[
  {
    "url": "https://www.9news.com.au/national/australia-music-festival-cancellations-exclusive-poll-insights/d413b6db-52cb-446e-9438-35a4be3b68e1",
    "title": "Music festivals keep getting canned. Nearly half of Aussies say this could fix it",
    "publish_date": "Fri, 05 Dec 2025 01:36:13 +0000",
    "category": "finance",
    "authors": [
      "Dec"
    ],
    "text": "Exclusive: Thousands of Australians have been directly affected by the slew of music festival cancellations over the last 12 months, including Park Waves festival this week.\n\nNow they're calling for more government investment in the scene, according to a nine.com.au reader poll.\n\nMore than 40 per cent of﻿ the ﻿434 readers surveyed agreed that federal and state governments should invest in Australia's live music industry to support festivals and prevent more cancellations in 2026.\n\n\"The government should support music the same way they support international sports such as tennis, golf and soccer,\" one told 9news.com.au.﻿\n\nA further 39 per cent of readers confessed to being at least 'somewhat concerned' about the future of Australian music festivals in light of recent events.\n\nPark Waves festival, scheduled for February 2026, was cancelled on Tuesday due to challenges including economic issues.\n\n\"Ultimately, the numbers no longer stack up,\" organisers said in a statement.\n\nChanging Tides 2025 was canned, and Groovin' The Moo cancelled its 2024 shows and didn't return in 2025.\n\nFalls Festival and Splendour in the Grass gave 2025 a miss as well.\n\nLong-running festival Splendour in the Grass did not return in 2025. (Mark Metcalfe/Stringer/Getty)\n\nMoney is the biggest issue for most Australian music festivals, according to two Creative Australia reports on the sector.\n\nRising operational costs, a lack of available funding and grants, and insurance costs have made it challenging for organisers to finance festivals.\n\nAustralians' ticket buying habits have also changed, creating uncertainty for organisers.\n\nFestival goers ages 18 to 24 are purchasing tickets at lower rates﻿ than pre-pandemic.\n\nPatterns of later ticket buying are also continuing, creating additional costs and risks some organisers simply can't keep up with.\n\nG﻿roovin' the Moo cancelled its 2024 shows and didn't return in 2025. (Instagram/Groovin the Moo)\n\nBut when organisers have to jack up ticket prices to cope with ﻿rising operational costs, it prices some Aussies out altogether.\n\n\"Music festival tickets are too expensive,\" one reader said.\n\nAnother added that it's not surprising that Aussies can't afford them when many struggle to afford groceries and rent.\n\nA combined 61 per cent of nine.com.au readers said they were ﻿'not very concerned' or 'not concerned at all' about festival cancellations.\n\nBut only 30 per cent were opposed to government investment in Australia's live music industry to support festivals.\n\nOne reader said events like festivals need to be self-sustainable, rather than relying on government support.\n\nAbout 28 per cent of readers were on the fence about government investment.\n\n\"I don't go to music festivals but some could bring more tourism to the country so perhaps the government should invest in some,\" one said.\n\nOthers were concerned about how it could affect taxpayers.﻿\n\n\"Festivals should be supported by the music labels to support our music industry, not be taxpayer-funded,\" said one.\n\nHave you got a story? Contact reporter Maddison Leach at mleach@nine.com.au",
    "source": "9News",
    "cluster_id": 0
  },
  {
    "url": "https://www.9news.com.au/national/private-health-people-paying-more-getting-less-ama-says/680984f6-3ec4-47dd-9c81-41093623322e",
    "title": "Aussies paying more for private health insurance and getting less",
    "publish_date": "Thu, 04 Dec 2025 22:59:09 +0000",
    "category": "finance",
    "authors": [
      "Dec"
    ],
    "text": "Australians are paying more for private health insurance and getting less for their money in return, a new report from the country's top doctors' advocacy group says.\n\nThe Australian Medical Association has released its latest Private Health Insurance Report Card, which found that consumers were abandoning gold-tier policies and questioning the value of other policies, while insurer profits piled up ever higher.\n\nThe AMA said the sector was in urgent need of reform, and President Dr Danielle McMullen renewed the call to establish an independent private health authority to drive that process.\n\nPeople are paying more for private health insurance and receiving less, a new report says. (Getty)\n\n\"Australia's health system is valued for its mix of public and private healthcare, but both parts of the system are under increasing pressure,\" McMullen said.\n\n\"Public hospitals are struggling with a severe logjam crisis, which is pushing more patients towards the private sector.\n\n\"However, runaway insurance premiums, low value offerings and shady tactics like product phoenixing leave customers facing tough choices about the level of cover they can afford.\"\n\nCost of living pressures are seeing people drop gold-tier policies. (Nine)\n\nAustralians are paying more for private health insurance and getting less for their money in return, a new report from the country's top doctors' advocacy group says. (Getty)\n\nThe report card showed that every year since 2008, the growth of private health insurance premiums has outstripped inflation, health sector inflation, average weekly earnings and the indexation of the Medicare Benefits Schedule (MBS).\n\nBetween 2008 and 2024, premiums climbed more than 100 per cent, while MBS indexation – which was frozen for several years from 2013 – increased by less than 20 per cent.\n\nThe report card also shows that over the six years to June 2025, insurers increased benefits paid for in-hospital medical treatment by only 18.1 per cent, while sector profits grew by nearly 50 per cent over the same period.\n\nREAD MORE: Manhunt for prisoner who escaped from police at hospital ﻿\n\nIn 2024-2025, insurers returned 84.2 per cent of premiums to consumers as benefits, below the 2019 level of 88 per cent.\n\nThe AMA is calling on the federal government to mandate a 90 per cent return minimum for insurers.\n\n\"Of course, private health insurers must make a surplus to be sustainable, but it is clear they are holding out on Australians while recording significant profits each year,\" McMullen said.\n\nThe AMA is calling for major reform. (Getty Images/iStockphoto)\n\n\"These insurers have ample capacity to increase the benefits paid to patients.\"\n\nThe report also found gold-tier policies are in decline as consumers face rising premiums and cost-of-living pressures.\n\nSince the start of the COVID-19 pandemic in March 2020, the number of gold-tier policies have dropped by 360,000, despite the overall number of policies growing.\n\n\"These trends show that private health insurance is becoming less affordable for many Australians – and we are already seeing the drastic effects of this, with at least 14 private maternity units closing over the past five years,\" McMullen said.\n\n\"The need for a Private Health System Authority to better regulate the sector and drive long-term reform has never been more crucial. There are too many bodies involved in the regulation of private health – a single, independent authority would provide a unified and coherent approach.\"",
    "source": "9News",
    "cluster_id": 1
  },
  {
    "url": "https://www.9news.com.au/world/thailand-eases-afternoon-alcohol-ban/f3f9fd75-b134-4a10-8267-290201c94eeb",
    "title": "Thailand eases alcohol ban to attract more tourists",
    "publish_date": "Thu, 04 Dec 2025 01:07:47 +0000",
    "category": "finance",
    "authors": [
      "Dec"
    ],
    "text": "Thailand has temporarily eased a ban on the sale of afternoon alcoholic drinks in a move aimed to attract more tourists.\n\nRestaurants, bottle shops and other authorised outlets can now sell beer, wine and spirits from 2pm to 5pm as part of a six-month trial, the BBC reports.\n\nOverseas tourists, including Australians, have often been confused by the afternoon prohibition of alcohol sales ﻿in Thailand, a top destination for partygoers.\n\nTourists in Thailand will find buying an afternoon alcoholic drink easier after authorities eased a decades-old ban. (AP Photo/Sa (AP)\n\nIt was started in 1972, partly to deter public servants from drinking during work hours.\n\nAlcohol sales in Thailand are now permitted from 11am to midnight during the next 180 days while an expert panel examines its impact.\n\nPreviously, breaking the ban carried the risk of a fine up to 10,000 baht﻿ ($437).\n\nThe change comes in the lead-up to the Christmas and the New Year holiday, both peak periods for tourists.﻿\n\nNew Thai Prime Minister Anutin Charnvirakul has pledged to kickstart the economy by reviving tourism following years of political unrest.\n\nLocal beer brands Chang and Singha are favourites among overseas visitors,﻿\n\nAbout 800,000 Australians visit Thailand every year, according to Tourism Research Australia.﻿",
    "source": "9News",
    "cluster_id": 2
  },
  {
    "url": "https://www.9news.com.au/world/social-media-influencers-medical-advice/2516140b-e49b-4ddc-ae7a-e5734a43bae5",
    "title": "Experts caution against taking medical advice from influencers",
    "publish_date": "Wed, 03 Dec 2025 23:54:09 +0000",
    "category": "finance",
    "authors": [
      "Dec"
    ],
    "text": "Experts have called for greater governance on potentially misleading medical advice shared by influencers on social media.\n\nWhilst over 40 per cent of young adults in the USA take advice from influencers, a report in The BMJ claims people are at risk of getting incorrect or biased information on important medical issues.\n\nFor example, Kim Kardashian encouraged her 360 million followers to have a full-body screening with magnetic resonance imaging.\n\nREAD MORE: ﻿ Scorching heatwave to smother major city as hot air mass moves across state\n\nKim Kardashian has previously promoted medical treaments with no proven benefits. (Getty)\n\nWhile scans can have a benefit for people at a high-risk of certain conditions it is also linked to overdiagnosis and unnecessary medical interventions.\n\nThe fourth overlapping biases, according to the authors, include \"limited expertise, industry influence, entrepreneurial interests, and personal belief.\n\n\"Such advice can cause psychological, physical, financial, and systemic harm,\" the report continued.\n\nThe report says influencers create a tight bond and relationship with their followers, with the sharing of real-life experiences helping foster a connection.\n\nThey can also help break stigmas surrounding certain medical conditions.\n\nLily Mae, also known as @chronicallylil on Instagram, documents her journey in navigating multiple medical conditions. (Instagram/@chronicallylil)\n\nHowever, the report argues more government oversight is required to ensure influencers do not mislead their followers or promote unethical practices.\n\nAustralia already has some laws and regulations in place, banning paid health testimonials.\n\nSome influencers believe medical experts should work more closely with them, believing they can bridge a key gap.\n\n\"I wish healthcare professionals would listen and engage more with patient communities online,\" Lily Mae, whose Instagram account @chronicallylil shows her struggles with Ehlers-Danlos syndrome, endometriosis, and vascular compression syndrome.\n\n\"There's such a wealth of firsthand knowledge being shared—real stories, symptoms, and lived experiences that could help improve care if more providers took the time to understand them.\"",
    "source": "9News",
    "cluster_id": 3
  },
  {
    "url": "https://www.abc.net.au/news/2025-12-05/ayers-rock-resort-being-sold-ilsc-to-us-company-journey-beyond/105867822",
    "title": "Ayers Rock Resort operation being sold to US company",
    "publish_date": "Fri, 05 Dec 2025 02:01:22 +0000",
    "category": "finance",
    "authors": [],
    "text": "The Ayers Rock Resort at Uluru is set to change hands, after the Indigenous Land and Sea Corporation (ILSC) came to an agreement with \"experiential tourism\" company Journey Beyond.\n\nJourney Beyond is owned by American private equity firm Crestview Partners and already operates several high-profile tourism assets, including the Ghan and Indian Pacific railways.\n\nThe deal sees Journey Beyond purchase the operational assets of ILSC subsidiary Voyages Indigenous Tourism Australia, which include the Ayers Rock Resort and the Mossman Gorge Cultural in Far North Queensland.\n\nLand and buildings at both locations will be transferred to traditional owners, Anangu Pitjantjatjara Yankunytjatjara of Yulara and the Kuku Yalanji of Mossman Gorge.\n\nValuation review questions Ayers Rock Resort buy An advisory group that delivered the highest valuation for central Australia's Ayers Rock Resort in 2010 was paid a fee based on the purchase price.\n\nThe move brings to an end a 15-year foray into large tourism ventures by the ILSC.\n\nIn 2010, the Indigenous Land Corporation board announced with great fanfare that it was buying the Ayers Rock Resort, near Uluru, for $300 million.\n\nThe deal with Journey Beyond is likely to be for less than $300 million and, while Voyages Indigenous Tourism was never supposed to be just about making a profit, the impending sale has some people asking questions, like was it worth it?\n\nWhat is the Indigenous Land and Sea Corporation?\n\nThe Indigenous Land Corporation (ILC), now known as the Indigenous Land and Sea Corporation (ILSC), was set up in 1995 in the wake of the historic Mabo High Court decision that recognised Torres Strait Islander and Aboriginal traditional title to land.\n\nOne of the ILC's functions is to manage the Land Account, which aims to help Indigenous people to acquire land and manage it in a sustainable way, to provide economic, social and cultural benefits for themselves and future generations.\n\nThe direction and responsibilities of the ILSC have evolved over the years and now include a wide range of Indigenous-led projects, agribusinesses, tourism enterprises and to help native title holders, if needed.\n\nThe ILSC board is the primary decision-making body and oversees governance, considers land acquisition and land management proposals and monitors performance.\n\nThe board consists of seven directors appointed by the federal minister for Indigenous Australians. Five of them, including the chairperson, must be Indigenous people.\n\nWhy did the board buy Ayers Rock Resort?\n\nIn 2007, the ILC decided to focus on education, training and employment.\n\nThis meant a considerable expansion to build businesses and create training opportunities.\n\nThe ILC announced it had acquired Ayers Rock Resort at Yulara near Uluru from property giant GPT for $300 million in October 2010.\n\nResort between Rock and hard place after shake-up The former board chairman of Voyages Indigenous Tourism Australia calls for federal government action on the Ayers Rock Resort in the Northern Territory.\n\n\"The resort represents a unique and probably the biggest opportunity to advance the training and employment of Indigenous people in the Australian tourism and hospitality industries,\" ILC chairperson Shirley McPherson said at the time.\n\nThe idea was to increase Indigenous employment at the resort from a handful to more than half the staff members and to establish a National Indigenous Tourism Training Academy, with 200 people in training each year from 2013.\n\nWas the purchase contentious?\n\nWhen she was appointed ILC chair in 2011, Dr Dawn Casey started digging into the purchase.\n\nAnd she was outraged by what she found.\n\nProperty giant GPT originally offered the resort to the ILC for $270 million in 2009, but the sale price was revised upwards by $30 million in 2010.\n\nIn a 2015 letter to then-prime minister Tony Abbott, Dr Casey alleged the former ILC board agreed to the increased price \"without any sound reasoning documented in the [then ILC board] minutes\".\n\nAllegations $30m missing in Uluru resort deal Taxpayers \"inexplicably\" paid an \"unjustified\" $30 million in a deal to buy Ayers Rock Resort in 2010, a letter to the prime minister alleges.\n\nThe letter states:\n\n\"[This was] despite strong concerns from certain directors and due diligence advisers indicating that the purchase price may not have been commensurate with the resort's value.\"\n\nBanks had refused to finance the full acquisition in 2009, and then-indigenous affairs minister Jenny Macklin declined to back the purchase and forbade access to the Land Account for it.\n\nWhen GPT increased the resort's sale price in 2010, the property giant proposed a new seller-financed model, also called vendor finance, where the seller loans the purchaser all or part of a loan that they would not otherwise be able to secure.\n\nThat meant the ILC was able to borrow $198 million to buy the resort, including land, buildings, infrastructure and the nearby airport at Yulara.\n\nIn 2016, then-Indigenous affairs minister Nigel Scullion authorised a $65 million federal government bailout for the ILC to help refinance the resort, blaming the global financial crisis.\n\nVoyages still has an external debt of more that $100 million.\n\nWhat is the resort worth?\n\nWhile Uluru has been a sacred and spiritual place for Aboriginal peoples for thousands of years, tourists have been flocking to the rock since the first graded road from Alice Springs was completed in the 1950s.\n\nBy 1968, visitor numbers had grown to more than 20,000 annually but facilities at the base of Uluru were unregulated, driving governments to develop the concept of a resort during the 1970s.\n\nThe original tourism site is now the Indigenous township of Mutitjulu.\n\nThe resort was opened in 1984 and celebrated its 40th anniversary last year.\n\nLoading Instagram content\n\nIt is the only place tourists can stay to visit Uluru and contains a range of accommodation options from campsites through to high-end rooms, restaurants, pools and an art gallery.\n\nBut by the time the ILC took possession of the resort in early 2011, it needed renovating and modernising.\n\nIn October 2013, the ILC announced it had written $62 million off the value of the resort.\n\nIt also said it was having trouble dealing with its annual interest repayments of about $10 million.\n\nIn January 2014, the resort was revalued again down to $202.5 million.\n\nAnd, like all tourism ventures, it was adversely affected by the pandemic from 2020.\n\nThe Ayers Rock Resort welcomes tens of thousands of domestic and international tourists each year. (Supplied)\n\nShadow Minister for Indigenous Australians Kerrynne Liddle, an Arrernte woman, worked for Voyages Tourism for a few years, to increase Indigenous employment outcomes and help the resort better engage with the local Mutitjulu community.\n\nShe said it was a worthwhile and valuable exercise that involved a lot of resetting relationships with the local community.\n\n\"My focus was also making sure that Aboriginal people weren't only employed at the lower levels of the business, that they could do anything,\" she said.\n\nSenator Liddle said, in her time at the resort, Indigenous people were able to access registered training, and were employed in all sorts of roles, from front of house to senior leadership.\n\n\"People came from all over Australia to work there and … it's pretty special when you walk into a hotel anywhere in Australia and see Indigenous people just doing their jobs … it is really wonderful to see,\" she said.\n\nAyers Rock Resort is the only place tourists can stay when visiting Uluru. (Supplied)\n\nBut, despite the positive outcomes in training and employment, Senator Liddle has questions.\n\n\"Unfortunately, it struggled to operate effectively from a profit perspective because of the extraordinary way in which it was financed,\" she said.\n\n\" We may effectively have a business that's operated for many years … and you have to ask the question was this such a great investment to begin with? \"\n\nLooking back, Dr Casey says there's \"no doubt\" that the training and employment programs were valuable and excellent.\n\n\"But it did hamstring us in terms of the funding that we had to pay out on loans,\" she said.\n\n\"We set it up so that we could see exactly how much it cost to operate, separated it out from the rest of the budget and, yeah, it was a major concern for during the period that we were there.\"\n\nWhat's for sale?\n\nVoyages' operational assets are being sold to Journey Beyond.\n\nThe land will be divested to the traditional owners at both Yulara and Mossman Gorge, with the ILSC saying there has been multi-year consultation and engagement with Anangu in Central Australia and the Kuku Yalanji in Far North Queensland.\n\nLater, following the transfer of land to community corporations, both communities will be paid rent from Journey Beyond's leasing of the sites under 90 and 10-year leases, respectively.\n\nThe sale has already been brought to the attention of the Foreign Investment Review Board.\n\nLand at Mossman Gorge will be handed back to Kuku Yalanji people. (Supplied: Tourism and Events Queensland)\n\nIn addition, in central Australia there are to be areas that will remain outside of a leasing arrangement and remain with community.\n\nOne of those areas will be used to develop a business hub, for Anangu (local people) and there is another area which is being set aside, outside of the lease, where Anangu can look to develop their own cultural tourism activities, not just rely on a partnership with Voyages to run experiences at the resort.\n\nIn a statement, Yulara Aboriginal Corporation said they were happy with the decision to hand back land that was originally excised from Uluru Kata Tjuta National Park and looking forward to working with Journey Beyond \"in the development of world class Indigenous tourism experiences that will share our language, our culture and our rich landscapes with visitors\".\n\nThe transaction is expected to be finalised in early 2026, along with the divestment of the Yulara land to Anangu.\n\nThe Mossman Gorge land divestment will follow once the native title application that embraces the cultural centre site is determined.",
    "source": "ABC",
    "cluster_id": 4
  },
  {
    "url": "https://www.abc.net.au/news/2025-12-05/canberra-bus-network-changes-fare-free-weekend-evenings-summer/106105054",
    "title": "'Go out for dinner': Free fares for summer amid Canberra construction chaos",
    "publish_date": "Fri, 05 Dec 2025 00:35:55 +0000",
    "category": "finance",
    "authors": [],
    "text": "The ACT government has announced changes to the public transport network as major construction continues on Commonwealth Avenue Bridge.\n\nFrom February, Canberra's bus timetable will be altered to allow for the project, which is being delivered by the National Capital Authority and is expected to take two years.\n\nThe changes include reduced frequency for some rapid bus services.\n\nACT Transport Minister Chris Steel also announced today that a free public transport initiative would run over the summer to support the night-time economy in Civic amid construction on light rail stage 2A.\n\nAnd from next week, it will be free to use bus and light rail services from 6pm on Fridays and Saturdays until the end of February.\n\nCommonwealth Avenue Bridge is an important link between Canberra's north and south. (ABC News: Joel Wilson)\n\nThat free travel coincides with the end of a year-long trial of fare-free Fridays in Canberra.\n\nThe government said it was not until February that the full impact of the bridge renewal project would be felt, when term 1 of school commenced.\n\nThe government urged Canberrans to travel outside peak times when possible.\n\nACT Transport Minister Chris Steel urged Canberrans to \"go out for dinner or a drink\" over summer. (Facebook: Chris Steel MLA)\n\n\"The updated bus network is based on traffic modelling which tells us that the southbound morning peak travel across Commonwealth Avenue will be most impacted by the construction works,\" a government statement said.\n\n\"Travel times are expected to increase by around 13 minutes southbound on Commonwealth Avenue. This reduces to around an additional seven minutes by the afternoon peak.\n\n\"The project will also have flow on impacts on major roads and the broader traffic network including Kings Avenue. The impacts are projected to be significant and we encourage the community to plan ahead before you travel whether by bus or by private vehicle.\"\n\nThe $137.5 million project includes strengthening the bridge, widening its shared pathways, installing new lighting, and replacing safety barriers.\n\nAt its peak, it means only one side of the bridge will be open at a time, seeing its six lanes shrink to three to accommodate traffic, pedestrians and cyclists travelling in both directions.\n\nChanges to bus network beginning February\n\nChanges to Canberra's bus network will begin on February 2, including the introduction of a dedicated bus and emergency services priority lane northbound across Commonwealth Avenue Bridge.\n\nThe rapid bus service standard weekday frequency will be 15 minutes across the network until 7:30pm.\n\nRapid bus services set to be reduced in frequency include services 2, 3, and 4, which operate in the Belconnen area.\n\nBut other rapid bus services will be changed in a bid to ease the reduction in those services.\n\nA new bus timetable will be released in January detailing the alterations. (ABC News: Callum Flinn)\n\nBuses to Marcus Clarke Street will also change.\n\nThe government said dedicated school services would remain the same as in the current bus network, \"with temporary adjustment including timing for 51 schools\".\n\nThe light rail line will be unaffected.\n\nTimetables will be released in January, the government said.\n\nTransport Canberra executive group manager Jeremy Smith said the changes were necessary to \"ensure that Transport Canberra resources are used in the most effective way possible\".\n\n\"While changes may mean adjusted travel times or altered routes for some passengers, bus services will be monitored, reviewed and refined to align with demand, impact and operational conditions,\" Mr Smith said.\n\nFare-free weekend evenings amid light rail construction\n\nOnly one side of Commonwealth Avenue Bridge will be open at a time at the peak of the works. (ABC News: Matt Roberts)\n\nTransport Minister Chris Steel said the modified public transport network was necessary as the work continued.\n\n\"I acknowledge that it is going to be incredibly disruptive for Canberrans while the federal government's bridge works are underway,\" Mr Steel said.\n\n\"We have worked hard to make sure we deliver a reliable bus network during the construction period, with capacity to move as many Canberrans as possible.\n\n\"I am committed to revising the bus timetable once the community has had some time to adjust to the new traffic environment and we understand what the actual impacts are on travel times.\"\n\nParts of London Circuit in Canberra have been closed for construction work of light rail stage 2A. (ABC News: Joel Wilson)\n\nMr Steel encouraged Canberrans to visit the CBD over summer, which is also experiencing disruptions as construction work as part of light rail stage 2A continues.\n\nBusinesses in the area say they have been negatively impacted due to road closures and reduced foot traffic.\n\n\"The new free night-time travel trial is intended to encourage Canberrans to get out and support our great food and entertainment businesses across the city,\" Mr Steel said.\n\n\"Go out for dinner or a drink over the summer and you can enjoy a free ride home on a bus or light rail.\"",
    "source": "ABC",
    "cluster_id": 5
  },
  {
    "url": "https://www.abc.net.au/news/2025-12-05/wa-gold-miners-building-up-massive-holdings-at-perth-mint/106078198",
    "title": "Reclusive millionaire builds massive gold stockpiles amid record prices",
    "publish_date": "Fri, 05 Dec 2025 00:19:22 +0000",
    "category": "finance",
    "authors": [],
    "text": "A prospector who amassed a fortune in Western Australia's mining industry after pegging ground covering some of Kalgoorlie's richest gold mines has no plans to sell large stockpiles of the metal being stored at the Perth Mint.\n\nAnton Billis, also known as Anthony, is a one-time bankrupt who remains a reclusive enigma in the resources sector.\n\nThe 81-year-old is managing director of ASX-listed gold miners Tribune Resources and Rand Mining, which own a combined 49 per cent stake in the rich East Kundana joint venture.\n\nThe Croatian-born prospector's combined shareholding in Tribune and Rand was this week worth about $141 million.\n\nSince 2005, the companies' combined share of production from Kalgoorlie mines such as Raleigh, Rubicon-Hornet and Pegasus has topped 1.33 million ounces — a big chunk of which has been stockpiled at the mint.\n\nPrecious metals worth billions of dollars are stored at the Perth Mint. (Supplied: Perth Mint)\n\nMagical run for gold price\n\nStock market filings show Tribune had gold on its books valued at $177.01 million at June 30, while Rand's holdings were worth $70.08 million.\n\nMr Billis said he had no plans to sell the gold holdings other than to meet financial commitments and provide sufficient working capital.\n\n\"We use that to pay cash calls and to pay for dividends, the rest of it stays in the Perth Mint,\" he said.\n\n\"Everyone thought I was a bit eccentric. I think that gold will continue to go up higher.\n\n\" Gold is a currency that won't rust, it will always appreciate. \"\n\nThe Perth Mint sells stamped products all over the world. (Supplied: Perth Mint)\n\nThe appreciation in value of Tribune and Rand's stockpiles reflects this year's magical run for the gold price.\n\nThe metal surpassed $5,000 an ounce for the first time in April, and then hit $6,000 an ounce in October.\n\nBillions deposited at Perth Mint\n\nAustralia produced 76 tonnes of gold in the September quarter, according to Melbourne-based gold consultancy Surbiton Associates, worth about $15.5 billion at current prices.\n\nWA miners produce most of the country's gold and typically sell to the government-owned Perth Mint at the daily spot price.\n\nThe 126-year-old mint refines bars into 99.9 per cent bullion and sells stamped products like bars and coins around the world.\n\nAccording to its annual report, the Perth Mint refined 225.4 tonnes of gold last financial year, while its depository held gold and other metals in secure vaults valued at $10.4 billion at June 30.\n\nWhile Mr Billis's companies stand out, fellow ASX-listed miners Black Cat Syndicate and Beacon Minerals have also recently adopted policies of retaining a portion of production in gold bullion storage.\n\nThe Australian dollar gold price has hit record highs this year. (Supplied: Brightstar Resources)\n\nNo superstition on gold\n\nBlack Cat Syndicate restarted the Paulsens gold mine in WA's Pilbara last year, and more recently acquired the Lakewood mill near Kalgoorlie for $85 million to process gold from its Kal East project.\n\nAs of September 30, Black Cat had 5,104 ounces in storage, worth about $29.6 million.\n\nThe company estimates its gold has appreciated somewhere between $3 million and $4 million since adopting its strategy.\n\nBlack Cat managing director Gareth Solly (centre) with board members Les Davis and Davide Bosio at their Lakewood plant's first gold pour in April. (Supplied: ASX/Black Cat Syndicate)\n\n\"It is hard to justify producing a safe-haven asset in gold and then converting that into an asset losing its purchasing power in cash,\" managing director Gareth Solly told Black Cat's annual shareholder meeting on November 27.\n\n\"At the end of the day, we are in the gold business.\"\n\nGold bars from the Paulsens mine in the Pilbara. (Supplied: ASX/Black Cat Syndicate)\n\nBlack Cat chairman Paul Chapman also spoke at the AGM, pointing to a recent report by the World Gold Council which expects 95 per cent of central banks to increase their gold reserves over the next 12 months.\n\n\"Gold is no longer seen as an artefact, but a currency,\" he said.\n\nMetal's 'strategic value'\n\nCoolgardie gold miner Beacon Minerals held 4,615 ounces of gold at the Perth Mint at September 30 and reported another 1,393 ounces was in transit, with the combined value worth about $36.27 million.\n\nBeacon's managing director, Graham McGarry, said the gold price reaching a record $6,448 an ounce on October 14 highlighted the strength of the market and the \"strategic value\" of retained gold holdings.\n\nBeacon Minerals boss Graham McGarry at the company's Jaurdi gold project near Coolgardie. (ABC Goldfields: Jarrod Lucas)\n\n\"Our decision to hold gold in excess of that required to meet operational and capital commitments has delivered a tangible uplift to shareholder value,\" Mr McGarry said in Beacon's quarterly report.\n\n\"The board regularly reviews the company's policy of holding gold at the Perth Mint, and we currently see no reason to alter this strategy.\"",
    "source": "ABC",
    "cluster_id": 6
  },
  {
    "url": "https://www.abc.net.au/news/2025-12-05/world-cup-socceroos-and-argentina-possible-draw-and-rematch/106104608",
    "title": "Behich, Socceroos eyeing rematch against World Cup giants",
    "publish_date": "Thu, 04 Dec 2025 23:48:16 +0000",
    "category": "sports",
    "authors": [],
    "text": "Eagerly anticipating the World Cup draw, Aziz Behich can't help but dream of settling some unfinished business with Argentina.\n\nIn Qatar in 2022, Behich and Garang Kuol were denied late chances to equalise against eventual champions Argentina as the Socceroos' golden run ended in the round of 16.\n\nIn the draw for next year's global showpiece, to be held on Saturday at 4am (AEDT), Argentina will be in Pot 1 with the Socceroos in Pot 2, making for a one-in-12 shot at a group stage reunion.\n\n\"Look, that would be great if we get another shot at them,\" Behich told AAP.\n\n\"That's football — the game can turn so quick. And we had two opportunities to make that game something special.\n\n\"But that whole campaign was just special in general, the way we got out of the group there, and I'd love to be a part of something like that again.\n\nArgentina beat Australia’s Socceroos 2-0 The irrepressible Lionel Messi again brings the Socceroos' undone, scoring the fastest goal of his international career as Argentina claims a friendly victory in Beijing.\n\n\"And why not take it one more step forward in a World Cup?\"\n\nLanding in Pot 2 should help Australia avoid any \"group of death'' scenarios — but Behich doesn't care.\n\n\"I've really never believed in a group of death or anything like that because if a team's at the World Cup, they're there for a reason,\" he said.\n\n\"That means they're the best in their area and they qualified. Come the World Cup, they're one-off games, so for me, any game's a tough game.\n\n\"Anything's possible when it comes to football and it's proven week in, week out, not just at international level.\n\n\"We showed that in the last World Cup. No one gave us a chance in Qatar and we went out swinging against the champions of that World Cup — and we could have snagged something there in that game as well.\n\n\"So whatever group comes, it's a challenge — but if there's one thing that us Aussies pride ourselves on, it's performing with our backs against the wall against the best.\n\n\"So it's more of just excitement and a 'bring it on' type mentality.\"\n\nBehich hopes an expanded 48-team tournament minimises the chance of a third consecutive World Cup group involving France and Denmark.\n\n\"It'd be nice, obviously, to get a different draw because the last two World Cups had a few of the same teams,\" he said.\n\nLionel Messi hoists the trophy after Argentina's win over France in the 2022 World Cup final. (Getty Images: Tom Jenkins)\n\nThere will clearly be far more travel than the 2022 Doha tournament, with games sprawled across Canada, the United States and Mexico — a challenge Behich welcomes.\n\nMelbourne City skipper Behich, who missed the Socceroos' last window with a hamstring injury, is determined to reach a third World Cup, and compete with Jordy Bos for the starting left-back role.\n\n\"When it comes to the national team, there's always competition and it's healthy for the team,\" he said.\n\n\"So it's one thing I don't shy away from. I just believe in my own ability, what I'm capable of.\"\n\nBehich won't watch the draw live, given it's game day for Melbourne City in Newcastle, but will catch up with it when he wakes up.\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\n\"I'll be straight on the TV to have a look at the draw, and it'll be exciting to see who our opponents will be for the first phase,\" he said.\n\n\"When the draw comes out, then the countdown begins.\n\n\"If you put all sports together, the World Cup is the pinnacle of everything.\n\n\"It's the biggest event in the world — pretty much the whole world's watching when it comes around.\n\n\"So hopefully I'm in good stead come selection time and I can go around one more time.\"\n\nAAP",
    "source": "ABC",
    "cluster_id": 7
  },
  {
    "url": "https://www.abc.net.au/news/2025-12-05/red-tipped-ecoganic-bananas-go-viral-on-social-media/106102526",
    "title": "Australia's red-tipped bananas go viral after cheeky social media post",
    "publish_date": "Thu, 04 Dec 2025 23:17:18 +0000",
    "category": "finance",
    "authors": [],
    "text": "Red-tipped bananas are not new to Australian consumers, but have gone viral on social media this month after an inquisitive post from two bewildered British backpackers.\n\nThe video from travellers Mel Chekaoui and Phil Colia has been seen more than 11 million times on Instagram, with eager consumers commenting that they too were hungry to learn the reason for the red wax tip.\n\nLoading Instagram content\n\n\"My Dad told me it meant they were strawberry flavoured and I believed him until I was 16 years old. Nice to finally learn the real reason in the comments\"\n\n\"Legit my favourite bananas, and I don't even know why\"\n\n\"Baby-bel bananas\"\n\n\"Christian Louboutin version of bananas\"\n\nPioneered by Innisfail farmers Dianne and Frank Sciaccia in Far North Queensland, the red wax tip indicates bananas that have been grown using their Ecoganic farming method.\n\n\"Stores actually have a sign that says 'uniquely Ecoganic', but I mean [social media] is just the way the young ones communicate today,\" Ms Sciaccia said.\n\n\"[When I saw the video] I just laughed.\"\n\nMs Sciaccia said the accredited farming system used natural ecosystems to grow the crop and promote soil health, minimising other inputs such as chemical fertilisers and insecticides.\n\nIt is different to organic farming because not all products used are free of inputs.\n\nThe bananas are grown to a recognised standard in order to be accredited. (ABC Rural: Sophie Johnson)\n\nWhile the red tips are more widely known to appear on bananas, producers of other crops have also started to adopt the farming method.\n\n\"We've had a lot of interest from different industries, so we've been working with avocadoes, apples and pears in Victoria, and almond growers in South Australia for the past couple of years,\" Ms Sciaccia said.\n\n\"We're just putting some focus back into papaya, which we did start a few years ago, but due to crop loss, we sort of put that on hold at the time.\"\n\nPawpaw potential\n\nThere are eight certified growers nationally, including William Darveniza.\n\nHis farm is up the road from the Sciaccia's, about 260 kilometres north of Townsville, and his range of crops includes the red-tipped bananas.\n\nThis is his first year formally producing the fruit, after he realised he had already been using the farming method.\n\nWilliam Darveniza farms multiple crops near Innisfail in Far North Queensland. (ABC Rural: Sophie Johnson)\n\nHe hopes to add the red tip to other fruits on the farm, including paw paws.\n\n\"A lot of those mycorrhizal fungi and the bacteria that they evolved alongside in the rainforest are sort of taken out of the equation in the conventional farming system that we have,\" said Mr Darveniza.\n\n\"I'd like to sort of try and reintroduce that a little bit and help protect the crop from these weather situations and these insect pressures using that system.\"\n\nHe hoped a wider range of red-tipped fruit would be on supermarket shelves by mid-next year.\n\n\"There has already been a fair bit of interest in the product, so we're looking forward to moving forward with it,\" he said.\n\nMr Darveniza is going to grow red-tipped pawpaws next year. (ABC Rural: Sophie Johnson)\n\nRed-tipped exports\n\nAcross all growers, about 80 tonnes of red-tipped bananas are produced a week, and they are not only turning heads in Australia.\n\nMs Sciaccia said international interest had grown since they first sent trial volumes of bananas with the waxy, red tips to Japan about two years ago.\n\n\"We've been working with one of the major supermarkets over there and putting together a business plan with them,\" she said.\n\n\"They've done all of their testing on the product, and the texture, taste, what they call sensory attributes, sit above any other product that they import from around the world.\"\n\nShe was hopeful of sending commercial volumes to Japan in the future.\n\n\"I don't see the export as being a major part of our business, but it certainly has the potential to be as equal to our domestic market quite easily,\" Ms Sciaccia said.",
    "source": "ABC",
    "cluster_id": 8
  },
  {
    "url": "https://www.abc.net.au/news/2025-12-05/ed-craven-vip-gamblers-club-stake-messages/106028000",
    "title": "Leaked texts from inside Australian billionaire's VIP gamblers club",
    "publish_date": "Thu, 04 Dec 2025 23:09:41 +0000",
    "category": "finance",
    "authors": [],
    "text": "Messages between Australian multi-billionaire Ed Craven and a former associate reveal the inner workings of his online casino empire.\n\nAll it took was a splashy gambling spree for Chris to announce himself as a new high roller at Stake.\n\nOver a few whirlwind months of gambling, the Swedish millionaire lost more than $US150,000 at the online casino.\n\nIn doing so, he gained something more valuable: a direct line to Stake's CEO and co-founder, Ed Craven.\n\nEddie: Sup Chris\n\nEddie: You were one of the top players on Stake in August\n\nEddie: Special bonus here - https://stake.com/?bonus=EddieTopAugustVIPs 🙂\n\nEddie: Hope you have a nice September dude\n\nStake was on the rise, soon to be a global gambling juggernaut, but its CEO still found the time to roll out the VIP treatment for its top clients.\n\nA few months in, Chris offered up a tantalising clue about how profitable he could be for the casino.\n\nChris: i'm down like €2.3m on bitcasino\n\nEddie: Really, wow lol\n\nThe full transcript of their conversations between 2020 and 2024 — obtained exclusively by the ABC — shows Chris taking on many roles at Stake: client, collaborator, informant, and rule-breaker.\n\nIn the process, it offers a look inside how one of Australia's richest people built his gambling empire, and how he ignored numerous red flags suggesting his associate had a serious gambling problem.\n\nIn 2025, Chris commenced legal proceedings seeking to reclaim $US1.5 million of losses at Stake, using his conversations with the Stake CEO in support of a claim that the company had exploited his addiction.\n\nEd Craven declined to comment; Stake's head of PR, Audrey Fitzgerald, said the company would not comment on active litigation.\n\nOn the surface, much of the chat between the pair is light-hearted. Craven jokes about \"sketchy\" casinos, and games \"designed to f*** player[s]\". He advises Chris on his role as a promoter for the casino, shares screenshots of jackpots and resolves the occasional technical issue.\n\nChris: always good to be able to contact so fast not many have that :)\n\nEddie: No problem man, least can do\n\nBut underneath it all, colouring almost every interaction, were signs that his VIP client had a gambling problem.\n\nChris tells Craven about going \"overboard on the live blackjack\", suffering \"bad losses\", and makes quips about \"losing track of money\" when he's faced with the raw numbers. They also openly discuss several of Chris's attempts to have himself barred from gambling on Stake.\n\nThe messages also show Craven advising Chris not to circumvent a self-imposed ban in 2022. \"I think it's kinda dumb too,\" wrote the Stake CEO, \"but at the same time there's a lot of people it helps.\"\n\nChris did it anyway. And still, he says, Craven acted \"as if nothing had changed\". Chris continued to gamble at Stake — and chat with Craven about it — for another two years.\n\nChris's parents had no idea their 17-year-old son was a teenage millionaire in 2020, much less that he was at risk of gambling his fortune away.\n\nFrom a young age, the Swedish teenager had discovered a knack for trading video game items online.\n\nHe converted his winnings into cryptocurrencies such as Bitcoin and Ethereum, back when they were worth relatively little. By 2020, these coins had multiplied in value and Chris's crypto fortune had swelled into the millions.\n\nChris kept his online exploits to himself. His parents only caught rare glimpses of his new-found wealth, like when they helped him cash out a tiny portion of it to buy a new computer.\n\nAs he grew up, Chris found himself unable to resist playing the virtual slot machines at several online casinos. The teenager burned through massive amounts of crypto in a matter of months, much of it on a site called Bitcasino — one of the first online casinos to accept cryptocurrencies.\n\nOnline, Chris was more open about his gambling habit. He would post screenshots of the occasional jackpot on Twitter, interspersed with despairing comments about how much he was losing.\n\nBut this schtick was about more than just venting. By posting about special offers at Bitcasino, accessible through his personal referral code, Chris found another way to fund his gambling.\n\nAnyone who used that code to sign up would be doing Chris a big favour.\n\nWhenever these people — called his \"affiliates\" — spent money on Bitcasino, Chris would get a cut for referring them. It was a kind of gambling pyramid scheme, where influencers profited off the misfortune of their fans.\n\nThis Faustian bargain offered by online casinos had spawned an entire universe of gambling influencers, each jostling for a share in the bonanza of affiliate revenue.\n\nThis meant that, as Chris was growing his list of affiliates, he was simultaneously being courted by others trying to do the same. And it wasn't long before Stake, a relative newcomer to the online \"crypto casino\" space, started cannibalising the player bases of its more storied competitors.\n\nMidway through 2020, with the pandemic trapping millions of gamblers in their homes, Craven saw an opportunity to reach a larger audience.\n\nThat was when he hired Akhil Sarin as Stake's first official marketer, a job that came with one massive hitch.\n\nAs Stake was licensed in Curaçao — a tax haven in the Caribbean with minimal oversight for casinos — it was banned in many popular gambling markets, including in Australia, the US and much of Europe. This meant that it couldn't be advertised through traditional means.\n\nBut Sarin soon had an idea he wanted to try out: partnering with people who would live-stream themselves as they gambled on their site. Craven wasn't initially sold on the idea, according to Sarin, but he allowed his new lieutenant to spend a month trying it out.\n\nAkil Sarin (grey suit, white shirt) was hired by Ed Craven (light blue jeans) in 2020. ( )\n\nBefore long, tens of thousands of people were tuning in to watch their favourite streamers play Stake's virtual slot machines, clicking a button over and over again. A community of young gamblers materialised on Twitch, the world's most popular live streaming platform.\n\nThe Stake team were blown away by the success of their new marketing strategy. \"I think the pivotal moment was the [rate of] conversion of viewers,\" Sarin later told an industry podcast. \"Live-streaming is the absolute best way to market any product.\"\n\nStake used a similar incentive for its streamers as Chris had been offered by Bitcasino — they were entitled to a cut of each bet made by anyone they referred to the site, continuing into perpetuity.\n\nOver time, Stake struck deals with online celebrities such as xQc and Trainwreck, both of whom signed contracts — reportedly worth more than $US1 million per month — that required them to gamble live for their fans.\n\nDo you know more? Contact Julian Fell at tips@jtfell.com if you have any information about crypto casinos in Australia.\n\nChris switched over to Stake after being lured in with a sweetheart deal of his own. \"They gave me a VIP deal there,\" Chris recalls, \"because I was playing with a lot of money.\"\n\nThat meant the 17-year-old had a direct line to \"Eddie\" — the big boss, Ed Craven.\n\nTheir earliest interactions were playful. The two of them would banter about Chris's losses and discuss Stake's competitors.\n\nAt one point, Craven suggested that Chris's betting limit, already at an astronomical $US25,000 per hand of blackjack, could be raised even higher.\n\nChris: lost 110 [bitcoin] in like 2 hours becuase [Bitcasino] had stupid amounts as limits\n\nEddie: Damn\n\nEddie: On Blackjack?\n\nChris: yep, and baccarat\n\nChris: i did private baccarat and private [blackjack] tables\n\nEddie: Haha damn\n\nEddie: If you ever need Stake's limits increased let me know\n\nEddie: We can get up to $100k/hand\n\nEddie: But yeh I guess it's dangerous having that available 24/7 I can set it for like 1 hour or 2 hours for you if you like\n\nChris: 100k? haha might need it someday:)\n\nEddie: Easy, just one message away\n\nDuring a discussion of Chris's \"cash back\" entitlements — a promotion where a portion of his gambling losses were periodically returned to him — Chris said he was thinking of sticking to slot games for the next little while.\n\nChris: wanted to try to stick to slots for a lil bit and see how it goes\n\nEddie: Hahaha, I recall that never working out too well for you 😂\n\nChris: Yup im the worst one when it comes to slots hehe\n\nEddie: Hahah, yeh live games more fun tbh\n\nEddie: Slots also real hard to profit\n\nEddie: Designed to f*** player\n\nChris: true gonna try another [deposit] tomorrow and see how it goes:)\n\nEddie: Hopefully a decent streak :)\n\nThe signs that Chris had a problem were never far from the surface.\n\nChris asked if it was \"possible to disable evolution [games] specifically or is it still not possible? [Makes] me go crazy with the bad luck there\". He complained about \"bad losses\" on the slots and blackjack, and often voiced frustration about his inability to stick to sports betting.\n\nStake's own website acknowledges the devastating impact problem gambling can have. \"Although problem gambling often results in financial problems,\" it says, \"the impact of problem gambling usually stretches much further than this.\"\n\nIn between these dire interactions, Craven continued giving Chris inducements, including a percentage of cash back on his losses, and helped him to claim the income he was owed through referring other players.\n\nChris: Hey could you check for some cashback had a nother loss. maybe some extra available on top? :D\n\nChris: bit of a bad luck streak again\n\nEddie: Hey man I got you 😄\n\nEddie: All set in vault\n\nIn late 2021, Chris got his account permanently banned via a process called self-exclusion. This is a tool offered to players who have identified that they have a gambling problem, so they can avoid relapsing.\n\nHe told Craven it was an accident and later asked to have his VIP perks transferred over to a new account so he could keep gambling on Stake. \"Umm not the best idea to try get around the exclusion man,\" replied Craven.\n\nA few weeks later, Chris asked to apply some perks to an account of a \"buddy\". \"All set 🙂,\" Stake's co-founder replied.\n\nThe charade about it being a friend's account was quickly dropped, and their interactions fell back into their usual rhythm — Chris repeatedly asking to have a percentage of his losses refunded, Craven offering words of encouragement and incentives to keep playing.\n\nChris's earlier, supposedly permanent, self-exclusion was seemingly lost to time.\n\nIn all, he created seven different accounts across on Stake. \"Whenever I made a new account, I would just message,\" he says. \"I would just give [Craven] the name and say, 'This is my new account.'\"\n\nChris's gambling only represented a tiny slice of the money being poured into Craven's burgeoning online empire.\n\nStake's popularity was, by 2021, starting to expand at an exponential rate.\n\nThe pandemic had hit, meaning countless people in high income countries all around the world were stuck inside without work, many with cash from income-protection schemes like Australia's JobKeeper program.\n\nThis explosion of potential players came just as Stake's marketing tactics, boosted by Sarin's innovations, were coming into their own. The company expanded its reach further, sponsoring an English Premier League football club and the Ultimate Fighting Championship.\n\nAmong the masses of players flocking to the site was a name with serious star power. One day in 2021, Craven received a message from a Stake customer, who, as it turned out, was hanging out with Drake.\n\nBefore he knew it, Craven was on a video call with the Canadian pop star, who was standing on a basketball court inside his home.\n\nDrake said he loved playing on the site. Craven said later that he'd thought he was being scammed. It was too absurd to be real. But once it became clear that it really was Drake, Craven sensed an opportunity.\n\nDrake was announced as Stake's \"brand ambassador\" that same year.\n\nStake founders Ed Craven (left) and Bijan Tehrani (right) with the casino's ambassador and pop star Drake. ( )\n\nThe pop star appeared in viral marketing stunts and live-streamed himself making multi-million-dollar bets, projecting all the glamour of the high-rolling lifestyle onto a barely regulated casino.\n\nAs Chris struggled to control his gambling on Stake, he too was tapping into the rivers of money flowing in and out of the casino. He joined the casino's army of live-streaming influencers in late 2020.\n\nHe was never employed by Stake, and had no guaranteed income, however Craven offered financial support for Chris' efforts to entice others to play on Stake.\n\nEddie: Sup\n\nEddie: Hooked you up couple k in Bitcoin\n\nEddie: Hope you can get a decent run 🙂 Nice win on Monopoly on Twitter\n\nChris: Ty haha yeah a quite good win\n\nEd Craven shares a screenshot of a win he had on Stake. ( )\n\nEddie: I got this one yesterday\n\nEddie: 1000x haha\n\nEddie: Super addictive\n\nChris: What the i never hit those lmao\n\nChris: Most I think is like 100x\n\nChris: Gonna upload that sometime\n\nEddie: Ha nice, you still making vids? Nice\n\nMake aure you attach ref links on all ya vids. Those things can pay for rest of ya life lol\n\nWhen he live-streamed his gambling sessions, Chris says he would bet far more recklessly than usual.\n\nHe felt the pressure to put on a show and entertain those watching him. \"I would lose [everything],\" Chris says, \"like within the first five to seven minutes.\"\n\nSean, who lives in Florida, used to watch Chris gamble live on Stake. \"It was just an insane amount of money,\" he says. \"[He would] be doing like six-figure blackjack hands.\"\n\nSean says he could see Chris had a gambling problem within a month of meeting him. \"One time he lost 800 grand in what must have been a few minutes,\" he recalls. \"And then after he lost it, he just instantly left the call.\"\n\nCraven seemed aware of this tendency in Chris, even counselling him to bet in smaller increments so he could keep playing — and therefore promoting the casino — for longer.\n\nEddie: Just like 10 Euro max spins preferably bro\n\nEddie: And you be live stream whole time\n\nEddie: Idea is to make some long streaming content haha\n\nChris regularly sent Craven long lists of players to add to his affiliate list; not all of them would keep playing once their welcome bonus was gone, but those who did were putting money straight into Chris's pocket.\n\nChris's affiliate list grew quickly, he recalls, reaching about 300 players at its peak.\n\nHis cut of each deposit made by his affiliates was relatively small, but in aggregate it worked out to a serious income.\n\nOther streamers found themselves with similar problems to Chris.\n\nA Stake-affiliated influencer named Austin Michael Taylor, who called himself DNP3, caused a public scandal when he committed fraud to fund his gambling habit.\n\nAfter running out of his own money to gamble with, Taylor took investor funds from a cryptocurrency project that he had launched in 2021, and used them to chase his losses. His sponsorship with Stake, he later wrote on social media, \"unleashed an addiction [he] never knew [he] had.\"\n\nOther similar scandals, involving a variety of online casinos, led to a crisis moment for Stake's promotional strategy.\n\nTwitch — the world's most popular live-streaming platform, where most of Stake's promoters hung out — banned any content featuring what it called \"unsafe\" gambling sites.\n\nThe ban included Stake.\n\nMonths later, a new live-streaming platform called Kick emerged, with far more liberal policies.\n\nIt's CEO and part-owner: Ed Craven.\n\nSeveral prominent gambling streamers quickly signed contracts with the new site, including Canadian streamer Felix Lengyel, known online as xQc, and American internet celebrity Adin Ross.\n\nFelix Lengyel (centre) meets Donald Trump on a Kick live-stream. ( )\n\nLengyel's $US100-million contract with Kick included a clause requiring him to gamble on Stake while streaming, the streamer once said. Other streamers have made similar comments.\n\nStill, Lengyel's relationship with gambling appears to be a complicated one. \"I'm ill,\" he once said, referring to his addiction to gambling, \"but you know what, I can afford to be ill.\"\n\nBy April 2023, Craven handed Chris off to another of Stake's VIP hosts.\n\nThe Stake CEO was a busy man. He was, by now, a certified billionaire, the owner of Australia's most expensive property, and the CEO of a major live-streaming platform.\n\nEddie: Hey bro\n\nEddie: If you reach out to @TejmanVIP he'll be able to renew the reload + send cashback etc & set all bonuses going forward. I've let him know to expect a message from you — He'll also have a nice extra bonus for when you reach out\n\nEddie: I'll still be here if you need anything unrelated to bonuses though, I'm not going anywhere :)\n\nChris: Yee I understand seen ur f1 stuff on Twitter some sick stuff\n\nEddie: hahah, yeh juggling a few things at once\n\nChris only reached out sporadically after that. When he did, Craven reminded him that he had a VIP host for these requests.\n\nTheir last exchange, in November 2024, followed the same pattern. Chris said he had lost $US700,000 on blackjack, and wanted a quarter of it back. \"I went insane,\" he wrote to Craven.\n\nCraven connected him with an on-duty VIP host, who would \"be able to sort everything out\".\n\nAnd that's where they left things, until Chris filed a legal claim — via a lawyer — for $US1.5 million in lost winnings.\n\nIn the meantime, Chris had reached out to the Foundation for the Representation of Victims of Online Gaming, which assists players with claims against online casinos.\n\nRoelof Bijkerk, an affiliate of the foundation based on the Dutch-Caribbean island of Curaçao, took on Chris's case against Stake.\n\nTogether, they prepared a demand letter — featuring the messaging history between Chris and Craven as its centrepiece — that claimed the casino \"made gross misuse\" of Chris's gambling addiction.\n\nIn response Stake argued that Chris was a \"professional gambler\" who was merely playing the \"gambling addiction card\" to recover his losses.\n\nIt said the company continuously monitors player patterns that might indicate gambling addiction and \"there was no specific pattern in the timing of [Chris's] deposits that would indicate such a problem\".\n\nThe casino also claims Chris actually made a profit while gambling there. He did hit the jackpot at times — he withdrew $US2.2 million from one account in November 2023 — though he is missing the gambling data from two of his Stake accounts, so the ABC could not determine his overall position.\n\nIf his claim were to be awarded, Stake's lawyers say, \"it would go against the principle of fair play.\"\n\nThe only grounds for returning a player's losses, they argue, would be if its games had been rigged against them. \"In gambling, the fundamental rule is: if you lose, you lose; if you win, you win.\"\n\nIn effect, they were saying that the casino's arsenal of psychological tactics — hosting games designed to \"f*** player[s]\" and undermining players' attempts to quit with bonuses and cool-off periods — were all fair game.\n\nThe case is ongoing.\n\nAs for his own complicity as a cog in Stake's promotional machine, Chris says he didn't think about it all that much at the time.\n\nAnd now? \"Yeah, a little bit,\" he says, and changes the subject.\n\nSometimes it's easier to look the other way.\n\nCredits",
    "source": "ABC",
    "cluster_id": 9
  },
  {
    "url": "https://www.abc.net.au/news/2025-12-05/ashes-2025-zak-crawley-on-nathan-lyon-being-dropped/106104822",
    "title": "Lyon 'absolutely filthy' as English star says shock dropping helped his rhythm",
    "publish_date": "Thu, 04 Dec 2025 22:35:10 +0000",
    "category": "sports",
    "authors": [],
    "text": "Australia's controversial decision to drop Nathan Lyon is threatening to backfire as England's Zak Crawley has admitted he found it easier to find his rhythm facing an all-pace attack.\n\nLyon told Channel 7 he was \"absolutely filthy\" to have been axed for the second Ashes Test after also missing the last day-night Test on the tour of the West Indies in July.\n\nIt is just the second time since his 2011 debut that Lyon has missed a home Test, with the veteran spinner replaced by right-arm paceman Michael Neser.\n\nBut there were times Australia could have used Lyon on a seesawing first day of the pink-ball Test that ended with England going to stumps at 9-325 at the Gabba.\n\nAustralia are eight overs behind in their over rate, which could cost WTC points, after not playing spin at any point on Thursday.\n\nThere were times when Australia struggled for the breakthrough wickets that fell in clusters during their big win of the series opener.\n\nWith the condition of the ball apparently deteriorating, Jofra Archer and Joe Root toyed with the pacemen on a 61-run stand for the final wicket.\n\nThey will have the chance to continue batting in valuable daylight hours after the pacemen could not break the partnership under lights before stumps on Thursday.\n\nEarlier, Zak Crawley (76) stretched out to his second-biggest score in Australia, before Root (135no) broke through for a first century in 30 innings Down Under.\n\nCrawley admitted the tourists, under pressure for their poor batting in Perth, had been shocked not to have seen Lyon's name on the team sheet at the toss.\n\n\"I can't remember the last time other than in the West Indies recently that they haven't played him, so we were surprised,\" he said.\n\nOther than big left-armer Starc, all of Australia's bowlers on Thursday were right-arm medium-pacers.\n\nNeser, Cameron Green, Scott Boland and Brendan Doggett gave up 249 runs for only two wickets between them as Starc (6-71) inflicted the bulk of the damage.\n\nCrawley conceded that the lack of variety made his job easier.\n\n\"I suppose there was some rhythm I could get in with the four seamers playing. It definitely got easier as the game wore on,\" he said.\n\n\"I don't know if that was the ball or picking up the rhythm of the pitch. After about 10 or 15 overs, it seemed to do a lot less.\"\n\nStarc was not worried by the homogeneous pace of the attack.\n\n\"I'm not sure speed's the be-all and end-all. That's the makeup we've gone with this week,\" Starc said.\n\nThe left-armer said he did not feel extra pressure without Lyon, as the clearest source of variety in the attack.\n\n\"I didn't feel anything different, much like last week, just trying to play that role,\" Starc said.\n\nStarc felt for Lyon, who learned of his omission only an hour before the toss on Thursday.\n\n\"It's a tough one for Nath. Everyone wants to play every game and I'm sure he'll be disappointed not to be playing this week,\" Starc said.\n\n\"The selectors certainly looked at the conditions and made the choice of that attack for these conditions. It's not a reflection of Nathan and his skills.\"\n\nThe ABC of SPORT Sports content to make you think... or allow you not to. A newsletter delivered each Saturday.\n\nAAP",
    "source": "ABC",
    "cluster_id": 10
  },
  {
    "url": "https://www.abc.net.au/news/2025-12-05/housing-crisis-has-impact-on-caravan-parks/106051650",
    "title": "Housing crisis turns caravan park owners into 'landlords' of last resort",
    "publish_date": "Thu, 04 Dec 2025 22:31:06 +0000",
    "category": "finance",
    "authors": [],
    "text": "Caravan park owners say they are copping the brunt of the housing crisis, as those on the brink of homelessness turn to these facilities as a last resort.\n\nOwners have spoken to the ABC about the emotional toll of turning desperate people away and dealing with anti-social behaviour from some long-term residents.\n\nGreg Homer has run the Waterloo Village Caravan Park on the outskirts of Bunbury, 160km south of Perth, with his family since 2011.\n\nGreg Homer says turning away desperate people every day is taking a toll on him and his staff. (ABC South West: Madigan Landry)\n\nMr Homer said, while he found running the park fulfilling, the demand for accommodation he faced on a daily basis was overwhelming.\n\n\"Our phone does not stop ringing every single day,\" he said.\n\n\"We've had people in tears at our front counter, people who come back multiple times a day.\"\n\nParks of last resort\n\nMr Homer's experience is indicative of the seismic shift in caravan park culture, brought on by an acute shortage of homes.\n\nHe said he was increasingly turning away locals pleading for any kind of accommodation.\n\nGreg Homer wishes he had more room to help people find a place to live. (ABC South West: Madigan Landry)\n\n\"They'll be a family with a couple of small kids and asking if they just set up a tent anywhere on our property just to live, just to have something, so they are not sleeping in a car, so they can actually accommodate their kids,\" Mr Homer said.\n\n\"It's very, very tough to face that.\"\n\nMr Homer said he understood why caravan parks were such a popular choice for people struggling financially.\n\n\"We tend to be the most affordable of all styles of accommodation … so we've seen more and more people who are interested,\" he said.\n\n\"I don't think I've had a vacancy at the caravan park now for probably four to five months.\"\n\nGreg Homer says the number of people being turned away is sometimes emotionally overwhelming. (ABC South West: Madigan Landry)\n\nKylie Holt has been living in a converted 1967 Leyland Leopard school bus for five years with her young family on long-term sites in the South West.\n\n\"We're all reliant on having somewhere to call home, no matter how humble that becomes, and just trying to provide that stability for yourself and your family,\" Mrs Holt said.\n\nKylie Holt says she is not confident she would find another caravan park with vacancies if she was forced to start looking now. (ABC South West: Madigan Landry)\n\nShe said she had seen a significant increase in the number of people using caravan parks as long-term accommodation.\n\n\"I'd say where we are, the amount of permanent families and people that we had doubled in the last three years,\" she said.\n\n\"From young mums with children, older men who have come out of divorce or widowed, and they can't afford a mortgage on their pension — a lot of different scenarios.\"\n\nTourism operator to landlord\n\nThe South West experienced a 62.9 per cent increase in the number of people experiencing homelessness between 2016 and 2021, which was the second largest increase in the state, according to the Australian Bureau of Statistics.\n\nSouth West caravan park manager Angela Kaitsioukas said she struggled with the shift from short-term holiday makers to long-term accommodation.\n\nWaterloo Village Caravan Park offers alternative types of long-term accommodation for people who do not have a caravan of their own. (ABC South West: Madigan Landry)\n\nMs Kaitsioukas said anti-social behaviour was causing safety concerns for her staff.\n\n\"There have been a couple of times where I have been quite scared to the point that now we actually have a pepper spray in our top drawer in the office,\" she said.\n\n\"We need everyone [customers] to have a current police clearance, no older than, like, six months old.\n\n\"We had been actually given a lot of false police clearances … I didn't realise that people would actually go to that length.\"\n\nAngela Kaitsioukas says more anti-social behaviour is making work challenging. (ABC South West: Madigan Landry)\n\nMs Kaitsioukas said she was considering removing long-term residency as an option because of the stress.\n\n\"I'm not sure that we will continue on doing it just because each year it seems to be getting a lot worse,\" she said.\n\n\" We do want to be, ultimately, just a caravan park. \"\n\n'An emergency valve'\n\nAnglicare CEO Mark Glasson said even caravan park space had been exhausted by the prolonged housing shortage.\n\n\"The inaccessibility of caravan parks for many people means that they are sleeping rough, they're sleeping in their cars, in tents, in people's backyards,\" he said.\n\n\"There's also a worrying trend that what was once an emergency valve is no longer available.\"",
    "source": "ABC",
    "cluster_id": 11
  },
  {
    "url": "https://www.abc.net.au/news/2025-12-05/oscar-piastri-and-lando-norris-in-abu-dhabi-grand-prix/106104724",
    "title": "Will Oscar play kingmaker? Piastri ducks big F1 title question",
    "publish_date": "Thu, 04 Dec 2025 21:59:37 +0000",
    "category": "sports",
    "authors": [],
    "text": "Oscar Piastri has sidestepped the question of whether he'd be prepared to play Formula One kingmaker by helping teammate and overwhelming championship favourite Lando Norris race to the world drivers' crown.\n\nNorris, who leads by 12 points from champion Max Verstappen and 16 from McLaren teammate Piastri going into the season-ending Abu Dhabi Grand Prix with all three still in the hunt, said on Thursday he felt he would help the Australian if the boot was on the other foot.\n\nBut quizzed on his stance, Piastri neatly ducked the burning topic on pre-race media day, shrugging: \"It's not something we've discussed — I don't really have an answer until I know what's expected of me.\"\n\nOthers, though, had plenty to say, with Mercedes driver George Russell adamant it would be \"unfair\" to ask Piastri to sacrifice his admittedly slim title chances, even if it meant neither McLaren driver ended up being champion.\n\nHis advice to Piastri? Unplug his car radio.\n\n\"I don't think it's acceptable or reasonable to ask a driver who's also in a shot at a championship in the very last race to move over for your teammate,\" Russell said.\n\n\"They both need to be given a shot, and if they lose out because of it, you just need to say the other guy did a better job and that's racing.\"\n\nHow Oscar Piastri can still win the F1 world title Oscar Piastri's hopes of winning the F1 title suffered a hammer blow after McLaren's strategy error in Qatar, but there is still hope. Here's how the Aussie can upset the odds in Abu Dhabi's decider.\n\nNorris, for his part, said he wouldn't ask Piastri for any help in a potential scenario where, say, he was fourth in the race with Verstappen leading and Piastri third — a situation which would result in the Red Bull champ retaining his crown unless the McLaren drivers switched positions.\n\nQuizzed over whether he would ask Piastri to sacrifice a place to help him, Norris, sounding a mite uncomfortable as his two title rivals sat alongside, said: \"I don't think I would ask it because … I don't know … it's up to Oscar if he would allow it. I don't think it's necessarily down to me.\n\n\"It's the same, if it's the other way around. Would I be willing to or not? Personally, I think I would just, because I feel like I'm always like that and that's just how I am.\n\n\"I'm not going to ask it, I don't want to ask it because I don't think it's necessarily a fair question,\" he added.\n\n\"At the same time, if that's how it ends and Max wins, then, well, that's it. Congrats to him, and look forward to next year. It doesn't change anything. It doesn't change my life. He will deserve it over us.\"\n\nIt seems unthinkable, though, that McLaren wouldn't ask Piastri to play the perfect team man again — a role he's played selflessly before in the British outfit — if it looked as if the team might miss out on the drivers' title after such a dominant year.\n\nPrincipal Andrea Stella, after all, had said after last Sunday's Qatar Grand Prix, where a strategy bungle ruined both their chances, that \"what's important for us is that we are in condition to beat Verstappen with one of our two drivers\".\n\nHe also said then that, though the team's racing approach would not change, there would be conversations this week — yet both drivers reckoned there had been none so far.\n\nNorris admitted he felt he had most to lose of the three contenders — and Piastri seemed more relaxed as he explained how he's feeling \"a lot of confidence\" off the back of his superb weekend in Qatar.\n\n\"Obviously, I need a fair few things to happen this weekend to come out champion, but I'll just make sure I'm in the right place at the right time and see what happens,\" he said.\n\n\"Obviously, it would be a very cool achievement, but I'm not getting my hopes up too high. We'll see what happens. If I can achieve it, then I'd be a pretty happy guy.\"\n\nAAP",
    "source": "ABC",
    "cluster_id": 12
  },
  {
    "url": "https://www.abc.net.au/news/2025-12-05/compressed-air-energy-storage-explainer/105999452",
    "title": "Compressed air energy storage is coming, but how does it work?",
    "publish_date": "Thu, 04 Dec 2025 20:57:40 +0000",
    "category": "finance",
    "authors": [],
    "text": "Broken Hill's hard-rock geology could hold part of the solution to Australia's energy storage problem as the country shifts to renewables.\n\nA 200-megawatt, $1 billion facility built by Canadian company Hydrostor near the historic mining city will be Australia's first large-scale compressed air energy storage facility, capable of powering up to 80,000 homes for a day.\n\nThe Silver City Energy Storage Centre will be able to store energy for about eight hours, longer than lithium-ion batteries, which typically hold about four hours of charge in large grid-scale batteries.\n\nThat means solar energy generated during the day can be soaked up and then released through the night.\n\nAbundant daytime renewable energy is wasted because of a lack of storage, and this figure is growing as more renewables come online.\n\nIt is estimated Australia will need up to 20 times more energy storage by 2050, and simply adding more lithium-ion batteries is not the solution because of their high cost and the limit on the number of hours they efficiently store energy.\n\nWhat is compressed air energy storage?\n\nA compressed-air energy storage facility is a bit like a pneumatic nail gun but on a much bigger scale, says Ben Clennell, a research scientist at the CSIRO, who has done work for Hydrostor in the past.\n\nDuring periods of high supply, renewable energy is used to pump atmospheric air, under pressure, into a storage container. It is then released during periods of high demand to drive a turbine and generate electricity.\n\nAn impression of the Hydrostor site. (Supplied: NSW government)\n\n\"It's a bit like storing air in a compressed air cylinder,\" Dr Clennell says.\n\nUnlike a nail gun, the Broken Hill facility has several extra steps to improve efficiency.\n\nThe process of compressing the air generates heat. Your reverse-cycle heater works on the same principle. This surplus heat is stored and then used to heat the stored air when it is decompressed.\n\nThe Broken Hill facility also uses water for a process called \"hydrostatic compensation\".\n\nThe compressed air is stored in a water-filled 280,000 cubic-metre underground cavern, 600 metres below the surface.\n\n\"As the air goes into the underground cavern, it pushes water out of the cavern to a lake at the top,\" Dr Clennell said.\n\nA diagram showing how Hydrostor's Compressed Air Energy Storage System works. (Supplied: Hydrostor)\n\nTo tap this stored energy, the process is reversed — water is allowed to flow from the surface reservoir back into the underground cavern, pushing air back to the surface where it's reheated and used to spin turbines that generate electricity.\n\nHydrostor, the Canadian company behind the Silver City Energy Storage Centre, said it would use a disused underground mine site adjacent to the proposed cavern to access and excavate rock to create the cavern.\n\n\"It [the rock] will hold water and air without having to line it or build a steel vessel because it's very high-density rock,\" said Martin Becker, from Hydrostor.\n\nDr Clennell said big compressed-air energy storage facilities had to be underground.\n\n\"You can store air in pressure vessels or pipes, or various other arrangements at the surface, but they would rapidly become very large if you're wanting to store hundreds of megawatt hours of electricity-equivalent power,\" he said.\n\nWhy use hydrostatic compensation?\n\nAdding water makes the process more complicated, but more efficient, robust and reliable, according to Seamus Garvey, a professor of energy dynamics at the University of Nottingham.\n\nProfessor Seamus Garvey recently established the Medium Duration Energy Storage Alliance. (Supplied: Seamus Garvey)\n\nIt means that when energy is needed, all of the air pumped into the underground cavern can be released through the turbines. Without water, some of the air would need to be left in the cavern to avoid creating a partial vacuum.\n\n\"You can get all the air back out of the tank when you want to empty it,\" Professor Garvey said.\n\nThe compressor and turbines can work at the same optimal pressure, which makes them more efficient.\n\nWater also mitigates damage to the storage vessels due to stress on materials caused by cycles of pressurisation and depressurisation — similar to the way the repeated heating and cooling of the ground during the day and night causes rock to warp and then crack.\n\n\"[The materials are in] big tension when the tank is full of high-pressure air, and then they relax a little bit when it's not full of high-pressure air,\" Professor Garvey said.\n\nHow efficient is a compressed air energy storage system?\n\nHydrostor said the Broken Hill facility would have a round-trip efficiency of about 66 per cent.\n\nThis meant about two-thirds of the electricity used to power the air compressors was later recovered as electricity generated by the turbines.\n\nHydrostor said it would take 12 hours to charge the system, which stored energy for eight hours.\n\nCSIRO's Dr Ben Clennell says compressed air energy is ideal for long-term energy storage. (Supplied: CSIRO)\n\nMr Martin said the system was more efficient than traditional compressed air storage because it captured heat and stored it in tanks on the surface.\n\n\"You can't run cool air through these turbines [to generate electricity]. The air needs to be at a certain operating range and temperature,\" he said.\n\n\"In traditional compressed air, when the air is reused to generate, they normally use natural gas. That is very inefficient because you're … introducing a fossil fuel source.\n\n\"So by capturing that heat, storing it and re-injecting it, you're eliminating the need to introduce another fuel.\"\n\nEven so, Dr Clennell said some energy would be lost as heat.\n\n\"In heat transfer processes, there will be some losses,\" he said.\n\n\"Then as the air expands, there will be some friction, and you generate more heat that wouldn't all be recovered, and so on.\n\n\"So you have losses in the machinery and in the tubing and in the heat exchangers.\"\n\nCompressed air systems were not as efficient as pumped hydro energy storage, said Graham Nathan, research director at the Heavy Industry Low-carbon Transition Cooperative Research Centre (HILT CRC).\n\n\"I mean 66 per cent [efficiency] is pretty good, but it's still pretty lossy. You'd like to be able to get 95 per cent, but of course you never would,\" he said.\n\nWhy compressed air energy storage?\n\nDespite being less efficient than other forms of energy storage, compressed air energy storage has some major advantages.\n\nLarge amounts of air can be stored relatively cheaply, Professor Nathan said.\n\n\"Batteries would be more efficient, but they'd be a much higher cost, and you wouldn't be able to get stuff of that size without being much, much more expensive,\" he said.\n\nProfessor Graham Nathan says compressed air energy storage is a cheap way to store large amounts of energy. (Supplied: HILT CRC)\n\nProfessor Garvey said compressed air could also store energy for longer than lithium-ion batteries.\n\n\"Batteries tend to be excellent solutions for energy storage that will discharge for relatively short periods of time, like up to four hours,\" he said.\n\n\"[But] most of the action that happens with energy storage … happens in a medium-sized set of time.\"\n\nFour hours of energy storage is useful for delivering stored solar to households in the evening, after the sun has set, but not so helpful for meeting demand through the night and the following morning.\n\nEnergy storage of 4 to 12 hours is known as \"medium duration\".\n\nTechnologies in this area include storing energy as heat in thermal blocks, or as potential energy as weights suspended from cranes, or new kinds of battery technologies currently undergoing testing such as vanadium redox-flow batteries.\n\nProfessor Garvey recently set up a Medium Duration Energy Storage Alliance to help provide recognition that medium duration storage is distinct from short and long duration energy storage.\n\nHow much medium storage energy storage does Australia need?\n\nAustralia needs 10-20 times more energy storage of all kinds by 2050 to meet its net zero emissions target, according to the CSIRO.\n\nBy 2030, about a quarter of energy storage should be medium duration, according to the Australian Energy Market Operator, which also forecasts strong demand.\n\nNew South Wales has legislated a 2-gigawatt target for storage of at least eight hours duration by 2030.\n\nIt is less than halfway towards its target.\n\n\"We do see it as a very important element of energy storage technology in the future,\" Dr Clennell said.",
    "source": "ABC",
    "cluster_id": 13
  },
  {
    "url": "https://www.abc.net.au/news/2025-12-05/local-australian-bid-to-take-over-gupta-tahmoor-mine/106101390",
    "title": "Australian-backed bid gathers pace to restart Tahmoor mine",
    "publish_date": "Thu, 04 Dec 2025 20:36:35 +0000",
    "category": "finance",
    "authors": [],
    "text": "A local consortium says it is \"hastily\" working on a bid to take over the mothballed Tahmoor mine, owned by British billionaire Sanjeev Gupta, to ensure operations start soon and \"there is a workforce to come back\".\n\nThe Tahmoor coking coal mine, south-west of Sydney, has been closed since February after running out of cash amid financial turmoil within Mr Gupta's GFG Alliance.\n\nAbout 500 workers, including contractors, were stood down on minimum pay, and in November, about half were told they would not be paid.\n\nWilliam Buck was appointed administrator of Liberty Primary Metals Australia (LPMA) in November.\n\nLPMA is the holding entity for GFG's Australian steel and mining businesses, including Tahmoor, and relies heavily on income from the mine to meet its financial obligations.\n\nAbout 500 workers were stood down when operations ceased at the Tahmoor mine earlier this year. (ABC News: Shaun Kingma)\n\nThis week, RStar, Tahmoor's majority contractor, has partnered with GBA Capital to assemble a bid.\n\nRStar's legal representative, Olivia Hitchens, principal at Artemide Law, said the consortium was moving quickly to put together an attractive offer.\n\n\"We want everyone who's employed at the mine to continue. That is mission critical for us,\" she said.\n\n\"RStar's workforce is a contracted workforce that would remain, as would the existing workforce … our proposal also carves off a piece of the pie for management to participate as equity owners.\"\n\nMs Hitchens said the closure had been difficult for RStar workers, many of whom had worked at the mine for decades.\n\n\"I think that the idea came about out of fear that someone else might take over the mine, who might not understand it, might not have the same relationship with management and might not love it the way that our client loves it,\" she said.\n\nCreditors report\n\nThe creditors' report released by William Buck on Monday found LPMA's holding-company structure and the complexity of GFG's global arrangements left its Australian businesses exposed.\n\nIt also revealed a failed $US1 billion plan to shift an electric arc furnace from South Korea to Romania to capture EU steel incentives.\n\nAdministrators said tens of millions were borrowed against Tahmoor to support the project before the economics collapsed when EU incentives were reduced.\n\nCombined with production issues, the cash drain left the mine unable to fund operations, forcing its closure earlier this year.\n\nAdministrators said they had received letters from third parties expressing interest in acquiring Tahmoor Coal and were recommending a Deed of Company Arrangement (DOCA) as a better outcome for creditors than liquidation.\n\nMs Hitchens said the release of the creditors' report provided vital clarity for the consortium as it finalised its bid.\n\n\"Until now, we didn't know what that looks like, but we need to get an idea of that number,\" she said, referring to the scale of LPMA's debt.\n\nShe said analysts were now assessing the mine's assets and future potential following a four-hour underground inspection on Tuesday.\n\nThe mothballed Tahmoor coal mine, which has been closed since February amid financial turmoil at GFG Alliance. (ABC Illawarra: Kelly Fuller )\n\nSite tour\n\nThis week, the RStar consortium conducted that tour with management, which Ms Hitchens described as highly encouraging.\n\n\"They have a really clear plan to re-open the mine, and it was really impressive.\"\n\nShe added that the consortium had been in contact with Mr Gupta and appreciated the access he provided to the mine and his cooperation.\n\nMs Hitchens said the situation remained \"complicated,\" with the administration process, a separate wind-up application from the mine's workers' compensation insurer, and the NSW government's decision to remain a secured creditor all adding uncertainty.\n\n\"There is a lot of hope here, and hopefully governments, unions, investors and powers that be [will] back our consortium and can move quickly, because it is a great asset — a really solid asset.\"",
    "source": "ABC",
    "cluster_id": 14
  },
  {
    "url": "https://www.abc.net.au/news/2025-12-05/asx-markets-business-live-news-dec-5-2025/106104580",
    "title": "Live: ChatGPT's owner OpenAI launching in Australia",
    "publish_date": "Thu, 04 Dec 2025 20:32:06 +0000",
    "category": "finance",
    "authors": [
      "Adelaide Miller",
      "Nassim Khadem",
      "Michael Janda",
      "Emilia Terzon",
      "Stephanie Chalmers"
    ],
    "text": "Thousands of Australians who lost hundreds of millions in retirement savings in First Guardian received bad news this week.\n\nThe fund collapsed earlier this year, leaving about 6000 investors losing $446 million.\n\nCorporate watchdog ASIC is currently conducting multiple investigations into the conduct of the fund's directors and in November announced legal action against more players involved in the collapse of both the First Guardian and Shield schemes.\n\nIn an update this week, FTI Consulting's Ross Blakeley and Paul Harlond — appointed in April as liquidator of Falcon Capital, the responsible entity that administered the First Guardian scheme — said just $1.6 million had been recovered to date.\n\nThe amount recovered so far will not even be enough to cover the liquidator's remuneration, which currently stands at almost $2 million.\n\nThe liquidators also warned any potential distribution, if it comes, is at least 18 months off.\n\nThe amount recovered thus far included more than $336,646 from the sale of a Lamborghini Urus allegedly bought with investor money.\n\nFox Friday (Mr Anderson was a director of the brewery until it went into liquidation earlier this year), with Falcon liquidators recovering just $450,000 of the $29 million invested.\n\nThe recovery also included $859,227 from Kanun Capital Pty Ltd as Trustee for the Kanun Capital Unit Trust, a niche lender to property developers. The outstanding book value of that investment, however, stands at about $30 million.\n\nThe liquidators said that across five of First Guardian's investments that had a combined book value of $59.2 million, just $504,754 had been recovered, with little to no prospect of further recoveries from these holdings.\n\nOf the total money pumped into First Guardian by Australians, $94.2 million was allegedly channeled into related-party investments, with a further $166.2 million sent to management-related parties, most of which had no formal agreement with Falcon.\n\nThe liquidators said $11.7 million was allegedly moved to directors' personal investment vehicles, as well as family members of the directors.\n\nIt also said a number of First Guardian investments would require litigation to effect recoveries, while \"other potential legal claims identified would primarily be against the directors or related parties\", making the amount and time of recovery uncertain.",
    "source": "ABC",
    "cluster_id": 15
  },
  {
    "url": "https://www.abc.net.au/news/2025-12-05/sa-golf-course-wetland-used-as-breeding-site-for-olive-perchlet/106102092",
    "title": "Scientists say golf course wetlands are the future for breeding threatened native fish",
    "publish_date": "Thu, 04 Dec 2025 20:28:51 +0000",
    "category": "sports",
    "authors": [],
    "text": "Golf courses around the world feature picturesque water ponds as a challenging hazard for players to avoid, but scientists say these permanent wetlands could be key breeding sites for threatened native fish.\n\nOnce found along the Murray Darling Basin but now locally extinct due to habitat loss, the olive perchlet has returned to South Australian waters for the first time since 1983.\n\nBacked by $50,000 from the South Australian government-supported group Green Adelaide, not-for-profit Nature Glenelg Trust is repopulating the native fish as part of its rewilding program.\n\n\"To be able to bring back a species that has actually been extinct in South Australia for over 40 years is such a huge achievement,\" senior freshwater ecologist Dr Sylvia Zukowski said.\n\nOlive perchlet are also known as glassfish because of their translucent appearance. (Supplied: Green Adelaide)\n\nShe said it was not known if breeding threatened fish by a golf green had been done before, but the artificial wetland at the Glenelg Golf Club, south-west of Adelaide, was perfect.\n\nIt has fringing vegetation and is safe from introduced predators like carp, gambusia and redfin.\n\nCrucially, the water is clean and permanent.\n\n\"One of the biggest concerns we have with fish is water security,\" Dr Zukowski said.\n\nThe Glenelg Golf Club wetlands is being used as a breeding site for hundreds of olive perchlet. (Supplied: Green Adelaide)\n\nDr Zukowski contributed to research published in 2024 which found 37 per cent of Australian native freshwater fish are at risk of extinction — a threat made worse by climate change.\n\nWhile drought conditions empty dams, wetlands like those at the Glenelg Golf Club do not dry out.\n\n\"Last year, we had the largest land drought within the Mount Lofty Ranges. We had dams going dry that haven't been dry for over 30 years,\" Dr Zukowski said.\n\n\"I think the golf club could be a really great part of fish conservation for South Australia and since we've done this in South Australia, we're also looking at it in other states as well.\"\n\nThe wetland is a perfect home for the olive perchlet due to its good water quality and fringing vegetation. (Supplied: Green Adelaide)\n\nUsing green spaces for good\n\nGlenelg Golf Club sprawls across 50 hectares of land, a \"fair slab\" which course superintendent Tim Warren said golf clubs \"have to almost justify\".\n\n\"Golf courses have more to play than just hitting a golf ball around, or LIV golf,\" he said.\n\n\"The cooling of the suburb, storm water retention and all the environmental benefits that an open space can bring.\"\n\nThe site has attracted pelicans, ducks, grebes, turtles, black cockatoos, magpies, Murray magpies and ibis, while a survey of the constructed wetlands where the olive perchlet now live found Galaxiidae, another native freshwater fish.\n\nGlenelg Golf Club course coordinator Tim Warren is keen to help threatened native fish species. (ABC News: Stephen Opie)\n\n\"We're not just a space for recreation … we play a role in environmental stewardship,\" Mr Warren said.\n\nBy early next year, the olive perchlet population could grow in the surrogate wetland from 500 to 10,000.\n\n\"We hope to be able to then reintroduce them into other wetlands and maybe even back into the wild one day,\" South Australian Environment Minister Lucy Hood said.",
    "source": "ABC",
    "cluster_id": 16
  },
  {
    "url": "https://www.smh.com.au/sport/golf/scott-opens-with-a-birdie-20251205-p5nl73.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Scott opens with a birdie",
    "publish_date": "Fri, 05 Dec 2025 12:44:28 +1100",
    "category": "finance",
    "authors": [],
    "text": "Scott opens with a birdie\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 17
  },
  {
    "url": "https://www.smh.com.au/business/companies/fashion-maven-fills-the-age-s-former-collins-st-home-with-tenants-20251204-p5nkvv.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Fashion maven fills The Age’s former Collins St home with tenants",
    "publish_date": "Fri, 05 Dec 2025 12:41:05 +1100",
    "category": "finance",
    "authors": [
      "Nicole Lindsay"
    ],
    "text": "Hospitality hotspot The slump in CBD property values is yielding a new buyer breed: hospitality operators taking a punt on buying their premises instead of leasing – and it’s not just at the high-end where Chris Lucas, Justin Hemmes and the O’Brien Group have paid top dollar for well-placed venues. This week, an owner-operator bought 171 Bourke Street for $3.88 million and has plans to open a new Asian fusion restaurant in mid-2026. The building is near the corner of the Bourke and Russell streets intersection which looks poised for a comeback with a new pub and hotel bar pulling in the punters. A swag of luxury hotels and fine dining nearby is also helping drive the renaissance. 171 Bourke Street has a new owner-occupier.\n\nThe deal was negotiated by Colliers’ Matt Stagg and Yvonne Zhou. Down the other end of town, a Sydney investor has paid $3 million for the Grain Store cafe at Shop 2 of 517 Flinders Lane. The deal reflected a building rate of $15,000-a-square-metre and a yield of 5.7 per cent. A Sydney investor has bought the Grain Store at 517 Flinders Lane. Grain Store, which opened in 2013, committed to a further 10-year lease in April 2023. Jones Real Estate’s Luke Peric did the deal.\n\nThe west end precinct also has its share of new attractions, notably Sand Hill Road’s new seven-level Waterside Hotel. Natural therapy The buyers of Fitzroy’s Southern School for Natural Therapies emerged this week after applying for development permits. A joint venture between B&B Property Group’s Stephen and Ben Buxton, and PACASA’s Stefano Paciocco has acquired 25-37 Victoria Street for a price believed to be about $20 million. The sale was negotiated by Colliers agents Matt Stagg, Ryan Milivojac, Ben Baines and Yvonne Zhou. Peter Smyth from Untitled Property represented the Jacka Foundation who bought the property for $1.53 million in 1996.\n\nThe joint venture has a caveat over the buildings – part of which is the 1889 Acme Shirt Factory – and applied for an eight-storey 60-unit project through the State Government’s Development Facilitation Program. 25-37 Victoria Street, Fitzroy Paciocco is a former development manager at Stephen Buxton’s first property business Hamton Property Group – Hamton’s first project is nearby, on the corner of Fitzroy Street. The plans drawn up by DKO Architecture include restoring the original shirt factory frontage and building behind and above it. The Buxton family, multi-generational property players, also have a foothold on the old swimsuit shop at 430-444 Brunswick Street and 224-228 Smith Street through Valli, which is backed by MAB founder Andrew Buxton.\n\nAll roads Fresh from the landmark completion of its Bourke Street Mall Mecca project, fund manager Newmark Capital is going back to basics. It’s purchased the VicRoads Testing & Inspection Centre in Ballarat for $8.975 million on a 7 per cent yield for the Newmark Property Income Fund. VicRoads at 86-88 Learmonth Road, Wendouree. While that yield might seem on the high side, the lease has just four years left to run with two-year options.\n\nThe building at 86-88 Learmonth Road, Wendouree, purpose built for VicRoads in 2001, is zoned for public use, which limits it to government-related activities. It’s on 8485 square metres of land and returns $628,000 a year. CBRE’s Scott Hawthorne and George Wilkinson handled the transaction which drew six offers from local and interstate investors. Records show the vendor was the local Edward family. Deals done The year is ending with a bang at the retail end of the market with a swag of competitive deals struck on sharp yields. The sale of a tiny vacant shop at 416 Toorak Road set the sharpest yield of the lot – just 2.5 per cent from a $2.7 million deal.\n\nThe 150-square-metre shop is on 196 square metres of land opposite the Trak Centre and Vicland’s St Germain project, and is a few doors away from Orchard Piper’s recently completed project. 416 Toorak Road, Toorak. In East Burwood, 19 bidders registered for the auction of the KFC building at 123-125 Burwood Highway last week, with the buyer paying $5.83 million, reflecting a 3.3 per cent yield on a gross lease. The deal was one of six properties worth a total of $50 million sold by Stonebridge Property Group in the past 10 days. The Red Rooster Wodonga drew seven bidders and sold for $3.35 million on a 5 per cent yield. Stonebridge’s Kevin Tong, who did the deals with Rorey James, said the depth in the buyer pool – all 26 registered parties for both auctions demonstrated an intention to buy – indicated a strong sign of market confidence.\n\nThe team also sold the Pakenham BP and KFC servo for $14 million on a 5.61 per cent yield. The crowd at the auction of the East Burwood KFC. A Sydney buyer has paid $6.41 million for China state-owned Sinopec’s first Australian servo on a 5.81 per cent yield. Cushman & Wakefield’s George Davies, who handled the negotiations with Oliver Hay, Raphael Favas and Leon Ma, said five offers were made for the property. The servo at 325A Nepean Highway, Frankston was developed and sold by Jasbe.\n\nIn Ringwood, a strata property at 5-6/74-82 Maroondah Highway occupied by a Club Lime gym, sold under the hammer for $5.9 million. Four bidders competed for the 1288-square-metre open-plan showroom with a local investor out muscling competition from around Melbourne and Australia. Fitzroys’ Ben Liu and Chris James and Gross Waddell ICR’s Glenn Ye and Danny Clark ran the auction. Club Lime, owned by ASX-listed Viva Leisure – Australia’s second-largest fitness network – has a new 10-year lease. The price reflected a tight 5.7 per cent yield. Season Greetings",
    "source": "SMH",
    "cluster_id": 18
  },
  {
    "url": "https://www.smh.com.au/politics/victoria/skinny-surplus-still-on-track-despite-greater-government-spending-20251205-p5nl4j.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Skinny surplus still on track despite greater government spending",
    "publish_date": "Fri, 05 Dec 2025 12:40:54 +1100",
    "category": "finance",
    "authors": [
      "Chip Le Grand",
      "Kieran Rooney"
    ],
    "text": "The Victorian government remains on track to deliver its first operating surplus since the pandemic, with the release of its mid-year budget update showing an unexpected $1.5 billion in additional revenue in the state’s finances.\n\nHowever, the Allan government has again shown no signs of reining in spending, with recurrent government expenses now projected to reach $109 billion this year, up from the $107.7 billion forecast when the budget was handed down in May.\n\nVictorian Treasurer Jaclyn Symes. Credit: Getty\n\nThe government wages bill – a focus of the Silver review of the public service released on Thursday – also continues to climb, with employee expenses forecast to top $39 billion.\n\nThe budget update reveals that investment property owners have been given an unannounced Christmas gift. They had been expecting a $139 increase in the deeply unpopular Emergency Services and Volunteers Fund next year, but will now be spared the additional impost until after the November state election.",
    "source": "SMH",
    "cluster_id": 19
  },
  {
    "url": "https://www.smh.com.au/national/nsw/sydney-s-three-metro-rail-projects-blow-out-by-more-than-6-billion-20251205-p5nl59.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Sydney’s three metro rail projects blow out by more than $6 billion",
    "publish_date": "Fri, 05 Dec 2025 12:38:23 +1100",
    "category": "finance",
    "authors": [
      "Matt O'Sullivan",
      "Ellie Busby"
    ],
    "text": "The cost of Sydney’s three metro rail projects has blown out by more than $6 billion due to disputes with contractors, skyrocketing construction expenses and design and scope changes, which the Minns government has attempted to blame on its Coalition predecessors.\n\nAs foreshadowed by the Herald, the Minns government has confirmed that its signature rail project, Metro West, is now estimated to cost between $27 and $29 billion to complete by its targeted opening date of 2032. The 24-kilometre line will extend from the Sydney CBD to Westmead.\n\nThe Metro West rail line between central Sydney and Parramatta is now forecast to cost up to $29 billion. Credit: Janie Barrett\n\nThe government also confirmed reports by this masthead that legal claims made by the private consortium building the metro line to Western Sydney Airport might raise the project’s total price tag by more than $1 billion to more than $12 billion.\n\nThe project is already set to open 12 months late in December 2027, a year after the first flights are expected to take off from the new international airport.",
    "source": "SMH",
    "cluster_id": 20
  },
  {
    "url": "https://www.smh.com.au/politics/federal/the-latest-illustrations-from-artist-matt-golding-20230608-p5df5o.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "The latest illustrations from artist Matt Golding",
    "publish_date": "Fri, 05 Dec 2025 12:32:18 +1100",
    "category": "entertainment",
    "authors": [],
    "text": "The latest illustrations from artist Matt Golding\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 21
  },
  {
    "url": "https://www.smh.com.au/sport/kenyan-obliterates-womens-marathon-world-record-20251205-p5nl6x.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Kenyan obliterates women's marathon world record",
    "publish_date": "Fri, 05 Dec 2025 12:30:26 +1100",
    "category": "sports",
    "authors": [],
    "text": "Kenyan obliterates women's marathon world record\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 22
  },
  {
    "url": "https://www.smh.com.au/national/nsw/fears-cracked-pipe-causing-sewerage-leak-could-flow-into-sydney-harbour-20251205-p5nl47.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Fears cracked pipe causing sewage leak could flow into Sydney Harbour",
    "publish_date": "Fri, 05 Dec 2025 12:15:04 +1100",
    "category": "finance",
    "authors": [
      "Cindy Yin"
    ],
    "text": "A cracked underground pipe in Pyrmont has created a significant leak, which in the worst-case scenario could result in sewage flowing into Sydney Harbour.\n\nA leak in one of the main sewerage pipes running eight to nine metres underground in Pyrmont was identified weeks ago. While the leak has been contained, significant emergency works are under way at the nearby Wentworth Park in Glebe to divert the flow away from the leaking pipe.\n\nWorkers at Wentworth Park on Friday morning. Credit: Sam Mooy\n\nNSW water minister Rose Jackson said while it had a low likelihood of happening, the “worst-case scenario” could see leaked sewage flowing into the harbour.\n\n“That’s why we’re working so hard to get this fixed now because, in that worst-case scenario where there is sewerage flowing into the harbour, we would do everything we could to manage that,” Jackson said on Friday.",
    "source": "SMH",
    "cluster_id": 23
  },
  {
    "url": "https://www.smh.com.au/national/tubbys-blunt-call-on-lyon-axing-20251205-p5nl6i.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Tubby's blunt call on Lyon axing",
    "publish_date": "Fri, 05 Dec 2025 12:10:19 +1100",
    "category": "finance",
    "authors": [],
    "text": "Tubby's blunt call on Lyon axing\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 24
  },
  {
    "url": "https://www.smh.com.au/goodfood/recipes/pistachio-amaretti-20251205-p5nl6a.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Pistachio amaretti",
    "publish_date": "Fri, 05 Dec 2025 12:08:45 +1100",
    "category": "finance",
    "authors": [
      "Julia Busuttil Nishimura"
    ],
    "text": "Decorate the biscuits with halved pistachios (pictured) or amarena cherries. William Meppem\n\nThese soft and chewy pistachio amaretti are so festive and make for a wonderful offering during the holiday period when visitors are coming and going. They’re fragrant with citrus and have a beautiful green hue.\n\nThey’re wonderful plain, but I like to top them with half a pistachio kernel or, sometimes, half an amarena cherry.\n\nIf you don’t have pistachios, you can just use more almond meal to make\n\nregular almond amaretti.",
    "source": "SMH",
    "cluster_id": 25
  },
  {
    "url": "https://www.smh.com.au/business/companies/the-curse-of-rupert-lachlan-murdoch-has-a-long-way-to-go-to-match-his-dad-20251205-p5nl33.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "The curse of Rupert: Lachlan Murdoch has a long way to go to match his dad",
    "publish_date": "Fri, 05 Dec 2025 12:01:29 +1100",
    "category": "finance",
    "authors": [
      "Colin Kruger"
    ],
    "text": "Lachlan Murdoch, victorious heir to the family’s global media empire, celebrated the end of a tumultuous year at his Sydney Harbour mansion Thursday evening with a guest list that few social events in Australia could match.\n\nThe rich, powerful and famous trekked up the driveway of his humble home – “Le Manoir”, the former French consulate in Bellevue Hill – to one of the most closely watched gatherings on the social calendar.\n\nLachlan Murdoch has an uphill battle on his hands. Credit: Jamie Brown\n\nAttendees included Sydney’s sports czar Peter V’landys, AFL boss Andrew Dillon and his NRL counterpart Andrew Abdo, along with members of the News Corp-owned NRL premiers Brisbane Broncos: coach Michael Maguire and chief executive Dave Donaghy.\n\nFormer AFL boss and high-flying Tabcorp chief executive Gillon McLachlan led the stream of corporate talent, which included Commonwealth Bank boss Matt Comyn and SGH boss Ryan Stokes – another corporate titan and billionaire-heir like Lachlan.",
    "source": "SMH",
    "cluster_id": 26
  },
  {
    "url": "https://www.smh.com.au/technology/facial-age-verification-can-it-be-fooled-and-how-safe-is-it-20251204-p5nkss.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Facial age verification: Can it be fooled and how safe is it?",
    "publish_date": "Fri, 05 Dec 2025 11:53:43 +1100",
    "category": "finance",
    "authors": [
      "Tim Biggs"
    ],
    "text": "So, some form of age inference is already being applied to all social media accounts, even when there’s no legal requirement. That might mean inferring your age from photos you post, messages you send or subjects you’re interested in. It’s not exactly precise, but if the estimate on your account is 40-45 then the platform might be satisfied and won’t ask you to verify your age for the purposes of the new laws. If it’s 20-25 though, it may. Loading The eSafety commissioner has recommended companies take a “waterfall” approach to this problem, borrowing industry jargon to mean starting with the method that interrupts users the least and then escalating from there as necessary. So theoretically, the company could first check to see if it’s already very confident a user is over 16, without the user even knowing. The next option might be an instant background check, which would require the platform to use an identity service. VerifyMy, which supplies services like these to companies complying with US and European laws, says it can verify the vast majority of adults over 18 very quickly using only their email address, deleting all the information afterwards. The social media companies already have your email address, so you would likely be asked to consent to the check, and the identity company would then search through financial records and the like to see if your email address shows up. If you’ve ever taken out a loan or paid for utilities, it probably will. If the methods that can happen automatically in the background fail, the next step would likely involve the user supplying a short video of themselves. Which is where visual facial age estimation comes in.\n\nThe video selfie It’s important to note that since the government isn’t requiring social media companies to use any specific technology or service, we can’t say exactly what the process will be for each app. But in this hypothetical waterfall scenario I’m describing — based on the eSafety’s guidelines and the way things have worked with age restriction regulations overseas — I’ll describe the facial age technology provided by Yoti, a British company that Meta uses for identity services. It currently processes more than a million age checks per day, thanks to laws restricting access to adult services and the purchasing of certain goods in the US and Europe. If the platform hasn’t been able to verify that you’re 16 or over with the above methods, it may open up a facial age estimation window powered by Yoti’s technology. This doesn’t require you to download an app or go anywhere outside of the platform, and it works with whatever camera is attached to the device you have. Prompts guide you through capturing a photo of your face, while Yoti’s processes attempt to confirm it is a living face rather than a photo or some other image. Once the data is captured, the system analyses it and guesses your age, with the pass or fail transmitted to the social media platform. Yoti says this takes less than a second. Importantly, it’s not using your facial data to make any assumptions about you other than your age. It’s not trying to identify you, and it doesn’t pass anything on to the social media platform except whether you passed or failed. Yoti says that its selfie age assurance works to within one year of accuracy, and equally well across genders and skin tones. So anyone over 17 should pass.\n\nSo, will kids be able to break into social media using their parents’ faces, as several have already boasted of doing online? Of course they will. Facial age estimation platforms are designed only to guess the age of a face, not to identify the person the face belongs to, or ensure it’s the same person using a social media account. Yoti makes big claims about its ability to tell a living face from a photo or recording, but other platforms may not be as strong. But this isn’t to say that getting around the ban will be easy. The underage user will likely need access to a willing adult accomplice, and all the platform’s other analytics will still be sounding the alarm. If you recently changed your birthdate to make yourself 16 instead of 13, then passed a facial age estimation check, then continued to engage with the platform in a way that’s consistent with a 13-year-old, the apps will take note. You might not get booted right away, but if eSafety is upset that too many underage users are still on the platform, they’ll know who to re-verify. Loading Where else things could come apart At this point in the waterfall hypothetical, the huge majority of Australians who are legitimately over 16 have been allowed onto the platform, either because the app already knows they’re an adult, or because of a background check or facial age estimation. The remainder can fit generally into three groups; those who are under 16, those who are under 17 (remember Yoti’s technology is accurate to within one year), and those who are an absolute edge case in both not having an active email address and appearing significantly younger than they are. Photo IDs are the next least intrusive option.\n\nFor the edge cases, the process should go smoothly and (if the platform is following best practices and eSafety’s guidance) would not require them to give a scan of their ID to a company that’s going to misuse it or store it improperly. An identity service would capture a video of the user holding their ID, checking the details against government records while also matching the face on the document, subsequently informing the platform of a pass or fail and deleting all the data. The big problem for users between 16 and 17 is that if they don’t have a learner’s permit or passport they likely don’t have a useable photo ID. Some states have alternative documents and there are burgeoning digital ID systems that let you prove your age through other documents and then provide a token to the platform, but users will be at the mercy of social media platforms and identity services in terms of which of these are supported. Users who are actually under 16 and are determined to defeat the verification system would likely do so in this step of the waterfall, assuming they couldn’t find a compliant adult to help in the previous one of the waterfall or the previous one. They could procure the genuine photo ID of a person who looks like them, for example their parent or sibling, and hope to get through. Since the verification happens through the identity company and not the social media platform, the ID would not be compared against any photos a user posts. Loading This is all based on speculation of how the system will ideally work, but there are other potential issues. What happens when a small under-resourced or inexperienced social media company tries to comply and ends up with user data it really doesn’t need to have? What about when crooks start making fake pages that look like verification screenings and ask people to send pictures of their passports? What if it’s so easy for underage users to side-step the checks that social media companies need to employ more intrusive methods?",
    "source": "SMH",
    "cluster_id": 27
  },
  {
    "url": "https://www.sbs.com.au/news/article/teen-social-media-ban-visa-holders/9lvj3s138",
    "title": "Australian teens holidaying overseas still subject to social media ban, Meta says",
    "publish_date": "Fri, 5 Dec 2025 00:08:50 +0000",
    "category": "finance",
    "authors": [],
    "text": "Meta has started locking the accounts of under-16s on Instagram and Facebook ahead of Australia's world-first social media ban, but uncertainty remains over whether young temporary visa holders — including international students — will also be swept up in the restrictions.\n\n\n\n\n\nThe tech giant has confirmed to SBS News Australian under-16s users travelling overseas for a short-term holiday will still be restricted from using Facebook and Instagram.\n\n\n\n\n\n\"We will still recognise them as a resident of Australia, and they will still be subject to Australian law,\" a spokesperson for the company said.\n\n\n\n\n\nThe ban starts on 10 December , yet Meta has already notified users aged 13 to 15 that their accounts will be shut down. About 150,000 Facebook users and 350,000 Instagram accounts are expected to be affected. Under-16s are now blocked from creating new accounts on either platform.\n\n\n\n\n\nA spokesperson for the eSafety commissioner told SBS News the rules apply to young people under 16 who are \"ordinarily resident\" in Australia.\n\n\n\nBut what does \"ordinarily resident\" mean in practice — and could it include young people on temporary visas, such as international students?\n\n\n\nDoes the ban apply to under-16 international students?\n\nA spokesperson for Meta told SBS News it's unlikely teens who enter Australia for a short holiday will have their accounts restricted.\n\n\n\n\n\n\"However, if they stay in Australia for an extended period, such as long study periods, then our age assurance measures will take effect,\" they said.\n\n\n\n\n\nAccording to the latest figures from the Department of Education, 19,768 international students were enrolled in Australian schools and 331,402 in VET programs as of September this year.\n\n\n\n\n\nIt isn't clear how many of those students are under 16.\n\n\n\nREAD MORE Could turning off algorithms fix our social media feed? This Australian campaign thinks so\n\nA spokesperson for the eSafety commissioner said temporary visa holders, including international students, should be aware their accounts \"may be flagged\".\n\n\n\n\n\nThis could include \"age checks, deactivation or removal if platforms receive signals indicating they are in Australia for a significant period of time or indefinitely\".\n\n\n\n\n\nSBS News has sought clarification from the eSafety commissioner on what counts as a \"significant period of time\".\n\n\n\n\n\nAccording to the Australian Citizenship Act (2007) a person is not \"ordinarily resident\" in Australia if they reside in the country for a \"special or temporary purpose only\", but considered resident if they are home or have a permanent abode in the country.\n\n\n\nNot just location data\n\nIt's understood platforms won't rely solely on location data to determine whether a young person is living in Australia.\n\n\n\n\n\nAn eSafety spokesperson said the industry will use \"various signals\" to identify a person's country of residence.\n\n\n\nA spokesperson for the eSafety commissioner told SBS News they understand Meta will use \"various signals\" to detect users' locations. Source: AAP / Nicholas T. Ansell \"This approach will also be leveraged to prevent issues such as circumvention via VPN as well [as] limit unintended disruption of services to people visiting the country for a short period,\" they said.\n\n\n\n\n\nIt's not clear what those signals might be, but the spokesperson said platforms are expected to take reasonable steps to address potential errors, such as mistakenly including a young person .\n\n\n\n\n\n\"Platforms should also provide clear ways for people to request a review if they have been age-restricted by mistake,\" they said.\n\n\n\nNearly 'every teen affected'\n\nRoy Morgan research released this week shows 624,000 Australians aged 14 and 15 use at least one social media platform.\n\n\n\n\n\nYoutube was the most popular platform, with 95 per cent of young Australians using it.\n\n\n\nSnapchat was next at 87 per cent, followed by Facebook and then Instagram at 81 per cent and 78 per cent respectively.\n\n\n\n\n\nRoy Morgan CEO Michele Levine said the number shows how \"deeply social media is embedded in the daily lives of Australian teenagers\".\n\n\n\n\n\n\"The new legislation to ban social media for Australians under 16, set to be enforced from next week, will affect almost every 14 to 15-year-old in the country.\"\n\n\n\n",
    "source": "SBS",
    "cluster_id": 28
  },
  {
    "url": "https://www.sbs.com.au/news/video/2-5-million-grant-for-cutting-edge-brain-cancer-research-lab/sfx285w12",
    "title": "$2.5 million grant for cutting edge brain cancer research lab",
    "publish_date": "Thu, 4 Dec 2025 10:29:35 +0000",
    "category": "lifestyle",
    "authors": [],
    "text": "$2.5 million grant for cutting edge brain cancer research lab\n\nPublished 4 December 2025, 8:55 am\n\nAn Australian cancer research centre has been awarded a $2.5 million grant to further their research into one of the country's deadliest brain cancers. Researchers at the Walter and Eliza Institute in Melbourne hope to fast-track diagnosis and treatment options.",
    "source": "SBS",
    "cluster_id": 29
  },
  {
    "url": "https://www.sbs.com.au/news/video/destructive-floods-displace-more-than-1-million-people-across-south-east-asia/fxmdbr65g",
    "title": "Destructive floods displace more than 1 million people across South-east Asia",
    "publish_date": "Thu, 4 Dec 2025 10:07:08 +0000",
    "category": "finance",
    "authors": [],
    "text": "Destructive floods displace more than 1 million people across South-east Asia\n\nPublished 4 December 2025, 8:55 am\n\nMore than one million people are now homeless and hundreds remain missing across South-east Asia, after cyclones triggered a series of floods and landslides. The death toll has risen, with 1300 people now confirmed to have lost their lives in the catastrophic weather event.",
    "source": "SBS",
    "cluster_id": 30
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/rba-could-hike-rates-sooner-than-expected-how-much-super-do-you-need/l53hb1k5o",
    "title": "RBA could hike rates sooner than expected | How much super do you need?",
    "publish_date": "Thu, 4 Dec 2025 07:57:16 +0000",
    "category": "finance",
    "authors": [],
    "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
    "source": "SBS",
    "cluster_id": 31
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/se-asia-flood-crisis-putins-moscow-musings-austrias-rebel-nuns-return/zb8uvqtqk",
    "title": "SE Asia flood crisis, Putin’s Moscow musings & Austria’s rebel nuns return",
    "publish_date": "Thu, 4 Dec 2025 07:51:12 +0000",
    "category": "finance",
    "authors": [],
    "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
    "source": "SBS",
    "cluster_id": 31
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/how-helpful-is-carbon-capture-in-mitigating-global-warming/ppbj7zcj9",
    "title": "How helpful is carbon capture in mitigating global warming?",
    "publish_date": "Thu, 4 Dec 2025 07:26:15 +0000",
    "category": "finance",
    "authors": [],
    "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nThat's the sound of a helicopter taking off from Esbjerg Airport on Danish Jutland peninsula’s west coast.\n\n\n\n\n\nIt was heading towards a remote platform in the North Sea where an oil facility lives.\n\n\n\n\n\nThe facility - Siri platform - is part of a European Union initiative to store carbon dioxide beneath the North Sea.\n\n\n\n\n\nIt's set to launch its operations next year.\n\n\n\n\n\nThe carbon capture process - currently in its final stage - is a way of permanently storing planet-warming carbon dioxide beneath the seabed.\n\n\n\n\n\nThe European Union is aiming to achieve a carbon dioxide injection capacity of at least 50 million tonnes per year by 2030.\n\n\n\n\n\nMads Gade is the CEO of INEOS Energy in Europe.\n\n\n\n\n\n\"The potential is actually quite big. So, if you look at some of the geological studies done, Denmark has the potential to actually store more than several hundred years of our own emissions. So, we are able to create an industry where we can support Europe in actually storing a lot of the CO2 here. So, plenty of potential to do that.\"\n\n\n\n\n\nSiri is close to the remote Nini oil field.\n\n\n\n\n\nThis project - used to extract fossil fuels from beneath the seabed - will give the field a second lease of life.\n\n\n\n\n\nIn a process that almost reverses oil extraction, INEOS plans to inject liquefied carbon dioxide deep down into depleted oil reservoirs, 1,800 meters beneath the North Sea.\n\n\n\n\n\nThe carbon capture and storage efforts are named Greensand Future.\n\n\n\n\n\nPeter Bjerre is the maintenance manager at INEOS Energy.\n\n\n\n\n\n\"With this new green transition, we're actually going to do the same thing, but instead of taking oil out of the reservoir, we're actually reversing the flow and adding the CO2 to the reservoir, instead giving us a future out here and also a big contribution to the green transition.\"\n\n\n\n\n\nGreensand is expected to become the European Union’s first fully-operational offshore carbon dioxide storage site.\n\n\n\n\n\nThis is the aim when the project begins its commercial operations next year.\n\n\n\n\n\nIt will initially begin storing close to 400,000 tonnes [[363,000 metric tonnes]] of carbon dioxide each year, scaling up to as much as 8 million tonnes [[7.2 million metric tonnes]] annually by 2030.\n\n\n\n\n\nMr Gade says it's the best solution to reduce emissions.\n\n\n\n\n\n\"We think it's one of the best answers to cut emissions. And the reason is that we don't want to deindustrialise Europe. We want to have actually a few instruments to decarbonise instead. So we can maintain our industry, but meanwhile actually remove some of the CO2, so it's going to offset.\"\n\n\n\n\n\nGreensand has struck deals with Danish biogas facilities to bury their captured carbon emissions into depleted reservoirs of the Nini oil field.\n\n\n\n\n\nThe EU has proposed developing around 280 million tonnes of carbon dioxide storage per year by 2040.\n\n\n\n\n\nThis is a part of their plans to reach \"net zero\" emissions by 2050.\n\n\n\n\n\nNiels Schovsbo is a senior researcher at the Geological Survey of Denmark and Greenland.\n\n\n\n\n\nHe says experts at Denmark’s geological survey say Greensand reservoir sandstone rock is well-suited.\n\n\n\n\n\nAnd that a third of the rock volume is made up of tiny cavities, perfect for storing the liquified carbon dioxide.\n\n\n\n\n\n“We found that there is no reactions between the reservoir and the injected CO2. And we find that the seal rock on top of that has sufficient capacity to withhold the pressure that is induced when we are storing CO2 in the subsurface. So, these two methods make it a perfect site for storage right there.”\n\n\n\n\n\nBut while there are many carbon capture facilities around the world, the technology is far from scale.\n\n\n\n\n\nIt sometimes uses fossil fuel energy in its operations, and captures just a tiny fraction of worldwide emissions.\n\n\n\n\n\nAccording to the International Energy Agency, the Greensand project’s aim is to bury up to eight million tons of carbon dioxide a year by 2030.\n\n\n\n\n\nJust last year, nearly 38 billion tons of carbon dioxide was emitted globally.\n\n\n\n\n\nThe chemical giant is also hoping to begin development at another previously unopened North Sea oil field.\n\n\n\n\n\nHelene Hagel is the head of climate and environment policy at Greenpeace Denmark.\n\n\n\n\n\n\"We could have CCS on those very few sectors where emissions are truly difficult or impossible to abate, but when you have all sectors in society almost saying, we need to just catch the emissions and store them instead of reducing emissions, and that is the problem in developed societies right now.\"\n\n\n\n\n\nShe says carbon capture storage has been used as an excuse by industries to delay cutting emissions.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 32
  },
  {
    "url": "https://www.sbs.com.au/news/article/what-to-know-about-the-fifa-world-cup-2026-draw/o19tphr95",
    "title": "Who could the Socceroos play? What to know about the FIFA World Cup 2026 draw",
    "publish_date": "Thu, 4 Dec 2025 06:54:22 +0000",
    "category": "sports",
    "authors": [],
    "text": "Australia's Socceroos will soon learn who their FIFA World Cup 2026 opening stage opponents are, with the unveiling of the tournament's draw.\n\n\n\n\n\nThe World Cup draw will be attended by United States President Donald Trump, who has been rumoured as a possible winner of FIFA's inaugural peace prize, which will also be awarded at the event.\n\n\n\n\n\nDraw proceedings kick off at Washington's John F Kennedy Center for the Performing Arts at midday local time on Friday 5 December, which means early morning Saturday for Australians (more details on that below).\n\n\n\n\n\nThe draw will divide the 48 teams — three host teams, 39 qualified teams, two FIFA World Cup 2026 play-off tournament placeholders and four European play-off placeholders — into 12 groups comprising four teams each.\n\n\n\n\n\nIt's an expansion from previous World Cups, which only included 32 teams.\n\n\n\nThe Socceroos met France and Denmark at both the 2022 and 2018 group stages. The only other nations the Australian side has encountered twice at the cup finals are Chile and Germany.\n\n\n\n\n\nGiven their placement in Pot 2 — a system by which more closely ranked teams are grouped — the Socceroos won't face two-time champions Uruguay, 2018 finalists Croatia, Colombia, Switzerland or Austria in the opening round.\n\n\n\n\n\nTeams in the same pot cannot compete against each other in this stage, meaning the Socceroos will also avoid early match-ups with Asian regional confederation rivals Japan, South Korea and Iran.\n\n\n\n\n\nHowever, they could face highly-ranked teams such as England, Argentina, Spain, Norway, or Italy, who are yet to qualify but could be a late entry to Pot 4.\n\n\n\n\n\nA total of 104 games will be held in stadiums across the host countries — Canada, Mexico and the US.\n\n\n\nThe Socceroos were knocked out in round 16 of the World Cup 2022. Source: AAP / Joel Carrett The teams will be drawn by supermodel and television personality Heidi Klum, comedian Kevin Hart and actor Danny Ramirez.\n\n\n\n\n\nGuests will also be treated to performances by British pop star Robbie Williams, American singer Nicole Scherzinger and classical singer Andrew Bocelli.\n\n\n\n\n\nLegendary disco band the Village People will also deliver a rendition of YMCA, Trump's favourite campaign anthem.\n\n\n\nPeace prize to also be announced\n\nFIFA president Gianni Infantino will also be announcing the winner of the inaugural FIFA Peace Prize at the draw, which the organisation has said will go to someone who has \"taken exceptional and extraordinary actions for peace\".\n\n\n\n\n\nThere are broad speculations the prize will be awarded to Trump, who is known to have a close relationship with Infantino.\n\n\n\n\n\nInfantino attended Trump's inauguration in January and has previously said the US leader deserved global recognition for his role in brokering a ceasefire in the Middle East.\n\n\n\n\n\nThe FIFA boss also rubbed shoulders with world leaders at a Gaza peace summit in mid-October, reportedly at the invitation of Trump.\n\n\n\nSome have questioned FIFA's involvement in politics, with Human Rights Watch sending a letter requesting information on the criteria and process for selecting the winner.\n\n\n\n\n\nThe announcement of the peace prize in early November prompted questions as to whether Trump would be the first recipient of the award.\n\n\n\n\n\nAsked at the America Business Forum in Miami recently, which Trump also attended, Infantino replied: \"On the 5th of December you will see.\" He also said he had \"a great relationship\" with Trump.\n\n\n\nWhat are the FIFA pots?\n\nThere are four pots in the draw, with all pots seeded with teams from the FIFA/Coca-Cola Men's World Ranking.\n\n\n\n\n\nPot 1 includes the top nine teams, alongside the hosts: Canada, Mexico, USA, Spain, Argentina, France, England, Brazil, Portugal, Netherlands, Belgium, and Germany.\n\n\n\n\n\nPot 2 has the next 12 highest-ranked teams: Croatia, Morocco, Colombia, Uruguay, Switzerland, Japan, Senegal, IR Iran, Korea Republic, Ecuador, Austria, and Australia.\n\n\n\nThe World Cup 2026 final will be held at the New York/New Jersey Stadium on 19 July. Source: Getty / Cristopher Rogel Blanquet Pot 3 is followed by the next 12: Norway, Panama, Egypt, Algeria, Scotland, Paraguay, Tunisia, Côte d'Ivoire, Uzbekistan, Qatar, Saudi Arabia, and South Africa.\n\n\n\n\n\nPot 4 includes six teams — Jordan, Cabo Verde, Ghana, Curaçao, Haiti, and New Zealand — and six placeholders scheduled to play in March 2026 during the international match window.\n\n\n\nHow does the draw work?\n\nAs the teams are drawn, they will go into groups from A to L.\n\n\n\n\n\nThe teams in Pot 1 will go into the first positions in each group, with host country positions already established. Mexico for A1, Canada B1 and USA D1.\n\n\n\n\n\nThose in pots 2, 3 and 4 will be drawn randomly into other positions in their respective groups.\n\n\n\nREAD MORE How to watch the FIFA World Cup 26™ Final Draw LIVE on SBS\n\nFor the first time, the four highest-seeded countries will not face each other until the semifinals, assuming all four win in their groups. According to FIFA, this is to ensure a balanced distribution of teams.\n\n\n\n\n\nTwo countries from the same confederation — Africa, Asia, Europe, North and Central America and the Caribbean, South America and Oceania — cannot be drawn together.\n\n\n\n\n\nEurope has an exemption because it has 16 countries competing in the World Cup, making it impossible to prevent a clash.\n\n\n\nWhere can I watch the World Cup draw in Australia?\n\nAustralians will have to rise early on Saturday 6 December to watch the World Cup draw live, which will be streaming live and free on SBS, SBS VICELAND and SBS On Demand at the following times:\n\n\n\n4am AEDT (Victoria, Tasmania and most of NSW)\n\n3.30am South Australia\n\n3am Queensland\n\n2:30am Northern Territory\n\n1am Western Australia\n\nSocceroo fans at Federation Square in Melbourne watch Australia play Denmark at the FIFA World Cup 2022. Source: AAP / Con Chronis On Sunday, for Australians, the matchups to venues and kick-off times will be released following the post-draw allocation process.\n\n\n\n\n\nThis ensures fans worldwide can watch their teams play live across different time zones.\n\n\n\n\n\nWatch the draw, and all 104 games of the FIFA World Cup 26™ LIVE, FREE and EXCLUSIVE on SBS, SBS VICELAND and SBS On Demand .\n\n\n\n",
    "source": "SBS",
    "cluster_id": 33
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/victoria-to-cut-1000-public-sector-jobs-evening-news-bulletin-4-december-2025/eyfh8ij6u",
    "title": "Victoria to cut 1000 public sector jobs | Evening News Bulletin 4 December 2025",
    "publish_date": "Thu, 4 Dec 2025 04:57:48 +0000",
    "category": "finance",
    "authors": [],
    "text": "Key Points Victoria to cut one thousand public sector jobs to save $4 billion\n\nUN chief calls for calm over US Venezuela military tensions\n\nArsenal reclaims lead on English Premier League table\n\nListen to Australian and world news, and follow trending topics with SBS News Podcasts .\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nThe Victorian Government has announced it will cut more than 1,000 public sector jobs, including more than 300 executive positions, in a move expected to save $4 billion.\n\n\n\n\n\nThe changes come in response to recommendations from a review by a former top bureaucrat, who suggested the government slash more than 2,000 jobs.\n\n\n\n\n\nPremier Jacinta Allan says Victorians are watching every dollar in their budgets and expect the state government to do the same.\n\n\n\n\n\n\"These are savings that means that we can continue to deliver those frontline services that matter most to Victorian people. Now, there's a range of saving measures that have been outlined in the in the materials before you. They've been focused around looking at cutting the senior executive numbers in the Victorian public sector, looking at how we can further reduce expenditure on consultants and labor hire, reducing also to office accommodation.\"\n\n\n\n---\n\n\n\n\n\nThe opposition has accused Home Affairs Minister Tony Burke of misleading the public over what role the government played in repatriating a small number of so-called ISIS brides.\n\n\n\n\n\nThey say handwritten notes revealed through Senate Estimates demonstrate direct involvement in repatriating children and women whose partners fought for ISIS in Syria.\n\n\n\n\n\nWhile Minister Burke did meet with representatives from Save the Children, he says the government refused their requests to repatriate people from refugee camps.\n\n\n\n\n\nShadow Home Affairs Minister Jonno Duniam says the documents tell a different story.\n\n\n\n\n\n\"The fact that secret meetings were held with no public officials, that redacted documents have been released, that Tony Burke directly expressed a commitment to assist, completely destroys their argument that they weren't involved. So Tony Burke needs to come out, he needs to tell us today exactly what involvement the government has, draw a line under this forever. Furthermore, the Prime Minister says that the reports were inaccurate the government was in any way involved in bringing ISIS brides back to Australia. Either he was lied to by his minister or he's in on this deceit of the Australian people.\"\n\n\n\n---\n\n\n\n\n\n[[WARNING: This story contains distressing information of alleged child sex offences.]]\n\n\n\n\n\nVictoria police have charged alleged Melbourne childcare sex offender, Joshua Dale Brown, with more than 80 new charges, related to four additional victims.\n\n\n\n\n\nThe charges include six counts of penetrating a child under 12, eight counts of producing child abuse material and 23 counts of using a carriage service to transmit child abuse material.\n\n\n\n\n\nPolice say the families of the alleged four new victims identified have been notified and are being provided with the support needed.\n\n\n\n\n\nEarlier in the year, the 27-year-old - who worked at more than 20 centres - was charged with 70 offences, including sexually abusing eight children under the age of two.\n\n\n\n\n\nBrown is accused of abusing children between April 2022 and January 2023 in Point Cook, a suburb in southwest Melbourne.\n\n\n\n\n\nFor support and advice regarding child sexual abuse, Bravehearts has a free call service on 1800 272 831.\n\n\n\n---\n\n\n\n\n\nIn the United States, a group of Democratic and Republican senators have filed a resolution that would block U-S military action against Venezuela without approval from Congress.\n\n\n\n\n\nThe move reflects mounting concern over strikes on alleged drug boats, with the US killing at least 83 people since September in the Caribbean Sea and Pacific Ocean.\n\n\n\n\n\nAs the US amasses military forces in the region, President Donald Trump has openly entertained the idea of an attack on Venezuelan territory.\n\n\n\n\n\nUnited Nations Secretary-General Antonio Guterres says the actions of the U-S are not compatible with international law.\n\n\n\n\n\n\"The UN High Commissioner for Refugees has been clear that international law is not compatible with this kind of strikes, and so my strong appeal is to avoid in the Caribbean, a situation of confrontation that could have much more dramatic consequences than the strikes that are happening at the present moment.\"\n\n\n\n---\n\n\n\n\n\nPrime Minister Anthony Albanese has revealed his end-of-year Spotify wrap - which details his most-listened-to artists on the music streaming service.\n\n\n\n\n\nThe top five includes Taylor Swift, Middle Kids, Beth Gibbons, and Nick Cave and the Bad Seeds - but Arnhem Land band King Stingray topped the list.\n\n\n\n\n\nThe Northern Territory rock group is known for singing in Yolngu Matha, as well as English.\n\n\n\n---\n\n\n\nIn football, Arsenal have beaten Brentford 2-nil, reclaiming their lead on top of the English Premier League table to five points over Manchester City.\n\n\n\n\n\nMikel Merino scored for the second time in four days, leading in the 11th minute.\n\n\n\n\n\nThe lead remained 1-nil until second-half stoppage time, when Bukayo Saka scored the second goal for the Gunners.\n\n\n\n\n\nArsenal's club manager Mikel Arteta spoke after the match about the changes with three players [[Ben White, Noni Madueke and captain Martin Odegaard, and their draw with Chelsea over the weekend.\n\n",
    "source": "SBS",
    "cluster_id": 34
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/opposition-probes-government-spending-midday-news-bulletin-4-december-2025/abd5dt82v",
    "title": "Opposition probes government spending | Midday News Bulletin 4 December 2025",
    "publish_date": "Thu, 4 Dec 2025 00:48:22 +0000",
    "category": "finance",
    "authors": [],
    "text": "Key Points Opposition condemns Albanese government over transparency record\n\nSuper fund reports two thirds of members afraid they can’t retire\n\nLeeds beat Chelsea 3-1 in Premier League\n\nListen to Australian and world news, and follow trending topics with SBS News Podcasts .\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nThe opposition is ramping up its attacks on the federal government, accusing senior ministers of misplaced priorities and a lack of transparency as cost-of-living pressures bite.\n\n\n\n\n\nLeader of the Opposition Sussan Ley today targeted energy policy, ministerial travel and concerns over national security during a fiery press conference.\n\n\n\n\n\nMs Ley singled out Energy Minister Chris Bowen over rising power prices, while also criticising Communications Minister Anika Wells for charging taxpayers almost $100,00 for an overseas trip to New York.\n\n\n\n\n\n\"The wheels are well and truly falling off the Albanese government. Last week, we learned that Chris Bowen is a part time energy minister delivering a part time energy grid. This week, we learnt that Annika Wells is a part time communications minister, but a full-time frequent flyer ... And today, we learn that Tony Burke has held secret meetings about the return of so-called ISIS brides to Australia.\"\n\n\n\n\n\nMs Ley is demanding answers from the Labor government on what senior ministers, including Foreign Minister Penny Wong, knew about the brides, and when, as well as on other matters.\n\n\n\n---\n\n\n\n\n\nNew research reveals nearly two in five Australians fear they will never be able to retire, as housing and living costs continue to rise.\n\n\n\n\n\nAccording to MFS Investment Management, about 38 per cent of superannuation members now share that concern, up from 28 per cent last year.\n\n\n\n\n\nTwo-thirds of survey respondents expect to work longer than planned.\n\n\n\n\n\nHousing has become the top financial worry, overtaking everyday expenses, with inflation close behind.\n\n\n\n\n\nFewer than half of retirees are confident their savings will deliver enough income throughout retirement.\n\n\n\n---\n\n\n\n\n\nTen major social media platforms, Facebook, Instagram, Kick, Reddit, Snapchat, Threads, TikTok, X, YouTube and, most recently, Twitch, will face fines of up to $50 million dollars if they fail to remove accounts belonging to Australians under 16 from the 10th of December.\n\n\n\n\n\nThe eSafety Commissioner will issue notices to all ten platforms on 11 December demanding data on account removals, followed by monthly requests for six months.\n\n\n\n\n\nRegulators say courts could impose the maximum penalty where breaches are systemic or repeated.\n\n\n\n\n\nCommunications Minister Anika Wells says the government expects platforms to implement age checks carefully but firmly.\n\n\n\n\n\n“The government recognises that age assurance may require several days or weeks to complete fairly and accurately … One week from today, this law is starting. Over the coming months, we will fight to defend this law in the High Court because parents right across Australia asked the government to step up.”\n\n\n\n\n\nGoogle says the reform is misguided and that it does not fulfil its promise to make kids safer online.\n\n\n\n---\n\n\n\n\n\nHong Kong’s deadly high-rise fire has claimed at least 159 lives, as police arrest six people suspected of disabling fire alarms during maintenance at the housing complex.\n\n\n\n\n\nVictims ranged from a one-year-old child to a 97-year-old resident.\n\n\n\n\n\nPolice say they have now searched seven of the eight towers engulfed by the blaze, which burned for more than 40 hours, though around 30 people remain unaccounted for.\n\n\n\n\n\nCommissioner of Police Joe Chow says the operation is far from over.\n\n\n\n\n\n“So, this is the interim, but we have not finished our work yet because as you can see the scaffoldings, a lot of bamboos, that they have fallen down. So, we still need to do some work on those bamboos to see any remaining or any bodies were covered by these bamboos.”\n\n\n\n\n\nAuthorities say suspected human remains have been found in several apartments, with DNA testing now underway.\n\n\n\n---\n\n\n\n\n\nFive Palestinians, including two children, have been killed in Israeli airstrikes on Gaza, according to medics at Al-Kuwaiti Hospital in Khan Younis.\n\n\n\n\n\nA tent sheltering displaced people in the southern part of the enclave was among the sites hit.\n\n\n\n\n\nThe Israeli military says the strike targeted a Hamas fighter after what it described as a ceasefire breach, accusing militants of attacking Israeli troops near Rafah and injuring five soldiers.\n\n\n\n\n\nPrime Minister Benjamin Netanyahu has warned Israel will respond to any harm to its forces.\n\n\n\n\n\nGaza's health authorities say 357 Palestinians have been killed over the first 50 days of the ceasefire, while Israeli authorities say three Israeli soldiers have been killed in the same period.\n\n\n\n---\n\n\n\n\n\nTo sport and in football, Chelsea's Premier League title hopes have suffered a major setback, with a humbling 3-1 defeat at Leeds United which lifted the hosts out of the bottom three.\n\n\n\n\n\nAn attacking start from Leeds was rewarded with a sixth minute goal when Jaka Bijol powered in a header from the corner and the home side doubled their lead, with Ao Tanaka scoring a stunner two minutes before halftime.\n\n\n\n\n\nChelsea pulled one back five minutes after the break, through substitute Pedro Neto, but their comeback attempt was ended when a mistake at the back gave Leeds a third goal in the 72nd minute, with Dominic Calvert-Lewin wrapping up the win.\n\n\n\n\n\nChelsea coach Enzo Maresca says Leeds were impressive opponents.\n\n\n\n\n\n\"I think they were better than us in all the aspects, they deserved to win the game. There is nothing that we can take from this game. The only thing we can do is try to understand the mistake we have done, try to reset, because again in 48 hours we have one more game.\"\n\n\n\n",
    "source": "SBS",
    "cluster_id": 35
  },
  {
    "url": "https://www.sbs.com.au/news/article/australia-pledges-95-million-dollars-to-ukraine/izr0k8q0h",
    "title": "Australia's 'mateship' package for Ukraine praised but questions remain on sanctions",
    "publish_date": "Thu, 4 Dec 2025 00:34:56 +0000",
    "category": "finance",
    "authors": [],
    "text": "Australia's latest sanctions on Russia's \"shadow fleet\" are symbolic and still fall short of measures imposed by the European Union and the United Kingdom, an expert says, despite praise from Ukraine's ambassador.\n\n\n\n\n\nThe $95 million aid package brings Australia's total support of Ukraine to $1.7 billion since Russia's full-scale invasion in 2022, Defence Minister Richard Marles and Foreign Minister Penny Wong said in a joint statement on Thursday.\n\n\n\n\n\nThe ministers also announced targeted sanctions on an additional 45 Russian \"shadow fleet\" vessels — tankers used to carry Russian crude oil to countries such as India and China, where it is refined and sold on to markets including Australia.\n\n\n\n\n\nThe addition of 45 new vessels brings the total number of sanctioned shadow fleet ships to 200, according to Thursday's joint statement.\n\n\n\n\n\nAn SBS investigation in October revealed that , at that time, at least 25 of these vessels remained in the supply chains of Australian companies.\n\n\n\nCall for more action on indirect oil imports\n\nWong said the latest sanctions were \"part of a coordinated effort to starve Russia's oil revenues and limit its ability to finance its invasion\".\n\n\n\n\n\nHowever, Anton Moiseienko, a senior law lecturer at the Australian National University, told SBS News the sanctions would not meaningfully restrict Russia's oil revenue.\n\n\n\n\n\nWhile Wong highlighted that \"direct Australian imports of Russian energy products have fallen from $80 million before Russia's invasion to zero\", Moiseienko said direct imports were only one part of a much bigger picture.\n\n\n\nLISTEN TO 'Shadow fleet' still appearing in Australian supply chains despite sanctions, research finds SBS News 03:49 English\n\nUnlike the EU and UK, Australia has not banned indirect purchases, and until similar restrictions were adopted, Moiseienko said its actions would remain \"largely symbolic\".\n\n\n\n\n\n\"Australia is in a very uncomfortable position of being one of the major holdouts in relation to [imposing] those sanctions,\" he said.\n\n\n\n\n\nUkraine's ambassador to Australia, Vasyl Myroshnychenko, said that, while the additional shadow fleet sanctions were welcome, more needed to be done — including restrictions on companies or countries that still enable Russia to sell its oil.\n\n\n\n\n\n\"If we can limit the ability of Russia to make money out of [oil and gas], we will be able to starve their economy and deprive them an opportunity to produce more weapons to kill Ukrainians,\" he told SBS News.\n\n\n\nGreens defence spokesperson David Shoebridge called on the federal government to implement further sanctions on Russian oil imports.\n\n\n\n\n\n\"Australia needs to make it clear, no oil that is sourced in Russia, whether it's washed through a refinery in India or not, can be sold into Australia,\" he said.\n\n\n\nUkraine ambassador praises 'true act of mateship'\n\nIn Thursday's joint statement, Marles said Australia was \"unwavering in its support for Ukraine\".\n\n\n\n\n\n\"These commitments will make a tangible difference in Ukraine's defence against Russia's illegal and immoral invasion,\" he said.\n\n\n\n\n\nThose comments were echoed by Myroshnychenko, who said the federal government's package was a \"tangible contribution\" to his nation's war effort.\n\n\n\n\n\nHe thanked Marles and Wong, telling SBS News the latest package was a \"true act of mateship\".\n\n\n\n\"Australia remains the largest ... military contributor ... outside of NATO, for which we are grateful,\" he told SBS News.\n\n\n\n\n\nHe said funds from the package would be used to procure ammunition and missiles from the United States, which would save Ukrainian lives.\n\n\n\n\n\nOf the $95 million announced on Thursday, $50 million will go towards the Prioritised Ukraine Requirements List, a North Atlantic Treaty Organization (NATO) initiative to supply Ukraine with critical military equipment.\n\n\n\n\n\nAustralian Defence Force supplies and weapons worth $43 million will also be donated, including tactical air defence radars, munitions and combat engineering equipment.\n\n\n\nREAD MORE The challengers to Australia's sanctions against Russia\n\nAn extra $2 million will be provided to help Ukraine with advanced drone technologies.\n\n\n\n\n\nAustralia has also imposed targeted financial sanctions and travel bans on more than 1,180 people and 293 entities.\n\n\n\n\n\nThe Coalition welcomed the latest support package but said it was \"long overdue\" and a \"drop in the ocean\" compared to Australia's $56 billion defence budget.\n\n\n\n\n\nTreasurer Jim Chalmers said military support for Ukraine was about supporting the \"brave Ukrainian people\" to stand up against \"unacceptable Russian brutality and aggression\".\n\n\n\n\n\n\"The end of this war can't come soon enough, but it needs to be a lasting peace that does justice to the courage that the Ukrainians have shown,\" he told ABC RN on Thursday morning.\n\n\n\nREAD MORE US and Russia fail to reach compromise on Ukraine following talks at the Kremlin\n\nThe announcement comes during another round of peace talks aimed at ending the war.\n\n\n\n\n\nHowever, the path ahead for Ukraine peace talks is unclear, US president Donald Trump said on Wednesday, after what he previously described as \"reasonably good\" talks between Russian President Vladimir Putin and US envoys.\n\n\n\n\n\nA meeting between the White House and Ukrainian officials is scheduled for Thursday.\n\n\n\n\n\n— Additional reporting by the Australian Associated Press.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 36
  },
  {
    "url": "https://www.sbs.com.au/news/article/how-much-do-you-need-to-retire/1j5iabxnv",
    "title": "How much super will you need? The new figure to retire comfortably",
    "publish_date": "Wed, 3 Dec 2025 22:37:45 +0000",
    "category": "finance",
    "authors": [],
    "text": "The cost of a comfortable retirement is higher than it's ever been, according to the Association of Superannuation Funds of Australia (ASFA).\n\n\n\n\n\nThe peak body's CEO, Mary Delahunty, said, fortunately, the average balance of superannuation accounts has also risen to a record high.\n\n\n\n\n\nThe average balance is sitting at $172,834 for nearly 18 million superannuation account holders over the age of 15. For those aged 65 to 69, the average balance is around $420,934.\n\n\n\n\n\n\"More Australians than ever before are reaching retirement with meaningful super behind them,\" she said.\n\n\n\n\n\nBut it might not feel that way to many Australians.\n\n\n\nWith the eye-watering cost of living putting pressure on families and economic uncertainty overseas making Australians anxious , two new guides have outlined how much you need to support your retirement.\n\n\n\nSo how much will you need?\n\nThere are many factors that influence how much money you'll need, such as age pension eligibility, whether you own your home, and your living situation.\n\n\n\n\n\nMost calculations consider a more modest budget option versus a more comfortable lifestyle, including things like overseas travel and subscriptions to streaming services.\n\n\n\n\n\nAccording to ASFA, coupled homeowners 65 and over will need $76,505 each year to live comfortably in retirement.\n\n\n\n\n\nA single person will need around $54,240 each year.\n\n\n\nAccording to ASFA, coupled homeowners 65 and over will need $76,505 each year to live comfortably in retirement, while a single person will need around $54,240 each year. Source: SBS News That's an increase of 3.5 per cent and 3.6 per cent respectively compared to this time last year, and it's directly connected to the rising cost of living.\n\n\n\n\n\nThe group estimated retirees over 85 who own their home would need less money, offering about $71,104 as a guide for a couple and $47,534 for a single person.\n\n\n\n\n\nA separate estimate from Super Consumers Australia, a group that advocates for lower- and middle-income super consumers, suggests that a typical single homeowner will need around $322,000 in superannuation for a comfortable retirement.\n\n\n\n\n\nCouples will need a combined $432,000.\n\n\n\nSource: SBS News In contrast, for those living a 'modest lifestyle', the estimated annual budget was approximately $20,000 lower, as they typically spend less on health insurance, cars, and take fewer holidays, among other expenses.\n\n\n\n\n\nExperts say it may take even less in superannuation to have a secure retirement, especially if you own your own home.\n\n\n\n\n\nJoey Moloney, the deputy director of the housing and economic security program at the Grattan Institute, previously told SBS News the real cost of retirement could be even lower, as retirees typically spend less once they stop working.\n\n\n\n\n\n\"When you look at people's spending habits from pre-retirement to post-retirement, what you see is that people spend less in retirement and increasingly so as retirement goes on,\" he said.\n\n\n\n\n\n\"Pensioners benefit from a bunch of discounts on council rates, electricity, medicines and other benefits that add up to an implicit income of thousands of dollars a year.\"\n\n\n\nWhere have prices risen most?\n\nWith the consumer price index rising in the September quarter to 1.3 per cent , and a 3.2 per cent increase over the past year, more people are spending money on daily essentials.\n\n\n\n\n\nIn the September quarter alone, electricity prices have risen by 9 per cent.\n\n\n\n\n\nOver the past twelve months, the increase is closer to 25 per cent.\n\n\n\n\n\nMeanwhile, the cost of eating out has risen by around 1.3 per cent, while those staying in are paying 9.3 per cent more for media services.\n\n\n\nDelahunty said the holidays will be a challenging time for many retirees because prices have risen fastest in the things they spend most on, like \"food, energy and health\".\n\n\n\n\n\n\"Some older people may cut back on pricier gifts, travel and social occasions to stay on top of the basics,\" she said.\n\n\n\n\n\nShe pointed to recent reforms, including the move to 12 per cent super and Payday Super , that could give people more security over their retirement savings.\n\n\n\n\n\n\"The challenge now is to keep strengthening the system so every Australian has the best possible chance of a comfortable, dignified retirement, not just at Christmas but all year round.\"\n\n\n\n\n\nThe information in this article is general in nature and is not intended as financial advice. You should consult with a licensed professional to make the decisions that are right for you.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 37
  },
  {
    "url": "https://www.theage.com.au/sport/golf/scott-opens-with-a-birdie-20251205-p5nl73.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Scott opens with a birdie",
    "publish_date": "Fri, 05 Dec 2025 12:44:28 +1100",
    "category": "finance",
    "authors": [],
    "text": "Scott opens with a birdie\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 17
  },
  {
    "url": "https://www.theage.com.au/business/companies/fashion-maven-fills-the-age-s-former-collins-st-home-with-tenants-20251204-p5nkvv.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Fashion maven fills The Age’s former Collins St home with tenants",
    "publish_date": "Fri, 05 Dec 2025 12:41:05 +1100",
    "category": "finance",
    "authors": [
      "Nicole Lindsay"
    ],
    "text": "Hospitality hotspot The slump in CBD property values is yielding a new buyer breed: hospitality operators taking a punt on buying their premises instead of leasing – and it’s not just at the high-end where Chris Lucas, Justin Hemmes and the O’Brien Group have paid top dollar for well-placed venues. This week, an owner-operator bought 171 Bourke Street for $3.88 million and has plans to open a new Asian fusion restaurant in mid-2026. The building is near the corner of the Bourke and Russell streets intersection which looks poised for a comeback with a new pub and hotel bar pulling in the punters. A swag of luxury hotels and fine dining nearby is also helping drive the renaissance. 171 Bourke Street has a new owner-occupier.\n\nThe deal was negotiated by Colliers’ Matt Stagg and Yvonne Zhou. Down the other end of town, a Sydney investor has paid $3 million for the Grain Store cafe at Shop 2 of 517 Flinders Lane. The deal reflected a building rate of $15,000-a-square-metre and a yield of 5.7 per cent. A Sydney investor has bought the Grain Store at 517 Flinders Lane. Grain Store, which opened in 2013, committed to a further 10-year lease in April 2023. Jones Real Estate’s Luke Peric did the deal.\n\nThe west end precinct also has its share of new attractions, notably Sand Hill Road’s new seven-level Waterside Hotel. Natural therapy The buyers of Fitzroy’s Southern School for Natural Therapies emerged this week after applying for development permits. A joint venture between B&B Property Group’s Stephen and Ben Buxton, and PACASA’s Stefano Paciocco has acquired 25-37 Victoria Street for a price believed to be about $20 million. The sale was negotiated by Colliers agents Matt Stagg, Ryan Milivojac, Ben Baines and Yvonne Zhou. Peter Smyth from Untitled Property represented the Jacka Foundation who bought the property for $1.53 million in 1996.\n\nThe joint venture has a caveat over the buildings – part of which is the 1889 Acme Shirt Factory – and applied for an eight-storey 60-unit project through the State Government’s Development Facilitation Program. 25-37 Victoria Street, Fitzroy Paciocco is a former development manager at Stephen Buxton’s first property business Hamton Property Group – Hamton’s first project is nearby, on the corner of Fitzroy Street. The plans drawn up by DKO Architecture include restoring the original shirt factory frontage and building behind and above it. The Buxton family, multi-generational property players, also have a foothold on the old swimsuit shop at 430-444 Brunswick Street and 224-228 Smith Street through Valli, which is backed by MAB founder Andrew Buxton.\n\nAll roads Fresh from the landmark completion of its Bourke Street Mall Mecca project, fund manager Newmark Capital is going back to basics. It’s purchased the VicRoads Testing & Inspection Centre in Ballarat for $8.975 million on a 7 per cent yield for the Newmark Property Income Fund. VicRoads at 86-88 Learmonth Road, Wendouree. While that yield might seem on the high side, the lease has just four years left to run with two-year options.\n\nThe building at 86-88 Learmonth Road, Wendouree, purpose built for VicRoads in 2001, is zoned for public use, which limits it to government-related activities. It’s on 8485 square metres of land and returns $628,000 a year. CBRE’s Scott Hawthorne and George Wilkinson handled the transaction which drew six offers from local and interstate investors. Records show the vendor was the local Edward family. Deals done The year is ending with a bang at the retail end of the market with a swag of competitive deals struck on sharp yields. The sale of a tiny vacant shop at 416 Toorak Road set the sharpest yield of the lot – just 2.5 per cent from a $2.7 million deal.\n\nThe 150-square-metre shop is on 196 square metres of land opposite the Trak Centre and Vicland’s St Germain project, and is a few doors away from Orchard Piper’s recently completed project. 416 Toorak Road, Toorak. In East Burwood, 19 bidders registered for the auction of the KFC building at 123-125 Burwood Highway last week, with the buyer paying $5.83 million, reflecting a 3.3 per cent yield on a gross lease. The deal was one of six properties worth a total of $50 million sold by Stonebridge Property Group in the past 10 days. The Red Rooster Wodonga drew seven bidders and sold for $3.35 million on a 5 per cent yield. Stonebridge’s Kevin Tong, who did the deals with Rorey James, said the depth in the buyer pool – all 26 registered parties for both auctions demonstrated an intention to buy – indicated a strong sign of market confidence.\n\nThe team also sold the Pakenham BP and KFC servo for $14 million on a 5.61 per cent yield. The crowd at the auction of the East Burwood KFC. A Sydney buyer has paid $6.41 million for China state-owned Sinopec’s first Australian servo on a 5.81 per cent yield. Cushman & Wakefield’s George Davies, who handled the negotiations with Oliver Hay, Raphael Favas and Leon Ma, said five offers were made for the property. The servo at 325A Nepean Highway, Frankston was developed and sold by Jasbe.\n\nIn Ringwood, a strata property at 5-6/74-82 Maroondah Highway occupied by a Club Lime gym, sold under the hammer for $5.9 million. Four bidders competed for the 1288-square-metre open-plan showroom with a local investor out muscling competition from around Melbourne and Australia. Fitzroys’ Ben Liu and Chris James and Gross Waddell ICR’s Glenn Ye and Danny Clark ran the auction. Club Lime, owned by ASX-listed Viva Leisure – Australia’s second-largest fitness network – has a new 10-year lease. The price reflected a tight 5.7 per cent yield. Season Greetings",
    "source": "TheAge",
    "cluster_id": 18
  },
  {
    "url": "https://www.theage.com.au/politics/victoria/skinny-surplus-still-on-track-despite-greater-government-spending-20251205-p5nl4j.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Skinny surplus still on track despite greater government spending",
    "publish_date": "Fri, 05 Dec 2025 12:40:54 +1100",
    "category": "finance",
    "authors": [
      "Chip Le Grand",
      "Kieran Rooney"
    ],
    "text": "The Victorian government remains on track to deliver its first operating surplus since the pandemic, with the release of its mid-year budget update showing an unexpected $1.5 billion in additional revenue in the state’s finances.\n\nHowever, the Allan government has again shown no signs of reining in spending, with recurrent government expenses now projected to reach $109 billion this year, up from the $107.7 billion forecast when the budget was handed down in May.\n\nVictorian Treasurer Jaclyn Symes. Credit: Getty\n\nThe government wages bill – a focus of the Silver review of the public service released on Thursday – also continues to climb, with employee expenses forecast to top $39 billion.\n\nThe budget update reveals that investment property owners have been given an unannounced Christmas gift. They had been expecting a $139 increase in the deeply unpopular Emergency Services and Volunteers Fund next year, but will now be spared the additional impost until after the November state election.",
    "source": "TheAge",
    "cluster_id": 19
  },
  {
    "url": "https://www.theage.com.au/national/nsw/sydney-s-three-metro-rail-projects-blow-out-by-more-than-6-billion-20251205-p5nl59.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Sydney’s three metro rail projects blow out by more than $6 billion",
    "publish_date": "Fri, 05 Dec 2025 12:38:23 +1100",
    "category": "finance",
    "authors": [
      "Matt O'Sullivan",
      "Ellie Busby"
    ],
    "text": "The cost of Sydney’s three metro rail projects has blown out by more than $6 billion due to disputes with contractors, skyrocketing construction expenses and design and scope changes, which the Minns government has attempted to blame on its Coalition predecessors.\n\nAs foreshadowed by the Herald, the Minns government has confirmed that its signature rail project, Metro West, is now estimated to cost between $27 and $29 billion to complete by its targeted opening date of 2032. The 24-kilometre line will extend from the Sydney CBD to Westmead.\n\nThe Metro West rail line between central Sydney and Parramatta is now forecast to cost up to $29 billion. Credit: Janie Barrett\n\nThe government also confirmed reports by this masthead that legal claims made by the private consortium building the metro line to Western Sydney Airport might raise the project’s total price tag by more than $1 billion to more than $12 billion.\n\nThe project is already set to open 12 months late in December 2027, a year after the first flights are expected to take off from the new international airport.",
    "source": "TheAge",
    "cluster_id": 20
  },
  {
    "url": "https://www.theage.com.au/politics/federal/the-latest-illustrations-from-artist-matt-golding-20230608-p5df5o.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "The latest illustrations from artist Matt Golding",
    "publish_date": "Fri, 05 Dec 2025 12:32:18 +1100",
    "category": "entertainment",
    "authors": [],
    "text": "The latest illustrations from artist Matt Golding\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 21
  },
  {
    "url": "https://www.theage.com.au/sport/kenyan-obliterates-womens-marathon-world-record-20251205-p5nl6x.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Kenyan obliterates women's marathon world record",
    "publish_date": "Fri, 05 Dec 2025 12:30:26 +1100",
    "category": "sports",
    "authors": [],
    "text": "Kenyan obliterates women's marathon world record\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 22
  },
  {
    "url": "https://www.theage.com.au/national/nsw/fears-cracked-pipe-causing-sewerage-leak-could-flow-into-sydney-harbour-20251205-p5nl47.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Fears cracked pipe causing sewage leak could flow into Sydney Harbour",
    "publish_date": "Fri, 05 Dec 2025 12:15:04 +1100",
    "category": "finance",
    "authors": [
      "Cindy Yin"
    ],
    "text": "A cracked underground pipe in Pyrmont has created a significant leak, which in the worst-case scenario could result in sewage flowing into Sydney Harbour.\n\nA leak in one of the main sewerage pipes running eight to nine metres underground in Pyrmont was identified weeks ago. While the leak has been contained, significant emergency works are under way at the nearby Wentworth Park in Glebe to divert the flow away from the leaking pipe.\n\nWorkers at Wentworth Park on Friday morning. Credit: Sam Mooy\n\nNSW water minister Rose Jackson said while it had a low likelihood of happening, the “worst-case scenario” could see leaked sewage flowing into the harbour.\n\n“That’s why we’re working so hard to get this fixed now because, in that worst-case scenario where there is sewerage flowing into the harbour, we would do everything we could to manage that,” Jackson said on Friday.",
    "source": "TheAge",
    "cluster_id": 23
  },
  {
    "url": "https://www.theage.com.au/national/tubbys-blunt-call-on-lyon-axing-20251205-p5nl6i.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Tubby's blunt call on Lyon axing",
    "publish_date": "Fri, 05 Dec 2025 12:10:19 +1100",
    "category": "finance",
    "authors": [],
    "text": "Tubby's blunt call on Lyon axing\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 24
  },
  {
    "url": "https://www.theage.com.au/goodfood/recipes/pistachio-amaretti-20251205-p5nl6a.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Pistachio amaretti",
    "publish_date": "Fri, 05 Dec 2025 12:08:45 +1100",
    "category": "finance",
    "authors": [
      "Julia Busuttil Nishimura"
    ],
    "text": "Decorate the biscuits with halved pistachios (pictured) or amarena cherries. William Meppem\n\nThese soft and chewy pistachio amaretti are so festive and make for a wonderful offering during the holiday period when visitors are coming and going. They’re fragrant with citrus and have a beautiful green hue.\n\nThey’re wonderful plain, but I like to top them with half a pistachio kernel or, sometimes, half an amarena cherry.\n\nIf you don’t have pistachios, you can just use more almond meal to make\n\nregular almond amaretti.",
    "source": "TheAge",
    "cluster_id": 25
  },
  {
    "url": "https://www.theage.com.au/business/companies/the-curse-of-rupert-lachlan-murdoch-has-a-long-way-to-go-to-match-his-dad-20251205-p5nl33.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "The curse of Rupert: Lachlan Murdoch has a long way to go to match his dad",
    "publish_date": "Fri, 05 Dec 2025 12:01:29 +1100",
    "category": "finance",
    "authors": [
      "Colin Kruger"
    ],
    "text": "Lachlan Murdoch, victorious heir to the family’s global media empire, celebrated the end of a tumultuous year at his Sydney Harbour mansion Thursday evening with a guest list that few social events in Australia could match.\n\nThe rich, powerful and famous trekked up the driveway of his humble home – “Le Manoir”, the former French consulate in Bellevue Hill – to one of the most closely watched gatherings on the social calendar.\n\nLachlan Murdoch has an uphill battle on his hands. Credit: Jamie Brown\n\nAttendees included Sydney’s sports czar Peter V’landys, AFL boss Andrew Dillon and his NRL counterpart Andrew Abdo, along with members of the News Corp-owned NRL premiers Brisbane Broncos: coach Michael Maguire and chief executive Dave Donaghy.\n\nFormer AFL boss and high-flying Tabcorp chief executive Gillon McLachlan led the stream of corporate talent, which included Commonwealth Bank boss Matt Comyn and SGH boss Ryan Stokes – another corporate titan and billionaire-heir like Lachlan.",
    "source": "TheAge",
    "cluster_id": 26
  },
  {
    "url": "https://www.theage.com.au/technology/facial-age-verification-can-it-be-fooled-and-how-safe-is-it-20251204-p5nkss.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Facial age verification: Can it be fooled and how safe is it?",
    "publish_date": "Fri, 05 Dec 2025 11:53:43 +1100",
    "category": "finance",
    "authors": [
      "Tim Biggs"
    ],
    "text": "So, some form of age inference is already being applied to all social media accounts, even when there’s no legal requirement. That might mean inferring your age from photos you post, messages you send or subjects you’re interested in. It’s not exactly precise, but if the estimate on your account is 40-45 then the platform might be satisfied and won’t ask you to verify your age for the purposes of the new laws. If it’s 20-25 though, it may. Loading The eSafety commissioner has recommended companies take a “waterfall” approach to this problem, borrowing industry jargon to mean starting with the method that interrupts users the least and then escalating from there as necessary. So theoretically, the company could first check to see if it’s already very confident a user is over 16, without the user even knowing. The next option might be an instant background check, which would require the platform to use an identity service. VerifyMy, which supplies services like these to companies complying with US and European laws, says it can verify the vast majority of adults over 18 very quickly using only their email address, deleting all the information afterwards. The social media companies already have your email address, so you would likely be asked to consent to the check, and the identity company would then search through financial records and the like to see if your email address shows up. If you’ve ever taken out a loan or paid for utilities, it probably will. If the methods that can happen automatically in the background fail, the next step would likely involve the user supplying a short video of themselves. Which is where visual facial age estimation comes in.\n\nThe video selfie It’s important to note that since the government isn’t requiring social media companies to use any specific technology or service, we can’t say exactly what the process will be for each app. But in this hypothetical waterfall scenario I’m describing — based on the eSafety’s guidelines and the way things have worked with age restriction regulations overseas — I’ll describe the facial age technology provided by Yoti, a British company that Meta uses for identity services. It currently processes more than a million age checks per day, thanks to laws restricting access to adult services and the purchasing of certain goods in the US and Europe. If the platform hasn’t been able to verify that you’re 16 or over with the above methods, it may open up a facial age estimation window powered by Yoti’s technology. This doesn’t require you to download an app or go anywhere outside of the platform, and it works with whatever camera is attached to the device you have. Prompts guide you through capturing a photo of your face, while Yoti’s processes attempt to confirm it is a living face rather than a photo or some other image. Once the data is captured, the system analyses it and guesses your age, with the pass or fail transmitted to the social media platform. Yoti says this takes less than a second. Importantly, it’s not using your facial data to make any assumptions about you other than your age. It’s not trying to identify you, and it doesn’t pass anything on to the social media platform except whether you passed or failed. Yoti says that its selfie age assurance works to within one year of accuracy, and equally well across genders and skin tones. So anyone over 17 should pass.\n\nSo, will kids be able to break into social media using their parents’ faces, as several have already boasted of doing online? Of course they will. Facial age estimation platforms are designed only to guess the age of a face, not to identify the person the face belongs to, or ensure it’s the same person using a social media account. Yoti makes big claims about its ability to tell a living face from a photo or recording, but other platforms may not be as strong. But this isn’t to say that getting around the ban will be easy. The underage user will likely need access to a willing adult accomplice, and all the platform’s other analytics will still be sounding the alarm. If you recently changed your birthdate to make yourself 16 instead of 13, then passed a facial age estimation check, then continued to engage with the platform in a way that’s consistent with a 13-year-old, the apps will take note. You might not get booted right away, but if eSafety is upset that too many underage users are still on the platform, they’ll know who to re-verify. Loading Where else things could come apart At this point in the waterfall hypothetical, the huge majority of Australians who are legitimately over 16 have been allowed onto the platform, either because the app already knows they’re an adult, or because of a background check or facial age estimation. The remainder can fit generally into three groups; those who are under 16, those who are under 17 (remember Yoti’s technology is accurate to within one year), and those who are an absolute edge case in both not having an active email address and appearing significantly younger than they are. Photo IDs are the next least intrusive option.\n\nFor the edge cases, the process should go smoothly and (if the platform is following best practices and eSafety’s guidance) would not require them to give a scan of their ID to a company that’s going to misuse it or store it improperly. An identity service would capture a video of the user holding their ID, checking the details against government records while also matching the face on the document, subsequently informing the platform of a pass or fail and deleting all the data. The big problem for users between 16 and 17 is that if they don’t have a learner’s permit or passport they likely don’t have a useable photo ID. Some states have alternative documents and there are burgeoning digital ID systems that let you prove your age through other documents and then provide a token to the platform, but users will be at the mercy of social media platforms and identity services in terms of which of these are supported. Users who are actually under 16 and are determined to defeat the verification system would likely do so in this step of the waterfall, assuming they couldn’t find a compliant adult to help in the previous one of the waterfall or the previous one. They could procure the genuine photo ID of a person who looks like them, for example their parent or sibling, and hope to get through. Since the verification happens through the identity company and not the social media platform, the ID would not be compared against any photos a user posts. Loading This is all based on speculation of how the system will ideally work, but there are other potential issues. What happens when a small under-resourced or inexperienced social media company tries to comply and ends up with user data it really doesn’t need to have? What about when crooks start making fake pages that look like verification screenings and ask people to send pictures of their passports? What if it’s so easy for underage users to side-step the checks that social media companies need to employ more intrusive methods?",
    "source": "TheAge",
    "cluster_id": 27
  },
  {
    "url": "https://au.news.yahoo.com/cost-of-aussie-dinner-table-staple-set-to-soar-after-fishing-ban-along-900km-of-aussie-coastline-014701643.html",
    "title": "Cost of Aussie dinner table staple set to soar after fishing ban along 900km of Aussie coastline",
    "publish_date": "2025-12-05T01:47:01Z",
    "category": "finance",
    "authors": [],
    "text": "You'll likely pay more for a fish meal at a restaurant or fish and chips shop this summer after a fishing ban affecting 900 kilometres of Australian coastline was announced this week. The ban is a desperate bid to replenish levels of demersal fish along the Western Australian coast, with species like pink snapper and dhufish under severe threat of extinction.\n\nA 21-month ban will commence on January 1 and will apply to commercial fishing for demersal species in the West Coast Zone which stretches from Kalbarri in the north to Augusta in the southwest.\n\nRecreational fishing in the zone will continue to be banned until spring 2027.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nCharter fishing in the Perth metropolitan area will be closed from 16 December 2025, however, charter fishing for demersals under the tag system will continue in the remainder of the West Coast Zone under a reduced annual catch limit of 25 tonnes.\n\nThe fishing ban across 900 kilometres of WA coastline will likely increase the cost of beachside fish and chips this summer. Source: Getty\n\nHow will fresh fish supplies be affected in Western Australia?\n\nAuthorities have copped major backlash over the decision, with many in the National Party, such as MP Lachlan Hunter, claiming \"people are losing their livelihoods\" because of it, according to Perth Now.\n\nFish shop owners and seafood restaurants are wondering how they can serve their customers, with some admitting the decision will lead to more reliance on imported fish.\n\nColin Cox, who has been serving fresh local fish to Geraldton diners for over 30 years, says fresh fish is going to be hard to find.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nFish he has been serving at his popular Skeetas restaurant, such as dhufish, just won't be available.\n\n\"Geraldton is known for fresh fish, fresh crayfish, we're a fishing community, now we can't buy fresh fish in Geraldton or the Midwest,\" Cox told the ABC.\n\nWA Premier Roger Cook stands by fishing ban\n\nWestern Australia Premier Roger Cook stood firm on the decision.\n\n\"These are difficult decisions to make, but they are the right thing to do. We want our kids and grandkids to be able to enjoy fishing in our beautiful state into the future,\" Cook said.\n\n\"We know that these reforms will have a large impact on the fishing industry and sectors, and we have been working with them closely throughout this decision-making process... We need to take urgent action to save them for the future generations of fishers.\"\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nFisheries Minister Jackie Jarvis said \"there will be less fish in the market for a number of years\" but the ban was \"the right thing to do\" in order to protect marine life.\n\nDo you have a story about the WA fishing ban? Contact sophie.coghill@yahooinc.com\n\n$29m support fund to be dished out amid fishing ban\n\nThe Cook government confirmed it will be providing a $29.2 million Fisheries Support Package to help those likely impacted by the reforms.\n\n$3.3 million will be for tackle shop rebates to encourage fishing for species not under threat.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nThe latest stock assessments across the coastline in question show the fishing pressure on a number of demersal species is too high, according to the state's Department of Primary Industries and Regional Development’s (DPIRD).\n\n\"We know strong management does work to recover fisheries, and the Gascoyne oceanic pink snapper fishery is a great example,\" Nathan Harrison, DPIRD Fisheries and Aquaculture Executive Director, said.\n\n\"Thanks to a recovery plan which significantly reduced fishing quotas and introduced spawning closures, we have been able to rebuild the stock.\n\n\"To safeguard the future of these highly valued demersal species along the entire WA coast, further management action is required.\"\n\nDo you have a story tip? Email: newsroomau@yahoonews.com.\n\nYou can also follow us on Facebook, Instagram, TikTok, Twitter and YouTube.",
    "source": "Yahoo",
    "cluster_id": 38
  }
]