[
    {
        "url": "https://www.9news.com.au/national/more-than-18000-hyundai-cars-recalled-over-manufacturing-defect/39cbb213-f8e6-460d-85c5-36c44722f357",
        "title": "More than 18,000 Hyundai cars recalled over manufacturing defect",
        "publish_date": "Tue, 02 Sep 2025 01:00:00 +0000",
        "category": "finance",
        "authors": [
            "Sep"
        ],
        "text": "More than 18,000 Hyundai cars are ﻿being recalled due to a manufacturing defect.\n\nThe recall is for the i30 PD model from 2020 to 2021.\n\n\"Due to a manufacturing defect, the fuel pump impeller may become deformed under certain environmental conditions, interrupting the fuel supply,\" the recall notice said.\n\nMore than 18,000 Hyundai cars are ﻿being recalled due to a manufacturing defect.The recall is for the i30 PD model from 2020 to 2021. (Supplied)\n\n\"If this occurs, the engine could stall, resulting in a sudden loss of motive power.\n\n\"A sudden loss of motive power while driving may increase the risk of an accident causing injury or death to vehicle occupants and/or other road users.\"\n\nHyundai Australia will contact affected car owners in writing, asking them to schedule an appointment to have the fuel pump impeller inspected and replaced free of charge.﻿\n\nA list of vehicle identification numbers of the affected cars is available on the Department of Transport website .\n\nFor more information, call the Hyundai customer care team on 1800 186 306.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/health/australia-spring-thunderstorm-asthma-weather/419aa934-dd68-4efe-b26f-d8af89060678",
        "title": "Risk of 'thunderstorm asthma' increases ahead of wet spring",
        "publish_date": "Tue, 02 Sep 2025 01:05:17 +0000",
        "category": "lifestyle",
        "authors": [
            "Sep"
        ],
        "text": "Doctors are warning wetter conditions in spring could lead to a higher risk of 'thunderstorm asthma', which could pose a danger to Australians with and without asthma.\n\nMuch of eastern Australia - including Sydney and Melbourne - is expected to receive above-average rainfall between September and December, meaning grass pollens and other allergens could be transported from rural areas into urban areas.\n\nIn certain thunderstorm conditions, these particles can be broken up and enter the lungs, causing an asthma attack even in people who do not regularly suffer from asthma.\n\nThunderstorms can cause pollen particles to break down and impact people who don't normally suffer from asthma. (Nick Moir)\n\nOne serious incident occurred in Victoria in 2016 , when 10 people died after ambulance and emergency services were overwhelmed with the number of people suffering from asthma symptoms after a thunderstorm.\n\nHealth experts say all Australians need to be aware of the risks thunderstorm asthma poses.\n\n\"Events like thunderstorm asthma can affect people who have never experienced asthma symptoms before,\" Dr Tony MacDermott said.\n\n\"These individuals are less likely to have medication on hand, so it helps to know what medical resources are available to you before an incident strikes, to keep you safe and potentially out of hospital.\"\n\nThose with asthma and who suffer from conditions like hayfever are being told to be proactive this srping. (Nine)\n\nPeople who are allergic to grass pollen and hayfever sufferers are at higher risk of suffering from thunderstorm asthma.\n\nMacDermott urged Australians with these conditions or who suffer from asthma to be vigilant and proactive in looking after their health this spring.\n\n\"[We] see increased levels of distress amongst asthmatics during spring which highlights the fact that having a proactive conversation with your doctor can be the best medicine when it comes to seasonal health issues,\" he said.\n\n\"When it comes to asthma or any chronic health condition, the most important thing to have is a plan and the support you need to mitigate any risks and get the right care at the right time.\"",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/coles-and-woolworths-class-actions-to-progress/ad8f69da-077f-4ee7-aa8f-cdd1cc96d095",
        "title": "Class actions against Coles and Woolworths to go ahead next year",
        "publish_date": "Mon, 01 Sep 2025 22:48:48 +0000",
        "category": "finance",
        "authors": [
            "Sep"
        ],
        "text": "Coles and Woolworths will separately face a joint class action next year over allegations they misled shoppers about their discount pricing claims.\n\nThe Federal Court has confirmed that the class action proceedings being run by law firm Gerard Malouf & Partners on behalf of shoppers will be run alongside the Australian Competition & Consumer Commission's (ACCC) proceedings against the supermarket giants.\n\nTo reduce legal costs and ensure maximum protection for group members, the class actions have been paused until the ACCC liability judgment is handed down.\n\nColes and Woolworths will separately face a joint trial over allegations they misled shoppers about their discount pricing claims. (Supplied)\n\nThe court will first hear the consumer watchdog's case on whether Coles and Woolworths made false and misleading claims in their respective discount price campaigns.\n\nIf liability is established, the findings will also apply to the class actions, which will then move directly to the question of compensation for group members.\n\n\"This is an important milestone for group members,\" said Gerard Malouf, founder and chairman at GMP Law.\n\n\"The court's decision to align our class action with the ACCC proceedings streamlines the path to justice, reduces costs, and strengthens the prospects of securing fair compensation if liability is established.\"\n\nThe next case management hearing is set for next Wednesday in Melbourne.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/world/nestle-fires-ceo-over-inappropriate-relationship-with-subordinate/b75e3ebb-03b5-40e4-8f39-0c230e64ad90",
        "title": "CEO of food giant Nestle fired for 'inappropriate' relationship with employee",
        "publish_date": "Mon, 01 Sep 2025 20:50:19 +0000",
        "category": "finance",
        "authors": [
            "Sep"
        ],
        "text": "Swiss food giant Nestlé has said it dismissed its chief executive Laurent Freixe due to an inappropriate relationship with a subordinate.\n\nThe maker of Nescafé drinks and Purina pet food said in a statement the dismissal was effective immediately.\n\nAn investigation found the undisclosed romantic relationship with a direct subordinate violated Nestlé's code of conduct.\n\nREAD MORE: Leading genocide scholars say Israel committing genocide in Gaza ﻿\n\nSwiss food giant Nestlé has said it dismissed its chief executive Laurent Freixe (pictured) due to an inappropriate relationship with a subordinate. (AP)\n\nFreixe, who had been chief executive for a year, will be replaced by Philipp Navratil, a longtime Nestlé executive.\n\n\"This was a necessary decision,\" said Chairman Paul Bulcke.\n\n\"Nestlé's values and governance are strong foundations of our company.\"\n\nREAD MORE: ﻿ Fears Dezi Freeman is getting help as search enters day eight\n\nThe maker of Nescafé drinks and Purina pet food said in a statement the dismissal was effective immediately. (Tanya Lake)\n\nNavratil started his career with Nestlé in 2001 as an internal auditor and served in a variety of roles in Central America.\n\nIn 2020, he joined Nestlé's Coffee Strategic Business Unit, and in 2024, he became CEO of Nestlé's Nespresso division.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/dreamworld-expansion-plans-government-could-fast-track-development-queensland-news/07ab489a-d8bc-48d4-bf45-bfca76d288c4",
        "title": "Government could fast track Dreamworld multi-million dollar expansion plans",
        "publish_date": "Tue, 02 Sep 2025 00:21:40 +0000",
        "category": "finance",
        "authors": [
            "Sep"
        ],
        "text": "Plans for a multi-million dollar expansion of the Gold Coast's Dreamworld precinct could be fast-tracked by the Queensland government after plans stalled with the council.\n\nThe application, initially lodged in 2023, envisions the 30-hectare site divided into four distinct zones, encompassing a major tourism core with existing rides, a nature-based tourism area, a town centre precinct including residential homes, and a gateway precinct featuring a resort, restaurants and bars.\n\nThe state government today toured the theme park before indicating it may use its \"call-in powers\" to bypass Gold Coast City Council and directly manage the approval process.\n\nDreamworld's expansion would cover 30 hectares and include a tourism precinct and residential homes. (AAP)\n\nAccording to Dreamworld chief executive Greg Yong, the lack of certainty has hindered progress.\n\n\"I can't talk to developers, I can't talk to partners about what we can do, because we have no certainty,\" Yong said, adding that the government's potential intervention \"is a very strong step in the right direction\".\n\n\"This is not a hotel for the Olympics, this is a hotel that will do really well for the Olympics but tremendously well for us for 50 years,\" Yong said.\n\nThe decision to consider using \"call in powers\" was influenced by a request from Gold Coast mayor Tom Tate.\n\n\"For Dreamworld ﻿to expand, it invests further in our city, I welcome (that) very much,\" Tate said.﻿\n\nDreamworld now has 20 days to convince Deputy Premier Jarrod Bleijie, who is also planning minister, why he should \"call in\" the application.\n\n﻿ \"If I, in 20 days, decide to call in this development then I'll take over the approval process,\" Bleijie said today.\n\nA final decision regarding the intervention is anticipated by late September.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/derryn-hinch-on-life-death-and-why-he-hates-the-human-headline-nickname/800f089a-b140-4e3c-a9fb-af417a42b55e",
        "title": "Derryn Hinch makes startling revelation about his final act",
        "publish_date": "Mon, 01 Sep 2025 20:04:41 +0000",
        "category": "lifestyle",
        "authors": [
            "Sep"
        ],
        "text": "The indestructible Derryn Hinch is sitting near his walking frame, recovering from a \"bad fall\", contemplating life in a nursing home and the possibility of being a candidate for voluntary assisted dying.\n\nHe admits he has only \"a few years left\" and there's time for reflection, but no regrets.\n\nExamples: he doesn't like being called the \"human headline\", doesn't think he has often been wrong, admits to being inconsistent, agrees he was an alcoholic but still drinks, says one of his toughest times was being falsely accused of rape, and claims that he is in no way arrogant, something which may surprise some.\n\nHinch is 81 now, and after four wives, 17 sackings, three stints as a prisoner, several dances with death and treating his liver like a punching bag for decades he's still competitively driven, preparing in advance for criticisms he suspected would be raised in this discussion.\n\nI spoke to him for my podcast Neil Mitchell Asks Why? at his city flat, which is small but has some of the most magnificent views in Melbourne.\n\nIt is here, surrounded by personal memorabilia, that he reads, sleeps, does puzzles and \"cloud watches\".\n\nIt's an age away from the opening nights, long lunches, Rolls-Royces and pay cheques which today would still be staggering.\n\nDerryn Hinch has lived many lives: a broadcaster, a senator, several marriages and a litany of health issues. (Alex Ellinghausen)\n\nOf course, even with age, some things never change.\n\nThe man whose every hiccough has been public property for more than 40 years is happy to share his battles with the pain of ageing.\n\n\"Originally, I thought I didn't ever want to go into a nursing home,\" Hinch told me.\n\n\"But I'm told now by some of the nursing homes I've been talking to that you can still socialise there and it's not like you are locked away.\"\n\nAnd death?\n\nHe's had liver cancer, a liver transplant, facial melanoma that required significant radiation treatment, a life-threatening blood infection, and recently cardiac arrhythmia, where the heart doesn't beat properly and is effectively stopped and restarted to get back into rhythm.\n\n\"I'm very lucky that my brain still seems to be going,\" he said.\n\n\"Some people will dispute that, but it seems to be.\n\n\"But if my brain went, I've told my medical attorney not to revive me.\"\n\nAnd would he consider voluntary assisted dying?\n\n\"Yes, I would. Yes. One of my best friends, Bob Rogers, did have his life taken by voluntary assisted dying because he had no quality of life.\n\n\"He couldn't go to the toilet by himself. He couldn't shower. He couldn't dress himself.\n\n\"And the last time I took him out to lunch I had to get on my hands and knees to lift his feet into a taxi.\n\n\"I thought, 'This is not living.'\"\n\nRogers, who was 97, died in May last year.\n\nHe was a broadcasting icon for over 78 years.\n\nHinch, who was described as a spokesman for the Rogers family after the death, once offered to fly with Rogers to a Zurich euthanasia clinic and \"be with him while he went\".\n\nBut the family did not agree.\n\nREAD MORE: ﻿ Huge snowfalls push ski season into spring\n\nLate radio icon Bob Rogers. (Nine Entertainment)\n\nHinch himself has been close to death at least twice.\n\nHis liver transplant was 14 years ago and was, he says, a \"punt\".\n\nThe donor liver came from a drug addict and may have carried dangerous infections.\n\nIt later emerged that without the surgery, Hinch would have been dead in two weeks.\n\nBut he remains a committed atheist, not having a \"bob each way\" as the inevitable approaches.\n\n\"When you're dead, you're dead. I don't believe in heaven and I get uncomfortable when people say, 'Oh, he will meet so and so upstairs.'\n\n\"I find that pretty embarrassing.\n\n\"I stopped taking communion when I was about 12 and told my parents I didn't believe it anymore. I have no belief at all.\"\n\nExcept, perhaps, self-belief.\n\nHis mind remains sharp and the strong self-belief hasn't faded.\n\nHe has no self-doubt.\n\nBooze has been a constant in the Hinch life.\n\nLunches were marathons and he once wrote a newspaper column claiming to drink four bottles of white wine every day.\n\nThat's eight times the recommended daily intake, and exactly why he ended with cirrhosis of the liver.\n\nHe reluctantly agrees he \"thinks\" he was an alcoholic and says he stopped drinking for eight years out of respect for the donor of his liver.\n\nHe now drinks occasionally, he says.\n\nSo why the broken promise?\n\n\"It's partly because I've only got a few years left. I want to live well. But partly because my donor was a drug addict.\n\n\"I think I've made a deal with him.\"\n\nREAD MORE: ﻿ Friend of accused gunman says he could have network of supporters helping him\n\nDerryn Hinch has been imprisoned three times. (Nine)\n\nI've had many disagreements with Hinch over the years.\n\nHe showed few regrets as we argued the cases again, particularly how he reported the deaths of cricket legend David Hookes and television icon Graham Kennedy.\n\nOn the day of Hookes' funeral, Hinch broadcast that the cricketer had a girlfriend many didn't know about.\n\nHe claimed on-air Graham Kennedy \"died with AIDS\", which he now admits was \"a mistake \" and says he has apologised.\n\nAdmitting he was wrong does not come easily.\n\nHinch's catchphrase was always \"all history owes the dead is the truth\" while I argued publishing anything required a balance between benefit and hurt.\n\nWe still don't agree.\n\nHe was deeply upset by losing his Senate seat after only three years, but immensely proud of driving legislation to stop international travel by sex offenders.\n\nAs a commentator and a senator he has seen many politicians first hand: he gets on well with Anthony Albanese, thinks John Howard was a good leader, is very fond of Malcom Turnbull, thinks Bob Hawke was not a nice man, and Jeff Kennett is an enigma.\n\nHinch has been seriously broke, with less than $20 available at the ATM.\n\nHe has been very rich, and once owned two Rolls-Royces, one for himself and one for then wife Jacki Weaver.\n\nThey were different colours, he says.\n\nThere's no doubt he's been a trouble magnet, a larger than life tabloid journalist at times ahead of his time and at times infuriating with his uncompromising views.\n\nIn that sense, age hasn't changed him.\n\nIn Derryn's world, there are rarely shades of grey.\n\nLack of confidence has never been his problem, although he does say the nickname \"human headline\" seems \"narcissistic\".\n\nThis is how our discussion ended:\n\nMITCHELL: You have no self-doubt. You stand by things you've done. You don't really see many mistakes in your life. Do you think you're arrogant?\n\nHINCH: That's for you to decide.\n\nMITCHELL: That's a political answer. You're back in the bloody Senate. What do you think?\n\nHINCH: I don't think it's arrogant. I think it's just confidence.\n\nMITCHELL: What's the difference?\n\nHINCH: Donald Trump is arrogant. I'm self-confident.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/finance/tax-overhaul-chris-murphy-proposal-land-corporate-household/9c736035-71dc-4dfe-bd5a-c8febde00129",
        "title": "Aussies to get an extra $4000 a year under proposed $93b tax overhaul",
        "publish_date": "Mon, 01 Sep 2025 06:46:07 +0000",
        "category": "finance",
        "authors": [
            "Sep"
        ],
        "text": "Australian households would have an extra $4000 in the bank every year – as well as higher wages – under a substantial overhaul of the tax system put forward by one of the nation's most respected economists.\n\nChris Murphy, who has modelled tax policy for the federal government and Productivity Commission, today released a research paper proposing changes to land, corporate and household taxes.\n\nCombined, the reforms would provide $43 billion in \"consumer welfare\", effectively providing each household an extra $4000 a year.\n\nAustralian households would have an extra $4000 in the bank every year under a substantial overhaul of the tax system put forward by one of the nation's most respected economists. (Edwina Pickles)\n\nThe changes would be budget-neutral – that is, not increase or decrease the amount of tax revenue collected by the government – and the boost to households would come from collecting $91 billion in ways that do less harm to the economy.\n\nMurphy also modelled that it would lead to an increase in real wages, while at the same time improving real GDP by 6 per cent.\n\n\"At the (productivity) roundtable, the federal treasurer committed to 'a better tax system',\" he wrote.\n\n\"In that spirit, this paper models reform packages for Australian property, corporate and household taxes to increase consumer welfare by shifting towards more efficient taxes.\"\n\nThe first package includes removing stamp duty and land taxes on investment properties, and replacing them by effectively expanding council rates into a broad-based land tax.\n\nChris Murphy's proposal would see the GST broadened to include items that are currently exempt, like fresh food. (Louise Kennerley/AFR)\n\nMurphy said that change alone accounts for $27 billion of the $43 billion benefit households would enjoy.\n\nHe also proposed reducing corporate tax for most companies, while at the same time increasing the tax bill for ultra-profitable entities in uncompetitive, oligopolistic sectors like banking and supermarkets, as well as reducing the concessions related to franking credits.\n\nAnd on taxes that more directly affect households, Murphy said the government would do well to expand the GST to remove the current exemptions provided to goods and services like fresh food and private education.\n\nHe also called for the payroll tax threshold to be lowered, effectively increasing it for most small businesses.\n\nTogether, those two hikes would allow the government to cut income taxes by 11 per cent – or about $43 billion a year.\n\nMurphy's proposal comes weeks after Treasurer Jim Chalmers said the government would work on potential changes to the tax system following the productivity roundtable.\n\nREAD MORE: New major entry rule for Aussies heading to Bali ﻿\n\nJim Chalmers said the government is examining changes to the tax system. (Alex Ellinghausen)\n\nHe indicated a road user charge for electric vehicle drivers , which would replace the revenue lost from declining fuel excise, is on the verge of being confirmed.\n\nHowever, more substantial changes to the tax system – which economists say Australia desperately needs – are not likely to be handed down until far later this parliamentary term, if not taken to the 2028 federal election.\n\nBut Murphy said it was critical for the government to make a decision soon.\n\n\"Comprehensive tax reform stands out as a way of delivering large benefits compared to other areas of economic reform,\" he wrote.\n\n\"Achieving those large benefits requires a willingness to collect $91 billion in tax revenue in a different way that is less harmful for consumer welfare.\n\n\"As Theodore Roosevelt said: 'In any moment of decision, the best thing you can do is the right thing, the next best thing is the wrong thing, and the worst thing you can do is nothing'.\"",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/australia-house-prices-value-rise/86460a1c-3ed3-4fdf-8aa6-17bd8dddf252",
        "title": "House values on the rise across Australia",
        "publish_date": "Mon, 01 Sep 2025 05:14:53 +0000",
        "category": "finance",
        "authors": [
            "Sep"
        ],
        "text": "The average value of houses overall rose by 0.7 per cent, with rises as high as 1.2 per cent seen in\n\nAdelaide\n\nlast month alone, according to Cotality.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/finance/negative-gearing-on-short-term-rentals-costing-aussie-taxpayers-up-to-550-million-dollars/caf0dcb2-39b1-4bec-a871-8241b25e9c49",
        "title": "Taxpayers 'losing up to $550 million' in tax breaks for short-term property owners",
        "publish_date": "Mon, 01 Sep 2025 03:54:37 +0000",
        "category": "finance",
        "authors": [
            "Sep"
        ],
        "text": "Taxpayers could be forking out hundreds of millions of dollars every year in financial concessions for property investors using homes as short-stay accommodation, a new report has found.\n\nThe research by the national housing campaign Everybody's Home estimates that this financial year, the federal budget could be losing between $111 million and $556 million in forgone revenue through negative gearing deductions claimed on short-stay rental properties.\n\nAcross Australia 167,955 entire homes are estimated to be operating as short-stay accommodation instead of long-term rentals, yet owners can still claim negative gearing and the capital gains tax (CGT) discount.\n\nProperty investors claiming negative gearing could be costing Aussie taxpayers hundreds of millions of dollars every year, a new report says. (9News)\n\nNegative gearing is a tax concession that applies when the cost of owning an investment outweighs the income it generates.\n\nThe owner can then deduct that net loss from their overall income and lower their total taxable income, and therefore reduce their tax bill.\n\nIt can apply to any kind of investment in Australia but is most commonly associated with investment properties.\n\nDespite there being no official breakdown of the number of negatively geared ﻿short-stay properties, the Australian Taxation Office (ATO) has reported that about half of all property investors utilise negative gearing in any given year.\n\nResearchers who drew up the Everybody's Home report looked at a range of outcomes.\n\nThey found if only 10 per cent to 20 per cent of short-stay rentals were negatively geared, the annual cost to taxpayers could be more than $111 million.\n\nBut if 50 per cent of listings were negatively geared, the cost could balloon to $556 million.\n\nThe report was released today after the federal government last week fast-tracked its promised 5 per cent deposit Home Guarantee Scheme, which could help thousands of Australians buy their first homes.\n\nShould negative gearing be abolished? Yes 1201 No 1756\n\nBut campaigners and some economists argue tax reform is also needed to take the heat off property prices.﻿\n\nEverybody's Home spokesperson Maiy Azize says overhauling negative gearing has the potential to reclaim billions of dollars for the public purse.\n\n\"Everyday people are footing the bill for property investors to write off losses from holiday homes, all while families are being priced out of their communities because they can't find affordable rentals,\" she said.\n\n\"Renters across the country are being squeezed by soaring rents and a shrinking number of affordable homes – and in many parts of the country, short-stay accommodation is only making it worse.\n\n\"Generous tax breaks for investors, including for short-stay accommodation, are driving wealth inequality and pushing up house prices for everyone else.\"",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/tesla-recall-thousands-of-teslas-recalled-over-automatic-window-issue/5e70c542-5cf9-4bd2-bc28-2aee3032ea76",
        "title": "Thousands of Teslas recalled over window fault",
        "publish_date": "Mon, 01 Sep 2025 03:24:27 +0000",
        "category": "finance",
        "authors": [
            "Sep"
        ],
        "text": "Thousands of Teslas have been urgently recalled over an issue with their automatic windows.\n\nThere is a major software fault impacting 7301 of the 2025 model-Y Teslas, which results in the automatic windows closing with \"excessive force\" on any obstruction, such as a body part.\n\n\"If a body part is in the window space when the driver's side window is closing, it can increase the risk of injury to a vehicle occupant,\" the vehicle recall notes.\n\nA Tesla Model Y is seen on a Tesla car lot on May 31, 2023 in Austin, Texas. (Getty)\n\nOwners of impacted cars will be contacted by Tesla.\n\nThe issue can be addressed with a software update and does not require a service appointment.\n\nCars running the software version 2025.26.6 are not impacted by this issue.\n\nOver one million Teslas were recalled in the US in 2022 over a similar issue which impacted Model 3 and Model S variants.\n\nREAD MORE: Armoured cars enter national park in manhunt for Dezi Freeman\n\nCars running the software version 2025.26.6 are not impacted by this issue. (AP Photo/Jae C Hong, File)\n\nIn this recall, it was noted the car's automatic windows may not \"react correctly\" if an obstruction is detected.\n\nA recall was issued in Australia in March for hundreds of Teslas over a software issue which may have resulted in a loss of steering power.\n\nVisit the Department of Transport website for more information about the recall.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/women-in-sport-female-athlete-financial-literacy-nrlw-wests-tigers-pepper-money-program/9f7122a8-56b3-4758-9508-9e4b1d63012e",
        "title": "Why women in their 20s like Emily are already planning for retirement",
        "publish_date": "Sun, 31 Aug 2025 23:50:29 +0000",
        "category": "finance",
        "authors": [
            "Sep"
        ],
        "text": "EXCLUSIVE: Wests Tigers NRLW star Emily-Claire Bass is only 26 but she's already making plans for retirement.\n\nNot because she wants to give up the sport but because if she doesn't get her finances in order now, she fears she might find herself without a job or any savings in a few years' time.\n\nResearch suggests about 8.5 million Australians adults are financially illiterate, many of them women.\n\nWests Tigers NRLW star Emily-Claire Bass loved being on the field, but she can't play forever. (Supplied)\n\nMore than 60 per cent of ﻿Australian men demonstrate basic financial literacy compared to just 48 per cent of women.\n\nAnd for female athletes, that financial literacy gap can be even wider.\n\nNow the Wests Tigers are doing something about it.\n\nThe club has ﻿partnered with Pepper Money to deliver financial literacy workshops to its NRLW team, providing education tailored to women in elite sport and the unique financial challenges they players face.\n\nThe gender pay gap, limited endorsement and sponsorship opportunities,﻿ and a lack of investment in women's codes puts significant financial strain on Australia's sportswomen, especially those in emerging leagues like the NRLW.\n\n\"Their contracts are shorter, their pay is lower, and their financial journey often includes planning for family or career transitions,\" Pepper Money chief executive Mario Rehayem told 9news.\n\n\"They're also building the foundations of a league that's still evolving. That means they need to be even more financially aware and proactive.\"\n\nThe Wests Tigers partnered with Pepper Money to deliver financial literacy workshops to its NRLW team. (Supplied)\n\nThe NRLW salary cap was $1.2 million this year. In the men's league it was almost 10 times higher.\n\nThe men's minimum salary was triple that of the women's ($120,000 compared to ﻿$41,800) and they earned twice as much per game in the 2025 State of Origin series.\n\nIt's worth noting that the men's code is more established and lucrative – but that doesn't make the pay gap any easier for female athletes to navigate.\n\nMost have to work additional jobs on top of training and competing, which Bass did all through her first five NRLW seasons.\n\nThe juggle was \"a lot\" and when she joined the Wests Tigers this year she made the risky decision to focus on footy full-time.\n\n\"Not having that dual income from my other job, I'm not earning as much money as what I did last year,\" she told 9news.com.au.\n\nREAD MORE: The twisted messages posted by church mass shooter\n\nBass gave up her second income to focus on footy, something few female athletes can afford to do. (Instagram/@itsembass)\n\nThe new ﻿'Mastering Money On and Off the Field' workshops has been invaluable as she navigates the transition from two incomes to one.\n\nThey teach players how to establish smart money habits during their playing career and set themselves up for a financially sound future after retiring from the game.\n\nOne in three athletes admit to making poor financial decisions, according to the Professional Footballers Australia (PFA), and two in five elite athletes aged 18-34 reported suffering poor mental health as a result of financial stress.\n\n﻿\"NRLW contracts aren't the most amount of money [and] I'm not too sure where my income is going to come from in the future,\" Bass said.\n\n\"﻿That's a little bit scary﻿, it's an uncertain situation to be in, so Pepper Money did talk to us about that emergency fund as well.\n\n\"So post career, if I do struggle to find work or I'm not working for three months for some reason, like I get injured, I do have that safety net there﻿.\"\n\nManaging money is \"a little bit scary﻿\" when you're playing in an emerging league without the funding the men's game enjoys. (Supplied)\n\nAlmost 90 per cent of athletes ﻿need to find new employment post-career to maintain financial security, according to UNI World Athletes, and it's doubly hard for women.\n\nFemale athletes typically receive fewer career opportunities when they retire than their male counterparts; just ask Charmain Steventon.\n\nShe debuted on the ﻿Australian Sevens team in 2000﻿, represented Australia at the 2002 Rugby XVs World Cup, and won five premierships with West Harbour RFC, and did it all while working a second job.\n\nWhen she finally hung up her boots, she was fortunate ﻿ to have supportive employers and mentors who helped her secure work.\n\nNot every player was so lucky, especially in an era where financial literacy and planning for a future after footy \"wasn't even on the radar\".\n\nNow the ﻿Wests Tigers Head of Women's Football, Steventon is determined to change that for the next generation.\n\nWests Tigers Head of Women's Football, Charmain Steventon. (Supplied)\n\n﻿\"Equalling the playing field is really important, particularly now that the female players are being paid for playing footy,\" she told 9news.\n\n\"It's a long term vision but it will certainly pay off.\"\n\nEnsuring the current NRLW cohort are financially literate will build a strong foundation for future players and set a positive example for the next generation.\n\nFor Bass, who is now trying to plan a wedding on an NRLW contract salary after years of having a dual income, it has been invaluable.﻿\n\nShe just hopes the workshops and others like them will be picked up by ﻿other clubs across the NRLW and other codes of women's sport.\n\n\"It really gives us a perspective on life in general, where our money is coming and going, and how we can properly invest in not just our career right now, but the next 30 to 50 years, and set ourselves up for the future.\"",
        "source": "9News"
    },
    {
        "url": "https://www.abc.net.au/news/2025-09-02/ollie-miles-returns-to-footy-after-beating-leukaemia/105720520",
        "title": "Teen celebrates emotional grand final win after beating leukaemia",
        "publish_date": "Tue, 02 Sep 2025 00:53:53 +0000",
        "category": "sports",
        "authors": [],
        "text": "Oliver Miles never thought he would play footy again, catch a wave with his mates or join his dad on a boat, fishing the pristine waters off Queensland's Capricorn Coast.\n\nJust weeks before Christmas in 2023, the Yeppoon teenager was diagnosed with a rare and aggressive form of leukaemia.\n\n\"It was quite unexpected being diagnosed with leukaemia a week after being at footy training,\" he remembered.\n\n\"I was feeling healthy and pretty good and being diagnosed was like a blind-side moment really.\"\n\nFrom that moment, the then 16-year-old was in the fight of his life.\n\nOllie Miles spent 14 months in hospital undergoing various treatments. (Supplied: Ollie Miles)\n\nImmediately after his diagnosis, Ollie, as he's affectionately known, and his family relocated to Brisbane to start his treatment, which included participating in a new medical trial.\n\n\"I think for a lot of people, getting diagnosed with any sort of cancer is epic and everyone handles it differently and we just couldn't believe it,\" Ollie's dad Clint said.\n\n\"He was a kid that had basically been kicking goals and going from strength to strength school-wise, mates-wise, with footy and other sports.\n\n\"To go from footy training on a Thursday to literally on a hospital bed on the Monday with nothing really positive ahead [was a shock].\"\n\nOllie's remarkable footy comeback\n\nOllie Miles flies high to take a mark for his Yeppoon Swans junior team. (Supplied: Ollie Miles)\n\nAfter building his strength and immunity back, Ollie returned to the football field earlier this year for the first time since his diagnosis.\n\nClint said the chance to play alongside his mates again kept Ollie going.\n\n\"It meant a hell of a lot to Oliver but also for a lot of those young men really that were around him and they went through it all from the beginning with him, by his side,\" he said.\n\nLast Sunday, the comeback was complete, with Ollie kicking the final goal in his team's junior grand final win.\n\nOllie Miles is mobbed by his teammates after kicking the final goal of the grand final. (Supplied: Yeppoon Swans)\n\n\"It was just great to see all the boys get around me at the end,\" Ollie said.\n\n\"I'm sure they would have done it for anyone, but it was just special being in that moment.\"\n\nFor Clint and his wife Kate, it was an overwhelming experience.\n\n\"It was just great to see and we knew how happy and how much it meant to him,\" Clint said.\n\n\"Just being out there achieving, getting better, getting stronger, having a laugh, having a smile and to have the last kick of his junior career being a goal … we'll never forget it.\"\n\nClint and Ollie Miles share a love of football. (Supplied: Clint Miles)\n\nThe journey and life-saving treatment\n\nIt's been nearly two years since Ollie started on a daily regime of chemotherapy at the Brisbane Children's Hospital, even having treatment on Christmas day.\n\nHis treatment plan changed daily during the 14-month battle for the Miles family, including being part of a worldwide trial for the Philadelphia chromosome-positive gene.\n\n\"It was kitchen-sink time to throw at this cancer,\" Clint said.\n\nOllie Miles's older brother, Ari, was a perfect DNA match for a bone marrow transplant. (Supplied: Ollie Miles)\n\nOllie's groundbreaking treatment and bone marrow transplant from older brother, Ari, were successful and he was able to return to Yeppoon with his family late last year.\n\n\"The top floor [of the cancer ward] down there [in Brisbane] is not where any parent ever wants to be and definitely no kid deserves to be there,\" Clint said.\n\n\"The doctors, nurses, 24/7 staff were amazing and stayed positive … they kept him alive.\n\n\"Sometimes you get these little [medical] breakthroughs and you just have to be on the right side of it.\"\n\nThe Miles family from Yeppoon in central Queensland during happier times before Ollie's diagnosis. (Supplied: Clint Miles)\n\nThe Capricorn Coast community in central Queensland rallied behind the Miles family during the daunting ordeal, especially his beloved footy club the Yeppoon Swans and high school St Brendan's College.\n\nThe club and his school showed support by shaving their heads for the Leukemia Foundation's Shave for a Cure and raised money for Ollie and his family.\n\nOllie, now 18, said the support played a huge role in getting him through this dark and challenging time.\n\n\"It was great peace of mind, knowing that everyone was thinking about me and everyone was sending their support,\" Ollie said.\n\nThe Yeppoon community rallied behind Ollie Miles as he tackled his shock cancer diagnosis. (Supplied: Clint Miles)\n\nRaising awareness about blood cancer\n\nIn Australia, an average 55 people are told each day they have blood cancer and the disease claims the lives of more than 6,300 people each year.\n\nOne in three people will not survive five years after their diagnosis.\n\nThe Leukaemia Foundation's head of research, Bill Stavreski, said more than 20,000 people would be newly diagnosed with blood cancer such as leukaemia, lymphoma or myeloma, this year.\n\nBill Stavreski says Ollie Miles's story is one of hope. (Supplied: Leukaemia Foundation)\n\n\"What we are seeing is over the last 20 years … the number of blood cancer cases have nearly doubled,\" he said.\n\n\"It doesn't discriminate, it affects young and old alike, and it is actually the leading cancer amongst Australian kids.\n\n\"Likewise it doesn't discriminate against whether you live in metro or regional areas.\"\n\nOllie Miles says the support of the Yeppoon Swans played a huge role in his return to the field. (Supplied: Ollie Miles)\n\nSeptember is Blood Cancer Month for the Leukaemia Foundation.\n\nMr Stavreski said survival stories like Ollie's helped raise awareness and educate people about the disease.\n\n\"It's a fairytale story and it's really great not only that Ollie has recovered from his long treatment but to get back on the footy field,\" he said.\n\n\" Whoever has written the script for Ollie to kick the winning goal, I mean, that's wonderful. \"\n\nAway from the footy field, Ollie Miles is a keen fisherman and surfer. (Supplied: Yeppoon Swans)\n\nNow in remission, Ollie's next three-month check-up in Brisbane is at the end of the month, but in the meantime, the fun-loving Yeppoon teen has other plans now the footy season is over.\n\n\"Oh, 100 per cent. Every time I'm not at footy I'm out on the boat fishing and surf whenever there's a wave,\" he said.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-09-02/alcoa-advert-about-forests-inaccurate-misleading-watchdog-finds/105722968",
        "title": "Watchdog rules Alcoa claims about jarrah forest rehabilitation not true",
        "publish_date": "Tue, 02 Sep 2025 00:45:20 +0000",
        "category": "finance",
        "authors": [],
        "text": "Australia's advertising watchdog has found US aluminium giant Alcoa made inaccurate or misleading claims in an advertisement about its rehabilitation of the forests it mines in.\n\nAlcoa has mined for bauxite — used to create aluminium — in the world's only jarrah forests in Western Australia since 1963.\n\nThe WA Forest Alliance, Conservation Council of WA and The Wilderness Society made a complaint to Ad Standards about an advertisement printed in The West Australian newspaper on May 24, 2025.\n\nThe Alcoa advertisement ran in The West Australian newspaper on May 24. (Supplied)\n\nThe complaint alleged the advertisement breached the advertising Environmental Claims Code, including by being misleading or deceptive.\n\nAd Standards found the advertisement's claim that Alcoa had rehabilitated 75 per cent of the forest it had cleared was not truthful.\n\nAlcoa said in its response the definition of \"rehabilitation\" referred to \"management actions that aim to reinstate a level of ecosystem productivity or function\", not \"restoring the Jarrah Forest to its natural ecosystem\".\n\nAlcoa has permission to mine thousands of kilometres of jarrah forest, but its rehabilitation efforts are under scrutiny. (Declan Taylor )\n\n\"The Panel considered that the overall impression created by the advertisement was inaccurate and likely to mislead or deceive target consumers,\" the report said.\n\n\"While the target consumer may understand the land had not been returned to its former state, they were also unlikely to understand that rehabilitation is a long-term project and the areas referred to as rehabilitated may only contain seedlings and not forest.\"\n\nClaims 'overstated'\n\nThe advertising watchdog also found Alcoa did not support the claims made in the advertisement with evidence, used language which was \"not clear or specific\", and made \"overstated\" claims.\n\nAd Standards rejected a fifth claim that Alcoa's environmental claims about future objectives were not based on reasonable grounds at the time they were made.\n\nInside Alcoa's plans to expand mining in WA's jarrah forests Photo shows A hi-vis yellow hard hat with Alcoa printed on the front. US aluminium giant Alcoa wants to expand mining operations in the world's only jarrah forests, setting the stage for a battle with environmentalists.\n\n\"The overall claim being made by the advertisement related to work that had already been completed, rather than what was ongoing … while the advertisement touches on some future environmental objectives, these were specific and limited and likely to be made on reasonable ground,\" the report said.\n\nAd Standards rejected a claim made by Alcoa that the printout did not meet the definition of advertising and was only a statement of public policy.\n\n\"The Panel considered that such statements if published in a media release or on the advertiser's website may constitute a statement of public policy, but when part of a paid media campaign this material does meet the definition of advertising under the Code,\" the report said.\n\nSatellite imagery from 1984 to 2022 showing mining areas growing within green forest of Alcoa's Huntly (centre top) and Willowdale (centre low). (Supplied: Google Earth)\n\nThe executive director of Ad Standards, Greg Wallace, said research showed the community cared deeply about accurate advertising.\n\n\"One in five Australians are concerned about environmental claims and the potential of greenwashing in advertising,\" he told ABC Radio Perth.\n\n\"About 43 per cent have concerns about misleading or deceptive advertising.\n\n\"So, it does matter.\"\n\nAdvert discontinued\n\nIn response to the findings, Alcoa said the advertisement was no longer in circulation and confirmed future advertising material would be updated accordingly.\n\n\"The reality is rehabilitation has commenced in 75 per cent of mined areas and is at various stages of maturity,\" the company said in a statement.\n\n\"Alcoa used language according to mining industry-accepted definitions and acknowledge that some people may have interpreted this differently.\"\n\nAlcoa tried to argue the advert did not meet the definition of advertising. (AAP Image: Joe Castro)\n\nThe Pennsylvania-based company also noted, in the report, the economic value of its projects and its commitment to sustainability.\n\n\"In 2024, in Australia, our annual spend was more than $3.9 billion locally through wages, taxes, royalties, procurement and community investment,\" Alcoa said.\n\n\"We care about the environment and the communities near where we operate. In Australia and around the world we are consistently recognised for our approach to sustainability.\"\n\nRehabilitation contested: CCWA\n\nThe Conservation Council of WA (CCWA) said there was some vindication from the finding, but said it was vital companies like Alcoa got it right the first time.\n\nJarrah forest near the Serpentine dam has been mined by the US aluminium giant. (Supplied/Miles Tweedie )\n\n\"These companies do not spend a lot of money on advertising or sponsoring events because it doesn't get them anything. [They do it because] it buys them social license, it influences what the public thinks of them,\" CCWA executive director Matt Roberts told ABC Radio Perth.\n\n\"It's contested that you can actually rehabilitate jarrah forest in any way shape or form after strip mining it.\n\n\"Most people, they don't want to go reading and trolling through scientific papers.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-09-02/fears-trades-skills-shortage-may-undermine-vic-housing-targets/105698356",
        "title": "Glazier working 90-hour weeks warns housing targets may be unachievable",
        "publish_date": "Tue, 02 Sep 2025 00:26:03 +0000",
        "category": "finance",
        "authors": [],
        "text": "A staffing shortage is triggering alarm bells for tradespeople in regional Victoria, as the state government moves to build 800,000 homes across the next decade.\n\nPeter Shields has been working as a glazier for 28 years, and two years ago moved back to his hometown of Dookie in the state's north-east.\n\nHe has worked up to 90 hours a week in the past month to keep up with growing demand.\n\n\"Obviously we are under stress, and it's long hours,\" Mr Shields said.\n\n\"It adds frustration to the job that you can see where it [the industry] is going, and you think, 'Jeepers, what's going to happen in five years' time?'\"\n\nPeter Shields says the pressure of working in a finishing trade may deter some apprentices. (ABC Goulburn Murray: Coco Veldkamp)\n\nMr Shields said the Shepparton region had just nine glaziers servicing a population of more than 130,000 people.\n\nHe said many of those businesses were likely to close in the next five years, due to ageing staff and a lack of new apprentices.\n\n\"As a trade that isn't widely known, there isn't a rush of potential candidates,\" Mr Shields said.\n\n\"Add to that the lure of better pay initially in retail, the pressure to be perfect with production because we are a finishing trade, the manual lifting and the occasional cuts, [and we] see employees leave the industry.\n\n\" I have lost count of how many I have mentored, but only one is still in the trade full-time. \"\n\nAustralian Glass and Window Association head of industry development Melissa Baker said the number of apprentices in the glass and glazing industry was extremely low.\n\n\"With glass becoming an increasingly prominent feature in both commercial and residential buildings, the demand for skilled workers continues to grow,\" she said.\n\nTrade industry bodies are warning the workforce may struggle to meet government housing targets. (ABC North Coast: Hannah Ross)\n\nWider trade shortages\n\nThe Victorian government's target of building 800,000 homes in the next decade has some industries concerned about whether the goal is possible amid widespread staffing shortages.\n\nCliff Bingham says the construction workforce is already unable to keep up with demand. (Supplied: Cliff Bingham)\n\nJobs and Skills Australia assistant secretary of labour markets Cliff Bingham said trade shortages were a particular problem in the regions.\n\n\"We also tend to see that, on average across the labour market, regional employers tend to have a slightly tougher time of it than employers in capital cities, particularly when you get out into small country towns,\" he said.\n\nMr Bingham said that over the past two years, trade shortages had improved marginally, but were still well below where they needed to be.\n\nVictoria is planning to build 800,000 homes in a decade. (ABC South East SA: Isadora Bogle)\n\n\"In the context of housing construction, we can't build as many homes as we would like to because we just don't have the size of the workforce that we need,\" he said.\n\nMr Bingham said many factors contributed to trade skills shortages, including negative perceptions of vocational training, and differing opinions around policy settings for apprenticeships.\n\nBarriers for women in construction industry Photo shows A woman holding a nail gun on a construction site As Australia's construction industry continues to suffer from a worker shortage, these female tradies say more women want to take up the tools but can't due to sexist attitudes on the site.\n\nHe also said industries dominated by one gender were more likely to have shortages.\n\nMaster Builders Victoria chief executive Michaela Lihou said attracting new entrants into construction trades was important.\n\n\"Our members across the state have let us know that it is harder to attract apprentices into trades than it was 20 years ago, and getting more people into apprenticeships is critically important to deliver the homes that we need,\" she said.\n\n\"It is essential that every region across Victoria has access to quality training and clear career pathways into trades to support us meeting the Victorian housing target.'\n\nMichaela Lihou has been the CEO of Master Builders Victoria since 2023. (Supplied: Master Builders Australia)\n\nBarriers to training\n\nDuring National Skills Week last week, the Housing Industry Association (HIA) called for \"fresh thinking\" to address the industry's chronic staff shortages.\n\n\"Not only is Australia facing a chronic shortage of skilled workers, but the competition for workers has never been tougher,\" HIA managing director Jocelyn Martin said.\n\n\"This competition is only expected to increase with a number of significant infrastructure and big-build projects in the pipeline.\"\n\nNew apprenticeship funding Photo shows Electricians place solar panels on roof The most recent data shows apprenticeship numbers haven't kept pace with population growth, with more than half of apprentices not completing their training.\n\nShe said training access remained a barrier for young people in rural areas, with some having to travel up to four hours for trade school.\n\nHIA said it had made numerous recommendations to the Victorian government, including a targeted program for school leavers to promote trades, a pilot program for accelerated apprenticeships, and funding to support skilled immigrants navigating regulatory requirements.\n\nA Victorian government spokesperson said there was more work to do to recruit staff to trades.\n\n\"We're taking action to build a strong pipeline of skilled workers to deliver the homes that all Victorians need, including in the regions,\" the spokesperson said.\n\n\"This includes investing more than $16 billion [in] new and base funding into our TAFE and training system since 2014, making sure Victorians have the right skills for the opportunities of the future.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-09-02/labor-plans-to-weaken-foi-laws/105723992",
        "title": "Labor plans to make it harder to access government information",
        "publish_date": "Tue, 02 Sep 2025 00:21:59 +0000",
        "category": "finance",
        "authors": [],
        "text": "Details of the government's actions and the advice of public servants could be more easily hidden under a new Albanese government proposal to weaken Freedom of Information (FOI) laws.\n\nAttorney-General Michelle Rowland will introduce legislation on Wednesday that would make it harder for journalists and members of the public to gain access to documents related to government \"deliberations\".\n\nIt would also \"clarify\" the rules about when documents could be deemed confidential because they related to cabinet processes, an avenue the Robodebt royal commission found was routinely abused by public servants as an excuse to refuse FOI requests.\n\nThe details of this \"clarification\" are not yet known, but the ABC understands the change may lead to more documents being labelled as cabinet confidential, not fewer.\n\nFreedom of Information laws allow members of the public and journalists to access information about government decisions and processes, and have long been contested between transparency advocates favouring stronger laws and bureaucrats who say confidentiality allows them give freer advice to government.\n\nThe proposal would also introduce a mandatory fee to lodge requests. A spokesperson for Ms Rowland said the purpose of this was to stamp out vexatious requests, and that there would be an exemption for those seeking information about themselves.\n\nThe fee would be broadly in line with fees charged by some state governments, of roughly $30 to $50 per request.\n\n\"Freedom of Information is a vital feature of our democratic system … [But] the FOI framework is stuck in the 1980s,\" Ms Rowland said in a statement.\n\n\"[The] changes will continue to promote transparency in government while ensuring public sector resources are not unduly misused by anonymous or vexatious requests.\"\n\nLabor cites 'frivolous' requests as motivation\n\nAccording to figures quoted by the attorney-general, public servants spent more than a million hours processing FOI requests in the 2023-24 financial year including spam, threats and \"frivolous\" requests.\n\nIn one instance, a single entity sent 580 FOI requests in a short window, diverting an entire public service team for more than three months. In another, an applicant made numerous requests.\n\nBut the FOI system is also used by members of the public seeking information about decisions made by officials that affect them — 72 per cent of requests — and by journalists seeking information about the actions of officials and politicians.\n\nWhile fees are not currently mandatory, departments often seek hefty sums to process requests, or refuse them on the grounds that they would take too long to process. Documents related to government deliberations are also routinely excluded.\n\nMs Rowland's statement framed the current laws as \"barriers to frank and fearless advice from the public service\", echoing the common claim by bureaucrats that FOI laws cause them to censor what they tell their ministers because they fear publication.\n\nThe Albanese government has faced criticism for its transparency on a number of fronts, including its responses to FOI requests, answers to orders for the production of documents from opposition and crossbench parliamentarians, and tendency to make stakeholders sign non-disclosure agreements when they consult on policies.\n\nShadow Attorney-General Julian Leeser said the proposal for a mandatory FOI fee was a \"truth tax\", but declined to comment on other elements of the bill, saying he was yet to be briefed.\n\n\"This is a government that talked a big game on transparency when they came to office, but what they've done since they came to office is anything but transparent,\" Mr Leeser said.\n\nGreens justice spokesperson David Shoebridge said the proposal would \"make it even harder to get access to government information\".\n\n\"They've looked at the FOI system and decided the problem was you trying to get information and not the secretive departments and ministers that are repeatedly trying to hide it … What are they trying to hide from us this time?\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-09-02/museum-of-central-australia-closed-alice-springs/105722228",
        "title": "Museum of Central Australia closes as visitor numbers fall",
        "publish_date": "Mon, 01 Sep 2025 23:38:22 +0000",
        "category": "entertainment",
        "authors": [],
        "text": "Nestled in Alice Springs' Araluen cultural precinct, the Museum of Central Australia's natural and earth science collection has been delighting families, tourists and school groups for well over two decades.\n\nThat was until January, when the museum quietly closed its doors as part of the planned expansion of the Strehlow Centre.\n\nThe closure raised questions about the future of the significant natural and earth science collection.\n\nMuseum and Art Gallery of the Northern Territory (MAGNT) director Adam Worrall said the Museum of Central Australia would not reopen to the public after its standard summer closure period.\n\nMr Worrall said it was due to several factors, including a continued decline in attendance.\n\nAdam Worrall says the museum will not reopen. (Supplied: MAGNT/Mark Sherwood)\n\nHe said the exhibitions at the Museum of Central Australia had been the same exhibitions for the past 25 years and were looking old and tired and need updating.\n\n\"The third reason is because we are planning the redevelopment of the Strehlow Research Centre, which will actually take over the whole building,\" he said.\n\n\"We need to increase collection storage so we can receive and care for the Aboriginal cultural material and sacred items that are being repatriated back to Central Australia over the next 10 years.\"\n\nThe collection will be packed and split between storage sites in Darwin and Alice Springs with no immediate plans for display.\n\n\"The geology specimens will probably all stay in Alice Springs,\" he said.\n\nMr Worrall said he had been in discussions with the Alice Springs Desert Park about potentially displaying part of the exhibition.\n\n\"There is an exhibition space there that's incredibly under-utilised and we have an exhibition that tells parts of the geological creation of the MacDonnell Ranges and that's exactly where you need to be to see that story,\" Mr Worrall said.\n\n\"We were also proposing that we would work with local communities to tell their creation story alongside of that scientific story.\"\n\nThe exhibition space at the now closed Museum of Central Australia. (Supplied: MAGNT)\n\nBut he said funding remained a challenge given the significant cost to move and revamp the current collection.\n\n\"My experience in exhibitions would be a new exhibition of that scale would be around just under a million [dollars],\" he said.\n\n\"There is a draft that has been done that I know there have been some conversations, but it is by no means a proposal to government or treasurer at the moment for them to consider,\" he said.\n\nContinued access\n\nNorthern Territory Treasurer and member for Namatjira, Bill Yan, said researchers and custodians still had access to the collection by appointment.\n\n\"I know MAGNT are working with government at present to see what that future is going to look like for that collection here in Alice Springs,\" he said.\n\nThe natural and earth sciences exhibits will be moved to Alice Springs and Darwin. (Supplied: MAGNT)\n\n\"There's some great stuff in there, some great history around Central Australia, and we need to make sure that Northern Territorians and tourists, of course, have access to that as well.\"\n\nHowever, there were no plans to exhibit the specimens.\n\n\"I don't have a budget to build a new museum at the moment,\" he said.\n\nBlow to tourism\n\nTourism Central Australia CEO Danial Rochford said the closure was a significant loss to the town.\n\n\"We used to get significant positive feedback about the centre and … it strengthened that Araluen precinct,\" he said.\n\nDanial Rochford says the closure is a loss to the town. (Supplied: Danial Rochford)\n\nMr Rochford said he was aware of the closure but was expecting the site to reopen after its refurbishment.\n\nMuseum of Central Australia has been shut since late last year. (ABC Alice Springs: Emma Haskin)\n\nHe said the NT government must invest in tourism products in Alice Springs.\n\n\"We need tourism product development acutely at the moment,\" he said.\n\n\"This is something, a really low-hanging piece of fruit that the government could do, literally starting the process in the next few days.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-09-02/polish-ceo-apology-for-stealing-kamil-majchzrak-cap-at-us-open/105723574",
        "title": "Polish CEO apologises for stealing cap from young US Open fan",
        "publish_date": "Mon, 01 Sep 2025 23:12:22 +0000",
        "category": "sports",
        "authors": [],
        "text": "The Polish CEO who took tennis player Kamil Majchrzak's hat from a young fan at the US Open has apologised on social media and says he has returned it.\n\nPiotr Szczerek, founder of paving company Drog-Bruk, posted an apology on social media after a video of the incident went viral over the weekend.\n\nThe broadcast showed Szczerek grabbing the cap as Majchrzak handed it to a young boy in the stands after a second-round upset win over ninth seed Karen Khachanov.\n\nSzczerek, who is from Poland, wrote on Facebook that he made a mistake thinking Majchrzak was giving him the hat for his sons, who had asked earlier for an autograph.\n\n\"I take full responsibility for my extremely poor judgement and hurtful actions,\" he wrote.\n\nThe young fan was overjoyed as Majchrzak handed him his hat. (Supplied: Stan Sport)\n\nBut Szczerek ripped it from his hands and stashed it in his partner's bag. (Supplied: Stan Sport)\n\n\"It was never my intent to steal away a prized memento from the young fan. I became caught up in the heat of the moment and the joy of the victory.\n\n\"Regardless of what I believed was happening, the actions I took hurt the young boy and disappointed the fans.\n\n\"I have sent the hat back to the boy and extended my sincere apologies to his family. I hope, at least to a small extent, I was able to repair the harm I caused.\"\n\nJust before the incident, Majchrzak shook hands with Szczerek in the stands and exchanged some words.\n\nKamil Majchrzak upset ninth seed Karen Khachanov but retired injured from his next match. (Getty Images: Sarah Stier)\n\nThe world number 76 then removed his black cap and handed it to the boy, who looked shocked and overjoyed as he reached for it, only for Szczerek to rip it away from him.\n\n\"No! What are you doing?\" the boy was heard saying on the court microphones, as Szczerek turned away, ignored him and stashed the cap in his partner's bag.\n\nAs the video did the rounds on social media, a statement purporting to be from Szczerek emerged, saying it was a case of \"first come, first served\" and, \"If you had been quicker, you would have had it.\"\n\nSzczerek said those comments and any others attributed to his wife or sons were fake, including claims they were looking at legal options over criticism on social media.\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\n\"All statements appearing online accredited to us were false and were not authored by us or our representatives,\" he wrote.\n\n\"For years, my wife and I have been involved in supporting children and young athletes, but this incident has shown me that a moment of inattention can undo years of work and support.\n\n\"It is a painful but necessary lesson in humility.\"\n\nMajchrzak said on social media he reached out to the boy's family and met with him to give him a new hat and take photos with him.\n\nThe 29-year-old, who is also from Poland, retired during his third-round match against Swiss qualifier Leandro Riedi, clutching at his left side and unable to complete the first set.\n\nThe ABC of SPORT Sports content to make you think... or allow you not to. A newsletter delivered each Saturday.\n\nABC/AP",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-09-02/record-geraldton-port-closures-caused-by-winter-storms/105719690",
        "title": "Winter storms cause 'unprecedented' and costly delays at WA port",
        "publish_date": "Mon, 01 Sep 2025 23:02:56 +0000",
        "category": "finance",
        "authors": [],
        "text": "Weather conditions at a West Australian port have caused record shipping delays, led to cost increases and created challenges for farmers, exporters and miners.\n\nWinter storms and long waves, which have an extended period between crests, have caused surges in water levels at Geraldton Port, resulting in excessive and unsafe ship movements.\n\nThe CBH Group receives farmers' grain and operates most of the wharf-based grain loading facilities in the state.\n\nIt is also one of Australia's largest grain exporters.\n\nCBH Geraldton zone general manager Collette Newton said the cooperative had lost 900 hours of ship loading time at the port due to surge closures from October to August, doubling the previous delay record.\n\n\"We have seen an unprecedented level of surge,\" she said.\n\n\"We've seen a spike in surge since June.\n\n\"All port users have been affected, including us.\"\n\nMs Newton said the cooperative was averaging a 16-day turnaround for ships at Geraldton, which was \"a lot higher\" than what was ideal.\n\nAn iron ore ship sails out of Geraldton on a calm morning. (ABC Mid West Wheatbelt: Jo Prendergast)\n\nCost blowouts\n\nShipping records show some ships have experienced much longer turnaround times.\n\nBulk carrier Kea arrived in Geraldton on July 15 to be loaded with 18,000 tonnes of wheat, but the CBH-chartered ship did not depart until August 26.\n\nIndustry estimates put the daily shipping rate for vessels of that size at $15,000, meaning the 41 days the vessel spent in Geraldton could have amounted to $615,000.\n\nRecords show four ships, the YM Summit, the Ultra Esterhazy, the Ocean Makmur and SSI Providence were at anchor in Geraldton for more than 30 days during July and August.\n\nSome grain exporters are understood to be changing their plans to avoid Geraldton because of its track record of delays.\n\nMs Newton said CBH had moved some vessels to other ports and increased its road capacity to relieve some pressure on the port.\n\nShe said that despite the challenges, the cooperative had exported nearly 3 million tonnes of grain this season, putting it in a \"really good position\" to deal with the upcoming grain harvest.\n\nMs Newton said CBH was also in the process of upgrading some port storage.\n\nThe next port is 450 kilometres away at Kwinana.\n\nGeraldton Port is a vital export point for the region's miners. (ABC Mid West Wheatbelt: Natasha Harradine)\n\n250-hour closure\n\nFenix Resources shipped 2.4 million tonnes of iron ore from the Geraldton Port last financial year.\n\nExecutive chair John Welborn said in July alone, the port was closed for 250 hours due to surge, and that made logistics difficult.\n\n\"The impact of surge events slows down our ability to ship, and therefore delays the receipt of revenue,\" he said.\n\n\"The most important thing is to be efficient with our ship movements.\n\n\" It's a big cost to us if there is demurrage, if the ship is required to stay at anchor, that's inefficient. \"\n\nSurge from winter weather caused significant delays at the Geraldton port (ABC News: Gian De Poloni)\n\nMr Welborn said the Geraldton port was an important export terminal for WA and vital for the Mid West.\n\nDespite the port closures, he said the miner was still usually able to turn vessels around in 24 hours.\n\n\"We are loading around 60,000 tonnes of iron ore at Berth 5 in Geraldton,\" Mr Welborn said.\n\n\"The Mid West Ports Authority can load that material from our storage facility at about 3,000 tonne an hour.\"\n\nLike CBH, Fenix owns and operates an integrated supply chain, from its mines in the Mid West, to road haulage and port storage companies.\n\nA 400-metre breakwater will be built to protect Geraldton Port from storm surge. (Supplied: Mid West Ports)\n\n$350m upgrade\n\nConstruction of a 400 metre breakwater at Geraldton is due to begin next year as part of a $350 million port upgrade.\n\nMid West Ports Authority chief executive Damian Tully said reducing surge impact was the number one priority in the upgrade, and he estimated the breakwater would reduce surge delays by 60 to 80 per cent.\n\nDamian Tully says the planned breakwall will significantly reduce storm surge. (ABC Mid West Wheatbelt: Natasha Harradine)\n\nHe said the port was averaging 32 days per year of surge-related delays, but this year had been \"one of the worst\".\n\n\"We have seen an unprecedented number of weather events affecting us over winter this year,\" he said.\n\nMr Tully said the port was meeting with all impacted customers to plan the most efficient shipping as possible.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-09-02/community-fundraises-for-cancer-drug-for-woman-with-lfs/105704728",
        "title": "Mother's heartbreaking mission to buy more time for her dying daughter",
        "publish_date": "Mon, 01 Sep 2025 22:47:09 +0000",
        "category": "lifestyle",
        "authors": [],
        "text": "Diana Matthews has adorned her modest home at Darnum, east of Melbourne, with family photos, calming candles and soft furnishings.\n\nIt's a sanctuary of love and a vigil of hope for the mother-of-four who is enduring the tough task of coming up with enough money to keep her 32-year-old daughter Emma Trenerry alive.\n\nDiagnosed with stage-four osteosarcoma, Emma is the latest in the family to succumb to the hereditary cancer syndrome that has claimed the lives of her father, four of his six siblings, her grandmother, and great-aunt and uncle.\n\nEmma Trenerry and her mother Diana Matthews celebrate Christmas in happier times. (Supplied: Diana Matthews)\n\nFor many years, the early deaths on the paternal side of the family were attributed to bad luck, but in 1995 the death of Emma's paternal uncle from leukaemia prompted an investigation that revealed the presence of the Li-Fraumeni gene variant.\n\nLi-Fraumeni syndrome (LFS) is a rare genetic condition that predisposes carriers to developing various cancers early in life.\n\n\"It's quite an aggressive gene, and unfortunately Emma is the only one of my children that inherited the gene from her father, who passed away when he was 40,\" Ms Matthews said.\n\nEmma Trenerry's siblings were lucky not to inherit the Li-Fraumeni gene. (Supplied: Diana Matthews)\n\nEmma's cancer journey\n\nAs a preventative measure, Emma underwent a hysterectomy in 2020, even before testing positive to LFS.\n\nDuring the surgery, doctors discovered and removed a cervical cancer.\n\nTwo years later, during a follow-up full-body MRI scan, doctors found an 8x7x5-centimetre sarcoma growing in her spine.\n\n\"She did have a bit of pain in her hip for a while, which was diagnosed as being arthritic, but when she had the MRI they found cancer in her hip, and it was quite large already,\" Ms Matthews said.\n\nEmma Trenerry, who has a terminal diagnosis, is determined to see another Christmas with her family. (Supplied: Diana Matthews)\n\nEmma had six months of chemotherapy and eight rounds of radiotherapy, which put her in remission for six months.\n\nBut unfortunately the tumour started to grow again.\n\n\"Any cancers that come up, Emma's body cannot shut them down,\" Ms Matthews said.\n\nFor Emma, her only option is to \"keep going\" with the time she has left.\n\n\"[I'm] as good as I can be, I guess,\" she said.\n\n\" It's hard not being able to do what I used to do, but my kids are just absolutely amazing; they've been through a lot and just watching them grow is amazing. \"\n\nEmma Trenerry's family and friends staged a Christmas in July celebration for her. (Supplied: Diana Matthews)\n\nRaising funds to pay for cancer drug\n\nDuring treatments, Emma was informed of a trial for the cancer-inhibiting drug Cabozantinib, a tablet medication developed by US pharmaceutical company Exelixis.\n\nAt $9,500 for a two-month supply, she was initially told by her doctor that she could access the medication for free.\n\nThey have since learnt that she is ineligible to receive the drug under the PBS.\n\nPrepared to do anything to prolong her daughter's life, Ms Matthews and her sister Val made it their mission to learn as much they could about Cabozantinib, and raised the $9,500 needed to buy the drug.\n\n\"After just two months taking the tablet, the specialist rang us back and said it was working, that it had stopped the growth of the major tumour, and it had stopped the growth of the tumours in her lungs,\" Ms Matthews said.\n\nMs Matthews' nieces then set up a fundraising page called Emma vs the Big C, raising enough money to pay for two more rounds, thanks to a TikTok post on Emma's story by kindness influencer Samuel Widenhofer.\n\nEmma has been taking the drug for six months and said she was grateful for the extra time it had given her with her children.\n\n\"It kills cancer cells, well, it kills a lot of cells, to the point [where] my hair turned white … but when I had a scan done it had actually killed all the active cells there so it helps me live a bit longer,\" she said.\n\nEmma Trenerry, her husband Warren and their three children have tried to live a normal life. (Supplied: Diana Matthews)\n\nWitnessing the success of the drug, Emma's specialist asked for the full price to be waived, but the request was declined, her family said.\n\nMs Matthews said if Emma paid for and survived eight rounds (16 months) of the drug, she could receive Cabozantinib from the company for free, meaning the family needed to come up with $50,000 for the five remaining rounds in the meantime.\n\nDrug available for some cancers\n\nCabozantinib is available under the PBS for treating stage-four renal cell carcinoma and for certain thyroid cancers under certain circumstances.\n\nEligible patients can receive Cabozantinib through the PBS for $31.60 or $7.70 if they hold a concession card.\n\nA federal health department spokesperson said the drug did not have Therapeutic Goods Administration approval for treating osteosarcoma.\n\n\"Using it for this purpose would be considered 'off-label', and doctors should discuss the risks and benefits with patients before prescribing,\" the spokesperson said.\n\n\"There are various medicines listed on the PBS that may be used in the treatment of osteosarcoma … which are available on the PBS without restrictions. This means any patient can access them if prescribed.\"\n\nIn Emma's case, the family said it was told there was nothing else suitable.\n\nThe Nilma Darnum football and netball community has rallied behind Emma Trenerry and her family. (ABC Gippsland: Rachael Lucas)\n\nFooty club intervenes\n\nEmma said that one of her biggest fears was that her kids would forget who she was.\n\nBut she said in her own way, she felt like she had already defeated the cancer.\n\n\" Them not having the gene, I feel like I've already beaten it. They don't have it, so it ends at me now, so I am very blessed. \"\n\nAs an animal lover, aspiring vet nurse and fan of Steve Irwin, Emma had always wanted to visit Australia Zoo in Queensland.\n\nComing to the end of her third round, and down to her last $10,000, Emma then had to decide whether to go on a holiday with her family to make some final memories, or invest in another month's worth of medication, knowing that it could prolong, but not save her life.\n\nBut the family's beloved Nilma Darnum Football Club didn't want Emma to make that decision.\n\nThe Nilma Darnum Football Netball Club has raised $74,000 for Emma Trenerry. (Supplied: Diana Matthews)\n\nEarlier this month, they organised an \"I walked to Australia Zoo for Emma\" fundraising event, in which more than 500 people walked 4,900 laps of the club's football oval, the 1,960-kilometre distance from Darnum to Australia Zoo.\n\nThey also auctioned off a dinner with former Collingwood star Nathan Buckley, raising an accumulative total of $74,000, for Emma to have a family holiday and pay for more rounds of medication.\n\nEmma, her husband and kids are enjoying a two-week trip of a lifetime on the Sunshine Coast, with the club even organising limousine transfers and a back-of-house tour of Australia Zoo so Emma could hold the animals.\n\nEmma Trenerry and her family embark on the trip of a lifetime to make some memories at Australia Zoo. (Supplied: Emma Trenerry)\n\nCommunity rallies behind Emma\n\nIn a wheelchair, and on numerous pain medications and sleeping a lot, Ms Matthews said her \"pocket rocket\" daughter was still smiling, and tried to maintain a sense of normality for the children with their schooling and sporting schedules.\n\n\"She's not one to sit down and say 'poor me'. She just gets up and does what she has to do,\" Ms Matthews said.\n\n\"She cares for people. She cares for animals. She's just kind. She's an absolutely wonderful mother and her children come first in whatever situation. Her children are her life,\" Ms Matthews said.\n\nDiana Matthews is grateful for all the support that has helped Emma Trenerry's quality of life. (ABC Gippsland: Rachael Lucas)\n\nMs Matthews is grateful for the support of family and friends who have helped out with house cleaning, taking the kids to school, transporting Emma to appointments in Melbourne, and everyone who has donated to Emma's fight.\n\nDiana Matthews wants her daughter Emma Trenerry to spend as much time with her family as she can. (Supplied: Diana Matthews)\n\n\"I can spend time with Emma now without stressing where's the money going to come from for the next lot of tablets,\" she said.\n\n\"This medication should be on the PBS for [more] people with cancer.\n\n\"They shouldn't have to pay ridiculous prices like this.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-09-02/class-action-queensland-youth-detention-centres/105719318",
        "title": "Law firm prepares for class action over youth detention in Queensland",
        "publish_date": "Mon, 01 Sep 2025 21:33:37 +0000",
        "category": "finance",
        "authors": [],
        "text": "A class action lawsuit is being prepared against the state of Queensland and the Department of Youth Justice over the treatment of juveniles at youth detention centres.\n\nThis week legal firm Levitt Robinson announced it was preparing to launch action on behalf of detainees at Cleveland, Brisbane, West Moreton, Sir Leslie Wilson and John Oxley youth detention centres.\n\nThe Sydney-based law firm also launched action against the WA government over the alleged unlawful treatment of juvenile detainees at Banksia Hill Detention Centre.\n\nFirm partner Dana Levitt said the action would be based on what was considered the punitive and unlawful conditions of detention.\n\n\"This is about ensuring that legal standards are adhered to and that the purposes and goals of detention are realised, and that isn't being done at the moment,\" she said.\n\nDana Levitt says the action is being prepared on behalf of past and present detainees. (ABC News: Patrick Thomas)\n\nThe firm says it is aiming to seek compensation for detainees who were subjected to confinement due to staff shortages and their placement in an unhygienic cell, as well as a lack of access to running water or a working toilet.\n\nThe action will also aim to seek compensation for juvenile detainees left without access to services such as education, lack of access to meaningful out of cell time and a lack of psychosocial supports.\n\n\"Whether you're an adult prisoner or a child there are certain minimum standards to which the state has to comply,\" Ms Levitt said.\n\n\"Just because you're in jail or youth detention doesn't mean that the state can treat you however they want to treat you or, indeed, how they have to treat you because they don't have enough staff working that day.\"\n\nStaff shortages and isolation\n\nThe firm's action stems from the conditions at Cleveland Youth Detention Centre in Townsville, which has long been plagued by reports of staff shortages and other issues.\n\nIn August last year, Queensland's prison watchdog flagged human rights concerns at the centre.\n\nDuring that visit, Inspector of Detention Services Anthony Reilly found children were frequently locked alone in their cells due to staffing shortages, or held in separation rooms with no toilet, bed or running water.\n\nLast month Australian Workers' Union northern district secretary Jim Wilson told the ABC he was hearing of severe, weekly staff shortages at the facility.\n\n\"We can't run the centre at the moment properly with the number of staff that we have and the way things are going at the moment,\" he said.\n\n\"We need to see some significant improvements and we need to see a genuine plan.\"\n\nHe said understaffing at Cleveland Youth Detention Centre was putting workers at risk.\n\nLevitt Robinson wants to speak to former or current detainees in five Queensland facilities. (ABC North Qld: Chloe Chomicki)\n\n\"When a young person is left in confinement for 23 hours a day they can become very volatile, so that makes them more dangerous to our staff,\" Mr Wilson said.\n\n\"In our enterprise agreement currently there's a designated ratio of no more than four young people per youth detention worker.\n\n\" Staff shortages are so bad it's very difficult for that ratio to be met pretty regularly. \"\n\nDetainees asked to come forward\n\nMs Levitt said the firm was seeking to speak with people who had been in the five Queensland youth detention centres from 2005 onwards.\n\n\"We're really looking at everything that happens to a child when they're in detention and considering them against the law that prescribes those minimum standards,\" she said.\n\nIn December last year the Crisafulli government passed its flagship \"adult crime, adult time\" laws, which involve juveniles being tried as adults for offences such as murder, manslaughter and rape.\n\nMs Levitt said tougher penalties for young people were an ineffectual way of dealing with youth crime.\n\n\"It's become incredibly clear that there is very little political will to address the causes of youth justice involved children — looking at why they end up committing crimes and looking to remediate those root causes,\" she said.\n\nYouth Justice and Victim Support Minister Laura Gerber did not respond to questions on the preparation of the class action.\n\nShe said the state government was making Queensland safer with stronger laws, more police, early intervention and rehabilitation.\n\n\"Labor created the Youth Crime Crisis and failed to build the infrastructure needed to arrest it,\" she said.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-09-02/naomi-osaka-breezes-past-coco-gauff-at-us-open/105723454",
        "title": "'Nothing's working' for Gauff as she is brushed aside by Osaka",
        "publish_date": "Mon, 01 Sep 2025 21:30:12 +0000",
        "category": "sports",
        "authors": [],
        "text": "Naomi Osaka has produced a commanding performance to knock out third seed Coco Gauff 6-3, 6-2 in a highly anticipated fourth-round showdown.\n\nThe clash between two former US Open champions — Osaka in 2018 and 2020, Gauff in 2023 — did not entirely live up to the billing as it lasted just 64 minutes and was incredibly one-sided.\n\nFour-time grand slam champion Osaka showed flashes of her old brilliance as she took control of the match from the start, while the Gauff struggled with her forehand and her serve.\n\nThe result will carry Osaka into the Flushing Meadows quarterfinals for the first time in five years and mark her first trip to the last eight of a major since winning the 2021 US Open.\n\nCoco Gauff has been tinkering with the mechanics of her play, leading to a tough US Open. (Getty Images: Clive Brunskill)\n\nShe will next play Czech 11th seed Karolína Muchová, who spent just under 3 hours on court to beat 27th seed Marta Kostyuk 6-3, 6-7(0/7), 6-3, as she shoots for her third straight semifinal berth in New York.\n\n\"It's really special. I look up to her a lot,\" Osaka said of Gauff, who she described as \"a little sister\" after her third-round win.\n\n\"The way she conducts herself is really special. To be such a role model at such a young age, I have respect for her.\"\n\nThe fourth-round match marked the first time the two fan favourites met in New York since their memorable 2019 tussle when the then-15-year-old Gauff lost to Osaka.\n\nGauff, who was coming off her shock run to the fourth round at Wimbledon, was in tears after the match, but was comforted by reigning champion Osaka, who brought her onto court with her for her post-match interview in front of adoring US fans.\n\nLoading...\n\nStill only 21 years old, but now a two-time grand slam champion, Gauff has been in tears at times during this year's tournament too, as she has struggled with consistency.\n\nThe American has spent many months trying to rebuild her serve. However, it let her down yet again as she produced a double fault on set point, one of five across the match.\n\nThe mistakes began to pile up for the American, who handed Osaka another break point with an unforced error in the sixth game of the second set and turned helplessly to her box during the final game, telling her coaches: \"Nothing's working.\"\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\nThe pair embraced briefly at the net after Gauff bowed out with a shot into the net on match point and Osaka smiled in a subdued celebration.\n\n\"I'm a little sensitive. I don't want to cry. I had so much fun out here,\" said Osaka, who has recaptured some of her best form this year with a run to the final in Montreal.\n\n\"A big thank-you to my team. We've been through a lot, it hasn't been easy but they have been by my side. I love you.\"\n\nThe ABC of SPORT Sports content to make you think... or allow you not to. A newsletter delivered each Saturday.\n\nReuters",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-09-02/federal-politics-live-sept-2/105722386",
        "title": "Live: Coalition says plan for information access charges a 'transparency tax'",
        "publish_date": "Mon, 01 Sep 2025 21:22:08 +0000",
        "category": "finance",
        "authors": [
            "Evelyn Manfield",
            "Courtney Gould",
            "Joshua Boscaini",
            "Stephen Dziedzic",
            "Sean Tarek Goodwin"
        ],
        "text": "(ABC News: Matt Roberts)\n\nGreens and crossbench MPs and Senators have joined forces to speak out about a gas leak coming from a gas storage tank near Darwin.\n\nDocuments seen by the ABC suggest the scale of the leaking pollutants could be equivalent to 8,300 new cars on the road every year it is in use.\n\nIndependent MP Monique Ryan says the leak — which hasn't been fixed — is a \"regulatory failure\".\n\n\"It is a health risk not only for territorians but for all australians but it is actively contributing as we stand here to an increase in carbon emissions,\" Ryan says.\n\nDarwin-based paediatrician Louise Woodward says the leak has been going for years and the NT Environmental Protection Agency hasn't acted.\n\nShe's called on Santos to fix the leak, and wants the federal government to legislate industrial air pollution to safeguard communities.\n\n\"Research from around the world shows that children living near gas operations have higher rates of serious illness, like asthma and cancer,\" Woodward says.\n\nGreens Leader Larissa Waters has called for \"science-based\" climate targets and a toughening of rules against oil and gas companies.\n\n\"This company cannot comply with environmental regulations, has been leaking gas for almost 20 years, can't be bothered to fix the leaks that might cost them a bit of money. They do not deserve fresh approvals,\" Waters says.\n\nIndependent Senator David Pocock has urged the federal government to \"grow a spine\" and force Santos to fix the leak before the tank is filled again.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-09-02/fremantle-dockers-americas-cup-inspiration-jordan-clark/105720342",
        "title": "America's Cup driving Dockers as club looks for maiden AFL flag",
        "publish_date": "Mon, 01 Sep 2025 21:19:03 +0000",
        "category": "sports",
        "authors": [],
        "text": "It's hard to imagine an event that would bring more people together in the heart of Fremantle than Australia's America's Cup defence of 1987.\n\nBut a first premiership for the Fremantle Dockers would surely give it a run for its money.\n\nAustralia's win in the 1983 America's Cup, ending a US stranglehold on the yachting holy grail that had lasted more than 100 years, is a moment etched in national folklore.\n\nFremantle hosted Australia's America's Cup defence in 1987. (Supplied: State Library of Western Australia)\n\nThat victory was the ultimate sporting drought breaker, and it's a theme the Dockers are looking to borrow from as they look to land the club a historic first flag.\n\nCoach Justin Longmuir revealed the theme \"bringing something special back to Freo\" had been a driver for the club this year during an interview on radio station, SEN.\n\nLast week, the Dockers took a trip to the WA Maritime Museum to visit Australia II, the vessel that delivered skipper John Bertrand the America's Cup.\n\nAustralia II, with its famed winged keel, is on display at the WA Maritime Museum. (Flickr: Ken Hodge)\n\nThe idea was the brainchild of assistant coach Jaymie Graham.\n\nDashing defender Jordan Clark says the side had bought into the magic of that occasion as it geared up for an elimination final against Gold Coast on Saturday night.\n\n\"It's been a focus all year,\" he said.\n\nEven when it all looked like going wrong for Freo, Longmuir was resolute Photo shows Justin Longmuir smiles and gestures with his hands outstretched. He has been on the receiving end of plenty of criticism this season, but Justin Longmuir's Fremantle side has 16 wins and a berth in the AFL finals.\n\n\"I think it's pretty much the first bit of silverware that was brought back to Freo, and how big it was for the Freo community.\n\n\"It gives me a bit of a glimmer of what our club [can achieve] and what we can achieve actually means for our Freo public as well.\n\n\"It's a feel-good story.\n\n\"They were down 3-1 in a [best-of-seven series]. They came back and won 4-3, so you're never truly down and out if you believe so.\"\n\nUnassuming hero\n\nClark has enjoyed his best season in the AFL, culminating in his first All-Australian blazer last week.\n\nBut the unassuming defender is not letting success go to his head.\n\n\"To be honest, it's no different [being All Australian] — I still woke up in the same house with the same mates, went to the same pub on Saturday,\" Clark said.\n\nJordan Clark (middle row, third from right) says it was surreal being named in the All-Australian team. (X: AFL Photos/Michael Willson)\n\n\"It hasn't changed my life or anything like that.\n\n\"I haven't done a whole lot of reflecting.\n\n\"The only thinking I sort of did was on the night, looking around going 'how am I even here?'\n\n\" These blokes are around me are so much better than me. \"\n\nClark feels the Dockers' togetherness is what will give them the edge as they progress through a difficult finals campaign.\n\nFremantle defender Jordan Clark believes season 2025 is wide open as the Dockers prepare for an elimination final against Gold Coast. (ABC News: Greig Johnston)\n\n\"I just feel like it's a very tight-knit club,\" Clark said.\n\n\"We've ridden the waves a bit, we've had some shocking losses, had some great wins.\n\n\"We win and lose together and I think that's what makes us pretty strong.\"\n\nDockers a 'live chance'\n\nClark said the club will need to be at their best to defeat Gold Coast, which is playing its first final in the club's 15-year history.\n\n\"You never get 120 minutes of the game on your terms,\" he said.\n\nJordan Clark is confident Fremantle can beat anyone on their day. (AAP Image: Rob Prezioso)\n\n\"I do feel like Gold Coast will, at some stages, have momentum this week.\n\n\"But if we play the way we want to play, and we know what works for us, I think we'll be very competitive.\"\n\nSerong battles through the tags to stamp credentials Photo shows Fremantle Dockers player Caleb Serong holds the football during a game. Caleb Serong has copped plenty of extra attention in 2025 but, thanks to the meditative power of LEGO, he's been able to stay at the very top of the game.\n\nAnd should they beat the Suns, Clark does not doubt the club has the mettle to go all the way and make history.\n\n\"We just take it in our stride, we have a lot of fun, we're quite youthful,\" he said.\n\n\"I truly believe any team can win any game if you rock up and play the right way.\n\n\"The final eight teams now, every single one of them is a live chance.\n\n\" We're a group that believes so heavily in ourselves and we're going to give ourselves every chance, no bones about that. \"\n\nThe ABC of SPORT Sports content to make you think... or allow you not to. A newsletter delivered each Saturday.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-09-02/aussie-joe-bugner-dies-aged-75/105723390",
        "title": "Former boxing champ 'Aussie' Joe Bugner, who fought Muhammad Ali, dies",
        "publish_date": "Mon, 01 Sep 2025 21:05:58 +0000",
        "category": "sports",
        "authors": [],
        "text": "Former heavyweight boxing champion Joe Bugner, who lived more than half his life on the Gold Coast and fought under the name \"Aussie Joe\", has died in a Brisbane care home aged 75.\n\nBorn in Hungary, Bugner made his name in Britain but only felt accepted in Australia. He won the Australian, British, European and Commonwealth belts, capping his career by becoming the oldest world heavyweight champion, albeit with one of the lower profile titles of the several on offer in the sport.\n\nAt his peak, he fought Muhammad Ali and Joe Frazier in back-to-back fights in 1973, and faced Ali again for his WBA and WBC world championships in 1975. He lost all three bouts on points, being the only man both fought but neither knocked out.\n\nAt the peak of his career, the Hungarian-born Bugner fought US heavyweight champion Muhammad Ali. (Supplied: Associated Press)\n\nHis blond locks, brash talking and pugilistic excellence made him a household name in Britain in the 1970s, but he felt he was never forgiven for ending the career of national treasure Henry Cooper and emigrated.\n\nAfter moving to Australia in 1986 he made several comebacks, partly motivated by financial issues after a vineyard investment went awry.\n\nHe became the Australian heavyweight champ in 1995, then beat James \"Bonecrusher\" Smith to win the World Boxing Federation title at the age of 48 three years later.\n\nBugner fought Ali twice, going the distance both times. (AP: Dave Pickoff)\n\nHe also appeared in the 1994 action-thriller Street Fighter alongside Jean-Claude Van Damme and Kylie Minogue, the 2003 Australian crime caper film Gettin' Square, and was a contestant in the television show I'm A Celebrity … Get Me Out Of Here in 2009.\n\nBorn Jozsef Kreul Bugner in Szoreg, southern Hungary, on March 13, 1950, he left aged six with his four siblings after the 1956 Soviet invasion. His single mother Margaret whisked them away via a bus to Yugoslavia and a night-time walk through a forest.\n\nSettling as a refugee in Britain, he made an impact in sport at school and turned professional at 17.\n\nIn the mid-1990s Bugner staged a comeback to boxing, including a victory over Vince Cervi at the Carrara Entertainment Centre on the Gold Coast. (AP: Steve Holland)\n\nKnocked out on his debut by a bus driver, he won 31 of his next 33 bouts before beating Cooper by a quarter of a point in 1971.\n\nYears later, Bugner lamented the victory.\n\n\"I wish I had never ruddy fought Henry Cooper. It got me chased out of England,\" he said.\n\n\"In the eyes of the press, I was a refugee who had come to Britain and made a fortune by beating people up.\"\n\nHis sculpted face and torso plus a defensive approach that relied heavily on a ramrod jab led to sportswriter Hugh McIlvanney remarking Bugner possessed \"the physique of a Greek statue but with fewer moves\".\n\nAli was more impressed. After Bugner survived 15 rounds in steaming heat in Kuala Lumpur he said: \"Watch out for Bugner. He'll be the champion a couple of years from now.\"\n\nThat proved wrong but Bugner kept fighting on and off for another two decades, ending with 69 wins, 13 defeats and one draw.\n\nBugner lived more than half his life on the Gold Coast and died in a Brisbane care home after being diagnosed with dementia. (AAP: Tracey Nearmy)\n\nIn 1995 he came out of retirement to beat Vince Cervi in Carrara and win the Australian title.\n\nThe following year he defeated Young Haumona for the Pacific and Australasian title.\n\nHe regained the Australian title, which he had relinquished, in 1997, defeating Colin Wilson, and defended both titles in 1998 before retiring for good in 1999.\n\nBugner spent the final years of his life in a Brisbane care home after being diagnosed with dementia. He is survived by his three children: James, Joe Jr and Amy.\n\nAAP",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-09-02/berry-consumption-prompts-apvma-dimethoate-review/105684394",
        "title": "Surge in berry consumption prompts call for pesticide review",
        "publish_date": "Mon, 01 Sep 2025 20:50:53 +0000",
        "category": "finance",
        "authors": [],
        "text": "Australians' surging appetite for berries has forced the national farm chemical watchdog to review the risk of exposure to harmful levels of a popular pesticide.\n\nBlueberry, blackberry and raspberry consumption has more than doubled in less than a decade, prompting the Australian Pesticides and Veterinary Medicines Authority (APVMA) to propose new regulations for the use of dimethoate.\n\nExecutive director of risk assessment capability, Sheila Logan, said current residue levels were unlikely to pose a serious risk to human health but safety margins needed to be reconsidered.\n\n\"I certainly wouldn't suggest that anyone needs to avoid eating berries,\" Dr Logan said.\n\nSheila Logan says berries are safe to eat. (Supplied: Australian Pesticides and Veterinary Medicines Authority)\n\nGrowers must wait one day after spraying blueberries and seven days after spraying rubus berries (blackberries and raspberries) before they can pick and send the fruit to market.\n\nDr Logan's authority has proposed that the time between spraying and picking be increased to 14 days.\n\nThat has put the watchdog at odds with the $1.3 billion industry.\n\nGrowers said the proposal would increase costs.\n\nThey said the risks could be managed with a shorter timeframe without disrupting production and pushing up prices.\n\nMeanwhile, food safety experts recommended consumers be aware of the risks, adopt safe handling practices at home and eat a diverse range of fruits.\n\nMargin of safety\n\nDimethoate has been used in Australia since the 1950s to control more than 80 insect pests in fruit, vegetables and grains.\n\nBut it was banned by the European Union in 2019 and has been classified by the United States Environmental Protection Agency as a \"possible human carcinogen\".\n\nQueensland fruit fly is one of the horticultural industry's worst pests. (Supplied: Western Australian Agricultural Authority)\n\nThe chemical has also faced increased scrutiny in Australia, most recently when the APVMA banned its use as a post-harvest dip for avocados, mangoes and other tropical fruits.\n\nTo use it, growers need a permit from the APVMA, which dictates safe usage based on acceptable residue limits.\n\nThe permit details how much of the chemical can be present in food and still be safely consumed.\n\nDr Logan said berry consumption, excluding strawberries, had risen to 1.3 kilograms per person a year, from 611 grams when the limits were last considered in 2017.\n\n\"It's a concern that there may not be that full margin of safety, which has led us to propose to suspend these uses,\" Dr Logan said.\n\n\"The key priority for the APVMA is the protection of human health and the environment.\"\n\nAnthony Poiner says dimethoate is the most effective chemical to combat Queensland fruit fly in berries. (Supplied: Fresh Produce Group)\n\nBerries Australia chair Anthony Poiner said extending the restriction period to two weeks would effectively ban the chemical.\n\n\"Berries are picked every two to seven days, so if you spray one day and have to wait 14 days, all the berries have gone overripe and are no longer usable,\" Dr Poiner said.\n\n\"Our tests are telling us that levels of residual dimethoate after 24 hours of being sprayed are low and below the medically acute level.\"\n\nDr Poiner, whose PhD is in chemistry, said dimethoate was the most effective option for controlling Queensland fruit fly, a native insect that had cost growers at least $300 million a year in control and trade restrictions.\n\nGrowers say prices could rise if dimethoate is banned. (ABC Rural: Brandon Long)\n\n\"This [suspension] would be highly damaging to the berry industry because it is the most efficacious of all the chemical applications,\" he said.\n\nHe said alternatives such as fumigation, irradiation or other chemicals were more costly and less effective, and organic production could not supply the market at scale.\n\nSafe to eat\n\nCSIRO food scientist Rozita Spirovska Vaskoska said all fresh food carried some risk.\n\nRozita Vaskoska says safe food handling practices help avoid contaminants. (Supplied)\n\n\"It's not that organic food does not have any risks, or traditionally produced food doesn't have risks, they just have differing risks,\" Dr Vaskoska said.\n\nShe said food produced in an organic system typically involved fewer chemical treatments, but it could carry a higher risk of other contaminants such as bacteria.\n\nWashing produce could reduce, but not eliminate, the risk from both, but she said eating a wide variety of foods and practicing safe food handling at home was best.\n\n\"Having variety in our diet and … following good kitchen storage and cooking practices will maintain our food safety,\" she said.\n\nDr Poiner said the industry accepted a need for caution and growers were committed to working with the regulators to find a solution.\n\n\"We should have confidence in the food we eat,\" he said.\n\nFruit fly is an established pest in multiple states. (Supplied: Department of Agriculture, Fisheries and Forestry)\n\nHe said restrictions would mean higher costs and more on-farm waste for growers in Queensland, New South Wales and Victoria, but Western Australia and Tasmania were largely fruit-fly free and would be less affected.\n\nThe APVMA said all other approved uses of dimethoate remained safe and no other chemicals used on berries required action at this stage.\n\nSubmissions on the proposed suspension are open until September 2.",
        "source": "ABC"
    },
    {
        "url": "https://www.smh.com.au/business/the-economy/trump-s-china-threat-shows-how-vulnerable-america-is-20250902-p5mroj.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Trump’s China threat shows how vulnerable America is",
        "publish_date": "Tue, 02 Sep 2025 11:57:37 +1000",
        "category": "finance",
        "authors": [
            "Stephen Bartholomeusz"
        ],
        "text": "He could, as he did early this year, deny China access to Boeing jet engines and aircraft parts. China does have some military engines it has developed itself, and its key aircraft manufacturer, Comac, is developing an engine for its C919 narrow-bodied commercial planes, but it is still heavily reliant on Boeing and Europe’s Airbus for engines and parts. He could also deny – and has been denying, until recently – China’s access to the most advanced US semiconductors. China isn’t petrified by the prospect of extreme tariff rates, as its response to Trump’s 145 per cent rate earlier this year demonstrated. Credit: Getty When Trump first slapped new tariffs on China earlier this year, China retaliated with tariff hikes of its own – and stopped allowing exports of rare earths and rare earth magnets to the US. A meeting in Sweden saw the confrontation de-escalated, with the US reducing its headline tariff rate to 30 per cent and China its rate to 10 per cent. (The headline rates are misleading because Trump added to pre-existing tariffs, dating back to his first term, and China has also been subjected to the general sectoral tariffs on commodities like steel and aluminium and products derived from them, as well as those slapped on Canada and Mexico for their claimed role in fentanyl trafficking. The Peterson Institute for International Economics puts the average US tariff on China’s exports at 57.6 per cent and China’s rate on US exports at 32.6 per cent).\n\nLoading There have since been a succession of 90-day extensions of the truce agreed in Stockholm and confirmed at a subsequent meeting of the trade negotiators in London which have deferred any final agreement on trade until early November. As part of that truce deal, China has allowed exports of rare earth magnets to resume, although it wasn’t until July, when the volume of rare earth magnet imports from China suddenly jumped 76 per cent, that the supply regained pre-confrontation levels. China knows that its dominance of rare earths and the magnets in particular – it controls more than 70 per cent of the global supply, more than 90 per cent of the processing of rare earths and more than 90 per cent of the processing and manufacturing of rare earth permanent magnets – gives it tremendous leverage over the US. When it throttled supply of the magnets earlier this year it nearly shut down the US auto industry. The magnets are also critical to many other commercial and military applications.\n\nThe US doesn’t have meaningful alternate sources of supply, although it is racing to develop some, including Defence Department funding for Australia’s Lynas Rare Earths to build a separation facility in Texas. It has also arranged a $US1 billion ($1.5 billion) debt facility, $US150 million of Defence Department loans, $US400 million of equity and a 10-year floor price – at twice the current level set by China –as part of guaranteed purchase commitment for 100 per cent of the output from America’s only significant producer, MP Materials. While China has resumed exports of rare earth magnets to the US, for instance, it appears to be limiting sales to the US defence industry. Credit: AP There are, however, estimates that it will take 15 years and $US120 billion for the US to completely distance its rare earths supply chain from China, which developed its dominance over decades. Indeed, it ambition of dominating rare earths dates back to the 1980s. China, while it might prefer to maintain its trade with the US, isn’t petrified by the prospect of extreme tariff rates, as its response to Trump’s 145 per cent rate earlier this year demonstrated.\n\nLoading Since Trump first deployed tariffs against it in 2018, Xi Jinping has deliberately diversified China’s range of trading partners and reduced its reliance on America for some key imports – it has, for instance, nearly halved its imports of soy beans, with Brazil displacing the US as its major supplier – while also developing alternate export markets in Asia and South America. Trump’s tariffs are a crude weapon, but China’s dominance of rare earths gives it the ability to use it in a highly strategic way. While it has resumed exports of rare earth magnets to the US, for instance, it appears to be limiting sales to the US defence industry. China has tightened its export controls for rare earths progressively, and recently added imports of rare earths that it processes for third parties – including MP Materials – to the continually expanding list of minerals subject to its controls and monthly monitoring. It can dial up, or down, its export quotas almost instantly and bring America’s advanced manufacturing base to a near halt.\n\nWhile Trump, understandably, has tried to play down the threat posed by China’s control of the market, it is clear that his administration does understand the degree of leverage it gives China. That’s why it backed down from its extreme tariff rates in Stockholm and that’s why it has adopted a more conciliatory tone since. Both the first Trump administration and, even more substantially the Biden administration, progressively shut semiconductors off China’s access to America’s most advanced semiconductors, with the ban on sales of Nvidia’s H20 chips maintained by the second Trump administration. A complete closure of US markets to China’s exports would hurt China’s economy, but it wouldn’t destroy it. The US has a very significant edge over China in designing the most advanced chips required for artificial intelligence.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/politics/federal/labor-could-be-dealt-first-defeat-over-delayed-home-care-for-200-000-australians-20250902-p5mrpy.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Labor could be dealt first defeat over delayed home care for 200,000 Australians",
        "publish_date": "Tue, 02 Sep 2025 11:57:35 +1000",
        "category": "finance",
        "authors": [
            "Natassia Chrysanthos"
        ],
        "text": "Labor could be dealt its first defeat on the Senate floor since its landslide election win, as the Greens, Coalition and crossbench team up to force the government to expedite the delivery of home care packages for elderly Australians who are waiting for support.\n\nThe Health Department last week revealed a backlog of 121,596 older Australians were waiting to be assessed so they could receive home care, on top of 87,000 people already on the official waitlist with approved packages that had not been released.\n\nEvery Coalition and crossbench question on Monday was directed at new Aged Care Minister Sam Rae. Credit: Alex Ellinghausen\n\nThe home care packages were delayed when the government deferred the start of its aged care reforms – set to introduce higher resident fees, stronger regulatory powers and a rebooted support-at-home scheme – from July to November.\n\nDelaying the rollout cost the federal budget $1 billion in lost savings and was based on the sector’s request for more time to prepare. But providers told a Senate inquiry on Friday that the home care packages could roll out now, even if the residential aged care changes took effect in November.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/money/super-and-retirement/lost-your-super-here-s-how-you-can-get-back-on-track-20250829-p5mquc.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Lost your super? Here’s how you can get back on track",
        "publish_date": "Tue, 02 Sep 2025 11:54:28 +1000",
        "category": "finance",
        "authors": [
            "Alex Brooks"
        ],
        "text": "Australia’s biggest superannuation scandal keeps getting bigger. Equity Trustees – which looks after the superannuation balances of 800,000 Australians – is now entangled in the “industrial-scale misconduct″⁣ connected to the collapse of Shield Master Fund.\n\nShield’s collapse, along with similar failings at First Guardian, Lion Property, and Australian Fiduciaries, has eroded the savings of thousands of retirees and investors, in what has to be some of the most significant corporate collapses in recent memory.\n\nIf you’re aged over 50 and have been caught up in these collapses or other schemes that have fallen over, here’s how to get clarity on what to do next.\n\nIf you’ve been caught up in the collapse of a fund or investment scheme, there are routes to recovery. Credit: Simon Letch\n\nStep one: take steps to recover. Liquidators and regulators are still working out if any money will be returned, but many victims – like Christian Thor Eriksen – fear they’ll get nothing.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/awkward-confessions-scandal-headlines-and-a-new-life-at-the-abc-hugh-marks-story-20250828-p5mqld.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Awkward confessions, scandal headlines and a new life at the ABC: Hugh Marks’ story",
        "publish_date": "Tue, 02 Sep 2025 11:45:00 +1000",
        "category": "finance",
        "authors": [
            "Jordan Baker"
        ],
        "text": "Save Log in , register or subscribe to save articles for later. Save articles for later Add articles to your saved list and come back to them any time. Got it Normal text size Larger text size Very large text size As a mild-mannered, middle-aged father of five, Hugh Marks is an unlikely romantic protagonist. Despite disliking soft dramas – he prefers them to be grittier – he found himself playing the lead role in a real-life one, when he fell in love with a colleague while running Nine Entertainment (the owner of this masthead). It was all very awkward for Marks, his new partner, his boss and their colleagues, so he made a decision that took many by surprise: he chose his relationship over his job. The whole thing was uncomfortable. Not many people have to disclose their new partner to a chairman, or address concerns you’ve favoured her professionally, or brace for “sex scandal” headlines, or inform the stock exchange that you’ve decided to quit. I ask whether it puts a wet blanket on romance. “As it turns out, not,” he says. “We’re getting married at the end of this year. We have a child. We have a house together. We have a lovely life.” Their life is so lovely that Marks says he wasn’t chasing another big job after leaving Nine. “I was really enjoying myself,” he says. But when the ABC managing director’s role became vacant, he felt the lure of higher purpose. “It wasn’t that it was a burning thing for me to do,” he says. “But when I thought about it, I thought, no, it’s important. To do something that’s important … I mean, it sounds a bit righteous but it’s not. Media is important. Storytelling is important. “It matters that the ABC is there as a public good … The work matters.” It’s Friday afternoon in Paddington and noisy chatter fills Italian restaurant Barbetta, one of Marks’ favourites. He has a soft voice – his mild manner is partly what prompted his tongue-in-cheek nickname, Hollywood Hugh – and we strain to hear each other over the din. I first met Marks when he became my boss, back when he oversaw the merger between Nine (of which he was chief executive) and Fairfax Media, which owned these mastheads, in 2018. These days he’s a public servant in charge of the public broadcaster, so, in a roundabout way – given I’m a taxpaying member of that public – he now works for me. He orders his favourite dish, the pork chops, and I select the ragu as I brief Marks on the usual pattern of these lunchtime interviews: as the one asking the questions, I’ll finish my meal, while he’ll be so busy answering, he won’t get a chance to eat and his food will get cold. “I’ll have to give one-word answers, then,” he says.\n\nAdvertisement\n\nHe doesn’t. Marks hasn’t done many profile-style interviews since he became managing director of the ABC five months ago and he’s at pains to explain his approach. Many at the broadcaster still aren’t quite sure what to expect. They’re uncertain of his vision, or what he plans to change, or whether he’ll be “too commercial”, or if he’ll stand up for them when the attacks come from outside, or if he sees a future for traditional radio and terrestrial television given their declining audiences, or even if he watches, listen to and reads the ABC. They can be reassured on the last point. Marks says he has always been a fan of ABC news and current affairs. He likes Wednesday-night comedy. Friday-night dramas are a bit soft for him but he’s enjoying The Family Next Door. “When I was at Nine I could watch, listen [to] and read everything,” he says. “There’s no way I can do that at the ABC.” But he watches, reads and listens to as much as he can, and does it with his work hat on. “If you have thoughts about the direction or tone or whatever, you’ve got to be thinking about all those things and talking to the teams about it,” he says. Barbetta’s ragu. Credit: Janie Barrett He no longer feels obliged to watch Married at First Sight, the Nine reality juggernaut that “marries” two single, extroverted strangers, and is not to everyone’s taste. While he has said he wants the ABC to pursue more hit shows – to find the next Bluey or MasterChef – Marks doesn’t put MAFS in that category. Still, he doesn’t shy away from the concept. “Love on the Spectrum is a different version of the same show – still a dating show, still puts people in a reality contest,” he says. “There are always different treatments of an idea.” I take Marks back to the subject of dating, given it was at the centre of his departure from the top job at Nine in early 2021. It had been his second stint at the broadcaster, after working there for eight years earlier in his career as in-house legal counsel, then director of film and television, before leaving to become chief executive of Southern Star, which produced reality show Big Brother for Ten, drama Love My Way for Foxtel, and game show Deal or No Deal for Seven.\n\nAdvertisement\n\nHe replaced David Gyngell as Nine’s chief executive in 2015. The merger he oversaw transformed Nine, creating a multi-platform company with broadcast television, streaming (Stan), publishing and radio. During that time Marks and his wife, with whom he had four children, broke up. His love life was the subject of speculation; he was photographed on a picnic with his executive assistant, who he said was an old friend. But then one of his own papers broke the story that Marks was leaving the business after he had begun a relationship with Nine’s former managing director of commercial, Alexi Baker. Marks ordered the pork cutlet at Barbetta. Credit: Janie Barrett They were two consenting adults. Still, it was messy. Questions flew about who on the board was notified and when, and if there were any promotions or bonuses for Baker. Relationships involving the chief executive and a subordinate make boards nervous. There were already fractures in the board between the Nine and the Fairfax people, and the relationship exacerbated tensions. Marks says he was thinking about leaving anyway, after the merger had been bedded down. The relationship sped up his plans. “In one sense, you can deal with relationships and stuff through disclosure and all of that,” he says. “In another, it creates pressures in the business that I just felt at the time was better for us to move on … to be able to pursue that relationship without the impediment of the organisation.” It must be awkward to have to tell higher-ups about one’s love life? “It’s awkward but it’s appropriate because the risk of conflict exists,” he says. “It’s a complex mash of personalities and responsibilities. It’s a challenge to make those decisions but it was the right decision.” The story was widely reported; some of the headlines referred to it as a “sex scandal”. I ask how he felt about the reporting, and whether he thought his relationship had been unfairly lumped into the broader category of workplace relationship scandals, particularly as it came fresh off the heels of headline-grabbers such as then federal MP Alan Tudge’s affair with a staffer, who accused him of abuse, and Barnaby Joyce’s relationship with his staffer, who he later married.\n\nAdvertisement\n\n“I think in many ways it was more unfair for Alexi than me,” he says. “That is, I think, a regret. There were certainly elements where we could have said more but chose not to, or where we thought it was unfair and we chose not to say something. We’re comfortable with our own decisions; you have to find that in yourself.” Alexi Baker and Hugh Marks at the Midwinter Ball at Parliament House last month. Credit: Alex Ellinghausen They now have a three-year-old son, Hamish, and will get married in December when Marks’ adult children, two of whom live overseas, can attend. Marks is enjoying fatherhood for the fifth time. He might have more experience at parenting than his partner but he’s conscious of not taking over. “It’s Alexi’s first child, so [I’m] trying to balance that. They’re such joys, children, they’re so interesting as individuals.” Marks is juggling fifth-time fatherhood with a big job. His experience at Nine prepared him for some elements of the role but not others. He doesn’t have to answer to corporate shareholders but ABC has its own version – the viewers and staff who feel a strong sense of ownership. Changes bring a big backlash. “I must say,” he says, “one difference between Nine and the ABC was at Nine it was always ‘can you get rid of?’ At the ABC it’s more ‘why did you get rid of?’” The cultures at Nine and ABC are different, too. The ABC staff is more unionised than Nine’s television division, staff are public servants, there’s a clear charter and a strong sense of independence from management. He’ll negotiate a new enterprise agreement later this year.\n\nAdvertisement\n\n“There’ll always be moments [of conflict],” he says, “but I hope that my approach is always to engage with people on their work. There’s a great sense of purpose at the ABC but if we can get them to buy into what we’re doing and why, I think we can hopefully get them all to come along.” Marks says he has also learnt from the exposure of the culture of sexual harassment at Nine’s broadcast division, which exploded into the public eye last year but was happening while he was chief executive (he says the harassment allegations were never bought to him and were a surprise). One way to stop those cultures from developing, he says, is to keep an open dialogue with staff, and to listen as well as talk. He admits he has become better at this over the past decade, given his personal travails. “My empathy levels have also gone way up,” he says. “I think you do learn every time something negative happens.” He is deeply interested in journalism. He is not trained as a journalist but likes to talk to journalists about their stories and provide feedback, which makes some ABC staff – who spoke to this masthead on the condition of anonymity, so they could speak freely – nervous about independence, although others like that he values their work. He also wants the ABC to break more stories with impact. This is easier said than done; every journalist wants strong stories but they don’t grow on trees. Investigative journalism, in particular, is expensive. Kim Williams, ABC chair, has been in hot water for raising concerns directly with radio management about editorial decisions on comedian Sandy Gutman. Credit: Alex Ellinghausen “Yes, it’s difficult,” Marks says. “Often it’s just having the intellect, when you’ve got a story, to challenge you on … angles and layers that you may not have thought about,” he says. He sees his role as “an overview, looking at tone and balance, fairness, entertainment value and quality”.\n\nAdvertisement",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/goodfood/melbourne-eating-out/the-frankston-cafe-with-a-genre-defining-chilli-scramble-you-can-smell-down-the-street-20250902-p5mrqn.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "The Frankston cafe with a ‘genre-defining’ chilli scramble you can smell down the street",
        "publish_date": "Tue, 02 Sep 2025 11:39:41 +1000",
        "category": "finance",
        "authors": [
            "Dani Valent"
        ],
        "text": "Add articles to your saved list and come back to them anytime.\n\nCommonfolk coffee now has an all-day venue just two blocks back from the beach.\n\n1 / 7 Ugandan-style chilli scramble is a certified brunch banger. Simon Schluter 2 / 7 The green smash. Simon Schluter 3 / 7 Commonfolk’s ‘Franga’ coffee mugs sold out on the cafe’s first morning. Simon Schluter 4 / 7 Brisket and eggs. Simon Schluter 5 / 7 The 50-seat cafe plays music on vinyl and has a large communal table. Simon Schluter 6 / 7 Lamb shoulder with smoked almond romesco. Simon Schluter 7 / 7 Inside Commonfolk in Frankston. Simon Schluter Previous Slide Next Slide\n\nCafe$$$$\n\nThirteen-year-old coffee company Commonfolk has opened a new cafe in Frankston with a genre-defining chilli scramble and a big ambition. The 50-seat corner cafe is in an old op shop two blocks from the beach and a five-minute walk from Frankston Station. It replaces a smaller Commonfolk location in the suburb.\n\nThe spacious room has a warm look with coffee-coloured Tuscan tiles, a high communal table with stools that makes a virtue of a central structural pillar, music on vinyl and big windows that promote an indoor-outdoor feel. A good way to blast yourself into the Commonfolk orbit is to order a Yin Yang coffee duo ($8) featuring their Peruvian “Castle in the Sky” blend. You’ll get an espresso and a magic to experience the smooth, apricot-tinged chocolatey roast in two different ways.\n\nChef Kyle Noll (ex-Hatter and the Hare, Locavore Studio) is running an all-day menu that includes half-serves of many items. That hero chilli scramble is strewn with a Ugandan-style tumble of crisp spices with turtle beans and curry powder. The dish is a nod to Zukuka Bora, a Ugandan coffee producer-partner of Commonfolk since 2014. Soft scrambled eggs are layered up with that chilli, dill-infused labne, fermented garlic and preserved lemon for a certified brunch banger. Lamb shoulder with roasted beetroot would be at home in any quality bistro, and a well-constructed avo smash is boosted by green tahini and smashed chickpeas.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/politics/nsw/nsw-s-2-3-million-renters-were-promised-protection-then-the-premier-acted-for-landlords-twice-20250829-p5mqyh.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "NSW’s 2.3 million renters were promised protection. Then the premier acted for landlords, twice",
        "publish_date": "Tue, 02 Sep 2025 11:30:00 +1000",
        "category": "finance",
        "authors": [
            "Max Maddison"
        ],
        "text": "NSW Premier Chris Minns has intervened to make two policies designed to favour renters more friendly to landlords, overruling the responsible minister and blindsiding stakeholders.\n\nSources speaking on the condition of anonymity to detail confidential discussions said Minns moved to make it easier for landlords to prevent pets in their rental properties in September last year, then, in May, loosened restrictions on landlords evicting tenants because of planned renovations.\n\nOver the past year, Labor has implemented a raft of rental reforms, promised before the 2023 state election, to protect the more than 2.3 million tenants in NSW, barring no-grounds evictions, limiting rent increases to one per year, and providing a fee-free means of payment.\n\nPremier Chris Minns unilaterally changed rental reforms to make it easier for landlords to prevent pets in rental properties. Credit: Marija Ercegovac\n\nAfter months of consultation, NSW Better Regulation and Fair Trading Minister Anoulack Chanthivong had settled on draft legislation for allowing pets in rental properties. In line with similar reforms in ACT and Victoria, landlords would have to apply to a tribunal to refuse such a request.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/queensland/brisbane-news-live-brisbane-2032-secures-marketing-whiz-no-excuses-for-protest-behaviour-says-rishworth-20250901-p5mrko.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Brisbane news LIVE: Mayor applauds call to scrap Gold Coast tram plan; Visitors urged to chuck Sunny Coast sickie; New CBD Metro tunnel to open",
        "publish_date": "Tue, 02 Sep 2025 11:13:39 +1000",
        "category": "finance",
        "authors": [],
        "text": "Brisbane Lord Mayor Adrian Schrinner has applauded the state’s decision to scrap stage four of the Gold Coast light rail, saying a hybrid tramline and busway travel route will be better value for money.\n\nDeputy Premier Jarrod Bleijie announced the decision yesterday, citing cost concerns and community consultation from residents on the southern end of the Gold Coast who had opposed the project.\n\nToday, Schrinner said a metro-style rapid transit busway was a “practical, common-sense solution”.\n\nAs we head towards the 2032 Games, the focus has to be on projects that are reliable, scalable and value for money. Metro is quicker to deliver, more flexible to run and better value than light rail.\n\nSchrinner said he was pleased the state had used Brisbane’s Metro as a benchmark for other cities in the south-east, and said rapid bus transit was “the only timely and affordable way to keep our region moving in the near future”.\n\nLoading\n\nGold Coast Mayor Tom Tate and Opposition Leader Steven Miles both said they were disappointed in the outcome yesterday, with Tate adding that axing the light rail would skewer the Gold Coast’s 2032 Games transport legacy.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/nrl/nrl-around-the-clubs-round-27-20250831-p5mr9y.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "NFL hopeful who blew Viking horn in Vegas sacked and suspended",
        "publish_date": "Tue, 02 Sep 2025 11:12:45 +1000",
        "category": "sports",
        "authors": [
            "Adrian Proszenko",
            "Christian Nicolussi",
            "Michael Chammas"
        ],
        "text": "The NFL wannabe who was kicked out of Allegiant Stadium shortly after blowing the Viking horn has been cut by the Las Vegas Raiders and suspended for two games.\n\nTyler Manoa, a 25-year-old defensive tackle, was given the honour of blowing a custom-made horn that was constructed solely for the purposes of marking Canberra’s debut in the United States in the opening round of the season.\n\nTyler Manoa may have jeopardised his NFL career moments after blowing the Viking horn. Credit: Fox Sports\n\nCanberra had reached out to a number of celebrities - including Dana White, Tom Brady, Rob Gronkowski and Las Vegas Raiders head coach Pete Carroll - in the hope they would be available. When they all declined, Manoa - who is yet to make his run-on NFL debut - was enlisted for the job.\n\nShortly after blowing the horn, Manoa was ejected from the stadium for misbehaviour in the corporate area. Then a member of the Las Vegas Raiders’ practice squad, it’s alleged Manoa damaged property inside the restrooms, with some reports suggesting he was also tasered.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/cricket/sore-australia-captain-pat-cummins-sweats-on-back-scans-before-ashes-20250901-p5mrla.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Cummins ‘hot spots’ cloud Ashes preparation as Starc quits T20s",
        "publish_date": "Tue, 02 Sep 2025 11:10:07 +1000",
        "category": "sports",
        "authors": [
            "Daniel Brettig"
        ],
        "text": "Pat Cummins has been cleared of a stress fracture that would have put him out of the Ashes, but scans have confirmed a “hot spot” in the Australian captain’s back that will require careful management ahead of the first Test of the series in Perth.\n\nLeft-armer Mitchell Starc, meanwhile, has retired from Twenty20 internationals in order to prolong his Test career for Australia.\n\nAustralian skipper Pat Cummins. Credit: AP\n\nScans conducted in Sydney on Monday were reviewed overnight, and Cricket Australia confirmed on Tuesday that Cummins will miss the white-ball games at home against India that precede the five Tests against England.\n\nHe will also be missing from a T20 trip to New Zealand, the squad for which was also missing Starc due to his decision to retire from the short format. Starc’s 79 wickets is second to Adam Zampa among Australian T20 bowlers, but he has been in and out of the Australian T20 team in recent years, infamously being dropped during the 2022 World Cup on home soil.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/tennis/bublik-celebrates-rare-win-over-sinner-20250902-p5mrql.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Bublik celebrates rare win over Sinner",
        "publish_date": "Tue, 02 Sep 2025 11:04:42 +1000",
        "category": "sports",
        "authors": [],
        "text": "Bublik celebrates rare win over Sinner\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/culture/music/he-lost-all-hope-after-his-mother-died-then-a-random-song-saved-his-career-20250825-p5mply.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "He lost all hope after his mother died. Then a random song saved his career",
        "publish_date": "Tue, 02 Sep 2025 11:00:00 +1000",
        "category": "entertainment",
        "authors": [
            "Robert Moran"
        ],
        "text": "Save Log in , register or subscribe to save articles for later. Save articles for later Add articles to your saved list and come back to them any time. Got it Normal text size Larger text size Very large text size All of a sudden, music felt completely insignificant to Dev Hynes. In early 2023, just as he was preparing to perform a selection of his classical works at the Sydney Opera House, his mother fell sick and was admitted to hospital. Hynes returned to his childhood home in Ilford, in Essex in England, to be by her bedside. Within two months, she had died. He cancelled the Opera House gig, and several other shows, as he took “time to grieve and focus on getting myself together”. Music had been a constant in Hynes’ life since childhood. He’d started piano lessons at seven and cello at nine, and launched his career in the early aughts in British dance-punk phenoms Test Icicles. As Blood Orange, he’d released several acclaimed solo albums and written and produced revered releases for Sky Ferreira, Solange Knowles and Carly Rae Jepsen. “It just didn’t matter,” recalls Hynes in a faded Iron Maiden T-shirt from his home in New York, where he’s been based for 17 years. “I really didn’t see a point in it any more.” After his mother’s funeral, to get some distance from the grief of home, Hynes rented a place in Paris, just a brief rail ride from London. One day, as he was tinkering around the apartment, the algorithm served up a song he’d never heard before that stopped him in his tracks. It was Sufjan Stevens’ Fourth of July. “I’m a Sufjan fan and I’m a music obsessive, but I have these crazy music holes where I just miss things, right? But this song came on and it felt like it was speaking to me. It sounded like it was inside my head,” says Hynes. “It was so visceral and intense.” Fourth of July is a track from Carrie & Lowell, Sufjan Stevens’ harrowing album about the death of his estranged mother. At the time, Hynes knew nothing of the song’s backstory. “It was quite striking to me because I didn’t know the story, but it went right inside and I understood the song completely. How many mediums can do that? I’m not Sufjan, but I had this feeling of wow, I can’t believe my occupation is the same as the person who made this, I’m involved in a pretty magical medium. And that was the drive I needed.” The result is Essex Honey, Hynes’ first new Blood Orange project since 2018’s acclaimed Negro Swan. He’d continued making music in the intervening years, including film scores for Queen & Slim (2019) and Paul Schrader’s Master Gardener (2022), as well as writing and producing for hardcore stars Turnstile and Argentinian singer Nathy Peluso (for which he won a Latin Grammy in 2024). But why the break from releasing music as Blood Orange?\n\nAdvertisement\n\n“There was a little bit of, what’s the point?” admits Hynes. “Music was always being made, I never stopped, but I would think to myself: why does it need to be released? It’s a noisy world, and there’s a lot of shit getting thrown at us daily. I don’t want to add my shit to that noise. Why would I do that?” Essex Honey, the first Blood Orange album since 2018, finds Hynes looking back to his childhood. It’s not the usual mindset for a successful musician. “I still feel that a lot, and I have to remind myself that it’s a privilege,” says Hynes. “I’m quite lucky that, a) I know how to make music, and b) I have opportunities to release it, and c) there are people that would actually like to hear it. I think about all that and it’s like, ‘get over yourself’,” he laughs. That it’s officially 20 years since his first professional release – Test Icicles’ blog-hit Boa Vs Python came out on August 1, 2005 – has also played on Hynes’ mind. “I never could have dreamt, 20 years ago, that I’d still be releasing albums,” he says. “I think of all the incredible musicians who don’t have those opportunities, and I think of myself as a teenager, and I have to put something out, even if it’s only one person who listens to it while they’re at the gym or something. Like, that’s cool!” ‘It’s a noisy world, and there’s a lot of shit getting thrown at us daily. I don’t want to add to that noise.’ Due to the time he spent back in Ilford, by his mother’s side and among his childhood haunts, memory and the formative influence of music became key catalysts for Essex Honey. Throughout the album, snippets of well-known songs act like launchpads to memories and emotions, like Proust’s madeleines turned musical. On Westerberg, Hynes sings the hook from the Replacements’ Alex Chilton – a sort of boomerang tribute back to Paul Westerberg – to honour the music that made him. On Mind Loaded, he sings Elliott Smith’s Everything Means Nothing to Me to evoke both grief and the unifying comfort of pop melancholy. On The Field, Hynes calls in Vini Reilly to recreate the Durutti Column’s Sing To Me. The references act like totems – to comfort, hope, excitement, his mother – in the same way that Sufjan’s Fourth of July helped Hynes reengage with the magical potential of music that, in the midst of grief, had evaded him.\n\nAdvertisement\n\n“Thinking about being younger and listening to music was an enormous part of [this album], and so it felt like the most honest thing to do and the most natural way to do it,” says Hynes of using such recognisable musical cues. “George Saunders, the writer, says the reason why his stories are so crazy is because he will use any device that gets the necessary emotion across. I feel the same way musically – I don’t care what it is, I will do it.” On Essex Honey, Hynes also finds a way to integrate the classical training he’s had since youth. Songs build around orchestral improvisations and float freely like sheet music in the wind. Highlight Vivid Light – featuring woodwind bursts, an acid house break beat, and author Zadie Smith singing about writer’s block – sounds like you’re listening to a jam session happening in another room down the hall. “Years ago I would keep [my classical work] quite separate because I was scared those connotations would overwhelm the listening experience for people – even though, in my mind, it is all just me making stuff,” says Hynes. “What’s happened is I’m a lot looser and a lot easier on myself now, and in that sense the approach to making music has let things seep in and talk to each other. Before, I would only make things that were, quote-unquote ‘Blood Orange’. But now I trust that since it’s me making it, it will turn out Blood Orange anyway.” Loading Beyond Vini Reilly and Zadie Smith, Essex Honey features a who’s who of cameos from Hynes’ friends, including Caroline Polachek, Brendan Yates from Turnstile, Mustafa the Poet and even pop superstar Lorde. Hynes worked on Lorde’s new album Virgin, playing cello, bass, guitar and synths on multiple tracks including single Man of the Year. “Working on other people’s music is probably the peak of fun musically for me,” says Hynes. His strength in sessions is being a pliable jack of all trades. “When I work on someone else’s music, I’m completely at service to them. If they want ideas, I can give ideas. If they just want keyboards, I can give keyboards. However they want it to go, I’m down, I just need to know. And then it’s super fun for me.”\n\nAdvertisement",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/lifestyle/fashion/anna-wintour-2-0-meet-the-new-editor-of-vogue-20250902-p5mroe.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Anna Wintour 2.0: Meet the new editor of Vogue",
        "publish_date": "Tue, 02 Sep 2025 10:59:15 +1000",
        "category": "lifestyle",
        "authors": [
            "Damien Woolnough"
        ],
        "text": "At the first show of New York Fashion Week on September 11, all eyes will be on the front row rather than the clothes by Michael Kors. There’s a new sheriff in town, wearing Chanel instead of a gold star (they are so last season), with reports that Anna Wintour has appointed Chloe Malle as the new head of editorial content for American Vogue.\n\nAfter nearly four decades of focusing on the inscrutable gaze of outgoing editor-in-chief Wintour, with her signature sharp bob and sunglasses, designers will look to the amiable expression of Malle resting beneath corkscrew curls, for hints on whether their collection will make the pages of the enduring fashion magazine.\n\nHaving worked at Vogue since 2011, currently as editor of Vogue.com, the 39-year-old Malle has the necessary experience to sit in Wintour’s chair, but it’s her Hollywood pedigree that has prepared her for this close-up.\n\n“The child of Candice Bergen and the late auteur director Louis Malle, she arrives with pop culture bona fides,” Puck journalist Lauren Sherman wrote in her announcement of the appointment. Bergen, the star of nineties sitcom Murphy Brown not only played a Vogue staffer in the Sex and the City series, she appeared on the magazine cover twice as a model in 1967 and 1969.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/business/markets/asx-set-to-dip-global-markets-rise-wall-street-closed-20250902-p5mrmv.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "ASX slides lower; Trump crypto token starts trading",
        "publish_date": "Tue, 02 Sep 2025 10:53:07 +1000",
        "category": "finance",
        "authors": [
            "Staff Reporter"
        ],
        "text": "The Australian sharemarket slipped at the open with energy and consumer stocks weighing on the index, with a number of high-profile stocks trading ex-dividend on Tuesday.\n\nThe S&P/ASX200 was 36.4 points, or 0.4 per cent, lower at 8891.3 in early trade, with eight of 11 industry sectors lower. Wall Street was closed overnight for the Labor Day holiday in the US.\n\nThe ASX has lost ground on Tuesday. Credit: Oscar Colman\n\nMining stocks were mixed. Iron ore heavyweights BHP (up 0.5 per cent) and Rio Tinto (up 0.4 per cent) rose while rival Fortescue slipped 0.4 per cent. Among gold players, Evolution rose 0.4 per cent, but Northern Star lost 1 per cent as it traded ex-dividend. Newmont dipped 0.1 per cent.\n\nEnergy stocks fell after oil prices retreated. Woodside shed 0.8 per cent in early trade, while Santos, which is trading ex-dividend, slumped by 2.5 per cent.",
        "source": "SMH"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/the-number-of-people-dead-in-afghanistans-earthquake-rises-to-over-800-morning-news/qm7121a7a",
        "title": "The number of dead in Afghanistan's earthquake rises to over 800 | Morning News bulletin 2 September 2025",
        "publish_date": "Mon, 1 Sep 2025 21:00:25 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/video/rare-earth-minerals-what-they-are-and-why-australia-matters/5d5u2vym3",
        "title": "Rare earth minerals: What they are and why Australia matters?",
        "publish_date": "Mon, 1 Sep 2025 11:47:40 +0000",
        "category": "finance",
        "authors": [],
        "text": "Rare earth minerals: What they are and why Australia matters?\n\nPublished 1 September 2025, 9:27 am\n\nGlobal demand for rare earth minerals is surging and many of them lie under Australian soil. But what exactly are they and why are they important?",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/video/shark-nets-return-to-nsw-beaches-amid-calls-for-change/b3tigjwrk",
        "title": "Shark nets return to NSW beaches amid calls for change",
        "publish_date": "Mon, 1 Sep 2025 11:39:56 +0000",
        "category": "finance",
        "authors": [],
        "text": "Shark nets return to NSW beaches amid calls for change\n\nPublished 1 September 2025, 10:43 am\n\nThe start of spring ushers in the start of the shark net season for New South Wales beaches. The annual program is designed to mitigate attacks. But debate about whether to scrap them has reignited and now net free beaches will be trialled.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/video/support-program-helps-ease-housing-struggles-for-regional-workers/8m7nehdg1",
        "title": "Support program helps ease housing struggles for regional workers",
        "publish_date": "Mon, 1 Sep 2025 11:33:56 +0000",
        "category": "finance",
        "authors": [],
        "text": "Support program helps ease housing struggles for regional workers\n\nPublished 1 September 2025, 9:25 am\n\nMany regional towns across Australia struggle to attract essential workers - including doctors, teachers and aged-care staff with a lack of affordable housing among the key factors exacerbating the issue. An initiative, currently operating in parts of regional New South Wales, is looking to change that by offering essential workers support to help ease the transition and make them feel welcome in their new communities.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/spring-season-property-hotspots-reporting-season-fallout/u6jn8r0fh",
        "title": "Spring season property hotspots & reporting season fallout",
        "publish_date": "Mon, 1 Sep 2025 09:05:26 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/australia-avoids-latest-round-of-us-tariffs-midday-news-bulletin-1-august-2025/le76fst46",
        "title": "Australia avoids latest round of US tariffs | Midday News Bulletin 1 August 2025",
        "publish_date": "Mon, 1 Sep 2025 02:00:00 +0000",
        "category": "finance",
        "authors": [],
        "text": "Key Points Australia avoids latest round of White House tariffs\n\nUluru Dialogue condemns lack of progress on Closing the Gap\n\nAustralia triumphs in women's 200 metre freestyle relay at World Championships\n\nListen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nAustralia has avoided a fresh wave of tariffs, after the Trump administration announced new import taxes targeting dozens of other countries.\n\n\n\n\n\nThe White House confirmed that President Trump would raise tariffs on products from nations that, in his words, failed to engage in negotiations with the United States or to align on economic and national security matters.\n\n\n\n\n\nAustralia has been spared, with its goods to remain under a baseline 10 per cent tariff.\n\n\n\n\n\nBy contrast, New Zealand imports will face a 15 per cent rate, while Canada and others have been hit with even harsher penalties.\n\n\n\n\n\nThe decision comes amid ongoing U-S concerns over non-tariff trade barriers, including Australia’s biosecurity rules.\n\n\n\n\n\nCanberra recently eased restrictions on American beef, but ministers insist the timing was unrelated to the tariff announcement.\n\n\n\n---\n\n\n\n\n\nThe Uluru Dialogue has issued a strong statement ahead of the Garma Festival, declaring 'enough is enough' on Closing the Gap.\n\n\n\n\n\nIt says progress has stalled, and in some areas, is going backwards.\n\n\n\n\n\nIt blames government inaction, outdated bureaucracy, and the ongoing exclusion of Indigenous voices.\n\n\n\n\n\nIn a statement, the Uluru Dialogue says without a Voice to Parliament, decisions are still being made without Indigenous input.\n\n\n\n\n\n\"We continue to be sold the status quo as the solution, but how can we see any progress on Closing the Gap by doing more of the same? Our children are being locked up, our Elders are dying, and our people are continuing to live in a country where their rights are neglected. Their voices and calls for help falling on deaf ears.\"\n\n\n\n\n\nClosing the Gap is a national plan to improve health, education, and life expectancy for First Nations people, but only four of 19 targets are on track.\n\n\n\n\n\nThe government is expected to highlight progress on 10 of 15 measures at Garma, but the group says that won’t resonate with struggling communities.\n\n\n\n\n\nThe Garma Festival runs from today to the 4th of August in northeast Arnhem Land, on Yolngu country.\n\n\n\n---\n\n\n\n\n\nAn underworld war looms in Melbourne after the daylight execution of 26-year-old Athan Boursinos, who had known links to organised crime.\n\n\n\n\n\nThe son of a former police officer, he was gunned down around 9:30am yesterday outside his home in Wollert as he was heading to court, a tactic often used by gangs to ambush rivals.\n\n\n\n\n\nEight shots were heard by neighbours.\n\n\n\n\n\nDetective Inspector Dean Thomas is with the Victoria Police.\n\n\n\n\n\n\"This is deliberate and obviously targeted. We will work now to piece together what has gone on.\"\n\n\n\n\n\nAthan Boursinos had been a person of interest in the killing of underworld figure Sam Abdul Rahim, and his death has sparked concerns of violent retaliation linked to the ongoing illicit tobacco wars.\n\n\n\n\n\nPolice says investigators are now working to prevent further bloodshed.\n\n\n\n---\n\n\n\n\n\nRussian missile and drone attacks have killed at least 15 people and injured 155 others in Kyiv, as Russia's President defies United States President Donald Trump's ceasefire deadline.\n\n\n\n\n\nRescue crews were seen sifting through the debris following attacks on 27 locations across four Kyiv districts Thursday night.\n\n\n\n\n\nSenior US diplomat John Kelley tells the 15-member United Nations Security Council that President Trump wants a deal to end Russia’s war in Ukraine within one week.\n\n\n\n\n\n\"Both Russia and Ukraine must negotiate a ceasefire and durable peace. It is time to make a deal. President Trump has made clear this must be done by August 8. The United States is prepared to implement additional measures to secure peace.\"\n\n\n\n---\n\n\n\n\n\nTwo Australians arrested by Israeli forces aboard the Freedom Flotilla boat Handala have returned safely to Australia.\n\n\n\n\n\nTan Safi and Robert Martin were among 19 activists trying to breach Israel’s blockade of Gaza to deliver aid including nappies and baby formula.\n\n\n\n\n\nThe boat was intercepted in international waters on the 26th of July by Israeli soldiers and towed to Ashdod.\n\n\n\n\n\nThis morning, supporters greeted them at the airport waving Palestinian flags and chanting as they reunited with loved ones.\n\n\n\n\n\nMs Safi describes the treatment they faced in Israeli custody, especially that of fellow activist Chris Smalls, co-founder of the Amazon Labor Union.\n\n\n\n\n\n\"They pinned him down on the floor, seven or eight of them, and when i asked about him, they came into the room and dragged me out by my arms. I'm still bruised here on my arms from it. They pulled me out and threw me down on the floor, and they made me take off all my clothes. They strip searched me right there, made me, squat, up and down, and then go through all my things. And after that, maybe an hour passed, and we were able to see someone from the Australian Embassy.\"\n\n\n\n\n\nThe Handala was part of a wider Freedom Flotilla effort to raise awareness about conditions in Gaza.\n\n\n\n\n\nAll foreign nationals have since been deported from Israel.\n\n\n\n---\n\n\n\n\n\nTo sport and in swimming, Australia has won the women’s four by 200 metre freestyle relay final at the World Championships in Singapore.\n\n\n\n\n\nThe victory, securing Mollie O’Callaghan 11 world titles - equal to the record set by legend of the pool, fellow Australian Ian Thorpe.\n\n\n\n\n\nKyle Chalmers placed third 100 metres freestyle final at the event overnight.\n\n\n\n\n\nThe Australian came close to breaking the 46-second barrier in the race but fell just short of the mark.\n\n\n\n\n\nChalmers tells Channel 9 he is content with the result as he focuses on the arrival of his child.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.theage.com.au/business/the-economy/trump-s-china-threat-shows-how-vulnerable-america-is-20250902-p5mroj.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Trump’s China threat shows how vulnerable America is",
        "publish_date": "Tue, 02 Sep 2025 11:57:37 +1000",
        "category": "finance",
        "authors": [
            "Stephen Bartholomeusz"
        ],
        "text": "He could, as he did early this year, deny China access to Boeing jet engines and aircraft parts. China does have some military engines it has developed itself, and its key aircraft manufacturer, Comac, is developing an engine for its C919 narrow-bodied commercial planes, but it is still heavily reliant on Boeing and Europe’s Airbus for engines and parts. He could also deny – and has been denying, until recently – China’s access to the most advanced US semiconductors. China isn’t petrified by the prospect of extreme tariff rates, as its response to Trump’s 145 per cent rate earlier this year demonstrated. Credit: Getty When Trump first slapped new tariffs on China earlier this year, China retaliated with tariff hikes of its own – and stopped allowing exports of rare earths and rare earth magnets to the US. A meeting in Sweden saw the confrontation de-escalated, with the US reducing its headline tariff rate to 30 per cent and China its rate to 10 per cent. (The headline rates are misleading because Trump added to pre-existing tariffs, dating back to his first term, and China has also been subjected to the general sectoral tariffs on commodities like steel and aluminium and products derived from them, as well as those slapped on Canada and Mexico for their claimed role in fentanyl trafficking. The Peterson Institute for International Economics puts the average US tariff on China’s exports at 57.6 per cent and China’s rate on US exports at 32.6 per cent).\n\nLoading There have since been a succession of 90-day extensions of the truce agreed in Stockholm and confirmed at a subsequent meeting of the trade negotiators in London which have deferred any final agreement on trade until early November. As part of that truce deal, China has allowed exports of rare earth magnets to resume, although it wasn’t until July, when the volume of rare earth magnet imports from China suddenly jumped 76 per cent, that the supply regained pre-confrontation levels. China knows that its dominance of rare earths and the magnets in particular – it controls more than 70 per cent of the global supply, more than 90 per cent of the processing of rare earths and more than 90 per cent of the processing and manufacturing of rare earth permanent magnets – gives it tremendous leverage over the US. When it throttled supply of the magnets earlier this year it nearly shut down the US auto industry. The magnets are also critical to many other commercial and military applications.\n\nThe US doesn’t have meaningful alternate sources of supply, although it is racing to develop some, including Defence Department funding for Australia’s Lynas Rare Earths to build a separation facility in Texas. It has also arranged a $US1 billion ($1.5 billion) debt facility, $US150 million of Defence Department loans, $US400 million of equity and a 10-year floor price – at twice the current level set by China –as part of guaranteed purchase commitment for 100 per cent of the output from America’s only significant producer, MP Materials. While China has resumed exports of rare earth magnets to the US, for instance, it appears to be limiting sales to the US defence industry. Credit: AP There are, however, estimates that it will take 15 years and $US120 billion for the US to completely distance its rare earths supply chain from China, which developed its dominance over decades. Indeed, it ambition of dominating rare earths dates back to the 1980s. China, while it might prefer to maintain its trade with the US, isn’t petrified by the prospect of extreme tariff rates, as its response to Trump’s 145 per cent rate earlier this year demonstrated.\n\nLoading Since Trump first deployed tariffs against it in 2018, Xi Jinping has deliberately diversified China’s range of trading partners and reduced its reliance on America for some key imports – it has, for instance, nearly halved its imports of soy beans, with Brazil displacing the US as its major supplier – while also developing alternate export markets in Asia and South America. Trump’s tariffs are a crude weapon, but China’s dominance of rare earths gives it the ability to use it in a highly strategic way. While it has resumed exports of rare earth magnets to the US, for instance, it appears to be limiting sales to the US defence industry. China has tightened its export controls for rare earths progressively, and recently added imports of rare earths that it processes for third parties – including MP Materials – to the continually expanding list of minerals subject to its controls and monthly monitoring. It can dial up, or down, its export quotas almost instantly and bring America’s advanced manufacturing base to a near halt.\n\nWhile Trump, understandably, has tried to play down the threat posed by China’s control of the market, it is clear that his administration does understand the degree of leverage it gives China. That’s why it backed down from its extreme tariff rates in Stockholm and that’s why it has adopted a more conciliatory tone since. Both the first Trump administration and, even more substantially the Biden administration, progressively shut semiconductors off China’s access to America’s most advanced semiconductors, with the ban on sales of Nvidia’s H20 chips maintained by the second Trump administration. A complete closure of US markets to China’s exports would hurt China’s economy, but it wouldn’t destroy it. The US has a very significant edge over China in designing the most advanced chips required for artificial intelligence.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/politics/federal/labor-could-be-dealt-first-defeat-over-delayed-home-care-for-200-000-australians-20250902-p5mrpy.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Labor could be dealt first defeat over delayed home care for 200,000 Australians",
        "publish_date": "Tue, 02 Sep 2025 11:57:35 +1000",
        "category": "finance",
        "authors": [
            "Natassia Chrysanthos"
        ],
        "text": "Labor could be dealt its first defeat on the Senate floor since its landslide election win, as the Greens, Coalition and crossbench team up to force the government to expedite the delivery of home care packages for elderly Australians who are waiting for support.\n\nThe Health Department last week revealed a backlog of 121,596 older Australians were waiting to be assessed so they could receive home care, on top of 87,000 people already on the official waitlist with approved packages that had not been released.\n\nEvery Coalition and crossbench question on Monday was directed at new Aged Care Minister Sam Rae. Credit: Alex Ellinghausen\n\nThe home care packages were delayed when the government deferred the start of its aged care reforms – set to introduce higher resident fees, stronger regulatory powers and a rebooted support-at-home scheme – from July to November.\n\nDelaying the rollout cost the federal budget $1 billion in lost savings and was based on the sector’s request for more time to prepare. But providers told a Senate inquiry on Friday that the home care packages could roll out now, even if the residential aged care changes took effect in November.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/money/super-and-retirement/lost-your-super-here-s-how-you-can-get-back-on-track-20250829-p5mquc.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Lost your super? Here’s how you can get back on track",
        "publish_date": "Tue, 02 Sep 2025 11:54:28 +1000",
        "category": "finance",
        "authors": [
            "Alex Brooks"
        ],
        "text": "Australia’s biggest superannuation scandal keeps getting bigger. Equity Trustees – which looks after the superannuation balances of 800,000 Australians – is now entangled in the “industrial-scale misconduct″⁣ connected to the collapse of Shield Master Fund.\n\nShield’s collapse, along with similar failings at First Guardian, Lion Property, and Australian Fiduciaries, has eroded the savings of thousands of retirees and investors, in what has to be some of the most significant corporate collapses in recent memory.\n\nIf you’re aged over 50 and have been caught up in these collapses or other schemes that have fallen over, here’s how to get clarity on what to do next.\n\nIf you’ve been caught up in the collapse of a fund or investment scheme, there are routes to recovery. Credit: Simon Letch\n\nStep one: take steps to recover. Liquidators and regulators are still working out if any money will be returned, but many victims – like Christian Thor Eriksen – fear they’ll get nothing.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/awkward-confessions-scandal-headlines-and-a-new-life-at-the-abc-hugh-marks-story-20250828-p5mqld.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Awkward confessions, scandal headlines and a new life at the ABC: Hugh Marks’ story",
        "publish_date": "Tue, 02 Sep 2025 11:45:00 +1000",
        "category": "finance",
        "authors": [
            "Jordan Baker"
        ],
        "text": "Save Log in , register or subscribe to save articles for later. Save articles for later Add articles to your saved list and come back to them any time. Got it Normal text size Larger text size Very large text size As a mild-mannered, middle-aged father of five, Hugh Marks is an unlikely romantic protagonist. Despite disliking soft dramas – he prefers them to be grittier – he found himself playing the lead role in a real-life one, when he fell in love with a colleague while running Nine Entertainment (the owner of this masthead). It was all very awkward for Marks, his new partner, his boss and their colleagues, so he made a decision that took many by surprise: he chose his relationship over his job. The whole thing was uncomfortable. Not many people have to disclose their new partner to a chairman, or address concerns you’ve favoured her professionally, or brace for “sex scandal” headlines, or inform the stock exchange that you’ve decided to quit. I ask whether it puts a wet blanket on romance. “As it turns out, not,” he says. “We’re getting married at the end of this year. We have a child. We have a house together. We have a lovely life.” Their life is so lovely that Marks says he wasn’t chasing another big job after leaving Nine. “I was really enjoying myself,” he says. But when the ABC managing director’s role became vacant, he felt the lure of higher purpose. “It wasn’t that it was a burning thing for me to do,” he says. “But when I thought about it, I thought, no, it’s important. To do something that’s important … I mean, it sounds a bit righteous but it’s not. Media is important. Storytelling is important. “It matters that the ABC is there as a public good … The work matters.” It’s Friday afternoon in Paddington and noisy chatter fills Italian restaurant Barbetta, one of Marks’ favourites. He has a soft voice – his mild manner is partly what prompted his tongue-in-cheek nickname, Hollywood Hugh – and we strain to hear each other over the din. I first met Marks when he became my boss, back when he oversaw the merger between Nine (of which he was chief executive) and Fairfax Media, which owned these mastheads, in 2018. These days he’s a public servant in charge of the public broadcaster, so, in a roundabout way – given I’m a taxpaying member of that public – he now works for me. He orders his favourite dish, the pork chops, and I select the ragu as I brief Marks on the usual pattern of these lunchtime interviews: as the one asking the questions, I’ll finish my meal, while he’ll be so busy answering, he won’t get a chance to eat and his food will get cold. “I’ll have to give one-word answers, then,” he says.\n\nAdvertisement\n\nHe doesn’t. Marks hasn’t done many profile-style interviews since he became managing director of the ABC five months ago and he’s at pains to explain his approach. Many at the broadcaster still aren’t quite sure what to expect. They’re uncertain of his vision, or what he plans to change, or whether he’ll be “too commercial”, or if he’ll stand up for them when the attacks come from outside, or if he sees a future for traditional radio and terrestrial television given their declining audiences, or even if he watches, listen to and reads the ABC. They can be reassured on the last point. Marks says he has always been a fan of ABC news and current affairs. He likes Wednesday-night comedy. Friday-night dramas are a bit soft for him but he’s enjoying The Family Next Door. “When I was at Nine I could watch, listen [to] and read everything,” he says. “There’s no way I can do that at the ABC.” But he watches, reads and listens to as much as he can, and does it with his work hat on. “If you have thoughts about the direction or tone or whatever, you’ve got to be thinking about all those things and talking to the teams about it,” he says. Barbetta’s ragu. Credit: Janie Barrett He no longer feels obliged to watch Married at First Sight, the Nine reality juggernaut that “marries” two single, extroverted strangers, and is not to everyone’s taste. While he has said he wants the ABC to pursue more hit shows – to find the next Bluey or MasterChef – Marks doesn’t put MAFS in that category. Still, he doesn’t shy away from the concept. “Love on the Spectrum is a different version of the same show – still a dating show, still puts people in a reality contest,” he says. “There are always different treatments of an idea.” I take Marks back to the subject of dating, given it was at the centre of his departure from the top job at Nine in early 2021. It had been his second stint at the broadcaster, after working there for eight years earlier in his career as in-house legal counsel, then director of film and television, before leaving to become chief executive of Southern Star, which produced reality show Big Brother for Ten, drama Love My Way for Foxtel, and game show Deal or No Deal for Seven.\n\nAdvertisement\n\nHe replaced David Gyngell as Nine’s chief executive in 2015. The merger he oversaw transformed Nine, creating a multi-platform company with broadcast television, streaming (Stan), publishing and radio. During that time Marks and his wife, with whom he had four children, broke up. His love life was the subject of speculation; he was photographed on a picnic with his executive assistant, who he said was an old friend. But then one of his own papers broke the story that Marks was leaving the business after he had begun a relationship with Nine’s former managing director of commercial, Alexi Baker. Marks ordered the pork cutlet at Barbetta. Credit: Janie Barrett They were two consenting adults. Still, it was messy. Questions flew about who on the board was notified and when, and if there were any promotions or bonuses for Baker. Relationships involving the chief executive and a subordinate make boards nervous. There were already fractures in the board between the Nine and the Fairfax people, and the relationship exacerbated tensions. Marks says he was thinking about leaving anyway, after the merger had been bedded down. The relationship sped up his plans. “In one sense, you can deal with relationships and stuff through disclosure and all of that,” he says. “In another, it creates pressures in the business that I just felt at the time was better for us to move on … to be able to pursue that relationship without the impediment of the organisation.” It must be awkward to have to tell higher-ups about one’s love life? “It’s awkward but it’s appropriate because the risk of conflict exists,” he says. “It’s a complex mash of personalities and responsibilities. It’s a challenge to make those decisions but it was the right decision.” The story was widely reported; some of the headlines referred to it as a “sex scandal”. I ask how he felt about the reporting, and whether he thought his relationship had been unfairly lumped into the broader category of workplace relationship scandals, particularly as it came fresh off the heels of headline-grabbers such as then federal MP Alan Tudge’s affair with a staffer, who accused him of abuse, and Barnaby Joyce’s relationship with his staffer, who he later married.\n\nAdvertisement\n\n“I think in many ways it was more unfair for Alexi than me,” he says. “That is, I think, a regret. There were certainly elements where we could have said more but chose not to, or where we thought it was unfair and we chose not to say something. We’re comfortable with our own decisions; you have to find that in yourself.” Alexi Baker and Hugh Marks at the Midwinter Ball at Parliament House last month. Credit: Alex Ellinghausen They now have a three-year-old son, Hamish, and will get married in December when Marks’ adult children, two of whom live overseas, can attend. Marks is enjoying fatherhood for the fifth time. He might have more experience at parenting than his partner but he’s conscious of not taking over. “It’s Alexi’s first child, so [I’m] trying to balance that. They’re such joys, children, they’re so interesting as individuals.” Marks is juggling fifth-time fatherhood with a big job. His experience at Nine prepared him for some elements of the role but not others. He doesn’t have to answer to corporate shareholders but ABC has its own version – the viewers and staff who feel a strong sense of ownership. Changes bring a big backlash. “I must say,” he says, “one difference between Nine and the ABC was at Nine it was always ‘can you get rid of?’ At the ABC it’s more ‘why did you get rid of?’” The cultures at Nine and ABC are different, too. The ABC staff is more unionised than Nine’s television division, staff are public servants, there’s a clear charter and a strong sense of independence from management. He’ll negotiate a new enterprise agreement later this year.\n\nAdvertisement\n\n“There’ll always be moments [of conflict],” he says, “but I hope that my approach is always to engage with people on their work. There’s a great sense of purpose at the ABC but if we can get them to buy into what we’re doing and why, I think we can hopefully get them all to come along.” Marks says he has also learnt from the exposure of the culture of sexual harassment at Nine’s broadcast division, which exploded into the public eye last year but was happening while he was chief executive (he says the harassment allegations were never bought to him and were a surprise). One way to stop those cultures from developing, he says, is to keep an open dialogue with staff, and to listen as well as talk. He admits he has become better at this over the past decade, given his personal travails. “My empathy levels have also gone way up,” he says. “I think you do learn every time something negative happens.” He is deeply interested in journalism. He is not trained as a journalist but likes to talk to journalists about their stories and provide feedback, which makes some ABC staff – who spoke to this masthead on the condition of anonymity, so they could speak freely – nervous about independence, although others like that he values their work. He also wants the ABC to break more stories with impact. This is easier said than done; every journalist wants strong stories but they don’t grow on trees. Investigative journalism, in particular, is expensive. Kim Williams, ABC chair, has been in hot water for raising concerns directly with radio management about editorial decisions on comedian Sandy Gutman. Credit: Alex Ellinghausen “Yes, it’s difficult,” Marks says. “Often it’s just having the intellect, when you’ve got a story, to challenge you on … angles and layers that you may not have thought about,” he says. He sees his role as “an overview, looking at tone and balance, fairness, entertainment value and quality”.\n\nAdvertisement",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/goodfood/melbourne-eating-out/the-frankston-cafe-with-a-genre-defining-chilli-scramble-you-can-smell-down-the-street-20250902-p5mrqn.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "The Frankston cafe with a ‘genre-defining’ chilli scramble you can smell down the street",
        "publish_date": "Tue, 02 Sep 2025 11:39:41 +1000",
        "category": "finance",
        "authors": [
            "Dani Valent"
        ],
        "text": "Add articles to your saved list and come back to them anytime.\n\nCommonfolk coffee now has an all-day venue just two blocks back from the beach.\n\n1 / 7 Ugandan-style chilli scramble is a certified brunch banger. Simon Schluter 2 / 7 The green smash. Simon Schluter 3 / 7 Commonfolk’s ‘Franga’ coffee mugs sold out on the cafe’s first morning. Simon Schluter 4 / 7 Brisket and eggs. Simon Schluter 5 / 7 The 50-seat cafe plays music on vinyl and has a large communal table. Simon Schluter 6 / 7 Lamb shoulder with smoked almond romesco. Simon Schluter 7 / 7 Inside Commonfolk in Frankston. Simon Schluter Previous Slide Next Slide\n\nCafe$$$$\n\nThirteen-year-old coffee company Commonfolk has opened a new cafe in Frankston with a genre-defining chilli scramble and a big ambition. The 50-seat corner cafe is in an old op shop two blocks from the beach and a five-minute walk from Frankston Station. It replaces a smaller Commonfolk location in the suburb.\n\nThe spacious room has a warm look with coffee-coloured Tuscan tiles, a high communal table with stools that makes a virtue of a central structural pillar, music on vinyl and big windows that promote an indoor-outdoor feel. A good way to blast yourself into the Commonfolk orbit is to order a Yin Yang coffee duo ($8) featuring their Peruvian “Castle in the Sky” blend. You’ll get an espresso and a magic to experience the smooth, apricot-tinged chocolatey roast in two different ways.\n\nChef Kyle Noll (ex-Hatter and the Hare, Locavore Studio) is running an all-day menu that includes half-serves of many items. That hero chilli scramble is strewn with a Ugandan-style tumble of crisp spices with turtle beans and curry powder. The dish is a nod to Zukuka Bora, a Ugandan coffee producer-partner of Commonfolk since 2014. Soft scrambled eggs are layered up with that chilli, dill-infused labne, fermented garlic and preserved lemon for a certified brunch banger. Lamb shoulder with roasted beetroot would be at home in any quality bistro, and a well-constructed avo smash is boosted by green tahini and smashed chickpeas.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/politics/nsw/nsw-s-2-3-million-renters-were-promised-protection-then-the-premier-acted-for-landlords-twice-20250829-p5mqyh.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "NSW’s 2.3 million renters were promised protection. Then the premier acted for landlords, twice",
        "publish_date": "Tue, 02 Sep 2025 11:30:00 +1000",
        "category": "finance",
        "authors": [
            "Max Maddison"
        ],
        "text": "NSW Premier Chris Minns has intervened to make two policies designed to favour renters more friendly to landlords, overruling the responsible minister and blindsiding stakeholders.\n\nSources speaking on the condition of anonymity to detail confidential discussions said Minns moved to make it easier for landlords to prevent pets in their rental properties in September last year, then, in May, loosened restrictions on landlords evicting tenants because of planned renovations.\n\nOver the past year, Labor has implemented a raft of rental reforms, promised before the 2023 state election, to protect the more than 2.3 million tenants in NSW, barring no-grounds evictions, limiting rent increases to one per year, and providing a fee-free means of payment.\n\nPremier Chris Minns unilaterally changed rental reforms to make it easier for landlords to prevent pets in rental properties. Credit: Marija Ercegovac\n\nAfter months of consultation, NSW Better Regulation and Fair Trading Minister Anoulack Chanthivong had settled on draft legislation for allowing pets in rental properties. In line with similar reforms in ACT and Victoria, landlords would have to apply to a tribunal to refuse such a request.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/queensland/brisbane-news-live-brisbane-2032-secures-marketing-whiz-no-excuses-for-protest-behaviour-says-rishworth-20250901-p5mrko.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Brisbane news LIVE: Mayor applauds call to scrap Gold Coast tram plan; Visitors urged to chuck Sunny Coast sickie; New CBD Metro tunnel to open",
        "publish_date": "Tue, 02 Sep 2025 11:13:39 +1000",
        "category": "finance",
        "authors": [],
        "text": "Brisbane Lord Mayor Adrian Schrinner has applauded the state’s decision to scrap stage four of the Gold Coast light rail, saying a hybrid tramline and busway travel route will be better value for money.\n\nDeputy Premier Jarrod Bleijie announced the decision yesterday, citing cost concerns and community consultation from residents on the southern end of the Gold Coast who had opposed the project.\n\nToday, Schrinner said a metro-style rapid transit busway was a “practical, common-sense solution”.\n\nAs we head towards the 2032 Games, the focus has to be on projects that are reliable, scalable and value for money. Metro is quicker to deliver, more flexible to run and better value than light rail.\n\nSchrinner said he was pleased the state had used Brisbane’s Metro as a benchmark for other cities in the south-east, and said rapid bus transit was “the only timely and affordable way to keep our region moving in the near future”.\n\nLoading\n\nGold Coast Mayor Tom Tate and Opposition Leader Steven Miles both said they were disappointed in the outcome yesterday, with Tate adding that axing the light rail would skewer the Gold Coast’s 2032 Games transport legacy.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/nrl/nrl-around-the-clubs-round-27-20250831-p5mr9y.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "NFL hopeful who blew Viking horn in Vegas sacked and suspended",
        "publish_date": "Tue, 02 Sep 2025 11:12:45 +1000",
        "category": "sports",
        "authors": [
            "Adrian Proszenko",
            "Christian Nicolussi",
            "Michael Chammas"
        ],
        "text": "The NFL wannabe who was kicked out of Allegiant Stadium shortly after blowing the Viking horn has been cut by the Las Vegas Raiders and suspended for two games.\n\nTyler Manoa, a 25-year-old defensive tackle, was given the honour of blowing a custom-made horn that was constructed solely for the purposes of marking Canberra’s debut in the United States in the opening round of the season.\n\nTyler Manoa may have jeopardised his NFL career moments after blowing the Viking horn. Credit: Fox Sports\n\nCanberra had reached out to a number of celebrities - including Dana White, Tom Brady, Rob Gronkowski and Las Vegas Raiders head coach Pete Carroll - in the hope they would be available. When they all declined, Manoa - who is yet to make his run-on NFL debut - was enlisted for the job.\n\nShortly after blowing the horn, Manoa was ejected from the stadium for misbehaviour in the corporate area. Then a member of the Las Vegas Raiders’ practice squad, it’s alleged Manoa damaged property inside the restrooms, with some reports suggesting he was also tasered.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/cricket/sore-australia-captain-pat-cummins-sweats-on-back-scans-before-ashes-20250901-p5mrla.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Cummins ‘hot spots’ cloud Ashes preparation as Starc quits T20s",
        "publish_date": "Tue, 02 Sep 2025 11:10:07 +1000",
        "category": "sports",
        "authors": [
            "Daniel Brettig"
        ],
        "text": "Pat Cummins has been cleared of a stress fracture that would have put him out of the Ashes, but scans have confirmed a “hot spot” in the Australian captain’s back that will require careful management ahead of the first Test of the series in Perth.\n\nLeft-armer Mitchell Starc, meanwhile, has retired from Twenty20 internationals in order to prolong his Test career for Australia.\n\nAustralian skipper Pat Cummins. Credit: AP\n\nScans conducted in Sydney on Monday were reviewed overnight, and Cricket Australia confirmed on Tuesday that Cummins will miss the white-ball games at home against India that precede the five Tests against England.\n\nHe will also be missing from a T20 trip to New Zealand, the squad for which was also missing Starc due to his decision to retire from the short format. Starc’s 79 wickets is second to Adam Zampa among Australian T20 bowlers, but he has been in and out of the Australian T20 team in recent years, infamously being dropped during the 2022 World Cup on home soil.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/tennis/bublik-celebrates-rare-win-over-sinner-20250902-p5mrql.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Bublik celebrates rare win over Sinner",
        "publish_date": "Tue, 02 Sep 2025 11:04:42 +1000",
        "category": "sports",
        "authors": [],
        "text": "Bublik celebrates rare win over Sinner\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/culture/music/he-lost-all-hope-after-his-mother-died-then-a-random-song-saved-his-career-20250825-p5mply.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "He lost all hope after his mother died. Then a random song saved his career",
        "publish_date": "Tue, 02 Sep 2025 11:00:00 +1000",
        "category": "entertainment",
        "authors": [
            "Robert Moran"
        ],
        "text": "Save Log in , register or subscribe to save articles for later. Save articles for later Add articles to your saved list and come back to them any time. Got it Normal text size Larger text size Very large text size All of a sudden, music felt completely insignificant to Dev Hynes. In early 2023, just as he was preparing to perform a selection of his classical works at the Sydney Opera House, his mother fell sick and was admitted to hospital. Hynes returned to his childhood home in Ilford, in Essex in England, to be by her bedside. Within two months, she had died. He cancelled the Opera House gig, and several other shows, as he took “time to grieve and focus on getting myself together”. Music had been a constant in Hynes’ life since childhood. He’d started piano lessons at seven and cello at nine, and launched his career in the early aughts in British dance-punk phenoms Test Icicles. As Blood Orange, he’d released several acclaimed solo albums and written and produced revered releases for Sky Ferreira, Solange Knowles and Carly Rae Jepsen. “It just didn’t matter,” recalls Hynes in a faded Iron Maiden T-shirt from his home in New York, where he’s been based for 17 years. “I really didn’t see a point in it any more.” After his mother’s funeral, to get some distance from the grief of home, Hynes rented a place in Paris, just a brief rail ride from London. One day, as he was tinkering around the apartment, the algorithm served up a song he’d never heard before that stopped him in his tracks. It was Sufjan Stevens’ Fourth of July. “I’m a Sufjan fan and I’m a music obsessive, but I have these crazy music holes where I just miss things, right? But this song came on and it felt like it was speaking to me. It sounded like it was inside my head,” says Hynes. “It was so visceral and intense.” Fourth of July is a track from Carrie & Lowell, Sufjan Stevens’ harrowing album about the death of his estranged mother. At the time, Hynes knew nothing of the song’s backstory. “It was quite striking to me because I didn’t know the story, but it went right inside and I understood the song completely. How many mediums can do that? I’m not Sufjan, but I had this feeling of wow, I can’t believe my occupation is the same as the person who made this, I’m involved in a pretty magical medium. And that was the drive I needed.” The result is Essex Honey, Hynes’ first new Blood Orange project since 2018’s acclaimed Negro Swan. He’d continued making music in the intervening years, including film scores for Queen & Slim (2019) and Paul Schrader’s Master Gardener (2022), as well as writing and producing for hardcore stars Turnstile and Argentinian singer Nathy Peluso (for which he won a Latin Grammy in 2024). But why the break from releasing music as Blood Orange?\n\nAdvertisement\n\n“There was a little bit of, what’s the point?” admits Hynes. “Music was always being made, I never stopped, but I would think to myself: why does it need to be released? It’s a noisy world, and there’s a lot of shit getting thrown at us daily. I don’t want to add my shit to that noise. Why would I do that?” Essex Honey, the first Blood Orange album since 2018, finds Hynes looking back to his childhood. It’s not the usual mindset for a successful musician. “I still feel that a lot, and I have to remind myself that it’s a privilege,” says Hynes. “I’m quite lucky that, a) I know how to make music, and b) I have opportunities to release it, and c) there are people that would actually like to hear it. I think about all that and it’s like, ‘get over yourself’,” he laughs. That it’s officially 20 years since his first professional release – Test Icicles’ blog-hit Boa Vs Python came out on August 1, 2005 – has also played on Hynes’ mind. “I never could have dreamt, 20 years ago, that I’d still be releasing albums,” he says. “I think of all the incredible musicians who don’t have those opportunities, and I think of myself as a teenager, and I have to put something out, even if it’s only one person who listens to it while they’re at the gym or something. Like, that’s cool!” ‘It’s a noisy world, and there’s a lot of shit getting thrown at us daily. I don’t want to add to that noise.’ Due to the time he spent back in Ilford, by his mother’s side and among his childhood haunts, memory and the formative influence of music became key catalysts for Essex Honey. Throughout the album, snippets of well-known songs act like launchpads to memories and emotions, like Proust’s madeleines turned musical. On Westerberg, Hynes sings the hook from the Replacements’ Alex Chilton – a sort of boomerang tribute back to Paul Westerberg – to honour the music that made him. On Mind Loaded, he sings Elliott Smith’s Everything Means Nothing to Me to evoke both grief and the unifying comfort of pop melancholy. On The Field, Hynes calls in Vini Reilly to recreate the Durutti Column’s Sing To Me. The references act like totems – to comfort, hope, excitement, his mother – in the same way that Sufjan’s Fourth of July helped Hynes reengage with the magical potential of music that, in the midst of grief, had evaded him.\n\nAdvertisement\n\n“Thinking about being younger and listening to music was an enormous part of [this album], and so it felt like the most honest thing to do and the most natural way to do it,” says Hynes of using such recognisable musical cues. “George Saunders, the writer, says the reason why his stories are so crazy is because he will use any device that gets the necessary emotion across. I feel the same way musically – I don’t care what it is, I will do it.” On Essex Honey, Hynes also finds a way to integrate the classical training he’s had since youth. Songs build around orchestral improvisations and float freely like sheet music in the wind. Highlight Vivid Light – featuring woodwind bursts, an acid house break beat, and author Zadie Smith singing about writer’s block – sounds like you’re listening to a jam session happening in another room down the hall. “Years ago I would keep [my classical work] quite separate because I was scared those connotations would overwhelm the listening experience for people – even though, in my mind, it is all just me making stuff,” says Hynes. “What’s happened is I’m a lot looser and a lot easier on myself now, and in that sense the approach to making music has let things seep in and talk to each other. Before, I would only make things that were, quote-unquote ‘Blood Orange’. But now I trust that since it’s me making it, it will turn out Blood Orange anyway.” Loading Beyond Vini Reilly and Zadie Smith, Essex Honey features a who’s who of cameos from Hynes’ friends, including Caroline Polachek, Brendan Yates from Turnstile, Mustafa the Poet and even pop superstar Lorde. Hynes worked on Lorde’s new album Virgin, playing cello, bass, guitar and synths on multiple tracks including single Man of the Year. “Working on other people’s music is probably the peak of fun musically for me,” says Hynes. His strength in sessions is being a pliable jack of all trades. “When I work on someone else’s music, I’m completely at service to them. If they want ideas, I can give ideas. If they just want keyboards, I can give keyboards. However they want it to go, I’m down, I just need to know. And then it’s super fun for me.”\n\nAdvertisement",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/lifestyle/fashion/anna-wintour-2-0-meet-the-new-editor-of-vogue-20250902-p5mroe.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Anna Wintour 2.0: Meet the new editor of Vogue",
        "publish_date": "Tue, 02 Sep 2025 10:59:15 +1000",
        "category": "lifestyle",
        "authors": [
            "Damien Woolnough"
        ],
        "text": "At the first show of New York Fashion Week on September 11, all eyes will be on the front row rather than the clothes by Michael Kors. There’s a new sheriff in town, wearing Chanel instead of a gold star (they are so last season), with reports that Anna Wintour has appointed Chloe Malle as the new head of editorial content for American Vogue.\n\nAfter nearly four decades of focusing on the inscrutable gaze of outgoing editor-in-chief Wintour, with her signature sharp bob and sunglasses, designers will look to the amiable expression of Malle resting beneath corkscrew curls, for hints on whether their collection will make the pages of the enduring fashion magazine.\n\nHaving worked at Vogue since 2011, currently as editor of Vogue.com, the 39-year-old Malle has the necessary experience to sit in Wintour’s chair, but it’s her Hollywood pedigree that has prepared her for this close-up.\n\n“The child of Candice Bergen and the late auteur director Louis Malle, she arrives with pop culture bona fides,” Puck journalist Lauren Sherman wrote in her announcement of the appointment. Bergen, the star of nineties sitcom Murphy Brown not only played a Vogue staffer in the Sex and the City series, she appeared on the magazine cover twice as a model in 1967 and 1969.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/business/markets/asx-set-to-dip-global-markets-rise-wall-street-closed-20250902-p5mrmv.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "ASX slides lower; Trump crypto token starts trading",
        "publish_date": "Tue, 02 Sep 2025 10:53:07 +1000",
        "category": "finance",
        "authors": [
            "Staff Reporter"
        ],
        "text": "The Australian sharemarket slipped at the open with energy and consumer stocks weighing on the index, with a number of high-profile stocks trading ex-dividend on Tuesday.\n\nThe S&P/ASX200 was 36.4 points, or 0.4 per cent, lower at 8891.3 in early trade, with eight of 11 industry sectors lower. Wall Street was closed overnight for the Labor Day holiday in the US.\n\nThe ASX has lost ground on Tuesday. Credit: Oscar Colman\n\nMining stocks were mixed. Iron ore heavyweights BHP (up 0.5 per cent) and Rio Tinto (up 0.4 per cent) rose while rival Fortescue slipped 0.4 per cent. Among gold players, Evolution rose 0.4 per cent, but Northern Star lost 1 per cent as it traded ex-dividend. Newmont dipped 0.1 per cent.\n\nEnergy stocks fell after oil prices retreated. Woodside shed 0.8 per cent in early trade, while Santos, which is trading ex-dividend, slumped by 2.5 per cent.",
        "source": "TheAge"
    }
]