[
  {
    "url": "https://www.9news.com.au/national/european-union-seeks-defence-pact-with-australia/ce1fbe59-0cb6-4756-9f85-946d9eb9cf4b",
    "title": "European Union seeking defence pact with Australia",
    "publish_date": "Mon, 19 May 2025 01:39:14 +0000",
    "category": "finance",
    "authors": [
      "May"
    ],
    "text": "The European Union wants to build deeper defence links with Australia amid global instability.\n\nThe economic bloc's top official put the idea to Prime Minister Anthony Albanese in Rome yesterday, and said it would match EU defence partnerships with other nations.\n\nEuropean Commission President Ursula von der Leyen raised the idea when she met the prime minister after the inaugural mass for Pope Leo XIV at the Vatican.\n\nPrime Minister Anthony Albanese meets with President of the European Commission Ursula von der Leyen after attending the Inauguration Mass of Pope Leo XIV, in Rome, Italy, on Sunday 18 May 2025. fedpol Photo: Alex Ellinghausen (Alex Ellinghausen)\n\nShe said it could add to the defence ties the EU - a﻿n economic bloc of 25 nations and 449 million people - currently enjoys with Japan and South Korea.\n\nEurope has been rethinking its defence strategies since the election of US President Donald Trump who has said the US might abandon its commitments to defending Europe if it were attacked.\n\nVon der Leyen, speaking ahead of her private meeting with Albanese, said the global security situation had deteriorated over the past months.\n\n\"The geopolitical tensions have massively increased. The good thing is, Australia and Europe are reliable partners. We are predictable. We share the same values.\n\n\"So, we can offer to each other stability and we are very grateful for that.\n\nThe European Union is an economic bloc of 27 nations and 449 million people. (Getty)\n\n\"And this is the reason also that we do not only see you as a trading partner, but we see you as a strategic partner. And we would very much like to broaden this strategic partnership.﻿\"\n\n\"For example, we have signed security and defence agreements with South Korea and with Japan, soon with the UK.\n\n\"We would be very pleased if we could develop such a security and defence partnership too, just to broaden the strategic partnership.\"\n\nAlbanese gave a cautious reaction to the plan, but said the federal government was open to a defence partnership.\n\n\"We said that we were certainly interested in any further engagement of support, but it's very early stages at this point,\" he said.",
    "source": "9News",
    "cluster_id": 0
  },
  {
    "url": "https://www.9news.com.au/national/vodafone-makes-accc-complaint-telstra-network-advertising/0242efe0-90dd-4925-a810-dca734624cfb",
    "title": "Vodafone makes bombshell Telstra complaint to ACCC",
    "publish_date": "Sun, 18 May 2025 22:49:05 +0000",
    "category": "finance",
    "authors": [
      "May"
    ],
    "text": "Australian telco Vodafone is alleging that competitor Telstra﻿ has been falsely claiming their network is larger than it is for average consumers and that they have been misleading Australians for over a decade.\n\nVodafone, owned by TPG Telecom, is alleging misleading and deceptive conduct by Telstra over 15 years and has made a complaint to the Australian Competition and Consumer Commission.\n\nIt all stems from Telstra's use of an \"external antenna\" to measure where they do and don't have coverage.\n\nVodafone suggests that by using such an antenna, they may be overstating the geographic reach of the Telstra mobile network by as much as 40 per cent.\n\nVodafone alleges Telstra may have misled customers about their mobile coverage by calculating their network area using an external antenna. (Supplied)\n\n\"This is alarming. It appears Telstra has tricked Australians into paying top dollar for coverage they simply can't get on a regular mobile phone,\" Kieren Cooney from TPG Telecom said.\n\n\"We are shocked that Telstra appears to have been overstating its coverage by so much for so long and we are calling on them to make it right.\n\n\"Telstra's conduct could have misled consumers into believing they can get coverage in places that require special equipment.\n\nTelstra changed its coverage advertising after a complaint to the ACCC. (Supplied)\n\n\"By overstating the coverage available to most Australians by such an enormous amount, Telstra and its resellers have no doubt retained customers or attracted customers that might otherwise have chosen Vodafone or other TPG Telecom brands such as TPG, Felix, Lebara and Kogan.\"\n\nSince raising this issue with Telstra, Vodafone also suggests that Telstra has already adjusted their marketing materials including how their network claims are portrayed on their website.\n\nCore to Vodafone's claim is that Telstra claims coverage of over three million square kilometres, when Vodafone suggests the actual coverage using a normal mobile phone without an external antenna or repeater is more like one million square kilometres.\n\nREAD MORE: AI could be the latest tool in battle against dementia ﻿\n\nTelstra said it stood by their claim. (Getty Images/iStockphoto)\n\nThis claim is critical to Vodafone's competition in the market, having recently boosted their own coverage after a network sharing deal with Optus that sees them now reaching closer to or over one million square kilometres.\n\nTelstra stands by their claim, pointing out that it is Vodafone who has changed the way they measure coverage.\n\n\"No matter how you look at it, Telstra's mobile network covers more of Australia than any other. Any suggestion that we've misled the public about the size of our network is completely untrue,\" a Telstra spokesperson told 9News.com.au.\n\n\"Using our coverage maps, customers have always been able to determine our level of coverage with and without an external antenna, so they always knew what to expect based on the device they're using.\n\nLegendary actress swaps mansion for prison cell View Gallery\n\n\"Many customers in regional and remote areas benefit from using external antennas to maximise their coverage.\n\n\"This is why we have used this as the basis for our coverage footprint.\n\n\"Now that Vodafone has communicated to us how it's chosen to calculate its coverage footprint, to help the public understand the difference, we're highlighting that our three million square kilometres of coverage is based on using an external antenna.\n\n\"Using coverage maps, people can see the many towns, highways and places where we've invested to provide coverage and Vodafone hasn't. We're all for transparency and industry consistency in how we report coverage and would gladly put our maps up, side-by-side, so that Australians can see the difference.\"",
    "source": "9News",
    "cluster_id": 1
  },
  {
    "url": "https://www.9news.com.au/health/just-two-days-of-eating-fatty-foods-can-cause-hidden-gut-damage/3edb7d15-73be-4351-ae7b-10d3ba344c13",
    "title": "'Hidden' gut damage triggered by eating fatty meals for just two days",
    "publish_date": "Sun, 18 May 2025 22:39:38 +0000",
    "category": "lifestyle",
    "authors": [
      "May"
    ],
    "text": "A new Australian study has revealed just two days of high-fat meals can disrupt gut health, triggering \"hidden\" inflammation well before any physical symptoms appear.\n\nResearchers at Melbourne's WEHI, formerly known as the Walter and Eliza Hall Institute, found these hidden changes could build up over time, potentially fuelling chronic inflammatory diseases that emerge years later.\n\nEating only two days of high-fat food depleted a key protein that protects the gut, known as ﻿ IL-22, the study revealed.\n\nA new Australian study shows eating just two days of fatty meals can trigger hidden gut inflammation. (iStock)\n\nIt's now hoped the findings will lead to a shake-up of dietary guidelines to naturally boost gut protection and help people living with chronic inflammatory conditions, such as bowel disease.\n\nDr Cyril Seillet, a senior author on the paper, said the findings show that every meal we consume impacts our gut health.\n\n\"The more saturated fats we eat, the more inflammation that builds up – gradually weakening our gut defences and increasing our susceptibility to chronic inflammation.\n\n\"But this inflammation build-up is initially silent, remaining hidden in our bodies until years later, where it can present as chronic inflammation.\"\n\nAbout one-third of Australians live with chronic inflammatory disease, such as coeliac disease and rheumatoid arthritis.\n\nConsuming food high in unsaturated fat, such as avocado, can improve the gut's defences against disease. (Getty Images/iStockphoto)\n\nBut how this inflammation is triggered and causes disease remains largely unknown﻿.\n\nThe new study, published in the journal Immunity , highlighted short-term exposure to high-fat diets sparked inflammation in mice as well as limiting their bodies' capacity to resist it.\n\nFirst author on the paper, Le Xiong, said high-fat diets were a \"double hit\" to our gut barrier because they not only promoted inflammation, but also disabled the body's ability to fight it.\n\nThe healthiest places to live in Australia revealed View Gallery\n\n\"IL-22 is a critically important protein for gut health and protection. Without it, the gut loses its ability to prevent inflammation,\" he said.\n\nEncouragingly, the researchers found consuming food high in unsaturated fat - such as nuts and avocadoes - improved the protein's production, strengthening the gut's resistance to disease.",
    "source": "9News",
    "cluster_id": 2
  },
  {
    "url": "https://www.9news.com.au/world/tiffany-slaton-missing-hiker-california-found/89a176a6-1ed5-47a4-a316-09836a4c4a86",
    "title": "US woman's incredible survival story after avalanche",
    "publish_date": "Sun, 18 May 2025 21:53:15 +0000",
    "category": "finance",
    "authors": [
      "May"
    ],
    "text": "A US woman who went missing for weeks in California's Sierra Nevada mountains said that she was trapped by an avalanche and survived off wild leeks and snowmelt before she was found this week in a snowy cabin.\n\nTiffany Slaton discussed her harrowing ordeal at a news conference alongside her parents and law enforcement officials, where she also recounted being immobilised by a steep fall.\n\n\"When I fell off of this cliff, I was unconscious for about two hours and did indeed need to splint one of my legs and popped the other knee back into place,\" Slaton said.\n\nTiffany Slaton discussed her harrowing ordeal at a news conference alongside her parents and law enforcement officials, where she also recounted being immobilised by a steep fall. (Fresno County Sheriff's Department via CNN)\n\n\"From there, I couldn't actually get back onto the road, the main road was blocked because of the avalanche that I had been in.\"\n\nSlaton said she tried calling 911 numerous times but was not successful. Her GPS worked, however, providing directions to the nearest Starbucks, a route Slaton said was a \"long, arduous journey.\"\n\nAfter about five days, she ran out of food. Slaton, who said she is a nutritionist, recalled that she staved off hunger with wild leeks and boiled snowmelt. She made tea out of manzanita and pine needles, she said.\n\n\"The [Sierra] has a large selection of leeks that is hard to find in other places,\" Slaton said.\n\nSlaton was stranded in California's Sierra Nevada Mountains. (Getty)\n\n\"I managed to survive off of these leeks and boiling the snowmelt for a very long period of time.\"\n\nHaving originally set out for a camping trip, Slaton said she brought two sleeping bags and a tent. But she lost the tent and the sleeping bags at some point, leaving her with just a lighter and a knife.\n\n\"I'm pretty good at foraging, and nature is quite terrifying, so usually once you start finding things that are scary for you, you do your best to keep moving and get over it,\" she said.\n\nREAD MORE: Two dead after Mexican tall ship hits Brooklyn Bridge in New York City ﻿\n\nIt looks like the type of place you'd whack on your travel bucket list View Gallery\n\nThe owner of Vermilion Valley Resort found her in a cabin on Wednesday. The following day, she celebrated her 28th birthday.\n\n\"That was the 13th heavy snowstorm I had been in,\" said Slaton, who also noted that she is an archery teacher and athlete.\n\n\"If he hadn't come that day, they would've found my body there.\"",
    "source": "9News",
    "cluster_id": 3
  },
  {
    "url": "https://www.abc.net.au/news/2025-05-19/energy-australia-apologises-in-settlement-in-greenwashing-case/105308684",
    "title": "EnergyAustralia apologises, settles 'greenwashing' case",
    "publish_date": "Mon, 19 May 2025 01:38:15 +0000",
    "category": "finance",
    "authors": [],
    "text": "EnergyAustralia has apologised to its customers and says it has shifted to \"direct emissions reductions\" after settling a legal battle over accusations it was \"greenwashing\".\n\nEnvironmental advocacy group Parents for Climate took action in the Federal Court in 2023 alleging misleading or deceptive conduct over the energy giant's marketing of its Go Neutral carbon offset product and the matter was set down for hearings this month.\n\nThe allegations related to the company buying carbon credits to offset the pollution from their electricity or gas customers' energy use that was \"still sourced predominantly from fossil fuels\".\n\nGreenwashing is when something is made to appear more environmentally friendly than it is.\n\nEnergyAustralia said offset programs are no substitute for not burning fossil fuels in the first place. (ABC News: Monish Nand)\n\nIn a statement published on Monday as part of the settlement, Energy Australia said it \"acknowledges that carbon offsetting is not the most effective way to assist customers to reduce their emissions\".\n\n\"While offsets can help people to invest in worthwhile projects that may reduce greenhouse gas emissions elsewhere, offsets do not prevent or undo the harms caused by burning fossil fuels for a customer's energy use,\" it said.\n\nThe company said it \"apologises to any customer who felt that the way it marketed its Go Neutral products was unclear\" and that it has \"has now shifted its focus to direct emissions reductions\".\n\n\"Burning fossil fuels creates greenhouse gas emissions that are not prevented or undone by carbon offsets,\" the statement said. \"This could have been made clearer to customers. \"Storing carbon in plants is not equivalent to keeping it stored in fossil fuels (by not burning those fossil fuels in the first place).\"\n\nThe Federal Court was expected to hear the case this month. (AAP: Bianca De Marchi)\n\nEnergyAustralia's chief customer officer Kate Gibson said the benefits of offsets had been questioned in recent years and the company accepts that there is legitimate public concern about the efficacy of these programs.\n\n\"Carbon offsets should not be used to delay or diminish the important work that needs to be done to actively decarbonise,\" she said.\n\n\"EnergyAustralia is now focused on more effective ways of helping its customers to directly reduce the emissions associated with their energy use.\"\n\n'Real action … not marketing spin'\n\nParents for Climate were seeking the company issue a corrective notice and for the court to make a declaration the EnergyAustralia engaged in greenwashing.\n\nKey to their case was the claim that customers believed their fossil fuel consumption would be neutralised by renewable projects as part of EnergyAustralia's Go Neutral program.\n\nParents for Climate CEO Nic Seton said greenwashing delayws climate action. (Supplied: Nic Seton)\n\nParents for Climate CEO Nic Seton said it was a \"historic acknowledgement\" and showed \"climate action must be backed by real action … not marketing spin\".\n\n\"It will set a new standard for the way carbon offset products are used by corporations and sold to consumers,\" he said.\n\n\"This isn't just about EnergyAustralia — it's about holding companies to a higher standard across the board.\n\n\"Greenwashing isn't harmless. It's costing families money, delaying climate action, and eroding trust.\"\n\nHow environmental spin shows up in household appliances Photo shows A man pushes the button on a washing machine that's full of clothes Consumer advocates are calling for Australia to introduce a repairability and durability rating system for household appliances.\n\nThe company began the Go Neutral scheme in 2016 but stopped offering it mid last year, claiming it is continuing to phase it out for residential customers this year.\n\nThe Parents For Climate said it was the first case in an Australian court for \"carbon neutral\" marketing.",
    "source": "ABC",
    "cluster_id": 4
  },
  {
    "url": "https://www.abc.net.au/news/2025-05-19/far-north-queensland-parents-want-second-paediatric-cardiologist/105301232",
    "title": "Parents plead for children's 'amazing' heart doctor to get helping hand",
    "publish_date": "Mon, 19 May 2025 01:22:59 +0000",
    "category": "lifestyle",
    "authors": [],
    "text": "When Juliana O'Neill's son Levi hops on a bike, she watches him with an eagle eye.\n\nEven a simple fall could land the four-year-old in a hospital ward 1,600 kilometres away.\n\nLevi was resuscitated at birth with low oxygen levels before being diagnosed with a serious heart condition three days later.\n\n\"We've got an emergency bag ready to go when we have to go,\" Ms O'Neill said.\n\n\"And it won't be the first time we've had to do that.\"\n\nJuliana O'Neill spent six months at a Brisbane hospital with her son Levi (right) after he was born. (ABC Far North: Christopher Testa)\n\nMs O'Neill and Levi spent the first six months of his life at the Queensland Children's Hospital in Brisbane, far from their home in Cairns.\n\nHe has had to return to Brisbane twice for emergency care since then and requires check-ups with a paediatric cardiologist every two months.\n\nHowever, families of children with heart conditions in Far North Queensland say the stress in their lives is exacerbated because the region has only one paediatric cardiologist.\n\nThat is despite the rate of rheumatic heart disease in children aged 14 and under being 30 times higher in Far North Queensland than the rest of the state.\n\n'Amazing' doctor needs help\n\nTegan Catalano's daughter Violet, aged four, underwent open heart surgery as a newborn and she said a heart check-up was recently postponed three times.\n\nMs Catalano said the health needs of the remote, vast area were \"completely different to down south\".\n\n\"It's just unbelievable to me the geographic range that one paediatric cardiologist covers and so, to me, there really needs to be a consideration of the complexity of that,\" she said.\n\nTegan Catalano's daughter Violet underwent open heart surgery as a newborn. (Supplied: Tegan Catalano)\n\nMs O'Neill described Cairns-based doctor Ben Reeves as \"amazing\" but said \"there have been a fair few times where we wish we could have spoken to [him] and he wasn't here\".\n\nThe mother said she once sought treatment for her son at the Cairns Hospital emergency department but was told to wait three days for a specialist to become available.\n\n\"That night we were flown down south; it was that important,\" Ms O'Neill said.\n\n\"Levi probably wouldn't be here today if it weren't for [Dr Reeves] in the beginning and I do believe he needs help.\n\n\"Another cardiologist would really help with a lot of the wait times and when you present to the ED as well.\"\n\nOnly one paediatric cardiologist is based in Cairns, providing care across all of Far North Queensland. (ABC News: Brendan Mounter)\n\nHospital preparing business case\n\nThe Queensland Children's Hospital supports the work of Dr Reeves at the Cairns and Hinterland Hospital and Health Service (CHHHS), which provided almost 700 occasions of paediatric cardiology service in 2024.\n\nThe average wait time for new patients was about 324 days, it said.\n\n\"We are currently working with Queensland Health on a business case for strengthened networked service approach to paediatric cardiology service delivery,\" CHHHS chief executive Leena Singh said.\n\nLeena Singh says there is a business case for strengthened service. (ABC News: Conor Byrne)\n\nMs Catalano said she was a member of a social media group of about 50 Far North parents whose children had experienced similar issues waiting for care.\n\n\"For us, it's just the peace of mind and I think other families feel this, that if you go to emergency or something does happen to your child, that you're going to have somebody there who is trained, specialised, who knows your child,\" she said.\n\nPaediatric cardiologists are in short supply across the nation, but that shortage is particularly felt in regional and rural areas, Ms Singh said.\n\nAccording to data from the Medical Board of Australia, there are 66 registered paediatric cardiologists in Australia, of which 15 are in Queensland.\n\nFamilies don't want to move\n\nIn a statement, Queensland Health said despite increasing demand for services, most paediatric cardiology patients needing specialist appointments were being seen \"within clinically recommended times\".\n\n\"While all efforts are made to ensure Queenslanders can get the support they need close to home, we also assist families to access paediatric services through a combination of outreach services, virtual care and subsidised travel where services are not available locally,\" a Queensland Health spokeswoman said.\n\nTegan and Adam Catalano with their children Marli and Violet. (Supplied: Tegan Catalano)\n\nViolet's father, Adam Catalano, said some families had been told to consider moving to a capital city for easier access to treatment, but that came with its own issues, including a need to find other new specialists and allied health professionals.\n\n\"For children that have heart conditions, they also have other challenges that come with that, so having the occupational therapist that's local and close is also critical,\" he said.\n\n\"If it was a need [to move], then we'd definitely have to consider it.\n\n\"We don't want that for us or for any family.\"\n\nThe state health minister has been contacted for comment.",
    "source": "ABC",
    "cluster_id": 5
  },
  {
    "url": "https://www.abc.net.au/news/2025-05-19/horse-ride-raises-1m-for-child-trauma-survivors/105297574",
    "title": "Horse ride raises $1m for child trauma survivors",
    "publish_date": "Mon, 19 May 2025 00:51:34 +0000",
    "category": "finance",
    "authors": [],
    "text": "Kel Keir does not remember being burnt at the hands of his mother at six months old, but he lives with the consequences every day.\n\nFor Spencer Connelly, it was a car fire lit by his father that led to a life of skin grafts for burns to more than a third of his body.\n\nMr Keir and Mr Connelly now call each other family, and have been wrapped up in the support of the KIDS Foundation — a charity devoted to young victims of trauma — for more than a decade.\n\nThey now help build confidence within other survivors, sharing their stories and showing that there is life after trauma.\n\nSpencer Connelly (left) and Kel Keir say they have found a family through the KIDS Foundation. (ABC Upper Hunter: Amelia Bernasconi)\n\n\"It happened when I was six months old, so I simply don't know any different,\" Mr Keir said.\n\n\" I just try to get out and inspire anyone I meet. \"\n\n\"The KIDS Foundation is the primary reason as to why I'm so confident and why I'm so brave. They've given me so much support, and I'm really grateful for that,\" Mr Connelly said.\n\nThe charity's latest fundraiser, Tour d'Horse, has just swelled the bank account by more than $1 million.\n\nStar power\n\nOlympians, actors, models and horse-racing royalty are among those who have saddled up for the 2025 Tour d'Horse, a week-long ride around the hills of the New South Wales Upper Hunter.\n\nIt's been a nostalgic time for The Man From Snowy River star Tom Burlinson, who did all his own riding and stunts in the classic Australian movies from the 1980s.\n\n\"It's a lovely misty day and it did remind me of riding through the snow gums in the real high country when we were making the film,\" he said.\n\n\"I said early on, 'There will be no re-enactment.' I'm now the old man from Snowy River, so those days are long gone.\"\n\nTom Burlinson was happy to get back in the saddle to support the work of the KIDS Foundation. (Supplied: Nicole Cleary)\n\nNow aged 69, Burlinson said he was bracing for the aches and pains a few days in the saddle would bring, but was proud to be riding for such a wonderful cause.\n\n\"It's been some time since I've been on the back of a horse,\" he said.\n\n\"I'm feeling it in the knees right now, but I know from experience it can take a few days to come out, so I'll see how it goes.\"\n\nNew York-based model, Georgina Burke, was also quick to jump in and support the cause.\n\n\"When I found out what the KIDS Foundation was and obviously hearing some of the survivors' stories and all those horrific incidents, within the hour I had that flight booked home,\" the former Brisbane local said.\n\nGeorgina Burke has got behind the cause. (Supplied: Nicole Cleary)\n\nShe held a fundraiser at an Aussie-owned pub in the US before flying home and continues to showcase the ride on social media to her following of more than 165,000 people.\n\nBuilding resilience\n\nKIDS Foundation chief executive Susie O'Neill OAM was emotional as the tally tipped over $1 million, as it would allow the charity to continue supporting about 300,000 children and their families.\n\n\"It is more than just a charity, it is a family,\" Ms O'Neill said.\n\n\"Most of our children's injuries are from horrific trauma, so car accidents, house fires, abuse, neglect, and innocent victims of crime.\n\n\n\n\"We also run safety education and wellbeing programs in kindergartens and preschools. We have 10,000 kindergartens that receive our resources.\"\n\nShe said the strength of their participants and ambassadors was nothing short of extraordinary.\n\n\"What we see is the young people develop this incredible resilience, and they'll say to me, 'My life is better now than before.'\"\n\nKIDS Foundation Founder and CEO Dr Susie O'Neill OAM at the Tour d'Horse fundraiser at Belltrees. (ABC Upper Hunter: Amelia Bernasconi)\n\nThe Tour d'Horse team was based at cattle property \"Belltrees\" in the Upper Hunter, owned by the White family.\n\nAnto White OAM admitted he had shed more than a few tears this week, reconnecting with the survivors and KIDS Foundation team.\n\n\"When you hear them speak … their stories are inspirational to think where they were and where they are today,\" he said.\n\n\"It's a tear-jerker.\"\n\nThe KIDS Foundation increasingly uses former racehorses as part of therapy, and for the Tour d'Horse, most riders are on off-the-track thoroughbreds.\n\n\"It's showing people there is life after racing ... It's good to take them off the racetrack,\" Mr White said.",
    "source": "ABC",
    "cluster_id": 6
  },
  {
    "url": "https://www.abc.net.au/news/2025-05-19/ex-eagle-calls-for-afl-mental-health-round-adam-selwood-death/105308382",
    "title": "Ex-Eagle calls for AFL mental health round in wake of Adam Selwood's death",
    "publish_date": "Mon, 19 May 2025 00:40:13 +0000",
    "category": "sports",
    "authors": [],
    "text": "A former West Coast Eagles player who experienced poor mental health after he was delisted from the club has added his voice to calls for the AFL to establish a mental health round in the wake of Adam Selwood's death.\n\nBrayden Ainsworth was drafted by the Eagles at pick 32 in 2017 and made his debut the following year, but played only 14 AFL games before being delisted at the end of the 2021 season.\n\nAinsworth spoke out after the sudden passing of Selwood aged 41 over the weekend, just three months after the death of his twin brother and former Brisbane Lions player Troy Selwood by suicide.\n\nLoading...\n\nNo details have been released about the circumstances of Adam Selwood's death.\n\nHe played 187 games for West Coast from 2002 to 2013, and was part of the club's 2006 premiership win against Sydney.\n\n\"He was such a kind, caring man [who] just wanted to help as many people as he could,\" Ainsworth told ABC Radio Perth of his memories of Selwood.\n\n\" You always left his presence just feeling energised, happy, safe. \"\n\nThe Eagles honoured Selwood before their match against St Kilda at Perth Stadium on Sunday and went on to record an emotional 28-point win.\n\nMaking a difference\n\nAinsworth now runs mental health workshops for young men and revealed he had lived with anorexia over the years, and was now committed to using that experience to help others.\n\nThe former Eagle has thrown his support behind a dedicated mental health round in the AFL, which he said could help break down stigmas around seeking help and raise funds for more services.\n\nThe Eagles and Saints held a moment's silence to pay tribute to Selwood before their clash in Perth on Sunday. (Getty Images: Paul Kane)\n\n\"But the thing with it is there might become funds, there might be ways you can then raise the money and then that can help and go back into community, [into] services,\" he said.\n\n\"I think that's what the point of the mental health round is, it's not 'OK let's all put some different colours on our jersey'.\n\nFormer Eagle Brayden Ainsworth says young men would benefit from an AFL mental health round. (ABC News: Benjamin Gubana)\n\n\"[It's] let's raise some amazing funds, as much as we can, then put that back out into the community, and I think that's the way that the mental health round can really work to then fund services and advocacies.\"\n\nAinsworth said that broader focus was important if a mental health round was to make a difference, particularly in helping young men open up.\n\nHeartbroken Eagles respond to Selwood tragedy with stirring win Photo shows Brady Hough is hugged by teammates in celebration West Coast pays an emotional tribute to Adam Selwood before its game against St Kilda and then registers its first win of the 2025 season.\n\n\"I think the flow-on effect could be so important and ripple into … grassroots footy, then into Auskick. I think it can have a major effect,\" he said.\n\n\"One round's not going to change everything, but I think the awareness and the resources you can get off the back of it to then help others and provide a platform [could help].\"\n\n'The tipping point'\n\nAinsworth, speaking about his own mental health experience, described the period after he was delisted as the \"most challenging of my life\", one that culminated in a period in hospital where \"it was looking like I wasn't going to make it out\".\n\nAinsworth (left) played 15 games for West Coast and now works as a youth mental health advocate. (AAP: Daniel Munoz)\n\n\"It was all to do [with] … the physical and mental health from the delisting and the self-worth, but I guess the shame and the guilt of what I was going through. And football, getting delisted was just the tipping point,\" he said.\n\n\"There was a lot of things going on through my childhood and then into football that I never talked about, which was all around body image issues, anorexia, and that's what I ended up in hospital for.\"\n\nHe praised the support services offered by the AFL, individual clubs and the AFL Players Association but said he found it difficult to reach out.\n\n\"When you reach out and you ask for help, that's when it becomes real,\" he said.\n\n\"And I think that's the scariest thing is because, OK, [you realise] what I'm going through is actually a thing, it's not made up in my mind.\n\n\"These thoughts become true and that's when it can become a really hard thing to navigate.\"\n\nThe ABC of SPORT Sports content to make you think... or allow you not to. A newsletter delivered each Saturday.",
    "source": "ABC",
    "cluster_id": 7
  },
  {
    "url": "https://www.abc.net.au/news/2025-05-19/motorbike-off-road-champion-daniel-sanders-next-challenge/105307214",
    "title": "After conquering off-road rallying, Daniel Sanders is chasing further glory",
    "publish_date": "Mon, 19 May 2025 00:31:50 +0000",
    "category": "sports",
    "authors": [],
    "text": "The chances of coming across a Dakar Rally winner at work in regional Australia, knee-deep in a farm dam, are always slim — but never zero.\n\nVictorian motorbike racer Daniel Sanders is that slim chance.\n\nThe 30-year-old, a rising star in the high-speed world of rally-raid — and winner of one of the world's toughest races in January — is focused on the third race of the 2025 World Rally-Raid Championship this week.\n\nBut lately, his mind's been put to much lower-adrenaline pursuits.\n\nSanders celebrates with an Australian flag after winning the Dakar Rally. (Supplied: Instagram)\n\nLush apple farm a world away from desert tracks\n\nSanders had previously said if he wasn't a racer, he'd probably be a farmer.\n\n\"Apples are in full swing here at the moment,\" he said of his 12-week break from competition, at the family farm about 65km from Melbourne.\n\n\"The old man's flat-out picking. I'm just tidying up some machines … It's been a really dry end to the summer, so we're cleaning out dams and making sure they're ready to fill up for next summer.\"\n\nSanders Apples is a fourth-generation, 100-acre orchard growing on the slopes of a Yarra Valley hillside in Three Bridges — a locale home to about 200 people and innumerable bush tracks. Beneath the canopies of towering native eucalypts, soft-edged roads wind through the valley's hills.\n\nAway from the track Sanders works on the farm, but motorbikes are never far away. (Supplied: Instagram)\n\nIt's the Aussie's home away from the overseas desert tracks over which he's lately firmed his reputation as a tactical and uncompromising competitor.\n\nRally-raid is a mixed-class category: high-powered dirt bikes race alongside almost futuristic, purpose-built rally cars, and even quad bikes. It's a tactical race against the clock on epic, constantly-changing courses that take days to complete. The World Championship consists of five races this year, beginning with the famed Dakar Rally — which Sanders won convincingly.\n\nAfter that win — making Sanders the second Australian to win The Dakar after Toby Price — and the celebrations that ensued, Sanders returned to Three Bridges as family duty called.\n\nSanders made history as the second Australian to win the Dakar Rally earlier this year. (Supplied: Instagram)\n\nLong, quiet days in the paddock perfect training ground\n\nEven the winner of one of the world's toughest races still had to help around the farm — not that he complained.\n\n\"I've been pretty busy between training and working on those [farm] machines,\" he said.\n\n\"Tidying things up and making it a bit easier for my old man and my uncles.\n\n\"Making sure the irrigation's good and all the water's running as well.\"\n\nApples are never far away. Sanders with a carton of produce at the Australian Formula 1 Grand Prix. (Supplied: Instagram)\n\nDays in the paddock — sunrise to sunset, he said — might seem an unusual distraction for a world-class motorbike racer — especially one who leads a World Championship approaching the season's half-way point.\n\nSome competitors might spend their days burning around a test track or poring over data seeking an edge for the next event.\n\nTo be sure: he'd kept up his training, and wasn't short of social engagements.\n\nBut work around the farm — training his mind to hone a different kind of focus than the type needed for days spent flat-out on a motorbike — would, he hoped, help sharpen him for the season's remaining week-long races.\n\n\"It's just a long day like we do in rally, so it's … training for your mental side,\" he said.\n\n\"When you jump back on a bike it makes you really enjoy it and keeps you motivated.\"\n\nBut inevitably, after a nearly three-month break, the championship race has pulled him back to competition.\n\nThe farming gear has been switched for racing leathers, hat for a helmet, and from work gloves to racing ones — CHUCKY, his nickname, emblazoned on them above a bright cartoon of a honey-dripped apple.\n\nNow the focus is on the pursuit of victory over the coming days, this time in southern Africa.\n\nApples are an integral part of Daniel Sanders's brand. (Supplied: Daniel Sanders)\n\nSwapping desert sand for dirt and gravel\n\nThe six-day Safari Rally marks the World Rally-Raid Championship's first visit to South Africa, and presents distinctly different challenges to those posed in North Africa and Arabia, where Sanders has lately excelled.\n\nShifting desert dunes, with red-gold sand rising like giant waves, have been the backdrop for each of Sanders's recent wins in Morocco, Saudi Arabia and Abu Dhabi.\n\nIn South Africa, competitors expect more solid ground.\n\nOrganisers say dirt and gravel will make up three-quarters of the rally's 1,600-kilometre route through the country's expansive northern middleveld and highveld — midfield and highfield — a broad area outside Johannesburg defined by its changing vegetation and soils, rising from 600 to 1,800 metres above sea level.\n\nWater crossings, dense bushland and open plains are promised — maybe even a close encounter with one of Africa's famed natural predators.\n\nA promotional image for the South Arica Safari Rally. (Supplied: South Africa Safari Rally)\n\nSanders expects a close race but, he said, he's hopeful the conditions have parallels to Australia.\n\nA potential home advantage, only 10,000km from the farm.\n\n\"To lose 10 to 20 seconds overshooting an intersection, having to do a U-turn and come back — I think that's where you're going to lose it,\" he said.\n\nOver the journey, riders and drivers will navigate an arid and unpredictable path. It's a solo race against the clock — no GPS, no directions, just a digital roadbook and instinct.\n\nHow they reach the finish — that's largely up to them.\n\nIt means sharpened wit is needed as much as a quick throttle to find the fastest route, often concluding at a campsite hundreds of kilometres from the start line.\n\nA victory is worth 30 points, second place 25, 20 for third. A retirement? Just one.\n\nAnd any one of Sanders's rivals could take the win.\n\nSanders gets serious air while training in Australia. (Supplied: Instagram)\n\nThe championship's second-placed rider, Tosha Schareina (ESP), spent part of the break winning a 650km race through Portugal and Spain. Third-placed Ricky Brabec (USA) won a rally in Las Vegas last week. Last year's champion Ross Branch — from neighbouring Botswana — is among the favourites too.\n\nBut if having rivals chasing his tail-light distracts him, Sanders doesn't show it.\n\n\"I'm sort of all around it at the moment and have strengths everywhere,\" he said going into South Africa.\n\n\"The quicker I can get back into that rhythm, the better the result will be.\"\n\nThe South Africa Safari Rally runs May 19-24.",
    "source": "ABC",
    "cluster_id": 8
  },
  {
    "url": "https://www.abc.net.au/news/2025-05-19/pga-championship-jon-rahm-rues-missed-opportunity/105308604",
    "title": "'Tough pill to swallow': Rahm rues missed opportunity as Scheffler claims major",
    "publish_date": "Mon, 19 May 2025 00:30:50 +0000",
    "category": "sports",
    "authors": [],
    "text": "Jon Rahm appeared on the verge of doing what few thought possible — overcoming a five-shot deficit on the final day of a major championship to beat Scottie Scheffler.\n\nAnd then came the collapse.\n\nAfter battling back to tie the top-ranked Scheffler with a birdie on the 11th hole, Rahm turned what seemed like a foregone conclusion of a Scheffler victory into an entertaining back nine at the PGA Championship — at least for a while.\n\nBut the two-time major champion missed birdie putts on the 14th and 15th holes, and hooked drives on 16 and 18, playing the final three holes in five-over par, leaving him trying to process his thoughts after his round.\n\nScottie Scheffler with wife Meredith and son Bennett after winning the PGA Championship. (Getty Images: Kevin C. Cox)\n\n\"Am I embarrassed a little bit about how I finished today? Yeah,\" Rahm said.\n\n\"But I just need to get over it, get over myself. It's not the end of the world. It's not like I'm a doctor or a first responder, where somebody, if they have a bad day, truly bad things happen. I'll get over it. I'll move on.\"\n\nThe Spanish star wound up with a two-over 73 and tied for eighth place, eight shots behind Scheffler.\n\nThat would have been an inconceivable outcome for Rahm just an hour before.\n\n\"The last three holes, it's a tough pill to swallow right now,\" he said.\n\n\"Especially knowing 16 is not the narrowest fairway in the world. That bunker is in play. You're lucky enough, you have a shot to the pin. Not a terrible swing, but bad enough to put me in a real difficult situation.\"\n\nBut Rahm said in hindsight he felt the tournament began to slip away on the 14th hole.\n\nDressed in all black with a pink hat on a 30C day, he was looking to become the seventh player to win the PGA Championship after trailing by five or more shots entering the final round.\n\nHe blasted his tee shot on the 14th hole 340 yards onto the oblong green, but instead of the ball tracking toward the flag stick, it took a nasty bounce into the bunker. He hit out of the sand hoping to save birdie, but misread his birdie putt and had to settle for par.\n\nHe misread another birdie putt on 15 and took another par.\n\nThe momentum from his birdie binge on holes 8, 10 and 11 was long gone, and his confidence seemed shaken.\n\nHe had errant drives on 16 and 18 and made double bogeys on the final two holes.\n\n\"I think it was a bit of nerves,\" Rahm said.\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\n\"Can't pinpoint exactly right now. I'll go back to what happened. I didn't feel like I rushed anything. I didn't feel like the process was bad.\"\n\nRahm left the course disappointed, receiving a long embrace from his wife.\n\nHe said that when he has time to reflect on the week, he may view it in a different light.\n\nFor 15 holes, he said it was the most fun he's had on the golf course in quite a while. And, he had played himself into contention on the final day of a major championship for the first time since leaving the PGA Tour for LIV Golf in December 2023.\n\n\"Again, there's a lot more positive than negative to think about this week,\" Rahm said.\n\n\"I'm really happy I put myself in [that] position, and hopefully learn from this and give it another go in the US Open. … I think it's the first time I've been in position to win a major that close and haven't done it. The only times I think I've been in the lead in a major on a Sunday, I've been able to close it out.\n\n\"This is a very different situation.\"\n\nAustralia's Adam Scott also made a brief run at that lead, but faltered late and finished two-under for the tournament, equal with Cam Davis as the best finishing Aussies tied for 19th.\n\nThe ABC of SPORT Sports content to make you think... or allow you not to. A newsletter delivered each Saturday.\n\nAP",
    "source": "ABC",
    "cluster_id": 9
  },
  {
    "url": "https://www.abc.net.au/news/2025-05-19/maroons-state-of-origin-squad-set-for-three-debutants/105308424",
    "title": "Maroons turn to three Origin debutants as Queensland counts the cost of injury",
    "publish_date": "Sun, 18 May 2025 23:26:03 +0000",
    "category": "sports",
    "authors": [],
    "text": "Robert Toia grew up idolising Greg Inglis and now he gets to follow in his footsteps, with the Sydney Roosters rookie set to make his State of Origin debut.\n\nThe 20-year-old centre joins Gold Coast second-rower Beau Fermor and Melbourne lock Trent Loiero as debutants in the Maroons side to play in the Origin series opener on May 28 at Lang Park.\n\nAfter losing last year's series 2-1, coach Billy Slater has put his faith in new blood.\n\nA pectoral injury to Dolphins forward Tom Gilbert and a calf issue for North Queensland winger Murray Taulagi opened the door to offer new candidates an opportunity.\n\nOn the cusp of the side being named, Brisbane outside back Selwyn Cobbo also suffered a possible wrist fracture in the 30-26 loss to St George Illawarra.\n\nSelwyn Cobbo has joined a growing injury list for the Maroons. (AAP: Dave Hunt)\n\nToia overcame two ACL ruptures to finally make his NRL debut this year and in 10 matches, he showcased rare talents.\n\nHe has an unflustered temperament along with power, speed and skill. That was best highlighted in a 36-26 win over the Dolphins at Magic Round, where he scored two tries, had a try assist and created carnage.\n\n\"I would love to play Origin,\" former Queensland under-19 representative Toia said after round 11.\n\n\"I just remember watching GI [Inglis] and how dominant he was. It didn't matter who was in front of him, he was just able to create havoc.\"\n\nFermor, 25, has also suffered two ACL tears. The latest wiped him out of the 2023 season after he had been invited into the Maroons camp in 2022.\n\nThis year, he has found his groove as a superb edge forward who runs great lines and defends strongly.\n\nLoiero is well-known for being a feisty forward who plays with physicality and work ethic, highlighted by his average of 117m and 32 tackles per game in 2025.\n\nYeo to captain as NSW Blues announce State of Origin team Photo shows Isaah Yeo poses for a photograph during a NSW Blues media day, leaning on a wall, folding his arms Penrith Panthers lock Isaah Yeo has been named the new NSW captain as the Blues team for State of Origin Game I is announced.\n\nThe Maroons have made other selection decisions forced partly by injury. Incumbent fullback Reece Walsh (knee) and utility Ben Hunt (hamstring) are both unavailable.\n\nNewcastle captain Kalyn Ponga, who came off the bench in game three last year, returns to the starting custodian's role for the first time since the 2022 decider, when he was man of the match.\n\nMaroons champion Cameron Munster is back in the number 6 jersey after missing last year's series with injury. That pushes Cowboys co-captain Tom Dearden from five-eighth to the number 14 jersey previously worn by Hunt with distinction.\n\nTitans captain Tino Fa'asuamaleaui also returns to the Maroons side at prop after missing last year with an ACL tear.\n\nLIKELY QUEENSLAND SIDE: 1 Kalyn Ponga, 2 Xavier Coates, 3 Robert Toia, 4 Hamiso Tabuai-Fidow, 5 Valentine Holmes, 6 Cameron Munster, 7 Daly Cherry-Evans (c), 8 Moeaki Fotuaika, 9 Harry Grant, 10 Tino Fa'asuamaleaui, 11 Reuben Cotter, 12 Jeremiah Nanai, 13 Pat Carrigan, 14 Tom Dearden, 15 Lindsay Collins, 16 Beau Fermor, 17 Trent Loiero, 18 Kurt Mann, 19 Jesse Arthars, 20 Kulikefu Finefeuiaki.\n\nThe ABC of SPORT Sports content to make you think... or allow you not to. A newsletter delivered each Saturday.\n\nAAP",
    "source": "ABC",
    "cluster_id": 10
  },
  {
    "url": "https://www.abc.net.au/news/2025-05-19/sunshine-coast-rental-scam-nursing-student/105300658",
    "title": "Scammers use social media to connect with people looking for rentals",
    "publish_date": "Sun, 18 May 2025 23:21:02 +0000",
    "category": "finance",
    "authors": [],
    "text": "As the weight of the housing crisis bears down on many Australians, some are not only losing the roof over their heads but also their money to brazen rental scams.\n\nSimon Alexander, 39, moved to the Sunshine Coast from the regional town of Goomeri, west of Gympie, to pursue a nursing career.\n\nHe said his search for a home became desperate after he was forced out of his first rental property after only a fortnight because his housemate was found to be subletting without approval.\n\nMr Alexander says he lost thousands of dollars as a result of social media rental scams. (ABC Sunshine Coast: Jay Carstens)\n\nEventually, he found another rental through Facebook, and the advertiser took him through a video walk-through of the property.\n\n\"I shouldn't have trusted anyone, but I was a bit desperate,\" Mr Alexander said.\n\nHe supplied personal information to the scammer along with a $1,200 bond payment and $600 for rent in advance, only to find it already occupied when it was time to move in.\n\n\"It wasn't until I went to go move my stuff in that I realised that there was already somebody there,\" he said.\n\n\"They owned the place, and they knew nothing of this person [the scammer].\n\n\"[We were] around the same age … and they had quite a number of friends, it was very believable\".\n\nMr Alexander moved towns to pursue a nursing course but found himself targeted by rental scammers. (ABC Sunshine Coast: Jay Carstens)\n\nIn a vulnerable position, Mr Alexander experienced the same situation again.\n\nAnother listing he was looking at was occupied by someone who had no idea a scammer was trying to rent out their home online.\n\nMr Alexander became homeless as a result of the repeated scams after losing more than $4,000.\n\nEven the cost of attending his nursing course became too much, and he was forced to quit.\n\n\"I've literally been homeless on the streets, and I've been robbed on the streets. I got chased by a couple of guys with a weapon … it's been really full-on,\" he said.\n\nHe said seeking help while sleeping rough had been difficult, and access to community services and housing was almost non-existent.\n\n\"All these community services are stretched thin … [The Department of Housing] actually gave me a gift voucher to go buy a tent,\" he said.\n\n\"I want people to learn from my mistakes. I want people to become more educated around how to avoid these things.\"\n\nMr Alexander recently found a temporary place to stay and has gained work as a cleaner, with plans to move into more secure housing soon.\n\nData reveals increasing issue\n\nData provided to the ABC by IDCARE, a non-for-profit national identity and cyber support service, exposed a notable increase in the amount of money Australians were losing to rental scams.\n\nQueenslanders are losing more money on rental scams than any other state. (ABC News: Mark Leonardi)\n\nTotal monthly losses to rental scams nearly tripled in Queensland in the past year, with the average loss per scam case doubling in the five months from November to March from $2,280 to $4,683.\n\nQueenslanders are losing more to these kinds of scams than anywhere else in the country, with average personal losses about 60 per cent higher than the national average.\n\nIDCARE spokeswoman Kathy Sundstrom said more than 60 per cent of rental scams were on social media, with 80 per cent coming from organised crime groups overseas.\n\n\"The criminals are not only creating fake social media accounts but are hacking into people's existing account to post listings, creating a false sense of legitimacy,\" she said.\n\n\"It's becoming harder for them [the scammers] to create new accounts so what they prefer to do is to compromise existing ones that take over your account and contact people pretending to be you.\n\n\"It's far more effective because you have a history … you have a reputation, you have friends, you're so much more believable than just creating a new account.\"\n\nPaula Ford credits her time working at the tax office for knowing how to spot a scammer. (ABC Sunshine Coast: Jay Carstens)\n\nSunshine Coast grandmother and former Australian Taxation Office (ATO) debt collector Paula Ford turned to local Facebook groups because the National Rental Affordability Scheme (NRAS) was ending.\n\n\"I had to change jobs because this is an NRAS house,\" she said.\n\n\"And the rent was doubling, so I needed to get a job where I could afford to pay the rent but, as it turned out, it didn't work out, given my mental illness.\"\n\nBut as she inquired about two properties listed in the groups, she was not expecting to be asked to make up-front payments to meet the advertiser.\n\n\"Every time I wanted to meet, it was like, 'You have to have the $100 first' and I'm like, 'I'm not going to give $100 to someone I don't know,'\" Ms Ford said.\n\nMs Ford realised she was being targeted by rental scammers when they asked for an up-front payment. (ABC Sunshine Coast: Jay Carstens)\n\nShe said she was grateful for her time at the ATO, which prepared her for dealing with scammers.\n\n\"She [the scammer] wouldn't meet with me … unless I gave her a $100 Apple gift card,\" Ms Ford said.\n\n\"Working at the ATO [they taught us] that's one of the scams that they use on people to pay their ATO debt.\"\n\nApplication fee is a warning sign\n\nQueensland's Rental Tenancy Authority (RTA) recommends that those who have experienced a rental scam report the matter to the Office of Fair Trading, or police if it involved fraud.\n\nThe RTA also urged people to look up the history of the property and the person who listed it before sending any money, as more than 90 per cent of rentals in the state were managed by real estate or property agents.\n\nMs Ford received multiple messages from rental scammers as she searched for a new home on social media. (ABC Sunshine Coast: Jay Carstens)\n\nA copy of the tenancy agreement must be given to tenants before any money is paid, and a property owner or manager cannot charge a future tenant an \"application fee\".\n\nMs Sundstrom from IDCARE said people should report suspicious profiles to Facebook and set up two-factor authentication to protect their own social media profiles.\n\n\"It's really important that people think about how they go about looking for a rental property and you have to be so careful on those [Facebook] community groups,\" she said.\n\n\" Don't pay the money up-front … demand to inspect the property first, [and] preferably try to deal with rental agencies first who have that extra credibility behind them. \"\n\nFacebook and its parent company, Meta, were contacted for comment.",
    "source": "ABC",
    "cluster_id": 11
  },
  {
    "url": "https://www.abc.net.au/news/2025-05-19/stuart-knowles-appointment-under-scrutiny-territory-coordinator/105303840",
    "title": "Closed recruitment of ex-gas boss to 'extraordinary' public job criticised",
    "publish_date": "Sun, 18 May 2025 23:05:00 +0000",
    "category": "finance",
    "authors": [],
    "text": "The Northern Territory government has faced criticism over its move to hand a former gas executive \"extraordinary powers\" to green-light private development, without publicly recruiting for the \"highly-paid\" position.\n\nLast Thursday, Stuart Knowles was appointed as the first territory coordinator, gaining a four-year term after acting in the role since November.\n\nThe government passed new laws to create the position in March, and it comes with sweeping powers to \"consolidate regulatory processes\" for projects of \"economic significance\".\n\nMr Knowles, a former NT Inpex boss, now has the ability to issue \"step-in notices\" and take over some assessments from other approval bodies.\n\nWhat is the territory coordinator bill? Photo shows NT parliament building The NT government says the territory coordinator bill is the \"most important piece of economic reform\" seen in a decade.\n\nHe gains powers to override dozens of NT laws, including those regulating the environment, pastoral land, petroleum, heritage and water.\n\nOpposition Leader Selena Uibo said the \"high standards expected of the public service\" had not been applied in the government's appointment of Mr Knowles, claiming there was no open recruitment for the role.\n\n\"The Labor opposition is struggling to find the process that has been used to appoint Mr Knowles in this highly-paid taxpayer position for four years,\" she said.\n\n\"What vetting processes were afoot, what open recruitment process has the CLP government followed?\n\n\"So far it looks like none.\"\n\nSelena Uibo has questioned the process around the hiring of Stuart Knowles. (ABC News: Pete Garnish)\n\nA government spokesperson said a selection panel undertook a \"formal assessment process\" before Mr Knowles was appointed territory coordinator on Thursday.\n\nIn a statement, Mr Knowles said that process assessed his \"private and public sector strategic project experience, and qualifications in management, auditing and corporate governance\".\n\nThe government declined to answer multiple ABC requests for information on how much Mr Knowles would get paid in the role, nor whether it considered other candidates.\n\nKnowles 'deeply sorry' for animal neglect\n\nLabor's questioning in parliament last week also centred around media reports by the NT Independent that Mr Knowles was investigated by NT Animal Welfare for animal neglect 10 years ago.\n\nDuring the investigation, four dogs were seized and taken to a vet for treatment, with a warning issued to Mr Knowles.\n\nTerritory coordinator bill under fresh scrutiny Photo shows The exterior of the Northern Territory's Parliament House building. Changes to the NT's controversial territory coordinator bill that would modify heritage laws and create new powers to enter private property, in a bid to fast-track economic development, have come under fresh scrutiny.\n\nMr Knowles said in a statement he took full responsibility for the \"unintended\" animal neglect.\n\n\"I am deeply sorry for the distress caused to my dogs due to the tick infestation on my property a decade ago,\" he said.\n\n\"I deeply regret my failure to prevent it.\"\n\nMr Knowles said during the investigation, animal welfare officers attended his property three times in six weeks to assess the dogs' condition.\n\n\"After confirming that remedial actions, including tick eradication treatments, were successful and the dogs were in good health, they concluded their investigation,\" he said.\n\n'Open questions' about Knowles's fitness for role, MLA says\n\nIndependent MLA Justine Davis has also raised concerns about Mr Knowles's appointment, saying parliament members know little about how he was chosen for the role.\n\n\"There are open questions about his fitness for the role, the integrity of the recruitment process that led to his appointment, and ongoing concerns about potential conflict of interest — actual or perceived — Mr Knowles may have given his prior work with Inpex,\" she said.\n\n\" The territory coordinator holds extraordinary power, the public must be confident that the territory coordinator is a fit and proper person, and the hiring process is rigorous. \"\n\nJustine Davis says there are open questions about the recruitment process. (ABC News: Michael Franchi)\n\nMs Davis said the role's selection criteria — which the new laws limit to \"suitable qualifications or experience\" relating to the territory coordinator's functions — were \"totally inadequate\".\n\nShe said the legislative scrutiny committee, which she was part of, recommended the job criteria exclude government or judicial officials and people who had donated to a political party in the past.\n\nConcerns new territory coordinator role will 'cut corners' Photo shows Politician looks ahead at press conference The interim territory coordinator faced a barrage of questions during a community consultation session this week on controversial draft laws designed to fast-track major economic projects in the NT.\n\nHowever that request was rejected, along with another recommendation that the territory coordinator's appointment should require the parliament's endorsement.\n\n\"It remains difficult to understand why the CLP would object to basic integrity standards for powerful public service roles like the territory coordinator,\" Ms Davis said.\n\nMr Knowles worked in the Department of Chief Minister and Cabinet prior to joining Inpex as a compliance approvals manager in 2014.\n\nHe went on to become the gas giant's NT general manager, and later worked for a consulting firm before he took on the territory coordinator role.\n\nChief Minister Lia Finocchiaro said Mr Knowles had \"extensive\" public and private sector experience and an \"understanding of the Northern Territory's unique challenges and opportunities\".\n\nLia Finocchiaro has defended the hiring of Stuart Knowles. (ABC News: Michael Franchi)\n\nLast week the government was also criticised for making a \"captain's pick\" appointment of Legal Aid NT's new director — which prompted a string of resignations from the organisation's board.",
    "source": "ABC",
    "cluster_id": 12
  },
  {
    "url": "https://www.abc.net.au/news/2025-05-19/generative-ai-use-in-everyday-life-callout/105273566",
    "title": "How has generative AI changed life for you?",
    "publish_date": "Sun, 18 May 2025 23:04:31 +0000",
    "category": "finance",
    "authors": [],
    "text": "Generative AI has found its footing in our everyday lives.\n\nIn its early days, the tools gained traction for suggesting recipes and activities and crafting to-do lists and reminders.\n\nNo longer limited to personal use, generative AI has far progressed into our learning and working lives.\n\nWe want to know about how you use generative AI and what impact it's having on your life.\n\nWe'll be using your submissions to expand our understanding on this topic and our journalists may be in touch for a digital or social media story.",
    "source": "ABC",
    "cluster_id": 13
  },
  {
    "url": "https://www.abc.net.au/news/2025-05-19/boxers-adjust-training-methods-as-head-injury-knowledge-grows/105253978",
    "title": "As interest in combat sport grows, athletes look to protect their heads",
    "publish_date": "Sun, 18 May 2025 22:31:15 +0000",
    "category": "sports",
    "authors": [],
    "text": "After more than a decade of boxing, Sam Dwyer knows he is taking a risk.\n\n\"I think it's a bit of cognitive dissonance,\" he said.\n\n\"There's nothing you do in life that doesn't have risk … but obviously protecting yourself is very important.\"\n\nHowever, a new analysis of head knocks by Central Queensland University's (CQU) Ragnar Purje found that even low-level impacts on the head in sports like boxing can reduce neural function.\n\nThe analysis also highlighted the particular risks of head knocks for children, with even sub-concussive impacts having long-term consequences.\n\nDr Purje's colleague, CQU's head of educational neuroscience Ken Purnell, said experts wanted to make sports \"smarter, not softer\".\n\n\"It's not about banning boxing or karate or soccer or whatever else,\" Professor Purnell said.\n\n\"It's really more about awareness … all thinking about prioritising that safety for the brain, so the sport can be thriving.\"\n\nDwyer says he's seen boxing grow in popularity in recent years. (ABC News: Ian Cutmore)\n\nA growing sport\n\nA professional boxer, promoter and gym owner from Mount Gambier in South Australia's south-east, Dwyer started in the sport 13 years ago.\n\n\"It's opened up a whole world of opportunities for me,\" he said.\n\nDuring that time, he started his gym, began running events, and has seen increased participation and attendance.\n\n\"Combat sports are having a little bit of a revival,\" he said.\n\n\"When I moved back to Mount Gambier, I was one of a handful of amateur boxers. Now we've got 20-odd getting ready to fight out of the gym.\"\n\nDwyer said the motivations behind people taking up the sport varied, with some never intending to get hit.\n\n\"All of our technical and general classes are non-contact, so there's a lot of people that do it just for the fitness and community side,\" he said.\n\n\"Probably 75 per cent of our gym members are just here for fitness.\"\n\nSam Dwyer also trains other fighters in Mount Gambier. (Supplied: Dwyer's Boxing Promotions)\n\nSub-concussive blows add up\n\nProfessor Purnell said that as the popularity of combat sports had grown in recent years, so had the knowledge about the impact on the brain.\n\n\"We've got a brain that floats in fluid … it's really got the consistency of soft butter,\" he said.\n\n\"Even if a knock to the head doesn't cause concussion, it can contribute to long-term brain changes, especially in young athletes where their brains are still developing.\"\n\nProfessor Purnell said the sub-concussive blows could add up, causing symptoms such as mood changes, brain fogginess, irritability and more.\n\nDwyer said that while he had so far avoided issues with head injuries, many boxers had changed the way they train.\n\n\"Back when I started, we'd do a lot more sparring than we do now,\" he said.\n\n\"We do a lot more skill work and the sparring we do, unless we're coming into comp, is very light.\n\n\" But I think it really boils down to it's a contact sport and to some degree we have to accept the risk. \"\n\nDwyer has been boxing for more than a decade. (Supplied: Dwyer's Boxing Promotions)\n\nMaking sports 'smarter' on head injuries\n\nProfessor Purnell said it would be impossible to remove head contact from sports where it was ingrained in the culture, such as combat sports.\n\nBut he said administrators needed to look at ways to minimise risks across all sports.\n\n\"We're smart about when we get in a car that we wear our seatbelt,\" he said.\n\n\"So what can we do, whether it's soccer or hockey or netball or whatever, to reduce the possibility of it occurring and then to help if and when it does?\" he said.\n\nBeyond the sports themselves, Professor Purnell said the \"magic four\" elements of connectedness with other people, good nutrition, decent sleep and exercise could help maintain a healthy brain.\n\n\"If you're in that period where you've had a few of these knocks, but you do these things, they help to mitigate against some of those more adverse impacts,\" he said.\n\n\"The moment something starts to interfere with your daily life, you know that's when you really need to take some action to reduce that.\"",
    "source": "ABC",
    "cluster_id": 14
  },
  {
    "url": "https://www.smh.com.au/business/the-economy/the-trump-alarm-bells-are-ringing-louder-20250519-p5m0a9.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "The Trump alarm bells are ringing louder",
    "publish_date": "Mon, 19 May 2025 11:59:52 +1000",
    "category": "finance",
    "authors": [
      "Stephen Bartholomeusz"
    ],
    "text": "“Over the next decade, we expect larger deficits as entitlements spending rises while government revenue remains broadly flat. “In turn, persistent, large fiscal deficits will drive the government’s debt and interest burden higher. The US fiscal performance is likely to deteriorate relative to its own past and compared to other highly-rated sovereigns.” US government debt has ballooned over the past decade. US debt is ballooning. Credit: Bloomberg It was just under $US20 trillion when Donald Trump first took office but had swollen to $US27.7 trillion by the start of the Biden administration, with Trump’s 2017 $US4.5 trillion “Tax and Jobs Act” the major influence.\n\nIt is now $US36.2 trillion, thanks to Biden’s massive spending on climate-related concessions, infrastructure spending and his CHIPS and Science Act. In March, the Congressional Budget Office released its projections for US debt and deficits, saying the deficit would reduce from last year’s 6.4 per cent of GDP to 6.1 per cent over the next decade. Debt would, however, rise from 98 per cent of GDP in 2024 to 118 per cent in 2035. More recently, it has factored in the One, Big, Beautiful Bill. That would, it says, increase annual deficits from $US1.9 trillion to $US2.9 trillion in 2034, or 6.9 per cent of GDP, or potentially as much as $US3.3 trillion and 7.8 per cent of GDP if some measures in the bill, which are scheduled to expire at the end of Trump’s term, were to be made permanent. (Some of the “temporary” measures are only temporary to try to make the bill look less profligate, while others look like an inducement for his supporters while he is in office, with their expiry his successor’s problem).\n\nDebt would increase by $US3.3 trillion by 2034 – $US5.2 trillion if the spending measures were made permanent – or to 125 per cent of GDP (129 per cent if permanent). Annual interest costs would rise between $US1.8 trillion (4.2 per cent of GDP) and $US1.9 trillion (4.4 per cent of GDP). In other words, this big, beautiful bill would take a fiscal position which, in any economy without America’s privileged position would already be unsustainable, and make it worse. Trump’s aggressive policies have hurt the US dollar. Moreover, given that Trump’s tax package is highly regressive – the wealthy would continue to benefit significantly while lower income households see little or no benefit – it would exacerbate inequality. Moody’s, while cutting America’s rating, awarded the US a stable outlook because of a history of effective monetary policy led by an independent Federal Reserve, the constitutional separation of powers and America’s unique status and the world’s dominant reserve currency provider.\n\nThose attributes are being tested by the current administration. Loading Trump has routinely slammed the Fed and its chairman, Jerome Powell, threatened to sack Powell (until the markets’ reactions caused him to back off) and is expected to insert his own nominees into the Fed at every available opportunity. He would subvert the Fed’s independence if he thought financial markets would let him. With Trump effectively ignoring Congress and governing via executive orders, many of which have dubious legal or constitutional authority, and disregarding Supreme Court orders on immigration, the separation of powers doctrine in the US is being tested by his administration. The US dollar is the world’s reserve currency, but it has depreciated by more than 8 per cent against a basket of its major trading partners’ currencies and there have been indications of capital outflows, or at least reduced inflows, as a result of Trump’s aggressive trade policies.\n\nWhile financial markets have calmed since Trump announced 90-day pauses of his proposed “reciprocal” tariffs and his 145 per cent tariff on imports on China was reduced (temporarily?) to 30 per cent, before those stays there was a strong “sell America” mood among foreign investors. Given that Trump’s tax package is highly regressive – the wealthy would continue to benefit significantly while lower income households see little or no benefit – it would exacerbate inequality. When the 90-day pauses end the administration is now saying it will replace its “reciprocal” tariffs, which were supposed to be negotiated trade deals, with unilateral tariffs. “I own the store (the US economy) and I set prices,” Trump has said. The tariffs, their impact on the US economy and their impact on America’s trade partners have the potential to be highly disruptive and negative for the US and the rest the world.\n\nThey risk a self-induced recession in the US (and deficits and debt that are an even higher proportion of GDP as a consequence) while slowing growth around the world. They also place a questionmark over something of longer-term consequence than the short-term ebbs and flows in economic activity in the US and elsewhere. Trump’s “America First” unilateralism, and his economic illiteracy, has unsettled allies and the investors needed to buy the swelling tide of government debt that the US is already issuing even before the effects of the One, Big, Beautiful Bill start flowing. If Trump’s trade war were to cause more capital to flow out of the US than flows in, initially it would result in higher interest costs and bigger deficits and debt than would already be the case. Longer term it could undermine the reserve currency status of the dollar, which is America’s greatest financial asset. It helps prevent the US from experiencing the external pressures and the risk of a financial crisis that any other economy with its deteriorating fiscal outlook would be facing.",
    "source": "SMH",
    "cluster_id": 15
  },
  {
    "url": "https://www.smh.com.au/property/news/sydney-dad-spends-6-12m-on-balmain-east-home-his-daughter-can-live-in-20250519-p5m0al.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Sydney dad spends $6.12m on Balmain East home his daughter can live in",
    "publish_date": "Mon, 19 May 2025 11:51:09 +1000",
    "category": "finance",
    "authors": [
      "Carmen Forward"
    ],
    "text": "A four-bedroom waterfront in Balmain East with sweeping harbour views sold for $6.12 million at auction on Saturday.\n\nGuided at $6 million, the deep waterfront at 5A Little Edward Street came with a pontoon and mooring able to secure a 15-metre vessel.\n\nThe buyer was from Putney and, although he was purchasing it in his own name, his daughter returning from America may live in it. The vendor had maintained the property as an investment with an agreement that allowed him to use the jetty and pontoon while tenanted.\n\nTwo parties registered, but as neither would make a start, a vendor bid of $5.8 million was placed. A third party, who saw it for the first time that day, then registered and got involved.",
    "source": "SMH",
    "cluster_id": 16
  },
  {
    "url": "https://www.smh.com.au/national/australia-news-live-pm-meets-pope-leo-xiv-former-us-president-joe-biden-diagnosed-with-cancer-20250519-p5m09c.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Australia news LIVE: PM meets Pope Leo XIV; Former US president Joe Biden diagnosed with cancer",
    "publish_date": "Mon, 19 May 2025 11:45:48 +1000",
    "category": "finance",
    "authors": [
      "Sarah Mcphee"
    ],
    "text": "The Australian sharemarket has retreated today, following US futures lower as investors reacted to ratings agency Moody’s stripping the US of its AAA credit rating and deepening concern that growing debt will damage America’s standing as the choice destination for global capital.\n\nThe S&P/ASX200 dropped 29.80 points, or 0.4 per cent, to 8313.90 shortly before 11am. Nine of 11 industry sectors were in the red, with materials and energy stocks weighing on the bourse.\n\nNewmont Corporation, up 4.2 per cent, bucked the trend of the materials sector to be among the biggest risers, while a fall in iron ore prices caused BHP (down 1.8 per cent), Fortescue (down 1.9 per cent) and Rio Tinto (down 1.3 per cent) to drop. Mineral Resources (down 5.2 per cent) slumped as it unveiled its new chairman, Malcolm Bundey, who will take over from James McClements on July 1.\n\nEnergy companies fell after oil prices dropped. Santos shed 0.5 per cent and Woodside lost 0.4 per cent.\n\nThe Commonwealth Bank rose 0.6 per cent while the rest of the big four banks had minor falls.\n\nRead more on today’s markets here.",
    "source": "SMH",
    "cluster_id": 17
  },
  {
    "url": "https://www.smh.com.au/sport/nrl/if-you-picked-an-australian-side-right-now-nsw-would-dominate-which-is-just-how-qld-likes-it-20250518-p5m05c.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "If you picked an Australian side right now, NSW would dominate. Which is just how Qld likes it",
    "publish_date": "Mon, 19 May 2025 11:45:00 +1000",
    "category": "sports",
    "authors": [
      "Dan Walsh"
    ],
    "text": "It’s a favourite of TV panel shows, talkback radio and the click-hungry right across the rugby league landscape - what would a post-Origin Kangaroos side look like?\n\nBut if you were doing Mal Meninga’s job for him on Sunday afternoon, based on the NSW and Queensland squads filtering through, the Roos were distinctly sky-blue.\n\nPicking a merit Australian side right here, right now, based on 2025 form lines (as Meninga used to do after each series a few years ago), a fair argument could be made for an 11-6 split in favour of NSW.\n\nEspecially considering the NRL’s two form fullbacks - James Tedesco and Ryan Papenhuyzen - won’t feature for the Blues, though most accept Dylan Edwards’ incumbency and four-straight titles for Penrith as a sound selection basis.",
    "source": "SMH",
    "cluster_id": 18
  },
  {
    "url": "https://www.smh.com.au/sport/nrl/daley-wants-latrell-to-be-latrell-in-origin-20250519-p5m09t.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Daley wants ‘Latrell to be Latrell’ in Origin",
    "publish_date": "Mon, 19 May 2025 11:42:18 +1000",
    "category": "sports",
    "authors": [
      "Christian Nicolussi"
    ],
    "text": "Laurie Daley revealed Terrell May was overlooked for Origin I because “others are playing better than him”, Tom Trbojevic needed to rediscover his confidence for Manly, while he was confident NSW would get the best out of Latrell Mitchell.\n\nBlues players started assembling in camp at Sydney Olympic Park on a cool Monday morning, including Payne Haas, whose scans results confirmed a minor quad strain, which will not keep him out of next Wednesday’s series opener.\n\nReturning to the Blues’ top job for the first time since 2017, Daley explained why Wests Tigers’ prop May, and Sea Eagles’ superstar Trbojevic, were left out of the opening game at Suncorp Stadium on Wednesday week.\n\n“I just think the others are playing better than Terrell May,” Daley said. “[As for Trbojevic] everyone agrees Tom, if he’s fit, is one of the best players in the game. It was a tough decision.",
    "source": "SMH",
    "cluster_id": 19
  },
  {
    "url": "https://www.smh.com.au/property/news/young-couple-pay-720-000-over-the-reserve-for-renovated-brunswick-terrace-20250519-p5m0an.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Young couple pay $720,000 over the reserve for renovated Brunswick terrace",
    "publish_date": "Mon, 19 May 2025 11:36:51 +1000",
    "category": "finance",
    "authors": [
      "Shona Hendley"
    ],
    "text": "Three young couples competed for a Brunswick terrace at auction on Saturday, pushing the sale price to $3.72 million.\n\nThe renovated three-bedroom home at 679 Park Street was listed with a price guide of $2.8 million to $3 million and had a reserve of $3 million, set at the top of the range.\n\nThe Victorian terrace, ‘Ellis’, located on the Princes Hill border in Brunswick, has generous living areas, a flexible layout and off-street parking. The winner and underbidder were both local to the area.\n\nProceedings opened with a bid of $2.8 million and the reserve was quickly reached. Bidding then slowed, with increments decreasing from $25,000 to $10,000, $5,000, and $1,000.",
    "source": "SMH",
    "cluster_id": 20
  },
  {
    "url": "https://www.smh.com.au/culture/tv-and-radio/dolly-parton-reveals-her-only-childhood-regret-in-resurfaced-interview-20250519-p5m0d2.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Dolly Parton reveals her only childhood 'regret' in resurfaced interview",
    "publish_date": "Mon, 19 May 2025 11:35:25 +1000",
    "category": "finance",
    "authors": [],
    "text": "Dolly Parton reveals her only childhood 'regret' in resurfaced interview\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 21
  },
  {
    "url": "https://www.smh.com.au/politics/federal/the-latest-illustrations-from-artist-matt-golding-20230608-p5df5o.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "The latest illustrations from artist Matt Golding",
    "publish_date": "Mon, 19 May 2025 11:33:13 +1000",
    "category": "entertainment",
    "authors": [],
    "text": "The latest illustrations from artist Matt Golding\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 22
  },
  {
    "url": "https://www.smh.com.au/goodfood/recipes/manti-style-lamb-pasta-20250402-p5lomf.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Manti-style lamb pasta",
    "publish_date": "Mon, 19 May 2025 11:32:55 +1000",
    "category": "lifestyle",
    "authors": [
      "Jessica Brook"
    ],
    "text": "Step 1 Heat the oil in a large non-stick frying pan over high heat. Add the onion and garlic, season with salt and cook for 4 minutes, or until they start to colour.\n\nStep 2 Add the mince and cook for 8 minutes, breaking it up in the pan with the back of a spoon. Add the tomato, 1 tablespoon of the sumac, ½ teaspoon of the dried mint, and ½ cup water. Bring to a simmer and cook for 10 minutes.\n\nStep 3 Meanwhile, cook the pasta in boiling salted water for 6-8 minutes, or until al dente. Drain. Add the pasta to the pan with the meat sauce and toss to coat\n\nStep 4 Combine the yoghurt and lemon juice, then fold them through the pasta. Adding lemon juice helps stabilise the proteins in yoghurt so it won’t curdle when you add it to a hot dish.\n\nStep 5 Heat a small frying pan over high heat. Add the butter and garlic and cook for 2 minutes, or until nutty brown. Remove from the heat and add the remaining sumac and mint.",
    "source": "SMH",
    "cluster_id": 23
  },
  {
    "url": "https://www.smh.com.au/national/nsw/what-you-need-to-earn-to-be-in-the-top-1-per-cent-in-your-sydney-suburb-20250518-p5m051.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "What you need to earn to be in the top 1 per cent in your Sydney suburb",
    "publish_date": "Mon, 19 May 2025 11:31:00 +1000",
    "category": "finance",
    "authors": [
      "Matt Wade",
      "Craig Butt"
    ],
    "text": "The top 1 per cent of income earners in a ring of Sydney harbourside suburbs take home more than $5 million a year on average, while in another 25 neighbourhoods across the city the best-paid 1 per cent make more than $2 million.\n\nAnalysis of official personal income data by this masthead has revealed a cluster of ultra-high earners in Sydney’s eastern suburbs and lower north shore.\n\nTopping the list was Bellevue Hill where the highest paid 1 per cent had an average annual income of $7.5 million.\n\nThe 1 per cent in the adjacent neighbourhood of Rose Bay-Vaucluse-Watsons Bay was next with an average annual income of $6.4 million. Third was the 1 per cent living in the northern part of the CBD, which includes Millers Point and Barangaroo, with $5.2 million.",
    "source": "SMH",
    "cluster_id": 24
  },
  {
    "url": "https://www.smh.com.au/politics/federal/the-latest-illustrations-from-artist-simon-letch-20230608-p5df4g.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "The latest illustrations from artist Simon Letch",
    "publish_date": "Mon, 19 May 2025 11:30:07 +1000",
    "category": "entertainment",
    "authors": [],
    "text": "The latest illustrations from artist Simon Letch\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 22
  },
  {
    "url": "https://www.smh.com.au/sport/tennis/sinner-falls-short-of-title-in-rome-20250519-p5m0cx.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Sinner falls short of title in Rome",
    "publish_date": "Mon, 19 May 2025 11:29:21 +1000",
    "category": "finance",
    "authors": [],
    "text": "Sinner falls short of title in Rome\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 25
  },
  {
    "url": "https://www.smh.com.au/property/news/house-of-the-year-with-swim-up-bar-golf-simulator-snapped-up-for-cool-14m-20250519-p5m0ao.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "‘House of the Year’ with swim-up bar, golf simulator snapped up for cool $14m",
    "publish_date": "Mon, 19 May 2025 11:27:10 +1000",
    "category": "finance",
    "authors": [
      "Sarah Webb"
    ],
    "text": "A Gold Coast trophy home with its own golf simulator, inbuilt trampoline and swim-up cocktail bar has smashed the Mermaid Waters house price record, after a local buyer – who first saw the house 24 hours earlier – dropped $14,005,000 under the hammer.\n\nThe unnamed buyer outmuscled eight registered bidders, five of whom were active, and paid about $1 million over the reserve. The previous house price record for Mermaid Waters was $7.7 million.\n\nSet on a 1113-square-metre block at 24 Winch Court, the five-bedroom, four-bathroom residence was crowned National Contract Home and Gold Coast House of the Year in 2024.\n\nPALA was built by Rob and Tui McKinnon of Havendeen Projects over 18 months and completed in 2023. Credit: Domain\n\nSpanning four levels and boasting 46 metres of lake frontage, it features a resort-style pool with built-in day beds, a five-car basement garage and a hydraulic lift.",
    "source": "SMH",
    "cluster_id": 26
  },
  {
    "url": "https://www.sbs.com.au/news/article/two-dead-dozens-injured-after-mexican-navy-training-ship-crashes-into-brooklyn-bridge/ni2fva8qw",
    "title": "Two dead, over a dozen injured after Mexican Navy training ship crashes into Brooklyn Bridge",
    "publish_date": "Sun, 18 May 2025 05:12:23 +0000",
    "category": "sports",
    "authors": [],
    "text": "Two people died and more than a dozen others were injured after a Mexican Navy training ship hit the Brooklyn Bridge, New York City Mayor Eric Adams said on Sunday.\n\n\n\n\n\n\"Earlier tonight, the Mexican Navy tall ship Cuauhtémoc lost power and crashed into the Brooklyn Bridge\", Adams posted on X.\n\n\n\n\n\n\"At this time, of the 277 on board, 19 sustained injuries, 2 of which remain in critical condition, and 2 more have sadly passed away from their injuries.\"\n\n\n\nThe training ship slammed into the Brooklyn Bridge late on Saturday local time, snapping all three of its masts as it collided with the New York City landmark.\n\n\n\n\n\nMexican President Claudia Sheinbaum wrote on X that she was \"deeply saddened\" by the two crew members' deaths.\n\n\n\n\n\nAccording to multiple US media reports, around 200 people were on the Cuauhtémoc, a barque built in 1982 with a mast height of 48.2 meters, at the time of the collision.\n\n\n\n\n\nThe Cuauhtémoc had been on a training manoeuvre at the time and was damaged in the \"mishap,\" the Mexican Navy said in a separate statement on X.\n\n\n\n\n\n\"The Ministry of the Navy reaffirms its commitment to the safety of its personnel, transparency in its operations and excellence in the training of future officers of the Mexican Navy,\" it said.\n\n\n\nThe bridge sustained no major damage, New York City transportation official said. Traffic reopened in both directions after a preliminary inspection. Source: AP / Yuki Iwamura\n\n'Panic on the ship'\n\nFootage shared online showed the Cuauhtemoc, its sails furled and festive lights draped in its rigging, as it tried to pass beneath the bridge, which sheared off the masts and sent them crashing into the East River.\n\n\n\n\n\nThere was \"panic on the ship,\" Brooklyn resident Nick Corso, 23, who was standing near the water, told thr Agence France-Presse news agency.\n\n\n\nHe had been poised to take a photo, but when he realised what was happening, he switched to video.\n\n\n\n\n\n\"Lots of screaming, some sailors hanging from the masts, looked like panic happening on the ship,\" he said.\n\n\n\n\n\n\"I didn't see anyone fall into the water, but lots of people up top. People ran back and were screaming!\" Corso said.\n\n\n\n\n\n\"The one thing that stood out to me was the panic on the ship, and there was a guy at the back waving for people to move away from the walkway we were on,\" he said.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 27
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/austria-triumphs-at-eurovision-with-operatic-pop-singer-jj/yjoh7chg8",
    "title": "Austria triumphs at Eurovision with operatic pop singer JJ",
    "publish_date": "Sun, 18 May 2025 02:58:41 +0000",
    "category": "entertainment",
    "authors": [],
    "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nAustria has emerged victorious, claiming its third-ever win at the world’s biggest music competition.\n\n\n\n\n\nOperatic singer JJ whose full name is Johannes Pietsch, captivated both the jury and the public with his genre-blending track 'Wasted Love'.\n\n\n\n\n\nCombining classical opera vocals with club beats and soaring falsetto, JJ took home a total of 435 points, with 257 from the professional juries and 178 from the public vote.\n\n\n\n\n\nThe 24-year-old, born in Vienna to Austrian and Filipino parents, stepped onto the stage holding back tears as he accepted the iconic glass microphone trophy.\n\n\n\n\n\nJJ: “It’s beyond my wildest dreams. It’s crazy.\n\n\n\n\n\nREPORTER: \"What did you want the audience to feel while watching you sing?\"\n\n\n\n\n\nJJ: \"I wanted to let them have an insight on my deepest soul, how I felt when we wrote the song. And I’m so, so, so happy that, you know, everyone has been resonating with this… And what I’m trying to permit is that there’s no wasted love. Love is never wasted. There’s so much love that we can spread around, and we should use love. It’s the strongest force on planet Earth.”\n\n\n\n\n\nJJ now joins Austria’s elite circle of Eurovision winners, following Conchita Wurst in 2014 and Udo Jurgens in 1966.\n\n\n\n\n\nHis win comes a year after Switzerland’s Nemo claimed the crown in Malmö, granting Basel the right to host this year’s contest.\n\n\n\n\n\nMore than 160 million people tuned in worldwide, while 100,000 fans attended events across the host city.\n\n\n\n\n\nAmong them were enthusiastic supporters of the 37 countries competing, and a visible wave of protesters.\n\n\n\n\n\nIn the Sydney suburb of Hurstville, scores of fans, many dressed in the traditional garb of the countries they either came from or were rooting for, gathered at 5am to watch the performance live on SBS.\n\n\n\n\n\nAmong them was this man.\n\n\n\n\n\n\"It's been an amazing morning, it's been chaotic but fun and frenzied, you know, we just had, Finland and she went off. Everyone got up dancing to Estonia and Austria. It's been a great morning already so far.\"\n\n\n\n\n\nWhen asked by SBS why he thought Australia loved Eurovision so much, he replied:\n\n\n\n\n\n\"I think it's because it's a safe and inclusive space for people, you know, it brings together people of different cultures, different languages. We're all united through music, and it's that celebration and cultural expression that I think everyone just loves and the fun and all the colour and excitement of Eurovision.\"\n\n\n\n\n\nAlthough Eurovision brands itself as politically neutral, tensions surrounding Israel’s participation cast a shadow over the festivities.\n\n\n\n\n\nIsrael’s entrant this year, Yuval Raphael, is a survivor of the Hamas attack on the Nova music festival on 7 October 2023, an attack which killed 1,200 people.\n\n\n\n\n\nMs Raphael’s performance earned Israel second place overall, with strong backing from Australia’s public vote.\n\n\n\n\n\nBut the country’s involvement stirred controversy.\n\n\n\n\n\nAs the war in Gaza continues, pro-Palestinian groups called for Israel’s exclusion, pointing to the precedent set in 2022 when Russia was barred after invading Ukraine.\n\n\n\n\n\nAround 200 protesters gathered outside the venue on the night of the final, where scuffles broke out between police and protesters over Israel's participation in the Eurovision Song Contest final.\n\n\n\n\n\nAmong them was Sebastian Piery from France.\n\n\n\n\n\n\"Because I have the impression that Israel is using this as a showcase to clear itself of what's happening, to show that... Yes, it's a nation open to the world, gay-friendly. And so am I, but I don't think we can justify that. And to do what's happening on the other side, that's not OK.\"\n\n\n\n\n\nInside the venue, the political atmosphere rippled into the broadcast.\n\n\n\n\n\nSpanish public broadcaster RTVE aired a message ahead of the show, stating: “When human rights are at stake, silence is not an option. Peace and justice for Palestine.”\n\n\n\n\n\nDespite the calls for boycott, Israel competed, and nearly won.\n\n\n\n\n\nBack on the scoreboard, Estonia placed third with its catchy caffeine-fuelled track Espresso Macchiato.\n\n\n\n\n\nJury favourites France, Italy, and Switzerland saw their high marks from experts undone by lukewarm audience votes.\n\n\n\n\n\nOne surprise came from Sweden’s comedy trio KAJ, favourites going into the competition with a humorous song about saunas.\n\n\n\n\n\nDespite the buzz, they didn’t crack the top three.\n\n\n\n\n\nMeanwhile, it was a disappointing night for the UK.\n\n\n\n\n\nGirl group Remember Monday ended in 19th place, earning zero points from the public, echoing last year’s result when Olly Alexander landed in 18th.\n\n\n\n\n\nBut for JJ, it was a moment of transcendence.\n\n\n\n\n\nHis message, he says, was always about love.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 28
  },
  {
    "url": "https://www.sbs.com.au/news/article/algorithmic-discrimination-how-the-use-of-ai-in-job-hiring-may-disadvantage-some-people/t32y910ch",
    "title": "'Algorithm discrimination': How the use of AI in job hiring may disadvantage some people",
    "publish_date": "Sun, 18 May 2025 02:42:48 +0000",
    "category": "finance",
    "authors": [],
    "text": "Have you applied for a job and landed an interview? You might need to prepare differently — as this time, it may not be a human deciding your fate.\n\n\n\n\n\nIn 2024, 43 per cent of Australian organisations used Artificial Intelligence (AI) \"moderately\" in their recruitment, while 19 per cent used it \"extensively\" when hiring new staff, according to The Australian Responsible AI report.\n\n\n\n\n\nThe use of technology in the hiring process can happen in different ways, such as by analysing CVs or evaluating applicants.\n\n\n\n'Confronting' interview with AI\n\nBut nowadays, AI can be used more directly in the process through so-called \"robo-interviews\".\n\n\n\n\n\nMelbourne-based social enterprise, Sisterworks, experienced this late in 2024, when a group of its graduates found themselves in a situation neither they nor their teachers had prepared for.\n\n\n\n\n\n\"We actually got caught on surprise, when towards the end of last year, we sent about nine sisters to an interview and they didn't make it, they didn't pass the interview,\" The group's CEO, Ifrin Fittock, told SBS News.\n\n\n\n\n\n\"We found out that they're actually not being interviewed face to face, but actually being interviewed by videos slash AI interviews.\n\n\n\n\n\n\"I think they just fail because they don't know what to do.\"\n\n\n\nSisterworks has been helping migrant and refugee women enter the workforce for more than a decade, and their recent experience with AI is not unique, with job seekers increasingly sharing similar experiences.\n\n\n\n\n\nRobo-interviews are essentially interviews where a candidate is assessed by an AI system instead of a human. Typically, candidates record themselves and answer a series of questions, which are then evaluated by AI.\n\n\n\n\n\nThe use of technology in recruitment is often praised for its potential to save both time and money, but there are concerns that this type of hiring process can create new barriers for migrants and refugees.\n\n\n\n\n\n\"The challenges with these AI recruitment or AI interview for some of our sisters is really, first of all, English is not their first language, but also the level of digital literacy that they may or may not have,\" Fittock said.\n\n\n\n\n\n\"It's all really quite confronting.\"\n\n\n\nLISTEN TO Should artificial intelligence be used in job recruitment? SBS News 17/05/2025 06:18 Play\n\nConcerns about 'discrimination'\n\nThese are not the only existing concerns about AI hiring systems.\n\n\n\n\n\nThe way that these systems operate \"creates serious risks of algorithm-facilitated discrimination\", according to a study published by the Law School at the University of Melbourne.\n\n\n\n\n\nNatalie Sheard, who led the study, told SBS News: \"In my research I heard of systems not being accessible to job seekers with disabilities, heard of CV screening systems using things like gaps in employment history to screen candidates out.\n\n\n\n\n\n\"Having a gap in your employment history is a well-known proxy for gender as women tend to have time out of the workforce to care for family, parents, children.\"\n\n\n\nPrevious reports indicate that the new hiring process might discriminate against applicants wearing headscarves, individuals with disabilities, and women.\n\n\n\n\n\nSheard's research also highlights the issue around data sets and algorithms for the AI models.\n\n\n\n\n\n\"A lot of these systems are built overseas, so they might've been trained on data on populations that aren't comparable to the Australian population,\" she said.\n\n\n\n\n\n\"The system won't perform as well for particular demographic groups that we have in Australia. For example, refugees, migrant women, First Nations ...\"\n\n\n\nThere are benefits too\n\nAndreas Leibbrandt, a professor at Monash University, has also researched the role of AI in recruitment.\n\n\n\n\n\nHe says there are benefits to the technology, and if deployed correctly, a system can be less biased than a human.\n\n\n\n\n\nIn one study, conducted in the US, he found women and non-anglo candidates are more likely to apply for a job if they know AI tools are being used.\n\n\n\n\n\n\"It's not that both women or ethnic minorities feel there's no bias in the AI algorithm, but they feel that this bias is less so than when they're faced with a human recruiter,\" he said.\n\n\n\nIn the same time, he is concerned about a lack of transparency, regulation, and potential bias built into algorithms.\n\n\n\n\n\n\"These AI algorithms are fed with training data sets or data sets from corporations. But their training data in itself may be biased. It may come from an organisation where there was, for instance, [a] bias against women,\" Leibbrandt said.\n\n\n\n\n\nWhile it remains uncertain whether AI hiring systems reduce bias or reinforce discrimination, applicants from various backgrounds appear to be adapting.\n\n\n\n\n\nVideo interview training is now part of the Sisterworks job course, and Fatemeh Zahra Hazrati, originally from Iran, is among those taking part.\n\n\n\n\n\n\" AI has [a] real big effect on our lives nowadays,\" she said.\n\n\n\n\n\n\"All of us have to learn it, [and we] just need to adapt ourselves for new things and accept challenges to learn new things.\"\n\n\n\n",
    "source": "SBS",
    "cluster_id": 29
  },
  {
    "url": "https://www.sbs.com.au/news/article/eurovision-final-2025-winner/hgwuishje",
    "title": "Who is JJ, the winner of Eurovision 2025?",
    "publish_date": "Sat, 17 May 2025 23:17:27 +0000",
    "category": "entertainment",
    "authors": [],
    "text": "After battling it out against 36 other countries, Austria has officially won Eurovision 2025.\n\n\n\n\n\nAustria's entrant, JJ, wowed crowds and more than 160 million watchers worldwide with their song Wasted Love, a ballad turned club anthem with operatic vocals.\n\n\n\n\n\n\"Thank you to you, Europe, for making my dreams come true,\" the 24-year-old said.\n\n\n\n\n\n\"Love is the strongest force in the world. Let's spread more love.\n\n\n\n\n\n\"This is beyond my wildest dreams. It's crazy.\"\n\n\n\nWinner of the Eurovision Song Contest JJ from Austria holds up the trophy onstage he won with the song Wasted Love. Source: AP / Martin Meissner His performance was filmed in black and white, in the 4:3 ratio of the monochrome television era.\n\n\n\n\n\nIt is the third time Austria has won Eurovision, with Udo Jürgens taking home the top spot in 1965 and Conchita Wurst in 2014.\n\n\n\n\n\n\"When JJ sings, it's as if time stops,\" Wurst said.\n\n\n\n\n\nEarlier this year, the two performers released a duet, while JJ said Wurst provided \"many tips\" ahead of Saturday's contest.\n\n\n\n\n\nDescribed by Eurovision as \"A countertenor with a distinctive voice that can reach soprano heights\", the Austrian-Filipino artist's music is classical meets club.\n\n\n\n\n\n\"My song is about my personal experience with wasted and unreciprocated love. I had too much love to put out there; not much came back,\" he told Agence France-Presse during Eurovision week.\n\n\n\n\n\nThe singer has set his sights on a blend known as operatic pop, a \"cross-genre and cross-disciplinary approach (which) demonstrates exceptional versatility and innovative strength\", said Andreas Mailath-Pokorny, rector at Vienna arts and music university MUK, where JJ studies.\n\n\n\nWho is JJ?\n\nJJ, whose real name is Johannes Pietsch, was born in Vienna in 2001 — his father is an IT specialist, and his mother is a Filipino chef.\n\n\n\n\n\nHe got a taste for classical music from his father, especially for Bach and Mozart, while his mother listened to Celine Dion and Whitney Houston.\n\n\n\n\n\nHe was raised in Dubai, where karaoke parties and his father first introduced him to pop and opera.\n\n\n\n\n\nIn Vienna, he later uncovered classical music, refining his skills through talent shows and minor opera roles before Eurovision.\n\n\n\n\n\nHe speaks German, English and Tagalog and has learned Arabic and French.\n\n\n\nIn a recent interview with The Independent, he said that he was \"surrounded by music\" growing up and started singing at a young age.\n\n\n\n\n\nFor those following The Voice UK music contest, he should seem familiar as he participated in the ninth series in 2020 and reached the finals alongside his coach, William James Adams, also known as will.i.am.\n\n\n\nHow was the winner chosen?\n\nAn estimated 160 million people across Europe and beyond were expected to tune in for the annual TV spectacle, where kitsch, glam and spectacular staging go hand in hand.\n\n\n\n\n\nIn the grand final, JJ triumphed over 25 competitors, with performers from 37 nations participating in Eurovision 2025.\n\n\n\n\n\nSeparate jury and viewer votes from each of this year's participating countries -- with equal weight -- plus an extra vote from the rest of the world combined, decided who won the coveted microphone-shaped trophy.\n\n\n\n\n\nAustria earned 178 points from the audience and 257 from the jury, taking them to 435 points in total.\n\n\n\n\n\nIsrael came in second place with 357 points. They also topped the Australian public vote.\n\n\n\nAfter a surge in audience votes, Estonia came in third with 356 points for their coffee bop, Espresso Macchiato.\n\n\n\n\n\nThe favourites coming into the competition were Sweden's KAJ, with their catchy tune about heading to the sauna, Bara Bada Bastu.\n\n\n\n\n\nBut they faded away as the votes came in, finishing fourth ahead of Italy, Greece and France.\n\n\n\n\n\nSwitzerland, France and Italy dominated jury votes but fell short in praise from the audience.\n\n\n\n\n\nEleven were knocked out by public voting in the semi-finals, including Australia's Go-Jo Marty Zambotto, with his tongue-in-cheek Milkshake Man.\n\n\n\n\n\n- Additional reporting by Agence France-Presse.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 30
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/should-artificial-intelligence-be-used-in-job-recruitment/uh8f238gk",
    "title": "Should artificial intelligence be used in job recruitment?",
    "publish_date": "Sat, 17 May 2025 22:00:00 +0000",
    "category": "finance",
    "authors": [],
    "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nFor more than a decade, Melbourne-based social enterprise, Sisterworks, has been helping migrant and refugee women enter the workforce.\n\n\n\n\n\n\"If you're in a real interview, you're looking at the person, you're looking at their eyes.\"\n\n\n\n\n\nTraining courses focus on customer service, hospitality and people skills, as well as networking, resume writing and interviewing to ensure the women are 'job ready'.\n\n\n\n\n\nBut Ifrin Fittock, Sisterworks CEO, says late last year, a group of nine graduates found themselves in a situation neither they or their teachers had prepared for.\n\n\n\n\n\n\"We actually got caught on surprise when towards the end of last year we sent about nine sisters to an interview and they didn't make it, they didn't pass the interview. Upon investigation, we found out that they're actually not being interviewed face to face, but actually being interviewed by videos slash AI interviews and because they've never been exposed to it before, I think they just failed because they don't know what to do.\"\n\n\n\n\n\nTheir experience is not unique, with job seekers increasingly sharing their own experiences with so-called \"robo\" interviews on social media.\n\n\n\n\n\nMAN: \"Hello.\"\n\n\n\n\n\nROBOT: \"Hi, thank you so much for joining the interview today. I'm so excited to talk to you and get to know more about you.\"\n\n\n\n\n\n\"Robo\" interviews are when a candidate is interviewed by an AI system rather than a human.\n\n\n\n\n\nFittock says this style of interview can add extra barriers for migrant and refugee applicants.\n\n\n\n\n\n\"The challenges with these AI recruitment or AI interview for some of our sisters is really, first of all, English is not their first language, but also the level of digital literacy that they may or may not have because they need to actually navigate through, apart from answering questions, they also need to navigate that click of a button and pay attention to the timer and all that pressure really mounting up, especially when you see the ticking clock running in front of you. So it's all really quite confronting.\"\n\n\n\n\n\nIn 2024, 43 percent of organisations use AI \"moderately\" in their recruitment, while 19 per cent use the technology \"extensively\" when hiring new staff.\n\n\n\n\n\nThat's according to The Australian Responsible AI report, which details how Australian businesses are tracking when it comes to AI practices.\n\n\n\n\n\nAs employers increasingly embrace AI, video interview training is now part of the Sisterworks job course.\n\n\n\n\n\nFatemeh Hazrati - originally from Iran - is among those currently taking part in the program.\n\n\n\n\n\n\"AI has real big effect on our life nowadays. All of us have to learn it, [and] [We] just need to adapt ourself for new things and accept challenges to learn new things.\"\n\n\n\n\n\nAI in recruitment is often touted for its ability to save both time and money.\n\n\n\n\n\nBut there are mounting concerns around its potential to discriminate.\n\n\n\n\n\nDoctor Natalie Sheard is from the Melbourne Law School at the University of Melbourne.\n\n\n\n\n\nShe led a study published earlier this month that suggests AI hiring systems are creating new barriers to employment.\n\n\n\n\n\n\"So it could be older applicants, women, people who speak English as a second language, job seekers with disabilities. In my research I heard of systems not being accessible to job seekers with disabilities. I heard of CV screening systems using things like gaps in employment history to screen candidates out and having a gap in your employment history is a well-known proxy for gender as women tend to have time out of the workforce to care for family.\"\n\n\n\n\n\nShe also explains how those with English as a second language can be disadvantaged in video interviews.\n\n\n\n\n\n\"Another concern is that the way these systems tend to operate is the AI doesn't assess the video. What happens is the audio from your video is transcribed and then AI is used to evaluate your answer and it's well established that those transcription services perform poorly for people who speak English as a second language or have accents.\"\n\n\n\n\n\nMonash University's Professor Andreas Leibbrandt has also researched the role of AI in recruitment.\n\n\n\n\n\nHe says there are benefits to the technology, and if deployed correctly, a system can be less bias than a human.\n\n\n\n\n\nIn one study, conducted in the US, he found women and non-anglo candidates are more likely to apply for a job if they know AI tools are being used.\n\n\n\n\n\n\"It's not that both women or ethnic minorities feel there's no bias in the AI algorithm, but they feel that this bias is less so than when they're faced with a human recruiter.\"\n\n\n\n\n\nBut he's concerned by a lack of transparency, regulation and potential bias built into algorithms.\n\n\n\n\n\n\"These AI algorithm are fed with training data sets or data sets from corporations. But their training data in itself may be biased. It may come from an organisation where there was, for instance, bias against women.\"\n\n\n\n\n\nThe issue around data sets and algorithms also emerged in Doctor Sheard's research.\n\n\n\n\n\n\"So one example there is a lot of these systems are built overseas, so they might've been trained on data on populations that aren't comparable to the Australian population. And therefore again, the system won't perform as well for particular demographic groups that we have in Australia. For example, refugees, migrant women, first Nations, Australians.\"\n\n\n\n\n\nThere are growing calls for the Australian government to better regulate the use of AI in recruitment.\n\n\n\n\n\nCatherine Hunter, is the CEO of Diversity Council Australia - the independent not-for-profit peak body leading diversity and inclusion in the workplace.\n\n\n\n\n\n\"With such high adoption rates and the rapid acceleration of the technology, we're just concerned that people aren't putting in place the proper considerations around ethical use.\"\n\n\n\n",
    "source": "SBS",
    "cluster_id": 29
  },
  {
    "url": "https://www.sbs.com.au/news/article/heavy-menstrual-bleeding-hysterectomy-uterectomy-terminology-womens-health/d6fp5ayow",
    "title": "Michelle's condition 'ruined' her. Treatment was life-changing, but it has a concerning label",
    "publish_date": "Sat, 17 May 2025 20:37:34 +0000",
    "category": "lifestyle",
    "authors": [],
    "text": "A $793 million investment into women's health has been celebrated, but there are concerns over a lack of specific reference to a condition affecting many women.\n\n\n\n\n\nHeavy menstrual bleeding is often excluded from discussions around women's health despite it being a disruptive, and sometimes crippling, condition.\n\n\n\n\n\n\"I'd get out the door and I would flood to the point where I'd have to come back and change again,\" said Michelle Watts, as she recounted a ski trip — one of many occasions where she bled through layers of clothing.\n\n\n\n\n\n\"And I'd literally just sit down and cry and think, 'I can't do this anymore', because it was ruining every aspect of my life,\" the 60-year-old said.\n\n\n\n\n\nFor 18 months from 2021, Watts suffered from heavy menstrual bleeding, which the Australian Commission on Safety and Quality in Health Care (ACSQHC ) defines as excessive menstrual blood loss that interferes with a woman's quality of life.\n\n\n\n\n\n\"I was about as sad as I could ever be because everything was impossible to do in my eyes by the end. I couldn't go swimming with my friends anymore, swimming became challenging, going to the gym became challenging,\" Watts said.\n\n\n\n\n\n\"All those things that I loved to do, I just couldn't do.\"\n\n\n\n'Time to change' the language\n\nAfter many failed treatments, Michelle finally underwent a uterectomy, traditionally known as a hysterectomy.\n\n\n\n\n\nThe original terminology for this procedure has some specialists concerned due to its links to the Greek word 'hysteria'.\n\n\n\n\n\nDr Talat Uppal is a gynaecologist and director at Women's Health Road and is in the process of changing the language, which she says was inaccurately used to explain women's emotional and physical concerns.\n\n\n\n\n\n\"Often when I'm using the word hysteroscopy or hysterectomy it brings back that association of centuries-old myth which is something that is important to defuse and re-word to a more anatomical one\", Dr Talat said.\n\n\n\n\n\nAlso in the push to change the medical language is the CSIRO, Australia's national science agency, which is responsible for updating global standards for clinical terminology.\n\n\n\nDr Talat Uppal is a gynaecologist and director at Women's Health Road. Source: Supplied Katrina Ebril is the Interoperability Lead with the Australian e-Health research centre at the CSIRO and says this change is a first when it comes to women's bodies.\n\n\n\n\n\n\"It's definitely time to change ... and we do this for other procedures,\" Ebril said.\n\n\n\n\n\n\"It is a uterectomy, let's call it what it is, and start to use that much more positive language and much more language that aligns to what the actual procedure is.\"\n\n\n\n\n\nFor women like Watts, removing taboos around menstruation is key to making treatment more accessible, and encouraging others to seek help.\n\n\n\nWho suffers from heavy menstrual bleeding?\n\nOne in four people who menstruate suffer from heavy menstrual bleeding, according to the ACSQHC, and two thirds of those experience iron deficiency.\n\n\n\n\n\nYet the commission notes less than half of women suffering from the condition visit a doctor.\n\n\n\n\n\n\"Traditionally or historically, women have been left out of research, and sometimes even the animals in the labs were male animals,\" Uppal said.\n\n\n\n\n\n\"And so this is a long historical background of disadvantage of not including women, and we really want to change that narrative when it comes to heavy bleeding.\"\n\n\n\n\n\nUppal welcomes a number of measures in the federal government's multi-million dollar investment in women's health , but would like to see more attention given to this issue.\n\n\n\n\n\n\"I think it's just part of that silence around heavy menstrual bleeding ... and I don't think it's deliberate, I feel it's just a culture where it's not front of mind,\" she said.\n\n\n\nWatt believes a lack of awareness is why she struggled to receive adequate care for months.\n\n\n\n\n\n\"It's just been so normalised ... and I don't think it should be, I don't think it's normal,\" Watt said. \"And it's really hard to get any information because it's just taken as: 'Well, you're a woman, this is what happens.'\"\n\n\n\n\n\nShe can't imagine what her life would have looked like without undergoing the procedure, now relishing the active lifestyle she was once forced to sacrifice.\n\n\n\n\n\n\"My ability to participate in skiing, running, swimming ... all of the things that I wanted to enjoy, that's all possible again, I never have to worry about that ever again, it's like an absolute new lease of life,\" she said.\n\n\n\n\n\nLearn more about medical misogyny and discrimination in our health system by listening to the podcast series 'Hysterical' by SBS News .\n\n\n\n",
    "source": "SBS",
    "cluster_id": 31
  },
  {
    "url": "https://www.sbs.com.au/news/live-blog/eurovision-2025-final-live-updates-and-coverage/1wq3ldaeu",
    "title": "Austria's JJ wins 2025 Eurovision Song Contest - as it happened",
    "publish_date": "Sat, 17 May 2025 19:05:09 +0000",
    "category": "sports",
    "authors": [],
    "text": "How do they change the sets so quickly?\n\nFun fact: The backstage team at Eurovision only has about 35 seconds to change the set.\n\n\n\nThat's all the time they get to make sure the props are swapped out for the next performance and to get all the performers ready, mic'd up, and in the right spot.\n\n\n\n\"We call it the Formula 1 tyre change,\" Richard van Rouwendaal, the Dutch Eurovision stage manager told BBC.\n\n\n\n\"Each person in the crew can only do one thing. You run on stage with one light bulb or one prop. You always walk on the same line. If you go off course, you will hit somebody.\"\n\n\n\n\"It's a bit like ice skating.\"\n\n\n\nThe stage crew has about two weeks to practice before the big day.\n\n\n\n— Alexandra Koster",
    "source": "SBS",
    "cluster_id": 28
  },
  {
    "url": "https://www.sbs.com.au/news/article/an-outbreak-of-this-once-eradicated-disease-has-been-declared-on-australias-doorstep/amserdjy4",
    "title": "An outbreak of this once-eradicated disease has been declared on Australia's doorstep",
    "publish_date": "Sat, 17 May 2025 08:55:23 +0000",
    "category": "lifestyle",
    "authors": [],
    "text": "A polio outbreak has been declared in Papua New Guinea, sparking concern about the disease's spread in a country with low vaccination rates, health officials said.\n\n\n\n\n\nPoliovirus, most often spread through sewage and contaminated water, is highly infectious and potentially fatal.\n\n\n\n\n\nIt can cause deformities and paralysis, and mainly affects children under five years old.\n\n\n\nIn some remote villages in PNG polio vaccination rates are thought to be as low as 7 per cent. Source: AAP / Brendan Esposito The virus was detected in wastewater and environmental samples in the Pacific nation's capital Port Moresby and second-largest city Lae, the World Health Organization (WHO) said.\n\n\n\n\n\nIn subsequent testing, two children in Lae were found to have the poliovirus type 2 strain, according to the WHO representative in Papua New Guinea, Sevil Huseynova.\n\n\n\n\n\nThe confirmation of community transmission in the children \"constitutes a polio outbreak\", Huseynova said in briefing notes provided to AFP.\n\n\n\n\n\n\"Polio is a highly infectious disease, and in communities with low polio immunisation rates, the virus quickly spreads from one person to another,\" Huseynova said.\n\n\n\n\n\nThe health agency \"expresses deep concern over the confirmed outbreak\", she said.\n\n\n\nDr Matt Mason is a lecturer in nursing in the School of Health, Centre for Pacific Islands Research at the University of the Sunshine Coast.\n\n\n\n\n\nHe said with only 47 per cent of PNG children fully immunised, and some districts reporting coverage as low as 8 per cent, \"pockets of extreme vulnerability exist\".\n\n\n\n\n\n\"Infection prevention and control must begin at the community level. Strengthening water, sanitation, and hygiene infrastructure in both urban settlements and remote villages is essential to curb faecal–oral spread.\"\n\n\n\n\n\nHe recommended health authorities collaborate with trusted partners, such as churches and women’s groups, to disseminate hygiene kits and promote hand‑hygiene stations at schools, markets, and health services.\n\n\n\nTracing PNG's polio outbreak\n\nGenetic testing showed the polio strain detected in Papua New Guinea was linked to one circulating in Indonesia.\n\n\n\n\n\nPapua New Guinea was certified as polio-free in 2000, but immunisation rates among children are low.\n\n\n\n\n\nPapua New Guinea health minister Elias Kapavore said the situation was \"serious but manageable\".\n\n\n\n\"We've dealt with this before and know what works,\" he told reporters on Thursday.\n\n\n\n\n\n\"Vaccination is safe and effective, and we're acting quickly to keep children protected.\"\n\n\n\nIs there a risk of polio spreading to Australia?\n\nAustralia has been polio-free since 2000 and hasn't had a major outbreak of the disease since 1961. Children are routinely vaccinated against the illness.\n\n\n\n\n\nDr Yong Gao (Nias) Peng is a CSIRO early research career fellow at CSIRO Health and Biosecurity.\n\n\n\n\n\n\"While the risk of polio spreading to Australia is considered low due to high vaccination rates and robust public health infrastructure, it is recommended that travellers to PNG ensure their polio vaccinations are up to date,\" Peng says.\n\n\n\n\n\n\"Continued surveillance for poliovirus and support for PNG's immunisation efforts are crucial to contain the outbreak and prevent international spread.\"\n\n\n\n",
    "source": "SBS",
    "cluster_id": 32
  },
  {
    "url": "https://www.theage.com.au/business/the-economy/the-trump-alarm-bells-are-ringing-louder-20250519-p5m0a9.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "The Trump alarm bells are ringing louder",
    "publish_date": "Mon, 19 May 2025 11:59:52 +1000",
    "category": "finance",
    "authors": [
      "Stephen Bartholomeusz"
    ],
    "text": "“Over the next decade, we expect larger deficits as entitlements spending rises while government revenue remains broadly flat. “In turn, persistent, large fiscal deficits will drive the government’s debt and interest burden higher. The US fiscal performance is likely to deteriorate relative to its own past and compared to other highly-rated sovereigns.” US government debt has ballooned over the past decade. US debt is ballooning. Credit: Bloomberg It was just under $US20 trillion when Donald Trump first took office but had swollen to $US27.7 trillion by the start of the Biden administration, with Trump’s 2017 $US4.5 trillion “Tax and Jobs Act” the major influence.\n\nIt is now $US36.2 trillion, thanks to Biden’s massive spending on climate-related concessions, infrastructure spending and his CHIPS and Science Act. In March, the Congressional Budget Office released its projections for US debt and deficits, saying the deficit would reduce from last year’s 6.4 per cent of GDP to 6.1 per cent over the next decade. Debt would, however, rise from 98 per cent of GDP in 2024 to 118 per cent in 2035. More recently, it has factored in the One, Big, Beautiful Bill. That would, it says, increase annual deficits from $US1.9 trillion to $US2.9 trillion in 2034, or 6.9 per cent of GDP, or potentially as much as $US3.3 trillion and 7.8 per cent of GDP if some measures in the bill, which are scheduled to expire at the end of Trump’s term, were to be made permanent. (Some of the “temporary” measures are only temporary to try to make the bill look less profligate, while others look like an inducement for his supporters while he is in office, with their expiry his successor’s problem).\n\nDebt would increase by $US3.3 trillion by 2034 – $US5.2 trillion if the spending measures were made permanent – or to 125 per cent of GDP (129 per cent if permanent). Annual interest costs would rise between $US1.8 trillion (4.2 per cent of GDP) and $US1.9 trillion (4.4 per cent of GDP). In other words, this big, beautiful bill would take a fiscal position which, in any economy without America’s privileged position would already be unsustainable, and make it worse. Trump’s aggressive policies have hurt the US dollar. Moreover, given that Trump’s tax package is highly regressive – the wealthy would continue to benefit significantly while lower income households see little or no benefit – it would exacerbate inequality. Moody’s, while cutting America’s rating, awarded the US a stable outlook because of a history of effective monetary policy led by an independent Federal Reserve, the constitutional separation of powers and America’s unique status and the world’s dominant reserve currency provider.\n\nThose attributes are being tested by the current administration. Loading Trump has routinely slammed the Fed and its chairman, Jerome Powell, threatened to sack Powell (until the markets’ reactions caused him to back off) and is expected to insert his own nominees into the Fed at every available opportunity. He would subvert the Fed’s independence if he thought financial markets would let him. With Trump effectively ignoring Congress and governing via executive orders, many of which have dubious legal or constitutional authority, and disregarding Supreme Court orders on immigration, the separation of powers doctrine in the US is being tested by his administration. The US dollar is the world’s reserve currency, but it has depreciated by more than 8 per cent against a basket of its major trading partners’ currencies and there have been indications of capital outflows, or at least reduced inflows, as a result of Trump’s aggressive trade policies.\n\nWhile financial markets have calmed since Trump announced 90-day pauses of his proposed “reciprocal” tariffs and his 145 per cent tariff on imports on China was reduced (temporarily?) to 30 per cent, before those stays there was a strong “sell America” mood among foreign investors. Given that Trump’s tax package is highly regressive – the wealthy would continue to benefit significantly while lower income households see little or no benefit – it would exacerbate inequality. When the 90-day pauses end the administration is now saying it will replace its “reciprocal” tariffs, which were supposed to be negotiated trade deals, with unilateral tariffs. “I own the store (the US economy) and I set prices,” Trump has said. The tariffs, their impact on the US economy and their impact on America’s trade partners have the potential to be highly disruptive and negative for the US and the rest the world.\n\nThey risk a self-induced recession in the US (and deficits and debt that are an even higher proportion of GDP as a consequence) while slowing growth around the world. They also place a questionmark over something of longer-term consequence than the short-term ebbs and flows in economic activity in the US and elsewhere. Trump’s “America First” unilateralism, and his economic illiteracy, has unsettled allies and the investors needed to buy the swelling tide of government debt that the US is already issuing even before the effects of the One, Big, Beautiful Bill start flowing. If Trump’s trade war were to cause more capital to flow out of the US than flows in, initially it would result in higher interest costs and bigger deficits and debt than would already be the case. Longer term it could undermine the reserve currency status of the dollar, which is America’s greatest financial asset. It helps prevent the US from experiencing the external pressures and the risk of a financial crisis that any other economy with its deteriorating fiscal outlook would be facing.",
    "source": "TheAge",
    "cluster_id": 15
  },
  {
    "url": "https://www.theage.com.au/property/news/sydney-dad-spends-6-12m-on-balmain-east-home-his-daughter-can-live-in-20250519-p5m0al.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Sydney dad spends $6.12m on Balmain East home his daughter can live in",
    "publish_date": "Mon, 19 May 2025 11:51:09 +1000",
    "category": "finance",
    "authors": [
      "Carmen Forward"
    ],
    "text": "A four-bedroom waterfront in Balmain East with sweeping harbour views sold for $6.12 million at auction on Saturday.\n\nGuided at $6 million, the deep waterfront at 5A Little Edward Street came with a pontoon and mooring able to secure a 15-metre vessel.\n\nThe buyer was from Putney and, although he was purchasing it in his own name, his daughter returning from America may live in it. The vendor had maintained the property as an investment with an agreement that allowed him to use the jetty and pontoon while tenanted.\n\nTwo parties registered, but as neither would make a start, a vendor bid of $5.8 million was placed. A third party, who saw it for the first time that day, then registered and got involved.",
    "source": "TheAge",
    "cluster_id": 16
  },
  {
    "url": "https://www.theage.com.au/national/australia-news-live-pm-meets-pope-leo-xiv-former-us-president-joe-biden-diagnosed-with-cancer-20250519-p5m09c.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Australia news LIVE: PM meets Pope Leo XIV; Former US president Joe Biden diagnosed with cancer",
    "publish_date": "Mon, 19 May 2025 11:45:48 +1000",
    "category": "finance",
    "authors": [
      "Sarah Mcphee"
    ],
    "text": "The Australian sharemarket has retreated today, following US futures lower as investors reacted to ratings agency Moody’s stripping the US of its AAA credit rating and deepening concern that growing debt will damage America’s standing as the choice destination for global capital.\n\nThe S&P/ASX200 dropped 29.80 points, or 0.4 per cent, to 8313.90 shortly before 11am. Nine of 11 industry sectors were in the red, with materials and energy stocks weighing on the bourse.\n\nNewmont Corporation, up 4.2 per cent, bucked the trend of the materials sector to be among the biggest risers, while a fall in iron ore prices caused BHP (down 1.8 per cent), Fortescue (down 1.9 per cent) and Rio Tinto (down 1.3 per cent) to drop. Mineral Resources (down 5.2 per cent) slumped as it unveiled its new chairman, Malcolm Bundey, who will take over from James McClements on July 1.\n\nEnergy companies fell after oil prices dropped. Santos shed 0.5 per cent and Woodside lost 0.4 per cent.\n\nThe Commonwealth Bank rose 0.6 per cent while the rest of the big four banks had minor falls.\n\nRead more on today’s markets here.",
    "source": "TheAge",
    "cluster_id": 17
  },
  {
    "url": "https://www.theage.com.au/sport/nrl/if-you-picked-an-australian-side-right-now-nsw-would-dominate-which-is-just-how-qld-likes-it-20250518-p5m05c.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "If you picked an Australian side right now, NSW would dominate. Which is just how Qld likes it",
    "publish_date": "Mon, 19 May 2025 11:45:00 +1000",
    "category": "sports",
    "authors": [
      "Dan Walsh"
    ],
    "text": "It’s a favourite of TV panel shows, talkback radio and the click-hungry right across the rugby league landscape - what would a post-Origin Kangaroos side look like?\n\nBut if you were doing Mal Meninga’s job for him on Sunday afternoon, based on the NSW and Queensland squads filtering through, the Roos were distinctly sky-blue.\n\nPicking a merit Australian side right here, right now, based on 2025 form lines (as Meninga used to do after each series a few years ago), a fair argument could be made for an 11-6 split in favour of NSW.\n\nEspecially considering the NRL’s two form fullbacks - James Tedesco and Ryan Papenhuyzen - won’t feature for the Blues, though most accept Dylan Edwards’ incumbency and four-straight titles for Penrith as a sound selection basis.",
    "source": "TheAge",
    "cluster_id": 18
  },
  {
    "url": "https://www.theage.com.au/sport/nrl/daley-wants-latrell-to-be-latrell-in-origin-20250519-p5m09t.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Daley wants ‘Latrell to be Latrell’ in Origin",
    "publish_date": "Mon, 19 May 2025 11:42:18 +1000",
    "category": "sports",
    "authors": [
      "Christian Nicolussi"
    ],
    "text": "Laurie Daley revealed Terrell May was overlooked for Origin I because “others are playing better than him”, Tom Trbojevic needed to rediscover his confidence for Manly, while he was confident NSW would get the best out of Latrell Mitchell.\n\nBlues players started assembling in camp at Sydney Olympic Park on a cool Monday morning, including Payne Haas, whose scans results confirmed a minor quad strain, which will not keep him out of next Wednesday’s series opener.\n\nReturning to the Blues’ top job for the first time since 2017, Daley explained why Wests Tigers’ prop May, and Sea Eagles’ superstar Trbojevic, were left out of the opening game at Suncorp Stadium on Wednesday week.\n\n“I just think the others are playing better than Terrell May,” Daley said. “[As for Trbojevic] everyone agrees Tom, if he’s fit, is one of the best players in the game. It was a tough decision.",
    "source": "TheAge",
    "cluster_id": 19
  },
  {
    "url": "https://www.theage.com.au/property/news/young-couple-pay-720-000-over-the-reserve-for-renovated-brunswick-terrace-20250519-p5m0an.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Young couple pay $720,000 over the reserve for renovated Brunswick terrace",
    "publish_date": "Mon, 19 May 2025 11:36:51 +1000",
    "category": "finance",
    "authors": [
      "Shona Hendley"
    ],
    "text": "Three young couples competed for a Brunswick terrace at auction on Saturday, pushing the sale price to $3.72 million.\n\nThe renovated three-bedroom home at 679 Park Street was listed with a price guide of $2.8 million to $3 million and had a reserve of $3 million, set at the top of the range.\n\nThe Victorian terrace, ‘Ellis’, located on the Princes Hill border in Brunswick, has generous living areas, a flexible layout and off-street parking. The winner and underbidder were both local to the area.\n\nProceedings opened with a bid of $2.8 million and the reserve was quickly reached. Bidding then slowed, with increments decreasing from $25,000 to $10,000, $5,000, and $1,000.",
    "source": "TheAge",
    "cluster_id": 20
  },
  {
    "url": "https://www.theage.com.au/culture/tv-and-radio/dolly-parton-reveals-her-only-childhood-regret-in-resurfaced-interview-20250519-p5m0d2.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Dolly Parton reveals her only childhood 'regret' in resurfaced interview",
    "publish_date": "Mon, 19 May 2025 11:35:25 +1000",
    "category": "finance",
    "authors": [],
    "text": "Dolly Parton reveals her only childhood 'regret' in resurfaced interview\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 21
  },
  {
    "url": "https://www.theage.com.au/politics/federal/the-latest-illustrations-from-artist-matt-golding-20230608-p5df5o.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "The latest illustrations from artist Matt Golding",
    "publish_date": "Mon, 19 May 2025 11:33:13 +1000",
    "category": "entertainment",
    "authors": [],
    "text": "The latest illustrations from artist Matt Golding\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 22
  },
  {
    "url": "https://www.theage.com.au/goodfood/recipes/manti-style-lamb-pasta-20250402-p5lomf.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Manti-style lamb pasta",
    "publish_date": "Mon, 19 May 2025 11:32:55 +1000",
    "category": "lifestyle",
    "authors": [
      "Jessica Brook"
    ],
    "text": "Step 1 Heat the oil in a large non-stick frying pan over high heat. Add the onion and garlic, season with salt and cook for 4 minutes, or until they start to colour.\n\nStep 2 Add the mince and cook for 8 minutes, breaking it up in the pan with the back of a spoon. Add the tomato, 1 tablespoon of the sumac, ½ teaspoon of the dried mint, and ½ cup water. Bring to a simmer and cook for 10 minutes.\n\nStep 3 Meanwhile, cook the pasta in boiling salted water for 6-8 minutes, or until al dente. Drain. Add the pasta to the pan with the meat sauce and toss to coat\n\nStep 4 Combine the yoghurt and lemon juice, then fold them through the pasta. Adding lemon juice helps stabilise the proteins in yoghurt so it won’t curdle when you add it to a hot dish.\n\nStep 5 Heat a small frying pan over high heat. Add the butter and garlic and cook for 2 minutes, or until nutty brown. Remove from the heat and add the remaining sumac and mint.",
    "source": "TheAge",
    "cluster_id": 23
  },
  {
    "url": "https://www.theage.com.au/national/nsw/what-you-need-to-earn-to-be-in-the-top-1-per-cent-in-your-sydney-suburb-20250518-p5m051.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "What you need to earn to be in the top 1 per cent in your Sydney suburb",
    "publish_date": "Mon, 19 May 2025 11:31:00 +1000",
    "category": "finance",
    "authors": [
      "Matt Wade",
      "Craig Butt"
    ],
    "text": "The top 1 per cent of income earners in a ring of Sydney harbourside suburbs take home more than $5 million a year on average, while in another 25 neighbourhoods across the city the best-paid 1 per cent make more than $2 million.\n\nAnalysis of official personal income data by this masthead has revealed a cluster of ultra-high earners in Sydney’s eastern suburbs and lower north shore.\n\nTopping the list was Bellevue Hill where the highest paid 1 per cent had an average annual income of $7.5 million.\n\nThe 1 per cent in the adjacent neighbourhood of Rose Bay-Vaucluse-Watsons Bay was next with an average annual income of $6.4 million. Third was the 1 per cent living in the northern part of the CBD, which includes Millers Point and Barangaroo, with $5.2 million.",
    "source": "TheAge",
    "cluster_id": 24
  },
  {
    "url": "https://www.theage.com.au/politics/federal/the-latest-illustrations-from-artist-simon-letch-20230608-p5df4g.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "The latest illustrations from artist Simon Letch",
    "publish_date": "Mon, 19 May 2025 11:30:07 +1000",
    "category": "entertainment",
    "authors": [],
    "text": "The latest illustrations from artist Simon Letch\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 22
  },
  {
    "url": "https://www.theage.com.au/sport/tennis/sinner-falls-short-of-title-in-rome-20250519-p5m0cx.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Sinner falls short of title in Rome",
    "publish_date": "Mon, 19 May 2025 11:29:21 +1000",
    "category": "finance",
    "authors": [],
    "text": "Sinner falls short of title in Rome\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 25
  },
  {
    "url": "https://www.theage.com.au/property/news/house-of-the-year-with-swim-up-bar-golf-simulator-snapped-up-for-cool-14m-20250519-p5m0ao.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "‘House of the Year’ with swim-up bar, golf simulator snapped up for cool $14m",
    "publish_date": "Mon, 19 May 2025 11:27:10 +1000",
    "category": "finance",
    "authors": [
      "Sarah Webb"
    ],
    "text": "A Gold Coast trophy home with its own golf simulator, inbuilt trampoline and swim-up cocktail bar has smashed the Mermaid Waters house price record, after a local buyer – who first saw the house 24 hours earlier – dropped $14,005,000 under the hammer.\n\nThe unnamed buyer outmuscled eight registered bidders, five of whom were active, and paid about $1 million over the reserve. The previous house price record for Mermaid Waters was $7.7 million.\n\nSet on a 1113-square-metre block at 24 Winch Court, the five-bedroom, four-bathroom residence was crowned National Contract Home and Gold Coast House of the Year in 2024.\n\nPALA was built by Rob and Tui McKinnon of Havendeen Projects over 18 months and completed in 2023. Credit: Domain\n\nSpanning four levels and boasting 46 metres of lake frontage, it features a resort-style pool with built-in day beds, a five-car basement garage and a hydraulic lift.",
    "source": "TheAge",
    "cluster_id": 26
  },
  {
    "url": "https://au.news.yahoo.com/live/extraordinary-situation-along-south-australia-coastline-sussan-ley-admits-significant-failure-man-attacked-by-dingo-235029387.html",
    "title": "'Extraordinary' situation along South Australia coastline, Sussan Ley admits significant 'failure', man attacked by dingo",
    "publish_date": "2025-05-18T23:50:29Z",
    "category": "finance",
    "authors": [
      "Tom Flanagan"
    ],
    "text": "Vodafone is calling for the ACCC to investigate claims rival telco Telstra has made about its coverage, alleging the company has “been misleading Australians for more than a decade”.\n\nVodafone’s owner TPG Telecom has reported the allegations and says it is considering taking legal action against Telstra, claiming the telco has “dramatically overstated” the reach of its mobile network by as much as 40 per cent and used the inflated figures to make “unfair comparisons” against other operators’ coverage.\n\nAccording to the allegations put forward to the ACCC, Telstra asserted it offers more than double the service available from Optus and about three times the area available through Vodafone and its owner TPG Telecom.\n\nVodafone is leading the charge with the accusations, but similar claims have been made by other providers that use the Telstra network, including Belong Aldi, Tangerine, Woolworths and More Telecom.\n\nTPG Telecom group executive consumer, data, and analytics Kieran Cooney said the alleged conduct was “alarming”.\n\n“It appears Telstra has tricked Australians into paying top dollar for coverage they simply can’t get on a regular mobile phone,” he said.\n\n“We are shocked that Telstra appears to have been overstating its coverage by so much for so long and we are calling on them to make it right.”\n\nTelstra has denied the claims made by Vodafone and TPG, though has been accused of making changes to its website following the allegations, including removing claims its network covers “more Australians over an area of 3 million sq km”.\n\nRead more from NewsWire here.",
    "source": "Yahoo",
    "cluster_id": 1
  },
  {
    "url": "https://au.news.yahoo.com/sad-discovery-at-popular-aussie-river-sparks-concern-amid-disturbing-trend-223933522.html",
    "title": "Sad discovery at popular Aussie river sparks concern amid 'disturbing' trend",
    "publish_date": "2025-05-18T22:39:33Z",
    "category": "lifestyle",
    "authors": [],
    "text": "Recent fish deaths across Tasmania, along with similar events on the Asssie coastline, suggest a concerning trend that may point to broader environmental stress in Australian waters.\n\nHundreds of fish, believed to be sardines or pilchards, have washed ashore along the River Derwent in Tasmania. Source: Lisa Hollister/Pulse\n\n\"Disturbed\" locals have reported that hundreds — and possibly thousands — of small dead fish are washing up ashore along a popular Australian waterway in the country's south.\n\nNumerous dead fish have been spotted floating along the River Derwent in Tasmania over the weekend, sparking an investigation by environmental authorities.\n\nThe fish, believed to be pilchards or sardines, were seen strewn along the water and beaches between Crayfish Point in Taroona and Long Beach in Sandy Bay on Saturday. The sight alarmed local residents, many of whom shared their concern on social media.\n\nPilchard orthomyxovirus (POMV) was detected in samples collected over the weekend by Biosecurity Tasmania and the Environment Protection Authority (EPA). Source: Lisa Hollister/Pulse\n\nWhy are fish appearing dead in Tasmania?\n\nInitial testing by Biosecurity Tasmania and the Environment Protection Authority (EPA) detected the presence of pilchard orthomyxovirus (POMV) — a virus known to naturally occur in several fish species found in Tasmanian waters — in samples collected over the weekend, Pulse Tasmania reported.\n\nADVERTISEMENT\n\nThe virus belongs to the same broader family as influenza but only infects aquatic species, with Atlantic salmon and Australian pilchards being particularly vulnerable.\n\nWhile it often exists in the environment without causing major issues, outbreaks can occur when fish are stressed due to environmental factors like warm water temperatures, low oxygen levels, or handling. These outbreaks can lead to symptoms such as lethargy, unusual swimming behaviour, reduced appetite, and, in severe cases, large-scale fish deaths.\n\nIn recent months, mass fish deaths have been reported along Australia's coast. In March 2025, thousands of juvenile leatherjacket fish washed up on beaches stretching over 300 kilometres from Stanwell Park to Bermagui in New South Wales.\n\nSimilarly, in South East Queensland, reports emerged of leatherjacket fish washing ashore, with environmental factors such as changes in water temperature, pollution, or natural events like ex-Tropical Cyclone Alfred potentially contributing to the strandings.\n\nIn South Australia, a toxic algae outbreak was responsible for the deaths of numerous marine life. Among them were different species of fish, octopus and cockles (also known as pipis).\n\nADVERTISEMENT\n\nThe Department of Natural Resources and Environment Tasmania confirmed that tests for illnesses typically associated with farmed salmon, including Tasmanian rickettsia-like organism (TRLO) and P. salmonis, returned negative results.\n\nWhile the current fish kill appears to be localised, further testing is now underway to determine whether other contributing factors may be involved. Officials are also monitoring nearby marine environments to assess the potential impact on other species.\n\nEnvironmental scientists said it's still unclear whether the event was an isolated incident or could indicate deeper ecological issues within the Derwent Estuary.\n\nDead salmon wash up due to farm bacterial infection\n\nIn early 2025, Tasmania experienced a significant environmental crisis as large numbers of dead salmon and oily fish waste began washing up on beaches in the state's southeast, including Verona Sands and Bruny Island.\n\nADVERTISEMENT\n\nThese incidents were linked to a mass mortality event in nearby salmon farms, where over 5,500 tonnes of fish died in February alone—approximately six per cent of the industry's annual production.\n\nThe primary cause of the die-off was an outbreak of Piscirickettsia salmonis, a bacterial infection exacerbated by rising water temperatures. As the infected fish decomposed, congealed fish oil and fatty, \"foul-smelling\" deposits formed, which then drifted ashore.\n\nPreliminary testing by the Environment Protection Authority (EPA) confirmed that these greasy \"chunks\" were composed of fish oil mixed with sand.\n\nDespite the decline in fish deaths, the incident has raised ongoing concerns about the sustainability and environmental impact of salmon farming in Tasmania. Calls for increased transparency and stricter oversight continue as the community seeks to prevent similar events in the future.\n\nDo you have a story tip? Email: newsroomau@yahoonews.com.\n\nYou can also follow us on Facebook, Instagram, TikTok, Twitter and YouTube.",
    "source": "Yahoo",
    "cluster_id": 33
  },
  {
    "url": "https://au.news.yahoo.com/caravan-dad-blown-away-by-sketchy-problem-at-aussie-campsites-bogged-for-days-064152902.html",
    "title": "Caravan dad 'blown away' by sketchy problem at Aussie campsites: 'Bogged for days'",
    "publish_date": "2025-05-18T06:41:52Z",
    "category": "finance",
    "authors": [],
    "text": "While most Australians are familiar with the country's iconic red dirt, some may never have heard of this 'slippery' soil.\n\nWhen reflecting on Australia’s iconic landscape, it’s hard not to picture the distinct dusty, red dirt that stretches across the centre of the lucky country. However, that might not be the case for everyone, with a lesser-known “sketchy” soil creating big problems at caravan parks and campsites, leaving some travellers “bogged for days”.\n\nWhen Aaron Schubert, 35, his wife and their two young sons hit the road to embark on a two-year lap of Australia, the dad told Yahoo he was pretty familiar with the “clay mud” often seen in his home state of WA. But as the family trekked further north and along the coast to Queensland, they were shocked by the stark difference in the dirt beneath their feet.\n\n“We’ve done a ridiculous amount of 4WDing and black soil was fairly new to us, but it blew me away with how sketchy things can get,” Schubert, who has shared tips about caravanning and camping on his website for 15 years.\n\nThe 35-year-old said he was 'quite taken aback as to how slippery' the clay soil is. Source: Aaron Schubert/Supplied\n\nBlack soil, otherwise referred to as a vertosol, is Australia’s most fertile soil and can be found largely across Queensland and NSW, especially in agricultural areas. While it is prime for produce, the cracking clay soil can get “really sticky” and soft when wet, former president of Soil Science Australia Dr Vanessa Wong told Yahoo.\n\nADVERTISEMENT\n\nUnsurprisingly, this has landed numerous campers in quite a pickle, with Schubert saying it’s “very easy for people to get caught out”. “I was quite taken aback as to how slippery it was on a number of occasions in Cape York,” he added.\n\nCaravanners 'bogged for days' at Queensland campsites\n\nOne morning, while staying at a caravan park in Karumba, a coastal town in the Gulf of Carpentaria, Schubert told Yahoo he awoke to find some cars “stuck at the bottom” and wandered down to see what was going on.\n\n“I nearly stacked it in my thongs. You don’t even have to sink into [black soil]. There’s just zero traction,” he said. “We went to another campsite not long after and there were cars that were bogged for five or six days. They just had to wait for it all to dry out.”\n\nIn nearby Normanton, Schubert popped into the visitors centre and learned multiple campers had gotten stuck near a river after ignoring a warning to move before the rain set in.\n\nSchubert said he came across several travellers who were stranded for days after getting bogged in black soil. Source: Aaron Schubert/Supplied\n\n“They’d rung up asking for recoveries, with some people saying their van started sliding towards the river at night when the rain hit. If you imagine the slipperiest stuff you can stand on, black soil is pretty similar!\n\nADVERTISEMENT\n\n“If there’s black soil on the surface and it rains, that's it — you’re in big trouble.”\n\nSchubert, who returned home to Perth late last year, said his family avoided getting bogged by being “pretty cautious” and consistently keeping an eye on the weather.\n\n“I think that applies in general to 4WDing. You don’t want to be at the top or bottom of a mountain if it’s gonna rain because you it doesn’t have to be black soil for you to end up in a world of pain.”\n\nAustralia has the largest variety of shrink/swell soils. Source: TERN Australian Soil Classification Map\n\nWhat is black soil?\n\nIn Australia, there are several kinds of vertosols — black soil is just one of them, Dr Wong said. It shrinks and swells depending on whether it’s wet or dry, with some farmers reporting losing entire fence posts in the soil’s large cracks.\n\nADVERTISEMENT\n\n“Clay soils can be found all over the world but Australia has the largest variety of these shrink/swell soils — it’s one of the really neat things about the Aussie landscape. They also make up a large area relative to our land mass which is probably why people keep coming across them,” Dr Wong told Yahoo.\n\n“These soils can be quite deep so once you get stuck in them they get really, really sticky because of the clay contents. There’s nothing underneath to stop you from sinking.”\n\nDo you have a story tip? Email: newsroomau@yahoonews.com.\n\nYou can also follow us on Facebook, Instagram, TikTok, Twitter and YouTube.",
    "source": "Yahoo",
    "cluster_id": 34
  },
  {
    "url": "https://au.news.yahoo.com/sad-reality-revealed-as-trees-turn-blue-across-australia-confronting-051018491.html",
    "title": "Sad reality revealed as trees turn blue across Australia: 'Confronting'",
    "publish_date": "2025-05-18T05:10:18Z",
    "category": "finance",
    "authors": [],
    "text": "The striking campaign aims to de-stigmatise the conversation around suicide, which is the leading cause of death for Australians aged 15 to 49.\n\nScenes like this are popping up all over Australia. Source: Supplied\n\nAustralia’s mental health crisis is one many have experienced firsthand, and now a striking campaign is aiming to help spark important conversations in a visible and unexpected way.\n\nThe Blue Tree Project is a national initiative that encourages communities to paint dead trees blue as a visual reminder to reduce stigma around mental health and suicide. Launched in Western Australia in 2019, the grassroots movement has since grown into a global symbol of support and awareness.\n\nIn the ACT, the project is backed by the territory government, which recently called on locals to \"start important discussions that could make a real difference\". Last Thursday, the Office for Mental Health and Wellbeing hosted a tree-painting event in Acton to launch Canberra’s Tree Week.\n\n\"Openly talking about mental health can reduce stigma, shift outdated attitudes, and create safer spaces where people can seek help without judgment,\" said Gabrielle from the Office for Mental Health and Wellbeing. \"It’s great to see so many people come together to create a more open, supportive community where mental health is recognised and talked about.\"\n\nIn the ACT, the Blue Tree Project is backed by the territory government. Source: ACT Government\n\nThe ACT Government said the initiative is successfully sparking the kinds of mental health conversations it set out to promote. \"When someone asks ‘Why is that tree blue?’ it can lead to meaningful discussions that help reduce stigma,\" a spokesperson told Yahoo News, adding that the aim is to create \"safer spaces where people can seek help without fear of judgment.\"\n\nADVERTISEMENT\n\nThey said the community response has been “overwhelmingly positive”, with feedback coming from a diverse range of Canberrans — including students, tradespeople, public servants, and retail workers. \"Many have said the trees offer a sense of connection, visibility, and hope, reminding people they are not alone in their mental health journey.\"\n\nThere are currently several Blue Trees across the ACT, including three painted by the government in Lyons, Holt and Acton, with more planned. The government said it continues \"to identify suitable locations for future trees\", and encourages the public to view the full list online.\n\nOnly non-living trees are painted, following environmental and cultural assessments. Trees are chosen for their visibility, and non-toxic paint is used to \"ensure environmental safety.\"\n\nThe blue trees are meant as a symbol of the largely hidden problem that continues to plague Australia. Source: Blue Tree Project/Facebook\n\nImportant truth behind unique campaign\n\nThe Blue Tree Project was founded by CEO Kendall Whyte, who started the organisation a year after losing her brother to suicide in 2018.\n\nADVERTISEMENT\n\n\"Like many initiatives, there will always be people who don't connect with our cause and mission,\" she previously told Yahoo. \"However, the support over the last six years has been overwhelmingly positive.\"\n\nWith suicide the leading cause of death for Australians aged 15 to 49, according to ABS data, the group now runs workshops and collaborates with corporate partners to better equip people to have difficult but vital conversations.\n\n\"Outdated attitudes are still deeply ingrained across Australia, which is preventing many from seeking support,\" Kendall said. \"Education is crucial, not only in shifting old attitudes, but also in upskilling ourselves to have the harder and more confronting conversations in life.\"\n\nThe idea of painting trees began with a joke her late brother once played by painting a tree on the family’s Western Australian property to surprise their dad. Today, more than 1,300 registered blue trees — all dead trees known as stags — have become symbols of hope around the world.\n\nADVERTISEMENT\n\n\"There is now a blue tree on every continent of the world — making us a global movement,\" Kendall said.\n\nReaders seeking support and information about suicide prevention can contact Beyond Blue on 1300 22 4636, Lifeline on 13 11 14 or Suicide Call Back Service on 1300 659 467.\n\nDo you have a story tip? Email: newsroomau@yahoonews.com.\n\nYou can also follow us on Facebook, Instagram, TikTok, Twitter and YouTube.",
    "source": "Yahoo",
    "cluster_id": 35
  }
]