[
  {
    "url": "https://www.9news.com.au/national/gina-rinehart-rooftop-helipad-plan-rejected-by-perth-council/1ccb7e35-629e-41bf-ad11-c0fb7109741f",
    "title": "Australia's richest person loses bid for rooftop helipad",
    "publish_date": "Wed, 10 Dec 2025 01:31:40 +0000",
    "category": "finance",
    "authors": [
      "Dec"
    ],
    "text": "A﻿ bid by mining magnate Gina Rinehart to construct a rooftop helipad at the Perth headquarters of her company has been rejected by local councillors.\n\nCity of Perth councillors backed recommendations from planning officials and voted six to two in opposing the application at a council meeting last night.\n\nRinehart, the richest person in Australia, had sought to include a helipad designed to hold a Bell 429 helicopter on top of Hancock Prospecting's revamped headquarters in West Perth.\n\nA proposal by mining billionaire Gina Rinehart to build a helipad on her company's revamped Perth headquarters has been rejected by councillors. (Supplied)\n\nHancock said the helipad would be used only a maximum of 12 times every year.\n\nNoise impact from the helicopter would ﻿be limited to a few minutes during landing and take-off, the company said.\n\nBut council planning chiefs decided to oppose the application, arguing noise levels could not be eased and the helipad would impact nearby residential land.\n\nAmong the councillors who voted for a motion against the application was Lord Mayor Bruce Reynolds.\n\nHe told the meeting that Rinehart was an \"amazing Australian\", but backed planners' concerns about noise and environmental impacts.\n\nA Hancock Prospecting spokesperson said the outcome of the meeting was disappointing and the company would consider further options.\n\nAn artist impression of Hancock Prospecting's revamped headquarters in Perth. (Graphic: Cox Architecture)\n\nThey pointed to a telephone poll conducted by the 6PR radio station in Perth last week that showed strong public backing for the helipad proposal.\n\nThe spokesperson also ﻿restated the company's stance that public safety would not be impacted and environmental impacts would be kept to a minimum.\n\n\"Independent technical assessments confirmed noise would not exceed existing ambient noise levels for the area, in fact, even reaching the highest current ambient noise level would occur for less than one minute per month – and only during daytime hours,\" they said.\n\n\"Other expert technical reports addressing aviation safety and wind downwash confirm the helipad can operate safely and appropriately within the existing and future inner-city context.\"\n\nThe spokesperson said Perth had missed an opportunity to showcase itself as a global mining and business hub, arguing other ﻿international cities had helipads.\n\n\"Rooftop helipads are commonplace in major and premier CBDs around the world including New York, London and Tokyo.\"\n\nDOWNLOAD THE 9NEWS APP : Stay across all the latest in breaking news, sport, politics and the weather via our news app and get notifications sent straight to your smartphone. Available on the Apple App Store and Google Play .",
    "source": "9News",
    "cluster_id": 0
  },
  {
    "url": "https://www.9news.com.au/national/one-in-five-mortgage-holders-say-they-borrowed-too-much-finder-survey/b3dfdfc4-232c-434e-bee4-7d99835805df",
    "title": "One-in-five mortgage holders rue taking on huge home loans",
    "publish_date": "Tue, 09 Dec 2025 23:33:39 +0000",
    "category": "finance",
    "authors": [
      "Dec"
    ],
    "text": "H﻿undreds of thousands of Australian mortgage holders think they've borrowed too heavily to finance their home loans, according to new research today.\n\nA survey by comparison site Finder canvassed 1017 people, 297 of whom have a mortgage, and showed one in five think the financial burden is too much.\n\nThat is equivalent to 627,000 homeowners across Australia.\n\nH﻿undreds of thousands of Australian mortgage holders think they've borrowed too heavily to finance their home loans, according to new research today. (Dominic Lorrimer)\n\nThe findings come after ﻿the Reserve Bank of Australia board decided yesterday to keep interest rates on hold at 3.6 per cent.\n\nWhile the decision left mortgage holders disappointed, economists and commentators have not ruled out a possible hike in the cash rate next year.\n\nThey point to inflation stubbornly remaining outside the RBA's target range as a hurdle to further cuts.﻿\n\nFinder home loans expert Richard Whitten said some borrowers had stretched themselves to enter the housing market.\n\n\"Many Aussies who took out a loan at the top of their borrowing capacity are now finding themselves with a mortgage that's pushing their budget to its limits.\n\n\"When you layer home loan repayments on top of everything else – groceries, energy bills, insurance and more – the costs quickly add up.\n\n\"Homeowners are having to make some tough decisions – cutting back on essentials, dipping into emergency savings, or postponing major life plans just to keep up with their repayments.\" ﻿\n\nLast month, 37 per cent of homeowners said they struggled to pay their mortgage, according to Finder's Consumer Sentiment Tracker.\n\nWhitten warned if rates increase next year, anyone who's already stretched will feel the pinch immediately.\n\n\"Shaving even half a per cent off your interest rate can save you thousands of dollars.\"",
    "source": "9News",
    "cluster_id": 1
  },
  {
    "url": "https://www.9news.com.au/national/shocked-to-the-core-iconic-david-jones-christmas-window/6d1e0496-e2d2-485a-bdfd-c5776482260d",
    "title": "'Shocked to the core': Beloved Christmas tradition scrapped in Sydney",
    "publish_date": "Wed, 10 Dec 2025 00:36:11 +0000",
    "category": "finance",
    "authors": [
      "Dec"
    ],
    "text": "Sydney residents have lashed out at David Jones after its iconic Christmas window display was abruptly scrapped this year.\n\nHornsby Heights father Phil told radio station 2GB the decision shattered a family tradition he had passed down to his seven-year-old daughter Lucy.\n\n\"I went around Elizabeth Street, went around Castlereagh Street, went around Market Street - no Christmas windows,\" he told 2GB radio host Clinton Maynard.\n\nThe Christmas display at David Jones in Sydney CBD in 2021. (SMH)\n\n\"What I find shocking is this has been a tradition of David Jones for the last 70 years.﻿\n\n﻿\"I was going back through the archives, I found a photo from 1952 of kids gathering around there.\n\n\"My mother used to tell me about ﻿my grandfather taking her down when she was a little girl, so this is something that's been going on for so long.\n\n\"It's such a tradition and I think it's a real loss for Sydney's Christmas.\n\n\"Melbourne's Myer is still running Christmas windows so I'm just shattered we're not doing it here.﻿\"\n\nThe father said he asked staff and he was told the store wasn't doing the window this year.\n\n﻿\"That's a small sentence, but for me it carries a big loss,\" he said.\n\n\"This is about community and sharing the joy of Christmas time that Sydney families have enjoyed for decades.\"\n\nThe department store﻿ told the radio station it has opted to feature its loyalty program mascot Domino the Dalmatian which fits in with its theme, \"A very rewarding Christmas\".\n\nOne caller Denise said she regularly visited the department store to view the Christmas display.\n\n\"I was just shocked to the core when I heard about DJs in the city,\" she said.﻿\n\n\"I was that upset ﻿that I went on their website and put a nice review on there for them.\"\n\nListener Ros told Maynard she was \"disappointed\" by the lack of decorations.﻿\n\n\"What a load of crap with the Dalmatians, excuse my French,\" she said.﻿\n\n\"﻿We all love Dalmatians but they don't have a lot to do with Christmas, with respect to those wonderful dogs,\" Maynard said.\n\nCaller Louise said she preferred the Christmas decorations in the Melbourne CBD.\n\n\"I try not to be outraged too much,\" she said.\n\n\"My ﻿husband and I were in Melbourne, we were very lucky to watch the Australian Open golf on the weekend, and we went into the Melbourne CBD yesterday and it felt so lovely for Christmas.\n\n\"I begrudgingly said to my husband, 'Wow, Melbourne just does it so much better',\" she said.﻿\n\nA David Jones spokesperson said the team understood \"how deeply sentimental the Christmas windows are for many families and truly appreciated the feedback\".\n\n\"This year, we're celebrating A Very Rewarding Christmas – a season all about the joy of giving, cherishing moments with loved ones, and enjoying the benefits of our new loyalty program,\" the spokesperson said.\n\n\"To reflect this theme, the Elizabeth Street windows feature Domino the Dalmatian, our symbol of loyalty, brought to life through animation in our campaign.\n\n\"While the windows look different, the Christmas magic continues in-store with the Santa Experience, the Christmas Shop, the David Jones Choir, and our Christmas Shopping Festival on 11 December.\n\n\"We greatly value our customers' feedback and will carefully consider it as we plan future Christmas experiences.\"",
    "source": "9News",
    "cluster_id": 2
  },
  {
    "url": "https://www.9news.com.au/national/social-media-ban-about-avoiding-the-truth/4ccfac45-9ee4-45e0-b189-d7b7b3aed2ea",
    "title": "'The social media ban is the easy option. That's why it will fail'",
    "publish_date": "Tue, 09 Dec 2025 13:13:40 +0000",
    "category": "finance",
    "authors": [
      "Dec"
    ],
    "text": "Opinion: I keep seeing people acting shocked that social media is out of control, and yet the ban feels like the government has finally noticed a problem we've been living with for years and picked the laziest fix.\n\nBeing 15 and online isn't easy. I think anyone could tell you that. You're constantly faced with pressure to keep up with trends, look or act a certain way, and stay plugged in. Always.\n\nIt's chaotic, exhausting, and most people I know will admit that they're probably better off without it.\n\nFifteen-year-old Grace Anderson says the Australian government is taking the easy option with the implementation of the social media ban. (Supplied)\n\nSocial media hasn't just crept into the modern teenager's lives, it's steamrolled straight through.\n\nBut this doesn't mean the blanket ban is the hero solution it's been sold as.\n\nIn my opinion, banning social media is punishing the people. The people aren't the problem. The apps are.\n\n'What Australia needs is an overhaul, a genuine effort to collaborate with social media companies on making them a safer and useful place for everyone'\n\nBanning every under 16 doesn't fix the parts of social media that are actually broken. It doesn't change the algorithms that shove extreme content in your face. It doesn't make platforms take responsibility for the way they design apps to keep us addicted.\n\nWhen someone finds a way around the ban - because trust me, they will - the cycle just repeats.\n\nNothing improves. The problem doesn't disappear, it just goes into hiding.\n\nCutting teenagers off such a big part of society for the first 16 years of life doesn't \"fix\" social media. It just means that when we do turn 16, the shift is an unnecessary confrontation with reality that could so easily be softened.\n\nPolicies like these act as if every teenager is the same. That's not true - as if a 12-year-old on TikTok at 2am is identical to a 15-year-old using Instagram to keep up with school, friends, and sport. A harsh rule doesn't recognise differences.\n\nDifferences in people, in apps.\n\nI don't want to be treated like one big problem to be managed.\n\nIf governments actually wanted to help, they'd go after the companies. Force them to fix features that make social media so damaging - streaks, instant gratification, constant notifications. Instead we're stuck with a ban, which is the most basic solution to this complex problem.\n\nI could've thought of it.\n\nI'm not against it. Not fully. I can see where they were coming from. I see the addiction in society, I see it in myself.\n\nBut there were so many ways to help. To help kids see themselves in lights that aren't overshadowed by their phones. What Australia needed right now wasn't an age restriction, a blanket ban, a loss of trust with the government.\n\nWhat Australia needs is an overhaul, a genuine effort to collaborate with social media companies on making them a safer and useful place for everyone.\n\nThey took the easy option, and it will fail.\n\nDo you support banning under 16s from using social media? Yes 10410 No 3458",
    "source": "9News",
    "cluster_id": 3
  },
  {
    "url": "https://www.9news.com.au/national/social-media-ban-australia-live-updates-latest-news-headlines/ad7659ba-e99a-483e-b0f4-3fd5a82aa28b",
    "title": "Juggernaut tech giant to launch legal challenge against social ban",
    "publish_date": "Wed, 10 Dec 2025 00:53:35 +0000",
    "category": "finance",
    "authors": [
      "Dec"
    ],
    "text": "What happens when you suddenly kick millions of teens off social media? We're about to find out with the eyes of the world watching.\n\nAll sites that meet the government's definition of an age-restricted social media platform must now show they are doing enough to block under-16s from access or face multi-million-dollar fines.\n\nFollow our live coverage and reaction from throughout the day.\n\nExplainer: Full list of sites banned﻿ and your other questions answered\n\nOpinion: 'A ban is the easy option, not the hard option, and that's why it will fail'﻿",
    "source": "9News",
    "cluster_id": 4
  },
  {
    "url": "https://www.9news.com.au/national/northern-territory-australia-politics-andrew-mackay-bull-horse-inside-house/deccb172-f713-44c6-9f74-88b2662f89a6",
    "title": "Bull and horses caught wandering into the home of Aussie politician",
    "publish_date": "Tue, 09 Dec 2025 23:27:54 +0000",
    "category": "finance",
    "authors": [
      "Dec"
    ],
    "text": "A politician from the Northern Territory had some surprise visitors in his house after a bull and a horse were caught sneaking in through an open door.\n\nAndrew Mackay, who is a Country Liberal MP for the Northern Territory electorate of Goyder, shared a video of several farm animals gaining access to his home via a backdoor that had been opened by his pet dogs.\n\nThe pet camera initially showed two of his dogs pushing the sliding door open with their noses to get outside, leaving it slightly ajar.\n\nTwo horses and a bull were seen entering Mackay's house. (Facebook/Andrew Mackay MLA)\n\nMackay now thinks the animals may be tempted to return. (Facebook/Andrew Mackay MLA)\n\nA large white bull was then seen poking his head through the door, before stepping fully inside the room.\n\nA horse then follows suit, with both animals having a curious wander around what appears to be a living room.\n\nAnother horse is also seen on the camera standing outside the door, but it is unclear if they also ventured into the house.\n\nMackay, who posted the video to his official Facebook account, was able to see the funny side of the situation despite the potential dangers of a bull walking around his home.\n\n\"Note to self: The dogs can't be trusted with door security…\" the post read.\n\nA somewhat bewildered Mackay surveys the mess made, though none of the animals were harmed. (Facebook/Andrew Mackay MLA)\n\n\"Dinner finished early last night when I decided to check the pet cam to find Thunder figured out how to nuzzle open the door.\"\n\nThe end of the video taken later that night shows Mackay surveying the mess the animals made, with one of his dogs beside him.\n\nHe said there was no major damage and that all animals in the video were unharmed, but he still had some concerns they may return.\n\n\"Now the outside animals know what aircon feels like and will no doubt try again,\" he said with a hint of humour.",
    "source": "9News",
    "cluster_id": 5
  },
  {
    "url": "https://www.9news.com.au/national/ndis-auto-plans-shift-to-computer-generated-funding-how-it-works-what-it-means-everything-to-know-explained/824572d7-2229-484c-a413-029d79390069",
    "title": "The NDIS is introducing computer-generated plans. Here's what that means",
    "publish_date": "Tue, 09 Dec 2025 21:45:15 +0000",
    "category": "finance",
    "authors": [
      "Dec"
    ],
    "text": "﻿Reports of ﻿computer-generated NDIS plans have been circling for weeks, leaving some participants and their families worried.\n\nThe new plans appear to be part of cost-cutting efforts at the NDIS, which is projected to cost Australia $52.3 billion in the 2025-26 financial year.\n\nBut what is the new ﻿I-CAN assessment tool, how will these computer-generated NDIS plans work, and when will they come into effect?\n\nHere's what we know so far.﻿\n\nThe NDIS is introducing computer-generated plans - but that doesn't mean it's using AI. (Getty)\n\nWhat are NDIS computer-generated plans?\n\nTalk of \"computer-generated NDIS plans\" refers to the new digital tool the NDIS will soon be implementing to help determine participant funding.\n\nIn October, the government announced changes to how budgets are determined for NDIS participants.\n\nUnder the new method, budgets will be decided based on a Support Needs Assessment.\n\nThe base of the assessment will be formed by the Instrument for the Classification and Assessment of Support Needs (I-CAN) tool.\n\nDeveloped by ﻿the University of Melbourne and the Centre for Disability Studies, the I-CAN tool has been used in the Australian disability sector for 20 years.\n\nThe I-CAN tool is a computer program, but it's not AI.﻿\n\n\"The Support Needs Assessment is not automated and does not use artificial intelligence,\" a National Disability Insurance Agency (NDIA) spokesperson told 9news.com.au.\n\n\"Decisions about a participant's needs will be made by a real person.\n\n\"Assessments will be conducted by trained assessors and plans will always be approved by real people who are trained NDIA staff.\" ﻿\n\nWhen will the new NDIS computer-generated plans start?\n\n\"From mid-2026, the NDIS planning process will begin changing to make it fairer, more consistent and easier for participants,\" an NDIA spokesperson said.\n\nThe I-CAN planning model will be rolled out in stages, according to The Guardian.\n\nThe NDIA is reportedly ﻿conducting participant and staff information sessions now.\n\nHow does the I-CAN tool calculate my budget?\n\nThe I-CAN tool will be used in conjunction with ﻿in-person assessments to produce a Support Needs Assessment and develop participant budgets.\n\nAn NDIS participant will first meet with a trained assessor who will work to understand their ﻿life and disability support needs.\n\nThe participant can bring family, support people or carers to the meeting.\n\nA new personal and environmental circumstances questionnaire will also be used to collect additional information about the participant's support needs.\n\nIn some cases, ﻿where the participant's needs are more complex, reports from their treating health professionals may also be submitted.\n\n﻿Information gathered by the assessor will be checked with the participant and their carers and put into the I-CAN tool.\n\nIt will then cost the participant's support needs and provide a budget or funding package.\n\nAll budgets produced using the I-CAN﻿ tool must be approved by an NDIS staff member.\n\nHowever, NDIS staff cannot make any changes to a budget generated by I-CAN, according to reports.\n\nStaff can only request a ﻿new assessment from the I-CAN tool using different inputs.\n\nA ﻿spokesperson for the NDIA, which administers the NDIS, said the new method would ensure more consistent collection of information and inform fairer plan budgets.\n\n\"This planning process uses a person-based and strengths-based approach that will result in simpler plans with more flexibility,\" they said.\n\n\"It will also reduce the need for participants to collect and pay for expensive reports.\"\n\nThe spokesperson also said NDIA staff will spend more time with participants under the new framework.\n\nUnder the new framework, NDIS staff won't be able to amend budgets produced by the I-CAN tool. (9News)\n\nWhat if I disagree with my NDIS computer-generated plan?\n\nParticipants still have the ﻿right to request a review of their plan, either internally or through the Administrative Review Tribunal (ART).\n\nAn internal review may involve conducting another assessment using the I-CAN tool.\n\nIf a participant is still unsatisfied, they can request a review through the ART.\n\nHowever, tribunal members will reportedly no longer have the power to directly amend an NDIS participant's plan if they believe it's incorrect.\n\nMore than 7000 new cases of participants appealing NDIA decisions were brought before the ART in the 2024-25 financial year alone.\n\nThat figure represented a ﻿76 per cent increase year on year.",
    "source": "9News",
    "cluster_id": 6
  },
  {
    "url": "https://www.9news.com.au/national/anika-wells-expenses-family-reunion-entitlements-parliamentarian-taxpayer-spending-rules-explained/e35c24ab-5a97-49ec-b985-36c352511ec9",
    "title": "Minister racks up $1000 bill at the tennis. But it's not against the rules",
    "publish_date": "Tue, 09 Dec 2025 01:40:15 +0000",
    "category": "sports",
    "authors": [
      "Dec"
    ],
    "text": "Anika Wells is under the microscope once again for her taxpayer bills after she spent $1000 on a government-funded car to wait while she watched the tennis.\n\nThe frontbencher is already under fire for spending nearly $100,000 on flights to New York, $3000 on a family ski trip and another $4000 on flying her husband to the cricket.\n\n﻿Now, it has been revealed Wells billed taxpayers a grand to have a Comcar idle for seven hours while she enjoyed the Australian Open tennis final in January 2023, The Sydney Morning Herald reports.\n\nMinister for Communications and Minister for Sport Anika Wells' taxpayer expenses have been under the microscope. (Alex Ellinghausen)\n\nIt has also been reported that Wells claimed $8500 in family travel expenses on flights to Melbourne for the AFL grand final weekends in 2022, 2023 and 2024.\n\nThe Communications and Sport Minister, like every federal MP, is allowed to use the public purse on work-related expenses – but in a cost of living crisis, critics say her spending doesn't quite pass the \"pub test\".\n\nSo what exactly are the rules﻿?\n\nParliamentarians like Wells can use public resources, including taxpayer money, for travel which falls within parliamentary business.\n\nThe term parliamentary business﻿ means anything that relates directly to their role.\n\nIn Wells' capacity as Sports Minister﻿, she and fellow frontbenchers have argued that attending major sporting events such as the Australian Open, Thredbo for a Paralympics event and the AFL grand final is part of her job.\n\nHowever, the fact Wells' husband and children have accompanied her on some of these trips may seem like a grey area.\n\nBut there is something known as \"family reunion travel\" that means this falls perfectly within the rules.\n\nWells ﻿defended her expenses last week, saying \"every parliamentarian has family reunion entitlements\".\n\nWells has also spent $8500 on flying to Melbourne for the AFL grand final in 2022, 2023 and 2024. (Instagram/@anikawellsmp)\n\nWhat are 'family reunion' entitlements?﻿\n\nUnder this entitlement, MPs can be joined by their spouse, a nominee or their children at Commonwealth expense if they are travelling within Australia for work and their loved ones are coming to meet them.\n\nConversely, Wells can use this entitlement to fly back and forth between Canberra and Brisbane.\n\n﻿Between July and September this year, Wells has spent $3056.77 on family travel.\n\n﻿According to the Independent Parliamentary Expenses Authority (IPEA), this travel is covered if it is \"facilitating the family life of the parliamentarian's family\".\n\nThe Minister for Sport flew her family to Thredbo for a Paralympic event. (Nine)\n\nFor all other major travel expenses, like the trip to New York, there are certain provisions.\n\n﻿International travel must be approved by a presiding officer or the prime minister.\n\nThe budget for each presiding officer is $250,000 per year.﻿\n\nThe condition of spending taxpayer money is that every parliamentarian must be prepared to be \"personally responsible and accountable\" for it.﻿\n\nEvery politician's spending is publicly available on the IPEA website.﻿\n\nWells may have followed the rules, but the opposition has claimed she should have reined in her spending.\n\n﻿\"Whether it's New York, whether it's Paris, whether it's Thredbo, these are expenses that would make the royals blush,\" said Shadow Industry Minister Alex Hawke.\n\n\"If she wants to take her family on a ski holiday, she can pay for it herself,\" Shadow Finance Minister James Paterson added.",
    "source": "9News",
    "cluster_id": 7
  },
  {
    "url": "https://www.9news.com.au/national/christmas-new-year-public-holiday-dates-2025-state-by-state-explainer/d0f5094e-8c69-455c-8772-649832c4346a",
    "title": "What are the public holidays during the Christmas and New Year period?",
    "publish_date": "Tue, 09 Dec 2025 10:45:36 +0000",
    "category": "finance",
    "authors": [
      "Dec"
    ],
    "text": "Christmas is approaching, which means businesses around Australia will shut down, and many workers will earn some time off at the end of the year.\n\nThere are also several public holidays that fall within a week of each other, meaning Aussies get paid time off, resulting in many taking advantage to go on holidays or spend time with family.\n\nHere are all of the public holidays coming up, and how they differ between states.\n\nREAD MORE: Australia Post reveals deadline for mailing Christmas parcels\n\nMillions of Aussies will be treated to several public holidays to end 2025. (iStock)\n\nWhat are the public holidays over Christmas and New Year's in 2025?\n\nMost states and territories have identical public holidays at the end of this year.\n\nChristmas Day, December 25th is a public holiday all over Australia. This year, it falls on a Thursday.\n\nDecember 26th, known as Boxing Day or Proclamation Day, is also a public holiday all over the country.\n\nEvery state and territory has New Year's Day 2026 as a public holiday. This year it falls on a Thursday, though two regions also have a part-day public holiday the day before on New Year's Eve.\n\nSydney may be the epicentre of New Year's Eve celebrations, but it doesn't have a public holidat on December 31. (Getty)\n\nWhat is a 'part-day' public holiday?\n\nIn South Australia and the Northern Territory, 7pm to midnight on December 31 is designated as a part-day holiday.\n\nBoth also observe the same type of public holiday on Christmas Eve, December 24th, which is on a Wednesday this year.\n\nAnyone working between those hours on a part-day public holiday will be entitled to public holiday rates, which could be up to double time and a half.\n\nWhy is December 26th a public holiday?\n\nDecember 26th, known as Boxing Day, is a public holiday in many Commonwealth countries.\n\nIt was traditionally when tradespeople, servants and the poor were presented with gifts﻿, also called \"Christmas boxes\", which is how the term Boxing Day came into popular use.\n\nThe Sydney to Hobart Yacht Race begins on Boxing Day every year. (Getty)\n\nWhilst this purpose has changed, it can be a day of celebration with friends and family at the beach, but other significant events also occur on this day.\n\nIt is the start of Boxing Day sales and a busy shopping period, but also marks the beginning of the famous Sydney to Hobart Yacht Race, as well as the Boxing Day cricket test, held annually at the Melbourne Cricket Ground.",
    "source": "9News",
    "cluster_id": 8
  },
  {
    "url": "https://www.abc.net.au/news/2025-12-10/queensland-tent-family-not-considered-homeless/106120606",
    "title": "Queensland family living in a tent says they're not considered homeless",
    "publish_date": "Wed, 10 Dec 2025 01:55:55 +0000",
    "category": "finance",
    "authors": [],
    "text": "A regional Queensland family leasing a powered tent site at a caravan park has been told it is no longer considered homeless and not eligible for crisis accommodation.\n\nSimone and Steve Owen moved to Bundaberg, about 400 kilometres north of Brisbane, with their two children earlier this year after the lease on the property they rented at Townsville for seven years was not renewed.\n\nDespite applying for \"about 100 properties\" since January, the couple was unable to secure a home in the town and couch surfed with family and friends until moving to the tent site one month ago.\n\nThe family signed a lease at a caravan park one month ago. (ABC News: Johanna Marie)\n\nMrs Owen said they signed a six-month lease with the caravan park because it was \"safer\" than camping in public parks.\n\n\"We're paying $680 a fortnight to live here,\" she said.\n\n\" It's ridiculously expensive to live on a bit of dirt. \"\n\nThe family's weekly charge is comparable with the fees for non-permanent visitors at the park.\n\nMrs Owen said after signing the lease, community housing provider Regional Housing Limited explained that because the agreement was considered \"independent living\", the family did not qualify for crisis accommodation for people considered homeless.\n\nThe family will remain on the social housing register, which has an average wait time of two and a half years.\n\nMrs Owen said the situation had been particularly difficult on her children, aged 11 and 13.\n\n\"As a mum I feel bad for my kids that they're in this situation,\" she said.\n\n\"I just want a roof over my boys' heads … That's all I'm asking for, just tiny bit of help and compassion.\"\n\nThe couple is making the best of the situation for their children. (ABC News: Johanna Marie)\n\nShort-term and emergency housing\n\nA spokesperson from the Department of Housing and Public Works declined to comment on the couple's case for privacy reasons.\n\nIn a statement to the ABC, the spokesperson said the department funded community housing providers, including Regional Housing Limited, to support people experiencing or at risk of homelessness.\n\nThey said the department had allocated more than $396 million to 91 organisations in the 2025-2026 financial year to provide specialist homelessness services across Queensland, including three in the Bundaberg area.\n\nQueensland's social housing register has reached a record high, with the latest data showing 54,922 people on the waitlist in October.\n\nThat figure has grown by about 1,000 since the end of August.\n\nFamilies make up a large portion of people on the social housing register, with 30,709 active households waiting for a home.\n\nTom Smith says more needs to be done to help people into homes. (ABC News: Johanna Marie)\n\nBundaberg has a rental vacancy rate of 1 per cent and according to the Residential Tenancy Authority, a median weekly rent of $560 for a three-bedroom house.\n\nThe Queensland Council of Social Services told the ABC in October that rent prices in the town had increased by almost 80 per cent in the past five years.\n\nMember for Bundaberg, Labor's Tom Smith, said the government's partnership with community housing providers was failing people in desperate need of homes.\n\n\"There is absolutely no doubt that there's been changes and that we're seeing more and more families, which means more and more children living in tents, living in cars, living in the backyard of a friend's place,\" he said.\n\n\"That's simply not good enough.\"\n\nStorm season in a tent\n\nOn the cusp of the school holidays, Mr and Mrs Owen — who are each on a disability support pension — are bracing for the summer in their polyester-walled makeshift home.\n\nThey have already replaced tents and other equipment that was damaged during storms in November.\n\n\"Whenever we get rain, we hear it,\" Mrs Owen said.\n\n\"Whenever the wind blows, the tent's moving and we have to constantly lower this [awning] so this doesn't get damaged.\"\n\nThe family expects summer weather to be a challenge. (ABC News: Johanna Marie)\n\nShe said they hoped to one day secure social housing but in the meantime would continue applying for private rentals despite feeling overlooked, \"discriminated and judged\" by real estate agents.\n\n\"They look at us and say, 'You're not going to be able to afford that',\" she said.\n\n\"They talk about the vulnerable Australians — well, that's us, that is my family.\"",
    "source": "ABC",
    "cluster_id": 9
  },
  {
    "url": "https://www.abc.net.au/news/2025-12-10/testing-finds-some-imported-honey-not-honey/106119344",
    "title": "Beekeepers pay for imported honey testing to uncover hidden additives",
    "publish_date": "Wed, 10 Dec 2025 00:53:14 +0000",
    "category": "finance",
    "authors": [],
    "text": "Australian beekeepers have funded an investigation into the authenticity of imported honey on supermarket shelves, with early results showing some imported products are not pure honey.\n\nHoney is regarded as one of the most adulterated foods in the world and can be blended with products such as rice syrup or cane sugar.\n\nAustralian beekeepers are concerned Australia's current border testing of imported products is not detecting some forms of adulteration.\n\nChair of the Australian Honey Bee Industry Council, Jon Lockwood, said the industry was on a mission to modernise Australia's testing standards and work with the Department of Agriculture, Fisheries and Forestry (DAFF).\n\n\"We did a broad sweep, we [tested] about 30 [imported honeys] and we found a few honeys that had been pre-packed before they were imported into Australia that showed that they were adulterated,\" he said.\n\n\" We are not on a witch hunt, we are just trying to paint a bit of a picture of what is happening with the honey coming into Australia. \"\n\nBeekeepers say shoppers can look for labelled Australian honey to support the local industry. (ABC Midwest Wheatbelt: Jo Prendergast)\n\nBeekeepers contributed their own money to fund the testing which was conducted in laboratories in Germany.\n\n\"Our end goal is to show (DAFF) that perhaps some of this honey is slipping through the cracks with their current testing protocol, and that its testing protocol needs to be examined and brought up to the modern day era,\" Mr Lockwood said.\n\n\"DAFF have been really helpful, we've been happy to work with them.\"\n\nMr Lockwood said DAFF's testing was \"very, very outdated\" and did not detect some products honey could be blended with, such as rice syrup.\n\n\"It's a very grey area internationally on how to detect a pure honey, and that's what we are trying to investigate with the federal government to see if we can find some better [testing] protocols,\" he said.\n\n\"Any honey should only be produced from the bee, that's what we need to advocate for.\n\n\"We are trying to give our Australian beekeepers a level playing field.\"\n\nUpsetting results\n\nImported honey is often sold at a cheaper price than Australian-produced honey.\n\nIn 2024, Australia imported 9 million kilograms of honey from countries such as China, Argentina, Brazil and India.\n\nKim Fewster is a fourth-generation beekeeper based near Perth in Western Australia. (ABC Midwest Wheatbelt: Jo Prendergast)\n\nFourth-generation beekeeper Kim Fewster said it was difficult to compete in supermarkets, and to hear some imported products were not pure honey, as labelled, was distressing.\n\n\"It's very upsetting because the consumer doesn't know that the honey is adulterated,\" he said.\n\n\" What I keep saying to everybody is that if you buy honey that is local, if you go and buy your honey from the beekeeper down the road, that is the best honey in the world because you know where it has come from. \"\n\nMr Fewster said consumer confidence in honey labelling was low and the industry was attempting to increase consumer awareness of the benefits of buying local.\n\n\"I keep saying to everybody, 'You can buy a good kilo of beautiful West Australian honey for less than a Big Mac meal,'\" Mr Fewster said.\n\nAustralian honey producers say Australia's honey is some of the best in the world. (ABC Mid West Wheatbelt: Jo Prendergast)\n\nThe Australian beekeeping industry has endured some of its most challenging times recently with millions of bees lost to varroa mite and drought reducing honey production in some regions.\n\nMr Lockwood said the best way for consumers to support the industry was to read a product label.\n\n\"The biggest thing they can do for the Australian industry, and ensure their honey is pure and clean, is to ensure it's 100 per cent Australian honey,\" he said.\n\n\"One out of every three mouthfuls of food we consume is directly impacted by honey bees pollinating that crop.\n\n\"So by buying Australian honey, we're supporting the beekeeper and therefore food security.\"\n\nMuch of Australia's food production depends on bee pollination. (Supplied: Jeremy Jones)\n\nTesting protocols under review\n\nA DAFF spokesperson said testing was being conducted to compare current assessment protocols.\n\n\"Imported honey samples are analysed using internationally accepted standard methods for detecting adulterated honey,\" they said.\n\n\"The department is conducting a pilot survey to assess the authenticity of imported honey samples and compare the department's current border tests with the performance of commercially available analytical tests.\n\n\"The results of this survey will inform if further work is required to update our testing capability at the border.\"\n\nThe spokesperson said 5 per cent of consignments were randomly referred for testing under the Imported Food Inspection Scheme.\n\nBetween 2020 and 2024 honey products that were tested had an average compliance rate of 97 per cent.",
    "source": "ABC",
    "cluster_id": 10
  },
  {
    "url": "https://www.abc.net.au/news/2025-12-10/football-champions-league-wrap-salah-slot-liverpool-win/106123934",
    "title": "Liverpool boss says 'everyone makes mistakes' after win amid Salah spat",
    "publish_date": "Wed, 10 Dec 2025 00:36:16 +0000",
    "category": "sports",
    "authors": [],
    "text": "Even from the penalty spot, Liverpool managed just fine without Mohamed Salah.\n\nAfter leaving the Egypt forward in England, Liverpool got a much-needed boost with a 1-0 win over Inter Milan in the Champions League on Wednesday morning (AEDT). Barcelona and Bayern Munich also celebrated comeback wins and Chelsea lost.\n\nWith Liverpool's regular penalty taker Salah out of the squad following his public criticism of the club last week, Dominik Szoboszlai stepped up instead to score the 88th-minute penalty which earned a 1-0 win over one of the competition's best-performing teams.\n\nIt was all the more valuable coming after a run of one win in six games in all competitions for Arne Slot's under-pressure team, which moved up to eighth in the Champions League table and is now back in contention for a direct spot in the round of 16. Inter dropped to fifth.\n\nFollowing the win, the attention immediately turned back to Salah's apparent falling out with Slot and whether he would feature at the weekend against Brighton — Liverpool's last fixture before Salah departs to represent Egypt at the African Cup of Nations (AFCON).\n\n\"Well, you say everyone makes mistakes in life but the question is should the players also recognise that as well? And should the initiative come from the player or me,\" Slot said when asked post-match whether he'd like Salah back in his squad.\n\n\" There [were] a lot of things being said. That affects the players and the individual as well as he has been so, so influential. \"\n\nSalah's long-time teammate Andy Robertson called the club's current predicament \"a tough situation\".\n\n\"For me, he [Salah] is one of the greatest players to play for this club. He has been unbelievable for us. I signed the same window as him and we've been through so many highs and lows,\" he said.\n\n\"Whatever happens, happens internally. We're all together in the changing room, and you could see that today.\n\n\"I love playing with Mo Salah and I hope to continue playing with him.\"\n\nSalah (left) created controversy at the weekend by saying his relationship with Slot (right) has completely broken down. (Getty Images: Molly Darlington)\n\nLiverpool's players thought they had taken the lead with Ibrahima Konate's header in the 31st minute. After a video review that lasted several minutes, it was ruled out for handball as Virgil van Dijk had earlier nodded the ball on to the arm of Hugo Ekitike.\n\nHaving taken away a goal from Liverpool, VAR came to the visitors' aid when it spotted that Alessandro Bastoni had tugged Florian Wirtz's shirt in the area, with the midfielder flailing to the ground. Szoboszlai converted the penalty.\n\nTeen sensation continues to star for Bayern\n\nBayern's 17-year-old midfielder Lennart Karl produced an audacious bit of skill to continue his high-scoring start to life in the Champions League in a 3-1 win over Sporting Lisbon which lifted Bayern to second behind Arsenal.\n\nKarl scored his third goal in four career Champions League games, controlling a pass from Konrad Laimer in mid-air before volleying a shot from a tight angle over two onrushing defenders and past the goalkeeper.\n\nIt was part of a 12-minute, three-goal turnaround for Bayern after Joshua Kimmich's own-goal handed Sporting the lead. Serge Gnabry levelled for Bayern when he was left unmarked at a corner in the 65th, before Karl scored Bayern's second in the 69th and defender Jonathan Tah made it 3-1 in the 77th.\n\nWidely viewed as German soccer's best young talent this season, Karl became Bayern's youngest-ever Champions League scorer in October on his first start in the competition.\n\nLate on, Canadian left back Alphonso Davies came off the bench for his first game since March after a serious knee injury.\n\nYamal sets Champions League record\n\nHeaders by Jules Koundé three minutes apart gave Barcelona a 2-1 comeback victory over Eintracht Frankfurt.\n\nMarcus Rashford assisted in the first goal in the 50th and Lamine Yamal with a cross in the second in the 53rd.\n\nBarcelona's Lamine Yamal (left) continued the mesmerising start to his football career with another 'youngest ever' record. (Getty Images: David Ramirez)\n\nThe goal took Yamal to 14 career combined goals and assists in the Champions League, breaking a tie with Kylian Mbappe for the most by a player aged under 19, UEFA said.\n\nThe visitors had taken the lead with a goal by Ansgar Knauff in a 21st-minute breakaway at the renovated but only partially open Camp Nou stadium.\n\nSon says goodbye to Spurs\n\nSon Heung-min said a belated goodbye to Tottenham as his former club moved up to ninth after beating Slavia Prague 3-0 via an own-goal and two penalties in a game overshadowed by a dispute over moving a rainbow flag showing support for the LGBTQIA+ community.\n\nJulián Alvarez scored for the ninth time in his last nine league-phase appearances to lead Atletico Madrid to a 3-2 come-from-behind win at PSV Eindhoven.\n\nMarseille held on for a 3-2 win over Union Saint-Gilloise, which had two potential equalisers ruled out for narrow offsides on video review.\n\nFolarin Balogun's close-range finish gave Monaco a 1-0 win over Galatasaray. Gelson Martins scored the only goal in Olympiakos' 1-0 win over Kairat Almaty in Kazakhstan.\n\nAP/ABC",
    "source": "ABC",
    "cluster_id": 11
  },
  {
    "url": "https://www.abc.net.au/news/2025-12-10/anika-wells-gut-reaction-travel-expense-rules/106118512",
    "title": "Wells says 'gut reaction' to travel claims fair but she has 'upheld' rules",
    "publish_date": "Wed, 10 Dec 2025 00:20:25 +0000",
    "category": "finance",
    "authors": [],
    "text": "Communications Minister Anika Wells has accepted her taxpayer-funded travel claims have prompted a \"gut reaction\" in people, after a week of scrutiny over her expenses drew attention away from the government's efforts to spruik its world-first social media ban.\n\nTaxpayer-funded flights for Ms Wells' husband to join her at Boxing Day cricket tests and AFL grand finals, bills to hold Comcars for several hours while she attended events, and a more than $100,000 trip to New York for a speech to world leaders on the government's social media ban, have drawn intense scrutiny.\n\nYesterday, Ms Wells referred her claims for audit by the Independent Parliamentary Expenses Authority, but she has refused the Coalition's demand to step aside until that is resolved.\n\nMs Wells said she was trying to stay focused on her work.\n\n\"Absolutely not, I am the steward of a world-leading social media ban that has incredible cultural and generational change unfurling as of today,\" she said.\n\n\"I am also the communications minister who needs to make sure that taxpayers have confidence in the triple zero system, particularly over the summer.\"\n\nWells 'happy' for expense review, but dodges direct questioning\n\nIn a hastily arranged press conference outside Kirribilli House this morning to discuss the ban on children and teenagers under 16, the minister instead received a barrage of questions over the details of her travel claims.\n\nAlbanese tries to explain the inexplicable defending Wells's ski trip What was meant to be a Sunday interview bookending a remarkable political year became an exercise in explaining the inexplicable.\n\nAsked whether a taxpayer-funded trip where she attended a Labor fundraising event met requirements for travel claims to be for the dominant purpose of parliamentary business, Ms Wells responded that she had referred her travel claims.\n\n\"I have three different portfolios and have countless requests to be in different towns and cities to do all different things. I could probably live every day three times over and not get to all the requests,\" Ms Wells said.\n\n\" I always give really thoughtful care in the decisions I make in regard to my program ... I really do do my best. \"\n\nAsked whether it was appropriate for a Comcar to wait for eight hours while she attended an event, at a cost of more than $1,000, Ms Wells said she was \"happy\" for the independent authority to review that claim.\n\n\"We are looking at three and a half years of travel,\" Ms Wells said.\n\nMs Wells said she was confident she had upheld guidelines for charging taxpayers for travel, but that she was happy for that to be audited \"so there is no doubt\".\n\n\"I absolutely accept those figures prompt a gut reaction in people, I honestly accept that. I agree with everybody that parliamentarians' expenses should be scrutinised,\" Ms Wells said.\n\n\"I have been found to have followed the guidelines so far, but for the absolute avoidance of doubt I am happy for them to have another look.\"\n\nMs Wells said the rules were set \"at arm's length\" by the Independent Parliamentary Expenses Authority.\n\nPollies charge taxpayers $1.1m for family travel in 12 months Family reunion travel is under scrutiny as new analysis shows federal MPs and senators spent $1.1 million on flying and driving their loved ones to Canberra and around Australia in 12 months.\n\nBut the Coalition has said even if the minister has remained within technical guidelines, her travel claims have not met community expectations for how public money is used.\n\nSpeaking on Sky News, Shadow Finance Minister James Paterson said it was not enough for the expenses to be audited by the parliament's expense authority, saying the matter should also be referred to the Department of Prime Minister and Cabinet to determine whether Ms Wells have breached ministerial standards.\n\n\"There is a real sense from this government that they had a big election win and can basically get away with anything,\" Senator Paterson said.\n\n\"Including spending $100,000 flying to New York city to speak for six-and-a-half minutes, including having a meal out in Paris at taxpayers' expense that cost $1,000 for food and $750 for alcohol, and including keeping Comcar drivers waiting up to ten hours while you're at a sporting event in a corporate box sipping free champagne.\n\n\"I don't think it's sufficient that it has been referred to [the Independent Parliamentary Expenses Authority] only for independent investigation, I think there is a chance the ministerial code of conduct has also been breached.\"\n\nAs scrutiny has spread to other ministers and MPs in other parties, some have also questioned whether the rules should be revisited.\n\nEarlier, while also attempting to market the government's social media ban, Mr Albanese evaded whether he believed the rules for MP expense claims should be tightened.\n\n\"I think it's really important that an independent authority be just that, that I don't pre-empt what the independent authority thinks,\" Mr Albanese said.",
    "source": "ABC",
    "cluster_id": 12
  },
  {
    "url": "https://www.abc.net.au/news/2025-12-10/cricket-pat-cummins-returns-australia-3rd-ashes-test-squad/106124238",
    "title": "Cummins's return made official as Aussies name squad for Adelaide",
    "publish_date": "Wed, 10 Dec 2025 00:16:32 +0000",
    "category": "sports",
    "authors": [],
    "text": "Pat Cummins is set to return for Australia in Adelaide, with the captain named in the squad for the third Ashes Test.\n\nCummins has been recovering from a back injury and sat out the first two games of the series, but is now all but certain to play in a potentially decisive third game.\n\nCummins's inclusion is the only change to Australia's squad, which still includes opener Usman Khawaja, who is fighting to regain his position at the top of the order.\n\nAustralia's squad for the third Test in Adelaide Pat Cummins (c), Scott Boland, Alex Carey, Brendan Doggett, Cameron Green, Travis Head, Josh Inglis, Usman Khawaja, Marnus Labuschagne, Nathan Lyon, Michael Neser, Steve Smith, Mitchell Starc, Jake Weatherald, Beau Webster\n\nAustralia's final team will be confirmed at the toss when the Test begins next Wednesday, December 17.\n\nThe Adelaide Test will be Cummins's first outing in any form of cricket since he played a Test match in the West Indies in mid-July.\n\nCummins's return will heap the pressure on an England squad that is already under fire courtesy of its performances over the first two Test matches.\n\nCummins has played 19 Ashes Tests over his career and has taken 91 wickets at an average of 24.10. He was the leading wicket-taker in the series last time England toured Australia.\n\n\"We feel as though he'll be as best prepared as can be,\" Australia coach Andrew McDonald told reporters when asked about Cummins on Tuesday.\n\n\"He was well ahead of where we thought he'd be at and it did create a real live conversation for [Cummins playing in] Brisbane.\n\nVeteran duo Nathan Lyon (left) and Usman Khawaja (right) could both potentially earn recalls for Adelaide. (Getty Images: Robert Cianflone)\n\n\"It was debated a lot leading into that Test match. With that in mind, us seeing him further advanced, we feel he'll be really well placed for the challenges of Adelaide albeit [it's still] a long way off.\n\n\"We feel as though the simulation in the nets has got him skill ready. His body's ready to go. Barring anything else happening in the next week, I'd be expecting Pat to be tossing the coin and putting the blazer on.\"\n\nMcDonald also added that Australia is likely to name its \"best balanced and available attack\" for the Adelaide Test, opening the door for Nathan Lyon's return after being dropped for the second Test.\n\nLoading...\n\nLyon's potential return as well as Khawaja's likely availability represent massive selection headaches for the Australian camp in the next week.\n\nMcDonald indicated that Khawaja could potentially return to the side down the order following the success of the Travis Head-Jake Weatherald partnership at the top of the order.\n\n\"The assumption is that [Khawaja] can only open as well. He does have flexibility,\" he said.\n\n\"We like to think that all our batters have the flexibility to be able to perform anywhere in that order.\"",
    "source": "ABC",
    "cluster_id": 13
  },
  {
    "url": "https://www.abc.net.au/news/2025-12-10/sepak-takraw-sport-connects-karen-refugees-bendigo/106114240",
    "title": "Refugees keep sport of sepak takraw alive and kicking in Bendigo",
    "publish_date": "Tue, 09 Dec 2025 23:47:15 +0000",
    "category": "sports",
    "authors": [],
    "text": "The hollow tap of a plastic ball reverberates around a stadium on a typically sunny spring Saturday in central Victoria.\n\nTwo teams with three players each are darting around either side of what looks like a volleyball court.\n\nBut these players are not using their hands, instead kicking, flipping and using their heads to get the ball over the net.\n\nThe sport is similar to volleyball except players cannot use their hands. (ABC News: Anna McGuinness)\n\nAmong them is Nay Ta Gay Wah who learned to play sepak takraw in a Thai refugee camp when he was 12.\n\nThree decades later, in Bendigo, the sport is still a central part of his life.\n\n\"For health, for energy. Happy, you know,\" Mr Wah said.\n\nBendigo is now home to an estimated 4,000 Karen people, nearly 20 years since the first family settled in the city.\n\nAn ethnic group of South-East Asia, many Karen people have fled conflict and persecution in Myanmar by crossing the border into Thailand.\n\nAccording to the 2021 census, after English, the Karen language is the second most commonly spoken at home within the Bendigo region.\n\nPlayers travelled from across Victoria to play at the tournament in Bendigo. (ABC News: Anna McGuinness)\n\nThe Karen people are an ethnic group from Myanmar.\n\nEh Soo organised a sepak takraw tournament in late November which brought together about 50 players from across Victoria, mostly from the Karen and Karenni community.\n\n\"We want to maintain this traditional sport we love,\" Mr Soo said.\n\n\"In Australia it's hard to connect sometimes — maybe three or four times a year if we can do this sport.\n\n\"It's amazing for young adults to come together and connect.\"\n\nTha Htoo travelled from Melbourne to support his team and said it was good to see the new generation of players coming through.\n\n\"I think it's good for the next King's Cup. It would be a great opportunity,\" he said.\n\nThe King's Cup is the prestigious sepak takraw world championships held in Thailand.\n\nIn July this year, Mr Wah and Mr Soo were among those in green and gold representing Australia on the international stage, bringing home the runner-up trophy in the quad men's event.\n\nThe Australian team at the King's Cup Sepak Takraw World Championships in Thailand in July. (Facebook)\n\n\"[The sport] means a lot actually, personally to keep active, and my mental health as well,\" Mr Soo said.\n\n\" I would love to welcome the wider community to join in if they want to. Come say 'hi'. \"",
    "source": "ABC",
    "cluster_id": 14
  },
  {
    "url": "https://www.abc.net.au/news/2025-12-10/sa-prisons-remain-locked-down-indefinitely/106123454",
    "title": "SA prisons remain locked down indefinitely, as home detention officers step off job",
    "publish_date": "Tue, 09 Dec 2025 23:44:11 +0000",
    "category": "finance",
    "authors": [],
    "text": "Officers monitoring 1,500 offenders on home detention have joined industrial action in South Australia as the union representing correctional officers has voted to indefinitely continue a strike impacting seven prisons.\n\nThe Public Service Association union's general secretary in SA, Charlotte Watson, said correction officers voted unanimously to continue industrial action until a fair pay offer was received.\n\n\"This is unprecedented in this state, we have never seen a walk out of this kind,\" she said.\n\nMs Watson said officers who monitored the ankle bracelets of 1,500 people on home detention also voted to strike for 24 hours.\n\nCorrectional officers have been on strike since Monday morning, meaning prisoners are in lockdown. (ABC News: Will Hunter)\n\n\"This is an indefinite strike, we are seeing the justice system collapse,\" she said.\n\n\"The premier needs to come down here and fix this mess.\"\n\nHowever, government spokesperson Tom Koutsantonis said he had been reassured by the chief executive of correctional services that \"they have staff to maintain security over those detainees, and make sure they're monitored accurately\".\n\nMs Watson said sheriffs officers were also expected to join the strike, which would see the state's court system affected.\n\nThe union is seeking a 20 per cent pay rise over 18 months, a claim the government has ruled out.\n\n\"The union's claim ... is about 13.5 per cent a year, and no other public sector, as a general group have got that,\" Industrial Affairs Minister Kyam Maher said.\n\n\"Most people sitting at home will think that that is far too much for a government to absorb and to keep a balanced budget.\"\n\nMr Maher said the government would continue to negotiate in good faith.\n\nBut Ms Watson said the government's current offer of between 10.5 per cent and 12.5 per cent was not enough.\n\n\"These people have had enough, they are not safe in their workplaces, their pay is not adequate and we cannot continue the way we are,\" she said.\n\n\"Bargaining has been going for 15 months now, it is unacceptable, and we need an outcome.\"\n\nMs Watson says correctional officers will strike until a fair pay offer is made by the government. (ABC News: Will Hunter)\n\nThe head of South Australia's department of corrections said he was confident the state's prisons would be managed effectively.\n\nCorrections CEO David Brown told ABC Radio Adelaide senior leaders and support staff were working to deliver essential services to people confined to their cells.\n\nHe said the strike was affecting services to prisoners, but the department was experienced in operating under emergency conditions after the COVID-19 pandemic.\n\n\"We've got strong operational plans in place, we've got a lot of experience of running our institutions under emergency footings,\" he said.\n\n\"There's no doubt it has an impact on services to prisoners, but we have a good plan in place.\"",
    "source": "ABC",
    "cluster_id": 15
  },
  {
    "url": "https://www.abc.net.au/news/2025-12-10/tasmania-st-helens-stieglitz-bushfire-houses-destroyed/106123090",
    "title": "Houses destroyed as firefighters battle bushfire near St Helens",
    "publish_date": "Tue, 09 Dec 2025 22:41:57 +0000",
    "category": "finance",
    "authors": [],
    "text": "At least two properties have been lost and hundreds of residents displaced overnight as a bushfire burns near a beachside community on Tasmania's east coast.\n\nAuthorities are continuing to battle the blaze between Dianas Basin and Stieglitz, near St Helens, which was upgraded again to emergency level about 9:30am on Wednesday.\n\nIt was downgraded to a watch and act alert just after midday on Wednesday.\n\nThe bushfire lit up the night sky, as seen from St Helens. (Supplied: Paul Worsteling)\n\nResidents at Parkside, Parnella, Stieglitz and surrounds are urged to monitor conditions.\n\n\"The fire is travelling towards Dianas Basin, Flagstaff Hill and surrounds,\" the alert reads.\n\n\"The fire is expected to be difficult to control.\"\n\nThe fire started on Tuesday afternoon and quickly went to emergency level before being downgraded to watch and act overnight, before the danger escalated again on Wednesday morning.\n\nPeople in the affected areas are urged to stay updated with the latest advice at the TasAlerts website.\n\nABC listeners and viewers in the St Helens area are expected to experience disruptions to their local radio, digital TV and Radio National services owing to a loss of mains supply power.\n\nListeners are being advised to tune into the St Marys (102.7FM), Weldborough (97.3FM) or North East Tasmania Mt Barrow (91.7FM) transmitter outputs.\n\nNed Bramich's photo of the bushfire as seen at 9.43pm December 9, 2025. (Supplied: Ned Bramich)\n\nTasmania Fire Service incident controller Steve Richardson said firefighters had tried to save the two properties, which could be either residences or shacks.\n\n\"They were what we would say is undefendable,\" he said.\n\n\"They were surrounded by dense vegetation, the firefighters put up a valiant attempt to protect those properties, but in the end, it just became too dangerous for them to stay in place.\"\n\n\"There will be some minor structure losses like outbuilding sheds, some water tanks … some caravans were lost in the Diana's Basin area.\"\n\nMr Richardson said the key priorities on Wednesday will be in Stieglitz behind Perin Street, where the fire is close to properties, and keeping the edge east of the Tasman Highway.\n\n\"We are expecting some fairly erratic winds today that could put pressure on the Tasman Highway,\" he said.\n\n\"Knowing the difficulties that we would face if it crosses and gets into that area where the mountain bike tracks are, and that steep rugged terrain that's beyond, that would be problematic.\"\n\nAbout 30 firefighters from the north worked on the fire into the night, using 28 firefighting trucks, three aircraft and two heavy machines, trying to bring it under control.\n\nThe bushfire quickly rose to emergency level on Tuesday before being downgraded late in the night. (ABC News: Luke Bowden)\n\nEvacuation centre busy overnight\n\nRunning off barely two hours' sleep, Break O'Day Mayor Mick Tucker said it had been a busy night at the evacuation centre at the Break O'Day Community Stadium.\n\nBushfire threat for Tasmanian coastal communities in north-east On the same day that residents in one Tasmanian community are returning to find if their homes are still standing after a bushfire last week, residents in north-east coastal towns are being threatened by a new out-of-control blaze.\n\n\"It would be fair to say that we've had a few 100 people through the door,\" he said.\n\n\"A lot of people stayed overnight, and the Navy Cadets alongside opened up, and they've got people sleeping in there in their accommodation.\n\n\"We had people who stayed on the boat ramp at Stieglitz last night as the last port of call.\n\n\" It's been amazing the amount of goodwill being shown by people throughout our community, offering their house, their AirBnBs, any accommodation available has been offered... we potentially will need the same, if not more again tonight if the road is closed. \"\n\n\"And we've been able to put a lot of our elderly and most vulnerable people into some good accommodation overnight, so that's been an absolute blessing in disguise.\"\n\nFor local alerts and advice on what to do before, during and after a bushfire, check ABC Emergency and listen to ABC Radio.\n\nTasNetworks says more than 800 people have been left without power. (ABC News: Luke Bowden)\n\nMr Tucker said the centre would stay open today, and the council would put on a barbecue for volunteers and people displaced.\n\nWeather conditions on Wednesday are expected to be more favourable for firefighting. (ABC News: Luke Bowden)\n\nThe cause of the fires at Dianas Basin and Dolphin Sands are under investigation. (ABC News: Luke Bowden)\n\nFresh fire crews to join fight\n\nOn Wednesday, additional fire crews from the south are joining the effort.\n\n\"We've also taken the opportunity to reallocate resources from around the state, especially now they've finished at Dolphin Sands, and are reaching out for additional helicopters to come in from the mainland, including a Black Hawk,\" Mr Richardson said.\n\n\"We're hopeful that that will arrive today as well because that has a very large capacity for water drops.\"\n\nThe bushfire near St Helens seen from space on Tuesday afternoon. (Supplied: NASA/MODIS)\n\nMr Richardson said he expected another challenging day ahead and said crews would be staggered.\n\n\"But we need to bring others in later in the day so they can work through till late tonight, because otherwise it's just too long a day and then fatigue sets in and it's unsafe for our firefighters,\" he said.\n\nOnly days ago, 19 homes were destroyed in a fire further down the coast at Dolphin Sands — the most lost since the 2013 Dunalley blaze.\n\nHundreds without power, powerlines damaged\n\nTasNetworks said more than 800 people have been left without power in the area around Stieglitz.\n\n\"At this stage, safely accessing our assets to assess any damage has been the issue,\" TasNetworks spokesperson Aaron Vlahov said.\n\n\"We'll be working very closely with Tasmania Fire Service to get safe access as soon as possible, only then can we fully assess the situation and get an estimate of time for restoration for power.\"",
    "source": "ABC",
    "cluster_id": 16
  },
  {
    "url": "https://www.abc.net.au/news/2025-12-10/tottenham-moves-rainbow-flag-for-sparta-prague-football-game/106123418",
    "title": "Spurs under fire after moving rainbow flag for Champions League clash",
    "publish_date": "Tue, 09 Dec 2025 22:24:52 +0000",
    "category": "sports",
    "authors": [],
    "text": "A rainbow flag showing support for the LGBTQIA+ community was moved to a new location inside Tottenham's stadium ahead of the club's Champions League match against Slavia Prague following a request from the Czech team, according to Spurs.\n\nThe Progress Pride flag is constantly displayed in the north-east corner of Tottenham Hotspur Stadium, close to the area of the ground which hosts away fans.\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\nFor the match against Slavia, which Spurs won 3-0 thanks to an own goal from David Zima and penalties from Mohammed Kudus and Xavi Simons, the flag was situated in the south-west corner of the stadium.\n\n\"The flag has been relocated at the request of the visiting team to UEFA on security grounds,\" Tottenham said prior to the match.\n\nThe decision was criticised by Proud Lilywhites, Tottenham's official LGBTQI+ supporters' group, which said Slavia \"raised concerns that some of their supporters may damage the flag and cause disorder if it remains in its usual location\".\n\n\"Let's be honest about what this means,\" the group said. \"The risk here isn't the flag. It's the reaction of a small number of opposition supporters.\n\n\"That's disappointing, and it's another reminder of the hostility LGBTQI+ fans still face across European football.\"\n\nTottenham reportedly sought to keep the flag in its original place but reluctantly accepted it should move due to safety grounds.\n\nAP",
    "source": "ABC",
    "cluster_id": 17
  },
  {
    "url": "https://www.abc.net.au/news/2025-12-10/nfl-indianapolis-colts-set-to-sign-philip-rivers-as-quarterback/106123424",
    "title": "NFL team turns to retired grandfather to play quarterback due to injury crisis",
    "publish_date": "Tue, 09 Dec 2025 22:21:53 +0000",
    "category": "sports",
    "authors": [],
    "text": "The Indianapolis Colts have bolstered their injury-depleted quarterback corps by bringing 44-year-old Philip Rivers out of retirement and signing him to the practice squad, a person with knowledge of the deal has told The Associated Press.\n\nThe person spoke to the AP on condition of anonymity because the team had not yet made an official announcement.\n\nThe move came less than 24 hours after Colts coach Shane Steichen confirmed Indy's starter, Daniel Jones, would miss the rest of this season after tearing his right Achilles tendon, and backup Riley Leonard injured his right knee during the weekend's loss at Jacksonville.\n\nThe Colts' number one quarterback, Daniel Jones, leaves the field on the weekend after tearing his Achilles. (Getty Images: Logan Bowles)\n\nRivers — who has 10 children and recently became a grandfather — has not taken a snap since finishing his career with a playoff loss following the Colts 2020 season. That was the last time the Colts (8-5) made the post-season.\n\nThe eight-time Pro Bowler announced his retirement in January 2021 and has been coaching St Michael High School in Fairhope, Alabama, ever since.\n\nBut it is not clear how long it will take Rivers to learn Indy's playbook — or work his way into game shape — as the reeling Colts try to snap a three-game losing streak next weekend at Seattle (10-3).\n\n\"Things happen. Wacky stuff has happened in this league. Your depth gets tested, your resolve gets tested as you get thrown into some adversity as a unit, as a coaching staff, as a position group,\" offensive coordinator Jim Bob Cooter said, declining to take specific questions about Rivers.\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\n\"We've been through some fire out there, but our coaching staff's excited to draw a plan up and teach it.\"\n\nRivers rejoins a team desperately trying to rebound from its worst stretch of the season, four losses in five games. Indy has fallen out of the race for the AFC's top seed and is tied for second in the AFC South with Houston (8-5), one game behind division leader Jacksonville (9-4).\n\nRivers ranked among the NFL's career leaders in yards passing with 63,440, 421 touchdown passes, and 12 4,000-yard seasons when he retired.\n\nThe ABC of SPORT Sports content to make you think... or allow you not to. A newsletter delivered each Saturday.\n\nAP",
    "source": "ABC",
    "cluster_id": 18
  },
  {
    "url": "https://www.abc.net.au/news/2025-12-10/social-ban-experts-blog-media-under-16/106118846",
    "title": "Live: Our experts take your questions on the social media ban",
    "publish_date": "Tue, 09 Dec 2025 22:08:46 +0000",
    "category": "finance",
    "authors": [
      "Georgie Hewson",
      "Lisa Given",
      "Michael Dezuanni",
      "Heloise Vyas",
      "Lewis Wiseman"
    ],
    "text": "Yes, there are several workarounds that children may use to keep their accounts.\n\nThey may use Virtual Private Networks (VPNs) to pretend that they are in other countries.\n\nThey may try to alter their appearance to try to trick facial scanning age estimation.\n\nOr, they may have a sibling, parent, or another person over 16 do the facial scan for them, to get past the age checks.\n\nThe government has asked technology companies to take \"reasonable steps\" to stop children under 16 from creating and holding accounts, but acknowledges that some young people will slip through these controls.\n\nChildren may also start using other social media (like Lemon8, Yope, Rednote, and Coverstar) that are not on the current list of restricted platforms.\n\nThe eSafety Commissioner has already reached out to some companies, asking them to conduct a self-assessment, and to enact restrictions if they fall under the legislation. Over time, more platforms will be added to the restricted list, so more and more companies will need to comply or face significant fines.",
    "source": "ABC",
    "cluster_id": 19
  },
  {
    "url": "https://www.abc.net.au/news/2025-12-10/tas-gift-registry-for-politicians-published/106119614",
    "title": "Tasmanian ministers access $45,000 in free NBL and AFL tickets",
    "publish_date": "Tue, 09 Dec 2025 22:07:12 +0000",
    "category": "sports",
    "authors": [],
    "text": "Tasmanian government ministers have accessed more than $21,000 worth of free tickets to Tasmania JackJumpers games in the past 12 months, available as part of an agreement with the basketball club.\n\nThe details were included in parliament's annual gifts register, which also showed ministers had received more than $24,000 in function and match tickets from the Hawthorn Football Club for games in Tasmania.\n\nThe Tasmanian government provides the JackJumpers with $2 million per year as part of a two-year agreement, and Hawthorn with about $4.5 million per year for four annual matches.\n\nThe JackJumpers defeated Melbourne United to win the 2024 NBL finals series. (AAP: James Ross)\n\nThe original agreement with the JackJumpers gives the government access to 20 general admission tickets and up to 10 corporate hospitality packages per home game.\n\nThe register shows various ministers received free corporate box tickets for six consecutive matches covering the end of last season and start of this season, accessing 36 tickets valued at about $365 each.\n\nSpirit of Tasmania operator TT-Line also gifted Transport Minister Kerry Vincent two tickets for the first game valued at $480 each; he is one of TT-Line's two shareholder ministers, and the state-owned TT-Line sponsors the JackJumpers.\n\nAn integrity expert believes the inclusion of free tickets in a government sponsorship agreement is something that should be avoided. (Facebook: Tasmania JackJumpers)\n\nMinisters who accessed free corporate tickets in the 12 months include Premier Jeremy Rockliff and Sport Minister Nick Duigan, along with Roger Jaensch, Jo Palmer, Jane Howlett and Felix Ellis.\n\nIt was an increase on the previous 12 months, when ministers accessed $15,406 in free JackJumpers tickets.\n\nCentre for Public Integrity director Geoffrey Watson SC said the ability of ministers to access free tickets in this way was \"really odd\".\n\n\"I've never heard of it before,\" he said.\n\n\" I don't like the idea, I think the allocation of funding to sporting clubs should be able to stand or fall on its own. \"\n\nFree tickets used to 'promote Tasmania'\n\nThe government previously provided $15 million for the construction of a high-performance centre for the JackJumpers, and in 2022 a $250,000 undisclosed election promise resulted in sustained political scrutiny over the potential for conflicts of interest.\n\nIn February, the JackJumpers were sold to Queensland-based asset manager Altor Capital.\n\nTasmanian government ministers have accessed more than $21,000 worth of free tickets to Tasmania JackJumpers games in the past 12 months. (Facebook: Tasmania JackJumpers)\n\nA government spokesperson said the attendances at the matches and other events served a purpose.\n\n\"The premier and ministers attend such events to promote Tasmania to a wide range of stakeholders and have discussions accordingly,\" the spokesperson said.\n\nGovernment ministers were not the only ones in receipt of free JackJumpers tickets.\n\nLabor leader Josh Willie received three courtside tickets from the club and two corporate tickets from Tassal, while Labor upper house MLC Luke Edmunds also received two corporate tickets from the JackJumpers.\n\nRange of other tickets also gifted\n\nIn January, the government announced the extension of its deal with Hawthorn until the end of the 2027 season, at a cost of $9.1 million.\n\nThe gifts register shows that four ministers — including Mr Rockliff — were gifted tickets to the Hawthorn president's function at York Park in Launceston for the March 29 match against the GWS Giants.\n\nThe ministers disclosed 17 gifted tickets for the function, which Hawthorn describes as offering \"gourmet food, drinks, entertainment, and networking with club officials\" with \"reserved seating and exclusive access\".\n\nThey also received a combined 27 free tickets for two presidents' functions in June.\n\nIt was among a range of tickets declared by ministers for the 12 months to November.\n\nConsultancy firm PinPoint Tasmania provided 21 VIP tickets to ministers for the Taste of Summer festival, valued at $95 each; the event received $7.7 million in government funding through to 2026.\n\nMr Rockliff declared five VIP tickets to Party in the Paddock, valued at $473, as a gift from event production company Vibestown.\n\nMr Duigan — the sports minister — received 10 corporate tickets to the V8 Supercars at Symmons Plains, totalling $6,250 in tickets.\n\nTabcorp gifted Mr Rockliff a $1,400 ticket to the TAB Everest raceday in Sydney on October 18.\n\nLabor leader Josh Willie and Labor upper house MLC Luke Edmunds also received tickets from the JackJumpers. (Facebook: Tasmania JackJumpers)\n\nWhen asked if Mr Rockliff paid for flights, a government spokesperson responded that the trip to Sydney included official business.\n\n\"The premier's official trip to Sydney included important government business and meetings, including with Minister for Industry and Innovation, Tim Ayres, a tour of Allianz Stadium, Everest Day 2025, and a briefing and site visit about the highly successful and transformative Barangaroo development,\" the spokesperson said.\n\nTabcorp's chief executive officer is Gillon McLachlan, who signed the deal for Tasmania to enter the AFL when he was chief executive officer of the AFL.",
    "source": "ABC",
    "cluster_id": 20
  },
  {
    "url": "https://www.abc.net.au/news/2025-12-10/complaint-filed-to-fifa-over-peace-prize-awarded-to-donald-trump/106123358",
    "title": "Complaint filed over FIFA's 'egregious abuse of power' with Trump award",
    "publish_date": "Tue, 09 Dec 2025 22:02:53 +0000",
    "category": "sports",
    "authors": [],
    "text": "FIFA president Gianni Infantino's public support for Donald Trump and a peace prize awarded to the US president are the subjects of formal complaints to the global soccer body's ethics investigators.\n\nFairSquare, a London-based human rights nonprofit, said on Tuesday it filed requests for investigations into Infantino's alleged breaches of FIFA's statutory duty to be politically neutral.\n\nFIFA said its ethics committee did not comment on potential ongoing cases, and could not confirm receiving the complaint.\n\nFIFA's ethics code calls for a ban from soccer of up to two years for violating the duty of neutrality, though it is unclear if the case will be taken up.\n\nInfantino and Trump take a selfie together during the World Cup draw last week. (Getty Images: Emilee Chinn)\n\nThe FIFA-appointed current ethics investigators and judges are seen by some observers to operate with less independence than their predecessors a decade ago when then-president Sepp Blatter was removed from office.\n\nInfantino has expressed views this year backing Trump and his policies, including suggesting the US president deserved to get the Nobel Peace Prize, which he did not win.\n\nThe FIFA leader also has closely aligned soccer with the United States government ahead of the men's 2026 World Cup being co-hosted with Canada and Mexico. The tournament should earn more than $US10 billion for FIFA.\n\nPolitical leaders of all three co-hosts joined Infantino on stage to begin the World Cup tournament draw last Friday in Washington after Trump got the inaugural FIFA Peace Prize.\n\nTrump says he has real Club World Cup trophy US President Donald Trump says the Club World Cup trophy remains in the Oval Office despite Chelsea winning the competition over the weekend.\n\n\"The award of a prize of this nature to a sitting political leader is in and of itself a clear breach of FIFA's duty of neutrality,\" FairSquare said in an eight-page complaint.\n\nFIFA has not specified how Infantino created the peace prize last month, though people familiar with the process in private conversations said they learned about it through media reports.\n\n\"If Mr Infantino acted unilaterally and without any statutory authority this should be considered an egregious abuse of power,\" FairSquare said.\n\nFairSquare has previously challenged FIFA over the human rights record of Saudi Arabia, the 2034 World Cup host; the influence of the kingdom's oil company Aramco which is a highest-tier World Cup sponsor; FIFA governance standards; and FIFA's slow-moving investigation into possible statutes breaches relating to teams from Israeli settlements playing in the national soccer league.\n\nThe ABC of SPORT Sports content to make you think... or allow you not to. A newsletter delivered each Saturday.\n\nAP",
    "source": "ABC",
    "cluster_id": 21
  },
  {
    "url": "https://www.abc.net.au/news/2025-12-10/how-cannabis-companies-exploit-australias-legal-loopholes/106074556",
    "title": "How medicinal cannabis clinics target vulnerable Australians",
    "publish_date": "Tue, 09 Dec 2025 21:44:32 +0000",
    "category": "finance",
    "authors": [],
    "text": "Hannah Wilson says it was shockingly easy to obtain a medicinal cannabis prescription, despite her history of schizophrenic psychosis.\n\nIn her late teens, Ms Wilson asked her doctor for a medicinal cannabis prescription to help manage her depression and anxiety.\n\nMs Wilson said her doctor wrote her prescription with very few questions asked, and no questions around her experiences with psychosis and alcohol addiction.\n\nThe now 23-year-old said she decided to quit medicinal cannabis after a few doses, but had been bombarded with online advertisements ever since.\n\n\"It's just in your face,\" Ms Wilson said.\n\n\"I haven't interacted with any drug, alcohol, cannabis content, but it still comes up all the time on Instagram and it's frustrating.\"\n\nMs Wilson said medicinal cannabis could be beneficial in some cases for those with a genuine medical need.\n\nHowever, she said she was concerned how these advertisements targeted at-risk people like her who were attempting to stay substance-free.\n\nCarmen Lim says these businesses are profiting from vulnerable young people. (ABC Radio Brisbane: Kenji Sato)\n\nExploiting a legal loophole\n\nIt is illegal to advertise medicinal cannabis products in Australia, but University of Queensland biostatistician Carmen Lim says the practice is rife and growing rapidly.\n\nThe public health researcher said Australian clinics were using increasingly aggressive marketing tactics to target vulnerable young people like Ms Wilson.\n\nShe said this included using targeted social media ads, memes, Black Friday sales and online competitions and giveaways designed for young audiences.\n\nDr Lim said the companies used demographic data and third-party cookies to target their advertisements.\n\nDr Lim said the clinics used cryptic language and abstracted representations of cannabis leaves in an attempt to circumvent advertising laws.\n\nShe said these advertisements were becoming more brazen and more numerous, with Australia's regulators struggling to keep up.\n\nDr Lim said some advertisements skirted a legal grey area, while others were unambiguously illegal.\n\n\"The cannabis industry is super lucrative, so it doesn't make sense to fine them a few thousand dollars and let them get away with it,\" Dr Lim said.\n\n\" I think we should find a way to take them down, because more young people are being affected. \"\n\nDr Lim said medicinal cannabis was justified in some instances, but she was concerned prescriptions were largely being issued without a valid medical reason.\n\nShe said this was of particular concern when clinics advertised \"discrete\" and \"no awkward questions\" services.\n\nDr Lim said this could signal to customers that the clinic was willing to issue prescriptions with few questions asked, based on self-diagnosis of symptoms.\n\nA Therapeutic Goods Administration spokesperson said reports of unlawful advertising were subject to robust assessment and investigation.\n\n\"Advertisements for therapeutic goods must comply with the requirements in the Therapeutic Goods Act 1989,\" the spokesperson said.\n\n\"Suspected breaches of advertising requirements can be reported via the TGA's online portal.\"",
    "source": "ABC",
    "cluster_id": 22
  },
  {
    "url": "https://www.smh.com.au/politics/federal/australia-social-media-ban-live-updates-children-under-16-barred-from-social-media-apps-as-world-first-legislation-takes-effect-20251209-p5nm5i.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Australia social media ban LIVE updates: PM lauds decision as children under 16 barred from social media in world-first; Wells says more than 200,000 TikTok accounts deactivated",
    "publish_date": "Wed, 10 Dec 2025 13:03:50 +1100",
    "category": "finance",
    "authors": [
      "Brittany Busch",
      "Bronte Gossling"
    ],
    "text": "It was May 2024 when Nova 96.9 host Michael ‘Wippa’ Wipfli launched 36 Months with Rob Galluzzo, founder of production company Finch.\n\nThe campaign was named for the 36 months between ages 13 to 16, which researchers say is a critical phase of psychological development for children.\n\nMichael ‘Wippa’ Wipfli at a press conference in Canberra in November, when the law passed. Credit: Alex Ellinghausen\n\n“Imagine a product, let’s say a shampoo, which, when used by children, caused half of them to become depressed, to self-harm, to develop an eating disorder, or to become suicidal,” Wipfli wrote for this masthead in June 2024.\n\n“It would be ripped from the shelves, the owners locked away with blood on their hands. I wish I could say I’m exaggerating, but the harsh reality is that children under 16 are not yet ready to navigate social media safely.”\n\nThe federal government then announced in September 2024 that it planned to limit teens’ use of platforms such as Instagram, TikTok and Facebook. In November 2024, Prime Minister Anthony Albanese confirmed children under 16 would be banned from social media, and the Online Safety Amendment (Social Media Minimum Age) Act 2024 was given royal assent on December 10, 2024, exactly a year before its implementation.\n\nLoading\n\n“Today, December 10, 2025, is now marked in history as the day the law changed after the Australian government chose the wellbeing of teenagers first,” Wipfli said today to applause and cheers in a press conference at Kirribilli House in Sydney.\n\n“It’s an important day. They chose to put the wellbeing of Australian families first, and the Australian government has shown the world that it’s OK to say to big tech, ‘Stop, this isn’t working, and we can do better for our kids.’\n\n“We led a campaign with one simple aim: to delay the age kids could become a citizen of a social media platform from 13 to 16. Just 36 months. That’s all we wanted. A chance for kids to get to know themselves before the world does.”",
    "source": "SMH",
    "cluster_id": 23
  },
  {
    "url": "https://www.smh.com.au/business/companies/locksley-lights-up-new-rare-earths-trend-in-california-20251210-p5nmii.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Locksley lights up new rare earths trend in California",
    "publish_date": "Wed, 10 Dec 2025 12:58:25 +1100",
    "category": "finance",
    "authors": [
      "James Pearson"
    ],
    "text": "Locksley Resources has deployed ultra-high-resolution geophysics at its Mojave project in California to uncover a brand new rare earths trend just metres from its El Campo prospect.\n\nFlying at just 35 metres above ground with ultra-tight 40-metre line spacing, the heli-survey has peeled back decades of low-resolution legacy data to reveal a much crisper geological picture.\n\nLocksley Resources’ new geophysical survey has unearthed a parallel thorium trend to its El Campo rare earths project and next to MP Materials’ massive Mountain Pass mine.\n\nAt the heart of the story is the discovery of two thorium anomalies within Locksley’s claims. The first is a well-defined target in the company’s Northern blocks, marked by distinctive weathering that follows local drainage. It also lines up with a broad, diffuse magnetic response, potentially pointing to altered rocks or changes in lithology.\n\nHowever, it’s the second anomalous thorium zone that has raised more than a few eyebrows. This fresh target appears to sit just 700 metres to the east and parallel to Locksley’s existing high-grade El Campo prospect. Parallel systems can often multiply project scale quickly if the geology stacks up.",
    "source": "SMH",
    "cluster_id": 24
  },
  {
    "url": "https://www.smh.com.au/traveller/travel-news/nikon-comedy-wildlife-winners-2025-20251210-p5nmhs.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Nikon Comedy Wildlife Winners 2025",
    "publish_date": "Wed, 10 Dec 2025 12:47:57 +1100",
    "category": "finance",
    "authors": [
      "Katherine Scott"
    ],
    "text": "Remove items from your saved list to add more.\n\nYou have reached your maximum number of saved items.\n\nSave this gallery for later\n\nAdd galleries to your saved list and come back to them anytime.\n\nGot it",
    "source": "SMH",
    "cluster_id": 25
  },
  {
    "url": "https://www.smh.com.au/sport/soccer/foster-happy-with-socceroos-draw-20251210-p5nmi9.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Foster happy with Socceroos draw",
    "publish_date": "Wed, 10 Dec 2025 12:45:59 +1100",
    "category": "sports",
    "authors": [],
    "text": "Foster happy with Socceroos draw\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 26
  },
  {
    "url": "https://www.smh.com.au/goodfood/melbourne-eating-out/kick-off-summer-finally-at-one-of-these-12-hot-new-melbourne-bars-20251201-p5njv9.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Kick off summer (finally!) at one of these 12 hot new Melbourne bars",
    "publish_date": "Wed, 10 Dec 2025 12:42:15 +1100",
    "category": "finance",
    "authors": [
      "Emma Breheny"
    ],
    "text": "Collection\n\nKick off summer (finally!) at one of these 12 hot new Melbourne bars\n\nSpring was MIA but summer is officially here. Celebrate with a mango and sake cocktail on a resurrected city rooftop, $15 martinis that come with a loyalty card, and fried goat’s cheese at a St Kilda newcomer built for group hangs.",
    "source": "SMH",
    "cluster_id": 27
  },
  {
    "url": "https://www.smh.com.au/politics/federal/a-profound-reform-pm-20251210-p5nmi3.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "A profound reform: PM",
    "publish_date": "Wed, 10 Dec 2025 12:37:38 +1100",
    "category": "finance",
    "authors": [],
    "text": "A profound reform: PM\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 28
  },
  {
    "url": "https://www.smh.com.au/culture/live-reviews/melbourne-review-wrap-perfume-genius-20251204-p5nl1d.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "It was a moody start for this Euphoria star’s Melbourne gig",
    "publish_date": "Wed, 10 Dec 2025 12:17:11 +1100",
    "category": "entertainment",
    "authors": [
      "Vyshnavee Wijekumar",
      "Nadia Bailey",
      "Thuy On",
      "Jessica Nicholas"
    ],
    "text": "MUSIC\n\nPerfume Genius ★★★★★\n\nForum Melbourne, December 4 Mike Hadreas, better known as Perfume Genius, has a chameleon’s voice, switching deftly from shimmering falsetto to an otherworldly, wavering register that seems to emanate from deep within his body. It’s a voice that’s at turns full of yearning and subtly rendered emotion or dripping with swagger and sensuality. Perfume Genius (left) performs with Aldous Harding at the Forum Melbourne on December 4. Credit: Richard Clifford All this was on full display at the Forum, where Hadreas, who has forged a career making mesmerising, impressionistic music for the queer and queer-adjacent, arrives on stage like a postmodern Saint Sebastian, ready to martyr himself to art. The tour comes off the back of his recently released seventh studio album, Glory, a work that puts his soul-baring lyrics in dialogue with layers of richly textured, cinematic instrumentation. Glory was largely written during lockdown and is a product of the uncertainty of those times: its animating themes are grief, anxiety, isolation. Despite this, it is not a depressing record, but rather something transcendent.\n\nThe show puts Hadreas’ range on display, as he moves effortlessly from the propulsive, emotionally charged suffering of In a Row to the plaintive and tender piano ballad Me & Angel. One of the most arresting moments arrives early when, in a world debut, Hadreas invites New Zealand’s Aldous Harding on stage to perform No Front Teeth. Already an album stand-out, the duet takes on new emotional resonance in this live performance, as Harding’s gossamer vocals soar to the Forum’s highest reaches and the song builds to a flaring, guitar-heavy climax. It is a rare treat for the audience and something unlikely to be repeated any time soon. Perfume Genius is a bodily performer. Credit: Richard Clifford Elsewhere, Hadreas pulls crowd-pleasing hits from the Perfume Genius back catalogue, from the deliciously camp Slip Away to the eminently danceable On the Floor (its potential goes sadly unfulfilled as Melbourne audiences simply do not dance). Otherside delivers another show highlight, as Hadreas makes inventive use of silence and negative space before unleashing beautiful aural chaos. The encore comprises two covers – Big Star’s Kangaroo and Mazzy Star’s Fade into You – before the show closes with the exhilarating and defiant celebration of queer selfhood, Queen. Hadreas is a bodily performer, contorting his limbs and executing gravity-defying back bends as he sings, though these objectively quite taxing moves seem to come to him as easily as breathing. He has a dancer’s grace and a showman’s unerring self-confidence. Yet you get the sense that everything he does on stage is for himself first: the audience is merely there as witness.\n\nReviewed by Nadia Bailey\n\nMUSIC\n\nMelbourne Women’s International Jazz Festival\n\nAshling O’Farrell / Virago with Flora Carbo ★★★★\n\nThe Jazzlab, December 7 Sonja Horbelt must be some kind of conjuror. The program for this year’s Melbourne Women’s International Jazz Festival – which Horbelt has directed for many years – is particularly impressive, with numerous acts from overseas and interstate, plus several premieres and special collaborations. Flora Carbo with Virago. Yet the budget for the 2025 festival is actually smaller than the (already slim) budget for last year’s event. Somehow, Horbelt has juggled funding sources, artist schedules and well-timed visits by expat musicians to assemble a genuinely enticing line-up. Sunday’s double bill began with an engaging set by 21-year-old trombonist and vocalist Ashling O’Farrell, the VCA’s “New Horizons” artist for 2025. O’Farrell’s tone on both trombone and vocals was suffused with an appealing warmth, augmented by the sensitive accompaniment of her rhythm section.\n\nThen came the unveiling of a newly commissioned work that was years in the planning, but which came together in less than a fortnight. Local saxophonist and composer Flora Carbo met American percussionist Sofia Carbonara in 2019, and – after Carbonara moved to Melbourne – the pair began dreaming of a full-length collaboration. That dream came to fruition last month, when Carbonara’s US-based Virago quartet flew to Australia to develop and rehearse a work written for them by Carbo, to be premiered at the festival. Loading Combining intricately notated parts with passages of free-form spontaneity, the as-yet-untitled piece made the most of the group’s unusual instrumentation: two alto saxophones, violin, cello and vibraphone. The suite opened with quivering harmonics from Carbonara’s vibraphone, beckoning the other instruments to join them and coalesce into a single, trembling note. Gradually the players began to diverge, creating a mournful dissonance as Magnolia Rohrer’s violin and Wesley Hornpetrie’s cello slid away from BethAnne Kunert’s sax, and Carbo’s mini drum machine added a subtle, syncopated heartbeat. In other sections, minimalist repetition created pulsating waves where saxes, strings and vibes moved in deft interlocking patterns, before dissolving in a swirl of improvised abstraction or settling into a glade of delicate, folk-like serenity. At times challenging, at times strikingly beautiful, this was the kind of ambitious and compelling work that festivals are made for.\n\nReviewed by Jessica Nicholas\n\nMUSIC\n\nNoël! Noël! ★★★★\n\nAustralian Brandenburg Orchestra, Melbourne Recital Centre, December 6 Brimming with festive cheer, this year’s edition of the Australian Brandenburg Orchestra’s Christmas offering took on a Spanish flavour. This musical accent honoured Tommie Andersson, the orchestra’s foundation theorbo and baroque guitar principal, who is making his final appearances with the ABO this tour after delighting audiences for nearly 40 years. This year’s edition of the Australian Brandenburg Orchestra’s Christmas offering took on a Spanish flavour. Credit: Laura Manariti Under the irrepressibly energetic direction of Paul Dyer, the orchestra and Brandenburg Choir were joined by guests Argentinian mezzo-soprano Maria Eugenia Nieva and Australian classical guitarist Andrew Blanch. Wearing a full-length bright red dress with a side slit, Nieva exuded plenty of Latin sensuality. Her strong, dark-chocolate mezzo voice animated a variety of numbers from the traditional carol Riú Riú Chiú, through Gioia & Amore by Spanish renaissance composer Soto de Langa and Nana from Six Popular Spanish Songs by Manuel de Falla to Santa la noche, an arrangement of Adolphe Adam’s beloved classic O Holy Night.\n\nBlanch, who featured prominently in the program, was especially brilliant in Albéniz’s Leyenda, arranged to showcase the simmering passion of the guitar’s rapid-fire flamenco technique. Once again, the Brandenburg Choir brought sheer delight to the choral aspect of Noël! Noël! with crisp ensemble work and crystalline diction. Between the customary bookends, Hark! The Herald Angels Sing, and O Come, All ye Faithful, came some English schmaltz courtesy of John Rutter and Philip Stopford, as well as an intense account of the Kyrie from Palestrina’s Missa Papae Marcelli. In chamber formation, the Brandenburgs themselves were in top form, bringing joyous dynamism to Monn’s Sinfonia in G and whimsy to an arrangement of God Rest ye Merry, Gentlemen. Andersson’s own solos and his poignant accompaniment of Stille Nacht (Silent Night) with its original Austrian lilt mirrored his quiet but impressive dedication. Noël! Noël! continues to be a distinctive but deservedly popular Christmas tradition.\n\nReviewed by Tony Way\n\nMUSIC\n\nParcels: LOVED Tour ★★★★\n\nSidney Myer Music Bowl, December 4 I dare you to stand still at a Parcels show. From the minute they hit the stage, the band’s blend of electro-pop and disco-pop rhythms has the crowd possessed, grooving along to the psychedelic funky beat. The Australian five-piece indie band formed in Byron Bay in 2014, and made the spontaneous move to Berlin that year. They have played some high-profile gigs in 2025, including Coachella and Glastonbury. This weekend, their national tour concludes in Sydney with two gigs on the steps of the Opera House. It’s hard to stand still at a Parcels show. Credit: Martin Philbey The band experiments with many different sounds across the set. Opening with Tobeloved, they show off their signature harmonies, reminiscent of The Beach Boys. It’s clear how Berlin club culture has influenced their music when they perform Gamesofluck, the stage lit with an electric blue as the keys and guitar pulse. They performed Overnight, a single co-produced and co-written with Daft Punk after they attended Parcels’ first-ever show in Paris in 2016; the duo’s electronic influence is evident in the live sound.\n\nFinallyover, their final song, has a much more mellow, retro rock feel like The Beatles. They perform a lengthy instrumental track which feels improvised, exerting riffs that resemble the disco energy of Boney M and AC/DC’s Thunderstruck. Parcels in full flight. Credit: Martin Philbey “I know we are a lot of people, but we move as one tonight,” says one of the band, indistinguishable in the moody lighting, and that collective feeling carries through, maintaining a chill vibe across the entire set. During Summerinlove, the crowd leans into the sexiness, with footage of couples kissing in the front row projected onto a heart-shaped kiss cam on the screen above. It’s clear the band are having just as much fun as the crowd. Patrick Hetherington’s foot pounds the stage as Jules Crommelin’s hips thrust against his guitar and Noah Hill’s neck jerks back and forth like a chicken. The band seemed to have as much fun as their energetic audience. Credit: Martin Philbey\n\nThere’s a sense of euphoria that fills the atmosphere at the all-ages concert. Like a rave, the infectious beats travel through your ears and all the way to your feet. The band asks tech staff to light up the crowd, as they peer into the masses extending up the theatre and across the green of the Sidney Myer Music Bowl. As Crommelin perches at the end of the stage, he says: “Just going to take a second to take this all in.” What a start to the summer.\n\nReviewed by Vyshnavee Wijekumar THEATRE\n\nSoul of Possum ★★★\n\nfortyfivedownstairs, until December 13 A few months ago, after nearly 10 years of consultation, parliament passed Treaty legislation for Aboriginal Victorians. It’s the first treaty of its kind in Australia and one that not only acknowledges past injustices but also commits to returning decision-making powers to Aboriginal communities. Presented within this context, this latest staging of Soul of Possum serves as a potent and topical reminder of the past that still needs present-day reckoning. Soul of Possum is based on the experiences of the playwright’s ancestors. Credit: Darren Gill\n\nBased on the personal histories of playwright Brodie Murray’s ancestors (in particular his father and grandfather), the play is a taut reenactment of an altercation between colonial soldiers and members of an Indigenous population on the Murray River in Swan Hill. With a few cast changes, Soul of Possum’s latest iteration follows a successful season at Castlemaine State Festival and Yirramboi Festival in 2021. It’s 1853 in Wamba Wamba Country and Marnuu (Balla Neba) is troubled by his dreams; the voice of Possum predicts wide-scale destruction by a hostile force, a devastation of both people and wildlife. But his fellow warriors Gundi (Wimiya Woodley) and Barru (Murray) are sceptical and mock his warnings. Meanwhile, there’s a steamboat moored at the river, with a military expedition about to disembark to open up the country for “glorious empire”. It’s a story most of us should know; this first-contact skirmish between two parties who are completely alien to the other’s customs and cultures, and the resulting and continuing legacy of settler occupation. The play asks us to imagine what it was actually like in the initial round of invasion and resistance, a pattern that would repeat itself across the land. The play is a taut reenactment of an altercation between colonial soldiers and the Indigenous population on the Murray River in Swan Hill. Credit: Darren Gill\n\nThe stage is sparse except for a large projection of the riverbank at the back, two platforms on the left that serve as the steamboat and a clump of river reeds, a tree and a campfire to the right. Loading Preview night brought some rushed dialogue from the trio of warriors that should hopefully settle for the rest of the season. Maybe they feel there’s no time to waste: under Beng Oh’s direction, the 70-minute narrative moves fast, with the plight of both sets of white and blackfellas played out in alternate scenes before they finally meet. What makes Soul of Possum interesting is that it dramatises the in-fighting among each group. The First Nations Australians lose valuable time arguing about what to do with the threat of territorial trespass while the English marauders – Captain Gibbons (Leigh Scully), Lieutenant Bankes (Gabriel Partington), Dr Wilkins (Kevin Dee) and Irish convict Yates (Luke Mason) – have their own on-board power conflicts to contend with. All four characters are performed with ease and conviction. There’s an earnestness about this play and some unnecessary repetition in the script. The ending that brings us back to the present day also seems a bit too expository after everything we’ve witnessed. Nonetheless, Soul of Possum does manage to take us into the crossfire of colonial violence in its short, sharp stage time.\n\nReviewed by Thuy On\n\nSoul of Possum was reviewed from a preview performance.",
    "source": "SMH",
    "cluster_id": 29
  },
  {
    "url": "https://www.smh.com.au/national/queensland/burst-water-main-closes-brisbane-cbd-street-20251210-p5nmhn.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Burst water main closes Brisbane CBD street",
    "publish_date": "Wed, 10 Dec 2025 12:10:58 +1100",
    "category": "finance",
    "authors": [],
    "text": "Burst water main closes Brisbane CBD street\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 30
  },
  {
    "url": "https://www.smh.com.au/goodfood/recipes/sticky-gochujang-barbecue-chicken-20251210-p5nmh7.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Sticky gochujang barbecue chicken",
    "publish_date": "Wed, 10 Dec 2025 12:06:23 +1100",
    "category": "finance",
    "authors": [
      "Katrina Meynink"
    ],
    "text": "Step 1\n\nAdd the honey, ginger, garlic, gochujang and smoky barbecue sauce to a large bowl and stir to combine. If the marinade seems too thick, add a little olive oil. Once mixed, add the chicken and use your hands to completely coat the chicken in the marinade. If you have time, let it sit overnight in the fridge. This is not a die-hard rule – it’s a nice-to-do rather than must-do.",
    "source": "SMH",
    "cluster_id": 31
  },
  {
    "url": "https://www.smh.com.au/world/oceania/world-watches-as-australia-s-teen-social-media-ban-kicks-in-20251210-p5nmdh.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "‘Backdoor way to control access’: World reacts to social media ban",
    "publish_date": "Wed, 10 Dec 2025 12:04:40 +1100",
    "category": "finance",
    "authors": [
      "Newley Purnell",
      "Nasteho Said"
    ],
    "text": "Australia’s landmark teenage social media ban has drawn global attention at a time when governments are increasingly enacting rules to shield minors from toxic content and cyberbullying.\n\nThe law, passed last year, mandates services such as TikTok and Instagram keep under-16s off their platforms or face fines of up to $49.5 million. Australia becomes the world’s first democracy to bring in a ban amid growing concerns about social media’s harms.\n\nAustralia has become the world’s first country to enact a ban on social media for under-16s. Credit: Getty Images\n\nMeanwhile, governments in Indonesia, Denmark, Brazil and other nations are also moving to rein in tech companies, and planning moves of their own to shield young users.\n\nSocial platforms affected in Australia include Snapchat, YouTube, Reddit and more. Of the initial 10, all but Elon Musk’s X have said they will comply using age inference – guessing a person’s age from their online activity – or age estimation, which is usually based on a selfie. They might also check with uploaded identification documents or linked bank account details.",
    "source": "SMH",
    "cluster_id": 3
  },
  {
    "url": "https://www.smh.com.au/national/queensland/the-reason-lady-gaga-fans-were-stuck-for-hours-outside-suncorp-stadium-20251210-p5nmct.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "The reason Lady Gaga fans were stuck for hours outside Suncorp Stadium",
    "publish_date": "Wed, 10 Dec 2025 12:03:26 +1100",
    "category": "finance",
    "authors": [
      "Julius Dennis"
    ],
    "text": "Technical issues left thousands of Lady Gaga fans locked out Suncorp Stadium last night, with the show beginning nearly an hour late.\n\nProblems were discovered during the star’s soundcheck, resulting in the gates opening at 5.50pm instead of 5pm as planned.\n\nThe disruption led to some fans queuing outside Suncorp for another two hours.\n\nConcertgoers were forced to queue for hours outside Suncorp Stadium. Credit: Cameron Atfield\n\nLines to enter the stadium stretched almost to Milton train station, with thousands joining unsigned queues in the hope it would end at their nominated gate.",
    "source": "SMH",
    "cluster_id": 32
  },
  {
    "url": "https://www.smh.com.au/world/north-america/tariff-rescue-trump-gives-band-aids-to-the-farmers-he-hurt-20251210-p5nmd1.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Tariff rescue: Trump gives Band-Aids to the farmers he hurt",
    "publish_date": "Wed, 10 Dec 2025 12:03:04 +1100",
    "category": "finance",
    "authors": [
      "Stephen Bartholomeusz"
    ],
    "text": "This is not the first time Trump has had to pay farmers compensation for his tariff. During the trade war in his first term, he handed out $US23 billion of aid. The farmers would, you’d assume, prefer to be able to trade freely rather than rely on government charity. Loading Trump and his officials have described the payments as a “bridge” to tide the farmers over until China delivers on its promises, even though the experience of the 2020 “phase one” trade deal, in which China made similar promises that it didn’t meet, suggests there’s a possibility that it will be a bridge to nowhere. It’s consistent, however, with the administration’s broader assertions that Americans only have to wait – initially it was supposed to be this year, now it’s next year and beyond – for the benefits of the tariffs to flow. The administration has previously rolled back tariffs on coffee, bananas, tomatoes and other foods that the US doesn’t produce in significant quantities in an attempt to blunt the impact of tariffs-induced spikes in prices and the cost of living for US households\n\nNow it is subsidising its own agricultural production, while blaming the Biden administration and other countries for the losses of markets and the affordability crisis for middle and lower income household in the US that its own policies have created. Trump doesn’t seem to be able to connect the dots between the cause and the effect. The hardship being experienced by US farmers isn’t only due to the closure of the Chinese market to their products after the April 2 “Liberation Day” tariffs. It’s not just a revenue problem. Their input costs have risen sharply because fertiliser prices and farm machinery prices, among other items, have also jumped because of Trump’s tariffs. The administration lowered the tariffs on some fertilisers last month in an implicit recognition of their impact, although Trump this week threatened “very severe” tariffs on Canadian potash in order to boost domestic production of fertilisers. About 95 per cent of Canada’s potash is exported, with about 50 per cent of those export volumes directed to the US. A tariff on potash would flow through to another hike in farm costs. Farm machinery prices have risen because Trump slapped 50 per cent tariffs on steel and aluminium and tariffs on other imported items used in their manufacture. About a quarter of the components in a John Deere tractor are imported.\n\nTrump, predictably, blames Joe Biden’s environmental rules for the rising cost of farm machinery and has said he will wind them back. “You buy it, it’s got so much equipment on it for the environmental, it doesn’t do anything except it makes the equipment much more expensive and much more complicated to work,” he said on Tuesday. John Deere has said that Trump’s tariffs, particularly those on steel and aluminium, will cost it $US600 million this year. It has laid off about 240 workers this year in response. The other challenge for US farmers is labour. Trump’s aggressive crackdown on undocumented immigrants has produced a shortage of labour and forced up labour costs. More than 40 per cent of US crop workers lack legal status. So, the tariffs have closed markets and reduced farm income while the tariffs and immigration policies have driven up costs. The bailout might help some farmers limp on into next year, but they aren’t a long-term response to the bind the farmers find themselves in.\n\nThe lost markets, higher fertiliser and machinery costs and shrunken pool of labour are structural changes to the economics of American farms that can’t easily, or readily, be unwound. Loading Even if China does buy more soybeans and other agricultural commodities, it will buy much less than it did before Trump decided tariffs had magical qualities, able to fix the US trade deficit, rebuild the US manufacturing base, reduce US deficits and debt, fund $2000 “dividends” to households and even enable the abolishment of US income taxes. Oh, and bail out farmers. China helped build the infrastructure in Brazil than has enabled it to displace the US as its major supplier of soybeans. It has also begun buying the beans from Argentina, much to the chagrin of the US farmers, who saw their administration give that country a $US20 billion bailout package that helped it sell up to $US7 billion of soybeans to China. Having been burned twice by Trump’s tariffs, China will maintain the diversity of supply it has helped create. Its market, and those of other countries hit by the tariffs, will never be as open to US producers as they once were.",
    "source": "SMH",
    "cluster_id": 33
  },
  {
    "url": "https://www.smh.com.au/business/companies/vanishing-act-the-anika-wells-expenses-exclusive-pulled-by-news-corp-20251208-p5nlti.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Vanishing act: The Anika Wells expenses exclusive pulled by News Corp",
    "publish_date": "Wed, 10 Dec 2025 11:59:45 +1100",
    "category": "finance",
    "authors": [
      "Calum Jaspan"
    ],
    "text": "So you see the dilemma for the News Corp editors? While the story and its critical tone in highlighting Wells’ use of taxpayer funds was arguably fair, she made the trip to promote the ban News Corp says it was central in establishing. Ultimately, the exclusive was retracted after a few hours online. A Google search from Wednesday afternoon, the day after the story was published. Credit: The Sydney Morning Herald However, by that time, the story had already been shared widely within a Press Gallery WhatsApp chat containing almost 200 journalists. The link to the story went dead and remains so. With no live link come Wednesday morning, it was then reported by 2GB’s Ben Fordham as an “exclusive” just hours before Wells was due to appear at the National Press Club, a week before the ban was due to go live. The story snowballed into a barrage of questions for Wells, and the subsequent expenses scandal that followed.\n\nClick on the story, and it was nowhere to be found. Credit: SMH Since then, there has been a slew of stories published regarding Wells’ use of taxpayer funds for trips for her and her family (it’s worth noting that all of these trips appear to be within the guidelines). They’ve come from multiple media sources including this masthead, The Australian Financial Review, Guardian Australia, ABC and other outlets. It was not until Friday evening, three days after the initial news.com.au article, that The Daily Telegraph wrote the first story published by a News Corp metro masthead about the unfolding government crisis, appearing in its Saturday paper. The Australian and Sky News Australia covered the story on the day of the Press Club appearance, and have done so since, but they were not involved in the Let Them Be Kids campaign. A number of sources, both in the Press Gallery and in the federal opposition, have noted the softer tone from some News Corp outlets since the expenses saga has unfolded.\n\nThe Let Them Be Kids campaign continued on The Daily Telegraph’s front page on Friday, three days after the initial expenses story was published by news.com.au. Credit: News Corp On Sunday, the News Corp tabloids’ national weekend political editor James Campbell defended Wells in a piece titled “Lay off Anika, she’s done absolutely nothing wrong”, exonerating her for each of the then-reported uses of public funds for personal events. The coverage has turned more critical in the days since, however. On Background tried to speak to Carroll and Pilling directly about why such an important exclusive was pulled. The comment we got came from a corporate spin doctor. A News Corp spokesperson confirmed the story was removed, but said all the company’s publications have been covering the debate about Wells’ travel expenses closely and prominently on their print front pages and digital home pages. They also rejected any suggestion of government interference or executive influence.\n\n“With one particular story, there was an editorial decision to review its publication. All decisions on editorial coverage have been made by editorial independent of government interference or executive directive,” the spokesperson said. The world-first social media ban came into effect on Wednesday, and has been described as a legacy-shaping policy for the Labor Party and for Wells. It was prompted and has been championed by the News Corp campaign, alongside a campaign “36 Months” led by Nova presenter Michael “Wippa” Wipfli, arguing for the minimum age for social media usage be raised from 13 to 16. Nova is also owned privately by News Corp chair Lachlan Murdoch. “Let Them Be Kids” and “36 Months” were both launched in May 2024, the former splashed across the front pages of the company’s metro tabloid newspapers at the time and in the lead-up to the ban going live this week. Both launched petitions urging the government to impose a minimum age to access social media. The tabloids’ homepages also featured countdowns to the ban going live this week.\n\nOn Sunday, The Daily Telegraph detailed the inception of policy itself and how it successfully lobbied this government. It started with an “intimate dinner at the Lodge” in September 2024 between Emma Mason, the mother of Matilda Rosewarne who took her own life as a 15-year-old after sustained online bullying; Pilling; Courier Mail editor Chris Jones; Albanese and his partner, Jodie Haydon; and Albanese’s press secretary, Fiona Sugden. “Pilling found herself arguing for a social media ban up to the age of 16, rather than 14 or 15. At some point, it occurred to her that she and Albanese were not talking about the question of a ban. They were talking about the details of a ban,” the story on Sunday read. “I knew then that this was probably going to happen,” Pilling told The Daily Telegraph. “That was a pretty pivotal moment in the process.” Pilling then went on to front and lead the campaign, which ultimately resulted in the bill that comes into effect on Wednesday. If you or anyone you know needs support, call Lifeline on 131 114 or Beyond Blue on 1300 224 636. Read the full and final “On Background” column for the year this Friday.",
    "source": "SMH",
    "cluster_id": 34
  },
  {
    "url": "https://www.smh.com.au/national/camping-expert-reveals-how-to-nab-budget-friendly-spots-20251210-p5nmha.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Camping expert reveals how to nab budget-friendly spots",
    "publish_date": "Wed, 10 Dec 2025 11:59:14 +1100",
    "category": "finance",
    "authors": [],
    "text": "Camping expert reveals how to nab budget-friendly spots\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 35
  },
  {
    "url": "https://www.smh.com.au/sport/cricket/australian-delight-english-woe-cummins-boosts-attack-for-adelaide-test-20251210-p5nmfw.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Australian delight, English woe: Cummins boosts attack for Adelaide Test",
    "publish_date": "Wed, 10 Dec 2025 11:55:27 +1100",
    "category": "sports",
    "authors": [
      "Andrew Wu"
    ],
    "text": "It means selectors will be able to field their most experienced and arguably strongest attack of the series in Adelaide, which is staging a rare day Test.\n\nCummins’ impending return strengthens an Australian attack that has had little trouble claiming 20 wickets in each of the first two Tests.\n\nHis return had been flagged by coach and selector Andrew McDonald on Tuesday but has now been set in stone after being named on Wednesday in the 15-person squad for the third Ashes Test in Adelaide.\n\n“Pat will be back in the squad, he will be available, and that creates a different balance to our attack,” McDonald said. “Barring anything else happening in the next week, we’ll be expecting Pat to be tossing the coin and putting the blazer on.\n\n“There won’t be any match opportunities for Pat. This is something we’ve done with Pat before, off longish lay-offs, where we’ve put in some time into rebuilding his body. He’s simulated pretty much what a match will look like out there with multiple spells.\n\n“We feel as though he’ll be as best prepared as he can be. He was well ahead of where we thought he would be at, and it created a real live conversation for Brisbane. The skill readiness, the loads, how he was pulling up … it was debated a lot, leading into that Test match. So with that in mind, seeing him further advanced, we feel he’ll be really well-placed for the challenges of Adelaide.”\n\nCummins’ availability will put the squeeze on Gabba hero Michael Neser and newcomer Brendan Doggett.",
    "source": "SMH",
    "cluster_id": 36
  },
  {
    "url": "https://www.sbs.com.au/news/article/social-media-ban-comes-into-effect/f5l8fndl1",
    "title": "'Read that book', PM tells teens, as eSafety says social media ban will have 'teething issues'",
    "publish_date": "Tue, 9 Dec 2025 23:24:04 +0000",
    "category": "finance",
    "authors": [],
    "text": "Prime Minister Anthony Albanese has said teenagers will face a \"difficult\" adjustment as new laws restricting their access to social media take effect.\n\n\n\n\n\nThe new laws came into force on Wednesday and ban teenagers aged under 16 from holding accounts on some social media platforms, including Instagram, Snapchat and TikTok.\n\n\n\n\n\nAlbanese lauded the new restrictions which his government has described as world-first legislation, but acknowledged it would be a \"difficult period\" for affected teenagers.\n\n\n\n\n\n\"This is the day when Australian families are taking back power from these big tech companies,\" he told ABC TV on Wednesday.\n\n\n\n\n\n\"One of the dynamics that has occurred over a period of time is people being addicted, effectively.\n\n\n\n\n\n\"It won't be simple. It'll be a difficult period.\"\n\n\n\nREAD MORE The global fault lines emerging over Australia's social media ban\n\nSome experts have been divided over the issue, saying the ban will have positive and negative effects , while others have argued social media is an important tool for young people to have access to .\n\n\n\n\n\nEarlier, in a video message posted to social media, Albanese encouraged teenagers to use the ban as an opportunity to \"spend quality time\" face-to-face with family and friends.\n\n\n\n\n\n\"Make the most of the school holidays coming up, rather than spending it scrolling on your phone,\" he said on Tuesday.\n\n\n\n\n\n\"Start a new sport, learn a new instrument, or read that book that has been sitting there on your shelf for some time.\"\n\n\n\n'Can't avoid in a week's time', Wells says\n\nSome have raised concerns children could try to find ways around the restrictions or that age verification could be unreliable.\n\n\n\n\n\nThe 10 platforms committed to the ban, including TikTok, Instagram, Snapchat, YouTube, and Reddit, to take reasonable steps to block children from accessing their services, or face fines of up to $49.5 million per breach.\n\n\n\n\n\nTech companies are expected to use a range of methods to verify a user's age, including face scans with artificial intelligence, sophisticated analysis of people's posting patterns and language, and digital IDs.\n\n\n\n\n\nSome platforms, such as YouTube, will still be accessible without an account, but it will be harder for algorithms to target content to children.\n\n\n\nEsafety Commissioner Julie Inman Grant said some companies have come into the ban \"kicking and screaming\", but she believes they have the \"technical capability\" to enforce the ban.\n\n\n\n\n\n\"There will be teething issues, and kids are ingenious; they will be finding ways around it,\" she told ABC News on Wednesday morning.\n\n\n\n\n\n\"But the way that we are looking at compliance and enforcement is around systemic failures, and I 100 per cent believe that these companies have the technical capability to achieve this.\"\n\n\n\n\n\nIn response to claims, some children have continued to access social media after the ban took effect, Communications Minister Annika Wells said: \"They might have avoided it today does not mean they can avoid it in a week's time or a month's time because these social media platforms have to go back and routinely check under-16s' accounts.\"\n\n\n\n\n\nWells told reporters on Wednesday morning social media companies have years of data they can use to ascertain a person's age, whether it's previous searches or the subjects of conversations children may have.\n\n\n\n\n\nShe said more than 200,000 TikTok accounts have been deactivated so far.\n\n\n\n\n\n\"Because you've had your older brother scan their face for you today which has bought you a bit of time, doesn't mean that these accounts aren't going to see you talking to other 14-year-olds,\" she said.\n\n\n\n\n\nSocial media companies have an \"onus\" to enforce the ban, Wells said, adding the government is also looking at how to regulate artificial intelligence chatbots and bring in a \"digital duty of care\" next year.\n\n\n\n\n\nThe ban has also been subject to last-minute changes. A month before the ban took effect, social media platform Reddit and streaming site Kick were included.\n\n\n\n\n\nLittle-known apps Lemon8 and Yope have also been warned they may be added in the future.\n\n\n\n\n\nAcross Europe, governments and institutions are tightening restrictions on children's social media use, with Australia's laws increasingly viewed as a reference point .\n\n\n\n\n\n— With additional reporting by the Australian Associated Press\n\n\n\n",
    "source": "SBS",
    "cluster_id": 3
  },
  {
    "url": "https://www.sbs.com.au/news/article/lithuania-smuggling-balloons-emergency/n711gx7vq",
    "title": "Why are smuggling balloons creating an 'emergency situation' in Lithuania?",
    "publish_date": "Tue, 9 Dec 2025 20:29:11 +0000",
    "category": "finance",
    "authors": [],
    "text": "Smuggling balloons drifting over the Belarusian border have forced repeated shutdowns at the airport in Lithuania's capital Vilnius, in what authorities call a \"hybrid attack\" by Belarus, a Russian ally.\n\n\n\n\n\nSince October, the airport just 30km from Belarus has closed more than a dozen times, disrupting hundreds of flights and affecting thousands of passengers.\n\n\n\n\n\nOn Tuesday, Lithuania declared an \"emergency situation\" over the influx of balloons, describing it as a \"hybrid attack\" orchestrated by the Belarusian government.\n\n\n\n\n\nThe measure is one step below a \"state of emergency\", which can only be declared by parliament when the country's \"constitutional order\" is in danger.\n\n\n\nWhat are these balloons?\n\nThe high-altitude balloons, filled with helium or hydrogen, fly where the wind takes them but their altitude can be controlled remotely from the ground.\n\n\n\n\n\nTypically used by meteorologists to probe stratospheric conditions starting 15km above ground, they have been repurposed to smuggle cheap Belarusian cigarettes into Lithuania. The practice surged after tighter border controls were imposed during a 2021 migrant crisis.\n\n\n\n\n\nFirst spotted in 2023, the balloons became widespread in 2024, with several hundred recorded.\n\n\n\n\n\nThey pass over the border at an altitude of about 3 to 4km. The smugglers in Lithuania can then communicate with the balloon to track its location, and direct it to land.\n\n\n\n\n\nA balloon typically carries 500 to 1,500 packs of cigarettes, with a pack costing less than a euro, versus 4.5 euros per similar brand in Lithuania.\n\n\n\nREAD MORE 'Narco-subs': How thousands of tonnes of cocaine are being shifted across seas\n\nSo, what's the problem?\n\nAuthorities say the balloons fly at a similar height to aeroplanes approaching an airport, raising the risk of collisions.\n\n\n\n\n\nLocal rules for what constitutes a mid-air risk have recently been upgraded, and the balloons now frequently qualify.\n\n\n\n\n\nLithuanian authorities have fine-tuned their detection systems and have been able to better identify whether the flight paths of any identified balloons pose a threat to civil aviation.\n\n\n\n\n\nSince October, Vilnius Airport has been closed for more than 60 hours due to the threat posed by smuggling balloons, impacting more than 350 flights and approximately 51,000 passengers, according to the interior ministry.\n\n\n\nWhat happens to the cigarettes?\n\nLithuania says smuggled cigarettes are typically manufactured in Belarus and many are smoked in Lithuania.\n\n\n\n\n\nThe Lithuanian Border Guard confiscated 1.4 million packs of illicit cigarettes in 2024, of which 1.2 million packs were marked for sale in Belarus.\n\n\n\n\n\nThe Lithuanian government initially said the balloons were not being shot down because of the danger to lives or property posed by their heavy payloads.\n\n\n\n\n\nOfficials have since authorised the use of \"kinetic measures\", but Lithuania's chief of defence said the army had not yet found cost-effective methods to identify and bring down balloons.\n\n\n\nHow has Belarus responded?\n\nBelarusian President Alexander Lukashenko says Lithuania is exaggerating incidents with smuggler balloons but that Minsk does not want a war with its neighbours.\n\n\n\n\n\nHe called Lithuania's earlier closure of the border, which lasted several weeks, a \"crazy scam\" and, in turn, accused the West of waging a hybrid war against Belarus and Russia.\n\n\n\n\n\nBelarus, which allowed its territory to be used for Russia's invasion of Ukraine in 2022, has accused Lithuania of deploying a drone to spy on it and drop \"extremist material\". Vilnius has rejected this charge.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 37
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/morning-bulletin-10-december-2025/f6ogtn8op",
    "title": "Social media ban kicks off today | Morning Bulletin 10 December 2025",
    "publish_date": "Tue, 9 Dec 2025 19:30:12 +0000",
    "category": "finance",
    "authors": [],
    "text": "Listen to Australian and world news and follow trending topics with SBS News Podcasts.\n\n\n\n\n\n\n\nTRANSCRIPT:\n\n\n\n\n\nThe social media ban kicks in as the Communications Minister refers her expenses for audit\n\nConflict on the Thai-Cambodia border continues to escalate with several people reported dead ...\n\nThe AFLW draft goes down to the wire.\n\n\n\nThe federal government's ban on social media for children under 16 years officially enters into force today, with Snapchat, Facebook, Instagram, YouTube, TikTok, Reddit, X and Twitch included.\n\n\n\n\n\nIt's world-leading legislation that has prompted moves toward a similar ban in Malaysia, as well as several European countries and the broader European Union.\n\n\n\n\n\nWhile the government concedes the ban is likely to experience teething problems, the new rules set out clear standards and expectations.\n\n\n\n\n\nOne of the first advocates for the social media ban, South Australian Premier Peter Malinauskas has told Chanel Nine he agrees.\n\n\n\n\n\n\"I am absolutely convinced that this is a reform that will make a difference to children's lives, but also make lives a lot easier for parents as well, because what we're really doing here is not just regulating the relationship between large big-tech social media platforms and children. What we're really doing is empowering parents to put in place a standard that's better for their mental health that everyone knows is the law and everyone can comply by. The resistance we're seeing from big tech is highly surprising. I mean this is a reform that started here in South Australia is now genuinely going global.\"\n\n\n\n\n\nThe advent of the government's youth social media ban has been overshadowed by an expenses scandal plaguing Communications Minister Anika Wells.\n\n\n\n\n\nThe minister maintains it's all been within rules, but says she's self-referred herself to the Independent Parliamentary Expenses Authority for an audit.\n\n\n\n\n\nLast week, it was revealed she'd spent more than $100,000 on flights for herself and three staffers to spruik the ban at the United Nations.\n\n\n\n\n\nOther expenses that have raised eyebrows include car charges and airfares for her family to join her at sport events and at the snow.\n\n\n\n\n\nHeading overseas now and...\n\n\n\n\n\nThe renewed border conflict between Thailand and Cambodia continues to escalate, with both countries blaming each other for the collapse of a ceasefire agreed in July.\n\n\n\n\n\nCambodia says seven civilians have been killed and 20 injured, while Thailand reports one military casualty and 29 people injured during skirmishes in border regions.\n\n\n\n\n\nAs tens of thousands flee the expanding conflict zone, Cambodia's Senate President Hun Sen says his country is capable of a fierce fight against Thailand.\n\n\n\n\n\nThailand has conducted a series of air strikes, and Defence Ministry Spokesperson Rear Admiral Surasat Kongsiri says military measures will continue.\n\n\n\n\n\n“Thailand is determined to defend its sovereignty and territorial integrity and therefore military measures must be taken as necessary to protect Thailand’s sovereignty and territorial integrity.”\n\n\n\n\n\nPresident Donald Trump has described Europe as a “decaying” group of nations led by “weak” people.\n\n\n\n\n\nIn an interview with the Politico website, he criticised them for failing to control migration and end the Russia-Ukraine war.\n\n\n\n\n\nIt's his strongest criticism of European leaders yet:\n\n\n\n\n\n\"I know them really well. Some are friends, some are ... ok. I know the good leaders, I know the bad leaders, I know the smart ones, I know the stupid ones,you got some real stupid ones too. They're not doing a good job in many ways, they're not doing a good job. They talk too much, they're not producing. We're talking about Ukraine - they talk, but they don't produce.\"\n\n\n\n\n\nMr Trump also suggested Ukraine should give territory to Russia to achieve peace, as Russia's size and power makes it the likely victor in the conflict.\n\n\n\n\n\nItalian firefighters have rescued 37 stranded goats from the snowy peak of Mount Cardinello on the border with Switzerland.\n\n\n\n\n\nThe goats had been missing for days after finding their way to an altitude of about 2,500 metres.\n\n\n\n\n\nWith the help of a helicopter, firefighters brought them back to their hut at 600 metres.\n\n\n\n\n\nThe goats are reported to be in good condition.\n\n\n\n\n\nTo sport now...\n\n\n\n\n\nFormer number one draft pick Kristie-Lee Weston-Turner and Brisbane star Taylor Smith are among the AFLW players whose bids to land a new club will come down to the final day.\n\n\n\n\n\nPlenty of big names, have already sealed their moves, but others may have to wait for the closing moments at Marvel Stadium on Wednesday.\n\n\n\n\n\nAt the end of a busy trade period, Weston-Turner wants to join back-to-back premiers North Melbourne after just eight games across two seasons at the Bulldogs.\n\n\n\n\n\nBut the two teams are at an impasse in regards to her value, which could force the youngster to try her luck in the draft.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 3
  },
  {
    "url": "https://www.sbs.com.au/news/article/the-simple-question-from-a-nurse-that-saved-stuarts-life/f6mnbuyic",
    "title": "The simple question at hospital that saved Stuart's life",
    "publish_date": "Tue, 9 Dec 2025 18:40:46 +0000",
    "category": "lifestyle",
    "authors": [],
    "text": "Stuart Slater doesn't drink or smoke, exercises regularly and describes his diet as healthy.\n\n\n\n\n\nSo when the 54-year-old suffered a life-threatening cardiac emergency at work at 2022, he had no idea what was happening.\n\n\n\n\n\n\"I ... just felt really dizzy and faint and I couldn't stand up and I've never had that happen to me before,\" Slater recalled.\n\n\n\n\n\n\"I knew there was something that just wasn't quite right.\"\n\n\n\n\n\nThe ambulance service said they were going to be two to three hours.\n\n\n\n\n\n\"A work colleague looked at me and said: 'can you wait that long?' I said: 'I really don't think so'.\"\n\n\n\nSlater was experiencing an aortic dissection, or ruptured aorta.\n\n\n\n\n\nHe later found out that he only had a 10 to 15 per cent chance of survival.\n\n\n\n\n\nWhen he arrived at the hospital, the receptionist asked him a simple question: Are you admitting yourself as a public or private patient?\n\n\n\n\n\nHe says the answer he gave that day probably saved his life.\n\n\n\nREAD MORE 'Historic': WHO releases first guidance on drugs like Ozempic for treating obesity\n\n\"I was sort of confused with that question because I'd never been to hospital before and my instinct would've been to say private,\" he said.\n\n\n\n\n\n\"But, I actually bounced the question back to her and said: 'how should I admit to hospital?' And she said, 'what's happening?' I said: 'I think I'm having some sort of major heart issue. I'm just not sure'.\n\n\n\n\n\n\"She looked at me and went: 'public, go public. If you are presenting any critical situation, go public.'\n\n\n\n\n\n\"She probably saved my life that day. Just the very fact that I did go public that day probably did save my life.\"\n\n\n\n\n\nSlater had premium private health insurance. If he had been admitted as a private patient, accessing the lifesaving technology used to treat him may not have been possible.\n\n\n\n\n\nA new report by healthcare consulting firm HTAnalysts says that patients are waiting an average 4.7 years for clinically proven, lifesaving technologies to get approved in Australia.\n\n\n\nCardiothoracic surgeon Jayme Bennetts says the current approval process creates inequities in patient care.\n\n\n\n\n\n\"The main issue is that there is a significant time component to getting new technologies,\" he said.\n\n\n\n\n\nHe said updates to existing technologies and approval of new technologies go through the same regulatory pathway.\n\n\n\n\n\n\"That regulatory pathway is taking on average just shy of five years to get new products approved, which means that patients are being unable to access what is potentially a better and an improved way of dealing with their problems, especially with heart pathologies,\" he said.\n\n\n\n\n\n\"And … those technologies are already readily available overseas.\"\n\n\n\n\n\nThe report says that in order for Australia to catch up to global best practice in the US and Germany it must reform to streamline processes, promote alternate funding mechanisms and increase transparency.\n\n\n\nIan Burgess, the chief executive of the Medical Technology Association of Australia, said delays have costs for both individuals and the wider health system.\n\n\n\n\n\n\"In Australia, there's funding and access gaps to new innovative medical technologies, and that directly impacts on patient access,\" he said.\n\n\n\n\n\n\"It means there's inequitable patient access and it slows down adoption of medical technologies, new innovation, and when that new innovation can drive enormous value in terms of to an individual patient, better outcomes, better quality of life, and drive efficiency in our health system.\"\n\n\n\n\n\nThe report calls on the Australian government to establish performance targets for reimbursement times.\n\n\n\nIt also calls for the development of a provisional funding mechanism for new and innovative technologies in the private sector.\n\n\n\n\n\nBennetts says disparities between the private and public sector mean greater inequity in treatments.\n\n\n\n\n\n\"The regulatory pathway really is more limiting in the private sector than the public. Often some of these new technologies are available earlier publicly because they don't need to have the same approval and funding regulatory pathways through to get them to be available in that system.\"\n\n\n\n\n\nWhile he says reform is needed to speed up these regulatory pathways, Bennetts says the regulations exist for good reason.\n\n\n\n\n\n\"I think the pathways are designed to ensure that we have a system that can afford healthcare, but also that we are delivering devices and technologies to patients where there is a proven benefit that is actually one, safety and efficacy for the patient, but two is also cost-efficient for the system.\n\n\n\n\n\n\"So those systems I think are very good and are designed with the right intent. We just need a more efficient pathway of new technologies and devices to be able to be approved quicker.\"\n\n\n\nFor people like Stuart, access to the right technology not only saved his life, but made it better.\n\n\n\n\n\n\"It was the greatest day of the rest of my life,\" he said.\n\n\n\n\n\n\"Little did I know that day that I had a 10 to 15 per cent chance of living. Your odds aren't good and you need everything to go your way.\n\n\n\n\n\n\"But 20 years ago, if I had an aortic dissection, I wouldn't have lived. And that's just showing that what the medical technology has done since then. I've had two new grandkids, my kids have had kids, but I'm just enjoying life so much more.\n\n\n\n\n\n\"I'm probably the person I always wanted to be now because I'm more relaxed with everything. People say it's a second chance of life, but it's not — it's just realising how lucky you were.\"\n\n\n\n",
    "source": "SBS",
    "cluster_id": 38
  },
  {
    "url": "https://www.sbs.com.au/news/article/australias-teen-social-media-ban-what-does-the-world-think/j7xz6vbnt",
    "title": "The global fault lines emerging over Australia's social media ban",
    "publish_date": "Tue, 9 Dec 2025 18:36:06 +0000",
    "category": "finance",
    "authors": [],
    "text": "Australia's new laws banning children under 16 from social media are reshaping international debate, attracting interest from European regulators while drawing resistance from major United States technology firms.\n\n\n\n\n\nThe legislation, which comes into force today, requires platforms including TikTok, Instagram, Snapchat, YouTube and Reddit to take reasonable steps to block children from accessing their services or face fines of up to $49.5 million per breach.\n\n\n\n\n\nMeta has already started deleting hundreds of thousands of under-age accounts in response.\n\n\n\n\n\nWhile the policy is domestic in scope, its diplomatic implications appear to be far-reaching, as foreign governments and industry bodies assess what Australia's approach signals about its regulatory direction and global positioning.\n\n\n\nEurope tracks Australia's lead\n\nAcross Europe, governments and institutions are tightening restrictions on children's social media use, with Australia's laws increasingly viewed as a reference point.\n\n\n\n\n\nDenmark has pledged to restrict under-15s from social media without parental consent, while France, Italy, Spain and Norway are all advancing similar policies.\n\n\n\n\n\nAt the EU level, the European Commission is developing a regional age-verification app with five member states to allow users to verify their age without handing personal data directly to platforms. Though critics have pointed out the policies wouldn't be binding like Australia's.\n\n\n\nEuropean Commission president Ursula von der Leyen has publicly welcomed Australia's approach as \"plain common sense\".\n\n\n\n\n\n\"We all agree that young people should reach a certain age before they smoke, drink, or access adult content. The same can be said for social media,\" she said.\n\n\n\n\n\nSenior lecturer and researcher in communications at Edith Cowan University, Catherine Archer, said the Albanese government is likely celebrating the international recognition it has attracted.\n\n\n\n\n\n\"As we all know, they went to the United Nations with this and made quite a strong stand on it,\" she said.\n\n\n\n\n\n\"It's the populist move — the majority of adults agree with it.\"\n\n\n\nPolling indicates that most Australian adults support the ban. However, a Resolve Political Monitor survey for the Nine newspapers found that only about 35 per cent of respondents were confident social media companies could effectively block users under 16, and fewer than one in three believed the ban would be fully enforced.\n\n\n\n\n\nWhile the shift has improved Australia's standing with liberal progressive audiences in parts of Europe, it has weakened its reputation among others, according to Charles Miller, a senior lecturer in the Australian National University's School of Politics and International Relations.\n\n\n\n\n\n\"It does draw the ire of many libertarian and American conservatives, especially around the tech industry.\"\n\n\n\nUS tech giants push back\n\nThe strongest opposition to the ban has come from the United States technology sector, where industry groups representing Meta, Netflix, Disney, Alphabet and others have lodged formal complaints with the US Trade Representative.\n\n\n\n\n\n\"The Elon Musk's and the Peter Thiels of the tech world who have the ear of the Trump administration — they do not like this at all and I think it's [been] underestimated how much it could actually become a problem for relations between Australia and the United States,\" Miller said.\n\n\n\n\n\nThe US-based Computer & Communications Industry Association has raised \"serious concerns for industry about freedom of expression and information,\" saying such a framework \"risks applying disproportionate penalties to US firms, while overbroad and blanket restrictions could stifle creativity\".\n\n\n\nWhile Archer said those arguments reflect the commercial interests at stake, she acknowledged that the ban could excessively restrict how young people access news and participate in civic life.\n\n\n\n\n\n\"[People under 16] largely get their information through social media … That's been an avenue that they have been able to use and that's not going to be open to them in as much detail or depth as it has been,\" she said.\n\n\n\n\n\nThe lobby group also criticised Australia's new streaming investment rules, which will require major platforms to spend either 10 per cent of local expenditure or 7.5 per cent of Australian revenue on Australian-made programs.\n\n\n\n\n\nAnother US lobby body, the International Intellectual Property Alliance, said there was \"no evidence\" the Australian market required intervention to sustain local production.\n\n\n\n\n\nThe government has described the social media ban as a world first.\n\n\n\n\n\n\"In one week, Australia will become the first country in the world to ban under 16's from having social media accounts,\" communications minister Annika Wells told the National Press Club last week.\n\n\n\n\n\n\"With one law, we can protect Generation Alpha from being sucked into purgatory by predatory algorithms described by the man who created the feature as 'behavioural cocaine'.\n\n\n\n\n\n\"Through one reform, more kids will have their time back to learn an instrument or a language, or walk their dog, master a torpedo punt or the perfect lob pass.\"\n\n\n\nSecurity, culture politics and the alliance with Washington\n\nThe fallout from Australia's social media ban is now intersecting with shifts in United States security thinking, where cultural and speech regulation is increasingly being treated as a strategic issue, experts say.\n\n\n\n\n\nMiller pointed to the recently released US national security strategy, which he said contains significant \"culture war content\", despite its traditional focus on military threats.\n\n\n\n\n\n\"Although you would think it's security in terms of missiles, guns, bombs and military aggression, you actually find that there's an awful lot in it which might be described as culture war content,\" he said.\n\n\n\nREAD MORE Meta admits there may be mistakes as it brings teenager social media ban forward\n\nOne example is the way the strategy frames European content regulation as a free speech threat.\n\n\n\n\n\n\"The document advocates for the United States to pull away from Europe because of what they describe as European countries infringing on freedom of speech,\" he said, citing restrictions on social media content and Brussels' recent fining of X, which Musk owns.\n\n\n\n\n\nWhile those issues may appear distant from conventional security concerns, Miller said they now carry strategic weight within the Trump administration and the US tech sector.\n\n\n\n\"It seems rather strange to us that they would become security issues,\" he said, \"but in the mindset of the Trump administration — and especially its supporters in the tech industry — they actually can become a problem for security relations as well.\"\n\n\n\n\n\nHe said there was no current indication the Australian ban itself had become a flashpoint in the alliance.\n\n\n\n\n\n\"But similar policies pursued by European countries are now finding their way into the rhetoric of American policymakers towards Europe,\" he added, warning the same dynamics could eventually extend to Australia.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 39
  },
  {
    "url": "https://www.sbs.com.au/news/video/what-we-know-about-the-under-16s-social-media-ban/3qb3mnyl5",
    "title": "What we know about the under 16s social media ban",
    "publish_date": "Tue, 9 Dec 2025 09:31:27 +0000",
    "category": "finance",
    "authors": [],
    "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
    "source": "SBS",
    "cluster_id": 40
  },
  {
    "url": "https://www.sbs.com.au/news/video/concern-over-death-and-injury-rate-of-workers-under-palm-visa-scheme/6m12qqnai",
    "title": "Concern over death and injury rate of workers under PALM visa scheme",
    "publish_date": "Tue, 9 Dec 2025 09:24:02 +0000",
    "category": "finance",
    "authors": [],
    "text": "Concern over death and injury rate of workers under PALM visa scheme\n\nPublished 9 December 2025, 4:57 am\n\nThere are growing calls for an urgent overhaul of a federal government scheme many say puts Pacific Island and Timorese workers at risk of exploitation in regional Australia. There are more than 7,000 workers who have disengaged from the Federal Government's Pacific Australia Labour Mobility scheme and who have stayed working here either unlawfully or on bridging visas. In part three of our special series we hear from those who say they're appalled at the death and injury rate associated with the scheme.",
    "source": "SBS",
    "cluster_id": 41
  },
  {
    "url": "https://www.sbs.com.au/news/video/victoria-makes-history-with-apology-to-the-states-first-nations-people/8dsgfjlqn",
    "title": "Victoria makes history with apology to the state's First Nations People",
    "publish_date": "Tue, 9 Dec 2025 09:23:15 +0000",
    "category": "finance",
    "authors": [],
    "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
    "source": "SBS",
    "cluster_id": 40
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/no-more-interest-rate-cuts-the-rbas-warning/2ensey0ne",
    "title": "No more interest rate cuts: the RBA's warning",
    "publish_date": "Tue, 9 Dec 2025 06:18:21 +0000",
    "category": "finance",
    "authors": [],
    "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
    "source": "SBS",
    "cluster_id": 40
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/reserve-bank-leaves-rates-unchanged-ahead-of-christmas-evening-news-bulletin-9-december-2025/3hpz50ew6",
    "title": "Reserve Bank leaves rates unchanged ahead of Christmas | Evening News Bulletin 9 December 2025",
    "publish_date": "Tue, 9 Dec 2025 04:59:20 +0000",
    "category": "finance",
    "authors": [],
    "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts .\n\n\n\n\n\nTRANSCRIPT:\n\n\n\nVictoria's historic apology to First Nations people another step in the treaty process;\n\nThe Reserve Bank issues its final rates decision for the year;\n\nSaudi fans await confirmation Mo Salah will join Al-Hilal.\n\nThe Reserve Bank has kept interest rates unchanged at its final board meeting this year.\n\n\n\n\n\nThat means the official cash rate remains on hold at 3.6 per cent, a decision widely anticipated in light of resurgent inflation in recent months.\n\n\n\n\n\nTreasurer Jim Chalmers says while many Australians would have welcomed a rate cut, they would not have expected it.\n\n\n\n\n\nHe says mortgage holders should not be disappointed.\n\n\n\n\n\n\"The three interest rate cuts that are already in the system this year are saving someone with a $700,000 mortgage about $4,000 a year. So the three rate cuts which are already flowing, which the Reserve Bank has said today the benefits are not yet fully felt, that is providing welcome relief to Australians with a mortgage who are doing it tough.”\n\n\n\n\n\n.\n\n\n\n\n\nShadow Treasurer Ted O’Brien says the RBA decision to hold rates demonstrates that the federal government has failed to manage the economy effectively.\n\n\n\n\n\nHe has described the lack of rate relief as tragic news ahead of Christmas.\n\n\n\n\n\n”The average Australian mortgage holder is paying $1,800 more in interest every single month compared to when the Coalition was in government. That won't change. In fact, next year, it's likely to get worse.”\n\n\n\n\n\n.\n\n\n\n\n\nThe Victorian Government has delivered a historic apology to the state's First Nations people.\n\n\n\n\n\nThe opposition refused to back the apology, because the wording mentions treaty, which the Liberal Party has vowed to repeal within 100 days if it wins office.\n\n\n\n\n\nBut Premier Jacinta Allan has told Parliament she hopes that together with the state's truth telling and treaty process, the apology will help unite Victorians.\n\n\n\n\n\n\"For the Laws, the policies and the decisions of this Parliament, and those that came before it - laws that took land, removed children, broke families and tried to erase culture - we say sorry. For the tears shed in the dark, for the silence that shadowed their years, for the childhood taken and never returned, for the Stolen Generations, we say sorry.\"\n\n\n\n\n\n.\n\n\n\n\n\nThe Israeli military has launched a wave of strikes in southern Lebanon.\n\n\n\n\n\nNo casualties have been immediately reported but Lebanon's state news agency says that Israeli warplanes carried out a series of strikes throughout the south.\n\n\n\n\n\nThe Israeli military says it was targetting a Hezbollah training compound, military infrastructure and a rocket launch site.\n\n\n\n\n\nThe strikes come less than a week after both Israel and Lebanon sent civilian envoys to a military committee monitoring the ceasefire struck between Israel and Hezbollah in 2024.\n\n\n\n\n\n.\n\n\n\n\n\nCambodia's defence ministry says at least six Cambodian civilians have been killed in renewed clashes along the country's border with Thailand.\n\n\n\n\n\nPhnom Penh's defence ministry says two civilians deaths happened when the Thai military fired into the border province of Banteay Meanchey overnight.\n\n\n\n\n\nThe Thai army says one soldier has been killed and 18 others wounded since clashes broke out on Sunday.\n\n\n\n\n\nIn Sydney, Kanit Utitabud has spoken to SBS Thai about his concerns for family in the region.\n\n\n\n\n\n“I just got off the phone with my younger brother. He said the explosions started around 4 am. The roof was shaking with each blast. People are scared. There’s no sense of safety at all. And when political interests whether local or national get entangled with one side or the other, it’s ordinary people who pay the price. Families on both sides are suffering. Some are even related to each other. The displacement, the uncertainty the impact on people’s lives is enormous.”\n\n\n\n\n\n.\n\n\n\n\n\nLeading figures from across the political spectrum have gathered to farewell one of Australia's most notorious kingmakers: Labor powerbroker Graham Richardson.\n\n\n\n\n\nPrime Minister Anthony Albanese was among the mourners at the state funeral service in Sydney's St James’ Church, along with one of his Liberal predecessor Tony Abbott and ex-Nationals leader Barnaby Joyce.\n\n\n\n\n\nGraham Richardson had a controversial career as a Labor senator and minister during the Hawke and Keating governments, and remained a prominent figure after his retirement from politics, despite being embroiled in several scandals stretching back decades.\n\n\n\n\n\nMr Albanese has told the service that Mr Richardson had nevertheless commanded respect across political lines.\n\n\n\n\n\n\"If Graham was not perfect, he was always very direct. That much was evident in the famously self aware title of his memoir - ‘Whatever it takes’. He had that rogue's charm. An instinctive capacity to disarm, no secret that he played his politics hard. Very hard.\"\n\n\n\n\n\n.\n\n\n\n\n\nTo sport,\n\n\n\n\n\nSoccer fans are awaiting confirmation following reports linking Liverpool forward Mohamed Salah with a potential January move to Saudi Pro League club Al-Hilal.\n\n\n\n\n\nSpeculation has intensified after the 33-year-old voiced frustration with Liverpool manager Arne Slot following Saturday’s 3–3 draw with Leeds.\n\n\n\n\n\nAt Al-Hilal’s club grounds, players and supporters like Abdulrahman Al-Harbi say Salah could boost the team’s title hopes.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 42
  },
  {
    "url": "https://www.sbs.com.au/news/article/reserve-bank-keeps-cash-rate-on-hold-for-december/tb01ju7h5",
    "title": "Reserve Bank governor's warning about interest rates next year",
    "publish_date": "Tue, 9 Dec 2025 03:35:11 +0000",
    "category": "finance",
    "authors": [],
    "text": "The Reserve Bank of Australia (RBA) has kept the interest rate unchanged for a third time at its December meeting, with governor Michele Bullock all but ruling out further mortgage relief in the new year.\n\n\n\n\n\nBullock said further cuts to the official cash rate are not part of the bank's thinking, \"given what’s happening with underlying momentum in the economy … it does look like additional cuts are not needed\".\n\n\n\n\n\n\"I don’t think there are interest rate cuts on the horizon for the foreseeable future.\"\n\n\n\n\n\nThe RBA board did not consider the case for a rate hike at today’s meeting, she said, but given inflationary pressures there were discussions about the possibility of raising the rate next year.\n\n\n\n\n\n\"We did consider and discuss quite a lot what were the circumstances and what might need to happen if we were to decide that interest rates had to rise at some time next year,\" she said.\n\n\n\nIt was widely anticipated by the major banks and economists the cash rate would remain at 3.6 per cent after Tuesday's meeting.\n\n\n\n\n\nIn a statement released by the RBA board, the group said its decision was informed by inflation rates, noting that while inflation is lower than its peak in 2022, \"it has picked up more recently\".\n\n\n\n\n\n\"The board's judgement is that some of the recent increase in underlying inflation was due to temporary factors and there is uncertainty about how much signal to take from the monthly CPI data, given it is a new data series,\" it reads.\n\n\n\n\n\n\"Nevertheless, the data do suggest some signs of a more broadly based pick-up in inflation, part of which may be persistent and will bear close monitoring.\"\n\n\n\nIt was widely anticipated by the major banks and economists the cash rate would remain at 3.6 per cent after Tuesday's meeting. Source: SBS News In its recent data for the September quarter, the consumer price index was at 3.2 per cent, above the Reserve Bank's inflation target band of 2 to 3 per cent.\n\n\n\n\n\nUnderlying, or trimmed mean inflation, the RBA's preferred measure of price movements, rose 1 per cent over the September quarter — higher than its forecast.\n\n\n\n\n\nAnnual trimmed mean inflation rose to 3 per cent, up from 2.7 per cent in the June quarter, marking the first time annual trimmed mean inflation had risen since December 2022.\n\n\n\n\n\nThe RBA will meet again in February, when it will have its first opportunity to change the cash rate in 2026.\n\n\n\n\n\nIf inflationary pressures continue to build, some analysts say the bank could be forced to hike interest rates as soon as February.\n\n\n\n\n\n\"Should inflation numbers published in January show a continued rise, the possibility of an interest rate hike at the February meeting remains on the table to ensure inflation returns to target in a reasonable time frame,\" economist at Monash University Isaac Gross said.\n\n\n\nREAD MORE Energy bill rebates to be axed in cost of living relief 'shift'\n\nDomain chief economist Nicola Powell said the turnaround in rate expectations could help take heat out of the rapid price growth in the housing market during the past year.\n\n\n\n\n\n\"However, it doesn't solve the deeper affordability issues,\" she said.\n\n\n\n\n\n\"Mortgage holders are still managing repayments that are significantly higher than they were before the tightening cycle began in 2022.\"\n\n\n\n\n\nThe outlook for households and businesses has soured markedly from a few months ago, when bonds traders were pricing in one or two more cuts.\n\n\n\n\n\nIG market analyst Tony Sycamore said: \"This isn’t the statement of a central bank with one hand hovering over the rate hike button,\" adding that CPI data points to a broader rise in inflation \"part of which could prove persistent.\"\n\n\n\n\n\n— With additional reporting by the Australian Associated Press.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 42
  },
  {
    "url": "https://www.theage.com.au/politics/federal/australia-social-media-ban-live-updates-children-under-16-barred-from-social-media-apps-as-world-first-legislation-takes-effect-20251209-p5nm5i.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Australia social media ban LIVE updates: PM lauds decision as children under 16 barred from social media in world-first; Wells says more than 200,000 TikTok accounts deactivated",
    "publish_date": "Wed, 10 Dec 2025 13:03:50 +1100",
    "category": "finance",
    "authors": [
      "Brittany Busch",
      "Bronte Gossling"
    ],
    "text": "It was May 2024 when Nova 96.9 host Michael ‘Wippa’ Wipfli launched 36 Months with Rob Galluzzo, founder of production company Finch.\n\nThe campaign was named for the 36 months between ages 13 to 16, which researchers say is a critical phase of psychological development for children.\n\nMichael ‘Wippa’ Wipfli at a press conference in Canberra in November, when the law passed. Credit: Alex Ellinghausen\n\n“Imagine a product, let’s say a shampoo, which, when used by children, caused half of them to become depressed, to self-harm, to develop an eating disorder, or to become suicidal,” Wipfli wrote for this masthead in June 2024.\n\n“It would be ripped from the shelves, the owners locked away with blood on their hands. I wish I could say I’m exaggerating, but the harsh reality is that children under 16 are not yet ready to navigate social media safely.”\n\nThe federal government then announced in September 2024 that it planned to limit teens’ use of platforms such as Instagram, TikTok and Facebook. In November 2024, Prime Minister Anthony Albanese confirmed children under 16 would be banned from social media, and the Online Safety Amendment (Social Media Minimum Age) Act 2024 was given royal assent on December 10, 2024, exactly a year before its implementation.\n\nLoading\n\n“Today, December 10, 2025, is now marked in history as the day the law changed after the Australian government chose the wellbeing of teenagers first,” Wipfli said today to applause and cheers in a press conference at Kirribilli House in Sydney.\n\n“It’s an important day. They chose to put the wellbeing of Australian families first, and the Australian government has shown the world that it’s OK to say to big tech, ‘Stop, this isn’t working, and we can do better for our kids.’\n\n“We led a campaign with one simple aim: to delay the age kids could become a citizen of a social media platform from 13 to 16. Just 36 months. That’s all we wanted. A chance for kids to get to know themselves before the world does.”",
    "source": "TheAge",
    "cluster_id": 23
  },
  {
    "url": "https://www.theage.com.au/business/companies/locksley-lights-up-new-rare-earths-trend-in-california-20251210-p5nmii.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Locksley lights up new rare earths trend in California",
    "publish_date": "Wed, 10 Dec 2025 12:58:25 +1100",
    "category": "finance",
    "authors": [
      "James Pearson"
    ],
    "text": "Locksley Resources has deployed ultra-high-resolution geophysics at its Mojave project in California to uncover a brand new rare earths trend just metres from its El Campo prospect.\n\nFlying at just 35 metres above ground with ultra-tight 40-metre line spacing, the heli-survey has peeled back decades of low-resolution legacy data to reveal a much crisper geological picture.\n\nLocksley Resources’ new geophysical survey has unearthed a parallel thorium trend to its El Campo rare earths project and next to MP Materials’ massive Mountain Pass mine.\n\nAt the heart of the story is the discovery of two thorium anomalies within Locksley’s claims. The first is a well-defined target in the company’s Northern blocks, marked by distinctive weathering that follows local drainage. It also lines up with a broad, diffuse magnetic response, potentially pointing to altered rocks or changes in lithology.\n\nHowever, it’s the second anomalous thorium zone that has raised more than a few eyebrows. This fresh target appears to sit just 700 metres to the east and parallel to Locksley’s existing high-grade El Campo prospect. Parallel systems can often multiply project scale quickly if the geology stacks up.",
    "source": "TheAge",
    "cluster_id": 24
  },
  {
    "url": "https://www.theage.com.au/traveller/travel-news/nikon-comedy-wildlife-winners-2025-20251210-p5nmhs.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Nikon Comedy Wildlife Winners 2025",
    "publish_date": "Wed, 10 Dec 2025 12:47:57 +1100",
    "category": "finance",
    "authors": [
      "Katherine Scott"
    ],
    "text": "Remove items from your saved list to add more.\n\nYou have reached your maximum number of saved items.\n\nSave this gallery for later\n\nAdd galleries to your saved list and come back to them anytime.\n\nGot it",
    "source": "TheAge",
    "cluster_id": 25
  },
  {
    "url": "https://www.theage.com.au/sport/soccer/foster-happy-with-socceroos-draw-20251210-p5nmi9.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Foster happy with Socceroos draw",
    "publish_date": "Wed, 10 Dec 2025 12:45:59 +1100",
    "category": "sports",
    "authors": [],
    "text": "Foster happy with Socceroos draw\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 26
  },
  {
    "url": "https://www.theage.com.au/goodfood/melbourne-eating-out/kick-off-summer-finally-at-one-of-these-12-hot-new-melbourne-bars-20251201-p5njv9.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Kick off summer (finally!) at one of these 12 hot new Melbourne bars",
    "publish_date": "Wed, 10 Dec 2025 12:42:15 +1100",
    "category": "finance",
    "authors": [
      "Emma Breheny"
    ],
    "text": "Collection\n\nKick off summer (finally!) at one of these 12 hot new Melbourne bars\n\nSpring was MIA but summer is officially here. Celebrate with a mango and sake cocktail on a resurrected city rooftop, $15 martinis that come with a loyalty card, and fried goat’s cheese at a St Kilda newcomer built for group hangs.",
    "source": "TheAge",
    "cluster_id": 27
  },
  {
    "url": "https://www.theage.com.au/politics/federal/a-profound-reform-pm-20251210-p5nmi3.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "A profound reform: PM",
    "publish_date": "Wed, 10 Dec 2025 12:37:38 +1100",
    "category": "finance",
    "authors": [],
    "text": "A profound reform: PM\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 28
  },
  {
    "url": "https://www.theage.com.au/culture/live-reviews/melbourne-review-wrap-perfume-genius-20251204-p5nl1d.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "It was a moody start for this Euphoria star’s Melbourne gig",
    "publish_date": "Wed, 10 Dec 2025 12:17:11 +1100",
    "category": "entertainment",
    "authors": [
      "Vyshnavee Wijekumar",
      "Nadia Bailey",
      "Thuy On",
      "Jessica Nicholas"
    ],
    "text": "MUSIC\n\nPerfume Genius ★★★★★\n\nForum Melbourne, December 4 Mike Hadreas, better known as Perfume Genius, has a chameleon’s voice, switching deftly from shimmering falsetto to an otherworldly, wavering register that seems to emanate from deep within his body. It’s a voice that’s at turns full of yearning and subtly rendered emotion or dripping with swagger and sensuality. Perfume Genius (left) performs with Aldous Harding at the Forum Melbourne on December 4. Credit: Richard Clifford All this was on full display at the Forum, where Hadreas, who has forged a career making mesmerising, impressionistic music for the queer and queer-adjacent, arrives on stage like a postmodern Saint Sebastian, ready to martyr himself to art. The tour comes off the back of his recently released seventh studio album, Glory, a work that puts his soul-baring lyrics in dialogue with layers of richly textured, cinematic instrumentation. Glory was largely written during lockdown and is a product of the uncertainty of those times: its animating themes are grief, anxiety, isolation. Despite this, it is not a depressing record, but rather something transcendent.\n\nThe show puts Hadreas’ range on display, as he moves effortlessly from the propulsive, emotionally charged suffering of In a Row to the plaintive and tender piano ballad Me & Angel. One of the most arresting moments arrives early when, in a world debut, Hadreas invites New Zealand’s Aldous Harding on stage to perform No Front Teeth. Already an album stand-out, the duet takes on new emotional resonance in this live performance, as Harding’s gossamer vocals soar to the Forum’s highest reaches and the song builds to a flaring, guitar-heavy climax. It is a rare treat for the audience and something unlikely to be repeated any time soon. Perfume Genius is a bodily performer. Credit: Richard Clifford Elsewhere, Hadreas pulls crowd-pleasing hits from the Perfume Genius back catalogue, from the deliciously camp Slip Away to the eminently danceable On the Floor (its potential goes sadly unfulfilled as Melbourne audiences simply do not dance). Otherside delivers another show highlight, as Hadreas makes inventive use of silence and negative space before unleashing beautiful aural chaos. The encore comprises two covers – Big Star’s Kangaroo and Mazzy Star’s Fade into You – before the show closes with the exhilarating and defiant celebration of queer selfhood, Queen. Hadreas is a bodily performer, contorting his limbs and executing gravity-defying back bends as he sings, though these objectively quite taxing moves seem to come to him as easily as breathing. He has a dancer’s grace and a showman’s unerring self-confidence. Yet you get the sense that everything he does on stage is for himself first: the audience is merely there as witness.\n\nReviewed by Nadia Bailey\n\nMUSIC\n\nMelbourne Women’s International Jazz Festival\n\nAshling O’Farrell / Virago with Flora Carbo ★★★★\n\nThe Jazzlab, December 7 Sonja Horbelt must be some kind of conjuror. The program for this year’s Melbourne Women’s International Jazz Festival – which Horbelt has directed for many years – is particularly impressive, with numerous acts from overseas and interstate, plus several premieres and special collaborations. Flora Carbo with Virago. Yet the budget for the 2025 festival is actually smaller than the (already slim) budget for last year’s event. Somehow, Horbelt has juggled funding sources, artist schedules and well-timed visits by expat musicians to assemble a genuinely enticing line-up. Sunday’s double bill began with an engaging set by 21-year-old trombonist and vocalist Ashling O’Farrell, the VCA’s “New Horizons” artist for 2025. O’Farrell’s tone on both trombone and vocals was suffused with an appealing warmth, augmented by the sensitive accompaniment of her rhythm section.\n\nThen came the unveiling of a newly commissioned work that was years in the planning, but which came together in less than a fortnight. Local saxophonist and composer Flora Carbo met American percussionist Sofia Carbonara in 2019, and – after Carbonara moved to Melbourne – the pair began dreaming of a full-length collaboration. That dream came to fruition last month, when Carbonara’s US-based Virago quartet flew to Australia to develop and rehearse a work written for them by Carbo, to be premiered at the festival. Loading Combining intricately notated parts with passages of free-form spontaneity, the as-yet-untitled piece made the most of the group’s unusual instrumentation: two alto saxophones, violin, cello and vibraphone. The suite opened with quivering harmonics from Carbonara’s vibraphone, beckoning the other instruments to join them and coalesce into a single, trembling note. Gradually the players began to diverge, creating a mournful dissonance as Magnolia Rohrer’s violin and Wesley Hornpetrie’s cello slid away from BethAnne Kunert’s sax, and Carbo’s mini drum machine added a subtle, syncopated heartbeat. In other sections, minimalist repetition created pulsating waves where saxes, strings and vibes moved in deft interlocking patterns, before dissolving in a swirl of improvised abstraction or settling into a glade of delicate, folk-like serenity. At times challenging, at times strikingly beautiful, this was the kind of ambitious and compelling work that festivals are made for.\n\nReviewed by Jessica Nicholas\n\nMUSIC\n\nNoël! Noël! ★★★★\n\nAustralian Brandenburg Orchestra, Melbourne Recital Centre, December 6 Brimming with festive cheer, this year’s edition of the Australian Brandenburg Orchestra’s Christmas offering took on a Spanish flavour. This musical accent honoured Tommie Andersson, the orchestra’s foundation theorbo and baroque guitar principal, who is making his final appearances with the ABO this tour after delighting audiences for nearly 40 years. This year’s edition of the Australian Brandenburg Orchestra’s Christmas offering took on a Spanish flavour. Credit: Laura Manariti Under the irrepressibly energetic direction of Paul Dyer, the orchestra and Brandenburg Choir were joined by guests Argentinian mezzo-soprano Maria Eugenia Nieva and Australian classical guitarist Andrew Blanch. Wearing a full-length bright red dress with a side slit, Nieva exuded plenty of Latin sensuality. Her strong, dark-chocolate mezzo voice animated a variety of numbers from the traditional carol Riú Riú Chiú, through Gioia & Amore by Spanish renaissance composer Soto de Langa and Nana from Six Popular Spanish Songs by Manuel de Falla to Santa la noche, an arrangement of Adolphe Adam’s beloved classic O Holy Night.\n\nBlanch, who featured prominently in the program, was especially brilliant in Albéniz’s Leyenda, arranged to showcase the simmering passion of the guitar’s rapid-fire flamenco technique. Once again, the Brandenburg Choir brought sheer delight to the choral aspect of Noël! Noël! with crisp ensemble work and crystalline diction. Between the customary bookends, Hark! The Herald Angels Sing, and O Come, All ye Faithful, came some English schmaltz courtesy of John Rutter and Philip Stopford, as well as an intense account of the Kyrie from Palestrina’s Missa Papae Marcelli. In chamber formation, the Brandenburgs themselves were in top form, bringing joyous dynamism to Monn’s Sinfonia in G and whimsy to an arrangement of God Rest ye Merry, Gentlemen. Andersson’s own solos and his poignant accompaniment of Stille Nacht (Silent Night) with its original Austrian lilt mirrored his quiet but impressive dedication. Noël! Noël! continues to be a distinctive but deservedly popular Christmas tradition.\n\nReviewed by Tony Way\n\nMUSIC\n\nParcels: LOVED Tour ★★★★\n\nSidney Myer Music Bowl, December 4 I dare you to stand still at a Parcels show. From the minute they hit the stage, the band’s blend of electro-pop and disco-pop rhythms has the crowd possessed, grooving along to the psychedelic funky beat. The Australian five-piece indie band formed in Byron Bay in 2014, and made the spontaneous move to Berlin that year. They have played some high-profile gigs in 2025, including Coachella and Glastonbury. This weekend, their national tour concludes in Sydney with two gigs on the steps of the Opera House. It’s hard to stand still at a Parcels show. Credit: Martin Philbey The band experiments with many different sounds across the set. Opening with Tobeloved, they show off their signature harmonies, reminiscent of The Beach Boys. It’s clear how Berlin club culture has influenced their music when they perform Gamesofluck, the stage lit with an electric blue as the keys and guitar pulse. They performed Overnight, a single co-produced and co-written with Daft Punk after they attended Parcels’ first-ever show in Paris in 2016; the duo’s electronic influence is evident in the live sound.\n\nFinallyover, their final song, has a much more mellow, retro rock feel like The Beatles. They perform a lengthy instrumental track which feels improvised, exerting riffs that resemble the disco energy of Boney M and AC/DC’s Thunderstruck. Parcels in full flight. Credit: Martin Philbey “I know we are a lot of people, but we move as one tonight,” says one of the band, indistinguishable in the moody lighting, and that collective feeling carries through, maintaining a chill vibe across the entire set. During Summerinlove, the crowd leans into the sexiness, with footage of couples kissing in the front row projected onto a heart-shaped kiss cam on the screen above. It’s clear the band are having just as much fun as the crowd. Patrick Hetherington’s foot pounds the stage as Jules Crommelin’s hips thrust against his guitar and Noah Hill’s neck jerks back and forth like a chicken. The band seemed to have as much fun as their energetic audience. Credit: Martin Philbey\n\nThere’s a sense of euphoria that fills the atmosphere at the all-ages concert. Like a rave, the infectious beats travel through your ears and all the way to your feet. The band asks tech staff to light up the crowd, as they peer into the masses extending up the theatre and across the green of the Sidney Myer Music Bowl. As Crommelin perches at the end of the stage, he says: “Just going to take a second to take this all in.” What a start to the summer.\n\nReviewed by Vyshnavee Wijekumar THEATRE\n\nSoul of Possum ★★★\n\nfortyfivedownstairs, until December 13 A few months ago, after nearly 10 years of consultation, parliament passed Treaty legislation for Aboriginal Victorians. It’s the first treaty of its kind in Australia and one that not only acknowledges past injustices but also commits to returning decision-making powers to Aboriginal communities. Presented within this context, this latest staging of Soul of Possum serves as a potent and topical reminder of the past that still needs present-day reckoning. Soul of Possum is based on the experiences of the playwright’s ancestors. Credit: Darren Gill\n\nBased on the personal histories of playwright Brodie Murray’s ancestors (in particular his father and grandfather), the play is a taut reenactment of an altercation between colonial soldiers and members of an Indigenous population on the Murray River in Swan Hill. With a few cast changes, Soul of Possum’s latest iteration follows a successful season at Castlemaine State Festival and Yirramboi Festival in 2021. It’s 1853 in Wamba Wamba Country and Marnuu (Balla Neba) is troubled by his dreams; the voice of Possum predicts wide-scale destruction by a hostile force, a devastation of both people and wildlife. But his fellow warriors Gundi (Wimiya Woodley) and Barru (Murray) are sceptical and mock his warnings. Meanwhile, there’s a steamboat moored at the river, with a military expedition about to disembark to open up the country for “glorious empire”. It’s a story most of us should know; this first-contact skirmish between two parties who are completely alien to the other’s customs and cultures, and the resulting and continuing legacy of settler occupation. The play asks us to imagine what it was actually like in the initial round of invasion and resistance, a pattern that would repeat itself across the land. The play is a taut reenactment of an altercation between colonial soldiers and the Indigenous population on the Murray River in Swan Hill. Credit: Darren Gill\n\nThe stage is sparse except for a large projection of the riverbank at the back, two platforms on the left that serve as the steamboat and a clump of river reeds, a tree and a campfire to the right. Loading Preview night brought some rushed dialogue from the trio of warriors that should hopefully settle for the rest of the season. Maybe they feel there’s no time to waste: under Beng Oh’s direction, the 70-minute narrative moves fast, with the plight of both sets of white and blackfellas played out in alternate scenes before they finally meet. What makes Soul of Possum interesting is that it dramatises the in-fighting among each group. The First Nations Australians lose valuable time arguing about what to do with the threat of territorial trespass while the English marauders – Captain Gibbons (Leigh Scully), Lieutenant Bankes (Gabriel Partington), Dr Wilkins (Kevin Dee) and Irish convict Yates (Luke Mason) – have their own on-board power conflicts to contend with. All four characters are performed with ease and conviction. There’s an earnestness about this play and some unnecessary repetition in the script. The ending that brings us back to the present day also seems a bit too expository after everything we’ve witnessed. Nonetheless, Soul of Possum does manage to take us into the crossfire of colonial violence in its short, sharp stage time.\n\nReviewed by Thuy On\n\nSoul of Possum was reviewed from a preview performance.",
    "source": "TheAge",
    "cluster_id": 29
  },
  {
    "url": "https://www.theage.com.au/national/queensland/burst-water-main-closes-brisbane-cbd-street-20251210-p5nmhn.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Burst water main closes Brisbane CBD street",
    "publish_date": "Wed, 10 Dec 2025 12:10:58 +1100",
    "category": "finance",
    "authors": [],
    "text": "Burst water main closes Brisbane CBD street\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 30
  },
  {
    "url": "https://www.theage.com.au/goodfood/recipes/sticky-gochujang-barbecue-chicken-20251210-p5nmh7.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Sticky gochujang barbecue chicken",
    "publish_date": "Wed, 10 Dec 2025 12:06:23 +1100",
    "category": "finance",
    "authors": [
      "Katrina Meynink"
    ],
    "text": "Step 1\n\nAdd the honey, ginger, garlic, gochujang and smoky barbecue sauce to a large bowl and stir to combine. If the marinade seems too thick, add a little olive oil. Once mixed, add the chicken and use your hands to completely coat the chicken in the marinade. If you have time, let it sit overnight in the fridge. This is not a die-hard rule – it’s a nice-to-do rather than must-do.",
    "source": "TheAge",
    "cluster_id": 31
  },
  {
    "url": "https://www.theage.com.au/world/oceania/world-watches-as-australia-s-teen-social-media-ban-kicks-in-20251210-p5nmdh.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "‘Backdoor way to control access’: World reacts to social media ban",
    "publish_date": "Wed, 10 Dec 2025 12:04:40 +1100",
    "category": "finance",
    "authors": [
      "Newley Purnell",
      "Nasteho Said"
    ],
    "text": "Australia’s landmark teenage social media ban has drawn global attention at a time when governments are increasingly enacting rules to shield minors from toxic content and cyberbullying.\n\nThe law, passed last year, mandates services such as TikTok and Instagram keep under-16s off their platforms or face fines of up to $49.5 million. Australia becomes the world’s first democracy to bring in a ban amid growing concerns about social media’s harms.\n\nAustralia has become the world’s first country to enact a ban on social media for under-16s. Credit: Getty Images\n\nMeanwhile, governments in Indonesia, Denmark, Brazil and other nations are also moving to rein in tech companies, and planning moves of their own to shield young users.\n\nSocial platforms affected in Australia include Snapchat, YouTube, Reddit and more. Of the initial 10, all but Elon Musk’s X have said they will comply using age inference – guessing a person’s age from their online activity – or age estimation, which is usually based on a selfie. They might also check with uploaded identification documents or linked bank account details.",
    "source": "TheAge",
    "cluster_id": 3
  },
  {
    "url": "https://www.theage.com.au/national/queensland/the-reason-lady-gaga-fans-were-stuck-for-hours-outside-suncorp-stadium-20251210-p5nmct.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "The reason Lady Gaga fans were stuck for hours outside Suncorp Stadium",
    "publish_date": "Wed, 10 Dec 2025 12:03:26 +1100",
    "category": "finance",
    "authors": [
      "Julius Dennis"
    ],
    "text": "Technical issues left thousands of Lady Gaga fans locked out Suncorp Stadium last night, with the show beginning nearly an hour late.\n\nProblems were discovered during the star’s soundcheck, resulting in the gates opening at 5.50pm instead of 5pm as planned.\n\nThe disruption led to some fans queuing outside Suncorp for another two hours.\n\nConcertgoers were forced to queue for hours outside Suncorp Stadium. Credit: Cameron Atfield\n\nLines to enter the stadium stretched almost to Milton train station, with thousands joining unsigned queues in the hope it would end at their nominated gate.",
    "source": "TheAge",
    "cluster_id": 32
  },
  {
    "url": "https://www.theage.com.au/world/north-america/tariff-rescue-trump-gives-band-aids-to-the-farmers-he-hurt-20251210-p5nmd1.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Tariff rescue: Trump gives Band-Aids to the farmers he hurt",
    "publish_date": "Wed, 10 Dec 2025 12:03:04 +1100",
    "category": "finance",
    "authors": [
      "Stephen Bartholomeusz"
    ],
    "text": "This is not the first time Trump has had to pay farmers compensation for his tariff. During the trade war in his first term, he handed out $US23 billion of aid. The farmers would, you’d assume, prefer to be able to trade freely rather than rely on government charity. Loading Trump and his officials have described the payments as a “bridge” to tide the farmers over until China delivers on its promises, even though the experience of the 2020 “phase one” trade deal, in which China made similar promises that it didn’t meet, suggests there’s a possibility that it will be a bridge to nowhere. It’s consistent, however, with the administration’s broader assertions that Americans only have to wait – initially it was supposed to be this year, now it’s next year and beyond – for the benefits of the tariffs to flow. The administration has previously rolled back tariffs on coffee, bananas, tomatoes and other foods that the US doesn’t produce in significant quantities in an attempt to blunt the impact of tariffs-induced spikes in prices and the cost of living for US households\n\nNow it is subsidising its own agricultural production, while blaming the Biden administration and other countries for the losses of markets and the affordability crisis for middle and lower income household in the US that its own policies have created. Trump doesn’t seem to be able to connect the dots between the cause and the effect. The hardship being experienced by US farmers isn’t only due to the closure of the Chinese market to their products after the April 2 “Liberation Day” tariffs. It’s not just a revenue problem. Their input costs have risen sharply because fertiliser prices and farm machinery prices, among other items, have also jumped because of Trump’s tariffs. The administration lowered the tariffs on some fertilisers last month in an implicit recognition of their impact, although Trump this week threatened “very severe” tariffs on Canadian potash in order to boost domestic production of fertilisers. About 95 per cent of Canada’s potash is exported, with about 50 per cent of those export volumes directed to the US. A tariff on potash would flow through to another hike in farm costs. Farm machinery prices have risen because Trump slapped 50 per cent tariffs on steel and aluminium and tariffs on other imported items used in their manufacture. About a quarter of the components in a John Deere tractor are imported.\n\nTrump, predictably, blames Joe Biden’s environmental rules for the rising cost of farm machinery and has said he will wind them back. “You buy it, it’s got so much equipment on it for the environmental, it doesn’t do anything except it makes the equipment much more expensive and much more complicated to work,” he said on Tuesday. John Deere has said that Trump’s tariffs, particularly those on steel and aluminium, will cost it $US600 million this year. It has laid off about 240 workers this year in response. The other challenge for US farmers is labour. Trump’s aggressive crackdown on undocumented immigrants has produced a shortage of labour and forced up labour costs. More than 40 per cent of US crop workers lack legal status. So, the tariffs have closed markets and reduced farm income while the tariffs and immigration policies have driven up costs. The bailout might help some farmers limp on into next year, but they aren’t a long-term response to the bind the farmers find themselves in.\n\nThe lost markets, higher fertiliser and machinery costs and shrunken pool of labour are structural changes to the economics of American farms that can’t easily, or readily, be unwound. Loading Even if China does buy more soybeans and other agricultural commodities, it will buy much less than it did before Trump decided tariffs had magical qualities, able to fix the US trade deficit, rebuild the US manufacturing base, reduce US deficits and debt, fund $2000 “dividends” to households and even enable the abolishment of US income taxes. Oh, and bail out farmers. China helped build the infrastructure in Brazil than has enabled it to displace the US as its major supplier of soybeans. It has also begun buying the beans from Argentina, much to the chagrin of the US farmers, who saw their administration give that country a $US20 billion bailout package that helped it sell up to $US7 billion of soybeans to China. Having been burned twice by Trump’s tariffs, China will maintain the diversity of supply it has helped create. Its market, and those of other countries hit by the tariffs, will never be as open to US producers as they once were.",
    "source": "TheAge",
    "cluster_id": 33
  },
  {
    "url": "https://www.theage.com.au/business/companies/vanishing-act-the-anika-wells-expenses-exclusive-pulled-by-news-corp-20251208-p5nlti.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Vanishing act: The Anika Wells expenses exclusive pulled by News Corp",
    "publish_date": "Wed, 10 Dec 2025 11:59:45 +1100",
    "category": "finance",
    "authors": [
      "Calum Jaspan"
    ],
    "text": "So you see the dilemma for the News Corp editors? While the story and its critical tone in highlighting Wells’ use of taxpayer funds was arguably fair, she made the trip to promote the ban News Corp says it was central in establishing. Ultimately, the exclusive was retracted after a few hours online. A Google search from Wednesday afternoon, the day after the story was published. Credit: The Sydney Morning Herald However, by that time, the story had already been shared widely within a Press Gallery WhatsApp chat containing almost 200 journalists. The link to the story went dead and remains so. With no live link come Wednesday morning, it was then reported by 2GB’s Ben Fordham as an “exclusive” just hours before Wells was due to appear at the National Press Club, a week before the ban was due to go live. The story snowballed into a barrage of questions for Wells, and the subsequent expenses scandal that followed.\n\nClick on the story, and it was nowhere to be found. Credit: SMH Since then, there has been a slew of stories published regarding Wells’ use of taxpayer funds for trips for her and her family (it’s worth noting that all of these trips appear to be within the guidelines). They’ve come from multiple media sources including this masthead, The Australian Financial Review, Guardian Australia, ABC and other outlets. It was not until Friday evening, three days after the initial news.com.au article, that The Daily Telegraph wrote the first story published by a News Corp metro masthead about the unfolding government crisis, appearing in its Saturday paper. The Australian and Sky News Australia covered the story on the day of the Press Club appearance, and have done so since, but they were not involved in the Let Them Be Kids campaign. A number of sources, both in the Press Gallery and in the federal opposition, have noted the softer tone from some News Corp outlets since the expenses saga has unfolded.\n\nThe Let Them Be Kids campaign continued on The Daily Telegraph’s front page on Friday, three days after the initial expenses story was published by news.com.au. Credit: News Corp On Sunday, the News Corp tabloids’ national weekend political editor James Campbell defended Wells in a piece titled “Lay off Anika, she’s done absolutely nothing wrong”, exonerating her for each of the then-reported uses of public funds for personal events. The coverage has turned more critical in the days since, however. On Background tried to speak to Carroll and Pilling directly about why such an important exclusive was pulled. The comment we got came from a corporate spin doctor. A News Corp spokesperson confirmed the story was removed, but said all the company’s publications have been covering the debate about Wells’ travel expenses closely and prominently on their print front pages and digital home pages. They also rejected any suggestion of government interference or executive influence.\n\n“With one particular story, there was an editorial decision to review its publication. All decisions on editorial coverage have been made by editorial independent of government interference or executive directive,” the spokesperson said. The world-first social media ban came into effect on Wednesday, and has been described as a legacy-shaping policy for the Labor Party and for Wells. It was prompted and has been championed by the News Corp campaign, alongside a campaign “36 Months” led by Nova presenter Michael “Wippa” Wipfli, arguing for the minimum age for social media usage be raised from 13 to 16. Nova is also owned privately by News Corp chair Lachlan Murdoch. “Let Them Be Kids” and “36 Months” were both launched in May 2024, the former splashed across the front pages of the company’s metro tabloid newspapers at the time and in the lead-up to the ban going live this week. Both launched petitions urging the government to impose a minimum age to access social media. The tabloids’ homepages also featured countdowns to the ban going live this week.\n\nOn Sunday, The Daily Telegraph detailed the inception of policy itself and how it successfully lobbied this government. It started with an “intimate dinner at the Lodge” in September 2024 between Emma Mason, the mother of Matilda Rosewarne who took her own life as a 15-year-old after sustained online bullying; Pilling; Courier Mail editor Chris Jones; Albanese and his partner, Jodie Haydon; and Albanese’s press secretary, Fiona Sugden. “Pilling found herself arguing for a social media ban up to the age of 16, rather than 14 or 15. At some point, it occurred to her that she and Albanese were not talking about the question of a ban. They were talking about the details of a ban,” the story on Sunday read. “I knew then that this was probably going to happen,” Pilling told The Daily Telegraph. “That was a pretty pivotal moment in the process.” Pilling then went on to front and lead the campaign, which ultimately resulted in the bill that comes into effect on Wednesday. If you or anyone you know needs support, call Lifeline on 131 114 or Beyond Blue on 1300 224 636. Read the full and final “On Background” column for the year this Friday.",
    "source": "TheAge",
    "cluster_id": 34
  },
  {
    "url": "https://www.theage.com.au/national/camping-expert-reveals-how-to-nab-budget-friendly-spots-20251210-p5nmha.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Camping expert reveals how to nab budget-friendly spots",
    "publish_date": "Wed, 10 Dec 2025 11:59:14 +1100",
    "category": "finance",
    "authors": [],
    "text": "Camping expert reveals how to nab budget-friendly spots\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 35
  },
  {
    "url": "https://www.theage.com.au/sport/cricket/australian-delight-english-woe-cummins-boosts-attack-for-adelaide-test-20251210-p5nmfw.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Australian delight, English woe: Cummins boosts attack for Adelaide Test",
    "publish_date": "Wed, 10 Dec 2025 11:55:27 +1100",
    "category": "sports",
    "authors": [
      "Andrew Wu"
    ],
    "text": "It means selectors will be able to field their most experienced and arguably strongest attack of the series in Adelaide, which is staging a rare day Test.\n\nCummins’ impending return strengthens an Australian attack that has had little trouble claiming 20 wickets in each of the first two Tests.\n\nHis return had been flagged by coach and selector Andrew McDonald on Tuesday but has now been set in stone after being named on Wednesday in the 15-person squad for the third Ashes Test in Adelaide.\n\n“Pat will be back in the squad, he will be available, and that creates a different balance to our attack,” McDonald said. “Barring anything else happening in the next week, we’ll be expecting Pat to be tossing the coin and putting the blazer on.\n\n“There won’t be any match opportunities for Pat. This is something we’ve done with Pat before, off longish lay-offs, where we’ve put in some time into rebuilding his body. He’s simulated pretty much what a match will look like out there with multiple spells.\n\n“We feel as though he’ll be as best prepared as he can be. He was well ahead of where we thought he would be at, and it created a real live conversation for Brisbane. The skill readiness, the loads, how he was pulling up … it was debated a lot, leading into that Test match. So with that in mind, seeing him further advanced, we feel he’ll be really well-placed for the challenges of Adelaide.”\n\nCummins’ availability will put the squeeze on Gabba hero Michael Neser and newcomer Brendan Doggett.",
    "source": "TheAge",
    "cluster_id": 36
  },
  {
    "url": "https://au.news.yahoo.com/really-hard-minister-defends-family-012851247.html",
    "title": "'I work really hard': minister defends family travel",
    "publish_date": "2025-12-10T01:28:51Z",
    "category": "sports",
    "authors": [],
    "text": "Sports minister Anika Wells is backing herself as a hard worker as pressure mounts over her use of taxpayer money for family travel.\n\nAnd Anthony Albanese is behind her, saying she \"absolutely\" has his full support to continue in cabinet.\n\nMs Wells referred herself to the parliamentary expenses authority after it was revealed she repeatedly billed the public purse for chauffeured cars and family reunions.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\n\"I am incredibly serious about my work. I work really hard, and I try really hard every single day to discharge my duties,\" she told ABC Brisbane on Wednesday.\n\n\"I absolutely understand, appreciate and agree that parliamentarians entitlements should be scrutinised.\n\n\"That's why, for absolute transparency, I've always disclosed everything. I have always followed the rules, and I'm happy for the independent regulator to have another audit of my travels.\"\n\nVarious travel allowances are available to ministers and MPs, including a family reunion allowance into which Ms Wells and others have dipped.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nAsked if her husband should be able to enjoy big sporting games, Ms Wells said the family travel guidelines weren't new.\n\n\"No one expects any forgiveness for the political class. I understand that,\" she said.\n\n\"Yes, I always think about how this is going to look to people when we make decisions about when we use the family travel entitlement.\"\n\nMs Wells has referred herself to the parliamentary expenses authority over the incident. (Mick Tsikas/AAP PHOTOS)\n\nMs Wells charged taxpayers almost $1000 for a chauffeur for seven hours the day she attended the Australian Open in 2023 and more than $1200 for nine hours the day of the NRL and NRLW grand finals in 2022, according to the parliamentary expenses register.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nThe cabinet minister had her electorate office fitted with a secure communications facility in October 2024 when she was sports and aged care minister, despite a similar room being about a 20 minute drive away.\n\nThe prime minister dismissed the suggestion that Ms Wells should be criticised or sanctioned for claiming the allowances.\n\n\"A sports minister attending sports events should not be surprising,\" Mr Albanese told ABC Radio.\n\nHe also fired back at the opposition - who claim Ms Wells has rorted the system - by reminding them how the allowances framework was set up.\n\n\"We have an arm's length approach to this that was put in place by the former government after Sussan Ley had to resign after going to the Gold Coast and property purchases,\" he told Nine's Today show.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\n\"Anika Wells has done the right thing, but she's been out there doing her job in promoting this important legislation.\"\n\nThe current opposition leader resigned from her position as a minister in the Turnbull government after it was revealed in 2017 she had used taxpayer funds to buy a property on the Gold Coast.\n\nThat led to MPs and senators being required to report their expenses to an independent watchdog monthly.\n\nMs Wells first came under fire over flights for herself and two others that cost almost $100,000.\n\nThe embattled minister flew to New York during the United Nations General Assembly, where she spruiked Australia's social media ban for children under 16.\n\nPrime Minister Anthony Albanese is behind Ms Wells, saying she \"absolutely\" has his full support. (Mick Tsikas/AAP PHOTOS)\n\nOther politicians have also faced scrutiny over their expenses, including Trade Minister Don Farrell for claiming more than $100,000 on family reunion travel since 2022.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nOpposition communications spokeswoman Melissa McIntosh has defended her decision to fly herself and her son to Queensland, where he was taking part in Australian National Judo Championships on the Gold Coast.\n\nShe said she supported the rules being restricted or dropped to scale back entitlements.\n\n\"If you don't make some sort of change this is going to continue to happen, people are going to stretch the rules,\" the coalition frontbencher told the ABC.\n\n\"The prime minister should show some leadership on this. He should stand up and and make change.\"",
    "source": "Yahoo",
    "cluster_id": 7
  }
]