[
  {
    "url": "https://www.9news.com.au/world/elon-musk-donald-trump-feud-tesla-shares-plunge-amid-fight/0fedbc2c-ba8f-4495-8e47-b706a4767373",
    "title": "Musk suffers historic single-day loss amid vicious war of words",
    "publish_date": "Fri, 06 Jun 2025 00:46:06 +0000",
    "category": "finance",
    "authors": [
      "Jun"
    ],
    "text": "The world's richest person has lost $US34 billion ($52 billion) from his personal net worth at the end of the day, according to the Bloomberg Billionaires Index.\n\nElon Musk's staggering loss is the second-largest ever in the index's history, according to Bloomberg. It comes in second because the Tesla CEO suffered a bigger dive in November 2021.\n\nBut the loss is a drop in the bucket for the Tesla and SpaceX chief. As of June 5, he was still the richest person in the world, with a net worth of around $US334 billion.\n\nNot long ago, Elon Musk was jumping for joy while standing at Donald Trump's side. Now, he's losing billions of dollars at a rapid pace. (AP)\n\nTesla shares suffer 14 per cent plunge﻿\n\nIt comes after shares of Musk's electric vehicle company plunged more than 14 per cent, knocking about $US150 billion ($230 billion) off Tesla's market valuation as investors fear his dispute with US President Donald Trump will hurt the company.\n\nTesla closed down more than 14 per cent as a disagreement over the US president's budget bill turned nasty.\n\nAfter Musk said that Trump wouldn't haven't gotten elected without his help, Trump implied that he may turn the federal government against his companies, including Tesla and SpaceX.\n\nPresident Donald Trump inspects a Tesla with Elon Musk on the front lawn of the White House earlier this year. (AP)\n\n\"The easiest way to save money in our Budget, Billions and Billions of Dollars, is to terminate Elon's Governmental Subsidies and Contracts,\" Trump wrote on his social messaging service Truth Social. \"I was always surprised that Biden didn't do it!\"\n\nThe shares tanked earlier this year as Musk's association with DOGE damaged the car company's brand. Shares rallied when he promised in April to focus more on Tesla.\n\nNow, Wall Street is worried about Trump's hitting back at Musk through Tesla.\n\n\"Trump is tit for tat. If Musk tries to mess up Trump's bill, Trump won't be Mr Nice Guy\" when it comes to self-driving cars, which Musk acknowledges are a key to Tesla's future, said Dan Ives of Wedbush Securities.\n\nTesla's heavy losses partially reverse a big run-up in the eight weeks since Musk confirmed that Tesla would test an autonomous, driverless \"robotaxi\" service in Austin, Texas, this month.\n\nInvestors fear Trump might not be in such a rush to usher in a future of self-driving cars in the US, and that could slam Tesla because so much of its future business depends on that.\n\nREAD MORE: Trump says after Xi call that US and China will resume trade talks ﻿\n\nThe president and the richest man in the world together during happier times. (Bloomberg)\n\n\"The whole goal of robotaxis is to have them 20 or 25 cities next year,\" Ives said. \"If you start to heighten the regulatory environment, that could delay that path.\"\n\nTrump's threat to cut government contracts seem targeted more to another of Musk's businesses, SpaceX, his privately held rocket company that received billions of dollars to send astronauts and cargo to the International Space Station, provide launches and do other work for NASA.\n\nThe company is currently racing to develop a mega rocket for the space agency to send astronauts to the moon next year.\n\nA subsidiary of SpaceX, the satellite internet company Starlink, appears to also have benefited from Musk's once-close relationship with the president.\n\nOn a trip with Trump to the Middle East last month, Musk announced that Saudi Arabia had approved his satellite service for aviation and maritime use.\n\nThough its not clear how much politics has played a role, a string of other recent deals for the company in Bangladesh, Pakistan, India and elsewhere has come as Trump has threatened tariffs and sent diplomats scrambling to please the president.\n\nOne measure of SpaceX's success: A private financing round followed by a private sale of shares recently reportedly valued it at $US350 billion, up from an estimated $US210 billion just a year ago.\n\nTesla shares initially got a lift from his support of Trump. In the weeks after Trump was elected, Tesla shares surged, hitting an all-time high on December 17.",
    "source": "9News",
    "cluster_id": 0
  },
  {
    "url": "https://www.9news.com.au/world/private-japanese-moon-lander-falls-silent/9b07ba6f-aec5-407a-9eae-7fc68a22bddf",
    "title": "Private lunar lander falls silent while attempting a moon touchdown",
    "publish_date": "Fri, 06 Jun 2025 01:15:36 +0000",
    "category": "finance",
    "authors": [
      "Jun"
    ],
    "text": "A private lunar lander from Japan has fallen silent while descending to the moon with a mini rover and its fate was unknown.\n\nThe Tokyo-based company ispace said on Friday its lander dropped out of lunar orbit as planned and everything seemed to be going well. But there was no immediate word on the outcome, following the hour-long descent.\n\nAs the tension mounted, the company's livestream of the attempted landing came to an abrupt end. More than two hours later, ispace said it had yet to establish communication with the spacecraft and was still working to gain contact.\n\nREAD MORE: Musk lobs unfounded Epstein accusation at Trump\n\nThis image provided by Japanese company ispace shows the Resilience lander circling the moon, on Wednesday June 4, 2025. (ispace, inc. via AP) (AP)\n\nTwo years ago the company's first moonshot ended in a crash landing, giving rise to the name Resilience for its successor lander. Resilience carried a rover with a shovel to gather lunar dirt as well as a Swedish artist's toy-size red house for placement on the moon's dusty surface.\n\nLong the province of governments, the moon became a target of private outfits in 2019, with more flops than wins along the way.\n\nLaunched in January from Florida on a long, roundabout journey, Resilience entered lunar orbit last month. It shared a SpaceX ride with Firefly Aerospace's Blue Ghost, which reached the moon faster and became the first private entity to successfully land there in March.\n\nResilience was targeting the top of the moon, a less forbidding place than the shadowy bottom. The ispace team chose a flat area with few boulders in Mare Frigoris or Sea of Cold, a long and narrow region full of craters and ancient lava flows that stretches across the near side's northern tier.\n\nPlans had called for Resilience to beam back pictures within hours and for the lander to lower the piggybacking rover onto the lunar surface this weekend.\n\nREAD MORE: Tesla suffers wipeout as investors walk away\n\nThe founder and chief executive of ispace, Takeshi Hakamada, speaking at mission control on Friday, June 6, 2025. (ispace via AP) (AP)\n\nThe rover, weighing just 5kg, was going to stick close to the lander, going in circles at a speed of less than a couple of centimetres per second. It was capable of venturing up to one kilometre from the lander and should be operational throughout the two-week mission, the period of daylight.\n\nTakeshi Hakamada, chief executive and founder of ispace, considered the latest moonshot \"merely a steppingstone,\" with its next, much bigger lander launching by 2027 with NASA involvement, and even more to follow.\n\nMinutes before the attempted landing, Hakamada assured everyone that ispace had learned from its first failed mission.",
    "source": "9News",
    "cluster_id": 1
  },
  {
    "url": "https://www.9news.com.au/national/kings-birthday-public-holiday-2025-trading-hours-whats-open-and-closed-today-for-the--june-long-weekend/7267c9d5-31e8-447b-9371-415e53710acd",
    "title": "What's open and closed for the June long weekend",
    "publish_date": "Thu, 05 Jun 2025 06:00:05 +0000",
    "category": "finance",
    "authors": [
      "Jun"
    ],
    "text": "The June long weekend, in celebration of the King's Birthday, is approaching.\n\nWhile King Charles III's actual birthday is on November 14, in many states, the monarch's birthday is celebrated on June 10.\n\nWestern Australia and Queensland will celebrate the King's birthday ﻿in September and October.\n\nWhile King Charles III's actual birthday is on November 14, in many states, the monarch's birthday is celebrated on June 10. (Getty)\n\n﻿The remaining states and territories have slightly different regulations impacting the store's opening hours this weekend.\n\nHere's a quick state-by-state guide on the trading hours for Australia's biggest retailers this King's Birthday long weekend\n\nWoolworths\n\nWoolworths stores in NSW, the ACT, Victoria, Queensland, the Northern Territory, ﻿Western Australia and Tasmania will be open.\n\nStores in South Australia will be closed. ﻿\n\nBIG W\n\nBig W stor﻿es in NSW, the ACT, Victoria, Queensland, the Northern Territory, ﻿Western Australia and Tasmania will be open to a reduced schedule.\n\nSA stores will be closed besides Port Augusta, Victor Harbour, Mount Gambier and Murray Bridge.\n\nBig W stor﻿es in NSW, the ACT, Victoria, Queensland, the Northern Territory, ﻿Western Australia and Tasmania will be open. (Big W)\n\nDan Murphy's ﻿\n\nMost Dan Murphy's ﻿around the country will remain open, trading from 10am until either 6pm or 7pm.\n\nColes\n\nColes stores in NSW, the ACT, Victoria, Queensland, the Northern Territory, ﻿Western Australia and Tasmania will be open.\n\nStores in South Australia will ﻿be closed.\n\nSome regional stores may remain open; check with your local store.\n\nLiquorland ﻿\n\nMost stores should be open across the country. Stores in South Australia will be closed.\n\nMost Kmart stores will be open around the country, with some operating on reduced trading hours. (Bloomberg via Getty Images)\n\nKmart\n\nStores in SA will be open at reduced trading hours, most will open at ﻿11am and close at 5pm.\n\nStores in NSW, Queensland, ﻿ACT, Tasmania, Victoria, Western Australia and the Northern Territory will be open with regular hours.\n\nWestfields\n\n﻿﻿ Queensland and Western Australia: All stores are operating during normal trading hours.\n\nNSW and ACT: All centres are open from 10am and have reduced trading hours.\n\nSA: All Westfield shopping centres are closed﻿.\n\nVictoria: All Victorian centres are trading from 10am to 5pm.\n\nREAD MORE: Millions shivering as polar blast brings freezing morning\n\nBunnings stores will be open over the long weekend. (Louie Douvis)\n\nBunnings ﻿\n\nBunnings stores will be open in every state and territory. ﻿Stores will open and close at their regular time.\n\nAldi\n\n﻿Aldi stores have varied opening hours across the country. Potential shoppers are advised to check the Aldi store for more specific information.\n\nBWS",
    "source": "9News",
    "cluster_id": 2
  },
  {
    "url": "https://www.9news.com.au/national/toys-r-us-enters-voluntary-administration-for-second-time-in-australia/bde992ec-83e4-44d9-b4c6-e08bac0832c7",
    "title": "Toys R Us enters voluntary administration for second time",
    "publish_date": "Thu, 05 Jun 2025 03:00:01 +0000",
    "category": "finance",
    "authors": [
      "Jun"
    ],
    "text": "T﻿oys R Us has gone into administration five years after the company was saved.\n\nIn a statement to the ASX the company said the business has been put into voluntary administration.\n\nToys R US ANZ has put Luke Andrews and Duncan Clubb from BDO Business Restructuring in charge of the restructure to the toy store.﻿\n\nREAD MORE: Millions shivering as polar blast brings freezing morning\n\nToys R Us is now exclusively online. (Facebook/ToysRUs)\n\n\"As previously announced to the market, the company has been pursuing a recapitalisation plan with the support of its primary stakeholders,\" Toys R Us said in the ASX statement.\n\n\"However, the company is no longer in a position to pursue a solvent recapitalisation plan.\n\n\"In light of these events, the board has determined that the company is, or is likely to become, insolvent and that the appointment of an administrator is in the best interests of the company.\n\n\"The appointment of the administrators is effective immediately.\"\n\nT﻿oys R Us has gone into administration five years after the company was saved. (Getty)\n\nThe administrations will take control of the company's operations and undertake an independent assessment of its affairs.\n\nDuring this time, the company will continue to operate on a \"business as usual\" basis where possible.\n\nToys R Us has no physical stores in Australia and sells to customers online.﻿\n\nThe company﻿'s shares have been suspended from the ASX immediately pending further announcements.",
    "source": "9News",
    "cluster_id": 3
  },
  {
    "url": "https://www.9news.com.au/national/australias-top-10-most-valuable-companies-by-market-cap/e8fb79d5-b9de-4791-a5c1-39019a084a26",
    "title": "Aussie company cracks $300 billion mark to set new record",
    "publish_date": "Thu, 05 Jun 2025 01:15:16 +0000",
    "category": "finance",
    "authors": [
      "June"
    ],
    "text": "1 of 12 Attribution: Getty\n\nOne Australian company has made history, becoming the first ASX-listed entity to be valued at more than $300 billion.\n\nThe company is now worth, according to the Australian Financial Review, about 12 per cent of the entire ASX.﻿\n\nBut there are plenty of competitors that would like to take its place on top of the pile.\n\nThese are the top 10 most highly-valued ASX-listed companies.﻿",
    "source": "9News",
    "cluster_id": 4
  },
  {
    "url": "https://www.9news.com.au/national/polar-blast-brings-frosty-morning-coldest-in-brisbane-for-the-year/f966b290-a2e4-4538-b841-82eab0c76a51",
    "title": "Millions shivering as polar blast brings freezing morning",
    "publish_date": "Wed, 04 Jun 2025 22:23:22 +0000",
    "category": "entertainment",
    "authors": [
      "Jun"
    ],
    "text": "A polar blast has left millions shivering this morning as it sweeps through south-east Australia.\n\nSydney and Brisbane are both enduring their coldest mornings of the year so far, after Sydney had its coldest day of 2025 yesterday, the Bureau of Meteorology's Jonathan How said.\n\nTemperatures bottomed out at 11 or 12 degrees in some suburbs of southern Brisbane.\n\nA cold front has hit south-east Australia. (Windy)\n\nBut that sounds like a balmy spring day next to the NSW town of Goulburn, ﻿where How said the temperature this morning was -7 degrees.\n\n\"We will see a mild and sunny day today, but there is more cold weather on the way,\" How said on Today .\n\nHe said while the first week of winter had proven particularly chilly due to the current cold front, above-average temperatures were expected throughout the season on the whole.﻿\n\nREAD MORE: Jogger caught on camera defecating multiple times at Perth health clinic ﻿\n\nTourists come across extraordinary sight at Uluru View Gallery\n\nBut another polar blast is predicted to hit Australia on Saturday and Sunday.\n\nAdelaide is expecting rain tonight, while Melbourne will see falls tomorrow, How said, before the new cold front moves in on Saturday and Sunday, to also affect NSW and Queensland.\n\n\"So it is typical for this time of year, but a bit of a shock to the system,\" How said.",
    "source": "9News",
    "cluster_id": 5
  },
  {
    "url": "https://www.abc.net.au/news/2025-06-06/trump-musk-relationship-timeline/105381026",
    "title": "A black eye and online barbs: How the Musk-Trump relationship turned ugly",
    "publish_date": "Fri, 06 Jun 2025 01:07:18 +0000",
    "category": "finance",
    "authors": [],
    "text": "On July 13, 2024, the world's richest man took to the social media platform he had bought himself and made a dramatic declaration.\n\nSeconds earlier, then-presidential candidate Donald Trump had been the victim of an attempted assassination.\n\nAs Mr Trump — bleeding from the ear and raising a fist in the air — was rushed offstage by Secret Service agents, Tesla CEO Elon Musk officially endorsed him for president.\n\n\"I fully endorse President Trump and hope for his rapid recovery,\" he wrote on X.\n\nThe statement marked a new era of controversy for both men.\n\nThat age would come to an end just 10 months later — with Mr Musk, sporting a black baseball cap and a black eye to match, announcing his departure from the White House.\n\nThis week, their partnership took its ugliest turn.\n\nHow Trump went from 'not the right guy' to Musk's ally\n\nThis is far from the first time the two men have crossed paths or butted heads.\n\nDuring the 2016 election campaign, Mr Musk said in an interview he thought Mr Trump \"was not the right guy\".\n\n\"He just doesn't seem to have the sort of character that reflects well on the United States,\" the South African-born tech chief told CNBC.\n\n\" It's just, I don't know, no. \"\n\nAt the time he said Mr Trump's opponent, Hillary Clinton, had the \"right\" economic policies.\n\nBut just a month later — following Mr Trump's shock win on election night — he would accept a position on a federal advisory council alongside other Silicon Valley elites.\n\nMore than 580 tech industry employees had already signed an open letter condemning the Trump administration's planned policies to collect data on minority groups.\n\nMr Musk was not among them.\n\nHe stepped down from his position on the president's advisory councils less than six months after being appointed.\n\nMr Trump had just announced the US would withdraw from the Paris Climate Agreement — a move he would repeat during his second term.\n\nHe told followers on X — which he had yet to purchase at the time — he had done \"all I can to advise directly to POTUS\" and other White House officials.\n\nThe decision, Mr Musk said, left him \"no choice\" but to walk away.\n\nRockets, Tesla and an assassination attempt\n\nBy the end of Mr Trump's first term, he had again set his sights on rekindling the relationship with Mr Musk.\n\nThe president marvelled at his SpaceX rockets in a 2020 interview with CNBC.\n\n\"He likes rockets,\" Mr Trump told the outlet.\n\n\"And he does good at rockets, too, by the way.\n\n\"I never saw where the engines come down with no wings, no anything, and they're landing. I said, 'I've never seen that before.'\"\n\nHe dubbed Mr Musk one of the \"great geniuses\" of the modern age, \"one of our very smart people\".\n\nLoading YouTube content\n\nTwo years later the relationship had soured again.\n\nMr Musk, according to the then-presidential candidate, was \"another bulls*** artist\".\n\nClues into what the Secret Service could see before Trump was shot Photo shows A 3D model of the Trump rally shooting. The ABC has recreated the scene of the fatal rally in Pennsylvania.\n\nMr Trump, according to the Tesla CEO, needed to \"hang up his hat and sail into the sunset\".\n\nAfter ultimately being forced to follow through on his plan to buy Twitter — now X — Mr Musk reversed a ban on Mr Trump's account.\n\nAs the campaign trail heated up, however, Mr Musk announced he would not be donating to any presidential candidate, and would not endorse the Republican or Democratic parties.\n\nThe Pennsylvania assassination attempt appeared to change his mind.\n\nAccording to the Washington Post, Mr Musk would in just months become the biggest individual political donor of the 2024 election.\n\n'Dark MAGA' and the controversial launch of DOGE\n\nMr Musk made his first public appearance alongside the presidential candidate in August, jumping up and down on stage.\n\n\"I'm not just MAGA,\" he told the crowd, referencing his black \"Make America Great Again\" cap.\n\n\" I'm dark MAGA. \"\n\nThe number of public appearances and statements supporting the Trump campaign would only increase in the weeks leading up to election day.\n\nMr Musk's America PAC launched a giveaway, giving away $US1 million ($1.54 million) a day to voters in swing states.\n\nThe contest continued despite a legal challenge arguing it violated election laws.\n\nOn election night, Mr Musk joined Mr Trump and other elite members of the campaign at the Mar-a-Lago resort.\n\n\"Game, set and match,\" he wrote on X.\n\nElon Musk made multiple appearances during the election campaign. (REUTERS/Rachel Wisniewski)\n\nShortly after the sweeping win, Mr Trump announced a controversial new position for Mr Musk and entrepreneur Vivek Ramaswamy.\n\nThe two tech industry leaders were set to run \"DOGE\", the Department of Government Efficiency, with the name being a reference to one of Mr Musk's favourite online memes.\n\nUS Education Department to cut half its staff as part of DOGE Photo shows A close-up of Donald Trump wearing a white shirt, blue suit jacket and yellow tie The department said the terminations are part of its \"final mission,\" alluding to US President Donald Trump's vow to eliminate the agency.\n\n\"Together, these two wonderful Americans will pave the way for my administration to dismantle government bureaucracy, slash excess regulations, cut wasteful expenditures, and restructure federal agencies,\" Mr Trump said.\n\n\"Republican politicians have dreamed about the objectives of DOGE for a very long time.\n\n\"Importantly, we will drive out the massive waste and fraud which exists throughout our annual 6.5 trillion dollars of government spending.\"\n\nMr Ramaswamy would walk away from the project within weeks.\n\nHis departure left the president's new \"first buddy\" undeterred.\n\nMusk 'not taking the presidency' while Teslas park on the White House lawn\n\nMr Trump did not always appear comfortable with the public scrutiny regarding their close relationship.\n\nJust a month before his second inauguration, Mr Trump referenced growing complaints about Mr Musk's role at a public appearance in Arizona.\n\n\"No, he's not taking the presidency,\" he said in December.\n\n\" All the different hoaxes. The new one is that President Trump has ceded the presidency to Elon Musk. \"\n\n\"No, no, that's not happening.\"\n\nMeanwhile reports by White House insiders and former campaigners swirled that the then-president-elect had become \"annoyed\" with Mr Musk.\n\nThe tech CEO had sparked a \"civil war\" between himself and high-profile MAGA allies over H1B visas, which are short-term visas given out to foreign workers, often by tech companies, for specialised US jobs.\n\nDid Elon Musk make a Nazi or Roman salute, and what do they each mean? Photo shows SpaceX CEO Elon Musk speaks during a rally There is debate about what gesture the tech billionaire meant to make at the Capital arena on Monday. Here's what people are saying.\n\nA controversial gesture made on stage at a post-inauguration event by Mr Musk also stole headlines internationally.\n\nHis son, then-three-year-old X, appeared to shush the president in the Oval Office, seeming to tell him to \"shush your mouth\" in video taken by media.\n\nMr Musk took to the stage again at a conservative conference wielding a bedazzled \"chainsaw for democracy\".\n\nThe Trump administration was forced to argue in court that Mr Musk was not the \"head\" of DOGE, and US political media outlets reported on numerous behind-the-scenes clashes with White House officials.\n\nMr Musk was simultaneously facing turmoil outside the White House — by March Tesla shares had lost more than 50 per cent of their market value.\n\nLoading...\n\nThe company had hit its longest streak of losses since its debut in 2010, with the sharp decline linked to the Trump administration's rapidly changing tariff plans.\n\nIn an apparent attempt to throw a lifeline to his \"best buddy\", Mr Trump turned the White House's South Lawn into a temporary Tesla showroom.\n\nHe inspected five vehicles in front of the media, declaring them \"beautiful\".\n\n\"The one I like is that one, and I want the same colour,\" he said, pointing to a red car.\n\nMusk and Trump sat in the Tesla but did not take it for a test drive. (Reuters: Kevin Lamarque)\n\nMr Trump declared on his Truth Social platform he would buy Tesla.\n\nDays later during a Fox News interview, Mr Musk became emotional when asked about the performance of his companies.\n\nAsked how he managed multiple businesses and his government role, he said: \"With great difficulty.\"\n\nAt the same time, DOGE was facing widespread criticism for a lack of transparency and failure to reach its stated savings goals.\n\nThe advisory body has defunded multiple programs and made mass lay-offs, citing \"fraud and abuse\" and \"woke\" policies since it was first formed.\n\nBy the end of May, Mr Musk would make a subdued departure.\n\nThe black eye, Epstein allegations and a relationship in ruins\n\nOn May 30, Mr Musk arrived for a news conference at the Oval Office, sporting a black eye and a black DOGE cap.\n\nHe told the media the injury had occurred while playing rough with his youngest child.\n\nElon Musk and Donald Trump made their final appearance together in the White House. (Reuters: Nathan Howard)\n\nArms crossed and head down, he announced his time in the White House was over and accepted a golden key to the White House from the president.\n\n\"Elon's really not leaving,\" Mr Trump said.\n\n\" He's going to be back and forth, I think. [DOGE is] his baby. \"\n\nThe relationship between both men appeared to have fizzled out into quiet indifference — for a few days.\n\nMr Musk then criticised Mr Trump's \"Big, Beautiful Bill\", a sweeping budget reconciliation bill to fast-track spending policy.\n\nThe more than 1,000-page document, which he labelled \"pork-filled\" and \"outrageous\", would scrap electric vehicle subsidies among other changes.\n\nOn Thursday night, local time, the fallout intensified on each of their social media platforms.\n\nWhat is Trump's Big Beautiful Bill? Photo shows Donald Trump points. A rift is brewing within the US Republican Party as President Donald Trump attempts to muscle his Big, Beautiful Bill through Congress.\n\nOn X, Mr Musk appeared to take credit for the election outcome.\n\n\"Without me, Trump would have lost the election,\" he said.\n\nMr Trump then declared on Truth Social he had asked Mr Musk to leave the White House.\n\n\"Elon was 'wearing thin',\" he said.\n\n\"I asked him to leave, I took away his [electric vehicle] mandate that forced everyone to buy electric cars that nobody else wanted (that he knew for months I was going to do!), and he just went CRAZY!\n\n\"The easiest way to save money in our budget, billions and billions of dollars, is to terminate Elon's government subsidies and contracts.\n\n\"I was always surprised that Biden didn't do it!\"\n\nMr Musk labelled the accusations he went \"crazy\" as an \"obvious lie\", before hitting back with his claims.\n\n\"Time to drop the really big bomb,\" he said.\n\n\"[Donald Trump] is in the Epstein files. That is the real reason they have not been made public. Have a nice day, DJT!\"\n\nThe Trump administration has yet to respond to the allegation, which referred to documents relating to convicted sex offender Jeffrey Epstein who died in a prison cell.\n\nBeing mentioned in the files does not necessarily mean any wrongdoing.\n\nMr Trump told media on Thursday he was \"very disappointed\" in Mr Musk.\n\n\"Look, Elon and I had a great relationship,\" he said.\n\n\"I don't know if we will anymore.",
    "source": "ABC",
    "cluster_id": 6
  },
  {
    "url": "https://www.abc.net.au/news/2025-06-06/nrl-perth-bears-mal-meninga-head-coach/105384434",
    "title": "Perth Bears appoint rugby league Immortal Meninga as foundation coach",
    "publish_date": "Fri, 06 Jun 2025 00:17:40 +0000",
    "category": "sports",
    "authors": [],
    "text": "Mal Meninga has been named as the Perth Bears' foundation coach in the lead-up to their debut NRL season in 2027.\n\nMeninga will step down as Australia coach to take on the role with the Bears, which were announced as the NRL's 18th franchise last month.\n\n\"Personally, this is one of the most exciting challenges of my career,\" Meninga said.\n\n\"To have the opportunity to take our great game back to Western Australia to start a new team, and to bring with it a much-loved rugby league community and heritage brand in the Bears.\n\n\"It's a great privilege and responsibility I've been given to be one of the leaders in the formation of the club, and I'm looking forward getting to stuck into the work that needs to be done to deliver a team that represents WA and is competitive from day one.\"\n\nMeninga, a rugby league Immortal, has previously coached in the NRL, having led the Canberra Raiders between 1997 and 2001.\n\nBears faithful rejoice at NRL return Photo shows A group of rugby league fans celebrate The Bears' return to the NRL is a just reward for the diehard fans who kept the red and black colours alive during a period in the wilderness.\n\nHe made a name for himself as a representative coach, however, guiding Queensland to nine State of Origin series victories, including eight straight (2006-2013).\n\nMeninga had coached the Kangaroos from 2016 until now, winning two World Cups during his tenure.\n\nWhile in charge of the national team, he managed 26 wins from 29 Tests.\n\nAs a player, Meninga captained the Kangaroos between 1990 and 1994, and skippered the Raiders to three premierships (1989-1990 and 1994).\n\nBears chief executive Anthony De Ceglie said Meninga was an ideal choice to coach the expansion club.\n\n\"We're extremely honoured that Mal has signed on to become the inaugural coach of the Perth Bears,\" he said.\n\n\"Mal is not just an Immortal of the NRL but an immortal of the Australian sporting landscape.\n\n\"He is an icon whose leadership qualities such as courage, honesty and hard work are rightly renowned across the country and make him the perfect coach to build a brand new team from the ground up.\"",
    "source": "ABC",
    "cluster_id": 7
  },
  {
    "url": "https://www.abc.net.au/news/2025-06-06/benalla-labour-hire-breach/105381676",
    "title": "Business fined for providing farm workers without labour hire licence",
    "publish_date": "Fri, 06 Jun 2025 00:16:45 +0000",
    "category": "finance",
    "authors": [],
    "text": "A regional Victorian horticulture company and two individuals at the business have been fined a quarter of a million dollars for breaching labour laws.\n\nThe Supreme Court of Victoria found Cameron Workforce in Benalla contravened state labour laws by providing workers without a labour hire licence.\n\nThe workers picked grapes and chestnuts on several farms in the Benalla region.\n\nThe court imposed a $200,000 penalty on the business.\n\nIt also ordered a company director to pay a $40,000 penalty, and another individual was fined $15,000 for their conduct.\n\nThe hefty financial penalties come after the Labour Hire Authority (LHA) launched an investigation into overcrowded worker accommodation.\n\nThe court found workers were housed in overcrowded and substandard housing owned by a company director.\n\nThe Labour Hire Authority launched an investigation into overcrowded worker accommodation associated with the business. (Supplied: Labour Hire Authority)\n\nIt found the business failed to provide workers with a number of entitlements, including written contracts or pay slips.\n\nWorkers were not provided a minimum hourly rate under the industry award or superannuation contributions, and had their income tax withheld from wages.\n\nOther regulators to be notified\n\nThe court's findings and the financial penalty come after the company's bank account was frozen in 2023 following earlier court action taken by the LHA.\n\nThe company had agreed not to provide labour hire without a licence.\n\nThe authority said given the defendant's non-compliance with a range of laws, they would make referrals to other relevant regulators.\n\nLabour hire licensing commissioner Steve Dargavel said labour hire workers in the horticulture industry were among the state's most vulnerable.\n\n\"The industry is a key focus for our expanded compliance and enforcement program,\" he said.\n\n\"LHA will use all the tools at its disposal to remove exploitative businesses from the labour hire industry.\"",
    "source": "ABC",
    "cluster_id": 8
  },
  {
    "url": "https://www.abc.net.au/news/2025-06-06/ryan-reynolds-and-hugh-jackman-buy-australian-sailing-team/105384240",
    "title": "Ryan Reynolds and Hugh Jackman buy Australian sailing team",
    "publish_date": "Fri, 06 Jun 2025 00:15:17 +0000",
    "category": "sports",
    "authors": [],
    "text": "Hollywood co-stars and close friends Ryan Reynolds and Hugh Jackman have been named the new co-owners of Australia's SailGP team.\n\nThe actors, who starred together in Deadpool & Wolverine, announced on Thursday, US time, they had purchased the successful team, which has won three championships in just four seasons.\n\nBonds Flying Roos athletes in front of their team base in New York. (Supplied: SailGP)\n\nIn a joint statement, Reynolds and Jackman said they were \"incredibly excited to set sail together in this new adventure\".\n\n\"Hugh brings a deep love for and pride in his home country as well as being an avid fan of sailing,\" the statement said.\n\n\"He will also be bringing his overly clingy emotional support human along for the ride.\n\n\"Apologies in advance to Australia.\n\n\"No comment on whether we're writing this in our BONDS. No further questions.\"\n\nLoading...\n\nLatest sports venture for Reynolds\n\nThis is the latest sports venture for Reynolds, who purchased Wrexham AFC – one of the world's oldest soccer clubs – alongside fellow Hollywood actor Rob McElhenney.\n\nThey chronicled their 2021 purchase and subsequent stewardship of the club in wildly popular Disney+ docuseries, Welcome to Wrexham.\n\nRob McElhenney and Ryan Reynolds purchased Wrexham AFC in 2021. (Reuters: Craig Brough)\n\nThe club has gone on to achieve incredible success, becoming the first team in English football history to achieve three consecutive promotions, climbing from the National League to the Championship.\n\nReynolds and McElhenney were also among a group of investors in the Alpine Formula One team in 2023 and were part of an investment group that acquired Colombian club La Equidad this year.\n\nReynolds and Jackman join driver and chief executive Tom Slingsby in rebranding the Australian team as the BONDS Flying Roos, with underwear company BONDS as its title partner.\n\nBonds Flying Roos driver, chief executive and co-owner Tom Slingsby. (Supplied: SailGP)\n\nActors will bring 'star power' to team\n\nSlingsby, an Olympic gold medallist, told the ABC that Reynolds became interested in the purchase after members of his team attended several SailGP events.\n\n\"They pitched it to Ryan, saying, 'Hey, this is a pretty cool sport — maybe we should come check it out and get involved',\" Slingsby said.\n\n\" Sure enough, they looked into it a bit more and they were interested in buying our team. So it all went from there. \"\n\nHe said the actors would bring \"star power\" and a \"storytelling ability\" to the sport, but would not be drawn on whether a docuseries like Welcome to Wrexham was on the horizon.\n\nThe Bonds Flying Roos SailGP team boat launches on Hudson River in New York.\n\nThe rebranded team is now preparing for its debut at the Mubadala New York Sail Grand Prix, kicking off Saturday, local time.\n\n\"There no better way to cap off an amazing week for us than winning the event,\" Slingsby said.\n\n\"I'm a sailor at heart, and that's my main focus — trying to win events for Australia. That's what we've got to try to do this weekend.\"",
    "source": "ABC",
    "cluster_id": 9
  },
  {
    "url": "https://www.abc.net.au/news/2025-06-06/iga-supermarket-sale-sparks-esperance-competition-concerns/105374336",
    "title": "Concerns about a different kind of supermarket duopoly grow in WA town",
    "publish_date": "Thu, 05 Jun 2025 23:46:51 +0000",
    "category": "finance",
    "authors": [],
    "text": "The sale of a small supermarket on Western Australia's south coast has residents concerned that grocery prices will rise.\n\nEsperance, 700 kilometres east of Perth, has one Woolworths store and three IGA supermarkets.\n\nWhile it seems like a competitive market, the three smaller supermarkets appear to share more than branding.\n\nAustralian Securities and Investments Commission (ASIC) records show that, although all IGA stores are now owned by different companies with different directors, they have connections.\n\nEsperance Shire President Ron Chambers and his wife Carolyn sold the Pink Lake IGA to Perth-based Guru Merchants on Wednesday, after 16 years of ownership.\n\nThe town's other two IGA stores are owned by Air Voice Supermarkets and Esperance Fresh Food.\n\nRecords show Prashant Kariya, 38, owns businesses with the same registered addresses as Guru Merchants and Esperance Fresh Foods.\n\nHe is a former director of Air Voice Supermarket Group, which has the same contact address as Air Voice Supermarkets.\n\n\"From what I understand, on the supply chain side, they do work as a group,\" Mr Chambers said.\n\nRon and Carolyn Chambers owned the Pink Lake IGA for 16 years. (ABC Esperance: Emily Smith)\n\nNone of the listed company directors, nor Mr Kariya, could be contacted for comment.\n\nIt is understood that some may be out of the country.\n\nCost-of-living concerns\n\nEsperance Chamber of Commerce and Industry executive officer Jennifer Obourne said there were potential pros and cons to the recent sale but noted concerns about reduced competition between the town's supermarkets.\n\n\"There's essentially only Woolies versus IGA,\" Ms Obourne said.\n\nCheryl Green, president of the town's Senior Citizens Association, was worried grocery prices would go up if the three stores worked together.\n\n\"I feel it could lead to inflated prices,\" she said.\n\n\"This would impact greatly on the elderly, who already live on a limited budget.\"\n\nCheryl Green says she worries about the impact on the elderly if grocery prices rise. (ABC Esperance: Emily Smith)\n\n'No effective competition'\n\nExperts told the ABC that, while inflated prices were possible, the model could also help regional businesses survive.\n\nRaymond Da Silva Rosa, a professor of finance at the University of Western Australia, said higher grocery prices were a possibility for Esperance shoppers.\n\nHe said if the supermarkets worked together, they would have more bargaining power with suppliers and the costs of running each store would fall.\n\nBut Professor Da Silva Rosa said those savings would only be passed on to consumers if there was competition.\n\n\"The issue comes where you have one company or one person … dominate a particular town or sector and have all of the shops,\" he said.\n\n\" If they're buying all their rivals, there's no effective competition to force them to pass on any savings that might make. \"\n\nIGA stands for Independent Grocers Alliance. (ABC Esperance: Emily Smith)\n\nProfessor Da Silva Rosa said communities across Australia should look for ways to promote competition between businesses to benefit consumers, like reviewing onerous building codes or revising limits on shopping hours.\n\nMs Obourne, from the Esperance Chamber of Commerce, said it was ramping up efforts to attract a third supermarket to town or encourage an existing IGA to change its model to compete with the major supermarket.\n\nKeeping businesses in the regions\n\nElizabeth Jackson, an associate professor of logistics and supply chain management at Curtin University, said small businesses were increasingly difficult to run, especially in regional Australia.\n\nShe said that, without group models to collaborate and share costs, small supermarkets might fold in remote places.\n\nASIC records show there are connections between Esperance's three IGA stores. (ABC Esperance: Emily Smith)\n\n\"This business model is allowing food retailers to stay in the regions,\" she said.\n\nJo Aberle, executive officer of Esperance support service ESCARE, said it was a relief the town still had three IGAs in different areas, ensuring they were accessible to those with limited transport and outside standard retail hours.\n\n\"It is important those shops still exist,\" she said.\n\nThe only Food Works in Ravensthorpe, 187km west, closed this year.\n\nThe Pink Lake IGA store in Esperance sold this week. (ABC Esperance: Emily Smith)\n\nMore stores in fewer hands\n\nIGA stands for Independent Grocers of Australia.\n\nBut ASIC records show Mr Kariya, who has connections to all three Esperance IGA stores, directs more than 40 companies, many of which are IGA stores.\n\nYet Esperance is far from the only place where local stores are falling into fewer hands.\n\nRon and Carolyn Chambers have sold the Pink Lake IGA. (ABC Esperance: Emily Smith)\n\nAcross South Australia and New South Wales, for example, the Romeo family owns more than 40 IGAs and Foodland stores, according to their website.\n\nMetcash, a large corporation that owns the IGA brand, said it was not unusual for one person or group to own a series of stores.\n\n\"While many are owned by single store operators, there are successful multi-store groups in the network,\" a spokesperson said.\n\n\"As a wholesaler and banner operator, we do not have oversight, nor do we control, the way independent retailers structure their business entities.\"\n\nAsked whether a concentration of ownership could harm IGAs \"independent\" reputation, Ms Jackson did not think so.\n\n\"What it's very careful to talk about is independence from the big players,\" she said.\n\n\"It's still a lot smaller than the Coles, Woolworths, Aldis of this world.\"\n\nIn 2023, Metcash said Coles and Woolworths accounted for 65 per cent of grocery sales in Australia, while it held 6.5 per cent of market share.",
    "source": "ABC",
    "cluster_id": 10
  },
  {
    "url": "https://www.abc.net.au/news/2025-06-06/australia-could-bargain-over-beef-ban-trump/105384276",
    "title": "Australia could bargain over partial US beef ban in Trump tariff talks",
    "publish_date": "Thu, 05 Jun 2025 23:25:59 +0000",
    "category": "finance",
    "authors": [],
    "text": "Australia could use a biosecurity ban against some US-slaughtered beef as part of tariff negotiations with America, as Anthony Albanese prepares for an expected meeting with US President Donald Trump.\n\nA blanket ban on US beef imports to Australia was lifted in 2019, but restrictions remain on Canadian and Mexican cattle slaughtered in America.\n\nAustralia has been undertaking a review of those biosecurity rules, after the Trump administration requested they be lifted.\n\nTrump spruiks his 'success' since inauguration as steel tariffs take effect Photo shows Donald Trump standing next to three men in bright orange protective clothing inspecting a wheel of steel cable Donald Trump has raised the tariff rate on foreign importers of steel and aluminium goods shipped to the US from 25 per cent to 50 per cent.\n\nA government source familiar with the negotiations told ABC News that pork remained off-limits due to high biosecurity risks.\n\nThe source said beef was being positioned as a bargaining chip to help reset trade ties after the US imposed harsh tariffs on Aussie exports — including 50 per cent on steel and aluminium — and 10 per cent on all products.\n\nOfficials believe limited regulatory changes could be made without compromising Australia's food safety — although they acknowledge the risk of backlash from local farming groups.\n\nChris Parker, the head of peak body Cattle Australia, acknowledged beef had become a \"watershed issue\" for the Trump administration but that the industry would need to be assured the US was able to \"trace\" Canadian and Mexican cattle to mitigate risk.\n\nThe prime minister is expected to meet with Mr Trump on the sidelines of the upcoming G7 summit in Canada, with trade high on the agenda.\n\nIf the meeting goes ahead it is not expected to produce a final agreement, but could lay the groundwork for further trade and tariff negotiations.\n\nPM previously ruled out bargaining over beef\n\nAmerica has previously raised biosecurity rules as one of a list of trade grievances with Australia.\n\nDuring the recent election campaign, Mr Albanese said those issues were not up for negotiation.\n\n\"Not on my watch. We will negotiate sensibly but we won't undermine the biosecurity system,\" he told reporters on April 1.\n\nAlbanese won't budge on key US grievances, as Trump's 'liberation day' looms Photo shows Anthony Albanese speaking at a press conference. An updated list of grievances published by the United States trade office has set its sights on Australia's pharmaceutical sector, biosecurity protections and laws requiring the social media giants to pay for news.\n\nOn Friday, Prime Minister Anthony Albanese again insisted he would not compromise on biosecurity as part of tariff negotiations and said the sector was engaged in discussions.\n\n\"If things can be sorted out in a way that protects biosecurity of course,\" he said.\n\n\"We don't say no, we don't want imports in here for the sake of it but our first priority is biosecurity and there'll be no compromise on that.\"\n\nResponding to initial reports in the Nine Newspapers, which the ABC has confirmed, Nationals senator Bridget McKenzie told Sky Australia's multi-billion-dollar beef industry should not be used as \"pawns\" in tariff negotiations with the US.\n\n\"We need to be making decisions about importing beef based on science and the biosecurity risk posed by those imports, not in some sort of compromised deal or no deal trade-off with the United States,\" she said.\n\nThe Coalition's trade spokesperson Kevin Hogan said Australia should not \"slacken\" its biosecurity laws and that any decision should be \"based on rigorous, science-based assessments, not political expediency\".\n\nNationals leader David Littleproud said US beef from Mexico and Canada \"poses a potential risk to our industry and ignoring those risks would be dangerous.\n\n\"Rather than jeopardise our beef industry, Australia should be leveraging off our strong historical ties and areas such as critical minerals and AUKUS.\"\n\n'Pretty simple requirement' from industry\n\nAustralia has not imported any beef from the US since the ban was lifted in 2019.\n\nA spokesperson for the Australian Meat Industry Council noted the US had an \"active technical request\" to expand beef access into Australia, which was \"undergoing the usual scientific risk assessments against Australia's biosecurity and food safety requirements.\n\n\"Our expectation is that the normal process will continue and the US's request will only be approved should it meet Australia's biosecurity appropriate level of protection and equivalence to our food safety requirements,\" the spokesperson said.\n\nMr Parker said the beef industry had a \"pretty simple requirement\" for the standard the US industry would have to meet for their request to be granted.\n\n\"The concern is the ability of the US system to be able to provide traceability,\" he told the ABC.\n\n\"They insist that we provide that level of traceability for our beef going to their country and it's not unreasonable for us to have a requirement where we want to see at least equivalence of traceability so we have a good sense of where this is coming from.\n\n\"Our position is the US needs to demonstrate that it can either trace cattle born in Mexico or Canada or has systems that are equivalent to Australia's traceability before imports should occur … That's something we've made very clear to the government.\"\n\nMr Parker said his organisation was in \"ongoing communication\" at the highest levels of the Australian government over biosecurity and did not want scientific standards to be \"compromised\" or \"traded off for preferential access\".\n\nHe added that US beef, which is currently more expensive, was not a \"huge commercial risk\" for Australian businesses, which already export 70 per cent of the beef they produce locally, but that the issue had symbolic importance to the Trump administration.\n\n\"My view is that this has become a watershed issue for [the US],\" he added.\n\n\" They believe we're one of the last countries that doesn't accept their beef, even though we do accept their beef. I think it's almost a point of honour for them. That's the way I'd look at it. \"\n\nAgriculture Minister Julie Collins said the government would not \"compromise\" on biosecurity and that any decision to allow expanded access for US beef would be \"made based on science and evidence\".",
    "source": "ABC",
    "cluster_id": 11
  },
  {
    "url": "https://www.abc.net.au/news/2025-06-06/socceroos-japan-five-quick-hits-world-cup/105383152",
    "title": "Five quick hits: Behich puts Australia closer to World Cup qualification",
    "publish_date": "Thu, 05 Jun 2025 23:19:02 +0000",
    "category": "sports",
    "authors": [],
    "text": "Aziz Behich's strike in the 1-0 victory over Japan has all but ensured the Socceroos' qualification for the 2026 FIFA World Cup.\n\nHere are the five quick hits from Thursday night's World Cup qualifier in Perth.\n\n1. Understrength Japan still slick\n\nWith a World Cup berth already secured, Japan manager Hajime Moriyasu selected a heavily rotated squad for his side's final two qualifiers.\n\nBut you wouldn't have known it early on in Perth.\n\nThe Samurai Blue dominated the ball and territory as the Socceroos sat back and allowed the visitors to dictate proceedings.\n\nJapan dictated much of the play against the Socceroos in Perth. (Getty Images: James Worsfold)\n\nA packed Perth Stadium was anxiously hushed as Japan circulated and recycled the ball with ease.\n\nThey probed, prodded and poked, but were unable to create a clear-cut chance until Yuito Suzuki danced through the Australian defence and curled his shot just wide of Matt Ryan's post midway through the opening period.\n\nThe Japanese dominance didn't end at half-time.\n\nBut — just as in the first 45 minutes — a deep Australian block stood firm after the break.\n\n2. Popovic opts for substance over sparkle\n\nAs expected, Socceroos boss Tony Popovic named a starting XI much more likely to keep a clean sheet than pose significant danger to Japan's defence.\n\nIn Jackson Irvine's absence, Popovic opted for two holders in the centre of the park in the form of Aiden O'Neil and Ryan Teague.\n\nThey were tasked with providing support to a pretty rigid defensive five.\n\nThe Socceroos did not prioritise attacking flair against Japan. (Getty Images: Robert Cianflone)\n\nWing-backs Behich and Lewis Miller were much more conservative than we have come to expect, while Australia's three central defenders — among them returning youngster Alessandro Circati — sat deep.\n\nIn attack, Popovic resisted the temptation to name any of his resident livewires from the start.\n\nA front three of Brandon Borrello, Martin Boyle and Connor Metcalfe pressed and harried but created precious little in a dour first half.\n\nAs the match progressed, a sprinkling of substitutions threatened to add some life to Australia's attack.\n\nBut that threat wasn't realised until late on.\n\n3. Set-pieces crucial for Socceroos\n\nWhen the ball was on the ground, the Socceroos couldn't get anywhere near their Japanese opponents.\n\nHowever, it looked like they stood a better chance when it was flying through the air.\n\nBehich scored his first international goal in 13 years. (Getty Images: Robert Cianflone)\n\nThe Socceroos won a few inconsequential headers from corners in the first period, but were unable to really trouble the Japanese goal.\n\nAfter the break, a looping Cameron Burgess header from a gigantic Miller throw-in and a half-chance from a Japanese lapse in concentration were the closest Australia came until Behich provided the match-winner.\n\n4. Behich becomes Socceroos hero\n\nIt was the most unlikely of moments from the most unlikely of players.\n\nAs the match headed towards stoppage time, minds around Australia were turning to what was shaping to be a nail-biting, one-off title fight of a match against Saudi Arabia on Wednesday morning AEST.\n\nThen, almost unbelievably, the Socceroos found themselves in Japanese territory.\n\nAnd for the first time for what felt like all match, they had numbers.\n\nJason Geria, on the field as a second-half substitute at right wing-back, drilled the ball into the feet of Riley McGree on the edge of the box.\n\nThe Socceroos had not beaten Japan for 16 years. (Getty Images: Robert Cianflone)\n\nMcGree, only just back from injury and on as a half-time substitute, turned adroitly, tapped it forward and made his way to the touchline.\n\nAt one stage, it looked like he had overrun it, but he found his cut-back in the nick of time.\n\nThe ball fizzed across the six yard box, evading all the likely suspects in green and gold.\n\nAnd there he was, striding assuredly towards the ball.\n\nTime stood still as Behich twisted, turned and got off a tracer bullet of a weak-footed shot.\n\nIt was the left wing-back's first international goal in 13 years.\n\n5. World Cup qualification all but secured\n\nAnd somehow, barring an almost unthinkable calamity against Saudi Arabia on Wednesday morning, the Socceroos will contest the 2026 FIFA World Cup.\n\nIt mightn't have been as cathartic a moment as John Aloisi's spot kick in 2005, or quite as clutch as Andrew Redmayne's 'Wiggles' impersonation against Peru in 2022, but it might be even more remarkable.\n\nThe Socceroos are on the doorstep of World Cup qualification. (Getty Images: James Worsford)\n\nWhen Popovic took over as coach in September 2024, Australia was out of sorts.\n\nSitting fifth in the group and fresh from the humiliation of a 1-0 loss to Bahrain and a 0-0 draw with Indonesia, automatic World Cup qualification looked like a pipe dream.\n\nNine months later, it's almost a reality.",
    "source": "ABC",
    "cluster_id": 12
  },
  {
    "url": "https://www.abc.net.au/news/2025-06-06/anger-as-brown-street-social-housing-approved-in-busselton/105379470",
    "title": "Busselton set for new social housing, despite backlash",
    "publish_date": "Thu, 05 Jun 2025 23:15:22 +0000",
    "category": "finance",
    "authors": [],
    "text": "WA's Planning Commission has approved a high-density social housing development in the state's South West despite a fierce backlash by residents.\n\nThe three-and-four-storey apartment block will be built on an unused site on Brown Street in Busselton, 223 kilometres south of Perth, by developer Housing Choices Western Australia.\n\nIt will feature 30 apartments, 16 of which will be social housing units and 14 affordable housing.\n\nWith the median house price climbing to $780,000 and rents now upwards of $800 per week, housing has become a critical issue in the community.\n\nSigns advertising the apartments on Brown Street were vandalised in February. (ABC Great Southern: Jamie Thannoo)\n\nMore than half of the public submissions opposed the development.\n\nResidents cited safety and potential antisocial behaviour as key concerns.\n\nSigns advertising the project were vandalised during the review process.\n\n\"It's great to see approval granted for much-needed housing for vulnerable people in the area,\" Planning Minister John Carey said.\n\n\"The development will transform an unused, 2,034-square-metre site into much-needed social and affordable housing in Busselton.\"\n\nJane Bennett says residents should be able to have a say on what happens in their own backyards. (ABC South West WA: Pip Waller)\n\n'Dilution, not concentration'\n\nBusselton Ratepayers Association secretary Jane Bennett said she was acutely aware of the city's housing crisis, but did not support the development as a solution.\n\n\"We desperately need housing and options for people,\" she said.\n\n\" But we're disappointed that the approval has been given and we don't feel that there's been enough consideration of residents' concerns. \"\n\nThe WA Planning Commission received 268 submissions in its public consultation period, of which 148 were strongly opposed.\n\nOther concerns included the appearance of the building and parking.\n\nMs Bennett said there had been antisocial issues at other social housing developments, including in the Perth suburb of Inglewood, where residents spoke of living in fear due to the behaviour of a small group of social housing residents.\n\nThe apartment block will include 30 units. (Supplied: Housing Choices Australia)\n\nShe said the Cook government should consider installing tiny homes throughout Busselton.\n\nA similar WA-first initiative was introduced by homeless support group Accordwest in Bunbury in 2021.\n\n\"The message is for dilution, not concentration of these housing units,\" Ms Bennett said.\n\n\"There is concern that people are just trying to stop development, but our view is that the problems that could happen with this could spread to the entire community.\"\n\nCity backs development\n\nBusselton's council has endorsed the housing development, citing a crippling shortage of local housing stock.\n\nCity of Busselton Mayor Phill Cronin said the development should help people in need of community housing.\n\nPhill Cronin says the council supports the state government project. (Supplied: Phill Cronin)\n\n\"The city's current community housing units, which are provided for the over 55s, are at full capacity and have a wait list of in excess of 50 people,\" Mr Cronin said.\n\n\"So this development may assist to alleviate some of those pressures.\n\n\" Housing development near the centre of Busselton is also considered appropriate as it enables easier connections to health, community facilities and services, shops and public transport. \"\n\nBrown Street runs through the centre of Busselton. (ABC South West WA: Pip Waller)\n\nThe Planning Commission added a condition to change the visual appearance by painting the apartment in a lighter colour palette, in keeping with the coastal surroundings, rather than the original red brick.\n\nMs Bennett said ratepayers against the project would not give up.\n\n\"Just because they've said it's approved doesn't mean that there aren't many avenues we can go through to make sure that we're not dismissed,\" she said.\n\n\"Our voices in Busselton will be heard.\"\n\nConstruction is expected to begin early next year.",
    "source": "ABC",
    "cluster_id": 13
  },
  {
    "url": "https://www.abc.net.au/news/2025-06-06/nz-parliament-haka-suspensions-maori-party-treaty-bill/105383804",
    "title": "Māori Party MPs receive record suspensions over haka protest",
    "publish_date": "Thu, 05 Jun 2025 23:08:46 +0000",
    "category": "sports",
    "authors": [],
    "text": "New Zealand's parliament has handed record suspensions to three Indigenous Māori MPs after they performed a haka to protest a controversial bill last year.\n\nMāori Party co-leaders Rawiri Waititi and Debbie Ngarewa-Packer were banned from parliament for 21 days, the longest-ever suspension, while New Zealand's youngest MP Hana-Rāwhiti Maipi-Clarke was suspended for seven days.\n\nThe three performed the haka last November ahead of a vote on a bill that would have reinterpreted the 185-year-old Treaty of Waitangi between the British and Indigenous Māori that still guides the country's policy and legislation.\n\nLoading...\n\nIn footage widely shared around the world, Ms Maipi-Clarke, 22, rose to her feet, ripped up the bill and started performing a protest haka.\n\nShe was joined by Mr Waititi and Ms Ngarewa-Packer, who strode on the chamber floor chanting the Ka Mate haka famously performed by the All Blacks rugby team.\n\nMs Ngarewa-Packer was also accused of pointing her fingers in the shape of a gun at the leader of the right-wing ACT Party, David Seymour, who had proposed the bill.\n\nThe trio were hauled before parliament's Privileges Committee, but refused to take part in the hearing.\n\nSupported by New Zealand's three governing coalition parties, the bans were voted on and accepted on Thursday.\n\nMāori MPs say suspensions an effort to silence them\n\nMs Maipi-Clarke responded by saying Māori would not be silenced.\n\n\"A member can swear at another member, a member of cabinet can lay their hands on a staff member, a member can drive up the steps of parliament, a member can swear in parliament, and yet they weren't given five minutes of suspension,\" she said.\n\n\"Yet when we stand up for the country's foundational document, we get punished with the most severe consequences.\"\n\nShe told parliament ahead of the vote that the suspension was an effort to stop Māori from making themselves heard in parliament.\n\nNew Zealand's parliament debated the controversial Treaty Principles Bill last year. (AP Photo: Mark Baker)\n\n\"Are our voices too loud for this house? Is that the reason why we are being silenced? Are our voices shaking the core foundation of this house? The house we had no voice in building … We will never be silenced and we will never be lost,\" she said.\n\nMr Waititi held up a noose as he rose to speak in defiance of the ban on Thursday.\n\n\"In my maiden speech, I talked about one of our [ancestors] who was hung in the gallows of Mt Eden Prison, wrongfully accused,\" he said.\n\n\"The silencing of us today is a reminder of the silencing of our ancestors of the past, and it continues to happen.\n\n\" Now you've traded the noose for legislation. Well, we will not be silenced. \"\n\nWhile the members are suspended, they will not be paid or be able to vote on legislation.\n\nSuspending MPs is rare in New Zealand's parliament, and only three have been suspended in the past 10 years, according to New Zealand parliamentary services.\n\nBefore Thursday, the longest suspension was for three days, according to New Zealand representatives who spoke earlier in the day.\n\nJudith Collins, who heads the Privileges Committee and serves as attorney-general, had previously told parliament that the haka forced the speaker to suspend proceedings for 30 minutes and that no permission had been sought to perform it.\n\n\"It's not about the haka … it is about following the rules of parliament that we are all obliged to follow and that we all pledged to follow,\" Ms Collins said.\n\nThe opposition Labour party called for a compromise and proposed censure instead of suspension.\n\nLabour considers the suspension to be \"inconsistent with the fundamental nature of this democracy\", Labour parliamentarian Duncan Webb said on Thursday.\n\n\"This decision is wildly out of step with any other decision of the Privileges Committee,\" Mr Webb said.\n\nThe parliamentary committee panel members were sharply divided over the haka protest and the lengthy punishments were advanced only because the government has more MPs in the parliament than the opposition.\n\nCalls to recognise Māori protocols in parliament\n\nInside and outside parliament, the haka has increasingly been welcomed as an important part of New Zealand life.\n\nThe sacred chant can be a challenge to the viewer but is not violent.\n\nAs Māori language and culture have become part of mainstream New Zealand in recent years, haka appear in a range of cultural, somber and celebratory settings.\n\nWhat's behind huge Māori protests in New Zealand? Photo shows A silhouetted crowd standing in the morning mist, holding up large flags. Are the proposed changes to New Zealand's foundational document more bark than bite?\n\nThey have also been performed in parliament to welcome the passage of high-profile laws.\n\nSome who decried the protest haka in parliament cited its timing, with Ms Maipi-Clarke beginning the chant as votes were being tallied and causing a brief suspension of proceedings.\n\nShe has privately apologised for the disruption to parliament's speaker, she said on Thursday.\n\nSome MPs urged their peers to consider rewriting rules about what members could do in parliament to recognise Māori cultural protocols as accepted forms of protest.\n\nOne cited changes to allow breastfeeding in the debating chamber as evidence the institution had amended rules before.\n\nThursday's debate capped a fraught episode for race relations in New Zealand, beginning with the controversial bill that the Māori Party MPs opposed.\n\nIndigenous Māori people marched in protest against the Treaty Principles Bill last year. (AP: Mark Tantrum)\n\nThe bill, which was defeated in parliament, sought to reinterpret the Treaty of Waitangi and put the new interpretation to a public vote.\n\nIt was widely seen as an attack on Māori because for more than five decades the treaty has been used to enshrine Māori rights into law.\n\nThe Treaty Principles Bill sparked massive protests across New Zealand, including in a hikoi — or march — of nearly 40,000 people arriving on the steps of parliament in late November.\n\nThe Māori Party, as well as other community members, have been central to organising those protests, as well as resisting the proposal inside parliament.\n\nABC/wires",
    "source": "ABC",
    "cluster_id": 14
  },
  {
    "url": "https://www.abc.net.au/news/2025-06-06/moon-lander-falls-silent-while-attempting-a-moon-touchdown/105383890",
    "title": "Japanese spacecraft goes down during attempted Moon landing",
    "publish_date": "Thu, 05 Jun 2025 22:53:56 +0000",
    "category": "finance",
    "authors": [],
    "text": "Japanese company ispace says it has not been able to contact its uncrewed Moon lander Resilience since its lunar touchdown attempt.\n\nIt is two years since ispace's failed inaugural mission.\n\nResilience was part of ispace's bid to become the first company outside the United States to achieve a Moon landing.\n\nResilience targeted Mare Frigoris, a basaltic plain about 900 kilometres from the Moon's north pole.\n\nThe company's live-streamed flight data showed Resilience's altitude suddenly falling to zero shortly before the planned touchdown time of 4:17am on Friday, Japanese time, following an hour-long descent from lunar orbit.\n\nThe company said in the broadcast: \"We haven't been able to confirm [communication].\"\n\nIt said control centre members would \"continuously attempt to communicate with the lander\".\n\nFootage from the control room showed the nervous faces of ispace engineers.\n\nEmployees of ispace wait for a signal from the lunar lander. (Reuters: Manami Yamada)\n\nA room of more than 500 ispace employees, shareholders, sponsors and government officials abruptly grew silent during a public viewing event at mission partner Sumitomo Mitsui Banking Corp in the wee hours in Tokyo.\n\nThe status of Resilience remains unclear, and ispace CEO Takeshi Hakamada will hold a press conference about the outcome of the mission today, the company said.\n\nIn 2023, ispace's first lander crashed into the Moon's surface due to inaccurate recognition of its altitude. Software remedies have been implemented, while the hardware design is mostly unchanged in Resilience, the company has said.\n\nResilience carried a four-wheeled rover built by ispace's Luxembourg subsidiary and five external payloads worth $24 million, including scientific instruments from Japanese firms and a Taiwanese university.\n\nPrivate Moon landing likely to have failed Photo shows A space craft with three wheels and a photo of the earth in the background and a large rocket-like device beside it Japanese startup company ispace says there is a \"high probability\" its unmanned spacecraft has crashed on the moon.\n\nFollowing the landing, the 2.3 metre-high lander and the microwave-sized rover were scheduled to begin 14 days of exploration until the arrival of a freezing-cold lunar night, including capturing images of regolith, the Moon's fine-grained surface material, on a contract with US space agency NASA.\n\nShares of ispace more than doubled this year on growing investor hopes for the second mission, before calming in recent days. As of Thursday, ispace had a market capitalisation of more than 110 billion yen ($1.2 billion).\n\nResilience in January shared a SpaceX rocket launch with Firefly's Blue Ghost lander, which took a faster trajectory to the Moon and touched down successfully in March.\n\nIntuitive Machines, which last year marked the world's first touchdown of a commercial lunar lander, made its second attempt in March but the lander Athena ended on its side on the lunar surface just as in the first mission.\n\nJapan last year became the world's fifth country to achieve a soft lunar landing after the former Soviet Union, the US, China and India, when the national Japan Aerospace Exploration Agency achieved the touchdown of its SLIM lander, yet also in a toppled position.\n\nReuters",
    "source": "ABC",
    "cluster_id": 1
  },
  {
    "url": "https://www.abc.net.au/news/2025-06-06/letters-for-brian-book-offers-dementia-insight-brian-johnson-nrl/105353618",
    "title": "Diary entries give insight into dementia and life after rugby league",
    "publish_date": "Thu, 05 Jun 2025 22:09:53 +0000",
    "category": "sports",
    "authors": [],
    "text": "Despite everything she has gone through, Karen Johnson does not hesitate when asked how she feels about rugby league now.\n\nShe still loves it.\n\nMs Johnson was brought up on the sport as a child, her late husband Brian played professionally for the St George Dragons, and it \"paid the bills at our house forever\".\n\nBrian Johnson played 149 games for the St George Dragons. (Supplied: Karen Johnson)\n\nBut she cannot bring herself to recommend rugby league to a child considering taking it up.\n\n\"The knowledge has been there for a long time that knocks to the head, if you're susceptible to it, can cause CTE [chronic traumatic encephalopathy, a brain disease],\" she said.\n\n\"Getting people to realise that hits to the head, landing on the ground, shaking your brain around is terrifying.\n\n\" I wouldn't get a seven-year-old to put their head in a scrum, but that's my experience and there are so many players of Brian's era who don't have CTE. \"\n\nMs Johnson's husband Brian died from Alzheimer's disease, which the family believes was likely caused by CTE.\n\nAs a coping mechanism while caring for her husband in his latter stages of life, Ms Johnson wrote him letters that she has now turned into a book.\n\nDreaded collisions\n\nBrian Johnson was the 1980 Dally M fullback of the year and, on top of his six years at the Dragons, played a season for Eastern Suburbs and three years in Warrington in the United Kingdom.\n\nEven at the height of his career, he dreaded the collisions of the sport.\n\n\"He could run really fast, and he said he could run really fast because he was scared of getting tackled,\" Ms Johnson said.\n\n\"I'm really pleased to see [the NRL] trying to mitigate the [concussion] risks involved, but I don't think you can stop men and women wanting to play the sports they want to play.\"\n\nKaren and Brian Johnson were married in 1979. (Supplied: Karen Johnson)\n\n'I just needed to talk to him'\n\nMs Johnson said the diary letters to her husband helped her process the challenges she was facing.\n\n\"At the time, I probably left the house for about six hours a week and other than that, I was just home caring and it was at the stage where we could virtually not go out,\" she said.\n\n\"When he was tucked up in bed, I just needed to talk to him, so when he wasn't there, I was still talking to him like I used to.\"\n\nBrian Johnson died in January 2016.\n\nThe letters have formed the basis for Ms Johnson's book, Letters For Brian.\n\nRugby league writer Roy Masters said the book was a fitting tribute, an educational resource and a love story.\n\n\"The words 'humanitarian' and 'rugby league' rarely appear in the same sentence but Brian, particularly as father, friend, husband and coach, united them,\" he said.\n\nBrian Johnson had a successful coaching career with Warrington Wolves after he retired from playing. (Supplied: Karen Johnson)\n\nMs Johnson said that while writing the letters and her reflections on the time had been a cathartic experience, the book also provided an insight into life while caring for someone dying from Alzheimer's disease.\n\n\"I think people assume that dementia means you can't find your car keys and you can't remember your children's names, but that's not necessarily it,\" she said.\n\n\"They don't realise that everything that we do and what we think is intrinsic is memory — how to eat, how to speak, how to read, how to write.\n\nWhat is CTE? Photo shows A silhouette of an Australian football umpire throwing the ball in from the boundary. The brain disease is caused by repeated head injuries. It's most commonly associated with athletes in contact sports, but there's a lot researchers are still trying to learn about it.\n\n\"Brian stopped being able to read and if he wanted to write something down and he had objects on his desk, he didn't know which one the pen was.\"\n\nMs Johnson said she had shared more of her life in the book than she had expected to, but she wanted it to be a resource for people going through the same experience.\n\n\"People are going to know more about us than I realised, but I kind of wrote it for me,\" she said.\n\n\"The interest in it has taken me by surprise and I'm actually surprised at how long it is because people research books, but I just sat and had a stream of consciousness and just wrote it.\"",
    "source": "ABC",
    "cluster_id": 15
  },
  {
    "url": "https://www.abc.net.au/news/2025-06-06/e-scooter-injury-toll-enormous-perth-hospital-trauma-chief-says/105383108",
    "title": "Trauma surgeon describes 'enormous' daily e-scooter toll in hospital",
    "publish_date": "Thu, 05 Jun 2025 22:06:43 +0000",
    "category": "finance",
    "authors": [],
    "text": "A friend of a 51-year-old man who died after being hit by an e-scooter on the weekend has criticised local and state governments for not further regulating e-rideables, saying the father’s death was avoidable.\n\nHis comments come as the head of trauma services at Royal Perth Hospital separately laid bare the extent of e-scooter-related injuries, highlighting the lifelong impacts they can have on patients.\n\nPedestrian Thanh Phan was in Perth’s CBD for dinner on Saturday night when he was struck by a hired e-scooter.\n\nThe death of a pedestrian hit by an e-scooter in Perth has put their use under scrutiny. (ABC News: Glyn Jones)\n\nA 25-year-old UK tourist, Alicia Kemp, has been charged with causing death while driving dangerously under the influence of alcohol.\n\nIn response, the City of Perth yesterday suspended the hiring of e-scooters indefinitely.\n\nMr Phan's family friend Lee Carroll said that ban should be made permanent.\n\nThanh Phan died in hospital after he was struck by an e-scooter in Perth's CBD. (Supplied)\n\n\"E-scooters for hire are motorised vehicles that require no licence to operate and are often stationed outside bars and clubs, inviting use by people who may be intoxicated,\" he said.\n\n\"This is a dangerous and unacceptable situation.\n\n\"We call on the City of Perth and the minister for transport to take decisive action.\"\n\nDeath preventable\n\nIt came as the head of trauma services at Royal Perth Hospital told the ABC he and his team were seeing patients seriously injured by e-scooters every day.\n\n“Our patients are experiencing lifetime consequences or not even surviving from injuries sustained on an e-scooter,” Dieter Weber told Stateline.\n\nProfessor Weber sees people die in hospital after being in e-scooter crashes. (ABC News: Jake Sturmer)\n\nMr Carroll pointed to that situation, saying it should have been enough of a trigger for governments to take action.\n\n“Allowing motorised vehicles to share footpaths with pedestrians is fundamentally unsafe,” he said.\n\n\" Thanh's death was preventable. \"\n\nE-scooter injuries 'enormous'\n\nWhile not commenting on Mr Phan's death directly, Professor Weber said he wanted people to see e-scooter injuries as avoidable, especially by riders wearing helmets and not riding while under the influence of drugs or alcohol.\n\n\"The thing that sticks out to me as a surgeon is sadly the number of families that we've seen at the bedside in tears with their loved ones tragically injured from these e-scooters,\" he told Stateline.\n\nIntoxication and lack of helmet usage play roles in many cases Professor Weber sees. (ABC News: Sophie Johnson)\n\n\"The facilities here at the state trauma centre allow us to give our patients the best possible care, but sadly … the pathway to try to get back to as normal a life is not always possible with these terrible injuries that we're seeing.\n\n\"We're seeing the whole range of injuries from broken bones, significant internal organ injuries, brain injuries, spinal cord injuries, injuries that have not just immediate impact but then lasting lifelong effects on patients.\n\nProfessor Weber says the impacts can be life-altering. (ABC News: Jake Sturmer)\n\n\"It's this enormous group of patients that we've had to treat from injuries that are preventable.\"\n\nPlea to consider 'harm and risk'\n\nProfessor Weber welcomed the City of Perth's decision as a step towards an \"informed discussion\" about e-rideables and what role society wanted them to play.\n\nPerth to suspend e-scooter hire Photo shows E-scooters The City of Perth says it will suspend the hire of e-scooters from midday today, following the death of a 51-year-old pedestrian who was struck in the CBD by a hired e-scooter.\n\n\"Sadly, I don't think we've fully understood the potential consequences of riding one of these vehicles,\" he said.\n\n\"Of course society is going to look at some of the benefits of e-scooters, but the harm, the risk, needs to be understood as well so that we can make an informed, balanced decision.\"\n\nIt was that risk of serious, life-altering injuries which Professor Weber — a trauma and general surgeon — most wanted policymakers to understand.\n\n\"Are these people able to get back into the community, back to their usual jobs?\" he said.\n\n\"Or do they place an additional burden on our society as we have to nurse them through a remainder of a life in a nursing home, or whether they don't make it at all?\"\n\nStark statistics\n\nWhile some suggest there is little difference between e-scooters and traditional bicycles, Professor Weber disagreed.\n\n\"They're being used by different people in different situations, potentially with different understandings,\" he said.\n\n\"The crashes can be equally bad, but one's battery power … presumably it's going to be at a higher energy, that's going to cause an impact and injury and the aftermath that we see on our clinical wards.\"\n\nMost of those injured and admitted to hospital are riders, but pedestrians end up there too. (ABC News: Glyn Jones)\n\nResearch by Professor Weber and and his colleagues found that of 81 Western Australian patients who sustained serious e-scooter related injuries between 2017 and 2022, 40 per cent were not wearing a helmet and were four times more likely to sustain a head injury.\n\nAround 35 per cent were under the influence of either drugs or alcohol.\n\nHe said while the \"majority\" of patients admitted to the state trauma centre were e-scooter riders, there was a \"large group\" who had been hit by the devices.\n\nEnforcement blitz\n\nEarlier in the week, WA Transport Minister Rita Saffioti acknowledged: \"We need to increase our compliance.\"\n\nWA Police announced late yesterday they would be undertaking \"state-wide targeted enforcement operations\" in response to a number of incidents, including Mr Phan's death.\n\nThe transport minister admits there needs to be more compliance. (ABC News: Jake Sturmer)\n\nA spokesperson said they would be focusing on speeding, mobile phone use, riding under the influence, use of helmets, passenger limits and underage riders.\n\nPolice and Road Safety Minister Reece Whitby said he was open to making any change \"that will make people safer\".\n\nCalls for e-scooter footpath ban Photo shows Two orange e-scooters in the Perth CBD on a footpath. The death of a Perth man who was hit by an e-scooter in the city's CBD on the weekend sparks calls for an overhaul of WA's e-rideable laws.\n\n\"I want to consult with local government, and the operators about geo-fencing these devices so they can't be used in certain areas, at certain times, at certain speeds,\" he told ABC Radio Perth.\n\nThe shadow road safety minister called for the government to go further, describing the state's laws as \"no longer fit for purpose\".\n\n\"The rules we do have are being widely ignored, and compliance is almost non-existent,\" Julie Freeman said, pointing to a Road Safety Commission report which last month found a \"concerning\" lack of compliance.\n\nMs Freeman called for penalties for modifying e-scooters to increase their maximum speed, and a broader strengthening of penalties which the report found were \"much lower\" in WA compared to elsewhere in the nation.\n\nJulie Freeman does not think the current laws are up to scratch. (ABC News: Chris Lewis)\n\nShe also called for urban planning to separate cars and pedestrians from e-rideables and bikes.\n\nA study which looked at six European countries, published in 2023, found higher rates of e-scooter accidents in cities with a lower density of bike lanes.",
    "source": "ABC",
    "cluster_id": 16
  },
  {
    "url": "https://www.smh.com.au/world/prince-louis-plays-up-at-platinum-pageant-20220606-p5ardk.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Prince Louis plays up at Platinum Pageant",
    "publish_date": "Fri, 06 Jun 2025 12:01:02 +1000",
    "category": "finance",
    "authors": [],
    "text": "Prince Louis plays up at Platinum Pageant\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 17
  },
  {
    "url": "https://www.smh.com.au/national/from-tiktok-to-tv-robert-irwin-is-hot-property-20250603-p5m4ix.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "From TikTok to TV, Robert Irwin is hot property",
    "publish_date": "Fri, 06 Jun 2025 12:00:00 +1000",
    "category": "finance",
    "authors": [
      "Andrew Hornery"
    ],
    "text": "The stars are aligning for Robert Irwin. For a start, America’s ongoing fascination with Australia’s preternaturally perky, croc-wrangling family has delivered a $58 million, media-impact jackpot for underwear-maker Bonds after the buff 21-year-old appeared in the brand’s racy campaign designed to help it break into the $13 billion US men’s market. A Bonds analysis of the campaign, which launched in April, revealed that it had generated a staggering nine billion “media impressions” in its first 24 hours in the US. How much Bonds, which manufactures offshore and was sold to American giant Hanes in 2016, paid Irwin is unclear, but he’s pulled off something previous brand ambassadors, such as Sarah Murdoch, Paul Mercurio, Pat Rafter and even Chesty Bond, couldn’t: becoming the second-most popular global trending topic on TikTok in the first week of the launch. Crikey!\n\nRobert Irwin modelling for Bonds US advertising campaign\n\nThanks to Irwin’s khaki-clad, in-house management team, which is headed by “mummager” Terri, the youngest Irwin is fast becoming the brightest star in the Irwin firmament, flogging everything from Twisties and Hello Fresh to Pop! dolls and holiday parks. (The Irwin empire already includes a multimillion-dollar property portfolio, from Australia Zoo to the 130,000-hectare Steve Irwin Wildlife Reserve in Cape York, and a slew of residual-earning TV shows, books and magazines.)\n\nIrwin’s media career started in 2004 when a horrified world watched his dad, Steve, cradle his month-old son while dangling a chicken carcass over the snapping jaws of a 3.8-metre-long saltwater croc. The former chairman of the National Australia Day Council, Lisa Curry, later revealed the stunt cost Irwin snr the Australian of the Year honour.",
    "source": "SMH",
    "cluster_id": 18
  },
  {
    "url": "https://www.smh.com.au/property/news/triguboff-grandchildren-splash-millions-in-vaucluse-watsons-bay-20250602-p5m461.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Triguboff grandchildren splash millions in Vaucluse, Watsons Bay",
    "publish_date": "Fri, 06 Jun 2025 11:56:13 +1000",
    "category": "finance",
    "authors": [
      "Tawar Razaghi"
    ],
    "text": "While Harry Triguboff retained his title of richest man in Australia last week thanks to his Meriton property empire, his grandchildren were doing what their grandfather knows best – shoring up Sydney real estate.\n\nMiki Hendler is the latest grandchild to have bought into their favourite neighbourhood of Vaucluse, given the Triguboff clan already own two sizable compounds in the prestigious suburb.\n\nThe house bought by Miki Hendler and husband Elliot Solomon was on the market for the first time in more than 25 years.\n\nThe Meriton development manager and her husband, Elliot Solomon, chief executive of his family-run hospitality company Solotel (which runs a long list of popular venues such as The Golden Sheaf, North Bondi Fish, Aria, Chiswick and Opera Bar to name a few) have emerged as the buyers of the $20 million-plus grand five-bedroom, four-bathroom Vaucluse house after Hendler lodged a caveat on the home.\n\nIt sold through Paul Biller of Biller Property, who declined to comment.",
    "source": "SMH",
    "cluster_id": 19
  },
  {
    "url": "https://www.smh.com.au/sport/nrl/flyers-and-flops-every-club-rated-in-half-yearly-report-card-20250605-p5m565.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Flyers and flops: Every club rated in half-yearly report card",
    "publish_date": "Fri, 06 Jun 2025 11:53:37 +1000",
    "category": "sports",
    "authors": [
      "Adrian Proszenko",
      "Robert Dillon"
    ],
    "text": "A stat that tells the story: 34 points; that’s how many points the Eels have conceded in the past three games. A huge improvement to their defence after conceding 56 points to the Storm in a horror start to the Ryles campaign. Eels star Zac Lomax. Credit: Getty Images The surprise packet: Isaiah Iongi took over from fan favourite Gutherson after just the one NRL appearance at the Panthers. A revelation in the No.1 jersey, Iongi is a leading contender for rookie-of-the-year honours. Has a long NRL career ahead of him. What they need to do in the second half of the season: Build on the improvement they have shown in recent weeks. Iongi, Ryley Smith, Jordan Samrani, Kitione Kautoga, Joash Papalii and Sam Tuivaiti will gain valuable experience that will put them in good stead for future campaigns. Prediction: The top eight looks beyond them, but they have the opportunity to put distance between themselves and the wooden spoon. Mitchell Moses and Zac Lomax are the club’s two best players, but they have only played twice together. If both remain fit, Parra can climb a couple of ladder rungs.\n\nSea Eagles Mid-season status/the story so far: Seventh, six wins, six losses. Their position on the ladder is an accurate reflection of their season. As good as anyone on their best day, but the same can be said of their worst. Wildly inconsistent - as shown on Thursday night when they were run down by the Knights after leading 16-0 at half-time. The Daly Cherry-Evans saga hasn’t helped. A stat that tells the story: Just seven games to date for Tom Trbojevic. The injury-prone star has been down on form and confidence, to the point where he was overlooked for Origin selection. Needs a big, and injury-free, second half of the season if the Sea Eagles are to contend. Lehi Hopoate is a rising star. Credit: Getty Images The surprise packet: Lehi Hopoate has been a revelation. Whether on the wing or filling in at fullback for Trbojevic, he has shown enough to suggest he will be the club’s long-term No.1. Behind only James Tedesco for most run metres.\n\nWhat they need to do in the second half of the season: Such a Jekyll and Hyde team. They need to find consistency if they are going to press for the top four. Prediction: Feels like they will be just outside the top-four, which is where you need to be a legitimate challenger. Not enough has been made about just how big the loss of Taniela Paseka for the season has been. Big Brookvale home crowds are a huge factor in the run home. Storm Mid-season status/the story so far: Fourth, seven wins, four losses. Started the season as premiership favourites, and deservedly remain so despite a few unexpected dips to date. Boast the best spine in the game, and they are finally getting some much-needed game time together. Feels like their best footy is in front of them.\n\nA stat that tells the story: 63 tries, one more than the second-placed Raiders. Ryan Papenhuyzen leads the league with 12 of them as well as a league-leading 134 points. The fullback has made a huge difference after stringing some games together. The surprise packet: Trent Loiero is such a Storm story. Just fits into the system, does his job and is largely underrated by all but his teammates. Finally got the recognition he deserves when Billy Slater handed him a Maroons debut for this year’s series. Ryan Papenhuyzen is in fine form. Credit: Getty Images What they need to do in the second half of the season: Stay healthy and secure a top-four spot. If they can do this, a premiership is theirs to lose. The pain of last year’s defeat, coupled with Penrith’s decline, leaves Melbourne as the team most likely. Prediction: Storm to win the comp. So far, they have performed well below their ability. It’s a long season, they don’t need to peak too early, so Craig Bellamy should have them firing come finals time.\n\nRaiders Mid-season status/the story so far: Second, 10 wins, three losses. Along with the Bulldogs, this is the success story of the season. One of the spoon favourites at the start of the season, they are shaping up as a not-so-dark horse for the title. Ethan Strange, Kaeo Weekes and Savelio Tamale are just some of the big improvers. A stat that tells the story: 84 penalties conceded, the most in the NRL. Just shows how much improvement there is in this team if they can improve their discipline. And here’s a positive stat: an NRL-best 21,704 run metres. That’s a great platform for the halves and speed men to work from. The surprise packet: Corey Horsburgh. So strained was the relationship between he and coach Ricky Stuart that they didn’t speak for much of last season. Now “Big Red” is back to his rampaging best and is making a strong claim to return to the Origin arena.\n\nWhat they need to do in the second half of the season: Most of the hard work has already been done. They have banked competition points during a horror road stretch early, and will finish with two byes and a fair share of home games in the run home. Just need to keep doing what they are doing. Prediction: They are probably a season or two from being in a position to take out the whole thing, but there’s no reason why this side can’t get to at least the penultimate weekend of the season. Warriors Chanel Harris-Tavita and teammates celebrate. Credit: Getty Images Mid-season status/the story so far: Third, nine wins, three losses. The Warriors suffered a harsh reality check last season, finishing 13th, but have rediscovered their 2023 form. The loss of Mitch Barnett to a season-ending knee injury is a body blow, but after six wins in their past seven games, the Wahs have momentum.\n\nA stat that tells the story: 31 Dally M points. That’s how many votes Warriors halfback Luke Metcalf had accumulated to lead the race for the medal when the polling went behind closed doors. Metcalf’s hot form has allayed fears following the retirement of club legend Shaun Johnson. The surprise packet: Leka Halasima, the 19-year-old back-rower, has emerged as a genuine weapon, scoring four tries in 12 games. He’s progressed from the bench to the starting line-up and is likely to be terrorising edge defenders for many years to come. What they need to do in the second half of the season: The Warriors are a genuine chance of winning all six of their remaining home games. If they pick up a few victories on the road - and they have won their past four in Australia - they’ll be right up at the pointy end of the top four come finals time. Prediction: Anything less than a top-four finish and a home play-off would be a surprise/disappointment for fans across the ditch.\n\nDragons Clint Gutherson’s presence gives the Dragons hope in their quest for the finals. Credit: Getty Images Mid-season status/the story so far: Eighth, five wins, six losses. Funny team, the Dragons. They haven’t earned many accolades this season, but after back-to-back wins against Brisbane and Newcastle, they are in the finals mix. At their best, they’re dangerous, as they showed in round three when they beat Melbourne. A stat that tells the story: Three losses by one point. The Dragons have been denied by field goals in games against Souths, Parramatta and the Warriors. Those results could well come back to haunt them at season’s end. The surprise packet: Jacob Liddle. When the Dragons signed former Test hooker Damien Cook, Liddle must have been wondering if he’d spend the whole season in NSW Cup. Instead, the 28-year-old has starred off the bench, featuring in all 11 games and scoring six tries.\n\nWhat they need to do in the second half of the season: Dragons coach Shane Flanagan is craving consistency. Prediction: Given what appears to be a tough draw, they’ll fizzle out in the coming weeks. Rabbitohs Rookie half Jamie Humphreys has given Souths a new dimension with his kicking game. Credit: Getty Images Mid-season status/the story so far: Ninth, six wins, six losses. The Rabbitohs are lurking with intent at the midway point, and there is no better coach than Wayne Bennett to get them firing when it counts. Injuries have been a constant drain on Bennett’s resources, but with their main men back on the paddock, anything is possible.\n\nA stat that tells the story: 8442 total kick metres. The Bunnies have gained more ground via the boot than any rival team, mainly thanks to rookie halfback Jamie Humphreys. That’s a valuable asset, especially in tight games. The surprise packet: Humphreys has been a revelation after Souths signed him from Manly with one NRL game under his belt. He has a great kicking game, defends strongly and looks every inch a quality, long-term first-grader. What they need to do in the second half of the season: If they can keep their big guns on the field, the rest will take care of itself. Jack Wighton and Cody Walker return this week for the clash with the Raiders in Canberra, and they will make a massive difference. Prediction: At $51 to win the title, and $2.75 to make the top eight, Souths are arguably the best-value bet in the NRL. They’re not far off where they need to be and will be winning games in the finals.\n\nKnights Mid-season status/the story so far: 15th, four wins, eight losses. What a horror show it has been. Coach Adam O’Brien recently said he has the full support of the board. What he needs is the full support of the players. They seem bereft of ideas in attack and still don’t know what their best halves pairing is. A stat that tells the story: 4708. That’s how many tackles - the most in the league - that the Knights have made this season. You just can’t win games without the football. The Knights are also the worst team for errors (170) and ineffective tackles (252). That’s a damning set of numbers. Young Knights half Fletcher Sharpe. Credit: Getty Images The surprise packet: It’s evident that Fletcher Sharpe is a special talent, but he’s really shone when replacing Kalyn Ponga at fullback. If fortunes don’t improve, expect more debate about whether Ponga should shift from fullback to the halves.\n\nWhat they need to do in the second half of the season: Settle on a halves combination. They used 11 pairings last year and are no closer to arriving at a solution. Unless they do so, their points drought will continue. Prediction: The Knights have lashed out up to $14 million to poach Dylan Brown. O’Brien won’t be around to coach him if the Knights can’t improve their fortunes. They shouldn’t get the spoon, but it will be a close-run race. Cowboys The Cowboys are well placed in the race for the play-offs. Credit: Getty Images Mid-season status/the story so far: Sixth, five wins, one draw, five losses. North Queensland have broken even thus far, but their inconsistency will have frustrated coach Todd Payten. The form they showed during a four-game winning run gave a glimpse of their potential, and their destiny is in their own hands over the second half of the season.\n\nA stat that tells the story: 81 offloads. Only the Rabbitohs (79) have produced fewer this year. Maybe the Cowboys need to take a few chances in possession to create more second-phase football. The surprise packet: Robert Derby. The Papua New Guinea Test winger debuted in the NRL last year but clearly has found his feet this season, scoring seven tries in nine games, including a hat-trick against Gold Coast. He should keep improving with experience. What they need to do in the second half of the season: The Cows need to capitalise on their home-ground advantage and win their remaining six games in Townsville. If they pick up another win or two on the road, that will secure a top-eight finish. Prediction: They should make the eight, judging by their draw. Dolphins\n\nDolphins skipper Tom Gilbert is unlikely to play again this season. Credit: NRL Photos Mid-season status/the story so far: 10th, five wins, seven losses. Rookie coach Kristian Woolf endured a disastrous start, losing his first four games, but to his credit, the Dolphins are still in the race for a first finals berth. They face a crucial game against the Dragons on Friday. The winners will stay in touch with the top eight, the losers could find themselves playing catch-up for the rest of the season. A stat that tells the story: The Dolphins have a points differential of plus-42 (294 for, 252 against). That’s the sixth best in the NRL and highlights what a competitive team they are. They don’t beat themselves, and they’ll keep every opponent honest in the dogfight to reach the play-offs. The surprise packet: Kulikefu Finefeuiaki joined the Dolphins from North Queensland and has since established himself as a starting edge forward, playing the full 80 minutes in his past four games. He’s provided an ageing pack with some energy and spark. What they need to do in the second half of the season: The loss of Tom Gilbert and Daniel Saifiti to injuries, on top of the uncertainty surrounding Tom Flegler, will test the Dolphins’ depth. They’ll need their forwards to break even each week so that Isaiya Katoa can create chances for strike weapons Hamiso Tabuai-Fidow and Herbie Farnworth.\n\nPrediction: They’ll be thereabouts but might just miss the eight for the second season in a row. Broncos Broncos captain Adam Reynolds and coach Michael Maguire speak to the media after another loss. Credit: NRL Photos Mid-season status/the story so far: 11th, five wins, seven losses. Their 50-14 thrashing of the Roosters in round one has all but faded from memory, and the Broncos are now seriously under the pump. In saying that, they have a star-studded roster and enough time to get their season back on track. Over to you, Michael Maguire. A stat that tells the story: Six losses in their past seven games. How can a team with so much talent, and who started the season with such high expectations, have performed so poorly?\n\nThe surprise packet: Journeyman centre Gehamat Shibasaki has returned to the Broncos and grabbed his opportunity. He has played in every game this season, scoring six tries in the process. What they need to do in the second half of the season: For starters, a win against last-placed Gold Coast on Saturday is a non-negotiable. If they lose that, the Broncos are officially in crisis, and all bets are off. The return from injury of Reece Walsh might be just what they need to resurrect an underwhelming campaign. Prediction: They’ll turn it around, qualify for the postseason, and do some damage when they get there. Sharks\n\nMid-season status/the story so far: Fifth, seven wins, five losses. The jury remains out. After a slow start to the season, Nicho Hynes is playing good football. Addin Fonua-Blake has been a welcome addition. It remains to be seen whether this team is better placed for a title tilt than in previous years. A stat that tells the story: Nicho Hynes has 16 line-break assists, the most in the league. There have been times when Braydon Trindall has taken the control of Cronulla’s attack, but they are starting to strike a nice balance. The spotlight will be on whether Hynes can deliver when it counts. Nicho Hynes is warming into the season. Credit: Getty Images The surprise packet: When voting went behind closed doors, Will Kennedy was on 29 Dally M points. That’s just one point off the leader, Luke Metcalf. Incredibly, Kennedy remains unsigned for next season. Surely the Sharks can find the cap space to table a decent deal. What they need to do in the second half of the season: It’s a downhill ski for the Sharks; they don’t leave Sydney after round 18, and they still have two byes to come. They need to take advantage and cement a spot in the top four. After making the preliminary final last year, they need to go a step further.\n\nPrediction: A top-four spot, a home (region) final, but no premiership. This is a very open competition and the Sharks should again be one of the last four teams standing. Just feels like they are lacking that X-factor required to win the whole thing. Roosters There has been no more exciting player in the NRL this season than Mark Nawaqanitawase. Credit: NRL Photos Mid-season status/the story so far: 12th, five wins, seven losses. Win, lose or draw, the Roosters have been entertaining this season. They’ve unearthed an excitement machine in ex-Wallaby Mark Nawaqanitawase and some dynamic tyros like halfback Hugo Savala. The outstanding form of skipper James Tedesco has also been a highlight. Even if they don’t reach the finals, they’re good to watch. A stat that tells the story: 82 tackle breaks by James Tedesco. That’s the most in the NRL, by the way. At 32, “Teddy” is playing out of his skin and doing his utmost to inspire his young teammates.\n\nThe surprise packet: Robert Toia made his NRL debut in round one, and three months later was a shock choice for Queensland in the Origin series opener. Still only 20, he is presumably only going to improve. What they need to do in the second half of the season: Only once this season have the Chooks won consecutive games. They’ll be hoping the return of Sam Walker helps them start stringing wins together. Prediction: They have the talent to make the finals, but perhaps not the consistency. Tigers Are the Tigers better off without Lachlan Galvin? Credit: Getty Images\n\nMid-season status/the story so far: 13th, five wins, seven losses. After three consecutive wooden spoons, the only way was up for the Tigers. But they remain a work in progress and have had to deal with the ongoing distraction that culminated in Lachlan Galvin joining Canterbury. With that saga done and dusted, the Tigers can now focus on trying to win games. A stat that tells the story: 166 offloads, the most in the NRL. Terrell May has delivered an NRL-best 36 on his own. That suggests the Tigers are playing an enterprising brand of football and trying to keep the ball alive. More power to them. The surprise packet: Starford To’a arrived at the Tigers in 2022, after being discarded by Newcastle. This season, he has established himself as one of the most-improved centres in the NRL, scoring seven tries in nine games. Outside him, Sunia Turuva has scored nine tries. Beware the Tigers’ right edge. What they need to do in the second half of the season: Benji Marshall has his team heading in the right direction, but he’ll wants more consistency, especially in defence. Only the Titans have conceded more points this season. Prediction: They won’t finish last, which amounts to progress. But they won’t make the play-offs.\n\nPanthers Penrith will need to produce a remarkable turnaround to have any hope of defending their title. Credit: NRL Imagery Mid-season status/the story so far: 14th, four wins, seven losses, one draw. The four-time premiers kicked off their season by beating Cronulla in Las Vegas, but then followed an inexplicable five-game losing streak that left them at the foot of the table. The champions will need to produce something special simply to make the finals. A stat that tells the story: 281 points conceded. That works out to be 23.4 points per game, seven points a game more than last season’s average. Penrith have been statistically the most miserly defensive team in the NRL throughout their reign. Now they rank 11th. Sure, they’ve lost some key players, but the cracks in a once-impregnable system are the worry. The surprise packet: Thomas Jenkins. Spent most of last year in Newcastle’s NSW Cup side and was pondering retirement before the Panthers threw him a lifeline. The utility back has since appeared in nine NRL games to resurrect his career.\n\nLoading What they need to do in the second half of the season: Penrith probably need eight wins from their remaining 12 games, a tall order but far from impossible. They know what’s required, but there is precious little margin for error. Prediction: As Manchester City discovered this season in the English Premier League, dynasties can be suddenly dented. It will require a minor miracle for Penrith to reach the finals, let alone retain their title. But this team have a habit of rewriting the record books, so one way or the other, it will be intriguing to see how this plays out. Titans Mid-season status/the story so far: 17th, three wins, eight losses. This has been a tale of woe. On paper, this is a team that should not be sitting in last place. The contract clause in Des Hasler’s contract appears deliberately leaked, putting even more pressure on the coach. They are deserved favourites to finish last.",
    "source": "SMH",
    "cluster_id": 20
  },
  {
    "url": "https://www.smh.com.au/sport/afl/the-top-afl-draft-prospects-to-watch-at-this-year-s-under-18-championships-20250529-p5m3d3.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "The top Victorian AFL draft prospects to watch at this weekend’s under-18 championships",
    "publish_date": "Fri, 06 Jun 2025 11:50:20 +1000",
    "category": "sports",
    "authors": [
      "Marc Mcgowan"
    ],
    "text": "Mr Reliable. The consistent word from recruiters is that the margin between Annable’s best and worst is smaller any player in this class. He is headed to the Lions as a potential top-three pick, unless he unjustifiably slips like past academy prospects such as Tom Green and Nick Blakey. He is tough, clean and wins his own ball, and his leadership skills were evidenced in him captaining the AFL Academy team this year.\n\nShifter says: “He has as good hands as anyone we’ve seen in recent years. He doesn’t fumble, and whatever the situation, he is so clean and has great vision, with the ability to quickly making the right decision by hand and foot. He’s a rock-solid, early choice.” Cooper Duff-Tytler\n\nDuff-Tytler, who is considered a similar player – but more advanced with his football smarts at the same age – to fellow junior basketball standout Luke Jackson, is the rare ruckman in the No.1 pick mix. He dominated another standout big man, Louis Emmett, in round one of the Talent League, but talent scouts would love to see more of him as a key forward to figure out whether he genuinely has that in his toolkit.\n\nShifter says: “Cooper’s a dual-sports athlete, and the type of boy the youth of today are jealous of. He covers the ground as an athlete but also wins the ball, which not all boys at his size can do. He kicks goals on the run, can ruck, play a key position, and the early observation is whichever club he goes to will get the best out of him.”\n\nWillem Duursma The brother of AFL players Xavier and Zane and the AFLW’s Yasmin, the next Duursma might be the best and most talented of them all. He is capable of brilliance that other players are not – and often demonstrates that several times a game – but recruiters would like to see a higher work-rate and more toughness. There is significant upside here if he puts it together.\n\nShifter says: “It comes with a price when your brothers are just ahead of you, and your surname is known, but he’s lived up to every bit of that the last three years … he needs the challenge of nationals. He’s a tall midfielder, but can play back or forward as well, is a good user of the ball, strong overhead and a good athlete.” Louis Emmett flies high for a mark for Victoria Metro at last year’s national championships. Credit: AFL Photos via Getty Images Louis Emmett\n\nOakleigh Chargers/Victoria Metro, ruckman-forward, 199cm, 23/3/2007\n\nKey Talent League stats (averages): 12.5 disposals, 7.5 contested possessions, 3.5 hitouts-to-advantage.\n\nEmmett’s appeared just twice at Talent League level this season, and lowered his colours to Cooper Duff-Tytler in one of those games, but they have shared the honours across the years. They will be Vic Metro teammates. Emmett is not overly tall for a ruckman, but his excellent running ability separates him, and he also gets involved in the play and demonstrated last year he can make his mark as a forward.\n\nShifter says: “He’s not too dissimilar to Duff-Tytler: a super athlete, lovely size, covers the ground, marks it and gets dangerous when he’s forward. He is that modern-day type, [similar to] Rowan Marshall or Luke Jackson. He placed in the best-and-fairest as a bottom-ager, which is unusual as a ruckman, and is certain to be one of the first talls taken.” Oliver Greeves Eastern Ranges/Victoria Metro, midfielder, 191cm, 7/2/2007\n\nKey Talent League stats (averages): 25 disposals, 5.7 inside 50m, 5 clearances.\n\nMeet the grandnephew of the first Brownlow medallist, Edward “Carji” Greeves, a tall, strong and powerful midfielder with good skills. There are mixed opinions on whether he can be a genuine midfielder-forward at AFL level, as a Christian Petracca or Cam Rayner-type, or whether he projects more like a Patrick Cripps or Ollie Wines. There are some queries on Greeves’ running ability, but he could be a top-three selection by year’s end.\n\nShifter says: “He’s a bull who loves to hunt the ball and win the footy. He’s done it so regularly for three years, so there’s a line of sight now, but he’s raised the bar each year, in terms of performance and ball-winning ability. He’s got a wonderful, effervescent personality, and I’m expecting him to have a great championships.” Sam Grlj\n\nGrlj (pronounced “grill”) is the most explosive midfielder among this year’s prospects, and a footballer who is confident enough to take the game on, break tackles and play with speed. He takes his football seriously and brings an intensity with that approach. The most common knock from recruiters is on Grlj’s kicking, but they believe his strengths are so plentiful that it won’t be an issue in the AFL.\n\nShifter says: “Sam was forced out of the midfield last year because of the teammates he had who became AFL-listed players. He’s played across half-back, but jumped in as a midfielder in his 18th year, and he breaks lines with his dazzling pace to open the game, which is a priceless commodity. He is brave and exciting.” Max King Sydney Swans Academy/Allies, forward/midfielder, 192cm, 1/9/2007\n\nKey Talent League stats (averages): 14 disposals, 8.8 contested possessions, 5.8 score involvements\n\nKing’s raw athleticism and potential make him an exciting prospect to monitor, with his leaping and marking ability among his most eye-catching traits. He is playing various roles, including trying to go head-to-head with Dyson Sharp in the midfield last weekend, but has probably shown the most as a forward. Improving his decision-making will be crucial to whether King ends up being a top-10 selection.\n\nShifter says: “Max is highly promising, and an exciting prospect out of the Swans Academy. He is the perfect athlete, has a great spring, and he’s taken some wonderful marks the last two years. He’s a boy who is all promise and potential, and we want to see him have that breakout game, so we look forward to that in the champs.” Geelong Falcons footballer Josh Lindsay has performed well in representative matches. Credit: Geelong Falcons\n\nJosh Lindsay Geelong Falcons/Victoria Country, defender/midfielder, 183cm, 7/4/2007\n\nKey Talent League stats (averages): 26 disposals, 7.5 contested possessions, 4.5 tackles.\n\nLindsay could hardly have proven his bona fides more as one of the best-performed players in the 2025 draft class. He won the medal as Team Heppell’s best player in the 2024 Futures game on grand final day on the MCG, and collected another best-on-ground honour in this year’s first AFL Academy game. Recruiters believe Lindsay projects as a defender or wingman at this stage, but has the potential to develop into a midfielder.\n\nShifter says: “His performance is so consistent. He’s a smooth mover, covers the ground brilliantly, hits every target with pinpoint accuracy, and can play down back or on a wing. He’s a bit like [Melbourne’s] Xavier Lindsay, and he has not done anything wrong.” Archie Ludowyke Sandringham Dragons/Victoria Metro, key forward, 197cm, 19/11/2007\n\nKey Talent League stats (averages): 9.5 disposals, 5 marks, 3 goals\n\nLudowyke (pronounced “loo-doe-wick”) is viewed as this year’s best key forward prospect at this stage and a surefire top-10 selection. He is lightly framed, but the consistent view among recruiters was that he had emphatically answered queries entering the season about his combativeness and competitiveness. Ludowyke reads the play well, flies for marks, is also effective at ground level and gets into the right spots with his high IQ.\n\nShifter says: “Like all talls, it’s hard because you’re trying to project three years on with how he will develop physically, but he’s got all the tools. He’s a great size, a good athlete, his marking is spectacular, he has a lovely left-foot kick, and I liken him to a Matthew Lloyd when he was 16 or 17. He looks pretty special.” Dylan Patterson\n\nPatterson is all about speed, talent and power, has an unreal highlights reel, and scope to improve as a rugby league convert. There are recruiters who think the athletically gifted teenager could emerge as a top-five selection with an outstanding under-18 championships, whereas others are concerned with him going missing at times during matches and his willingness to commit in contests.\n\nShifter says: “Dylan was an All-Australian in the under-16s, but that was more on the glimpses he had shown. He’s had some exciting moments this year, and he has breathtaking pace and the ability to break lines, whether playing at half-back or on a wing. He has a step, too, and the ability to change lanes is so vital at AFL level.” Dyson Sharp Loading Central District/South Australia, midfielder, 188cm, 23/5/2007\n\nKey SANFL U18s stats (averages): 31 disposals, 6 clearances, 5 marks\n\nSharp has long been touted as one of the best players in the 2025 draft crop, but that also means he has been scrutinised more closely than most. Not every recruiter loves him, but those who do rate him as a genuine top-five prospect and point to his outstanding trial game last weekend for South Australia as evidence. Sharp’s supporters believe his “man-child” tag is unfair. He thrives in the contest and seems primed for a huge carnival.\n\nShifter says: “Another of the bulls. He debuted at senior SANFL level at 17, just like [Jason] Horne-Francis and these kids do, and reminded us last weekend of his elite ability in the final trial for SA against the NSW academies. He was the best player in that game, and he’s going to be highly sought-after at the end of the year.”",
    "source": "SMH",
    "cluster_id": 21
  },
  {
    "url": "https://www.smh.com.au/national/nsw/my-son-s-death-was-not-in-vain-joe-s-law-means-lives-will-be-saved-20250605-p5m591.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "My son’s death was not in vain: Joe’s Law means lives will be saved",
    "publish_date": "Fri, 06 Jun 2025 11:48:01 +1000",
    "category": "finance",
    "authors": [
      "Elouise Massa"
    ],
    "text": "On Thursday night, the NSW parliament passed “Joe’s Law”, named after my son Joe, who died in the Northern Beaches Hospital last year after a series of catastrophic medical errors.\n\nJoe’s Law is named after Joe Massa who died in September. (Left) Parents Elouise and Danny Massa. Credit: Kate Geraghty and supplied\n\nWe were moved to tears listening to members of parliament endorse the bill and share their own insights. Not one person, from any party, opposed it.\n\nOur family is forever changed. Our two other children – Grace and Teddy – did not have the chance to celebrate Joe’s second birthday or any future ones. He was less than two months away from turning two.\n\nEarlier this year, my husband Danny and I stood alongside Premier Chris Minns and Health Minister Ryan Park to announce the introduction of this landmark legislation, which prohibits new public-private partnership arrangements for the provision of acute hospital services such as emergency departments.",
    "source": "SMH",
    "cluster_id": 22
  },
  {
    "url": "https://www.smh.com.au/lifestyle/life-and-relationships/instagram-has-decided-i-m-a-sad-old-sack-it-s-only-partly-true-20250605-p5m5ae.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Instagram has decided I’m a sad old sack. It’s only partly true",
    "publish_date": "Fri, 06 Jun 2025 11:45:00 +1000",
    "category": "lifestyle",
    "authors": [
      "Kate Halfpenny"
    ],
    "text": "Fidgety while my husband drove us to the airport last Friday, I checked my email. A bald message from Instagram: my personal account had been locked due to “suspicious activity”. Here’s a recovery link.\n\nTurned out the only thing vaguely suss was I’d changed a security setting the day before. That was enough to have Meta on full alert. Thanks, I guess. But since then, no amount of link-clicking or troubleshooting-page scouring has unlocked what’s been mine since 2012.\n\nHow much longer could I spend dodging posts about gut-health gummies and Trinny Woodall’s eyeshadow? Credit: Flavio Brancaleone\n\nThirteen years of life moments – kids in everything from face paint to graduation gowns, the first photo ever taken of me and Chris together (off our gourds in a Canberra pub), ex-husbands, ex-haircuts – made inaccessible by the cold efficiency of Mark Zuckerberg’s customer service department.\n\nMy first instinct was panic. My resting heart rate shot to 87. Then: admin mode. I filled out forms that vanished into the Meta abyss, sent pleading emails to nobody. Paid $80 to the local IT experts to work some magic.",
    "source": "SMH",
    "cluster_id": 23
  },
  {
    "url": "https://www.smh.com.au/business/companies/elon-musk-loses-52-billion-in-one-day-as-trump-feud-boils-over-20250606-p5m5er.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Elon Musk loses $52 billion in one day as Trump feud boils over",
    "publish_date": "Fri, 06 Jun 2025 11:45:00 +1000",
    "category": "finance",
    "authors": [
      "Dylan Sloan",
      "Tom Maloney"
    ],
    "text": "Minute by minute, post by post, Elon Musk’s very public, extremely online feud with US President Donald Trump sliced into his vaunted status as the world’s richest person.\n\nThe final damage at day’s end: $US34 billion ($52 billion) erased from his personal net worth, the second-largest loss ever in the history of the Bloomberg Billionaires Index of the 500 wealthiest people on the planet. The only bigger one: his own wipeout in November 2021.\n\nThe world’s richest person’s fortune is shrinking. Credit: AP\n\nThe tit-for-tat was surreal, and also, in some ways, potentially inevitable for a US president who has used the Oval Office to dress down world leaders and a chief executive who has a history of launching himself from one crusade to another. The trigger was Musk’s sudden push, just days after he departed from Washington, to muster enough support to “kill” Trump’s signature “Big, Beautiful Bill”.\n\nMusk, who is still the world’s richest person with a vast $US334.5 billion fortune, has endured any number of routs before. But the stakes are higher than ever in contending with Trump, as the president laid bare when he proposed ending Musk’s government contracts, in a potential blow to Tesla and SpaceX revenue.",
    "source": "SMH",
    "cluster_id": 0
  },
  {
    "url": "https://www.smh.com.au/sport/run-it-straight-is-anarchy-in-the-guise-of-sport-20250605-p5m533.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Run It Straight is anarchy in the guise of sport",
    "publish_date": "Fri, 06 Jun 2025 11:44:35 +1000",
    "category": "sports",
    "authors": [
      "Darren Kane"
    ],
    "text": "And yet social media is lit up as, too, are the antennae of ambulance-chasing lawyers. Run It Straight competitions take place as organised and ticketed events, which have also inspired impromptu gatherings in the streets of Sydney and even on the hill at Brookvale Oval. The concept of freedom and personal choice shouldn’t be the exception, and governments can’t always legislate against every variant of idiocy, but “running it straight” is dangerous. Car manufacturers use crash test dummies, as opposed to real people, for a reason. Some poor kid in New Zealand has died already, apparently during an impromptu event that wasn’t organised by anyone, and therefore had no rules and no safety measures at all. I come at all this from the context that I am the chairman of the Combat Sports Authority of NSW. The authority is bestowed with the statutory power, and responsibility, to regulate sports including boxing, kickboxing and mixed martial arts, insofar as those sports occur within the state. Put simply, the legal responsibility to make unsafe sports as safe as they can be. That’s a heavy burden. Boxing can be very dangerous. There will be an incalculable number of amateur and professional bouts around the world during 2025 and there will be fighters somewhere, sometime this year, who will not come home after a bout. Run It Straight is no safer.\n\nJohn Graham Chambers wrote the Marquis of Queensbury Rules for boxing in the late 1860s and they remain the basis for the sport today. Though the Queensbury Rules didn’t conceive of boxing, they organised and codified the sport. If Chambers and the Marquis of Queensbury lived on modern times, boxing as a codified sport wouldn’t exist. If before yesterday, nobody had ever conceived of a sport consisting of two opponents strapping on gloves and climbing inside the ring to slug it out, it wouldn’t get off the ground as a legitimate pursuit. Because society in 2025 wouldn’t countenance that nascent sport’s existence. And yet here we are in 2025, and Run It Straight is a thing … But boxing does exist despite sections of society wishing it didn’t. And that’s the prism through which Run It Straight must be analysed. Despite the social media firestorm, variants of the activity have taken place for many years, especially in Pasifika communities. But that doesn’t mean freedom and anarchy should reign. Should boxing be banned because it’s too dangerous? Absolutely NOT. That’d be outright ridiculous, just like banning almost anything proves to be. Look what happened when the NSW Government attempted to ban greyhound racing a decade ago. For many of its participants boxing contributes much to ensuring a positive focus and useful direction in life, in circumstances where they have otherwise been dealt sevens and twos. Maybe Run It Straight does, too. But that doesn’t mean it should exist unregulated. Are organised duels next?\n\nWhile trite to highlight, the archetypal boxer knows of the risks associated with partaking in the sweet science and voluntarily assumes them. So does the Run It Straight-er. The difference, though, is that boxing is regulated; it has systems, checks and guardrails. Great responsibility rests upon the shoulders of boxing’s regulators, to ensure the health and safety of combatants. The best example is this: in any circumstances where a combatant in NSW loses a bout, either by knockout or TKO, they’re automatically suspended for the next 30 days. No exceptions. That’s been the rule in NSW for years, in circumstances where not every TKO results in a diagnosed concussion for the combatant. Should the same fighter go on to lose their next bout by either of those same methods, they’re suspended for another 60 days. Should they then suffer defeat in their next comeback match the same way, another 90 days outside the ropes is mandatory, in addition to requirements that they submit to medical and diagnostic testing. Conversely, Run It Straight is a catastrophic car crash waiting to happen. Organisations like Run It Straight Championships and Run It Straight 24, each of which run planned, ticketed and promoted, prizemoney-based competitions, have no discernible rules. There’s also no medical pre-contest screenings; no concussion protocols; no doctors in the same postcode and no identifiable risk management strategies.",
    "source": "SMH",
    "cluster_id": 24
  },
  {
    "url": "https://www.smh.com.au/world/north-america/the-trump-musk-bandwagon-was-always-going-to-crash-but-it-s-done-so-with-impressive-violence-20250606-p5m5g8.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "The Trump-Musk bandwagon was always going to crash, but it’s done so with impressive violence",
    "publish_date": "Fri, 06 Jun 2025 11:40:09 +1000",
    "category": "finance",
    "authors": [
      "Michael Lind"
    ],
    "text": "Musk had never served in public office before. His ignorance of government organisation and procedures showed. Like generations of other vain, ignorant business tycoons, he thought the problem with government was that it was not run like a business. Musk set about using his ill-defined authority to try to downsize the federal government as though it were one of his own companies, Tesla or PayPal or SpaceX. In 2022, when he bought control of Twitter, now known as X, Musk prepared for mass lay-offs of Twitter employees by sending the workforce an email asking what they had done last week. Similarly, in February, the Office of Personnel Management, over which Musk had no authority, nevertheless on his behalf sent an email to about 2 million federal employees that demanded they send their managers a list of five accomplishments from last week. Later on X, Musk announced, on the basis of no authority whatsoever, that anyone who refused to answer would be fired; he subsequently said the millions of employees would get a second chance and finally reversed himself, saying it had just been a “pulse check”. Elon Musk speaks at a cabinet meeting at the White House in February. Credit: AP The Department of State, led by former senator Marco Rubio, along with the Defence Department and FBI, told their employees not to answer Musk’s email. The tensions between Musk, who according to the administration was not actually in charge of DOGE, and Trump’s constitutionally appointed, Senate-confirmed cabinet secretaries were on public display in a bizarre videotaped cabinet meeting in which Musk, dressed in black, babbled in front of stony-faced officials. According to reports, Musk on another occasion got into a shouting match with Treasury Secretary Scott Bessent.\n\nDisloyal as he is to his own subordinates, Trump expects loyalty from others. It was one thing for Musk to fight with other Trump appointees behind the scenes, another to attack them in public. After Trump unveiled his half-baked tariff plan on April 2, Musk called Trump trade adviser Peter Navarro “truly a moron” and “dumber than a sack of bricks”. Reportedly Musk further damaged his relationship with Trump by pouring $US20 million ($31 million) into a special Wisconsin state Supreme Court election, offering to pay a million dollars apiece to lucky individual voters. This crass attempt to buy an election backfired against the Republican candidate Musk favoured, and the backlash powered the Democrat to victory. Elon Musk attacked Trump in posts on X on Thursday (Friday AEST). Credit: NurPhoto via Getty Images The trigger for the final break between Musk and Trump was money. On X, Musk tried to rally Republicans in Congress to vote against the “big, beautiful bill” that would be the central achievement of Trump’s first year in his second term. “KILL the BILL,” Musk ranted in one of more than two dozen tweets criticising the legislation. Some Republicans blamed Musk’s opposition to the bill on cuts to subsidies to consumers who bought electric cars from Tesla and other companies. Telling reporters that he was “very disappointed” in his donor and former DOGE czar, Trump said, “Look, Elon and I had a great relationship. I don’t know if we will any more.”\n\nOn X, Musk responded: “Without me, Trump would have lost the election, Dems would control the House and the Republicans would be 51-49 in the Senate. Such ingratitude.” No stranger to social media, Trump replied on his own platform, Truth Social: “Elon was ‘wearing thin’; I asked him to leave, I took away his EV Mandate that forced everyone to buy Electric Cars that nobody else wanted (that he knew for months I was going to do!), and he just went CRAZY!” Donald Trump and Elon Musk show off a Tesla at the White House in March. Credit: AP Trump followed this up with a threat: “The easiest way to save money in our Budget, Billions and Billions of Dollars, is to terminate Elon’s Governmental Subsidies and Contracts. I was always surprised that Biden didn’t do it!” Exit stage right-wing.\n\nThe end of the Trump-Musk relationship is a source of amusement to Democrats and a source of relief to Republican populists who dream of what Trump once called the “Republican workers’ party”, not a party subordinated to weird libertarian billionaires. Loading But everyone can learn from the latest demonstration of the fact that celebrity outsiders who have never held office before – generals like Ulysses S. Grant and Dwight Eisenhower, businessmen like Herbert Hoover and Donald Trump and Elon Musk – tend to perform poorly when given authority over America’s complex government, compared with presidents who had worked their way up in politics like Washington, Lincoln and Franklin D. Roosevelt. When Eisenhower was elected as president, his predecessor Harry Truman joked: “He’ll sit right there and he’ll say, do this, do that! And nothing will happen. Poor Ike – it won’t be a bit like the army.” Or Tesla or Twitter, either.",
    "source": "SMH",
    "cluster_id": 25
  },
  {
    "url": "https://www.smh.com.au/goodfood/brisbane-eating-out/the-5-tool-that-will-elevate-your-thai-cooking-according-to-a-star-chef-20250603-p5m4oi.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "The $5 tool that will elevate your Thai cooking, according to a star chef",
    "publish_date": "Fri, 06 Jun 2025 11:30:00 +1000",
    "category": "finance",
    "authors": [
      "Matt Shea"
    ],
    "text": "Advertisement\n\nEating outKitchen Drawer The $5 tool that will elevate your Thai cooking, according to a star chef Looking to level up your Thai salads and desserts? Longrain creator Martin Boetz reckons you need this simple utensil. Matt Shea June 6, 2025 Save Log in , register or subscribe to save recipes for later. You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share\n\nMartin Boetz reckons Thai cooking is getting better in Australia. Or more sophisticated, at least. “There are better restaurants around using proper ingredients,” Boetz says. “Even your local Thai restaurant is putting Thai basil in the curries, rather than nothing, like they used to.” Martin Boetz at Short Grain with his coconut scraper, which can be bought for as little as $5 at your local Asian supermarket. Markus Ravik Boetz should know. He’s partly responsible, given his creation of Longrain in Sydney in 1999. It was such a hit it inspired a second restaurant in Melbourne (which is still a going concern, now under the stewardship of Scott Pickett) and went on to influence a raft of others, from Chin Chin in Melbourne to EP & LP in Los Angeles and Longtime (now Same Same) in Brisbane. Often, it was Boetz’s former Longrain lieutenants heading up the kitchens in these venues, such as Louis Tikaram at EP & LP or Ben Bertei at Longtime.\n\nAdvertisement\n\nRelated Article The one rice cooker you need at home? It’s not a rice cooker, says this top chef And the effect has trickled down over time to smaller, more local venues, and now the home kitchen. Plus, people are travelling to Thailand more. “They have that deeper knowledge of Thai food,” says Boetz, who now owns Short Grain in Brisbane. There are plenty of tools and techniques that can help elevate your Thai cooking, Boetz reckons, from learning to use a wok correctly, to cooking out your store-bought pastes with coconut oil, to mastering the balancing of your curries with the addition of acid or salt.\n\nAdvertisement\n\nBoetz demonstrating how to use his coconut scraper. Markus Ravik Still, there’s one small utensil that can be bought for as little as $5 that he reckons will make a big difference to your Thai cooking at home: the humble coconut scraper. Before you ask, no, not a coconut shredder, which you may have seen cooks in Thailand use to shred fresh coconut to make coconut milk or cream. This is a smaller, simpler and cheaper handheld device used to scrape flesh from the inside of the coconut after it’s been split in two. Boetz likes to use his to elevate his Thai salads and desserts. “I have a whole stack of them under in the cupboard because if you use them every day, they don’t tend to last long,” Boetz says. “But it’s something that it pays to be gentle with. If you get stuck into it too hard, it ends up being a real thick piece.\n\nAdvertisement\n\nBoetz uses a coconut scraper to elevate his salads and desserts. Markus Ravik “It’s just a gentle scrape, but it’s easy for people to get the hang of.” Boetz demonstrates on a fresh coconut and the result is thin white wafers that resemble a crinkle cut potato chip. To eat, it has more flavour and a more tender texture than store-bought dried coconut. “You can take this and roast it and then use it on cakes,” Boetz says. “Because it’s pretty. It has that lovely curl to it.” Its more immediate use, though, is as a fresh addition to Thai-style salads. Boetz likes to pound bird’s eye chillies (“scuds” in Thai cooking) and garlic and put them on a simmer with some coconut cream, fish sauce and a dash of white sugar.\n\nAdvertisement\n\nBoetz’s poached tuna salad with freshly shaved coconut. Markus Ravik He’ll then add some tuna, lightly poaching it, before taking it out, breaking it into pieces, and throwing it together with Thai basil, peanuts and the freshly scraped coconut. The poaching liquid is then used as a dressing, Boetz finishing the dish with a squeeze of fresh lime. “It’s just a really simple dish with lots of flavour,” Boetz says, “and the coconut adds a lovely texture to that salad.”\n\nRestaurant reviews, news and the hottest openings served to your inbox. Sign up",
    "source": "SMH",
    "cluster_id": 26
  },
  {
    "url": "https://www.sbs.com.au/news/article/how-australias-slowing-economy-could-affect-your-mortgage-repayments/hgcjh71xt",
    "title": "How Australia's slowing economy could affect your mortgage repayments",
    "publish_date": "Thu, 5 Jun 2025 19:30:38 +0000",
    "category": "finance",
    "authors": [],
    "text": "The Reserve Bank of Australia (RBA) could cut rates at its next meeting despite its cautious plan to lower inflation as GDP figures reveal stagnation in Australia's economy, some analysts say.\n\n\n\n\n\nAustralia's economy has barely moved in the last quarter — GDP slowed to 0.2 per cent in the first three months of 2025, down from a 0.6 per cent rise in the December quarter, according to the Australian Bureau of Statistics.\n\n\n\n\n\nTreasurer Jim Chalmers said \"any growth is positive\" in response to questions about why the figures were worse than expected.\n\n\n\n\n\nNatural disasters delivered a big hit to the Australian economy — causing around $2.2 billion in damages, according to Treasury figures — while Chalmers added \"substantial headwinds at home and abroad\" are also inhibiting growth.\n\n\n\n\n\nHe could have been referring to United States President Donald Trump's tariffs that have continued to spike export and manufacturing costs and contribute to uncertainty in financial markets.\n\n\n\nWhat will the RBA do at its next meeting?\n\nAt its May meeting, RBA dropped the official cash rate by 0.25 per cent, taking it down to 3.85 per cent.\n\n\n\n\n\nRBA governor Michele Bullock said the board considered a 0.5 per cent cut, but ultimately did not want to risk inflation rising again after it had steadied.\n\n\n\nThe RBA reduced the cash rate target by 0.25 per cent in May, taking the key interest rate down to 3.85 per cent following what it described as a healthy reduction in inflation. Source: SBS News Financial markets are now pricing in a greater than 90 per cent chance the RBA will cut interest rates at its next meeting in July, with about a 70 per cent chance of a follow-up cut in August.\n\n\n\n\n\nMarkets predict the cash rate will be at or below 3.1 per cent by the end of the year, down 0.75 per cent from its current level of 3.85 per cent.\n\n\n\n\n\nBenjamin Picton, a senior macro strategist at Rabobank, who expects a rate cut in July, said: \"The households are rebuilding their balance sheets, but that's not being converted into spending.\"\n\n\n\n\n\n\"I think if we do see a few more rate cuts start to flow through ... that should give consumer confidence a bit of a shot in the arm, we think, and maybe we'll start to see a bit of a response in household consumption,\" he said.\n\n\n\nTony Sycamore, market analyst at financial markets trading firm IG, said per capita GDP growth fell by 0.2 per cent in the last quarter, adding weight to the probability the RBA will cut the cash rate at its next meeting.\n\n\n\n\n\n\"[The] GDP release reaffirms that the Australian economy continues to muddle along at a rate significantly below the 2.5-3 per cent growth rate we grew accustomed to before the COVID shock,\" he said.\n\n\n\n\n\n\"It also suggests the economy will fall short of the RBA's recently revised lower forecasts of 1.8 per cent for June 2025 and 2.1 per cent for December 2025.\n\n\n\n\n\n\"While there may be a temptation to overlook the adverse impacts of the weather, the lack of acceleration in the annual growth rate reinforces the case for the RBA to continue easing its restrictive monetary policy settings.\"\n\n\n\n\"We expect the RBA to cut rates by 0.25 per cent at its meeting in July, bringing it to 3.6 per cent, and to deliver another 0.25 per cent cut in August,\" Sycamore said.\n\n\n\nWhen will the RBA cut rates?\n\nSteven Wu, a senior economist at the Commonwealth Bank, told SBS News' On the Money podcast the RBA could continue the cautious path it's been treading, despite soft GDP figures.\n\n\n\n\n\n\"We haven't shifted our thinking on the profile for further rate cuts from the RBA. It's still very clear that the RBA will need to and will deliver further rate cuts. I think today's data at the margin does shift the balance of probabilities towards earlier rate cuts rather than later rate cuts,\" he said.\n\n\n\n\n\nBut he said the bank still maintains August is the most likely meeting for the next 0.25 per cent cut, followed by another one in September.\n\n\n\n\"There is a case to be made that will be, should see rate cuts being brought forward to maybe say July? But we think the RBA still remains a little bit cautious in how it wants to proceed with further rate cuts from here,\" Wu said.\n\n\n\n\n\n\"They will want to see more data and they will of course get the all-important quarterly CPI [consumer price index] numbers ahead of the August meeting.\"\n\n\n\n\n\nHe said if labour market data appears soft, it could sway an earlier rate cut.\n\n\n\n\n\nDevika Shivadekar, economist at financial services firm RSM Australia, said a hit to exports and flat government spending could prompt the RBA to remain cautious.\n\n\n\n\n\n\"The GDP figures reinforce expectations that the Reserve Bank of Australia will remain cautious, with its latest commentary pointing to a slower-than-expected recovery in domestic activity over 2025.\n\n\n\n\n\n\"Ongoing global uncertainty, muted household spending, and the aftershocks of recent climate-related disruptions all contribute to a more dovish near-term stance.\n\n\n\n\n\n\"We still expect to see the next reduction by 0.25 per cent in August. However, weak incoming data could make the July meeting one to watch.\"\n\n\n\n",
    "source": "SBS",
    "cluster_id": 27
  },
  {
    "url": "https://www.sbs.com.au/news/article/socceroos-beat-japan-in-nail-biting-finish-paving-way-for-world-cup-qualification/cltzx5ei0",
    "title": "Socceroos beat Japan in nail-biting finish, paving way for World Cup qualification",
    "publish_date": "Thu, 5 Jun 2025 11:10:14 +0000",
    "category": "sports",
    "authors": [],
    "text": "The Socceroos have almost certainly secured their place in the 2026 FIFA World Cup, barring a mathematical anomaly.\n\n\n\n\n\nWhile Japan dominated Australia for most of Thursday night's match, Socceroos defender Aziz Behich struck in the 90th minute to deliver a 1-0 win and send the almost 60,000-strong crowd at Perth Stadium into a frenzy.\n\n\n\n\n\n\"In a football sense, this is the best week [of my life] ... I think we more than deserve going to the World Cup again,\" Behich said after the match.\n\n\n\n\n\nThis was Australia's first win against Japan in 16 years. Japan, which had already qualified, played a second-string team but still dominated possession, with the Socceroos spending most of the match defending.\n\n\n\n\n\nBehich's goal, from a cut-back from substitute midfielder Riley McGree, came from the Socceroos' only incisive attack of the game.\n\n\n\nAustralia's place in the 2026 World Cup in the United States, Canada, and Mexico is now all but secured, though it won't be set in stone until the final group game against Saudi Arabia on Wednesday morning (AEST).\n\n\n\n\n\nThe Socceroos, second in Asian qualifying Group C, need only to avoid a five-goal defeat to the third-placed Green Falcons in Jeddah to go through.\n\n\n\nPopovic: 'It's a moment I'll always remember\n\nSocceroos coach Tony Popovic, who sunk to his knees in celebration before embracing his coaching staff after Behich's goal, said the team were determined to confirm qualification with a good result in Jeddah.\n\n\n\n\n\n\"It's a special night,\" Popovic said.\n\n\n\n\n\n\"The outpouring of emotions when we scored, and obviously after the game — it's a moment I'll always remember.\n\n\n\n\n\n\"We've all played a part in getting us to this point, and we want to go to Saudi Arabia now and really finish the job off.\"\n\n\n\n\n\nSocceroos central defender Allesandro Circati, who grew up in Perth and now plays for Parma in Italy, was emotional after the match. The 21-year-old recently returned from a serious knee injury to take his place in the side.\n\n\n\n\n\n\"It's like a dream come true. I couldn't be any happier,\" he said while wiping away tears in a post-match interview.\n\n\n\nJapan dominates possession\n\nThe first half was effectively one-way traffic, with Australia forced to defend against a Japanese side very comfortable in possession. When the Socceroos did get the ball, they struggled to maintain it.\n\n\n\n\n\nJapan enjoyed more than 70 per cent possession and had seven shots on goal.\n\n\n\n\n\nThe Socceroos, by contrast, had just two attempts.\n\n\n\n\n\nWhile Japan entered Australia's final third 45 times, Australia did the same only 12 times.\n\n\n\n\n\nJapan's first serious attack came in the 27th minute, when Yuito Suzuki shot just wide.\n\n\n\nSocceroos midfielder Connor Metcalfe heads towards goal during Thursday night's World Cup qualifier against Japan. Source: AAP / Richard Wainwright Australia had their first real chance in the 34th minute, but Connor Metcalfe's header from a corner went wide.\n\n\n\n\n\nIn the 38th minute, Japan's Yu Hirakawa unleashed a powerful shot from outside the box, which put Australia on notice.\n\n\n\nNail-biting finish\n\nThe second half started with two substitutions for Australia and one for Japan.\n\n\n\n\n\nFor the Socceroos, Riley McGree and Patrick Yazbek came on for Ryan Teague and Martin Boyle in midfield, while Japan brought on Ayumu Seko in place of fellow defender Koki Machida.\n\n\n\n\n\nThe substitutes didn't change the flow of the game in the first 15 minutes of the second half, with Japan maintaining control of the ball and continuing to apply pressure.\n\n\n\n\n\nIn the last 30 minutes of the second half, Japan's star player Takefusa Kubo, alongside Keito Nakamura, came into the match, increasing the pressure on Australia's defence.\n\n\n\n\n\nJapan came close to securing victory in the 80th minute of the game, when Kubo took a shot that narrowly missed Mat Ryan's goal.\n\n\n\n\n\nBut it was Behich's curved right-footed shot in the 90th minute that sent the crowd of 57,226 in Perth wild.\n\n\n\n\n\nWhat's next for the Socceroos?\n\nFollowing their win, the Socceroos remain second in their group on 16 points, behind Japan on 20 points.\n\n\n\n\n\nOnly the top two teams in the group will secure direct spots for the 2026 World Cup.\n\n\n\n\n\nSaudi Arabia is currently in third place, with 13 points, after they beat Bahrain 2-0 overnight.\n\n\n\n\n\nThe only way the Green Falcons can block Australia's automatic qualification is if they defeat the Socceroos by a five-goal margin when the two teams meet on Wednesday.\n\n\n\n\n\nIn eight matches against Saudi Arabia since 2011, the Socceroos have won four, drawn three and lost one.\n\n\n\n\n\nAustralia's most recent qualifier against Saudi Arabia, in Melbourne in November, ended in a 0-0 draw.\n\n\n\n\n\nIf the Socceroos do lose by five or more goals to Saudi Arabia and finish third in the group, they will need to qualify through a fourth round round-robin tournament in October.\n\n\n\n\n\nSix nations will be divided into two groups of three, with each team playing against the others in their group once. The winners of both groups will qualify for the 2026 FIFA World Cup.\n\n\n\n\n\nIn Group C, Indonesia, who play Japan in their final group game, have secured a place in the fourth round. The other two teams, Bahrain and China, have been eliminated.\n\n\n\nWhen and where is the next Socceroos match?\n\nThe Socceroos will go head-to-head with Saudi Arabia on 11 June at 4.15am AEST in the King Abdullah Sports City in Jeddah.\n\n\n\n\n\nYou can watch all 104 games of the FIFA World Cup 2026™ LIVE on SBS and SBS VICELAND.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 12
  },
  {
    "url": "https://www.sbs.com.au/news/video/oakville-nsw-to-become-home-to-australias-first-hindu-school/m744jfq7b",
    "title": "Oakville, NSW to become home to Australia's first Hindu school",
    "publish_date": "Thu, 5 Jun 2025 10:38:07 +0000",
    "category": "finance",
    "authors": [],
    "text": "Oakville, NSW to become home to Australia's first Hindu school\n\nPublished 5 June 2025, 8:01 am\n\nAustralia is becoming more religiously diverse; the 2021 census finding Hinduism is the third largest religion in Australia. But unlike other faiths, including Islam and Greek Orthodox, there’s not yet a mainstream Hindu school. That’s about to change — with a bold vision for a block of land in the suburb of Oakville, north-west of Sydney.",
    "source": "SBS",
    "cluster_id": 28
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/tasmania-set-for-early-election-after-premier-ousted-in-no-confidence-vote/75vv8edaj",
    "title": "Tasmania set for early election after Premier ousted in no-confidence vote",
    "publish_date": "Thu, 5 Jun 2025 08:11:01 +0000",
    "category": "finance",
    "authors": [],
    "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nThe Tasmanian Premier Jeremy Rockliff has been ousted by a successful no-confidence motion that passed by one vote.\n\n\n\n\n\nLabor, the Greens and independents teamed up to overthrow the minority Liberal premier.\n\n\n\n\n\nHe says he's 'broken hearted' at the result.\n\n\n\n\n\n\"Because what we have in this parliament, as I've said over the course of the last 14 months, is an eclectic mix of people from all backgrounds, which is how a parliament should be, in actual fact, and I wanted it to work. I believed in it, and I actually still do.\"\n\n\n\n\n\nThe vote was initially tied at 17 for and against the no confidence motion.\n\n\n\n\n\nLabor speaker Michelle O'Byrne cast the tie breaking vote.\n\n\n\n\n\n\"As I provide my casting vote today I do so in the knowledge that regardless of the outcome of today's vote, the stability of this parliament is fundamentally under question.\"\n\n\n\n\n\nThe Liberal leader's downfall has been driven by a number of issues, including debate over a recent budget.\n\n\n\n\n\nLabor has slammed the budget - handed down a week ago but not yet passed - as unsustainable.\n\n\n\n\n\nMs O'Byrne says the government could run out of money if a solution is not found soon.\n\n\n\n\n\n\"The die is cast and the state is on the inexorable path to another early election. The budget before this house faces almost insurmountable challenges in both its form and in its timing. As a result, I've sought advice on the issue of supply. In the event this budget is not passed, and I've been advised and in the absence of the approval of the appropriation bills currently before this house, alternate arrangements need to be established to fund government services beyond 1 July 2025. I'm sure no one in this house would like to see a situation where payments are not made to government employees or there is a failure to run service delivery or the organisations that provide them.\"\n\n\n\n\n\nAnother key issue has been the proposal - supported by Mr Rockliff - to build a new stadium in Hobart at a ballooning cost of almost $1 billion.\n\n\n\n\n\nThe new stadium is a condition for the success of Tasmania's bid to have a team in the AFL from 2028.\n\n\n\n\n\nAfter being ousted, Mr Rockcliff spoke passionately about his belief in the project.\n\n\n\n\n\n\"A large majority of this discussion, particularly from the Green side of the parliament, talked about the stadium and the AFL and AFLW team, and I've been advised by all the hard heads in my party not to go down that track. Why? Because it's bad for votes. Well, I've always said stuff votes.\"\n\n\n\n\n\nAnother key issue was cost blowouts in the project to launch two new Spirit of Tasmania ferries, which link the island state with the mainland.\n\n\n\n\n\nOriginally projected to cost $90 million, the latest estimates from Transport Minister Eric Abetz now put the price at $493 million.\n\n\n\n\n\nWith the accumulation of issues like these, opposition Leader Dean Winter says he had no choice but to topple the premier.\n\n\n\n\n\n\"I can't stand by and let this premier ruin this state, and so Tasmanian Labor needs to stand up, stand up for Tasmanians who want good health care, who want an education system that supports Tasmanian young people, who want a government that is focused on supporting them. I want to bridge the gap between Tasmania and the mainland. I want to make sure this is a state that has the best education facilities possible. I want this to be a state where you can get the health care you need, anywhere you live, but that's not what we've got.\"\n\n\n\n\n\nMr Winter said the Rockliff government was \"putting everything on the credit card\" with its budget.\n\n\n\n\n\n\"This is not personal, this is about Tasmania's future. It's about making sure we've got a government and a premier who are prepared to put Tasmania's interests first. Tasmania's interests now and into the future, not the not the short term political interests of someone who is prepared to put Tasmania's budget in so much debt, in so much deficit.\"\n\n\n\n\n\nFor his part, Mr Rockcliff says Mr Winter will be remembered as a wrecker who's more interested in taking his job than protecting the jobs of Tasmanians.\n\n\n\n\n\nThe opposition leader has ruled out governing alongside the Greens, which could have provided a pathway to a new minority government.\n\n\n\n\n\nAs a result, Mr Rockliff says Tasmania will now be forced into an election they don't want, and can't afford.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 29
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/evening-news-bulletin-5-june-2025/nvdsq3hk2",
    "title": "Tasmanian Premier moves to call a state election | Evening News Bulletin 5 June 2025",
    "publish_date": "Thu, 5 Jun 2025 06:20:56 +0000",
    "category": "finance",
    "authors": [],
    "text": "Key Points Tasmanian Parliament upholds no-confidence motion in Premier Jeremy Rockliffe\n\nTreasurer optimistic about Australian economy, after weak growth figures\n\nIn AFL, concerns political uncertainty could delay Tassie Devils' debut\n\nListen to Australian and world news, and follow trending topics with SBS News Podcasts .\n\n\n\n\n\nTRANSCRIPT\n\n\n\nTasmanians will head to an election, after parliament passed a no-confidence vote this afternoon against sitting Premier Jeremy Rockliffe.\n\n\n\n\n\nMr Rockliff confirmed if his colleagues supported the motion, he will move to call a snap election.\n\n\n\n\n\nThe premier has been under pressure over the almost $1 billion stadium project in Hobart, and delivery of two new Bass Strait ferries.\n\n\n\n\n\nMr Rockliff has vowed to \"fight to his last breath\" and not resign.\n\n\n\n\n\n\"If Mr Winter's divisive and destructive motion is passed, I will be going to the lieutenant-governor and seeking an election. This will be advice I will provide to the governor that an election is needed, unless Mr Winter forms government with the Greens.\"\n\n\n\n---\n\n\n\n\n\nTreasurer Jim Chalmers has said Australia's economy is still in good shape, despite weak growth figures.\n\n\n\n\n\n\n\nThe latest GDP figures released on Wednesday showed the economy grew by just 0.2 per cent for the first three months of 2025, weaker than what economists were expecting.\n\n\n\n\n\n\n\n\n\nThe growth figures also revealed GDP per capita, which is a common measure of living standards, also fell for the eighth quarter out of the past nine.\n\n\n\n\n\n\n\n\n\nBut Mr Chalmers says Australia is well prepared to deal with global economic uncertainty, and that he remains optimistic about the future of Australia's economy.\n\n\n\n\n\n---\n\n\n\n\n\n\n\nUnited States President Donald Trump has said the banning of nationals from twelve countries was necessary to protect the US from what he has described as mounting terror and security threats.\n\n\n\n\n\nThe countries affected by the ban are Afghanistan, Myanmar, Chad, Congo, Equatorial Guinea, Eritrea, Haiti, Iran, Libya, Somalia, Sudan and Yemen.\n\n\n\n\n\nThe entry of people from seven other countries, Burundi, Cuba, Laos, Sierra Leone, Togo, Turkmenistan and Venezuela, will also be partially restricted.\n\n\n\n\n\nMr Trump has said the strength of the restrictions applied is dependent on what he calls the severity of the security threat posed.\n\n\n\n\n\n\" In the twenty-first century, we’ve seen one terror attack after another carried out by foreign visa overstayers from dangerous places all over the world. And thanks to (former President Joe) Biden’s open-door policies, today, there are millions and millions of these illegals who should not be in our country.\"\n\n\n\n---\n\n\n\n\n\nAt least 11 people have died and more 47 injured in a crowd surge outside a cricket stadium in the Indian city of Bengaluru.\n\n\n\n\n\nFans were celebrating the Royal Challengers Bengaluru team's first Indian Premier League title win, and thousands of people lined streets around the Chinnaswamy Stadium as the team arrived in a bus in the evening.\n\n\n\n\n\nLocal authorities say the stampede occurred when people outside the stadium - who did not have tickets - tried to push through gates.\n\n\n\n\n\nKarnataka state chief minister Siddaramaiah says between 200 thousand and 300 thousand people gathered to celebrate, causing havoc when crowds tried to force their way into the venue.\n\n\n\n\n\n\"So, stampede has taken place. Nobody has expected so much of crowd will come because the capacity of the stadium is only 35,000 people. Only 35,000 seats are there.\"\n\n\n\n---\n\n\n\n\n\nAn exhibition honouring one of Australia’s celebrated Aboriginal leaders, the late Dr Lowitja O’Donoghue has opened in Tarndarnya, Adelaide.\n\n\n\n\n\nMs O-Donoghue was an Aboriginal advocate and nurse and is highly respected as a trailblazer in Aboriginal and Torres Strait Islander health and Indigenous affairs.\n\n\n\n\n\n\"LOWITJA – A Life of Leadership and Legacy\" features images, video, and personal correspondence from the Yankunytjatjara woman's collections.\n\n\n\n\n\nRunning until July, the exhibition is curated by Ms O'Donoghue's niece, Deb Edwards.\n\n\n\n\n\n\"I think she'd love that we're truth-telling. I think she'd absolutely love that. Not to sugar coat anything, some difficult stories that go with the items that are here, so I think she'd be pretty happy.\"\n\n\n\n---\n\n\n\n\n\nTo sport, the boss of Tasmania's first AFL team - the Devils - says a new premier could present a risk for the club.\n\n\n\n\n\nThe Devils were granted the League's 19th license after lengthy campaigning and were set to debut on the field in 2028, after the construction of a controversial stadium championed by Premier Jeremy Rockliffe.\n\n\n\n\n\nSpeaking before the no-confidence motion was passed in Parliament, Devil's CEO Brendon Gale told ABC if there is an election, it could put the almost billion-dollar stadium - and team - at risk.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 30
  },
  {
    "url": "https://www.sbs.com.au/news/article/us-steel-tariffs-kick-in-today-what-does-it-mean-for-australia/ncpridcbb",
    "title": "US steel and aluminium tariffs kick in today. What does it mean for Australia?",
    "publish_date": "Thu, 5 Jun 2025 06:15:42 +0000",
    "category": "finance",
    "authors": [],
    "text": "United States President Donald Trump's \"very damaging\" steel and aluminium tariffs have now come into effect, putting a 50 per cent levy on the country's imports of the metals.\n\n\n\n\n\nThe policy will affect the cost of the products and could drive up the prices of goods Australia buys from the US.\n\n\n\n\n\nTreasurer Jim Chalmers has described the tariffs as harmful for the global economy and cautioned Australia will feel the ripple effects.\n\n\n\n\n\n\"We don't want to see an escalation of tariffs, they are an act of economic self-harm, they are very damaging to the global economy, and we [Australia] won't be immune from that,\" he told the ABC on Thursday morning.\n\n\n\nSo, what effects could these tariffs have, and why has Trump introduced them?\n\n\n\nWill the tariffs increase prices?\n\nProfessor Tim Harcourt, chief economist at the University of Technology Sydney, told SBS News the costs of steel tariffs would impact factories across the US.\n\n\n\n\n\n\"A lot of American factories use steel, so the cost of more expensive metal would be very harmful for several industries,\" he said.\n\n\n\n\n\n\"It's a component of many other things too,\" he said, as steel and aluminium are used in machinery and canned goods that Australia imports from the US.\n\n\n\nREAD MORE From shopping to superannuation: How a US trade war could impact Australians\n\nCompanies producing these products would likely pass on the increasing costs to consumers at the point of sale.\n\n\n\n\n\nHarcourt said Australian-owned BlueScope Steel's North Star mill, which is located in the US, would probably \"benefit\" from the tariffs.\n\n\n\n\n\nAnd that the downsides to the latest tariffs would be \"pretty minimal\" for Australians, thanks to a robust domestic economy.\n\n\n\n\n\n\"Our steel industry is very competitive, and they have opened up markets in Asia, meaning we are less reliant on the UK or US,\" he said.\n\n\n\n\n\nWhile there may be a price hike for some canned products available in supermarkets, Harcourt said the bigger development to look out for would be how Australian steel producers adapt.\n\n\n\nWhat about Australian steel?\n\nChalmers said Australia is \"better placed than most countries\" in managing the effects of the tariffs, but acknowledged there could be tough times ahead for Australia's steel industry.\n\n\n\n\n\n\"These tariffs, they'll have an impact on our steel makers,\" he said.\n\n\n\n\n\n\"But our exporters are among the best in the world. We're confident that they can find good markets, good reliable markets for wonderful Australian steel and aluminium.\"\n\n\n\nLISTEN TO Anthony Albanese to discuss steel and aluminium tariff exemption with Donald Trump SBS News 10/02/2025 04:50 Play\n\nApproximately 10 per cent of Australia's steel and aluminium exports are destined for the US.\n\n\n\n\n\nHarcourt said north-east Asia is \"the obvious place\" for Australian exporters to look for new opportunities, as well as India.\n\n\n\n\n\nBy trading with countries that do not impose the 50 per cent steel and aluminium tariffs, the exporters would be able to sell more of their products and boost their profits.\n\n\n\n\n\n\"There may be some growing pains or costs in adjusting, but Australia is a very good steel, iron ore and aluminium exporter, so we will still be okay with partners in Asia and the Pacific,\" he added.\n\n\n\nWhy has Trump imposed steel and aluminium tariffs?\n\nTrump announced his plans to increase tariffs on foreign steel imports from 25 per cent to 50 per cent over the weekend, in a bid to \"secure the steel industry in the United States\".\n\n\n\n\n\n\"Our steel and aluminium industries are coming back like never before,\" he said in a post on Truth Social.\n\n\n\nREAD MORE Global stock markets surge after US, China agree to reduce tariffs for at least 90 days\n\nIn February, he had raised steel and aluminium tariffs to a flat 25 per cent \"without exceptions or exemptions\".\n\n\n\n\n\nThe White House has signalled that the United Kingdom will be temporarily spared from the executive order doubling the tariffs.\n\n\n\n\n\nThe measures, according to the administration, have been designed to protect the US steel industry, increase domestic supply, and avoid reliance on other countries for materials critical to defence.\n\n\n\n\n\nHarcourt said he believes world leaders are using tariffs as a tool to assert their power, citing Chinese President Xi Jinping's decision to impose tariffs on Australian wine and grains a few years ago as an example.\n\n\n\nREAD MORE Why Xi Jinping is touring Southeast Asia amid rising tariff tensions\n\nThe tariffs followed Australia's support for an investigation into the origins of COVID-19 and the overall deterioration of bilateral ties.\n\n\n\n\n\n\"I think China started the trade war and gave Donald Trump the idea that you can raise tariffs for reasons of geopolitics.\n\n\n\n\n\n\"Normally, tariffs don't go up, and they are simply driven by trade.\n\n\n\n\n\n\"But since Xi Jinping and China did that to Australia, now nations are using tariffs for all sorts of reasons, whether it be immigration or freedom of speech or defence.\"\n\n\n\n",
    "source": "SBS",
    "cluster_id": 31
  },
  {
    "url": "https://www.theage.com.au/world/prince-louis-plays-up-at-platinum-pageant-20220606-p5ardk.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Prince Louis plays up at Platinum Pageant",
    "publish_date": "Fri, 06 Jun 2025 12:01:02 +1000",
    "category": "finance",
    "authors": [],
    "text": "Prince Louis plays up at Platinum Pageant\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 17
  },
  {
    "url": "https://www.theage.com.au/national/from-tiktok-to-tv-robert-irwin-is-hot-property-20250603-p5m4ix.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "From TikTok to TV, Robert Irwin is hot property",
    "publish_date": "Fri, 06 Jun 2025 12:00:00 +1000",
    "category": "finance",
    "authors": [
      "Andrew Hornery"
    ],
    "text": "The stars are aligning for Robert Irwin. For a start, America’s ongoing fascination with Australia’s preternaturally perky, croc-wrangling family has delivered a $58 million, media-impact jackpot for underwear-maker Bonds after the buff 21-year-old appeared in the brand’s racy campaign designed to help it break into the $13 billion US men’s market. A Bonds analysis of the campaign, which launched in April, revealed that it had generated a staggering nine billion “media impressions” in its first 24 hours in the US. How much Bonds, which manufactures offshore and was sold to American giant Hanes in 2016, paid Irwin is unclear, but he’s pulled off something previous brand ambassadors, such as Sarah Murdoch, Paul Mercurio, Pat Rafter and even Chesty Bond, couldn’t: becoming the second-most popular global trending topic on TikTok in the first week of the launch. Crikey!\n\nRobert Irwin modelling for Bonds US advertising campaign\n\nThanks to Irwin’s khaki-clad, in-house management team, which is headed by “mummager” Terri, the youngest Irwin is fast becoming the brightest star in the Irwin firmament, flogging everything from Twisties and Hello Fresh to Pop! dolls and holiday parks. (The Irwin empire already includes a multimillion-dollar property portfolio, from Australia Zoo to the 130,000-hectare Steve Irwin Wildlife Reserve in Cape York, and a slew of residual-earning TV shows, books and magazines.)\n\nIrwin’s media career started in 2004 when a horrified world watched his dad, Steve, cradle his month-old son while dangling a chicken carcass over the snapping jaws of a 3.8-metre-long saltwater croc. The former chairman of the National Australia Day Council, Lisa Curry, later revealed the stunt cost Irwin snr the Australian of the Year honour.",
    "source": "TheAge",
    "cluster_id": 18
  },
  {
    "url": "https://www.theage.com.au/property/news/triguboff-grandchildren-splash-millions-in-vaucluse-watsons-bay-20250602-p5m461.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Triguboff grandchildren splash millions in Vaucluse, Watsons Bay",
    "publish_date": "Fri, 06 Jun 2025 11:56:13 +1000",
    "category": "finance",
    "authors": [
      "Tawar Razaghi"
    ],
    "text": "While Harry Triguboff retained his title of richest man in Australia last week thanks to his Meriton property empire, his grandchildren were doing what their grandfather knows best – shoring up Sydney real estate.\n\nMiki Hendler is the latest grandchild to have bought into their favourite neighbourhood of Vaucluse, given the Triguboff clan already own two sizable compounds in the prestigious suburb.\n\nThe house bought by Miki Hendler and husband Elliot Solomon was on the market for the first time in more than 25 years.\n\nThe Meriton development manager and her husband, Elliot Solomon, chief executive of his family-run hospitality company Solotel (which runs a long list of popular venues such as The Golden Sheaf, North Bondi Fish, Aria, Chiswick and Opera Bar to name a few) have emerged as the buyers of the $20 million-plus grand five-bedroom, four-bathroom Vaucluse house after Hendler lodged a caveat on the home.\n\nIt sold through Paul Biller of Biller Property, who declined to comment.",
    "source": "TheAge",
    "cluster_id": 19
  },
  {
    "url": "https://www.theage.com.au/sport/nrl/flyers-and-flops-every-club-rated-in-half-yearly-report-card-20250605-p5m565.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Flyers and flops: Every club rated in half-yearly report card",
    "publish_date": "Fri, 06 Jun 2025 11:53:37 +1000",
    "category": "sports",
    "authors": [
      "Adrian Proszenko",
      "Robert Dillon"
    ],
    "text": "A stat that tells the story: 34 points; that’s how many points the Eels have conceded in the past three games. A huge improvement to their defence after conceding 56 points to the Storm in a horror start to the Ryles campaign. Eels star Zac Lomax. Credit: Getty Images The surprise packet: Isaiah Iongi took over from fan favourite Gutherson after just the one NRL appearance at the Panthers. A revelation in the No.1 jersey, Iongi is a leading contender for rookie-of-the-year honours. Has a long NRL career ahead of him. What they need to do in the second half of the season: Build on the improvement they have shown in recent weeks. Iongi, Ryley Smith, Jordan Samrani, Kitione Kautoga, Joash Papalii and Sam Tuivaiti will gain valuable experience that will put them in good stead for future campaigns. Prediction: The top eight looks beyond them, but they have the opportunity to put distance between themselves and the wooden spoon. Mitchell Moses and Zac Lomax are the club’s two best players, but they have only played twice together. If both remain fit, Parra can climb a couple of ladder rungs.\n\nSea Eagles Mid-season status/the story so far: Seventh, six wins, six losses. Their position on the ladder is an accurate reflection of their season. As good as anyone on their best day, but the same can be said of their worst. Wildly inconsistent - as shown on Thursday night when they were run down by the Knights after leading 16-0 at half-time. The Daly Cherry-Evans saga hasn’t helped. A stat that tells the story: Just seven games to date for Tom Trbojevic. The injury-prone star has been down on form and confidence, to the point where he was overlooked for Origin selection. Needs a big, and injury-free, second half of the season if the Sea Eagles are to contend. Lehi Hopoate is a rising star. Credit: Getty Images The surprise packet: Lehi Hopoate has been a revelation. Whether on the wing or filling in at fullback for Trbojevic, he has shown enough to suggest he will be the club’s long-term No.1. Behind only James Tedesco for most run metres.\n\nWhat they need to do in the second half of the season: Such a Jekyll and Hyde team. They need to find consistency if they are going to press for the top four. Prediction: Feels like they will be just outside the top-four, which is where you need to be a legitimate challenger. Not enough has been made about just how big the loss of Taniela Paseka for the season has been. Big Brookvale home crowds are a huge factor in the run home. Storm Mid-season status/the story so far: Fourth, seven wins, four losses. Started the season as premiership favourites, and deservedly remain so despite a few unexpected dips to date. Boast the best spine in the game, and they are finally getting some much-needed game time together. Feels like their best footy is in front of them.\n\nA stat that tells the story: 63 tries, one more than the second-placed Raiders. Ryan Papenhuyzen leads the league with 12 of them as well as a league-leading 134 points. The fullback has made a huge difference after stringing some games together. The surprise packet: Trent Loiero is such a Storm story. Just fits into the system, does his job and is largely underrated by all but his teammates. Finally got the recognition he deserves when Billy Slater handed him a Maroons debut for this year’s series. Ryan Papenhuyzen is in fine form. Credit: Getty Images What they need to do in the second half of the season: Stay healthy and secure a top-four spot. If they can do this, a premiership is theirs to lose. The pain of last year’s defeat, coupled with Penrith’s decline, leaves Melbourne as the team most likely. Prediction: Storm to win the comp. So far, they have performed well below their ability. It’s a long season, they don’t need to peak too early, so Craig Bellamy should have them firing come finals time.\n\nRaiders Mid-season status/the story so far: Second, 10 wins, three losses. Along with the Bulldogs, this is the success story of the season. One of the spoon favourites at the start of the season, they are shaping up as a not-so-dark horse for the title. Ethan Strange, Kaeo Weekes and Savelio Tamale are just some of the big improvers. A stat that tells the story: 84 penalties conceded, the most in the NRL. Just shows how much improvement there is in this team if they can improve their discipline. And here’s a positive stat: an NRL-best 21,704 run metres. That’s a great platform for the halves and speed men to work from. The surprise packet: Corey Horsburgh. So strained was the relationship between he and coach Ricky Stuart that they didn’t speak for much of last season. Now “Big Red” is back to his rampaging best and is making a strong claim to return to the Origin arena.\n\nWhat they need to do in the second half of the season: Most of the hard work has already been done. They have banked competition points during a horror road stretch early, and will finish with two byes and a fair share of home games in the run home. Just need to keep doing what they are doing. Prediction: They are probably a season or two from being in a position to take out the whole thing, but there’s no reason why this side can’t get to at least the penultimate weekend of the season. Warriors Chanel Harris-Tavita and teammates celebrate. Credit: Getty Images Mid-season status/the story so far: Third, nine wins, three losses. The Warriors suffered a harsh reality check last season, finishing 13th, but have rediscovered their 2023 form. The loss of Mitch Barnett to a season-ending knee injury is a body blow, but after six wins in their past seven games, the Wahs have momentum.\n\nA stat that tells the story: 31 Dally M points. That’s how many votes Warriors halfback Luke Metcalf had accumulated to lead the race for the medal when the polling went behind closed doors. Metcalf’s hot form has allayed fears following the retirement of club legend Shaun Johnson. The surprise packet: Leka Halasima, the 19-year-old back-rower, has emerged as a genuine weapon, scoring four tries in 12 games. He’s progressed from the bench to the starting line-up and is likely to be terrorising edge defenders for many years to come. What they need to do in the second half of the season: The Warriors are a genuine chance of winning all six of their remaining home games. If they pick up a few victories on the road - and they have won their past four in Australia - they’ll be right up at the pointy end of the top four come finals time. Prediction: Anything less than a top-four finish and a home play-off would be a surprise/disappointment for fans across the ditch.\n\nDragons Clint Gutherson’s presence gives the Dragons hope in their quest for the finals. Credit: Getty Images Mid-season status/the story so far: Eighth, five wins, six losses. Funny team, the Dragons. They haven’t earned many accolades this season, but after back-to-back wins against Brisbane and Newcastle, they are in the finals mix. At their best, they’re dangerous, as they showed in round three when they beat Melbourne. A stat that tells the story: Three losses by one point. The Dragons have been denied by field goals in games against Souths, Parramatta and the Warriors. Those results could well come back to haunt them at season’s end. The surprise packet: Jacob Liddle. When the Dragons signed former Test hooker Damien Cook, Liddle must have been wondering if he’d spend the whole season in NSW Cup. Instead, the 28-year-old has starred off the bench, featuring in all 11 games and scoring six tries.\n\nWhat they need to do in the second half of the season: Dragons coach Shane Flanagan is craving consistency. Prediction: Given what appears to be a tough draw, they’ll fizzle out in the coming weeks. Rabbitohs Rookie half Jamie Humphreys has given Souths a new dimension with his kicking game. Credit: Getty Images Mid-season status/the story so far: Ninth, six wins, six losses. The Rabbitohs are lurking with intent at the midway point, and there is no better coach than Wayne Bennett to get them firing when it counts. Injuries have been a constant drain on Bennett’s resources, but with their main men back on the paddock, anything is possible.\n\nA stat that tells the story: 8442 total kick metres. The Bunnies have gained more ground via the boot than any rival team, mainly thanks to rookie halfback Jamie Humphreys. That’s a valuable asset, especially in tight games. The surprise packet: Humphreys has been a revelation after Souths signed him from Manly with one NRL game under his belt. He has a great kicking game, defends strongly and looks every inch a quality, long-term first-grader. What they need to do in the second half of the season: If they can keep their big guns on the field, the rest will take care of itself. Jack Wighton and Cody Walker return this week for the clash with the Raiders in Canberra, and they will make a massive difference. Prediction: At $51 to win the title, and $2.75 to make the top eight, Souths are arguably the best-value bet in the NRL. They’re not far off where they need to be and will be winning games in the finals.\n\nKnights Mid-season status/the story so far: 15th, four wins, eight losses. What a horror show it has been. Coach Adam O’Brien recently said he has the full support of the board. What he needs is the full support of the players. They seem bereft of ideas in attack and still don’t know what their best halves pairing is. A stat that tells the story: 4708. That’s how many tackles - the most in the league - that the Knights have made this season. You just can’t win games without the football. The Knights are also the worst team for errors (170) and ineffective tackles (252). That’s a damning set of numbers. Young Knights half Fletcher Sharpe. Credit: Getty Images The surprise packet: It’s evident that Fletcher Sharpe is a special talent, but he’s really shone when replacing Kalyn Ponga at fullback. If fortunes don’t improve, expect more debate about whether Ponga should shift from fullback to the halves.\n\nWhat they need to do in the second half of the season: Settle on a halves combination. They used 11 pairings last year and are no closer to arriving at a solution. Unless they do so, their points drought will continue. Prediction: The Knights have lashed out up to $14 million to poach Dylan Brown. O’Brien won’t be around to coach him if the Knights can’t improve their fortunes. They shouldn’t get the spoon, but it will be a close-run race. Cowboys The Cowboys are well placed in the race for the play-offs. Credit: Getty Images Mid-season status/the story so far: Sixth, five wins, one draw, five losses. North Queensland have broken even thus far, but their inconsistency will have frustrated coach Todd Payten. The form they showed during a four-game winning run gave a glimpse of their potential, and their destiny is in their own hands over the second half of the season.\n\nA stat that tells the story: 81 offloads. Only the Rabbitohs (79) have produced fewer this year. Maybe the Cowboys need to take a few chances in possession to create more second-phase football. The surprise packet: Robert Derby. The Papua New Guinea Test winger debuted in the NRL last year but clearly has found his feet this season, scoring seven tries in nine games, including a hat-trick against Gold Coast. He should keep improving with experience. What they need to do in the second half of the season: The Cows need to capitalise on their home-ground advantage and win their remaining six games in Townsville. If they pick up another win or two on the road, that will secure a top-eight finish. Prediction: They should make the eight, judging by their draw. Dolphins\n\nDolphins skipper Tom Gilbert is unlikely to play again this season. Credit: NRL Photos Mid-season status/the story so far: 10th, five wins, seven losses. Rookie coach Kristian Woolf endured a disastrous start, losing his first four games, but to his credit, the Dolphins are still in the race for a first finals berth. They face a crucial game against the Dragons on Friday. The winners will stay in touch with the top eight, the losers could find themselves playing catch-up for the rest of the season. A stat that tells the story: The Dolphins have a points differential of plus-42 (294 for, 252 against). That’s the sixth best in the NRL and highlights what a competitive team they are. They don’t beat themselves, and they’ll keep every opponent honest in the dogfight to reach the play-offs. The surprise packet: Kulikefu Finefeuiaki joined the Dolphins from North Queensland and has since established himself as a starting edge forward, playing the full 80 minutes in his past four games. He’s provided an ageing pack with some energy and spark. What they need to do in the second half of the season: The loss of Tom Gilbert and Daniel Saifiti to injuries, on top of the uncertainty surrounding Tom Flegler, will test the Dolphins’ depth. They’ll need their forwards to break even each week so that Isaiya Katoa can create chances for strike weapons Hamiso Tabuai-Fidow and Herbie Farnworth.\n\nPrediction: They’ll be thereabouts but might just miss the eight for the second season in a row. Broncos Broncos captain Adam Reynolds and coach Michael Maguire speak to the media after another loss. Credit: NRL Photos Mid-season status/the story so far: 11th, five wins, seven losses. Their 50-14 thrashing of the Roosters in round one has all but faded from memory, and the Broncos are now seriously under the pump. In saying that, they have a star-studded roster and enough time to get their season back on track. Over to you, Michael Maguire. A stat that tells the story: Six losses in their past seven games. How can a team with so much talent, and who started the season with such high expectations, have performed so poorly?\n\nThe surprise packet: Journeyman centre Gehamat Shibasaki has returned to the Broncos and grabbed his opportunity. He has played in every game this season, scoring six tries in the process. What they need to do in the second half of the season: For starters, a win against last-placed Gold Coast on Saturday is a non-negotiable. If they lose that, the Broncos are officially in crisis, and all bets are off. The return from injury of Reece Walsh might be just what they need to resurrect an underwhelming campaign. Prediction: They’ll turn it around, qualify for the postseason, and do some damage when they get there. Sharks\n\nMid-season status/the story so far: Fifth, seven wins, five losses. The jury remains out. After a slow start to the season, Nicho Hynes is playing good football. Addin Fonua-Blake has been a welcome addition. It remains to be seen whether this team is better placed for a title tilt than in previous years. A stat that tells the story: Nicho Hynes has 16 line-break assists, the most in the league. There have been times when Braydon Trindall has taken the control of Cronulla’s attack, but they are starting to strike a nice balance. The spotlight will be on whether Hynes can deliver when it counts. Nicho Hynes is warming into the season. Credit: Getty Images The surprise packet: When voting went behind closed doors, Will Kennedy was on 29 Dally M points. That’s just one point off the leader, Luke Metcalf. Incredibly, Kennedy remains unsigned for next season. Surely the Sharks can find the cap space to table a decent deal. What they need to do in the second half of the season: It’s a downhill ski for the Sharks; they don’t leave Sydney after round 18, and they still have two byes to come. They need to take advantage and cement a spot in the top four. After making the preliminary final last year, they need to go a step further.\n\nPrediction: A top-four spot, a home (region) final, but no premiership. This is a very open competition and the Sharks should again be one of the last four teams standing. Just feels like they are lacking that X-factor required to win the whole thing. Roosters There has been no more exciting player in the NRL this season than Mark Nawaqanitawase. Credit: NRL Photos Mid-season status/the story so far: 12th, five wins, seven losses. Win, lose or draw, the Roosters have been entertaining this season. They’ve unearthed an excitement machine in ex-Wallaby Mark Nawaqanitawase and some dynamic tyros like halfback Hugo Savala. The outstanding form of skipper James Tedesco has also been a highlight. Even if they don’t reach the finals, they’re good to watch. A stat that tells the story: 82 tackle breaks by James Tedesco. That’s the most in the NRL, by the way. At 32, “Teddy” is playing out of his skin and doing his utmost to inspire his young teammates.\n\nThe surprise packet: Robert Toia made his NRL debut in round one, and three months later was a shock choice for Queensland in the Origin series opener. Still only 20, he is presumably only going to improve. What they need to do in the second half of the season: Only once this season have the Chooks won consecutive games. They’ll be hoping the return of Sam Walker helps them start stringing wins together. Prediction: They have the talent to make the finals, but perhaps not the consistency. Tigers Are the Tigers better off without Lachlan Galvin? Credit: Getty Images\n\nMid-season status/the story so far: 13th, five wins, seven losses. After three consecutive wooden spoons, the only way was up for the Tigers. But they remain a work in progress and have had to deal with the ongoing distraction that culminated in Lachlan Galvin joining Canterbury. With that saga done and dusted, the Tigers can now focus on trying to win games. A stat that tells the story: 166 offloads, the most in the NRL. Terrell May has delivered an NRL-best 36 on his own. That suggests the Tigers are playing an enterprising brand of football and trying to keep the ball alive. More power to them. The surprise packet: Starford To’a arrived at the Tigers in 2022, after being discarded by Newcastle. This season, he has established himself as one of the most-improved centres in the NRL, scoring seven tries in nine games. Outside him, Sunia Turuva has scored nine tries. Beware the Tigers’ right edge. What they need to do in the second half of the season: Benji Marshall has his team heading in the right direction, but he’ll wants more consistency, especially in defence. Only the Titans have conceded more points this season. Prediction: They won’t finish last, which amounts to progress. But they won’t make the play-offs.\n\nPanthers Penrith will need to produce a remarkable turnaround to have any hope of defending their title. Credit: NRL Imagery Mid-season status/the story so far: 14th, four wins, seven losses, one draw. The four-time premiers kicked off their season by beating Cronulla in Las Vegas, but then followed an inexplicable five-game losing streak that left them at the foot of the table. The champions will need to produce something special simply to make the finals. A stat that tells the story: 281 points conceded. That works out to be 23.4 points per game, seven points a game more than last season’s average. Penrith have been statistically the most miserly defensive team in the NRL throughout their reign. Now they rank 11th. Sure, they’ve lost some key players, but the cracks in a once-impregnable system are the worry. The surprise packet: Thomas Jenkins. Spent most of last year in Newcastle’s NSW Cup side and was pondering retirement before the Panthers threw him a lifeline. The utility back has since appeared in nine NRL games to resurrect his career.\n\nLoading What they need to do in the second half of the season: Penrith probably need eight wins from their remaining 12 games, a tall order but far from impossible. They know what’s required, but there is precious little margin for error. Prediction: As Manchester City discovered this season in the English Premier League, dynasties can be suddenly dented. It will require a minor miracle for Penrith to reach the finals, let alone retain their title. But this team have a habit of rewriting the record books, so one way or the other, it will be intriguing to see how this plays out. Titans Mid-season status/the story so far: 17th, three wins, eight losses. This has been a tale of woe. On paper, this is a team that should not be sitting in last place. The contract clause in Des Hasler’s contract appears deliberately leaked, putting even more pressure on the coach. They are deserved favourites to finish last.",
    "source": "TheAge",
    "cluster_id": 20
  },
  {
    "url": "https://www.theage.com.au/sport/afl/the-top-afl-draft-prospects-to-watch-at-this-year-s-under-18-championships-20250529-p5m3d3.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "The top Victorian AFL draft prospects to watch at this weekend’s under-18 championships",
    "publish_date": "Fri, 06 Jun 2025 11:50:20 +1000",
    "category": "sports",
    "authors": [
      "Marc Mcgowan"
    ],
    "text": "Mr Reliable. The consistent word from recruiters is that the margin between Annable’s best and worst is smaller any player in this class. He is headed to the Lions as a potential top-three pick, unless he unjustifiably slips like past academy prospects such as Tom Green and Nick Blakey. He is tough, clean and wins his own ball, and his leadership skills were evidenced in him captaining the AFL Academy team this year.\n\nShifter says: “He has as good hands as anyone we’ve seen in recent years. He doesn’t fumble, and whatever the situation, he is so clean and has great vision, with the ability to quickly making the right decision by hand and foot. He’s a rock-solid, early choice.” Cooper Duff-Tytler\n\nDuff-Tytler, who is considered a similar player – but more advanced with his football smarts at the same age – to fellow junior basketball standout Luke Jackson, is the rare ruckman in the No.1 pick mix. He dominated another standout big man, Louis Emmett, in round one of the Talent League, but talent scouts would love to see more of him as a key forward to figure out whether he genuinely has that in his toolkit.\n\nShifter says: “Cooper’s a dual-sports athlete, and the type of boy the youth of today are jealous of. He covers the ground as an athlete but also wins the ball, which not all boys at his size can do. He kicks goals on the run, can ruck, play a key position, and the early observation is whichever club he goes to will get the best out of him.”\n\nWillem Duursma The brother of AFL players Xavier and Zane and the AFLW’s Yasmin, the next Duursma might be the best and most talented of them all. He is capable of brilliance that other players are not – and often demonstrates that several times a game – but recruiters would like to see a higher work-rate and more toughness. There is significant upside here if he puts it together.\n\nShifter says: “It comes with a price when your brothers are just ahead of you, and your surname is known, but he’s lived up to every bit of that the last three years … he needs the challenge of nationals. He’s a tall midfielder, but can play back or forward as well, is a good user of the ball, strong overhead and a good athlete.” Louis Emmett flies high for a mark for Victoria Metro at last year’s national championships. Credit: AFL Photos via Getty Images Louis Emmett\n\nOakleigh Chargers/Victoria Metro, ruckman-forward, 199cm, 23/3/2007\n\nKey Talent League stats (averages): 12.5 disposals, 7.5 contested possessions, 3.5 hitouts-to-advantage.\n\nEmmett’s appeared just twice at Talent League level this season, and lowered his colours to Cooper Duff-Tytler in one of those games, but they have shared the honours across the years. They will be Vic Metro teammates. Emmett is not overly tall for a ruckman, but his excellent running ability separates him, and he also gets involved in the play and demonstrated last year he can make his mark as a forward.\n\nShifter says: “He’s not too dissimilar to Duff-Tytler: a super athlete, lovely size, covers the ground, marks it and gets dangerous when he’s forward. He is that modern-day type, [similar to] Rowan Marshall or Luke Jackson. He placed in the best-and-fairest as a bottom-ager, which is unusual as a ruckman, and is certain to be one of the first talls taken.” Oliver Greeves Eastern Ranges/Victoria Metro, midfielder, 191cm, 7/2/2007\n\nKey Talent League stats (averages): 25 disposals, 5.7 inside 50m, 5 clearances.\n\nMeet the grandnephew of the first Brownlow medallist, Edward “Carji” Greeves, a tall, strong and powerful midfielder with good skills. There are mixed opinions on whether he can be a genuine midfielder-forward at AFL level, as a Christian Petracca or Cam Rayner-type, or whether he projects more like a Patrick Cripps or Ollie Wines. There are some queries on Greeves’ running ability, but he could be a top-three selection by year’s end.\n\nShifter says: “He’s a bull who loves to hunt the ball and win the footy. He’s done it so regularly for three years, so there’s a line of sight now, but he’s raised the bar each year, in terms of performance and ball-winning ability. He’s got a wonderful, effervescent personality, and I’m expecting him to have a great championships.” Sam Grlj\n\nGrlj (pronounced “grill”) is the most explosive midfielder among this year’s prospects, and a footballer who is confident enough to take the game on, break tackles and play with speed. He takes his football seriously and brings an intensity with that approach. The most common knock from recruiters is on Grlj’s kicking, but they believe his strengths are so plentiful that it won’t be an issue in the AFL.\n\nShifter says: “Sam was forced out of the midfield last year because of the teammates he had who became AFL-listed players. He’s played across half-back, but jumped in as a midfielder in his 18th year, and he breaks lines with his dazzling pace to open the game, which is a priceless commodity. He is brave and exciting.” Max King Sydney Swans Academy/Allies, forward/midfielder, 192cm, 1/9/2007\n\nKey Talent League stats (averages): 14 disposals, 8.8 contested possessions, 5.8 score involvements\n\nKing’s raw athleticism and potential make him an exciting prospect to monitor, with his leaping and marking ability among his most eye-catching traits. He is playing various roles, including trying to go head-to-head with Dyson Sharp in the midfield last weekend, but has probably shown the most as a forward. Improving his decision-making will be crucial to whether King ends up being a top-10 selection.\n\nShifter says: “Max is highly promising, and an exciting prospect out of the Swans Academy. He is the perfect athlete, has a great spring, and he’s taken some wonderful marks the last two years. He’s a boy who is all promise and potential, and we want to see him have that breakout game, so we look forward to that in the champs.” Geelong Falcons footballer Josh Lindsay has performed well in representative matches. Credit: Geelong Falcons\n\nJosh Lindsay Geelong Falcons/Victoria Country, defender/midfielder, 183cm, 7/4/2007\n\nKey Talent League stats (averages): 26 disposals, 7.5 contested possessions, 4.5 tackles.\n\nLindsay could hardly have proven his bona fides more as one of the best-performed players in the 2025 draft class. He won the medal as Team Heppell’s best player in the 2024 Futures game on grand final day on the MCG, and collected another best-on-ground honour in this year’s first AFL Academy game. Recruiters believe Lindsay projects as a defender or wingman at this stage, but has the potential to develop into a midfielder.\n\nShifter says: “His performance is so consistent. He’s a smooth mover, covers the ground brilliantly, hits every target with pinpoint accuracy, and can play down back or on a wing. He’s a bit like [Melbourne’s] Xavier Lindsay, and he has not done anything wrong.” Archie Ludowyke Sandringham Dragons/Victoria Metro, key forward, 197cm, 19/11/2007\n\nKey Talent League stats (averages): 9.5 disposals, 5 marks, 3 goals\n\nLudowyke (pronounced “loo-doe-wick”) is viewed as this year’s best key forward prospect at this stage and a surefire top-10 selection. He is lightly framed, but the consistent view among recruiters was that he had emphatically answered queries entering the season about his combativeness and competitiveness. Ludowyke reads the play well, flies for marks, is also effective at ground level and gets into the right spots with his high IQ.\n\nShifter says: “Like all talls, it’s hard because you’re trying to project three years on with how he will develop physically, but he’s got all the tools. He’s a great size, a good athlete, his marking is spectacular, he has a lovely left-foot kick, and I liken him to a Matthew Lloyd when he was 16 or 17. He looks pretty special.” Dylan Patterson\n\nPatterson is all about speed, talent and power, has an unreal highlights reel, and scope to improve as a rugby league convert. There are recruiters who think the athletically gifted teenager could emerge as a top-five selection with an outstanding under-18 championships, whereas others are concerned with him going missing at times during matches and his willingness to commit in contests.\n\nShifter says: “Dylan was an All-Australian in the under-16s, but that was more on the glimpses he had shown. He’s had some exciting moments this year, and he has breathtaking pace and the ability to break lines, whether playing at half-back or on a wing. He has a step, too, and the ability to change lanes is so vital at AFL level.” Dyson Sharp Loading Central District/South Australia, midfielder, 188cm, 23/5/2007\n\nKey SANFL U18s stats (averages): 31 disposals, 6 clearances, 5 marks\n\nSharp has long been touted as one of the best players in the 2025 draft crop, but that also means he has been scrutinised more closely than most. Not every recruiter loves him, but those who do rate him as a genuine top-five prospect and point to his outstanding trial game last weekend for South Australia as evidence. Sharp’s supporters believe his “man-child” tag is unfair. He thrives in the contest and seems primed for a huge carnival.\n\nShifter says: “Another of the bulls. He debuted at senior SANFL level at 17, just like [Jason] Horne-Francis and these kids do, and reminded us last weekend of his elite ability in the final trial for SA against the NSW academies. He was the best player in that game, and he’s going to be highly sought-after at the end of the year.”",
    "source": "TheAge",
    "cluster_id": 21
  },
  {
    "url": "https://www.theage.com.au/national/nsw/my-son-s-death-was-not-in-vain-joe-s-law-means-lives-will-be-saved-20250605-p5m591.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "My son’s death was not in vain: Joe’s Law means lives will be saved",
    "publish_date": "Fri, 06 Jun 2025 11:48:01 +1000",
    "category": "finance",
    "authors": [
      "Elouise Massa"
    ],
    "text": "On Thursday night, the NSW parliament passed “Joe’s Law”, named after my son Joe, who died in the Northern Beaches Hospital last year after a series of catastrophic medical errors.\n\nJoe’s Law is named after Joe Massa who died in September. (Left) Parents Elouise and Danny Massa. Credit: Kate Geraghty and supplied\n\nWe were moved to tears listening to members of parliament endorse the bill and share their own insights. Not one person, from any party, opposed it.\n\nOur family is forever changed. Our two other children – Grace and Teddy – did not have the chance to celebrate Joe’s second birthday or any future ones. He was less than two months away from turning two.\n\nEarlier this year, my husband Danny and I stood alongside Premier Chris Minns and Health Minister Ryan Park to announce the introduction of this landmark legislation, which prohibits new public-private partnership arrangements for the provision of acute hospital services such as emergency departments.",
    "source": "TheAge",
    "cluster_id": 22
  },
  {
    "url": "https://www.theage.com.au/lifestyle/life-and-relationships/instagram-has-decided-i-m-a-sad-old-sack-it-s-only-partly-true-20250605-p5m5ae.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Instagram has decided I’m a sad old sack. It’s only partly true",
    "publish_date": "Fri, 06 Jun 2025 11:45:00 +1000",
    "category": "lifestyle",
    "authors": [
      "Kate Halfpenny"
    ],
    "text": "Fidgety while my husband drove us to the airport last Friday, I checked my email. A bald message from Instagram: my personal account had been locked due to “suspicious activity”. Here’s a recovery link.\n\nTurned out the only thing vaguely suss was I’d changed a security setting the day before. That was enough to have Meta on full alert. Thanks, I guess. But since then, no amount of link-clicking or troubleshooting-page scouring has unlocked what’s been mine since 2012.\n\nHow much longer could I spend dodging posts about gut-health gummies and Trinny Woodall’s eyeshadow? Credit: Flavio Brancaleone\n\nThirteen years of life moments – kids in everything from face paint to graduation gowns, the first photo ever taken of me and Chris together (off our gourds in a Canberra pub), ex-husbands, ex-haircuts – made inaccessible by the cold efficiency of Mark Zuckerberg’s customer service department.\n\nMy first instinct was panic. My resting heart rate shot to 87. Then: admin mode. I filled out forms that vanished into the Meta abyss, sent pleading emails to nobody. Paid $80 to the local IT experts to work some magic.",
    "source": "TheAge",
    "cluster_id": 23
  },
  {
    "url": "https://www.theage.com.au/business/companies/elon-musk-loses-52-billion-in-one-day-as-trump-feud-boils-over-20250606-p5m5er.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Elon Musk loses $52 billion in one day as Trump feud boils over",
    "publish_date": "Fri, 06 Jun 2025 11:45:00 +1000",
    "category": "finance",
    "authors": [
      "Dylan Sloan",
      "Tom Maloney"
    ],
    "text": "Minute by minute, post by post, Elon Musk’s very public, extremely online feud with US President Donald Trump sliced into his vaunted status as the world’s richest person.\n\nThe final damage at day’s end: $US34 billion ($52 billion) erased from his personal net worth, the second-largest loss ever in the history of the Bloomberg Billionaires Index of the 500 wealthiest people on the planet. The only bigger one: his own wipeout in November 2021.\n\nThe world’s richest person’s fortune is shrinking. Credit: AP\n\nThe tit-for-tat was surreal, and also, in some ways, potentially inevitable for a US president who has used the Oval Office to dress down world leaders and a chief executive who has a history of launching himself from one crusade to another. The trigger was Musk’s sudden push, just days after he departed from Washington, to muster enough support to “kill” Trump’s signature “Big, Beautiful Bill”.\n\nMusk, who is still the world’s richest person with a vast $US334.5 billion fortune, has endured any number of routs before. But the stakes are higher than ever in contending with Trump, as the president laid bare when he proposed ending Musk’s government contracts, in a potential blow to Tesla and SpaceX revenue.",
    "source": "TheAge",
    "cluster_id": 0
  },
  {
    "url": "https://www.theage.com.au/sport/run-it-straight-is-anarchy-in-the-guise-of-sport-20250605-p5m533.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Run It Straight is anarchy in the guise of sport",
    "publish_date": "Fri, 06 Jun 2025 11:44:35 +1000",
    "category": "sports",
    "authors": [
      "Darren Kane"
    ],
    "text": "And yet social media is lit up as, too, are the antennae of ambulance-chasing lawyers. Run It Straight competitions take place as organised and ticketed events, which have also inspired impromptu gatherings in the streets of Sydney and even on the hill at Brookvale Oval. The concept of freedom and personal choice shouldn’t be the exception, and governments can’t always legislate against every variant of idiocy, but “running it straight” is dangerous. Car manufacturers use crash test dummies, as opposed to real people, for a reason. Some poor kid in New Zealand has died already, apparently during an impromptu event that wasn’t organised by anyone, and therefore had no rules and no safety measures at all. I come at all this from the context that I am the chairman of the Combat Sports Authority of NSW. The authority is bestowed with the statutory power, and responsibility, to regulate sports including boxing, kickboxing and mixed martial arts, insofar as those sports occur within the state. Put simply, the legal responsibility to make unsafe sports as safe as they can be. That’s a heavy burden. Boxing can be very dangerous. There will be an incalculable number of amateur and professional bouts around the world during 2025 and there will be fighters somewhere, sometime this year, who will not come home after a bout. Run It Straight is no safer.\n\nJohn Graham Chambers wrote the Marquis of Queensbury Rules for boxing in the late 1860s and they remain the basis for the sport today. Though the Queensbury Rules didn’t conceive of boxing, they organised and codified the sport. If Chambers and the Marquis of Queensbury lived on modern times, boxing as a codified sport wouldn’t exist. If before yesterday, nobody had ever conceived of a sport consisting of two opponents strapping on gloves and climbing inside the ring to slug it out, it wouldn’t get off the ground as a legitimate pursuit. Because society in 2025 wouldn’t countenance that nascent sport’s existence. And yet here we are in 2025, and Run It Straight is a thing … But boxing does exist despite sections of society wishing it didn’t. And that’s the prism through which Run It Straight must be analysed. Despite the social media firestorm, variants of the activity have taken place for many years, especially in Pasifika communities. But that doesn’t mean freedom and anarchy should reign. Should boxing be banned because it’s too dangerous? Absolutely NOT. That’d be outright ridiculous, just like banning almost anything proves to be. Look what happened when the NSW Government attempted to ban greyhound racing a decade ago. For many of its participants boxing contributes much to ensuring a positive focus and useful direction in life, in circumstances where they have otherwise been dealt sevens and twos. Maybe Run It Straight does, too. But that doesn’t mean it should exist unregulated. Are organised duels next?\n\nWhile trite to highlight, the archetypal boxer knows of the risks associated with partaking in the sweet science and voluntarily assumes them. So does the Run It Straight-er. The difference, though, is that boxing is regulated; it has systems, checks and guardrails. Great responsibility rests upon the shoulders of boxing’s regulators, to ensure the health and safety of combatants. The best example is this: in any circumstances where a combatant in NSW loses a bout, either by knockout or TKO, they’re automatically suspended for the next 30 days. No exceptions. That’s been the rule in NSW for years, in circumstances where not every TKO results in a diagnosed concussion for the combatant. Should the same fighter go on to lose their next bout by either of those same methods, they’re suspended for another 60 days. Should they then suffer defeat in their next comeback match the same way, another 90 days outside the ropes is mandatory, in addition to requirements that they submit to medical and diagnostic testing. Conversely, Run It Straight is a catastrophic car crash waiting to happen. Organisations like Run It Straight Championships and Run It Straight 24, each of which run planned, ticketed and promoted, prizemoney-based competitions, have no discernible rules. There’s also no medical pre-contest screenings; no concussion protocols; no doctors in the same postcode and no identifiable risk management strategies.",
    "source": "TheAge",
    "cluster_id": 24
  },
  {
    "url": "https://www.theage.com.au/world/north-america/the-trump-musk-bandwagon-was-always-going-to-crash-but-it-s-done-so-with-impressive-violence-20250606-p5m5g8.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "The Trump-Musk bandwagon was always going to crash, but it’s done so with impressive violence",
    "publish_date": "Fri, 06 Jun 2025 11:40:09 +1000",
    "category": "finance",
    "authors": [
      "Michael Lind"
    ],
    "text": "Musk had never served in public office before. His ignorance of government organisation and procedures showed. Like generations of other vain, ignorant business tycoons, he thought the problem with government was that it was not run like a business. Musk set about using his ill-defined authority to try to downsize the federal government as though it were one of his own companies, Tesla or PayPal or SpaceX. In 2022, when he bought control of Twitter, now known as X, Musk prepared for mass lay-offs of Twitter employees by sending the workforce an email asking what they had done last week. Similarly, in February, the Office of Personnel Management, over which Musk had no authority, nevertheless on his behalf sent an email to about 2 million federal employees that demanded they send their managers a list of five accomplishments from last week. Later on X, Musk announced, on the basis of no authority whatsoever, that anyone who refused to answer would be fired; he subsequently said the millions of employees would get a second chance and finally reversed himself, saying it had just been a “pulse check”. Elon Musk speaks at a cabinet meeting at the White House in February. Credit: AP The Department of State, led by former senator Marco Rubio, along with the Defence Department and FBI, told their employees not to answer Musk’s email. The tensions between Musk, who according to the administration was not actually in charge of DOGE, and Trump’s constitutionally appointed, Senate-confirmed cabinet secretaries were on public display in a bizarre videotaped cabinet meeting in which Musk, dressed in black, babbled in front of stony-faced officials. According to reports, Musk on another occasion got into a shouting match with Treasury Secretary Scott Bessent.\n\nDisloyal as he is to his own subordinates, Trump expects loyalty from others. It was one thing for Musk to fight with other Trump appointees behind the scenes, another to attack them in public. After Trump unveiled his half-baked tariff plan on April 2, Musk called Trump trade adviser Peter Navarro “truly a moron” and “dumber than a sack of bricks”. Reportedly Musk further damaged his relationship with Trump by pouring $US20 million ($31 million) into a special Wisconsin state Supreme Court election, offering to pay a million dollars apiece to lucky individual voters. This crass attempt to buy an election backfired against the Republican candidate Musk favoured, and the backlash powered the Democrat to victory. Elon Musk attacked Trump in posts on X on Thursday (Friday AEST). Credit: NurPhoto via Getty Images The trigger for the final break between Musk and Trump was money. On X, Musk tried to rally Republicans in Congress to vote against the “big, beautiful bill” that would be the central achievement of Trump’s first year in his second term. “KILL the BILL,” Musk ranted in one of more than two dozen tweets criticising the legislation. Some Republicans blamed Musk’s opposition to the bill on cuts to subsidies to consumers who bought electric cars from Tesla and other companies. Telling reporters that he was “very disappointed” in his donor and former DOGE czar, Trump said, “Look, Elon and I had a great relationship. I don’t know if we will any more.”\n\nOn X, Musk responded: “Without me, Trump would have lost the election, Dems would control the House and the Republicans would be 51-49 in the Senate. Such ingratitude.” No stranger to social media, Trump replied on his own platform, Truth Social: “Elon was ‘wearing thin’; I asked him to leave, I took away his EV Mandate that forced everyone to buy Electric Cars that nobody else wanted (that he knew for months I was going to do!), and he just went CRAZY!” Donald Trump and Elon Musk show off a Tesla at the White House in March. Credit: AP Trump followed this up with a threat: “The easiest way to save money in our Budget, Billions and Billions of Dollars, is to terminate Elon’s Governmental Subsidies and Contracts. I was always surprised that Biden didn’t do it!” Exit stage right-wing.\n\nThe end of the Trump-Musk relationship is a source of amusement to Democrats and a source of relief to Republican populists who dream of what Trump once called the “Republican workers’ party”, not a party subordinated to weird libertarian billionaires. Loading But everyone can learn from the latest demonstration of the fact that celebrity outsiders who have never held office before – generals like Ulysses S. Grant and Dwight Eisenhower, businessmen like Herbert Hoover and Donald Trump and Elon Musk – tend to perform poorly when given authority over America’s complex government, compared with presidents who had worked their way up in politics like Washington, Lincoln and Franklin D. Roosevelt. When Eisenhower was elected as president, his predecessor Harry Truman joked: “He’ll sit right there and he’ll say, do this, do that! And nothing will happen. Poor Ike – it won’t be a bit like the army.” Or Tesla or Twitter, either.",
    "source": "TheAge",
    "cluster_id": 25
  },
  {
    "url": "https://www.theage.com.au/goodfood/brisbane-eating-out/the-5-tool-that-will-elevate-your-thai-cooking-according-to-a-star-chef-20250603-p5m4oi.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "The $5 tool that will elevate your Thai cooking, according to a star chef",
    "publish_date": "Fri, 06 Jun 2025 11:30:00 +1000",
    "category": "finance",
    "authors": [
      "Matt Shea"
    ],
    "text": "Advertisement\n\nEating outKitchen Drawer The $5 tool that will elevate your Thai cooking, according to a star chef Looking to level up your Thai salads and desserts? Longrain creator Martin Boetz reckons you need this simple utensil. Matt Shea June 6, 2025 Save Log in , register or subscribe to save recipes for later. You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share\n\nMartin Boetz reckons Thai cooking is getting better in Australia. Or more sophisticated, at least. “There are better restaurants around using proper ingredients,” Boetz says. “Even your local Thai restaurant is putting Thai basil in the curries, rather than nothing, like they used to.” Martin Boetz at Short Grain with his coconut scraper, which can be bought for as little as $5 at your local Asian supermarket. Markus Ravik Boetz should know. He’s partly responsible, given his creation of Longrain in Sydney in 1999. It was such a hit it inspired a second restaurant in Melbourne (which is still a going concern, now under the stewardship of Scott Pickett) and went on to influence a raft of others, from Chin Chin in Melbourne to EP & LP in Los Angeles and Longtime (now Same Same) in Brisbane. Often, it was Boetz’s former Longrain lieutenants heading up the kitchens in these venues, such as Louis Tikaram at EP & LP or Ben Bertei at Longtime.\n\nAdvertisement\n\nRelated Article The one rice cooker you need at home? It’s not a rice cooker, says this top chef And the effect has trickled down over time to smaller, more local venues, and now the home kitchen. Plus, people are travelling to Thailand more. “They have that deeper knowledge of Thai food,” says Boetz, who now owns Short Grain in Brisbane. There are plenty of tools and techniques that can help elevate your Thai cooking, Boetz reckons, from learning to use a wok correctly, to cooking out your store-bought pastes with coconut oil, to mastering the balancing of your curries with the addition of acid or salt.\n\nAdvertisement\n\nBoetz demonstrating how to use his coconut scraper. Markus Ravik Still, there’s one small utensil that can be bought for as little as $5 that he reckons will make a big difference to your Thai cooking at home: the humble coconut scraper. Before you ask, no, not a coconut shredder, which you may have seen cooks in Thailand use to shred fresh coconut to make coconut milk or cream. This is a smaller, simpler and cheaper handheld device used to scrape flesh from the inside of the coconut after it’s been split in two. Boetz likes to use his to elevate his Thai salads and desserts. “I have a whole stack of them under in the cupboard because if you use them every day, they don’t tend to last long,” Boetz says. “But it’s something that it pays to be gentle with. If you get stuck into it too hard, it ends up being a real thick piece.\n\nAdvertisement\n\nBoetz uses a coconut scraper to elevate his salads and desserts. Markus Ravik “It’s just a gentle scrape, but it’s easy for people to get the hang of.” Boetz demonstrates on a fresh coconut and the result is thin white wafers that resemble a crinkle cut potato chip. To eat, it has more flavour and a more tender texture than store-bought dried coconut. “You can take this and roast it and then use it on cakes,” Boetz says. “Because it’s pretty. It has that lovely curl to it.” Its more immediate use, though, is as a fresh addition to Thai-style salads. Boetz likes to pound bird’s eye chillies (“scuds” in Thai cooking) and garlic and put them on a simmer with some coconut cream, fish sauce and a dash of white sugar.\n\nAdvertisement\n\nBoetz’s poached tuna salad with freshly shaved coconut. Markus Ravik He’ll then add some tuna, lightly poaching it, before taking it out, breaking it into pieces, and throwing it together with Thai basil, peanuts and the freshly scraped coconut. The poaching liquid is then used as a dressing, Boetz finishing the dish with a squeeze of fresh lime. “It’s just a really simple dish with lots of flavour,” Boetz says, “and the coconut adds a lovely texture to that salad.”\n\nRestaurant reviews, news and the hottest openings served to your inbox. Sign up",
    "source": "TheAge",
    "cluster_id": 26
  },
  {
    "url": "https://au.news.yahoo.com/satellite-image-shows-huge-bin-change-coming-to-aussie-households-fogo-a-no-go-232128076.html",
    "title": "Satellite image shows huge bin change coming to Aussie households: 'FOGO a no go'",
    "publish_date": "2025-06-05T23:21:28Z",
    "category": "finance",
    "authors": [],
    "text": "In Queensland, it seems that a million residents in the Brisbane City Council area will soon receive green bins, but details of the rollout remain undisclosed.\n\nSatellite photos show thousands of green bins sitting idle, waiting to be rolled out across Brisbane. Source: Google Maps\n\nSatellite photos reveal a vast stockpile of green bins sitting idle, seemingly ready for deployment across a major east coast city. And though the local council has confirmed the bins' existence, it remains tight-lipped about any forthcoming plans for the new service.\n\nWhile FOGO systems have been widely introduced in other Australian states, particularly in Victoria and New South Wales, in Queensland, councils have cited a mix of cost, logistical complexity and community readiness as reasons for delaying full-scale implementation.\n\nIn Brisbane, the city council had previously rolled out an opt-in service for green-lidded bins at a quarterly price of $49. Used for garden waste and not food scraps like FOGO, it's believed that just 30 per cent of eligible households took up the offer.\n\nBut satellite photos available on Google show a massive stockpile of the bins waiting at Nudgee, Rochedale and Willawong council depots.\n\nBrisbane City Council had previously rolled out an opt-in service for green-lidded bins, but believed that just 30 per cent of eligible households took up the offer. Source: Brisbane City Council\n\nParties argue over yet-to-be-announced green bin scheme\n\nBrisbane City Council, controlled by the Liberal party since 2008, had suggested that it would make a bin-related announcement when the council budget is released this month, but Labor seemingly beat them to the punch — and wants to take credit.\n\nADVERTISEMENT\n\nAccording to the ABC, leaked details by Labor indicate that free green bins for garden waste will be rolled out across the city.\n\nLNP councillor Sarah Hutton declined to provide further details until June 18 when pressed by the ABC, but stated that \"FOGO is a no-go\".\n\n\"I can promise you that we will be making sure if people want a green bin, there'll be an option for them to get a green bin,\" she told the national broadcaster. \"We'll wait and see what the budget has to say.\"\n\nShe would also not say whether residents who had paid for a green bin would be refunded if they're now made freely available.\n\nAccording to the opposition leader, Jared Cassidy, Labor deserves the credit for the green bins. He said it would have happened sooner if not for the council \"stalling\". \"The amount of organic waste going into landfill is the single biggest contributor to Brisbane's carbon footprint, and all we've seen is years of inaction from this LNP Council,\" he claimed.\n\nADVERTISEMENT\n\n\"Brisbane should be leading Queensland on green waste services, but instead we've been falling behind other councils like Moreton Bay, which rolled out a city-wide garden organics program last year.\"\n\nFOGO bins have been widely adopted in other parts of the country. Supplied/TikTok\n\nWhat are the benefits of FOGO bins?\n\nFood Organics and Garden Organics (FOGO) recycling systems offer significant environmental benefits by diverting organic waste, such as food scraps and garden clippings, away from landfill and into composting or anaerobic digestion facilities.\n\nThis process reduces methane emissions, a potent greenhouse gas produced by decomposing organic matter in landfills, and creates valuable compost that can improve soil health and support sustainable agriculture. Several Australian states have widely adopted FOGO systems with NSW mandating that all council areas adopt the system by 2030.\n\nADVERTISEMENT\n\nQueensland, however, has been slower to implement FOGO across its councils, with many opting for limited or opt-in green waste services rather than comprehensive organic waste separation.\n\nDo you have a story tip? Email: newsroomau@yahoonews.com.\n\nYou can also follow us on Facebook, Instagram, TikTok, Twitter and YouTube.",
    "source": "Yahoo",
    "cluster_id": 32
  },
  {
    "url": "https://au.news.yahoo.com/grim-200kg-find-on-picturesque-beach-prompts-plea-to-aussies-075647836.html",
    "title": "Grim 200kg find on picturesque beach prompts plea to Aussies",
    "publish_date": "2025-06-05T07:56:47Z",
    "category": "finance",
    "authors": [],
    "text": "Tourists flock to the Whitsunday Islands every year, however many are likely oblivious to the quiet national crisis lurking within arm’s reach.\n\nVolunteers collected a whopping 209kg of rubbish from one beach in the Whitsunday Islands. Source: Eco Barge Clean Seas\n\nKnown for its picturesque beaches, sparkling blue water and colourful reefs, the Whitsunday Islands attract hundreds of thousands of tourists from around Australia and the world every year. Holidaymakers flock to the area to dive, snorkel and soak up the sun, however many may be oblivious to the quiet national crisis lurking within arm’s reach.\n\nThe country’s aquatic pollution — from microplastics washing up on shore to discarded fishing gear entangling marine animals — is escalating, with a recent 209kg haul highlighting the pressure it is placing on the iconic Queensland destination.\n\nLast week, volunteers for Eco Barge Clean Seas, a non-profit based in Airlie Beach, removed the staggering amount of rubbish from Mackerel Bay on Hook Island. A second trip carried out a few days later resulted in the collection of another 167kg of marine debris.\n\n“We’ve got 40 to 45 known hotspot beaches within the Whitsunday Islands, and they’re all on southeast facing bays,” Eco Barge founder Libby Edge told Yahoo News. Due to their location, pollution — mainly plastic — is constantly washing up in the select coves thanks to strong winds.\n\nThe non-profit hit a milestone this week, with over 300,000kg of rubbish collected since 2009. Source: Eco Barge Clean Seas\n\nNon-profit hits 300,000kg marine debris milestone\n\nThe most common item collected is “hard bits of plastic” that have broken off from larger items, and hundreds of thousands of bottle top lids, Edge said. “We average around about 40 trips a year, and that’s us staying on top of newly arriving marine debris coming to the Whitsunday Islands,” she explained.\n\nADVERTISEMENT\n\nDespite an increase in awareness around the growing issue since she founded the organisation in 2009, Edge said she hasn’t seen “much of a change” over the years.\n\nIn that timeframe, with the help of 13,000 volunteers, the group hit a milestone figure this week, collecting a total of 300,000kg of rubbish — just in time for World Environment Day on Thursday.\n\n“It’s been a very hard journey, but very rewarding,” Edge told Yahoo. “I wanted people like me to really feel that effect of what we do on land, affects our ocean and our marine life.”\n\nFor many Aussies, the issue is “out of sight, out of mind”, she continued. “It’s in the middle of the ocean. You don’t see the plastic and the horrific impact it’s having on our marine life.”\n\nHowever, that doesn’t mean it isn’t happening.\n\nIn 2013, Edge noticed turtles living in the reefs were struggling after repeated cyclones wiped out a lot of their food source, prompting her to launch the Whitsunday Turtle Rescue Centre, which has since cared for 272 animals.\n\nAussies are encouraged do their part when wandering along a beach or river. Source: Eco Barge Clean Seas\n\nAussies urged to do their part as pollution crisis worsens\n\nNow she’s encouraging Aussies to do their part when wandering along a beach or river. “When you go to the beach as an individual, you really can get despondent… but at one point, someone held that plastic item and didn’t dispose of it correctly — it shouldn’t be in the ocean,” Edge said.\n\nADVERTISEMENT\n\nWherever rubbish is dumped, there’s a high chance it will inevitably enter the ocean.\n\n“So even if it’s not your trash, pick it up, because you do not want Mother Nature ingesting it, and entangling in it,” she added. “It’s human produced plastic. Let’s dispose of it correctly. It doesn’t have to be your plastic. Just do your bit every day.”\n\nEco Barge Clean Seas partnered with Coca Cola Australia in 2018, but Edge said the non-profit is always open to other organisations and volunteers who want to help out.\n\nDo you have a story tip? Email: newsroomau@yahoonews.com.\n\nYou can also follow us on Facebook, Instagram, TikTok, Twitter and YouTube.",
    "source": "Yahoo",
    "cluster_id": 33
  }
]