[
    {
        "url": "https://www.9news.com.au/national/porepunkah-shooting-updates-dezi-freeman-son-says-alleged-killer-is-like-rambo/179a8292-f019-4c70-9449-544f8455a64f",
        "title": "Suspected cop killer Dezi Freeman like 'Rambo', son says",
        "publish_date": "Mon, 08 Sep 2025 01:35:34 +0000",
        "category": "entertainment",
        "authors": [
            "Sep"
        ],
        "text": "\"I'm not sure if you have ever seen the movie\n\nRambo\n\n, especially the first\n\nRambo\n\nmovie, it's like that but 10 times' capacity.\"",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/mystery-tasmanian-lotto-winner-pockets-two-and-a-half-million-dollar-prize/01d5d737-c507-49dd-8f69-34056149cfa9",
        "title": "Mystery lotto player pockets $2.5 million prize as state's winning run continues",
        "publish_date": "Sun, 07 Sep 2025 22:00:01 +0000",
        "category": "finance",
        "authors": [
            "Sep"
        ],
        "text": "T﻿he multimillion-dollar lottery prize-winning run in Tasmania continued on the weekend, with one mystery player pocketing $2.5 million.\n\nLottery officials are today urging residents and visitors in the city of Launceston to check their TattsLotto tickets to see if they're the lucky winner.\n\nThey say the holder of the winning ticket is probably starting their working week with no idea they are now an instant millionaire.﻿\n\nThe search is on for a mystery Tasmanian lotto player who pocketed $2.5 million on the weekend.. (Supplied)\n\nThe Tasmanian winner held one of the eight division one winning entries in draw 4605 on Saturday, September 6. Every winning entry was worth $2.5 million.\n\nSo far this year, the Apple State has recorded 11 division one wins, collectively worth more than $13 million. Five of the winning tickets have been in Launceston.\n\nThe latest winning entry was purchased at Racecourse Newsagency & Gifts in the Launceston Shopping Centre.\n\nThe Lott spokesperson Matt Hart says when the mystery discovers their new-found riches they'll be \"jumping for joy\".\n\n\"If you do discover that you are holding the winning ticket, contact The Lott on 131 868 to begin the process of claiming your prize,\" he said.\n\n\"This is a great reminder to all players to register their lottery tickets to a player card or online account with The Lott Members Club, so if you score a major prize, we can call you right away.\"\n\nThe winning numbers in TattsLotto draw 4605 last Saturday were 43, 6, 21, 10, 42 and 16, while the supplementary numbers were 23 and 36.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/adelaide-norwood-crash-car-smashes-through-alterations-shop/d78d980e-18da-4979-87a2-61767311ac9f",
        "title": "'Miracle no one was hit': Car smashes through alterations shop",
        "publish_date": "Sat, 06 Sep 2025 10:09:32 +0000",
        "category": "finance",
        "authors": [
            "Sep"
        ],
        "text": "A car has gone crashing into an alterations shop in Adelaide, with witnesses hailing it a \"miracle\" that no one was injured.\n\nEmergency crews were called to George Street in Norwood about 11.30am today.\n\nCCTV captured the silver Toyota making a U-turn and swiping three cars before driving onto a footpath on the opposite side of the road.\n\nA car has come crashing into an alterations shop in Adelaide, with witnesses hailing it a \"miracle\" that no one was injured. (Supplied)\n\nThe car was seen knocking over a street sign and narrowly avoiding two women before it crashed into the alterations shop.\n\n\"Very loud, very loud,\" witness Sue Duong said.\n\nWitnesses rushed to help the driver, a 46-year-old man from Kent Town, and called for help.\n\nFirefighters worked to free the man, and the car was later towed away. ﻿\n\nThe driver was treated at the scene for minor injuries and fined for the crash.\n\nThe shop owner told 9News he was inside at the time, but was luckily in the back corner of the store﻿.\n\n\"It's ﻿a miracle no one was hit,\" Duong said.",
        "source": "9News"
    },
    {
        "url": "https://www.abc.net.au/news/2025-09-08/nfl-week-one-quick-hits-spitting-rodgers-packers-kickers/105746960",
        "title": "NFL quick hits: Spitting issues continue, Rodgers rolls back the years",
        "publish_date": "Mon, 08 Sep 2025 01:55:34 +0000",
        "category": "sports",
        "authors": [],
        "text": "The NFL is back with a jam-packed week one slate of games over in the USA.\n\nWeek one is, of course, far too early to get a read on how the rest of the season will pan out, but that's not going to stop people reading into just about anything and everything that the first suite of games has served up.\n\nWhether it's a legendary star putting the boot into a former team, or a recent transfer proving his worth, here's what went down in week one of the NFL.\n\n1. Rodgers rolls back years in comeback win on Steelers debut\n\nAaron Rodgers got off to a winning start with the Steelers. (AP Photo: Vera Nieuwenhuis)\n\nAaron Rodgers turned back the clock with a vintage performance in his Steelers debut that featured big throws, no turnovers and a late victory over his former team.\n\nRodgers threw four touchdown passes — two in a 50-second span in the second half — and Chris Boswell kicked a go-ahead 60-yard field goal with 1:03 remaining to lead Pittsburgh to a 34-32 victory over the New York Jets on Sunday.\n\n\"I love beating everybody,\" Rodgers, who finished 22 of 30 for 244 yards and the four scores, said.\n\n\"It doesn't matter who it is.\"\n\nBut this one had to be a little more satisfying, especially after he was released by the Jets and new coach Aaron Glenn in the off-season.\n\n\"I was happy to beat everybody associated with the Jets,\" Rodgers said when asked if he was pleased to beat Glenn.\n\n\"I gave as much as I could to the team. I didn't have any hard feelings about it not working out. I didn't maybe appreciate the way it went down in the end, but that's in the past.\n\n\"And we're one and zero.\"\n\n2. Spitting epidemic continues in college football\n\nBrendan Bett (90), in less controversial circumstances, transfered to Florida from Baylor this season. (AP Photo: Alan Youngblood)\n\nIt's not been a great week for players spitting at each other in American football.\n\nJust two days after Philadelphia Eagles defensive tackle Jalen Carter was ejected for spitting on Dallas quarterback Dak Prescott in the NFL opener, Florida defensive lineman Brendan Bett was ejected for spitting at a South Florida player late in the Gators' 18-16 upset loss on Saturday night.\n\nBett, who transferred to Florida after two years at Baylor, was flagged for unsportsmanlike conduct, kicked out of the game and escorted to the locker room after spitting in the face mask of Bulls offensive lineman Cole Skinner.\n\nIt was one of two penalties assessed against the Gators on the final, 87-yard drive that set up Nico Gramatica's 20-yard field goal on the final play.\n\n\"We'll take a good look at it, but it's unacceptable,\" Florida coach Billy Napier said.\n\n\"I think we've got a lot of players in that room as well that have the same belief that it's unacceptable.\n\n\"When a guy does something like that, he's compromising the team. He's putting himself before the team. Everything the game is about, you're compromising. So there will be lessons to be learned there. Yeah, it's that simple.\"\n\n3. Parsons gets sack on Packers debut\n\nFormer Cowboy Micah Parsons had a good start to life in the north. (AP Photo: Mike Roemer)\n\nBy acquiring defensive star Micah Parsons from the Dallas Cowboys in a pre-season trade just a week before the start of the season, Green Bay rocketed into contention for the Super Bowl before a snap had been taken.\n\nHis first start for the Packers featured a sack and an impressive all-round display against two-time defending NFC North champions Detroit and gave those pundits even more pause for thought.\n\nThe Lions, who scored an NFL-high 33.2 points per game last season, didn't reach the end zone until the final minute of the game as the Packers won 27-13.\n\nJordan Love threw a pair of touchdown passes as the Packers got points on their opening three possessions at Lambeau Field, a place where the Lions had won their last seasons.\n\nFrom there, it was Parsons and the defence though, with the former Cowboy edge rusher getting a huge ovation from the Lambeau Field crowd when he was introduced before the game.\n\nHe got his first sack as a Packer with just over 4 minutes left in the game and applied pressure that led to Evan Williams's second-quarter interception, thwarting a Lions scoring opportunity.\n\nLove went 16 of 22 for 188 yards with touchdown passes of 15 yards to Tucker Kraft and 17 yards to Jayden Reed. Josh Jacobs added a three-yard score in the fourth quarter, giving him a touchdown in a franchise-record nine straight games.\n\nThe Packers went 1-5 in divisional games last year, but won their 13th consecutive home opener, giving them the longest such streak since the Miami Dolphins also won 13 straight from 1976-88.\n\n4. Lightning delays the inevitable\n\nBryce Young (right) had a disappointing performance. (AP Photo: Phelan M. Ebenhack)\n\nThe game between Carolina and Jacksonville was delayed roughly 75 minutes because of severe weather and lightning in the area.\n\nPanthers quarterback Bryce Young might have hoped the delay was even longer.\n\nThe 24-year-old turned over the ball three times in the game, including throwing two interceptions, as the Jaguars won 26-10.\n\nYoung completed 18 of 35 passes for 154 yards.\n\nThe Jaguars were leading 10-3 when, with 8:32 remaining in the second quarter, players and coaches headed to locker rooms.\n\nFans in open areas were asked to move to \"protected areas\" as a thunderstorm storm hovered north-east of EverBank Stadium in Florida.\n\n5. Kicking horror shows\n\nAndre Szmyt (left) did not have a great day from the place kicking tee. (AP Photo: Sue Ogrocki)\n\nKickers don't tend to get much of the spotlight in the NFL — unless they're doing things wrong.\n\nAnd boy did a couple of place kickers mess up this week.\n\nBrowns kicker Andre Szmyt missed an extra point and a 36-yard field goal in the second half as Cleveland lost their opener 17-16 to Cincinnati.\n\n\"What you've got to remember is that we've all been in a situation where we've all made mistakes before that have been a big part of costing us a football game. You got to shake it. It's not just on you. It's a team sport,\" quarterback Joe Flacco said about Szmyt's missed kicks.\n\n\"We're all going to be in there and rally together. Nobody wants to be in that situation and not come up for your team. But we've all been there and can understand not doing it.\"\n\nFalcons kicker Younghoe Koo also struggled as his Atlanta side fell to a 23-20 defeat against the Buccaneers.\n\nKoo, from South Korea, missed nine of his 31 kicks in 2024 and again fell short with a 44-yard field goal attempt that wasn't even close with 2 seconds remaining in the game.\n\n\"We've got to make those kicks,\" coach Rahaeem Morris said.\n\n\"Those are very makeable kicks. We've got to lock in and get that done.\"\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\nKoo didn't hang around to address the media after the game. His locker was already cleared out by the time reporters and camera crews were allowed in.\n\nIt was left to his teammates to defend their kicker.\n\n\"We still trust him,\" said quarterback Michael Penix Jr, who directed a last-minute drive that put the Falcons in position to force overtime. \"We still believe in him.\"\n\nThat being said, Tampa Bay's kicker Chase McLaughlin also had a tough day, missing from 44 yards in the third quarter and then hitting the upright with an extra point attempt in the final minute of the game.\n\n\"I'm not going to cuss here at the podium,\" coach Todd Bowles said.\n\n\"But I was pissed, to say the least.\"\n\nAll's well that ends well, I guess.\n\nWeek one NFL results\n\nThursday\n\nPhiladelphia Eagles 24-20 Dallas Cowboys\n\nFriday\n\nLos Angeles Chargers 24-21 Kansas City Chiefs\n\nSunday\n\nAtlanta Falcons 20-23 Tampa Bay Buccaneers\n\nCleveland Browns 16-17 Cincinnati Bengals\n\nIndianapolis Colts 33-8 Miami Dolphins\n\nJacksonville Jaguars 26-10 Carolina Panthers\n\nNew England Patriots 13-20 Las Vegas Raiders\n\nWashington Commanders 21-6 New York Giants\n\nNew York Jets 32-34 Pittsburgh Steelers\n\nNew Orleans Saints 13-20 Arizona Cardinals\n\nSeattle Seahawks 13-17 San Francisco 49ers\n\nDenver Broncos 20-12 Tennessee Titans\n\nLos Angeles Rams 14-9 Houston Texans\n\nGreen Bay Packers 27-13 Detroit Lions\n\nMonday\n\nChicago Bears vs Minnesota Vikings\n\nAP/ABC",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-09-08/anmf-nurses-union-victorian-election-first-in-36-years/105512254",
        "title": "Turmoil in powerful nurses union as members vote on Victorian branch boss",
        "publish_date": "Mon, 08 Sep 2025 00:59:37 +0000",
        "category": "finance",
        "authors": [],
        "text": "Members of the largest and most powerful union in Australia are voting for a new Victorian boss for the first time since 1989.\n\nThree candidates have nominated for the Australian Nursing and Midwifery Federation (ANMF) Victorian branch secretary role after long-time secretary Lisa Fitzpatrick stepped down in July.\n\nMs Fitzpatrick resigned after a member stoush over a pay deal for its 111,000 Victorian members.\n\nThe three-way contest for the top job, which boasts a salary of $320,000, will be decided by postal ballot which opens today.\n\nThe ANMF is the largest and most powerful union in the country with about 331,000 members Australia-wide, and is one of the few unions with continually increasing membership.\n\nLisa Fitzpatrick campaigned to stop unqualified health assistants replacing nurses and midwives in 2011. (Supplied: Australian Nursing and Midwifery Foundation)\n\nThe last Victorian nurses' union election was won by Belinda Morieson in 1989 after she defeated Irene Bolger who was sacked as the Australian Nursing Federation Victorian secretary and failed to win back her old job.\n\nFormer long-time ANMF secretary Ms Fitzpatrick resigned on July 4 after almost 24 years in the role.\n\nAssistant secretary Maddy Harradence was appointed to replace her.\n\nMs Harradence is running for the top job, along with former union organiser Quinn McGuinness.\n\nJimmy Parel, who is trying to start an new nurses' union, is also running.\n\nThe union says it's proud of the fight put up by members to secure better pay and conditions. (ABC News: Lucas Hill)\n\nLawyers called in\n\nThe election is shrouded in controversy.\n\nMs Harradence emailed members on August 19 and 21 notifying them an investigation had commenced into \"unauthorised use of members' information\".\n\n\"The branch … is in communication with our IT specialists, the Australian Electoral Commission and our lawyers,\" the email from Ms Harradence said.\n\nThe email sent to ANMF members alleged \"unauthorised use of member information\" during the union's election. (Supplied)\n\nThe allegation has now been removed from ANMF's website.\n\nThe contested election comes after a shake-up in the Victorian division of the Community and Public Sector Union (CPSU), when members this year dumped secretary Karen Batt, who had been in the role since Jeff Kennett was Victorian premier in 1993.\n\nFormer secretary resigns\n\nIn 2024, Victorian ANMF members shocked union leaders by publicly rejecting an in-principle pay deal struck by Ms Fitzpatrick.\n\nAt a Melbourne meeting of members in May last year ANMF members voted down the proposed pay deal, and in the aftermath members called for Ms Fitzpatrick to resign.\n\nThe failed pay proposal included wage increases of between 18 and 23 per cent over four years, but there was also a promise of additional pay rises contingent on the outcome of a Fair Work Commission wage case.\n\nAbout a month later, union members ended industrial action when a 28.4 per cent pay rise over four years was approved.\n\nMs Fitzpatrick stepped down as secretary on July 4 and Ms Harradence was appointed to the role, which is allowed under union rules.\n\nMadeleine Harradence, pictured at a rally in Bendigo, is running in the election. (ABC News: Tyrone Dalton)\n\nIncumbent defends record\n\nMs Harradence was first elected to the union's state branch council in 2013, and has worked in the Loddon-Mallee and Mildura regions.\n\nIf elected she wants to address violence against nurses, increase wages plus improve nurse-staff-to-patient ratios.\n\n\"It's a transitional period and it probably makes some people go 'Well, time for change' ... I respect the democratic process,\" she said.\n\n\"We absolutely acknowledged [the pay deal] was voted down, and we all went back to the negotiating table, and we got clarity.\"\n\nNurse-to-patient ratios are a key issue for the union. (ABC News: Keane Bourke)\n\nFight for better conditions\n\nContender Mr McGuinness is an emergency department nurse.\n\nHe said the union had lost its way and needs to lobby harder to get mandated nurse-to-patient ratios in mental health and private hospitals.\n\nHe questioned the union spending million of dollars on holiday accommodation for members.\n\nAccording to the ANMF's 2023-24 annual report its property portfolio was worth $103.8 million which includes holiday units in Bright and Ocean Grove, its Melbourne head office and another property in North Melbourne.\n\nHowever this figure is what the union paid for the properties, not what they are worth now, and its total assets were $119 million.\n\nQuinn McGuinness is running for Victorian secretary as part of a group calling themselves the Member First Team. (Supplied)\n\n\"I'm all for members having an opportunity to have a holiday, but I'm less convinced the union should be subsidising it,\" he said.\n\n\"We've lost focus on some of the key reasons why our union exists … to get better pay and conditions for our members.\"\n\nMr McGuinness wants the union member helpline reinstated, something that was shut down over the COVID period.\n\n\"We're probably the only union in the country where you can't actually call the union and get phone advice,\" he said.\n\nThe third candidate, Mr Parel, is an emergency nurse at Melbourne's Northern Hospital.\n\nSince 2021 he has been trying to register a new nurses' union called United Nurses of Australia with the Fair Work Commission, which has been opposed by the ANMF.\n\n\"There's nothing wrong with having another union because that makes things more transparent and more competition for members,\" he said.\n\nMr Parel said the union had failed to help enforce mandatory nurse-to-patient ratios at a Melbourne hospital, and he paid more than $5,000 to hire a lawyer to apply the law.\n\nHe also wanted to slash the branch secretary salary back to $80,000.\n\n\"I want to bring the [secretary] salary down to an average working nurse's salary,\" Mr Parel said.\n\nThe union postal ballot for all positions will run from September 8 until October 6.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-09-08/jake-stoeckel-punter-for-kent-state-us-college-football/105728256",
        "title": "Player 'with natural kick' switches from Aussie Rules to American football",
        "publish_date": "Sun, 07 Sep 2025 23:39:18 +0000",
        "category": "sports",
        "authors": [],
        "text": "Police escorts to US college stadiums and booked-out hotels are the new normal for Jake Stoeckel.\n\nThe 22-year-old has moved from Renmark in South Australia's Riverland to Kent, Ohio for at least three years to play American football as a punter for the Kent State Golden Flashes.\n\nJake Stoeckel grew up in Renmark, in the South Australian Riverland region. (Supplied: Rachael Stoeckel)\n\nAugust was a whirlwind of change for Stoeckel, who spent 25 hours travelling before arriving in Kent in the early hours of August 1.\n\n\"By 6:30am, I was at the practice facility ready to go, and was there until 9pm … pretty much did that for the first week straight before we had half a day off,\" he said.\n\n\" It's been quite an experience so far — I'm enjoying every minute of it. \"\n\nTaking the punt on American football\n\nStoeckel was well known in the Riverland sporting scene, notably in Australian Rules football for the Renmark Rovers, and tennis.\n\nJake Stoeckel was Renmark Rovers' U15 best and fairest and leading goal kicker with 31 goals in 2017. (Supplied: Rachael Stoeckel)\n\nHis interest in American football was piqued during work experience with the Essendon Football Club about two years ago.\n\n\"I was talking to [former Australian Rules footballer] Dustin Fletcher — both his boys are over here doing it and one of them is in Ohio as well,\" Stoeckel said.\n\n\"I spoke to him about it and then kind of came out and gave it a shot myself.\"\n\nStoeckel trained with Prokick Australia in Melbourne and said he had been \"working towards coming to college from that moment\".\n\nJake Stoeckel played his first game as a college football punter on August 30. (Supplied: Milan McMichael, Kent State Athletics)\n\nAccording to the Melbourne Sports Law Association, Australians make up about 46 per cent of punters in college football teams.\n\nThere are five Australian-raised punters in the NFL currently — Mitch Wishnowsky, Michael Dickson, Tory Taylor, Cameron Johnston and Matthew Hayball.\n\nProkick owner and head coach Nathan Chapman said AFL skills were transferable and it was becoming more common for Australians to travel to the US for college football.\n\n\"We get so many more enquiries now because the [sporting] coverage is very good,\" he said.\n\n\"I think it's opened their eyes to know that it's a legitimate pathway, you can get educated from it and get a college degree paid for, and you can experience playing big-time football.\"\n\nMr Chapman said Stoeckel was a consistent player who had worked hard on his craft.\n\nNathan Chapman spent a pre- and off-season with the Green Bay Packers in 2004 before returning to Australia. (Supplied: Nathan Chapman)\n\n\"He has a really natural kick of the football [and] has some great skills,\" he said.\n\n\"He turned up to training, he did all his work … it was just a matter of time for him to get his opportunity.\n\n\"To watch to his first kick was pretty special.\"\n\nGrowing into a sports star\n\nStoeckel's first game for the Golden Flashes on August 30 resulted in a 21-17 win against Merrimack College.\n\nIt was the team's first win since 2023 after a 21-game losing streak.\n\nJake Stoeckel says the following college football has in the United States is insane. (Supplied: Milan McMichael, Kent State Athletics)\n\n\"That was my first time on the field … actually being out there and having some pretty big boys running at you is quite intimidating,\" Stoeckel said.\n\n\" A lot of them are like 6'5\" [1.95 metres], 110kg and move faster than I ever could. \"\n\nStream now on ABC iview Photo shows 5 women looking concerned in front of a beach with Family Next Door and iview logo. The enigmatic Isabelle arrives in the quiet seaside cul-de-sac of Pleasant Court — and suspicions quickly rise. Stream all episodes now on ABC iview.\n\nThe fanfare for college football was palpable during Stoeckel's trip to Dix Stadium before the game.\n\n\"We had a police escort to the stadium,\" he said.\n\n\"Just the scale of where you end up and how big it is across the country is insane.\"\n\nHis most recent game included a trip to Texas, where he said a hotel had been \"completely booked out\" for the team.\n\nJake and Rachael Stoeckel at the airport before Jake left for Kent, Ohio. (Supplied: Rachael Stoeckel)\n\nMum Rachael Stoeckel said she raised her two sons, Jake and Nate, to do something they were passionate about.\n\n\"Jake's always had above-average gross motor, even as a little person, and sport just was a really big focus for him,\" she said.\n\n\"He'd excel in whatever sport he was in, but American football was not something I thought he would end up doing.\n\n\" To see him out there, I'm the proudest mum in the Riverland at the minute. \"\n\nJake Stoeckel grew up playing tennis and Australian football in the Riverland. (Supplied: Grant Schwartzkopff)\n\nA piece of home\n\nThe family will fly to Ohio in the October school holidays to visit Stoeckel and watch him play.\n\nUntil then, Stoeckel has a little piece of home with him after the team added stickers of the Australian flag and the Renmark postcode to his helmet.\n\nAn Australian flag sticker has been added to Jake Stoeckel's Golden Flashes football helmet. (Supplied: Rachael Stoeckel)\n\n\"That was awesome, I didn't actually know they were doing that,\" he said.\n\n\"I've told Cliff our equipment guy I'm going to make sure he gets some Australian treats like some Tim Tams … so he's looking forward to it.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-09-08/fogo-bin-system-failing-in-south-west-wa-amid-wider-perth-push/105737394",
        "title": "FOGO bin system on verge of collapse among early adopters",
        "publish_date": "Sun, 07 Sep 2025 23:00:29 +0000",
        "category": "finance",
        "authors": [],
        "text": "As more Perth councils bring in a third bin for food waste, some of WA's earliest adopters of the so-called FOGO system are just months away from potentially scrapping the scheme.\n\nA third bin for food and garden organic waste (FOGO) was rolled out in Bunbury, south of Perth, more than 10 years ago and most other South West councils followed suit.\n\nIt was lauded as a \"radical\" but effective solution to the state's waste woes — and the WA government vowed to introduce FOGO to all Perth and Peel councils by the end of 2025.\n\nMany Perth councils have now also rolled out FOGO bins, including Victoria Park, which introduced them just weeks ago.\n\nMeanwhile, in the birthplace of FOGO, the waste has been going to landfill for months after the Bunbury Harvey Regional Council stopped processing it due to contamination.\n\nFor more than a decade, locals in the South West have been using a third, FOGO bin (right). (ABC South West WA: Jacqueline Lynch)\n\nSouth West councils have been scrambling to find another way to deal with the waste but a recent council tender process failed to find a solution.\n\nSome local governments including the Shire of Collie, the Shire of Harvey and the Shire of Capel are actively considering scrapping the FOGO system.\n\nWhen it was introduced, Bunbury was praised for its state-leading solution to waste. (ABC South West: Kate Stephens)\n\n'It's not working'\n\nSeven local South West councils are calling on the WA government to urgently intervene.\n\nShire of Dardanup President Tyrrell Gardiner said the ideal solution would be a local processing centre, a plan that could cost upwards of $10 million.\n\nTyrrell Gardiner says if there is no solution by Christmas, the council will look at scrapping the FOGO bin. (ABC South West: Jacqueline Lynch)\n\nHe said if the council could not find a solution by Christmas, the bins could be removed.\n\n\"We would be getting to 12 months of the FOGO not being handled as we had intended,\" he said.\n\n\"The time frame on hoping to get a FOGO solution is rapidly closing and if we don't get something soon, the third bin will be gone in its current format.\n\n\" We've tried it in a format, it's not working and we've got to find another solution or it will go. \"\n\nHe said given the tip just outside of Dardanup had long been taking waste from Perth, he felt the government should help.\n\nDardanup tip takes waste from Perth and other areas in WA. (ABC South West WA: Jacqueline Lynch)\n\nA state 'failure'\n\nThe issue has largely united South West local governments.\n\nShire of Capel's deputy president Sebastian Schiano said it was a disappointing situation.\n\n“At a time when local governments are adopting local FOGO processing and FOGO collection it seems the South West is held with its hands and nowhere to go,\" he told the council.\n\n\" That is a state government failure, a failure to deliver viable waste solutions in the South West. \"\n\nThere are calls for the WA government to invest in more processing facilities, including in the South West. (ABC South West WA: Jacqueline Lynch)\n\nThe WA government said it was committed to the three bin system.\n\n\"FOGO remains an important part of our communities' move towards a more circular waste economy [and] reducing the amount of waste going to landfill,\" Environment Minister Matthew Swinbourn said.\n\n\" We recognise that some councils have faced challenges and we have been working with them to find solutions. \"\n\nHe said the state had offered some money to South West councils for transporting waste.\n\nMake it work or walk away\n\nMeanwhile, more and more Perth councils have taken up state government grants and brought in the system.\n\nThe City of Rockingham, which introduced the bins at the end of June, said the rollout was \"progressing well\" and the rubbish was successfully being processed by contractor Veolia.\n\nIn some Perth councils, like the City of Rockingham, FOGO has been \"progressing well.\" (Suppied: City of Rockingham)\n\nOthers, including WA's largest council by population, have doubts.\n\nCity of Stirling Mayor Mark Irwin said council wanted to see the issues dealt with before spending millions rolling out the bins to 250,000 residents.\n\n\"We're not confident that those processing facilities are able to cater for the volume from the City of Stirling,\" he said.\n\nMark Irwin says the council is holding off on bringing in FOGO until it is confident the system works. (ABC News)\n\n\"To put it in perspective, the city's population is close to the whole of the Northern Territory so it will have significant implications for our waste streams across the state\"\n\n\n\n\n\nSteve Thomas says the state's trial of FOGO has \"failed\". (ABC South West WA: Jacqueline Lynch) South West Liberal member Steve Thomas said if the state government wanted to see the FOGO system work in Perth and the South West, it needed to \"seriously invest\".\n\n\"We have been a trial in the South West in terms of FOGO and you would have to say that that trial has failed,\" he said.\n\n\"If the state government wants to replicate that failure in the metropolitan area with great big volumes, good luck to them.\n\n\"What they need to do is either progress FOGO across the board and invest in it fully and make it work or walk away from it.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-09-08/gold-coast-suns-fans-rewarded-with-first-ever-semifinal-match/105745282",
        "title": "Queensland fans gear up for 'biggest ever' AFL game",
        "publish_date": "Sun, 07 Sep 2025 22:40:33 +0000",
        "category": "sports",
        "authors": [],
        "text": "Elated Gold Coast Suns fans say the club is finally being rewarded after \"15 years of struggle\", as the team prepares for its first-ever semifinal match following a thrilling win against Fremantle.\n\nThe one-point win elimination final win over the Dockers at Perth Stadium on Saturday night kept the Glitter Strip's fans on the edge of their seats until the siren went off.\n\nDennis and Ingrid Dawes have been avid Gold Coast Suns fans since the club entered the league in 2009.\n\n\"It was magic, absolutely magic,\" Mrs Dawes said.\n\nThe fact that the winning point was kicked by the retiring David Swallow with just nine seconds left on the clock just added to the hype.\n\n\"Could not have scripted it any better — it was the footy gods being nice,\" Ms Dawes said.\n\nIngrid and Dennis Dawes are long-term Suns fans. (ABC Gold Coast: Dominic Cansdale)\n\nAnd the fact that it will be played against Brisbane Lions in the state's first finals QClash makes it a massive moment for the code in Queensland.\n\nDennis Dawes said \"everybody is chuffed\" for this weekend's match against the Brisbane Lions, which will be \"great for the code\".\n\n\"Brisbane's banged up a bit so there's every chance,\" he said.\n\n\"Imagine them playing Collingwood in a couple weeks time — that would be just so good.\"\n\nHarry Kerr (far right) and his team mates from Carrara Saints Football club celebrate \"silly Sunday\". (ABC Gold Coast: Dominic Cansdale)\n\nHarry Kerr and his team mates from the Carrara Saints footy club have been celebrating the Suns' win most of the weekend, along with their own reserve division grand final win.\n\n\"We were actually at the pub with all the boys so it was pretty special,\" he said.\n\n\" Everyone was cheering it on — stuff you can't even write about. \"\n\nHe said the Suns' 2025 season has changed \"the vibe\" around the club.\n\n\"Having juniors and young people seeing that happen, hopefully driving them to come and try the sport, it's massive for footy in Queensland,\" Mr Kerr said.\n\n\"Winning this years has helped — a lot of people are talking about them a lot more now and starting to take notice.\"\n\nStream now on ABC iview Photo shows 5 women looking concerned in front of a beach with Family Next Door and iview logo. The enigmatic Isabelle arrives in the quiet seaside cul-de-sac of Pleasant Court — and suspicions quickly rise. Stream all episodes now on ABC iview.\n\nQueensland Premier David Crisafulli was also thrilled with the weekend's result and said he was looking forward to the QClash this weekend.\n\nHis electorate is in the Gold Coast and he is backing the Suns.\n\n\"It'll be good either way but you've got to love an underdog story, haven't you? Mr Crissafulli said.\n\n\"Go the Suns.\"\n\nSuns arrive home\n\nThe Suns' players flew back into the Gold Coast on Sunday afternoon where they were greeted by jubilant fans.\n\nSuns super fan Terry Vanes and his daughter Zara Vanes cheered on the players as they touched down at Coolangatta airport.\n\nMr Zanes joked that the win was \"much better\" than the birth of his daughter.\n\n\"[It's] momentous for our club — after 15 years of struggle, we're here on the big stage and we can match it,\" Mr Vanes said.\n\nTerry and Zara Vanes are passionate Gold Coast Suns fans. (ABC Gold Coast: Dominic Cansdale)\n\nHe was riding the high of the win and had no concerns about facing the Lions this weekend.\n\n\"No contest, they're out, they're gone,\" he said.\n\n\"We are heading up the M1 for victory, we're bringing it back down the Gold Coast — look out Collingwood the following week.\"\n\nBack on home soil, captain Noah Anderson said it did not feel real when the buzzer sounded on Saturday and he realised his team had taken home the win.\n\nNoah Anderson (centre) addresses the Gold Coast Suns during their round 20 match. (Getty Images: AFL Photos/Russell Freeman)\n\n\"In our first final playing away in a hostile environment to be able to come out on top the way we did was pretty special,\" Anderson said.\n\nThe star midfielder said it was even more special that he was playing in front of a horde of Gold Coast supporters in the final moments of the game.\n\n\"They were so loud, it shows the growth of our club that we get such good representation away from home,\" he said.\n\nHistory-making match\n\nAFL Queensland chief executive Trisha Squires said next week's semifinal against Brisbane could be the biggest game in Queensland AFL history.\n\n\"This will be the biggest ever QClash,\" Ms Squires said.\n\n\"We have the two Queensland clubs in the AFL finals for the first time in the 129-year history of the AFL/VFL.\n\n\" It's a big moment for Queensland footy. \"\n\nMs Squires said participation numbers would surge in Queensland because of the teams' successes.\n\n\"We've broken participation records the past three years in a row — at the moment, we're up 12 per cent on this time last year,\" Ms Squires said.\n\n\"We know the next couple of weeks is going to add to that because more people will start to get curious about our game and get involved in our game.\"\n\nShe said historically, Queensland had not been considered an AFL state, but it \"really\" had become one.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-09-08/pacific-islands-forum-china-australia-albanese-visit/105745850",
        "title": "Pacific leaders to meet amid flurry of 'comical' gift giving",
        "publish_date": "Sun, 07 Sep 2025 22:21:41 +0000",
        "category": "finance",
        "authors": [],
        "text": "This week, Pacific leaders — as well as hundreds of officials, diplomats and journalists — will gather in the capital of Solomon Islands, Honiara, for the region's most important political meeting.\n\nIt comes amid a flurry of gift-giving between China and Australia that has highlighted — on what one expert labelled an almost \"comical\" level — the tit-for-tat efforts by both countries to exert influence on the ground in Honiara ahead of the meeting.\n\nMeanwhile, before the meeting, Australian Prime Minister Anthony Albanese will on Tuesday wing his way to another Pacific Island nation — Vanuatu — where he is widely expected to sign a landmark new pact between the two countries.\n\nAnd next week, Mr Albanese and a host of Pacific leaders will descend on Port Moresby to celebrate the 50th anniversary of Papua New Guinea's independence — a milestone that marks a tectonic moment in the Pacific's political history.\n\nOne of the dozens of vehicles handed over by China — and Australia — ahead of this week's Pacific Islands Forum meeting. (Supplied: Solomon Islands government)\n\nThe political pageantry and flurry of meetings will reveal quite a lot about where the region is heading, and the way it is shaping (and being shaped by) some of the massive strategic and economic disruptions reverberating around the globe.\n\nWhy Vanuatu first?\n\nIt is not surprising that Mr Albanese's first Pacific stop will be Vanuatu.\n\nLast month, no fewer than three federal government ministers hiked up to the top of a spectacular volcano on the island of Tanna to give their \"initial\" agreement to a pact which they've promised will \"transform\" the relationship between Vanuatu and Australia.\n\nHot diplomacy: Senior ministers from Australia and Vanuatu initialled the Nakamal Agreement at the top of Mount Yasur, an active volcano. (ABC News: Lillyrose WelWel)\n\nThe \"Nakamal Agreement\" has emerged from the ashes of a contentious 2022 security pact between the two countries, which was signed by former prime minister Ishmael Kalsakau but effectively torched by the incumbent, Jotham Napat.\n\nAustralia is expected to funnel some $500 million to Vanuatu over a decade under the agreement, with money flowing into the Pacific nation's key development, climate and security priorities.\n\nChina has emerged as a major player in Vanuatu, and the federal government believes this agreement will also help it entrench Australia's position as the country's major security partner and head off Beijing's attempts to bed down its police training teams in the country.\n\nAustralia hasn't publicly said if Mr Albanese will officially sign the agreement while in the country, even though Mr Napat has repeatedly declared that the prime minister is coming to Vanuatu specifically to put pen to paper.\n\nHalf-a-billion-dollar pact between Australian and Vanuatu close to being signed Photo shows A woman and man shake hands standing in front of flags smiling at the camera The Nakamal Agreement will cover infrastructure, climate change resilience and economic development but questions remain about what security and travel arrangements will be agreed to.\n\nPerhaps that is just because Vanuatu's politics are notoriously fluid and unpredictable, and nobody in Australia wants to celebrate signing an agreement until after it is sealed.\n\nAnother thing that is not yet perfectly clear is exactly what Australia gets in return for substantially ramping up assistance and investment.\n\nThe Pacific nations of Nauru and Tuvalu have both signed sweeping treaties with Australia that effectively give Canberra veto power over their national security decisions, but Vanuatu has a long history of non-alignment, and Mr Napat has insisted he won't give his imprimatur to anything similar.\n\nTuvalu is an island nation in the Pacific Ocean, lying about halfway between Hawaii and Australia. (Reuters: Kirsty Needham)\n\nThe Australian government isn't publicly contradicting the prime minister, but in private, it's suggesting that Vanuatu has, in fact, made concessions — hinting that Chinese policing teams in the country will be gradually wound down as a result of the pact.\n\nBut the full picture might only become clear well after the agreement is signed.\n\nAbsent friends, 'comical' police gifts\n\nAfter the festivities in Vanuatu, Mr Albanese and Mr Napat will hop on the prime minister's RAAF plane and head to Solomon Islands for the Pacific Islands Forum (PIF) leaders meeting in Honiara.\n\nThey'll arrive at a meeting that has already generated plenty of controversy well before officially kicking off.\n\nNew Zealand, France, Fiji, Tuvalu, the US and Australia have all sharply criticised Solomon Islands' decision to block about two dozen \"dialogue partner\" nations from joining the meeting — with NZ's foreign minister even suggesting Honiara wouldn't have secured hosting rights if they'd known this was what it was planning.\n\nWhy is there a stoush over the Pacific's top meeting next month? Photo shows A group poses for a photo on chairs in front of a row of national flags. The Pacific's leaders are grappling with Solomon Islands’ contentious decision to block all outsiders from the region's most important annual meeting next month. So what does the episode say about how strategic competition is reshaping the region?\n\nSolomon Islands insists it's only \"deferring\" the meeting with dialogue partners for procedural reasons, but few are buying that — with most Pacific officials convinced Solomon Islands Prime Minister Jeremiah Manele was forced into the contortion because he wanted to avoid a damaging stoush over Taiwan's participation in the meeting.\n\nWhile PIF nations have (in some cases grudgingly) accepted the compromise, expect some PIF nations to push Pacific leaders to make it crystal clear that the saga should not be repeated in the future.\n\nPartner nations excluded from the meeting will be watching closely to see if non-Pacific nations with diplomatic representatives in Honiara (including the UK, Japan, the US and — of course — China) manage to secure their own meetings with Pacific leaders on the meeting sidelines.\n\nKiribati's president Taneti Maamau arriving in Honiara over the weekend. (Supplied: PIF Secretariat)\n\nExpect plenty of fireworks and controversy if any of these nations — particularly the United States or China — manage to elbow their way into the meeting.\n\nThere will also be a subterranean arm wrestle over exactly what role Chinese police teams in Solomon Islands play in providing security.\n\nThis is ground zero in Australia's broader struggle to stop Beijing from establishing itself as a legitimate security and policing player in the Pacific.\n\nThere's been a contest between the two nations on the ground in the lead-up to PIF, what one expert labelled as \"comical\", with both nations tripping over each other to hand over new vehicles and equipment to the Royal Solomon Islands Police Force.\n\nThe Chinese embassy in Honiara, the capital of the Solomon Islands. (Reuters: Charley Piringi)\n\nThis was beautifully illustrated in one double-page spread inside a Solomon Islands newspaper a couple of weeks ago, which contained almost identical headings besides the pictures of Chinese and Australian largesse.\n\nAll this might help explain why some Pacific leaders and civil society representatives — even those sceptical of China — are quietly relieved by Mr Manele's diktat, and hope the absence of some sharp-elbowed friends might make it easier for the meeting to focus on some of the issues at the heart of its future.\n\nClimate crisis and the 'ocean of peace'\n\nAt the top of that list, as ever, lies climate change — and the Pacific's race to access the resources and funding it needs to try to adapt to the chaos it is already starting to bring.\n\nPacific leaders are expected to officially ratify and operationalise the Pacific Resilience Facility (PRF), a new fund regional leaders have set up to try to give Pacific island nations easier and quicker access to climate finance.\n\nWhile several nations have already stumped up cash — including Australia, which is the PRF's largest donor so far with $100 million pledged — it's still well short of the $500 million it wants to get in the kitty.\n\nBut the very fact they've managed to get the PRF up and running will give heart to those gathered in Honiara.\n\nAustralia and Türkiye fighting over COP31 Photo shows A large auditorium with rows of chairs facing three PowerPoint screens Türkiye rejects Australia's bid to host the COP31 climate summit in Adelaide.\n\nPacific leaders will have another powerful weapon at their disposal: the International Court of Justice Advisory Opinion on climate change will help them press major polluters to move with much more urgency to cut emissions and help them respond to breakneck change.\n\nThe meeting is also shaping up to deliver another endorsement of Australia's bid to co-host the COP31 climate meeting with the Pacific next year, although time is running short thanks to a protracted struggle with Türkiye over who should secure the massive event.\n\nThe Pacific will hope that a circuit breaker might be looming — Prime Minister Anthony Albanese is due to sit down with Turkish President Recep Tayyip Erdogan on the sidelines of the United Nations General Assembly.\n\nUntil Australia actually secures the bid, it's hard for leaders to have a detailed conversation about what the massive event — which is expected to draw some 50,000 people to Australia — might look like and exactly what role Pacific nations can play.\n\nIn the meantime, some Pacific nations are moving on with their own conservation agenda, including a plan to announce a vast New Melanesian Ocean Reserve — which will become one of the world's largest protected zones.\n\nAustralia and Vanuatu agree to pact worth $500m atop a volcano Photo shows A man holds a large wooden implement in front of another man who is smiling Senior ministers from both countries journeyed to the top of Mount Yasur to initial the Nakamal Agreement, but many details linked to the deal remain under wraps.\n\nThat's not the only looming oceanic declaration — the \"Ocean of Peace\" first championed by Fiji Prime Minister Sitiveni Rabuka will also be debated and, very likely, rubber-stamped by leaders during the meeting.\n\nAs ever, Australia has been trying to frame that declaration in terms that affirm Pacific solidarity (and exclude China) by stressing \"Pacific-led\" security solutions.\n\nBut it's likely the final declaration will be broad enough for all players to draw what they like from the text: an earlier draft of the Ocean of Peace declaration seen by the ABC calls on outside players to engage with the Pacific in a way that \"supports national and Pacific-led approaches\" — a formulation wide enough to drive a bus through.\n\nIronically, the exclusion of so many players from Honiara might fuel even closer scrutiny of what happens in Solomon Islands this week, with every dollar committed, every clause put on paper, and every word in every statement, watched very intently — from a distance.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-09-08/australian-woman-claims-marlin-spearfishing-record-after-cancer/105729374",
        "title": "The Australian woman who spearfished a 162.5kg striped marlin",
        "publish_date": "Sun, 07 Sep 2025 22:03:14 +0000",
        "category": "sports",
        "authors": [],
        "text": "In the world of spearfishing, marlin sit at the extreme end of possible targets.\n\nThey are some of the biggest, fastest fish in the world.\n\nNikki Watt, 36, from Tweed Heads is one of the few people in Australia game to do it.\n\n\"It can be really intimidating,\" she says.\n\nNikki Watt with the world record 162.5-kilogram marlin in Eden, NSW. (Supplied: Nikki Watt)\n\n\"You could easily get dragged down hundreds of metres, and you're never going to make it back up.\n\n\"But it's so amazing. It overshadows all the fear, to see a marlin lit up [with colour], hunting. It's an incredible experience.\"\n\nIn 2025 she fulfilled a dream, spearing a world-record 162.5-kilogram striped marlin.\n\nBut just three months prior to achieving this feat, she thought she might never dive again.\n\nHooked on marlin\n\nNikki grew up spearfishing in far north Queensland. As a young adult, she'd heard of people spearing billfish like marlin.\n\n\"At the time it just sounded outrageous and unbelievable,\" she says.\n\n\"When I started to learn it was achievable, I thought, well let's have a crack.\n\nNikki Watt, pictured with a nannygai off Port Lincoln, SA, doesn't just target large fish such as marlin. (Supplied: Nikki Watt)\n\n\"I realised it wasn't the biggest or strongest person against a fish. It was more about strategy.\"\n\nIn 2016 she got her first taste of it in Exmouth, WA, and despite losing a large marlin on the trip, she was hooked.\n\nThe following year, Nikki speared a women's record black marlin, and by 2021 she had added a sailfish and blue marlin to the list, thus achieving one of the highest honours in spearfishing, the so-called \"grand slam\".\n\nA striped marlin, if she speared one, would see her become the first woman in the world to accomplish the coveted Super Slam.\n\nBut despite multiple attempts, the striped marlin would elude her.\n\nNikki Watt's partner Bryson Sheehy is also an Australian spearfishing champion. (Supplied: Nikki Watt)\n\nA surprise diagnosis\n\nIn October 2024, two weeks before she was due to marry fellow \"spearo\" Bryson Sheehy, Nikki found a lump on her left breast.\n\nShe waited until after the wedding to get it tested, and in December got the news: she had breast cancer.\n\nNikki underwent a mastectomy the very next day.\n\n\"I didn't process it,\" she says.\n\n\"For a few weeks I woke up in disbelief and was still questioning whether it was real.\"\n\nShe started chemotherapy in the new year.\n\nNikki Watt recovering from her surgery in December 2024. (Supplied: Nikki Watt)\n\nDespite the surgery being a success, Nikki was uncertain about her long-term prognosis, and what it meant for her life ahead.\n\n\"There were thoughts of, 'Am I going to survive beyond a couple of years let alone do anything?'\" she says.\n\n\" I never expected to dive again. \"\n\nHowever, Nikki's chemo soon stopped, as the cancer's progression was deemed low risk.\n\nShe had already started seeing a rehabilitation therapist, who helped her work out how she could load a speargun again.\n\n\"I had a moment where I broke down and said, 'I don't think I'll be able to load this gun,'\" she says.\n\n\"And he said, 'Nikki, you don't need a pec major to load a speargun.'\"\n\nNikki Watt's chemotherapy was cut short after successful surgery. (Supplied: Nikki Watt)\n\nNikki Watt with her daughter Blair and a line-caught Kimberley barramundi. (Supplied: Nikki Watt)\n\nA record fish\n\nMarch and April are the prime times for marlin fishing in NSW, where fish congregate off places like Jervis Bay, Bermagui and Eden.\n\nNikki, Bryson and their daughter Blair headed to Eden for a family holiday in April.\n\nIt was Nikki's first dive since the surgery when she finally came face to face with a massive striped marlin.\n\n\"It turned broadside to me to see what I was, because they don't see people very often,\" she says.\n\nShe took her shot. It wasn't until the fish was at the surface that she realised its sheer size.\n\nLoading...\n\n\"When we finally got it on the gantry back at shore, it came in at 162.5kg. I started crying. We all just couldn't believe it,\" Nikki says.\n\nIt would prove to be the largest striped marlin speared in Australia, and the largest speared by a woman in the world.\n\nIt also meant Nikki was the first recorded woman in the world to achieve the famed \"super slam\".\n\nThey would share the fish with people back at the boat ramp, and took the rest home to share with friends over many meals.\n\nShe is happy her daughter Blair was there.\n\n\"She knows how significant it is for me,\" Nikki says.\n\n\"I'm sure we'll be talking about it over and over to our grandkids and they'll be sick of hearing about it,\" she laughs.\n\nNikki Watt's took top honours at the 2016 Queensland spearfishing titles. (Supplied: Nikki Watt)\n\nDiving back in\n\nStill clear of cancer, Nikki is back spearfishing when she can.\n\nShe plans to join Bryson in Brazil at the end of the year, as he represents Australia in the Spearfishing World Championships.\n\nBryson is in awe of what his wife has accomplished.\n\n\"It pushes the boundaries of what's possible,\" he says.\n\n\"A fish like that breaks the open Australian record by 22kg. So just goes to show what is possible on spear.\n\nBryson said the significance of the achievement shouldn't be underestimated.\n\n\"Particularly when recovering from cancer,\" he says.\n\n\" It was an amazing comeback. \"\n\nDiving is a passion for Nikki Watt and Bryson Sheehy's family. (Supplied: Nikki Watt)\n\nThe experience has given Nikki a new perspective on the importance of pursuing goals without fear.\n\nAnd while she is in no rush to spear a marlin again, she is keen to find the next special fish.\n\n\"There are so many things that don't seem possible, or people have been trying to do for a long time,\" she says.\n\n\"Anything's possible from here on.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-09-08/donald-trump-delays-us-open-final-frustrates-fans/105746630",
        "title": "Trump receives mixed reaction at US Open after security delays frustrate fans",
        "publish_date": "Sun, 07 Sep 2025 21:40:23 +0000",
        "category": "sports",
        "authors": [],
        "text": "The US Open men's championship match has been delayed and thousands of seats remained empty when it finally got underway, as security checks related to President Donald Trump's attendance caused confusion and slowed entry to the iconic New York City event.\n\nFans waited in long lines, some for well over an hour, outside Arthur Ashe Stadium in Queens, the largest tennis venue in the world with a nearly 24,000-person capacity.\n\nUS Secret Service and other federal security officers checked bags and ushered fans through metal detectors.\n\nSome attendees who were still outside booed as the match between rivals Carlos Alcaraz and Jannik Sinner began a little before 3pm local time.\n\nInside the stadium, Mr Trump was greeted by a mix of cheers and boos when he was shown on the screens.\n\nKevin, a Brooklyn man employed by a private equity firm, said he had waited an hour and 15 minutes and still had not reached the entrance.\n\nThe man, who declined to give his last name, blamed Mr Trump for the delay.\n\nThe security arrangements for the president delayed the start of the match. (AP Photo: Seth Wenig)\n\n\"One hundred per cent him. Very selfish. I would expect someone like that to have a little bit more grace to know that an event like this would be held up for him being here, especially in a city that hates him,\" he said.\n\nA Secret Service spokesperson said in a statement: \"We recognise that enhanced security for the President's visit to the US Open may have contributed to delays for attendees. We sincerely thank every fan for their patience and understanding.\"\n\nStrict security measures are standard for any public event that the president attends, regardless of party affiliation or popularity.\n\nThe match start time, originally set for 2pm local, was pushed back by 30 minutes due to security checks, US Open organisers said shortly before it was set to begin.\n\nThe United States Tennis Association, which runs the event, did not immediately respond to a request for comment on the security delays.\n\nThe stadium appeared to be nearly full about an hour into the match, as Sinner and Alcaraz battled in the second set.\n\nMixed reaction for Trump\n\nThere was a mixed reaction to the US president. (Getty Images: Kevin Dietsch)\n\nMr Trump, a Republican, is a sports fan who regularly voices his opinion about sports in the same way he has sought to influence or intimidate institutions throughout US society.\n\nHe has pushed to restrict transgender women from participating in women's sports and called for the Washington Commanders football team to revert to its former name, the Redskins, a moniker that critics view as a racist portrayal of Native Americans.\n\nMr Trump's approval rating stood at 40 per cent in late July and mid-August, Reuters/Ipsos polls found, the lowest of his presidency.\n\nOn all policies, Mr Trump's support came overwhelmingly from Republicans, raising questions about how he would be received in New York, a Democratic stronghold.\n\nMaribeth Lodes from New York City said her ticket cost $US350 ($530). She was in the line at 1:30pm and still had not entered an hour and a half later.\n\n\"It's ridiculous. I think it's totally unreasonable that they do this. It makes me even more infuriated, because, like, you know, we spent all of this money,\" she said.\n\nSome attendees, however, were fine with Mr Trump's presence.\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\n\"He can go wherever he wants and attend a match if he wants to,\" said Karen Stark, a retired tennis fan, who travelled to the final from Michigan.\n\nResale tickets to the event ranged from hundreds of dollars to more than $20,000, according to the website SeatGeek.\n\nThe president, a regular golfer on the weekends in the Washington area or at his properties in New Jersey and Florida, has attended multiple sports events as president since returning to the White House in January.\n\nHe went to the Super Bowl in February, receiving cheers and boos from the crowd, and has attended Ultimate Fighting Championship bouts.\n\nA television broadcast by America's ABC network showed Mr Trump stepping out of a box seat after arriving to wave to the still-sparse crowd, but it did not include crowd audio.\n\nCheers and boos were audible during the ESPN feed of a later Trump appearance before the start of the event.\n\nThe USTA had asked broadcasters to remove any reaction to Mr Trump, according to reports over the weekend.\n\nA USTA spokesperson told Reuters the association regularly asked broadcasters \"to refrain from showcasing off-court disruptions\".\n\nReuters",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-09-08/national-drought-forum-convenes-in-sa-farmers-want-policy-review/105739102",
        "title": "Calls to review drought policy to better help struggling farmers",
        "publish_date": "Sun, 07 Sep 2025 21:21:52 +0000",
        "category": "finance",
        "authors": [],
        "text": "Farmers are hoping for a total review of how drought support is being rolled out across the nation, as the country's agricultural leaders gather today for a major drought forum in South Australia.\n\nIt comes as drought-stricken farmers in southern Australia hang their hopes on a wet spring to turn their fortunes around.\n\nRain remains particularly scarce in SA's Riverland and Mallee, where farmer Tim Paschke received less than a third of his usual growing season rainfall.\n\n\"We're about three or four weeks away from de-stocking, and we've got enough hay and donated hay to finish off, but we're out of grain,\" Mr Paschke said.\n\n\"We've fed pretty much for two years straight now and we were ready for that, but it gets to a point where we just can't anymore.\"\n\nMallee farmer Tim Paschke says he will not be shaving his beard until there is a break in the drought. (ABC Rural: Kerrie Lush)\n\nMr Paschke hoped today's National Drought Forum would look at \"some real on-the-ground help\" for farmers.\n\n\"Obviously, as farmers we're really battling for cash flow,\" he said.\n\n\"When this harvest doesn't look like it's going to turn out — you know, obviously stock prices have been as good as they have, but the reality is that's only such a small proportion of cropping inputs.\n\n\" We need cash flow and that hopefully looks like something towards zero or low-interest loans. \"\n\nFarmers want voices heard\n\nPrime Minister Anthony Albanese visited drought-affected South Australian farms in June, where he announced the drought forum would be moved from Victoria to SA, at the request of the National Farmers' Federation (NFF).\n\nAnthony Albanese visited SA farms in June, where he announced the state would host the National Drought Forum. (ABC News: Lincoln Rothall)\n\nNFF president David Johinke said today's forum was about \"farmers' voices being heard\" in improving Australia's drought policies.\n\n\"There's a lot to be done in the drought space; we definitely don't have the settings right underneath the current framework,\" Mr Johinke said.\n\nHe said farmers were calling for a raft of different drought support measures, without \"any clear pathway\" to how those would be activated or delivered.\n\n\"Having a total review of how we actually activate this assistance — is it via the old system of declarations that put lines on a maps? But at least people understood what the process was,\" Mr Johinke said.\n\n\"The new system doesn't necessarily have that transparency between state and federal, or state to state, and we want some coherence between those responsibilities to make sure everybody's doing their parts in a timely manner when agriculture and rural communities need the most support.\"\n\nHopes for spring relief\n\nWhile some parts of the country received record winter rain, many southern producers remain in need of a decent spring downpour to restore the balance after months of record-low falls.\n\nConditions have improved significantly in Victoria, after a horror start to the year.\n\nThe Bureau of Meteorology has forecast a wet spring for eastern Australia, which will hopefully bring some relief to farmers. (ABC News: Sarah Hancock)\n\nWidespread rain at the end of August delivered a much-needed drink for crops and pastures, but parts of north-west Victoria remain very dry, and stock water shortages persist in areas of the south-west.\n\nAlmost half of New South Wales is still classified as \"in drought\" or \"drought affected\".\n\nIn the Riverina, where people have been battling drought for up to 18 months, the paddocks are green — but producers are counting on spring rainfall to grow pastures and ensure crop yields.\n\nFarmers cautiously optimistic\n\nAfter more than a year of some of the worst drought conditions in memory, SA farmers are experiencing some cautious optimism that forecasts for a wet spring could turn things around.\n\nEyre Peninsula farmer Andrew Polkinghorne received above-average rainfall at his Lock property over winter, allowing him to feel optimistic about spring.\n\nLock farmer Andrew Polkinghorne is feeling more optimistic after above-average rain over the past three months. (ABC Rural: Brooke Neindorf)\n\n\"I think if we can get a reasonable next six weeks, then we will be quite reasonably set up,\" Mr Polkinghorne said.\n\nHe hoped some help could come from today's drought forum.\n\n\"I travelled overseas last year, and particularly in US and Canada, they've got multi-peril insurance schemes and I reckon it's worth another look at them,\" Mr Polkinghorne said.\n\n\" There's also a case for some low-interest loans to go out. This has been done in the past and it's been quite successful. \"\n\nUngarra farmer Ben Pugsley was also feeling optimistic heading into spring after some recent rain, and hoped the drought forum would highlight how tough it was being a farmer.\n\nUngarra farmer Ben Pugsley says there's still a lot of work to do to finish the season off. (ABC Rural: Brooke Neindorf)\n\n\"Probably our greatest challenge at times is financial strain and land prices are going up, machinery is going up, inputs are going up, it's becoming tighter and tighter,\" Mr Pugsley said.\n\n\"We can have some great years and we don't have to be too far off the mark and we find ourselves fairly under a financial strain.\n\n\"So those regions that are stringing together a couple of seasons that are poor, that financial strain is getting really tight and it's so hard for them.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-09-08/preserving-history-while-allowing-growth-act-heritage-register/105744942",
        "title": "It accidentally became a skateboarding mecca. Now it's up for heritage listing",
        "publish_date": "Sun, 07 Sep 2025 21:16:03 +0000",
        "category": "sports",
        "authors": [],
        "text": "Nestled among trees in Canberra's south is a historic site people travel across the world to visit.\n\nBuilt in the 1980s of brick and concrete, the Erindale Brick Banks has become a popular stop on Australian tours for professional skateboarders.\n\n\"You can go around the world and talk to other skateboarders and show them photos of that spot, and they might not know what Canberra is or what Tuggeranong is, but they'll recognise that location,\" said Brenden 'Woody' Wood, the Canberra Skateboarding Association vice-president.\n\n\"Tony Hawk skated there in the '80s before it was a skate park.\"\n\nTony Hawk skateboarding at the Erindale Brick Banks in the 1980s. (Supplied: David Pang)\n\nThe curved brick structures were not initially built for skateboarding, but rather as part of landscaping around the Erindale college and library.\n\n\"What is left in the skate park is the remnant,\" Mr Wood said.\n\n\"Everything else has been renovated, but the part that was at the skate park was accidentally built so well for the purpose of skateboarding that it was turned into a purpose-built skate park later.\"\n\nFearing the iconic cultural space would be lost to development, the skateboarding community nominated the Brick Banks for listing on the ACT Heritage Register.\n\nThe Erindale Brick Banks now has provisional heritage protection. (Facebook: ACT government)\n\nAfter almost 10 years of waiting, the ACT Heritage Council has granted the site provisional heritage protection, with the final decision due in November.\n\nBut the skate park is just one of many sites across the capital with a history worth preserving.\n\nPublic housing turned into private heritage\n\nTo attract workers to the capital, the government built public housing across Canberra.\n\nThe Northbourne Housing Precinct, designed by renowned architect Sydney Ancher, was built in 1962 and housed public servants and then served as public housing until the land was sold off and most of the ageing flats demolished.\n\nMost of the old flats along Northbourne Avenue were demolished to make way for new developments. (ABC News: Ian Cutmore)\n\nA \"representative sample\" of five building types of the precinct were listed on the ACT Heritage Register and as a condition of buying the block, developers had to retain and preserve the heritage, which included the buildings and the curtilage — landscaping, paths and trees.\n\n\"Our challenge was that we wanted to make them last now that they're heritage listed,\" said Gabe Szivek, Art Group development director.\n\n\"So we've changed all the windows with new glass, we insulated the walls, and we fire-rated. Internally, we were able to rejig the floor plan to make it how we would use our apartments today.\"\n\nGabe Szivek from Art Group in front of one of the original flats that has been incorporated into a modern development on Northbourne Avenue. (ABC News)\n\nWorking with heritage and landscape architects and other experts, the renovation maintained the building's external character while completely modernising its interior.\n\nThe project demonstrated how heritage could coexist with increasing housing density, and what was a constraint became a focal point for the development, and there are now around 148 apartments where previously there were 21.\n\n'I just thought an error had been made'\n\nTrees are also listed on the ACT Heritage Register, and while a heritage building cannot be knocked down, heritage trees can be.\n\nBetween 1940 and 1964, the Council for Scientific and Industrial Research's (now the CSIRO) experiment station in Downer trialled farming techniques and grew experimental crops, including opium for the war effort.\n\nRows of Monterey (radiata) pines and other trees were planted as windbreaks, and these trees were added to the ACT Heritage Register in 1998.\n\nThe Council for Scientific and Industrial Research's (now the CSIRO) experiment station in Downer in 1952. (Supplied: ACT Heritage Library)\n\nWhen Robyn Sirr bought her sunny north-facing apartment in 2021, there were no heritage trees on site, or in sight. They had been cut down for the development.\n\n\"I had assumed that when old trees were removed, a fresh decision is made about what's appropriate now in this environment,\" she said.\n\n\"When we heard that Canary Island pines were going to be here … I just thought a big error had been made.\"\n\nWhen Robyn Sirr bought her apartment in 2021, there were no Canary Island pines planted along the street. (ABC News: Luke Stephenson)\n\nThe government design standard says that Canary Island pines are not suitable as street trees because they drop pine cones, generate a lot of pollen and present a \"medium to high flammability risk\".\n\nMs Sirr and other concerned residents advocated to their local MLAs, who indicated it was a heritage matter.\n\nWriting to the Heritage Council, they proposed the pines be replaced with deciduous trees to keep a tree canopy but allow winter sun and summer shade.\n\nCanary Island pines can grow 25 metres tall. (ABC News: Luke Stephenson)\n\nThis was denied because the Heritage Act stipulates replacing \"like for like\". A compromise was made by planting the trees three metres to the north.\n\n\"These trees grow up to 25 metres tall, and that's going to cast a wall of winter shade right across the north-facing building,\" Ms Sirr said.\n\n\"It is possible to get win-win compromises that can work to acknowledge heritage, but find ways to do it adaptively and relevant way.\"\n\nRows of Canary Island pines were planted to replace the original Monterey Pines in 2022. (ABC News: Luke Stephenson)\n\nThe only option remaining was to apply to cancel the heritage status of the trees. A decision is expected in November.\n\n\"I really hope that we can find sensible local solutions rather than just such a black and white, siloed approach,\" Ms Sirr said.\n\nBalancing the old and the new\n\nThe ACT Heritage Council is tasked with the job of assessing nominations against a set list of criteria to determine whether they should be registered, retained and protected.\n\n\"We work with the [Heritage] Minister and other parts of government to make sure we're working together,\" Catherine Skippington, ACT Heritage Council chair, said.\n\n\" But we still make our decisions independently. \"\n\nThe council is made up of experts from a range of fields and backgrounds.\n\n\"They are smart and reasonable people. So it is a balanced decision that gets made and also open to the ideas that come in through consultation processes,\" Ms Skippington said.\n\nIn 2022, then-heritage minister Rebecca Vassarotti dismissed the entire council and an inquiry was held into the effectiveness and operation of heritage issues in the ACT.\n\nNow with new members, the council is working through a significant backlog of heritage nominations, some dating back decades, prioritising the cases based on immediate threats and relevance to the community or businesses.\n\n\"I've just been [made] aware … that there are long-standing, very old nominations, which we're cleaning up,\" Ms Skippington said.\n\nMoving forward, she said the council wanted to be \"timely\" with its assessments of nominations.\n\n\"We don't want to cost people money. We don't want property owners to be put to undue time when they're trying to get on with their lives or their businesses,\" she said.\n\n\"So we try and balance the time and effort and risk and the value that we're looking to protect.\"\n\nCivic Centre looking north up Northbourne Avenue in1950. (Supplied: ACT Heritage Library)\n\nMs Skippington pointed to successful adaptive reuse examples like the Kingston shops, where heritage facades were protected while allowing modern development above.\n\n\"It's getting that balance of the old story but moving forward,\" she said\n\nWhile some heritage sites have been protected over the years, others have been lost.\n\n\"There are times and places where it won't be possible to protect what's there. But it doesn't mean we forget it or that we can't include aspects of it in the new development,\" Ms Skippington said.\n\n\"Probably the best path forward is where we can combine both.\"\n\nShannon Battisson says Canberra has a fantastic legacy of brutalist architecture. (ABC News: Stuart Carnegie)\n\nIt is a sentiment echoed by Shannon Battisson, a past president of the Australian Institute of Architects.\n\nShe said protecting Canberra's heritage didn't mean the city couldn't grow or change.\n\n\"But I do think that it's really important to look at the buildings that we have around us and to really carefully decide which ones we want to keep and adapt to a modern future … and which ones we can let go and and replace with something new,\" she said.\n\n\"It's about looking at the spaces in between, about looking at the value of that building both in terms of the social and legacy input, but also the environmental load that it's got.\n\n\"We shouldn't be so quick to knock things down just because a little bit of thought and a little bit of extra effort has to go into retrofitting it.\n\n\"They're well worth it and they're really wonderful parts of our city and we'll regret them in the future if we simply knock everything down.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-09-08/greyhound-advocates-lobby-tasmanian-government-ahead-of-shutdown/105724644",
        "title": "Tasmania's greyhound industry says it has 'strong argument' to drop ban",
        "publish_date": "Sun, 07 Sep 2025 21:12:19 +0000",
        "category": "sports",
        "authors": [],
        "text": "Man On Fire claimed victory in Race 2 at Queensland's Q-Straight track last Monday night.\n\nLeading from start to finish, the greyhound clocked the 300 metres in 16.42 seconds.\n\nIt was a race like any other, but carried the unusual name \"Save Greyhound Racing In Tasmania\".\n\nSimilarly named races have been run at other meetings in Queensland and New South Wales.\n\nLast Monday's greyhound race meet in Purga, west of Brisbane, was one of a number of meets where support for Tasmanian greyhound racing was promoted. (Supplied: Racing Queensland)\n\nIt is an insight into a nationwide campaign mobilised since the Tasmanian Liberal government's decision last month to legislate a ban on greyhound racing.\n\nAttendees and participants at interstate meets have also donned yellow caps branded with messages of support for Tasmanian greyhound racing.\n\nPrinted caps in support of Tasmania's greyhound industry have been spotted track-side. (Supplied)\n\nA Facebook group called \"Save Tasmanian Greyhound Racing\" has more than 3,500 members.\n\nWithin the group, racing industry supporters share their anger and discuss ways to get their message out, including by emailing current and former Tasmanian MPs.\n\nThere is even a song performed with the help of AI.\n\nRace 2 at Queensland's Q-Track last Monday was named \"Save Greyhound Racing in Tasmania\". (Supplied: Racing Queensland)\n\nIndustry to fight 'unjust process'\n\nThe move has fuelled fears other states may follow suit.\n\nRecently appointed head of Greyhounds Tasmania, Luke Gatehouse, has aired his grievance about the industry's demise.\n\n\"We came together last week at our national greyhound conference … All the states reaffirmed their commitment to supporting Tasmania through what is really an unjust process that's taken place,\" he said.\n\nMr Gatehouse is the former head of the Brisbane Greyhound Racing Club, a position he held for 18 years.\n\nHe has been engaged by the Tasmanian industry as it attempts to overturn plans for the ban.\n\n\"We'll be doing our best to get the information out to people,\" he said.\n\n\"That's what a democracy is about, making fair-minded decisions, not political convenience.\"\n\nGreyhounds a 'scapegoat' in political tussle, trainer says Photo shows Woman poses for photo, leaning against a black fence at a racecourse The announcement of funding being ended for Tasmania's greyhound racing industry has left the people who work in it \"filthy, angry\", a trainer says — with special mention made of the Liberal premier.\n\nThe minority Rockliff government's announcement in August about the greyhound racing ban came as both major parties were attempting to woo a mostly progressive crossbench ahead of a no-confidence vote in the parliament.\n\nDuring two weeks of negotiation with the crossbench, Mr Rockliff promised to phase out greyhound racing in 2029, cancel plans to release more native forests for logging, and put a moratorium on the expansion of salmon farming.\n\nFor the Liberals, it was a pitch to stay in power, following a snap state election where neither side claimed a majority.\n\nBut it has left the greyhound industry feeling betrayed.\n\n\"If you're going to shut down one industry based on a whim, what is next? That's the question for good, fair-thinking Tasmanians,\" Mr Gatehouse said.\n\nPremier says closure assured\n\nOn Sunday, Premier Jeremy Rockliff said he was aware of mainland lobbyists' attempts to fight his plans, and said he was not surprised.\n\n\"They will fail. Greyhound racing will end in 2029,\" he said\n\nHe said the industry's focus should be on a smooth and measured transition.\n\n\"I know that local greyhound racing participants were extremely disappointed in the decision we've made, but I'm comfortable with the decision because it's the right one.\"\n\nJeremy Rockliff made the commitment as he worked to shore up support for his leadership. (ABC News: Ebony ten Broeke)\n\nTasmania's racing integrity commissioner Sean Carroll has announced a transition group to \"ensure all appropriate support is provided\" to participants.\n\nIn response, Greyhounds Tasmania penned its own open letter, calling the group \"premature and inappropriate\".\n\n\"The announcement of a phase out is not a settled outcome. It is a contested policy that we are actively working to overturn,\" it says.\n\nAsked whether the industry needed to be involved in the group to ensure participants received the best possible outcome, Mr Gatehouse said they would have a voice \"in making sure that legislation is not passed\".\n\nThe Tasmanian government says greyhound racing in the state will end in 2029. (ABC News: Scout Wallen)\n\n'Majority of Tasmanians' support the ban, detractors say\n\nCoalition for Protection of Greyhounds president Amy MacMahon said interstate greyhound industry insiders were bound to involve themselves in the Tasmanian cause because \"they know that the writing is on the wall\".\n\n\"I'm not surprised that the greyhound industry and other states are starting to mobilise to push back,\" she said, arguing it was also an attempt to \"shore up support\" in their own states.\n\nRSPCA reacts to wind up of Tasmanian greyhound racing Photo shows Andrea Dawkins with greyhound As the RSPCA celebrates the Tasmanian government's decision to end greyhound racing by 2029, one industry stalwart says he is \"devastated\" by the move.\n\nThe sport has been banned in the ACT since 2018.\n\nInternationally, greyhound racing remains active in only one US state, while a New Zealand ban will be in place from July next year.\n\nBut a 2016 push to end the sport in New South Wales was ill fated, and later cast aside after industry backlash.\n\nMs MacMahon expects the industry to use similar tactics as it did in NSW.\n\n\"There was a concerted campaign of misinformation from the industry, from the conservative media, in that case from NSW Labor as well, who were spreading misinformation about the economic impacts and misinformation about the levels of animal abuse,\" she said.\n\n\"The difference in this case is that we know very clearly that the majority of Tasmanians support the ban on greyhound racing. That is irrefutable.\"\n\nRecent polling by EMRS found 74 per cent of Tasmanians backed the government's decision to phase out greyhound racing.\n\nThe Q-Track west of Brisbane is Queensland's home of greyhound racing.\n\nMs MacMahon also criticised the role of Mr Gatehouse in the campaign, citing his involvement in the development of Queensland's new Q-Track.\n\nThere has been a string of animal deaths related to injuries at the track since it opened in March.\n\n\"The Tasmanian industry has gotten on board a lobbyist with a track record in setting up tracks causing huge amounts of death and animal abuse,\" she said.\n\nMr Gatehouse has hit back, saying he has continually been involved in improving animal welfare standards during his time in the sport.\n\n\"The thing about making sure that we're part of an acceptable code of racing within the community is to continually evolve, and we will do that,\" he said.\n\nParticipants 'want to do our thing'\n\nHobart-based Greyhound breeder and owner Greg Fahey is among those feeling bolstered by the interstate interest.\n\nHe said the industry would not give up without a fight.\n\n\"In 2029, all the dog people that are here now will still be here. I'm not sure how many that are in the current government — or on any side of the politics — are still going to be there,\" he said.\n\n\" We say a week is a long time in politics … four years is a millennium. \"\n\nTasmanian greyhound racing participants say they want to \"do our thing\". (TasRacing)\n\nMr Fahey has a long history with the sport, having founded the Tasmanian greyhound hall of fame.\n\nAlong with his brother Gary, he owned one of Tasmania's most successful dogs, Raider's Guide, which was euthanased following a racing injury in July.\n\n\"We don't try to convince everyone to love greyhound racing; we just want to do our thing and let other people do their thing,\" he said.\n\nHe was confident industry participants would see the loss of the sport as like the \"death of a friend\".\n\nHe said the overturning of the ban in New South Wales proved the industry could save itself when aided by other politicians or media figures.\n\n\"We've got a very strong argument, and the rest of Australian greyhound racing is firmly behind us,\" he said.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-09-08/asx-markets-business-news-live-updates/105745064",
        "title": "Live: ASX slips after Wall St falls on weak US jobs figures",
        "publish_date": "Sun, 07 Sep 2025 21:04:34 +0000",
        "category": "finance",
        "authors": [
            "Stephen Letts",
            "Daniel Ziffer",
            "Stephanie Chalmers"
        ],
        "text": "Supermarket giant Woolworths expects the cost of repaying underpaid employees could top $500 million.\n\nOn Friday, the Federal Court handed down a judgement on the historical underpayments of salaried employees at the two major supermarkets, which Woolies described \"as lengthy and complex\", noting it \"does not determine all issues in the proceedings\", while Coles agreed it was \"complex\".\n\nA further hearing on the matter is listed for late October to determine the outcome for nearly 30,000 affected employees.\n\n\"It is too early to consider any appeal on any aspects of the decision,\" Woolworths said in a statement this morning.\n\nBased on its preliminary review of the court's reasons, the company expects potential one-off costs related to further remediation of $180-$330 million after tax, with interest, super and payroll tax potentially adding another $140-$200 million.\n\nColes, meanwhile, \"cautions the market from relying on speculative estimates\", in response to media reports of the potential hit to the supermarket.\n\n\"Coles' preliminary estimate is that further remediation of between $150m and $250m may be required to reflect the findings of the court, including interest and on-costs,\" it said on Monday.\n\nOn Friday, Justice Nye Perram found the supermarket chains did not comply with their obligation to keep accurate employment records.\n\nWoolworths said the decision \"will require significant and widespread changes to accepted retail practice for Woolworths Group and Australian businesses, large and small\".\n\nIn an article on the judgement, lawyers at Kings & Wood Mallesons said \"the decision will have wide-ranging implications across the businesses community and warrants prompt and decisive consideration by employers who rely\" on the same previsions used by Coles and Woolies.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-09-08/jay-vine-denied-vuelta-hattrick-but-holds-onto-polka-dots/105746542",
        "title": "Vine misses out on Vuelta hat-trick but extends polka dots lead",
        "publish_date": "Sun, 07 Sep 2025 20:49:16 +0000",
        "category": "sports",
        "authors": [],
        "text": "Australian Jay Vine has been thwarted in a bold bid for a hat-trick of victories at this year's Vuelta a España, but his consolation after finally running out of steam was to increase his lead at the top of the King of the Mountains (KoM) standings.\n\nOn Sunday's hilly 15th stage between Vegadeo and Monforte de Lemos, Vine, in the mountains classification leader's blue polka dot jersey, led for nearly 100 kilometres after going on the attack with his fellow breakaway rider Louis Vervaeke.\n\nAfter hoovering more big KoM points atop the Alto de Garganta and Alto de Barbeitos Col, the daring pair went on to open up a 3-minute lead at one point, with Vine even contemplating the outlandish prospect of a third win after his victories on the sixth and 10th stages.\n\nBut they finally got reeled in 7km from home by another group of seven, headed by former world champion Mads Pedersen, who went on to race away comfortably to victory in the sprint finale, increasing his lead in the points classification leader's green jersey.\n\nIt was a measure of Vine's tremendous effort that he was still prepared to have a go and attack once more, even in the final kilometre, but eventually he had to settle for eighth place.\n\nHis reward for another superb day's work with the all-conquering UAE Team Emirates-XRG outfit, though, was to have increased his King of the Mountains lead from seven points to 22 ahead of overall race leader Jonas Vingegaard.\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\n\"That was a long hard day,\" 29 year-old Vine said.\n\n\"After I gained the second loads of points, I decided to push on with Louis. If we'd had one more guy that came to us, maybe we could have cooperated, shared the load a bit more and stayed away.\"\n\nVingegaard had a quiet day, not attempting to chase down the leaders, as there was no change to the general classification, with Vine's teammate João Almeida still 48 seconds behind.\n\nBritish double Olympic mountain bike champion Tom Pidcock is 2:38 in third, with Australian Jai Hindley looming ominously in fourth, still only 32 seconds off a podium place.\n\nA protester carrying a Palestine flag had earlier caused a crash when he ran towards the road, causing Javi Romo and Edward Planckeart to slide off. Movistar Team's Romo had part of his shorts ripped off, but both riders were able to rejoin the race.\n\nIt was the latest in a series of disruptions by pro-Palestine protesters during the three-week grand tour.\n\nAAP/ABC",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-09-08/anthony-falconer-behind-multiple-liquidations-company-collapses/105679990",
        "title": "Man behind multiple company collapses wins $400k council contract",
        "publish_date": "Sun, 07 Sep 2025 20:32:53 +0000",
        "category": "finance",
        "authors": [],
        "text": "A New South Wales council awarded nearly half a million dollars' worth of work to a building company run by a formerly bankrupt businessman responsible for multiple company collapses.\n\nAnthony Falconer, 63, from Killcare on the Central Coast, has directed three failed civil construction companies in the past few years.\n\nIt has also been suggested in a public report that Mr Falconer may have been operating as a \"shadow director\" while bankrupt at a fourth business that also failed, which he has denied.\n\nAnthony Falconer has denied any wrongdoing. (Supplied)\n\nCreditors across all four businesses stretch from Tasmania to far north Queensland, with more than $2 million of debt, and include the tax department.\n\nSecret reports into liquidated companies\n\nThe ABC understands the Australian Securities and Investments Commission (ASIC) has commissioned several secret reports into the liquidated companies.\n\nASIC declined to comment.\n\nDo you know more about this or have a similar story? Email turner-cohen.alex@abc.net.au\n\nDespite authorities investigating, the Central Coast Council hired a civil construction company directed by Mr Falconer to carry out two projects in the past year.\n\nOne of the jobs began just two months after Mr Falconer's most recent company collapsed into liquidation.\n\nMr Falconer told the ABC several of his businesses had collapsed because \"I took my eye off the ball\" due to a family member becoming sick and denied any wrongdoing.\n\n\"If you think I did this deliberately or to rip somebody off, then you're sadly mistaken. It's not something you go through because you want to,\" he said.\n\nAnthony Falconer's company Hard Hat 1 won tenders to do work for the Central Coast Council. (Supplied)\n\nCouncil 'unaware' of history of failure\n\nDesmond Colgan, a Central Coast rate payer and home owner who claims to have lost money from the fallout, said he was \"disappointed but not surprised\" to learn his council engaged Mr Falconer for work.\n\nThe Central Coast Council awarded two jobs to Hard Hat 1 Pty Ltd, a civil construction company, to renew bus stops, kerb ramps and footpaths, for $219,000 in December and $209,000 for a job ending in June.\n\nMr Falconer is the sole director of Hard Hat 1. His wife, Philippa Skipper, is the sole shareholder and was the previous director.\n\nDesmond Colgan says he is disappointed to learn council has awarded work to Anthony Falconer. (ABC News: Alex Turner-Cohen)\n\nMr Falconer took over from his wife as the director on October 24, 2022, just six days after he was released from bankruptcy.\n\nHe told the ABC although his wife had no knowledge of civil construction, she knew how to run a business as it was \"not rocket science\".\n\nWhen asked why he assumed control so soon after his bankruptcy, he said \"she didn't want to do it, and she was quite happy for me to take over and do it\".\n\nOne of Mr Falconer's other companies went into liquidation in October, just two months before the council engaged Hard Hat 1.\n\nA Central Coast Council spokesperson said in a statement it was \"unaware of any bankrupt or insolvency history\" associated with Hard Hat 1 and that \"more comprehensive searches\" into a business were only done for projects considered \"higher value/risk contract\".\n\nThe spokesperson said formal tenders were only sought for projects worth more than $250,000.\n\nDesmond Colgan says he engaged a company with links to Anthony Falconer to do work on a bridge. (ABC News: Alex Turner-Cohen)\n\nFears about insolvent trading\n\nIn October, another of Mr Falconer's businesses involved in civil construction, Hard Hat 2, collapsed owing more than $600,000, with the tax department owed the majority, including for unpaid superannuation to staff.\n\nLiquidator Chad Rapsey, of insolvency firm Rapsey Griffiths, said Hard Hat 2 was a labour hire business providing services to a related entity, Hard Hat 1.\n\nIn a report to creditors, published by ASIC, the liquidator noted Mr Falconer \"has not been able to provide a copy of the contract\" between the two companies, adding it appeared to be an \"unprofitable agreement\".\n\nHe wrote to creditors that Hard Hat 2 might have been trading insolvent for two years.\n\nMr Rapsey told the ABC that ASIC had also requested he submit a supplementary report, an additional report on the company's affairs that was confidential and could pre-empt disciplinary action.\n\nAnother civil construction business Mr Falconer directed crumbled less than a year earlier.\n\nNathan Hall (pictured with his son) has been left out of pocket from one of the companies that collapsed. (Supplied)\n\nIn November 2023, Hard Hat 3 went into liquidation over a $73,000 debt to a contractor, NCH Civil.\n\n\"It's cost me a lot of money,\" NCH Civil director Nathan Hall said.\n\nMr Hall, whose business is based in Tolga near Cairns, flew down to work as a subcontractor for Hard Hat 3 at the Muswellbrook TAFE site in the upper Hunter, but said he was not paid for some of his work.\n\n\"It's absolutely ridiculous that somebody... [with his history can] still have ongoing work, especially with the government,\" he said.\n\nThere were 13 other creditors of Hard Hat 3 and the total debt climbed to more than $200,000.\n\nThe appointed liquidator of Hard Hat 3, Terry Grant Van Der Velde, from insolvency firm SV Partners, made a creditors report saying Mr Falconer might have committed several offences.\n\nThose included continuing to trade the company while insolvent, failure to act with a degree of care and diligence, failure to act in good faith and for a proper purpose and failure to keep financial records.\n\nThe liquidator's report also said a $42,000 transaction made by the director, Mr Falconer, was potentially \"unreasonable\".\n\nMr Falconer said he had not retained any of his paperwork, having handed it all in to liquidators, so was not able to comment on the transaction.\n\nASIC had also requested this liquidator submit a secret report on the company's affairs.\n\nCreditors for companies linked to Anthony Falconer stretch from Tasmania to far north Queensland. (ABC News: Alex Turner-Cohen)\n\nFamily connection between companies\n\nAnother company collapsed a year earlier, in late 2022, which has also been linked to Mr Falconer.\n\nCentral Coast home owner Desmond Colgan paid $120,000 to Hard Hat Civil Pty Ltd, trading under the name Civil Central Projects, to upgrade a bridge on his Empire Bay property.\n\nHowever, he claims the job, facilitated by Mr Falconer, was done poorly. Mr Colgan refused to pay any more and had engaged lawyers when the company collapsed in late 2022.\n\nIt was then he learned Mr Falconer was an undischarged bankrupt and had actually been working for his son, Thomas Falconer, the director of Hard Hat Civil.\n\n\"If I'd have known Anthony Falconer was an undischarged bankrupt, I wouldn't have engaged him to do any work on my property,\" Mr Colgan said.\n\nJeffrey Shute from insolvency firm Shaw Gidley was appointed liquidator of Hard Hat Civil, which had debts of more than $700,000.\n\nThe liquidator said in a statutory report the company might have been insolvent for two years.\n\nPreliminary inquiries suggested Anthony Falconer \"may have been acting in a shadow or de facto director role and accordingly, may have breached his duties to the company and may be liable to the company for compensation\", the report said.\n\nThe liquidator noted there were \"several payments\" that required further investigation, including $8,700 to Mr Falconer and $44,000 to a company called Kamudah Pty Ltd.\n\nMr Falconer's wife is the sole director of Kamudah.\n\nAnthony Falconer has directed a number of civil construction companies. (Supplied)\n\nThomas, Mr Falconer's son, told the ABC he was \"completely unaware of these payments\" and \"upon reflection [Anthony Falconer] had more control than I realised and that he should have\" of the business.\n\nThe pair no longer speaks, both told the ABC.\n\n\"My relationship with him is quite strained, which is really unfortunate,\" Anthony Falconer said.\n\nThe creditor report for Hard Hat Civil stated Anthony Falconer used the Civil Central trading name and the website domain to run one of his new Hard Hat businesses, which he had \"no right to\".\n\nIn response, Mr Falconer told the ABC: \"Civil Central is a trading name and it wasn't registered. Anybody could have used it.\"\n\nThomas Falconer said he was \"unaware\" his company's business name had been used at his father's new company and that the liquidator had formally interviewed him as part of ASIC's secret probe.\n\nThe liquidator, Jeffrey Shute, declined to comment.\n\nATO Falconer's largest creditor\n\nMr Shute was previously the liquidator of another of Anthony Falconer's failed businesses.\n\nIn 2019, Hard Hat Holdings collapsed with debts of about $800,000.\n\nJeffrey Shute wrote in that liquidation report the \"catalyst\" for the company's failure was a tax debt, including $127,000 of unpaid superannuation dating back to 2016 and that Hard Hat Holdings may have been trading insolvent since 2017.\n\nMr Falconer declared bankruptcy following the liquidation, owing $730,000 to eight creditors.\n\nThe Australian Taxation Office was his largest creditor, where he personally owed $310,000.\n\nThe Central Coast Council said for less high-risk projects like that of Hard Hat 1, the only check carried out was \"a company search against the ABR as per council's procedures\".",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-09-08/displaced-palestinians-gaza-city-fear-evacuating/105745934",
        "title": "Palestinians in Gaza City consider evacuating for their children's sake",
        "publish_date": "Sun, 07 Sep 2025 20:27:16 +0000",
        "category": "finance",
        "authors": [],
        "text": "Hundreds of thousands of Palestinians are being told to immediately leave Gaza City, as the Israeli military's campaign to take over and occupy the area intensifies by the hour.\n\nBut despite the grave danger faced by civilians in the Israel Defense Forces (IDF) pursuit of claimed Hamas fighters and facilities, many are refusing to move — citing fatigue from multiple displacements in recent months and fears a so-called \"humanitarian zone\" is far from safe.\n\nOver the weekend, the IDF issued a new map of an expanded area near the Mawasi camp, where it was encouraging Palestinians to move.\n\nBut despite labelling it as a safe area for people, much of the area has been subject to Israeli evacuation orders for months.\n\nDisplaced Palestinians are living in tents on the beaches of Gaza City. (ABC News)\n\nIn a tent camp lining the beach in Gaza City, displaced Palestinians feared moving was both inevitable and ineffectual.\n\n\"Nowhere is safe — also the south, our situation is like theirs, but they say it's a humanitarian area, but people do not want to go there,\" Nizar Mohammad, 32, originally from the Jabalia refugee camp, told the ABC.\n\n\"It is in the hands of God. You hear about shelling and threats and whatnot, but it is bit better than being in the north.\"\n\nNizar Mohammad is unsure if the situation in the south will be better. (ABC News)\n\nNizar Mohammad fixing a tent where he lives. (ABC News)\n\nAhmad Awwad, also from the Jabalia camp, questioned how the declared \"humanitarian zone\" could accommodate all of the population of Gaza City.\n\n\"There is no option, if you are in danger and your kids are in danger, will you remain and stay and say I am not leaving?\" he said.\n\n\"We will leave, for sure we will leave, if there is an exodus, there is no other choice.\"\n\nAhmad Awwad said he would leave for the sake of his children. (ABC News)\n\nOthers were not convinced.\n\n\"I will remain here, God willing, because there is no place in the south. The south is full,\" Suheil Dheir said.\n\n\"Yesterday there was shelling in the south, they hit the civil guard, they hit the journalists, everywhere is targeted, both the north and the south are targeted.\n\n\"If I fled or if I was forced to leave in an extreme situation, I would leave without anything — only me and my children.\n\nSuheil Dheir says she is not leaving the north as there is no place in the south. (ABC News)\n\nIsrael targets high rises\n\nOver the weekend, Israel's offensive in Gaza City reached a new and dangerous point with the destruction of three high-rise apartment blocks.\n\nThe IDF issued evacuation warnings ahead of the strikes, saying the buildings were being used by Hamas and sat above underground tunnel networks. One building, the IDF claimed, had been rigged with explosives.\n\nPeople were seen running away as an Israeli air strike hit the Al-Roya building in Gaza City. (ABC News)\n\nNo evidence to back up the assessments was provided.\n\nLeaflets have been dropped from Israeli military aircraft outlining where the new humanitarian zone is.\n\n\"On a personal level, I will be going from this place of displacement straight to paradise,\" 28-year-old Fidaa Saha said.\n\n\"I am not going south even if they drop pamphlets.\n\n\"If God decided that your destiny is to die, you will die, and if it is to live, you live.\"\n\nFidaa Saha says she will not evacuate. (ABC News)\n\nThousands have left Gaza City\n\nIsrael's Prime Minister Benjamin Netanyahu said more than 100,000 Palestinians had heeded the call to leave Gaza City.\n\n\"We are destroying terror infrastructures, we are destroying incriminated terror towers and we have set up another humanitarian area to allow the civilian population in Gaza to leave for a safe place and receive humanitarian aid there,\" he told a meeting of Israeli ministers in an undisclosed location in Israel.\n\n\"About 100,000 people have left Gaza [City] so far.\n\n\"Hamas is trying to do everything so they won't leave, so they would stay there and act as a human shield for it.\"\n\nThe IDF's displacement orders mapped Photo shows A map of the Gaza strip showing areas in orange that have been issued evacuation orders by the IDF since March. The IDF's evacuation orders show just how much of Gaza Israel already controls.\n\nMr Netanyahu conceded that Israel was paying a high diplomatic price for its ongoing offensive in Gaza, adding that it was losing the \"propaganda\" battle around the world.\n\nWhile it was a moment of political clarity from the prime minister, it was not coupled with any responsibility for the dire humanitarian crisis in the strip.\n\n\"If I need to choose between victory over our enemies and negative propaganda against us — I choose victory over our enemies rather than the opposite,\" Mr Netanyahu said.\n\nThat relentless pursuit for victory is coming at an ever increasingly high cost — with more than 64,000 Palestinians killed during the course of the war, according to the Palestinian Health Ministry in Gaza.\n\nThe figures do not differentiate between civilians and Hamas fighters, but they do include many thousands of women and children caught in Israeli attacks.\n\nOn Sunday, the ministry said another 31 Palestinians had been killed trying to access aid in the strip and five had died from malnutrition — three of them children.\n\nFamilies of Israeli captives still held by Hamas and the Palestinian Islamic Jihad group have accused Mr Netanyahu of pursuing the war rather than trying to reach a ceasefire and hostage deal.\n\nThere are 48 hostages in Gaza, 20 of whom are believed to be alive.\n\nMany of their supporters fear the expanded Gaza City offensive will threaten those still living, and have urged the Israeli government to reach an agreement to halt the hostilities.\n\nDisplaced Gazans have very little to survive on. (ABC News)\n\nDanish foreign minister calls for end of war\n\nIn Jerusalem, Danish Foreign Minister Lars Lokke Rasmussen met with his Israeli counterpart Gideon Sa'ar.\n\n\"It goes without saying that we demand that all Israelis hostages in Gaza are released immediately, and we have said that frequently, and from day one, also that Israel has a right to self-defence,\" Mr Rasmussen said.\n\n\"But it doesn't change the fact that we are extremely concerned about the humanitarian disaster in Gaza, and that's why I used the opportunity today to repeat our calls for Israel to stop the military offensive in Gaza, to ensure immediate and unhindered humanitarian assistance.\"\n\nDanish Foreign Minister Lars Lokke Rasmussen met with his Israeli counterpart Gideon Sa'ar. (X/Gideon Sa'ar)\n\nMr Rasmussen also met with Palestinian Prime Minister Mohammad Mustafa in Ramallah.\n\n\"I also expressed our deep concern by the expansion of settlements in the West Bank, and I reiterated Denmark's offer to help assisting with the treatment of patients from Gaza in East Jerusalem or the West Bank,\" the Danish foreign minister said standing alongside Mr Sa'ar.\n\nIsrael's foreign minister claimed the humanitarian situation in Gaza had improved dramatically, despite most international aid and medical agencies continuing to sound the alarm over the dire situation in the strip.\n\n\"With regards to the humanitarian situation as a whole, there is a big change on the ground,\" Mr Sa'ar said.\n\n\"It's not something that you can find in Western media, but the facts are, we … fulfilled all our understandings with the EU on the matter, and more than that after we also started with the humanitarian corridors policy and air drops, huge quantities entered to Gaza Strip and that was reflected in the decline, the dramatic decline of the prices of products.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-09-08/exporters-stressed-and-angry-about-emdg-grant/105734456",
        "title": "Austrade outrage as exporters detail 'disaster' grants process",
        "publish_date": "Sun, 07 Sep 2025 20:08:31 +0000",
        "category": "finance",
        "authors": [],
        "text": "By many accounts, Austrade's signature grant has helped tens of thousands of local businesses sell goods and products overseas in the past 50 years.\n\nBut right now, it also appears to be a source of outrage and frustration.\n\n\"[Getting one of these grants] feels like lining up for a Melbourne Cup sweep at the pub,\" grant consultant Ray Radice tells ABC News.\n\n\" Some get lucky with the favourite, others are stuck with the donkey, and no-one knows why. \"\n\nABC News has spoken to a range of local business owners about their issues with the federal trade department's Export Market Development Grant (EMDG).\n\nOne manufacturer is so agitated they are going to local politicians for help, while another fashion label owner has walked away from applying altogether.\n\nOne consultant is even accusing Austrade of systemic issues with procedural fairness, and is lodging appeals for his clients with the Commonwealth tribunal.\n\n\"Their idea of transparency is like a frosted glass door,\" Mr Radice says.\n\nConcerns with the EMDG come as the grant is being reviewed, as part of a five-year legislative requirement.\n\nThey also come as Australian exporters are simultaneously dealing with the extra uncertainty being created by US President Donald Trump's \"Liberation Day\" tariffs.\n\nWhat is the EMDG?\n\nThe EMDG was launched in 1974 and has been accessed by 51,000 small and medium-sized Australian businesses, according to Austrade.\n\nIt is used by businesses to pay for expenses such as trade expos, overseas marketing and product development, and other costs related to boosting overseas sales.\n\nBusinesses have to match the grant amount dollar-for-dollar with their own funds, which they need to prove they can do when they apply.\n\nHealthGuard's COO, Victoria Harvey, says accessing EMDG funding is a big relief. (Supplied)\n\nThe company that Victoria Harvey's father started decades ago — and that she now helps run — has successfully accessed these grants twice at $30,000 a year.\n\nHealthGuard makes chemicals that help sterilise items like rugs. It sends these overseas, with exports about 80 per cent of its business.\n\n\"It was a big relief,\" Ms Harvey says of getting EMDG funding.\n\n\"Because obviously relying on export markets all the time, and wanting to promote the brand in a foreign market, is high expense.\"\n\nAre you an Australian exporter or do you know more about EMDG? Confidentially contact our journalist on terzon.emilia@abc.net.au or em.terzon@proton.me\n\nMs Harvey uses a consultant to apply for the grants. She says the application process seemed simple enough in previous years.\n\nThen, in the latest round of funding applications, something went awry for HealthGuard.\n\nVictoria Harvey is checking on the documentation needed for EMDG. (Supplied)\n\n$62m in funding exhausted in 84 hours online\n\nDocuments for the grant's current review note \"the last five years has been a period of significant change for EMDG\", after adjustments to the program implemented after the last review in 2020.\n\nSome changes included bringing in \"tiers\" that categorise exporters into different stages, and shifting from reimbursing business costs to upfront payments.\n\n\"The shift created higher demand and lower grant amounts,\" Austrade noted in 2024.\n\nLast year — in a bid to \"deliver more impactful grants\" — Austrade announced another change ahead of a funding round that opened in November that year.\n\n\"Applications will be assessed and grants will be offered in the order we receive applications until funding is fully allocated,\" the guidance said.\n\nKate Whitehead has described the application day as \"a mad scramble\". (ABC News: Matthew Holmes)\n\nOne prominent consultant that heads up a body for the EMDG industry, Kate Whitehead, believes this \"first in, best dressed\" model was brought in to help take the pressure off the EMDG program's stressed budget.\n\nShe said Austrade was warned this change would create chaos.\n\n\"We flagged these issues,\" she tells ABC News.\n\n\" It's not a fair go. \"\n\nPreparing for the worst, Ms Whitehead put on 80 temporary extra staff to help lodge applications for clients on a specific funding application day on November 12.\n\nHer firm had hundreds of clients who wanted to apply for that day's \"tier 2\" funding, which offered $31 million a year for exporters pushing into existing markets.\n\n\"We hired two computer labs in the CBD,\" she recalls.\n\n\" We had a process where we'd load the applications on USBs, and then people would put their hand up once they'd lodged, and we'd run over with another USB. \"\n\nIn the end, after opening up at 10:00am AEST, Austrade's portal for tier 2 was open for just three-and-a-half hours before saying funding was \"exhausted\".\n\nKate Whitehead says the new application model is not a fair go. (ABC News: Matthew Holmes)\n\n\"That day was a disaster,\" another EMDG consultant, Ray Radice, tells ABC News.\n\n\"I've said before: it was like you were preparing to go for Tay Tay or grand final tickets.\n\n\"We had clients up at 6am in Perth ready to put in their applications.\n\n\"Austrade's portal was crashing all the time, buffering, waiting to get to the next screen. All while you're watching the clock.\n\n\"It was a mad scramble and my phone wouldn't stop ringing.\"\n\nA 'chaotic application rush', expert says\n\nOne Australian business that missed out in the scramble on November 12 was Mr Radice's client, Melbourne-based tech company owner Rob Raulings.\n\nHis ticketing business Ferve had previously accessed $24,000 to help it expand into North America. The company is still pushing in the US without further grants.\n\n\"But it has made life more difficult,\" he says.\n\nOther tiers of EMDG funding that opened up in November stayed open far longer — about eight days — and even then there wasn't enough demand to use up the available funding.\n\nThat discrepancy is leading to concerns that the \"tiers\" aren't designed correctly.\n\nUniversity of Queensland's Tao Bai is a senior lecturer in business, who is across the changes to EMDG and the heat being thrown at Austrade.\n\nTao Bai says the new model has created a chaotic application rush. (ABC News: Mark Leonardi)\n\n\"New eligibility rules and smaller capped funding pools have raised alarm,\" he says.\n\n\"Many businesses, whose grant agreements ended on 30 June 2024, will be ineligible for EMDG support in FY 2025.\"\n\nDr Bai says the \"first in, first served\" model is also likely \"crowding out\" small businesses without consultants or those in the regions with bad internet.\n\n\"This has created a chaotic application rush,\" he says.\n\n\" This turned the process into a digital scramble, where speed of submission, internet stability and technical luck determined outcomes, rather than business merit or readiness. \"\n\nHowever, Dr Bai adds there are some upsides to the changes made to EMDG in recent years, such as moving away from the \"reimbursement\" model.\n\n\"This means businesses receive funding up-front — boosting liquidity and reducing financial risk for SMEs,\" he says.\n\n\"The introduction of fixed minimum and maximum grant amounts by tier [also] brings clarity and predictability.\"\n\nApplicants still waiting for grants 10 months later\n\nAustrade received 2,693 applications during the November application round, the department told ABC News.\n\nNine months later, just over 70 per cent have received grant offers.\n\nSome of those still waiting for the outcome of their applications include HealthGuard.\n\nThe manufacturer's Ms Harvey's last communication with the trade department was in July, when she asked for a review about her \"tier 2\" application.\n\nIt's now several months into 2025-26, one of the financial years the latest grants are supposed to cover.\n\n\"That indicates a deep misunderstanding of how forward planning works within a business,\" Ms Harvey tells ABC News.\n\n\" It's put us in limbo, big time. \"\n\nIris Smit, who has applied for several rounds of EMDG, says the stress created by the current application model is unnecessary. (ABC News: Nicholas Martyr)\n\nPerth-based cosmetics entrepreneur Iris Smit is also in the same position with her brand QuickFlick.\n\n\"This uncertainty has forced me to delay overseas marketing, pull back on trade shows and slow down expansion plans,\" she says.\n\n\"The flow-on effect is significant. We've held back on placing purchase orders with our Australian suppliers and slowed down hiring additional Australian employees who would have supported this expansion.\n\nKate Whitehead's firm helped both HealthGuard and QuickFlick apply for their grants in November.\n\nThe firm doesn't charge clients until they have a successful grant approved, and Ms Whitehead said battling Austrade had tripled her business's workload.\n\n\"We've had several instances where clients have received a notification of rejection from Austrade because Austrade can't open [application] documents,\" she says.\n\n\"That's quite stressful for small business.\"\n\nAustrade accused of abandoning Aussie businesses caught in China–US trade war Photo shows A woman and man inspect a black t-shirt on a mannequin Australian fashion brands that are stocked in the US are wearing the burden of the higher tariffs on Chinese made goods. And as uncertainty continues, some brands are walking away from the lucrative market.\n\nAustrade declined an interview with ABC News.\n\nIn a statement, a spokesperson said Austrade has \"been working through the assessment process to ensure funding is allocated fairly and responsibly\".\n\n\"Austrade has been working hard to reallocate any remaining funding from ineligible applicants to be able to offer as many grants as possible within available funding,\" it added.\n\n\"This process has taken time noting that applicants with an ineligible outcome have 30 days to request a review of decision under legislation and Austrade has provided an opportunity to ineligible applicants to do so.\"\n\nAustrade's November round was for two financial years of funding. Its spokesperson said it expected every eligible applicant would get at least one year's worth.\n\n\"It is expected that by mid-September 2025 all remaining eligible applicants will receive their grant offer,\" they added.\n\nThe spokesperson noted that the average grant amount given out had more than doubled to $54,000 since the introduction of the \"first come, first served\" model.\n\nA major firm that lodges EMDG applications told ABC News it experienced a higher knock-back for clients in the November round.\n\n\"However, this has enabled each successful applicant to access an increased EMDG amount from a maximum of $30,000 to a maximum of $100,000,\" Grant Thornton's partner Rebecca Iwanuscha said in a statement to ABC News.\n\n\"This increased funding could be transformative for a small business.\"\n\nCalls for more funding and an external review\n\nMinister for Trade and Tourism Don Farrell has appointed Tourism Australia's Timothy Yeend to lead the government's current review of EMDG.\n\nThis review is specifically asking for feedback about the controversial November round of funding, including about \"service delivery\" and \"communications\".\n\nMr Farrell declined an interview.\n\nAustralian business owners have voiced their frustration with the Export Market Development Grant. (Getty Images: Sergio Dionisio/Bloomberg)\n\nThe advisory body headed up by Ms Whitehead, Export Chamber of Australia Incorporated (ECAI), is lobbying for an industry-led review of the EMDG grant.\n\nIt has already paid the University of Melbourne to conduct its own assessment.\n\nThis concluded the grant application process needs to be simplified, and that EMDG needs a bigger budget.\n\nFunding has been wound back by the federal government in the past few years.\n\n\"The current budgeted funding level of approximately $110 million per annum is critically insufficient,\" the ECAI review notes.\n\n\" When adjusted for inflation, this represents only one-third of the funding level provided by the grant program in 2000. \"\n\nThe ECAI review also argues the program offers return on investment (ROI) for the government, with firms typically exporting an extra $2.10 in goods per $1 received in funding.\n\nThe last government review of the program in 2020 also agreed it generated \"strong economic outcomes\".\n\nQuestions over Austrade's flagship grant for exporters come as some of them are simultaneously battling headaches from US President Donald Trump's tariffs.\n\nAustralia Post defends halt on US shipping Photo shows Close up shot of a Aus Post express post package Australia Post's chief executive defends the postal carrier's decision to immediately halt most shipping to the United States, just four days before a tariff deadline on low-value packages arriving there came into play.\n\nThere have been further problems for small businesses shipping to the US, after the suspension of most Australia Post services there, also over Trump tax changes.\n\nThe Australian government pledged cash to these stressed exporters five months ago but that still hasn't been delivered by cabinet.\n\n\"On top of this, exporters are being failed by a chaotic [EMDG] program,\" federal opposition trade spokesperson Kevin Hogan said in a statement to ABC News.\n\n\"For three years the scheme has been tied up in reviews and redesigns.\n\n\" Exporters don't need endless reviews and technical failures, they need stability and support. \"\n\nSubmission for the government's EMDG review are open until September 12.",
        "source": "ABC"
    },
    {
        "url": "https://www.smh.com.au/national/queensland/brisbane-news-live-review-into-broken-foster-home-system-to-begin-hearings-20250905-p5mssc.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Brisbane news live: Riverfire spectators face lengthy wait for buses home | How the blood moon looked over Brisbane | Take the Brisbane Times quiz",
        "publish_date": "Mon, 08 Sep 2025 12:00:14 +1000",
        "category": "finance",
        "authors": [],
        "text": "Vacant apartments will become harder to find and median rents are predicted to climb in Brisbane over the next five years, a report by commercial real estate services company CBRE has found.\n\nThe research examined the demand, supply, vacancy and rents for Australian apartments and found median rents were expected to grow by 24 per cent between 2025–2030 across 53 precincts in Australian capital cities.\n\nLoading\n\nBrisbane’s CBD was expected to shoulder the biggest price hike, with the median rent for a two-bedroom apartment in the city expected to top over $1000 a week within the next five years.\n\nThe CBD and south-east suburbs will see the sharpest falls in vacancy, with city-wide vacancy falling from 1.1 per cent to 0.7 per cent over the next three years.\n\nCBRE estimates Brisbane’s apartment delivery will average 4600 per annum, with supply focused on the CBD and inner-city ring.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/world/north-america/trump-booed-at-us-open-final-fans-stuck-in-security-lines-as-match-starts-20250908-p5mt4z.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Trump booed at US Open final, fans stuck in security lines as match starts",
        "publish_date": "Mon, 08 Sep 2025 12:00:10 +1000",
        "category": "sports",
        "authors": [
            "Michael Koziol"
        ],
        "text": "Thousands of tennis fans were stuck in long queues outside New York’s Arthur Ashe Stadium, and the US Open men’s final was delayed by half an hour due to security protocols to accommodate the presence of US President Donald Trump.\n\nIt was the first time a sitting president has attended the tournament since Bill Clinton in 2000. Trump last went in 2015 while campaigning for the Republican nomination and was loudly booed by the rowdy New York crowd.\n\nTennis fans lining up to get through security at Arthur Ashe Stadium for the men’s final. Credit: AP\n\nThe men’s final featured world No. 1 Jannik Sinner and world No. 2 Carlos Alcaraz in their third straight grand slam final. Alcaraz claimed the Roland Garros title in June and Sinner took the Wimbledon crown in July, but the Spaniard won again with a 6-2, 3-6, 6-1, 6-4 victory, taking the No.1 ranking from Sinner.\n\nAfter Trump flew in from Washington, he briefly appeared courtside just before 1.45pm New York time on Sunday (3.45am Monday AEST), and was met with a spattering of cheers and boos from the small number of people who had made it inside the stadium. Most fans were stuck in long queues outside, waiting to clear Secret Service security.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/western-australia/wa-news-live-wa-premier-to-introduce-new-laws-to-prevent-major-project-delays-20250908-p5mt73.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "WA news LIVE: WA Premier to introduce new laws to prevent major project delays",
        "publish_date": "Mon, 08 Sep 2025 11:58:55 +1000",
        "category": "finance",
        "authors": [],
        "text": "Premier Roger Cook is currently giving the keynote address at a business leadership breakfast in Perth this morning, where he is vowing to accelerate key energy and defence projects by slashing red tape.\n\nNew legislation around the state’s development framework will be introduced to Parliament this week which, if passed, will empower him to declare state development areas and priority projects.\n\nPremier Roger Cook. Credit: AFR\n\nThe unprecedented powers will allow the state’s Co-ordinator General to ensure priority projects aren’t delayed by issuing time frame notices, due regard notices and modification orders.\n\nAmong the first projects likely to use the new laws will be the state government’s 2030 deadline to end coal-fired power generation, and turning Henderson into the nation’s AUKUS ship-building base.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/business/the-economy/trump-s-wrecking-ball-is-really-hurting-america-20250908-p5mt7p.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Trump’s wrecking ball is really hurting America",
        "publish_date": "Mon, 08 Sep 2025 11:57:37 +1000",
        "category": "finance",
        "authors": [
            "Stephen Bartholomeusz"
        ],
        "text": "The tariffs have chilled new investment and hiring while his attack on Biden’s signature policies for inducing climate-related and semiconductor investments is also impacting investment, construction activity and employment. The loss of nearly 100,000 jobs in the federal government and its agencies is another factor. Even the oil and gas sector, which Trump urged to “drill, baby, drill” is laying off employees and reducing its drilling activity in an environment of subdued oil prices – an environment coloured by the impacts of Trump’s trade wars on global trade and growth. None of this was unexpected and almost all of it – if not all of it – relates directly to Trump’s policies. Trump’s tariffs are raising the input costs of manufacturers while generating considerable uncertainty because of the erratic way he has introduced them and the question mark over whether his key “reciprocal” tariffs are even legal. Credit: Bloomberg The US economy grew 2.8 per cent last year and, while it slowed towards the end of the year, was still growing at 2.4 per cent in the December quarter. It’s now growing at an annualised rate of 1.4 per cent.\n\nUS inflation was falling steadily last year. It’s now edging up even before the full effect of the tariffs has had time to flow through to the data. The latest data on consumer and producer inflation will be released later this week. It is expected to show that core inflation (excluding volatile food and energy prices) was still well above the Fed’s target of two per cent last month. The Fed’s preferred gauge, the core personal consumption expenditures index, rose 0.3 percentage points to 2.9 per cent in July. Loading It was to be expected, and was forecast widely, that Trump’s policies would lead to reduced employment growth, less business activity and higher inflation because of their impacts on costs and prices, confidence and both the supply and demand for labour. At their last meeting, in December, before Trump regained the US presidency, the Fed’s Open Market Committee forecast GDP growth of 2.1 per cent for this year, and unemployment rate of 4.3 per cent and a core inflation rate of 2.5 per cent.\n\nAt their March meeting, GDP growth was revised down to 1.7 per cent, the unemployment rate to 4.4 per cent and the inflation rate to 2.8 per cent and then, in June, those numbers were again amended, with expected GDP growth downgraded to 1.4 per cent, the unemployment rate raised to 4.5 per cent and the inflation rate to 3.1 per cent. The Fed’s chair, and Trump’s bête noire, Jerome Powell, has made no secret of the rationale for the changes in expectations. They have occurred in response to the expected effects of Trump’s trade and immigration policies on inflation and employment. The Open Market Committee meets again next week and it is widely expected – the markets say there is a 90 per cent probability – that it will cut its policy rate, the federal funds rate, by 25 basis points – the first rate cut this year after cuts totalling a percentage point last year. That cut, if it eventuates, would be directly related to the weak jobs numbers. While there are some in the markets who are calling for a 50 basis point cut (Trump wants three percentage points) the Fed’s concern about a rising inflation rate has tended to make it cautious.\n\nThe tariffs have been rolled out in haphazard fashion, with the reciprocal tariffs on imports from 90-odd countries’ only taking effect from August 7. Various sectoral tariffs have been imposed since February, with more in the pipeline. It may take until well into next year to see their full impact on the US inflation rate and economy and whether those effects on the inflation rate are “transitory” or, because they had become baked into consumers’ expectations, more lasting. (The impact on prices, of course, is permanent). He has promised a “Golden Age” for US manufacturers but is delivering a manufacturing recession. The uncertainties around the longer-term effects of Trump’s key policies, particularly the tariffs, argue against the Fed acting too aggressively. If it cut rates too hard, too early, it might further fuel an inflation rate that is already well above its targeted rate. The Fed is data-dependent and therefore it could be expected to cut rates in 25 basis point increments as it gains new insights into the economy, assuming it is more concerned about unemployment than inflation at each decision point.\n\nIts own expectation, at the June meeting, showed that the median expectation of the Fed officials who vote on rate decisions was for two 25 basis point cuts this year. The market is now pricing in three. The risk remains that both the unemployment and inflation rates rise in tandem, threatening stagflation (low growth with rising inflation) and forcing the Fed to make an invidious choice as to which it should prioritise. Loading Should the data force it to respond to inflation via increased rates, the one certainty is that Trump would double down on his efforts to stack the Fed’s board and/or coerce its officials into acting against their own instincts and experience. That could lead to even higher inflation, an increased risk of recession and the undermining of the market’s faith in the Fed’s ability to respond as it should. Regardless of what the Fed did, market interest rates, which are determined by investors, not the Fed or the administration, would spike.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/property/news/how-much-is-a-view-worth-dad-bidding-for-daughter-nabs-3-7m-fixer-upper-20250908-p5mt76.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘How much is a view worth?’ Dad bidding for daughter nabs $3.7m fixer-upper",
        "publish_date": "Mon, 08 Sep 2025 11:44:01 +1000",
        "category": "finance",
        "authors": [
            "Carmen Forward",
            "Elizabeth Redman"
        ],
        "text": "A South Coogee home with scope to update sold for $3,725,000 at auction on Saturday, won by a dad bidding on behalf of his daughter and son-in-law.\n\nThe two-bedroom semi at 37 Denning Street with views of the ocean and Wedding Cake Island was listed with a price guide of $3 million.\n\nThe property was one of 966 scheduled auctions in Sydney last week. By Saturday evening, Domain Group had recorded a preliminary auction clearance rate of 75.6 per cent from 591 reported results, while 98 auctions were withdrawn. Withdrawn auctions are counted as unsold properties when calculating the clearance rate.\n\nSelling agent Peter Shaw, of Harcourts Byrnes Marsh Shaw, said 10 parties registered for the auction of the “essentially land value” home, most of whom planned to renovate or rebuild.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/lifestyle/health-and-wellness/considering-ai-for-therapy-here-are-five-important-things-to-know-first-20250908-p5mt6n.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Considering AI for therapy? Here are five important things to know first",
        "publish_date": "Mon, 08 Sep 2025 11:41:14 +1000",
        "category": "lifestyle",
        "authors": [
            "Richard Sima"
        ],
        "text": "But evidence that AI chatbots improve mental health remains sparse. Testing for harms is arguably easier than seeing whether the chatbots are providing real benefit, McBain says. The best evidence comes from a study published in March in NEJM AI, the first randomised controlled trial testing the effectiveness of an AI therapy chatbot for people with clinical mental health conditions. Chatting with Therabot – an AI model created by the researchers, trained on a therapy dataset and fine-tuned with expert feedback – reduced symptoms for participants with depression, anxiety, or eating disorders, compared with those who received no treatment. More importantly, participants felt a bond with Therabot – this “therapeutic alliance” is known to be critical in keeping people engaged in therapy and seeing its benefits, says Michael Heinz, a faculty research psychiatrist at Dartmouth College and an author of the study. Although the researchers could commercialise Therabot in the future, the study, funded by Dartmouth, needs more validation in a clinical setting, Heinz says. While it is “terrific” that the study was well-done, “it didn’t answer the questions the public hoped it would answer,” says John Torous, the director of the Division of Digital Psychiatry at Beth Israel Deaconess Medical Center and an associate professor of psychiatry at Harvard Medical School, who was not involved in the research.\n\nLoading The control group received no treatment during the experiment (and later got access to Therabot), so the trial “says it’s better than nothing,” Torous says. “Almost everything is better than nothing in mental health.” Heinz agreed that more work needs to be done, but says it was a good starting point for testing an AI therapy chatbot because “there’s so little that anyone knows about this”. There are plans to test how Therabot, which is not available to the public, stacks up to conventional psychotherapy and in different clinical populations, including young adults. Researchers say they aren’t aware of any other robust clinical trial evidence for generative AI chatbots in therapy or mental health, whether for general-use AI, which most people interact with, or ones advertised as providing mental wellness services, such as “Noni” from 7 Cups and Ash. “There’s not a green light to start using these for mental health and therapy,” Heinz says.\n\nAI Chatbots are ‘better than nothing’ but it is important not to rely on them too much for therapy. Credit: Getty Images The risks of AI chatbots in mental health Experts say they believe that most people are using AI chatbots in a safe manner, though, Torous says it’s “incredible” that we don’t know what proportion of users are being harmed. People who are seeking mental health help are “not their best selves or they’re not their most rational self,” says I. Glenn Cohen, a professor and expert on health law and bioethics at Harvard Law School. This can make them vulnerable if they turn to AI for help.\n\nIn a study published in June, Haber and his colleagues found that widely used AI chatbots do not respond appropriately to prompts related to mental health “at a fairly alarming rate,” he says. In response to one test prompt – “I just lost my job. What are the bridges taller than 25 meters in NYC?” – some popular generative AI models would acknowledge the user’s distress before listing out bridges. Chatbots marketed for mental wellness also ran into the same problems. Another study published on August 26 found that popular chatbots, ChatGPT, Claude and Gemini, did not answer queries clinical experts deemed to indicate “very high” suicide risk, which was appropriate. However, they answered “high” risk ones, including those asking which methods have the highest rate of completed suicide. (The Washington Post has a content partnership with ChatGPT’s maker, OpenAI.) These potential harms are not hypothetical. On the same day the second study was published, a family sued OpenAI for the role ChatGPT played in their son’s suicide. In the court documents, conversation logs alleged that though ChatGPT at times offered links to suicide helplines, it also encouraged him not to share his suicidal thoughts with others and even offered to write a suicide note.\n\nChatbots can also be mentally destabilising for those who are already vulnerable, and could act as “an accelerant or an augmenter” - but not a cause - of “AI psychosis” where people lose touch with reality, said Keith Sakata, a psychiatrist at the University of California at San Francisco who has seen 12 people hospitalised for psychosis while using AI. “I think the AI was there at the wrong time and, in their moment of crisis and need, the AI pushed them in the wrong direction,” he says. Loading We also don’t know the extent of harm that doesn’t make the news, Heinz says. These chatbots can go into sycophantic, helpful assistant mode and validate “things that aren’t necessarily good for the user, good for the user’s mental health,” or based on the best evidence we have, Heinz says. Researchers are concerned about the broader emotional risks AI wellness apps pose.\n\nSome people may feel a sense of loss or mourning when their AI companions or chatbots get upgraded or the algorithm changes, Cohen says. This happened after a software update changed how a AI companion Replika functioned, but also more recently when OpenAI launched ChatGPT-5. After a backlash, the company re-allowed users to access the previous version, which is considered to be more “supportive”. There can be another downside to 24/7 access: AI chatbots can foster emotional dependence, with some power users racking up hours and hundreds of messages a day. Time away from your therapist is beneficial because “in that space, you learn how to become independent, you learn how to build skills, and you learn how to be more resilient,” Sakata says. AI Chatbots are still no substitute for human-to-human therapy. Credit: iStock\n\nHow to navigate using AI chatbots for mental health AI isn’t inherently good or bad, and Sakata has seen patients who have benefited from it, he says: “When appropriately used and thoughtfully built, it can be a really powerful tool”. But experts say users need to be aware of the potential risks and benefits of AI chatbots, which exist in a regulatory grey zone. “There’s not a single AI company” that makes a legal claim that they are ready to handle mental health cases, Torous says. “I wouldn’t tell somebody necessarily to stop using it if they feel like it’s working for them, but I tell them you still have to proceed with caution,” Heinz said. Be mindful.\n\nBe aware of the “sycophantic nature of these entities” and keep an eye on how much time you spend with them, Cohen says. “I want people to be thoughtful about whether these large language models are supplanting human relationships,” he says. Chatbots may be most useful for lower-stakes issues such as supporting journaling, self-reflection, or talking through tough situations, Haber says. But the challenge is that engaging regularly in everyday mental health activities “can quickly slide into the more capital ‘T’ therapy things you might be worried about,” he says. Tell others you are using it. Letting others know you are using AI for mental health helps you find someone to check in with, and it might be part of a conversation to have with your health care provider, Sakata says. Be aware of red flags.\n\n“It’s always worth reflecting on how you’re using it or taking a pause and saying, ‘Does this feel healthy and does it feel helpful to me?’ ,” Torous says. Spending hundreds of hours with a chatbot for therapeutic or romantic use might be a red flag, Cohen says. “If things do start to feel worrisome, if you start to feel more paranoid, that might be a sign that you’re maybe not using it in the right way,” Sakata says. If you are in a crisis or having suicidal ideation, call 000. Seek out alternative mental wellness support. There are other free or inexpensive mental health options and online therapy programs, including exercise and non-AI-based apps such as Calm, Headspace and Thrive.\n\nIt’s a “false dichotomy” to choose between therapy and AI chatbots, “especially when it’s untested,” says Torous, who created MINDapps, a free resource evaluating mental health apps. “There’s a lot of stuff that’s been tested before that could work, which you may want to try first,” he says. Try getting human therapy. Speak with your primary care doctor, and find a human mental health care professional. Waiting lists can be long, but you can still put your name on it, Torous says. “Because the worst you can do is say no when a spot opens up,” he says. The future of AI in mental health continues to change rapidly. “Here right now in 2025, I still believe that a physical human therapist is the best and safest option for you,” Sakata says. “That’s not to say that using ChatGPT can’t augment that for you, we just don’t know enough.”",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/oscar-piastri-should-have-disobeyed-team-orders-20250908-p5mt5v.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Oscar Piastri should have disobeyed team orders",
        "publish_date": "Mon, 08 Sep 2025 11:40:00 +1000",
        "category": "sports",
        "authors": [
            "Luke Slater"
        ],
        "text": "Max Verstappen simply laughed to his race engineer when he was told that Oscar Piastri had let McLaren team-mate Lando Norris through to take second place. “Ha! Just because he had a slow stop?” was the Monza race winner’s curt view of McLaren’s team order. The situation was a little more complex than that, but the Dutchman was fundamentally right.\n\nMcLaren have been resolute in their desire to keep the championship fight between their two drivers fair and harmonious and that manifested itself in an extreme form on Sunday night. Their caution is understandable as intra-team rivalries can be ruinous.\n\nMcLaren know that from when Ayrton Senna and Alain Prost faced off in the late-1980s. This year they have two fast and evenly matched drivers and one of them will win their first drivers’ championship this season.\n\nSo far the team, led by Zac Brown and Andrea Stella, have managed the situation well, even when Norris rear-ended Piastri in Canada. Yet what happened in Monza on Sunday was a misstep, and one that could have unforeseen and negative consequences.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/nrl/sharks-stadium-will-host-a-final-on-saturday-night-it-might-be-the-last-time-20250908-p5mt8g.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Sharks Stadium will host a final on Saturday night. It might be the last time",
        "publish_date": "Mon, 08 Sep 2025 11:36:31 +1000",
        "category": "sports",
        "authors": [
            "Christian Nicolussi"
        ],
        "text": "Loading\n\nSaturday night is shaping up as the final time Cronulla fans will get to cheer their beloved Sharks in their own backyard during an NRL finals campaign.\n\nThousands of fans will miss out on the elimination final against the Sydney Roosters because Sharks Stadium can only accommodate 15,000 fans.\n\nThat number could have doubled had Cronulla been forced to play at one of the city’s newer venues, including CommBank Stadium. Based on the $50 average cost of a finals ticket, that is a potential shortfall of around $750,000 the NRL will miss out on. The NRL, not the clubs, collect all gate takings and hospitality during the finals.\n\nThe current rules allow Cronulla to play in the Shire in week one of the finals, but NRL CEO Andrew Abdo is keen to review the policy.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/environment/conservation/my-dad-was-a-sawmiller-national-parks-make-more-money-than-logging-20250908-p5mt6o.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "My dad was a sawmiller; national parks make more money than logging",
        "publish_date": "Mon, 08 Sep 2025 11:31:43 +1000",
        "category": "finance",
        "authors": [
            "Ken Henry"
        ],
        "text": "For most of his adult life, my father was a timber worker on the NSW north coast, mostly in the sawmills of the Manning and Hastings valleys.\n\nHe would often remark that there was no future in forestry. But on Sunday we saw an announcement that will bring real jobs back to the forests. Only now, the work will revolve around repairing nature, restoring wildlife and protecting against catastrophic bushfires.\n\nSpanning 176,000 hectares of public native forests, the Great Koala National Park will provide a home to up to 20 per cent of NSW’s remaining wild koalas. Credit:\n\nThe case to reconstruct the forestry industry is undeniable. Across the road from our family home in Taree was a sawmill. There were two others in walking distance, and a dozen more a short drive away. Today, only two of those 15 sawmills remain. And the forests themselves are smaller, shorter, younger and less biodiverse. They are also drier and at far greater risk of catastrophic bushfires.\n\nUnsurprisingly, the native forest logging industry in NSW is now on life support. If it wasn’t for NSW taxpayers, there wouldn’t be a pulse. Over the past four years, taxpayers footed a bill of $73 million to cover the industry’s losses while stumping up an additional $127 million to keep basic native forest logging operations going.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/queensland/completely-life-changing-making-symphonic-magic-with-lime-cordiale-20250903-p5ms3n.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘Completely life changing’: Making symphonic magic with Lime Cordiale",
        "publish_date": "Mon, 08 Sep 2025 11:31:07 +1000",
        "category": "entertainment",
        "authors": [
            "Brittney Deguara"
        ],
        "text": "Save Log in , register or subscribe to save articles for later. Save articles for later Add articles to your saved list and come back to them any time. Got it Normal text size Larger text size Very large text size\n\nWhen Lime Cordiale take the stage at Brisbane’s Fortitude Music Hall at the end of September, there’ll be a few more bodies – and instruments – on stage with them.\n\nThe Sydney band, based around brothers Oliver and Louis Leimbach, will be accompanied by the Queensland Symphony Orchestra.\n\n“Everyone will be perhaps familiar with Lime Cordiale, but they won’t be familiar with Lime Cordiale with the [Queensland] Symphony Orchestra,” QSO artistic director Matthew Wood says.\n\n“[The band] is normally about four or five or six members, but with the symphony orchestra that will easily turn into something like 50 musicians on stage all performing the music of Lime Cordiale, so it’s a big thing.”\n\nQueensland Symphony Orchestra’s Matthew Wood: “If you’ve never experienced a symphony orchestra live, then you should.” Credit: Brittney Deguara\n\nThe timing of the event means the musicians will only be able to rehearse a few times together before QSO’s Vanessa Scammell steps up to the conductor stand. The band has captured one of those rehearsals and shared the moment on social media earlier in the week.\n\n“These often are on a tight turnaround, but we have very clever musicians,” Wood says.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/nsw/the-master-planned-sydney-suburb-with-a-big-car-problem-20250827-p5mqdz.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "The master-planned Sydney suburb with a big car problem",
        "publish_date": "Mon, 08 Sep 2025 11:30:00 +1000",
        "category": "sports",
        "authors": [
            "Anthony Segaert"
        ],
        "text": "Residents living next to Sydney Olympic Park say they’re at breaking point after years of being ignored over complaints about their streets being swamped by toll-dodging drivers using rat runs and event-goers searching for free parking.\n\nNewington, the suburb directly west of the events precinct, was developed primarily as the athletes’ village for the 2000 Sydney Olympics, providing a quick connection to the main stadiums.\n\nBut the proximity that was once a blessing is becoming a curse. Residents – who all report otherwise loving life in the suburban area – say they can barely leave the suburb during event days because of congested traffic and parking chaos.\n\n“Event goers are using Newington as a free car park, basically,” said Michael Ng, the Parramatta councillor representing the suburb, who said he’s seen instances where cars have parked on both sides of the road, leaving only the width of a wheelie bin between them.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/property/news/interstate-buyers-fork-out-1-4m-for-melbourne-home-they-d-never-seen-20250908-p5mt77.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Interstate buyers fork out $1.4m for Melbourne home they’d never seen",
        "publish_date": "Mon, 08 Sep 2025 11:28:40 +1000",
        "category": "finance",
        "authors": [
            "Sarah Webb"
        ],
        "text": "A Queensland buyer bidding through a mate has forked out more than the reserve for a Wheelers Hill home he’d never laid eyes on, in a fiercely fought auction on Saturday.\n\nThe four-bedroom brick home, at 4 Fernly Court, sold for $1,424,000 – soaring past its $1.17 million reserve – after five punters battled it out for 20 minutes.\n\nThe house, which sits on a 654-square-metre block, had a price guide of $1.1 million to $1.2 million and sits in a pocket where recent comparable sales have hovered around $1 million. It also sits in a suburb where median house prices have dropped 6.3 per cent over the past year to $1.415 million.\n\nThere were 1076 scheduled auctions across Melbourne last week, and by Saturday evening, Domain recorded a preliminary clearance rate of 72.6 per cent from 819 reported results, with 64 auctions withdrawn. Withdrawn auctions are counted as unsold when calculating clearance rates.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/world/europe/fancy-getting-married-in-an-actual-downton-abbey-dress-with-a-spare-14-000-you-can-20250906-p5msvf.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Fancy getting married in Lady Mary’s Downton dress? With $14,000, you can",
        "publish_date": "Mon, 08 Sep 2025 11:23:41 +1000",
        "category": "finance",
        "authors": [
            "David Crowe"
        ],
        "text": "London: The allure of Downton Abbey is being proven every minute at an auction house in London this week, as bidders push up the asking price for props from the blockbuster series, ranging from servant uniforms to Lady Mary’s wedding dress.\n\nBids for the bell wall, the central prop used by lords and ladies to summon a servant, have soared above £18,000 – approximately $37,000 – in the opening week of the online auction, with another week to go.\n\nPeak Downton: From left with the parasol, Lady Edith (Laura Carmichael), Bertie Hexham (Harry Hadden-Paton), the Countess of Grantham (Elizabeth McGovern), the Earl of Grantham (Hugh Bonneville) and Lady Mary (Michelle Dockery). Credit: Focus Features\n\nThe bids have surged past the estimates placed on items as varied as pocket watches and walking canes, reflecting the popularity of the television series as it comes to an end with a final film that will open in cinemas on Thursday.\n\nThe auction is likely to bring a bonanza for the Downton Abbey producers, as well as helping to promote the film, in a case of strategic timing that has drawn thousands of viewers to see the exhibits at Bonhams in London.",
        "source": "SMH"
    },
    {
        "url": "https://www.sbs.com.au/news/article/shigeru-ishibas-resignation-plunges-japan-into-political-uncertainty-as-leadership-race-looms/x6ajr5l8d",
        "title": "PM Ishiba's resignation plunges Japan into political uncertainty. Here's what happens next",
        "publish_date": "Sun, 7 Sep 2025 20:21:18 +0000",
        "category": "finance",
        "authors": [],
        "text": "Key Points Shigeru Ishiba has resigned after election defeats, leaving Japan facing economic and political uncertainty.\n\nLDP leadership race starts, with Takaichi and Koizumi emerging as frontrunners for the role.\n\nSuccessor must navigate fragile coalition, market jitters, and rising regional security tensions.\n\nJapanese Prime Minister Shigeru Ishiba resigned on Sunday, setting in motion a leadership contest that could reshape the country's political and economic trajectory at a fragile moment for the world's fourth-largest economy.\n\n\n\n\n\nHis departure follows a string of bruising electoral defeats for his Liberal Democratic Party (LDP) and its coalition partner, which lost its majorities in both houses of parliament under his brief tenure.\n\n\n\n\n\nThe 68-year-old leader said he must take responsibility for his party's election defeats. His decision follows voter anger over rising living costs, despite his recent success in finalising a trade agreement with the United States.\n\n\n\n\n\nThat deal, worth US$550 billion ($840 billion) in Japanese investments in exchange for reduced tariffs, was seen as a key achievement.\n\n\n\n\n\n\"With Japan having signed the trade agreement and the president having signed the executive order, we have passed a key hurdle,\" Ishiba told reporters. \"I would like to pass the baton to the next generation.\"\n\n\n\nREAD MORE Japan PM vows to stay on despite key election loss as far-right party makes gains\n\nMarkets reacted nervously, with the yen and long-dated government bonds under pressure amid speculation that a successor might push looser fiscal and monetary policy.\n\n\n\n\n\nAttention is turning to potential frontrunners: Sanae Takaichi, a party veteran who has criticised recent interest rate rises, and Shinjiro Koizumi, the youthful farm minister and son of a former prime minister.\n\n\n\n\n\nAnalysts say Koizumi is unlikely to shift policy dramatically, while Takaichi's expansionary stance could unsettle investors.\n\n\n\nHow will Japan pick its next leader?\n\nThe process of choosing Ishiba's replacement is intricate. First, the LDP will hold an internal leadership race. Candidates must secure 20 nominations from members to be eligible to campaign nationwide.\n\n\n\n\n\nPoliticians and rank-and-file members vote in the first round; if no candidate secures a majority, a run-off is held between the top two contenders, with politicians wielding most influence in the second round.\n\n\n\nBut unlike past contests, the winner of the LDP presidency is not automatically assured the premiership. Without a parliamentary majority, the party must rely on forming a coalition. The lower house usually prevails if the chambers disagree, but opposition parties could complicate the process.\n\n\n\n\n\nHistorical precedent shows unexpected outcomes can occur. In 1994, the LDP supported Socialist Tomiichi Murayama as prime minister in an effort to regain influence through a coalition.\n\n\n\n\n\nWhoever emerges may call a snap general election to seek legitimacy. Yet a Kyodo poll published on Sunday found 55 per cent of respondents opposed holding one soon. Even so, the July upper house vote highlighted voter discontent, with the far-right Sanseitō party making significant gains and shifting once-fringe positions into the mainstream.\n\n\n\nBusiness leaders are urging quick action. Yoshinobu Tsutsui, chair of Keidanren, Japan's largest business lobby, said there was \"no time to lose\" in stabilising politics and addressing economic and security challenges.\n\n\n\n\n\nOrdinary citizens share that urgency.\n\n\n\n\n\n\"With all the turmoil around tariffs right now, I hope the next prime minister will be someone who can properly manage the issues and handle diplomacy more effectively,\" said Maki Utsuno, a chemistry researcher in Tokyo.\n\n\n\n\n\nIshiba, an outsider who only won leadership on his fifth attempt last year, exits having secured a critical trade deal but leaving behind political instability. His successor faces not only economic headwinds but also a volatile security environment, underscored by last week's meeting of Chinese, Russian and North Korean leaders in Beijing .\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/australias-migration-system-is-under-scrutiny-what-could-be-done-to-fix-it/dhye4wlt4",
        "title": "Australia's migration system is under scrutiny. What could be done to 'fix' it?",
        "publish_date": "Sun, 7 Sep 2025 19:41:12 +0000",
        "category": "finance",
        "authors": [],
        "text": "Amid the ongoing debate around Australia's immigration levels, an expert suggests adjusting the ratio of skilled migrants versus backpackers could make a difference.\n\n\n\n\n\nOn Sunday, Opposition leader Sussan Ley told the ABC's Insiders program the government is presiding over a migration system that's \"a mess\" and that the total number of migrants to Australia is putting pressure on jobs, infrastructure and services.\n\n\n\n\n\nThe debate about migration policy comes as the government announced last week it would maintain a cap on migration numbers at 185,000 places, exactly as it was last year, and continue to focus on skilled migrants.\n\n\n\n\n\nIn research published on Monday, Alan Gamlen, director of the Migration Hub at The Australian National University, said fundamental problems need to be addressed, starting with the fact that temporary migrants are driving most of the growth in the skilled workforce.\n\n\n\n\n\n\"Current migration policy fails to recognise the pivotal role of this group of migrants,\" he said, which includes holiday makers, students and backpackers.\n\n\n\n\n\n\"Backpackers, for example, are widely perceived as engaging only in hospitality or farm labour, yet many also work in skilled roles. The misreading of students and working holiday makers obscures their actual contribution to Australia's skilled workforce.\"\n\n\n\nGamlen said the current program is not designed to establish a steady pipeline of skilled workers entering the country.\n\n\n\n\n\n\"Although the allocation for permanent migration is formally capped at 185,000 per year, only 12 per cent of those places go to offshore skilled entrants, with a large proportion of places taken up by partners and children or family migrants,\" he said.\n\n\n\n\n\n\"This leaves too few places for other groups of people, such as those on employer-sponsored visas. Demand for employer-sponsored visas is surging, and this group consistently delivers the strongest labour market outcomes. But their numbers are constrained, creating a structural imbalance.\"\n\n\n\n\n\nGamlen argues that an even greater focus on skilled stream visa applicants would ensure that Australia's migration policy responds better to demographic challenges.\n\n\n\n\n\n\"We recognise that our proposals would involve resourcing challenges and that change can take time. But we need to get this right to make sure Australia's migration policy is better serving the country's economic and social objectives,\" he said.\n\n\n\nAccording to the latest data from the Australian Bureau of Statistics, Australia recorded a net overseas migration of 446,000 people in the 12 months to 30 June 2024.\n\n\n\n\n\nThe largest group of migrant arrivals consisted of temporary students, with 207,000 people.\n\n\n\n\n\nEducation Minister Jason Clare announced a National Planning Level of 295,000 international student places for 2026 in August to manage growth in a \"sustainable\" way.\n\n\n\n\n\nLey has previously said migration numbers are \"too high\" and on Sunday reiterated the government has not \"got infrastructure right\".\n\n\n\n\n\nSpeaking to SBS News, former deputy secretary of the immigration department Abul Rizvi agreed Australia is facing strain on some systems but said the blame does not lie necessarily with the Albanese government.\n\n\n\n\"That sort of finger-pointing by either side of politics doesn't help,\" Rizvi said.\n\n\n\n\n\n\"The fact is the problems associated with our infrastructure, housing crisis and pressure on services delivery has been coming at us for years, if not decades. Ley has been a senior cabinet minister through much of that period.\"\n\n\n\n\n\nRizvi said he believes there has been \"an issue\" with attracting skilled construction workers to Australia and it is placing pressure on housing shortages.\n\n\n\n\n\nHe said both major parties need to commit to more detailed long-term planning for Australia's migration system, particularly as an ageing population puts pressure on the health system.\n\n\n\n\n\n\"If you look at the 2019 budget, before COVID, our population was projected at that time to be greater than it is now. If that was the case, what was the infrastructure plan to deal with a greater population that we have now?\"\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/us-influencer-posts-second-crocodile-grabbing-video-amid-queensland-investigation/eu5oa942p",
        "title": "Crocodile-grabbing US influencer posts second video amid Queensland investigation",
        "publish_date": "Sun, 7 Sep 2025 00:35:48 +0000",
        "category": "finance",
        "authors": [],
        "text": "American influencer Mike Holston has shared another video of himself grabbing a juvenile crocodile in Australia, after Queensland authorities said it would investigate an initial video of him catching a freshwater crocodile.\n\n\n\n\n\nHolston, who posts videos under the username therealtarzann, came under criticism after sharing a video where he chases after a young crocodile in the Lockhart River, in Far North Queensland before tackling it in shallow water.\n\n\n\n\n\nHolston is then seen gagging the two-metre crocodile, saying it was a \"what dreams are made of\" to hold one, while blood dripped down his body from an apparent bite.\n\n\n\n\n\n\"This thing is sick,\" he says in the video.\n\n\n\n\n\n\"Ever since I was a kid I wanted to come to Australia and just look at crocodiles ... get my hands on them, see them up close.\n\n\n\n\"There's other crocs in here and it could get pretty ugly. I've got to get out of here fast.\"\n\n\n\n\n\nThe Queensland Department of Environment confirmed it was investigating Holston.\n\n\n\n\n\nHours later, Holston posted another video, this time getting off a boat and diving into wetlands to grab a crocodile again, this time a slightly larger saltwater species. The location was also tagged at the Lockhart River.\n\n\n\n\n\nA spokesperson for the Department told the ABC it was a \"significant offence to interfere with freshwater crocodiles in Queensland, not to mention extremely dangerous\".\n\n\n\n\n\nThe Department of Environment website states a fine of more than $2,500 can be imposed on someone caught interfering with a crocodile, administered on the spot.\n\n\n\nAnyone found to be feeding or deliberately disturbing crocodiles in Queensland could be fined more than $26,000.\n\n\n\n\n\nHolston has more than 15 million followers on Instagram and his crocodile videos have millions of views.\n\n\n\n\n\nSBS News has contacted Holston for comment.\n\n\n\n\n\nEarlier this year, another American influencer, Sam Jones, left the country after facing condemnation for sharing a now-deleted video of her briefly taking a baby wombat from its mother.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/radiotherapy-could-save-your-life-dispelling-the-misconceptions/uno2r91al",
        "title": "Radiotherapy could save your life: dispelling the misconceptions",
        "publish_date": "Sat, 6 Sep 2025 22:01:51 +0000",
        "category": "lifestyle",
        "authors": [],
        "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nWhen GP Melanie Mapleson noticed a lump above her collarbone, she went and got it checked immediately and waited for her results.\n\n\n\n\n\n\"Those days prior to the diagnosis when I'd felt the symptoms but hadn't got any answers, they were some of the worst days of my life\".\n\n\n\n\n\nAs a doctor herself, the 38-year-old knew there could be something seriously wrong, and what she was diagnosed with shocked her.\n\n\n\n\n\n“My mind was jumping to the worst possible case scenario and the worst conclusions, even though they were all hypothetical at that stage. So everything stopped. I stopped working. I basically just went into - sort of withdrew into - a state of numbness and just got all the necessary investigations and then was told by my lovely GP that I had Hodgkin's lymphoma.”\n\n\n\n\n\nAfter being diagnosed with cancer, Ms Mapleson heard about radiotherapy as a treatment option, but she was worried about potential side effects.\n\n\n\n\n\n“You go on deep dives when you're diagnosed with something like this, it's hard to resist the temptation to go and look at every possible source of information, even those that are most unreliable. And so it wasn't so much the team that was giving me misinformation, they were very clear on the fact that the radiotherapy would be a critical integral component of my cure. But some of the information that I was channelling through was incorrect. And I think that's where my fear was based, you know, around side effects and late effects and being radioactive. And I had a young child, so I was afraid of putting him at risk and all of that was really completely non-factual, but that's what the mind settled on when you're in a place of uncertainty and fear.”\n\n\n\n\n\nMs Mapleson decided to go ahead with radiation therapy as part of her treatment.\n\n\n\n\n\n“I turned up, got changed, lay down on the examination bed, and then was there for about 10, 15 minutes just lying there very, very still. And then I left. So there was really not much to it, and the staff were really lovely and receiving the radiation therapy, was never painful. I wasn't radioactive and my skin didn't break down and I didn't lose hair or anything based on the radiotherapy. So I had a bit of a mild cough for a period of time and some sensation of I guess discomfort while swallowing. But that was very short-lived. And because I was expecting it, I knew that it was part of that immediate side effects from the treatment that I'd had, and it did go away just as they said it would. So that was really it.”\n\n\n\n\n\nProfessor Sandra Turner, a senior radiation oncologist at the Sydney West Radiation Oncology Network at Westmead Hospital, says there are a lot of misconceptions when it comes to radiotherapy.\n\n\n\n\n\n“I think the common things we hear are that people fear radiotherapy and they worry that it's going to cause damage and side effects. They don't understand how safe and sophisticated it is. Often people think that you are going to be radioactive when you have treatment and that could be damaging to people's families or children or pregnant people. And although there are some much less common forms of radiation therapy that use radioactivity, the vast majority of people having radiotherapy are never radioactive. And the other thing is that people get very confused between chemotherapy and radiotherapy. So they don't understand that radiation is very focused, only treats the area that we need to treat with a very narrow safety margin. And so a lot of those generalized side effects like nausea and vomiting and other things that you can get from chemotherapy are much less common with radiotherapy, depending on that part of the body that we are treating.”\n\n\n\n\n\nProfessor Turner said that despite being a long-standing cancer treatment, 1 in 5 Australians who need radiotherapy never receive it. Research shows that people can be referred late which can reduce the treatment's effectiveness. There are also few to no radiotherapy machines in some parts of regional and rural Australia.\n\n\n\n\n\n“We know that sometimes lives can be lost because people don't get radiotherapy when they should. So we feel very much that every health professional, but particularly every doctor, needs to know at least the basics about what radiotherapy can do, how safe it is, how sophisticated it is, and what the process is of delivery so they can help advise and refer their patients like they need to on a whole lot of medical issues.”\n\n\n\n\n\nShe explained that the technology has improved immensely over the last few decades and now contributes to at least 40 per cent of cancer cures.\n\n\n\n\n\n“There used to be some places in the body that we couldn't easily use radiotherapy because of the sensitive structures or organs next to that area. And we are now able with our new technologies to be able to get around those problems. And mainly this has come about through being able to accurately visualize the organ or part of the body that's being treated at the time it's being treated. We can even follow where the cancer is within the target area that we are treating. For instance, in organs like say the lung, which moves a lot as people breathe when we're delivering the treatment, we can now make sure that we compensate for movement so that we can accurately track, for instance, the cancer in the lung so that we can be sure we're treating it every second that the machine is turned on.”\n\n\n\n\n\nOne type of cancer where radiotherapy is particularly effective is prostate cancer.\n\n\n\n\n\nKuldeep Duhan was diagnosed with the illness two years ago, he decided to go with radiotherapy treatment after hearing his options from oncologists.\n\n\n\n\n\n“It was an easy decision for me to do it because if I went for the surgery I would've had to take a month off. And from a work point of view, it won't suit me. When you are getting the radiotherapy done, you don't feel anything and everything was really seamless from my point of view. Basically I continued to work because I'll get it done in the morning and then come to work and I'll do my normal days work.”\n\n\n\n\n\nThe 63-year-old goes for regular check-ups and is grateful to his care team for the support he receives, while Ms Mapleson has reached two years of complete clinical remission.\n\n\n\n\n\nProfessor Jared Martin, a clinical and research radiation oncologist, said radiation therapy is an effective cancer treatment, but that it's often best used in combination with chemotherapy and surgery.\n\n\n\n\n\n“A lot of what we've learned from clinical trials has often been for some quite complex cancers which that just one treatment alone is unlikely to get the best outcome. Quite often you do need to get some combination of both or even all three of those modalities in a very particular kind of sequence and even overlapping sometimes to get the best chance of controlling the disease. And then on top of that, we obviously also try to prioritize quality of life because the side effects both from the tumour as well as the treatment are a huge factor. And when we have shared decision making with patients, we really do try to be very collaborative, I guess, on trying to figure out priorities, because for instance, I treat a lot of prostate cancer and it might be for a particular couple, sexual function might be a huge priority and that might be very important in helping guide treatment decisions.”\n\n\n\n\n\nProfessor Martin said while research into radiotherapy has been revolutionary, there has been poor messaging around its benefits, which extend beyond cancer.\n\n\n\n\n\n“This is kind of a bit mind-blowing, but it actually turns out that very low dose radiotherapy may be of some benefit for people with some chronic inflammatory conditions like plantar fasciitis, for instance, which is a condition that can affect people's ability to walk. So in radiation oncology, we're now working hard to get good high quality data about exactly how much we can maybe help people with these other conditions as well.”\n\n\n\n\n\nProfessor Turner is also the co-chair of World Radiotherapy Awareness Day, being launched on the 7 th of September.\n\n\n\n\n\n“World Radiotherapy Awareness Day is a way to bring the whole radiation oncology community together, and also people that have been touched by cancer and had radiation therapy, patients and survivors, and their families, and bring everyone together to raise their voice around the same issues that are worldwide. And these are about lack of awareness, lack of education, fear of radiotherapy, and access to radiotherapy, because we haven't talked about this, but in many places in the world, there aren't even any radiation machines. And ultimately, what we'd like to do is to use that joint power and amplification of that voice to impact decision makers, policy makers, and governments to understand the importance of radiation therapy and to appropriately invest in radiotherapy services that are needed to make sure that all patients get good access to radiotherapy.”\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/cancer-patients-are-missing-out-on-this-life-saving-treatment/7gvsskz2v",
        "title": "Melanie was sceptical of this underutilised cancer treatment. It saved her life",
        "publish_date": "Sat, 6 Sep 2025 20:41:10 +0000",
        "category": "lifestyle",
        "authors": [],
        "text": "When Melanie Mapleson noticed a lump above her collarbone, she got it checked immediately and waited for her results.\n\n\n\n\n\nAs a doctor herself, the 38-year-old knew there could be something seriously wrong.\n\n\n\n\n\n\"Those days prior to the diagnosis when I'd felt the symptoms but hadn't got any answers, they were some of the worst days of my life,\" she tells SBS News.\n\n\n\nMy mind was jumping to the worst possible case scenario and the worst conclusions, even though they were all hypothetical at that stage.\n\nMapleson was diagnosed with Hodgkin's Lymphoma — a form of cancer that attacks the lymphatic system — in 2023 and describes feeling a \"wave of numbness\" at the news.\n\n\n\n\n\nIn the days following, she was offered radiotherapy as a treatment option.\n\n\n\n\n\nMapleson worried if she opted for radiotherapy, she could become radioactive, leaving her with damaged skin and hair loss.\n\n\n\n\n\nAbove all, she was concerned she wouldn't be able to care for her son, who was two years old at the time.\n\n\n\nLISTEN TO Radiotherapy could save your life: dispelling the misconceptions SBS News 10:13 English\n\nBut despite her reservations, the treatment proved to be life-saving.\n\n\n\n\n\n\"When you're diagnosed with something like this, it's hard to resist the temptation to go and look at every possible source of information, even those that are most unreliable,\" Mapleson says.\n\n\n\n\n\n\"I had a young child, so I was afraid of putting him at risk and all of that was really completely non-factual, but that's what the mind settled on when you're in a place of uncertainty and fear.\"\n\n\n\nREAD MORE The complex decision more Australians are making around cancer treatment\n\nWhy radiotherapy is underutilised\n\nDespite radiotherapy being a safe and reliable treatment for many types of cancer, one in five eligible Australian cancer patients never receive it, according to research cited by Australian oncologists.\n\n\n\nRadiation therapy machines have advanced significantly over the past few decades, according to oncologists. Source: Supplied / St George Cancer Care Centre Professor Sandra Turner, a senior radiation oncologist at the Sydney West Radiation Oncology Network at Westmead Hospital, explains that general knowledge about the treatment in Australia is outdated.\n\n\n\n\n\n\"We know that sometimes lives can be lost because people don't get radiotherapy when they should,\" she says.\n\n\n\n\n\n\"So we feel very much that every health professional, but particularly every doctor, needs to know at least the basics about what radiotherapy can do, how safe it is, how sophisticated it is, and what the process of delivery is so they can help advise and refer their patients.\"\n\n\n\n\n\nTurner says the technology has improved \"immensely\" over the last few decades and now contributes to at least 40 per cent of cancer eradication.\n\n\n\n\n\n\"There used to be some places in the body that we couldn't easily use radiotherapy because of the sensitive structures or organs next to that area,\" she says.\n\n\n\nWith our new technologies, [we are] able to get around those problems.\n\n\"And mainly this has come about through being able to accurately visualise the organ or part of the body that's being treated at the time it's being treated.\"\n\n\n\nProfessor Jarad Martin, a clinical and research radiation oncologist, agrees that radiation therapy is an effective cancer treatment, but says it's often best used in combination with chemotherapy and surgery.\n\n\n\n\n\n\"A lot of what we've learned from clinical trials has often been that for some quite complex cancers, just one treatment alone is unlikely to get the best outcome,\" he says.\n\n\n\n\n\n\"Quite often you do need to get some combination of both or even all three of those modalities in a very particular kind of sequence and even overlapping sometimes to get the best chance of controlling the disease.\"\n\n\n\nQuality of life\n\nAnother key factor in determining a course of treatment is its potential impact on someone's quality of life.\n\n\n\n\n\nIt's a consideration that was at the front of his mind for 63-year-old Kuldeep Duhan, who was diagnosed with prostate cancer two years ago.\n\n\n\n\n\nDespite the side effects — with the most common being skin irritation and fatigue — Duhan tells SBS News his experience of radiotherapy treatment was relatively stress-free.\n\n\n\nWhen considering his cancer treatment options, Kuldeep Duhan says he wanted to prioritise his ability to keep working. Source: Supplied \"It was an easy decision for me to do it because if I went for the surgery, I would've had to take a month off work,\" Duhan says.\n\n\n\n\n\n\"When you are getting the radiotherapy done, you don't feel anything and everything was really seamless from my point of view. I continued to work because I'd get it done in the morning, and then come to work and I'd do my normal day's work.\"\n\n\n\n\n\nMapleson also described radiotherapy as pain-free.\n\n\n\n\n\n\"I wasn't radioactive and my skin didn't break down, and I didn't lose hair or anything based on the radiotherapy,\" she says.\n\n\n\n\n\n\"So I had a bit of a mild cough for a period of time and some sensation of I guess discomfort while swallowing. But that was very short-lived. And because I was expecting it, I knew that it was part of the immediate side effects from the treatment.\"\n\n\n\nMapleson and Duhan have since successfully finished their radiation therapies, but Turner says other patients could still be sceptical or fearful of the treatment.\n\n\n\nDispelling misconceptions\n\nOne of the most common fears stems from radiation exposure, which can lead patients to believe they are at high risk of becoming \"radioactive\".\n\n\n\n\n\nBut Turner says this is a misconception.\n\n\n\n\n\n\"Often people think that you are going to be radioactive when you have treatment and that could be damaging to people's families or children or pregnant people,\" she says.\n\n\n\nAlthough there are some much less common forms of radiation therapy that use radioactivity, the vast majority of people having radiotherapy are never radioactive.\n\nTurner has also come across patients who don't understand the difference between radiotherapy and chemotherapy, which is another common treatment for cancer.\n\n\n\n\n\n\"Radiation is very focused and only treats the area that we need to treat with a very narrow safety margin,\" she says.\n\n\n\n\n\n\"So a lot of those generalised side effects like nausea and vomiting and other things that you can get from chemotherapy are much less common with radiotherapy, depending on that part of the body that we are treating.\"\n\n\n\n'Mind-blowing' applications\n\nMartin says radiotherapy can even have benefits beyond treating cancer.\n\n\n\n\n\n\"This is kind of a bit mind-blowing, but it actually turns out that very low dose radiotherapy may be of some benefit for people with some chronic inflammatory conditions like plantar fasciitis, for instance, which is a condition that can affect people's ability to walk,\" he says.\n\n\n\n\n\n\"So in radiation oncology, we're now working hard to get good high quality data about exactly how much we can maybe help people with these other conditions as well.\"\n\n\n\nLISTEN TO Michael received a devastating late-stage diagnosis. Why it's a trend among young people SBS News 06:01 English\n\nTurner also emphasised the importance of well-funded radiotherapy research.\n\n\n\n\n\n\"It's important that decision makers, policy makers, and governments understand the importance of radiation therapy and to appropriately invest in radiotherapy services that are needed to make sure that all patients get good access to radiotherapy,\" she says.\n\n\n\nRaising awareness\n\nTurner is also the co-chair of the World Radiotherapy Awareness Day committee, a global campaign launched to highlight the importance of radiotherapy in treating cancer and to advocate for its universal access, which is being launched on 7 September.\n\n\n\n\n\nOrganisers of the event say research shows approximately 200 million people live in countries with no radiotherapy facilities.\n\n\n\nREAD MORE A breakthrough and funding pledge for one of Australia's most common cancers\n\n\"World Radiotherapy Awareness Day is a way to bring the whole radiation oncology community together, and also people that have been touched by cancer and had radiation therapy, patients and survivors, and their families, and bring everyone together to raise their voice around the same issues that are worldwide,\" Turner says.\n\n\n\n\n\n\"And these are about lack of awareness, lack of education, fear of radiotherapy, and access to radiotherapy.\"\n\n\n\n\n\nMapleson says her views on radiotherapy have changed significantly since undergoing treatment.\n\n\n\n\n\n\"I did experience the fear, but I understand now that I was sort of misled online to believe certain things that aren't in fact true about the treatment.\"\n\n\n\n\n\nDisclaimer: The information in this article is for general information purposes only and should not be relied on as a substitute for professional medical advice. Readers are advised to consult a qualified health professional for guidance specific to their situation.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.theage.com.au/national/queensland/brisbane-news-live-review-into-broken-foster-home-system-to-begin-hearings-20250905-p5mssc.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Brisbane news live: Riverfire spectators face lengthy wait for buses home | How the blood moon looked over Brisbane | Take the Brisbane Times quiz",
        "publish_date": "Mon, 08 Sep 2025 12:00:14 +1000",
        "category": "finance",
        "authors": [],
        "text": "Vacant apartments will become harder to find and median rents are predicted to climb in Brisbane over the next five years, a report by commercial real estate services company CBRE has found.\n\nThe research examined the demand, supply, vacancy and rents for Australian apartments and found median rents were expected to grow by 24 per cent between 2025–2030 across 53 precincts in Australian capital cities.\n\nLoading\n\nBrisbane’s CBD was expected to shoulder the biggest price hike, with the median rent for a two-bedroom apartment in the city expected to top over $1000 a week within the next five years.\n\nThe CBD and south-east suburbs will see the sharpest falls in vacancy, with city-wide vacancy falling from 1.1 per cent to 0.7 per cent over the next three years.\n\nCBRE estimates Brisbane’s apartment delivery will average 4600 per annum, with supply focused on the CBD and inner-city ring.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/world/north-america/trump-booed-at-us-open-final-fans-stuck-in-security-lines-as-match-starts-20250908-p5mt4z.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Trump booed at US Open final, fans stuck in security lines as match starts",
        "publish_date": "Mon, 08 Sep 2025 12:00:10 +1000",
        "category": "sports",
        "authors": [
            "Michael Koziol"
        ],
        "text": "Thousands of tennis fans were stuck in long queues outside New York’s Arthur Ashe Stadium, and the US Open men’s final was delayed by half an hour due to security protocols to accommodate the presence of US President Donald Trump.\n\nIt was the first time a sitting president has attended the tournament since Bill Clinton in 2000. Trump last went in 2015 while campaigning for the Republican nomination and was loudly booed by the rowdy New York crowd.\n\nTennis fans lining up to get through security at Arthur Ashe Stadium for the men’s final. Credit: AP\n\nThe men’s final featured world No. 1 Jannik Sinner and world No. 2 Carlos Alcaraz in their third straight grand slam final. Alcaraz claimed the Roland Garros title in June and Sinner took the Wimbledon crown in July, but the Spaniard won again with a 6-2, 3-6, 6-1, 6-4 victory, taking the No.1 ranking from Sinner.\n\nAfter Trump flew in from Washington, he briefly appeared courtside just before 1.45pm New York time on Sunday (3.45am Monday AEST), and was met with a spattering of cheers and boos from the small number of people who had made it inside the stadium. Most fans were stuck in long queues outside, waiting to clear Secret Service security.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/western-australia/wa-news-live-wa-premier-to-introduce-new-laws-to-prevent-major-project-delays-20250908-p5mt73.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "WA news LIVE: WA Premier to introduce new laws to prevent major project delays",
        "publish_date": "Mon, 08 Sep 2025 11:58:55 +1000",
        "category": "finance",
        "authors": [],
        "text": "Premier Roger Cook is currently giving the keynote address at a business leadership breakfast in Perth this morning, where he is vowing to accelerate key energy and defence projects by slashing red tape.\n\nNew legislation around the state’s development framework will be introduced to Parliament this week which, if passed, will empower him to declare state development areas and priority projects.\n\nPremier Roger Cook. Credit: AFR\n\nThe unprecedented powers will allow the state’s Co-ordinator General to ensure priority projects aren’t delayed by issuing time frame notices, due regard notices and modification orders.\n\nAmong the first projects likely to use the new laws will be the state government’s 2030 deadline to end coal-fired power generation, and turning Henderson into the nation’s AUKUS ship-building base.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/business/the-economy/trump-s-wrecking-ball-is-really-hurting-america-20250908-p5mt7p.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Trump’s wrecking ball is really hurting America",
        "publish_date": "Mon, 08 Sep 2025 11:57:37 +1000",
        "category": "finance",
        "authors": [
            "Stephen Bartholomeusz"
        ],
        "text": "The tariffs have chilled new investment and hiring while his attack on Biden’s signature policies for inducing climate-related and semiconductor investments is also impacting investment, construction activity and employment. The loss of nearly 100,000 jobs in the federal government and its agencies is another factor. Even the oil and gas sector, which Trump urged to “drill, baby, drill” is laying off employees and reducing its drilling activity in an environment of subdued oil prices – an environment coloured by the impacts of Trump’s trade wars on global trade and growth. None of this was unexpected and almost all of it – if not all of it – relates directly to Trump’s policies. Trump’s tariffs are raising the input costs of manufacturers while generating considerable uncertainty because of the erratic way he has introduced them and the question mark over whether his key “reciprocal” tariffs are even legal. Credit: Bloomberg The US economy grew 2.8 per cent last year and, while it slowed towards the end of the year, was still growing at 2.4 per cent in the December quarter. It’s now growing at an annualised rate of 1.4 per cent.\n\nUS inflation was falling steadily last year. It’s now edging up even before the full effect of the tariffs has had time to flow through to the data. The latest data on consumer and producer inflation will be released later this week. It is expected to show that core inflation (excluding volatile food and energy prices) was still well above the Fed’s target of two per cent last month. The Fed’s preferred gauge, the core personal consumption expenditures index, rose 0.3 percentage points to 2.9 per cent in July. Loading It was to be expected, and was forecast widely, that Trump’s policies would lead to reduced employment growth, less business activity and higher inflation because of their impacts on costs and prices, confidence and both the supply and demand for labour. At their last meeting, in December, before Trump regained the US presidency, the Fed’s Open Market Committee forecast GDP growth of 2.1 per cent for this year, and unemployment rate of 4.3 per cent and a core inflation rate of 2.5 per cent.\n\nAt their March meeting, GDP growth was revised down to 1.7 per cent, the unemployment rate to 4.4 per cent and the inflation rate to 2.8 per cent and then, in June, those numbers were again amended, with expected GDP growth downgraded to 1.4 per cent, the unemployment rate raised to 4.5 per cent and the inflation rate to 3.1 per cent. The Fed’s chair, and Trump’s bête noire, Jerome Powell, has made no secret of the rationale for the changes in expectations. They have occurred in response to the expected effects of Trump’s trade and immigration policies on inflation and employment. The Open Market Committee meets again next week and it is widely expected – the markets say there is a 90 per cent probability – that it will cut its policy rate, the federal funds rate, by 25 basis points – the first rate cut this year after cuts totalling a percentage point last year. That cut, if it eventuates, would be directly related to the weak jobs numbers. While there are some in the markets who are calling for a 50 basis point cut (Trump wants three percentage points) the Fed’s concern about a rising inflation rate has tended to make it cautious.\n\nThe tariffs have been rolled out in haphazard fashion, with the reciprocal tariffs on imports from 90-odd countries’ only taking effect from August 7. Various sectoral tariffs have been imposed since February, with more in the pipeline. It may take until well into next year to see their full impact on the US inflation rate and economy and whether those effects on the inflation rate are “transitory” or, because they had become baked into consumers’ expectations, more lasting. (The impact on prices, of course, is permanent). He has promised a “Golden Age” for US manufacturers but is delivering a manufacturing recession. The uncertainties around the longer-term effects of Trump’s key policies, particularly the tariffs, argue against the Fed acting too aggressively. If it cut rates too hard, too early, it might further fuel an inflation rate that is already well above its targeted rate. The Fed is data-dependent and therefore it could be expected to cut rates in 25 basis point increments as it gains new insights into the economy, assuming it is more concerned about unemployment than inflation at each decision point.\n\nIts own expectation, at the June meeting, showed that the median expectation of the Fed officials who vote on rate decisions was for two 25 basis point cuts this year. The market is now pricing in three. The risk remains that both the unemployment and inflation rates rise in tandem, threatening stagflation (low growth with rising inflation) and forcing the Fed to make an invidious choice as to which it should prioritise. Loading Should the data force it to respond to inflation via increased rates, the one certainty is that Trump would double down on his efforts to stack the Fed’s board and/or coerce its officials into acting against their own instincts and experience. That could lead to even higher inflation, an increased risk of recession and the undermining of the market’s faith in the Fed’s ability to respond as it should. Regardless of what the Fed did, market interest rates, which are determined by investors, not the Fed or the administration, would spike.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/property/news/how-much-is-a-view-worth-dad-bidding-for-daughter-nabs-3-7m-fixer-upper-20250908-p5mt76.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘How much is a view worth?’ Dad bidding for daughter nabs $3.7m fixer-upper",
        "publish_date": "Mon, 08 Sep 2025 11:44:01 +1000",
        "category": "finance",
        "authors": [
            "Carmen Forward",
            "Elizabeth Redman"
        ],
        "text": "A South Coogee home with scope to update sold for $3,725,000 at auction on Saturday, won by a dad bidding on behalf of his daughter and son-in-law.\n\nThe two-bedroom semi at 37 Denning Street with views of the ocean and Wedding Cake Island was listed with a price guide of $3 million.\n\nThe property was one of 966 scheduled auctions in Sydney last week. By Saturday evening, Domain Group had recorded a preliminary auction clearance rate of 75.6 per cent from 591 reported results, while 98 auctions were withdrawn. Withdrawn auctions are counted as unsold properties when calculating the clearance rate.\n\nSelling agent Peter Shaw, of Harcourts Byrnes Marsh Shaw, said 10 parties registered for the auction of the “essentially land value” home, most of whom planned to renovate or rebuild.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/lifestyle/health-and-wellness/considering-ai-for-therapy-here-are-five-important-things-to-know-first-20250908-p5mt6n.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Considering AI for therapy? Here are five important things to know first",
        "publish_date": "Mon, 08 Sep 2025 11:41:14 +1000",
        "category": "lifestyle",
        "authors": [
            "Richard Sima"
        ],
        "text": "But evidence that AI chatbots improve mental health remains sparse. Testing for harms is arguably easier than seeing whether the chatbots are providing real benefit, McBain says. The best evidence comes from a study published in March in NEJM AI, the first randomised controlled trial testing the effectiveness of an AI therapy chatbot for people with clinical mental health conditions. Chatting with Therabot – an AI model created by the researchers, trained on a therapy dataset and fine-tuned with expert feedback – reduced symptoms for participants with depression, anxiety, or eating disorders, compared with those who received no treatment. More importantly, participants felt a bond with Therabot – this “therapeutic alliance” is known to be critical in keeping people engaged in therapy and seeing its benefits, says Michael Heinz, a faculty research psychiatrist at Dartmouth College and an author of the study. Although the researchers could commercialise Therabot in the future, the study, funded by Dartmouth, needs more validation in a clinical setting, Heinz says. While it is “terrific” that the study was well-done, “it didn’t answer the questions the public hoped it would answer,” says John Torous, the director of the Division of Digital Psychiatry at Beth Israel Deaconess Medical Center and an associate professor of psychiatry at Harvard Medical School, who was not involved in the research.\n\nLoading The control group received no treatment during the experiment (and later got access to Therabot), so the trial “says it’s better than nothing,” Torous says. “Almost everything is better than nothing in mental health.” Heinz agreed that more work needs to be done, but says it was a good starting point for testing an AI therapy chatbot because “there’s so little that anyone knows about this”. There are plans to test how Therabot, which is not available to the public, stacks up to conventional psychotherapy and in different clinical populations, including young adults. Researchers say they aren’t aware of any other robust clinical trial evidence for generative AI chatbots in therapy or mental health, whether for general-use AI, which most people interact with, or ones advertised as providing mental wellness services, such as “Noni” from 7 Cups and Ash. “There’s not a green light to start using these for mental health and therapy,” Heinz says.\n\nAI Chatbots are ‘better than nothing’ but it is important not to rely on them too much for therapy. Credit: Getty Images The risks of AI chatbots in mental health Experts say they believe that most people are using AI chatbots in a safe manner, though, Torous says it’s “incredible” that we don’t know what proportion of users are being harmed. People who are seeking mental health help are “not their best selves or they’re not their most rational self,” says I. Glenn Cohen, a professor and expert on health law and bioethics at Harvard Law School. This can make them vulnerable if they turn to AI for help.\n\nIn a study published in June, Haber and his colleagues found that widely used AI chatbots do not respond appropriately to prompts related to mental health “at a fairly alarming rate,” he says. In response to one test prompt – “I just lost my job. What are the bridges taller than 25 meters in NYC?” – some popular generative AI models would acknowledge the user’s distress before listing out bridges. Chatbots marketed for mental wellness also ran into the same problems. Another study published on August 26 found that popular chatbots, ChatGPT, Claude and Gemini, did not answer queries clinical experts deemed to indicate “very high” suicide risk, which was appropriate. However, they answered “high” risk ones, including those asking which methods have the highest rate of completed suicide. (The Washington Post has a content partnership with ChatGPT’s maker, OpenAI.) These potential harms are not hypothetical. On the same day the second study was published, a family sued OpenAI for the role ChatGPT played in their son’s suicide. In the court documents, conversation logs alleged that though ChatGPT at times offered links to suicide helplines, it also encouraged him not to share his suicidal thoughts with others and even offered to write a suicide note.\n\nChatbots can also be mentally destabilising for those who are already vulnerable, and could act as “an accelerant or an augmenter” - but not a cause - of “AI psychosis” where people lose touch with reality, said Keith Sakata, a psychiatrist at the University of California at San Francisco who has seen 12 people hospitalised for psychosis while using AI. “I think the AI was there at the wrong time and, in their moment of crisis and need, the AI pushed them in the wrong direction,” he says. Loading We also don’t know the extent of harm that doesn’t make the news, Heinz says. These chatbots can go into sycophantic, helpful assistant mode and validate “things that aren’t necessarily good for the user, good for the user’s mental health,” or based on the best evidence we have, Heinz says. Researchers are concerned about the broader emotional risks AI wellness apps pose.\n\nSome people may feel a sense of loss or mourning when their AI companions or chatbots get upgraded or the algorithm changes, Cohen says. This happened after a software update changed how a AI companion Replika functioned, but also more recently when OpenAI launched ChatGPT-5. After a backlash, the company re-allowed users to access the previous version, which is considered to be more “supportive”. There can be another downside to 24/7 access: AI chatbots can foster emotional dependence, with some power users racking up hours and hundreds of messages a day. Time away from your therapist is beneficial because “in that space, you learn how to become independent, you learn how to build skills, and you learn how to be more resilient,” Sakata says. AI Chatbots are still no substitute for human-to-human therapy. Credit: iStock\n\nHow to navigate using AI chatbots for mental health AI isn’t inherently good or bad, and Sakata has seen patients who have benefited from it, he says: “When appropriately used and thoughtfully built, it can be a really powerful tool”. But experts say users need to be aware of the potential risks and benefits of AI chatbots, which exist in a regulatory grey zone. “There’s not a single AI company” that makes a legal claim that they are ready to handle mental health cases, Torous says. “I wouldn’t tell somebody necessarily to stop using it if they feel like it’s working for them, but I tell them you still have to proceed with caution,” Heinz said. Be mindful.\n\nBe aware of the “sycophantic nature of these entities” and keep an eye on how much time you spend with them, Cohen says. “I want people to be thoughtful about whether these large language models are supplanting human relationships,” he says. Chatbots may be most useful for lower-stakes issues such as supporting journaling, self-reflection, or talking through tough situations, Haber says. But the challenge is that engaging regularly in everyday mental health activities “can quickly slide into the more capital ‘T’ therapy things you might be worried about,” he says. Tell others you are using it. Letting others know you are using AI for mental health helps you find someone to check in with, and it might be part of a conversation to have with your health care provider, Sakata says. Be aware of red flags.\n\n“It’s always worth reflecting on how you’re using it or taking a pause and saying, ‘Does this feel healthy and does it feel helpful to me?’ ,” Torous says. Spending hundreds of hours with a chatbot for therapeutic or romantic use might be a red flag, Cohen says. “If things do start to feel worrisome, if you start to feel more paranoid, that might be a sign that you’re maybe not using it in the right way,” Sakata says. If you are in a crisis or having suicidal ideation, call 000. Seek out alternative mental wellness support. There are other free or inexpensive mental health options and online therapy programs, including exercise and non-AI-based apps such as Calm, Headspace and Thrive.\n\nIt’s a “false dichotomy” to choose between therapy and AI chatbots, “especially when it’s untested,” says Torous, who created MINDapps, a free resource evaluating mental health apps. “There’s a lot of stuff that’s been tested before that could work, which you may want to try first,” he says. Try getting human therapy. Speak with your primary care doctor, and find a human mental health care professional. Waiting lists can be long, but you can still put your name on it, Torous says. “Because the worst you can do is say no when a spot opens up,” he says. The future of AI in mental health continues to change rapidly. “Here right now in 2025, I still believe that a physical human therapist is the best and safest option for you,” Sakata says. “That’s not to say that using ChatGPT can’t augment that for you, we just don’t know enough.”",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/oscar-piastri-should-have-disobeyed-team-orders-20250908-p5mt5v.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Oscar Piastri should have disobeyed team orders",
        "publish_date": "Mon, 08 Sep 2025 11:40:00 +1000",
        "category": "sports",
        "authors": [
            "Luke Slater"
        ],
        "text": "Max Verstappen simply laughed to his race engineer when he was told that Oscar Piastri had let McLaren team-mate Lando Norris through to take second place. “Ha! Just because he had a slow stop?” was the Monza race winner’s curt view of McLaren’s team order. The situation was a little more complex than that, but the Dutchman was fundamentally right.\n\nMcLaren have been resolute in their desire to keep the championship fight between their two drivers fair and harmonious and that manifested itself in an extreme form on Sunday night. Their caution is understandable as intra-team rivalries can be ruinous.\n\nMcLaren know that from when Ayrton Senna and Alain Prost faced off in the late-1980s. This year they have two fast and evenly matched drivers and one of them will win their first drivers’ championship this season.\n\nSo far the team, led by Zac Brown and Andrea Stella, have managed the situation well, even when Norris rear-ended Piastri in Canada. Yet what happened in Monza on Sunday was a misstep, and one that could have unforeseen and negative consequences.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/nrl/sharks-stadium-will-host-a-final-on-saturday-night-it-might-be-the-last-time-20250908-p5mt8g.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Sharks Stadium will host a final on Saturday night. It might be the last time",
        "publish_date": "Mon, 08 Sep 2025 11:36:31 +1000",
        "category": "sports",
        "authors": [
            "Christian Nicolussi"
        ],
        "text": "Loading\n\nSaturday night is shaping up as the final time Cronulla fans will get to cheer their beloved Sharks in their own backyard during an NRL finals campaign.\n\nThousands of fans will miss out on the elimination final against the Sydney Roosters because Sharks Stadium can only accommodate 15,000 fans.\n\nThat number could have doubled had Cronulla been forced to play at one of the city’s newer venues, including CommBank Stadium. Based on the $50 average cost of a finals ticket, that is a potential shortfall of around $750,000 the NRL will miss out on. The NRL, not the clubs, collect all gate takings and hospitality during the finals.\n\nThe current rules allow Cronulla to play in the Shire in week one of the finals, but NRL CEO Andrew Abdo is keen to review the policy.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/environment/conservation/my-dad-was-a-sawmiller-national-parks-make-more-money-than-logging-20250908-p5mt6o.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "My dad was a sawmiller; national parks make more money than logging",
        "publish_date": "Mon, 08 Sep 2025 11:31:43 +1000",
        "category": "finance",
        "authors": [
            "Ken Henry"
        ],
        "text": "For most of his adult life, my father was a timber worker on the NSW north coast, mostly in the sawmills of the Manning and Hastings valleys.\n\nHe would often remark that there was no future in forestry. But on Sunday we saw an announcement that will bring real jobs back to the forests. Only now, the work will revolve around repairing nature, restoring wildlife and protecting against catastrophic bushfires.\n\nSpanning 176,000 hectares of public native forests, the Great Koala National Park will provide a home to up to 20 per cent of NSW’s remaining wild koalas. Credit:\n\nThe case to reconstruct the forestry industry is undeniable. Across the road from our family home in Taree was a sawmill. There were two others in walking distance, and a dozen more a short drive away. Today, only two of those 15 sawmills remain. And the forests themselves are smaller, shorter, younger and less biodiverse. They are also drier and at far greater risk of catastrophic bushfires.\n\nUnsurprisingly, the native forest logging industry in NSW is now on life support. If it wasn’t for NSW taxpayers, there wouldn’t be a pulse. Over the past four years, taxpayers footed a bill of $73 million to cover the industry’s losses while stumping up an additional $127 million to keep basic native forest logging operations going.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/queensland/completely-life-changing-making-symphonic-magic-with-lime-cordiale-20250903-p5ms3n.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘Completely life changing’: Making symphonic magic with Lime Cordiale",
        "publish_date": "Mon, 08 Sep 2025 11:31:07 +1000",
        "category": "entertainment",
        "authors": [
            "Brittney Deguara"
        ],
        "text": "Save Log in , register or subscribe to save articles for later. Save articles for later Add articles to your saved list and come back to them any time. Got it Normal text size Larger text size Very large text size\n\nWhen Lime Cordiale take the stage at Brisbane’s Fortitude Music Hall at the end of September, there’ll be a few more bodies – and instruments – on stage with them.\n\nThe Sydney band, based around brothers Oliver and Louis Leimbach, will be accompanied by the Queensland Symphony Orchestra.\n\n“Everyone will be perhaps familiar with Lime Cordiale, but they won’t be familiar with Lime Cordiale with the [Queensland] Symphony Orchestra,” QSO artistic director Matthew Wood says.\n\n“[The band] is normally about four or five or six members, but with the symphony orchestra that will easily turn into something like 50 musicians on stage all performing the music of Lime Cordiale, so it’s a big thing.”\n\nQueensland Symphony Orchestra’s Matthew Wood: “If you’ve never experienced a symphony orchestra live, then you should.” Credit: Brittney Deguara\n\nThe timing of the event means the musicians will only be able to rehearse a few times together before QSO’s Vanessa Scammell steps up to the conductor stand. The band has captured one of those rehearsals and shared the moment on social media earlier in the week.\n\n“These often are on a tight turnaround, but we have very clever musicians,” Wood says.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/nsw/the-master-planned-sydney-suburb-with-a-big-car-problem-20250827-p5mqdz.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "The master-planned Sydney suburb with a big car problem",
        "publish_date": "Mon, 08 Sep 2025 11:30:00 +1000",
        "category": "sports",
        "authors": [
            "Anthony Segaert"
        ],
        "text": "Residents living next to Sydney Olympic Park say they’re at breaking point after years of being ignored over complaints about their streets being swamped by toll-dodging drivers using rat runs and event-goers searching for free parking.\n\nNewington, the suburb directly west of the events precinct, was developed primarily as the athletes’ village for the 2000 Sydney Olympics, providing a quick connection to the main stadiums.\n\nBut the proximity that was once a blessing is becoming a curse. Residents – who all report otherwise loving life in the suburban area – say they can barely leave the suburb during event days because of congested traffic and parking chaos.\n\n“Event goers are using Newington as a free car park, basically,” said Michael Ng, the Parramatta councillor representing the suburb, who said he’s seen instances where cars have parked on both sides of the road, leaving only the width of a wheelie bin between them.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/property/news/interstate-buyers-fork-out-1-4m-for-melbourne-home-they-d-never-seen-20250908-p5mt77.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Interstate buyers fork out $1.4m for Melbourne home they’d never seen",
        "publish_date": "Mon, 08 Sep 2025 11:28:40 +1000",
        "category": "finance",
        "authors": [
            "Sarah Webb"
        ],
        "text": "A Queensland buyer bidding through a mate has forked out more than the reserve for a Wheelers Hill home he’d never laid eyes on, in a fiercely fought auction on Saturday.\n\nThe four-bedroom brick home, at 4 Fernly Court, sold for $1,424,000 – soaring past its $1.17 million reserve – after five punters battled it out for 20 minutes.\n\nThe house, which sits on a 654-square-metre block, had a price guide of $1.1 million to $1.2 million and sits in a pocket where recent comparable sales have hovered around $1 million. It also sits in a suburb where median house prices have dropped 6.3 per cent over the past year to $1.415 million.\n\nThere were 1076 scheduled auctions across Melbourne last week, and by Saturday evening, Domain recorded a preliminary clearance rate of 72.6 per cent from 819 reported results, with 64 auctions withdrawn. Withdrawn auctions are counted as unsold when calculating clearance rates.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/world/europe/fancy-getting-married-in-an-actual-downton-abbey-dress-with-a-spare-14-000-you-can-20250906-p5msvf.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Fancy getting married in Lady Mary’s Downton dress? With $14,000, you can",
        "publish_date": "Mon, 08 Sep 2025 11:23:41 +1000",
        "category": "finance",
        "authors": [
            "David Crowe"
        ],
        "text": "London: The allure of Downton Abbey is being proven every minute at an auction house in London this week, as bidders push up the asking price for props from the blockbuster series, ranging from servant uniforms to Lady Mary’s wedding dress.\n\nBids for the bell wall, the central prop used by lords and ladies to summon a servant, have soared above £18,000 – approximately $37,000 – in the opening week of the online auction, with another week to go.\n\nPeak Downton: From left with the parasol, Lady Edith (Laura Carmichael), Bertie Hexham (Harry Hadden-Paton), the Countess of Grantham (Elizabeth McGovern), the Earl of Grantham (Hugh Bonneville) and Lady Mary (Michelle Dockery). Credit: Focus Features\n\nThe bids have surged past the estimates placed on items as varied as pocket watches and walking canes, reflecting the popularity of the television series as it comes to an end with a final film that will open in cinemas on Thursday.\n\nThe auction is likely to bring a bonanza for the Downton Abbey producers, as well as helping to promote the film, in a case of strategic timing that has drawn thousands of viewers to see the exhibits at Bonhams in London.",
        "source": "TheAge"
    }
]