[
    {
        "url": "https://www.9news.com.au/finance/nine-sells-radio-network-to-billionaire-publican/cc5eb8b6-501f-4970-81f3-16f6a85c54d9",
        "title": "Nine sells radio empire for $56 million",
        "publish_date": "Thu, 29 Jan 2026 22:23:37 +0000",
        "category": "finance",
        "authors": [
            "Jan"
        ],
        "text": "Nine Entertainment has sold its broadcast radio assets, including the top-rating talkback stations 2GB and 3AW, to Australian publican Arthur Laundy and his family for $56 million.\n\nThe sale, which includes 2GB, 3AW, 4BC, 6PR, 2UE, Magic1278 and 4BH, was announced to shareholders this morning among a number of changes to the media giant's strategy which also include acquiring outdoor media platform QMS Media for $850 million.\n\nNine, which is the publisher of this website, told shareholders that the sale to the Laundy Family Office is expected to be completed by the end of June this year and that Nine will remain a long-term partner of the radio stations.\n\nR EAD MORE: ﻿ Australian government 'monitoring' Nipah virus closely\n\nPublican Arthur Laundy and his family are purchasing the Nine Radio business. (Photo: Peter Rae/AFR) (Peter Rae)\n\n\"Laundy is expected to remain a long-term partner of Nine, with plans to utilise Nine News journalists on radio, showcase Stan Sport through Laundy venues, provide promotion and advertising sales collaboration, as well as increased advertising spend by Laundy on Nine properties,\" the release reads.\n\nNine this morning also announced it was buying leading digital ﻿outdoor media platform, QMS Media and converting regional television station NBN (Northern NSW) from a wholly-owned business to an affiliate, owned and operated by Nine's regional partner, WIN Network.\n\nNine Group chief executive officer Matt Stanton says the move positions the media giant well for the future.\n\n\"Today's announcements mark a critical milestone in our Nine2028 transformation. These transactions will create a more efficient, higher-growth, and digitally powered Nine Group for our consumers, advertisers, shareholders and people,\" he said.\n\n\"This positions Nine well for the future, enabling the group to withstand industry disruption and deliver long-term sustainable value to our shareholders.\"\n\nREAD MORE: ﻿ How Australian spy base could play role in US strike on Iran\n\nThe sale, which includes 2GB, 3AW, 4BC, 6PR, 2UE, Magic1278 and 4BH, was announced to shareholders this morning. (Janie Barrett)",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/elon-musk-is-betting-teslas-future-isnt-about-cars-at-all/b12bba27-6578-466b-ae7f-df17256c3e41",
        "title": "Elon Musk is betting Tesla's future isn't about cars at all",
        "publish_date": "Fri, 30 Jan 2026 01:32:18 +0000",
        "category": "finance",
        "authors": [
            "Jan"
        ],
        "text": "Tesla dominated the electric vehicle industry by the mid-2010s with sleek, fast cars that helped combat the public perception that EVs were severely limited by short ranges.\n\nNow the company, and its controversial Chief Executive, Elon Musk , face stiffer competition and political headwinds.\n\nIts EV sales fell by a record 9 per cent in 2025, amid increasing rivalry from China and the expiration of the US EV sales tax credit.\n\nIn November last year, Elon Musk offered a sneak peak of Tesla's Optimus robot. (Tesla Australia)\n\nBut Musk has been steering the company toward an audacious bet.\n\nHe believes Tesla's future won't ride on cars but on humanoid robots.\n\nOn Tesla's earnings call on Wednesday, Musk laid out a literal replacement of Tesla cars by robots – announcing Tesla would discontinue the Model S and Model X in favour of making more of its Optimus robots.\n\n\"We're gonna take the Model S and X production space in our Fremont factory and convert that into an Optimus factory, with the long-term goal of having one million units a year of Optimus robots in the current SX space in Fremont,\" he said.\n\nIt is the quintessential science-fiction dream of the future: Musk says Tesla's Optimus robots will do everything from cleaning your house to performing surgery.\n\nHe's called Optimus, the key to eliminating world poverty, making human work optional and reaching Mars .\n\nAnd he claims they'll be on sale by the end of 2027.\n\n\"Every human on earth is going to have their own personal R2-D2, C3PO,\" Musk said in November, referring to the personal robots from Star Wars .\n\n\"But actually, Optimus will be better than that.\"\n\nBut critics say these are fever-dream distractions from Tesla's core automotive business.\n\nAnd plenty of companies, like Boston Dynamics and Figure, are already deep into the humanoid robot business.\n\nMusk's own success and pay are directly at stake.\n\nTesla must deliver one million Optimus robots within 10 years for Musk to fully realise an almost $US1 trillion ($1.4 trillion) Tesla pay plan approved by shareholders late last year.\n\n\"Elon is a big thinker, and he wants to be pushing the edge of people's imagination,\" a former Tesla senior engineer told CNN in an interview.\n\nBut the EV and robot markets are very different, the engineer said.\n\n\"With electric vehicles, Tesla was really the only one working on this hard problem. There's a lot of companies now and tons of competition.\"\n\nMusk laid out a literal replacement of Tesla cars by robots. (Supplied)\n\n'Infinite money glitch'\n\nTesla first unveiled its humanoid robot project at a 2021 event, where a silvery figure danced to thumping techno music on a stage.\n\nIt was an actor in a robot suit, complete with a face that looked like a screen. \"Obviously, that's not real,\" Musk said as the costumed figure left the stage.\n\nJust months later, in January 2022, Musk said he thought Optimus could be \"more significant than the vehicle business\" for Tesla over time.\n\nTesla says Optimus can now sort objects, serve popcorn, throw out trash and dance.\n\nIt does \"some basic tasks in the factory,\" Musk said Wednesday, progress, but still a far cry from Musk's futuristic vision, even as he predicted Optimus could eventually generate $US10 trillion ($14 trillion) of revenue.\n\nYet Musk has set a speedy timeline for Optimus.\n\nAt the World Economic Forum this month, he said the robot will be available for sale by the end of 2027.\n\nIt is a lofty goal, one experts say may be tougher than Musk's bets on electric vehicles or SpaceX.\n\nREAD MORE: Melbourne nail salon firebombed twice in two days\n\nMusk has set a speedy timeline for Optimus. (AP)\n\nHumanoid robots are among the most complex machines imaginable, and the race to build them is already heating up.\n\nTesla is not the only company in this space.\n\nHyundai and Google DeepMind are also deploying their Atlas humanoid robot internally in the coming months before rolling it out to customers.\n\nMeanwhile, the CES tech show in January was full of companies, including Nvidia, Qualcomm and Intel, showing off humanoid robots powered by their chips and technologies.\n\nMore than 90 companies have a humanoid robot product, according to Ani Kelkar, a partner at McKinsey & Company who leads the firm's advanced automation and autonomy sector. More are coming, especially in the United States and China.\n\nExperts from McKinsey, Goldman Sachs and Morgan Stanley estimate the humanoid robot market could eventually be worth anywhere from $US370 billion ($524 billion) by 2040 to $US5 trillion ($7 trillion) by 2050.\n\nTesla does have critical advantages in its expertise in motors, batteries and mechanisms, said Ken Goldberg, a professor who supervises research in robotics and automation at the University of California, Berkeley.\n\n\"They also understand how to make something advanced in high volume – with cost effectiveness, and that's really important,\" Goldberg said.\n\nREAD MORE: Man kept alive for 48 hours with lungs removed\n\nMusk's commentary and support of US President Donald Trump have made him a polarising figure. (AP)\n\nThe company could also benefit from using Optimus internally and selling it externally, giving it a \"cost advantage\" that could enable Tesla to make \"several thousand dollars per robot,\" Goldman Sachs said in an October report.\n\nBut most experts agree it'll be at least a decade before humanoid robots are widely deployed.\n\n\"A giant leap may happen, but we don't know when,\" Goldberg said.\n\n\"Most technology develops as a slow burn over time, so I think the expectations about having fully general humanoids seems over-inflated.\"\n\nOthers are sceptical about whether humanoid robots will ever be broadly useful in society.\n\nBill Ray, an analyst following emerging technologies and robotics for market research firm Gartner, previously told CNN that humanoid robots face too many limitations to be practical.\n\nOptimus challenges\n\nMusk has swung big with timelines before – and missed. He previously said Tesla cars would be fully autonomous by 2018, and that SpaceX would start sending rockets to Mars by 2018 – neither of which has happened yet.\n\nAnd already with Optimus, Tesla has missed its leader's ambitious schedule. Musk had initially set internal goals for Tesla to produce at least 5000 Optimus units in 2025, according to The Information .\n\nThat goal was slashed to 2000 a few months later and has been lowered again since, The Information reported in October.\n\nTesla did not respond to CNN's request for comment.\n\nMusk has acknowledged that his goals are not easy.\n\n\"Right now, we're struggling with the final design of the hardware,\" especially of the arm and hand, Musk said at the All In Summit in September.\n\n\"Human-like hands are notoriously hard for robots to emulate. Unlike people, robots have a hard time knowing how to grip different objects like a wet glass versus a piece of metal.\n\n\"People think of space travel as extraordinarily difficult, and it is, no doubt, but it turns out that getting a robot to reliably tie a sneaker is harder than getting a rocket out of the atmosphere,\" Goldberg said.\n\nMusk's political commentary and support of US President Donald Trump have also made him a polarising figure, resulting in protests and vandalism at Tesla dealerships across the country.\n\nProtests and vandalism occured at Tesla dealerships across the country. (Getty)\n\nA man uses chalk to write messages on the side of a San Francisco Tesla store during a protest. (AP Photo/Noah Berger)\n\n\"If they won't buy his cars, why would they buy a huge robot for their home from him?\" posted Ross Gerber, an early Tesla investor and CEO of investment firm Gerber Kawasaki, who is now a prominent critic of Musk.\n\nMusk acknowledged the \"many who doubt our ambitions for creating amazing abundance\" on Wednesday's earnings call.\n\n\"But we're confident it can be done, and that we're making the right moves technologically to ensure that it does.\"\n\n\"And Tesla's obviously never been a company to shy away from solving some of the hardest problems,\" he added.\n\nBut Musk's version of the future won't happen instantly – and maybe not for a long time.\n\n\"Elon is a visionary, but he promises things that sometimes may take more time than his engineers can deliver,\" said Goldberg.\n\n\"The research community all over the world is working very hard on this, but it's not going to get solved overnight.\"",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/finance/interest-rate-hike-likely-finder-survey-found/508c05a1-f1f6-4be7-89b6-4cb89d7415cb",
        "title": "'Cold shower' for mortgage holders: Experts' gloomy rates' forecast",
        "publish_date": "Thu, 29 Jan 2026 20:28:51 +0000",
        "category": "finance",
        "authors": [
            "Jan"
        ],
        "text": "M﻿ortgage holders across Australia are likely to be hit with an interest rate hike next week, according to a survey of experts.\n\nMore than half the 33 economists and financial experts in the Finder Cash Rate Survey believe a sudden spike in inflation will force the Reserve Bank of Australia's hand when it announces its decision next Tuesday.\n\nNew inflation data released this week showed the trimmed mean, the RBA's preferred measure of ﻿underlying inflation , increased to 3.3 per cent and headline inflation shot up to 3.8 per cent in the year to December – both well outside the central bank's target band.\n\nMortgage holders are likely to be hit with an interest rate hike next week, experts forecast. (Photo by ROB HOMER SPECIAL 103506) (Rob Homer) (Nine)\n\nThe Finder research found 17 of those surveyed, or 51 per cent, believe the central bank will green-light a 0.25 per cent rise in the cash rate, raising it to 3.85 per cent﻿.\n\nThis is a marked turnaround from last December when only 9 per cent of experts in a Finder survey forecast a February rates lift.\n\nHead of Finder consumer research Graham Cooke says the big four banks and most economists are now backing a hike.\n\n\"This news will feel like a cold shower for homeowners after a brief reprieve.\n\n\"Many who refinanced or entered the market during the 2025 easing cycle may feel blindsided, as the pivot from falling to rising rates in just six months has created significant whiplash.\"\n\nREAD MORE: ﻿ How Australian spy base could play role in US strike on Iran\n\nAdding to the gloomy outlook, more than four in five experts who weighed in believe a rate cut in the next 12 months is unlikely.﻿\n\nHomeowners on the average home loan of $693,802 will see an annual increase of $1313 to their mortgage repayments if the RBA raises the cash rate by 0.25 per cent next Tuesday.\n\nOn a $1 million mortgage, the same hike would cost a homeowner nearly $1893 a year more in interest – a rise of $158.\n\nA rates rise next week would be the first in Australia since November 2023, and would follow the RBA's easing cycle that brought relief for mortgage holders. ﻿\n\nCooke says mortgage they should now scrutinise their interest rate with the easing cycle unlikely to restart again soon.﻿\n\n\"If your rate isn't one of the best, now might be a good time to give yourself a rate cut. Many banks will also throw in some cash for your trouble.\"\n\nNEVER MISS A STORY: Get your breaking news and exclusive stories first by following us across all platforms.\n\nThe information provided on this website is general in nature only and does not constitute personal financial advice. The information has been prepared without taking into account your personal objectives, financial situation or needs. Before acting on any information on this website you should consider the appropriateness of the information having regard to your objectives, financial situation and needs.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/perth-rentals-deposit-scam-targets-desperate-renters/b505ff04-a476-4478-b248-eb903ddd5c20",
        "title": "'Exclusively only for you': Deposit scam targets desperate renters",
        "publish_date": "Thu, 29 Jan 2026 12:27:35 +0000",
        "category": "finance",
        "authors": [
            "Jan"
        ],
        "text": "Scammers are preying on desperate Perth renters struggling to get a roof over their heads.\n\nFake \"private landlords\" on Facebook Marketplace are promising listings below market price for a costly deposit.\n\nThey're posting real pictures of real properties to lure their victims, but the prices are often too good to be true.\n\nREAD MORE: Kids shelter on bus as cops open fire outside school\n\nThey're posting real pictures of real properties to lure their victims but the prices are often too good to be true. (9News)\n\nFinding a rental has never been this hard and WA Commissioner for Consumer Protection Trish Blake says it's a \"perfect playground for scammers\".\n\n\"[There's ]a lot of grooming by these scammers,\" she said.\n\n\"So they'll tell you that they're there to help the underdog and that you're the perfect person, they can see that you're a real battler, that you're a good person and they want to help you out.\"\n\nMessages show how the scammers take advantage of the high demand for rentals.\n\n\"Due to the large number of people making offers for the apartment and which I can not attend to all.. my lawyer mandated a commitment fee to secure the apartment and filter out many people to secure it down for one person,\" one message reads.\n\n\"You can have the space secured ahead of your move in date by paying a security deposit of the first week rent of $400.\n\nScammers are preying on desperate Perth renters struggling to get a roof over their heads. (9News)\n\n\"The deposit act more like a commitment fee which is fully refundable if upon physical visit you have a change of mind and it will be added to your first week rent if everything goes as planned.\n\n\"The deposit secure down the apartment for you and it will be reserved exclusively only for you.. I will stop taking offers for it and remove it from the Market.﻿\"\n\nBlake warned renters not to hand over any money before they'd seen the property.\n\nIn 2025, at least 20 people reported a rental scam, losing $50,000, an increase of 27 per cent compared to the year before.\n\nMedian rental prices in Perth are at record highs.\n\nREAD MORE: Aussie astronomers discover potentially habitable planet\n\nFake \"private landlords\" on Facebook marketplace promising listings below market price for a costly deposit. (9News)\n\nIt costs $700 per week for a house and $670 to rent a unit while properties are snatched up in just 16 days.\n\n\"People have pure desperation and people will do what they can for their family and think they're doing the right thing and potentially dealing with unsavoury characters,\" Real Estate Institute of Western Australia member Rob Mandanici said.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/health-heart-disease-scarlett-hack/4cdced4d-4b51-49c2-ad99-50246828200a",
        "title": "Scarlett had a shortness of breath. Years later, she was put on life support",
        "publish_date": "Thu, 29 Jan 2026 06:56:52 +0000",
        "category": "lifestyle",
        "authors": [
            "Jan"
        ],
        "text": "Scarlett Hack was just 10 years old when she started experiencing a shortness of breath and heart palpitations.\n\nHer symptoms were dismissed as anxiety, which she suffered with at the time, but her parents persisted and took her to several doctors before she was given an echocardiogram.\n\nShe was diagnosed with ﻿hypertrophic cardiomyopathy, a genetic heart condition where the muscle thickens.\n\nREAD MORE: ﻿ Australian astronomers discover potentially habitable planet\n\nScarlett Hack was diagnosed with two heart diseases. (Supplied)\n\n\"The heart disease was spontaneous in me. My entire family doesn't have any record of it, only me,\" she told 9news.com.au. ﻿\n\n\"After the doctor's appointment, my parents were told by the doctor, 'You should learn CPR as this has no cure'.\"\n\nHack's symptoms only worsened over the next three years until she was diagnosed with a second heart disease called ﻿arrhythmia burden disease - the time the heart spends in abnormal rhythm.\n\nShe fainted often, which caused her heart to stop each time, and eventually had an internal defibrillator installed.\n\nDuring a doctor's appointment, ﻿her heart started racing and she went into cardiac arrest.\n\n\"I was screaming to my dad, 'Don't let me die, don't let me die',\" she said.\n\n﻿\"It was very traumatising.\"\n\nScarlett was put onto life support. (Supplied)\n\nHack was in cardiac arrest for 40 minutes and then put on life support.\n\nHer parents had two choices: let her go or wait for a heart donor.\n\n\"I only had two weeks to get it. If not, I'd be declared brain dead,\" she said.\n\n\"On the eighth day, my parents got the call at 2am, and they had a heart for me, and then I went into surgery at 7am.\"\n\nNow aged 18, Hack ﻿is studying nursing so she can care for other children who may be in the same position she was in.\n\nNew data by the Heart Research Institute found 144,000 Australians are living with a deadly heart disease, which claims nine lives and causes 170 hospitalisations each day.\n\nOf those who survive heart failure, 65 per cent return to the emergency department within a year. ﻿\n\nREAD MORE: ﻿ Three things could save Aussies from looming interest rate hell\n\nNow 18, Scarlett is studying nursing. (Supplied)\n\nHeart Research Institute ﻿chief executive Andrew Coats said many people were unaware their heart was failing to pump blood and oxygen around the body as it should.\n\n\"Heart disease can affect any one of us,\" he said.\n\n\"For too many Australians, it strikes without warning, taking the lives of loved ones far too soon.\"\n\nPart of the issue is awareness.\n\nHack urged anyone with symptoms of heart disease to get themselves checked. ﻿\n\n\"There's no harm in you getting checked out by a doctor﻿,\" she said.",
        "source": "9News"
    },
    {
        "url": "https://www.abc.net.au/news/2026-01-30/calls-to-end-greyhound-racing-after-cannington-carnage/106287412",
        "title": "'Carnage' at Perth greyhound track prompts calls to end racing",
        "publish_date": "Fri, 30 Jan 2026 02:32:20 +0000",
        "category": "sports",
        "authors": [],
        "text": "Calls to end greyhound racing have intensified after a night of \"carnage\" at a Perth suburban race track that saw four dogs injured and two euthanased.\n\nRaces at the Cannington greyhound track were abandoned on Wednesday night after race seven of a scheduled 12, after the four dogs were injured, according to Racing and Wagering WA (RWWA).\n\nCanning Mayor Patrick Hall has urged the state government to \"read the room\" and set a date for transitioning the state away from greyhound racing.\n\n'Most deadly' greyhound track\n\n\"On Wednesday this week, absolute carnage out there, on a fine night, on a dry track,\" Cr Hall told ABC Radio Perth.\n\n\"I have no pride in the fact that the most deadly track, greyhound track, in the whole of Australia is located right here in the City of Canning.\n\n\"I think you have to draw a line in the sand sometimes and step up to the plate, and meet the expectations of your own community.\"\n\nPatrick Hall has described Wednesday's greyhound racing meet as \"carnage\". (ABC News: Gian De Poloni)\n\nRWWA declined an interview but in a statement said track-side veterinarians and racing stewards \"acted to ensure all injured greyhounds received appropriate care and attention\" after the incidents.\n\n\"Racing WA officials are currently conducting a comprehensive review of these incidents and assessing all available data prior to the continuation of any further racing or trialling at Cannington,\" the spokesperson said.\n\n\"Racing WA extends its sympathies to the connections involved and will continue to ensure the care, safety and welfare of all racing animals remains a priority.\"\n\nThe Cannington track was closed temporarily in 2024 for maintenance and a safety upgrade, which reportedly cost RWWA $3 million.\n\nInquiry underway\n\nThere were 119 greyhound deaths on tracks in Australia last year, according to data collated by the Coalition for the Protection of Greyhounds.\n\nThe most deadly tracks, according to the Coalition, were the Cannington and Mandurah racetracks in WA, with 10 deaths recorded at each track.\n\nA parliamentary inquiry is underway, which was prompted by a petition with more than 26,000 signatures calling for the industry to be phased out.\n\nTwo dogs were euthanased follling Wednesday's event in Cannignotn. (Facebook: Greyhounds WA)\n\nMel Harrison, president of advocacy group Free The Hounds, said Australia had more greyhound racetracks than there were across the globe combined, and has long called for greyhound racing to be stopped.\n\n\"I'd love to say it's the first time anything like this has happened, but sadly, it's not,\" she told ABC Radio Perth.\n\nMs Harrison said it was disingenuous for the industry and its supporters to say they cared for the welfare of the greyhounds.\n\n\"That's fine if you're prepared to accept that dogs die for this … but then stop hiding behind all the welfare speech, and saying that you care so much about the dogs,\" she said.\n\nShe said there needed to be more transparency and independent oversight of the industry.\n\nThe RWWA spokesperson said \"the welfare of all racing animals is Racing WA's highest priority\".",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2026-01-30/nine-radio-sold-to-arthur-laundy-talk-radio-shrinking-audience/106286352",
        "title": "Nine Radio sold for cut-price $56m to pub tycoon Arthur Laundy",
        "publish_date": "Fri, 30 Jan 2026 01:04:30 +0000",
        "category": "finance",
        "authors": [],
        "text": "Nine Entertainment has taken a loss by selling its radio network to billionaire pub baron Arthur Laundy as the media company takes a big punt on outdoor advertising.\n\nMr Laundy's Laundy Family Office will pay $56 million for the network, which includes Melbourne's top-rating talk station 3AW, Sydney's 2GB and a stable of presenters, including Ben Fordham and Tom Elliott.\n\nMr Laundy has an estimated net worth of $1.75 billion and owns more than 40 pubs in NSW.\n\nHe is the father of former Liberal MP Craig Laundy, who was a junior minister in Malcolm Turnbull's government, and Stu Laundy, a former contestant on Network 10's dating show The Bachelorette.\n\nThe sale price is far less than the $275m the network was worth just seven years ago when Nine took full control of what was then known as Macquarie Media.\n\nArthur Laundy (left) appeared on Clinton Maynard's 2GB show in August 2025. (Supplied: 2GB)\n\nAt the time, Macquarie's Sydney stars included Alan Jones — currently before the courts charged with multiple counts of indecent assault — and Ray Hadley, who retired last year.\n\nNine's culture of bullying and sexual harassment revealed Bosses in Nine's broadcast division would belittle, intimidate, gaslight and sexually harass employees, and when complaints were made against management, HR would cover it up.\n\nLong-time 3AW breakfast host Neil Mitchell, who dominated the ratings in Melbourne, also retired in 2023.\n\nThe exit of stars added extra pressure on top of the continued decline of the entire talk radio industry as digital media grabbed younger audiences and left broadcasters competing for a shrinking band of baby boomer listeners.\n\nAt the same time as selling the radio stations, Nine on Friday splashed $850m buying outdoor ad company QMS from private equity group Quadrant.\n\nIt also sold its regional TV station, NBN, to affiliate WIN, which already rebroadcasts Nine throughout much of Australia, for $14.8m.\n\nNine has lost faith in the future of radio, analysts say. (ABC News)\n\nNine chief executive Matt Stanton told the stock exchange the shake-up would \"create a more efficient, higher-growth, and digitally powered Nine Group for our consumers, advertisers, shareholders and people\".\n\nVeteran media analyst Peter Cox said this contradicted the positive narrative about radio put out by Nine's competitor, the newly merged Seven West Media and Southern Cross Austereo.\n\n\"Southern Cross and Seven are saying radio is the future,\" he told the ABC.\n\n\"But here's Nine saying that 'No, we don't think that's the future, it's billboards by the side of the road'.\n\n\" I'm a great believer that traditional media is dying; I've been saying that for many years in many ways. \"\n\nNine is expected to reap about $50m in cash from the sale after transaction costs and debt adjustments are made.\n\nCEO Matt Stanton says he hopes the shake-up will make Nine's business model \"more efficient\". (Supplied)\n\nThis will be booked as a gain of about $10m because last year the company dramatically wrote down the value of the network in its accounts.\n\nNine the latest casualty from slowing economy In announcing 200 job losses on Friday, Nine Entertainment has joined other commercial media outlets in feeling the chill from a cooling economy as more corporate budgets slash their marketing spend.\n\nIt also stands to book a tax benefit of about $50m because for tax purposes it is making a loss compared to the original purchase price.\n\nThe sale of the radio network will be greeted with relief by many inside Nine's publishing division, which runs metro mastheads The Age and The Sydney Morning Herald as well as The Australian Financial Review.\n\nSome within the relatively buttoned-up newspaper division have been unhappy to be sharing ownership with the more rambunctious right-wingers at the radio network.\n\nHowever, Nine told the ASX it would continue to collaborate with the radio stations under the Laundy group's ownership.\n\n\"Laundy is expected to remain a long-term partner of Nine, with plans to utilise Nine News journalists on radio, showcase Stan Sport through Laundy venues, provide promotion and advertising sales collaboration, as well as increased advertising spend by Laundy on Nine properties,\" the company said.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2026-01-30/nipah-virus-no-border-control-changes-australia/106286138",
        "title": "Australia taking Nipah virus seriously but no changes to border control",
        "publish_date": "Fri, 30 Jan 2026 00:46:06 +0000",
        "category": "lifestyle",
        "authors": [],
        "text": "The federal health minister says there are no immediate plans to tighten border controls after cases of a deadly virus were detected in India.\n\nNipah virus has been detected in two people in West Bengal and countries across Asia are stepping up health screening measures, including at airports.\n\nThe virus is most commonly spread by fruit bats and although infections in people are rare, the World Health Organisation said it can have a 40 to 75 per cent fatality rate in humans.\n\nHealth Minister Mark Butler told ABC's Radio National the federal government was taking the situation seriously but was not considering additional border measures.\n\n\"We don't have any advice at the moment to change our existing protocols for sick travellers who arrive in Australia. There already are protocols for that, but we'll continue to watch the situation closely,\" Mr Butler said.\n\n\"There's reason to hope that this has been contained.\"\n\nAirport health authorities are monitoring passengers from international flights arriving in Bangkok, Thailand. (Suvarnabhumi Airport Office /Handout via Reuters)\n\n'We shouldn't panic': expert\n\nThe virus, which has never been detected in Australia, is a zoonotic disease like COVID-19 and Ebola, meaning it's spread from animals to humans, but there are major differences to COVID-19 in how it spreads, as it is not transmissible through airborne droplets.\n\n\"It's very difficult to transmit between humans,\" Mr Butler said.\n\n\"It requires very close personal contact between humans and the exchange effectively of bodily fluids.\"\n\nSanjaya Senanayake, associate professor of medicine at the Australian National University, said there was \"no reason to panic\" .\n\n\"It is not a brand new virus. It's been around since 1999 … and we see annual outbreaks of Nipah virus in countries like Bangladesh every year,\" Dr Senanayake said.\n\n\"It's something we've known about for a long time and we have outbreaks every year in that region of Asia and we haven't panicked before, so we shouldn't panic now.\"\n\nTwo Nipah cases had been detected at the Narayana Multispeciality Hospital in the eastern Indian state of West Bengal, since December. (AP Photo)\n\nThe Australian Centre for Disease Control said it is uncommon for the virus to spread between people, as prolonged close contact with an infected person is required for transmission, such as when a healthcare worker is caring for an infected patient.\n\nThere is no vaccine for Nipah virus but the World Health Organisation says several candidate vaccines are currently in different stages of development.\n\nVaccine development has faced challenges because outbreak sizes are generally small which makes vaccine efficacy trials difficult to conduct.\n\nDr Sanjaya Senanayake says it's not a brand new virus and is difficult to transmit. (Supplied)\n\nDr Senanayake said only about 750 cases of Nipah virus have been recorded in almost 30 years.\n\n\"I suspect if we ever got to a stage where there were concerns about pandemics like COVID, the research and production could be ramped up,\" he said.\n\n\"We don't have any antivirals against it. So if someone does get Nipah, it's what we call supportive care, just general measures.\"\n\nMore screening at some Asian borders\n\nSeveral Asian countries such as Thailand, Indonesia, Vietnam and Pakistan have ramped up health screening at their borders in recent days with some airports using thermal screening or body temperature scanners to check travellers, particularly those arriving from India.\n\nThe precautions come as the region prepares for a travel surge over the Chinese Lunar New Year holiday season which begins in about a fortnight.\n\nAsian countries taking no chances with deadly virus Two cases of the Nipah virus have been detected in India, prompting a raft of screening measures to be enacted in countries across Asia.\n\nHowever, India's health ministry said there was no plan to screen passengers at Indian airports as the situation did not justify it.\n\n\"There is no outbreak. There were just two cases in one district in [West] Bengal and there is no spread,\" an official told Reuters.\n\nThe ministry said it had traced 196 close contacts of the two positive cases and all had tested negative for the virus.\n\nThe two infected people are nurses at the same hospital and one is likely to be discharged from hospital soon while the other remains in a critical condition.\n\nNipah virus can cause flu-like symptoms such as fever, headache, fatigue, vomiting and shortness of breath four days to three weeks after infection.\n\nIn some cases, people develop pneumonia or encephalitis (inflammation of the brain), but most people who survive make a full recovery.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2026-01-30/australian-open-day-13-live-blog-alcaraz-zverev-djokovic/106286224",
        "title": "Live: Gadecki and Peers in mixed doubles final before Alcaraz, Zverev kick off men's semis",
        "publish_date": "Fri, 30 Jan 2026 00:39:44 +0000",
        "category": "sports",
        "authors": [
            "Andrew Mcgarry"
        ],
        "text": "As with the format of the mixed doubles, we are now off to a 10-point match tie-break to decide the Australian Open title.\n\nThe French win the first point on serve. 1-0 Mladenovic/Guinard.\n\nA solid Peers second serve draws the error from Guinard. 1-1\n\nPeers second serve ends with Mladenovic splitting the Aussie pair with a drive down the middle of the court. Mini-break for 2-1 Mladenovic/Guinard.\n\nNerves from Mladenovic, who double faults, hitting her partner on the head on second serve. 2-2\n\nAnother second serve, and Gadecki ends the rally with a whipped crosscourt backhand. Aussies now a mini-break ahead! 3-2 Gadecki/Peers\n\nBrilliant deep return from Guinard and Gadecki nets. Back on serve at 3-3\n\nEveryone has nerves here, as they should — there is a grand slam title on the line.\n\nSecond serve for Gadecki. And it's a double fault! 4-3 Mladenovic/Guinard\n\nTen points seems a long way away at this point.\n\nGuinard holds and the French lead 5-3.\n\nSecond serve, and a brilliant net exchange from Peers sets up the error from Guinard. Back on serve again! 5-4 Mladenovic/Guinard.\n\nNow a second serve from Peers is drilled by Guinard and Gadecki nets. 6-4 Mladenovic/Guinard\n\nAnother second serve, and Peers comes forward to drill the winner off a kick serve. 6-5 Mladenovic/Guinard\n\nTwo vital serves from Mladenovic, and she gets the first point! 7-5 Mladenovic/Guinard\n\nThe French are three points away.\n\nGreat rally, with Mladenovic and Gadecki exchanging moonballs, but Gadecki's crosscourt draws the net shot from Guinard. Back on serve at 7-6 Mladenovic/Guinard\n\nA tense return from Guinard to Gadecki goes low on the net. 7-7\n\nAlmost an ace from Gadecki! The crowd goes up then sighs. But Mladenovic drills a forehand well over the baseline. 8-7 Gadecki/Peers\n\nAnd a hammerblow of a forehand from Peers gives two championship points! 9-7 Gadecki/Peers\n\nFrench hold for 8-9. Still championship point!\n\nSecond serve from Peers.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2026-01-30/lachie-neale-brisbane-lions-pre-season-marriage-breakdown/106286732",
        "title": "Why Lachie Neale is having his 'best pre-season in a long time' despite drama",
        "publish_date": "Fri, 30 Jan 2026 00:38:02 +0000",
        "category": "sports",
        "authors": [],
        "text": "Brisbane coach Chris Fagan says Lachie Neale is enjoying his best pre-season in years despite the Lions champion dealing with significant personal issues.\n\nThe dual Brownlow medallist relinquished the co-captaincy earlier in January amid a tumultuous and public marriage breakdown.\n\nNeale, one of the greatest players in club history after moving from Fremantle at the end of 2018, will likely return to Western Australia in 2027 to be closer to his two children.\n\nLachie Neale steps down as Brisbane Lions co-captain The club said the 32-year-old had made the decision following a \"challenging personal period\".\n\nBut until then, the 32-year-old will remain a crucial part of Brisbane's push to claim a third consecutive premiership this season.\n\n\"It hasn't really affected things too much,\" Fagan told SEN on Friday when asked about the intense tabloid interest in Neale's personal life.\n\n\"It's not like we sit around having meetings with the players and talk about it.\n\n\"It's just been myself, [Lions football boss] Danny [Daly] and Lachie.\n\n\"To Lachie's credit, in terms of the way that he's training and going about things, he's having his best pre-season in a long while.\n\n\"Normally, he's finished seasons quite injured and been in rehab, but this year he had no injury at the finish.\n\n\"He's been able to train fully and in the best shape he's been in for ages in terms of setting himself up for a good football season.\n\n\"He's in a good place at the moment, obviously got a bit going on personally, but he seems to be coping with that pretty well.\"\n\nIn three seasons as co-captain with Harris Andrews, Neale led the Lions to three grand finals — winning the last two.\n\nComing towards the end of his career, Neale had already raised the prospect of stepping back as a leader before his marriage breakdown turned into a social media storm.\n\nNeale gave up the Lions co-captaincy after a high profile marriage breakdown. (AAP: Jono Searle)\n\nTalks took place last year about Andrews being the Lions' sole captain.\n\nBut due to the success the Lions have had with co-captains — Dayne Zorko was skipper for five seasons before 2023 — Fagan is superstitious about changing that.\n\nA player vote will take place in February that will help shape Brisbane's captaincy system for 2026.\n\n\"Harris Andrews could easily be captain on his own,\" Fagan said.\n\n\"I am not a fan of the two-captain model but since we have had it, we have been successful.\n\n\"I don't know if I want one or two.\n\n\"If it's two, then you look at Hugh McCluggage and Josh Dunkley and it's hard to split those two blokes.\"\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\nThe Lions have taken a similar approach to when they broke through to win the 2024 premiership in a bid to stay at the top — humility in success.\n\n\"Straight away after the grand final, we talked about it — we can only be our own worst enemies if we get too carried away with ourselves and we don't stay humble,\" Fagan said.\n\n\"It's a regular topic of conversation.\n\n\"The boys know what that behaviour looks like, and we encourage them to call it out if they see it.\n\n\"We certainly do if we do.\n\n\"But to be fair, I haven't seen any of that to this point in time.\n\n\"We turned up in great shape and attitude at training has been terrific.\"\n\nThe Lions will unfurl their premiership flag when they host the Western Bulldogs at the Gabba in opening round on March 7.\n\nAAP",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2026-01-30/nt-darwin-salties-wheelchair-basketball-champions-team-withdrawn/106284830",
        "title": "Para-athletes 'devastated by sudden, unexplained decision' to withdraw team",
        "publish_date": "Fri, 30 Jan 2026 00:32:17 +0000",
        "category": "sports",
        "authors": [],
        "text": "Australia's top wheelchair basketball team was \"devastated\" to learn it had been withdrawn from this season's national competition, sparking calls to \"urgently\" reverse the shock decision.\n\nIn a joint statement released on Thursday, Darwin Salties co-captains Tom O'Neill-Thorne and CJ McCarthy-Grogan revealed players only heard about the decision — made overnight on Wednesday — through media the following morning.\n\nThey said Basketball NT (BNT) provided players with \"no reason\" for pulling out of the National Wheelchair Basketball League (NWBL) 2026 season and said there had been \"no prior consultation with the team\".\n\nTom O'Neill-Thorne and CJ McCarthy-Grogan co-captained the Darwin team to three consecutive National Wheelchair Basketball League championships. (Supplied)\n\nO'Neill-Thorne said players had been \"totally blindsided\" and \"devastated by the sudden and unexplained decision\" from BNT.\n\n\"It's shattering for the team but, more than us, it's distressing that the next generation of wheelchair basketball players might not get the same opportunities we all got playing for the Salties,\" he said.\n\n\"We're still trying to get some answers on what's happened but we are appealing directly to Basketball NT to reverse the decision.\"\n\nThe Darwin Salties joined the national men's wheelchair basketball competition in 2022, taking home the past three consecutive championships including last year's grand final in Sydney, and players have gone on to represent Australia at the 2023 World Championships and 2024 Paris Paralympics.\n\n\"The Salties have helped put the NT on the national and international wheelchair basketball map,\" McCarthy-Grogan said.\n\n\" That should be supported, not shut out. \"\n\nWhy was the team withdrawn?\n\nMcCarthy-Grogan urged BNT to \"provide transparency\" around how the decision was made, and said the team \"finding out through a media statement is incredibly disappointing\".\n\nHe worried about the potential flow-on impacts to \"disability representation, opportunity and pathways in the Northern Territory\".\n\nSpeaking with ABC Radio Darwin this week, McCarthy-Grogan said the decision was particularly upsetting in the lead-up to Australia hosting the 2032 Olympic and Paralympic Games.\n\n\"We'd made so much progress over the years and, in the lead-up to the 2032 Games in Brisbane and Gold Coast, you would expect that they would have been supportive but unfortunately, it's not the case,\" he said.\n\nIn a statement, BNT said it \"acknowledges and shares the disappointment felt by the basketball community\" in response to the decision.\n\nThe Darwin Salties first heard about the withdrawal decision in a media release. (Supplied)\n\nIt said Darwin Basketball Association (DBA) previously held the NWBL licence and operated the Top End wheelchair basketball program, but when DBA \"entered administration in December 2025\" BNT was asked if \"it would assume responsibility for fielding a new Darwin team for the 2026 season\".\n\nThe BNT board decided it couldn't \"take on the financial and operational risks of entering a national league team without committed ongoing funding\", which it described as a \"prudent but difficult decision\".\n\n\"As a result of DBA ceasing operations, BNT is focused on commencing a new Darwin local competition, rebuilding governance confidence and long-term financial sustainability of basketball across the territory,\" the statement said.\n\n'A line in the sand'\n\nOn Thursday afternoon, WBA executive general manager John Palmer told ABC Radio Darwin the national body had been \"confident\" Basketball NT could \"move forward\" until \"very recently\".\n\n\"We've extended our deadline compared to other teams — over six weeks longer than any other team — and unfortunately, NT Basketball couldn't meet those deadlines as of this morning when we were notified, after a board meeting last night, that NT Basketball had decided not to move forward with the licence, so disappointing all around,\" he said.\n\n\"It's a difficult decision.\n\n\"From the financial prudence point of view, I suppose we needed to say; 'Look, there's a line in the sand', we needed an answer and that's where we're at.\"\n\nHow two NT friends helped form the Darwin Salties Tom and CJ have been friends for decades. Now the two mates, who had to leave home for their sporting opportunities, have reunited to bring those opportunities home.\n\nIn a statement to the ABC on Friday, Mr Palmer said \"the Darwin Salties depart the league at the very top of the sport\".\n\n\"While the Salties will not take the court in 2026, the league remains committed to supporting the growth of para-sport in the region,\" he said.\n\nHe thanked the team for being \"a benchmark for excellence\", fans of the sport, and the staff and volunteers who worked to keep the league running.\n\n\"Their dominance on the court was matched only by the fervour of the Darwin fans who turned the stadium into a fortress,\" Mr Palmer said.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/rural/2026-01-30/saleyards-australia-best-canteen-competition/106281246",
        "title": "What's lamb's fry, and why is it popular at this canteen",
        "publish_date": "Fri, 30 Jan 2026 00:03:18 +0000",
        "category": "finance",
        "authors": [],
        "text": "Every Wednesday morning at the Mount Gambier saleyards, Liz Beames gets in at 4am to start cooking up lamb's fry.\n\nShe runs the canteen on site, and while it might not be everyone's cup of tea, her lamb's fry for breakfast is popular.\n\nThe traditional dish, which usually includes lamb liver and is thus rich in iron, was once a popular menu item at pubs, kitchens and clubs around Australia, but has since largely disappeared from many venues.\n\nBut not at the canteen at Mount Gambier and District Saleyards, where the tradition isn't just going strong, it's their speciality.\n\nLamb's fry is one of Mount Gambier Saleyards' signature dishes. (ABC South East SA: Elsie Adamo)\n\n\"I used to make it just in the winter periods and then some of the older fellas said to me, 'Can't you do this all year round?'\" she said.\n\n\"They love it. I don't mind making it, but I have never tasted it.\"\n\nIt is this kind of dedication that has Mount Gambier and District Saleyards in the running for Saleyards Australia's Best Canteen competition, which is encouraging people to vote for their favourite site.\n\nSaleyards Australia executive officer Amy Perfrement said every saleyard had its own characters, but the canteens were often the heart and soul of livestock exchanges.\n\nWorkers put a lot of effort into Australian Saleyards' canteens. (ABC South East SA: Elsie Adamo)\n\n\"One part of saleyards that's often forgotten about is the canteen ... we wanted to just shine a bit of a spotlight on those unsung heroes that keep everyone fed and watered on sale day and sometimes the days either side of that,\" she said.\n\nThere are just under 80 canteens across the country that are registered as Saleyards Australia members, and many more unregistered operators.\n\nOften run by small businesses, volunteers, or community groups, Ms Perfrement said the canteens helped foster connection, goodwill and a welcoming atmosphere.\n\nAlongside the vanilla slices, bacon and egg sandwiches and fresh coffee, the canteens are often a meeting place for rural communities.\n\nLiz Beames grew up on a farm and says her background helps her to connect with the community. (ABC South East SA: Elsie Adamo)\n\n\"It's a place where people can come in and meet, have a chat, maybe a debrief, and it really is that social fabric of saleyards,\" Ms Perfrement said.\n\nMore than just a canteen\n\nWhen Liz Beames first started at the Mount Gambier saleyards as the canteen manager, she thought she might stay for maybe three months.\n\nIn May, she will have been in the role for 18 years.\n\nOver those years of serving the saleyard community, she counts many of them as family.\n\nThe business has been a family affair for Liz Beames, who has worked alongside her husband and children over the years. (ABC South East SA: Elsie Adamo)\n\n\"I love them all, they're great. They're salt of the earth people, and I love what I do, and I want that to come through in my food,\" Ms Beames said.\n\nAnd like family, Ms Beames knows exactly what each regular wants to order.\n\n\"There is a few that have been here for a long time and I know that they will have the bacon, eggs, bit of toast — always the same,\" she said.\n\nBreakfast is popular at the Mount Gambier and District Saleyards. (ABC South East SA: Elsie Adamo)\n\nMeantime, Megan Ireland — who runs the Naracoorte saleyard canteen, which is also in the running — agrees that homemade meals cooked with love were always a winner.\n\n\"I make everything from scratch, from my homemade jelly slice to a fresh soup in winter or a salad in summer,\" she said.\n\n\"I like to support local business as well, so local eggs, the local butcher, the bakery.\"\n\nA hot meal and a welcoming smile are what make saleyard canteens a farmer favourite. (ABC South East SA: Elsie Adamo)\n\nShe also agrees that some of the best customers are the ones who are not even there to take part in the sale.\n\n\"Some of the older blokes come in every Tuesday or every Friday just so they can feel like they're a part of it,\" Ms Ireland said.\n\n\"They're some of our favourite customers. Every single sale day they sit at the same table, they order the same thing, and they give you the same smile.\"\n\nA community hub\n\nDavid Wallis is the saleyards manager in Mount Gambier and knows all too well the importance of a good saleyard canteen.\n\nDavid Wallis says canteen workers deserve recognition. (ABC South East SA: Elsie Adamo)\n\n\"This is a hub where people feel like they're involved. Farmers are often isolated in what they do, and so to come to the saleyards, and in particular the canteen, they feel like they have someone that is happy to have a chat,\" he said.\n\n\" It's more than just a feed in the canteen, it's about wellbeing as well. \"\n\nSaleyard canteens around the country keep sellers, buyers and agents well fed on busy days. (ABC South East SA: Elsie Adamo)\n\nMr Wallis said canteens could act as a barometer of how the community was feeling.\n\n\"[Liz Beames] will come to me and say, 'Oh, the vibe today is amazing', or there might be other days where it might be a really elongated day, and people are tired,\" he said.\n\n\"But she also is just an ear for many.\"\n\nAnd the saleyard canteen is never missed by Mr Wallis either.\n\n\"I have been here nearly six years and I have eaten every sale day here,\" he said.\n\n\"[Ms Beames] has this bad habit of bringing in a little bowl of lollies to people when they have worked real long hours.\n\nSaleyards Australia wants to find the best saleyards canteen in the country. (ABC South East SA: Elsie Adamo)\n\n\"You have just about had enough for the day, and Liz will come in with a smile and say, 'Just to keep you going', and walk out again.\n\n\"It's those little things that make a lot of difference.\"\n\nVoting for Australia's Best Saleyards Canteen closes at 11pm on Saturday, January 31, with the winner announced in February.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2026-01-30/trump-albanese-arafura-rare-earths-mine-facing-further-delays/106285164",
        "title": "It has been backed by Trump and Rinehart — but where is the Arafura mine?",
        "publish_date": "Thu, 29 Jan 2026 23:01:46 +0000",
        "category": "finance",
        "authors": [],
        "text": "It is the Central Australian mine promised to help upset China's dominance of the global rare earths market, and bring hundreds of jobs to the Northern Territory.\n\nArafura's Nolans Rare Earths Project was listed as a priority in a multi-billion dollar critical minerals deal inked between Donald Trump and Anthony Albanese in Washington last year.\n\nThe Nolans Project has also received backing from Australia's richest woman, Gina Rinehart.\n\nAccommodation for workers has been established at the project site, but the Arafura Rare Earths mine is yet to materialise. (Supplied: Arafura Rare Earths)\n\nBut 20 years after it was first floated as a prospect, and after receiving hundreds of millions of dollars in taxpayer funding, the project appears to be delayed once again.\n\nArafura Rare Earths released its quarterly report on Thursday, which showed the company was still vague on exactly when it might hit its golden milestone of final investment.\n\nLate last year, following the deal with the United States, the company's heads told media they were hopeful of reaching a final investment decision by the first quarter of 2026.\n\nGina Rinehart's company Hancock owns a 10 per cent stake in Arafura Rare Earths. (AAP: Richard Wainwright)\n\nIn this week's quarterly report, the firm said it was now awaiting confirmation of further investment from the German government, and has pushed its timeline out.\n\nArafura had previously said a final investment decision had been expected early in 2025.\n\nShareholder nerves over delays\n\nArafura has not committed to an exact timeline for a start date, but said in a statement to the ABC there was still a decision \"targeted for the first half of the calendar 2026\".\n\nWhy this multi-million-dollar project is powering ahead As the major parties make their final pitches ahead of the NT election, both say they have the answers to turn around the territory's stagnant economy.\n\nAt an investor meeting yesterday, one shareholder asked: \"How do you expect to reassure shareholders that this project will succeed due to constant delays?\"\n\nIn response, Arafura managing director Darryl Cuzzubbo said, \"90 per cent of that funding is committed, or subject to final approval.\n\n\"We are doing everything in our power to accelerate negotiations with cornerstone investors and efficiently navigate new and complex government equity programs, to deliver a fully-funded project, as soon as possible.\n\n\"The parties we are dealing with prioritise diligence and process, which serves to reinforce the project fundamentals that will deliver long-term value.\n\n\" By a similar token, we need to ensure that the solution that we put in place is on the best possible terms for our shareholders, and we are focusing on certainty over speed. \"\n\nDarryl Cuzzubbo assured stakeholders the majority of funding has already been secured. (AAP: Dominic Giannini)\n\nGovernment accepts complexity of project\n\nArafura has also pledged the project, to be based north of Alice Springs, will bring hundreds of jobs to the territory.\n\nIn response to the latest quarterly report, NT Mining Minister Gerard Maley said the government looked forward to seeing progress from the company.\n\nGerard Maley is looking forward to seeing the project progress. (ABC News: Pete Garnish)\n\n\"Projects of this scale and strategic importance involve complex and time-consuming financing processes,\" he said.\n\n\" [These are] ultimately commercial matters for Arafura, but we look forward to their progress. \"\n\nAustralian Strategic Policy Institute senior fellow Ian Satchwell said the company's announcement it had not yet reached the final investment decision should be no surprise.\n\nIan Satchwell says he's confident the project will proceed. (ABC News: Glyn Jones)\n\n\"I think that everybody, including the principals at Arafura Rare Earths, would've liked this project to get a go ahead sooner than 2026,\" he said.\n\n\"But when you're dealing with a market that's quite volatile, where prices are being manipulated to hold out competition, and where you're trying to line up financial institutions with loans, plus equity investment … it's complicated.\n\n\" I'm very confident that this project, when it gets a final investment decision, will proceed, and hopefully will be very successful. \"\n\nFederal Resources Minister Madeleine King declined to comment.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2026-01-30/last-nsw-vset-passenger-train-farewelled-by-transport-ethusiasts/106284820",
        "title": "Enthusiasts say goodbye to NSW 'steel rattler' train",
        "publish_date": "Thu, 29 Jan 2026 22:36:23 +0000",
        "category": "finance",
        "authors": [],
        "text": "For many, the garish purple interiors of V-Set passenger train carriages bring back fond childhood memories of travelling from regional NSW to Sydney.\n\nBut after 55 years on the tracks, the beloved \"steel rattlers\" have reached the end of the line.\n\n'Blue Goose' V-Set makes its final journey from Lithgow to Central Station in Sydney. (ABC News: Abubakr Sajid)\n\nOn Friday morning, the intercity workhorse rolled out of Lithgow for the last time painted in its original royal blue and grey 'Blue Goose' colours.\n\nThe 5:57am service stopped at most Blue Mountains Line stations before terminating at Sydney's Central Station, about 20 minutes later than expected due to demand.\n\nAlthough the final service V-Set train has been painted in the original royal blue, the more recent fleet was known for its yellow front exterior. (ABC News: Liam Patrick)\n\nFirst released in 1970, the V-Set trains continued to be manufactured for 19 years, with the more recent fleet known for its yellow front exterior.\n\nTransport management lecturer Geoffrey Clinton from the University of Sydney puts its success down to the modern edge the series brought when it first hit the tracks.\n\n\"They had things like automatic [closing] doors and air conditioning, which was obviously quite an important thing, particularly in our hot summers and cold winters,\" Dr Clinton said.\n\nDr Clinton says the V-Set passenger train was ahead of its time. (Supplied: University of Sydney)\n\nThe V-Set's distinctive reversible seats also proved to be a drawcard, affording people a sense of autonomy in choosing who they sat with.\n\n\"There's a lot of people who formed friendships on those trains and that's because people would take the same carriage on the same train every day to and from work or school,\" Dr Clinton said.\n\n\"I know stories about people who would have Friday drinks on the train as a carriage and you play card games and whatnot.\"\n\nMr Thomas is a fan of the V-Set train. (Supplied: Paul Thomas)\n\nPublic transport enthusiast Paul Thomas travelled up to Lithgow to board the V-Set train's victory lap.\n\nThe social media vlogger embarked on the journey with hundreds of others early on Friday morning, with the belief its final trip would be a celebration as opposed to a sombre occasion.\n\n\"I was at Lithgow Station at five in the morning,\" he said.\n\n\"There were lots of people there, probably 300 or 400 rail fans, waiting for this train to come in.\"\n\n'Blue Goose' V-Set train on its debut in October 1977 at Katoomba. (ABC News)\n\nMr Thomas said it was quite the party in the second car, but in his carriage the atmosphere was quite civilised.\n\nDemand to board the Blue Goose's final run caused delays to the service, leaving eager commuters waiting on station platforms.\n\nThousands packed Sydney's Central Station this morning to say goodbye. (ABC News: Abubakr Sajid)\n\nBut for some passengers, the wait brought back the feeling of nostalgia rather than frustration.\n\n\"It brings back those childhood memories,\" said Katie Laws, who brought her family to Penrith Station to watch the model roll next to the platform for the final time.\n\n\"The trains being late helps too … bringing back those memories of waiting and getting on the train, running for the train.\"\n\nThe V-Set class has been replaced with the Mariyung Fleet. (ABC News: Anushri Sood)\n\nThe V-Set class will be succeeded by the Mariyung Fleet, which has already replaced trains on the Central Coast and Newcastle lines.\n\nDespite passengers being unable to flip the seats on the newer model, train devotees welcome the trade-off for larger bathrooms and a quieter journey.\n\nAged just 10 years old, Zedd woke up at 5am to board the train with his dad.\n\nHe told the ABC he would miss travelling to the mountains on the Blue Goose, but was excited to be \"part of history\".\n\n\"This is one of the best trains on the inner-city network,\" he said.\n\n\"Also, this train is just nostalgic.\"\n\nZedd says he was excited to be \"part of history\". (ABC News.)\n\n'An emotional moment'\n\nThousands eagerly packed Central Station to watch the train terminate for the final time.\n\nAs the last passengers of the V-Set disembarked, they were greeted to fanfare and a live band.\n\nTransport Minister John Graham said it was an emotional day for not only Sydney's rail network, but generations of commuters.\n\n\"There's no question these V-Sets will be really missed as they retire today,\" he said.\n\n\"Incredible to have so many people down here... as we wave off for the final time these V-set trains.\"\n\nTransport Minister John Graham and V-Set train driver Peter Gunczy. (ABC News: Abubakr Sajid)\n\nLong-serving train driver, Peter Gunczy, said he was honoured to be given the opportunity to retire the fleet.\n\n\"I've spent the best part of 41 years driving these V-Sets,\" he said.\n\n\" It's really, really emotional for me personally. I'm trying really hard to not well up. \"\n\nPublic to decide future of V-Set train carriages\n\nThe 'Blue Goose' V-Set used for the final service will be preserved for future train enthusiasts, with the fate of the other 81 retired carriages up to the public.\n\nDr Clinton expects most will be turned into scrap metal, but hopes to see some provided with a new life.\n\n\"In the past, we've seen them being repurposed as cafes and for accommodation,\" he said.\n\n\"Train carriages around the world have also been repurposed for things like artificial reefs, as they make a good artificial reef.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2026-01-30/kevin-muscat-shanghai-port-chinese-super-league-corruption/106286038",
        "title": "Kevin Muscat's Shanghai Port hit with points deduction following corruption investigation",
        "publish_date": "Thu, 29 Jan 2026 22:20:10 +0000",
        "category": "sports",
        "authors": [],
        "text": "Kevin Muscat has managed Shanghai Port to two successive Chinese title triumphs but the Australian will face a huge hurdle if he goes for the \"three-peat\" after the champions were hit with a points deduction following an investigation into football corruption.\n\nShanghai, who won the Chinese Super League by just two points, must begin their defence of the title in March on minus five points after they were among nine top-flight clubs who were hit ⁠with substantial punishments announced by the Chinese FA on Thursday.\n\nShanghai Shenhua, who were runners-up to their neighbours, got an even tougher sanction of a 10-point deduction, along with Tianjin Jinmen Tiger, ‌who came sixth.\n\nMuscat has enjoyed tremendous success as a manager throughout Asia. (Getty Images: Clicks Images)\n\nThe punishments ‍have been handed out by authorities after an investigation into football-related gambling and match manipulation, Chinese state news agency Xinhua reported.\n\nThe 52-year-old Muscat, who earned a reputation as one of the toughest, most uncompromising defenders in the British game, has since become hugely successful as a manager, with two titles in charge of Melbourne Victory and another with Yokohama F Marinos in Japan.\n\nHis exploits in China have since kept him on the radar of British clubs, and he had been in line to take over as manager of Scottish giants Rangers last October before the deal fell through.\n\nWhether his attitude to life at his lucratively funded club will be changed by their punishment is not known, but only this week, Muscat's name has again come up in connection with the vacant manager's job at Championship side Leicester City, who sacked their boss Marti Cifuentes last week.\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\nAlso, after the punishments in China, Qingdao Hainiu will start the season on minus seven ‌points while Henan FC and Shandong Taishan were both hit with six-point deductions.\n\nWuhan Three Towns, Zhejiang FC and Beijing ‍Guoan will start on minus five points alongside Port.\n\nThe teams have also been fined between 200,000 and 1 million yuan ($41,071 to $204,000).\n\nThe Chinese FA also said former CFA president Chen Xuyuan and ex-China coach Li Tie were among 73 people barred from football-related activities for life.\n\nAAP",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2026-01-30/gm-purple-tomato-approved-for-australian-growth-and-sale/106262696",
        "title": "Are Australians ready for genetically modified tomatoes? The proof will be in the eating",
        "publish_date": "Thu, 29 Jan 2026 21:38:09 +0000",
        "category": "finance",
        "authors": [],
        "text": "Genetically modified tomatoes the colour of a plum are set to go on sale in Australian fruit shops for the first time this year.\n\nThe Purple Bliss tomato has been approved by the Office of the Gene Technology Regulator and Food Standards Australia New Zealand, allowing it to be grown and distributed in Australia.\n\nThe purple tomato was bred to include genes from the snapdragon flower which adds colour and antioxidants.\n\nIt will be the first fresh GM whole food to be grown and sold in the country, with other GM crops in Australia only approved for cultivation.\n\nSnapdragon fruit genes have been added to create the tomato's purple colour and increase health benefits. (Supplied: Norfolk Healthy Produce)\n\nVictoria-based fresh produce marketing company All Aussie Farmers has been working for several years to bring the purple tomato to Australia from the United States.\n\nManaging director Travis Murphy said the fruit had a \"really sweet\" flavour.\n\n\"I'm not a tomato eater, I can openly admit that, but I can eat these purple tomatoes. They're beautiful,\" he said.\n\nMelbourne first to stock\n\nNow that it is approved, All Aussie Farmers can begin growing and selling the Purple Bliss locally.\n\nTravis Murphy says the purple tomato has a sweet flavour. (Supplied: Norfolk Healthy Produce)\n\nThey will be on sale in Melbourne fruit shops around the middle of the year before expanding to other markets.\n\n\"Because this is such a unique product, we want to control how it's introduced,\" Mr Murphy said.\n\n\"We'll be selling them ourselves off our own wholesale floor so we're handling everything end-to-end,\" he said.\n\n\"We can make sure the product is handled properly and that the grower is getting paid fairly.\"\n\nThat first grower is based in Queensland, in the Clearview Valley.\n\nTravis Murphy (left) says it has been challenging to get regulatory approval for the purple tomato. (Supplied: All Aussie Farmers)\n\nMr Murphy said they were chosen because their main crop of medley tomatoes was wiped out by hail just before Christmas.\n\n\"He's a careful, committed grower who puts a lot of effort into his fruit,\" Mr Murphy said.\n\n\"That means we can deliver a top-quality product to fruit shops who can then pass that quality on to consumers.\"\n\nA question for the consumer\n\nVictorian Farmers Federation president Brett Hosking welcomed the go-ahead for the GM tomato, saying it was important technology was embraced.\n\nBrett Hosking says science and farming work hand in hand. (Supplied: GrainGrowers)\n\n\"We're starting to realise that science and food production work hand in hand,\" he said.\n\n\"The way we ensure consumers get the best eating experience is by embracing what we know from research, innovation and technology combined with traditional growing practices.\n\n\"A lot of GM food products in Australia aren't actually consumed directly.\n\n\"Take canola, for example, we produce oil from it, [but] that oil doesn't contain any of the DNA.\n\n\"This tomato though is a product you put straight on your plate. A fresh food that you chop up and eat whole.\"\n\nSecond GM 'wave' unlikely\n\nUnlike the purple tomato, most other GM crops in Australia are bred to solve pest, disease and agricultural issues.\n\nBut molecular plant biologist Joseph Pegler from the University of Newcastle doubts there would be a surge of GM crops modified for nutrition.\n\n\"It's certainly possible that we'll see more genetically modified crops in the future,\" Dr Pegler said.\n\n\"But this doesn't mean we're about to see a large influx of GM crops released into the Australian environment.\n\n\"The regulation around genetically modified organisms in Australia is very strict and highly transparent.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.smh.com.au/sport/tennis/australian-open-2026-live-updates-aussies-chase-doubles-title-zverev-battles-alcaraz-djokovic-faces-sinner-in-blockbuster-semis-20260129-p5ny45.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Australian Open 2026 LIVE updates: Aussies chase doubles title; Zverev battles Alcaraz, Djokovic faces Sinner in blockbuster semis",
        "publish_date": "Fri, 30 Jan 2026 13:40:58 +1100",
        "category": "sports",
        "authors": [
            "Angus Delaney",
            "Roy Ward"
        ],
        "text": "I wonder if mixed doubles pairings have to take lessons in sign language and ventriloquism before signing up for the tour?\n\nIt sure looks that way in this Australian Open final.\n\nClosed fists over mouths are just the ticket for the French pair. Credit: Getty Images\n\nMladenovic and Guinard have been spotted trying to communicate with their hands held over their mouths in a closed fist. It looks like they are trying to blow a pretend trumpet, but apparently they are talking tactics.\n\nThe Aussies are relying on hand signals to determine their approach to certain points.\n\nGadecki holds her left hand behind her back when she is standing at the net and goes through a number of different finger signals before her partner Peers serves.\n\nIn theory, it gives her the advantage of knowing where he is going to serve. If she signals wide to the forehand, she can cover the line. If she signals down the line, she can step across to cut off the volley.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/tennis/sabalenka-vs-rybakina-in-blockbuster-final-20260130-p5nybw.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Sabalenka vs Rybakina in 'blockbuster' final",
        "publish_date": "Fri, 30 Jan 2026 13:38:34 +1100",
        "category": "finance",
        "authors": [],
        "text": "Sabalenka vs Rybakina in 'blockbuster' final\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/three-olympics-four-surgeries-and-one-superstition-moguls-matt-takes-bumpy-road-to-milan-games-20251231-p5nqxf.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Three Olympics, four surgeries and one superstition: ‘Moguls Matt’ takes bumpy road to Milan Games",
        "publish_date": "Fri, 30 Jan 2026 13:36:49 +1100",
        "category": "sports",
        "authors": [
            "Danny Russell"
        ],
        "text": "Save Log in , register or subscribe to save articles for later. Save articles for later Add articles to your saved list and come back to them any time. Got it Normal text size Larger text size Very large text size In the tense moments before a high-pressure event, Winter Olympian Matt Graham looks for his daughter’s face. He pulls his phone from his pocket, lights up the screen and focuses on her image. It is a reassuring habit the 31-year-old moguls specialist has formed since becoming a father in September 2024 that will help drive him towards Winter Olympics gold next month. “I found myself doing it just this past season, which I didn’t expect,” he tells this masthead. Matt Graham with a world championships silver medal in 2023. Credit: Getty Images “She’s my background on my phone, so during competitions, when the stakes are high and the pressures up, I’d often just like, pull my phone out, just open it up, sort of blow her a kiss and just say, ‘let’s f...ing go’. “I just found myself doing that naturally. It wasn’t planned. It’s more my way of just getting in the zone and getting amped up for the event.”\n\nAdvertisement\n\nGraham has embraced fatherhood. Despite the added complications for an athlete who lives in Sydney and competes on the other side of the globe, it provides him with extra motivation as he prepares for the Olympics in northern Italy, which begin on February 6. “My day-to-day life as an athlete hasn’t changed a whole lot,” he says. “But mentally, it’s quite different. I feel like there’s more purpose when I’m away. “I’m not doing it just for me.” Matt Graham during moguls qualfying at the 2022 Beijing Games. Credit: Getty Graham and his partner Jess had daughter Ada in September 2024 and were married 13 months later in October last year.\n\nAdvertisement\n\n“It was a big step, obviously,” he says. “Anyone who’s a parent sort of knows that the transition can be quite full on. But yeah, I mean, Jess and I were both ready to become parents. “We’d obviously spoken about it a lot, leading up to us trying to be parents, and then once it eventually happened, it was about preparing for the hard times when I was going to be away.” Graham had a patchy season last year. But he bounced back in sparkling fashion last month, winning a World Cup moguls event in Ruka, Finland. It was a unique double for Australia as Jakara Anthony also won gold. “My performances in the past season were, it was a bit of a rocky road,” Graham says. “But the failures, or the times I didn’t succeed on the competition tour, it made it easier to get over because I would just go home and get Jess on FaceTime and, I mean, yeah, my daughter, Ada, she doesn’t care.\n\nAdvertisement\n\n“She’s just smiling and yapping away. So it makes that easier to sort of push past and move on from those downtimes.” Graham hit a low point in December 2021. Coming off an Olympic silver medal in South Korea in 2018, he broke his collarbone in a heavy fall in Sweden just two months out from the 2022 Olympics in Beijing. Despite an intensive rehabilitation program, he was far from his best. He competed in pain and finished 29th. Matt Graham during moguls qualifying at the 2022 Olympics in Beijing. Credit: Getty The experience rocked Graham. He admits he was “heartbroken” and considered calling time on his career. But the qualified civil engineer made some adjustments and rediscovered his love of the sport before he had to overcome more setbacks. His collarbone hadn’t healed properly, and he was sent for further surgery. “Generally speaking, a broken collarbone is an easy injury to come back from, but unfortunately, mine was a little bit more complicated,” Graham told the NSW Institute of Sport.\n\nAdvertisement\n\n“I had some issues with the bone healing. Consequently, I had to undergo four completely separate surgeries, which prolonged the injury over a two-year period.” After the operations and three sets of plates and screws, Graham then had to rediscover the right mindset. “Sometimes, you know, you’ll have a big crash, a big stumble, and you’ve got to get back up and right your wrong, and learn from that mistake,” he says. “I guess I’ve developed a bit of a way to push past those things and just know that I’ll be fine. If I attack a course, and I’m hesitant or conservative, then I’m at more risk than if I more or less just attack it. “Sometimes a moguls course can be pretty daunting, it can be steep, it can be icy, in some cases it can be a little bit scary. So, I guess you have to have a screw or two loose to take that step and really attack each day in each competition. “[But] I’d say generally I’m quite conservative in life. The risks we do out in the snow, they’re very calculated.\n\nAdvertisement",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/business/markets/asx-set-to-dip-microsoft-weighs-down-wall-street-apple-results-ahead-20260130-p5ny6n.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "ASX higher as energy shares shine; The Star stumbles",
        "publish_date": "Fri, 30 Jan 2026 13:20:58 +1100",
        "category": "finance",
        "authors": [
            "Staff Reporter"
        ],
        "text": "Advertisement\n\nUpdated BusinessMarketsWorld markets ASX higher as energy shares shine; The Star stumbles Staff reporter Updated January 30, 2026 — 1:20pm ,first published January 30, 2026 — 5:23am Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share A A A\n\nEnergy shares gained ground on the Australian sharemarket after oil prices jumped again following a dramatic day on Wall Street where investors wiped $US357 billion ($506 billion) off Microsoft’s market capitalisation. The S&P/ASX 200 was up 22.1 points, or 0.3 per cent, to 894961 in early trade, with seven of 11 industry sectors in the green. Technology shares are the heaviest weight on the index. Company results have had a lot of influence on Wall Street’s direction this week. Bloomberg Energy stocks jumped as oil prices rose on worries tension between the United States and Iran could constrict the flow of crude. Defence Secretary Pete Hegseth warned the US military “will be prepared to deliver whatever the president expects,” just a day after President Donald Trump told Iran to “make a deal” on its nuclear program. Woodside Energy advanced 1 per cent and Santos gained 3.1 per cent in early afternoon trade. Shares in embattled gaming company The Star erased early gains to slump 11 per cent lower in early afternoon trade. In a quarterly update, the company posted $301 million revenue in the December quarter, a 6 per cent rise over the prior quarter, but warned of “numerous material” uncertainties.\n\nAdvertisement\n\nLocal tech shares suffered losses echoing a difficult night on Wall Street for tech giants following Microsoft’s 10 per cent tumble. WiseTech fell 1.6 per cent, Xero lost 1.4 per cent and Technology One retreated 2.2 per cent. Gold stocks retreated after the price of the safe haven metal fell sharply overnight. Gold, near $US5600 an ounce, suddenly and briefly dropped below $US5200 before advancing again to fetch around $US5427 at 10.36am AEDT. In early trade, Northern Star added 0.7 per cent, Evolution Mining fell 0.8 per cent and Newmont slipped 2.9 per cent. Among the iron ore heavyweights, BHP advanced 0.8 per cent, Rio Tinto added 0.6 per cent and Fortescue lost 1 per cent. Bank stocks are mixed. Westpac climbed 0.8 per cent in early afternoon trade, ANZ Bank added 0.5 per cent, National Australia Bank edged up 0.2 per cent while Commonwealth Bank dipped 0.1 per cent. Nine Entertainment, owner of this masthead, added 4.1 per cent after it struck a deal to sell Australia’s top-rating conservative talkback stations 2GB, 3AW, 4BC and 6PR to publican and pokies billionaire Arthur Laundy and his family for $56 million. Nine has also purchased outdoor media firm QMS for $850 million.\n\nAdvertisement\n\nThe Australian dollar was trading at US70.14¢ at 12.24pm AEDT. Related Article Opinion\n\nFederal Reserve Trump will be seeing red as the Fed refuses to bow down Stephen Bartholomeusz Senior business columnist Overnight, the S&P 500 slipped 0.1 per cent after flirting with its record high in the morning and dropping by as much as 1.5 per cent later in the day. The Dow Jones rose 55 points, or 0.1 per cent, after erasing an earlier loss of more than 400 points, and the Nasdaq composite fell 0.7 per cent. Microsoft was the heaviest weight on Wall Street by far. The tech giant plunged amid scepticism over how much the company is investing in artificial intelligence, despite reporting stronger profit and revenue for the latest quarter than analysts expected. It was the stock’s worst day since the market’s COVID-19 crash in 2020.\n\nAdvertisement\n\nApple’s iPhone sales soared to a new quarterly record during the holiday season, despite artificial intelligence blunders that prompted the technology trendsetter to get a helping hand from Google. Shares are up 1 per cent in after-hours trading. Microsoft tumbled 10 per cent with concerns rising about how much the company is investing in AI. Bloomberg Tesla weighed on the market after falling 3.5 per cent. It delivered a bigger profit for the latest quarter than analysts expected, but the results were sharply lower than from a year earlier. Tesla’s leader, Elon Musk, has been trying to get investors to focus less on its flagging car sales and more on the company’s robotaxis and robots. Companies across the market are under pressure to deliver at least solid growth in profits following record-setting runs for their stock prices. Stock prices tend to follow the path of corporate profits over the long term, and earnings need to rise to quiet criticism that stocks have grown too expensive. Still, more stocks rose within the S&P 500 than fell. Leading them was Meta Platforms, which rallied 10.4 per cent after the company behind Facebook, Instagram and WhatsApp topped profit expectations, even though it also said it will continue its massive investments in AI. IBM was another winner and climbed 5.1 per cent after surpassing analysts’ expectations for profit and revenue.\n\nAdvertisement\n\nRelated Article Opinion\n\nAI Robots, redundancies and runaway spending: Not all AI hits the mark Elizabeth Knight Business columnist Some of the wildest action in financial markets was again for precious metals. Silver, which has been zooming higher in its own feverish run, had a similar and sudden reversal of momentum before ticking higher again. Bitcoin, which is pitched as a form of “digital gold”, also fell sharply. It sank nearly 6 per cent and dropped toward $US84,000. On the bond market, the yield on the 10-year Treasury dipped to 4.23 per cent from 4.26 per cent late on Wednesday. With AP The Market Recap newsletter is a wrap of the day’s trading. Get it each weekday afternoon.\n\nSave You have reached your maximum number of saved items. Remove items from your saved list to add more. Share More: World markets\n\nShares\n\nWall Street",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/culture/movies/first-look-at-the-melania-trump-documentary-20260128-p5nxl7.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "First look at the Melania Trump documentary",
        "publish_date": "Fri, 30 Jan 2026 13:09:17 +1100",
        "category": "finance",
        "authors": [],
        "text": "Remove items from your saved list to add more.\n\nYou have reached your maximum number of saved items.\n\nSave this video for later\n\nAdd videos to your saved list and come back to them anytime.\n\nGot it",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/culture/live-reviews/flashback-to-marriage-equality-vote-evokes-tumult-of-a-devastating-time-20260128-p5nxok.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Flashback to marriage equality vote evokes tumult of a devastating time",
        "publish_date": "Fri, 30 Jan 2026 13:04:57 +1100",
        "category": "entertainment",
        "authors": [
            "Sonia Nair"
        ],
        "text": "Advertisement\n\nCultureLive reviewsMelbourne live reviews Flashback to marriage equality vote evokes tumult of a devastating time Sonia Nair January 30, 2026 — 1:04pm Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share A A A\n\nTHEATRE\n\nThe Placeholder ★★★\n\nfortyfivedownstairs, until February 8 The shared experience of grief has culminated in many an incisive theatre piece centred on chosen families navigating existential questions of loss, friendship and mortality – Domenica Feraud’s off-Broadway play Someone Spectacular and, closer to home, Ash Flanders’ Malthouse production This Is Living among them. The kitchen of matriarch Pat (Meredith Rogers, centre) becomes the focal point of The Placeholder. Darren Gill Ben MacEllen’s The Placeholder is the latest play to wade into thorny territory. We’re plunged headfirst into 2017, notably the year queer communities were subjected to a plebiscite on marriage equality. It’s a devastating time, illustrated by clips of real-life interviews and news segments showcasing the bigotry that was allowed to flourish. United by virtue of Barb’s Bosom Buddies – a fundraising collective dedicated to honouring the memory of namesake Barb, who died of breast cancer – five disparate people in the fictional rural town of South Bend find themselves meeting monthly to brainstorm badges, banners, cookies and muffins.\n\nAdvertisement\n\nRelated Article Performing arts What is it about this show that can prompt a lifetime of obsession? Matriarch Pat (Meredith Rogers) is a soft-spoken retiree whose kitchen becomes the focal point of the play, brilliantly materialised by Bethany J. Fellows’s set design. Helen (Michelle Perera) is a widow with a heart of gold and a penchant for baking. A proud lesbian, Keira (Rebecca Bower) self-medicates with alcohol to withstand living in a cloistered town. Barb’s niece Jo (Brigid Gallacher) is the conservative black sheep of the group. And sporty Nic (Oliver Ayres) used to go by Nicole, until they announce they’re transitioning into a man. The reprisal is swift. The elder members of the group, Pat and Helen, paradoxically take it in their stride, but Keira is incensed by the perceived loss of a lesbian peer, and Jo insists it’s all but a phase. The remainder of the play details the fallout of Nic continuously insisting on his personhood against bad-faith arguments and a gulf of miscomprehensions. As the kindest, most level-headed character, Helen is who most audiences will project themselves onto. But Perera, so brilliant in This Is Living, is also the strongest of the ensemble. Her comedic timing is impeccable as she expertly oscillates between empathetic displays of allyship and perfectly executed moments of humour that imbue the play with levity at key junctures. Pat (Meredith Rogers) and Nic (Oliver Ayres) in The Placeholder. Darren Gill\n\nAdvertisement\n\nFunctioning like a time capsule by virtue of being set nearly a decade in the past, The Placeholder provides a stage for various expressions of acceptance and opposition as the group muddles through supporting Nic. A cookie-cutter bigot, Jo’s views cover well-trodden, odious ground. But it’s Keira’s see-sawing between solidarity and gender essentialism and a self-victimisation that’s impervious to the marginalisation of others that’s harder to stomach – and altogether more interesting. Related Article Exclusive\n\nArts From a New York bathroom to regional Victoria: An exhibition of art’s heavy hitters is on its way MacEllen presents thought-provoking contrasts between desired gender-affirming care and unwanted life-saving surgery, gender and sexuality, mental deterioration and newly prized lucidity. But at close to three hours, The Placeholder is simply too long. MacEllen’s script retreads familiar ground in the play’s second act, which drags lugubriously to its emotional climax(es). The tenuous connecting thread of a makeshift charity doesn’t explain why these characters are so invested in one another, and why they tolerate unconscionable behaviour – particularly from Jo. As a result, the emotional payoffs are muted, hampered further by unnatural, dialogue-heavy exposition and uneven acting during key dramatic reveals. Much is left unresolved by close. Keira’s alcohol addiction continues to be the butt of jokes, Pat’s clear descent into dementia is unremarked upon. String-heavy interludes between scenes are peppered with a greatest hits compilation of what happened in the intervening years – good, bad, ridiculous. But the cacophony, so effective initially in illustrating the overwhelm of the plebiscite, overpowers the play by the end. The Booklist is a weekly newsletter for book lovers from Jason Steger. Get it delivered every Friday.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/tennis/aussie-duo-drop-first-set-20260130-p5nybi.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Aussie duo drop first set",
        "publish_date": "Fri, 30 Jan 2026 13:02:54 +1100",
        "category": "sports",
        "authors": [],
        "text": "Aussie duo drop first set\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/nsw/it-s-time-to-say-goodbye-hundreds-farewell-the-last-v-set-train-20260129-p5ny30.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘It’s time to say goodbye’: Hundreds farewell the last V-set train",
        "publish_date": "Fri, 30 Jan 2026 12:37:34 +1100",
        "category": "finance",
        "authors": [
            "Ellie Busby"
        ],
        "text": "Advertisement\n\nNationalNSWPublic transport ‘It’s time to say goodbye’: Hundreds farewell the last V-set train Ellie Busby January 30, 2026 — 12:37pm Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share A A A\n\nRail enthusiasts Crystal and Ben Parker, and their six-year-old son Luke, love historic trains. It’s why they stayed up all night to catch a train to Lithgow early on Friday morning in the hopes of getting a seat on the final V-set service through the Blue Mountains to Sydney. “We caught the last train that was leaving Central at 12.05am, we got on at Springwood at 1.40am, and we didn’t make it to Lithgow until five to four, something like that … and then we caught this train like everybody else at 5.45am. So last night’s trip was not pleasant,” Crystal said. Crystal Parker (left) with her husband Ben Parker and their sleeping son Luke Parker (right) on the last V-set train. Kate Geraghty But the lack of sleep was worth it for the family, even young Luke, who enjoyed the journey for the first few stations before promptly falling asleep. It was an experience shared by many rail enthusiasts who turned up in the hundreds to take one last journey among the bush plum seats. The 55-year-old fleet has been replaced by the modern Mariyung trains.\n\nAdvertisement\n\n“It’s honestly a little sad because this train has been in service for so long, but it’s also pretty exciting to be on the last service,” said Zedd Spencer, aged 10. David Spencer with his son Zedd Spencer, who were excited to be on the last V-set train. Kate Geraghty The V-set train was freshly sprayed in the classic Blue Goose livery of royal blue and grey for its final run. The train had already reached capacity by the time it reached the lower Blue Mountains, forcing it to skip stations at both Blaxland and Glenbrook, much to the disappointment of the rail enthusiasts who were waiting at the platforms. At every station that followed, more V-set fans fought to get on board, with the train at standing room only. One excited young passenger who managed to get on at Parramatta was seven-year-old Sayan Poudel, whose in-depth knowledge of the V-set’s history impressed even some of the older fans of the train service sitting nearby.\n\nAdvertisement\n\nSayan Poudel and his mum Sarita Nepali boarded the train from Parramatta. Kate Geraghty “These trains operated since 1970 and have been serving the line until 2026,” he said. “It’s time to say goodbye to the V-sets.” But not everyone was as excited about the train’s final journey. Regular commuter Kristine Thompson was confused when she saw how busy the platform was and the “amusing characters and influencers” who were on board. Crowds at Central Station welcome and disembark from the train. Kate Geraghty “Not since before COVID have I seen the platform that busy,” she said.\n\nAdvertisement\n\nThe V-set used for the final service will be retained for heritage purposes, but the future of the remaining 81 retired V-set carriages is still to be determined. Related Article Public transport ‘Sad day’: End of line for NSW’s beloved steel rattlers When the train pulled into Central Station for the final time, rapturous applause and cheers were heard onboard. On the platform, rail enthusiasts of all ages gathered to take photos of the train, with a few of the younger passengers shedding some tears. A band played music to celebrate the train’s arrival, as the V-set service closed its doors for the final time. Start the day with a summary of the day’s most important and interesting stories, analysis and insights. Sign up for our Morning Edition newsletter.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/tennis/shes-coming-back-serena-masterplan-unpacked-20260130-p5nyb3.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "'She's coming back:' Serena 'masterplan' unpacked",
        "publish_date": "Fri, 30 Jan 2026 12:37:27 +1100",
        "category": "finance",
        "authors": [],
        "text": "'She's coming back:' Serena 'masterplan' unpacked\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/business/companies/premier1-locks-up-hot-property-in-wa-gold-land-grab-20260130-p5nyau.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Premier1 locks up hot property in WA gold land grab",
        "publish_date": "Fri, 30 Jan 2026 12:33:24 +1100",
        "category": "finance",
        "authors": [
            "Andrew Todd"
        ],
        "text": "Advertisement\n\nSponsored BusinessCompaniesBulls N' Bears Premier1 locks up hot property in WA gold land grab Brought to you by BULLS N’ BEARS Andrew Todd January 30, 2026 — 12:33pm Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share A A A\n\nPlucky ASX-listed gold junior Premier1 has locked up full ownership of one of the Yalgoo greenstone belt’s last remaining gold packages in Western Australia, not already in the hands of a multi-billion dollar gold producer. The company says it has secured complete control over 266 square kilometres of prime Yalgoo real estate, as the relentless WA gold consolidation by district majors continues to unfold and gold jumps to a monstrous price of US$5500 (A$7800) an ounce. Reverse circulation drilling underway at Premier1’s Yalgoo gold project. The deal completes the final piece in Premier1’s evolving WA gold narrative, positioning the company as the remaining independent player in a greenstone belt tug-of-war between the $9.7 billion Ramelius Resources and the $7.3 billion Capricorn Metals. The company and its high-grade Wadgingarra gold prospect are now sitting pretty, with a 13,000-ounce starter resource grading an enticing 2.7 grams per tonne (g/t) gold at the top end of the Yalgoo-Singleton greenstone belt.\n\nAdvertisement\n\n‘These transactions simplify the ownership structure and grant the Company full control’ Premier1 executive director Simon Phillips Ramelius holds most of the northern flank after its mid-2025 acquisition of Spartan Resources for a lazy $2.4 billion, while Capricorn has steadily expanded south thanks to a $188 million Warriedar-Golden Range acquisition and a landgrab of Tempest’s ground in December of last year. Premier1 says its tenure sits squarely in the middle of these two players and shares all the same shears and geological signatures that have made the underexplored region so very valuable to all its neighbours. Newly appointed Premier1 executive director Simon Phillips said: “Consolidating 100% ownership of Yalgoo represents a significant strategic milestone for Premier1. These transactions simplify the ownership structure and grant the Company full control over exploration, development and capital allocation decisions across a highly prospective gold portfolio.” Yalgoo is a district long recognised for its high-grade orogenic gold and copper potential. The project runs along strike from the world-class Golden Grove base metals operation, which has been successfully operating for the better part of half a century and from the more recent discoveries at Capricorn Metals’ Golden Range gold-antimony project to the south.\n\nAdvertisement\n\nPremier1’s Yalgoo project lies just 10 kilometres southeast of Ramelius’ Melville and Applecross prospects, which host some 5.2 million tonnes of resource at 1.4 g/t for 244,000 ounces. This ground was the focus of much of Spartan Resources’ exploration and prospectivity before the multi-million-ounce discovery of Never Never at its Dalgaranga project stole the show to the Northeast. Needless to say, there remains plenty of unfinished business in the northern reaches of the Yalgoo-Singleton. 29Metal’s Golden Grove base metals operation within the Yalgoo greenstone belt has been successfully operating for more than 35 years. Premier1’s flagship Wadgingarra prospect at Yalgoo anchors the project, where a maiden resource of 13,000 ounces sits within a conservative Whittle-optimised pit shell drawn up last year. The high-grade gold starts at surface at site and remains open along strike and at depth. The company says limited exploration has been conducted to define its high-grade resource, with historical shallow drilling averaging just 46m in depth at the project, focused only on oxide zones near old workings. Premier1’s maiden reverse-circulation program in early 2025 marked the first substantial modern drilling at the ground since the 1980’s. That’s a staggering amount of time considering the inherited high-grade near-surface intercepts up to 5 metres at 5.1g/t gold, 10 metres at 6.4 g/t gold and 2 metres at 20.8 g/t gold.\n\nAdvertisement\n\nNot surprisingly, then, the newer rod spin last year not only confirmed the presence of gold but also delivered some of the strongest intercepts recorded on the project. At its Crescent prospect in the north, one hole returned a staggering 3m hit running 31.5g/t gold from just 97m, including 1m at 91.9g/t gold, confirming bonanza-grade potential along trend from historical high-grade zones. At the company’s Carlisle prospect to the south, drilling extended mineralisation eastward with a 10-metre hit grading a handy 3.1g/t gold from 19m, including 7m at 4.3 g/t gold. A new zone west of Olive Queen also intersected mineralisation for the first time, with 1m at 1.5g/t gold within broader anomalous intervals and pathfinder support. The results were a fantastic first go at the ground, built directly on systematic work by Premier1. The intercepted structures identified from high-resolution magnetics and rock-chip sampling were full of high-grade gold.\n\nAdvertisement\n\nThe company says it’s eager to get back onto the ground and test its litany of litho-structural targets, including its fast-emerging Mt Kersey prospect in the East. Work at Mt Kersey has turned up a multi-kilometre pathfinder soil anomaly that coincides with double-digit gold grades from rock chips in what the company says is a complex structural setting linked to quartz-dolerite and gabbro rocks similar to regional gold systems. Premier1 boasts some 25kms of proven shear at Wadgingarra, where the shear trends under cover for kilometres to the south, offering scope for regional aircore and magnetics to chase previously overlooked district-scale extensions. The company, however, is far from a one-trick pony. Its second major project – Abbotts North - lies up the road in perhaps one of WA’s most active gold regions, along the Meekathara-Murchison greenstone belt. The project is a key second pillar to the company’s portfolio and sits just 35km north of Meekatharra in the Abbotts greenstones.\n\nAdvertisement\n\nIt is also just 20 kilometres from ASX-darling New Murchison Gold’s Crown Prince deposit, which has propelled that company’s market capitalisation towards A$800 million after making the high-grade discovery just 2 years ago. Rochefort – the flagship prospect at Abbotts North – sits along strike from New Murchison and has emerged as a priority walk-up target, thanks to a 350m-by-350m gold anomaly above a dolerite host rock. Heritage clearances are advancing for a planned regional aircore drill program and an ultrafine soil sampling campaign later in the year, both backed by an existing $180,000 EIS government grant and a $180,000 drill credit with Strike Drilling, all waiting in Premier1’s back pocket. The company’s prime ground is now paired with renewed corporate drive, as experienced gold hand Simon Phillips takes the reins. With a career spanning discovery to development, his promotion comes alongside a $650,000 raise to sustain exploration momentum into 2026. Also joining the revitalised company is Mr Dale Hanna. A chartered accountant with more than 20 years of experience across ASX-listed resource companies, his background spans the full spectrum of mining operations from early-stage exploration through to production.\n\nAdvertisement\n\nJoining Hanna and Phillips on the board, previous managing director Jason Froud - who helped steer Premier1 through its strategic pivot from lithium to gold – will stay on, transitioning to a non-executive director role. Boasting shallow high-grade gold at Wadgingarra, walk-up targets at Mt Kersey and numerous processing options in the region, the company’s Yalgoo gold tilt looks to be only beginning. As majors build empires to the north and south of both the company’s projects, Premier1 and its expanding resources could soon add even more shine to the region’s reputation. For now, though, the gold minnow - capped at just $6.5 million - is looking at a fresh new chapter of drilling in 2026 and hopeful it can turn that potential into reality. Is your ASX-listed company doing something interesting? Contact: mattbirney@bullsnbears.com.au\n\nSave You have reached your maximum number of saved items. Remove items from your saved list to add more. Share More: Bulls N' Bears\n\nSharemarket\n\nShares",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/politics/queensland/why-queensland-public-servants-could-pocket-a-wage-jump-20260129-p5ny2t.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Why Queensland public servants could pocket a wage jump",
        "publish_date": "Fri, 30 Jan 2026 12:12:38 +1100",
        "category": "finance",
        "authors": [
            "Matt Dennien"
        ],
        "text": "Advertisement\n\nPoliticsQueenslandQueensland government Why Queensland public servants could pocket a wage jump Matt Dennien January 30, 2026 — 12:12pm Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share A A A\n\nMore than 100,000 Queensland public servants are on track to pocket an inflation-driven pay bump of up to $500, heaping further pressure on the state’s ballooning debt. Following higher-than-expected inflation figures this week in which Brisbane led the nation on 5.2 per cent, analysis suggests several workforces are set for a topped-up annual wage rise. Queensland public servants could be in for a wage boost. Matt Dennien The potential for inflation uplift included in state wage deals inked last year forced the Crisafulli government to set aside $169 million in its December budget update – amid concern from ratings agencies and economists. Bargaining concessions from government last year added $345 million above the budgeted cost of its blanket wage policy, dictating rises of 3 per cent in 2025-26, and 2.5 per cent in the following two years of the deals.\n\nAdvertisement\n\nBut the finalised deals spanning police, firefighters, paramedics, nurses, doctors, health administration staff, and non-teaching school staff and others, also featured potential inflation-related pay bumps. Should the March inflation figure for Brisbane pass the agreed pay rise for that financial year, pay will instead be matched to inflation – to a 2025-26 cap of up to 0.5 per cent. Queensland Treasurer David Janetzki blamed the inflation spike on the end of electricity rebates. Renee Nowytarger For a public servant on the average sector salary of about $100,000, this could add up to $500 to their base annual pay. Any inflation-adjusted increase to pay rises will also be backdated across the entire financial year, and form the base pay rate from which future rises are also calculated.\n\nAdvertisement\n\nIndependent economist Saul Eslake said while the December quarter spike in Brisbane inflation was essentially an anomaly caused by energy rebates ending, the March figure was likely to be above the 3 per cent pay bump trigger. Related Article Queensland budget Qld avoids credit rating downgrade. But state’s books ‘remain grim’ He said that meant the spike was essentially caused by the former Miles government’s extensive pre-election rebates, criticised by some as an inflation-driving attempt to buy votes. Because of this, he believed it was “ludicrous that the unwinding of that is the catalyst for the paying of more taxpayer money to a smaller group of public servants”. “I would think the Queensland government probably needs to prepare itself to have a stoush over that,” Eslake told this masthead.\n\nAdvertisement\n\n“Queensland isn’t in the worst [budget] position of Australian states … but Queensland’s financial position has deteriorated quite significantly from what was the best in the country. “And this would be another serious blow to that.” Treasurer David Janetzki’s office stressed the headline annual inflation rise in Queensland to November was below the national headline figure, which meant the growth revealed this week was caused by short-term factors – primarily the end of electricity rebates. He also criticised Labor for enacting temporary cost-of-living measures, saying his government was “doing its bit to ease cost pressures facing families”. Deputy Opposition Leader Cameron Dick blamed the government for high inflation and said while the extra pay bump might help some, many people were struggling.\n\nAdvertisement\n\n“David Crisafulli is delivering the highest state inflation in the country as his affordability crisis deepens, and it will cost the state’s budget hundreds of millions of dollars,” he said. While in government, Labor had argued its power bill rebates had helped ease inflation by reducing the electricity bill element of the official figures. In December, the state government revealed in its midyear budget update the state operating balance fell almost $400 million further into deficit. Start the day with a summary of the day’s most important and interesting stories, analysis and insights. Sign up for our Morning Edition newsletter.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/culture/movies/melania-documentary-screenings-delayed-at-last-minute-20260130-p5ny90.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Melania documentary screenings delayed at last minute",
        "publish_date": "Fri, 30 Jan 2026 11:57:19 +1100",
        "category": "finance",
        "authors": [
            "Karl Quinn"
        ],
        "text": "Add articles to your saved list and come back to them anytime.\n\nAustralian political (and fashion) junkies champing at the bit for an early look at the documentary Melania have been dealt a blow, with Friday morning screenings of the Brett Ratner-directed film suddenly disappearing from the schedule.\n\nBut hold your horses, conspiracy theorists: rather than censorship being at play, it appears that the delay is due to a simple case of poor communication.\n\nPresident Donald Trump and first lady Melania Trump arrive for the premiere of her documentary Melania at the renamed Trump Kennedy Centre in Washington. AP\n\nThe film, which follows the 20 days leading up to Donald Trump’s return to the White House in January last year, is getting a short cinema run before dropping on the Prime Video platform. Amazon reportedly paid $US40 million for the right to distribute it (with $US28 million of that going straight to its subject), and another $US35 million to promote and market.\n\nThe tech giant paid $US26 million more for the film than Disney, its closest rival bidder, prompting some speculation that the company is attempting to curry favour with the Trump administration by paying well over the odds for what is essentially a vanity project.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/business/the-economy/you-re-paying-for-someone-else-s-profit-here-s-how-we-claw-it-back-20260129-p5nxzu.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "You’re paying for someone else’s profit. Here’s how we claw it back",
        "publish_date": "Fri, 30 Jan 2026 11:55:00 +1100",
        "category": "finance",
        "authors": [
            "Millie Muroi"
        ],
        "text": "Advertisement\n\nBusinessThe economyCarbon pricing Opinion You’re paying for someone else’s profit. Here’s how we claw it back Millie Muroi Economics Writer January 30, 2026 — 11:55am\n\nJanuary 30, 2026 — 11:55am Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share A A A\n\nWhat if I told you that you’re paying for someone else to make money? It might not be in the form of a bill sent to your home, or a bite taken out of your payslip every fortnight, but nearly all of us are paying a big cost we shouldn’t be. The problem is: it’s not really visible unless you know about it. It’s not too late to take inspiration from countries such as Norway, which has – largely through its taxing of resources – built up the world’s largest sovereign wealth fund. Matt Davidson You’ve probably heard plenty about the need to tax resources companies more: not just for the pollution they pump into the atmosphere and damage they cause to the environment, but also because they’re effectively making money out of digging up rocks, metals and gasses which don’t belong to them.\n\nAdvertisement\n\nOf course, there’s an argument they don’t really belong to any of us, except Aboriginal and Torres Strait Islander people who have looked after the land for centuries before colonisation. But as long as companies are continuing to mine resources, it makes sense for them to pay for the privilege – and to pay an amount that properly compensates for the damage caused by their businesses. It also makes sense for us to incentivise them to clean up their act. That’s where the Superpower Institute (started by economist Professor Ross Garnaut and former competition watchdog head Rod Sims) kicks in. They may not have found a way to harness superpowers such as invisibility, but they (and experts Dr Ingrid Burford and Dr Reuben Finighan) have found a way to rein in the invisible villain that is greenhouse gas emissions. As their new report explains, between 2020 and 2023, Australia’s state and federal governments took 30 per cent of fossil fuel companies’ profits (mostly through a patchwork of corporate tax, royalties and the Petroleum Resource Rent Tax).\n\nAdvertisement\n\nThat might seem like a decent chunk, but it’s much less than the 75 to 90 per cent that other major fossil fuel exporting countries claw back, and not nearly enough to make up for the costs of pollution or to move us towards net zero fast enough. If we continue as we are, we’ll struggle to fund essential services and to lift spending on education, new technologies and infrastructure: things we need to do if we’re going to boost productivity. Meanwhile, as natural disasters become more frequent, our insurance costs are going up, and we’re paying more at the checkout every time severe droughts or floods wipe out our farmers’ harvests. It also comes at a time when the country needs a stronger budget to prepare for the bigger health and aged care bills that will come with an ageing population, to shield us from international shocks, and lift our living standards. Budget deficits are not always bad, but always having budget deficits is, and we’re still a decade away from returning to surplus.\n\nAdvertisement\n\nIf we continue as we are, we’ll struggle to fund essential services and to lift spending on education, new technologies and infrastructure: things we need to do if we’re going to boost productivity (our ability to produce and do things better, faster or using fewer resources). Related Article Updated\n\nEnergy ‘Landmark moment’: Renewables’ record surge sends power prices tumbling Luckily, there’s a big group of companies that can play a big role in this – but how do we get them to cough up? Right now, we rely on policies such as the “safeguard mechanism” where the country’s biggest industrial facilities are forced to limit their emissions (and, if they emit more than they’re allowed to, to pay for emission-reducing projects by buying “carbon credits”). There are several problems, though.\n\nAdvertisement\n\nThe mechanism allows companies to buy their way out of actually reducing their own emissions, and often, the “credits” they buy can be for projects that don’t actually make as much difference as they claim, or projects which would have gone ahead anyway – and it fails to generate any government revenue. Instead, the first policy proposed by the Superpower Institute is a “polluter pays levy” – or PPL – which would apply to coal, oil and gas extracted and consumed in Australia, and to fossil fuel imports including oil, petrol and diesel. For example, a company that mines and sells black coal would pay a levy for the methane released during their mining process and the carbon dioxide released when the coal is combusted to produce electricity. The levy would start this year at $17 for every tonne of CO2 – or equivalent amount of another greenhouse gas – rising gradually until it hits the European Union’s carbon price in 2034, then continue tracking the EU carbon price. It would cover more than 80 per cent of Australia’s emissions, would be more straightforward and difficult to game than current policies, and raise nearly $23 billion of revenue on average every year.\n\nAdvertisement\n\nThat’s important because while Australians tend to support policies and actions to reduce emissions, we’re sensitive to cost-of-living pressures such as energy bills. Most of us want to do the right thing, but when it costs us more, we might think twice. The revenue from the levy would partly be used to reimburse households for higher energy costs – even generating enough to over-compensate them. Whether $330 a year, as proposed by the institute, is enough for households to feel they are better off is up for some debate. But if polling is anything to go by, it’s a policy that has a decent amount of public support. More than 60 per cent in a survey of 3000 voters (conducted by Redbridge Research for the Superpower Institute) agreed or strongly agreed with a polluter-pays levy. Overall, the institute reckons compensation for households would cost about $4.1 billion a year on average: less than one quarter of the revenue raised from the levy. Small businesses would also receive $325 a year, and compensation for households could be more targeted, starting at $490 a year for the bottom 75 per cent of households by income.\n\nAdvertisement\n\nThe levy would also crucially help reduce Australia’s annual carbon emissions by about 2.3 times more than under current policies according to the research. Related Article Opinion\n\nAI Robots, redundancies and runaway spending: Not all AI hits the mark Elizabeth Knight Business columnist The institute also suggests a “fair share levy” on gas exports, mirroring the system Norwegians have in place. The existing Petroleum Resources Rent Tax, introduced in the 1980s, doesn’t work very well, especially for Australia’s liquefied natural gas industry. Why? In short: because gas projects usually take decades (and a lot more money) to build than oil projects. Gas extracting companies can deduct these building costs (which they can carry across from one year to the next, and which can balloon every year to account for interest and inflation), effectively leaving them tax-free – sometimes forever.\n\nAdvertisement\n\nInstead, the fair share levy, which would collect 40 per cent of the large profits that gas companies pocket over time, would be based on expenses and revenues companies face within the year. The government would take a fixed share of profits or losses each year, with a tax refund given to companies in a loss-making year. Since profits from the Australian oil and gas industry overwhelmingly flow to foreign shareholders, taxing these profits means Australians will be better off, with the annual benefit – at its peak – being about $1500 for every Australian household. The tax revenue generated from the two levies – averaging nearly $36 billion each year – could be used not only to compensate households and get the budget in better shape to fund essential services, but to invest in green industries where Australia has a competitive edge over many other countries. While we can’t claw back the resources, emissions or money we’ve let float by us, it’s not too late to take inspiration from countries such as Norway, which has – largely through its taxing of resources – built up the world’s largest sovereign wealth fund. Perhaps most crucially, if we act now, we can set ourselves up to be a superpower in the global green transition. The Business Briefing newsletter delivers major stories, exclusive coverage and expert opinion. Sign up to get it every weekday morning.\n\nSave You have reached your maximum number of saved items. Remove items from your saved list to add more. Share License this article More: Carbon pricing\n\nOpinion Millie Muroi is the economics writer at The Sydney Morning Herald and The Age. She was formerly an economics correspondent based in Canberra’s Press Gallery and the banking writer based in Sydney. or email. Connect via X",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/environment/conservation/australia-s-bid-to-persuade-the-un-the-great-barrier-reef-is-doing-better-20260130-p5ny87.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Australia’s bid to persuade the UN the Great Barrier Reef is doing better",
        "publish_date": "Fri, 30 Jan 2026 11:53:56 +1100",
        "category": "finance",
        "authors": [
            "Bianca Hall"
        ],
        "text": "Advertisement\n\nEnvironmentConservationGreat Barrier Reef Australia’s bid to persuade the UN the Great Barrier Reef is doing better Bianca Hall January 30, 2026 — 11:53am Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share A A A\n\nThe federal government has launched a spirited defence before the international community of its efforts to protect the Great Barrier Reef, in its latest bid to avoid the reef being listed as “in danger”. In 2021 the United Nations Educational, Scientific and Cultural Organisation (UNESCO) issued a draft recommendation that the Great Barrier Reef should be listed as an “in danger” World Heritage site. Bleached coral on the Great Barrier Reef. AP Since then Australia has been locked in a multi-year battle to prevent that listing taking effect, a listing it says could place thousands of jobs at risk, particularly in tourism. Last year UNESCO’s World Heritage Committee ordered a full review of Australia’s management of the Great Barrier Reef, following the sixth mass bleaching event in nine years.\n\nAdvertisement\n\nThe body identified four areas of concern: climate pollution, water quality, climate-driven disasters like mass bleaching, and fisheries management. The government estimates the Great Barrier Reef contributes more than $9 billion a year to the Australian economy and, as the nation’s fifth-biggest employer, supports 77,000 jobs. Coral scientists capture larvae during this year’s annual coral spawning on the Great Barrier Reef. The Reef Co-Operative “There’s no doubt that the Great Barrier Reef is under extreme pressure from a range of factors like climate change, crown-of-thorns starfish, again, still issues around sediment run-off and reef water quality,” Environment Minister Murray Watt told ABC radio on Friday morning. “But what we can also say is that the actions that both levels of government, along with the broader community, are taking are making the reef more resilient towards those changes.”\n\nAdvertisement\n\nResponding to UNESCO, the government on Friday released a state party report on the steps it has undertaken to protect the reef’s ecosystems, in a bid to maintain the reef’s listing of Outstanding Universal Value. The report emphasised the significant amendments to federal environment laws, passed with the support of the Greens last year, as a key measure that would help protect the reef. It also highlighted the government’s decision to increase Australia’s emissions reduction targets and reduce land-clearing within 50 metres of a watercourse, wetland or drainage line in the reef catchment area. The Great Barrier Reef is under threat. iStock The federal government has spent $1.2 billion to help build the reef’s resilience and says its total investment – in partnership with the Queensland government – is more than $5 billion since 2014. Watt said the reef was one of the best-managed reef systems in the world and that Australia had not just met every commitment it has made to protect the reef but gone further.\n\nAdvertisement\n\nRelated Article Australia votes Great Barrier Reef bleaching turns up heat in key Coalition seat The Australian Marine Conservation Society’s Great Barrier Reef campaign manager Dr Lissa Schindler said the government had taken positive steps to improve the reef’s health but had not gone far enough. “Yes, they are pushing forward with renewable energy projects, but they’re also pushing forward with fossil fuel projects, and fossil fuels, like oil and coal and gas, is what is actually driving climate change,” she said. “Australia’s climate target is not in line with 1.5 degrees [of warming], which is what is needed for coral reefs to survive.” When UNESCO first signalled its intention to delist the reef of its Outstanding Universal Value status in 2021, the then-Morrison government acknowledged that climate change was the single greatest threat to its survival but insisted that only global action to reduce emissions would have any meaningful impact.\n\nAdvertisement\n\nIt noted that Australia’s emissions comprised just 1.3 per cent of the global total and said that “Australia’s efforts to reduce its own emissions would have virtually no impact on the long-term health and resilience of the reef”. The Albanese government has sought to emphasise Australia’s stronger emissions reductions commitments under Labor. Under the Paris Agreement, Australia has set a target to reduce greenhouse gas emissions by 62-70 per cent below 2005 levels by 2035 – a measure Watt described as “ambitious and achievable”. The federal government has also argued the Great Barrier Reef is not alone in experiencing mass bleaching events, which have affected coral reefs worldwide as climate change drives ocean temperatures up. In a letter to UNESCO World Heritage Centre director Lazare Eloundou Assomo, Watt pointed out the 2023-2024 bleaching event had also affected more than 84 per cent of the world’s coral reefs in more than 80 other countries and territories. “In submitting this report, I want to strongly reiterate that Australia’s management of the [Great Barrier] Reef is recognised as world-leading and our impactful and adaptive actions remain integral to protecting this World Heritage property’s Outstanding Universal Value into the future,” Watt wrote.\n\nAdvertisement\n\n“Australia continues to act on its commitments under the Paris Agreement to tackle climate change and remains willing to lend our substantial expertise to other countries with climate-affected World Heritage sites.” The World Heritage Committee will consider Australia’s response at a session to be held in July. If it deems Australia’s response is insufficient, it will then consider listing the reef as “World Heritage In Danger”. Get to the heart of what’s happening with climate change and the environment. Sign up for our fortnightly Environment newsletter.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/nrl/game-on-how-your-nrl-team-is-shaping-up-for-season-2026-20260126-p5nwyz.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Game on: How your NRL team is shaping up for season 2026",
        "publish_date": "Fri, 30 Jan 2026 11:52:19 +1100",
        "category": "sports",
        "authors": [
            "Robert Dillon"
        ],
        "text": "Haas, the NSW, former Kangaroos and now Samoa bulldozer, is off contract at the end of 2026, but reports suggest he is close to signing a 12-month extension, taking him through to the end of 2027. By then, Haas will be 28 and, if the proposed R360 rugby competition gets off the ground, he could be tempted by riches beyond anything available in the NRL. Alternatively, he could be precisely the type of marquee signing the Perth Bears will come chasing. Brisbane will want to retain Payne Haas beyond the 2026 season. Credit: Getty Images The Broncos would no doubt love to re-sign Haas to a long-term deal. The ageing legs of halves Ben Hunt and Adam Reynolds don’t have many more tomorrows left. Haas, on the other hand, is a franchise player, at the top of his game.\n\nKey gains: Aublix Tawha (Dolphins), Grant Anderson (Storm), Tom Duffy (Cowboys).\n\nKey losses: Selwyn Cobbo (Dolphins), Kobe Hetherington (Sea Eagles), Tyson Smoothy (Wakefield)\n\nComing off contract: Adam Reynolds, Ben Hunt, Gehamat Shibasaki, Billy Walters, Jack Gosiewski, Payne Haas, Cory Paix, Jesse Arthars. Storm (runners-up) Harry Grant comes to terms with another grand final loss. Credit: NRL Photos What’s the story? First Ryan Papenhuyzen and Nelson Asofa-Solomona announced they were taking sabbaticals. Next Eliesa Katoa suffered a horrific concussion playing for Tonga that will sideline him for 2026 at least, and then the Perth Bears swooped to sign Nick Meaney and Tyran Wishart for their 2027 foundation season.\n\nAll this, on top of losing back-to-back grand finals, does not augur well, but the Melbourne Storm are no ordinary team. Nonetheless, it shapes as a bit of a rebuilding operation, and nobody is better qualified to oversee the process than Craig Bellamy, arguably the greatest coach in the game. Of course, the big question remains: how long will 66-year-old Bellamy continue? He has been quite content to sign one-year extensions, while hinting retirement is not far away. Players are replaceable, but Melbourne must be dreading the day “Bellyache” informs them he’s pulling the pin. They’ll be hoping his era continues beyond this season. Key gains: Jack Hetherington (Knights), Davvy Moale (Rabbitohs), Manaia Waitere (Raiders)\n\nKey losses: Ryan Papenhuyzen, Nelson Asofa-Solomona (both released), Jonah Pezet (Eels), Grant Anderson (Broncos)\n\nComing off contract: Will Warbrick, Shawn Blore, Jack Hetherington, Tui Kamikamica.\n\nPanthers (preliminary final) It’s back to square one for Penrith after Brisbane ended their dynasty in last year’s preliminary final. Credit: Getty Images What’s the story? Compared to the spotlight they commanded during their four-year reign as champions, the Panthers have spent the off-season flying under the radar, which no doubt suits coach Ivan Cleary just fine. Rival teams, however, are entitled to be nervous: how hungry will the deposed champions be after surrendering their title?\n\nComplacency can bring even the greatest of teams undone, once they’ve been there, won that, on multiple occasions. Do they have the willpower to get back up there? Nathan Cleary, the ultimate competitor and perfectionist, will surely relish the challenge. Beware the Panthers. They’re not done yet. Key gains: Jack Cogger (Knights), Tom Ale (Warriors), Freddy Lussick (Warriors)\n\nKey losses: Brad Schneider (Dolphins), Daine Laurie (Raiders), Mavrik Geyer (Tigers), Trent Toelau (Storm), Soni Luke (Cowboys)\n\nComing off contract: Scott Sorensen, Luke Garner, Lindsay Smith, Matt Eisenhuth, Tom Ale. Sharks (preliminary final)\n\nThe Sharks were furious with the performance of referee Ashley Klein in last year’s preliminary final. Credit: Getty Images What’s the story? Shark Park was a hive of activity last week, on and off the field. As Cronulla’s players completed a gruelling training session under the eye of coach Fitzgibbon, tradesmen were just as hard at work in the adjoining building site. It is hoped they will have completed the fit-out of the leagues club redevelopment by mid-to-late 2026, allowing the Sharks to reopen for the first time in six years, after myriad construction delays.\n\nThey’ll be hoping it improves their financial position to the point where they can apply for government funding for a centre of excellence, which would put them on level footing with their Sydney-based NRL rivals. Meanwhile, Fitzgibbon and his very settled squad are not satisfied with back-to-back appearances in preliminary finals. Old-school training facilities might yet provide the steely edge that helps them claim the ultimate prize. Key gains: None\n\nKey losses: Daniel Atkinson (Dragons), Kade Dykes (Bulldogs)\n\nComing off contract: Cam McInnes, Siosifa Talakai, Sione Katoa, Jesse Ramien, Sam Stonestreet, Toby Rudolf, Will Kennedy, Braden Hamlin-Uele, Billy Burns. Raiders (semi-finalists) The Canberra Raiders won the minor premiership but lost both play-offs. Credit: Getty Images\n\nWhat’s the story? Coach Ricky Stuart is set to give 22-year-old Ethan Sanders first shot at steering the Raiders after the departure of halfback Jamal Fogarty. Stuart has plenty of faith in Sanders, who has played four NRL matches across the past two seasons with the Raiders and Eels. Sanders is also a handy goalkicker, which could make him a like-for-like replacement for Fogarty, now at Manly. And he’ll have the perfect mentor in Stuart, one of the greatest halfbacks of all time.\n\nStuart guided the Green Machine to the minor premiership last season, but heartbreak followed when they bowed out of the finals with back-to-back defeats. They’ll be primed to give a better account of themselves this year at the business end of proceedings. Key gains: Jayden Brailey (Knights), Daine Laurie (Panthers), Coby Black (Broncos), Sione Finau (Dragons)\n\nKey losses: Jamal Fogarty (Sea Eagles), Trey Mooney (Knights), Pasami Saulo (Knights), Danny Levi (Leeds)\n\nComing off contract: Josh Papali’i, Morgan Smithies, Chevy Stewart Bulldogs (semi-finalists) The Bulldogs contemplate their season-ending defeat against the Panthers. Credit: NRL Photos What’s the story?\n\nAs the first major signing of Canterbury’s rebuild, Matt Burton has been both a catalyst for change and a cornerstone of their success the past two seasons. Burton’s form last year was as good as ever, yet there is already speculation that he will be squeezed out at the end of this season, despite being contracted until the end of 2027. The theory goes that the Bulldogs want Lachlan Galvin to play five-eighth, his natural position, and they have a promising young half waiting in the wings called Mitchell Woods. Whether Burton is the odd man out remains to be seen, but if he wants to win a premiership with Canterbury – to add to the one he collected at Penrith – there’s no time like the present. After finishing third last season before exiting the finals in straight sets, the Bulldogs will be hoping former Knights prop Leo Thompson can give them a new dimension.\n\nKey gains: Leo Thompson (Knights), Kade Dykes (Sharks), Sean O’Sullivan (Dolphins), Fletcher Baker (Broncos)\n\nKey losses: Reed Mahoney (Cowboys), Toby Sexton (Catalans), Blake Wilson (Sea Eagles)\n\nComing off contract: Connor Tracey, Daniel Suluka-Fifita, Jake Turpin, Kurt Mann, Marcelo Montoya. Warriors (finalists) Luke Metcalf was leading the 2025 Dally M count before he suffered a season-ending knee injury in June. Credit: Getty Images What’s the story? Coach Andrew Webster will be sweating on the return of co-captain Mitch Barnett and halfback Luke Metcalf from season-ending knee reconstructions.\n\nBefore the loss of NSW and Kangaroos forward Barnett last June, the Warriors had won nine of their first 12 games and were sitting second on the ladder. Metcalf, who was leading the Dally M voting, was sidelined soon after, and Webster’s men eventually limped home in sixth position, before being bundled out by Penrith in week one of the play-offs. Barnett hopes to launch his comeback inside the first few rounds. Metcalf is aiming for round seven. The Warriors are expecting big things from new signing Alofiana Khan-Pereira, who was a prolific try-scorer at the Gold Coast. And Barnett has also tipped English forward Morgan Gannon to make an immediate impact. Main gains: Alofiana Khan-Pereira (Titans), Morgan Gannon (Leeds)\n\nMain losses: Bunty Afoa (Tigers), Freddy Lussick (Panthers), Tom Ale (Panthers)\n\nComing off contract: Roger Tuivasa-Sheck, Kurt Capewell, Marata Niukore, Chanel Harris-Tavita, Rocco Berry, Te Maire Martin, Tanah Boyd.\n\nRoosters (finalists) Roosters skipper James Tedesco and new recruit Daly Cherry-Evans. Credit: Peter Rae What’s the story? Can Daly Cherry-Evans emulate Cooper Cronk and become a premiership-winning talisman with the Roosters? The former Manly skipper might be the oldest player in the NRL, turning 37 before the season kicks off, but he is likely to turn the Chooks into contenders again. The DCE coup has commanded so much attention it is easy to forget the Roosters have also signed the incumbent NSW hooker, Reece Robson, from the Cowboys.\n\nAdding further depth to an imposing squad, Tommy Talau (Manly) and Cody Ramsey (St George Illawarra) are waiting in the wings, in case Trent Robinson loses any of his outside backs to injury. On the flip side, Kangaroos stars Angus Crichton and Mark Nawaqanitawase will switch codes at season’s end, in the hope of winning a World Cup with the Wallabies. They will no doubt have their hearts set on a grand final lap of honour before clocking off. Key gains: Daly Cherry-Evans (Sea Eagles), Reece Robson (Cowboys), Tommy Talau (Sea Eagles), Cody Ramsey (Dragons)\n\nKey losses: Sandon Smith (Knights), Zach Dockar-Clay (Sea Eagles)\n\nComing off contract: Daly Cherry-Evans, Daniel Tupou, Siua Wong, Tommy Talau. Dolphins (ninth)\n\nThomas Flegler hasn’t played since he was injured against the Wests Tigers in round five, 2024. Credit: NRL Photos What’s the story? They came within one win of a maiden finals berth last season, and now the Dolphins will be bolstered by an influx of quality reinforcements. Former Queensland and Kangaroos prop Thomas Flegler, who hasn’t played for almost two years after suffering career-threatening nerve damage in his shoulder, will return. Tom Gilbert (pectoral), Daniel Saifiti (shoulder), Max Plath (knee) and Jack Bostock (knee) won’t be too far behind him. Throw in English import Morgan Knowles – a four-time Super League winner with St Helens – and the Dolphins should have some serious muscle in 2026.\n\nMeanwhile, after scoring 721 points last season – the most by any team during the regular season – the Dolphins have added explosive Selwyn Cobbo to their backline. In Cobbo and Hamiso Tabuai-Fidow, Dolphins coach Kristian Woolf will have two strike weapons capable of scoring from anywhere. Key gains: Selwyn Cobbo (Broncos), Morgan Knowles (St Helens), Brad Schneider (Panthers)\n\nKey losses: Josh Kerr (Dragons), Mark Nicholls, Kenny Bromwich (both retired), Max Feagai (Titans), Aublix Tawha (Broncos), Sean O’Sullivan (Bulldogs)\n\nComing off contract: Selwyn Cobbo, Jamayne Isaako, Brad Schneider, Jake Averillo, Francis Molo, Ray Stone, Trai Fuller, Kodi Nikorima. Manly Sea Eagles (10th) Manly players after their scrimmage with St George Illawarra last week. Credit: Max Mason-Hubers\n\nWhat’s the story? For the first time since he debuted in 2011 – the last time Manly won a premiership – the Sea Eagles head into a season without Daly Cherry-Evans in their No.7 jersey. But after signing former Canberra playmaker Jamal Fogarty, Manly coach Anthony Seibold will be hoping the transition is seamless. The Sea Eagles finished two points outside the top eight last year, but they were cruelled by season-ending injuries to big men Taniela Paseka and Haumole Olakau’atu, and Jake Trbojevic’s concussion. As always, much will depend on Tom Trbojevic, who will lead the new era after succeeding Cherry-Evans as skipper and return to his preferred fullback role. His fitness and form will be crucial to Manly’s finals hopes, and in turn to Seibold’s job security.\n\nThe Sea Eagles have reached the play-offs just once during Seibold’s three seasons. He is contracted until the end of 2027, but needs a breakout season to keep the wolves from the door. Key gains: Jamal Fogarty (Raiders), Kobe Hetherington (Broncos), Zach Docker-Clay (Roosters)\n\nKey losses: Daly Cherry-Evans (Roosters), Tommy Talau (Roosters), Matt Lodge (Cowboys), Toafofoa Sipley (Warrington), Josh Aloiai, Lachlan Croker (both retired), Jazz Tevaga (Wakefield)\n\nComing off contract: Jake Trbojevic, Tolutau Koula, Siosiua Taukeiaho. Parramatta Eels (11th) The Eels and former winger Zac Lomax are set for a legal battle. Credit: Getty Images What’s the story?\n\nWhat, or who, will the Eels receive in exchange for Zac Lomax? That is the main narrative surrounding Parramatta after the protracted contractual impasse that prompted the club to launch legal action last week against the representative winger, to ensure he doesn’t join a rival NRL team without their permission. The Eels agreed to release Lomax from his contract, believing he would head to rugby union. Instead, he wants to join the Melbourne Storm, who haven’t overwhelmed the Eels with whatever they have offered in terms of financial compensation or a possible player exchange. Whatever transpires with Lomax, you can guarantee Eels coach Jason Ryles, an unflappable type, is getting on with business after delivering 10 wins in his rookie year as head coach in 2026. If Parramatta’s improvement continues, their first finals appearance since 2022 appears a realistic outcome.\n\nKey gains: Jonah Pezet (Storm), Jack de Belin (Dragons), Brian Kelly (Titans)\n\nKey losses: Dylan Brown (Knights), Zac Lomax (released), Shaun Lane (retired), Brendan Hands (Toulouse), Dean Hawkins (London Broncos)\n\nComing off contract: Junior Paulo, Will Penisini, Dylan Walker, Joash Papalii, Kelma Tuilagi, Ryan Matterson North Queensland Cowboys (12th) Cowboys coach Todd Payten with veteran Jason Taumalolo. Credit: NRL Photos What’s the story? Cowboys coach Todd Payten is unlikely to lose any sleep over constant speculation that he’s a dead man walking if North Queensland cannot reach the finals in 2026.\n\nPayten is heading into his fifth season as North Queensland’s tactician, and has made the finals in two of his previous four attempts. He has a 50 per cent winning record, which is second only to the late Paul Green, the sole coach to have steered the Cowboys to a premiership. Nonetheless, Payten is off contract at the end of this season, and the NRL is a ruthless industry, so nobody will need to remind him what is at stake. Any disappointment the Cowboys felt when NSW Origin hooker Reece Robson signed with the Roosters was offset by their recruitment of feisty Reed Mahoney from the Bulldogs. A favourable draw in the early rounds could potentially alleviate the pressure on Payten, providing the Cowboys can capitalise. Key gains: Reed Mahoney (Bulldogs), Matt Lodge (Sea Eagles), Soni Luke (Panthers)\n\nKey losses: Reece Robson (Roosters), Jordan McLean (retired), Karl Lawton (Hull KR)\n\nComing off contract: Murray Taulagi, Jake Clifford, Jaxon Purdue, Braidon Burns, John Bateman, Matt Lodge, Sam McIntyre.\n\nWests Tigers (13th) Wests Tigers fans have been waiting since 2011 to cheer for their team in the finals. Credit: Getty Images What’s the story? Regardless of the boardroom brawling late last year, culminating in the departure of chief executive Shane Richardson, the Wests Tigers players will be eager to continue their on-field improvement under coach Benji Marshall. Recruits Kai Pearce-Paul, the England and former Newcastle back-rower, and ex-Warriors prop Bunty Afoa should ensure the Tigers are more capable of throwing their weight around this season as they seek their first finals appearance since 2011.\n\nMarshall steered them to nine wins and 13th spot last season, a vast improvement on three consecutive wooden spoons. With Lachlan Galvin gone, the Tigers have a more settled look about them. Jarome Luai, Adam Doueihi, Api Koroisau and Jahream Bula are evolving into a quality spine, and irrespective of any boardroom shenanigans, Tigers fans are entitled to be optimistic their team can challenge for a play-off berth. Key gains: Kai Pearce-Paul (Knights), Bunty Afoa (Warriors), Mavrik Geyer (Panthers), Jock Madden (Broncos)\n\nKey losses: Charlie Staines (Catalans), Brent Naden (released)\n\nComing off contract: Jarome Luai, Jahream Bula, Jack Bird, Sione Fainu, Jeral Skelton, Mavrik Geyer, Tony Sukkar. South Sydney Rabbitohs (14th) Wayne Bennett delivered underwhelming returns on his return to South Sydney. Credit: Getty Images\n\nWhat’s the story? Coach Wayne Bennett has been a driving force behind a proposed rule change, whereby teams that concede a try will be given the option of either receiving the ball from the restart, or kicking off themselves. There is plenty of opposition among rival coaches and fans to the “scorer’s kick-off” plan, but by all accounts ARL Commission chairman Peter V’landys is inclined to back Bennett. “Stop whingeing about it … if you listen to some of these guys [complaining], we’d still be playing with unlimited tackles, and players would still be wearing black boots with white laces,” was Bennett’s response to the resistance. Regardless, Bennett faces a huge challenge at Souths. Last season was the worst result of his illustrious career, considering the Rabbitohs’ final placing (14th) and win tally (nine). He hasn’t had a team in the finals since 2021, and he hasn’t won a premiership since 2011.\n\nHe’s banking on enigmas like Latrell Mitchell, David Fifita and Brandon Smith to play consistently and avoid injuries, and for Cody Walker to keep defying Father Time. Key gains: David Fifita (Titans), Adam Elliott (Knights), Bronson Garlick (Storm), Jonah Glover (Dragons)\n\nKey losses: Davvy Moale (Storm), Lewis Dodd (Catalans), Mikaele Ravalawa (Castleford), Jacob Host (released), Siliva Havili (London), Shaquai Mitchell (released)\n\nComing off contract: Cody Walker, Jamie Humphreys, Sean Keppie, Adam Elliott, Liam Le Blanc Dragons (15th) The Dragons haven’t featured in the NRL finals since 2018. Credit: Getty Images What’s the story?\n\nWill Shane Flanagan have to drop his own son? The Dragons coach has never been known to shy away from a tough call, and the arrival of Daniel Atkinson from Cronulla ensures Kyle Flanagan is no sure thing to retain the No.7 jersey he wore in 24 games last season. Flanagan could find himself shifting to five-eighth, or potentially out of the starting side altogether. The Dragons received a massive boost before Christmas when they signed Keaon Koloamatangi from Souths. A helicopter tour of the Illawarra apparently sealed the deal, but the Kangaroos forward won’t arrive until 2027. In the interim, the Red V have to figure out how to win tight games. They suffered eight losses last year by six points or fewer. They’ll need to kick that habit to have any hope of reaching the finals for the first time since 2018.\n\nKey gains: Daniel Atkinson (Sharks), Josh Kerr (Dolphins), Setu Tu (Warriors)\n\nKey losses: Jack de Belin (Eels), Lachlan Ilias (Titans), David Klemmer (St Helens), Cody Ramsey (Roosters)\n\nComing off contract: Damien Cook, Tyrell Sloan, Jaydn Su’A, Emre Guler, Luciano Leilua, Blake Lawrie, Christian Tuipulotu. Titans (16th) A new era kicks off for the Titans under rookie coach Josh Hannay Credit: Getty Images What’s the story? Big Tino Fa’asuamaleaui is one of the game’s genuine warriors, and the Titans desperately need some early season success to have any hope of keeping the poachers at bay.\n\nThe Titans produced a great escape to avoid the 2025 wooden spoon, but rookie coach Josh Hannay might not be so fortunate in his debut season. Gold Coast appear to have cleared the deck for a spending spree, although it will require a leap of faith for Fa’asuamaleaui to extend his stay. Hannay can only hope his new-look team, with Lachlan Ilias calling the shots at halfback, can offer their captain a glimmer of hope that they are on the right trajectory. Given their roster, that will surely be easier said than done. Key gains: Lachlan Ilias (Dragons), Max Feagai (Dolphins), Luke Sommerton (Panthers), Kurtis Morrin (Bulldogs)\n\nKey losses: David Fifita (Rabbitohs), Kieran Foran (retired), Reagan Campbell-Gillard (London), Carter Gordon (released), Alofiana Khan-Pereira (Warriors), Brian Kelly (Eels)\n\nComing off contract: Tino Fa’asuamaleaui, Phillip Sami, Sam Verrills, Jaimin Joliffe.\n\nKnights (17th) Newcastle are hoping to offload the wooden spoon this season. Credit: Getty Images What’s the story? They’re set to field a potentially lethal backline, having spent a fortune on former Eels five-eighth Dylan Brown, whose job will be to unlock the likes of Kalyn Ponga, Bradman Best, Dominic Young, Fletcher Sharpe and Dane Gagai. But before the Ferraris can show their class, they’ll need a platform up front, and therein lies the problem for new coach Justin Holbrook in his first season at the helm of the incumbent wooden spooners.",
        "source": "SMH"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/delayed-start-for-program-on-early-disability-intervention-services-midday-news-bulletin-30-january-2026/gjrgtzt90",
        "title": "Delayed start for program on early disability intervention services | Midday News Bulletin 30 January 2026",
        "publish_date": "Fri, 30 Jan 2026 01:21:43 +0000",
        "category": "finance",
        "authors": [],
        "text": "Listen to Australian and world news and follow trending topics with SBS News Podcasts.\n\nTRANSCRIPT\n\nGovernment delays start to program for early disability intervention services\n\nA senior US official says the federal immigration operation will be more focused\n\nAryna Sabalenka welcomes possibility of Serena Williams' return to the sport\n\nThe federal government has offered to delay the start of a new program for early intervention autism services because states and territories say they are not ready.\n\nMembers of national cabinet are meeting in Sydney to reach a new five-year hospital agreement between the Commonwealth, states and territories.\n\nHealth Minister Mark Butler says the date for the Thriving Kids early intervention program will be delayed from its original plan to roll out from July 1st.\n\nThe money needed to kickstart the next phase of the program is linked to the public hospital deal.\n\nMr Butler says the program is designed to offer support to children with low to moderate support needs outside the NDIS.\n\n\"Well existing participants aren't coming off the program. I made a very clear commitment that existing participants would stay on the program subject to all the usual rules. But state and territories in the Commonwealth agreed way back in 2023 that far too many young children were ending up on the NDIS. In some parts of the country, as many as one in four young boys were ending up on a scheme that was established for severe and permanent disability.\"\n\n---\n\nOlder Australians are waiting an average of eight months to get access to home support services, which includes showering, meal preparation and cleaning.\n\nThe data in the Productivity Commission's Report on Government Services represents almost a doubling in the median wait time over the last financial year.\n\nA spokesman for Aged Care Minister Sam Rae says the report includes data that predates the government’s aged care reforms, including a new single assessment system which came in at the start of 2025.\n\nThe spokesperson says action is being taken to reduce wait times.\n\nThe federal government announced the release of 20,000 home care packages late last year, and another 63,000 by the middle of this year .\n\nOverall, Australia spent nearly $40 billion on aged care in the 2024/25 financial year, up from $38 billion the previous year.\n\n---\n\nUS border chief Tom Homan says federal agents will focus on targeted operations, shifting away from broad street sweeps that have provoked outrage in America and abroad.\n\nMr Homan admitted the federal immigration agency ICE could \"do better\" - in a rare acknowledgment from the administration that their operations had not been perfect.\n\nThis follows the fatal shooting of two US citizens in Minneapolis by federal immigration agents in the past month.\n\nMr Homan adds he would reduce the 3000-strong force of agents deployed to the city if he received cooperation from state and local leaders.\n\nMayor Frey continues to vocalise strong opposition to the enforcement, saying this kind of conduct needs to stop.\n\n\"What's become clear to me is this is obviously not about safety. This is not even about immigration. This is about silencing a narrative or a political position that differs from that of a federal administration. We've seen this kind of conduct in other countries. We cannot see it right here in America.\"\n\n---\n\nIn Tennis, world No 1, Aryna Sabalenka has welcomed the possibility of Serena Williams' return to the sport.\n\nThe 23-time grand slam singles champion did not rule out a potential comeback when interviewed on the NBC's Today Show.\n\nSerena Williams: I am just having fun and enjoying me life right now.\n\nInterviewer: Okay, but that's not a yes or a no.\n\nSerena Williams: That is not a yes or a no. I don't know. I'm going to see what happens. I have two kids. When I filled out the form the other day - occupation? I put down housewife. Listen, I can't discuss this. (laughs)\n\nThe 44-year-old retired after the 2022 US Open, but rejoined the drug testing pool late last year.\n\nThe action is a requirement before returning to the sport.\n\nAnd that's the latest from the SBS Newsroom.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/why-the-government-wants-to-track-your-medicines/yy53pc4wv",
        "title": "The end of doctor shopping? Why the government wants to track your medicines",
        "publish_date": "Thu, 29 Jan 2026 18:38:18 +0000",
        "category": "lifestyle",
        "authors": [],
        "text": "The federal government announced plans this week to reform how medications are dispensed and tracked, aiming to reduce unsafe use, stockpiling and \"doctor shopping\".\n\nThis will include two stages. First, the government will require all online and telehealth prescribers to upload information about a patient's prescribed medications to their My Health Record.\n\nSecond, the government plans to develop a National Medicines Record – an overarching database to register and monitor all current prescriptions.\n\nSo, how would this work? While some detail is still lacking, here's what we know.\n\nWhy is this needed?\n\nAn increasing number of Australians take multiple medications. Recent research analysing prescribing patterns in Australia estimates almost two million of us took five or more regular medicines in 2024.\n\nWhile multiple medicines are often needed to manage multiple conditions, there are risks of adverse effects.\n\nAnd when a clinician prescribes medication or a pharmacist dispenses it without a full understanding of the patient's current medications, it can lead to harmful interactions between them.\n\nThis can make a patient sicker and often lands them in hospital. An estimated 1.5 million people in Australia experience some kind of harmful side effect from using medicine each year.\n\nThose at particular risk are older adults taking numerous medications, as well as those transitioning between health-care settings (such as going into hospital or returning home).\n\nSometimes patients also stockpile medications, including through consulting multiple doctors, known as \"doctor shopping'. For example, they might do this to obtain extra supplies of addictive pain medication.\n\nHow does it work right now?\n\nCurrently, there is no centralised, mandatory register that records all of the medicines a person is prescribed and dispensed.\n\nInstead, prescribing information may be siloed in hospital and aged care systems, general practice records and those of online telehealth providers such as Instant Scripts, 13SICK and Hola Health.\n\nThis can prevent any single doctor or pharmacist from having clear, comprehensive information about a patient's medications.\n\nSome healthcare practitioners and pharmacy bodies have criticised the online prescribing industry, in particular, for contributing to inappropriate prescribing and medication misuse.\n\nFor high-risk medications such as opioids, there is already a Real Time Prescription Monitoring system. Victoria has a similar system called SafeScript, but this doesn't record the full range of prescription medications.\n\nAnnouncing the reforms on Wednesday, Health Minister Mark Butler referred to an Australian woman who died from an overdose after stockpiling her medicine. He explained her parents' advocacy prompted the government to address the lack of a comprehensive medicines record.\n\nWhat will change?\n\nFirst, the government will require online and telehealth prescribing platforms to add information to the My Health Record system about prescribed medications. This will include information about the clinical reasoning for prescribing.\n\nMy Health Record is a government-run platform providing a secure, online collection of a patient’s health information. Both patients and their treating health-care professionals can access it.\n\nSo any medication or related clinical information uploaded by a prescriber would be accessible via My Health Record, to the patient as well as to their health-care providers and pharmacists.\n\nMany general practices already upload this information, but online prescribing platforms may not. Organisations representing pharmacists have long called for this kind of change.\n\nLISTEN TO Medical specialists welcome study debunking paracetamol autism claims SBS News 00:49 English\n\nWill it work?\n\nIn theory, it is a step forward. The challenge is that the My Health Record system remains underused. One in 10 Australians have no My Health Record (the system is opt-out).\n\nFor the millions of Australians who do have a My Health Record, usage is increasing. But many still have never accessed their own record.\n\nIt is also not clear whether, and how, a patient’s access to their own My Health Record would reduce medication harm (particularly if the patient is deliberately stockpiling medication).\n\nAlmost all GPs, pharmacies and public hospitals are registered for My Health Record and have used the system. But data shows pharmacies are mainly using it to upload information rather than looking at records others have uploaded.\n\nOverall, ensuring that all medicines information is available on the My Health Record is a positive step.\n\nBut it does not mean that the information will be accessed (or understood) by others who are prescribing and dispensing medication to a patient.\n\nThe warnings that were placed by hospital services on the My Health Record of the young woman who died from an overdose were not accessed by telehealth services nor pharmacies prescribing and supplying her with medication.\n\nWhat's next?\n\nAs a second step, the government says it will design and build a National Medicines Record. This would be an overarching platform linked to My Health Record and other digital health systems, to register all current prescriptions.\n\nAt this stage, detail is lacking, but healthcare practitioners and pharmacy bodies are broadly supportive.\n\nA consultation is underway.\n\nIf this article has raised issues for you, or if you’re concerned about someone you know, call Lifeline on 13 11 14.\n\nMegan Prictor is a member of the Australasian Association of Bioethics and Health Law, the European Association for Health Law and the World Association of Medical Law.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/gold-and-silver-investing-explained/b5mtxf4nf",
        "title": "Could a bubble be about to burst? What to know as gold and silver prices surge",
        "publish_date": "Thu, 29 Jan 2026 18:34:17 +0000",
        "category": "finance",
        "authors": [],
        "text": "Gold and silver have notched a string of fresh record highs in recent sessions as global uncertainty drivers investors towards safe havens.\n\nLocal gold and silver prices are currently around $7,610 and $166 an ounce respectively — a far cry from the $5,100 and $58 they were priced at six months ago.\n\nThe rally has drawn increased interest from small investors. The Perth Mint experienced a surge in customers seeking to buy bullion or sell their jewellery in October. And more recently, there have been reports of people queuing at bullion dealers in Sydney's CBD.\n\nBut with prices surging, is it too late to invest? And what might you need to weigh up if you're considering it?\n\nWhat to be aware of\n\nPrice rallies can be alluring, but investing carries inherent risks. The federal government's MoneySmart offers guidance on what to consider and also recommends speaking to a financial adviser before you invest.\n\nWhen it comes to gold, Ole Hansen, head of commodity at Danish Investment Bank Saxo Bank, said the drivers behind the rally are \"largely concern-driven\".\n\n\"Geopolitical uncertainty remains elevated, amplified by an increasingly unpredictable US political backdrop, and inflation concerns have proven stickier than many policymakers had hoped,\" Hansen said in a statement this week.\n\nHe said demand for safe-haven assets like gold might start to cool, but does not believe a \"major\" price correction is on the horizon.\n\nDaniel Hynes, a senior commodity strategist for ANZ, echoed similar price drivers, and also believes there is likely to be a \"pullback in value in the not-too-distant future\".\n\n\"But the drivers that we have seen pushing [gold and silver] to these levels are not going to disappear soon,\" Hynes said.\n\nLISTEN TO Is it too late to jump on the gold and silver bullet train? SBS News 20:41 English\n\nSilver, he said, has \"the best of both worlds\", with an industrial link as well as being a safe-haven asset.\n\n\"When silver was included on the US critical minerals list just recently, that has raised some concerns that the US will start to strategically stockpile and potentially put tariffs on the metal as well,\" Hynes said.\n\nSilver also has uses in artificial technologies and the solar industry, he added.\n\nMichael Wayne, managing director at Medallion Financial Group, is more cautious. He said when there was a precious metals boom in 2011, the heat \"came out of it just as quickly as it went in\".\n\n\"Investors rushing to the party now need to be very, very careful and tread carefully,\" he said.\n\n\"It's very rare that you get a situation where the most dominant sector of the previous year continues to be the dominant sector for the year going forward.\"\n\nWhile Hansen believes gold won't experience a major price correction, he does have concerns for silver and believes it is in \"bubble territory\".\n\n\"While gold's ascent has so far been relatively orderly, with little evidence of classic bubble behaviour, the same cannot be said for silver,\" he said.\n\n\"Silver increasingly show signs of having moved into bubble territory, with retail participation, speculative positioning and fear of missing out acting as the primary drivers of a rally that has pushed prices to historically expensive levels, both relative to gold and to platinum.\n\nIn a December forecast of the price of gold for 2026, Natasha Kaneva, head of global commodities strategy at US investment bank JP Morgan, predicted further increases but said the rally \"has not, and will not, be linear\".\n\nHow can you invest?\n\nPeter Swan, a professor of finance at the University of NSW Business School, told SBS News that the cost of investing in gold and silver, like any commodity, is based on supply and demand.\n\n\"They all exist on a spectrum and have different proportions of cash or earnings in returns. Shares have a dividend yield of around 4 or 5 per cent, while investing in housing gives a lower yield of around 2 per cent,\" he said.\n\nPeople can invest in precious metals in a range of ways. This includes buying the physical commodity in the form of bullion, coins or jewellery.\n\nOther methods include buying shares in exchange-traded funds, where gold and silver are bought on behalf of shareholders, as well as directly buying shares in gold and silver mining companies.\n\nDisclaimer: The information in this article is general in nature and is not intended as financial advice. You should consult with a licensed professional to make the decisions that are right for you.\n\nFor the latest from SBS News, download our app and subscribe to our newsletter.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/a-hidden-childhood-cancer-is-increasing-what-do-these-children-need/pxhfn1h7q",
        "title": "A hidden childhood cancer is increasing: what do these children need?",
        "publish_date": "Thu, 29 Jan 2026 05:59:34 +0000",
        "category": "lifestyle",
        "authors": [],
        "text": "Listen to Australian and world news and follow trending topics with SBS News Podcasts.\n\nTRANSCRIPT\n\nAs tens of thousands of children prepare to start their first day back to school - Chloe Rodger won't be one of them.\n\nInstead of being with friends, she'll spend the day in a hospital gown - not a uniform - and in bed, not in the classroom.\n\nChloe's mother, Melissa, says it's a tough decision she has made to protect her immune system.\n\n\"The treatment that she receives today will give her a boost of immunity that will help protect her; as all the kids come back with all their germs and have a bit of a party. So it's about a balance of trying to look after and do what's best and look after her.\"\n\nTreatment of blood cancers, including leukemia, can endure for years.\n\nChloe's nurse, Maddy Gilsenan, is a paediatric bone marrow transplant and cellular therapy nurse practitioner at the Royal Children's Hospital, Melbourne.\n\nAt the hospital's cancer centre, she treats patients from newborns to teenagers and sees firsthand the impact of lengthy hospital stays.\n\n\"Particularly for our older children, our young adults and adolescents, when they're not out doing all the things that their peers are doing. They're missing out on school which is such a precious time for a child. So, a think it can be a really lonely experience for patients. And we do the best we can to look after them in our department, but it can be a really lonely time for a patient and their whole family.\"\n\nThe financial burden of childhood blood cancers on families is also intense and many families rely on support services.\n\nThe Rodger family had to grieve the life they lost after Chloe's diagnosis.\n\n\"My husband sold his business. I had to quit work. There was a huge toll on us. Talking about it and spreading awareness for other families going through this. We need support these families. It is a really critical and tough time, and I know a lot of families don't always make it after an illness like this. And we need more support in terms of kids for their education and families for their mental health.\"\n\nMany children frequently miss between 40 and 60 per cent of school in their first year of treatment, with some absent for six to 18 months or more.\n\nSince she was diagnosed with acute myeloid leukemia at age 9 in 2022, Chloe has missed a total of around two years away from school - and at least 10 months of that time in hospital.\n\nIn that time, Melissa found a charity that offered remote tutoring to children in Chloe's situation.\n\n\"I think it would be great if all kids could get that extra support in terms of tutoring. There are school services offered in the hospital, which Chloe took up. It was more just a bit of fun - and getting this tutoring that she did made a huge impact.\"\n\nIt is the most common and life-threatening childhood cancer in Australia and based on the data, this year, 350 Australian children are expected to be newly diagnosed with blood cancer.\n\nOver the past 20 years, blood cancer incidence has increased by almost 30 per cent among children aged 5 to 14 years.\n\nThe Leukaemia Foundation says if that rate of diagnosis continues, more than 400 children will be diagnosed annually by the next decade.\n\nBill Stavreski is the head of research at the foundation.\n\nHe says more funding into blood cancers is needed, to support patients and their families - and to build on major advancements in treatments.\n\n\"The key focus at the moment, now is early detection and prevention. If we can identify and diagnose children and people with blood cancer earlier and then hopefully into the future be able to prevent and understand why children are being diagnosed with leukemia and lymphoma. And there are significant inroads being made, but we still don't have those key answers and the need for research is quite significant.\"\n\nThe Leukaemia Foundation is urging people to shave, cut, or colour their hair for the World’s Greatest Shave.\n\nThe campaign is raising money for research and support services.\n\nMr Stavreski says a place to stay is one of the most important lifelines.\n\n\"Each year, the Leukemia Foundation provides 44,000 nights of accommodation for families and many of those patients are children who have to relocate. Some stay in our accommodation centres for up to six months. There is also the transport assistance, financial and importantly there is the emotional support from trained professionals.\"\n\nThere are other ways to help patients impacted by blood cancers.\n\nMany of the Australian children who will be diagnosed with a type of blood cancer this year will need stem cell therapy.\n\nThere aren't enough donors on shore, so 70 per cent of them will have to find overseas donors.\n\nYou can join the stem cell registry and become a potential donor when you next give blood.\n\nDonating whole blood and plasma is another important service eligible Australians can provide, to help blood cancer patients.\n\nMs Gilsenan says blood product donations are saving children's lives every day.\n\n\"We rely heavily on blood donations from the community. And we have a lot of children that will be requiring transfusion support potentially once a week or even more for up to two years. So, we use a big proportion of the blood supply that is kindly donated.\"\n\nYou can register for this year's World's Greatest Shave at worldsgreatestshave.com or call 1800 500 088.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/trumps-minnesota-flashpoint-myanmars-sham-election-china-recalls-its-bamboo-ambassadors/sy7c7eypb",
        "title": "Trump’s Minnesota flashpoint, Myanmar’s 'sham' election & China recalls its bamboo ambassadors",
        "publish_date": "Thu, 29 Jan 2026 05:37:12 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/nipah-virus-cases-confirmed-in-india/q68tlxman",
        "title": "Nipah virus cases confirmed in India",
        "publish_date": "Thu, 29 Jan 2026 03:41:57 +0000",
        "category": "lifestyle",
        "authors": [],
        "text": "Listen to Australian and world news and follow trending topics with SBS News Podcasts.\n\nTRANSCRIPT\n\nTwo cases of the deadly Nipah virus have been confirmed in India's West Bengal state and at least 190 people have been quarantined.\n\nIt's prompted multiple countries in Asia to step up airport screenings to prevent the spread of the infection, which at this stage has no vaccine or proven treatment.\n\nHowever, experts say while it's a dangerous virus with a high fatality rate, it doesn't spread easily from person-to-person.\n\nTwo cases of the deadly Nipah virus have been confirmed in the state of West Bengal in India since December.\n\nIt's sparked concern in parts of Asia, where multiple countries including Malaysia, Thailand and Nepal, have stepped up airport screenings to halt the spread of the virus.\n\nDr Subarna Goswami from the Darjeeling Tuberculosis Hospital says Indian authorities are working to trace, test and quarantine all who have come in contact with the confirmed cases.\n\n“So far, only two patients have tested positive. The remaining contacts, approximately 190-200 of them, have been quarantined and those who showed symptoms have also been tested. They also tested negative apart from these two patients, no one else has tested positive yet.”\n\nNipah is a rare viral infection that spreads largely from infected animals, mainly fruit bats, to humans, and can cause fever and brain inflammation.\n\nThe World Health Organisation says it has a fatality rate of between 40 per cent and 75 per cent, depending on the local healthcare system's capacity for detection and management.\n\nDr Goswami says the confirmed cases in India is troubling, given there is no vaccine, or proven treatment options.\n\n“The Nipah virus infection is very dangerous. There are three reasons for this. First, there is no cure for it, there is no specific treatment and no medicine works. Secondly, there is no vaccine or inoculation for it. And the third thing is that its morbidity rate, the fatality ratio, is very high.”\n\nInfectious diseases consultant at Manipal Hospital in India's West, Dr Sayan Chakraborty, says the danger of the virus lies in its potential to spread to the brain.\n\n“It starts like a normal viral fever. There is fever, headache, pain in the whole body. Along with it, there is pain in the throat and a cough. The cough transforms into Pneumonia-like conditions. There is difficulty in breathing. Then, gradually, the infection spreads to the brain which reduces the senses of the patient. Eventually, the patient goes into a coma.”\n\nProfessor in Medicine at the Norwich Medical School, Paul Hunter, says once the virus has impacted the brain, symptoms quickly become severe.\n\n\"The thing that probably kills most is called encephalitis, which is an infection and a swelling of the brain. And when you get encephalitis, you start feeling very unwell. You have high fever, you have very severe headaches, and you can have photophobia, where the light hurts your eyes.\"\n\nMost people who survive encephalitis make a full recovery, but the W-H-O says approximately 20 per cent are left with residual neurological consequences such as seizure disorder and personality changes.\n\nNipah was first identified in Malaysia in 1999.\n\nSince then, there have been small outbreaks almost every year, mostly in Bangladesh, and India has experienced sporadic outbreaks.\n\nAccording to the Coalition for Epidemic Preparedness Innovations, a group that tracks emerging disease threats, as of December last year, 750 cases had been recorded since 1999, and 415 of the patients died.\n\nWhile the virus can spread from person to person, Professor Hunter says it does not do so easily, which may explain why outbreaks have usually been small and fairly contained.\n\n\"As far as we can tell, the main risk of person-to-person transmission comes from fairly close contact, you know, typically when you're caring for somebody who's quite ill. But it must be said there aren't a lot of, there's not a huge amount of evidence on which to base a lot of these judgements.\"\n\nWhen first identified in Malaysia, Nipah spread largely through direct contact with sick pigs.\n\nSince then, it more commonly spreads from contact with what scientists say is its primary host: fruit bats.\n\nThe WHO says the consumption of fruit or fruit products containing urine or saliva from infected fruit bats has been the most likely source of infection.\n\nProfessor Hunter says with this in mind, there are some precautions that can help protect a person from contracting the virus.\n\n\"In terms of the initial infections, it's being careful about eating and drinking food that might be contaminated by fruit bats. For the traveller, if any of us go to these areas, the issue is, you know, being the sort of things that you're not supposed to do anyway, or you don't eat fruit without peeling it first. Don't drink unpasteurised or unheated drinks that have been heated to a temperature that would kill viruses.\"\n\nWhile there are currently no approved vaccines or treatments for Nipah, a number of vaccine candidates are undergoing testing, including one developed by the Oxford University scientists involved in developing one of the COVID-19 vaccines.\n\nProfessor Hunter says while Nipah is a dangerous virus with a high fatality rate, it hasn't yet shown signs of becoming more transmissible among humans, making it's global spread at this stage unlikely.\n\nHowever, he says its long incubation period does pose potential challenges to tracking its movement across borders - as it's also difficult to detect in the early stage.\n\n\"It's about one to two weeks, (the time for symptoms to show) maybe a little bit sooner in some, and sometimes a lot longer than that. I think the longest has been 45 days. And what this means is that it's actually very difficult to control at airports, if you've got a disease that's got a two-week incubation period, you know, for the first two weeks after somebody's carrying the infection, there's no way you can pick it up.\"",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/chris-minns-to-consider-creating-a-public-holiday-for-nsw/qnw89eo4p",
        "title": "Minns to consider creating public holiday fix for 'underserved' state",
        "publish_date": "Thu, 29 Jan 2026 01:10:21 +0000",
        "category": "finance",
        "authors": [],
        "text": "Only a select few million Australians are in line for an Anzac Day long weekend this year.\n\nWith that fact dawning on people planning their 2026 escapes, a state premier on Thursday flagged his government is in talks to create a new public holiday, accounting for Anzac Day falling on a Saturday.\n\nRemembrance services will be held nationwide on 25 April, but only people in Western Australia and ACT will get an additional public holiday on the following Monday.\n\n\"It's not just this year, it's next year as well that you don't get the day off,\" NSW Premier Chris Minns told Triple M radio on Thursday.\n\n\"And we [NSW] are underserved when it comes to public holidays, there's a lot more in every other state.\n\n\"We're going to have a conversation about it for this year.\"\n\nREAD MORE Here's the reason we should have more public holidays in Australia\n\nTalks with the Returned and Services League (RSL) would be held to ensure the creation of a long weekend didn't detract from the national day of remembrance.\n\n\"I've got to have confidence that it's not going to — if we have a public holiday on the Monday — it doesn't detract from the salience of the 25th,\" Minns said.\n\n\"It's got to be the 25th that's hugely important.\"\n\nThe Victorian government, which also doesn't observe the Monday holiday, and business groups were contacted for comment.\n\nAnzac Day is one of 10 public holidays recognised nationwide in 2026.\n\nMost Australians get another three or four, including those in Victoria, Queensland, ACT and South Australia.\n\nNSW observes two extra days: the King's Birthday in June and Labour Day in October.\n\nChristmas Island celebrates an extra six days, including two for Chinese New Year in mid-February.\n\nFor the latest from SBS News, download our app and subscribe to our newsletter.",
        "source": "SBS"
    },
    {
        "url": "https://www.theage.com.au/national/australia-news-live-ley-holds-on-to-leadership-as-rivals-fail-to-reach-agreement-on-who-should-challenge-trump-asks-putin-to-temporarily-halt-kyiv-bombing-20260130-p5ny6y.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Australia news LIVE: Ley holds on to leadership as rivals fail to reach agreement on who should challenge; Trump asks Putin to temporarily halt Kyiv bombing",
        "publish_date": "Fri, 30 Jan 2026 13:41:23 +1100",
        "category": "finance",
        "authors": [
            "Emily Kaine",
            "Rachael Ward"
        ],
        "text": "The federal government has launched a spirited defence before the international community of its efforts to protect the Great Barrier Reef, in its latest bid to avoid the reef being listed as “in danger”.\n\nIn 2021 the United Nations Educational, Scientific and Cultural Organisation (UNESCO) issued a draft recommendation that the Great Barrier Reef should be listed as an “in danger” World Heritage site.\n\nSince then Australia has been locked in a multi-year battle to prevent that listing taking effect, a listing it says could place thousands of jobs at risk, particularly in tourism.\n\nRead more here.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/tennis/australian-open-2026-live-updates-aussies-chase-doubles-title-zverev-battles-alcaraz-djokovic-faces-sinner-in-blockbuster-semis-20260129-p5ny45.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Australian Open 2026 LIVE updates: Aussies chase doubles title; Zverev battles Alcaraz, Djokovic faces Sinner in blockbuster semis",
        "publish_date": "Fri, 30 Jan 2026 13:40:58 +1100",
        "category": "sports",
        "authors": [
            "Angus Delaney",
            "Roy Ward"
        ],
        "text": "I wonder if mixed doubles pairings have to take lessons in sign language and ventriloquism before signing up for the tour?\n\nIt sure looks that way in this Australian Open final.\n\nClosed fists over mouths are just the ticket for the French pair. Credit: Getty Images\n\nMladenovic and Guinard have been spotted trying to communicate with their hands held over their mouths in a closed fist. It looks like they are trying to blow a pretend trumpet, but apparently they are talking tactics.\n\nThe Aussies are relying on hand signals to determine their approach to certain points.\n\nGadecki holds her left hand behind her back when she is standing at the net and goes through a number of different finger signals before her partner Peers serves.\n\nIn theory, it gives her the advantage of knowing where he is going to serve. If she signals wide to the forehand, she can cover the line. If she signals down the line, she can step across to cut off the volley.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/tennis/sabalenka-vs-rybakina-in-blockbuster-final-20260130-p5nybw.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Sabalenka vs Rybakina in 'blockbuster' final",
        "publish_date": "Fri, 30 Jan 2026 13:38:34 +1100",
        "category": "finance",
        "authors": [],
        "text": "Sabalenka vs Rybakina in 'blockbuster' final\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/three-olympics-four-surgeries-and-one-superstition-moguls-matt-takes-bumpy-road-to-milan-games-20251231-p5nqxf.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Three Olympics, four surgeries and one superstition: ‘Moguls Matt’ takes bumpy road to Milan Games",
        "publish_date": "Fri, 30 Jan 2026 13:36:49 +1100",
        "category": "sports",
        "authors": [
            "Danny Russell"
        ],
        "text": "Save Log in , register or subscribe to save articles for later. Save articles for later Add articles to your saved list and come back to them any time. Got it Normal text size Larger text size Very large text size In the tense moments before a high-pressure event, Winter Olympian Matt Graham looks for his daughter’s face. He pulls his phone from his pocket, lights up the screen and focuses on her image. It is a reassuring habit the 31-year-old moguls specialist has formed since becoming a father in September 2024 that will help drive him towards Winter Olympics gold next month. “I found myself doing it just this past season, which I didn’t expect,” he tells this masthead. Matt Graham with a world championships silver medal in 2023. Credit: Getty Images “She’s my background on my phone, so during competitions, when the stakes are high and the pressures up, I’d often just like, pull my phone out, just open it up, sort of blow her a kiss and just say, ‘let’s f...ing go’. “I just found myself doing that naturally. It wasn’t planned. It’s more my way of just getting in the zone and getting amped up for the event.”\n\nAdvertisement\n\nGraham has embraced fatherhood. Despite the added complications for an athlete who lives in Sydney and competes on the other side of the globe, it provides him with extra motivation as he prepares for the Olympics in northern Italy, which begin on February 6. “My day-to-day life as an athlete hasn’t changed a whole lot,” he says. “But mentally, it’s quite different. I feel like there’s more purpose when I’m away. “I’m not doing it just for me.” Matt Graham during moguls qualfying at the 2022 Beijing Games. Credit: Getty Graham and his partner Jess had daughter Ada in September 2024 and were married 13 months later in October last year.\n\nAdvertisement\n\n“It was a big step, obviously,” he says. “Anyone who’s a parent sort of knows that the transition can be quite full on. But yeah, I mean, Jess and I were both ready to become parents. “We’d obviously spoken about it a lot, leading up to us trying to be parents, and then once it eventually happened, it was about preparing for the hard times when I was going to be away.” Graham had a patchy season last year. But he bounced back in sparkling fashion last month, winning a World Cup moguls event in Ruka, Finland. It was a unique double for Australia as Jakara Anthony also won gold. “My performances in the past season were, it was a bit of a rocky road,” Graham says. “But the failures, or the times I didn’t succeed on the competition tour, it made it easier to get over because I would just go home and get Jess on FaceTime and, I mean, yeah, my daughter, Ada, she doesn’t care.\n\nAdvertisement\n\n“She’s just smiling and yapping away. So it makes that easier to sort of push past and move on from those downtimes.” Graham hit a low point in December 2021. Coming off an Olympic silver medal in South Korea in 2018, he broke his collarbone in a heavy fall in Sweden just two months out from the 2022 Olympics in Beijing. Despite an intensive rehabilitation program, he was far from his best. He competed in pain and finished 29th. Matt Graham during moguls qualifying at the 2022 Olympics in Beijing. Credit: Getty The experience rocked Graham. He admits he was “heartbroken” and considered calling time on his career. But the qualified civil engineer made some adjustments and rediscovered his love of the sport before he had to overcome more setbacks. His collarbone hadn’t healed properly, and he was sent for further surgery. “Generally speaking, a broken collarbone is an easy injury to come back from, but unfortunately, mine was a little bit more complicated,” Graham told the NSW Institute of Sport.\n\nAdvertisement\n\n“I had some issues with the bone healing. Consequently, I had to undergo four completely separate surgeries, which prolonged the injury over a two-year period.” After the operations and three sets of plates and screws, Graham then had to rediscover the right mindset. “Sometimes, you know, you’ll have a big crash, a big stumble, and you’ve got to get back up and right your wrong, and learn from that mistake,” he says. “I guess I’ve developed a bit of a way to push past those things and just know that I’ll be fine. If I attack a course, and I’m hesitant or conservative, then I’m at more risk than if I more or less just attack it. “Sometimes a moguls course can be pretty daunting, it can be steep, it can be icy, in some cases it can be a little bit scary. So, I guess you have to have a screw or two loose to take that step and really attack each day in each competition. “[But] I’d say generally I’m quite conservative in life. The risks we do out in the snow, they’re very calculated.\n\nAdvertisement",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/business/markets/asx-set-to-dip-microsoft-weighs-down-wall-street-apple-results-ahead-20260130-p5ny6n.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "ASX higher as energy shares shine; The Star stumbles",
        "publish_date": "Fri, 30 Jan 2026 13:20:58 +1100",
        "category": "finance",
        "authors": [
            "Staff Reporter"
        ],
        "text": "Advertisement\n\nUpdated BusinessMarketsWorld markets ASX higher as energy shares shine; The Star stumbles Staff reporter Updated January 30, 2026 — 1:20pm ,first published January 30, 2026 — 5:23am Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share A A A\n\nEnergy shares gained ground on the Australian sharemarket after oil prices jumped again following a dramatic day on Wall Street where investors wiped $US357 billion ($506 billion) off Microsoft’s market capitalisation. The S&P/ASX 200 was up 22.1 points, or 0.3 per cent, to 894961 in early trade, with seven of 11 industry sectors in the green. Technology shares are the heaviest weight on the index. Company results have had a lot of influence on Wall Street’s direction this week. Bloomberg Energy stocks jumped as oil prices rose on worries tension between the United States and Iran could constrict the flow of crude. Defence Secretary Pete Hegseth warned the US military “will be prepared to deliver whatever the president expects,” just a day after President Donald Trump told Iran to “make a deal” on its nuclear program. Woodside Energy advanced 1 per cent and Santos gained 3.1 per cent in early afternoon trade. Shares in embattled gaming company The Star erased early gains to slump 11 per cent lower in early afternoon trade. In a quarterly update, the company posted $301 million revenue in the December quarter, a 6 per cent rise over the prior quarter, but warned of “numerous material” uncertainties.\n\nAdvertisement\n\nLocal tech shares suffered losses echoing a difficult night on Wall Street for tech giants following Microsoft’s 10 per cent tumble. WiseTech fell 1.6 per cent, Xero lost 1.4 per cent and Technology One retreated 2.2 per cent. Gold stocks retreated after the price of the safe haven metal fell sharply overnight. Gold, near $US5600 an ounce, suddenly and briefly dropped below $US5200 before advancing again to fetch around $US5427 at 10.36am AEDT. In early trade, Northern Star added 0.7 per cent, Evolution Mining fell 0.8 per cent and Newmont slipped 2.9 per cent. Among the iron ore heavyweights, BHP advanced 0.8 per cent, Rio Tinto added 0.6 per cent and Fortescue lost 1 per cent. Bank stocks are mixed. Westpac climbed 0.8 per cent in early afternoon trade, ANZ Bank added 0.5 per cent, National Australia Bank edged up 0.2 per cent while Commonwealth Bank dipped 0.1 per cent. Nine Entertainment, owner of this masthead, added 4.1 per cent after it struck a deal to sell Australia’s top-rating conservative talkback stations 2GB, 3AW, 4BC and 6PR to publican and pokies billionaire Arthur Laundy and his family for $56 million. Nine has also purchased outdoor media firm QMS for $850 million.\n\nAdvertisement\n\nThe Australian dollar was trading at US70.14¢ at 12.24pm AEDT. Related Article Opinion\n\nFederal Reserve Trump will be seeing red as the Fed refuses to bow down Stephen Bartholomeusz Senior business columnist Overnight, the S&P 500 slipped 0.1 per cent after flirting with its record high in the morning and dropping by as much as 1.5 per cent later in the day. The Dow Jones rose 55 points, or 0.1 per cent, after erasing an earlier loss of more than 400 points, and the Nasdaq composite fell 0.7 per cent. Microsoft was the heaviest weight on Wall Street by far. The tech giant plunged amid scepticism over how much the company is investing in artificial intelligence, despite reporting stronger profit and revenue for the latest quarter than analysts expected. It was the stock’s worst day since the market’s COVID-19 crash in 2020.\n\nAdvertisement\n\nApple’s iPhone sales soared to a new quarterly record during the holiday season, despite artificial intelligence blunders that prompted the technology trendsetter to get a helping hand from Google. Shares are up 1 per cent in after-hours trading. Microsoft tumbled 10 per cent with concerns rising about how much the company is investing in AI. Bloomberg Tesla weighed on the market after falling 3.5 per cent. It delivered a bigger profit for the latest quarter than analysts expected, but the results were sharply lower than from a year earlier. Tesla’s leader, Elon Musk, has been trying to get investors to focus less on its flagging car sales and more on the company’s robotaxis and robots. Companies across the market are under pressure to deliver at least solid growth in profits following record-setting runs for their stock prices. Stock prices tend to follow the path of corporate profits over the long term, and earnings need to rise to quiet criticism that stocks have grown too expensive. Still, more stocks rose within the S&P 500 than fell. Leading them was Meta Platforms, which rallied 10.4 per cent after the company behind Facebook, Instagram and WhatsApp topped profit expectations, even though it also said it will continue its massive investments in AI. IBM was another winner and climbed 5.1 per cent after surpassing analysts’ expectations for profit and revenue.\n\nAdvertisement\n\nRelated Article Opinion\n\nAI Robots, redundancies and runaway spending: Not all AI hits the mark Elizabeth Knight Business columnist Some of the wildest action in financial markets was again for precious metals. Silver, which has been zooming higher in its own feverish run, had a similar and sudden reversal of momentum before ticking higher again. Bitcoin, which is pitched as a form of “digital gold”, also fell sharply. It sank nearly 6 per cent and dropped toward $US84,000. On the bond market, the yield on the 10-year Treasury dipped to 4.23 per cent from 4.26 per cent late on Wednesday. With AP The Market Recap newsletter is a wrap of the day’s trading. Get it each weekday afternoon.\n\nSave You have reached your maximum number of saved items. Remove items from your saved list to add more. Share More: World markets\n\nShares\n\nWall Street",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/culture/movies/first-look-at-the-melania-trump-documentary-20260128-p5nxl7.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "First look at the Melania Trump documentary",
        "publish_date": "Fri, 30 Jan 2026 13:09:17 +1100",
        "category": "finance",
        "authors": [],
        "text": "Remove items from your saved list to add more.\n\nYou have reached your maximum number of saved items.\n\nSave this video for later\n\nAdd videos to your saved list and come back to them anytime.\n\nGot it",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/culture/live-reviews/flashback-to-marriage-equality-vote-evokes-tumult-of-a-devastating-time-20260128-p5nxok.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Flashback to marriage equality vote evokes tumult of a devastating time",
        "publish_date": "Fri, 30 Jan 2026 13:04:57 +1100",
        "category": "entertainment",
        "authors": [
            "Sonia Nair"
        ],
        "text": "Advertisement\n\nCultureLive reviewsMelbourne live reviews Flashback to marriage equality vote evokes tumult of a devastating time Sonia Nair January 30, 2026 — 1:04pm Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share A A A\n\nTHEATRE\n\nThe Placeholder ★★★\n\nfortyfivedownstairs, until February 8 The shared experience of grief has culminated in many an incisive theatre piece centred on chosen families navigating existential questions of loss, friendship and mortality – Domenica Feraud’s off-Broadway play Someone Spectacular and, closer to home, Ash Flanders’ Malthouse production This Is Living among them. The kitchen of matriarch Pat (Meredith Rogers, centre) becomes the focal point of The Placeholder. Darren Gill Ben MacEllen’s The Placeholder is the latest play to wade into thorny territory. We’re plunged headfirst into 2017, notably the year queer communities were subjected to a plebiscite on marriage equality. It’s a devastating time, illustrated by clips of real-life interviews and news segments showcasing the bigotry that was allowed to flourish. United by virtue of Barb’s Bosom Buddies – a fundraising collective dedicated to honouring the memory of namesake Barb, who died of breast cancer – five disparate people in the fictional rural town of South Bend find themselves meeting monthly to brainstorm badges, banners, cookies and muffins.\n\nAdvertisement\n\nRelated Article Performing arts What is it about this show that can prompt a lifetime of obsession? Matriarch Pat (Meredith Rogers) is a soft-spoken retiree whose kitchen becomes the focal point of the play, brilliantly materialised by Bethany J. Fellows’s set design. Helen (Michelle Perera) is a widow with a heart of gold and a penchant for baking. A proud lesbian, Keira (Rebecca Bower) self-medicates with alcohol to withstand living in a cloistered town. Barb’s niece Jo (Brigid Gallacher) is the conservative black sheep of the group. And sporty Nic (Oliver Ayres) used to go by Nicole, until they announce they’re transitioning into a man. The reprisal is swift. The elder members of the group, Pat and Helen, paradoxically take it in their stride, but Keira is incensed by the perceived loss of a lesbian peer, and Jo insists it’s all but a phase. The remainder of the play details the fallout of Nic continuously insisting on his personhood against bad-faith arguments and a gulf of miscomprehensions. As the kindest, most level-headed character, Helen is who most audiences will project themselves onto. But Perera, so brilliant in This Is Living, is also the strongest of the ensemble. Her comedic timing is impeccable as she expertly oscillates between empathetic displays of allyship and perfectly executed moments of humour that imbue the play with levity at key junctures. Pat (Meredith Rogers) and Nic (Oliver Ayres) in The Placeholder. Darren Gill\n\nAdvertisement\n\nFunctioning like a time capsule by virtue of being set nearly a decade in the past, The Placeholder provides a stage for various expressions of acceptance and opposition as the group muddles through supporting Nic. A cookie-cutter bigot, Jo’s views cover well-trodden, odious ground. But it’s Keira’s see-sawing between solidarity and gender essentialism and a self-victimisation that’s impervious to the marginalisation of others that’s harder to stomach – and altogether more interesting. Related Article Exclusive\n\nArts From a New York bathroom to regional Victoria: An exhibition of art’s heavy hitters is on its way MacEllen presents thought-provoking contrasts between desired gender-affirming care and unwanted life-saving surgery, gender and sexuality, mental deterioration and newly prized lucidity. But at close to three hours, The Placeholder is simply too long. MacEllen’s script retreads familiar ground in the play’s second act, which drags lugubriously to its emotional climax(es). The tenuous connecting thread of a makeshift charity doesn’t explain why these characters are so invested in one another, and why they tolerate unconscionable behaviour – particularly from Jo. As a result, the emotional payoffs are muted, hampered further by unnatural, dialogue-heavy exposition and uneven acting during key dramatic reveals. Much is left unresolved by close. Keira’s alcohol addiction continues to be the butt of jokes, Pat’s clear descent into dementia is unremarked upon. String-heavy interludes between scenes are peppered with a greatest hits compilation of what happened in the intervening years – good, bad, ridiculous. But the cacophony, so effective initially in illustrating the overwhelm of the plebiscite, overpowers the play by the end. The Booklist is a weekly newsletter for book lovers from Jason Steger. Get it delivered every Friday.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/tennis/aussie-duo-drop-first-set-20260130-p5nybi.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Aussie duo drop first set",
        "publish_date": "Fri, 30 Jan 2026 13:02:54 +1100",
        "category": "sports",
        "authors": [],
        "text": "Aussie duo drop first set\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/nsw/it-s-time-to-say-goodbye-hundreds-farewell-the-last-v-set-train-20260129-p5ny30.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘It’s time to say goodbye’: Hundreds farewell the last V-set train",
        "publish_date": "Fri, 30 Jan 2026 12:37:34 +1100",
        "category": "finance",
        "authors": [
            "Ellie Busby"
        ],
        "text": "Advertisement\n\nNationalNSWPublic transport ‘It’s time to say goodbye’: Hundreds farewell the last V-set train Ellie Busby January 30, 2026 — 12:37pm Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share A A A\n\nRail enthusiasts Crystal and Ben Parker, and their six-year-old son Luke, love historic trains. It’s why they stayed up all night to catch a train to Lithgow early on Friday morning in the hopes of getting a seat on the final V-set service through the Blue Mountains to Sydney. “We caught the last train that was leaving Central at 12.05am, we got on at Springwood at 1.40am, and we didn’t make it to Lithgow until five to four, something like that … and then we caught this train like everybody else at 5.45am. So last night’s trip was not pleasant,” Crystal said. Crystal Parker (left) with her husband Ben Parker and their sleeping son Luke Parker (right) on the last V-set train. Kate Geraghty But the lack of sleep was worth it for the family, even young Luke, who enjoyed the journey for the first few stations before promptly falling asleep. It was an experience shared by many rail enthusiasts who turned up in the hundreds to take one last journey among the bush plum seats. The 55-year-old fleet has been replaced by the modern Mariyung trains.\n\nAdvertisement\n\n“It’s honestly a little sad because this train has been in service for so long, but it’s also pretty exciting to be on the last service,” said Zedd Spencer, aged 10. David Spencer with his son Zedd Spencer, who were excited to be on the last V-set train. Kate Geraghty The V-set train was freshly sprayed in the classic Blue Goose livery of royal blue and grey for its final run. The train had already reached capacity by the time it reached the lower Blue Mountains, forcing it to skip stations at both Blaxland and Glenbrook, much to the disappointment of the rail enthusiasts who were waiting at the platforms. At every station that followed, more V-set fans fought to get on board, with the train at standing room only. One excited young passenger who managed to get on at Parramatta was seven-year-old Sayan Poudel, whose in-depth knowledge of the V-set’s history impressed even some of the older fans of the train service sitting nearby.\n\nAdvertisement\n\nSayan Poudel and his mum Sarita Nepali boarded the train from Parramatta. Kate Geraghty “These trains operated since 1970 and have been serving the line until 2026,” he said. “It’s time to say goodbye to the V-sets.” But not everyone was as excited about the train’s final journey. Regular commuter Kristine Thompson was confused when she saw how busy the platform was and the “amusing characters and influencers” who were on board. Crowds at Central Station welcome and disembark from the train. Kate Geraghty “Not since before COVID have I seen the platform that busy,” she said.\n\nAdvertisement\n\nThe V-set used for the final service will be retained for heritage purposes, but the future of the remaining 81 retired V-set carriages is still to be determined. Related Article Public transport ‘Sad day’: End of line for NSW’s beloved steel rattlers When the train pulled into Central Station for the final time, rapturous applause and cheers were heard onboard. On the platform, rail enthusiasts of all ages gathered to take photos of the train, with a few of the younger passengers shedding some tears. A band played music to celebrate the train’s arrival, as the V-set service closed its doors for the final time. Start the day with a summary of the day’s most important and interesting stories, analysis and insights. Sign up for our Morning Edition newsletter.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/tennis/shes-coming-back-serena-masterplan-unpacked-20260130-p5nyb3.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "'She's coming back:' Serena 'masterplan' unpacked",
        "publish_date": "Fri, 30 Jan 2026 12:37:27 +1100",
        "category": "finance",
        "authors": [],
        "text": "'She's coming back:' Serena 'masterplan' unpacked\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/business/companies/premier1-locks-up-hot-property-in-wa-gold-land-grab-20260130-p5nyau.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Premier1 locks up hot property in WA gold land grab",
        "publish_date": "Fri, 30 Jan 2026 12:33:24 +1100",
        "category": "finance",
        "authors": [
            "Andrew Todd"
        ],
        "text": "Advertisement\n\nSponsored BusinessCompaniesBulls N' Bears Premier1 locks up hot property in WA gold land grab Brought to you by BULLS N’ BEARS Andrew Todd January 30, 2026 — 12:33pm Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share A A A\n\nPlucky ASX-listed gold junior Premier1 has locked up full ownership of one of the Yalgoo greenstone belt’s last remaining gold packages in Western Australia, not already in the hands of a multi-billion dollar gold producer. The company says it has secured complete control over 266 square kilometres of prime Yalgoo real estate, as the relentless WA gold consolidation by district majors continues to unfold and gold jumps to a monstrous price of US$5500 (A$7800) an ounce. Reverse circulation drilling underway at Premier1’s Yalgoo gold project. The deal completes the final piece in Premier1’s evolving WA gold narrative, positioning the company as the remaining independent player in a greenstone belt tug-of-war between the $9.7 billion Ramelius Resources and the $7.3 billion Capricorn Metals. The company and its high-grade Wadgingarra gold prospect are now sitting pretty, with a 13,000-ounce starter resource grading an enticing 2.7 grams per tonne (g/t) gold at the top end of the Yalgoo-Singleton greenstone belt.\n\nAdvertisement\n\n‘These transactions simplify the ownership structure and grant the Company full control’ Premier1 executive director Simon Phillips Ramelius holds most of the northern flank after its mid-2025 acquisition of Spartan Resources for a lazy $2.4 billion, while Capricorn has steadily expanded south thanks to a $188 million Warriedar-Golden Range acquisition and a landgrab of Tempest’s ground in December of last year. Premier1 says its tenure sits squarely in the middle of these two players and shares all the same shears and geological signatures that have made the underexplored region so very valuable to all its neighbours. Newly appointed Premier1 executive director Simon Phillips said: “Consolidating 100% ownership of Yalgoo represents a significant strategic milestone for Premier1. These transactions simplify the ownership structure and grant the Company full control over exploration, development and capital allocation decisions across a highly prospective gold portfolio.” Yalgoo is a district long recognised for its high-grade orogenic gold and copper potential. The project runs along strike from the world-class Golden Grove base metals operation, which has been successfully operating for the better part of half a century and from the more recent discoveries at Capricorn Metals’ Golden Range gold-antimony project to the south.\n\nAdvertisement\n\nPremier1’s Yalgoo project lies just 10 kilometres southeast of Ramelius’ Melville and Applecross prospects, which host some 5.2 million tonnes of resource at 1.4 g/t for 244,000 ounces. This ground was the focus of much of Spartan Resources’ exploration and prospectivity before the multi-million-ounce discovery of Never Never at its Dalgaranga project stole the show to the Northeast. Needless to say, there remains plenty of unfinished business in the northern reaches of the Yalgoo-Singleton. 29Metal’s Golden Grove base metals operation within the Yalgoo greenstone belt has been successfully operating for more than 35 years. Premier1’s flagship Wadgingarra prospect at Yalgoo anchors the project, where a maiden resource of 13,000 ounces sits within a conservative Whittle-optimised pit shell drawn up last year. The high-grade gold starts at surface at site and remains open along strike and at depth. The company says limited exploration has been conducted to define its high-grade resource, with historical shallow drilling averaging just 46m in depth at the project, focused only on oxide zones near old workings. Premier1’s maiden reverse-circulation program in early 2025 marked the first substantial modern drilling at the ground since the 1980’s. That’s a staggering amount of time considering the inherited high-grade near-surface intercepts up to 5 metres at 5.1g/t gold, 10 metres at 6.4 g/t gold and 2 metres at 20.8 g/t gold.\n\nAdvertisement\n\nNot surprisingly, then, the newer rod spin last year not only confirmed the presence of gold but also delivered some of the strongest intercepts recorded on the project. At its Crescent prospect in the north, one hole returned a staggering 3m hit running 31.5g/t gold from just 97m, including 1m at 91.9g/t gold, confirming bonanza-grade potential along trend from historical high-grade zones. At the company’s Carlisle prospect to the south, drilling extended mineralisation eastward with a 10-metre hit grading a handy 3.1g/t gold from 19m, including 7m at 4.3 g/t gold. A new zone west of Olive Queen also intersected mineralisation for the first time, with 1m at 1.5g/t gold within broader anomalous intervals and pathfinder support. The results were a fantastic first go at the ground, built directly on systematic work by Premier1. The intercepted structures identified from high-resolution magnetics and rock-chip sampling were full of high-grade gold.\n\nAdvertisement\n\nThe company says it’s eager to get back onto the ground and test its litany of litho-structural targets, including its fast-emerging Mt Kersey prospect in the East. Work at Mt Kersey has turned up a multi-kilometre pathfinder soil anomaly that coincides with double-digit gold grades from rock chips in what the company says is a complex structural setting linked to quartz-dolerite and gabbro rocks similar to regional gold systems. Premier1 boasts some 25kms of proven shear at Wadgingarra, where the shear trends under cover for kilometres to the south, offering scope for regional aircore and magnetics to chase previously overlooked district-scale extensions. The company, however, is far from a one-trick pony. Its second major project – Abbotts North - lies up the road in perhaps one of WA’s most active gold regions, along the Meekathara-Murchison greenstone belt. The project is a key second pillar to the company’s portfolio and sits just 35km north of Meekatharra in the Abbotts greenstones.\n\nAdvertisement\n\nIt is also just 20 kilometres from ASX-darling New Murchison Gold’s Crown Prince deposit, which has propelled that company’s market capitalisation towards A$800 million after making the high-grade discovery just 2 years ago. Rochefort – the flagship prospect at Abbotts North – sits along strike from New Murchison and has emerged as a priority walk-up target, thanks to a 350m-by-350m gold anomaly above a dolerite host rock. Heritage clearances are advancing for a planned regional aircore drill program and an ultrafine soil sampling campaign later in the year, both backed by an existing $180,000 EIS government grant and a $180,000 drill credit with Strike Drilling, all waiting in Premier1’s back pocket. The company’s prime ground is now paired with renewed corporate drive, as experienced gold hand Simon Phillips takes the reins. With a career spanning discovery to development, his promotion comes alongside a $650,000 raise to sustain exploration momentum into 2026. Also joining the revitalised company is Mr Dale Hanna. A chartered accountant with more than 20 years of experience across ASX-listed resource companies, his background spans the full spectrum of mining operations from early-stage exploration through to production.\n\nAdvertisement\n\nJoining Hanna and Phillips on the board, previous managing director Jason Froud - who helped steer Premier1 through its strategic pivot from lithium to gold – will stay on, transitioning to a non-executive director role. Boasting shallow high-grade gold at Wadgingarra, walk-up targets at Mt Kersey and numerous processing options in the region, the company’s Yalgoo gold tilt looks to be only beginning. As majors build empires to the north and south of both the company’s projects, Premier1 and its expanding resources could soon add even more shine to the region’s reputation. For now, though, the gold minnow - capped at just $6.5 million - is looking at a fresh new chapter of drilling in 2026 and hopeful it can turn that potential into reality. Is your ASX-listed company doing something interesting? Contact: mattbirney@bullsnbears.com.au\n\nSave You have reached your maximum number of saved items. Remove items from your saved list to add more. Share More: Bulls N' Bears\n\nSharemarket\n\nShares",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/politics/queensland/why-queensland-public-servants-could-pocket-a-wage-jump-20260129-p5ny2t.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Why Queensland public servants could pocket a wage jump",
        "publish_date": "Fri, 30 Jan 2026 12:12:38 +1100",
        "category": "finance",
        "authors": [
            "Matt Dennien"
        ],
        "text": "Advertisement\n\nPoliticsQueenslandQueensland government Why Queensland public servants could pocket a wage jump Matt Dennien January 30, 2026 — 12:12pm Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share A A A\n\nMore than 100,000 Queensland public servants are on track to pocket an inflation-driven pay bump of up to $500, heaping further pressure on the state’s ballooning debt. Following higher-than-expected inflation figures this week in which Brisbane led the nation on 5.2 per cent, analysis suggests several workforces are set for a topped-up annual wage rise. Queensland public servants could be in for a wage boost. Matt Dennien The potential for inflation uplift included in state wage deals inked last year forced the Crisafulli government to set aside $169 million in its December budget update – amid concern from ratings agencies and economists. Bargaining concessions from government last year added $345 million above the budgeted cost of its blanket wage policy, dictating rises of 3 per cent in 2025-26, and 2.5 per cent in the following two years of the deals.\n\nAdvertisement\n\nBut the finalised deals spanning police, firefighters, paramedics, nurses, doctors, health administration staff, and non-teaching school staff and others, also featured potential inflation-related pay bumps. Should the March inflation figure for Brisbane pass the agreed pay rise for that financial year, pay will instead be matched to inflation – to a 2025-26 cap of up to 0.5 per cent. Queensland Treasurer David Janetzki blamed the inflation spike on the end of electricity rebates. Renee Nowytarger For a public servant on the average sector salary of about $100,000, this could add up to $500 to their base annual pay. Any inflation-adjusted increase to pay rises will also be backdated across the entire financial year, and form the base pay rate from which future rises are also calculated.\n\nAdvertisement\n\nIndependent economist Saul Eslake said while the December quarter spike in Brisbane inflation was essentially an anomaly caused by energy rebates ending, the March figure was likely to be above the 3 per cent pay bump trigger. Related Article Queensland budget Qld avoids credit rating downgrade. But state’s books ‘remain grim’ He said that meant the spike was essentially caused by the former Miles government’s extensive pre-election rebates, criticised by some as an inflation-driving attempt to buy votes. Because of this, he believed it was “ludicrous that the unwinding of that is the catalyst for the paying of more taxpayer money to a smaller group of public servants”. “I would think the Queensland government probably needs to prepare itself to have a stoush over that,” Eslake told this masthead.\n\nAdvertisement\n\n“Queensland isn’t in the worst [budget] position of Australian states … but Queensland’s financial position has deteriorated quite significantly from what was the best in the country. “And this would be another serious blow to that.” Treasurer David Janetzki’s office stressed the headline annual inflation rise in Queensland to November was below the national headline figure, which meant the growth revealed this week was caused by short-term factors – primarily the end of electricity rebates. He also criticised Labor for enacting temporary cost-of-living measures, saying his government was “doing its bit to ease cost pressures facing families”. Deputy Opposition Leader Cameron Dick blamed the government for high inflation and said while the extra pay bump might help some, many people were struggling.\n\nAdvertisement\n\n“David Crisafulli is delivering the highest state inflation in the country as his affordability crisis deepens, and it will cost the state’s budget hundreds of millions of dollars,” he said. While in government, Labor had argued its power bill rebates had helped ease inflation by reducing the electricity bill element of the official figures. In December, the state government revealed in its midyear budget update the state operating balance fell almost $400 million further into deficit. Start the day with a summary of the day’s most important and interesting stories, analysis and insights. Sign up for our Morning Edition newsletter.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/culture/movies/melania-documentary-screenings-delayed-at-last-minute-20260130-p5ny90.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Melania documentary screenings delayed at last minute",
        "publish_date": "Fri, 30 Jan 2026 11:57:19 +1100",
        "category": "finance",
        "authors": [
            "Karl Quinn"
        ],
        "text": "Add articles to your saved list and come back to them anytime.\n\nAustralian political (and fashion) junkies champing at the bit for an early look at the documentary Melania have been dealt a blow, with Friday morning screenings of the Brett Ratner-directed film suddenly disappearing from the schedule.\n\nBut hold your horses, conspiracy theorists: rather than censorship being at play, it appears that the delay is due to a simple case of poor communication.\n\nPresident Donald Trump and first lady Melania Trump arrive for the premiere of her documentary Melania at the renamed Trump Kennedy Centre in Washington. AP\n\nThe film, which follows the 20 days leading up to Donald Trump’s return to the White House in January last year, is getting a short cinema run before dropping on the Prime Video platform. Amazon reportedly paid $US40 million for the right to distribute it (with $US28 million of that going straight to its subject), and another $US35 million to promote and market.\n\nThe tech giant paid $US26 million more for the film than Disney, its closest rival bidder, prompting some speculation that the company is attempting to curry favour with the Trump administration by paying well over the odds for what is essentially a vanity project.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/business/the-economy/you-re-paying-for-someone-else-s-profit-here-s-how-we-claw-it-back-20260129-p5nxzu.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "You’re paying for someone else’s profit. Here’s how we claw it back",
        "publish_date": "Fri, 30 Jan 2026 11:55:00 +1100",
        "category": "finance",
        "authors": [
            "Millie Muroi"
        ],
        "text": "Advertisement\n\nBusinessThe economyCarbon pricing Opinion You’re paying for someone else’s profit. Here’s how we claw it back Millie Muroi Economics Writer January 30, 2026 — 11:55am\n\nJanuary 30, 2026 — 11:55am Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share A A A\n\nWhat if I told you that you’re paying for someone else to make money? It might not be in the form of a bill sent to your home, or a bite taken out of your payslip every fortnight, but nearly all of us are paying a big cost we shouldn’t be. The problem is: it’s not really visible unless you know about it. It’s not too late to take inspiration from countries such as Norway, which has – largely through its taxing of resources – built up the world’s largest sovereign wealth fund. Matt Davidson You’ve probably heard plenty about the need to tax resources companies more: not just for the pollution they pump into the atmosphere and damage they cause to the environment, but also because they’re effectively making money out of digging up rocks, metals and gasses which don’t belong to them.\n\nAdvertisement\n\nOf course, there’s an argument they don’t really belong to any of us, except Aboriginal and Torres Strait Islander people who have looked after the land for centuries before colonisation. But as long as companies are continuing to mine resources, it makes sense for them to pay for the privilege – and to pay an amount that properly compensates for the damage caused by their businesses. It also makes sense for us to incentivise them to clean up their act. That’s where the Superpower Institute (started by economist Professor Ross Garnaut and former competition watchdog head Rod Sims) kicks in. They may not have found a way to harness superpowers such as invisibility, but they (and experts Dr Ingrid Burford and Dr Reuben Finighan) have found a way to rein in the invisible villain that is greenhouse gas emissions. As their new report explains, between 2020 and 2023, Australia’s state and federal governments took 30 per cent of fossil fuel companies’ profits (mostly through a patchwork of corporate tax, royalties and the Petroleum Resource Rent Tax).\n\nAdvertisement\n\nThat might seem like a decent chunk, but it’s much less than the 75 to 90 per cent that other major fossil fuel exporting countries claw back, and not nearly enough to make up for the costs of pollution or to move us towards net zero fast enough. If we continue as we are, we’ll struggle to fund essential services and to lift spending on education, new technologies and infrastructure: things we need to do if we’re going to boost productivity. Meanwhile, as natural disasters become more frequent, our insurance costs are going up, and we’re paying more at the checkout every time severe droughts or floods wipe out our farmers’ harvests. It also comes at a time when the country needs a stronger budget to prepare for the bigger health and aged care bills that will come with an ageing population, to shield us from international shocks, and lift our living standards. Budget deficits are not always bad, but always having budget deficits is, and we’re still a decade away from returning to surplus.\n\nAdvertisement\n\nIf we continue as we are, we’ll struggle to fund essential services and to lift spending on education, new technologies and infrastructure: things we need to do if we’re going to boost productivity (our ability to produce and do things better, faster or using fewer resources). Related Article Updated\n\nEnergy ‘Landmark moment’: Renewables’ record surge sends power prices tumbling Luckily, there’s a big group of companies that can play a big role in this – but how do we get them to cough up? Right now, we rely on policies such as the “safeguard mechanism” where the country’s biggest industrial facilities are forced to limit their emissions (and, if they emit more than they’re allowed to, to pay for emission-reducing projects by buying “carbon credits”). There are several problems, though.\n\nAdvertisement\n\nThe mechanism allows companies to buy their way out of actually reducing their own emissions, and often, the “credits” they buy can be for projects that don’t actually make as much difference as they claim, or projects which would have gone ahead anyway – and it fails to generate any government revenue. Instead, the first policy proposed by the Superpower Institute is a “polluter pays levy” – or PPL – which would apply to coal, oil and gas extracted and consumed in Australia, and to fossil fuel imports including oil, petrol and diesel. For example, a company that mines and sells black coal would pay a levy for the methane released during their mining process and the carbon dioxide released when the coal is combusted to produce electricity. The levy would start this year at $17 for every tonne of CO2 – or equivalent amount of another greenhouse gas – rising gradually until it hits the European Union’s carbon price in 2034, then continue tracking the EU carbon price. It would cover more than 80 per cent of Australia’s emissions, would be more straightforward and difficult to game than current policies, and raise nearly $23 billion of revenue on average every year.\n\nAdvertisement\n\nThat’s important because while Australians tend to support policies and actions to reduce emissions, we’re sensitive to cost-of-living pressures such as energy bills. Most of us want to do the right thing, but when it costs us more, we might think twice. The revenue from the levy would partly be used to reimburse households for higher energy costs – even generating enough to over-compensate them. Whether $330 a year, as proposed by the institute, is enough for households to feel they are better off is up for some debate. But if polling is anything to go by, it’s a policy that has a decent amount of public support. More than 60 per cent in a survey of 3000 voters (conducted by Redbridge Research for the Superpower Institute) agreed or strongly agreed with a polluter-pays levy. Overall, the institute reckons compensation for households would cost about $4.1 billion a year on average: less than one quarter of the revenue raised from the levy. Small businesses would also receive $325 a year, and compensation for households could be more targeted, starting at $490 a year for the bottom 75 per cent of households by income.\n\nAdvertisement\n\nThe levy would also crucially help reduce Australia’s annual carbon emissions by about 2.3 times more than under current policies according to the research. Related Article Opinion\n\nAI Robots, redundancies and runaway spending: Not all AI hits the mark Elizabeth Knight Business columnist The institute also suggests a “fair share levy” on gas exports, mirroring the system Norwegians have in place. The existing Petroleum Resources Rent Tax, introduced in the 1980s, doesn’t work very well, especially for Australia’s liquefied natural gas industry. Why? In short: because gas projects usually take decades (and a lot more money) to build than oil projects. Gas extracting companies can deduct these building costs (which they can carry across from one year to the next, and which can balloon every year to account for interest and inflation), effectively leaving them tax-free – sometimes forever.\n\nAdvertisement\n\nInstead, the fair share levy, which would collect 40 per cent of the large profits that gas companies pocket over time, would be based on expenses and revenues companies face within the year. The government would take a fixed share of profits or losses each year, with a tax refund given to companies in a loss-making year. Since profits from the Australian oil and gas industry overwhelmingly flow to foreign shareholders, taxing these profits means Australians will be better off, with the annual benefit – at its peak – being about $1500 for every Australian household. The tax revenue generated from the two levies – averaging nearly $36 billion each year – could be used not only to compensate households and get the budget in better shape to fund essential services, but to invest in green industries where Australia has a competitive edge over many other countries. While we can’t claw back the resources, emissions or money we’ve let float by us, it’s not too late to take inspiration from countries such as Norway, which has – largely through its taxing of resources – built up the world’s largest sovereign wealth fund. Perhaps most crucially, if we act now, we can set ourselves up to be a superpower in the global green transition. The Business Briefing newsletter delivers major stories, exclusive coverage and expert opinion. Sign up to get it every weekday morning.\n\nSave You have reached your maximum number of saved items. Remove items from your saved list to add more. Share License this article More: Carbon pricing\n\nOpinion Millie Muroi is the economics writer at The Sydney Morning Herald and The Age. She was formerly an economics correspondent based in Canberra’s Press Gallery and the banking writer based in Sydney. or email. Connect via X",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/environment/conservation/australia-s-bid-to-persuade-the-un-the-great-barrier-reef-is-doing-better-20260130-p5ny87.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Australia’s bid to persuade the UN the Great Barrier Reef is doing better",
        "publish_date": "Fri, 30 Jan 2026 11:53:56 +1100",
        "category": "finance",
        "authors": [
            "Bianca Hall"
        ],
        "text": "Advertisement\n\nEnvironmentConservationGreat Barrier Reef Australia’s bid to persuade the UN the Great Barrier Reef is doing better Bianca Hall January 30, 2026 — 11:53am Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share A A A\n\nThe federal government has launched a spirited defence before the international community of its efforts to protect the Great Barrier Reef, in its latest bid to avoid the reef being listed as “in danger”. In 2021 the United Nations Educational, Scientific and Cultural Organisation (UNESCO) issued a draft recommendation that the Great Barrier Reef should be listed as an “in danger” World Heritage site. Bleached coral on the Great Barrier Reef. AP Since then Australia has been locked in a multi-year battle to prevent that listing taking effect, a listing it says could place thousands of jobs at risk, particularly in tourism. Last year UNESCO’s World Heritage Committee ordered a full review of Australia’s management of the Great Barrier Reef, following the sixth mass bleaching event in nine years.\n\nAdvertisement\n\nThe body identified four areas of concern: climate pollution, water quality, climate-driven disasters like mass bleaching, and fisheries management. The government estimates the Great Barrier Reef contributes more than $9 billion a year to the Australian economy and, as the nation’s fifth-biggest employer, supports 77,000 jobs. Coral scientists capture larvae during this year’s annual coral spawning on the Great Barrier Reef. The Reef Co-Operative “There’s no doubt that the Great Barrier Reef is under extreme pressure from a range of factors like climate change, crown-of-thorns starfish, again, still issues around sediment run-off and reef water quality,” Environment Minister Murray Watt told ABC radio on Friday morning. “But what we can also say is that the actions that both levels of government, along with the broader community, are taking are making the reef more resilient towards those changes.”\n\nAdvertisement\n\nResponding to UNESCO, the government on Friday released a state party report on the steps it has undertaken to protect the reef’s ecosystems, in a bid to maintain the reef’s listing of Outstanding Universal Value. The report emphasised the significant amendments to federal environment laws, passed with the support of the Greens last year, as a key measure that would help protect the reef. It also highlighted the government’s decision to increase Australia’s emissions reduction targets and reduce land-clearing within 50 metres of a watercourse, wetland or drainage line in the reef catchment area. The Great Barrier Reef is under threat. iStock The federal government has spent $1.2 billion to help build the reef’s resilience and says its total investment – in partnership with the Queensland government – is more than $5 billion since 2014. Watt said the reef was one of the best-managed reef systems in the world and that Australia had not just met every commitment it has made to protect the reef but gone further.\n\nAdvertisement\n\nRelated Article Australia votes Great Barrier Reef bleaching turns up heat in key Coalition seat The Australian Marine Conservation Society’s Great Barrier Reef campaign manager Dr Lissa Schindler said the government had taken positive steps to improve the reef’s health but had not gone far enough. “Yes, they are pushing forward with renewable energy projects, but they’re also pushing forward with fossil fuel projects, and fossil fuels, like oil and coal and gas, is what is actually driving climate change,” she said. “Australia’s climate target is not in line with 1.5 degrees [of warming], which is what is needed for coral reefs to survive.” When UNESCO first signalled its intention to delist the reef of its Outstanding Universal Value status in 2021, the then-Morrison government acknowledged that climate change was the single greatest threat to its survival but insisted that only global action to reduce emissions would have any meaningful impact.\n\nAdvertisement\n\nIt noted that Australia’s emissions comprised just 1.3 per cent of the global total and said that “Australia’s efforts to reduce its own emissions would have virtually no impact on the long-term health and resilience of the reef”. The Albanese government has sought to emphasise Australia’s stronger emissions reductions commitments under Labor. Under the Paris Agreement, Australia has set a target to reduce greenhouse gas emissions by 62-70 per cent below 2005 levels by 2035 – a measure Watt described as “ambitious and achievable”. The federal government has also argued the Great Barrier Reef is not alone in experiencing mass bleaching events, which have affected coral reefs worldwide as climate change drives ocean temperatures up. In a letter to UNESCO World Heritage Centre director Lazare Eloundou Assomo, Watt pointed out the 2023-2024 bleaching event had also affected more than 84 per cent of the world’s coral reefs in more than 80 other countries and territories. “In submitting this report, I want to strongly reiterate that Australia’s management of the [Great Barrier] Reef is recognised as world-leading and our impactful and adaptive actions remain integral to protecting this World Heritage property’s Outstanding Universal Value into the future,” Watt wrote.\n\nAdvertisement\n\n“Australia continues to act on its commitments under the Paris Agreement to tackle climate change and remains willing to lend our substantial expertise to other countries with climate-affected World Heritage sites.” The World Heritage Committee will consider Australia’s response at a session to be held in July. If it deems Australia’s response is insufficient, it will then consider listing the reef as “World Heritage In Danger”. Get to the heart of what’s happening with climate change and the environment. Sign up for our fortnightly Environment newsletter.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/nrl/game-on-how-your-nrl-team-is-shaping-up-for-season-2026-20260126-p5nwyz.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Game on: How your NRL team is shaping up for season 2026",
        "publish_date": "Fri, 30 Jan 2026 11:52:19 +1100",
        "category": "sports",
        "authors": [
            "Robert Dillon"
        ],
        "text": "Haas, the NSW, former Kangaroos and now Samoa bulldozer, is off contract at the end of 2026, but reports suggest he is close to signing a 12-month extension, taking him through to the end of 2027. By then, Haas will be 28 and, if the proposed R360 rugby competition gets off the ground, he could be tempted by riches beyond anything available in the NRL. Alternatively, he could be precisely the type of marquee signing the Perth Bears will come chasing. Brisbane will want to retain Payne Haas beyond the 2026 season. Credit: Getty Images The Broncos would no doubt love to re-sign Haas to a long-term deal. The ageing legs of halves Ben Hunt and Adam Reynolds don’t have many more tomorrows left. Haas, on the other hand, is a franchise player, at the top of his game.\n\nKey gains: Aublix Tawha (Dolphins), Grant Anderson (Storm), Tom Duffy (Cowboys).\n\nKey losses: Selwyn Cobbo (Dolphins), Kobe Hetherington (Sea Eagles), Tyson Smoothy (Wakefield)\n\nComing off contract: Adam Reynolds, Ben Hunt, Gehamat Shibasaki, Billy Walters, Jack Gosiewski, Payne Haas, Cory Paix, Jesse Arthars. Storm (runners-up) Harry Grant comes to terms with another grand final loss. Credit: NRL Photos What’s the story? First Ryan Papenhuyzen and Nelson Asofa-Solomona announced they were taking sabbaticals. Next Eliesa Katoa suffered a horrific concussion playing for Tonga that will sideline him for 2026 at least, and then the Perth Bears swooped to sign Nick Meaney and Tyran Wishart for their 2027 foundation season.\n\nAll this, on top of losing back-to-back grand finals, does not augur well, but the Melbourne Storm are no ordinary team. Nonetheless, it shapes as a bit of a rebuilding operation, and nobody is better qualified to oversee the process than Craig Bellamy, arguably the greatest coach in the game. Of course, the big question remains: how long will 66-year-old Bellamy continue? He has been quite content to sign one-year extensions, while hinting retirement is not far away. Players are replaceable, but Melbourne must be dreading the day “Bellyache” informs them he’s pulling the pin. They’ll be hoping his era continues beyond this season. Key gains: Jack Hetherington (Knights), Davvy Moale (Rabbitohs), Manaia Waitere (Raiders)\n\nKey losses: Ryan Papenhuyzen, Nelson Asofa-Solomona (both released), Jonah Pezet (Eels), Grant Anderson (Broncos)\n\nComing off contract: Will Warbrick, Shawn Blore, Jack Hetherington, Tui Kamikamica.\n\nPanthers (preliminary final) It’s back to square one for Penrith after Brisbane ended their dynasty in last year’s preliminary final. Credit: Getty Images What’s the story? Compared to the spotlight they commanded during their four-year reign as champions, the Panthers have spent the off-season flying under the radar, which no doubt suits coach Ivan Cleary just fine. Rival teams, however, are entitled to be nervous: how hungry will the deposed champions be after surrendering their title?\n\nComplacency can bring even the greatest of teams undone, once they’ve been there, won that, on multiple occasions. Do they have the willpower to get back up there? Nathan Cleary, the ultimate competitor and perfectionist, will surely relish the challenge. Beware the Panthers. They’re not done yet. Key gains: Jack Cogger (Knights), Tom Ale (Warriors), Freddy Lussick (Warriors)\n\nKey losses: Brad Schneider (Dolphins), Daine Laurie (Raiders), Mavrik Geyer (Tigers), Trent Toelau (Storm), Soni Luke (Cowboys)\n\nComing off contract: Scott Sorensen, Luke Garner, Lindsay Smith, Matt Eisenhuth, Tom Ale. Sharks (preliminary final)\n\nThe Sharks were furious with the performance of referee Ashley Klein in last year’s preliminary final. Credit: Getty Images What’s the story? Shark Park was a hive of activity last week, on and off the field. As Cronulla’s players completed a gruelling training session under the eye of coach Fitzgibbon, tradesmen were just as hard at work in the adjoining building site. It is hoped they will have completed the fit-out of the leagues club redevelopment by mid-to-late 2026, allowing the Sharks to reopen for the first time in six years, after myriad construction delays.\n\nThey’ll be hoping it improves their financial position to the point where they can apply for government funding for a centre of excellence, which would put them on level footing with their Sydney-based NRL rivals. Meanwhile, Fitzgibbon and his very settled squad are not satisfied with back-to-back appearances in preliminary finals. Old-school training facilities might yet provide the steely edge that helps them claim the ultimate prize. Key gains: None\n\nKey losses: Daniel Atkinson (Dragons), Kade Dykes (Bulldogs)\n\nComing off contract: Cam McInnes, Siosifa Talakai, Sione Katoa, Jesse Ramien, Sam Stonestreet, Toby Rudolf, Will Kennedy, Braden Hamlin-Uele, Billy Burns. Raiders (semi-finalists) The Canberra Raiders won the minor premiership but lost both play-offs. Credit: Getty Images\n\nWhat’s the story? Coach Ricky Stuart is set to give 22-year-old Ethan Sanders first shot at steering the Raiders after the departure of halfback Jamal Fogarty. Stuart has plenty of faith in Sanders, who has played four NRL matches across the past two seasons with the Raiders and Eels. Sanders is also a handy goalkicker, which could make him a like-for-like replacement for Fogarty, now at Manly. And he’ll have the perfect mentor in Stuart, one of the greatest halfbacks of all time.\n\nStuart guided the Green Machine to the minor premiership last season, but heartbreak followed when they bowed out of the finals with back-to-back defeats. They’ll be primed to give a better account of themselves this year at the business end of proceedings. Key gains: Jayden Brailey (Knights), Daine Laurie (Panthers), Coby Black (Broncos), Sione Finau (Dragons)\n\nKey losses: Jamal Fogarty (Sea Eagles), Trey Mooney (Knights), Pasami Saulo (Knights), Danny Levi (Leeds)\n\nComing off contract: Josh Papali’i, Morgan Smithies, Chevy Stewart Bulldogs (semi-finalists) The Bulldogs contemplate their season-ending defeat against the Panthers. Credit: NRL Photos What’s the story?\n\nAs the first major signing of Canterbury’s rebuild, Matt Burton has been both a catalyst for change and a cornerstone of their success the past two seasons. Burton’s form last year was as good as ever, yet there is already speculation that he will be squeezed out at the end of this season, despite being contracted until the end of 2027. The theory goes that the Bulldogs want Lachlan Galvin to play five-eighth, his natural position, and they have a promising young half waiting in the wings called Mitchell Woods. Whether Burton is the odd man out remains to be seen, but if he wants to win a premiership with Canterbury – to add to the one he collected at Penrith – there’s no time like the present. After finishing third last season before exiting the finals in straight sets, the Bulldogs will be hoping former Knights prop Leo Thompson can give them a new dimension.\n\nKey gains: Leo Thompson (Knights), Kade Dykes (Sharks), Sean O’Sullivan (Dolphins), Fletcher Baker (Broncos)\n\nKey losses: Reed Mahoney (Cowboys), Toby Sexton (Catalans), Blake Wilson (Sea Eagles)\n\nComing off contract: Connor Tracey, Daniel Suluka-Fifita, Jake Turpin, Kurt Mann, Marcelo Montoya. Warriors (finalists) Luke Metcalf was leading the 2025 Dally M count before he suffered a season-ending knee injury in June. Credit: Getty Images What’s the story? Coach Andrew Webster will be sweating on the return of co-captain Mitch Barnett and halfback Luke Metcalf from season-ending knee reconstructions.\n\nBefore the loss of NSW and Kangaroos forward Barnett last June, the Warriors had won nine of their first 12 games and were sitting second on the ladder. Metcalf, who was leading the Dally M voting, was sidelined soon after, and Webster’s men eventually limped home in sixth position, before being bundled out by Penrith in week one of the play-offs. Barnett hopes to launch his comeback inside the first few rounds. Metcalf is aiming for round seven. The Warriors are expecting big things from new signing Alofiana Khan-Pereira, who was a prolific try-scorer at the Gold Coast. And Barnett has also tipped English forward Morgan Gannon to make an immediate impact. Main gains: Alofiana Khan-Pereira (Titans), Morgan Gannon (Leeds)\n\nMain losses: Bunty Afoa (Tigers), Freddy Lussick (Panthers), Tom Ale (Panthers)\n\nComing off contract: Roger Tuivasa-Sheck, Kurt Capewell, Marata Niukore, Chanel Harris-Tavita, Rocco Berry, Te Maire Martin, Tanah Boyd.\n\nRoosters (finalists) Roosters skipper James Tedesco and new recruit Daly Cherry-Evans. Credit: Peter Rae What’s the story? Can Daly Cherry-Evans emulate Cooper Cronk and become a premiership-winning talisman with the Roosters? The former Manly skipper might be the oldest player in the NRL, turning 37 before the season kicks off, but he is likely to turn the Chooks into contenders again. The DCE coup has commanded so much attention it is easy to forget the Roosters have also signed the incumbent NSW hooker, Reece Robson, from the Cowboys.\n\nAdding further depth to an imposing squad, Tommy Talau (Manly) and Cody Ramsey (St George Illawarra) are waiting in the wings, in case Trent Robinson loses any of his outside backs to injury. On the flip side, Kangaroos stars Angus Crichton and Mark Nawaqanitawase will switch codes at season’s end, in the hope of winning a World Cup with the Wallabies. They will no doubt have their hearts set on a grand final lap of honour before clocking off. Key gains: Daly Cherry-Evans (Sea Eagles), Reece Robson (Cowboys), Tommy Talau (Sea Eagles), Cody Ramsey (Dragons)\n\nKey losses: Sandon Smith (Knights), Zach Dockar-Clay (Sea Eagles)\n\nComing off contract: Daly Cherry-Evans, Daniel Tupou, Siua Wong, Tommy Talau. Dolphins (ninth)\n\nThomas Flegler hasn’t played since he was injured against the Wests Tigers in round five, 2024. Credit: NRL Photos What’s the story? They came within one win of a maiden finals berth last season, and now the Dolphins will be bolstered by an influx of quality reinforcements. Former Queensland and Kangaroos prop Thomas Flegler, who hasn’t played for almost two years after suffering career-threatening nerve damage in his shoulder, will return. Tom Gilbert (pectoral), Daniel Saifiti (shoulder), Max Plath (knee) and Jack Bostock (knee) won’t be too far behind him. Throw in English import Morgan Knowles – a four-time Super League winner with St Helens – and the Dolphins should have some serious muscle in 2026.\n\nMeanwhile, after scoring 721 points last season – the most by any team during the regular season – the Dolphins have added explosive Selwyn Cobbo to their backline. In Cobbo and Hamiso Tabuai-Fidow, Dolphins coach Kristian Woolf will have two strike weapons capable of scoring from anywhere. Key gains: Selwyn Cobbo (Broncos), Morgan Knowles (St Helens), Brad Schneider (Panthers)\n\nKey losses: Josh Kerr (Dragons), Mark Nicholls, Kenny Bromwich (both retired), Max Feagai (Titans), Aublix Tawha (Broncos), Sean O’Sullivan (Bulldogs)\n\nComing off contract: Selwyn Cobbo, Jamayne Isaako, Brad Schneider, Jake Averillo, Francis Molo, Ray Stone, Trai Fuller, Kodi Nikorima. Manly Sea Eagles (10th) Manly players after their scrimmage with St George Illawarra last week. Credit: Max Mason-Hubers\n\nWhat’s the story? For the first time since he debuted in 2011 – the last time Manly won a premiership – the Sea Eagles head into a season without Daly Cherry-Evans in their No.7 jersey. But after signing former Canberra playmaker Jamal Fogarty, Manly coach Anthony Seibold will be hoping the transition is seamless. The Sea Eagles finished two points outside the top eight last year, but they were cruelled by season-ending injuries to big men Taniela Paseka and Haumole Olakau’atu, and Jake Trbojevic’s concussion. As always, much will depend on Tom Trbojevic, who will lead the new era after succeeding Cherry-Evans as skipper and return to his preferred fullback role. His fitness and form will be crucial to Manly’s finals hopes, and in turn to Seibold’s job security.\n\nThe Sea Eagles have reached the play-offs just once during Seibold’s three seasons. He is contracted until the end of 2027, but needs a breakout season to keep the wolves from the door. Key gains: Jamal Fogarty (Raiders), Kobe Hetherington (Broncos), Zach Docker-Clay (Roosters)\n\nKey losses: Daly Cherry-Evans (Roosters), Tommy Talau (Roosters), Matt Lodge (Cowboys), Toafofoa Sipley (Warrington), Josh Aloiai, Lachlan Croker (both retired), Jazz Tevaga (Wakefield)\n\nComing off contract: Jake Trbojevic, Tolutau Koula, Siosiua Taukeiaho. Parramatta Eels (11th) The Eels and former winger Zac Lomax are set for a legal battle. Credit: Getty Images What’s the story?\n\nWhat, or who, will the Eels receive in exchange for Zac Lomax? That is the main narrative surrounding Parramatta after the protracted contractual impasse that prompted the club to launch legal action last week against the representative winger, to ensure he doesn’t join a rival NRL team without their permission. The Eels agreed to release Lomax from his contract, believing he would head to rugby union. Instead, he wants to join the Melbourne Storm, who haven’t overwhelmed the Eels with whatever they have offered in terms of financial compensation or a possible player exchange. Whatever transpires with Lomax, you can guarantee Eels coach Jason Ryles, an unflappable type, is getting on with business after delivering 10 wins in his rookie year as head coach in 2026. If Parramatta’s improvement continues, their first finals appearance since 2022 appears a realistic outcome.\n\nKey gains: Jonah Pezet (Storm), Jack de Belin (Dragons), Brian Kelly (Titans)\n\nKey losses: Dylan Brown (Knights), Zac Lomax (released), Shaun Lane (retired), Brendan Hands (Toulouse), Dean Hawkins (London Broncos)\n\nComing off contract: Junior Paulo, Will Penisini, Dylan Walker, Joash Papalii, Kelma Tuilagi, Ryan Matterson North Queensland Cowboys (12th) Cowboys coach Todd Payten with veteran Jason Taumalolo. Credit: NRL Photos What’s the story? Cowboys coach Todd Payten is unlikely to lose any sleep over constant speculation that he’s a dead man walking if North Queensland cannot reach the finals in 2026.\n\nPayten is heading into his fifth season as North Queensland’s tactician, and has made the finals in two of his previous four attempts. He has a 50 per cent winning record, which is second only to the late Paul Green, the sole coach to have steered the Cowboys to a premiership. Nonetheless, Payten is off contract at the end of this season, and the NRL is a ruthless industry, so nobody will need to remind him what is at stake. Any disappointment the Cowboys felt when NSW Origin hooker Reece Robson signed with the Roosters was offset by their recruitment of feisty Reed Mahoney from the Bulldogs. A favourable draw in the early rounds could potentially alleviate the pressure on Payten, providing the Cowboys can capitalise. Key gains: Reed Mahoney (Bulldogs), Matt Lodge (Sea Eagles), Soni Luke (Panthers)\n\nKey losses: Reece Robson (Roosters), Jordan McLean (retired), Karl Lawton (Hull KR)\n\nComing off contract: Murray Taulagi, Jake Clifford, Jaxon Purdue, Braidon Burns, John Bateman, Matt Lodge, Sam McIntyre.\n\nWests Tigers (13th) Wests Tigers fans have been waiting since 2011 to cheer for their team in the finals. Credit: Getty Images What’s the story? Regardless of the boardroom brawling late last year, culminating in the departure of chief executive Shane Richardson, the Wests Tigers players will be eager to continue their on-field improvement under coach Benji Marshall. Recruits Kai Pearce-Paul, the England and former Newcastle back-rower, and ex-Warriors prop Bunty Afoa should ensure the Tigers are more capable of throwing their weight around this season as they seek their first finals appearance since 2011.\n\nMarshall steered them to nine wins and 13th spot last season, a vast improvement on three consecutive wooden spoons. With Lachlan Galvin gone, the Tigers have a more settled look about them. Jarome Luai, Adam Doueihi, Api Koroisau and Jahream Bula are evolving into a quality spine, and irrespective of any boardroom shenanigans, Tigers fans are entitled to be optimistic their team can challenge for a play-off berth. Key gains: Kai Pearce-Paul (Knights), Bunty Afoa (Warriors), Mavrik Geyer (Panthers), Jock Madden (Broncos)\n\nKey losses: Charlie Staines (Catalans), Brent Naden (released)\n\nComing off contract: Jarome Luai, Jahream Bula, Jack Bird, Sione Fainu, Jeral Skelton, Mavrik Geyer, Tony Sukkar. South Sydney Rabbitohs (14th) Wayne Bennett delivered underwhelming returns on his return to South Sydney. Credit: Getty Images\n\nWhat’s the story? Coach Wayne Bennett has been a driving force behind a proposed rule change, whereby teams that concede a try will be given the option of either receiving the ball from the restart, or kicking off themselves. There is plenty of opposition among rival coaches and fans to the “scorer’s kick-off” plan, but by all accounts ARL Commission chairman Peter V’landys is inclined to back Bennett. “Stop whingeing about it … if you listen to some of these guys [complaining], we’d still be playing with unlimited tackles, and players would still be wearing black boots with white laces,” was Bennett’s response to the resistance. Regardless, Bennett faces a huge challenge at Souths. Last season was the worst result of his illustrious career, considering the Rabbitohs’ final placing (14th) and win tally (nine). He hasn’t had a team in the finals since 2021, and he hasn’t won a premiership since 2011.\n\nHe’s banking on enigmas like Latrell Mitchell, David Fifita and Brandon Smith to play consistently and avoid injuries, and for Cody Walker to keep defying Father Time. Key gains: David Fifita (Titans), Adam Elliott (Knights), Bronson Garlick (Storm), Jonah Glover (Dragons)\n\nKey losses: Davvy Moale (Storm), Lewis Dodd (Catalans), Mikaele Ravalawa (Castleford), Jacob Host (released), Siliva Havili (London), Shaquai Mitchell (released)\n\nComing off contract: Cody Walker, Jamie Humphreys, Sean Keppie, Adam Elliott, Liam Le Blanc Dragons (15th) The Dragons haven’t featured in the NRL finals since 2018. Credit: Getty Images What’s the story?\n\nWill Shane Flanagan have to drop his own son? The Dragons coach has never been known to shy away from a tough call, and the arrival of Daniel Atkinson from Cronulla ensures Kyle Flanagan is no sure thing to retain the No.7 jersey he wore in 24 games last season. Flanagan could find himself shifting to five-eighth, or potentially out of the starting side altogether. The Dragons received a massive boost before Christmas when they signed Keaon Koloamatangi from Souths. A helicopter tour of the Illawarra apparently sealed the deal, but the Kangaroos forward won’t arrive until 2027. In the interim, the Red V have to figure out how to win tight games. They suffered eight losses last year by six points or fewer. They’ll need to kick that habit to have any hope of reaching the finals for the first time since 2018.\n\nKey gains: Daniel Atkinson (Sharks), Josh Kerr (Dolphins), Setu Tu (Warriors)\n\nKey losses: Jack de Belin (Eels), Lachlan Ilias (Titans), David Klemmer (St Helens), Cody Ramsey (Roosters)\n\nComing off contract: Damien Cook, Tyrell Sloan, Jaydn Su’A, Emre Guler, Luciano Leilua, Blake Lawrie, Christian Tuipulotu. Titans (16th) A new era kicks off for the Titans under rookie coach Josh Hannay Credit: Getty Images What’s the story? Big Tino Fa’asuamaleaui is one of the game’s genuine warriors, and the Titans desperately need some early season success to have any hope of keeping the poachers at bay.\n\nThe Titans produced a great escape to avoid the 2025 wooden spoon, but rookie coach Josh Hannay might not be so fortunate in his debut season. Gold Coast appear to have cleared the deck for a spending spree, although it will require a leap of faith for Fa’asuamaleaui to extend his stay. Hannay can only hope his new-look team, with Lachlan Ilias calling the shots at halfback, can offer their captain a glimmer of hope that they are on the right trajectory. Given their roster, that will surely be easier said than done. Key gains: Lachlan Ilias (Dragons), Max Feagai (Dolphins), Luke Sommerton (Panthers), Kurtis Morrin (Bulldogs)\n\nKey losses: David Fifita (Rabbitohs), Kieran Foran (retired), Reagan Campbell-Gillard (London), Carter Gordon (released), Alofiana Khan-Pereira (Warriors), Brian Kelly (Eels)\n\nComing off contract: Tino Fa’asuamaleaui, Phillip Sami, Sam Verrills, Jaimin Joliffe.\n\nKnights (17th) Newcastle are hoping to offload the wooden spoon this season. Credit: Getty Images What’s the story? They’re set to field a potentially lethal backline, having spent a fortune on former Eels five-eighth Dylan Brown, whose job will be to unlock the likes of Kalyn Ponga, Bradman Best, Dominic Young, Fletcher Sharpe and Dane Gagai. But before the Ferraris can show their class, they’ll need a platform up front, and therein lies the problem for new coach Justin Holbrook in his first season at the helm of the incumbent wooden spooners.",
        "source": "TheAge"
    },
    {
        "url": "https://au.news.yahoo.com/very-serious-warning-deadly-virus-003707338.html",
        "title": "‘Serious’: Warning as deadly virus spreads",
        "publish_date": "2026-01-30T01:59:10Z",
        "category": "lifestyle",
        "authors": [],
        "text": "Health Minister Mark Butler says the government is monitoring the outbreak of the highly deadly Nipah virus “very closely” after two cases were detected in the Indian state of West Bengal.\n\nInternational airports across South and Southeast Asia have tightened health screening measures, with Thailand this week setting up designated parking bays for planes arriving from areas where the disease has been detected.\n\nThe virus has flu-like symptoms and can cause brain swelling and secondary ailments, such as pneumonia.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nUsually spread through animals such as bats and pigs, the virus has no cure or vaccine and its fatality rate is between 40-75 per cent.\n\nPerson-to-person transmission is rare because it typically requires “close, prolonged contact with an infected person”, according to the Australian Centre for Disease Control (CDC).\n\nMr Butler said on Friday the virus is “very serious”.\n\nHealth Minister Mark Butler says the government is monitoring the outbreak of Nipah virus ‘very closely’. Picture: NewsWire / Martin Ollman\n\n“The mortality rate is as many as one in two or even three in four people die if they if they develop the virus,” he told ABC radio, adding that it is different to airborne viruses such as Covid-19 or the flu.\n\n“It requires very close personal contact between humans and the exchange, effectively, of bodily fluids.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\n“So there’s reason to hope that this has been contained, but we’re monitoring it very, very closely.\n\n“We don’t have any advice at the moment to change our existing protocols for sick travellers who arrive in Australia.\n\n“There already are protocols for that, but we’ll continue to watch the situation closely.”\n\nNipah virus has never been detected in Australia.\n\nThe CDC this week put out advice for any Australians travelling to areas at risk.\n\nThe agency advised avoiding contact with animals and areas where bats live.\n\nIt also urged travellers to avoid fruit that could be contaminated with an animal’s bodily fluids or “contact with anybody who is unwell and their bodily fluids”.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nIndian health authorities have traced nearly 200 people who came into contact with those infected in December.\n\nNone of them showed any symptoms and all tested negative.\n\nVirologists are working on several vaccines.",
        "source": "Yahoo"
    },
    {
        "url": "https://au.news.yahoo.com/scurry-seal-australia-trade-deal-015822786.html",
        "title": "Scurry to seal Australia trade deal as EU chief visits",
        "publish_date": "2026-01-30T01:58:22Z",
        "category": "finance",
        "authors": [],
        "text": "Australian and European officials are scrambling to bridge the gap for an elusive free trade agreement as diplomatic heavyweights prepare a meeting to seal the deal.\n\nPlans are being drawn up for Trade Minister Don Farrell to meet with his European counterpart Maros Sefcovic, likely in Europe, before European Commission president Ursula von der Leyen travels to Australia at the end of February or start of March.\n\nThe president's visit could be viewed as a good omen after she travelled to India to sign a free trade agreement in mid-January, sealing a long-awaited deal between Europe and the world's most populous state.\n\nUrsula von der Leyen is set to visit Australia in coming weeks. (Lukas Coch/AAP PHOTOS)\n\nSenator Farrell was scheduled to meet with Mr Sefcovic last Friday before the meeting was postponed.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nThe final hurdles include quotas for the amount of beef and sheep Australian exporters can ship into Europe, with Canberra pushing for more than what's been offered.\n\nHowever, the conditions under which the meat can be exported have also proved contentious, with concerns Australian producers can't meet the stringent requirements, which would render any increased quota moot.\n\nEuropean conditions span deforestation regulations for farms, hormone-free growth and transport requirements.\n\nFor example, Canada used only a tiny fraction of its allocated 65,000 tonnes of tariff-free beef in recent years due to local farming and packaging practices, such as the use of hormones and how meat is sanitised, failing to meet European standards.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\n\"As we have said consistently, a deal with the EU must include new, commercially meaningful access for Australian agriculture, including beef and sheep meat,\" a spokesperson for Senator Farrell told AAP.\n\nMr Farrell insists a deal must include access for Australian agriculture, including beef. (Lukas Coch/AAP PHOTOS)\n\nEuropean farmers are also wary of the compounding impact of free trade agreements being signed with South American nations as part of the Mercosur agreement, and now with India as Brussels searches for a resolution with Australia.\n\nAustralian producers are pushing for higher quotas for beef and sheep while European farmers want them stripped back.\n\nDetails of the offered quotas haven't been made public.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nGeographic indicators - when Australian producers use names of foods that come from specific regions, such as prosecco and feta - have also been a sticking point as Europe aims to protect the naming rights of products.\n\nIf beef and sheep quotas are sorted, the final negotiations over naming rights would then need to be finalised, but negotiators are confident of compromises here to get the agreement over the line.\n\nThe use of geographic indicators like 'Feta' have been a sticking point. (David Mariuz/AAP PHOTOS)\n\nIt's believed Australia would agree to a grandfathering clause, so producers already using the names could continue to do so.\n\nThis is in line with similar provisions in other trade pacts Europe has signed with Canada and New Zealand.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nCanadian producers need to add qualifiers to certain products, such as \"Feta-like\" when selling the cheese, as some names were grandfathered.\n\nNew Zealand agreed to a phase-out of terms like Feta and Prosecco but there is a grandfathered exemption for Parmesan and Gruyere for some producers.",
        "source": "Yahoo"
    }
]