[
  {
    "url": "https://www.9news.com.au/national/mosaic-brands-former-retailer-told-to-pay-25m-in-fines-for-breaching-consumer-laws/2d2d947a-9ef8-4631-90aa-4c7ca913ec7e",
    "title": "Recently-liquidated major retailer fined $25m for breaching consumer laws",
    "publish_date": "Fri, 29 Aug 2025 00:44:40 +0000",
    "category": "finance",
    "authors": [
      "Aug"
    ],
    "text": "Recently-liquidated fashion retailer Mosaic Brands has been ordered to pay $25 million in fines by the Federal Court for breaching multiple consumer laws.\n\nMosaic Brands owned ﻿several well-known Australian brands, including Noni B, Rivers , Katies, Rockmans, Millers, Autograph, Beme, Crossroads and W Lane.\n\nThe Federal Court found all nine brands failed to deliver over 739,114 items to customers within the delivery times listed on its website, or within a reasonable amount of time afterwards.\n\nREAD MORE: Police descend on home in Porepunkah amid search for alleged cop killer\n\nMosaic Brands, owned ﻿several well-known Australian brands, including Noni B, Rivers, Katies, Rockmans, Millers, Autograph, Beme, Crossroads and W Lane. (Supplied)\n\nMore than 4300 items were never delivered at all.\n\n﻿The Australian Competition and Consumer Commission said the retailer was \"found to have wrongfully accepted payment from consumers and engaged in misleading or deceptive conduct.\"\n\nACCC Deputy Chair Catriona Lowe said the delays were \"unacceptable\" with a quarter of total goods ordered from the brand affected.\n\n\"Our investigation revealed that more than half of the items in question were dispatched from Mosaic Brands' warehouses 30 or more days after the order date, and about one-third were dispatched 40 or more days after the order date,\" she said.\n\n\"One person who reported to us experienced the dual disappointment of never receiving the goods they'd paid for and then having to wait six months for a refund.\"\n\nMore than 4300 items were never delivered at all. (Nine)\n\nThe court found the delays took place over a six-month period.\n\nMosaic Brands was also found to have breached another consumer law with its returns policy.\n\nIn a 13-month period between 2021 and 2022, eight of the brand's websites said that consumers were only eligible ﻿for a refund of a faulty item if it had been returned within six months of the purchase date.\n\nThe ACCC says that under consumer laws, refunds for faulty items do not have a set limit, it applies for a \"reasonable time\", which is dependent on the price and quality of the item.\n\nREAD MORE: The twisted messages posted by church mass shooter\n\nMosaic Brands was also found to have breached another consumer law with its returns policy. (Nine)\n\nThe brand was fined $25.05 million.\n\nMosaic Brands went into ﻿voluntary administration in October 2024 before entering complete liquidation in July 2025.\n\nIn May 2021 and September 2022, Mosaic Brands had already acquired $896,000 in infringement notices, including for misrepresentations on its websites about refunds for faulty goods .\n\nAt the brand's peak, they had ﻿800 retail stores across Australia and 7.8 million online customers.",
    "source": "9News",
    "cluster_id": 0
  },
  {
    "url": "https://www.9news.com.au/national/superannuation-funds-collapse-first-guardian-master-shield-nurse-lisa-rogers-lost-60000-exclusive/c312d287-7622-4ed8-af18-9a32901cafef",
    "title": "Lisa wanted to retire soon. After losing $60k, that won't happen",
    "publish_date": "Fri, 29 Aug 2025 00:51:02 +0000",
    "category": "finance",
    "authors": [
      "Aug"
    ],
    "text": "Exclusive: A nurse aged in her 60s who wanted to retire soon is one of thousands missing money after two Australian superannuation funds collapsed.\n\nVictoria nurse Lisa Rogers, 63, transferred half of her retirement fund across to First Guardian Master Fund and Shield Master Fund in 2023, hoping she could maximise her superannuation.\n\nIt turned out to be a costly decision.\n\nLisa Rogers is a nurse from regional Victoria and wanted to retire within the next two years. (Supplied)\n\nAlong with 12,000 other Australians who have lost a combined $1.2 billion, Rogers' nest egg has been frozen and drained with no answers.\n\nRogers told 9news.com.au she feels like her future has been stolen.\n\n\"I've been nursing for over 30 years and it's hard, It's really hard,\" Rogers said.\n\n\"And you don't get many nurses that can keep going past the retirement age.\n\n\"I didn't have much superannuation and was trying to increase my returns on my superannuation before retiring.\"\n\nRogers had $42,000 invested in Shield Master Fund and nearly $20,000 in First Guardian, with the rest in a separate fund which is still accessible.\n\nDo you have a story? Contact reporter April Glover at april.glover@nine.com.au\n\nHer Shield investment is frozen and the First Guardian balance is now zero due to the ASIC investigation into both collapsed funds.\n\nRogers' plan was to retire within the next two years.\n\nShe is now looking at working for another six years to recoup even some of her losses.\n\n\"I don't know how I'm going to fund my retirement because I'm already 63,\" she said.\n\n\"I'm going to be a lot worse off and it's scary.\"\n\nRogers said she also supports her adult son with a disability and her missing super will impact his life too.\n\n\"There are people who have lost hundreds of thousands of dollars, which is awful,\" she said.\n\n\"But it's my money, it's still my money.\"\n\nRogers transferred half her super into both funds in 2023. (Supplied)\n\nUntangling the collapse of two super funds﻿\n\nRogers said she was convinced to move her superannuation across by a financial planner associated with Financial Services Group Australia (FSGA).\n\nASIC permanently cancelled the Australian Financial Services (AFS) license of FSGA on June 7 this year.\n\nASIC said representatives of FSGA provided \"personal financial product advice\" to people who invested in First Guardian.\n\nFerras Merhi was the sole director of FSGA from 10 February 2021 to 30 May 2025.\n\nASIC is investigating Merhi and various entities associated with him, in connection with its investigations concerning Shield and First Guardian. Nine.com.au is not suggesting any wrongdoing by Mehri, only that investigations are ongoing.\n\nKeystone Asset Management Ltd is the responsible entity of Shield Master Fund and is now also in liquidation.\n\nASIC also began investigating First Guardian's responsible entity Falcon Capital, First Guardian and director David Anderson in late 2024.\n\nAround 12,000 people have lost a combined $1.2 billion in super. (iStock)\n\nThe Federal Court made interim travel restraint orders against Falcon Capital Limited directors David Anderson and Simon Selimaj on July 2. No findings of wrongdoing have been made in relation to the directors.\n\nIn a statement, ASIC said it has had more than 40 court appearances on matters related to First Guardian and Shield.\n\nASIC has also told investors that they cannot withdraw or transfer their investments as \"all redemptions are frozen due to the liquidation so that the overall financial position of the fund and recoverability of the fund's investments can be assessed by the liquidators\".\n\n\"Whether any money is returned depends on available assets, court outcomes and the results of liquidation and recovery proceedings,\" ASIC said.\n\nRogers calculated she will need to keep working for at least six more years. (Supplied)\n\nVictims could wait years for their money\n\nRogers has lodged a complaint with the Australian Financial Complaints Authority (AFCA).\n\nShe and other complainants have been told it could take years for anything to be resolved.\n\nHowever the liquidators of Shield Master told victims they may eventually receive 22c to 50c from every dollar invested.\n\n\"I am a little bit hopeful, but cautiously, I guess,\" Rogers added.\n\nShe and thousands of other financial victims want answers and change, including stricter regulation of the superannuation industry.\n\n\"The layperson like myself thought that this is the safest way of accumulating some money for retirement,\" Rogers explained.\n\n\"You're under the impression that it's heavily regulated by the government and that this sort of thing cannot occur.\"\n\nRoger said she may have to lean heavily on the pension to fund her retirement if she doesn't claw back her missing $60,000.\n\nShe also suspects thousands more victims will need the pension now too.\n\n\"Then that increases the burden on the government,\" Rogers said. \"You'd think they would want to do something to eliminate that.\"\n\nA spokeswoman for Assistant Treasurer Daniel Mulino told 9news.com.au the federal government was concerned for investors.\n\n\"The government is committed to ensuring that investor interests are safeguarded and the regulatory framework governing the investment landscape is fit for purpose,\" the spokeswoman said.\n\n\"ASIC has taken steps to commence enforcement and protect investors, including freezing assets and cancelling financial licences where appropriate.\n\n\"As these matters are before the Federal Court and part of ongoing investigations by ASIC and the liquidators, it would be inappropriate to provide further comments or speculation.\"",
    "source": "9News",
    "cluster_id": 1
  },
  {
    "url": "https://www.9news.com.au/national/mcdonalds-businesses-want-to-hire-australians-with-maccas-experience/c174958e-2e35-4f29-83cd-9e992837ee00",
    "title": "Does starting your working life at Macca's really make Australians more employable?",
    "publish_date": "Thu, 28 Aug 2025 03:11:59 +0000",
    "category": "finance",
    "authors": [
      "Aug"
    ],
    "text": "What do Prime Minister Anthony Albanese, ﻿ Today Extra 's Sylvia Jeffreys, and Paralympic gold medallist Tristan Knowles have in common?\n\nThey all started their careers at Macca's, as have 1.6 million other Australians.\n\nThat's about one in every 12 Aussies and according to recruiters, many businesses specifically want to hire Aussies with experience at Macca's.\n\nLIVE UPDATES: Hunt for accused cop killer enters third day\n\nWhat do these people have in common? They've all worked at McDonald's. (Instagram/Nikki Short/Max Mason-Hubers)\n\nNew research commissioned by the restaurant chain itself claims almost 90 per cent of recruiters agree working under the golden arches sets Aussie up for success.\n\nAnother 80 per cent said skills workers learn on the job﻿ – like teamwork, communication, and customer service – are transferable to any workplace.\n\nWe asked recruiters not associated with the Macca's survey if they agreed that experience in the service industry is a key indicator.\n\nChief executive Asia Pacific of Hays, Matthew Dickason, told 9news that data and direct experience from Hays staff supports Macca's claims.\n\n\"Our head of delivery's daughter has worked at McDonald's for four years, and the resilience she's developed dealing with the public has been remarkable,\" he told 9news.\n\n\"When you can handle a frustrated adult berating you over a broken ice cream machine at 15 years old, you develop exceptional emotional intelligence and professional composure that translates directly to client-facing roles and navigating modern work environments.\"\n\nThe 10 most in-demand jobs for 2025 View Gallery\n\nThe Hays Skills Report shows that 50 per cent of Australian employers now plan to hire people with entirely new skill sets and 92 per cent are focused on upskilling staff.\n\nThat shift, in response to ongoing skills shortages, means ﻿transferrable skills picked up on the job at Macca's may be more attractive than ever.\n\n\"The key insight for employers is not to dismiss any service industry experience,\" Dickason said.\n\nSenior director at Robert Walters Melbourne Rose Guise agreed that employers in almost every sector want to hire candidates who can handle pressure, meet deadlines, and work effectively in a team.\n\n\"And those are exactly the qualities that McDonald's employees develop,\" she told 9news.\n\nWhile recruiters at Robert Walters \"don't specifically seek out candidates\" with Macca's experience, Guise confirmed it's looked upon favourably even when compared to other fast food jobs.\n\n\"McDonald's has one of the strongest reputations due to its global consistency and structured training model,\" Guise said.\n\n\"Other places like KFC, Domino's, or Subway still reflect well, but they don't always carry the same instant credibility.\"\n\nExperience at Macca's may even be looked at more favourably than other fast food chains. (Supplied)\n\nAssociate director at Robert Half, Emma Sestic, said how useful having Macca's experience on your CV is will also depend on the role and industry you're applying for.\n\nIt can be great for ﻿entry-level roles in business support and customer service but not all employers view it as directly relevant.\n\n\"In more technical or specialised fields like finance or IT, employers mostly prioritise industry-specific experience over general soft skills,\" she told 9news .\n\n\"Still, it can show strong work ethic and adaptability.﻿\"\n\nSo while there are some caveats, it looks like working at McDonald's ﻿really can set Australians up for great careers.\n\nThat may ﻿come as no surprise to the millions of Aussies who have worked at Macca's.﻿\n\nMore than nine in 10 alumni surveyed by McDonald's ﻿believe working there sets people up for success.\n\nEight in 10 parents also ﻿believe it's a great place to have your first job.\n\nBrad McMullen started working at a Macca's restaurant on the NSW central coast when he was just 15 and is still with the company years later, now as McDonald's Australia chief restaurant officer.\n\n\"The training I got from that first time in the restaurant, all those sorts of fundamental skills, they set you up for business,\" he told 9news.\n\nBrad McMullen started at Macca's at 15 and is now McDonald's Australia Chief Restaurant Officer. (Supplied)\n\nMcMullen even attended Hamburger University, which he confirmed is a real thing.\n\nAvailable in eight countries around the world, Hamburger University is where prospective McDonald's restaurant managers receive their training.﻿\n\nIt's just one of the employee training avenues McDonald's spends more than $60 million ﻿on every year.\n\n\"We take our responsibility as one of the biggest employers of young people in Australia really seriously, and we're really proud of that,\" McMullen said.\n\nMore than 100,000 Aussies currently work at McDonalds, from teenagers starting their first job to former corporate workers in their 60s who want something different before they retire.\n\nToday McDonalds has launched a new campaign titled '1 in 12' celebrating the 1.6 million Aussies who have worked under the golden arches since it opened Down Under in 1971.",
    "source": "9News",
    "cluster_id": 2
  },
  {
    "url": "https://www.9news.com.au/technology/kirby-and-the-forgotten-lands-expansion-star-crossed-world-review/6778d8f4-16cc-4b60-a4bb-f7c15ab8f855",
    "title": "This game was already 'incredible'. It just got another reason to play",
    "publish_date": "Thu, 28 Aug 2025 06:03:32 +0000",
    "category": "finance",
    "authors": [
      "Aug"
    ],
    "text": "Kirby and the Forgotten Land was already an incredible game.\n\nIt is a charming and gorgeous showcase of level design, complementing unique and varied power ups.\n\nIt didn't need an expansion, but the fact it's getting one in the form of a Nintendo Switch 2 Edition is all the more reason to dive back in or give this wonderful 3D platformer a go for the very first time.\n\nREAD MORE: New Call of Duty game revealed ﻿\n\nKirby and the Forgotten Land. (Nine)\n\nStar Crossed World\n\nKirby and the Forgotten Land 's expansion is called Star Crossed World .\n\nAfter besting the base game's first boss, an ominous meteor crashes into the ocean. Its arrival triggers dramatic transformations of 12 of the game's levels, which you must conquer to quell the threat.\n\nThere are two of these \"Starry Stages\" to find in each of the six worlds. If you're starting from scratch, they'll unlock incrementally. But if you're booting up a completed save file like I did, all 12 are available from the get go.\n\nCalling these stages a \"remix\" of their existing counterparts would be underselling it.\n\nParting the seas like Moses to explore the ocean floor. (Nine)\n\nParting the seas like Moses to explore the ocean floor is hardly comparable to a level that once limited you to paddling on the surface.\n\nThese are all new levels with all new power ups and tougher enemies to fight.\n\nSpring, Roll and Slide!\n\nTransformations are what makes Kirby, Kirby!\n\n\"Mouthful mode\" set the stage for so many unique challenges in Forgotten Land , as Kirby inhaled and transfigured himself into cars, gliders, unstoppable rollers and a cone that could shatter rock with its point.\n\nMany of these return in the Starry Stages with three new additions:\n\n\"Mouthful mode\" set the stage for so many unique challenges in Forgotten Land. (Supplied)\n\nSpring mouth\n\nGear mouth\n\nSign mouth\n\nDespite its ridiculous name, sign mouth was by far my favourite.\n\nBy inhaling a foldable sign, Kirby would transform himself into a sled to slide down hills at speed, barreling through enemies and unlocking faster routes with precise jumps.\n\nInhaling a gear would allow Kirby to roll up walls at a decidedly slower pace. Leaping from surface to surface can be a little tricky, and you'll need it to find some devilishly hidden collectibles tucked around corners.\n\nTransforming into a spring has never been a mechanic I liked. I didn't like the power up in the Super Mario Galaxy games and the snake transformation was my least favourite of the bunch in Donkey Kong Bananza . To Kirby's credit, his spring is better than either of those. He still moves fast enough while on the ground and jumping is incredibly responsive.\n\nTaken together, these three new power ups combine to create some of the best levels in all of Forgotten Land .\n\nShort and Sweet\n\nIf you're not a completionist (and you're booting up an old save file to access all of the new stages immediately), you can easily power through Star Crossed World in a day.\n\nCollecting every starry and completing every challenge is decidedly tougher.\n\nCollecting every starry and completing every challenge is tough. (Supplied)\n\nIt took me roughly 10 hours to 100 per cent the Starry Stages and collect all of the 85 new figures.\n\nIf you're particularly sadistic, there's also a new and brutal new boss rush waiting for you at the colosseum. Besting the original colosseum challenge without dying was tough enough. This new challenge feels like something out of a Dark Souls game.\n\nAfter two measly attempts, I could only get through four or the 12 rounds!\n\nIs it worth it?\n\nNintendo is selling Kirby and the Forgotten Land + Star Crossed World for $109.95.\n\nYou can find it cheaper in store and if you already own the original, the upgrade pack is $30.\n\n12 stages for $30 is about right when the base game had 32.\n\nIf you're a Kirby fan or a parent with kids, this one's a no brainer.\n\nAnd if you're looking for something to play on your Switch 2 before Hollow Knight: Silksong comes out next week, this Switch 2 Edition is arguably the best yet.",
    "source": "9News",
    "cluster_id": 3
  },
  {
    "url": "https://www.9news.com.au/national/uber-rolls-out-rideshare-for-teens-across-australia/86c26d53-bb36-48c0-b5ca-e2bb1a82a54c",
    "title": "Uber rolls out rideshare for teens across Australia",
    "publish_date": "Thu, 28 Aug 2025 00:17:02 +0000",
    "category": "finance",
    "authors": [
      "Aug"
    ],
    "text": "Uber is shifting its rideshare service for teens into top gear from tomorrow, expanding nationwide, but the move has sparked concern from child safety advocates.\n\nUber for Teens allows children aged 13 and over to catch Ubers with drivers who have a Working With Children Check.\n\nOnly highly rated, experienced driver partners are eligible to receive trip requests from teens and parents are able to track their children's journeys.\n\nParents will be able to track their children on their journey. (9News)\n\nThe service is being launched in NSW, Victoria and Western Australia tomorrow.\n\nChildren were previously only allowed to travel in Ubers when accompanied by an adult.\n\nHowever, Uber for Teens has already been operating in Queensland, South Australia, Tasmania and the ACT since April last year, with Uber reporting no safety incidents have occurred in those states.\n\nExtra safety features implemented by Uber for its teen service include a three-way intercom feature for teen accounts, live trip tracking, and four-digit PIN verification.\n\nIn NSW, ACT, SA and TAS, teens are able to register for audio recording which will be automatically enabled for the entire teen trip.\n\nThe service will cost an extra $2 per trip, with the additional fee going towards the driver's cost of obtaining a Working With Children Check.\n\nUber for teens drivers in Queensland are not required to get the Working With Children Check as it is not legislated under state law.\n\nUber Australia & New Zealand Managing Director Emma Foley said: \"We know that modern family life is a constant balancing act, from early morning school runs to after-school activities and everything in between.\n\n\"That's why we are excited to be expanding Uber for teens to New South Wales, Victoria, the Northern Territory, and Western Australia, giving more families access to a safe and reliable way to help lighten the load.\"\n\nBut some parents and child safety advocates warn the measures are not enough to safeguard children.\n\nChild safety advocate Hetty Johnston told The Sydney Morning Herald she did not believe Uber's safeguards were enough to protect young people.\n\nWhile the driver having a Working With Children Check (WWCC) was better than nothing, the current system was \"a bit like having an ashtray on a motorbike\", Johnston said.\n\nShortcomings of the WWCC had been highlighted by the Melbourne childcare crisis, she said.\n\n\"I think you're throwing caution to the wind there, and you're just hoping that everything will be all right whenever you send your young people off into an Uber,\" she said.",
    "source": "9News",
    "cluster_id": 4
  },
  {
    "url": "https://www.abc.net.au/news/2025-08-29/venus-williams-wins-first-us-open-women-s-doubles-match-2014/105711646",
    "title": "Venus Williams wins first US Open women's doubles match since 2014",
    "publish_date": "Fri, 29 Aug 2025 01:51:19 +0000",
    "category": "sports",
    "authors": [],
    "text": "Venus Williams insists she is not a good doubles player. The 14 major championships she and Serena won together tell a different story.\n\nWithout her younger sister by her side, Williams showed she has still got it. Williams won a women's doubles match at the US Open for the first time in more than a decade, teaming with Leylah Fernandez to defeat the sixth-seeded pair of Lyudmyla Kichenok and Ellen Perez 7-6 (7/4), 6-3.\n\nWhen it was over, the 45-year-old Williams did her signature twirl-and-wave and called Fernandez \"the best partner I ever played with — outside of Serena\".\n\nThe 22-year-old Canadian even reminded Venus of Serena.\n\n\"Our energy really matched each other in terms of determination, in terms of not giving up, in terms of really still just focused and dialled in in every single thing,\" Williams said.\n\n\"That felt amazing because I never really played with a partner — outside of Serena, obviously — who had that kind of mentality, so it was really fun.\"\n\nWilliams and Fernandez, the 2021 singles runner-up at Flushing Meadows, were heavy fan favourites at a nearly full Louis Armstrong Stadium, and the chair umpire had to ask the crowd multiple times to quiet down.\n\nThe spectators gave Williams and Fernandez a standing ovation after they claimed the opening tie breaker despite trailing 5-2 in that set — and rose again to cheer after the match ended in 90 minutes.\n\n\"Leylah is a good player, (and) Venus is also a good doubles player,\" Kichenok said.\n\n\" They have played doubles many times. They know what it is. Maybe it took a bit of time to adjust at the beginning, but then they found their rhythm. \"\n\nThroughout the match, there were chants of \"Here we go, Venus, here we go!\" and a sign in the stands read, \"Welcome to the Williams show.\"\n\n\"Wow,\" Williams said in her on-court interview. \"Thank you, you guys. Thank you for showing up for us.\"\n\nWilliams had not won a women's doubles match in New York since 2014, when she and Serena made it to the quarterfinals, or at any Grand Slam tournament since the 2018 French Open.\n\n\"It's an area that I'm not that comfortable in, being on a doubles court, but I think you get to some point in the match where you stop thinking about it,\" Williams said.\n\n\" When push comes to shove, I'll do what I have to, but I'm a singles player, so, of course, when I walk out there, I actually tell myself just to play singles and try that method. I try not to be something that I'm not. \"\n\nDo you have a story idea about women in sport? Email us abcsport5050@your.abc.net.au\n\nThe older Williams won seven Grand Slam titles in singles and another two in mixed doubles. She had been off the tour for 16 months until returning to action by playing singles and doubles at Washington in July.\n\n\" With the amount of matches I've played, I'm progressing very quickly,\" Williams said. \"I didn't have to come back to play tennis, but eventually I found my way back. \"\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\nAt Flushing Meadows, Williams lost in the first round of mixed doubles and singles, then was awarded a wild card for women's doubles. Fernandez described feeling \"like a kid on Christmas Day\" and jumping around with a smile on her face after getting the call that Williams wanted to play doubles with her.\n\nShe was shocked to hear the comparison to Serena.\n\n\" It's probably the biggest compliment I've ever gotten,\" Fernandez said. \"I feel like those are big shoes to fill. \"\n\nBack in doubles at the US Open for the first time since 2022, Williams gets to keep going in New York after pushing 11th-seeded Karolina Muchova to three sets before bowing out of singles play Monday night.\n\nUlrikke Eikeri and Eri Hozumi are up next in the second round of doubles.\n\n\" I actually feel great,\" Williams said. \"With some luck, we'll stay, maybe win another round and just keep getting better. \"\n\nAP",
    "source": "ABC",
    "cluster_id": 5
  },
  {
    "url": "https://www.abc.net.au/news/2025-08-29/city-of-bunbury-plans-cbd-revamp-increase-tourism/105708176",
    "title": "City's 'bold' new plan for rough sleepers after Wiggles blunder",
    "publish_date": "Fri, 29 Aug 2025 00:01:08 +0000",
    "category": "finance",
    "authors": [],
    "text": "WA's biggest regional city has unveiled a \"bold\" plan to transform its city centre and relocate a local music shell used by rough sleepers as an unofficial homeless shelter.\n\nThe City of Bunbury's masterplan focuses on the area around the Graham Bricknell Music shell — a venue that gained notoriety after the council's \"brazen\" approach of playing the Wiggles on repeat to deter antisocial behaviour.\n\nThe plan, which the city expects to cost \"hundreds of millions of dollars\" would also result in the bus station being moved, the city's heritage buildings revived and the surrounding area — known as Bicentennial Square — made into a \"go-to\" destination for tourists.\n\nThe proposed transformation has been met with mixed reactions.\n\nThe City of Bunbury says the plan is expected to cost hundreds of millions of dollars. (Supplied: City of Bunbury)\n\nAndy Mcwhirter, who lives in Australind, north of Bunbury, said it was \"about time\" more was done to attract visitors.\n\n\"Anything that [the city] can do for tourists is good,\" he said.\n\n\" When I was a kid everyone used to come to Bunbury for holiday, now they don't. They bypass Bunbury. \"\n\nAndy Mcwhirter says anything that can be done to bring tourists to Bunbury is a good thing. (ABC South West WA: Jacqueline Lynch)\n\nThe Bunbury Outer Ring Road was opened last year to take traffic around the city.\n\nCalls have recently ramped up to make Bunbury CBD \"cool again\" after many retailers shut up shop.\n\nThe council has described the redevelopment as a \"bold\" plan, which Mayor Jaysen Miguel said would shape the next generation of Bunbury's history.\n\n\"[This is] the direct link between that waterfront and our city,\" he said.\n\n\"How can we make it more accessible to bring people and potentially beautify it in some ways?\"\n\nHe said the project would take some time and would need millions of dollars of government and private investment.\n\n'Where are they going to go?'\n\nRough sleepers have slept at the sound shell for years — even setting up what CBD worker Kylie Collins said was a \"camp\".\n\nMs Collins said while the plan to revitalise parts of Bunbury sounded \"great\", she worried for the homeless people sleeping at the shell.\n\n\"Where are they going to go?\" she said.\n\n\" We want our town to be thriving and successful and we want shops full and businesses full, but lives need to matter more. \"\n\nKylie Collins wants more to done to help the homeless people living at the shell. (ABC South West WA: Jacqueline Lynch)\n\n\"I have friends that are camped down there and they're really struggling … maybe we can look at building something for them?\n\n\" I think that should really be the priority rather than nice, big, green lawns. \"\n\nApril Hill, who has been sleeping in the area with up to a dozen others, said the planned changes had come as a shock.\n\n\"It actually feels home to those who actually stay here,\" she said.\n\n\"A big change is going to make it all awkward, certain people are going to feel out of place, \" she said.\n\n\"[And] You're taking away people's old memories, you're destroying what they had here.\"\n\nThe Graham Bricknell Music Shell will be moved. (ABC South West ABC: Jacqueline Lynch)\n\nCr Miguel said he understood the significance of the music shell as the grandson of former deputy mayor Graham Bricknell — who the venue was named after.\n\nMr Miguel said he was committed to relocating it.\n\n\"It's sort of strapped for room right now when we have big events,\" he said.\n\n\"It's obviously very much important to maintain it, absolutely, and maintain it in my grandfather's memory, but what's the best use out of it going forward as well?\n\n\"And how can we fully utilise that and the area?\"\n\nThe bus station will be moved to another location in the city centre. (ABC South West WA: Jacqueline Lynch)\n\nHe said he would work with rough sleepers and agencies on a way forward for the people living there.\n\nInvestment into helping homeless\n\nThe state government has since promised to expand homelessness services in the regional city.\n\nA day after the city's plan was released, a further $3 million was promised to expand Anglicare's Housing First Service in Bunbury, which links homeless people with health, financial, social and employment services.\n\nWA Homeless Minister Matthew Swinbourn said the services would be crucial in helping people into homes.\n\n\"We know that these types of services transform lives and provide serious, long-term solutions for people who are experiencing homelessness,\" he said.\n\nThe Bicentennial Square plan is open for public comment.",
    "source": "ABC",
    "cluster_id": 6
  },
  {
    "url": "https://www.abc.net.au/news/2025-08-29/bruce-highway-closed-after-fuel-tanker-fire-fraser-coast/105711110",
    "title": "Driver escapes after fuel tanker catches fire on Bruce Highway",
    "publish_date": "Thu, 28 Aug 2025 23:51:12 +0000",
    "category": "finance",
    "authors": [],
    "text": "The Bruce Highway is expected to remain closed for a number of hours after a B-double fuel tanker rolled and caught fire south of Maryborough this morning.\n\nThe tanker was carrying 20,000 litres of unleaded fuel in the first tank, and 28,000 litres of diesel in the second, both of which caught fire in the crash, which happened about 2am.\n\nActing Inspector Kyle Dellit from the Queensland Fire Department said it took about two-and-a-half hours to contain the blaze.\n\nEmergency services were called to the scene about 2am. (Supplied: Queensland Fire Department)\n\nThe driver, a man in his 30s, escaped before emergency services arrived. He was taken to Hervey Bay Hospital with minor injuries.\n\n\"The vehicle remains in situ until we get a support from Brisbane to come up and extract the remaining fuel, and safely remove it,\" Inspector Dellit said.\n\n\" The highway will still be closed for recovering clean-up efforts for some considerable time. \"\n\nInspector Dellit said the rear tanker was 50 metres down the road from the rest of the vehicle.\n\n\"If it's separated when it rolled or whether it came off, it's unknown as to what's caused the accident,\" he said.\n\nThe highway is expected to remain closed for several hours. (Supplied: Queensland Fire Department)\n\nEight fire crews attended, and an evacuation order was in place but has now been revoked.\n\nA traffic diversion is in place.\n\n'Flames leaping all over it'\n\nRay Juillerat was driving north past the incident about 3am.\n\nMotorists have been told to expect major delays on the Bruce Highway. (ABC Wide Bay: James Taylor)\n\n\"It was just a truck in the middle of the road and flames leaping all over it, the flames were quite high,\" Mr Juillerat said.\n\n\" The road is going to be an absolute mess. I think there's going to be melted metal all over the road. \"\n\nMatt Gees was travelling north through the diversion down Old Gympie Road.\n\n\"Because it's an older road and it's quite a narrow road, it's pretty much one direction, there is still quite a delay,\" Mr Gees said.",
    "source": "ABC",
    "cluster_id": 7
  },
  {
    "url": "https://www.abc.net.au/news/2025-08-29/nicho-hynes-supports-mental-health-junior-rugby-league-players/105707596",
    "title": "Sharks star halfback embraces his off-field position as a role model",
    "publish_date": "Thu, 28 Aug 2025 23:13:47 +0000",
    "category": "sports",
    "authors": [],
    "text": "NRL star Nicho Hynes has returned to where it all began for him on the NSW Central Coast to be honoured with a mural at his junior club.\n\nThe Cronulla Sharks halfback described the mural on the Umina Bunnies' clubhouse as humbling.\n\n\"I'm very grateful to be here and see my face on the wall and a young photo of me as well,\" Hynes said.\n\n\"[It] brings back a lot of memories and a fair bit of emotion.\n\n\"I was a little kid, like some of the kids here running around right now, kicking the footy, and wanting to be in the stage I'm in.\"\n\nThe mural also features an image of Nicho Hynes as a boy. (Supplied: Cronulla Sharks)\n\nThe admiration from junior fans and adults was plain to see at the unveiling as Hynes took selfies and signed autographs.\n\nHynes made his first-grade debut for the Melbourne Storm in 2019 before joining Cronulla in 2022 and winning the Dally M as the NRL's player of the season the same year.\n\nHe has represented NSW in State of Origin and played for Australia.\n\nBut despite being one of the biggest names in rugby league, he said he was not burdened by the expectations that came with being a role model.\n\n\"I know what sort of human I am, and I know how I want to live day to day … and I think that's a pretty good person,\" he said.\n\nSupporting youth mental health\n\nHynes also used his visit to take part in a mental health workshop with teenage players from the Umina Bunnies.\n\n\"I know a lot of people go through struggles and tough times, but you can come out of it,\" he said.\n\n\" I feel like I'm someone who has walked through some tough things in life and I've been able to come out the other side with hard work and dedication. \"\n\nNicho Hynes's star has risen since he played his first game for the Sharks in 2022. (ABC News: Jake Grant)\n\nHynes, who has been an ambassador with the Find Ya Feet program for five years, said it was changing young people's lives.\n\n\"All these kids get around each other, love each other, whether they've felt like they've been bullied before and there's people in the room that have bullied them, they get up and apologise,\" he said.\n\n\"It's a really incredible situation to be in.\"\n\nMarshall Michie took part in a mental health workshop with Nicho Hynes. (ABC Central Coast: Sarah Forster)\n\nBunnies player Marshall Michie, 17, said Hynes's rise from Umina to the best in the NRL was an inspiration.\n\n\"It's amazing to have Nicho as a role model,\" he said.\n\n\"It's great to see people get out and do their thing and chase their dreams … you saw Nicho succeed his dreams and it shows lots of the younger kids around here that they can do the same no matter what.\n\n\"There's lots of mental health issues in the area and having Nicho here … it's just great.\"\n\nMarshall said his mum and dad sat down with him as a teenager to talk about the challenges of mental health.\n\n\"I'm always checking up on the boys … [to] see if they're alright,\" he said.\n\nMarshall Michie says he checks in on his mates. (ABC Central Coast: Sarah Forster)\n\nTools to speak up\n\nFind Ya Feet founder Tommy Herschell developed his workshops to equip young people with the tools to speak up if they needed help and support a peer if they noticed something was wrong.\n\n\"I'm a school teacher by trade and I'm a big believer in getting young people talking from a young age about their mental health,\" Mr Herschell said.\n\nTommy Herschell works with young people to remove the stigma around speaking up about mental health. (ABC Central Coast: Sarah Forster)\n\nHe said the workshops gave people a platform to tell their story and listen to others.\n\n\"The beauty of having someone like Nicho [involved] is that they [the teenagers] want to pass like him and kick like him in the backyard but my goal is for them to want to talk like him, act like him and be open and vulnerable like him,\" Mr Herschell said.\n\nHe said he looked forward to a time when workshops like the ones he facilitated were not needed because prioritising good mental health had become the norm.",
    "source": "ABC",
    "cluster_id": 8
  },
  {
    "url": "https://www.abc.net.au/news/2025-08-29/taylor-swift-is-engaged-how-fans-will-relate-to-her-music/105709652",
    "title": "Taylor Swift is engaged — will it change how fans relate to her music?",
    "publish_date": "Thu, 28 Aug 2025 22:35:25 +0000",
    "category": "sports",
    "authors": [],
    "text": "Taylor Swift has built a billion-dollar empire off the back of relatable lyrics, taking her decades of experience with romance and heartbreak to craft love songs and break-up ballads.\n\nNow, she's getting married.\n\nSwift announced her engagement to NFL player Travis Kelce on Instagram this week, sharing photos of the proposal in a post that has garnered more than 33 million likes.\n\nThe pair began dating two years ago after Kelce revealed his desire to pursue the global superstar on his football podcast before trying to meet Swift backstage at the Eras Tour.\n\nHe was swiftly denied entry, but the risk was worth the reward.\n\nTaylor Swift said previously that Travis Kelce's courtship \"is sort of what I've been writing songs about wanting to happen to me since I was a teenager\". (Instagram: @taylorswift)\n\n\"It was such a wild, romantic gesture to just be like 'I want to date you,'\" Swift said during an interview on Kelce's podcast earlier this month, which has amassed more than 21 million views on YouTube.\n\n\"It kind of felt more like I was in an 80s John Hughes movie, and he was standing outside of my window with a boom box just being like, 'I want to date you. Do you want to go on a date with me? I made you a friendship bracelet!'\n\n\" It's like, if this guy isn't crazy — which is a big if — this is sort of what I've been writing songs about wanting to happen to me since I was a teenager. \"\n\nNow that Swift is entering her bridal era, is this the end of her vast swathes of relatable heartbreak songs that have sound-tracked the lives of her fans?\n\nBaby, just say 'yes'\n\nSwift's relationships have always played a significant role in her music, from her earliest album to her latest releases.\n\n\"She's taken her fans on her journey from being a young teenager with crushes and experiencing first heartbreaks, through to the more complex experiences of looking for, finding, and losing love in your twenties and thirties,\" says Georgia Carroll, a fan culture researcher.\n\nFan culture expert Georgia Carroll says themes of marriage aren't new to Taylor Swift's music. (Instagram: @taylorswift)\n\nBut Dr Carroll says while Swift's relationships have been a key theme of her music, they're far from being the only theme.\n\n\"When they are a part of the stories she tells, they are also the story of her maturity and growth through life on a broader scale.\n\n\"So while her break-up songs are definitely part of the reason fans relate to her, Taylor has built her career and image on being more than just relatable for her relationships and their endings.\"\n\nHow Taylor Swift's financial status collides with fans Photo shows Taylor Swift leans back and closes her eyes on stage in an orange dress as lights blur around her Taylor Swift is officially a billionaire, with Forbes confirming the megastar is the first artist to reach the wealthy status solely from songwriting and performing\n\nAnd as Dr Carroll adds, themes of love and marriage aren't new parts of her music.\n\n\"Love Story features an engagement, Paper Rings is all about wanting to get married, and fans have famously used Lover as the first dance song at their weddings from the moment of its release,\" she says.\n\n\"Even though this is the first time she's actually engaged, her music has always featured a belief in happily ever after and that she would one day find it.\"\n\nA new era\n\nAccording to Lauren Rosewarne, an associate professor at the University of Melbourne, Swift's relatable persona is impressive considering her net worth.\n\n\"Taylor Swift does vulnerability and confession well,\" Dr Rosewarne says.\n\n\"That she's perceived to divulge a lot about herself, her relationships and fears and anxieties endears her to fans, many of whom have grown up alongside her for nearly two decades.\n\n\"Taylor Swift has also managed to appear authentic and also accessible to her fans, which is an enormously difficult thing to accomplish when you're literally a billionaire superstar.\"\n\nTaylor Swift showed off her engagement ring as part of a series of posts on Instagram. (Instagram: @taylorswift)\n\nSo will Swift's engagement have any impact on how fans relate to her?\n\n\"Ultimately this is to be determined,\" Dr Rosewarne says.\n\n\"I imagine that there are many fans who actually just want her happy and thus will enjoy her future creative endeavours, regardless of what they entail.\n\n\"For others, there might be more of an investment in the drama, so marriage and stability might make her life and music seem less interesting.\"\n\nAs Dr Carroll notes, many Swifties are also likely to be engaged or married themselves.\n\n\"Rather than making her less relatable, it's going to unlock a new layer of relatability,\" she says.\n\n\"Many fans on social media have already been saying that seeing Taylor find true love in her mid-30s gives them hope as they find themselves similarly single and looking for their Mr Right — and I'm also in that camp!\n\n\"And just because we won't be getting a break-up album about this relationship, it doesn't mean she doesn't have other angst to draw on.\n\nTaylor Swift: Showgirl and 'marketing mastermind' Photo shows Taylor Swift poses in a body of water in a glittering silver corset Taylor Swift's new album might be called The Life of a Showgirl, but her ability to whip her fans into a frenzy ahead of the announcement has one expert calling her a \"marketing mastermind\".\n\n\"We have 11 albums — and potentially soon-to-be 12 — that touch on heartbreak, and they aren't going anywhere.\"\n\nSince Swift's upcoming album, The Life of a Showgirl, was produced before the proposal, the earliest hints of this new era in her songwriting would come via her 13th album.\n\n\"It's hard to know how much of the process she'll share with us through her music, but also how different it will potentially be from her previous examinations of love and the thought of forever,\" Dr Carroll says.\n\n\"Albums like Folklore and Evermore have shown she's not afraid to experiment with fictional narratives in her music, so we could also see a return to a less autobiographical style of music should she wish to keep this next stage of her relationship more private.\"",
    "source": "ABC",
    "cluster_id": 9
  },
  {
    "url": "https://www.abc.net.au/news/2025-08-29/sinner-too-strong-for-aussie-popyrin-at-us-open/105710734",
    "title": "Sinner mows down Aussie Popyrin and marches on at US Open",
    "publish_date": "Thu, 28 Aug 2025 22:32:52 +0000",
    "category": "sports",
    "authors": [],
    "text": "Defending US Open champion Jannik Sinner has effortlessly brushed aside Australian Alexei Popyrin 6-3, 6-2, 6-2 to make the third round of the Grand Slam and send out an ominous warning to his title rivals in New York.\n\nThe metronomic world number one, looking to become the first man to retain the trophy at Flushing Meadows since Roger Federer won the last of his five crowns in 2008, was expected to face a tricky test against a tenacious opponent on Thursday, local time.\n\n\"Obviously, I try to play the best tennis I can,\" said Sinner, who plays Canadian 27th seed Denis Shapovalov in the next round.\n\n\"The first round matches are always different compared to the further you go (in the tournament). I'm very happy that I managed these matches as good as I could, when you are up two sets and a break, you try to serve as best as you can.\n\n\"Today it felt like neither of us served well, but I was returning well, especially on the second serve. I'm happy about today. I'm aiming to improve on the serve but the rest (of my game), I'm quite comfortable with.\"\n\nBut Popyrin, who arrived at Arthur Ashe Stadium hoping to knock out the holder for a second successive year after toppling Novak Djokovic 12 months ago, landed in a world of trouble early on when Sinner forged a 4-1 lead with a reflexive return.\n\nSinner wrapped up the opening set on serve and then had the bandages on his right foot trimmed by a physio during the break, before the 24-year-old promptly resumed his mission to scythe down his 36th-ranked opponent in the second set.\n\nThe top seed forced an error from Popyrin's racquet for an early break, and although he faced some resistance while serving in the sixth game, comfortably took the second frame by trading his powerful hitting for a soft drop at the net on set point.\n\nPopyrin's win over Sinner in their only previous meeting at the 2021 Madrid Open began to look increasingly irrelevant when he fell behind in the third, before his opponent put him out of his misery with a thunderous ace.\n\nThe usually understated Sinner, who is aiming to go level on five Grand Slam trophies with his charismatic title rival Carlos Alcaraz, will now have a day to recover and said he had a number of Italian restaurants in mind to indulge his appetite.\n\nThere are more Australians due in action on day five, with Maya Joint facing American Amanda Anasimova on Louis Armstrong Stadium in the night session.\n\nOn Stadium 17, Daria Kasatkina will take on Kamilla Rakhimova, followed by Alex de Minaur playing Japan's Shintaro Mochizuki on the same court.\n\nReuters/ABC",
    "source": "ABC",
    "cluster_id": 10
  },
  {
    "url": "https://www.abc.net.au/news/2025-08-29/west-coast-eagles-adam-hunter-posthumously-diagnosed-with-cte/105686142",
    "title": "West Coast Eagles star posthumously diagnosed with CTE",
    "publish_date": "Thu, 28 Aug 2025 22:04:10 +0000",
    "category": "sports",
    "authors": [],
    "text": "West Coast Eagles premiership player Adam Hunter has been posthumously diagnosed with chronic traumatic encephalopathy (CTE) — a condition associated with repeated head trauma.\n\nHunter's mum and step-dad, Joanne and Rod Brown, said he had mentioned on several occasions he believed he had CTE.\n\nCurrently, the condition can only be diagnosed after death.\n\nSo when Hunter died in February, aged 43, his parents decided to donate his brain to the Australian Sports Brain Bank (ASBB) for research.\n\nMr Brown said Hunter had suffered countless head knocks and concussions over his life.\n\nWhile he was medically retired from the AFL due to a chronic shoulder injury in 2009, he continued playing football until the day he died.\n\nA 21-year-old Adam Hunter, bandaged and battered, after losing the 2002 elimination final. (Getty Images: Robert Cianflone)\n\n\"When you see your son run onto the football field and within five minutes he's on the stretcher being carried off shaking and convulsing, it's pretty upsetting,\" Mr Brown said.\n\n\" But that's the game. \"\n\nHe said they asked Hunter to consider hanging up his boots but \"it was always 'just one more year'\".\n\nMrs Brown said her son figured it was too late for him and he may as well keep playing.\n\nJoanne and Rod Brown hope Hunter's brain donation will help other players by advancing CTE research. (ABC South West WA: Bridget McArthur)\n\nThe ASBB, which examined Hunter's brain, said CTE risk was more closely linked to how long someone had played a contact sport, rather than the number of concussions they sustained.\n\n\"We just hope that something can come out of the [brain] donations ... [and] it can help young players in the future to find a cure before it kills them,\" Mrs Brown said.\n\nInquiries into the circumstances surrounding Hunter's death are ongoing, but preliminary coronial findings indicate he died from methylamphetamine-related heart failure.\n\nDo you have a story you want to share with the ABC? Contact Bridget McArthur at bridgetmcarthurtips@proton.me. If you're sharing sensitive information, read our tips on how to contact us confidentially.\n\nCTE symptoms and subtypes\n\nAn examination of Hunter's brain revealed several lesions consistent with stage II CTE, classed as low stage.\n\nASBB founder and associate professor Michael Buckland said symptoms included anxiety, depression, rage and poor impulse control.\n\n\"Many families tell us that their loved one sought some relief through drugs or alcohol,\" he said.\n\nThe examination also identified potential evidence of cortical-sparing CTE, classed as high stage.\n\nMichael Buckland founded the Australian Sports Brain Bank, which researches CTE in sportspeople. (ABC News: Jak Rowland)\n\nAccording to the ASBB, people with cortical-sparing CTE are less likely to experience dementia and severe cognitive difficulties but more likely to have early-onset behavioural and movement issues, compared to people with typical high-stage CTE.\n\nDr Buckland, a senior pathologist, said the subtype had only recently been discovered.\n\n\"We don't know a lot about it yet but it does appear to occur in about 10 per cent of cases,\" he said.\n\n\"It seems that in those cases people have more mental-health-type issues rather than the thinking and planning issues.\"\n\nDr Buckland said it was not yet clear why it only presented in a minority of people.\n\nHopes for living diagnosis\n\nIt is still relatively early days for CTE research.\n\nThe ASBB was the first medical institute to identify the disease in an AFL player's brain.\n\nIt has so far analysed about 100 sportspeople's brains, finding CTE in over 40 of them — professionals and amateurs.\n\nDr Buckland said brain donations were essential to better understanding the disease.\n\nHe said a global effort was underway to identify biomarkers of CTE and living diagnosis could be possible in the next decade or two, although a cure was likely some time away.\n\nBoth professionals and amateurs are at risk of developing CTE in high-contact sports. (ABC South West WA: Bridget McArthur)\n\n\"It's important for people not to give up,\" he said.\n\n\" There's no cure but the symptoms can be treated ... there's always cause for hope. \"\n\nIn the meantime, Dr Buckland said it was \"pleasing\" to see the AFL and other sporting bodies start to take concussion and head knocks more seriously.\n\nBut he said the risk could be further minimised by limiting full-contact training and leveraging new technologies like smart mouthguards to track players' exposure.\n\n'Dozens of rules' introduced\n\nAn AFL spokesperson said the league had changed \"dozens of rules\" to reduce the amount of \"avoidable forceful high contact\".\n\n\"Independent doctors … have more direct authority in relation to head injury assessments and being able to direct that a player be taken from the field for assessment,\" the spokesperson said.\n\nThe AFL has committed $25 million over 10 years to research the game's impact on brain health \"to inform policies at all levels of the game\".\n\nIt recently launched a new injury support fund for past players in collaboration with the AFL Players Association.\n\nThe association said it encouraged past players to commit their brains for research.\n\nThe West Coast Eagles deferred to the AFL's comments.\n\nThe Australian Sports Brain Bank is currently looking for Australians who have played high-impact contact sports to donate their brain for research. You can find out more here.",
    "source": "ABC",
    "cluster_id": 11
  },
  {
    "url": "https://www.abc.net.au/news/2025-08-29/federal-politics-live-aug-29/105710790",
    "title": "Live: Albanese tells Bob Katter to 'have a look at himself'",
    "publish_date": "Thu, 28 Aug 2025 21:52:48 +0000",
    "category": "finance",
    "authors": [
      "Romy Stephens",
      "Joshua Boscaini",
      "Jake Evans"
    ],
    "text": "Prime Minister Anthony Albanese has been heckled by the audience when answering a question about renewable energy at a bush summit in regional Victoria.\n\nThe PM attended the event in Ballarat, where he was asked during a Q & A why regional communities are paying the cost for renewable energy.\n\nThe question was met with applause from the audience.\n\n\"Quite clearly, governments haven't done well enough in their engagement and community consultation in those processes,\" the PM said.\n\nThe crowd started yelling during the PM's answer, which continued as he talked about climate change.\n\n\"We do need energy and the cheapest form of new energy is renewables,\" he said. \"The science told us that climate change was real … we are seeing what the science told us would happen, which is more extreme weather events and more intense.\"\n\nOne audience member shouted \"turbines aren't going to fix it Albo\".\n\nAt one point, Herald Sun editor Sam Weir, who was running the Q & A, said: \"ladies and gentleman, we'll have to stop if you keep interjecting.\"\n\nThe PM said he's up for debate but \"people need to be treated with respect\".\n\n\"That is what I am doing through my presence here and I'll continue to engage but I won't bullshit people,\" he said — a comment which was met with laughter and further eruption from the audience.",
    "source": "ABC",
    "cluster_id": 12
  },
  {
    "url": "https://www.abc.net.au/news/2025-08-29/asx-markets-business-live-news-august-29-2025/105710132",
    "title": "Live: Wall Street indices close at record highs, ASX could test new records too",
    "publish_date": "Thu, 28 Aug 2025 21:43:55 +0000",
    "category": "finance",
    "authors": [
      "Emilia Terzon",
      "Yiying Li",
      "Daniel Ziffer",
      "Michael Janda"
    ],
    "text": "In case you missed it, last night former ACCC regulator Rod Sims was speaking in Sydney.\n\nHe was talking about the bogeyman of Australian politics, a price on carbon. Down the bottom of this post there's a link to what the world is doing.\n\nHere's Sims:\n\n\"Why am I talking about a price on carbon? Do I not know that this and other potential governments will never implement a price on carbon? Let’s put our emission reduction efforts elsewhere where we can make progress.\n\n\"This is defeatist and damaging thinking.\n\n\"We all know a carbon price is first-best policy, but that statement gets us nowhere.\n\n\"The following arguments are why a carbon price is necessary and urgent.\n\n\"First, our current policies will not allow us to meet our climate targets and obligations unless further piecemeal, contentious and hideously costly steps are taken along these same paths.\n\n\"Second, current and likely future similar policies will damage our productivity.\n\n\"Third, policies without a carbon price provide no funds to compensate households for the cost of these policies.\n\n\"Fourth, current and likely future policies damage rather than contribute to necessary budget repair.\n\n\"How many times have we heard companies say they would like to make or use more green products, but they cannot, as they are more expensive?\n\n\"Well, of course, they are. Green and black products compete without any allowance for the damage done to the environment from the use of fossil fuels. If green products were already competitive with black products, there would be no need to encourage a transition; it would simply happen.\n\n\"Some criticise companies which make such statements, but they should not. The fault lies with government. If a government proclaims that the use of fossil fuels damages the environment but then does not recognise this in the way advocated by economists for over 100 years, via carbon pricing, you cannot blame companies for not taking action that would harm their economic interests.\"",
    "source": "ABC",
    "cluster_id": 13
  },
  {
    "url": "https://www.abc.net.au/news/2025-08-29/panthers-nrl-win-outside-top-four-bulldogs/105709808",
    "title": "The Bulldogs' blueprint that could help Penrith pull off a premiership miracle",
    "publish_date": "Thu, 28 Aug 2025 21:38:30 +0000",
    "category": "sports",
    "authors": [],
    "text": "With the Panthers resting nearly their entire top 17 for Thursday's clash with the Bulldogs, it was always going to bring forth a few new faces who came with a bit of a story behind them.\n\nOne of the five debutants was centre Sione Fonua, who was playing park footy for Brothers Penrith this time last year after several years away from the game.\n\nAnother was backrower Zac Lipowicz, who works as a sparky when he's not playing footy, only gets to train part-time, and has represented Poland in international football.\n\nThey were a ragtag bunch, but all things considered, it would be hard to be too critical of the Penrith cub's efforts.\n\nThis, after all, was the most inexperienced team in NRL history in terms of cumulative games, and they showed plenty of spirit despite going down 28-4 to Canterbury.\n\nTheir emergence was part of the long game for the Panthers. In holding back nearly their entire top side, they're throwing their weight around without moving a muscle.\n\nOnly two of the 117 teams that have won premierships in Australia have won from outside the top four, and now that the Panthers can finish no higher than sixth, they're aiming to make it three.\n\nIn his pre-match press conference, coach Ivan Cleary mentioned how the rise from the bottom of the ladder near the midpoint of the season had taken its toll, which is a marker of how things have changed for his side.\n\nThey have found peace in being at war forever, and are no stranger to a final round mass resting, but that was when they were top of the ladder, or close to it.\n\nPenrith rested 16 of its top 17 for the match, confirming it will miss the top four. (AAP Photos: Mark Evans )\n\nThis time, the resting, two rounds out from the finals, was both a statement of intent that they're going for something that is incredibly difficult, and a concession of the size of the task ahead because recent history says just making it to the grand final from outside the four will take something heroic.\n\nEight sides have made the grand final from outside the top four in the NRL era — including Cleary's New Zealand Warriors side in 2011 — but it hasn't happened since 2017.\n\nWhat shapes in Penrith's favour is that the last team that walked in the unfamiliar country they're seeking, fit a similar profile to the four-time defending premiers.\n\nThe 1995 Bulldogs won it all after finishing sixth in the regular season, joining the 1993 Broncos — which finished fifth but were just one win off the minor premiership — in a very exclusive club.\n\nBoth these Panthers and those Bulldogs entered the year among the premiership favourites, and both played their seasons out of Parramatta rather than their traditional homes.\n\nNRL live: Canterbury Bulldogs vs Penrith Panthers Photo shows Lachlan Galvin of the Bulldogs scores a try, grounding the ball in the corner while being tackled A hat-trick to backrow forward Jacob Preston has guided the Canterbury Bulldogs to a 28-4 win over an understrength Penrith Panthers. Follow live.\n\nWhile Penrith has had to claw its way up from higher depths after it was in last place after an awful first half of the year, Canterbury was dealing with a more existential crisis.\n\nThe advent of the Super League war cast a pall over the whole sport, but Canterbury, which chose to link with the breakaway competition, had to reckon with four of its best players — Jason Smith, Jarrod McCracken, Dean Pay and Jim Dymock — attempting to backflip on their deals with the rebels.\n\nEventually, they sued the club for the right to head to ARL-aligned Parramatta, and while Smith, Pay and Dymock all went on to play in the grand final side, bad blood bubbled underneath the surface between McCracken and coach Chris Anderson all season.\n\nJust as Penrith regrouped after a dire loss to Newcastle in Bathurst this year, the Bulldogs came together after a 42-0 smashing by the Knights in late June that put them down to 10th on the ladder.\n\nThere was a couple of bonding sessions, which was the style at the time, where some truths were exchanged and honest words told as the beers flowed.\n\nThe details all came up again just last month, when the 1995 Dogs got together for the 30-year reunion of their hard-fought miracle.\n\n\"Only the people at the Bulldogs gave us any chance, but we were building in confidence and — more importantly — belief,\" said hooker Jason Hetherington.\n\nThe 1995 Bulldogs held their reunion earlier this year. (Getty Images: Jeremy Ng)\n\n\"We embraced the moments of finals footy and we had an understanding of what was in front of us.\n\n\"It's proof it can be done. The statistics say it's extremely hard to do, but we proved it can.\"\n\nIf Canterbury's run through that finals series happened in a movie, it wouldn't have worked because nobody would find it realistic. It was too good to be true, only it really happened.\n\nAfter beating St George in week one, they downed the third-placed Broncos handily before outlasting the second-placed Raiders, which had only lost two matches all year, in the preliminary final.\n\n\"Our belief heading into the grand final against Manly was so strong, they'd only lost two games all year, but we felt like nobody could beat us,\" Hetherington said.\n\n\"A big part of it goes to the chemistry of what we had. Mateship, backing each other up, helping each other out, that matters.\"\n\nThe 17-4 victory over the Sea Eagles in the decider confirmed Canterbury's place in history and ensured they would send out retiring captain Terry Lamb a winner.\n\nLamb, who Hetherington calls the greatest team man he's ever seen, galvanised the squad through the hard times, but it took mighty efforts from the heralded and unheralded alike to slay all the giants.\n\nTerry Lamb helped hold Canterbury together en route to its 1995 premiership. (Getty Images)\n\n\"I always try and give special mention to Simon Gillies. What he did through the finals series was incredible, and I'd never seen him play like that in my life,\" Hetherington said.\n\n\"He was a good defensive toiler in the forwards, a good player, and a better fella, but he led the way, and we followed him. He was an everyday battler footballer who became outstanding.\n\n\"It takes special efforts like that, everyone following along, everyone playing to their best of their ability. It can be done, but you have to believe it can be done.\"\n\nIf any team has that belief it's Penrith because no side has a greater understanding of what it takes to win at this time of the year.\n\nThat gives them a better foundation to win it from the bottom half of the eight than sides like the Roosters, or Broncos, which, for all their attacking brilliance, may struggle to find the consistency to win the required four sudden-death games in a row.\n\nAt the same time, it's worth remembering Penrith is not chasing its first title as a group, but its fifth.\n\nOver the course of their dynasty they have outlasted fatigue, conventional wisdom over how long a team can stay hungry, and seemingly time itself as they put together the greatest winning run of their time.\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\nEventually, that has to catch up to them, and what they're doing has to end because not even this team can last forever.\n\nBut this is the same side that has made themselves immortal by finding new things to fight against, and new challenges to conquer, even as they sat on top of the world.\n\nWinning it all again, from here, with the weight of such history against them, strikes as the exact thing that would keep the black fires burning.\n\nBeyond that, it's been an unusual and open season, which could forecast an unusual and opening finish.\n\n\"We all think we know who the good teams are, and some have been good all year, but if you know anything about footy, your tips this season are probably a disaster,\" Hetherington said.\n\nAnd when he talks about the nuts and bolts that drove the Bulldogs, there are echoes of the same elements that have built the Panthers to greatness time and again.\n\n\"What made us successful was our strong defensive efforts for each other, we just kept turning up and turning them away,\" Hetherington said.\n\n\"If teams can get that defensive system and structure for each other, anyone can stand a chance. It's a tall order, it can be done, but you have to believe you can do it.\"",
    "source": "ABC",
    "cluster_id": 14
  },
  {
    "url": "https://www.abc.net.au/news/2025-08-29/aussie-star-jess-hull-diamond-league-dream-ends-tough-finish/105710720",
    "title": "Aussie star Jess Hull's Diamond League dream ends in tough finish",
    "publish_date": "Thu, 28 Aug 2025 21:14:32 +0000",
    "category": "sports",
    "authors": [],
    "text": "Jess Hull has blown a glorious opportunity to grab Diamond League glory when she ran out of steam with victory in her grasp in the 1,500-metre final in Zurich.\n\nAustralia's Olympic silver medallist looked certain to prevail as she held a 10m lead coming down the home straight in the Letzigrund Stadium on Thursday, local time, but she'd miscalculated her energy reserves and blew up in the last few steps, allowing Kenyan Nelly Chepchirchir to steal the win right on the line.\n\nChepchirchir herself was nearly out on her feet and the leading pair were both almost overhauled by the third-placed Australian, Linden Hall, whose fast finish would surely have taken her to victory in a couple more strides.\n\n\"I saw it, I saw Nelly coming closer, it's okay,\" a resigned Hull said afterwards. \"With the last 100m, I was tired, my legs were very tired because I've had very hard training blocks.\n\n\"I learned today my body is fit, but that I need to keep energy for the last 100m, so the solution is to take a bit out of training.\"\n\nHull slumped to the track exhausted after being beaten by just three-hundredths of a second — 3 minutes and 57.02 seconds to Chepchirchir's season's best 3:56.99.\n\nIf she had won, it would have resulted in an extra fourth place being opened up for Australia in the women's 1,500m in Tokyo.\n\nGeorgia Griffith, who'd earlier finished fourth in the 3,000m final in 8:41.36 behind Ethiopian winner Fantaye Belayneh (8:40.56), may have been the one who would have benefited.\n\nOlyslagers wins another Diamond League Photo shows Nicola Olyslagers clenches her fists and smiles after winning the high jump in front of the Zurich Opera House. Nicola Olyslagers confirms her status as perhaps Australia's greatest gold medal chance at next month's athletics world championships.\n\nAll-time miling great Steve Cram said on the BBC he'd never seen anything like Hull's \"collapse\" in the dying metres once her bold front-running had allowed her to push on for glory with just under 800m left.\n\nFive metres clear at the bell, Hull doubled her advantage — and more — down the back straight, but had nothing in reserve as she tried to run the legs out of her Kenyan pursuer.\n\nCram noted: \"She completely misjudged it, the two of them couldn't have gone any slower at the end — I've never seen that before. Jess completely ran out of gas.\n\n\"You've got to know you've got enough in reserve when you get to 300m, 200m to go. She's got that experience, but with 200 she was still heading for a time of 3:55. I haven't seen anything like that from Jess in a long time.\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\n\"In the end, Linden Hall (3:57.44) almost won it — it was a strange race.\"\n\nIt meant Hull missed out on joining Wednesday's high jump winner Nicola Olyslagers, hurdler Sally Pearson, and two-time pole vault winner Nina Kennedy as Australian women Diamond League champions.\n\nOlympic bronze medallist Matthew Denny missed out his third straight men's discus title, his best effort of 66.62m good enough for only fourth behind Lithuania's Paris silver medallist Mykolas Alekna, who prevailed with 68.89m in the second round.\n\nMackenzie Little also took fourth place in the women's javelin, the World Championship bronze medallist had a best throw of 61.96m, the first time she had thrown over 60m in 2025.\n\nMelbourne's Sarah Billings came home seventh (1:58.76) in a thrilling 800m won by local Swiss heroine Audrey Werro in 1:55.91.\n\nAAP/ABC",
    "source": "ABC",
    "cluster_id": 15
  },
  {
    "url": "https://www.abc.net.au/news/2025-08-29/south-gippsland-finds-public-transport-desert-solution/105607226",
    "title": "Residents create public transport oasis in train and bus 'desert'",
    "publish_date": "Thu, 28 Aug 2025 20:17:30 +0000",
    "category": "finance",
    "authors": [],
    "text": "On a tidy back street in Leongatha, a minibus is getting ready to depart.\n\nThe driver conducts some final safety checks before pulling away from the Leongatha Community House and heading into town.\n\nThe Leongatha Community House bus departs for the day. (ABC Gippsland: Danielle Kutchel)\n\nIts first stop is the home of Leongatha local Yvonne Osborne, who is on her way to visit a friend in Korumburra, 15 minutes down the road.\n\nUnable to drive and with no access to public transport, she relies on the bus to visit friends and attend appointments.\n\nShe is not the only one.\n\nSoon, the seats fill up with elderly commuters, some with health and mobility issues, all on their way to town for shopping, medical appointments, or lunch.\n\nMs Osborne said the service was life-changing for her.\n\nShe no longer had to rely on her nieces, who lived in Melbourne, to get her where she needed to go.\n\nResidents get ready to board the Leongatha Community Bus into town. (Supplied: Leongatha Community House)\n\nLeongatha Community House manager Maddison Redpath said the area was \"a transport desert\".\n\n\"They can catch taxis … but a lot of people who are accessing this service are on pensions, so it allows them to do it at a more affordable cost,\" she said.\n\nThe minibus makes the round trip from Leongatha to Korumburra every Wednesday.\n\nUp to 13 people can fit on board, each paying $6 to help with running costs.\n\nMs Redpath said the dream was to run the bus for free.\n\nMaddison Redpath, Jennifer Fleming and Lanie Verboon are from Leongatha Community House. (ABC Gippsland: Danielle Kutchel)\n\n'No service at all'\n\nMonash University public transport researcher Professor Graham Currie said young people, the elderly, Aboriginal communities, and people with disability were most affected by public transport deserts.\n\n\"Unfortunately, in regional Victoria, there are an awful lot of them where there's no service at all,\" Dr Currie said.\n\nGraham Currie says regional Victoria has many public transport deserts. (Supplied: Graham Currie)\n\n\" The people that end up being isolated in these cases certainly have lower opportunities in life, they struggle to get to activities they would like to get to … and that can go as far as health. \"\n\nDr Currie said the alternative for many people was to move to another town with better public transport, even if it meant leaving family and friends behind.\n\nHe said that while community services filled a gaping hole, a comprehensive solution to the problem needed the attention of all levels of government.\n\nTowns 'forgotten'\n\nSouth Gippsland once had a passenger V/Line train line that had services between Melbourne and Leongatha with branches to more distant towns.\n\nThe line was progressively closed from the 1950s.\n\nThe region is now serviced by sporadic regional V/Line buses, which connect some of the shire's major towns along a bus line to Yarram.\n\nSouth Gippsland Shire Mayor John Schelling said better public transport would allow people to access outer-suburban hospitals and make it easier for tourists to visit Wilsons Promontory.\n\nSouth Gippsland Shire and Bass Coast Shire are serviced only by buses. (ABC Gippsland: Danielle Kutchel)\n\nMr Schelling said a lack of public transport would hinder the growing offshore wind farm industry, forcing workers to rely on cars.\n\nA Department of Transport and Planning spokesperson said this year's state budget included funding for more frequent coach services between Leongatha and Yarram, which were expected to begin next year.\n\nDependent on cars\n\nSouth Gippsland Shire is not the only regional area in Victoria without adequate public transport.\n\nThe large regional centre of Mildura, in the state's north west, does not have any passenger rail services.\n\nResidents of Gippsland's Bass Coast Shire are also forced to rely on occasional buses to its tourist hotspots.\n\nRochelle Halstead wants better public transport in her region. (Supplied: Bass Coast Shire Council)\n\nBass Coast Mayor Rochelle Halstead said the municipality had become car-dependent.\n\n\"It's critical that we have those services right across Bass Coast, linking all of our towns and then linking from Bass Coast into the broader Melbourne regions,\" she said.\n\nThe recent state budget included funding to continue bus services in Bass Coast, including the Anderson to Cowes service, Bass Coast and South Gippsland TAFE bus, and Wonthaggi to Leongatha service via Inverloch.",
    "source": "ABC",
    "cluster_id": 16
  },
  {
    "url": "https://www.smh.com.au/sport/soccer/predictions-the-premier-league-match-week-3-you-pick-the-winners-20250829-p5mqsk.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Predictions: The Premier League Match Week 3 - you pick the winners",
    "publish_date": "Fri, 29 Aug 2025 11:54:46 +1000",
    "category": "sports",
    "authors": [
      "Emma Kemp"
    ],
    "text": "You might have noticed that the second weekend of the season delivered new narratives for tipping consideration. Manchester City, last week deemed in title contention thanks to their season-opening win over Wolves, are now apparently back out of the title race after being shown up by Tottenham. By the end of the third round, however, Pep Guardiola might be back in with a shot if he can oversee a rebound win at Brighton.\n\nBut the weekend’s main drawcard is Arsenal’s trip to Liverpool for a high-profile meeting between last season’s runners-up and champions, and also two sides on a maximum of six points. Eberechi Eze is set to make his Gunners debut, while Reds striker Hugo Ekitike is looking to add to his record of three goals from three games across all competitions for his new club.\n\nSpurs, the only other team with two from two, is also yet to concede a single goal under Thomas Frank, and Ange Postecoglou’s replacement will try to keep it that way when hosting a spirited Bournemouth outfit who have already pushed Liverpool to the brink and beaten Wolves.\n\nIn the crisis department, Manchester United welcomes Burnley three days after the embarrassing Carabao Cup exit to fourth-tier Grimsby Town, which has left manager Ruben Amorim on the brink.",
    "source": "SMH",
    "cluster_id": 17
  },
  {
    "url": "https://www.smh.com.au/sport/tennis/us-open-live-updates-alexei-popyrin-takes-on-world-no-1-jannik-sinner-20250828-p5mqow.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "US Open LIVE updates: Demon up a set despite early struggles as Kasatkina sets up Osaka clash",
    "publish_date": "Fri, 29 Aug 2025 11:50:50 +1000",
    "category": "sports",
    "authors": [
      "Marc Mcgowan"
    ],
    "text": "De Minaur has emphatically grabbed back the break, racing through Mochizuki’s service game without dropping a point before holding to love to push 3-2 ahead.\n\nMochizuki’s energy appears to have dipped a bit in the past 10 minutes, so de Minaur will try to capitalise here and hopefully go two sets up. This has been a tricky day at the office, but it’s further evidence of how reliable de Minaur has become, even when opponents throw the kitchen sink at him.\n\nAs much as de Minaur won’t be afraid to take the court against him, he would love to see Germany’s Daniel Altmaier upset potential third-round opponent Stefanos Tsitsipas.",
    "source": "SMH",
    "cluster_id": 18
  },
  {
    "url": "https://www.smh.com.au/business/companies/virgin-s-discipline-pays-off-as-full-year-earnings-climb-20250828-p5mqqh.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "‘Seat densification’: Virgin’s discipline pays off as full-year earnings climb",
    "publish_date": "Fri, 29 Aug 2025 11:45:04 +1000",
    "category": "finance",
    "authors": [
      "Chris Zappone"
    ],
    "text": "Chief financial officer Race Strauss said: “Importantly, all key financial metrics included in the prospectus were met or exceeded.” Virgin is standardising - and making more dense - its seating. The company’s transformation program aims to enhance revenue through more offerings, cutting costs through improved productivity, and driving deeper loyalty to Virgin’s Velocity program. The cost of the IPO and Qatar Airways “wet lease” transaction were $115.9 million. The deal gives Virgin access to Qatar’s international longhaul network, without the cost of maintaining the fleet. The company’s transformation program is expected to generate $400 million in benefits in 2026 and more for the next few years “and beyond”.\n\n“We’re in a high inflationary environment in aviation and so we need to be not just offsetting [the inflation] but getting beyond it,” Emerson said. Seat densification Strauss said: “We’ve still got a lot of the fleet density opportunities, putting the additional aircraft in the fleet, we’re only a little more halfway on that.” Additionally, Virgin Australia Regional Airlines is being simplified and more technology benefits are coming. “There’s a long pipeline still to come,” Stauss said.\n\nPart of the transformation involves a seat densification program. CEO Virgin Australia Dave Emerson. Credit: Edwina Pickles Emerson said adding more seats to the aircraft “really benefits the customer because... Sometimes today we show up in the plane has a few more or few fewer seats than we had planned and that’s not great for the customer experience.” “So we’re setting it up now so each plane is set up with exactly the same configuration and for some of the planes that needs an extra row of seats, but not all of them.” Other revenue streams are strong too. Velocity contributed $450 million, up from $409 million and added 900,000 new members.\n\nLoading “The Qatar deal has really helped our Velocity program and created a very positive dynamic for customers,” said Emerson, who noted that on a profit and loss basis “it hasn’t really affected us positively or negatively”. Atlas Funds chief investment officer Hugh Dive said Virgin’s results had to be read in parallel with Qantas’ to get a reading of where the company stood. While Virgin had smaller capital expenditure than Qantas which is refreshing its fleet, overall the airlines were tracking in a similar direction. Virgin’s load factor – a measure of the used seat capacity, or the fullness of a flight – is at 84.9 per cent compared to Qantas domestic at 78.1 per cent.\n\n“Virgin’s load factor is a lot higher than Qantas domestic – but both are pretty good,” said Dive. Jetstar domestic meanwhile is at 89.5, which helps explain its contribution to Qantas. Revenue rose as well to $5.8 billion in 2025 from $5.63 billion in 2024, a growth of 3.1 per cent. Virgin made a successful return to the sharemarket in June, valued at $2.3 billion, after selling $685 million worth of stock to fund managers and retail investors at $2.90 a share. Virgin was delisted from the ASX in 2020 amid mounting debts and losses. Having entered administration, it was bought by US-based Bain Capital, the private equity firm Emerson worked for before joining Virgin’s management in 2021.",
    "source": "SMH",
    "cluster_id": 19
  },
  {
    "url": "https://www.smh.com.au/property/news/sydney-pub-baron-who-is-1-8-billion-in-debt-lists-rose-bay-home-for-sale-20250826-p5mpxg.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Sydney pub baron who is $1.8 billion in debt lists Rose Bay home for sale",
    "publish_date": "Fri, 29 Aug 2025 11:45:00 +1000",
    "category": "finance",
    "authors": [
      "Tawar Razaghi"
    ],
    "text": "The Rose Bay home of embattled hospitality entrepreneur Jon Adgemis has hit the market amid the spectre of a potential bankruptcy fraud investigation.\n\nWhile there is no price guide on the mortgagee in possession, the six bedroom, five-bathroom house was purchased by the Public Hospitality Group founder and his mother, Rose, for $4.45 million in 2018.\n\nThe Rose Bay home of Jon Adgemis and his mother Rose has hit the market. Credit:\n\nSet on 556 square metres, the home has a long list of caveats lodged against the property including the chief commissioner of state revenue, who is chasing unpaid land tax to the tune of $255,796 for the state’s coffers, and an alcohol supplier that is owed a little over $1 million for unpaid booze supplied to his venues.\n\nJon’s debts have ballooned to more than $1.8 billion, owing money to a suite of creditors and the tax office.",
    "source": "SMH",
    "cluster_id": 20
  },
  {
    "url": "https://www.smh.com.au/sport/athletics/records-and-roads-closures-everything-you-need-to-know-about-the-sydney-marathon-20250825-p5mpn9.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Records and roads closures: Everything you need to know about the Sydney Marathon",
    "publish_date": "Fri, 29 Aug 2025 11:43:39 +1000",
    "category": "sports",
    "authors": [
      "Frances Howe"
    ],
    "text": "Loading Although it will take the best athletes more than two hours to finish the race, you shouldn’t be fooled. The best will be running very fast. Crazy fast. The men’s race is expected to be won in around 2 hours and 5 minutes (2:05). To run that time, athletes will have to complete every kilometre in just under three minutes. That works out at 72 seconds for every 400m, or 18 seconds for every 100m. How fast is that? The best way to understand that pace (for mere mortals who know the struggle of a treadmill) is to do this: go to your treadmill and turn the speed up to 20 (km/h). See if you can last 30 seconds. The world’s fastest men’s marathoners can set it to 20 km/hr and run for two hours. The world’s best women do it on 19 km/hr.\n\nRoughly speaking, a three-hour marathon equates to running at 14 km/hr on the treadmill. The course The Sydney Marathon was first opened to the public in 2001 as a way for your average Joes to get a chance to complete the course that the best athletes in the world had run at the 2000 Olympics. It’s changed in the years since, but will still feature some of the original course, including its most appealing features. Highlights will include running across the Harbour Bridge, the gruelling final uphill lap to Mrs Macquarie’s Chair, and a finish in front of the Opera House. The result: this marathon will have the most elevation of any of the majors, a fact which is sure to test even the best, as Hassan herself said on Thursday that she was “not good at hills”.\n\nHow to watch There are several key spots for spectators to watch the marathon this year. Those who want to see the gun go off at the start line should aim to be at Miller St in North Sydney by 6:15am. Other key viewing areas are Barangaroo (from 6:30am), Martin Place (from 6:40am), Randwick (from 7:30am), and Moore Park (from 7:55am). There will be several fan sites along the course, complete with DJs, face painters, and even Drag Queens watching on when the race passes through Taylor Square. The first runners are expected to cross the finish line from 8:30am, with the last of the finishers expected at around 3:15pm. Workenesh Edesa Gurmesa winning the 2024 race.",
    "source": "SMH",
    "cluster_id": 21
  },
  {
    "url": "https://www.smh.com.au/sport/nrl/reece-walsh-is-more-than-just-a-pretty-face-20250828-p5mqjx.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Reece Walsh is more than just a pretty face",
    "publish_date": "Fri, 29 Aug 2025 11:40:00 +1000",
    "category": "sports",
    "authors": [
      "Adrian Proszenko"
    ],
    "text": "Save Log in , register or subscribe to save articles for later. Save articles for later Add articles to your saved list and come back to them any time. Got it Normal text size Larger text size Very large text size To the untrained eye, Reece Walsh looks like he’s making it up as he goes along. A flick pass here, a goose step there. Maybe a short-side raid or a chip-and-chase, as likely to come out on the first tackle as the last. How can opposition defences know what’s coming because the flying fullback seemingly doesn’t know himself? But this is where the rugby league world has got it all wrong. The greatest dummy Walsh has ever sold is the notion that he’s doing it all off the top of his head. That the audacious plays that make highlight reels when they come off - and give Brisbane coach Michael Maguire a coronary when they don’t - are the result of unscripted, ad-lib football. Nothing is further from the truth. “The way I play, people think it’s off the cuff and it’s just luck, but the hours spent in the video room, watching teams, watching how they defend, their habits and tendencies, my brain doesn’t stop,” Walsh says. “The way I play, people enjoy watching it, but it’s [about] the things they don’t see; the hours that I put in on the [training] field, even with ‘Madge’ [Maguire], going over plays, picking his brain about things.\n\nAdvertisement\n\n“I’m very passionate about my footy. I want to try to be the best player I can be and it’s something I pride myself on, working hard and spending those hours on the training paddock when there’s no one around watching.” Sit down with Maguire, and he’ll describe Walsh as a student of the game. Whether it’s spending countless hours on the training track or forever studying video footage off it, the fullback’s workday is longer than most. It prompts the question; is the most flashy, flamboyant star in the game a footy nerd? “You tell me,” Walsh laughs. “If you’re watching every single game every week, watching my games back, is that a footy nerd? Reece Walsh leaves defenders in his wake. Credit: Getty Images “I don’t really think that’s being a footy nerd, that just comes with it. I don’t know, it’s not a one mould fits all. It’s just what I enjoy doing, trying to be the best I can for myself. “If that’s watching a bit more video, working on a few more things. I’m not the only guy who does it. There’s a lot of guys in our squad that work extremely hard on their craft to be the best.”\n\nAdvertisement\n\nThe greatest fullback of the modern era, Billy Slater, was given simple riding instructions from Melbourne coach Craig Bellamy. Slater was given the freedom to express himself however he liked on the football field, but only if he first perfected the play at training. It’s a similar relationship between Walsh and Maguire. “100 per cent. If I haven’t got something right, if I haven’t trained it, that’s when he is disappointed,” Walsh says. “He does say a lot about putting those hours and extras in. Even after our trainings are done, we practice things and it comes out in the games. “The time spent practising stuff, you might not get it within the first 10 goes or whatever it is, but when you do things right that you’ve practiced, it’s enjoyable. Madge has been awesome.” Brisbane coach Michael Maguire. Credit: Zak Simmonds The relationship between Walsh and Maguire is less than a season old, although Maguire would have liked it to have commenced earlier. Walsh has New Zealand heritage and Maguire attempted to get him to pledge his allegiance to the Kiwis when he was coaching the national team. “He did, that was my first year, in 2021, he asked me to be part of the Kiwis,” Walsh says.\n\nAdvertisement\n\n“I declined it, with all due respect. I love Queensland and Australia. That’s not to say that I don’t love the Kiwi side of me, but I grew up here and that’s what I want to represent … I will always put my hand up to represent Australia. “To be able to put my last name on one of them jerseys, I would be doing my family proud.” There are few opportunities to escape from football, or the public view, when you’re the shiniest star in rugby league. The Broncos No.1 has 540,000 Instagram followers, more than every single NRL club, save for his own. Christened as the “Justin Bieber of rugby league”, by ARL Commission chairman Peter V’landys, he is one of the biggest stars in Australian sport. There was a brief respite, of sorts, from public life on Wednesday when Walsh was unveiled as the ambassador of AUSX Supercross in Redcliffe. It was a chance for the Maroons star to take his four-year-old daughter, Leila, to a promo event at Kayo Stadium. Reece Walsh celebrates with his daughter Leila after a match in 2023. Credit: Getty Asked should Maguire be concerned about the prospect of his star player on a motorbike, Walsh quips: “If he saw me ride, I don’t think he’d be too worried, I’m elite. “I take my footy very seriously, that’s always going to be the number one priority. Having a daughter, that gets you away from footy.\n\nAdvertisement\n\n“Every single day you come home and she’s got a smile on her face. Being able to experience these moments with her, it’s what pulls me back to feeling like a kid again. “I remember getting hand-me-down pants and boots from my brother to ride his motorbike. To be sitting here and kitted out on a motorbike with my daughter is pretty special … “To show her what hard work gets, to not let anyone put you down or say things, to persist through that and put one foot in front of the other. I want to be the best role model that I can for her. “Obviously I slip up here and there, but I try to keep working hard and putting one foot in front of the other, then I’m doing a decent job.” Whenever Walsh steps out in public, particularly in Queensland, he is mobbed. Everyone either wants a piece of him or has an opinion. Take last weekend, for instance. After a stellar performance, the only thing anyone wanted to talk about was his decision to selflessly gift Kobe Hetherington a try in the forward’s milestone game. Perhaps it’s one of the reasons why Walsh grants few interview requests, instead opting to give fans a glimpse into his private life through his own YouTube channel. “It’s what comes with it,” says Walsh of life in the NRL fishbowl.\n\nAdvertisement",
    "source": "SMH",
    "cluster_id": 22
  },
  {
    "url": "https://www.smh.com.au/national/queensland/brisbane-news-live-brisbane-nation-s-third-youngest-capital-leaders-condemn-anti-immigration-rally-20250828-p5mqjf.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Brisbane news live: Newman-era deputy premier lands second government board job | Minister hails breakthrough in nurse pay talks | Things to do in Brisbane this weekend",
    "publish_date": "Fri, 29 Aug 2025 11:37:33 +1000",
    "category": "finance",
    "authors": [],
    "text": "Casino operator Star Entertainment was forced to report an unaudited $471.5 million loss on Friday for the 2025 financial year with its auditors expected to take another month to work through the many financial uncertainties over its future before signing off on its accounts.\n\n“Our announcement today highlights a number of key interdependencies that are critical to the Group’s future,” chief executive Steve McCann said.\n\n“The Group continues to require significant support from a range of its stakeholders including governments, regulators, lenders and investors. Without that support it will be difficult to navigate the various challenges facing the Group and to create a sustainable future for the business.\n\n“The Group has sourced additional funding to enable The Star to continue to provide thousands of jobs and support tourism and entertainment in the markets in which we operate.”\n\nLoading\n\nThe loss included significant items of $212 million relating to the writedown of the value of its Brisbane casino, which is being sold to its consortium partners, redundancy costs, heightened regulatory costs and fines as well as raised funding costs due to the precariousness of its financial position.\n\nGroup revenue and earnings declined despite $100 million of cost cuts last year, and the group flagged that more cuts are planned for this year.\n\nStar said the declining performance reflected new regulatory burdens like carded play and cash limits and the fact that it is losing market share to gambling rivals.\n\nStar said trading activity stabilised towards the end of June “although at depressed levels”. Cash levels were $234 million as of June 30 but declined to $189 million this week.\n\nStar said there remained material uncertainty regarding the group’s ability to continue as a going concern citing factors like the impending money laundering fine from AUSTRAC, continuing negotiations with lenders, and the group’s attempts to regain its casino licences.",
    "source": "SMH",
    "cluster_id": 23
  },
  {
    "url": "https://www.smh.com.au/national/australia-news-live-russian-drone-barrage-kills-19-iranian-ambassador-leaves-australia-following-albanese-s-expulsion-20250829-p5mqsd.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Australia news LIVE: Albanese’s net zero policy booed at bush summit; Katter urged to apologise after journalist outburst",
    "publish_date": "Fri, 29 Aug 2025 11:30:29 +1000",
    "category": "finance",
    "authors": [
      "Daniel Lo Surdo"
    ],
    "text": "Demand for homewares and lifestyle goods, mobiles, computers and other AI-powered devices helped drive Harvey Norman’s overall network sales by 5.5 per cent to $9.35 billion and lifted profits after tax by 47 per cent to $518 million.\n\nEasing cost-of-living pressures helped drive a particularly strong second half, with more Australians renovating their homes and replacing their household goods. The white goods and furniture retailer’s franchises grew profits by 25.9 per cent to $344.4 million, driven by a 6.1 per cent rise in revenue to $6.43 billion. Margins rose from 4.5 per cent last year to 5.4 per cent.\n\nHarvey Norman’s profits lifted after tax by 47 per cent to $518 million. Credit: Scott Barbour\n\n“Franchisees continue to strengthen their position in the fast-growing AI PC market, capitalising on rising consumer demand for smart, AI-enabled technologies” the company stated in ASX documents.\n\n“With residential construction and home improvement activity increasing, franchisees are well-positioned to benefit from sustained demand across its Furniture & Bedding categories.”\n\nInvestors have cheered the strong figures, sending the retailer’s share price 9.7 per cent higher this morning.\n\nHarvey Norman’s overseas business – it operates 270 overseas stores in seven countries across Asia, Europe, Ireland and Northern Ireland – reported a 4.9 per cent rise to $2.76 billion, a figure accompanied by a 5.5 per cent increase in expenses to $2.65 billion. Profit before tax of its overseas business declined 7.2 per cent to $110 million.\n\nThe retailer expanded into the UK in October last year, opening up a new store in the West Midlands region. Two new stores were opened in New Zealand, four in Malaysia, and one in Singapore.",
    "source": "SMH",
    "cluster_id": 24
  },
  {
    "url": "https://www.smh.com.au/national/they-want-to-silence-the-anu-s-music-school-this-is-tone-deaf-vandalism-20250826-p5mq1j.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "They want to silence the ANU’s music school. This is tone-deaf vandalism",
    "publish_date": "Fri, 29 Aug 2025 11:30:00 +1000",
    "category": "entertainment",
    "authors": [
      "Richard Tognetti"
    ],
    "text": "Rock drummers, jazz singers. Children with fiddles. Physicists with cellos. Law students from Hong Kong at the piano. Clarinettists from Queanbeyan. Punks from Rockhampton.\n\nFrom within the Australian National University’s School of Music and beyond, all demand to know: why slash and burn this great national educational and cultural institution? How can you justify discounting the worth of the students, without whom you wouldn’t exist?\n\nStudents at the ANU who have launched a campaign against proposed cuts to the School of Music. Credit: Alex Ellinghausen\n\nUnder the changes, the ANU’s School of Music would be relegated to “program” status and absorbed into a new School of Creative and Cultural Practice, with a revised bachelor of music to replace the traditional one-to-one instrument model.\n\nExplanations so far are no more than a smokescreen: the rhetoric of “future-proofing” and “integration” hide the truth of what’s being done here. The decision-makers seem deaf to the students’ voices which are resonating in halls, classrooms, rehearsal rooms, and stages across the nation and the globe.",
    "source": "SMH",
    "cluster_id": 25
  },
  {
    "url": "https://www.smh.com.au/politics/federal/bob-katter-s-son-defends-his-father-as-pm-condemns-journalist-threat-20250829-p5mqt7.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Bob Katter’s son defends his father as PM condemns journalist threat",
    "publish_date": "Fri, 29 Aug 2025 11:27:35 +1000",
    "category": "finance",
    "authors": [
      "Nick Newling"
    ],
    "text": "Prime Minister Anthony Albanese has condemned Bob Katter’s threatening of a journalist at a Brisbane press conference on Thursday, as Katter’s son backs in his father, saying journalists should expect aggression in response to personal questions from the long-term MP.\n\nAlbanese joined a cavalcade of MPs from across the political spectrum calling for Katter to apologise to Brisbane journalist Josh Bavas – the target of the outburst. Katter has refused to apologise, with his son saying it is difficult to understand how Bavas could have been intimidated by an 80-year-old.\n\n“Bob Katter needs to have a look at that footage. Have a look at himself, frankly, and recognise that that’s not what we expect of any Australian, let alone someone who’s in public office,” Anthony Albanese told Channel Nine’s Today on Friday morning.\n\nKatter and Queensland state party MPs were speaking in support of this weekend’s anti-migration March for Australia rallies during a Thursday press conference when Bavas, a Channel Nine reporter, asked Katter about his Lebanese heritage, triggering the response.",
    "source": "SMH",
    "cluster_id": 26
  },
  {
    "url": "https://www.smh.com.au/national/audience-heckle-albanese-at-bush-summit-20250829-p5mqwb.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Audience heckle Albanese at Bush Summit",
    "publish_date": "Fri, 29 Aug 2025 11:27:21 +1000",
    "category": "finance",
    "authors": [],
    "text": "Audience heckle Albanese at Bush Summit\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 27
  },
  {
    "url": "https://www.smh.com.au/sport/tennis/popyrin-puts-sinner-loss-into-perspective-20250829-p5mqw9.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Popyrin puts Sinner loss into perspective",
    "publish_date": "Fri, 29 Aug 2025 11:25:30 +1000",
    "category": "finance",
    "authors": [],
    "text": "Popyrin puts Sinner loss into perspective\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 28
  },
  {
    "url": "https://www.smh.com.au/sport/tennis/swiatek-baffled-by-odd-presser-20250829-p5mqw5.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Swiatek baffled by odd presser",
    "publish_date": "Fri, 29 Aug 2025 11:20:22 +1000",
    "category": "finance",
    "authors": [],
    "text": "Swiatek baffled by odd presser\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 29
  },
  {
    "url": "https://www.smh.com.au/sport/tennis/2nd-round-highlights-daria-kasatkina-vs-kamilla-rakhimova-20250829-p5mqvy.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "2nd Round Highlights | Daria Kasatkina vs Kamilla Rakhimova",
    "publish_date": "Fri, 29 Aug 2025 11:16:37 +1000",
    "category": "sports",
    "authors": [],
    "text": "2nd Round Highlights | Daria Kasatkina vs Kamilla Rakhimova\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 30
  },
  {
    "url": "https://www.smh.com.au/sport/tennis/2nd-round-highlights-alexander-bublik-vs-tristan-schoolkate-20250829-p5mqvv.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "2nd Round Highlights | Alexander Bublik vs Tristan Schoolkate",
    "publish_date": "Fri, 29 Aug 2025 11:14:04 +1000",
    "category": "finance",
    "authors": [],
    "text": "2nd Round Highlights | Alexander Bublik vs Tristan Schoolkate\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 31
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/knights-of-the-productivity-roundtable-ft-senator-jacqui-lambie/tdqs2qw1z",
    "title": "Knights of the (productivity) roundtable ft. Senator Jacqui Lambie",
    "publish_date": "Thu, 28 Aug 2025 21:00:00 +0000",
    "category": "finance",
    "authors": [],
    "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
    "source": "SBS",
    "cluster_id": 32
  },
  {
    "url": "https://www.sbs.com.au/news/video/migrant-skills-wasted-hurting-australias-productivity/q4h4pqa4m",
    "title": "Migrant skills wasted, hurting Australia’s productivity",
    "publish_date": "Thu, 28 Aug 2025 10:02:53 +0000",
    "category": "finance",
    "authors": [],
    "text": "Migrant skills wasted, hurting Australia’s productivity\n\nPublished 28 August 2025, 8:56 am\n\nThousands of permanent migrants are being underutilised, and it's stifling Australia's productivity. That's the finding of a new report commissioned by 'Activate Australia's Skills'. A campaign spear-headed by Settlement Services International and 100 partners from industries, unions and social services.",
    "source": "SBS",
    "cluster_id": 33
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/ceo-series-wesfarmers-rob-scott-calls-for-action-on-victorian-retail-crime/d63yt5qil",
    "title": "CEO Series: Wesfarmers Rob Scott calls for action on Victorian retail crime",
    "publish_date": "Thu, 28 Aug 2025 08:02:24 +0000",
    "category": "finance",
    "authors": [],
    "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
    "source": "SBS",
    "cluster_id": 32
  },
  {
    "url": "https://www.sbs.com.au/news/article/human-rights-groups-criticise-governments-dangerous-law-making-as-attack-on-migrants/rareugmif",
    "title": "'Incredibly alarming': Albanese's proposed rules for deporting non-citizens criticised",
    "publish_date": "Thu, 28 Aug 2025 05:51:11 +0000",
    "category": "finance",
    "authors": [],
    "text": "The government has proposed legislation that would allow it to waive the requirement of procedural fairness for non-citizens facing removal to a third country.\n\n\n\n\n\nHuman rights groups released a joint statement on Thursday criticising Home Affairs Minister Tony Burke's bill introduced to parliament earlier in the week.\n\n\n\n\n\nThe proposed changes in the bill would suspend the rules of natural justice for decisions involving \"third country reception arrangements\" in Australia, meaning the government would no longer be required to provide a fair hearing or consider individual circumstances when deporting non-citizens to those countries.\n\n\n\n\n\nThe changes, however, would not remove the right to procedural fairness regarding decisions related to visa cancellations or refusals.\n\n\n\n\n\nBurke said on Tuesday: \"Procedural fairness is a fundamental principle in many areas of decision-making; however, these provisions can and are being used by non-citizens to frustrate their removal at cost to the Commonwealth in circumstances where it is neither necessary or appropriate for it to continue to apply.\"\n\n\n\nREAD MORE Labor to reimpose ankle monitors, curfews on former immigration detainees\n\n\"These provisions are primarily directed to non-citizens who have exhausted all legitimate avenues to remain in Australia and for whom removal is the only remaining outcome under Australian law,\" Burke said.\n\n\n\n\n\nAustralia is looking to resettle three people in Nauru who were released as a result of the landmark \"NZYQ\" High Court decision, but their removal has been stalled since February due to ongoing court challenges.\n\n\n\nConcerns for legal rights\n\nBurke said the purpose of the law should be clear \"to give effect to removal as swiftly and effectively as possible\".\n\n\n\n\n\n\"All individuals affected by these decisions will have already had full access to visa application processes, merits review, judicial review, and ministerial intervention opportunities,\" he said.\n\n\n\n\n\nSanmati Verma, legal director at the Human Rights Law Centre, told SBS News there are serious concerns about how the new powers could operate in practice.\n\n\n\n\n\n\"It would deprive people of fair notice and a fair opportunity to make their case before they are deported to a third country under the government's new powers,\" she said.\n\n\n\n\n\n\"And it would deprive people of the right to respond before a deportation notice is issued to them, exposing them to prison time if they fail to comply.\"\n\n\n\nREAD MORE Labor pledges new laws to skirt High Court ruling on released immigration detainees\n\nVerma said removing procedural fairness means people could be essentially \"banished\" to another country without their individual circumstances being taken into account.\n\n\n\n\n\n\"What is their health situation? Are they owed protection? Are they going to be harmed in that other country? Do their personal circumstances mean that, once they are sent to a third country, they will never be able to leave? Will they ever practically be able to reunite with their family again?\" she questioned.\n\n\n\n\n\n\"These are the sort of basic human questions that the government should have to ask before exercising these powers.\"\n\n\n\n\n\nVerma said an example of a critical misunderstanding relates to the three men set to be sent to Nauru, where the government \"misunderstood certain critical health details in relation to some of these men and misunderstood the nationality of one of them\".\n\n\n\n\n\nSarah Dale, centre director and principal solicitor at the Refugee Advice and Casework Service, told SBS News another element of the proposal is around retrospective criminality, which has the potential to criminalise something that was not a criminal activity at the time.\n\n\n\n\n\n\"I think we're still coming to terms with what that means specifically in this legislation, but that retrospective nature is something that all lawyers around Australia should be deeply concerned by,\" she said.\n\n\n\nREAD MORE Refugee advocates to launch 'urgent' legal challenge to stop Nauru deportation deal\n\n\"We were assisting one man who had been issued with this removal notice to Nauru, and the courts determined that his previous legal proceedings were flawed, that he had not been afforded due process, and thus that affected his ability to be removed to Nauru,\" Dale said.\n\n\n\n\n\n\"The fact that the government is looking to legislate around these court decisions is incredibly alarming.\"\n\n\n\nLegislation 'secretive' and 'extremely dangerous'\n\nJana Favero, the deputy CEO at the Asylum Seeker Resource Centre, said the legislation sets an \"dangerous precedent\".\n\n\n\n\n\n\"We know that there are times when mistakes are made. We know that there are times when there have been delays in procedural fairness where there have been errors, either bureaucratic or in courts,\" she told SBS News.\n\n\n\n\n\n\"Everyone should have the right to absolutely exhaust all their legal avenues.\"\n\n\n\n\n\nFavero alleged the proposed changes followed a pattern of the Albanese government targeting the rights of vulnerable people in Australia.\n\n\n\n\n\n\"It can't be read in isolation. It also has to be read in conjunction with the three brutal bills that Labor passed at the end of last year, all of which are really forming this cobweb and framework that is denying access to legal justice, access to human rights safeguards for people in our community,\" she said.\n\n\n\nThe government passed laws last year granting immigration officials additional powers to facilitate deportations, including the option to pay other countries to accept non-citizens from Australia.\n\n\n\n'This is not the way'\n\nOpposition leader Sussan Ley has described the bill as \"rushed, secretive and chaotic\", saying the Coalition was only briefed about the bill on the day it was introduced.\n\n\n\n\n\n\"This is not the way that the prime minister and his ministers should conduct policy around critical issues of national security,\" she said at a press conference on Tuesday.\n\n\n\n\n\nSBS News has contacted the Department of Home Affairs for comment.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 34
  },
  {
    "url": "https://www.sbs.com.au/news/article/bob-katter-threatens-reporter-over-march-for-australia-questions/9l793bw3y",
    "title": "PM suggests Bob Katter 'have a look at himself' for threatening journalist over heritage question",
    "publish_date": "Thu, 28 Aug 2025 05:02:46 +0000",
    "category": "finance",
    "authors": [],
    "text": "Prime Minister Anthony Albanese has suggested that Bob Katter \"have a look at himself\" after the maverick federal MP threatened to punch a journalist on Thursday.\n\n\n\n\n\nKatter's threat came after his heritage was questioned ahead of so-called pro-Australia rallies planned across the country.\n\n\n\n\n\nKatter, 80, confronted a TV reporter and thrust a fist in his face when asked about his family's Lebanese heritage in fiery scenes in Brisbane on Thursday.\n\n\n\n\n\nThe Queensland MP had been expressing his support for Sunday's controversial anti-migration March for Australia rallies at a press conference when he suddenly became heated.\n\n\n\n\n\nKatter, who is federal parliament's longest-serving MP, became irate when asked about his Lebanese heritage by Nine Network journalist Josh Bavas.\n\n\n\nHis grandfather Carl Robert Katter immigrated from Lebanon to Australia in 1898.\n\n\n\n\n\n\"Don't say that, because that irritates me, and I punch blokes in the mouth for saying that,\" Katter yelled, cutting off the reporter's question.\n\n\n\n\n\n\"I am Australian. My family have been here since the dawn of time.\"\n\n\n\n\n\nKatter then approached Bavas with a raised fist when the reporter tried to ask what he thought about migrants who arrived in Australia with \"good values\".\n\n\n\n\"You're a racist,\" the veteran MP said, holding his fist close to the reporter's face.\n\n\n\n\n\n\"You cannot say what you just said without being identified as a racist.\n\n\n\n\n\n\"Gentlemen, ladies, this man is a racist. Don't listen to him.\"\n\n\n\n\n\nBavas stood his ground, taking Katter to task about the confrontation.\n\n\n\n\n\n\"I don't think it's fair to threaten journalists with a fist before they've even finished the question — I think it's quite offensive to threaten a journalist,\" he replied.\n\n\n\nBehaviour 'not what's expected' of politicians, Albanese says\n\nOn Friday, Albanese criticised Katter's interaction with the journalist.\n\n\n\n\n\n\"Bob Katter, I like, but Bob Katter needs to have a look at that footage,\" the prime minister told Nine's Today show.\n\n\n\n\n\n\"Have a look at himself, frankly, and recognise that that’s just not what we expect of any Australian, let alone someone who's in public office.\n\n\n\n\n\n\"You're speaking to someone called Albanese. We've got a Senate leader called [Penny] Wong. Migration enriches.\n\n\n\n\n\n\"Except for the First Australians, we're all either migrants or descendants of them.\"\n\n\n\n\n\nFederal health minister Mark Butler similarly said that both Katter's threat and the physical approach of Bavas were \"completely unacceptable\".\n\n\n\nFederal MP Bob Katter approached Nine News reporter Josh Bavas with a raised fist when the reporter tried to ask what he thought about migrants who arrived in Australia with \"good values\". Source: AAP / Fraser Barton Liberal senator Jane Hume said there \"must be consequences\" for Katter's actions.\n\n\n\n\n\n\"You should always be able to feel safe and respected at work, journalists and politicians, the idea of threatening violence is entirely unacceptable,\" Hume told Seven's Sunrise program.\n\n\n\n\n\nNationals leader David Littleproud also weighed in, saying that Katter's behaviour was not \"becoming\", no matter \"who you are or how iconic you think you are\".\n\n\n\n\n\n\" I get questions that I don't like to answer. But when you put yourself into the public sphere and you have that privilege of sitting in that great building of parliament facing the most sacred building, you've got to live up to your responsibility,\" he told ABC radio.\n\n\n\n\n\n\"And I don't think that sort of behaviour is appropriate for a federal member of parliament.\"\n\n\n\nKatter to be 'front and centre' at March for Australia rally\n\nThe MP for the Queensland seat of Kennedy had earlier claimed at the Katter's Australian Party press conference that he would be \"front and centre\" at the rally in Brisbane on Sunday.\n\n\n\n\n\nThe rallies have sparked safety fears for multi-cultural communities amid fears they may be targeted.\n\n\n\n\n\nThe rally in Brisbane will be held on the final weekend of the state's Multicultural Month.\n\n\n\nLISTEN TO March For Australia condemned as 'undermining social cohesion' SBS News 05:10 English\n\nKatter claimed migrants who mostly move to Melbourne and Sydney were not embracing Australian culture.\n\n\n\n\n\n\"I don't care whether you're born here or not, if you have anti-Australian sentiments then get the hell out of my country,\" he said.\n\n\n\n\n\nMarch for Australia anti-migration rallies are set to be held across the country, seeking to \"stand for the people, culture, and nation that built Australia.\"\n\n\n\n\n\nOrganisers have been linked with white nationalist ideas but they have distanced themselves from far-right groups.\n\n\n\nNine Network, Katter demand apology\n\nBavas later said he was trying to ask about the value migrant Australian families \"including the Katters and my own\" bring to the nation before he was cut off.\n\n\n\n\n\n\"In my near 20 years in journalism I've never experienced that kind of reaction from an elected representative,\" he said in a joint statement.\n\n\n\nNine Network stood by Bavas, demanding Katter apologise for his \"unacceptable\" behaviour.\n\n\n\n\n\n\"His baseless and offensive accusation of racism is an irresponsible attempt to shut down a legitimate line of questioning,\" Nine Network's Fiona Dear said in the statement.\n\n\n\n\n\nKatter also demanded an apology, publishing a Facebook post later in the day in which he said: \"To be seen as anything other than Australian is highly insulting to me.\"\n\n\n\n",
    "source": "SBS",
    "cluster_id": 26
  },
  {
    "url": "https://www.sbs.com.au/news/article/new-possibilites-qantas-posts-1-6-billion-profit-as-ceo-touts-expanded-asia-routes/ep5uojau9",
    "title": "'New possibilities': Qantas posts $1.6 billion profit as CEO touts expanded Asia routes",
    "publish_date": "Thu, 28 Aug 2025 01:33:14 +0000",
    "category": "finance",
    "authors": [],
    "text": "Qantas has ordered another 20 Airbus A321XLR jets after making $1.6 billion in full-year profit, up 28 per cent from a year ago.\n\n\n\n\n\nThe airline posted a bottom-line net profit of $1.6 billion in the last financial year, up 28.3 per cent from a year ago.\n\n\n\n\n\nIts underlying pre-tax profit rose 15 per cent to $2.4 billion.\n\n\n\n\n\nRevenue grew 8.6 per cent to $23.8 billion, thanks to growth in its international operations and strong demand for domestic business and leisure travel.\n\n\n\nThe airline will order another 20 Airbus A321XLR aircraft which will start arriving in 2028, taking its total order for the next-generation planes to 48 aircraft.\n\n\n\n\n\nThe jets have a range of 8,700km, around 3,000km more than the Boeing 737 it replaces, and will allow Qantas to launch flights to destinations across Southeast Asia and the Pacific islands that aren't currently viable.\n\n\n\n\n\n\"Not only will the A321XLRs help us serve the corporate market travelling between Perth and the east coast of Australia, they will also allow us to expand flying on existing routes into South East Asia and open up new possibilities like Perth-India and Adelaide-Singapore,\" Qantas CEO Vanessa Hudson said.\n\n\n\nQantas' first two A321XLRs, configured for domestic and short-haul international trips, are expected to begin flying in mid-September on the Sydney-Melbourne and Sydney-Perth routes.\n\n\n\n\n\n\"Investing in new aircraft is one of the most significant ways that we can provide our customers with a better flying experience, and these billion-dollar investments are possible because of our continued strong financial performance,\" Hudson said.\n\n\n\n\n\nQantas will pay investors a final dividend of 16.5 cent per share as well as a special dividend of 9.9 cents per share.\n\n\n\n\n\nEarlier this month, Qantas was ordered to pay a $90 million penalty for what was has been dubbed the largest case of illegal sackings in the country's history.\n\n\n\n\n\nQantas outsourced more than 1,800 baggage handlers, cleaners and ground staff in 2020, in a move the Federal Court ruled was designed to curb union bargaining power in wage negotiations\n\n\n\n",
    "source": "SBS",
    "cluster_id": 35
  },
  {
    "url": "https://www.theage.com.au/national/outback-wrangler-matt-wright-awaiting-verdict-after-weeks-long-trial-20250829-p5mqwu.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Outback Wrangler Matt Wright awaiting verdict after weeks-long trial",
    "publish_date": "Fri, 29 Aug 2025 11:56:01 +1000",
    "category": "finance",
    "authors": [],
    "text": "Outback Wrangler Matt Wright awaiting verdict after weeks-long trial\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 36
  },
  {
    "url": "https://www.theage.com.au/sport/soccer/predictions-the-premier-league-match-week-3-you-pick-the-winners-20250829-p5mqsk.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Predictions: The Premier League Match Week 3 - you pick the winners",
    "publish_date": "Fri, 29 Aug 2025 11:54:46 +1000",
    "category": "sports",
    "authors": [
      "Emma Kemp"
    ],
    "text": "You might have noticed that the second weekend of the season delivered new narratives for tipping consideration. Manchester City, last week deemed in title contention thanks to their season-opening win over Wolves, are now apparently back out of the title race after being shown up by Tottenham. By the end of the third round, however, Pep Guardiola might be back in with a shot if he can oversee a rebound win at Brighton.\n\nBut the weekend’s main drawcard is Arsenal’s trip to Liverpool for a high-profile meeting between last season’s runners-up and champions, and also two sides on a maximum of six points. Eberechi Eze is set to make his Gunners debut, while Reds striker Hugo Ekitike is looking to add to his record of three goals from three games across all competitions for his new club.\n\nSpurs, the only other team with two from two, is also yet to concede a single goal under Thomas Frank, and Ange Postecoglou’s replacement will try to keep it that way when hosting a spirited Bournemouth outfit who have already pushed Liverpool to the brink and beaten Wolves.\n\nIn the crisis department, Manchester United welcomes Burnley three days after the embarrassing Carabao Cup exit to fourth-tier Grimsby Town, which has left manager Ruben Amorim on the brink.",
    "source": "TheAge",
    "cluster_id": 17
  },
  {
    "url": "https://www.theage.com.au/sport/tennis/us-open-live-updates-alexei-popyrin-takes-on-world-no-1-jannik-sinner-20250828-p5mqow.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "US Open LIVE updates: Demon up a set despite early struggles as Kasatkina sets up Osaka clash",
    "publish_date": "Fri, 29 Aug 2025 11:50:50 +1000",
    "category": "sports",
    "authors": [
      "Marc Mcgowan"
    ],
    "text": "De Minaur has emphatically grabbed back the break, racing through Mochizuki’s service game without dropping a point before holding to love to push 3-2 ahead.\n\nMochizuki’s energy appears to have dipped a bit in the past 10 minutes, so de Minaur will try to capitalise here and hopefully go two sets up. This has been a tricky day at the office, but it’s further evidence of how reliable de Minaur has become, even when opponents throw the kitchen sink at him.\n\nAs much as de Minaur won’t be afraid to take the court against him, he would love to see Germany’s Daniel Altmaier upset potential third-round opponent Stefanos Tsitsipas.",
    "source": "TheAge",
    "cluster_id": 18
  },
  {
    "url": "https://www.theage.com.au/business/companies/virgin-s-discipline-pays-off-as-full-year-earnings-climb-20250828-p5mqqh.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "‘Seat densification’: Virgin’s discipline pays off as full-year earnings climb",
    "publish_date": "Fri, 29 Aug 2025 11:45:04 +1000",
    "category": "finance",
    "authors": [
      "Chris Zappone"
    ],
    "text": "Chief financial officer Race Strauss said: “Importantly, all key financial metrics included in the prospectus were met or exceeded.” Virgin is standardising - and making more dense - its seating. The company’s transformation program aims to enhance revenue through more offerings, cutting costs through improved productivity, and driving deeper loyalty to Virgin’s Velocity program. The cost of the IPO and Qatar Airways “wet lease” transaction were $115.9 million. The deal gives Virgin access to Qatar’s international longhaul network, without the cost of maintaining the fleet. The company’s transformation program is expected to generate $400 million in benefits in 2026 and more for the next few years “and beyond”.\n\n“We’re in a high inflationary environment in aviation and so we need to be not just offsetting [the inflation] but getting beyond it,” Emerson said. Seat densification Strauss said: “We’ve still got a lot of the fleet density opportunities, putting the additional aircraft in the fleet, we’re only a little more halfway on that.” Additionally, Virgin Australia Regional Airlines is being simplified and more technology benefits are coming. “There’s a long pipeline still to come,” Stauss said.\n\nPart of the transformation involves a seat densification program. CEO Virgin Australia Dave Emerson. Credit: Edwina Pickles Emerson said adding more seats to the aircraft “really benefits the customer because... Sometimes today we show up in the plane has a few more or few fewer seats than we had planned and that’s not great for the customer experience.” “So we’re setting it up now so each plane is set up with exactly the same configuration and for some of the planes that needs an extra row of seats, but not all of them.” Other revenue streams are strong too. Velocity contributed $450 million, up from $409 million and added 900,000 new members.\n\nLoading “The Qatar deal has really helped our Velocity program and created a very positive dynamic for customers,” said Emerson, who noted that on a profit and loss basis “it hasn’t really affected us positively or negatively”. Atlas Funds chief investment officer Hugh Dive said Virgin’s results had to be read in parallel with Qantas’ to get a reading of where the company stood. While Virgin had smaller capital expenditure than Qantas which is refreshing its fleet, overall the airlines were tracking in a similar direction. Virgin’s load factor – a measure of the used seat capacity, or the fullness of a flight – is at 84.9 per cent compared to Qantas domestic at 78.1 per cent.\n\n“Virgin’s load factor is a lot higher than Qantas domestic – but both are pretty good,” said Dive. Jetstar domestic meanwhile is at 89.5, which helps explain its contribution to Qantas. Revenue rose as well to $5.8 billion in 2025 from $5.63 billion in 2024, a growth of 3.1 per cent. Virgin made a successful return to the sharemarket in June, valued at $2.3 billion, after selling $685 million worth of stock to fund managers and retail investors at $2.90 a share. Virgin was delisted from the ASX in 2020 amid mounting debts and losses. Having entered administration, it was bought by US-based Bain Capital, the private equity firm Emerson worked for before joining Virgin’s management in 2021.",
    "source": "TheAge",
    "cluster_id": 19
  },
  {
    "url": "https://www.theage.com.au/property/news/sydney-pub-baron-who-is-1-8-billion-in-debt-lists-rose-bay-home-for-sale-20250826-p5mpxg.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Sydney pub baron who is $1.8 billion in debt lists Rose Bay home for sale",
    "publish_date": "Fri, 29 Aug 2025 11:45:00 +1000",
    "category": "finance",
    "authors": [
      "Tawar Razaghi"
    ],
    "text": "The Rose Bay home of embattled hospitality entrepreneur Jon Adgemis has hit the market amid the spectre of a potential bankruptcy fraud investigation.\n\nWhile there is no price guide on the mortgagee in possession, the six bedroom, five-bathroom house was purchased by the Public Hospitality Group founder and his mother, Rose, for $4.45 million in 2018.\n\nThe Rose Bay home of Jon Adgemis and his mother Rose has hit the market. Credit:\n\nSet on 556 square metres, the home has a long list of caveats lodged against the property including the chief commissioner of state revenue, who is chasing unpaid land tax to the tune of $255,796 for the state’s coffers, and an alcohol supplier that is owed a little over $1 million for unpaid booze supplied to his venues.\n\nJon’s debts have ballooned to more than $1.8 billion, owing money to a suite of creditors and the tax office.",
    "source": "TheAge",
    "cluster_id": 20
  },
  {
    "url": "https://www.theage.com.au/sport/athletics/records-and-roads-closures-everything-you-need-to-know-about-the-sydney-marathon-20250825-p5mpn9.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Records and roads closures: Everything you need to know about the Sydney Marathon",
    "publish_date": "Fri, 29 Aug 2025 11:43:39 +1000",
    "category": "sports",
    "authors": [
      "Frances Howe"
    ],
    "text": "Loading Although it will take the best athletes more than two hours to finish the race, you shouldn’t be fooled. The best will be running very fast. Crazy fast. The men’s race is expected to be won in around 2 hours and 5 minutes (2:05). To run that time, athletes will have to complete every kilometre in just under three minutes. That works out at 72 seconds for every 400m, or 18 seconds for every 100m. How fast is that? The best way to understand that pace (for mere mortals who know the struggle of a treadmill) is to do this: go to your treadmill and turn the speed up to 20 (km/h). See if you can last 30 seconds. The world’s fastest men’s marathoners can set it to 20 km/hr and run for two hours. The world’s best women do it on 19 km/hr.\n\nRoughly speaking, a three-hour marathon equates to running at 14 km/hr on the treadmill. The course The Sydney Marathon was first opened to the public in 2001 as a way for your average Joes to get a chance to complete the course that the best athletes in the world had run at the 2000 Olympics. It’s changed in the years since, but will still feature some of the original course, including its most appealing features. Highlights will include running across the Harbour Bridge, the gruelling final uphill lap to Mrs Macquarie’s Chair, and a finish in front of the Opera House. The result: this marathon will have the most elevation of any of the majors, a fact which is sure to test even the best, as Hassan herself said on Thursday that she was “not good at hills”.\n\nHow to watch There are several key spots for spectators to watch the marathon this year. Those who want to see the gun go off at the start line should aim to be at Miller St in North Sydney by 6:15am. Other key viewing areas are Barangaroo (from 6:30am), Martin Place (from 6:40am), Randwick (from 7:30am), and Moore Park (from 7:55am). There will be several fan sites along the course, complete with DJs, face painters, and even Drag Queens watching on when the race passes through Taylor Square. The first runners are expected to cross the finish line from 8:30am, with the last of the finishers expected at around 3:15pm. Workenesh Edesa Gurmesa winning the 2024 race.",
    "source": "TheAge",
    "cluster_id": 21
  },
  {
    "url": "https://www.theage.com.au/sport/nrl/reece-walsh-is-more-than-just-a-pretty-face-20250828-p5mqjx.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Reece Walsh is more than just a pretty face",
    "publish_date": "Fri, 29 Aug 2025 11:40:00 +1000",
    "category": "sports",
    "authors": [
      "Adrian Proszenko"
    ],
    "text": "Save Log in , register or subscribe to save articles for later. Save articles for later Add articles to your saved list and come back to them any time. Got it Normal text size Larger text size Very large text size To the untrained eye, Reece Walsh looks like he’s making it up as he goes along. A flick pass here, a goose step there. Maybe a short-side raid or a chip-and-chase, as likely to come out on the first tackle as the last. How can opposition defences know what’s coming because the flying fullback seemingly doesn’t know himself? But this is where the rugby league world has got it all wrong. The greatest dummy Walsh has ever sold is the notion that he’s doing it all off the top of his head. That the audacious plays that make highlight reels when they come off - and give Brisbane coach Michael Maguire a coronary when they don’t - are the result of unscripted, ad-lib football. Nothing is further from the truth. “The way I play, people think it’s off the cuff and it’s just luck, but the hours spent in the video room, watching teams, watching how they defend, their habits and tendencies, my brain doesn’t stop,” Walsh says. “The way I play, people enjoy watching it, but it’s [about] the things they don’t see; the hours that I put in on the [training] field, even with ‘Madge’ [Maguire], going over plays, picking his brain about things.\n\nAdvertisement\n\n“I’m very passionate about my footy. I want to try to be the best player I can be and it’s something I pride myself on, working hard and spending those hours on the training paddock when there’s no one around watching.” Sit down with Maguire, and he’ll describe Walsh as a student of the game. Whether it’s spending countless hours on the training track or forever studying video footage off it, the fullback’s workday is longer than most. It prompts the question; is the most flashy, flamboyant star in the game a footy nerd? “You tell me,” Walsh laughs. “If you’re watching every single game every week, watching my games back, is that a footy nerd? Reece Walsh leaves defenders in his wake. Credit: Getty Images “I don’t really think that’s being a footy nerd, that just comes with it. I don’t know, it’s not a one mould fits all. It’s just what I enjoy doing, trying to be the best I can for myself. “If that’s watching a bit more video, working on a few more things. I’m not the only guy who does it. There’s a lot of guys in our squad that work extremely hard on their craft to be the best.”\n\nAdvertisement\n\nThe greatest fullback of the modern era, Billy Slater, was given simple riding instructions from Melbourne coach Craig Bellamy. Slater was given the freedom to express himself however he liked on the football field, but only if he first perfected the play at training. It’s a similar relationship between Walsh and Maguire. “100 per cent. If I haven’t got something right, if I haven’t trained it, that’s when he is disappointed,” Walsh says. “He does say a lot about putting those hours and extras in. Even after our trainings are done, we practice things and it comes out in the games. “The time spent practising stuff, you might not get it within the first 10 goes or whatever it is, but when you do things right that you’ve practiced, it’s enjoyable. Madge has been awesome.” Brisbane coach Michael Maguire. Credit: Zak Simmonds The relationship between Walsh and Maguire is less than a season old, although Maguire would have liked it to have commenced earlier. Walsh has New Zealand heritage and Maguire attempted to get him to pledge his allegiance to the Kiwis when he was coaching the national team. “He did, that was my first year, in 2021, he asked me to be part of the Kiwis,” Walsh says.\n\nAdvertisement\n\n“I declined it, with all due respect. I love Queensland and Australia. That’s not to say that I don’t love the Kiwi side of me, but I grew up here and that’s what I want to represent … I will always put my hand up to represent Australia. “To be able to put my last name on one of them jerseys, I would be doing my family proud.” There are few opportunities to escape from football, or the public view, when you’re the shiniest star in rugby league. The Broncos No.1 has 540,000 Instagram followers, more than every single NRL club, save for his own. Christened as the “Justin Bieber of rugby league”, by ARL Commission chairman Peter V’landys, he is one of the biggest stars in Australian sport. There was a brief respite, of sorts, from public life on Wednesday when Walsh was unveiled as the ambassador of AUSX Supercross in Redcliffe. It was a chance for the Maroons star to take his four-year-old daughter, Leila, to a promo event at Kayo Stadium. Reece Walsh celebrates with his daughter Leila after a match in 2023. Credit: Getty Asked should Maguire be concerned about the prospect of his star player on a motorbike, Walsh quips: “If he saw me ride, I don’t think he’d be too worried, I’m elite. “I take my footy very seriously, that’s always going to be the number one priority. Having a daughter, that gets you away from footy.\n\nAdvertisement\n\n“Every single day you come home and she’s got a smile on her face. Being able to experience these moments with her, it’s what pulls me back to feeling like a kid again. “I remember getting hand-me-down pants and boots from my brother to ride his motorbike. To be sitting here and kitted out on a motorbike with my daughter is pretty special … “To show her what hard work gets, to not let anyone put you down or say things, to persist through that and put one foot in front of the other. I want to be the best role model that I can for her. “Obviously I slip up here and there, but I try to keep working hard and putting one foot in front of the other, then I’m doing a decent job.” Whenever Walsh steps out in public, particularly in Queensland, he is mobbed. Everyone either wants a piece of him or has an opinion. Take last weekend, for instance. After a stellar performance, the only thing anyone wanted to talk about was his decision to selflessly gift Kobe Hetherington a try in the forward’s milestone game. Perhaps it’s one of the reasons why Walsh grants few interview requests, instead opting to give fans a glimpse into his private life through his own YouTube channel. “It’s what comes with it,” says Walsh of life in the NRL fishbowl.\n\nAdvertisement",
    "source": "TheAge",
    "cluster_id": 22
  },
  {
    "url": "https://www.theage.com.au/national/queensland/brisbane-news-live-brisbane-nation-s-third-youngest-capital-leaders-condemn-anti-immigration-rally-20250828-p5mqjf.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Brisbane news live: Newman-era deputy premier lands second government board job | Minister hails breakthrough in nurse pay talks | Things to do in Brisbane this weekend",
    "publish_date": "Fri, 29 Aug 2025 11:37:33 +1000",
    "category": "finance",
    "authors": [],
    "text": "Casino operator Star Entertainment was forced to report an unaudited $471.5 million loss on Friday for the 2025 financial year with its auditors expected to take another month to work through the many financial uncertainties over its future before signing off on its accounts.\n\n“Our announcement today highlights a number of key interdependencies that are critical to the Group’s future,” chief executive Steve McCann said.\n\n“The Group continues to require significant support from a range of its stakeholders including governments, regulators, lenders and investors. Without that support it will be difficult to navigate the various challenges facing the Group and to create a sustainable future for the business.\n\n“The Group has sourced additional funding to enable The Star to continue to provide thousands of jobs and support tourism and entertainment in the markets in which we operate.”\n\nLoading\n\nThe loss included significant items of $212 million relating to the writedown of the value of its Brisbane casino, which is being sold to its consortium partners, redundancy costs, heightened regulatory costs and fines as well as raised funding costs due to the precariousness of its financial position.\n\nGroup revenue and earnings declined despite $100 million of cost cuts last year, and the group flagged that more cuts are planned for this year.\n\nStar said the declining performance reflected new regulatory burdens like carded play and cash limits and the fact that it is losing market share to gambling rivals.\n\nStar said trading activity stabilised towards the end of June “although at depressed levels”. Cash levels were $234 million as of June 30 but declined to $189 million this week.\n\nStar said there remained material uncertainty regarding the group’s ability to continue as a going concern citing factors like the impending money laundering fine from AUSTRAC, continuing negotiations with lenders, and the group’s attempts to regain its casino licences.",
    "source": "TheAge",
    "cluster_id": 23
  },
  {
    "url": "https://www.theage.com.au/national/australia-news-live-russian-drone-barrage-kills-19-iranian-ambassador-leaves-australia-following-albanese-s-expulsion-20250829-p5mqsd.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Australia news LIVE: Albanese’s net zero policy booed at bush summit; Katter urged to apologise after journalist outburst",
    "publish_date": "Fri, 29 Aug 2025 11:30:29 +1000",
    "category": "finance",
    "authors": [
      "Daniel Lo Surdo"
    ],
    "text": "Demand for homewares and lifestyle goods, mobiles, computers and other AI-powered devices helped drive Harvey Norman’s overall network sales by 5.5 per cent to $9.35 billion and lifted profits after tax by 47 per cent to $518 million.\n\nEasing cost-of-living pressures helped drive a particularly strong second half, with more Australians renovating their homes and replacing their household goods. The white goods and furniture retailer’s franchises grew profits by 25.9 per cent to $344.4 million, driven by a 6.1 per cent rise in revenue to $6.43 billion. Margins rose from 4.5 per cent last year to 5.4 per cent.\n\nHarvey Norman’s profits lifted after tax by 47 per cent to $518 million. Credit: Scott Barbour\n\n“Franchisees continue to strengthen their position in the fast-growing AI PC market, capitalising on rising consumer demand for smart, AI-enabled technologies” the company stated in ASX documents.\n\n“With residential construction and home improvement activity increasing, franchisees are well-positioned to benefit from sustained demand across its Furniture & Bedding categories.”\n\nInvestors have cheered the strong figures, sending the retailer’s share price 9.7 per cent higher this morning.\n\nHarvey Norman’s overseas business – it operates 270 overseas stores in seven countries across Asia, Europe, Ireland and Northern Ireland – reported a 4.9 per cent rise to $2.76 billion, a figure accompanied by a 5.5 per cent increase in expenses to $2.65 billion. Profit before tax of its overseas business declined 7.2 per cent to $110 million.\n\nThe retailer expanded into the UK in October last year, opening up a new store in the West Midlands region. Two new stores were opened in New Zealand, four in Malaysia, and one in Singapore.",
    "source": "TheAge",
    "cluster_id": 24
  },
  {
    "url": "https://www.theage.com.au/national/they-want-to-silence-the-anu-s-music-school-this-is-tone-deaf-vandalism-20250826-p5mq1j.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "They want to silence the ANU’s music school. This is tone-deaf vandalism",
    "publish_date": "Fri, 29 Aug 2025 11:30:00 +1000",
    "category": "entertainment",
    "authors": [
      "Richard Tognetti"
    ],
    "text": "Rock drummers, jazz singers. Children with fiddles. Physicists with cellos. Law students from Hong Kong at the piano. Clarinettists from Queanbeyan. Punks from Rockhampton.\n\nFrom within the Australian National University’s School of Music and beyond, all demand to know: why slash and burn this great national educational and cultural institution? How can you justify discounting the worth of the students, without whom you wouldn’t exist?\n\nStudents at the ANU who have launched a campaign against proposed cuts to the School of Music. Credit: Alex Ellinghausen\n\nUnder the changes, the ANU’s School of Music would be relegated to “program” status and absorbed into a new School of Creative and Cultural Practice, with a revised bachelor of music to replace the traditional one-to-one instrument model.\n\nExplanations so far are no more than a smokescreen: the rhetoric of “future-proofing” and “integration” hide the truth of what’s being done here. The decision-makers seem deaf to the students’ voices which are resonating in halls, classrooms, rehearsal rooms, and stages across the nation and the globe.",
    "source": "TheAge",
    "cluster_id": 25
  },
  {
    "url": "https://www.theage.com.au/politics/federal/bob-katter-s-son-defends-his-father-as-pm-condemns-journalist-threat-20250829-p5mqt7.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Bob Katter’s son defends his father as PM condemns journalist threat",
    "publish_date": "Fri, 29 Aug 2025 11:27:35 +1000",
    "category": "finance",
    "authors": [
      "Nick Newling"
    ],
    "text": "Prime Minister Anthony Albanese has condemned Bob Katter’s threatening of a journalist at a Brisbane press conference on Thursday, as Katter’s son backs in his father, saying journalists should expect aggression in response to personal questions from the long-term MP.\n\nAlbanese joined a cavalcade of MPs from across the political spectrum calling for Katter to apologise to Brisbane journalist Josh Bavas – the target of the outburst. Katter has refused to apologise, with his son saying it is difficult to understand how Bavas could have been intimidated by an 80-year-old.\n\n“Bob Katter needs to have a look at that footage. Have a look at himself, frankly, and recognise that that’s not what we expect of any Australian, let alone someone who’s in public office,” Anthony Albanese told Channel Nine’s Today on Friday morning.\n\nKatter and Queensland state party MPs were speaking in support of this weekend’s anti-migration March for Australia rallies during a Thursday press conference when Bavas, a Channel Nine reporter, asked Katter about his Lebanese heritage, triggering the response.",
    "source": "TheAge",
    "cluster_id": 26
  },
  {
    "url": "https://www.theage.com.au/national/audience-heckle-albanese-at-bush-summit-20250829-p5mqwb.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Audience heckle Albanese at Bush Summit",
    "publish_date": "Fri, 29 Aug 2025 11:27:21 +1000",
    "category": "finance",
    "authors": [],
    "text": "Audience heckle Albanese at Bush Summit\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 27
  },
  {
    "url": "https://www.theage.com.au/sport/tennis/popyrin-puts-sinner-loss-into-perspective-20250829-p5mqw9.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Popyrin puts Sinner loss into perspective",
    "publish_date": "Fri, 29 Aug 2025 11:25:30 +1000",
    "category": "finance",
    "authors": [],
    "text": "Popyrin puts Sinner loss into perspective\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 28
  },
  {
    "url": "https://www.theage.com.au/sport/tennis/swiatek-baffled-by-odd-presser-20250829-p5mqw5.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Swiatek baffled by odd presser",
    "publish_date": "Fri, 29 Aug 2025 11:20:22 +1000",
    "category": "finance",
    "authors": [],
    "text": "Swiatek baffled by odd presser\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 29
  },
  {
    "url": "https://www.theage.com.au/sport/tennis/2nd-round-highlights-daria-kasatkina-vs-kamilla-rakhimova-20250829-p5mqvy.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "2nd Round Highlights | Daria Kasatkina vs Kamilla Rakhimova",
    "publish_date": "Fri, 29 Aug 2025 11:16:37 +1000",
    "category": "sports",
    "authors": [],
    "text": "2nd Round Highlights | Daria Kasatkina vs Kamilla Rakhimova\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 30
  },
  {
    "url": "https://au.news.yahoo.com/five-wait-iconic-pool-opening-012710685.html",
    "title": "Five year wait as iconic pool’s opening delayed again",
    "publish_date": "2025-08-29T01:32:32Z",
    "category": "finance",
    "authors": [
      "Summer Liu"
    ],
    "text": "Another Christmas will come and go with the North Sydney Olympic Pool out of commission until early 2026, nearly five years since the two year project began.\n\nThe site is to be handed back on 18 November 2025, but it will take another two to three months to ‘commission and operationalise’ the pool before it can open to the public, North Sydney Council confirmed at a council meeting on Monday.\n\nThe pool could soon blow out of budget, with the Council’s contractor Icon submitting 26 variation claims since the last report to Council – launching the number of total claims to 541, with 116 under assessment currently.\n\nBrewster Hjorth Architects renders of the North Sydney Olympic Pool redevelopment. Photo: Courtesy of Brewster Hjorth Architects\n\n13 variations totalling $22,700 have been agreed since the last report to council, with $92.28 million being the revised construction contract sum, currently under the forecasted completion cost of $122 million, but more is yet to come.\n\nADVERTISEMENT\n\nIt was noted that the forecast was provided in February 2024 with an anticipated completion date for December of 2024, but now there are a “significant number of variations … which will place further pressure on the allocated budget for this project,” according to Council documents.\n\nDocuments reveal that $22,237.49 has been approved for 50m scoreboard audio integration, and $5,358.88 for pool hall clock power provisions.\n\nThe roof has been a highly contentious aspect of the redevelopment. Photo: Courtesy of Brewster Hjorth Architects\n\nCouncillors agreed that reports and attachments should be confidential, given the scale and importance of the project to the community but one member of the community called for transparency.\n\n“I am concerned that again we have an item that is being held in. closed session,” local Davie Macdonald said.\n\n“As a person that was engaged from the very beginning of the first consultations on the swimming pool, I … fail to understand why now a project update should necessarily be closed to public knowledge.\n\nADVERTISEMENT\n\n“At the last election, councillors, especially the … independents and the Labor councillors … came with a policy of transparency and openness. I would really like to know more information.”\n\nNorth Sydney pool is to face further delays. Photo: Destination NSW\n\nThe redevelopment has triggered a series of lawsuits, with North Sydney Council suing Brewster Hjorth Architects for a breach of contract as the roof design process caused significant delays.\n\nIcon is suing the council for $28 million in damages, due to the delays the design changes of the roof structure caused.\n\nThe Mayor said North Sydney Council does value transparency, but it is necessary to keep the meeting closed due to legal reasons.\n\n“Like other councils on major projects, there is legal professional privilege and commercial in confidence, at the very end of the project and the end of the litigation I know that this council will release everything.”",
    "source": "Yahoo",
    "cluster_id": 37
  }
]