[
    {
        "url": "https://www.9news.com.au/national/health-insurance-costs-secret-reset-adding-hundreds-to-aussie-family-bills/3cf5fdb3-f5cf-4730-af76-3a63080b9503",
        "title": "Aussie families face $200 hike on critical health insurance policies",
        "publish_date": "Mon, 17 Nov 2025 01:46:22 +0000",
        "category": "finance",
        "authors": [
            "Nov"
        ],
        "text": "Aussie families face being slugged around $200 more a year as ﻿private health insurance premiums are hiked.\n\nNew analysis shows next year's private health insurance premium increase could sit between 3.9 and 4.4 per cent.\n\nMoney.com.au says although premium increases have sat below health inflation since 2021, the gap has been steadily closing.\n\nAussie families face being slugged around $200 more more a year as ﻿private health insurance premiums are hiked. (Getty)\n\nIf health inflation stays near the four per cent mark this year, the 2026 premium hike could fall in line with, or even increase more than health price inflation.\n\nThat kind of premium rise would see singles on a combined hospital and extras policy pay an extra $127–$144 a year, while families would face another $191–$216 annually.\n\nThese estimates are based on the average combined single policy costing $3,264 a year and the average combined family policy costing $4,908 a year.\n\nMoney.com.au's General Manager of Health Insurance, Chris Whitelaw, says the return of bigger premium increases will be felt by millions.\n\n\"What we're seeing is a reset. Premium increases stayed unusually low for years, and 2026 may be the year they return to a more 'normal', but still painful, growth cycle,\" Whitelaw said.\n\n\"There's no doubt that a premium increase of around four per cent would be a shock for many policyholders, especially after a few years of softer rises.\"\n\nHandful of Australian cast including 100 50 20 dollars MONEY CASH (Getty Images/iStockphoto)\n\nHe said many Aussies will downgrade or even cancel their insurance.\n\nHe advised Aussies to check their policy and shop around.﻿\n\nMoney.com.au said last week health funds submitted their proposed 2026 premium changes to Federal Health Minister Mark Butler for review\n\nThe Minister has the final say on the industry-average premium increase, which is announced ahead of the 1 April adjustment each year.\n\nWhile the government approves a single industry-wide average, individual insurers can apply higher or lower increases, meaning some Australians may see rises well above the headline figure, while others may face smaller adjustments.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/world/china-warns-citizens-against-japan-travel/90c4695c-bf7a-4004-b844-c996c0a68404",
        "title": "New Japanese prime minister's comments spark row with China, travel ban",
        "publish_date": "Mon, 17 Nov 2025 01:43:05 +0000",
        "category": "finance",
        "authors": [
            "Nov"
        ],
        "text": "Japan has raised objections after China advised its citizens to avoid visiting Japan, as a feud over the new Japanese leader's remarks on Taiwan showed no signs of dying down.\n\nThe government in Tokyo lodged a protest last Saturday and its top spokesperson, Chief Cabinet Secretary Minoru Kihara, urged China to take \"appropriate measures,\" Japan's Kyodo News Service reported.\n\nChina advised its citizens last Friday to refrain from travelling to Japan in the near future. It cited earlier attacks against Chinese in Japan and what it called Prime Minister Sanae Takaichi 's \"erroneous remarks\" on Taiwan, which it said undermined the atmosphere for China-Japan exchange.\n\nChinese President Xi Jinping, right, shakes hands with Japanese Prime Minister Sanae Takaichi when they met on the sidelines of an APEC summit in South Korea on October 31, 2025. (Kyodo News via AP) (AP)\n\nKihara told reporters that it is precisely because of the differences between the two governments that multilayered communication is essential, a Kyodo report said.\n\nChina has repeatedly recommended its nationals take security precautions when in Japan over the past year, but the latest announcement appeared to be stronger in advising against travel, according to notices posted on the website of its embassy in Tokyo.\n\nJapan is an immensely popular destination for Chinese tourists, providing a much-needed economic boost but also sparking an anti-China and anti-foreigner backlash from some.\n\nIt's unclear what impact the advisory will have on the willingness of Chinese to visit Japan, but several Chinese airlines offered no-penalty refunds on previously sold tickets to Japan following the government's announcement.\n\nThe dispute suggests that Japan's already fragile relations with China could turn rocky under Takaichi, who supports building up the military to counter potential threats from Beijing and its claims to contested territory in nearby waters in the western Pacific.\n\nThe Japanese capital Tokyo is a popular destination for tourists from China and Taiwan. (AP Photo/Hiro Komae) (AP)\n\nJapanese Prime Minister Sanae Takaichi, left, waves as US President Donald Trump speaks aboard the aircraft carrier the USS George Washington on October 28, 2025 in Yokosuka, Japan. Trump visited Japan before heading to South Korea for the APEC meetings. (Photo by Tomohiro Ohsumi/Getty Images) (Getty)\n\nTakaichi, who became prime minister last month, said in parliament that a Chinese attack on Taiwan could constitute \"an existential threat\" to Japan, requiring the use of force by its military.\n\nThe remark prompted strong objections from China, including a social media post from its consul general in Osaka last weekend saying \"we have no choice but to cut off that dirty neck that has been lunged at us.\"\n\nHis comment, which was later taken down, sparked a Japanese diplomatic protest that was followed by a back-and-forth that continued all week.\n\nChina claims Taiwan, a self-governing island off its coast, as its territory and has staged threatening military drills in the surrounding waters in recent years.\n\nNeither the US nor Japan has official diplomatic relations with Taiwan, but the US is the main supplier of defence equipment to the island's military and opposes resolution of the China-Taiwan situation by force.\n\nJapan is a military ally of the US and hosts American troops at several US bases on its territory, including a major navy base south of Tokyo.﻿",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/world/iran-turns-to-cloud-seeding-amid-historic-drought/b99222ed-1403-4da4-b795-5b496b738f06",
        "title": "Iran turns to cloud-seeding in bid to end worst drought in 50 years",
        "publish_date": "Mon, 17 Nov 2025 01:30:36 +0000",
        "category": "finance",
        "authors": [
            "Nov"
        ],
        "text": "To combat a severe water crisis, Iranian authorities have begun cloud-seeding operations to induce rainfall, Iran's state-run IRNA news agency reported on the weekend, amid the driest fall in half a century.\n\nIran's National Weather Forecasting Centre of the Meteorological Organisations said Saturday that rainfall across the country has decreased by about 89 per cent compared to the long-term average, making this the driest autumn Iran has experienced in the past 50 years.\n\nThe cloud-seeding operation was carried out \"by aircraft equipped with cloud seeding equipment\" in the Lake Urmia basin in the north-west of the country, IRNA said.\n\nThe receding waters of Latyan Dam reveal a dry riverbed near Tehran, Iran, on November 10. (Bahram/AFP/Getty Images via CNN)\n\nIt's a process used in Iran for years, in which chemicals are dispersed into clouds to stimulate the release of moisture as rain.\n\nThis comes as Iran experiences one of its worst droughts on record, and its fifth consecutive year of drought. Key reservoirs are shrinking as rainfall is at record lows, and authorities are scrambling to reduce water consumption, and residents are desperately trying to conserve it to stave off catastrophe.\n\nJust two decades ago, Lake Urmia was the Middle East's largest lake, and its local economy thrived with hotels and restaurants catering to tourists. Now, boats sit rusted and immobile on land that is rapidly turning into a salt plain.\n\nThe dried-up bed of Lake Urmia, Iran. (Getty)\n\nClimate change is making an already severe situation significantly worse.\n\nAn acute water crisis \"has even raised alarms about drinking-water supplies in major cities, including the capital Tehran,\" Iran's state-run Press TV said in a report on Sunday.\n\nMohammad Mehdi Javadian-Zadeh, the head of the National Cloud-Seeding Research Center, said these cloud-seeding operations will continue until mid-May \"whether by airplane or drone, and if suitable systems exist in the country,\" as cited by IRNA.\n\n\"Considering that our country is located in arid regions and the urgent need for renewable water resources, cloud seeding is only performed to increase precipitation in various catchment basins,\" Javadian-Zadeh added.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/contact-lense-recycling-opticians-glasses/d2d0e5a7-dfc7-4ed8-9985-620af885c6b1",
        "title": "Easy way to recycle plastic contact lense packets rolled out",
        "publish_date": "Mon, 17 Nov 2025 00:54:41 +0000",
        "category": "finance",
        "authors": [
            "Nov"
        ],
        "text": "Aussies who wear contact lenses can now easily recycle the plastic packaging.\n\nAlmost 700,000 Aussies wear either daily or monthly lenses, which come in packets made from plastic and foil.\n\nBut people are holding on to almost seven million contact packets, as well as 32 million pairs of old prescription glasses according to Specsavers.\n\nAlmost 700,000 Aussies wear either daily or monthly lenses, which come in packets made from plastic and foil. (Getty)\n\nWhen laid end to end this volume would stretch from Perth to Brisbane, posing a huge environmental challenge.\n\nThe optical chain has partnered with Opticycle to recycle contact lens packaging as well as glasses and sunglasses.\n\nAnother free ﻿recycling scheme, via TerraCycle and Bausch + Lomb ended in 2021, meaning recycling of contacts and packaging was impossible for most Aussies.\n\nAnother free ﻿recycling scheme, via TerraCycle and Bausch + Lomb ended in 2021, meaning recycling of contacts and packaging was impossible for most Aussies. (Getty)\n\nCathy Rennie Matos, Specsavers ANZ Head of Sustainability said: \"This initiative is a cornerstone of Specsavers' broader commitment to positive social and environmental impact.\n\n\"By making it easy to recycle old eyewear, we're helping people declutter their homes while protecting our planet. It's a win-win for the environment and for personal peace of mind.\"\n\nAround 680,000 Aussies wear contacts, according to 2009 research.\n\nAround two-thirds of Australians wear prescription glasses, according to a 2020 survey by Optometry Australia.\n\nThe rollout, which started in April in all Specsavers shops, comes amid various other crackdowns on plastic across Australia.\n\nPlastic bread tags are one of many items to be phased out in the next five years by the New South Wales Government. (Supplied)\n\nNSW announced ﻿several plastic products will be banned from next year, as well as the establishment of a reuse-only precinct in Sydney CBD in late 2027.\n\nPlastic bread ties will be phased out, as well as plastic bags with handles, plastic pizza savers, and even fruit and vegetable stickers.\n\nCondiments will also be required to use recycled packaging, meaning the state will also phase out the soy sauce fish bottle like South Australia did back in September .",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/frustrating-and-ridiculous-social-media-platforms-ban-photos-of-breast-cancer-survivor-tattoos/1d9a47bc-db6c-4390-8c4a-438c155c6983",
        "title": "Rachel helps breast cancer survivors, but she's not allowed to show her work",
        "publish_date": "Sun, 16 Nov 2025 18:30:51 +0000",
        "category": "finance",
        "authors": [
            "Nov"
        ],
        "text": "A Queensland cosmetic tattoo artist who helps breast cancer survivors says it is almost impossible to share photos and videos of her work on social media.\n\nRachel Cahn, who runs Tinted Love in Noosa, specialises in creating tattoo areolas for clients who have undergone mastectomies and no longer have nipples.\n\nBeing able to provide realistic-looking, 3D areola tattoos for cancer survivors was deeply meaningful, Cahn said.\n\nREAD MORE: ﻿ Dozens of schools to close over asbestos play sand fears\n\nCosmetic tattooist Rachel Cahn is calling for change from social media companies in dealing with images and videos of breast cancer survivors. (Tinted Love)\n\n\"This art is not just about aesthetics; it's often the final step in helping survivors to reclaim their bodies and restore their sense of hope and dignity,\" she said.\n\nAreola tattooing is a relatively new procedure available for breast cancer survivors and Cahn said she was therefore keen to let as many women as possible know about it.\n\nHowever, social media platforms such as Facebook, Instagram and TikTok were constantly banning her photos and videos due to them being flagged as showing nudity, Cahn said.\n\n\"Social media platforms can't distinguish the difference between nudity and art,\" she said.\n\n\"I can't post anything on TikTok, they don't really allow any of my work.\"\n\nLikewise, Cahn said photos she posted to Facebook showing areola tattoos were often banned, after which she needed to go through a time-consuming process to have them reinstated.\n\nRachel Cahn is seen tattooing an areola on a client. (Tinted Love)\n\nCahn said other restrictions had been placed on her accounts, such as Instagram banning her from posting live videos for 12 months and Facebook blocking her from inviting people to join her page.\n\nThe cosmetic tattooist said she also suspected her accounts had been \"shadow banned\".\n\n\"Shadow banning is where you don't come up in people's feeds,\" she explained.\n\n\"You're not on the 'explore' page. People try and type in your name, and it doesn't come up.\"\n\nThe actions of the social media giants appear to directly contradict their policies on allowing photos and videos of breast mastectomies for education and advocacy purposes.\n\n\"We agree that undergoing life-changing experience and that sharing photos can help raise awareness about breast cancer and support the men and women facing a diagnosis, undergoing treatment or living with the scars of cancer,\" Facebook says on its website.\n\n\"The vast majority of these kinds of photos are compliant with our policies.\"\n\nIt is understood that the automated processes used by social media platforms to detect nudity, including nipples, is unable to distinguish between﻿ real and tattoo areolas.\n\nNine.com.au reached out to Meta, the owner of Facebook and Instagram, for comment but did not receive a response before publication.\n\nA spokesperson for TikTok said the platform had worked with Cahl to reinstate two videos which were \"incorrectly moderated by our automated systems\".\n\n﻿\"TikTok's Community Guidelines do not allow nudity or body exposure, but we do allow some content that falls within our limited exception categories,\" the spokesperson said.\n\nCahn said she was exhausted by the process of trying to fight the social media companies simply to show her work.\n\n\"It is tiring, and I'm wanting women to know that I'm here and what I do, but it doesn't get seen by anyone, and I get all these bans and restrictions and flags,\" Cahn said.\n\n\"And it is so hypocritical because then you see all the hate speech and the violence on social media.\n\n\"Even Instagram says they don't allow photos of buttocks, and I'm just like, come on, that's an absolute joke, every second woman is in a string bikini.\"\n\nFrustrated, Cahn has started a Change.org petition calling for social media companies to reform the rules for cosmetic tattooists who work with cancer survivors.\n\n\"The guidelines need to be changed so that cosmetic tattooers can post these images, so that breast cancer survivors are aware that this service is available.\n\n\"I have a lot of women that actually come in here and they say that they didn't even know the service was available until I posted something in one of the Facebook groups.\"",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/play-sand-asbestos-recall-dozens-of-act-schools-to-close-in-response-to-recall/99eba3fb-be95-4e81-b321-3b66b3b8f602",
        "title": "School shutdown in ACT, SA over asbestos sand fears today",
        "publish_date": "Sun, 16 Nov 2025 19:26:36 +0000",
        "category": "finance",
        "authors": [
            "Nov"
        ],
        "text": "Schools will stay shut in the ACT and South Australia today amid the ongoing fallout to recalls of popular play sand that may contain asbestos products last week.\n\nThe sand has been found in dozens of schools in both jurisdictions.\n\nAfter the recalls widened to include products sold at Kmart and Target, ACT Education Minister Yvette Berry announced yesterday afternoon that most of the territory's schools would be closed today.\n\nKmart has recalled play sand over asbestos fears. (9News)\n\nLast night, the government said it had started auditing all public schools for the affected products, listing 71 that would be closed, with just 23 opening.\n\nThe announcement followed more closures on Friday.\n\nBerry said \"unfortunately, this could take days\" for asbestos contractors to \"test, remediate and clear the spaces for use again\".\n\nIn South Australia, 130 schools were reported to have the sand but it was still sealed in 88 of the education facilities, meaning loose sand was found at 20 schools.\n\nThe SA government said some classrooms would be closed today for cleaning but a list was not freely available. Parents were urged to watch for communication from their schools.\n\nNo schools were listed as closed in NSW, Victoria or Queensland.\n\nThe Australian Competition and Consumer Commission has issued three separate recalls for play and decorative sand in the past week, including a 14-piece sand castle building set and magic sand in blue, green and pink – all sold at Kmart and Target – at the weekend.\n\nKmart has issued a recall for the ﻿14-piece Sand Castle Building Set and tubs of magic sand which come in blue, green and pink. (Kmart)\n\n\"The products may cause a risk to health as asbestos has been detected in some samples after laboratory testing,\" ACCC Product Safety said.\n\n\"﻿Importantly, respirable asbestos has not been detected in any of the tested samples.\n\n\"The release of respirable asbestos fibres is unlikely to occur in its current state, unless the sand is processed by mechanical means such as crushing or pulverising.\n\n\"The risk that any asbestos found, that is likely to be airborne or fine enough for inhalation, is low.\"\n\nThe retailer has issued a recall for a ﻿14-piece Sand Castle Building Set and tubs of magic sand which come in blue, green and pink. (Kmart)\n\nCustomers have been told to stop using the products immediately and safely dispose of them.\n\n\"﻿Wear disposable gloves and a mask and either return in the original tub or place the sand in a heavy-duty plastic bag and double tape it securely and keep it out of reach of children,\" the recall notice said.\n\n\"Do not dispose of the products in general waste.\"\n\nInformation on the disposal of asbestos waste, including disposal facilities in your state or territory can be found on The Asbestos and Silica Safety and Eradication Agency website.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/perth-dentist-six-figure-side-hustle-dr-grillz/581b67d1-6b11-4003-bf9e-521d32642bbb",
        "title": "Aussies pay this guy up to $5000 for what's in his mouth",
        "publish_date": "Sat, 15 Nov 2025 19:11:49 +0000",
        "category": "finance",
        "authors": [
            "Nov"
        ],
        "text": "Dr Maheer Shah didn't even want to be a dentist; now he's using his dentistry skills to run a six-figure side hustle making jewellery for your teeth.\n\nGrillz are removable dental accessories often made from gold and diamonds and Shah is the founder of one of Australia's only grillz businesses, Dr Grillz.\n\nHe can charge up to $5000 for a single removable set and right now, business is booming.﻿\n\nDr. Maheer Shah is a leading Perth dentist specialising in aesthetic dentistry - and making grillz on the side. (Supplied)\n\n\"Now I'm getting this demand for permanent work,\" Shah told 9news.com.au.\n\n\"I think the culture is moving in that direction – everyone's got so many tattoos now, and piercings, the permanent gold teeth and diamond teeth is probably the next phase.\"\n\nBorn in Nairobi and raised in the suburbs of Perth, Shah decided to pursue dentistry after hearing that a schoolmate's dentist dad only had to work three days a week.\n\nHe went in blind and admitted he didn't have much \"natural talent\". ﻿\n\nBut he persevered and completed his degree in 2015.\n\nThe idea for Dr Grillz﻿ struck him just a few weeks later, when he went to see his favourite DJs perform.\n\n\"I won some backstage passes, so I met them before their show and they had grillz in,\" Shah said.\n\nThese are grillz, removable dental accessories often made from gold and diamonds. (Supplied)\n\nWhen he asked about the accessories, the DJs confessed they travelled abroad to buy them because grillz were so hard to find in Australia.\n\nShah immediately saw it as an opportunity.\n\nAfter the show, his mates wanted grillz of their own, so he connected with designers and jewellers to create them.\n\nIt became a hobby, one he shared online via his Dr Grillz Instagram page.\n\nMost of the dentists he worked with called it a \"gimmick\", insisting it wouldn't amount to anything.\n\nBut Shah's social media page had started to gain traction.\n\nBefore long, total strangers were reaching out to order custom grillz.\n\nStill working full-time as a dentist, Shah slowly built a team of designers, jewellers and technicians to help bring each set of custom grillz to life.\n\nShah has built a team of jewellers, designers and technicians who keep Dr Grillz going. (Supplied)\n\nHe did most of the work for Dr Grillz between appointments or on weekends, but Shah didn't mind dedicating that time to a creative outlet.\n\nAnd at up to $5000 a pop, grillz were becoming a lucrative little side hustle.\n\n\"A little silver tooth would maybe be $200 or $300, and if you wanted a little tooth gem that's somewhere between $30 and $50,\" Shah explained.\n\n\"But then, when the pieces start to get bigger, covering multiple teeth, then it'll move to that $500 to $1000 mark.\n\n\"And then when you add diamonds, or if they're very big pieces, it goes into the thousands – up to $5000.\"\n\nHe charges even more for permanent work, though it's not something he does often.\n\n﻿On one occasion, Shah created a custom gold and diamond implant worth several thousand dollars to replace a patient's missing tooth.\n\nThis gold and diamond permanent tooth implant was created to fill the place where a client was missing a tooth. (Supplied)\n\nBut he's reluctant to do anything permanent that could damage a patient's natural smile – even though he could charge tens of thousands for it.\n\n﻿\"I'm still a dentist, my job is to protect your teeth,\" Shah said.\n\nDr Grillz is now a six-figure business and Shah will soon be opening a grillz studio in the Perth suburb of Northbridge.\n\nGetting to this point hasn't been easy but the challenges he's faced building this side hustle are nothing compared to his day job.\n\n\"The mishaps you have in dentistry, the complications and pain and bleeding, is a way worse headache than grillz ever will be,\" he said.\n\n﻿At least his Dr Grillz clients are happy to see him – unlike many of the patients he sees working full-time across two private dentistry practices.\n\n﻿\"When you work as a dentist, no one's really that excited to see you,\" Shah laughed.\n\nAustralian musician Mia Rodriguez shows off a custom set of grillz from Dr Grillz. (Supplied)\n\nBut he never considered giving up work as a dentist to focus on Dr Grillz alone.\n\nAbout 55 per cent of Australians are currently earning money from a side hustle, or actively considering starting one, according to Westpac data.\n\nLike many of them, ﻿Shah has had to play it smart with his money to keep his business going.\n\nWithout his salary as a dentist to fall back on, he doubts Dr Grillz would be as successful as it is today – if at all.\n\n﻿He urged other Aussies looking to build a brand or make cash on the side not to dive into a side hustle without considering how they'll pay rent when business is slow.\n\nShah encouraged other Aussies pursuing side hustles to keep their day jobs and focus on making smart money decisions. (Supplied)\n\nBecause there's nothing ﻿that can kill a small business quicker than poor financial planning.\n\n\"If you can have a job that pays your bills and things like that, then all the money your side hustle makes, you can reinvest into the business,\" he said.\n\n\"And even if that business doesn't grow into something that makes you $1 million, it will lead you into that next thing that might be the golden ticket for you.\"\n\nHave you got a story? Contact reporter Maddison Leach at mleach@nine.com.au",
        "source": "9News"
    },
    {
        "url": "https://www.abc.net.au/news/2025-11-17/why-the-act-has-closed-schools-over-asbestos-sand/106016514",
        "title": "Why is the ACT the only jurisdiction to close schools over coloured sand?",
        "publish_date": "Mon, 17 Nov 2025 00:56:22 +0000",
        "category": "finance",
        "authors": [],
        "text": "While there's a national recall for coloured sand products over asbestos contamination concerns, only the ACT has gone so far as to close public schools while it cleans up the products.\n\nNearly 70 Canberra schools are shut today after more coloured sand products were recalled over the weekend.\n\nSo why are schools closed in the ACT when other states and territories haven't taken the same action?\n\nWhy has the ACT closed schools?\n\nIn a situation reminiscent of the COVID pandemic, the states and territories have gone their own way in handling the issue.\n\nLast week, the Australian Competition and Consumer Commission (ACCC) issued a national recall notice for coloured sand products following laboratory testing that detected traces of chrysotile — a type of naturally occurring asbestos.\n\nThat prompted the ACT's education department to close 16 schools and six preschools on Friday, and partially shut eight others, as it scrambled to conduct a search for the products.\n\nACT to close more schools over asbestos contamination scare The ACT will close more schools after additional coloured sand products were recalled by Kmart and Target, while the schools that were shut on Friday will reopen on Monday.\n\nOver the weekend, Kmart and Target issued a product safety recall for four additional products.\n\nThat recall prompted the ACT government to shut 69 public schools today, putting it at odds not only with other jurisdictions but also with private and independent schools operating under the same legislation.\n\nEducation Minister Yvette Berry said the ACT's laws around asbestos removal were \"the most rigorous in the country\".\n\n\"We're proud of that,\" she said.\n\n\"I know it's a small risk, however under the work, health and safety regulation we are required to eliminate the risk as far as reasonably practicable and that's what we are doing,\" she said.\n\n\"I can't talk for or go through the legislation requirements under other states and territories.\n\n\"I understand the requirements of our legislation and those are the requirements that I'm meeting and that's based on the advice that was first released by the ACCC around contaminated sand being identified.\"\n\nSchools are being assessed for asbestos across the ACT. (ABC News: Matt Roberts)\n\nUnder the ACT's Work Health and Safety Act (2011), all asbestos removal work is required to be carried out by a licensed asbestos removalist.\n\n\"We need to have a certified asbestos assessor and contractor remove the contaminated sand and then provide a certificate to our schools that they are safe to return,\" Ms Berry said.\n\nJo Wood says the directorate is taking every step to \"prioritise safety\". (ABC News: Matt Roberts)\n\nACT Education Directorate director-general Jo Wood said the directorate was responsible for the safety of staff and students according to \"very stringent work health and safety laws\".\n\n\"We are doing everything we can to be following every single step under our legislation, and ensuring we're doing that in a really risk-assured way,\" Ms Wood said.\n\n\"So I guess what I would say is people can have confidence that we're really considering the risk and really taking every step to prioritise safety.\"\n\nWhy are Catholic and independent schools open?\n\nAll employers within the ACT operate under the same legislation, including Catholic and independent schools.\n\nTracy Taylor, the executive director of Independent Schools ACT, said they had searched every school for the products and were \"confident\" they had acted appropriately.\n\n\"Out of our 18 schools, 11 of them confirmed they did not have any of the sand products on site,\" Ms Taylor said.\n\n\"Seven of them found some small samples on site and they all did the right thing and got the licensed asbestos assessors in who disposed of any of the suspected contaminated products.\"\n\nCatholic Education issued a statement this morning saying it was working closely with the Education Directorate and health and safety authorities.\n\n\"We believe we have contained all the affected sand and the risk in our schools is still low,\" the statement said.\n\nWhy are schools open in other states and territories?\n\nThe ACT Education Directorate is alone in its decision to close schools, other than one independent school in Brisbane and another in Tasmania.\n\nSince the products were recalled, officials and experts have said any asbestos found in the coloured sand posed a low health risk.\n\n\n\n\"It's two things: it's probably unlikely to become airborne, and the second is it's really a very short-term exposure,\" Professor Martyn Kirk from the ANU's National Centre for Epidemiology and Population Health said.\n\n\"What we are worried about is when they breathe it in, not if they consume it.\n\n\"It's very unlikely in something like sand that you're going to get much in the air.\"\n\nIn a social media post, Giant Steps Tasmania in Deloraine said the closure would allow staff to safely remove the product, deep clean classrooms and seek further advice from specialists.\n\nMore coloured sand products recalled Kmart has recalled four coloured sand products over concerns of asbestos contamination.\n\nIn South Australia, 139 sites have now been found to have the coloured sand, with independent contractors coming in to clean surfaces where the product has been loose.\n\nIn Western Australia, residents were urged to take precautions, including storing the products in sealed containers in a secure location. The government's advice said not to dispose of the product but await further instruction.\n\nThe Queensland government has questioned how the Chinese-made products were allowed into the country.\n\n\"It's important that people are given up-to-date information and also that there is a proper analysis on how this was imported and distributed,\" Queensland Premier David Crisafulli said.\n\nVictoria is undertaking an investigation with the importer and supplier of the sand products.\n\nNo NSW public schools have been closed.\n\nAs a precaution, a safety alert has been sent to all NSW public schools to immediately and safely remove the sand products, if present.\n\n\"The health, safety, and wellbeing of students, staff, and the school community is the department's highest priority,\" A NSW Department of Education spokesperson said.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-11-17/tasmania-rock-lobster-fishery-antibiotic-florfenicol-salmon/106016448",
        "title": "Salmon antibiotic leads to partial rock lobster fishery closure",
        "publish_date": "Mon, 17 Nov 2025 00:53:10 +0000",
        "category": "finance",
        "authors": [],
        "text": "China's rules for imported seafood are among the reasons for a snap partial closure of Tasmania's rock lobster fishery, in an area where salmon farms are using the antibiotic florfenicol.\n\nJust hours after the commercial rock lobster season opened on Friday, the Natural Resources and Environment Department (NRE) closed two sections of the fishery south of the D'Entrecasteaux Channel in the state's south-east \"until further notice\".\n\n\"The [areas] were closed because they are within the 3-kilometre radius of where florfenicol has been used within the salmon pens,\" said Jane McGowan from the Tasmanian Rock Lobster Council.\n\n\" The decision to close is not because of florfenicol as a risk to human consumption, it's more under an abundance of caution to do with market access for our export markets. \"\n\nDifferent export markets have different rules. NRE's marine resources general manager, Dr David Midson, said the state's largest export market for lobster, China, had a requirement that there were no traces of antibiotics present in imported rock lobster.\n\nSalmon companies have received approval to use the antibiotic florfenicol. (Supplied: Tassal)\n\nLoading...\n\nPremier Jeremy Rockliff said the export market for rock lobster was \"a very, very sensitive market\".\n\n\"All primary producers, whether it be cherries or whether it be beef or whatever the case may be, have to be extra vigilant … and sensitive to the markets,\" Mr Rockliff told a budget estimates committee on Monday.\n\nHe said the closure was \"that extra precaution, if you like\".\n\nTasmania's farmed salmon industry received federal approval this month for the emergency use of the antibiotic florfenicol in its pens, following a mass mortality event last summer.\n\nThe state's Health Department has advised there are \"no reports of adverse human health effects from exposure to traces of florfenicol in meat or fish\".\n\nPublic health director Dr Mark Veitch has said that anyone who wants to avoid exposure to antibiotic residue should consider not consuming fish caught within 3 kilometres of a salmon pen being treated with florfenicol.\n\nThe state government has a live map showing where florfenicol is being used.\n\nClosure a 'smart move'\n\nBryce Way says he supports the closure of the two zones. (Supplied: Bryce Way)\n\nCommercial rock lobster fisher Bryce Way told ABC Radio Mornings closing the two zones was \"a smart move\" by NRE.\n\n\"It's important that everything we do meets our export rules and regulations,\" Mr Way said.\n\nBut he said the closure would have consequences.\n\n\"We've lost a large area that can't be fished … a nearly 6 square mile [15.5 square kilometre] area,\" he said.\n\n\"Which puts more fishing effort in a small area nearby.\"\n\nDr Midson told ABC Radio Mornings he expected the areas would be reopened to fishing within \"weeks\".\n\n\"The vast majority of the commercial rock lobster fishery is currently open, but that's not to downplay the impact, particularly on some fishers,\" he said.\n\n'Not something we're trying to hide'\n\nThe notice that NRE issued advising of the closure did not mention the reason for it.\n\nDr Midson said that was because the notice was a \"legal instrument\" that contained the information that was legally required.\n\n\"It's not something that we're trying to hide,\" he said.\n\nThere are concerns the closure will put more pressure on nearby areas. (ABC South East SA: Elsie Adamo)\n\nCommercial rock lobster fishers were also sent an email from NRE, which Mr Way said included more information.\n\nMr Way said he would like to see more warning of antibiotic use.\n\n\"The season opened on the 14th [of November] at 1 o'clock in the afternoon and we got an email at about 6:15 in the evening saying that as of that night, once you pull your gear, don't shoot them back into the water,\" he said.\n\n\"No one should have an issue with the zones closing for us commercially, the issue is the lack of discussion to the local commercial and recreational people that this could impact — there's no way the farms decided a few days ago to do this.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-11-17/paralympic-gold-medal-winner-paige-greco-dies-aged-28/106017286",
        "title": "Paralympic gold medal winner Paige Greco dies, aged 28",
        "publish_date": "Mon, 17 Nov 2025 00:49:25 +0000",
        "category": "sports",
        "authors": [],
        "text": "Australian Paralympian Paige Greco, who won Australia's first gold medal of the 2020 Tokyo Paralympic Games, has died aged 28.\n\nA statement released by AusCycling, on behalf of the Greco family, confirmed the Paralympic and multiple-time world champion died at her Adelaide home on Sunday after \"experiencing a sudden medical episode\"\n\nGreco competed at the 2025 UCI Para-cycling Road World Championships in August, where she won a bronze medal in the road race.\n\nIn a statement on behalf of the Greco family, Paige's mother Natalie described her daughter as someone who enriched the lives of those who knew her.\n\n\"Paige meant everything to us. Her kindness, her determination and her warmth touched our family every single day,\" Natalie Greco said\n\nPaige Greco won Australia's first gold medal during the Tokyo Paralympic Games. (Photo: Getty Images)\n\n\"She brought so much joy and pride into our lives, and the pain of her passing is something we will carry forever.\n\n\"While we are devastated by her loss, we are incredibly proud of the person she was and the way she represented Australia.\n\n\"As a family, we are deeply grateful for the support shown by so many people connected to Paige, including her teammates and friends. Paige cherished the connections she made through her sport, and we take comfort in knowing how widely she was loved.\"\n\nGreco won Australia's first gold medal of the 2020 Tokyo Games, triumphing in the women's C1-C3 3,000m individual pursuit, setting a new world record.\n\nShe would go on to win bronze in the women's C1-C3 road race and time trial at the Tokyo Games.\n\nGreco would be awarded a Medal of the Order of Australia for services to sport in 2022.\n\nPaige Greco, pictured with Olympian Alex Porter, wave to the crowd during the Christmas Pageant at Adelaide Oval in November 2021. (Getty Images: AOC/Mark Brake)\n\nCameron Murray, the chief executive of Paralympics Australia, said Greco's was admired for her character and the way she represented her country.\n\n\"Paige was an extraordinary athlete, but more importantly, a remarkable person,\" Murray said.\n\n\"As a Paralympian, Paige represented Australia with a level of commitment and composure that earned the admiration of everyone who had the privilege to watch her compete or to work alongside her.\n\n\"Her achievements on the international stage were exceptional, but it was her kindness, her quiet determination and the way she uplifted people around her that will stay with us all. She had a rare ability to make people feel included and supported, and her influence will no doubt leave a lasting impression on so many.\"\n\nGreco started her journey to the Paralympics as a runner, attempting to qualify for the Rio Games in 2016.\n\nAfter missing out on the team in 2016, Greco turned her focus to para-cycling, moving to Adelaide to work with the South Australian Sports Institute and complete a degree in exercise sports science in 2018.\n\nBefore becoming a Paralympic and world champion in para-cycling, Paige Greco started her career in para-athletics as a runner. (Getty Images: Morne de Klerk)\n\nGreco's maiden international debut came at the 2019 Para-cycling Track World Championships in the Netherlands.\n\nGreco broke three world records and won gold in the women's C3 3,000m individual pursuit and the C3 500m time trial.\n\nLater that year, Greco would claim a road cycling world championship in the C3 time trial, and placed fifth in the road race.\n\nAfter fulfilling her dream of representing Australia at the Paralympics in 2021, where she won a gold and two bronze, Greco would win four bronze medals at world championships across 2022 and 2023.\n\nPaige Greco was a multiple time world champion in para-cycling. (Getty Images: PA Images/Tim Goode)\n\nThis year, Greco claimed a bronze in the UCI World Cup time trial in Ostend, Belgium.\n\nAt the 2025 UCI Para-cycling Road World Championships in August, also in Belgium, Greco would add another bronze medal to her list of achievements in the road race.\n\n\"Paige was an extraordinary athlete who achieved outstanding accomplishments at the highest levels of our sport.\" Marne Fechner, chief executive of AusCycling, said.\n\n\"Much more than that, she touched the lives of everyone around her with her positive spirit and courageous outlook.\"\n\nIn the statement released on Monday morning, AusCycling and Paralympics Australia said they would provide support to Paige Greco's loved ones and \"honour her legacy appropriately\".",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-11-17/sam-konstas-picked-to-open-for-prime-minister-xi-england/106017212",
        "title": "Konstas to get crack at England with PM's XI selection",
        "publish_date": "Mon, 17 Nov 2025 00:46:11 +0000",
        "category": "sports",
        "authors": [],
        "text": "Sam Konstas will return to the scene where he made his case for Test selection last summer, with the axed opener given a chance to face England with the Prime Minister's XI.\n\nDropped by Australia's selectors after a poor start to the summer, Konstas was confirmed as a big-name inclusion for the two-day game at Manuka Oval later this month.\n\nPeter Handscomb will captain the PM's team, while veteran quick Peter Siddle will also feature in the pink-ball match.\n\nMore notable is the wealth of young talent picked in the side that will be coached by Tim Paine, as Australia moves towards a transition of its Test team.\n\nCampbell Kellaway will likely open with Konstas, after his Victoria coach Chris Rogers said last week he should be the man to eventually replace Usman Khawaja.\n\nNathan McSweeney is also selected after his three Tests at the top of the order last summer, as are Victoria's teenage prodigy Oliver Peake and rising Queenslander Hugh Weibgen.\n\nBut it is Konstas's name that will attract the most interest.\n\nIt was in this fixture last year that he hit 107 from 96 balls against India, pushing his case for Test selection with several extravagant shots.\n\nA debut came four weeks later on Boxing Day, where he famously unsettled the usually unflappable Jasprit Bumrah with a series of scoop shots on the way to 60.\n\nBut the opener has not hit another half-century in his nine innings since, scoring 103 runs at an average of 11.44 for Australia.\n\nSelectors had hoped he would return to form this summer with NSW, but he has passed 50 just once, averaging 20.12 for the Blues in the Sheffield Shield.\n\nStream End Game with Tony Armstrong on ABC iview Tony Armstrong tackles Australia's overdue reckoning with racism in sport with the help of some of its biggest sports stars.\n\nThe opener has shown a more conservative approach in recent weeks, spending time in the middle without making a big score.\n\n\"We've selected a squad that strikes a balance between youth, experience, and opportunity,\" chief selector George Bailey said.\n\n\"Peter Handscomb, who will captain the team, and Peter Siddle will provide valuable experience around the team for the occasion.\n\n\"It's a chance to build depth, reward performance, and provide valuable exposure and experience against international competition.\"\n\nNow played as a two-day fixture, the match will act as England's warm-up game for the day-night Test at the Gabba.\n\nPrime Minister's XI squad vs England XI\n\nPeter Handscomb (captain), Benji Floros, Campbell Kellaway, Campbell Thompson, Charlie Anderson, Doug Warren, Hugh Weibgen, Joel Curtis, Nathan McSweeney, Oliver Peake, Peter Siddle, Sam Konstas, Sam Skelly.\n\nAAP",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-11-17/australia-lpga-tour-championship-linn-grant-wins-the-annika/106017048",
        "title": "Four Aussies qualify for LPGA season-ending $16.8m tournament",
        "publish_date": "Mon, 17 Nov 2025 00:35:19 +0000",
        "category": "sports",
        "authors": [],
        "text": "Four Australians have qualified for the LPGA's season-ending Tour Championships, as Swede Linn Grant emerged from a form funk to win The Annika in runaway fashion.\n\nAfter eight missed cuts in 2025, Grant fired a final-round five-under-par 65 at Bellair's Pelican Golf Club to scorch to a three-shot victory.\n\nBogey-free for 52 consecutive holes, the 26-year-old finished at 19 under for the tournament to pocket $US487,500 ($746,000) for her second LPGA Tour title.\n\nLinn Grant overcame poor form during the season to win The Annika. (AP: Tampa Bay Times/Luis Santana)\n\nAmerican Jennifer Kupcho closed with a 67 to finish runner-up, one stroke ahead of Mexican Gaby Lopez (65) as Australian Grace Kim's quest for a third win of the year faltered on the front nine.\n\nAfter starting the day in third place, just three shots off the pace, Kim stumbled with two early bogeys before rallying down the stretch to post a 69 and end up equal ninth at 12 under.\n\nAs players jostled desperately for spots in the upcoming $US11 million ($A16.84 million) season-ending Tour Championship, fellow Australian Karis Davidson's final-round 66 was not enough.\n\nStream End Game with Tony Armstrong on ABC iview Tony Armstrong tackles Australia's overdue reckoning with racism in sport with the help of some of its biggest sports stars.\n\nOnly the top 60 in the season-long standings advanced, with Davidson's joint 14th only progressing the 27-year-old up to 74th position.\n\nTour rookie Cassie Porter also missed out on making the showpiece finale in Naples, in even more heartbreaking fashion.\n\nAfter starting the week on the bubble in 60th position, Porter dropped to 64th in the points race after a final-round 72 left the 24-year-old Sydneysider equal 56th.\n\nGabriela Ruffels' joint 28th at six under and Robyn Choi's equal 38th three shots further back were not enough either as world number five Minjee Lee was left to spearhead Australia's four-strong challenge at the Tour Championship.\n\nEven after sitting out this week, Lee is third in the points race behind Thailand's world number one, Jeeno Thitikul, and Open Champion Miyu Yamashita from Japan.\n\nAfter snaring her maiden major this year at the Evian Championship, Kim (29th), also qualified, along with Hannah Green (38th) and Steph Kyriacou (45th).\n\nGreen continued her strong end to the season with a share of 15th at nine under, while Kyriacou also closed with a 67 to tie for 38th.\n\nAmerican Brooke Matthews followed up a Saturday 64 with a Sunday 65 to finish tied for eighth and snatch the third-last spot at the Tour Championship from outside the top 60 entering the week.\n\nThe LPGA Tour Championship will be held at the Tiburón Golf Club in Florida, United States, from November 20-23.\n\nAAP",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-11-17/controversial-artworks-australia/105984714",
        "title": "How an abstract painting helped bring down a government",
        "publish_date": "Mon, 17 Nov 2025 00:12:33 +0000",
        "category": "entertainment",
        "authors": [],
        "text": "\"Never had such a picture moved and disturbed the Australian public.\"\n\nThat's art historian Patrick McCaughey, speaking at the National Gallery of Australia (NGA) about what is arguably the most controversial artwork in modern Australian history.\n\nThe painting was Jackson Pollock's Blue Poles, and some people believe it played a part in Gough Whitlam's dramatic dismissal from government in 1975.\n\nThe abstract expressionist painting was purchased for $1.3 million (approximately $11.3 million today) by the Australian federal government to take pride of place in Canberra's yet-to-be-built Australian National Gallery (which would later become the NGA).\n\nIt was the highest figure ever paid for an American artwork at the time, and led to furious public debate about government spending and the value of art. Ultimately, it became a political weapon for the opposition, who would later block supply of the Whitlam government's budget.\n\nBut this was not the first time the Australian public had been gripped with controversy over an artwork, nor would it be the last.\n\nThe one about style\n\nThere wasn't much that could push World War II off the front pages in 1943, but one portrait was so controversial that it did just that.\n\nIn fact, the painting in question was described at the time by artist Mary Edwards as a \"Pearl Harbor attack on art\".\n\n\" Not a child or an expectant mother should be allowed in the Art Gallery at present. \"\n\nSo, what was this artwork that provoked so much furore? It was Portrait of an Artist (Joshua Smith) by Sir William Dobell.\n\nThe Archibald Prize was less than two decades old, and Dobell had already entered three times. In 1943, he decided to paint a portrait of his fellow artist, Joshua Smith.\n\nThe portrait was awarded the top prize, with the Contemporary Art Society declaring it the most important work of art entered in the competition. The portrait was hung proudly in the Art Gallery of New South Wales.\n\nBut not everybody was happy.\n\nDobell used the title Portrait of an Artist for his painting but it was listed in the catalogue of the 1943 Archibald Prize competition as Mr Joshua Smith. ( )\n\nSmith's parents were seemingly horrified by the portrayal of their son. Despite Smith originally telling Dobell he quite liked the piece, his parents apparently pleaded with the artist to withdraw the \"humiliating\" portrait from the prize, and even offered to buy it.\n\nMelbourne newspaper critic James Stuart MacDonald, who had been director of the National Art Gallery of NSW, described the portrait as the \"epitome of ugliness, malformation and gruesome taste\".\n\n\"Mr Joshua Smith looks like a man naturally deformed or crippled, and suffering, in addition, from malnutrition,\" he wrote at the time.\n\nArt historian Lorraine Kypriotis explained to ABC Nightlife that Dobell had \"an expressionistic style\" where he distorted the human body.\n\n\" Sometimes they'd be long and thin. Other times they'd be quite bulky. But you always got a sense of the character's true personality coming through in his works, like I think all great portrait artists. \"\n\nMacquarie University historian Dr Peter Edwell, who wrote a book about the controversy, says many people just thought the exaggerated style of the piece was ugly.\n\n\"What made the win controversial was that Dobell's painting was different to past winners and it was linked to the influences of modernism and caricature,\" Dr Edwell told The Lighthouse.\n\n\"There was also the belief that Smith was rendered in a way that suggested he was gay at a time when homosexuality was against the law.\"\n\nAfter the piece was announced as the winner, groups of \"concerned citizens\" met in Sydney and Melbourne, aiming to challenge the decision.\n\nEdwards and fellow Sydney artist Joseph Wolinski decided to take the matter to the courts.\n\nThey argued the work was not a true portrait, as it depicted Smith in a \"distorted and caricatured form\". They believed the prize money should be withheld, as it was contrary to the terms set out in J.F Archibald's will.\n\nLoading...\n\nA bizarre court case ensued, where lawyers debated and scrutinised the meaning of art. To add to their claim, Dr Vivian Benjafield was called to the stand to attest that a living, healthy person couldn't look the way Smith was represented.\n\n\"I would say that it represents the body of a man who had died in that position and had remained in that position for a period of some months and had dried up.\"\n\nIn the end, the Honourable Justice Ernest Roper dismissed the case, saying: \"The picture in question is characterised by some startling exaggeration and distortion ... It bears, nevertheless, a strong degree of likeness to the subject and is, I think, undoubtedly a pictorial representation of him.\"\n\nMeanwhile, record numbers of people visited the gallery to check out the controversial painting; the gallery extended its opening hours and prolonged the exhibition by a month.\n\nSmith is said to have never quite recovered from the humiliation of the ordeal. When he won the Archibald Prize for his portrait of John Solomon Rosevear the following year, many speculated that it was a consolation prize.\n\nDobell won the Archibald Prize again in 1948 for his portrait of Margaret Olley, and in 1959 for his portrait of Dr EG MacMahon.\n\nThe painting of Smith was all but destroyed in a fire in 1958, and subsequently restored.\n\nThe one about obscenity\n\nA Sydney artist identifying as a bisexual witch might not draw a second glance these days, but in the 1940s it wasn't so common.\n\nRosaleen Norton emigrated to Sydney from Dunedin in 1925, and went on to become a trailblazing, and often misunderstood, artist.\n\nA self-proclaimed witch, Norton experienced childhood visions. From around the age of 23, she practised trance magic and, later, sex magic, in various flats and squats in inner-city Sydney.\n\nTrance magic involved Norton meditating (sometimes with the assistance of various substances) and raising her consciousness, aiming to experience higher forms of existence.\n\nSex magic was developed by the infamous English occultist, Aleister Crowley, around 1904, and involves a complicated series of sexual rituals designed to induce spiritual awakening.\n\nSafe to say, the predominantly Christian Australian culture of the time was alarmed by the art Norton produced and exhibited.\n\nFirebird by Rosaleen Norton. ( ) Norton photographed with her cat in 1949. ( ) Rosaleen Norton's Bacchanal. ( )\n\nThe tabloid presses frequently derided the \"satanic\" work of the \"Witch of King's Cross\", saying it was obscene and encouraged devil worship. (Although Norton seemed to lean into this label, sometimes wearing a pointed witch's hat). She was also the subject of regular police surveillance.\n\nDuring an exhibition of her art at Rowden-White Library, University of Melbourne, in 1949, the Vice Squad seized several works deemed to be profane. Norton appeared in court on obscenity charges — the first such case against a woman in Victoria.\n\nShe was acquitted, but a later book of her art landed the printer in court on charges of producing an obscene publication, and the book was banned.\n\nNorton retired from public view in the 1970s and died of colon cancer in 1979. Her extraordinary life and the influence of her art were captured in a 2020 documentary, The Witch of King's Cross on Prime Video.\n\nThe one about government spending\n\nJames Mollison is \"one of the most important Australian cultural figures\", according to journalist and writer Tom McIlroy, but very few people have heard of him.\n\nMollison was a public servant, a gallery executive and an arts leader in Australia. And he was the man tasked by the Whitlam Government with putting together a world-class sample of art for a new national gallery in Australia, which had been delayed for years.\n\nMollison's mission was part of a slew of commitments from Whitlam's government that he claimed would \"refresh, reinvigorate and liberate Australian intellectual and cultural life\".\n\nLoading...\n\nCompelled to bring something different to the collection, Mollison started talking with art dealers in New York.\n\n\"I think from the very start he sees the potential to really shake things up and catch people unaware with something like a Jackson Pollock painting, to hang next to Renaissance artworks, French impressionism, great sculpture from centuries past,\" says McIlroy, who also wrote Blue Poles: Jackson Pollock, Gough Whitlam and the Painting that Changed a Nation.\n\n\"He wanted to make a statement, and I think he achieved that.\"\n\nComing in at a sale price of $1.3 million, the enormous painting was worth about a fifth of their total acquisition budget and had to be approved by the prime minister himself. Going against political advice, Whitlam decided that the price paid for the artwork should be made public.\n\n\"I think he knew from the very start that this was going to be a transformational purchase; I think he knew that it was something that would forever be associated with him and with his government,\" says McIlroy.\n\n\"From the very start, Whitlam spoke about the importance of the arts. He said that to be a civilised society in the modern world, governments needed to foster the arts.\"\n\nAnd so, a political ruckus was ignited.\n\nIn 2016 Blue Poles was estimated to be worth $350 million, which means it has increased in value more than 30-fold. ( )\n\n'$1.3m for dribs and drabs,' raged one newspaper headline.\n\n'Barefoot drunks painted our $1 million masterpiece', read another.\n\nMembers of Whitlam's own party publicly criticised spending government money on paintings that were \"weird\". James Mollison was dragged in front of the Senate for questioning.\n\nThe purchase came at a time of economic difficulty for many people, and the opposition seized the moment, linking the painting to criticism about the government's handling of the budget.\n\n\"It became a political weapon against the Whitlam government,\" says McIlroy.\n\n\"It gives people like Malcolm Fraser and a whole host of coalition MPs the opportunity to say their priorities are warped. We can do a better job in governing Australia.\n\n\" And I think it plays a small piece in the ultimate drama of the Whitlam government playing out a couple of years later in the dismissal. \"\n\nThe inside story of how Gough Whitlam's dismissal changed Australian democracy forever Gough Whitlam's dismissal began with a budget stand-off. This is the inside story of the political earthquake that changed Australian democracy forever.\n\nGough Whitlam was dismissed by governor-general Sir John Kerr in 1975, 50 years ago. But he remained staunch in his support of the work throughout his life — he and his wife put Blue Poles on their annual Christmas card for years, even after he left government.\n\nBlue Poles is now the most viewed artwork at the National Gallery of Australia. The gallery has only lent the painting to other institutions twice (to MoMA in 1998–99 and the Royal Academy of Arts, London in 2016).\n\nIn 2016, Blue Poles was estimated to be worth $350 million.\n\nThe one about exploitation\n\nIn May 2008, police descended on a gallery in Paddington, Sydney, and seized 20 photographs.\n\nThey were the work of renowned Australian photographer Bill Henson.\n\nThe art in question was a series of photographs of a naked 13-year-old girl, and followed complaints from child protection organisation Bravehearts.\n\nThe website of Roslyn Oxley9 gallery was also referred to the Child Protection Internet Unit and the matter was also referred to the Australian Communications and Media Authority.\n\nWhat followed was a brutal public debate about art, consent, children and nudity.\n\nPolice spoke to the model and her family. ( )\n\nThe gallery received numerous threats and then prime minister Kevin Rudd labelled the work \"absolutely revolting\".\n\n\"Whatever the artistic view of the merits of that sort of stuff — frankly I don't think there are any — just allow kids to be kids.\"\n\nMeanwhile, the artistic community rallied behind Henson, with everyone from Cate Blanchett to author JM Coetzee signing an open letter of support.\n\n\"The work itself is not pornographic, even though it includes depictions of naked human beings,\" stated the letter.\n\n\"It is more justly seen in a tradition of the nude in art that stretches back to the ancient Greeks, and which includes painters such as Caravaggio and Michelangelo.\"\n\nEventually, the Australian Federal Police said they found Henson's work did not breach the law.\n\nThe artist welcomed the findings in a statement.\n\nBill Henson has been working as a photographer in Melbourne for more than 40 years. ( )\n\n\"It has been profoundly humbling to witness the depth of support for my work in these past weeks,\" Henson said.\n\n\"It is reassuring to see existing laws, having been rigorously tested, still provide a framework in which debate and expression of ideas can occur.\"\n\nBut high-profile anti-child abuse campaigner Hetty Johnston, from the Bravehearts group, said it was a dark day.\n\n\"This is a big green light for the commercial sexual exploitation of our children,\" she said.\n\n\"That we can't prosecute that in this country is an absolute disgrace.\"\n\nThen-NSW Law Society president Hugh Macken said the decision established a simple fact: that nudity is not obscenity.\n\n\"Bill Henson is one of most eminent photographers. He is a man worthy of accolades, not persecution,\" he said.\n\nHenson was appointed an Officer of the Order of Australia (AO) in 2024 for his service to the visual arts and the promotion of Australian culture.\n\nThe one about financial influence\n\n\"I paint the world as I see it.\"\n\nThis was the simple but impactful statement made by artist Vincent Namatjira in May 2024.\n\nThe work of the Archibald Prize-winning artist was suddenly under an enormous global spotlight, after a reported request to have one of his portraits removed from the National Gallery of Australia.\n\nThe portrait in question was of Australia's richest woman, mining magnate Gina Rinehart.\n\nThe portrait of Gina Rinehart by Vincent Namatjira is done in the Western Aranda artist’s bold style. ( )\n\nIt was part of an exhibit by Namatjira titled Australia in colour, and featured Rinehart alongside prominent figures such as Cathy Freeman, Adam Goodes, Scott Morrison, Julia Gillard, King Charles and many more.\n\nTo make matters more confusing, Swimming Queensland contacted the gallery directly, asking them to consider taking it down.\n\nRinehart's mining company, Hancock Prospecting, spends a great deal of money sponsoring Australian athletes: more than a quarter of Australia's 2024 Olympic team were directly supported by Rinehart.\n\nAnd apparently some of the swimmers didn't like the way the portrait portrayed their benefactor.\n\n\"We confirmed that a significant number of swimmers felt that way,\" said Swimming Queensland chief executive Kevin Hasemann.\n\n\"And having seen the portrait myself, it made sense that we would respectfully — and I emphasise respectfully — contact the gallery, make them aware of the way that we were perceiving it and hope that they might consider taking it down.\"\n\nThe monograph, titled Australia in Colour, is a collection of paintings of powerful people, said Namatjira. ( )\n\nThe National Gallery simply said that it welcomes public dialogue about its works.\n\nBut the National Association of Visual Arts says any pressure to remove a portrait that somebody doesn't like \"sets a dangerous precedent for censorship and the stifling of creative expression\".\n\nFor Namatjira, it's simple:\n\n\"People don't have to like my paintings, but I hope they take the time to look and think, 'why has this Aboriginal bloke painted these powerful people? What is he trying to say?'\"\n\nThe one about political influence\n\nKhaled Sabsabi was shocked when he found out he had been selected to represent Australia in the 61st Venice Biennale Art Exhibition.\n\nThe prestigious annual event is often dubbed \"the Olympics of the arts world\", with countries selecting artists to represent them in a national pavilion.\n\nIn 2024, Australia's pavilion won for the first time in the prize's history, with the monumental installation kith and kin, by First Nations artist Archie Moore.\n\nSabsabi and longtime collaborator, curator Michael Dagostino, had missed out on the position three times before.\n\nLebanese-Australian Western Sydney artist Khaled Sabsabi began his creative life as a hip-hop performer. ( )\n\n\"There was a sense of joy, an extreme sense of joy, disbelief, shock, to be accepted in that context — as a migrant … as a Muslim,\" the Lebanese-Australian artist told ABC Radio National's The Art Show.\n\n\"It spoke to all the good things of what Australia stands for, and the values that we stand for.\n\n\"To have that taken away from you is heartbreaking.\"\n\nDays after the announcement, Creative Australia's decision to appoint the duo was questioned in The Australian newspaper, which pointed out two much older artworks of Sabsabi's that it found problematic, particularly in the light of conflict in the Middle East.\n\nSabsabi's video Thank You Very Much includes footage of the hijacked second plane crashing into New York's Twin Towers on September 11, 2001. It's coupled with vision of then-US president George W Bush thanking first responders in the days immediately following the attacks, before he launched the war on terror in retaliation.\n\nYOU (2007) was a multichannel video and sound installation, which was first shown in Khaled Sabsabi's solo exhibition at Campbelltown Art Centre in 2007 as a two-part installation. ( )\n\nYOU, a multi-channel video and sound installation first exhibited in 2007, features Hassan Nasrallah, the former leader of the Lebanese political party and militant group Hezbollah, who was killed in an Israeli air-strike in 2024.\n\nHezbollah was not listed as a proscribed terrorist organisation by the Australian government until 2021.\n\nAfter the article was published, the matter was raised in Question Time in the Senate by the federal opposition's arts spokesperson, Claire Chandler, who accused Labor of using taxpayer funds to showcase an artist who had \"repeatedly depicted terrorists and terrorist acts\".\n\nThings moved quickly then. Arts Minister Tony Burke called Creative Australia with questions, and an extraordinary board meeting was called. It was decided that the invitation to Sabsabi and Dagostino would be rescinded.\n\nStream Portrait Artist of the Year on ABC iview This captivating eight-part art competition series explores one of the most accessible and provocative forms of art — the portrait.\n\nThe Creative Australia board faced fierce criticism from the Australian arts community, who called into question the organisation's stated principles of arms-length funding.\n\nTwo key players in Australia's Venice participation, Creative Australia's head of visual arts, Mikala Tai, and project manager Tahmina Maskinyar resigned.\n\nThe only visual artist on the board, Lindy Lee, also quit.\n\nThe other artists shortlisted to appear at the Venice Biennale, including Hayley Millar Baker and James Nguyen, were quick to demand Sabsabi's reinstatement.\n\nAlmost six months after the snap decision, after an internal review, Khaled Sabsabi and Michael Dagostino were reinstated to represent Australia in 2026.\n\nThe pair welcomed the decision, describing the work planned for the Venice Biennale as \"inclusive\" and \"nurturing\", saying it was intended to \"bring people together\".\n\n\"The world is becoming much more polarised at the moment,\" Dagostino told ABC Arts. \"With this polarisation, there's a lack of understanding about other people's experience and a lack of empathy.\n\n\"Hopefully this work can bring people together that might have different viewpoints, but who will come together to have this experience where they're trying to understand the other person's position.\"\n\nWatch the new season of Portrait Artist of the Year free on ABC TV and ABC iview.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-11-17/afl-draft-2025-everything-you-need-to-know-guide/106017028",
        "title": "When is the AFL draft and how does it work? Here's what you need to know",
        "publish_date": "Sun, 16 Nov 2025 23:52:28 +0000",
        "category": "sports",
        "authors": [],
        "text": "Another AFL draft has arrived, offering dozens of teenage footballers the chance to realise their dreams and clubs the opportunity to prepare for a brighter future.\n\nThe draft can be a complicated beast these days, with academies and father-son selections muddying the waters for clubs looking to secure the best talent.\n\nHere is everything you need to know about the 2025 AFL draft.\n\nWhen is the AFL draft?\n\nThe 2025 AFL draft will be held over two nights on November 19 and November 20.\n\nThe first round will be completed on the first night, when a selection of players will be present at Docklands Stadium for the event.\n\nThe rest of the draft will be held on the second night. In total, 50 to 60 players are expected to be drafted this year.\n\nHow can I follow the AFL draft?\n\nABC Sport will have live blogs running on both nights of the draft, bringing you news and analysis of every pick.\n\nThe draft will also be broadcast live on Fox Footy and Kayo Sports.\n\nWhat time is the AFL draft?\n\nBoth nights of the draft will start at 7pm AEDT.\n\nHere are the corresponding times for other regions of Australia.\n\n6:30pm ACDT: South Australia\n\nSouth Australia 6pm AEST: Queensland\n\nQueensland 5:30pm ACST : Northern Territory\n\n: Northern Territory 4pm AWST: Western Australia\n\nWho are the players I should know before the draft?\n\nIt is widely expected that Willem Duursma — the fourth Duursma sibling to join the AFL/AFLW system — will be taken by West Coast with the first selection on Wednesday night.\n\nWillem Duursma is set to be the number one pick at this year's draft. (Getty Images: Paul Kane)\n\nOthers in the top-five mix are Zeke Uwland and Dylan Patterson (both members of Gold Coast's academy), Daniel Annable (a member of Brisbane's academy) and Harry Dean (a Carlton father-son).\n\nFrom the open pool of players available to all, Cooper Duff-Tytler, Sullivan Robey, Xavier Taylor, Sam Cumming and Dyson Sharp are the strongest top-10 candidates.\n\nWhat is the current order of picks in the first round?\n\nWest Coast West Coast Richmond Richmond Essendon Essendon Melbourne Melbourne Carlton Hawthorn Carlton GWS West Coast Western Bulldogs Gold Coast Adelaide Brisbane Gold Coast Geelong Fremantle Essendon Hawthorn Brisbane\n\nHow does the bidding system work in the AFL draft?\n\nThe AFL assigns each draft pick with a points value. The first pick in the draft has the most value, with 3,000 points, and the points value of each pick decreases all the way down until pick 54, the final pick of the third round, which is worth 14 points. Any picks from then onwards have no points value.\n\nBrisbane will swiftly match a bid for academy prospect Daniel Annable. (Getty Images: Josh Chadwick)\n\nThe points system is in place for two reasons: to require clubs to pay for matching bids on father-son prospects or academy prospects that are tipped to go high up in any given draft year.\n\nTeams who match bids for either a father-son or academy prospect get a 20 per cent discount. Teams are not obligated to match bids from other clubs, therefore allowing the player to be drafted by a different club.\n\nCan teams do trades during the draft?\n\nThey sure can!\n\nSince being introduced in 2018, the ability for teams to trade during the draft has added an extra wrinkle to the whole process.\n\nTeams can trade with each other using their own picks in the current draft as well as using picks in the 2026 or 2027 drafts.\n\nWhat is the father-son rule?\n\nThe father-son rule is one that is unique to the AFL and allows family traditions to be carried through generations.\n\nSimply put, if a player makes 100 or more appearances for a single club, then that same club has the right to draft the player's son.\n\nThere have been some famous father-son combinations to have played in VFL/AFL history, perhaps none more famous than Gary Ablett and Gary Ablett Jr, who both played for Geelong.\n\nTeams are not obligated to select a player under the father-son rule either. A famous example of this occurred in the 2015 draft when the Sydney Swans opted against drafting Josh Dunkley — now a three-time premiership player — whose father, Andrew, played 217 games for the club.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-11-17/new-provider-to-take-over-bedford-after-financial-woes/106016466",
        "title": "Preferred buyer for Bedford says it will 'protect what matters the most'",
        "publish_date": "Sun, 16 Nov 2025 23:15:31 +0000",
        "category": "finance",
        "authors": [],
        "text": "Non-profit The Disability Trust has been named as the preferred buyer to take over programs run by disability employment provider Bedford, in an agreement that the federal health minister says \"secures the jobs of hundreds and hundreds of South Australians who live with a disability\".\n\nThe state and federal governments have been in talks over the weekend with The Disability Trust as well as major creditor National Australia Bank to finalise a deal that will be \"subject to support from creditors\".\n\nThe search for a new provider has been underway since Bedford first announced it was facing financial difficulty in July.\n\nSA Premier Peter Malinauskas made the announcement to hundreds of cheering Bedford clients at the organisation's Panorama site on Monday morning.\n\n\"This morning I am very pleased to be able to announce that we have secured a new buyer for Bedford,\" he said.\n\n\" Most importantly, every single employee here at Bedford is going to keep their job. \"\n\nPeter Malinauskas made the announcement alongside Human Services minister Nat Cook and federal health minister Mark Butler. (ABC News)\n\nMr Butler told Bedford workers and clients that The Disability Trust was a \"reputable\" organisation with services interstate.\n\n\"We've worked very hard to find an organisation to take Bedford over that we trust, that we know has a proven track record to take Bedford well into the future and to keep all of your jobs,\" he said.\n\n\"The great thing about this purchase by The Disability Trust is you can keep your Bedford badge.\"\n\nDetails on the deal\n\nThe proposed deal would see The Disability Trust take over Bedford's supported employment and learning and experiences programs.\n\nEarlier this morning, Mr Malinauskas told ABC Radio Adelaide that a piece of land at the Panorama site, worth $6 million and jointly owned by the state government and Bedford, would be handed to the new provider.\n\nThe land contribution was on top of the state government's $15 million loan in exchange for of one of the organisation's supported accommodation sites at Clapham.\n\n\"My view is if government isn't willing to hand over land at a moment like this, then when would we?\" he said.\n\n\"I think the necessity here of reaching a long-term solution was paramount.\"\n\nMr Malinauskas said one of the \"caveats\" for the land contribution was that the new buyer would be prevented from developing that land.\n\nAccording to its website, Bedford is the second-largest employer of people with disabilities in the nation. (ABC News: Olivia Mason)\n\nFederal health minister Mark Butler said the Commonwealth has put an additional $13.2 million on the table, after providing $4.4 million in October to keep Bedford afloat.\n\n\"This is the best deal possible for everyone concerned. It's come at significant expense,\" he told ABC Radio Adelaide.\n\n\"This is a long-term solution, if it's supported by creditors and I'm very confident it will be.\"\n\nIn a statement, Bedford said McGrathNicol will be appointed as voluntary administrators to progress the sale.\n\n\"The administrators will continue to operate all Bedford sites enabling all supported employees and clients to continue to attend their sites as usual,\" the statement said.\n\n\"The board has endorsed proceeding with The Disability Trust transaction to acquire Bedford's operations relating to the continuation of supported employment and programs for people with disability.\"\n\nThe Disability Trust's Karenza Louis-Smith says the non-profit would \"protect what matters the most\". (ABC News)\n\nDisability Trust chief executive officer Karenza Louis-Smith said the non-profit would work with the administrators throughout the transition.\n\n\"We will protect what matters the most — familiar routines, trusted relationships and meaningful work,\" she said.\n\nAccording to its website, Bedford is the second-largest employer of people with disabilities in the nation, and has 22 sites across Adelaide and regional South Australia.\n\nIn a statement, National Australia Bank Group's chief executive officer Andrew Irvine thanked the premier for the \"constructive discussions we have had to find a solution to this issue\".\n\n\"NAB has partnered with Bedford for more than 20 years to support the work Bedford's employees do across South Australia,\" he said.\n\nMr Irvine said NAB looked forward to working with McGrathNicol to \"ensure these critical services continue to be available to the community\".",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-11-17/ireland-beats-hungary-in-last-second-of-world-cup-qualifiers/106016698",
        "title": "Dublin erupts as late goal keeps Ireland's World Cup hopes alive",
        "publish_date": "Sun, 16 Nov 2025 23:11:05 +0000",
        "category": "sports",
        "authors": [],
        "text": "Ireland has kept its World Cup hopes alive with a stunning comeback win against Hungary.\n\nTroy Parrott, the unheralded Ireland striker who sent Cristiano Ronaldo's Portugal to a 2-0 loss on Thursday, did even better on Sunday with a hat-trick.\n\nHe struck in the sixth minute of second-half stoppage time in Budapest to complete his hat-trick in a 3-2 win that secured Ireland's place in the playoffs for next year's tournament in the United States, Canada and Mexico.\n\n\"This is why we love football because things like this can happen,\" Parrott told RTE, Ireland's national television and radio broadcaster.\n\n\"I said against Portugal that this is what dreams are made of, but this tonight. I don't think I'll ever have a better night in my whole life.\"\n\nThe goal sparked scenes of jubilation across Ireland, with footage from a pub at Dublin airport showing fans going wild after the unlikely comeback victory.\n\nAfter beating Portugal, the Irish still needed victory at second-placed Hungary to seal the runner-up position in Group F.\n\nBut trailing 2-1 heading into the 80th minute, it took a dramatic fightback to claim the win.\n\nParrott levelled by lifting a shot over Hungary goalkeeper Denes Dibusz and, with the clock running down, he converted from close range for the winner deep into added time.\n\nParrott, who plays for Dutch club AZ Alkmaar in the Eredivisie, capped an unforgettable week for him personally and Ireland with five goals in two games.\n\nHungary led after three minutes through Daniel Lukacs, with Parrott equalising from the penalty spot in the 15th.\n\nBarnabas Varga put Hungary ahead for a second time before half-time.\n\nBut Parrott's late double consigned the hosts to third place, with group winner Portugal routing Armenia 9-1.\n\nAs the result sank in, delirious fans in Budapest took the celebrations into the stadium concourse and elsewhere.\n\nPortugal moves directly through to the World Cup finals, with Ireland still needing to win through at the playoffs in order to make its first World Cup finals appearance since 2002.\n\nMaybe things in Dublin may have settled down by the time the draw for the playoffs happens on Thursday. But maybe not.\n\nThe ABC of SPORT Sports content to make you think... or allow you not to. A newsletter delivered each Saturday.\n\nAP",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-11-17/this-week-in-history-quiz/105877314",
        "title": "How well do you know this week in history?",
        "publish_date": "Sun, 16 Nov 2025 22:53:02 +0000",
        "category": "finance",
        "authors": [],
        "text": "The Velvet Revolution, an Australian rock star's legacy and the youngest ever Saturday Night Live host — how well do you know this week in history?\n\nLoading\n\nWhere to find all the ABC's quizzes\n\nWant to test yourself even further?\n\nTake a squiz at the ABC's New Quiz topic page and see if you're a whiz at our previous quizzes.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-11-17/south-africa-beat-india-in-first-test-boilover/106016596",
        "title": "South Africa stuns India in low-scoring Eden Gardens thriller",
        "publish_date": "Sun, 16 Nov 2025 22:47:23 +0000",
        "category": "sports",
        "authors": [],
        "text": "South Africa pulled off a sensational victory inside three days of the opening Test against India on Sunday in a manner that would go a long way to silencing those who doubted their credentials as the reigning world Test champions.\n\nPreviously known for their penchant to choke in big tournaments, South Africa registered their first major triumph in June when they beat Australia in the World Test Championship (WTC) final.\n\nThe Proteas landed in India to prove that their WTC glory was no fluke.\n\nTemba Bavuma's men jumped to the second spot in WTC standings, leapfrogging India and Sri Lanka, after their 30-run victory in the low-scoring contest at Eden Gardens.\n\nIt was South Africa's first Test win in India since 2010.\n\nBavuma led by example.\n\nOn a tricky track where the ball spun sharply and bounced irregularly, Bavuma struck the only fifty of the match by any batter and deftly marshalled his bowlers, who skittled out India for 93.\n\nA back-pedalling Bavuma followed a swirling ball and took a smart catch to remove Axar Patel that effectively sealed their victory in front of 40,000-odd fans at Eden Gardens.\n\nOff-spinner Simon Harmer's haul of eight wickets earned him the player-of-the-match award but Bavuma's heroic unbeaten 55 dragged his team back into the contest.\n\nJasprit Bumrah, right, was unplayable for India in the first innings, but South Africa's captain Temba Bavuma's half century in the second was the difference. (AP Photo: Aijaz Rahi)\n\nBavuma did not disagree when asked if he felt South Africa beat India in their own game on a pitch like that.\n\n\"Yeah, probably true,\" he told reporters after South Africa went 1-0 up in the two-Test series.\n\n\"We've come here knowing that the wickets are going to be spinner-friendly, similar to what we got in this game. So it didn't come as a surprise.\"\n\nStream End Game with Tony Armstrong on ABC iview Tony Armstrong tackles Australia's overdue reckoning with racism in sport with the help of some of its biggest sports stars.\n\nDespite having so little to defend, Bavuma said he never stopped trusting his bowlers.\n\n\"It's not every day you go and score 125, and you feel that's a winning score.\n\n\"But we had to believe. We knew it was tough. We saw with our own innings, with the bat.\"\n\nIndia were one batsman short as skipper Shubman Gill retired hurt in the first innings and did not bat in the second.\n\nIndia coach Gautam Gambhir defended the pitch, while vice-captain Rishabh Pant said they should have been able to pull off the chase even in Gill's absence.\n\n\"Definitely there was help in the wicket,\" Pant said.\n\n\"A [target] of 120 can be tricky on these kinds of surfaces, but at the same time, as a team we should be able to soak in the pressure.\"\n\nReuters\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-11-17/iran-cloud-seeding-worst-drought-in-decades/106016566",
        "title": "Iran begins cloud seeding operations as severe drought bites",
        "publish_date": "Sun, 16 Nov 2025 22:32:23 +0000",
        "category": "finance",
        "authors": [],
        "text": "Iranian authorities have launched cloud seeding operations to induce rainfall as the country faces its worst drought in decades, according to state media.\n\nVideos broadcast by local media on Sunday showed heavy rains and even some flooding in several regions, but it was not clear if it was linked to the seeding.\n\n\"Today, a cloud seeding flight was conducted in the Urmia Lake basin for the first time in the current water year,\" which begins in September, Islamic Republic News Agency (IRNA) said late Saturday.\n\nUrmia, in the north-west, is Iran's largest lake, but has largely dried out and turned into a vast salt bed due to drought.\n\nIRNA added that further operations would be carried out in the provinces of East and West Azerbaijan.\n\nIran developed cloud seeding technology\n\nCloud seeding involves spraying particles such as silver iodide and salt into clouds from aircraft to trigger rain.\n\nDoes cloud seeding work? Tasmanian Liberals have said they will put a stop to cloud seeding if re-elected in this weekend's state election.\n\nLast year, Iran announced it had developed its own technology for the practice.\n\nOn Saturday, IRNA reported that rain had fallen in Ilam, Kermanshah, Kurdistan and Lorestan in the west, as well as in the north-western West Azerbaijan province.\n\nIt quoted the country's meteorological organisation as saying rainfall had decreased by about 89 per cent this year compared with the long-term average.\n\n\"We are currently experiencing the driest autumn the country has experienced in 50 years,\" it said.\n\nWater levels at reservoirs supplying many provinces have fallen to record lows. (Reuters: Majid Asgaripour/West Asia News Agency)\n\nState media has shown footage of snow falling on the Tochal mountain and ski resort, located in the Tehran area on the Alborz range, for the first time this year.\n\nIran, a largely arid country, has for years suffered chronic dry spells and heatwaves expected to worsen with climate change.\n\nRainfall in the capital Tehran has been at its lowest level in a century, according to local officials, and half of Iran's provinces have not seen a drop of rain in months.\n\nPeople have prayed for rain following the drought crisis in Tehran. (Reuters: Majid Asgaripour/West Asia News Agency)\n\nWater levels at reservoirs supplying many provinces have fallen to record lows.\n\nEarlier this month, President Masoud Pezeshkian warned that without rain before winter, Tehran could face evacuation, though he did not elaborate.\n\nOther countries in the region, including the United Arab Emirates, have also used cloud seeding to artificially produce rain.\n\nAFP",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-11-17/new-york-jets-nfl-player-kris-boyd-shot/106016502",
        "title": "NFL player in critical condition after being shot in New York",
        "publish_date": "Sun, 16 Nov 2025 21:45:04 +0000",
        "category": "sports",
        "authors": [],
        "text": "New York Jets cornerback and special teams stand-out Kris Boyd has been critically injured in a shooting in Midtown Manhattan, according to multiple news outlets.\n\nThe shooting happened just after 2am on Sunday, local time, outside a business on West 38th Street near 7th Avenue, according to the New York Police Department.\n\nA 29-year-old man was shot in the abdomen, police said.\n\nThe man was taken to Bellevue Hospital, where he was in critical, but stable condition.\n\nThere have been no arrests and the investigation is ongoing.\n\nPolice did not name the victim, but multiple news outlets reported that Boyd was the man shot.\n\n\"We are aware of the situation involving Kris Boyd and will have no further comment at this time,\" a Jets spokesperson said in a statement.\n\nBoyd's agent did not immediately respond to a text message inquiring about the incident.\n\nBoyd has not played this season, his first with the Jets, after going on the season-ending injured reserve list on August 18 with a shoulder injury that required surgery to repair.\n\nStream End Game with Tony Armstrong on ABC iview Tony Armstrong tackles Australia's overdue reckoning with racism in sport with the help of some of its biggest sports stars.\n\nHe signed with New York as a free agent in March and was expected to be a key part of a revamped special teams unit under new coach Aaron Glenn and special teams coordinator Chris Banjo.\n\nBut Boyd was hurt during the team's training camp practice on August 2 and was carted from the field after trainers checked out his left shoulder.\n\nBoyd was regarded as a special teams stand-out during his first six NFL seasons, including most of the past two with Houston.\n\nHe made headlines during the Texans' divisional play-off loss to the Kansas City Chiefs in January when he celebrated a forced fumble on a kick-off by ripping off his helmet and nearly shoving his special teams coach to the ground.\n\nBoyd played his first four seasons with Minnesota after being a seventh-round pick by the Vikings out of Texas in 2019. He signed with the Arizona Cardinals in 2023 and then joined Houston's practice squad later that season.\n\nTeammates asked for prayers for Boyd in social media posts on Sunday afternoon.\n\n\"Everybody please send prayers to my brother and teammate Kris Boyd and his family!!! Lord please hold your healing hand over Kris and guide him back to health and safety,\" linebacker Jermaine Johnson said in a post.\n\n\"Lord, place your mighty hand on him as he fights lord God. Guide every doctor, nurse, and surgeon who touches him lord,\" defensive tackle Harrison Phillips said in a post. \"Give his family strength! Kris is a fighter and we're all here for him.\"\n\nAP\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-11-17/deadly-esperance-fires-10-year-anniversary/106011936",
        "title": "WA bushfire-hit community fights for change",
        "publish_date": "Sun, 16 Nov 2025 21:34:01 +0000",
        "category": "finance",
        "authors": [],
        "text": "A decade on from devastating bushfires that claimed the lives of four people in regional Western Australia, there is concern not enough has been done to ensure the tragedy is not repeated.\n\nA remembrance service will be held today in Esperance, 700 kilometres south east of Perth, to remember the lives of Kym \"Freddy\" Curnow, Thomas Butcher, Julia Kohrs-Lichte and Anna Winther, who died on November 17, 2015 while attempting to flee from one of the worst bushfires the state has ever seen.\n\nA firefighter battles a bushfire at Grass Patch, north of Esperance, that claimed four lives in November 2015. (Supplied: Department of Fire and Emergency Services)\n\nFor 11 days, three separate infernos fanned across 300,000 hectares, destroying 30,000 hectares of crops, one house, 16 sheds and 4,500 head of livestock.\n\nIn the years that followed, two reviews were undertaken — one publicly funded and one private — and a coroner's inquest concluded with 12 recommendations.\n\nIn November 2020, the West Australian government agreed to take on 10 of those recommendations.\n\nBut local farmers and firefighters believe there is still much left to be desired when it comes to fully acting upon those directives.\n\nThomas Butcher, Anna Winther, Kym Curnow and Julia Kohrs-Lichte died while attempting to flee one of WA's worst bushfires. (Supplied)\n\nFire still at forefront of community minds\n\nEsperance shire president and volunteer firefighter Ron Chambers said some members of the community were still on edge at the first sign of smoke, 10 years on from the deadly blaze.\n\n\"It's funny when you start talking to people and just how quickly they reminisce or how they sort of say that it doesn't seem like 10 years,\" he said.\n\nRon Chambers says people still keenly remember the deadly fires. (ABC Esperance: Andrew Williams)\n\nIn the decade since the bushfires, many of the coroner's 12 recommendations have been acted upon, including the establishment of an aerial firefighting fleet based in Esperance over harvest, new fire trucks, and a phone repeater tower installed at Peak Charles.\n\nMr Chambers believes further change is required, but acknowledges there have been positive improvements in the past decade.\n\n\"We've seen an awful lot of changes in and around the requirements and equipment and those sorts of things for volunteer firefighters, and a lot of technology that's been introduced into those sorts of realms.\"\n\nDan Sanderson and Greg Curnow say more money needs to be spent on bushfire mitigation. (ABC Esperance: Tara De Landgrafft)\n\nCascade farmer Greg Curnow lost his uncle Kym, or \"Freddy\" as he was known, in the 2015 blaze and said there was a lot left to be addressed.\n\n\"There has been some really good improvements and aspects to it, there are aspects that are quite disappointing though and still really haven't been addressed in a meaningful way,\" Mr Curnow said.\n\nMitigation still a major concern\n\nIn coroner Sarah Linton's 2019 report was a recommendation to instil a long term fire mitigation strategy for Esperance, funded over 10 years.\n\nAccording to the Department of Fire and Emergency Services (DFES), since 2015 the state government has significantly increased its spending on bushfire mitigation on-ground works.\n\nLocal governments have been granted $9.5 million through the Mitigation Activity Fund Grants Program for on-ground works with $1.15 million of this spent within the Esperance Shire.\n\nA paddock of wheat grows at Cascade, north of Esperance. (ABC Esperance: Tara De Landgrafft)\n\nDan Sanderson, one of the farmers who spearheaded a privately funded review into the bushfires, said mitigation was key.\n\n\"When we did our review of the fire, and along with the coroner's findings from the inquest, mitigation was a big one and there are still problems with mitigation at the moment,\" Mr Sanderson said.\n\n\"I was looking at cost-effective solutions, and I've given up on the cost-effective solutions. All I want is effective solutions and that's probably been the biggest change for me in the last 10 years.\n\nFirefighters and farm response units battle an out-of-control bushfire at Grass Patch near Esperance on November 19, 2015. (Supplied: Department of Fire and Emergency Services)\n\nGreg Curnow agreed that mitigation was a priority, and said there needed to be more emphasis on local brigades carrying out the mitigation works.\n\n\"There's no 100 percenters in fire fighting, but mitigation is a 20 per cent. It's a big one,\" Mr Curnow said.\n\n\"It will be far more efficient, it will get done properly and safely, and at a fraction of the cost.\"\n\nDan Sanderson says not enough money is being spent of bushfire mitigation. (ABC Esperance: Tara De Landgrafft)\n\nWhile the agricultural community had been proactive in the decade since, Mr Curnow believed more money was needed for mitigation.\n\n\"We've invested significantly in machinery and firefighting apparatuses personally, and pretty much every business in this location does,\" Mr Curnow said.\n\n\"We had another incidence with a young man passing away two years ago, from almost the exact same sort of incident.\n\n\"These things happen — we're in a high-risk area with lots of reserves which are unmanaged, unmaintained.\n\n\"I think the risk is always going to be there, but if this continues, it isn't going to reduce without positive change.\"\n\nDan Sanderson looks at the quality of a paddock of wheat, 10 years on from the Esperance bushfires. (ABC Esperance: Tara De Landgrafft)\n\nStill waiting for legislation\n\nAnother point of contention for the Esperance community was the time it had taken for consolidated emergency services legislation to be drafted, which was another recommendation by the coroner.\n\nRon Chambers said they desperately wanted to see the detail of the bill.\n\n\"It is taking too long,\" Mr Chambers said.\n\n\"We need to get that act up so that we know what's in the act and the regulations that we'll work with.\"\n\nWheat growing at Greg Curnow's Cascade farm, a decade on from the 2015 bushfires. (ABC Esperance: Tara De Landgrafft)\n\nHowever Dan Sanderson hoped there would be enough time for regional brigades to review the act and have input before the legislation was enshrined in law.\n\n\"We need that consultation period where we can have a look at it and work at it,\" he said.\n\n\"I'm concerned now that it will get rushed through and there will be like three months. It's not gonna be long enough.\"\n\nDFES confirmed to the ABC that an Emergency Services Exposure Draft Bill was being prepared and that, once finalised, it would be released for public comment, including to regional brigades.\n\nHope for change\n\nWhile they continued to advocate for change, Dan Sanderson and Greg Curnow said they remained hopeful.\n\nGreg Curnow inspects some wheat at his property, which was impacted by the 2015 bushfires. (ABC Esperance: Tara De Landgrafft)\n\n\"Things have got a lot better responding to fires than what we went through in 2015,\" Mr Sanderson said.\n\n\" It's giving faith for the future, of being able to respond to fires better, and have less life-threatening instances. \"\n\nMr Curnow said while the improvements made in Esperance had not been replicated across the state, the local community had benefited from the change.\n\n\"I think we're in a hell of a lot better place than we were 10 years ago,\" he said.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-11-17/groote-eylandt-nt-rehabilitation-program-nt-prison-crisis/106007976",
        "title": "Unique rehabilitation program offers alternative to overcrowded prisons",
        "publish_date": "Sun, 16 Nov 2025 21:19:34 +0000",
        "category": "finance",
        "authors": [],
        "text": "On a secluded island in West Arnhem Land, a group of Anindilyakwa men are breaking new ground as residents of a centre that is the Northern Territory's only alternative to custody for men.\n\nThe Anindilyakwa Healing Centre, a 32-bed residential rehab facility, opened on Groote Eylandt this year after a decade of advocacy from local elders.\n\nFor participants like Wayne Bading, it has provided an opportunity for redirection.\n\n\"There's so much for us to do here, I feel alright, you know?\" he said.\n\n\"I've come from Darwin, so I'm glad I came back here.\"\n\nWayne Bading is a participant in Anindilyakwa Healing Centre's rehab program. (ABC News: Marcus Kennedy)\n\nThe six-month program, delivered by Drug and Alcohol Services Australia (DASA) and overseen by the NT Department of Corrections, has been designed to be tailored to the social and cultural needs of Anindilyakwa men specifically.\n\nProspective residents are assessed for risk on a case-by-case basis, with input from Corrections.\n\nOnce there, they are required to take part in physical health activities, psycho-educational programs, skills and employment opportunities in the local community and on-country learning from local elders.\n\nDASA chief executive Eloise Cole said the centre provided a unique model of care, centring the role of the local community in rehabilitation efforts while still falling within the Corrections framework.\n\nEloise Cole says the Anindilyakwa Healing Centre's model of care helps ensure the unique needs of every individual are met. (ABC News: Marcus Kennedy)\n\n\"I think the Anindilyakwa Healing Centre is one of a kind,\" she said.\n\n\"We have very strong partnerships with the Anindilyakwa elders who advise us on individual needs and concerns, then we also have a good partnership with community corrections, who ultimately decide what the men can and can't participate in.\"\n\nWith incarceration rates across the territory at an all-time high, however, those involved in the centre said they hoped similar initiatives elsewhere could relieve pressures and alter trends across the NT justice system.\n\n'We can ease the burden,' operators say\n\nFor local elders, the establishment of the Anindilyakwa Healing Centre came after seeing generations of local men caught in cycles of incarceration.\n\n\"The reason we wanted this is because I wanted my people to do their time here rather than in Darwin prison,\" local Community Justice Group chair Matthew McKenzie said.\n\nMatthew McKenzie says it was important to him that members of his community serve their sentence on country. (ABC News: Marcus Kennedy)\n\nAs a member of NT Corrections' Elders Visiting Program, fellow elder Elaine Mamarika said she had seen plenty of Anindilyakwa men lose their ties to the community while in custody.\n\n\"We always ask them why they go back to jail,\" she said.\n\n\" Sometimes they tell us that's their home, in prison. \"\n\nElaine Mamarika says the cycle of incarceration has some people in her community feeling like prison is their \"home\". (ABC News: Marcus Kennedy)\n\nThe centre's first residents entered at a time of unprecedented incarceration rates in the territory.\n\nAfter the Country Liberal Party (CLP) was elected on a tough-on-crime platform in August 2024, the NT prison population grew by about 600 people in nine months — the sharpest increase on record.\n\nAs of last Monday, there were 2,828 people inside NT prisons.\n\nAustralian Bureau of Statistics data shows 88 per cent of NT prisoners are Indigenous.\n\nWith current and former inmates reporting overcrowding and staff shortages in prisons, Ms Cole, who previously worked in the corrections sector, said she believed investing in alternatives to custody was a wise use of money.\n\n\"When you've got numbers as high as they are, it's incredibly hard for even the best of intentioned prison staff to provide rehabilitation and therapeutic supports,\" she said.\n\n\" We can help ease the burden on the system by having those men come here. \"\n\nAnindilyakwa Healing Centre is a 32-bed residential rehab facility on Groote Eylandt. (ABC News: Marcus Kennedy)\n\nLocal community integral to success\n\nMs Mamarika said the importance of the healing centre's location could not be understated.\n\n\"It helps them a lot because they feel that they belong here — they're here when we have funerals and other cultural things,\" she said.\n\n\" They're close to community and they talk [about] their problems. They just spit it out. \"\n\nKenny Mamarika says he's glad he can start his rehabilitation process on his home country. (ABC News: Marcus Kennedy)\n\nWalking through the community of Umbakumba after a skills-building session, healing centre resident Kenny Mamarika said he was glad he could revisit the place closest to his heart.\n\n\"This is my community,\" he said.\n\n\"I grew up here, my father's family are from here — I used to play footy on that oval.\"\n\nKenny Mamarika says the Anindilyakwa Healing Centre's rehabilitation program has helped keep him out of trouble. (ABC News: Marcus Kennedy)\n\nHe said his time in the healing centre has put his focus back on finding employment and returning to Umbakumba to look after his family.\n\n\"It's been good for me to stay out of trouble, to stay away from prison,\" he said.\n\nHealing centre service manager Saliosi Tupou said the centre's inextricable ties to people and places on Groote Eylandt were integral to its function.\n\n\"A lot of [the residents] were taking off to Darwin, hanging out in Darwin, getting into a bit of trouble and then staying in prison in Darwin and reoffending,\" he said.\n\n\" One of the main purposes of this place is to get the younger men to go and better the community for themselves — now, a lot of them are thinking about staying. \"\n\nSailosi Tupou says he believes his program's participants rehabilitate better in their home community. (ABC News: Marcus Kennedy)\n\nHopes for expansion hampered by government policy\n\nMr McKenzie said the healing centre was attracting interest from around the NT.\n\n\"I've been asked a few questions from the other communities,\" he said.\n\n\" They want to do the same thing in their community — I think we're leading the way. \"\n\nHowever, there are concerns that plans to establish similar initiatives across the territory could be hindered by the NT government's policy of abandoning Local Decision Making agreements (LDMs) in the NT.\n\nParticipants of the Anindilyakwa Healing Centre rehab program take part in psycho-educational lessons and on-country learning from elders. (ABC News: Marcus Kennedy)\n\nLDM agreements were established by the NT's previous Labor government with the goal of giving Aboriginal communities greater control of services such as health, education and justice.\n\nIt was under the Groote Archipelago Local Decision Making agreement that the government and local community established the Anindilyakwa Healing Centre.\n\nMs Cole said she would like to see communities across the NT establish healing centres of their own.\n\n\"From the evidence that we have so far, alternative-to-custody programs work in reducing reoffending rates and improving wellbeing,\" she said.\n\n\" I think everyone should get behind it and there should be more of it. \"\n\nFishing on Groote Eylandt as part of the Anindilyakwa Healing Centre's rehabilitation program. (ABC News: Marcus Kennedy)\n\nParticipants like Wayne Bading, meanwhile, would like other Anindilyakwa men in similar situations to take advantage of the opportunity available.\n\n\"There's plenty of stuff out here we can do; we enjoy it out here,\" he said.\n\n\"We just want to show what we're doing out here, to encourage more men like us.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-11-17/brisbanes-new-bus-network-saves-commuters-journey-times-/106011424",
        "title": "Brisbane's new bus timetable shaves journey times in first three months",
        "publish_date": "Sun, 16 Nov 2025 21:11:58 +0000",
        "category": "finance",
        "authors": [],
        "text": "Brisbane bus passengers have shaved an average of two minutes off their journeys in the first three months of the new bus timetable, new figures show.\n\nThe new bus network — the biggest change to Brisbane's timetables in two decades — started on June 30 this year.\n\nPatronage has increased by 17 per cent, while journey times have decreased by 7 per cent between July and September this year, when compared with the same period last year.\n\nBoth the state government and the city's council have lauded the early success of the new timetable, but transport advocates say improvements show the drastic need for a transport overhaul across south-east Queensland.\n\nData supplied to the ABC shows comparative analysis of patronage, journey and trip times for Brisbane buses between July and September 2024 and the same period this year.\n\nYear Trips ('000) Journeys ('000) Trip time (mins) Journey time (mins) 2024 22,072 15,900 18.2 31.6 2025 24,727 18,642 16.6 29.5 Per cent change 12% 17% -9% -7%\n\nThe data includes a period before Queensland's former Labor government brought in 50-cent fares in August 2024, which was found to have increased patronage.\n\nData at the end of the six-month 50-cent trial showed patronage increased on all public transport by 18.3 per cent, with bus travel up 15.8 per cent.\n\nTransport Minister Brent Mickelberg said the new bus network was giving commuters more frequent, reliable and connected services that actually worked for them.\n\nSince the new timetable, the proportion of buses that were on time increased by 5 per cent, up to 81 per cent.\n\nNew Brisbane bus timetable About three-quarters of Brisbane's bus services will change in some way, with services being cut, added, rerouted, renamed, or split in half.\n\nMr Mickelberg said Queenslanders had saved about $236 million on 114 million trips since 50-cent fares had been made permanent.\n\nLord Mayor Adrian Schrinner said the new network would deliver 160,000 extra trips every year and faster journeys for more than 45 million passengers.\n\n\"With more than 600 people moving to our city every week, we need to keep growing our transport network to keep Brisbane moving,\" he said.\n\n'No silver bullet' for congestion\n\nDespite the early success, peak motoring body RACQ said the new network had not had a meaningful impact on congestion, although it had not expected it to.\n\nRACQ head of public policy, Michael Kane, said the scale of congestion issues in Brisbane and south-east Queensland was such that there was no silver bullet.\n\n\"The bus network review should be considered as stage one of a much deeper and longer process of reform and change that is needed for public transport,\" he said.\n\nSix million people are expected to call south-east Queensland home by 2046. (ABC News: Chris Gillette)\n\nMr Kane said the organisation's member surveys since the new timetable launched showed that there was strong support for the Brisbane Metro in Brisbane and Logan.\n\n\"We can see the Brisbane Metro is very popular, but it's only two routes, mainly through the inner-city, and so what RACQ has been calling for … is a transformation of the bus network across the whole of south-east Queensland,\" he said.\n\nThe Adelaide Street tunnel, a dedicated connection for busways in the city, opened on September 29 and will affect the data in the future.\n\nBus services are now running on time about 80 per cent of the time. (ABC News: Lucas Hill)\n\nCr Schrinner said the council's focus had \"always been on helping residents get home sooner and safer, and these results show that's exactly what's happening\".\n\nTranslink's customer experience surveys for south-east Queensland bus passengers in 2025 showed an overall rating of 3.7/5 in July, 3.6/5 in August and 4.1/5 in September.\n\nBut council opposition leader Jared Cassidy said community feedback in surveys conducted by Labor painted a different picture, with the average rating of the network at 1.4/10.\n\nOf 361 responses, 70 per cent of people said their commute had increased, and 50 per cent said the number of transfers they had to perform had increased, while 70 per cent said they were not happy with the changes.\n\n\"Adrian Schrinner and his LNP council are pulling the wool over Brisbane's eyes,\" he said.\n\nWith south-east Queensland's population expected to reach 6 million by 2046, Mr Kane said current planning would not meet demand.\n\n\"We're going to catch up with Sydney's population in 20 years' time and Sydney has far greater levels of public transport and road infrastructure, which they've built over many decades, and in that 20 years, we will not be able to build the infrastructure that Sydney has today,\" he said.\n\n\"We are not going to be fixing congestion overnight.\"\n\nCalls for active transport links\n\nGriffith University transport and planning adjunct professor Matthew Burke said the new figures were in line with the expected outcomes of the new bus timetable, but it was great to see improvements in patronage and journey times.\n\n\"Anecdotally, there's been confusion for people in the changeover, that's always going to happen, but the department and operators seem to have done a reasonable job explaining the changes,\" he said.\n\nMatthew Burke says connecting active transport within suburbs and to public transport is the missing link for commuters. (ABC News: Glen Armstrong)\n\nHowever, the Bicycle Queensland chief executive said there was still a lot of \"mess in the system\" and authorities needed to address the disconnected and disjointed active transport network.\n\n\"[The new network] is proof of what's possible without a lot of money,\" he said.\n\n\"The southern bus network review was done without big additional investment into services; it was done through tactical planning and thinking about the system, not through mega projects and building.\n\n\"Buses on the north side will need a similar level of restructuring, and we shouldn't be afraid of doing that in a large hit like we did on the south side.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/rural/2025-11-17/harvest-100-farmers-music-poll-2025-crops-working-class-man/105990636",
        "title": "When you work till 3am harvesting grain, these songs keep you going",
        "publish_date": "Sun, 16 Nov 2025 21:00:06 +0000",
        "category": "finance",
        "authors": [],
        "text": "Move over Hottest 100 — farmers have their own annual music poll to count down their top songs while counting down the long hours behind the wheel harvesting crops.\n\nFarmers and agricultural workers can work 12 or 15-hour days without much of a break as they race to harvest the crop while it is in peak condition.\n\nThat optimal window means the job needs to be done and dusted before rain comes, which can temporarily stop harvest and reduce crop quality.\n\nHarvesting is a race against time and weather. (ABC News: Tim Lee)\n\nFarmer Sally Zacher, on South Australia's Eyre Peninsula, starts her day early, and she can still be going at 3am.\n\n\"If the weather's right, you just keep going,\" she said.\n\n\"As long as you've got storage, you just go.\"\n\nUnder such manic pressure, it is important for farmers to have something to keep them going.\n\nThis year, for the farmers who voted for their favourite songs in the Harvest 100, that something was overwhelmingly a 1980s Aussie classic.\n\nLoading...\n\nJimmy Barnes's Working Class Man claimed the number one spot in the annual song countdown, which is run by South Australia's grain industry.\n\nIt is a fitting choice for the poll, with many farmers struggling to get a crop out of the ground after two consecutive years of drought.\n\nAussie legend a farmer favourite\n\nNow in its fourth year, the Harvest 100 music poll was started by a South Australian organisation for SA farmers, but farmers around the country are encouraged to take part.\n\nBarnes attributes his strong resolve to his tough upbringing. (ABC News: Luke Rosen)\n\nThe man behind the winning song, Jimmy Barnes, was pleased to top the poll, as the song was written in tribute to hard-working people like Australian farmers.\n\n\"We're so thrilled to hear the farmers voted Working Class Man top of their Harvest 100 playlist this year,\" Barnes said.\n\n\"This is a song written about my audience, for people just like you farmers — people who work hard, people who strive to make a living and feed their families, and then on the weekend, maybe they might kick their heels up occasionally and come out and see a band play or listen to music at home.\"\n\nIt is the second time Barnes has won the countdown — taking top spot in the inaugural Harvest 100 in 2022 with Driving Wheels.\n\nLoading YouTube content\n\nOrganised by Grain Producers SA (GPSA), the vote was devised as a fun way to bring the harvesting community together and celebrate another hard year of work.\n\nGPSA chief executive Brad Perry said the winning song was a fitting choice, given the conditions farmers had again endured across much of the state.\n\n\"I think it reflects that it has been a hard slog this year,\" Mr Perry said.\n\nHarvest 100 2025 top 10 songs: Working Class Man by Jimmy Barnes When It Rains It Pours by Luke Combs Copperhead Road by Steve Earle The Best by Tina Turner Oklahoma Smokeshow by Zach Bryan Livin' On A Prayer by Bon Jovi The Gambler by Kenny Rogers Take It Easy by the Eagles Great Southern Land by Icehouse Mr. Brightside by The Killers\n\nAnd just like there are many different types of farmers, the countdown this year is an eclectic mix that has been pulled together in an online playlist.\n\nBrad Perry says he looks forward to the results of the playlist each year. (Supplied: Grain Producers SA)\n\n\"You can fire this on when you jump on the header and it'll give you hours of enjoyment,\" Mr Perry said.\n\n\"If you like anything from 80s country, rock, you name it.\n\n\"There's some modern songs in there, and even a couple of real classics that I probably didn't expect to make the cut … and, of course, a couple of really strong country songs.\"\n\nHaving a 'boogie' in the tractor\n\nMs Zacher said she looked forward to the countdown each year, which she alternated with ABC Radio to alleviate boredom.\n\nSally Zacher farms at Lock on South Australia's Eyre Peninsula. (ABC Eyre Peninsula: Jodie Hamilton)\n\n\"When it's getting late or when I'm bit sick of it [harvesting], I'll put on Spotify and put on some music,\" Ms Zacher said.\n\n\"I quite enjoy it [the Harvest 100], it's just such a total variety of music.\n\n\" It would be quite hilarious seeing me in the cab sometimes, because if a decent tune comes on, I do get a good boogie on, and yes, singing to the top of my voice. \"\n\nSouth Australian farmers have had a slow start to harvest this year due to seasonal conditions. (ABC News: Carl Saville)\n\nMs Zacher said it was a great feeling to get a shout-out by Jimmy Barnes during harvest this season, as his music has helped her through some long hours sitting in the chaser bin.\n\n\"His music is iconic,\" she said.\n\nSlow start to SA harvest\n\nSA's grain production this year is estimated at 8.5 million tonnes — higher than last year, but still below the five-year average after some regions missed rain during key growing times.\n\nWhile parts of the state have started harvesting, most areas will have to wait a bit longer before pressing play on the Harvest 100 playlist.\n\nColourful canola crops are expected to make good returns this season. (ABC South East SA: Elsie Adamo)\n\nElders Naracoorte agronomist Adam Hancock explained timing could be so variable across SA because of the different weather and soil conditions, and most had a delayed start to the season due to a late \"break\" of rain.\n\n\"The further south you go, the more rain you get. A big part of it is also temperature,\" Mr Hancock said.\n\n\"For every hour you drive further north, the 30-day average temperature might be 1 degree warmer, and that really accelerates plant growth and development … you go through the growth stage quicker and you get to harvest quicker.\n\nAgricultural workers spend long stretches on headers or in tractors during harvest. (ABC Rural: Laurissa Smith)\n\n\"Then there's this thing we call soil moisture holding capacity, like how big is your water bucket, how much soil moisture can you store?\n\n\"The bigger the bucket, the deeper your soil, the longer your crop is going to grow.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.smh.com.au/sport/cricket/origin-of-the-ashes-cricket-australia-unveils-new-energy-sponsor-to-replace-alinta-20251117-p5nfy3.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Origin of the Ashes: Cricket Australia unveils new energy sponsor to replace Alinta",
        "publish_date": "Mon, 17 Nov 2025 13:00:00 +1100",
        "category": "sports",
        "authors": [
            "Daniel Brettig"
        ],
        "text": "Australia’s biggest energy supplier, Origin Energy, will emblazon the shirts of the Test team this Ashes summer as part of a three-year, multimillion-dollar deal, two years after the end of Cricket Australia’s sponsorship by Alinta.\n\nThe new energy deal follows a summer of record crowds and audience figures for the Border-Gavaskar Test series against India, and has been announced days before the first Test against England in Perth on Friday.\n\nBen Dwarshuis, Pat Cummins, Phoebe Litchfield and Hannah Darlington with CA’s new sponsor. Credit: Cricket Australia\n\nIt is also a much-needed addition to CA’s balance sheet after the governing body’s sixth consecutive season recording a net operating loss, after distributing millions of dollars in annual funding to the state associations.\n\n“Origin joins Australia’s national sport during the biggest international season in our history and their commitment to cricket will help us grow the game further,” CA chief executive Todd Greenberg said in a statement.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/australia-news-live-coalition-announce-joint-energy-policy-ley-says-migration-policy-imminent-albanese-sets-sights-on-security-deals-with-fiji-and-vanuatu-20251117-p5nfu8.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Australia news LIVE: Coalition and Ley polling at record lows; Albanese says Australia will not be co-hosting COP climate summit next year as stand-off with Turkey continues",
        "publish_date": "Mon, 17 Nov 2025 12:55:09 +1100",
        "category": "finance",
        "authors": [
            "Emily Kaine"
        ],
        "text": "Liberal senator Sarah Henderson has slammed the government’s commitment to net zero by 2050 emissions targets, while refusing to comment further on Sussan Ley’s leadership of the Liberal Party.\n\nLoading\n\nSpeaking on Sky News this afternoon, Henderson claimed Anthony Albanese was lying to the Australian people, saying, “We are telling Australians the truth. This net zero rubbish is an ideology that’s not worked… we are not going to cop the prime minister’s lies, and it is time the Labor government and this prime minister started to tell the truth.”\n\nAfter publicly declaring that Ley was “losing support” among the Liberal party a few weeks ago, Henderson said she would “not going to be a commentator” on the internal workings of the party.\n\n“I made some comments a few weeks ago where I raised concerns, but my focus now is solely on being part of a strong team to sell our policy to the Australian people.\n\nLiberal senator Sarah Henderson. Credit: Alex Ellinghausen\n\n“I’m not going to add to the comments that I made a few weeks ago. What I’m saying is I’m absolutely supportive of the direction that we are going under Sussan Ley, and I’m not going to be a commentator on any more of the internal stuff.”",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/cycling/tributes-follow-sudden-death-of-28-year-old-paralympic-gold-medallist-20251117-p5nfyr.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Tributes follow sudden death of 28-year-old Paralympic gold medallist",
        "publish_date": "Mon, 17 Nov 2025 12:47:18 +1100",
        "category": "sports",
        "authors": [
            "Frances Howe"
        ],
        "text": "Paralympics Australia and AusCycling have paid tribute to gold medallist Paige Greco, who died suddenly after a medical episode in her home in Adelaide on Sunday. She was 28.\n\nParalympics Australia on Monday issued a statement from her mother, Natalie, on behalf of the family.\n\nPaige Greco after winning gold at the 2020 Tokyo Paralympic Games. Credit: Getty\n\n“Paige meant everything to us,” the statement said. “Her kindness, her determination, and her warmth touched our family every single day. She brought so much joy and pride into our lives, and the pain of her passing is something we will carry forever.\n\n“While we are devastated by her loss, we are incredibly proud of the person she was and the way she represented Australia … We are grieving deeply and ask for privacy, time, and space to navigate this overwhelming loss.”",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/property/news/woman-wins-4-8-million-glebe-home-with-her-father-bidding-at-auction-20251117-p5nfvd.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Woman wins $4.8 million Glebe home with her father bidding at auction",
        "publish_date": "Mon, 17 Nov 2025 12:42:09 +1100",
        "category": "finance",
        "authors": [
            "Carmen Forward"
        ],
        "text": "A woman represented by her father paid $4,815,000 for a four-bedroom house in Glebe, outbidding five others, mostly families, at auction on Saturday.\n\nThe home at 405 Glebe Point Road has ornate ceilings, a romantic vine canopy in the courtyard and a highly desired backyard for the buyer who has dogs.\n\nFive out of six registered parties made offers on the property with an initial guide of $4 million which was later lifted to $4.3 million.\n\nMost were families looking to upsize from smaller houses. Bidding opened at $3.8 million in $50,000 increments until it reached its $4.3 million reserve, then smaller bids were made until it sold.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/western-australia/wa-news-live-man-rushed-to-hospital-after-car-crashes-into-tree-at-herdsman-lake-20251117-p5nfwl.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "WA news LIVE: Man rushed to hospital after car crashes into tree at Herdsman Lake",
        "publish_date": "Mon, 17 Nov 2025 12:30:06 +1100",
        "category": "finance",
        "authors": [],
        "text": "Rio Tinto has abandoned plans to build a $215 million green steel research and development facility in Rockingham, instead opting to bring on environmental technology company Calix to build a green steel demonstration plant at the same site.\n\nThe BioIron facility was announced with much fanfare in June last year and would have seen a pilot plant using greener alternatives to coal to turn Pilbara iron ore into metallic iron.\n\nLoading\n\nHowever, earlier today the company said the furnace design for BioIron required “additional development to minimise technical risks and optimise its performance”.\n\nInstead, the company has signed an agreement with Calix and will front up $35 million to help it build a Zero Emissions Steel Technology plant (known as Zesty) on the same site.\n\nCalix already has a $44.9 million federal government grant to build the plant.\n\nThe news adds to the green steel controversy sparked last week after Premier Roger Cook declared the state wanted to use green steel in its $1.5 billion hospital build program.\n\nThe opposition criticised Cook’s claims because there are currently no proven green steel plants operating in WA, and there would likely not be before the build program is completed within four years.\n\nCook welcomed the announcement.\n\n“Coupled with my government’s recent announcement that government will take an “if not, why not” approach to green steel procurement on major government projects, the Zesty Green Iron Demonstration Plant will support our efforts to diversify WA’s economy so that it can remain the strongest in the nation,” he said.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/politics/federal/sussan-ley-the-travelling-saleswoman-is-spruiking-hastie-s-wares-20251117-p5nfvj.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Sussan Ley, the travelling saleswoman, is spruiking Hastie’s wares",
        "publish_date": "Mon, 17 Nov 2025 12:13:11 +1100",
        "category": "finance",
        "authors": [
            "Nick Bonyhady"
        ],
        "text": "“We had a leadership ballot in the Liberal Party room six months ago,” Ley told Fordham. “I’m the leader and I’m working hard every day to deliver a serious, compelling policy agenda.”\n\nLey insisted she was unbothered by the stunt on a radio station that conservative leaders tend to favour, and was focused instead on real Australian concerns.\n\nAsked who she preferred as leader, Pattie said: “Certainly Andrew, definitely not Sussan.” No coincidence that Sheena, Narelle, Dominic and Simone all said the same.\n\n2GB host Ben Fordham didn’t declare open season on Opposition Leader Sussan Ley. He didn’t have to. The run of callers his producers lined up to declare their preference for backbencher Andrew Hastie, her undeclared challenger, did all the talking.\n\nIt was the same message she delivered on ABC breakfast radio, Channel Seven breakfast television, and doubtless much the same as the one she will tell youth outlet The Daily Aus and triple j’s Hack program later in the day in a media sales blitz spanning the ideological spectrum.\n\nOn Sunrise she insisted too many migrants were coming to Australia but wouldn’t provide her own ideal figure. “Well hang on, you’re not giving a number, so how do you know that their number’s wrong?” Natalie Barr wanted to know. The Liberals were working on a plan, Ley said, that would let Australia’s infrastructure cope better with the number of arrivals.\n\nABC AM host Sabra Lane asked Ley to square her energy plan, which relies on more ageing, or even new, coal plants to bring down electricity costs, with a CSIRO finding that renewables are slightly cheaper than fossil fuels to bring online.\n\n“I’m not going to comment on lines from reports. I’m commenting on what’s going on in the real world around me and the real facts,” Ley shot back. The cost of new electrical kit to make renewables reliable, transmission and firming power all made renewables more expensive, she argued.\n\nAs Ley tries to flood the zone with her talking points, Hastie is pursuing a very different strategy, which consists largely of Instagram posts, safe interviews and newsletters that read like a mix of a first year course on Western Civilisation mixed with a highly combative TikTok feed.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/property/news/from-unliveable-1930s-queenslander-to-2-7-million-street-record-20251117-p5nfw2.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "From ‘unliveable’ 1930s Queenslander to $2.7 million street record",
        "publish_date": "Mon, 17 Nov 2025 11:58:05 +1100",
        "category": "finance",
        "authors": [
            "Sarah Webb"
        ],
        "text": "A young couple who flipped an “unliveable” 1930s Queenslander have made a motza on their “risky reno”, pocketing $2.71 million at auction on Saturday and setting a street price record.\n\nThe former two-bedroom shack at 6 Antill Street, Wilston, was all poky rooms and peeling paint when it was snapped up in 2022 for $990,000.\n\nThe pair, who work in the construction industry, spent a year gutting and rebuilding it into a four-bedroom, three-bathroom family home with a media room, designer kitchen, al fresco dining space and a luxe spa-style ensuite, with the end product smashing the Antill Street house price record by just over $200,000.\n\nSix bidders registered, but an opening bid from a buyers’ agent of $2.43 million quickly thinned the field to three.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/business/the-economy/trump-changes-his-mind-about-bananas-and-coffee-20251117-p5nfv1.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Trump changes his mind about bananas and coffee",
        "publish_date": "Mon, 17 Nov 2025 11:57:41 +1100",
        "category": "finance",
        "authors": [
            "Stephen Bartholomeusz"
        ],
        "text": "That should have been obvious to Trump and his advisers – as it was to most with a basic understanding of trade and economics – from the outset, but Trump’s Trade Representative, Jamieson Greer, was adamant during a Senate hearing in April, when the reciprocal tariffs were supposed to take effect, that there would be no exemptions or exclusions from them. Now there are, in a tacit admission by the administration that, contrary to what it has consistently argued, that tariffs do raise prices and are increasingly paid by US consumers. Bananas and coffee illustrate perfectly how misconceived the tariffs are. Credit: Bloomberg Bananas and coffee illustrate perfectly how misconceived the tariffs are. The US imports almost all its bananas and coffee, most of its from South America and, in the case of coffee, from Brazil in particular. More than 99 per cent of US coffee is imported, with nearly a third of it from Brazil. Trump imposed a 50 per cent tariff on Brazil – a base 10 per cent tariff and an extra 40 per cent rate as punishment for the prosecution of Trump’s friend and ideological ally, Jair Bolsonaro, for an attempted coup. Not surprisingly, the retail price of coffee has soared nearly 19 per cent from a year ago.\n\nSimilarly, the price of bananas, which the US mainly imports from Guatemala and Ecuador, is up about 7 per cent. Loading Beef prices, where even Australia, which has a trade deficit with the US, is subject to Trump’s 10 per cent baseline tariffs, have also surged. According to the St Louis Federal Reserve, they are up by more than 14 per cent this year. The US herd is its smallest in 70 years, so the tariffs have a magnified impact on prices. More broadly, the US Tax Foundation has estimated that the tariffs have pushed up retail prices by 4.9 per cent this year, while the Yale Budget Lab has calculated that they will cost the average US household $US1800 ($2750).\n\nWith the political pain mounting, Trump has decided to roll back some of the tariffs on products that have high visibility with consumers and their perceptions of affordability. In other words, Trump’s strategy for lowering prices is to unwind some of the tariffs that he has claimed would help lower prices. The administration consistently claims that prices and inflation are falling, when the official data, and households’ own experiences, say otherwise. While not backing away from its erroneous claims, the move to lower tariffs on a raft of household staples contradicts that White House messaging. It is conceivable that the move to wind back some of the tariffs will be less effective than the White House hopes.\n\nIn the early months after the tariffs were announced, US importers stockpiled products before the tariffs came into effect, blunting their impact on prices. With Trump dithering over the introduction of the new duties, and constantly tinkering with them as trade deals were negotiated with individual countries and companies, importers generally absorbed some of their cost while waiting to understand where the final trade picture would settle (if it ever settles). More recently, a greater proportion of their cost has been passed onto consumers, a trend that is likely to continue. Goldman Sachs has calculated that, in April, US imports picked up about 64 per cent of the tab for those tariffs in force, with foreign exporters absorbing 14 per cent and US consumers 22 per cent. By October, the US companies were paying 27 per cent of the new costs, foreign exporters 18 per cent and US consumers 55 per cent. By mid-2026, Goldman has said, importers will pay 8 per cent, foreign exporters 25 per cent (as US importers identify suppliers willing to absorb more of the cost) and US consumers 67 per cent.\n\nAs was the case when, in Trump’s last term he imposed tariffs on imports of steel and aluminium, there will also be an element of US companies using the protection they provide to raise their own prices. Trump’s popularity and perceptions of his credibility as a manager of the economy have been sinking, raising concerns within the Republican ranks about their fate at next year’s midterms. Credit: Bloomberg The Peterson Institute for International Economics estimated that the cost to steel-consuming companies was $US650,000 for every steel industry job saved by the tariffs and that they added $US270,000 to domestic steel producers’ profits for each of those jobs saved. In any category where the US doesn’t produce a product, or where its domestic industries can’t fully supply products Trump has hit with tariffs – even some of those where he is reducing the rate of the duty – there is an opportunity for domestic companies to raise prices or, where tariffs are being reduced, for importers to maintain prices and boost their profitability in the process. For lovers of bananas and coffee, the tariffs might have been lowered, but the national emergency might not yet be over!",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/sky-sports-female-focused-channel-was-condescending-rubbish-women-deserve-better-20251116-p5nftl.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Sky Sports’ female-focused channel was condescending rubbish. Women deserve better",
        "publish_date": "Mon, 17 Nov 2025 11:55:57 +1100",
        "category": "sports",
        "authors": [
            "Hannah Kennelly"
        ],
        "text": "We think women like sport ... but only if the coverage is dumbed down and has hot pink subtitles.\n\nThat appears to be the thinking behind Sky Sports’ short-lived female-focused brand Halo – which was axed three days after it launched online following fierce backlash for content that viewers deemed “patronising and disappointing”.\n\nHalo lasted just three days after backlash around its posts. Credit: Aresna Villanueva\n\nLast Friday, the global broadcasting giant launched Halo – a new TikTok channel dubbed “the lil sis” of Sky Sports and “created specifically for female sports fans”.\n\n“We’re about all sports and championing female athletes,” the broadcaster said in a now deleted post. “We’re here for the culture, community and connection. We don’t just watch sports – we live it.”",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/lifestyle/health-and-wellness/13-key-questions-about-prostate-cancer-answered-by-a-specialist-20251021-p5n45p.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "13 key questions about prostate cancer answered by a specialist",
        "publish_date": "Mon, 17 Nov 2025 11:53:21 +1100",
        "category": "lifestyle",
        "authors": [
            "Phil Hilton"
        ],
        "text": "Localised: 95 per cent of patients will be alive 10 years after treatment. Locally advanced: The five-year survival rate is 70-90 per cent. Metastatic: This falls to 30 per cent. 2. What is my risk of developing prostate cancer? The average man’s risk is one in eight, but certain cohorts have higher risks. For Afro-Caribbean men, the risk is one in four. There is more data on the way about patients with a family history of prostate cancer, and this is related to age (a first-degree relative who had prostate cancer at 55 or below is at greater risk than someone with a relative who had the disease at 90).\n\nLoading Then there are those with the BRCA gene mutation. There is no guarantee that you will have prostate cancer if you have the BRCA mutation, but there is a strong association. We’re focusing on identifying high-risk groups to develop screening programmes. We give people a questionnaire and, depending on the answers, we decide whether they need a blood test and scanning. 3. What symptoms should I look out for? Prostate cancer in its early stages is asymptomatic, so we pick up a lot of people when they are having cholesterol checks, and a prostate blood test is suggested. Symptoms predominantly involve the waterworks, as the water pipe goes through the prostate. When the prostate enlarges, it can cause problems. Potential symptoms include blood in the urine, back pain, fatigue, and sometimes erectile dysfunction. Early disease is slightly ambiguous, but in more advanced disease, we see back pain and lymph node enlargement. Don’t wait for symptoms if you are in a high-risk group.\n\nFatigue can be a sign of something more serious. Credit: iStock 4. What’s the main test used for screening? The way we test for prostate cancer now is a blood test: the PSA (prostate-specific antigen). This is an enzyme that the prostate produces to keep the semen in a semi-liquid form. The test was invented in 1977 and is like any other blood test. 5. How accurate is the PSA test? The sensitivity (the ability correctly to spot cancer) of the PSA for detecting prostate cancer is 70-80 per cent, but the specificity (the ability correctly to diagnose the absence of cancer) is 30-40 per cent. The specificity is the issue, as PSA levels can fluctuate: it’s prostate-specific but not prostate cancer-specific. If the prostate increases in size, or there’s a prostate infection or a urinary tract infection, the PSA goes up. After recent ejaculation, the PSA goes up. If someone goes for a cycle ride and then has a blood test, the PSA goes up. Hence why we tend to use MRI scans alongside the PSA test.\n\n6. If I have a prostate cancer diagnosis, what happens next? Patients will have an MRI and biopsy, then return for a meeting. They’ll go to a multidisciplinary team meeting with all specialists – oncologists, surgeons, nurses – who work together. We’ll have a discussion with the patient and their family, ensuring liaison is the most important thing. We place patients into risk groups (low, medium, high) and discuss treatment options. The earlier that cancer is picked up, the more treatment options are available. If we’ve picked it up at a more advanced level, the options are more restricted. Treatment options include: Close monitoring – PSA and MRI tests. PSA is a good monitoring tool and MRIs are far quicker when used in this way. This is not treatment, just keeping a watchful eye.\n\nLoading Focal therapy – treatment applied only to the specific areas with cancer identified by MRI. This can be ultrasound (high-intensity focused ultrasound to destroy cancerous areas) or focal cryotherapy (freezing and killing cells with very low temperatures). Focal therapy is less invasive but there’s a 20-40 per cent chance the cancer can come back. Radiotherapy – radiation applied to kill cancer cells. This includes external beam radiation, brachytherapy (radioactive seeds placed in the gland), and targeted radiotherapy. Robotic surgery – removing the prostate using robot-assisted surgery for precision. This means significantly less blood loss and faster return to work than traditional open surgery. The main focus is to cure patients. Patients are given all options without bias. Patients can also decide to get another opinion – they do that a lot.\n\n7. How quickly does it spread? When prostate cancer is diagnosed, we look at three parameters: PSA level, grade on biopsy, and scan findings. Low-grade prostate cancer is slow-growing and the risk of progression is 20-30 per cent over 10 years. Intermediate-grade can spread over months to a few years. High-grade can be fast-growing and may spread in a few months. This needs urgent treatment.\n\n8. What are the potential side effects? No treatment has zero side effects. The main side effects are ejaculatory issues, urinary incontinence, and sexual dysfunction. In some cases, we provide hormonal treatment that induces a male menopause. Loading Testosterone is to prostate cancer what fuel is to fire, so sometimes we administer these hormones. This can cause mood changes, fatigue, breast enlargement, breast tenderness, anger issues, brain fog, and potential long-term bone loss, similar to women in menopause. There’s also an associated risk of cardiac issues in the long term with hormone treatment. Getting back to your usual routine and function can take some time. Credit: iStock\n\n9. What can be done to alleviate the side effects? If someone has erectile issues, we can offer tablets, injections or vacuum pumps, or we can insert an inflatable cylinder into the penis – it’s rare but it’s done. If there is incontinence, most of the time normal function returns. We work on pelvic muscle training, and have pads, penile clamps, emotional support and counselling. We can implant an artificial sphincter, but robot surgery and aftercare is sufficiently advanced, meaning enough of the anatomy and nerve structure is preserved and very few people need the sphincter. Most of the time post-surgery, the first week is stormy, but within about three months, 70 per cent will regain control, and within 12 months most people are dry. Only 5 per cent have lasting issues. Faecal incontinence is more associated with radiotherapy and may require surgery – but this affects only 0.1 per cent. It’s extremely rare and it all improves over time. With hormone treatments, we can give drugs to prevent breast enlargement. If they are experiencing hot flushes, we can offer acupuncture. Exercise is very helpful in dealing with weight gain or diabetes.\n\n10. Can people decide against treatment? Suppose a 93-year-old man is diagnosed with prostate cancer – we put him on a watchful waiting pathway, where we do some tests and keep an eye on them. The PSA is a good marker once there is a diagnosis. We use doubling time. If someone has a PSA test in January and they have a PSA of four, and by March it’s eight, that is definitely something we need to investigate. We know overdiagnosis and overtreatment can be a problem and we do a lot of work to prevent that happening. If a patient doesn’t want any treatment, we will watch them and test them. 11. How do I know whether the treatment is working? We monitor patients based on PSA levels, scans, and symptoms. We bring patients back to clinic, involve their GPs, and engage community nurses. Success rates are very high: 90-95 per cent for locally confined prostate cancer.\n\nThis depends on initial pathology, but if the cancer is confined to the prostate, we’re talking about a significant chance of complete cure. We’re seeing major improvements in survival data with modern treatments. 12. What is the effect on my fertility? Treatment will render you infertile. We routinely bank patients’ sperm – if they haven’t completed their family, we organise that the next day [after diagnosis], usually. 13. What are the chances of cancer coming back? It all depends on the treatment. Success rates are very high.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/cricket/the-build-up-to-the-ashes-20251117-p5nfyh.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "The build-up to the Ashes",
        "publish_date": "Mon, 17 Nov 2025 11:51:55 +1100",
        "category": "sports",
        "authors": [],
        "text": "Opinion\n\nAfter Terry Alderman was taken out by a pitch invader in the first Test, second-string bowlers were called upon to play key roles in the series. This series looks destined to follow a similar path.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/politics/federal/weak-liberal-party-moderates-as-shameless-as-internal-net-zero-opponents-20251117-p5nfv3.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Weak Liberal Party ‘moderates’ as shameless as internal net zero opponents",
        "publish_date": "Mon, 17 Nov 2025 11:50:19 +1100",
        "category": "finance",
        "authors": [],
        "text": "It’s not a fun time to be a Liberal Party moderate. This year’s federal election wiped out a series of heavyweights, reducing the faction to just 16 members out of a partyroom of 51. It was also the second election in which teals tightened their grip over the inner-city seats traditionally the domain of moderate MPs.\n\nThe faction has now been comprehensively steamrolled on net zero, with the party of Robert Menzies last week adopting the climate change policies of a bunch of reckless and ignorant political operatives otherwise known as the Nationals.\n\nThe final policy is actually far worse than it seems at first glance. Not only has the Liberal Party abandoned any commitment to net zero, it also pledged to scrap Labor’s legislated suite of emissions reduction mechanisms and opened the door to using taxpayer funds to subsidise new or extended coal-fired power plants.\n\nThe Herald does not dispute that rising energy costs are a massive challenge for consumers and industry. But for many conservative MPs, this new policy is climate denialism masked as concern for affordability.\n\nBefore Wednesday’s partyroom showdown on net zero, Liberal moderates were threatening to quit the frontbench should the party drop its Scott Morrison-era commitment to net zero.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/property/news/expat-pays-965-000-for-a-converted-mechanic-s-shop-with-soaring-ceilings-at-auction-20251117-p5nfvf.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Expat pays $965,000 for a converted mechanic’s shop with soaring ceilings at auction",
        "publish_date": "Mon, 17 Nov 2025 11:46:54 +1100",
        "category": "finance",
        "authors": [
            "Shona Hendley"
        ],
        "text": "In Seddon, a converted mechanic’s shop, with a soaring seven-metre-high ceiling, was sold under the hammer for $965,000, or $165,000 over reserve, at auction on Saturday.\n\nThe two-bedroom home at 2/2A Lyons Street had a price guide of $750,000-$825,000 and a reserve of $800,000.\n\nThe industrial, warehouse-style apartment attracted over one hundred parties throughout the 24-day campaign, said selling agent Max Marcialis from Village Real Estate.\n\n“It was a good campaign with the property’s unique style and location, both big selling points,” he said.",
        "source": "SMH"
    },
    {
        "url": "https://www.sbs.com.au/news/article/australian-paralympic-gold-medallist-paige-greco-dies-aged-28/rfmq1rg8u",
        "title": "'We are heartbroken': Australian cycling mourns Paralympian gold medallist Paige Greco",
        "publish_date": "Mon, 17 Nov 2025 01:28:21 +0000",
        "category": "sports",
        "authors": [],
        "text": "Australian Paralympic gold medal-winning cyclist Paige Greco has died at age 28.\n\n\n\n\n\nThe para-cyclist died in her Adelaide home on Sunday after experiencing a \"sudden medical episode\".\n\n\n\n\n\n\"Paige meant everything to us. Her kindness, her determination and her warmth touched our family every single day,\" Paige’s mother, Natalie Greco, said in a statement released by AusCycling on behalf of the family.\n\n\n\n\n\n\"She brought so much joy and pride into our lives, and the pain of her passing is something we will carry forever.\n\n\n\n\n\n\"While we are devastated by her loss, we are incredibly proud of the person she was and the way she represented Australia.\n\n\n\nGreco won Australia’s first gold medal at the Tokyo 2020 Paralympic Games, also breaking the world record in the Women’s C1–3 3000m individual pursuit. Source: PA / Tim Goode \"As a family, we are deeply grateful for the support shown by so many people connected to Paige, including her teammates and friends. Paige cherished the connections she made through her sport, and we take comfort in knowing how widely she was loved.\n\n\n\n\n\n\"We are grieving deeply and ask for privacy, time and space to navigate this overwhelming loss.\"\n\n\n\n\n\nGreco was one of Australia’s most accomplished para-cyclists and a history-making Paralympian.\n\n\n\n\n\nShe won Australia’s first gold medal at the Tokyo 2020 Paralympic Games, also breaking the world record in the Women’s C1–3 3000m individual pursuit.\n\n\n\n\n\nShe added bronze medals in the women’s C1–3 road race and time trial, cementing her status as a world-class competitor across both track and road disciplines.\n\n\n\n\n\nGreco claimed multiple World Championship titles and World Cup medals across her career, including a 2025 World Championship bronze in the Road Race, and consistently helped raise the standard of para-cycling on the international stage.\n\n\n\nCycling community in mourning\n\nChief executive of AusCycling Marne Fechner said: \"We are heartbroken by the tragic news of Paige’s death. Paige was an extraordinary athlete who achieved outstanding accomplishments at the highest levels of our sport. Much more than that, she touched the lives of everyone around her with her positive spirit and courageous outlook.\"\n\n\n\n\n\nCameron Murray, chief executive of Paralympics Australia, said Greco was an \"extraordinarly athlete\" and a \"remarkable person\" and her death was devastating.\n\n\n\n\n\n\"We extend our deepest condolences to Paige’s loved ones and to those who were closest to her. The sadness being felt across Paralympics Australia today is a reflection of the enormous regard in which she was held,\" he said.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/more-schools-found-to-have-asbestos-contaminated-sand-products-midday-news-bulletin-17-november-2025/qdqk8uupv",
        "title": "More schools found to have asbestos-contaminated sand products | Midday News Bulletin 17 November 2025",
        "publish_date": "Mon, 17 Nov 2025 01:10:49 +0000",
        "category": "finance",
        "authors": [],
        "text": "Listen to Australian and world news and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT:\n\n\n\n\n\nRemediation underway after the recall of asbestos-contaminated sand products\n\nThe Coalition attempts to win over voters with its energy policy\n\nJannik Sinner successfully defends his ATP Finals title.\n\n\n\n\n\nAsbestos-contaminated coloured play sand has been identified at more than 100 sites in South Australia.\n\n\n\n\n\nThat is now the third jurisdiction in Australia impacted by the national recall notice issued last week for imported sand products that were tested and found to contain traces of asbestos.\n\n\n\n\n\nThe product safety regulator said the risk of inhalation of asbestos from the product is low.\n\n\n\n\n\nSchool closures were announced on Friday - 16 in Canberra and one in Brisbane.\n\n\n\n\n\nToday nearly 70 schools are closed in Canberra.\n\n\n\n\n\nSouth Australia's Department for Education says it is helping to manage the removal of the items, adding that no schools have been closed, but a hazard alaert has been issued to all schools and preschools.\n\n\n\n\n\nACT Education and Early Childhood Minister Yvette Berry says a remediation process is underway.\n\n\n\n\n\n\"I understand that this will be a significant impact on families and on work places in our public school system. However, this is best practice in managing hazardous materials. And I am committed to making sure that we put the safety of our staff and students first.\"\n\n\n\n\n\nOpposition leader Sussan Ley has rejected concerns that she could face a leadership challenge.\n\n\n\n\n\nFollowing a week of meetings, the Coalition officially announced their energy policy on Sunday formally ditching the commitment to net zero emissions by 2050 - and saying energy prices are the new focus.\n\n\n\n\n\nNationals leader David Littleproud told Sky News, he is confident the energy policy is the right way to go with voters.\n\n\n\n\n\nHe says questions about Sussan Ley's position as leader are for members of the Liberal Party, but he feels she has handled the policy issue well.\n\n\n\n\n\n\"We could have just said no, straight after the election to net zero. But we didn't. We did the mature thing that created a pathway of common sense for better energy and climate policy in this country. And much of those principles are shared by the Liberal and National Party. And that's proven by the position we've got to. And while it might seem to have been a little torturous at times, I think you've got a better policy in front of the Australian people as an alternative.\"\n\n\n\n\n\nVictoria Police say it has seized a record amount of knives and machetes.\n\n\n\n\n\nMore than 15,000 weapons have been taken off Victoria's streets so far in 2025, an average of 47 per day.\n\n\n\n\n\nIt is the second consecutive year the record was broken, most weapons were taken during searches related to known offenders and police also targeted youth gang members.\n\n\n\n\n\nVictoria Police Chief Commissioner Mike Bush says there is no place for knives and machetes at shopping centres, bus stops or train stations.\n\n\n\n\n\n\" And Victoria Police will continue that focus to prevent this kind of crime. And we will do that by targeting locations and by targeting the suspects that we believe are involved in these crimes. My message to offenders who want to carry weapons with the intent of harming others is: that our people, our officers, will relentlessly pursue them.\"\n\n\n\n\n\nFormer A-League great David Williams has won the Coach of the Year at the 2025 National Aboriginal and Torres Strait Islander Sport Award, for taking a First Nations football team to this year's Emerging Socceroos Tournament.\n\n\n\n\n\nMr Williams, who played for Perth Glory until his injury last year, announced in early November that he wouldn't return to the team as a player.\n\n\n\n\n\nMr Williams told NITV he feels honoured to receive the award.\n\n\n\n\n\n\"For me, it's special because I believe that everything happen for a reason, I got injured in December, which gave me the chance and pathway to continue on and be a coach while I was still contracted. You know, it was one of those I fell into that type of role, fell into the right hands of some people, and was able to get into a role and coach young kids, which is what I want to do. And it's been great so far.\"\n\n\n\n\n\nIn Tennis, Italy's Jannik Sinner retains his ATP Finals title, after defeating Spanish world number one Carlos Alcaraz 7-6(4) 7-5.\n\n\n\n\n\nSinner, backed by a jubiliant Italian crowd, fell to the floor after breaking his rival's serve in the final game before racing to celebrate with his team.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/video/the-worst-possible-situation-this-major-city-only-has-a-few-days-of-water-left/jo6lm12cr",
        "title": "'The worst possible situation': This major city only has a few days of water left",
        "publish_date": "Mon, 17 Nov 2025 00:43:29 +0000",
        "category": "finance",
        "authors": [],
        "text": "'The worst possible situation': This major city only has a few days of water left\n\nPublished 17 November 2025, 12:31 am\n\nIran is experiencing an unprecedented water crisis, which has not been seen for more than six decades. Tehran, famous for its surrounding snowy mountains, has had no rain in over 200 days. Its main water sources are in a dire situation; two major dams supplying the capital are at less than 10 per cent capacity. This story was produced in collaboration with SBS Persian.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/coalition-cements-climate-policy-no-net-zero-more-fossil-fuel-as-a-move-towards-nuclear/s3xi9d3di",
        "title": "Coalition cements climate policy: no net zero, more fossil fuel as a move towards nuclear",
        "publish_date": "Mon, 17 Nov 2025 00:42:13 +0000",
        "category": "finance",
        "authors": [],
        "text": "Listen to Australian and world news and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT:\n\n\n\n\n\nThe Coalition has unveiled their full energy policy after a party room meeting, with the Liberals and Nationals formally agreeing to dump the net zero by 2050 emissions reduction target.\n\n\n\n\n\nOpposition leader Sussan Ley says Australian governments have long been doing more than their fair share to lower carbon emissions.\n\n\n\n\n\n\"Since 2005 and the last 20 years, this government has raced ahead and emissions have been reduced at one and a half times the rate of comparable countries. And if we are to reach their target in 2050, they will have to double again. That's not responsible emissions reduction, that's not doing our fair share. Now this is hurting Australian families and it's hurting Australia's amazing small businesses.\"\n\n\n\n\n\nThe new stance comes after the Liberal party followed in the footsteps of their Coalition partners in scrapping net zero from their policy platform.\n\n\n\n\n\nThey say they want to unlock more investment in gas supply and infrastructure, establishing an east coast gas reservation scheme.\n\n\n\n\n\nThe Coalition also wants to strip climate change from the national energy regulator's list of objectives.\n\n\n\n\n\nLiberal leader Sussan Ley and Nationals leader David Littleproud say they will remove emissions reduction considerations from the Australian Energy Market Operator (AEMO), which should boost supply and lower prices.\n\n\n\n\n\nLEY: \"By giving the national electricity market the objective of affordable power we know that the investments we make and the rules that we set will be all about bringing energy prices down.\"\n\n\n\n\n\nLITTLEPROUD: \"Exactly and this is a practical way of changing the mandate of AEMO. Their first mandate is to source energy predicated on the 2030-35 targets, that means that we have latent supply, or base load, sitting there that we need to increase the supply of and actually drive down those prices by the simple principle of demand and supply.\"\n\n\n\n\n\nThe CSIRO and international energy experts have consistently found that renewable energy with storage and backup generation to ensure reliable supply - known as firming - is the cheapest form of new electricity.\n\n\n\n\n\nBut in their new energy plan, the Coalition hopes to shift away from renewables by removing nuclear technology bans.\n\n\n\n\n\nThe CSIRO estimates it would take at least 15 years for Australia's first nuclear reactor to come online after these bans are scrapped.\n\n\n\n\n\nThe Nationals leader says they intend to boost fossil fuel production in the short term to help ease that transition.\n\n\n\n\n\n\"Taking a technology agnostic approach to that, when you look in my home state of Queensland, they intend to sweat out their coal-fired power stations. What you do by expanding it is you actually put that downward pressure right across all sources of energy and what it also does is it buys the time for us to transition into things like nuclear energy.\"\n\n\n\n\n\nThe latest report from the independent Climate Action Tracker puts the world on course for devastation, with global temperatures set to heat up by 2.6 degrees Celsius above preindustrial times by the end of the century.\n\n\n\n\n\nExperts say these rises could see the end of agriculture in the United Kingdom and much of Europe, with the loss of coral reefs, rising sea levels and lethal heat and droughts expected around the world.\n\n\n\n\n\nAssociate Professor Joel Gilmore, from Griffith University, is a member of the Climate Council and an energy systems expert.\n\n\n\n\n\nHe says the new policy approach from the Coalition is a major setback for the climate and the future of renewables investment.\n\n\n\n\n\n\"Fighting against net zero is fighting against gravity. This is a future the whole world is moving towards and every time Australia flip flops on this policy, investors are starting globally to look at other places to invest. So it is critical that we have a clear, united view that we are going to do net zero and bring costs down for all Australians.\"\n\n\n\n\n\nThe Coalition says they will still seek to reduce emissions in alignment with countries around the world but they have not set any targets and are promising to remove what they describes as 'punitive' mandates against high emissions projects.\n\n\n\n\n\nThey'll also scrap penalties under the New Vehicles Emission Standard and ditch the tax benefit exemption policy for electric vehicles.\n\n\n\n\n\nThe Albanese government immediately criticised the Coalition's policy update.\n\n\n\n\n\nSenator Penny Wong has told the ABC the decision to abandon net zero has pushed the Liberal party to the fringes of its conservative wing.\n\n\n\n\n\n\"This used to be a serious mainstream political party in this country and now it is overrun by the fringes. They are trying to outflank Pauline Hanson. And what I'd say to Sussan Ley and to Andrew Hastie and to Angus Taylor is you can't be more Pauline than Pauline. But ultimately, what their confused, divided approach will lead to is higher prices for Australians.\"\n\n\n\n\n\nThe Senator says the weakened climate targets also show disrespect towards Pacific nations.\n\n\n\n\n\nHer comments have been backed by the Prime Minister.\n\n\n\n\n\n\"If anyone thinks that there is certainty in the Coalition going forward, then they're not paying any attention to the rabble and clown show that the Coalition have become when it comes to energy policy and climate policy. Uncertainty - that kills off investment and less investment means higher power prices.\"\n\n\n\n\n\nClimate policy has been a contentious issue within the Coalition for decades.\n\n\n\n\n\nAt the last two federal elections, the Liberal Party lost inner-city seats to independent candidates focused on climate action.\n\n\n\n\n\nBut Liberal Senator Jonathon Duniam has rejected suggestions the climate policy reversal could hurt the Coalition at the next election or on the international stage.\n\n\n\n\n\nShadow energy minister Dan Tehan says he believes voters will recognise the Coalition can deliver on the affordable energy promises that Labor took to the May federal election.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/coalition-set-to-prioritise-migration-cuts-before-next-election-morning-news-bulletin-17-november-2025/kgtttx8b6",
        "title": "Coalition to unveil policy to cut immigration | Morning News Bulletin 17 November 2025",
        "publish_date": "Sun, 16 Nov 2025 19:36:57 +0000",
        "category": "finance",
        "authors": [],
        "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts .\n\n\n\n\n\nTRANSCRIPT\n\n\n\nThe Coalition sets a timeline for unveiling immigration policy.\n\nNearly 70 schools in the ACT closed due to asbestos concerns.\n\nAnd in football, Portugal qualifies for the World Cup after defeating Armenia.\n\n----\n\n\n\n\n\nLiberal leader Sussan Ley has promised the Coalition will announce more detail on its policy to reduce migration numbers in coming weeks.\n\n\n\n\n\nIt has been a contentious issue within the Liberal party as some backbenchers, like Jacinta Nampijinpa Price, push for deep cuts to migration.\n\n\n\n\n\nSenator Price was dumped from the shadow frontbench after a week-long spat over comments she made about Indian migrants, culminating in her refusal to back Ms Ley as Liberal leader.\n\n\n\n\n\nMs Ley has revisited the issue, vowing cuts to migration would be a priority under her leadership.\n\n\n\n\n\n\"We've been working very closely on migration policy in the last six months. This work has been done by (senator) Paul Scarr and more recently, Jonno Duniam has joined as the Home Affairs shadow minister, and in the coming weeks, we will release a migration policy, the broad principles of such a policy, that demonstrates what I have said from the get go, which is that this country's migration numbers are far too high, and this needs to be addressed as a priority.\"\n\n\n\n\n\n----\n\n\n\n\n\nThe Opposition has outlined the main parts of its energy plan after abandoning net-zero emissions targets.\n\n\n\n\n\nLiberal leader Sussan Ley and her Nationals counterpart, David Littleproud, say the Coalition would change the objectives given to regulatory and investment agencies if the Coalition wins government in 2028.\n\n\n\n\n\nMr Littleproud says agencies are currently forced to prioritise emissions reductions targets, but the Coalition's approach would be technology neutral, and this could support a future transition to nuclear.\n\n\n\n\n\nShadow minister for energy Dan Tehan says the Albanese government is not achieving their affordability or climate goals.\n\n\n\n\n\n\"They don't have an answer when it comes to energy affordability and reducing emissions. The $275 they promised you at the end of this year in the reduction in your power bills isn't going to happen. They also promised that would they were going to bring emissions down as well yet emissions are flatlining.\"\n\n\n\n\n\n----\n\n\n\n\n\nNearly 70 public schools in the ACT are closed today, as concerns about asbestos contamination continue to spread in the territory.\n\n\n\n\n\nOn Friday, 16 schools and 6 preschools were closed for investigation, after the Australian Competition and Consumer Commission warned a coloured sand may contain asbestos traces.\n\n\n\n\n\nACT Education and Early Childhood Minister Yvette Berry says testing will be done over the next few days at the affected sites.\n\n\n\n\n\n\"Health officials confirmed that the risk is very low and they do not recommend any clinical assessments will be required for people who have been in contact with these products. However, the ACT has strong Work Health and Safety laws. And we are required to eliminate risk as much as is reasonably practicable. For asbestos, that means isolating the space, testing and remdiating. All of this is required to be done a by licensed absestos contractor.\"\n\n\n\n\n\n----\n\n\n\n\n\nMore than 100 people, mostly police, have been injured in Mexico City during demonstrations that saw thousands march in protest against corruption and deteriorating security conditions.\n\n\n\n\n\nTensions exploded when masked protesters tore down metal barriers protecting the National Palace, prompting riot police to respond with tear gas and smoke bombs.\n\n\n\n\n\nThe demonstrations have mostly been organised by Generation Z youth groups, who say they are angered by violence, including the assassination of Urupan Mayor Carlos Manzo.\n\n\n\n\n\nProtester Manuel Martinez says crime is the key issue.\n\n\n\n\n\n\"We came because of what happened to Carlos Manzo. For me, this is living proof that people have woken up. We cannot be in the hands of a country ruled by crime. No more, no more. I think this is the limit.\"\n\n\n\n\n\n----\n\n\n\n\n\nIn football,\n\n\n\n\n\nCristiano Ronaldo is heading to another World Cup after Portugal sealed its place at next year's tournament in the United States, Canada and Mexico with a 9-1 rout of Armenia.\n\n\n\n\n\nRonaldo missed the match in Porto because of suspension — but in his absence, Portugal ensured he would have the chance to appear at a record sixth World Cup.\n\n\n\n\n\nThe five-time Ballon d'Or winner will be 41 by the time the tournament kicks off next June, with Ronaldo having said recently it would be his last shot at winning the one major title to elude him.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/albanese-set-to-pitch-australias-trade-potential-after-tariff-breakthrough/hskecckna",
        "title": "'Uniquely placed': Albanese to pitch Australia's trade potential after tariff breakthrough",
        "publish_date": "Sun, 16 Nov 2025 19:28:26 +0000",
        "category": "finance",
        "authors": [],
        "text": "Anthony Albanese will use a major speech to push Australia's case on international trade after securing several significant breakthroughs.\n\n\n\n\n\nThe prime minister's pitch follows the abolition of US tariffs on Australian beef and other agricultural exports, as well as key security and defence agreements inked with near neighbours.\n\n\n\n\n\n\"Geographically centred in this region, we are uniquely placed to further our shared interests as well as to demonstrate solutions and strategies to solve shared problems,\" Albanese will say, according to an advanced copy of his remarks.\n\n\n\n\n\n\"Perhaps now more than ever that is the role of a middle power.\"\n\n\n\n\n\nAlbanese highlights the enduring value of APEC, a forum of 21 member economies that promotes free trade and investment across the Asia-Pacific region.\n\n\n\nThe forum accounts for more than 60 per cent of global GDP and 75 per cent of Australia's trade.\n\n\n\n\n\n\"In an economy like ours, where one-in-four Australian jobs depends on trade, the impact of that market and those supply chains is enormous,\" Albanese will tell an audience in Melbourne on Monday.\n\n\n\n\n\nAustralia and Indonesia have locked in a treaty after months of negotiation, committing both countries to conduct routine consultations on security issues.\n\n\n\n\n\nThe prime minister's speech also touches on a pact with Papua New Guinea, elevating its relationship with Australia to the level of alliances with New Zealand and the United States.\n\n\n\n\n\nAustralia's political leaders have celebrated the lifting of US tariffs on beef and other agricultural goods, along with a major agreement on critical minerals.\n\n\n\n\n\nAlbanese's team will soon shift its focus to eliminating all remaining trade barriers with the US.\n\n\n\nREAD MORE What does the treaty with Indonesia actually mean?\n\nThe prime minister also has his sights on advancements in clean energy, artificial intelligence and a broader evolution in global trade.\n\n\n\n\n\n\"All of these represent Australian challenges and Australian opportunities. But not uniquely so,\" he will say.\n\n\n\n\n\n\"They are global in scale and they connect us all. That is why we cannot find our prosperity — or our place in the world — by only looking inward.\"\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/turkiye-proposes-co-hosting-cop31-with-australia-amid-deadlock-over-hosting-rights/63vhu2hdr",
        "title": "Australia downplays co-hosting COP31 after Türkiye proposes sharing event",
        "publish_date": "Sun, 16 Nov 2025 19:04:56 +0000",
        "category": "finance",
        "authors": [],
        "text": "Australia has poured cold water on the idea it could jointly lead the world's biggest climate conference with Türkiye.\n\n\n\n\n\nBoth countries have days to try to resolve the years-long standoff over hosting rights for the 2026 United Nations climate conference as this year's COP30 in Brazil draws to a close.\n\n\n\n\n\nThe mounting pressure has reportedly led Türkiye to propose a joint presidency model with Australia, which would include sharing hosting duties for high-level meetings and jointly steering negotiations.\n\n\n\n\n\nBut Minister for Regional Development Kristy McBain has downplayed the suggestion.\n\n\n\n\n\n\"It's important that these deliberations play out,\" she told ABC News on Monday.\n\n\n\nREAD MORE Australia's dispute with Türkiye over COP31 hosting rights could see both miss out\n\n\"(But) one of the reasons that we wanted to bring COP here and co-host it with our Pacific Island neighbours was so that people got a real understanding of what was actually happening in communities already.\"\n\n\n\n'Overwhelming support of the world'\n\nClimate Change Minister Chris Bowen has travelled to the Amazonian city of Belem for COP30 to represent Australia and try to seal the deal on next year's conference through talks with his Turkish counterparts.\n\n\n\n\n\nBefore his departure on Saturday, he maintained Australia had the \"overwhelming support of the world\" to host the event.\n\n\n\n\n\nHowever, the United Nations' annual Conference of the Parties lacks provisions to break deadlocks over such disputes, with the scenario relying on one side or the other voluntarily withdrawing.\n\n\n\n\n\n\"That means we need to reach an agreement with Türkiye — that's difficult,\" Bowen told reporters.\n\n\n\n\"I do know it's in Australia's best interest to be COP president and to host COP.\"\n\n\n\n\n\nIn a bid to break the stalemate, Prime Minister Anthony Albanese wrote to Turkish President Recep Tayyip Erdogan earlier in November.\n\n\n\n\n\nBut Türkiye has refused to back down, saying its candidacy emphasises cooperation and inclusiveness and aims to put greater focus on financing for developing countries while showcasing its progress towards a 2053 net zero emissions goal.\n\n\n\n\n\nThis year's climate change conference is expected to wrap up on Friday, and Bowen has said the hosting deal will be decided by then.\n\n\n\n\n\nIf it remains undecided, Germany — as the home of the UN climate headquarters — may have to take on the responsibility for the 2026 conference.\n\n\n\n\n\nThe annual talks rotate through five regional groups, with COP31's host needing to be unanimously agreed upon by the 28 members of the \"Western Europe and Others Group\" bloc, which includes Australia and Türkiye.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/top-job-skills-australian-employers-are-looking-for/ztg10usiz",
        "title": "Need a new job? These are the top 10 skills Australian employers are looking for",
        "publish_date": "Sun, 16 Nov 2025 18:30:56 +0000",
        "category": "finance",
        "authors": [],
        "text": "Looking for a new job can be a long and demoralising process.\n\n\n\n\n\nBetween job ads telling you how many people have already applied for your dream role, getting generic rejection emails (if any), and finding out after a lengthy interview process that an internal candidate has been hired, it can start to feel like you'll never succeed.\n\n\n\n\n\nOne thing that can help you stand out in such a competitive job market is possessing skills that are in demand — and new analysis has revealed what they are.\n\n\n\nThe 10 most in-demand skills in Australia\n\nUsing data from job ads posted in the 12 months to August 2025, employment listings platform SEEK has compiled the 10 most-requested skills from Australian recruiters.\n\n\n\n\n\nCustomer service was the most in-demand skill for employers across industries during that period.\n\n\n\n\n\nIt wasn't just a valued skill in the industries you'd expect, such as retail, administration support, and hospitality, but also in the banking and financial services, healthcare and medical, and Information and Communication Technology sectors.\n\n\n\nThe most sought-after skill across industries was customer service. Source: SBS, Getty Proficiency in Microsoft Office was the second-most in-demand skill across industries, while person-centred skills, including relationship management, leadership, relationship building, and team leadership, also rated highly.\n\n\n\n\n\nAnalysis, cleaning, project management, and investigation rounded out the top 10.\n\n\n\n\n\nSkills that are considered qualifications, such as driver's licences and workplace health and safety certifications, weren't included in SEEK's analysis.\n\n\n\nWhat do the findings tell us?\n\nWhile there are increasing concerns around the use of AI in workplaces and potential job losses, SEEK's analysis suggests there's still strong demand for skills that only people possess.\n\n\n\n\n\n\"As tools and technology continue to transform the way we work, we can see that Aussie employers are prioritising human skills, or what can be known as 'power skills',\" Kylie Pascoe from SEEK's Customer Insights and Research team said.\n\n\n\n\n\n\"Businesses are looking for people who can communicate effectively, build strong relationships, and lead teams with empathy and clarity to do great work and make the most of new technology.\"\n\n\n\nIf you don't already have these in-demand skills, developing them through upskilling, training, or hands-on experience can help you stand out in the job market, she said.\n\n\n\n\n\nEnsuring your skills are listed prominently on your resume and job site profiles is also \"really important\" in helping recruiters assess if you're the right fit for any role you apply for, Pascoe added.\n\n\n\nHow to demonstrate your job skills in an interview\n\nIf you get to the interview stage of the hiring process, you'll typically be asked to give real-life examples of how and when you've used certain skills that are relevant to the role you've applied for.\n\n\n\n\n\nOne way to do this effectively is by using the STAR method to structure your responses.\n\n\n\n\n\nThe STAR method is broken down into four parts: situation, task, action, and result.\n\n\n\n\n\nTo provide context for your example, describe the situation that took place.\n\n\n\n\n\nThen talk about what your task was in the situation, provide details about the action you took to resolve the situation, and finish by describing the result of that action.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/australia-have-got-this-socceroos-remember-world-cup-qualifier-against-uruguay-20-years-on/hln45p3bt",
        "title": "\"Australia have got this\": Socceroos remember World Cup qualifier against Uruguay, 20 years on",
        "publish_date": "Sun, 16 Nov 2025 07:23:32 +0000",
        "category": "sports",
        "authors": [],
        "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts .\n\n\n\n\n\nTRANSCRIPT:\n\n\n\n\n\nIt was a defining moment in Australian history.\n\n\n\n\n\n\"Here's John Aloisi for a spot in the World Cup... he scores! Australia have got this!\"\n\n\n\n\n\nThat was the night of November 16, 2005, when Socceroos member John Aloisi scored a penalty against Uruguay in front of more than 83,000 fans packed into Sydney's Olympic Stadium.\n\n\n\n\n\nOthers watched around the country, including around 8000 fans in Melbourne's Federation Square, hoping to witness the historic moment.\n\n\n\n\n\n\"Yay!!!\"\n\n\n\n\n\n20 years later, this match remains the most watched event in S-B-S history.\n\n\n\n\n\nAnd some of the key players of the night, including Aloisi, Mark Schwarzer and Josip Skoko, have reunited in Melbourne to reflect on the night that forever changed Australian football.\n\n\n\n\n\nJohn Aloisi says that night is a good memory for him.\n\n\n\n\n\n\"The whole evening just had that belief and confidence that we are going to the qualifier for some reasons, just had that aurora about it, and taking that penalty, as I said, I never took a penalty so for that kind of my first penalty, was extra special and I still take it the same day same way today.”\n\n\n\n\n\nThe Socceroos great has been coaching at the A-League club Western United for the past three years.\n\n\n\n\n\nHe remains in a holding pattern after the club's expulsion.\n\n\n\n\n\nBut while his coaching career remains uncertain, Aloisi says he's watching many young players making their best kicks on the field.\n\n\n\n\n\n\"We've got a number of players who I think in 2023 knocking on the door and not too far away, and we give them that belief that from that encouragement to go, you know, play their game, play their football, and they've been really good in the past year with us. And yeah, that's what they are thriving for, they want to play for the Socceroos and the World Cup around the corner makes it extra bit, em, important for them.\"\n\n\n\n\n\nAnother hero in the game against Uruguay was Mark Schwarzer , whose penalty saves set the stage for Australia to win the penalty shootout.\n\n\n\n\n\nHe says sometimes when he watches the footage, he still gets goosebumps.\n\n\n\n\n\n\"We all knew... We were talking about that moment so many times, how important that moment was gonna be one day if we have a qualifier for World Cup, then obviously, when you accomplish it, the realisation of satisfaction and the overwhelming sense of like relief that football was on the map and people were taking it seriously.\"\n\n\n\n\n\nThe watershed moment on November 16, 2005, ignited a golden era.\n\n\n\n\n\nNext year's tournament in North America will mark the Socceroos' sixth consecutive World Cup finals appearance.\n\n\n\n\n\nSchwarzer meanwhile is preparing for another career highlight, as one of seven people inducted into the Sport Australia Hall of Fame in Melbourne.\n\n\n\n\n\nMark Schwarzer says he's relieved that following the victory in 2005, football has become an important sport in Australia.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/opposition-presents-its-plan-to-put-power-prices-at-the-centre-of-climate-and-energy-policy/f2dnh0zl3",
        "title": "Opposition presents its plan to put power prices at the centre of climate and energy policy",
        "publish_date": "Sun, 16 Nov 2025 06:40:38 +0000",
        "category": "finance",
        "authors": [],
        "text": "The federal Opposition has emerged from joint party room talks spruiking a climate and energy policy that highlights power prices and removes specific emissions reduction goals.\n\n\n\n\n\nFronting the media on Sunday afternoon, Opposition leader Sussan Ley said the plan was \"all about affordable energy and responsible emissions reduction\".\n\n\n\n\n\n\"Why wouldn't you, as prime minister, prioritise affordable energy instead of the ideology of an 82 per cent renewable grid by 2030,\" she said.\n\n\n\n\n\n\"It's fundamentally, completely around the wrong way when it comes to looking after Australians who deserve a government that backs them in and understands that affordable power is the number one consideration for citizens in this.\"\n\n\n\n\n\nWhile saying the Coalition would keep Australia in the Paris Agreement, Ley would not be drawn on questions of whether the Opposition would submit Nationally Determined Contributions (NDCs) to the United Nations, as required from all signatories to the global climate treaty.\n\n\n\n\n\n\"We've already said that we won't make any comments about targets from opposition, and that we will look at our NDCs, our short-term targets, once in government,\" she said.\n\n\n\nREAD MORE Coalition meeting looms as Liberal rejects 'Nationals-lite' label after net zero dumped\n\nCountries that wish to fulfil their obligations under the Paris Agreement must ratchet up their targets for reducing greenhouse gas emissions every five years.\n\n\n\n\n\nIn a policy document released on Sunday, the Opposition said it would reduce emissions \"on average year on year, for every five-year period of Australia's Nationally Determined Contribution\".\n\n\n\n\n\nIt did not specify by how much it would reduce emissions, only saying it would be done \"in Australia's national interest by doing our fair share considering the real performance of OECD countries\" and \"as fast and as far as technology allows, without imposing mandated costs on families or industry\".\n\n\n\n\n\nSpeaking alongside Ley, National Party leader David Littleproud said: \"We will make sure that we don't streak ahead, but we're not going to be a laggard and we should peg ourselves to what the rest of the world's doing,\" he said.\n\n\n\n\n\nBoth the Liberals and National parties dropped a net zero by 2050 commitment from their platforms at recent party meetings.\n\n\n\nIn its policy document, the Opposition said: \"Whilst it is not our policy to set long-term targets, net zero would be a welcome outcome, if achieved through technology, choice and voluntary markets.\"\n\n\n\n\n\nSeveral days ago, the Liberal Party put out a press release saying it would scrap Labor's emissions reduction target of 43 per cent by 2030 and \"not legislate mandates in government\".\n\n\n\n\n\nPrime Minister Anthony Albanese said last week that the Opposition's direction on climate and energy policy was \"choosing to take Australia backwards\".\n\n\n\n\n\n\"They're walking away from jobs for Australians, and investment certainty for business,\" he told reporters on Thursday morning.\n\n\n\n\n\n\"They're walking away from climate action because they fundamentally do not believe in the science of climate change.\"\n\n\n\nREAD MORE Bowen heads to Brazil to push Australia's COP31 hosting bid amid standoff with Türkiye\n\nLittleproud said on Sunday the Albanese government was continuing \"to throw sledges at the Coalition about a 2015 debate about the science of climate change\".\n\n\n\n\n\n\"This debate is not one predicated on science. It is one predicated on economics,\" he said.\n\n\n\n\n\nForeign Minister Penny Wong, a veteran of Canberra's so-called climate wars, earlier said the Coalition's decision to abandon net zero would do little to shift public opinion.\n\n\n\n\n\nWatered-down climate targets would drive up power prices for Australians and show disrespect towards Pacific nations, Wong said.\n\n\n\nREAD MORE Why over a third of this nation's citizens want to migrate to Australia\n\nThe Opposition's policy proposals\n\nThe newly released document — titled Affordable and Responsible — also outlines a policy called the Affordable Electricity Scheme, which the Opposition said would differ from the government's Capacity Investment Scheme by being more technology-neutral.\n\n\n\n\n\nLey on Sunday criticised government agencies that \"invest or underwrite taxpayers' money in wind and solar, which don't need their help\".\n\n\n\n\n\nThe Opposition has also said, if it were to win government, it would remove the emissions reduction objective from the National Energy Objectives.\n\n\n\n\n\nAn emissions reduction objective was added to the rules governing national electricity, gas and related retail markets during the Albanese government's first term.\n\n\n\nThe Opposition also reiterated its support for lifting a moratorium on nuclear energy, which was first implemented federally under a former Coalition government in the late 1990s.\n\n\n\n\n\nHowever, the policy document does not detail plans for building nuclear power facilities at the sites of existing coal plants, something former Opposition leader Peter Dutton took to the May election, at which the Coalition suffered a crushing defeat .\n\n\n\n\n\nAt the last two federal elections, the Liberal Party lost inner-city seats to independent candidates focused on climate action.\n\n\n\n\n\nThe Opposition's plan also talks up the importance of gas in Australia's energy system, pledging to \"drive new gas exploration and development across key basins including Beetaloo, Narrabri, Barossa, Browse, Cooper and Scarborough — bringing significant new supply online\".\n\n\n\nLISTEN TO Hopes dashed as global fossil fuel emissions increase in 2025 SBS News 04:44 English\n\n\"Approvals will be streamlined, infrastructure investment supported, and gas delivery added to the investment mandate of the Clean Energy Finance Corporation,\" the policy document read.\n\n\n\n\n\nThe Opposition also reiterated support for a \"prospective\" gas reservation policy — which Dutton had promised ahead of the 2025 election.\n\n\n\n\n\nA gas reservation — such as Western Australia has had since 2006 — would reserve a certain portion of Australia's gas for the domestic market.\n\n\n\n\n\nThe vast majority of Australian gas is currently exported, and some experts say this has raised domestic prices by making Australian companies compete with international buyers willing to pay more.\n\n\n\n\n\n— With additional reporting from the Australian Associated Press\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/coalition-attempts-to-present-united-front-on-climate-policy-midday-news-bulletin-16-november-2025/qdvnpok7q",
        "title": "Coalition attempts to present united front on climate policy | Midday News Bulletin 16 November 2025",
        "publish_date": "Sun, 16 Nov 2025 01:02:16 +0000",
        "category": "finance",
        "authors": [],
        "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts .\n\n\n\n\n\nTRANSCRIPT:\n\n\n\nThe Coalition attempts to present a united front on climate policy\n\nPope Leo celebrates cinema in a meeting with Hollywood stars\n\nAlex de Minaur says he will come back stronger after ATP Finals defeat\n\nNational Party Leader David Littleproud says he is pretty confident of reaching a deal with the Liberals to formalise the Coalition's position on net zero when they hold a joint partyroom meeting today.\n\n\n\n\n\nAfter a party-room meeting earlier this week, the Liberal Party announced it would scrap its commitment to reach net zero emissions by 2050. It follows the same action taken by the Nationals earlier this month.\n\n\n\n\n\nOpposition leader Sussan Ley says the party agreed its policy platform would be about energy affordability as an issue - and that could be achieved without the 2050 emissions reduction target.\n\n\n\n\n\nShe said the party platform would be for Australia to stay with the Paris Agreement.\n\n\n\n\n\nLiberal Senator Jonathon Duniam told Sky News, the national interest would govern decisions made on emission reduction plans, called Nationally Determined Contributions, under the Paris Agreement.\n\n\n\n\n\n\"I think when you read Article 4 of the Paris Agreement in totality, there is provision for us to do what is in the national interest. And we would determine those contributions and the emission reductions effort in line with national interest. That means making energy more affordable. We have been doing ourselves a disservice. Climate change is settled - don't worry about that. It's not the debate here. It's about how you deal with the efforts our country puts in when it comes to emissions reduction.\"\n\n\n\n\n\n**\n\n\n\n\n\nThe Bureau of Meteorology says the risk of severe thunderstorms remains active over the next 24 hours for parts of eastern Australia.\n\n\n\n\n\nHailstones, heavy rain and destructive winds have hit parts of New South Wales and Queensland on Saturday.\n\n\n\n\n\nSoutheast Queensland received more than 50 millimetres of rain recorded in 30 minutes - at multiple locations west of Brisbane.\n\n\n\n\n\nAnd almost 3,000 properties were without power in southeast Queensland at 9pm on Saturday, according to Energex.\n\n\n\n\n\nAngus Hines, from the Bureau of Meteorology, says the storm danger continues for eastern Australia before the focus shifts from Monday to parts of the country's north and west.\n\n\n\n\n\n\"Where these storms do develop, they could bring some pretty significant weather impacts with them. Damage to cars and property, particularly from the large and giant hail is absolutely possible. And we've seen that happen many times in the last few weeks. We could also see power outages, travel and transport delays as well as flash flooding.\"\n\n\n\n\n\n**\n\n\n\n\n\nThousands have marched in the Brazilian city of Belem to call for climate justice and land rights at COP30.\n\n\n\n\n\nThe demonstration brought together Indigenous communities, Brazilian youth groups, and activists from around the world.\n\n\n\n\n\nIndigenous activists have been protesting outside the COP venue, saying many have been excluded access to the proceedings.\n\n\n\n\n\nBrazil's Minister of Indigenous Peoples, Sonia Guajajara, says 400 places out of 1,200 in Brazil's delegation were granted to Indigenous representatives.\n\n\n\n\n\nCristiane Puyanawa says she wants to be heard on the issue of Indigenous land rights.\n\n\n\n\n\n\"We are here today at the global climate march. Women, youths, Indigenous peoples, and river communities are united to demand social justice and the demarcation of Indigenous lands. Our land and our forest are not commodities. Respect nature and the peoples who live in the forest.\"\n\n\n\n\n\n**\n\n\n\n\n\nAustralian actor Cate Blanchett says the pope's message on the vital role of cinema, actors and filmmakers is affirming and inspiring.\n\n\n\n\n\nScreen stars Blanchett, Monica Bellucci, Chris Pine and Viggo Mortensen were among those invited to the private Vatican audience with the Pope to mark the 130th anniversary of cinema this year.\n\n\n\n\n\nPope Leo told the group that the logic of algorithms tends to repeat what works, but art opens up what is possible.\n\n\n\n\n\nAnd he urged those involved in cinema to have the courage to keep tackling difficult subject matter.\n\n\n\n\n\n\"In the present era, there is a need for witnesses of hope, beauty and truth. Good cinema and those who create and star in it have the power to recover the authenticity of imagery in order to safeguard and promote human dignity. Do not be afraid to confront the world’s wounds. Violence, poverty, exile, loneliness, addiction and forgotten wars are issues that need to be acknowledged and narrated. Good cinema does not exploit pain; it recognises and explores it.\"\n\n\n\n\n\n**\n\n\n\n\n\nIn Tennis, Alex de Minaur says he is already looking to come back even stronger after losing to Jannik Sinner 7-5 6-2 in the semis at the ATP Finals in Turin.\n\n\n\n\n\nSinner had to overcome first-set resistance from de Minaur until forging away in breathtaking fashion to set up a final against either world No.1 Carlos Alcaraz or Canadian Felix Auger-Aliassime.\n\n\n\n\n\nDe Minaur says he sees no other way, but to move forward.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/interview-nitv-radio-talks-to-dr-harry-hobbs-on-victorias-treaty-becoming-law/rj3bkrqua",
        "title": "INTERVIEW: NITV Radio talks to Dr Harry Hobbs on Victoria's treaty becoming law",
        "publish_date": "Sat, 15 Nov 2025 20:30:00 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.theage.com.au/sport/cricket/origin-of-the-ashes-cricket-australia-unveils-new-energy-sponsor-to-replace-alinta-20251117-p5nfy3.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Origin of the Ashes: Cricket Australia unveils new energy sponsor to replace Alinta",
        "publish_date": "Mon, 17 Nov 2025 13:00:00 +1100",
        "category": "sports",
        "authors": [
            "Daniel Brettig"
        ],
        "text": "Australia’s biggest energy supplier, Origin Energy, will emblazon the shirts of the Test team this Ashes summer as part of a three-year, multimillion-dollar deal, two years after the end of Cricket Australia’s sponsorship by Alinta.\n\nThe new energy deal follows a summer of record crowds and audience figures for the Border-Gavaskar Test series against India, and has been announced days before the first Test against England in Perth on Friday.\n\nBen Dwarshuis, Pat Cummins, Phoebe Litchfield and Hannah Darlington with CA’s new sponsor. Credit: Cricket Australia\n\nIt is also a much-needed addition to CA’s balance sheet after the governing body’s sixth consecutive season recording a net operating loss, after distributing millions of dollars in annual funding to the state associations.\n\n“Origin joins Australia’s national sport during the biggest international season in our history and their commitment to cricket will help us grow the game further,” CA chief executive Todd Greenberg said in a statement.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/australia-news-live-coalition-announce-joint-energy-policy-ley-says-migration-policy-imminent-albanese-sets-sights-on-security-deals-with-fiji-and-vanuatu-20251117-p5nfu8.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Australia news LIVE: Coalition and Ley polling at record lows; Albanese says Australia will not be co-hosting COP climate summit next year as stand-off with Turkey continues",
        "publish_date": "Mon, 17 Nov 2025 12:55:09 +1100",
        "category": "finance",
        "authors": [
            "Emily Kaine"
        ],
        "text": "Liberal senator Sarah Henderson has slammed the government’s commitment to net zero by 2050 emissions targets, while refusing to comment further on Sussan Ley’s leadership of the Liberal Party.\n\nLoading\n\nSpeaking on Sky News this afternoon, Henderson claimed Anthony Albanese was lying to the Australian people, saying, “We are telling Australians the truth. This net zero rubbish is an ideology that’s not worked… we are not going to cop the prime minister’s lies, and it is time the Labor government and this prime minister started to tell the truth.”\n\nAfter publicly declaring that Ley was “losing support” among the Liberal party a few weeks ago, Henderson said she would “not going to be a commentator” on the internal workings of the party.\n\n“I made some comments a few weeks ago where I raised concerns, but my focus now is solely on being part of a strong team to sell our policy to the Australian people.\n\nLiberal senator Sarah Henderson. Credit: Alex Ellinghausen\n\n“I’m not going to add to the comments that I made a few weeks ago. What I’m saying is I’m absolutely supportive of the direction that we are going under Sussan Ley, and I’m not going to be a commentator on any more of the internal stuff.”",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/cycling/tributes-follow-sudden-death-of-28-year-old-paralympic-gold-medallist-20251117-p5nfyr.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Tributes follow sudden death of 28-year-old Paralympic gold medallist",
        "publish_date": "Mon, 17 Nov 2025 12:47:18 +1100",
        "category": "sports",
        "authors": [
            "Frances Howe"
        ],
        "text": "Paralympics Australia and AusCycling have paid tribute to gold medallist Paige Greco, who died suddenly after a medical episode in her home in Adelaide on Sunday. She was 28.\n\nParalympics Australia on Monday issued a statement from her mother, Natalie, on behalf of the family.\n\nPaige Greco after winning gold at the 2020 Tokyo Paralympic Games. Credit: Getty\n\n“Paige meant everything to us,” the statement said. “Her kindness, her determination, and her warmth touched our family every single day. She brought so much joy and pride into our lives, and the pain of her passing is something we will carry forever.\n\n“While we are devastated by her loss, we are incredibly proud of the person she was and the way she represented Australia … We are grieving deeply and ask for privacy, time, and space to navigate this overwhelming loss.”",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/property/news/woman-wins-4-8-million-glebe-home-with-her-father-bidding-at-auction-20251117-p5nfvd.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Woman wins $4.8 million Glebe home with her father bidding at auction",
        "publish_date": "Mon, 17 Nov 2025 12:42:09 +1100",
        "category": "finance",
        "authors": [
            "Carmen Forward"
        ],
        "text": "A woman represented by her father paid $4,815,000 for a four-bedroom house in Glebe, outbidding five others, mostly families, at auction on Saturday.\n\nThe home at 405 Glebe Point Road has ornate ceilings, a romantic vine canopy in the courtyard and a highly desired backyard for the buyer who has dogs.\n\nFive out of six registered parties made offers on the property with an initial guide of $4 million which was later lifted to $4.3 million.\n\nMost were families looking to upsize from smaller houses. Bidding opened at $3.8 million in $50,000 increments until it reached its $4.3 million reserve, then smaller bids were made until it sold.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/western-australia/wa-news-live-man-rushed-to-hospital-after-car-crashes-into-tree-at-herdsman-lake-20251117-p5nfwl.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "WA news LIVE: Man rushed to hospital after car crashes into tree at Herdsman Lake",
        "publish_date": "Mon, 17 Nov 2025 12:30:06 +1100",
        "category": "finance",
        "authors": [],
        "text": "Rio Tinto has abandoned plans to build a $215 million green steel research and development facility in Rockingham, instead opting to bring on environmental technology company Calix to build a green steel demonstration plant at the same site.\n\nThe BioIron facility was announced with much fanfare in June last year and would have seen a pilot plant using greener alternatives to coal to turn Pilbara iron ore into metallic iron.\n\nLoading\n\nHowever, earlier today the company said the furnace design for BioIron required “additional development to minimise technical risks and optimise its performance”.\n\nInstead, the company has signed an agreement with Calix and will front up $35 million to help it build a Zero Emissions Steel Technology plant (known as Zesty) on the same site.\n\nCalix already has a $44.9 million federal government grant to build the plant.\n\nThe news adds to the green steel controversy sparked last week after Premier Roger Cook declared the state wanted to use green steel in its $1.5 billion hospital build program.\n\nThe opposition criticised Cook’s claims because there are currently no proven green steel plants operating in WA, and there would likely not be before the build program is completed within four years.\n\nCook welcomed the announcement.\n\n“Coupled with my government’s recent announcement that government will take an “if not, why not” approach to green steel procurement on major government projects, the Zesty Green Iron Demonstration Plant will support our efforts to diversify WA’s economy so that it can remain the strongest in the nation,” he said.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/politics/federal/sussan-ley-the-travelling-saleswoman-is-spruiking-hastie-s-wares-20251117-p5nfvj.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Sussan Ley, the travelling saleswoman, is spruiking Hastie’s wares",
        "publish_date": "Mon, 17 Nov 2025 12:13:11 +1100",
        "category": "finance",
        "authors": [
            "Nick Bonyhady"
        ],
        "text": "“We had a leadership ballot in the Liberal Party room six months ago,” Ley told Fordham. “I’m the leader and I’m working hard every day to deliver a serious, compelling policy agenda.”\n\nLey insisted she was unbothered by the stunt on a radio station that conservative leaders tend to favour, and was focused instead on real Australian concerns.\n\nAsked who she preferred as leader, Pattie said: “Certainly Andrew, definitely not Sussan.” No coincidence that Sheena, Narelle, Dominic and Simone all said the same.\n\n2GB host Ben Fordham didn’t declare open season on Opposition Leader Sussan Ley. He didn’t have to. The run of callers his producers lined up to declare their preference for backbencher Andrew Hastie, her undeclared challenger, did all the talking.\n\nIt was the same message she delivered on ABC breakfast radio, Channel Seven breakfast television, and doubtless much the same as the one she will tell youth outlet The Daily Aus and triple j’s Hack program later in the day in a media sales blitz spanning the ideological spectrum.\n\nOn Sunrise she insisted too many migrants were coming to Australia but wouldn’t provide her own ideal figure. “Well hang on, you’re not giving a number, so how do you know that their number’s wrong?” Natalie Barr wanted to know. The Liberals were working on a plan, Ley said, that would let Australia’s infrastructure cope better with the number of arrivals.\n\nABC AM host Sabra Lane asked Ley to square her energy plan, which relies on more ageing, or even new, coal plants to bring down electricity costs, with a CSIRO finding that renewables are slightly cheaper than fossil fuels to bring online.\n\n“I’m not going to comment on lines from reports. I’m commenting on what’s going on in the real world around me and the real facts,” Ley shot back. The cost of new electrical kit to make renewables reliable, transmission and firming power all made renewables more expensive, she argued.\n\nAs Ley tries to flood the zone with her talking points, Hastie is pursuing a very different strategy. His consists largely of Instagram posts, safe interviews and newsletters that read like a mix of a first year course on Western Civilisation mixed with a highly combative TikTok feed.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/property/news/from-unliveable-1930s-queenslander-to-2-7-million-street-record-20251117-p5nfw2.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "From ‘unliveable’ 1930s Queenslander to $2.7 million street record",
        "publish_date": "Mon, 17 Nov 2025 11:58:05 +1100",
        "category": "finance",
        "authors": [
            "Sarah Webb"
        ],
        "text": "A young couple who flipped an “unliveable” 1930s Queenslander have made a motza on their “risky reno”, pocketing $2.71 million at auction on Saturday and setting a street price record.\n\nThe former two-bedroom shack at 6 Antill Street, Wilston, was all poky rooms and peeling paint when it was snapped up in 2022 for $990,000.\n\nThe pair, who work in the construction industry, spent a year gutting and rebuilding it into a four-bedroom, three-bathroom family home with a media room, designer kitchen, al fresco dining space and a luxe spa-style ensuite, with the end product smashing the Antill Street house price record by just over $200,000.\n\nSix bidders registered, but an opening bid from a buyers’ agent of $2.43 million quickly thinned the field to three.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/business/the-economy/trump-changes-his-mind-about-bananas-and-coffee-20251117-p5nfv1.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Trump changes his mind about bananas and coffee",
        "publish_date": "Mon, 17 Nov 2025 11:57:41 +1100",
        "category": "finance",
        "authors": [
            "Stephen Bartholomeusz"
        ],
        "text": "That should have been obvious to Trump and his advisers – as it was to most with a basic understanding of trade and economics – from the outset, but Trump’s Trade Representative, Jamieson Greer, was adamant during a Senate hearing in April, when the reciprocal tariffs were supposed to take effect, that there would be no exemptions or exclusions from them. Now there are, in a tacit admission by the administration that, contrary to what it has consistently argued, that tariffs do raise prices and are increasingly paid by US consumers. Bananas and coffee illustrate perfectly how misconceived the tariffs are. Credit: Bloomberg Bananas and coffee illustrate perfectly how misconceived the tariffs are. The US imports almost all its bananas and coffee, most of its from South America and, in the case of coffee, from Brazil in particular. More than 99 per cent of US coffee is imported, with nearly a third of it from Brazil. Trump imposed a 50 per cent tariff on Brazil – a base 10 per cent tariff and an extra 40 per cent rate as punishment for the prosecution of Trump’s friend and ideological ally, Jair Bolsonaro, for an attempted coup. Not surprisingly, the retail price of coffee has soared nearly 19 per cent from a year ago.\n\nSimilarly, the price of bananas, which the US mainly imports from Guatemala and Ecuador, is up about 7 per cent. Loading Beef prices, where even Australia, which has a trade deficit with the US, is subject to Trump’s 10 per cent baseline tariffs, have also surged. According to the St Louis Federal Reserve, they are up by more than 14 per cent this year. The US herd is its smallest in 70 years, so the tariffs have a magnified impact on prices. More broadly, the US Tax Foundation has estimated that the tariffs have pushed up retail prices by 4.9 per cent this year, while the Yale Budget Lab has calculated that they will cost the average US household $US1800 ($2750).\n\nWith the political pain mounting, Trump has decided to roll back some of the tariffs on products that have high visibility with consumers and their perceptions of affordability. In other words, Trump’s strategy for lowering prices is to unwind some of the tariffs that he has claimed would help lower prices. The administration consistently claims that prices and inflation are falling, when the official data, and households’ own experiences, say otherwise. While not backing away from its erroneous claims, the move to lower tariffs on a raft of household staples contradicts that White House messaging. It is conceivable that the move to wind back some of the tariffs will be less effective than the White House hopes.\n\nIn the early months after the tariffs were announced, US importers stockpiled products before the tariffs came into effect, blunting their impact on prices. With Trump dithering over the introduction of the new duties, and constantly tinkering with them as trade deals were negotiated with individual countries and companies, importers generally absorbed some of their cost while waiting to understand where the final trade picture would settle (if it ever settles). More recently, a greater proportion of their cost has been passed onto consumers, a trend that is likely to continue. Goldman Sachs has calculated that, in April, US imports picked up about 64 per cent of the tab for those tariffs in force, with foreign exporters absorbing 14 per cent and US consumers 22 per cent. By October, the US companies were paying 27 per cent of the new costs, foreign exporters 18 per cent and US consumers 55 per cent. By mid-2026, Goldman has said, importers will pay 8 per cent, foreign exporters 25 per cent (as US importers identify suppliers willing to absorb more of the cost) and US consumers 67 per cent.\n\nAs was the case when, in Trump’s last term he imposed tariffs on imports of steel and aluminium, there will also be an element of US companies using the protection they provide to raise their own prices. Trump’s popularity and perceptions of his credibility as a manager of the economy have been sinking, raising concerns within the Republican ranks about their fate at next year’s midterms. Credit: Bloomberg The Peterson Institute for International Economics estimated that the cost to steel-consuming companies was $US650,000 for every steel industry job saved by the tariffs and that they added $US270,000 to domestic steel producers’ profits for each of those jobs saved. In any category where the US doesn’t produce a product, or where its domestic industries can’t fully supply products Trump has hit with tariffs – even some of those where he is reducing the rate of the duty – there is an opportunity for domestic companies to raise prices or, where tariffs are being reduced, for importers to maintain prices and boost their profitability in the process. For lovers of bananas and coffee, the tariffs might have been lowered, but the national emergency might not yet be over!",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/sky-sports-female-focused-channel-was-condescending-rubbish-women-deserve-better-20251116-p5nftl.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Sky Sports’ female-focused channel was condescending rubbish. Women deserve better",
        "publish_date": "Mon, 17 Nov 2025 11:55:57 +1100",
        "category": "sports",
        "authors": [
            "Hannah Kennelly"
        ],
        "text": "We think women like sport ... but only if the coverage is dumbed down and has hot pink subtitles.\n\nThat appears to be the thinking behind Sky Sports’ short-lived female-focused brand Halo – which was axed three days after it launched online following fierce backlash for content that viewers deemed “patronising and disappointing”.\n\nHalo lasted just three days after backlash around its posts. Credit: Aresna Villanueva\n\nLast Friday, the global broadcasting giant launched Halo – a new TikTok channel dubbed “the lil sis” of Sky Sports and “created specifically for female sports fans”.\n\n“We’re about all sports and championing female athletes,” the broadcaster said in a now deleted post. “We’re here for the culture, community and connection. We don’t just watch sports – we live it.”",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/lifestyle/health-and-wellness/13-key-questions-about-prostate-cancer-answered-by-a-specialist-20251021-p5n45p.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "13 key questions about prostate cancer answered by a specialist",
        "publish_date": "Mon, 17 Nov 2025 11:53:21 +1100",
        "category": "lifestyle",
        "authors": [
            "Phil Hilton"
        ],
        "text": "Localised: 95 per cent of patients will be alive 10 years after treatment. Locally advanced: The five-year survival rate is 70-90 per cent. Metastatic: This falls to 30 per cent. 2. What is my risk of developing prostate cancer? The average man’s risk is one in eight, but certain cohorts have higher risks. For Afro-Caribbean men, the risk is one in four. There is more data on the way about patients with a family history of prostate cancer, and this is related to age (a first-degree relative who had prostate cancer at 55 or below is at greater risk than someone with a relative who had the disease at 90).\n\nLoading Then there are those with the BRCA gene mutation. There is no guarantee that you will have prostate cancer if you have the BRCA mutation, but there is a strong association. We’re focusing on identifying high-risk groups to develop screening programmes. We give people a questionnaire and, depending on the answers, we decide whether they need a blood test and scanning. 3. What symptoms should I look out for? Prostate cancer in its early stages is asymptomatic, so we pick up a lot of people when they are having cholesterol checks, and a prostate blood test is suggested. Symptoms predominantly involve the waterworks, as the water pipe goes through the prostate. When the prostate enlarges, it can cause problems. Potential symptoms include blood in the urine, back pain, fatigue, and sometimes erectile dysfunction. Early disease is slightly ambiguous, but in more advanced disease, we see back pain and lymph node enlargement. Don’t wait for symptoms if you are in a high-risk group.\n\nFatigue can be a sign of something more serious. Credit: iStock 4. What’s the main test used for screening? The way we test for prostate cancer now is a blood test: the PSA (prostate-specific antigen). This is an enzyme that the prostate produces to keep the semen in a semi-liquid form. The test was invented in 1977 and is like any other blood test. 5. How accurate is the PSA test? The sensitivity (the ability correctly to spot cancer) of the PSA for detecting prostate cancer is 70-80 per cent, but the specificity (the ability correctly to diagnose the absence of cancer) is 30-40 per cent. The specificity is the issue, as PSA levels can fluctuate: it’s prostate-specific but not prostate cancer-specific. If the prostate increases in size, or there’s a prostate infection or a urinary tract infection, the PSA goes up. After recent ejaculation, the PSA goes up. If someone goes for a cycle ride and then has a blood test, the PSA goes up. Hence why we tend to use MRI scans alongside the PSA test.\n\n6. If I have a prostate cancer diagnosis, what happens next? Patients will have an MRI and biopsy, then return for a meeting. They’ll go to a multidisciplinary team meeting with all specialists – oncologists, surgeons, nurses – who work together. We’ll have a discussion with the patient and their family, ensuring liaison is the most important thing. We place patients into risk groups (low, medium, high) and discuss treatment options. The earlier that cancer is picked up, the more treatment options are available. If we’ve picked it up at a more advanced level, the options are more restricted. Treatment options include: Close monitoring – PSA and MRI tests. PSA is a good monitoring tool and MRIs are far quicker when used in this way. This is not treatment, just keeping a watchful eye.\n\nLoading Focal therapy – treatment applied only to the specific areas with cancer identified by MRI. This can be ultrasound (high-intensity focused ultrasound to destroy cancerous areas) or focal cryotherapy (freezing and killing cells with very low temperatures). Focal therapy is less invasive but there’s a 20-40 per cent chance the cancer can come back. Radiotherapy – radiation applied to kill cancer cells. This includes external beam radiation, brachytherapy (radioactive seeds placed in the gland), and targeted radiotherapy. Robotic surgery – removing the prostate using robot-assisted surgery for precision. This means significantly less blood loss and faster return to work than traditional open surgery. The main focus is to cure patients. Patients are given all options without bias. Patients can also decide to get another opinion – they do that a lot.\n\n7. How quickly does it spread? When prostate cancer is diagnosed, we look at three parameters: PSA level, grade on biopsy, and scan findings. Low-grade prostate cancer is slow-growing and the risk of progression is 20-30 per cent over 10 years. Intermediate-grade can spread over months to a few years. High-grade can be fast-growing and may spread in a few months. This needs urgent treatment.\n\n8. What are the potential side effects? No treatment has zero side effects. The main side effects are ejaculatory issues, urinary incontinence, and sexual dysfunction. In some cases, we provide hormonal treatment that induces a male menopause. Loading Testosterone is to prostate cancer what fuel is to fire, so sometimes we administer these hormones. This can cause mood changes, fatigue, breast enlargement, breast tenderness, anger issues, brain fog, and potential long-term bone loss, similar to women in menopause. There’s also an associated risk of cardiac issues in the long term with hormone treatment. Getting back to your usual routine and function can take some time. Credit: iStock\n\n9. What can be done to alleviate the side effects? If someone has erectile issues, we can offer tablets, injections or vacuum pumps, or we can insert an inflatable cylinder into the penis – it’s rare but it’s done. If there is incontinence, most of the time normal function returns. We work on pelvic muscle training, and have pads, penile clamps, emotional support and counselling. We can implant an artificial sphincter, but robot surgery and aftercare is sufficiently advanced, meaning enough of the anatomy and nerve structure is preserved and very few people need the sphincter. Most of the time post-surgery, the first week is stormy, but within about three months, 70 per cent will regain control, and within 12 months most people are dry. Only 5 per cent have lasting issues. Faecal incontinence is more associated with radiotherapy and may require surgery – but this affects only 0.1 per cent. It’s extremely rare and it all improves over time. With hormone treatments, we can give drugs to prevent breast enlargement. If they are experiencing hot flushes, we can offer acupuncture. Exercise is very helpful in dealing with weight gain or diabetes.\n\n10. Can people decide against treatment? Suppose a 93-year-old man is diagnosed with prostate cancer – we put him on a watchful waiting pathway, where we do some tests and keep an eye on them. The PSA is a good marker once there is a diagnosis. We use doubling time. If someone has a PSA test in January and they have a PSA of four, and by March it’s eight, that is definitely something we need to investigate. We know overdiagnosis and overtreatment can be a problem and we do a lot of work to prevent that happening. If a patient doesn’t want any treatment, we will watch them and test them. 11. How do I know whether the treatment is working? We monitor patients based on PSA levels, scans, and symptoms. We bring patients back to clinic, involve their GPs, and engage community nurses. Success rates are very high: 90-95 per cent for locally confined prostate cancer.\n\nThis depends on initial pathology, but if the cancer is confined to the prostate, we’re talking about a significant chance of complete cure. We’re seeing major improvements in survival data with modern treatments. 12. What is the effect on my fertility? Treatment will render you infertile. We routinely bank patients’ sperm – if they haven’t completed their family, we organise that the next day [after diagnosis], usually. 13. What are the chances of cancer coming back? It all depends on the treatment. Success rates are very high.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/cricket/the-build-up-to-the-ashes-20251117-p5nfyh.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "The build-up to the Ashes",
        "publish_date": "Mon, 17 Nov 2025 11:51:55 +1100",
        "category": "sports",
        "authors": [],
        "text": "Opinion\n\nAfter Terry Alderman was taken out by a pitch invader in the first Test, second-string bowlers were called upon to play key roles in the series. This series looks destined to follow a similar path.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/politics/federal/weak-liberal-party-moderates-as-shameless-as-internal-net-zero-opponents-20251117-p5nfv3.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Weak Liberal Party ‘moderates’ as shameless as internal net zero opponents",
        "publish_date": "Mon, 17 Nov 2025 11:50:19 +1100",
        "category": "finance",
        "authors": [],
        "text": "It’s not a fun time to be a Liberal Party moderate. This year’s federal election wiped out a series of heavyweights, reducing the faction to just 16 members out of a partyroom of 51. It was also the second election in which teals tightened their grip over the inner-city seats traditionally the domain of moderate MPs.\n\nThe faction has now been comprehensively steamrolled on net zero, with the party of Robert Menzies last week adopting the climate change policies of a bunch of reckless and ignorant political operatives otherwise known as the Nationals.\n\nThe final policy is actually far worse than it seems at first glance. Not only has the Liberal Party abandoned any commitment to net zero, it also pledged to scrap Labor’s legislated suite of emissions reduction mechanisms and opened the door to using taxpayer funds to subsidise new or extended coal-fired power plants.\n\nThe Herald does not dispute that rising energy costs are a massive challenge for consumers and industry. But for many conservative MPs, this new policy is climate denialism masked as concern for affordability.\n\nBefore Wednesday’s partyroom showdown on net zero, Liberal moderates were threatening to quit the frontbench should the party drop its Scott Morrison-era commitment to net zero.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/property/news/expat-pays-965-000-for-a-converted-mechanic-s-shop-with-soaring-ceilings-at-auction-20251117-p5nfvf.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Expat pays $965,000 for a converted mechanic’s shop with soaring ceilings at auction",
        "publish_date": "Mon, 17 Nov 2025 11:46:54 +1100",
        "category": "finance",
        "authors": [
            "Shona Hendley"
        ],
        "text": "In Seddon, a converted mechanic’s shop, with a soaring seven-metre-high ceiling, was sold under the hammer for $965,000, or $165,000 over reserve, at auction on Saturday.\n\nThe two-bedroom home at 2/2A Lyons Street had a price guide of $750,000-$825,000 and a reserve of $800,000.\n\nThe industrial, warehouse-style apartment attracted over one hundred parties throughout the 24-day campaign, said selling agent Max Marcialis from Village Real Estate.\n\n“It was a good campaign with the property’s unique style and location, both big selling points,” he said.",
        "source": "TheAge"
    },
    {
        "url": "https://au.news.yahoo.com/reason-flights-delayed-sydney-airport-013931029.html",
        "title": "Reason flights delayed at Sydney Airport",
        "publish_date": "2025-11-17T01:39:31Z",
        "category": "finance",
        "authors": [],
        "text": "Sydney Airport is experiencing delays for many flights, particularly arrivals, as gusty westerly winds sweep across the region.\n\nAccording to the airport’s flight schedule, many arriving flights are delayed by 10 to 30 minutes, while departures are largely on time.\n\nAt 11.10am, winds reached near gale force at WSW 51.8km/h, with westerly gusts affecting the airport throughout the morning.\n\nStrong westerly winds reaching 51.8km/h are delaying flights into Sydney Airport. Picture: NewsWire / Gaye Gerard\n\nA Sydney Airport spokesperson said the weather had forced a runway change.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\n“Due to weather, Airservices Australia has shifted arriving and departing flights to Sydney Airport’s east-west runway, which may cause some delays throughout the day,” the spokesperson said.\n\nAccording to Sydney Airport, strong westerly winds can significantly impact operations.\n\nWhen wind gusts exceed 20 knots (about 37km/h), Airservices Australia moves flights from the dual north-south parallel runways to the single east-west runway.\n\nSingle runway operations are in place due to strong winds, reducing airport capacity. Picture: Christian Gilles / NewsWire\n\nThis process, known as “single runway operations”, reduces the airport’s capacity.\n\nFor example, if the schedule allows 70 movements per hour, 15-20 flights may need to be cancelled each hour while the winds persist. After delays, clearing the backlog is further limited by regulatory hourly movement caps.\n\nPassengers are encouraged to check with their airline regarding the status of their flight and allow extra time when travelling to Sydney Airport.",
        "source": "Yahoo"
    }
]