[
    {
        "url": "https://www.9news.com.au/national/crocodile-sighting-noosa-fisherman-spots-figure-on-sounder-queensland-news/5016e3a9-980d-4933-a5a7-773f1ee6c8fc",
        "title": "'Makes no sense': Fisherman spots suspected crocodile on sounder at Noosa",
        "publish_date": "Mon, 21 Jul 2025 09:33:05 +0000",
        "category": "sports",
        "authors": [
            "Jul"
        ],
        "text": "\"Of course that makes no sense here in Noosa in the middle of winter, but the moment Kai, who was on the back of the boat, said 'Oi, come have a look at this', you just take one look and say, 'that's a croc'.",
        "source": "9News"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-22/afl-marcus-bontempelli-western-bulldogs-contract-extension/105558340",
        "title": "Bontempelli rejects free agency to sign new Bulldogs deal",
        "publish_date": "Tue, 22 Jul 2025 01:07:07 +0000",
        "category": "sports",
        "authors": [],
        "text": "Marcus Bontempelli says he never seriously considered leaving the Western Bulldogs, after signing a new four-year extension to remain at the club.\n\nBontempelli ended months of speculation by forgoing free agency to sign a deal that will see him remain at the Bulldogs through the 2029 season.\n\n\"I've had a few different things happening — getting married in the off-season, opening a small coffee shop out in Kew — but ultimately it is no different to how I've dealt with other things in the past,\" Bontempelli said in a statement on Tuesday.\n\n\"It's an important decision to spend the right amount of time on.\n\n\"This club means so much to me, it's hard to put it into a few words, to be honest. It is where I have grown as a man and spent all of my adult years coming here at 18.\n\n\"When I think about the person I want to become, it has been influenced by the people I have spent a lot of time with at the Western Bulldogs.\n\n\"I owe so much from a footballing experience perspective, but I think I really owe a lot of my maturing as a person and as a man to the football club.\n\n\"For me, it's such a special place, the fans, the people that have supported me along the way. I've never not felt supported by our people here at the club.\n\n\"I feel incredibly lucky to have had that for so long.\"\n\nBontempelli and Darcy's aligned deals help Dogs plan for the future\n\nBontempelli's extension is a massive win for the Bulldogs, who can now go about re-tooling the side around he and boom forward Sam Darcy in the coming years.\n\nInterestingly, the extension Darcy signed late last year also runs through the 2029 season, which gives the Bulldogs flexibility to pivot one way or another when that time comes.\n\nDespite being 29, Bontempelli remains as prolific as ever and is arguably the best player in the competition. Losing him to a rival club would have been a terrible result and locking him into this extension is a no-brainer from a Bulldogs perspective.\n\n\"Marcus has not only become a generational player for the Western Bulldogs but one of, if not the, most influential players in the competition,\" Bulldogs football boss Sam Power said.\n\nThe Bulldogs now have both Sam Darcy and Bontempelli locked in through the 2029 season. (Getty Images: Matt King)\n\n\"His leadership and influence over our group and wider club is phenomenal, continually setting the standard on and off the field, always striving to get the best out of players and staff.\n\n\"As a player, Marcus has impacted games of football for the past decade with his unique blend of skill, athleticism and thriving in the game's biggest moments, rising to the occasion when our club has most required it.\"\n\nBontempelli has averaged 25.2 disposals per game and has kicked 15 goals in 13 outings so far this season.\n\nThis contract will see him enter his post-prime years, and the Dogs can look to the career arc of Geelong captain Patrick Dangerfield to see how Bontempelli might age.\n\nLoading...\n\nArguably Bontempelli's best trait as a footballer is his ability to be damaging at almost any position in the forward half of the ground, and this versatility will be well utilised in the coming years as the Dogs steadily dial down his midfield minutes to keep him fresh.\n\nDangerfield has gone from being a bulldozing midfielder to a genuine forward threat this season, and Bontempelli could wind up being an excellent forward-line foil to the prolific Darcy in the latter stages of this new deal.\n\nBontempelli is the latest big pillar to re-commit to the Bulldogs, with senior coach Luke Beveridge signing a two-year extension of his own earlier this season.\n\nWith Beveridge, Bontempelli and Darcy locked in, the Bulldogs have put themselves in a powerful position to potentially lure other big names to the club as they continue to build towards their next premiership.\n\nAs the conversation around West Coast youngster Harley Reid's future continues to bubble along, the Bulldogs could offer him the prospect of playing his prime years alongside the league's best player and the league's best young forward.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-22/shire-of-coolgardie-set-to-defy-local-government-minister/105550534",
        "title": "Outback council rejects minister's push for merger",
        "publish_date": "Tue, 22 Jul 2025 00:31:43 +0000",
        "category": "finance",
        "authors": [],
        "text": "A debt-laden outback council has threatened legal action to hold off a would-be merger with its larger neighbour.\n\nLocal Government Minister Hannah Beazley rose in state parliament in June to slam \"gross mismanagement\" at the Shire of Coolgardie, which she described as a \"financial mess\" amid concerns about its ongoing viability.\n\nCouncil documents show the the shire owed creditors $2.8 million at June 30, while carrying debt of $27.5 million with just $2.9 million cash in the bank.\n\nMs Beazley proposed a \"boundary adjustment\" with the neighbouring City of Kalgoorlie-Boulder, but has since been inundated with letters from ratepayers in both communities opposed to the merger.\n\nCoolgardie councillors on Monday endorsed a position paper detailing its fight to maintain its independence.\n\nThe shire said it would \"explore its legal position\" should Ms Beazley force an amalgamation.\n\nMalcolm Cullen is fighting to maintain the council's independence. (ABC Goldfields: Macey Turner)\n\nShire president Malcolm Cullen said the council wanted to work with the Department of Local Government over the next 12 months while trying to achieve financial and organisational stability.\n\nMr Cullen and Kalgoorlie-Boulder Mayor Glenn Wilson were due to fly to Perth on Tuesday morning for another meeting with the minister after she told both councils to reach a joint position at a meeting last month.\n\n\"The position that we will be taking to the meeting is basically to provide the shire more time to look at enacting a financial recovery plan that will return the shire to financial stability and also organisational stability for the future,\" Mr Cullen said.\n\n\"Certainly, just request that there be a bit a little bit of breathing space so that both the Shire of Coolgardie and the city can work through a number of issues that have been identified in discussions so far.\"\n\nThe discovery of gold at Coolgardie in 1892 earned the town the moniker \"mother of the Goldfields\". (ABC Goldfields: Jarrod Lucas)\n\nCity's position 'confidential'\n\nCity of Kalgoorlie-Boulder councillors discussed the proposed boundary adjustment behind closed doors at Monday night's ordinary council meeting, where the council also endorsed its 2025-26 Budget.\n\nMayor Glenn Wilson said a boundary adjustment was a legislative process which was different to an amalgamation or merger.\n\nHe said the Shire of Coolgardie would be dissolved if the action went ahead.\n\nHe said the council had been asked by the minister's office to keep its formal position confidential until after Tuesday's meeting.\n\nBut Mr Wilson did concede there was little to be gained by taking on the Shire of Coolgardie's mountain of debt.\n\n\"There has to be nothing that our residents pay for out of this … our residents and our community should not bear the brunt of others' debt,\" he said.\n\nGlenn Wilson says the council wants to assist its neighbour. (ABC Goldfields: Jarrod Lucas)\n\nThe Shire of Coolgardie has already proposed the sale of a controversial workers' accommodation village in Kambalda, which was built in 2022 by the council to take advantage of the Goldfields' most recent mining boom.\n\nThe 328-room Bluebush Village was last valued in March in the range of $16.4 million to $19.4 million.\n\nOccupancy rates were as low as 25 per cent earlier this year.\n\nThe shire said it planned to advertise Bluebush Village for sale by public tender from next month, evaluate offers in November and make a final decision on a proposed transaction in January.\n\nMr Cullen said early estimates suggested the sale would lower debt to manageable levels.\n\n\"It's in the ballpark, it's a ballpark figure,\" he said.\n\nResidents voice concerns\n\nResidents of both the Shire of Coolgardie and City of Kalgoorlie-Boulder have voiced their opposition to the merger in letters to the minister's office.\n\nKambalda real estate agent Cheryl Davis requested the minister delay a decision until the shire's financial situation was properly assessed.\n\nShe said the shire was making positive strides in operational improvement and renewed community engagement.\n\n\"These early signs of progress are encouraging, and we believe the shire should be given a fair opportunity to continue this momentum without the added pressure of structural changes at this time,\" Ms Davis said.\n\nKalgoorlie business owner Greg Bowden told the minister it would be \"unfair and impractical\" to expect the City of Kalgoorlie-Boulder to take on responsibility for another local government while dealing with \"its own internal challenges\".\n\n\"The risk of further instability and long-term financial pressure on both communities is real if this is rushed,\" he said.\n\nKalgoorlie-Boulder is one of Australia's biggest inland cities and home to about 30,000 people. (ABC Goldfields: Jarrod Lucas)\n\nFellow Kalgoorlie business owner John Bruce was concerned an amalgamation would place an \"unfair and unsustainable burden\" on ratepayers and businesses in Kalgoorlie-Boulder.\n\n\"Our city should not be expected to absorb the consequences of long-term mismanagement, nor take on liabilities and debt accumulated by another local government without adequate assessment and consultation.\"\n\nCoolgardie RSL sub-branch secretary Ann Meagher told the minister Coolgardie was \"more than just a dot on the map\".\n\n\"We have weathered storms before, and while we acknowledge the current challenges faced by the shire, we truly believe there is still time and opportunity to turn things around,\" she wrote.\n\nThe Parents and Citizen Association at Coolgardie Primary School also wrote to the minister with an urgent request to delay any boundary changes.\n\n\"We are considering the children of Coolgardie and the impact amalgamating with Kalgoorlie will cause,\" Coolgardie P&C president Coriana Boothey said.\n\n\"It is a major concern that as a small community and small school that we will be left behind and not receive the support we are in need of.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-22/nick-kyrgios-gael-monfils-doubles-return-to-tennis/105557724",
        "title": "Kyrgios 'cooked' as he labours and loses in first match since March",
        "publish_date": "Mon, 21 Jul 2025 22:22:14 +0000",
        "category": "sports",
        "authors": [],
        "text": "Nick Kyrgios has come through his first match since March, and just his sixth this year, completing about an hour on court in a men's doubles defeat at the ATP Tour's DC Open.\n\nPartnering French veteran Gael Monfils, and playing in front of NBA star Kevin Durant, Kyrgios faced third seeds Edouard Roger-Vasselin and Hugo Nys.\n\nMonfils was broken in the opening game, and while Kyrgios held his first serve, both players were then broken to lose the first set 6-2.\n\nThe second was much the same, Monfils broken early and Kyrgios late as they dropped it 6-2 again to lose in 58 minutes.\n\nThe entertainment potential of the Kyrgios-Monfils pairing drew a massive crowd to the Grandstand court in Washington, but it never truly eventuated as the Australian looked hampered and uncomfortable.\n\n\"Knee cooked but fans still f***ed with us,\" Kyrgios wrote on Instagram after the match.\n\nThe 30-year-old has battled wrist issues, but his knee has troubled him of late, and he was seen limping and poking at the injury.\n\nNonetheless, just being on court was something of an achievement for Kyrgios, who has been dogged by injury since reaching the Wimbledon final in 2022.\n\nThat year ended with him withdrawing from a match in Tokyo with a knee injury, and he has played only 10 matches (six singles, four doubles) for two wins on tour since.\n\nKyrgios last played doubles at the Australian Open in January, retiring in the second set of his opening match with Thanasi Kokkinakis while trailing fellow Aussies James Duckworth and Aleksandar Vukic 7-5, 3-2.\n\nHe subsequently played three singles matches, retiring when 7-6(8/6), 3-0 down in the first round at Indian Wells in March. The wrist he had an operation on in September 2023 was still an issue.\n\nHe reached the second round at the Miami Open later in the month, beating McKenzie McDonald for his lone singles win since 2022.\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\nIn the second round, he lost to Karen Khachanov, and this outing in the US capital was his first match since injuries continued to be an issue.\n\nKyrgios has a current ATP ranking of 640, but has activated his protected ranking of 21 to be included on the official entry list for the US Open in New York, where he is also scheduled to play in the reformatted mixed doubles alongside three-time major winner Naomi Osaka, starting in late August.\n\nIn another match at the DC Open, Chris O'Connell went down 6-3, 6-2 to American Ethan Quinn, ranked five places lower at world number 82, and later, Vukic takes on big-serving Frenchman Giovanni Mpetshi Perricard.\n\nOn the WTA side in DC, 19-year-old Maya Joint's first match as she builds up to the US Open ended in disappointment, beaten 6-3, 6-3 in 80 minutes by Canada's Leylah Fernandez.\n\nAlex de Minaur and Alexei Popyrin are also in the ATP 500 event but have received first-round byes.\n\nThe ABC of SPORT Sports content to make you think... or allow you not to. A newsletter delivered each Saturday.\n\nAAP",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-22/organist-james-odonnell-royals-westminster-abbey/105546644",
        "title": "Former organist for Queen Elizabeth shares what it's like working with royals",
        "publish_date": "Mon, 21 Jul 2025 22:00:00 +0000",
        "category": "entertainment",
        "authors": [],
        "text": "Depending on who you ask, the planning for British royal occasions might be the best- or worst-kept secrets in the world.\n\nSome of these plans have been in place for years, even decades.\n\nWhen James O'Donnell was the Organist and Master of the Choristers of Westminster Abbey, he was involved in the years-long planning of the music for these historic occasions. This included working with composers to write new music for the events.\n\nCurrently visiting Australia, O'Donnell reveals some of the behind-the-scenes workings of the royal church, and what it was like when his home turned into a high security zone.\n\nPlanning the music for royal state occasions\n\nMusic plays an integral part in enhancing the splendour of British royalty throughout history, much of which takes place in Westminster Abbey.\n\nWhen the Queen Mother, Elizabeth Bowes-Lyon, died in 2002, her funeral was held at the 1000-year-old royal church.\n\n\"I've never been involved in anything quite like that,\" O'Donnell says.\n\nO'Donnell started his role in 2000, and very soon after, the funeral was his first state occasion of international magnitude.\n\n\"One had a very strong sense that she represented a whole generation of British life,\" O'Donnell says.\n\n\"It came home to me on that occasion that one day in the distant future, Her Majesty the Queen would die as well.\"\n\nQueen Elizabeth's funeral planning reportedly began in the 1960s. Despite being involved in organising its music, O'Donnell never thought he would be there to see it through. It turned out to be the last state funeral O'Donnell oversaw.\n\nA Life Lived With Grace: The music composed for Queen Elizabeth II Photo shows The young princesses Elizabeth and Margaret stand at a piano while their mother plays and King George VI looks on. Queen Elizabeth was a lifelong champion of music and a staunch supporter of contemporary composers and musicians.\n\nPart of O'Donnell's job is to identify and work with composers who have been approved to write music for royal occasions.\n\n\"Commissioning music cannot be done at the time of a death of a monarch,\" O'Donnell says. \"It's all done very discreetly and there's no guarantee that the music which has been commissioned will be included in the final draft.\"\n\nO'Donnell did have at least one composer he could rely on, Master of the Queen's music, a position at the time held by British composer Judith Weir.\n\nWeir wrote a new anthem for Elizabeth's funeral, Like As The Hart, alongside another British composer, James McMillan, who wrote Who Shall Separate Us.\n\nOne musical choice harked back to Elizabeth's 1952 coronation: Ralph Vaughan Williams's O Taste And See. The piece has become a beloved staple for choirs around the world.\n\nA small price for privilege\n\nO'Donnell might have had the privilege of being part of the inner workings of royalty, but it did come with a price.\n\nWith the Abbey sitting at the heart of London and frequently hosting local and international VIPs, he often had to live with intrusive security measures.\n\nOne memorable occasion for O'Donnell was a private memorial service attended by the Queen as well as active members of the British intelligence service.\n\n\"I had to be escorted backwards and forwards to my house by a police officer,\" O'Donnell says.\n\nNo member of the congregation was to be photographed and O'Donnell says \"nobody was allowed into the sterile area.\"\n\n\"The sterile area was between my office, the choir room and my house [in the precinct of the Abbey].\"\n\n\"It could be a little inconvenient at times, but I thought that was a small price to pay for the privilege,\" O'Donnell says.\n\nSometimes, the rewards outweighed the inconvenience.\n\nThe royal couple William and Kate walked through the musicians who helped make their day so special. (REUTERS/Dave Thompson/Pool)\n\nThe wedding of Prince William to Catherine Middleton, which was watched by more than a billion people worldwide, was one of the highlights of O'Donnell's career.\n\n\"There were many discussions as to what music was chosen by the couple and the now king,\" O'Donnell says.\n\n\"It was a very joyful occasion and musically satisfying for the orchestra and choir.\"\n\nPrincess Kate's walk down the aisle of the Westminster Abbey was accompanied by Hubert Parry's I Was Glad. She passed through the musicians who were situated on either side of the aisle on her way to the altar.\n\nWhat does the Westminster Abbey Organist actually do?\n\nIronically for O'Donnell, being the Abbey's Principal organist meant he rarely had the chance to play the organ.\n\n\"It's a rather archaic job title,\" O'Donnell says, adding that his role was more focused on rehearsing and conducting the choristers on a day-to-day basis.\n\nO'Donnell was in charge of conducting the choir and orchestra during Prince William and Kate's wedding. (REUTERS/Dominic Lipinski/POOL)\n\nDespite its royal status, the Abbey is still a working church.\n\n\"We have daily evensong choral services open to the public as well as Sunday services,\" O'Donnell says, adding televised occasions such as royal weddings and funerals grew out of these daily routines.\n\nAside from historic state occasions, the Queen, who was the head of the Church of England and a staunch music lover, was often present during many of these services.\n\n\"Often when we performed a new commission, [the Queen] would say 'I enjoyed the music',\" he says.\n\n\"These were often newly created pieces of music that were carefully crafted for [special] occasions and the Queen's words were much appreciated.\"\n\nAs rewarding as his role was, O'Donnell has enjoyed having more time to spend playing the organ alongside his current teaching position at Yale University in the US.\n\nHe has a warm spot for Australia, bringing the Westminster Abbey Choir on tour in 2007. Last year, he gave recitals in Adelaide and Sydney, inaugurating the new organ at Sydney's historic St James King St church.\n\nOne of the highlights of O'Donnell's current Australian visit will be playing the Sydney Opera House's Grand Organ. He says it is built differently to a lot of church organs.\n\n\"Westminster Abbey organ or St. Paul's Cathedral organ is designed to support worship,\" O'Donnell says. \"They don't overwhelm the choir when they're being played.\"\n\nThe Grand Organ is a fixture of the Sydney Opera House's Concert Hall, but rarely played for solo recitals. (Sydney Opera House: Cassandra Hannagan)\n\nThe Sydney Opera House's organ, on the other hand, is 15 meters high and 13 meters wide.\n\n\"It is the largest mechanical action organ in Australia, [meaning] despite its size, it uses actual levers instead of electricity to operate,\" O'Donnell explains.\n\nDespite being a fixture of the Concert Hall, the organ is rarely used for solo performances.\n\n\"I know what it sounds like and you can hear it online,\" O'Donnell says. \"I've never played it but I'm looking forward to it.\"\n\nYou can hear James O'Donnell with the Queensland Symphony Orchestra in Brisbane on July 26 and 27, and at the Sydney Opera House on Tuesday July 29. ABC Classic will broadcast a live recording of his Brisbane concert in August.\n\nGet the latest classical music stories direct to your inbox",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-22/asx-markets-business-news-live-updates/105557032",
        "title": "Live: Miners lead ASX higher, Insignia jumps after takeover",
        "publish_date": "Mon, 21 Jul 2025 21:30:04 +0000",
        "category": "finance",
        "authors": [
            "Stephen Letts",
            "Gareth Hutchens",
            "Daniel Ziffer",
            "Stephanie Chalmers"
        ],
        "text": "With hopes fading of trade deal between the EU and US being struck ahead of the August 1 deadline, Reuters is reporting European nations are already turning their thoughts to retaliation.\n\nThe European Union is exploring a broader set of possible counter-measures against the United States as prospects for an acceptable trade agreement with Washington fade, according to EU diplomats.\n\nAn increasing number of EU members, including Germany, are now considering using wide-ranging \"anti-coercion\" measures which would let the bloc target US services or curb access to public tenders in the absence of a deal, diplomats say.\n\nThe European Commission, which negotiates trade agreements on behalf of the 27-member bloc, had appeared on course for an agreement in which the EU would still have faced a 10% US tariff on most of its exports, with some concessions.\n\nSuch hopes now seem dashed after President Donald Trump's threat to impose a 30% tariff by August 1, and following talks between EU Trade Commissioner Maros Sefcovic and US counterparts in Washington last week.\n\nSefcovic, who has said a 30% tariff would \"practically prohibit\" transatlantic trade, delivered a sober report on the current state of play to EU envoys on Friday, diplomats told Reuters.\n\nUS counterparts had come up with diverging solutions during his meetings, including a baseline rate that could be well above 10%, the EU diplomats added.\n\n\"Each interlocutor seemed to have different ideas. No-one can tell (Sefcovic) what would actually fly with Trump,\" one diplomat said.\n\nProspects of easing or removing 50% US tariffs on steel and aluminium and 25% on cars and car parts appear limited.\n\n'Nuclear option'\n\nWashington has also rejected the EU's demand for a \"standstill\" arrangement, whereby no further tariffs would be imposed after a deal is struck. The rationale, according to diplomats, is that Trump's hands cannot be tied on national security, the basis of Section 232 trade investigations into pharmaceuticals, semiconductors and timber.\n\nAccordingly, the mood has pivoted among EU countries, EU diplomats say, and they are more ready to react, even though a negotiated solution is their preferred option.\n\nThe EU has one package of tariffs on 21 billion euros ($US24.5 billion) of US goods that is currently suspended until August 6.\n\nThe bloc must still decide on a further set of countermeasures on 72 billion euros of US exports.\n\nDiscussions have also increased on using the EU's wide-ranging \"anti-coercion\" instrument (ACI) that allows the bloc to retaliate against third countries that put economic pressure on member states to change their policies.\n\nBrought in more with China in mind, it would allow the bloc to hit trade in US services, in which the US has a trade surplus with the EU, limit US companies' access to financial service markets and to public tenders in the EU. Public procurement in the EU is worth around 2 trillion euros per year.\n\nPossible measures also include restricting US investment and limiting the protection of intellectual property rights and restrictions on the ability to sell US chemicals or food products in Europe.\n\nFrance has consistently advocated using the ACI, but others have baulked at what some see as a nuclear option. Trump has warned he will retaliate if other countries take action against the United States.\n\nEuropean Commission president Ursula von der Leyen said a week ago that the ACI was created for extraordinary situations, adding: \"We are not there yet.\"\n\nThe Commission would need a qualified majority of 15 countries making up 65% of the EU population to invoke it. It would not do so unless it was confident of passing it, but there are now growing signs of support building, with Germany among the countries saying it should be considered, EU diplomats say.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-22/isaah-yeo-kevin-walters-kangaroos-coach/105557654",
        "title": "Kevin Walters earns major endorsement for Kangaroos coaching job",
        "publish_date": "Mon, 21 Jul 2025 21:12:27 +0000",
        "category": "sports",
        "authors": [],
        "text": "Isaah Yeo has endorsed Kevin Walters as Australia's next coach, with the Kangaroos captain labelling the Brisbane legend a man people want to play for.\n\nWalters is expected to be announced as Mal Meninga's successor this week, with the ARL Commission (ARLC) finalising plans to unveil him ahead of this year's Ashes.\n\nIt comes after Meninga was forced to step down upon taking on the Perth Bears job last month and the ARLC ruled out having a club coach in charge.\n\nWalters's appointment will mark his return to coaching after being axed by Brisbane at the end of 2024. He previously led Queensland in four State of Origin series from 2016 to 2019, winning two.\n\nYeo has never previously worked with Walters, with his only dealings being in post-match interviews or playing against him while in charge of the Broncos, when Yeo's Panthers broke Brisbane hearts in the 2023 grand final.\n\nABC Sport is live blogging every round of the AFL and NRL seasons in 2025.\n\nBut he has spoken to a number of players about the 57-year-old, and was happy to have him take over the Kangaroos ahead of the Ashes.\n\n\"You can see how much he meant to the players by talking to the Broncos' boys,\" Yeo said.\n\n\"If it wasn't for Nathan Cleary killing it for 16 or 17 minutes, then he'd be a premiership-winning coach. Everyone I've spoken to has massive wraps on him.\n\nYeo and the Panthers kept Walters from winning a premiership in 2023. (Getty Images: Matt King)\n\n\"He's come out and said how much of an honour it'll be to be able to coach Brisbane, Queensland and his last one was going to be Australia.\n\n\"I'm super excited for him. You can see how much it means to him already, and I'd love to be a part of it with him.\"\n\nWalters's appointment will give him just three months to prepare for the Ashes, with the first Test against England at Wembley Stadium on October 25.\n\nThat short lead-in was part of former NSW coach Brad Fittler's reasoning to withdraw from the race, while also concerned about juggling media commitments.\n\nYeo is happy the coaching questions will soon be answered, with Walters able to fully focus on the tour without worrying about a club side.\n\n\"That's probably where it's gotten a little bit hard for whoever was going to come in, because it's going to be rushed for them,\" Yeo said.\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\n\"It'd be hard being an NRL coach and having to worry about a push to the finals, and then you're trying to do this stuff on top of it.\n\n\"It's nice that it's all done and sealed, and we can now get to planning what will hopefully be a successful series over there.\n\n\"He's been pretty busy, Kev, doing a lot with Fox [Sports] at the moment. But it certainly helps because he's now got three months to try to figure it out.\"\n\nWalters's appointment comes after Cameron Smith also put his hand up for the job, while the ARLC's no-club-job approach ruled out Wayne Bennett.\n\nThe ABC of SPORT Sports content to make you think... or allow you not to. A newsletter delivered each Saturday.\n\nAAP",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-22/federal-politics-live-blog-parliament-returns-july-22/105557602",
        "title": "Live: 'Surprised' Pocock declines Hanson's nomination for Senate president",
        "publish_date": "Mon, 21 Jul 2025 21:00:54 +0000",
        "category": "finance",
        "authors": [
            "Tom Crowley",
            "Courtney Gould",
            "Jake Evans"
        ],
        "text": "The green house is a sea of red as the 150 members of the lower house are sworn in.\n\nA staggering 94 of those are Labor MPs, many decked out in the party's colours for the occasion, their ranks stretching all the way to the other side of the chamber.\n\nColourful moments abound, including the first of many height-related gags involving the chamber's tallest member, Matt Smith, who was sworn in alongside the tiny Anne Urquhart and gave her a big bear hug, met with laughter.\n\nSome love on the Liberal side for Labor's other Big Fella Dan Repacholi, who was met with an 'onya Repa' when he took to the bench.\n\nDai Le is again wearing her Australian flag outfit, and Bob Katter is not to be missed in his trademark scarf.\n\nKatter also declines to swear allegiance to the King and his heirs and successors, replying 'no, I swear allegiance to the Australian people'.\n\nSeveral MPs have also brought their own texts to be sworn in, including Ed Husic with the Koran, while Josh Burns and Mark Dreyfus wore yarmulkes.\n\nHusic and Dreyfus also have new seats to get used to, consigned to the backbench.\n\nThe new MPs are easy to spot, beaming and a bit bewildered. The press gallery whispers among itself trying to put names to dozens of unfamiliar faces.\n\nAnd the public galleries are packed for the occasion; even ANU Chancellor Julie Bishop, a veteran of many swearings-in, is spied watching on.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-22/nt-gunbalanya-aboriginal-health-clinic-closing-the-gap/105470546",
        "title": "The unlikely killers near Australia's most dangerous river crossing",
        "publish_date": "Mon, 21 Jul 2025 20:43:16 +0000",
        "category": "lifestyle",
        "authors": [],
        "text": "First Nations people living in the remote Northern Territory are still not expected to reach their 70th birthday.\n\nA rare visit inside one of the NT's oldest bush clinics demonstrates why.\n\nKakadu National Park's notorious Cahills Crossing is the only road in and out of the Aboriginal community of Gunbalanya.\n\nEvery day during the dry season, drivers plough their vehicles through the East Alligator River, navigating high tides and saltwater crocodiles as tourists look on.\n\nDuring the wet season, the remote community is cut off by road entirely.\n\nCahills Crossing is known for its saltwater crocodiles and dangerous river conditions. ( )\n\nBut it's not crocodiles harming locals out here — it's preventable diseases.\n\nIn the Northern Territory's remote west Arnhem Land, common health problems are growing into unlikely killers.\n\nHigh blood pressure is leading to kidney dysfunction and skin infections are resulting in permanent heart damage.\n\nFirst Nations Territorians suffer disproportionately high rates of rheumatic heart disease. ( )\n\nA patient waits to be treated at the Gunbalanya health clinic. ( )\n\nThe decades-old clinic is still operational. ( )\n\nDespite the region's high burden of chronic illness, many patients dread going to Gunbalanya's makeshift health clinic.\n\nThe decaying facility was originally built to manage a leprosy outbreak in the mid-20th century, according to Aboriginal health organisation Red Lily Health Board.\n\n\"[It] was not designed to be a community health centre,\" its chief executive Brad Palmer said.\n\nThe clinic was transferred from the NT health department to Red Lily Health Board earlier this month.\n\nInside the asbestos-riddled building, paint is peeling off the walls and under-resourced health staff have become experts in compromise.\n\nAboriginal health support worker Houston Manakgu finds patients and encourages them to visit the clinic. ( )\n\nThe clinic has fallen into disrepair. ( )\n\nHealth clinic staff make do with few resources. ( )\n\nThe biggest issue for patients is a lack of privacy.\n\nAbout 1,350 people from different clan groups live in Gunbalanya and everyone knows each other.\n\nThe local clinic is so small that patients are sometimes asked to discuss personal health information in the same room as an acquaintance.\n\nHealth support worker Houston Manakgu said the building's inappropriate design was a major deterrent for patients.\n\n\"In Aboriginal culture way, man and female … have to be separate,\" he said.\n\nAvoiding \"poison cousins\" — certain relatives who must be avoided under Aboriginal kinship systems — is near impossible inside a bush clinic with one unisex toilet.\n\nHouston Manakgu says the Gunbalanya clinic does not consider cultural protocol. ( )\n\nThere's only one unisex toilet inside the building. ( )\n\nThe building is riddled with dangerous asbestos. ( )\n\nMr Manakgu said many people avoided the clinic altogether.\n\n\"[They] say, 'Big mob in there. Maybe we come back later,'\" he said.\n\nAboriginal Medical Services Alliance NT chief executive John Paterson said delaying medical treatment was a common issue in remote communities, where chronic illnesses often developed into health emergencies.\n\n\"If it goes untreated, then it worsens and worsens,\" he said.\n\n\"It gets to the stage where it requires the patient being uplifted from remote communities and brought into an already overcrowded Royal Darwin Hospital.\"\n\nJohn Paterson says preventable diseases are turning into serious medical emergencies. ( )\n\nRecognising the building's flaws, the former Labor government promised Gunbalanya a new health clinic in 2020.\n\nFive years later, the community is still waiting.\n\nNow, there's even further doubt after the Country Liberal Party government removed the $20 million project from its first budget.\n\n\"My first reaction was surprise because it had been promised,\" Mr Palmer said.\n\n\"The design had been completed, the tender documents had been completed. It seemed it was a done deal.\"\n\nRed Lily Health Board chief executive Brad Palmer said his team was blindsided by the funding cut. ( )\n\nMr Palmer said Red Lily Health Board had since been kept in the dark about the project's future.\n\n\"We just don't know anything,\" he said.\n\n\"There hasn't really been any explanation of the reason why it was removed from the budget.\"\n\nIn a statement, an NT government spokesperson blamed the previous Labor government for promising infrastructure projects it couldn't deliver.\n\n\"Labor had announced a record number of projects but failed to allocate sufficient funding to deliver them,\" the spokesperson said.\n\n\"We have not ruled out delivering a new health clinic at Gunbalanya, and it remains on the forward program for consideration.\"\n\nMr Paterson said this kind of chopping and changing of government policy was holding Australia back from closing the gap on life expectancy.\n\nThe NT has Australia's lowest life expectancy. ( )\n\nAustralia hopes to close the life expectancy gap by 2031. ( )\n\nThe most recent Productivity Commission data shows First Nations boys born in 2020-2022 are expected to live to about 72 years and girls to 75 years, while non-Indigenous children are expected to live to about 80 years and 84 years respectively.\n\nThe gap is even wider in the remote Northern Territory, which has the lowest life expectancy in Australia.\n\nIn communities like Gunbalanya, Aboriginal men are expected to live to about 65 years, while Aboriginal women are expected to live to about 69 years, data from the Australian Bureau of Statistics shows.\n\nThe data shows life expectancy for First Nations women in the NT is worse today than it was 15 years ago.\n\n\"Politicians and governments will only do stuff on a three-year cycle in between each election,\" Mr Paterson said.\n\n\"There's no long-term generational planning and funding commitment to really make a difference.\"\n\nRed Lily Health Board chairperson Marcia Brennan said listening to Aboriginal people was key to making progress.\n\nMarcia Brennan says improving First Nations health outcomes requires genuine collaboration. ( )\n\nShe said the government's failure to consider cultural protocol at the health clinic was just one example.\n\n\"In our community, culture will always be there,\" she said.\n\n\"It doesn't matter if we're in a balanda building or at home.\"\n\nMs Brennan said the clinic's transition from the NT health department into Aboriginal community control was a step in the right direction.\n\n\"Aboriginal staff need to be in Aboriginal clinics,\" she said.\n\n\"We have to work together.\"\n\nLoading...\n\nCredits",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-22/nsw-fines-ebike-safety-regulation-certification-delay/105529070",
        "title": "The NSW e-bike changes that saw retailers rapidly clear stock delayed",
        "publish_date": "Mon, 21 Jul 2025 20:21:59 +0000",
        "category": "finance",
        "authors": [],
        "text": "A safety requirement deadline for e-bikes that some believed would threaten food delivery, tourism and consumer options in NSW has been pushed back after outcry from the industry.\n\nFines of up to $825,000 were meant to commence from August 1 for manufacturers and suppliers who did not have e-bike models and parts certified on time — including lithium-ion batteries or chargers.\n\nThe new product standards, introduced earlier this year, were a nationwide first to tackle fire risk, also applying to hire e-bikes and similar micromobility products like e-scooters or skateboards.\n\nThere have been 166 lithium-ion-related fires so far in NSW in 2025. (ABC News: Emma Wynne)\n\nBut stakeholders argued there would be adverse effects from the \"unrealistic accreditation deadlines\" and said the bigger concerns were homemade kits, illegal imported e-bikes and poor-quality versions being bought online or overseas.\n\nRetailer 99 Bikes began clearing stock in preparation, while US manufacturer Trek said it would have been forced to withdraw from sales in NSW in order to comply with the original date.\n\nAfter some pressure, the NSW government quietly announced last week the cut-off was postponed until next February.\n\nHere's how the new date will affect customers trying to buy or rent e-bikes in the state.\n\nWhat are the e-bike safety changes?\n\nLike dishwashers or hair dryers, e-bikes must now meet international electrical standards and be approved before sale.\n\nNSW Fair Trading said the new standards — including providing information about safe use, storage, charging and disposal — would help ensure only compliant products were available on the market.\n\nRegulation and Fair Trading Minister Anoulack Chanthivong said it would also crack down on fires sparked by low-quality batteries.\n\nAccording to Fire and Rescue NSW (FRNSW), there have been 166 lithium-ion-related incidents in the state so far this year.\n\nGeneral manager of Bicycle Industry Australia Peter Bourke said the government's \"one size fits all\" approach bunched together \"good-quality\" e-bikes with \"lower-end\" alternatives.\n\n\"This declared articles framework the New South Wales government utilises has been designed around household goods,\" he said.\n\n\"They've actually compared e-bikes to the same electrical frameworks as toasters and electric blankets.\"\n\nPeter Bourke said hire bikes were also affected. (ABC Education: Tim Purdie)\n\nWhat was feared to happen?\n\nAfter receiving feedback, NSW Fair Trading said consultation concerns included \"delays in obtaining test reports, costs associated with testing, and confusion around the scope\" of the process.\n\nApplying for certification with the consumer regulator costs about $1,200 per bike, but additional lab testing can be over $20,000 per model and take up to six months, Mr Bourke said.\n\n\"The challenge is not about meeting the certification, it's about going through the testing protocols,\" he said.\n\nSome industry figures say illegal models and modification kits were more of a concern than current ones on the market. (ABC News: Kirsten Webster)\n\nChief executive of 99 Bikes Andrew Garnsworthy said the chain was supportive of the \"overall objective to have high-quality e-bikes and a reduction in e-bike battery fires\".\n\nHe said the initial \"unrealistic accreditation deadlines\" would have led to safer models being pulled from the market.\n\nIn turn, Mr Garnsworthy said consumers could resort to lower-quality alternatives available online from overseas, which could \"backfire and unfortunately increase the amount of battery fires\".\n\nHe welcomed the \"sensible\" extension, but said the testing costs, even pushed back, could \"increase the costs of e-bikes in NSW\" for consumers.\n\nAndrew Garnsworthy described the new February deadline as \"sensible\". (ABC News: Stephen Cavanagh)\n\nOutdoors NSW said at the start of July that the implementation would \"devastate cycle tourism, force business closures, and risk millions of dollars in government investment in regional adventure tourism\".\n\nThis is because hire e-bikes, used by tour companies and in food delivery, were not exempt from the certification rules.\n\nLithium-ion battery fires escalating in NSW Photo shows A window of a home damaged by a fire. Last year, Fire and Rescue NSW reported 323 fires ignited by lithium-ion batteries, an increase from 272 fires in 2023, and 165 fires in 2022.\n\n\"Good-quality hire bikes for food delivery … operate on a monthly hire process,\" Mr Bourke said.\n\n\"So those [third party companies] wouldn't have been able to hire their product out either, and so the gig economy workers would also have been messed up.\"\n\nA spokesperson for NSW Fair Trading said the cost of certification was \"expected to be borne by manufacturers, with small businesses primarily responsible for verifying that the products they sell are compliant\".\n\n\"Matters relating to illegally imported bikes fall under the jurisdiction of the Commonwealth Government,\" they said.\n\nWhat happens next?\n\nNSW Fair Trading confirmed the new compliance deadline came after \"feedback from industry stakeholders\".\n\n\"Despite the extension, all declared e-micromobility products must continue to meet the prescribed safety standards and NSW Fair Trading will maintain active market surveillance and enforcement action against suppliers found selling non-compliant products,\" the spokesperson said.\n\nMr Bourke said for customers hoping to buy or upgrade their e-bike next month, it would be \"business as usual\".\n\nThe changes also apply for hire bikes, often used in food delivery and the gig economy. (ABC News: Abubakr Sajid)\n\n\"Brands are looking to certify their product as fast as possible, and over the coming months there will be an ability to replace stock,\" he said.\n\n\" At this stage, we don't anticipate a shortage. \"\n\nSmaller fines of up to $5,500 will still be enforced on August 1 for suppliers who do not provide clear and accurate safety information alongside products.\n\nThe final piece of the puzzle is the introduction of mandatory labelling, which is also set to kick off next February.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-22/bendigo-concussion-clinic-high-demand-for-treatment/105371748",
        "title": "Country footballers desperate for concussion treatment book out clinic",
        "publish_date": "Mon, 21 Jul 2025 20:18:29 +0000",
        "category": "sports",
        "authors": [],
        "text": "On bad afternoons for a few months last year, 24-year-old concussion victim Jeremy Rodi would forget how he had spent the day.\n\nConstant migraines, nausea and fatigue made it one of the most terrifying periods of his life, and he became anxious about his future.\n\nJeremy Rodi had to stop work and football due to concussion. (ABC Central Victoria: Emile Pavlich)\n\n\"My close family was quite scared. It was just so uncertain how I was going to wake up feeling,\" Mr Rodi said.\n\n\"Am I [going to be] able to do the normal things that parents do with their kids?\n\n\" Or am I going to be affected by my concussions as a football player? \"\n\nMr Rodi is aware of six concussions he suffered while playing football, including as a talented junior footballer who went through Victoria's elite under-18 competition.\n\nHe said he had \"no idea\" some of the blows would have such a big impact on him in his mid-20s.\n\n\n\nFor treatment, Mr Rodi saw a specialist in Melbourne.\n\nNow, a concussion clinic has opened in the regional city where he lives, Bendigo, and appointments are booked out.\n\nLocal footy injuries\n\nThe AFL has faced a reckoning over its concussion management since former players suffering the long-term effects of concussion launched a class action.\n\nIt introduced policies for players and clubs at elite and local levels after a series of high-profile cases of former players with chronic traumatic encephalopathy (CTE), a degenerative brain disease caused by repeated head injuries.\n\nAs awareness of concussion grows, so too does demand for treatment in regional areas.\n\nDaniel Hamilton is a sports physiologist and physiotherapist who opened a dedicated concussion clinic in Bendigo in February, the first of its kind in Victoria outside of Melbourne and Geelong.\n\nDaniel Hamilton has opened a concussion clinic in Bendigo. (ABC Central Victoria: Emile Pavlich)\n\n\"People are probably travelling between 100 and 200 kilometres,\" Mr Hamilton said.\n\n\" We're open two-and-a-half days a week and we're booked out [in two-week cycles]. \"\n\nMr Hamilton said most of his patients had suffered head knocks during weekend community football.\n\nAnd even though Australian football is the leading cause of sport-related concussion in Victoria, he said many local club officials were not aware of the education resources available.\n\n\"That's half the battle,\" Mr Hamilton said.\n\nThe AFL has been managing concussions with more guidelines around return to play. (AAP: Joel Carrett)\n\nMr Rodi agreed there was not enough concussion awareness at a local sporting level.\n\n\"If you get hit in the head and you're not feeling right, you need to come off and we need to assess you,\" he said.\n\n\" There are certainly too many players at the moment [who] are still staying out there and going, 'I'll be fine.' \"\n\nIt is estimated that more than 100,000 sports concussions occur each year in Australia, most unreported, according to AIS Sports Concussion Guidelines analysis.\n\nMr Hamilton said he hoped his outreach educational programs on concussion with local clubs would broaden awareness on how to manage head knocks.\n\nDaniel Hamilton says his service is in high demand. (ABC Central Victoria: Emile Pavlich)\n\n\"We need to go through the right protocol and the right rehabilitation,\" he said.\n\n\"Things like change of work, change of school [and] lifestyle modification can make a big difference to minimising the risk of getting those symptoms that last for six to eight to 12 weeks.\n\n\" You've got to put it in perspective, it's our brain. \"\n\nApp-ification of concussion care\n\nAFL Victoria advises clubs to use the HeadCheck App, an evidence-based phone application that helps identify concussions.\n\n\"Anything that can guide people without the medical knowledge or background is beneficial at the moment,\" Mr Hamilton said.\n\nHowever, neuroscience academic Alan Pearce said the management and understanding of concussion in sport should not be based on a phone app.\n\nAlan Pearce predominantly studies sports-related head injuries. (ABC News: Billy Draper)\n\n\"One of the things about concussion is that it's a medical diagnosis and no-one else other than a medical doctor can diagnose a concussion,\" he said.\n\n\"What clubs really should be doing is more than just rely on an app.\n\n\"Community clubs around Victoria and Australia really need to be developing relationships with their local concussion clinics and doctors in order to be able to look after their players properly.\"\n\nAlan Pearce says he wants the King-Devick eye test to be adopted in community sport. (ABC News: Billy Draper)\n\nThere is one concussion per 20 players each season in community football, according to the AFL.\n\nBut Dr Pearce said he believed the actual figure was six to 10 times higher.\n\n\"Many physios and osteos and doctors don't really know what to do,\" he said.\n\n\" What we need are concussion clinics to help with the follow-up and the rehabilitation of these players. \"\n\nAFL Victoria has been contacted for comment.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-22/wine-grape-growers-battle-drought-and-soaring-water-prices/105457134",
        "title": "'We're at breaking point': Drought and soaring water prices push wine grape growers to exit",
        "publish_date": "Mon, 21 Jul 2025 20:13:07 +0000",
        "category": "finance",
        "authors": [],
        "text": "Ballooning water prices in Australia's largest wine grape growing region are pushing farmers to the brink, with many unable to break even.\n\nGrowers fear the soaring price on the water market will be the \"nail in the coffin\" for the industry.\n\nThe low returns have been caused by a mixture of environmental and market conditions, including tariffs, a decline in wine drinkers and frost.\n\nA worldwide oversupply of red wine has also seen prices offered for shiraz, cabernet and merlot plummet to record lows.\n\nAs drought continues to plague parts of southern Australia, growers are now faced with the increasingly tough reality of supply and demand on the water market.\n\nWine grape growers are not immune to the impacts of drought. (ABC Riverland: Will Hunter)\n\nA 'dire' situation\n\nGrowers are finding themselves needing more water to keep their crops viable during dry conditions as well as paying more to lease the finite resource.\n\nSome have told the ABC they have had to use 30 per cent more water, with prices as high as $350 a megalitre, and fear further rises could be on the horizon.\n\nData by water consultancy Ricardo Group showed temporary water prices reached up to $350 per megalitre in the past year.\n\nRicardo Group associate director and water markets lead Ben Williams said water trade prices fluctuated between $280 to $330 per megalitre between May and June.\n\nPrices were higher than the average water price in the lower Murray over the past decade, which sat around $200 per megalitre.\n\nLoveday grower Jim Giahgias is among growers feeling the impact of rising water prices, despite owning some permanent water rights.\n\nHe has been forced to rely on the temporary water market — where water can be bought, sold and traded based on demand — which has seen prices increase partly due to the drought.\n\nIt has left Mr Giahgias contemplating to pull out some of his red grape vines to cut costs, as he battles with the perception that grape growers are \"millionaires\".\n\nJim Giahgias has contemplated pulling out some of his red grape vines due to the oversupply. (ABC Riverland: Will Hunter)\n\nHe said he wanted consumers to know while they might pay $50 a bottle at a restaurant, the grower does not see the profits.\n\n\"Especially the red variety, the grower receives 20 cents from that bottle, which is probably less than the cork,\" he said.\n\nHe explained the 20-cent gross amount did not account for farmers expenses, including water, leaving them \"$150 a tonne out of pocket\".\n\nWhile he said he found it difficult having to buy more water the situation was \"a lot more dire\" for those who leased every drop.\n\nThe threat of fines\n\nFarmers in the Murray-Darling without permanent water rights, or those who do not own enough, rely on buying water from the temporary market.\n\nThe longer it does not rain, the more water people need to buy, causing a spike in both demand and temporary water prices.\n\nIn 2019-2021 the Australian Competition and Consumer Commission (ACCC) conducted a water markets inquiry, following irrigators' claims that non-farming investors have driven up the price they pay for water.\n\nSince then, a Water Markets Intermediaries Code has been developed, and has partially come into effect from this month, regulating how eligible intermediaries water markets conduct themselves with current and proposed clients.\n\nRiverland Winegrape Growers Association board member Jack Papageorgiou said the situation on the ground was \"serious\" for those totally reliant on the market.\n\nJack Papageorgiou is concerned about the effects the drought is having on growers. (ABC Riverland: Will Hunter)\n\nHe said some growers had inadvertently used more water than they were allowed, due to the dry conditions, and had no funds to balance their accounts.\n\n\"Their meters have been locked, and they can't irrigate the vineyards unless they go to the marketplace and lease the water,\" he said.\n\nThere are significant penalties for water overuse in South Australia, which has forced water suppliers to clamp down on growers who cannot pay their bills.\n\nSuppliers to Riverland growers include the Renmark and Central Irrigation Trusts, which are collectives of irrigators and farmers who share water supply infrastructure.\n\nCIT chief executive officer Greg McCarron said water supplies were only locked as a \"last resort\" to avoid exposing the collective to large fines.\n\nGreg McCarron runs Central Irrigation Trust, one of the biggest water suppliers to Riverland irrigators. (ABC Riverland: Will Hunter)\n\n\"Non-compliance from farmers … can result in us not being able to balance our water accounts with the state government and face significant overuse fines,\" he said.\n\nA Department for Environment and Water spokesperson said no water overuse penalties had been issued in the 2024-25 financial year.\n\nThe spokesperson said penalties were \"at least three times higher than the price of purchasing water on the water market\" and could be higher in the River Murray.\n\nExiting the industry\n\nFor growers like Amanda Dimas, who has already replaced vines in favour of more profitable varieties, the uncertainty of the water market remained troubling.\n\n\"There's been no return for so many years now, and I think this is the nail in the coffin,\" she said.\n\n\"Growers are really struggling, their mental health isn't good.\"\n\nShe called for government support to assist growers wanting to transition to other crops or exit the industry completely.\n\nAmanda Dimas wants to see government support for wine grape growers battling through the industry crisis. (ABC Riverland: Will Hunter)\n\n\"Vines are one of the hardest things to remove, they are so costly,\" Ms Dimas said.\n\n\" How do growers exit, when they don't have the funds? \"\n\nIt costs about $7,000 per hectare to remove vines, partly because the treated pine posts are difficult to dispose of.\n\nMr Giahgias said the only way for the industry to \"survive and move forward\" was to pull grape varieties which were no longer profitable.\n\n\"We can't take anymore, we're at breaking point now,\" he said.\n\n\"If the decision is to remove vineyards, to help the industry, I believe it has to be legislated … one grower can't be pulling while the other is planting.\"\n\nGrowers acknowledge some vineyard removals are needed but call for a legislated process. (ABC News: Nathan Morris)\n\nNeed for support to avoid 'trainwreck'\n\nState Primary Industries Minister Clare Scriven said the state government was investing in ongoing work examining wine grape growers' transition.\n\n\"Some of the funded work has been around what alternative crops might look like or what alternative varieties may look like,\" Ms Scriven said.\n\nAs a member of the National Wine Working Group, she said some of the group's recommendations were a need for \"structural changes\" within the industry.\n\n\"It's not necessarily a matter of government intervention, it's a matter of industry continuing to work through the issues.\"\n\nMs Scriven said exit packages were not receiving \"a great deal of support\" at a state or federal government level, referencing the 1980s vine pull scheme as an example.\n\n\"Vine pulls generally do not have a positive impact on long-term sustainability of the industry,\" she said.\n\nClare Scriven says \"structural changes\" within the wine industry are needed. (ABC News: Brant Cumming)\n\n\"That sort of government intervention can have absolutely unintended consequences, which could make it worse for growers rather than better.\"\n\nRiverland Wine general manager Alexandra Cannon said financial support for growers to leave the industry was essential.\n\n\"There needs to be some support for exit packages or it's going to be a trainwreck especially in this region,\" she said.\n\nThe International Organisation of Vine and Wine's latest data showed the global vineyard area reduced for a fourth consecutive year.\n\nSpain and France are some of the world's largest wine grape growing countries and are among those ripping out vines.\n\nIn France, the government launched a 120 million euro ($215.6 million) scheme to remove up to 30,000 acres of vineyards last year.\n\nClare Scriven says the state government is not in support of vine pulls. (ABC News: Matt Roberts)\n\nGrowers were offered a financial incentive of 4,000 euros ($7,190) per hectare.\n\nMr Giahgias said similar subsidies were needed in Australia but felt growers were unheard, describing the situation at 'stalemate'.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-22/australia-to-miss-out-on-top-up-tax-from-multinationals-oecd/105555376",
        "title": "'Free pass to dodge taxes': Critics slam US exemption from global tax floor",
        "publish_date": "Mon, 21 Jul 2025 20:00:35 +0000",
        "category": "finance",
        "authors": [],
        "text": "Australia could miss out on significant revenue from US multinational companies operating here, after the G7 \"caved\" to Donald Trump, says the man who spearheaded negotiations on a global minimum tax rate.\n\nThe Organisation for Economic Cooperation and Development's (OECD) former director of tax, Pascal Saint-Amans, says Australia will no longer be able to apply a top-up tax if a US firm pays less than a 15 per cent tax rate.\n\nIt comes after the US president undid more than a decade of progress towards multinationals paying their fair share of tax, striking a deal to exempt America from a worldwide corporate tax floor.\n\nIn 2021, about 140 countries, including Australia, signed up to the Organisation for Economic Cooperation and Development (OECD) \"Global Minimum Tax\" deal, a plan that's been years in the making.\n\nThese countries had, in principle, agreed to a set of rules for a 15 per cent global minimum tax.\n\nThis was aimed at helping countries like Australia collect more tax from digital tech giants like Google, Apple, Microsoft, Facebook, Amazon and others by applying that minimum tax rate.\n\nThe implementation of the law in Australia was expected to increase receipts by $370 million and increase payments by $111 million over the five years from 2022-23.\n\nDigital giants including Meta have been in the sights of foreign governments. (Reuters: Dado Ruvic/Illustration)\n\nBut neither the US nor China implemented the tax rules. And, to convince US President Donald Trump to drop his threat to impose a \"revenge tax\" in a major spending bill, G7 countries agreed to exempt US companies from the rules.\n\n\"What is clear is that [G7] countries have caved,\" argues Pascal Saint-Amans, who spearheaded the negotiations that culminated in the tax agreement worldwide.\n\nMr Saint-Amans says the deal protects American companies.\n\n\"They [the G7] have not sustained the minimum tax in front of the threats. And the US is getting a competitive advantage,\" he said.\n\n\"The significance of it, the magnitude of it, is still unknown — to be seen. But the new system is unfair, discriminatory against non-US companies and, by itself, it kind of undermines the global minimum tax.\"\n\nPascal Saint-Amans shaped global tax policy while at the OECD. (ABC News)\n\nAustralia's Diverted Profits Tax 'under threat'\n\nMr Saint-Amans says the rules were supposed to stop a race to the bottom.\n\nNew transparency law aims to deter multinational tax avoidance Photo shows Luxury apartments line the shore of Grand Cayman island, a well known tax haven Every multinational operating in Australia must now publicly report to the ATO more detailed information about taxes paid, in an attempt to stamp out profit shifting into once notorious tax haven jurisdictions.\n\nHe says they would have applied to all multinational enterprise groups with an annual global revenue of at least EUR 750 million ($1.34 billion).\n\nBut now it will be much harder for tax administrators, including the Australian Taxation Office (ATO), to tax US companies that operate in Australia.\n\nMr Saint-Amans argues Australia's Diverted Profits Tax (DPT) is \"under threat by the US\", and other moves to try to tax digital companies will also be harder.\n\nWhile Australia has avoided implementing a Digital Services Tax, it has been taxing foreign digital companies in other ways.\n\nAustralia collects 10 per cent goods and services tax, or GST, on digital services provided to Australian companies, including streaming platforms and app subscriptions.\n\nThe ATO has also been pursuing several multinationals using its Diverted Profits Tax (DPT) legislation powers.\n\nKnown unofficially as the \"Google tax\", the DPT was introduced under former Liberal treasurer Joe Hockey, and allows the ATO to hit companies it deems to be engaging in \"contrived arrangements\" with a 40 per cent tax on all profits.\n\nThe ATO has also been pursuing several multinationals using its DPT powers. (ABC News: Nassim Khadem)\n\nMr Saint-Amans said the ATO would now need to make sure that investments by multinationals in Australia \"are not sheltered in the intermediary countries where you would have very low taxation\".\n\n\"It's a question of fairness as well … making sure that there is no profit shifting,\" he said.\n\nWhile there are still \"tax loopholes\", the one silver lining, he says, is that \"we're no longer facing what the world was facing prior to the OECD work\".\n\n\"The international tax architecture needs to be revised to better tax digital companies,\" he said.\n\n\"But overall progress has been made. We're no longer in the case where you're a multinational company, [and] you pay taxes nowhere. … the days of zero tax are coming to an end.\"\n\nCanada Prime Minister Mark Carney (left) met with Donald Trump at June's G7 Summit in Alberta. (Reuters: Amber Bracken)\n\nHe says even the Trump administration recognises that there should be some form of minimum tax applied.\n\n\"The minimum is not the same for the US and for the rest of the world. But there is some principle of a minimum tax,\" he said.\n\nMr Saint-Amans says because of preferential tax treatment for US companies, the G7 tax backflip could cause Australian companies to move their headquarters to the US — or at least contemplate it.\n\n\"Would this trigger shifts of the headquartering of the companies? It's unlikely, but not impossible,\" Mr Saint-Amans said.\n\n\"And this is exactly what we will have to watch and monitor in the coming weeks and coming months.\"\n\nStartups at a disadvantage under the tax backflip\n\nNow Australian startups are questioning the value of staying here.\n\nHow Trump's tax triumph will cost Australians dearly Photo shows Mark Zuckerberg, Jeff Bezos, Sundar Pichai and Elon Musk standing on a stage This is why the world’s richest people — also known as the 'broligarchs' — are about to get a whole lot richer.\n\nMaria Baker is the founder of Nobody's Princess, a startup that sells women's snow gear to markets globally, including in the United States.\n\nShe says the situation disadvantages local startups and causes them to rethink whether they should keep their brands local.\n\n\"It's really unfair … ridiculously unfair,\" she said.\n\n\"Regardless of whether you're a big business owner or even just a consumer, it is frustrating to see essentially the rich getting richer.\"\n\nMs Baker's business is based in Melbourne, and she is now considering moving offshore.\n\n\"Do I actually have to go to the US and set up my business and be a US-based business?\" she asks.\n\n\"I'd rather not do that because I think there's this really big beauty about being an Australian business and, you know, putting an Australian brand on the stage.\"\n\nMaria Baker says it's not fair that US multinationals get preferential tax treatment. (ABC News: Simon Tucci)\n\nAnish Sinha is the co-founder and chief operating tech of startup UpCover, which tailors insurance for small businesses.\n\nThe company was founded in 2019 and has raised almost $20 million in debt and equity.\n\nMr Sinha says insurance is \"a highly regulated space, and we play by the rules\".\n\n\"We pay our fair share, and we expect others to do that as well, and so hearing about something like [the tax backflip] makes us feel like the big end of the town is not willing to pay their fair share.\"\n\nAnish Sinha says tax rules will impact where companies base their headquarters. (ABC News: Daniel Irvine)\n\nHe says many Australian founders look to sell into the US market because it's the largest market in the world.\n\nHe says there's still a lot of \"regulatory uncertainty and flux\" in the US, so he's not made the decision to move headquarters just yet.\n\nBut the tax situation \"does impact how we look at being headquartered in one country or another\".\n\n\"It impacts how we ultimately look at competitiveness long-term,\" Mr Sinha said.\n\n\"It determines how our customers think about us being based in one geography or another. And we would want our business to be favoured by the tax jurisdiction we're based in.\"\n\nUpCover tailors insurance for small businesses. (ABC News: Daniel Irvine)\n\nTax experts worry Australia will suffer\n\nUS multinationals and lobby groups declined to comment. But tax experts fear that the G7 tax backflip sends a bad signal, and Australia could lose more revenue.\n\nJason Ward, principal analyst at the Centre for International Corporate Tax Accountability and Research, says the OECD global minimum tax was meant to set a floor to eliminate a race to the bottom and to set in place a system where every company everywhere was paying at least some tax.\n\n\"It was set at a very low rate, which is 15 per cent, but that was the rate that was needed to bring the world on board. And really it was the Biden administration that really broke the loggerheads on this,\" Mr Ward said.\n\n\"It's a terrible caving into Trump's demands here, and really unnecessary, and a major step backward for international tax reform.\n\n\"Trump is essentially running a protection racket for larger US multinationals that most people already know are the most aggressive in dodging their tax obligations on the profits, the vast profits they make in Australia and around the world.\"\n\nJason Ward predicts more regional initiatives to shore up global tax systems. (ABC News: Daniel Irvine)\n\nHe noted Australia had already passed legislation to implement Pillar 2 — or the global minimum tax — and there was an expectation that this would bring in some revenue.\n\n\"This basically sends a clear signal to the likes of US big pharma companies, US big tech that, 'It's OK. Trump's got their back.' And so this is not collecting extra tax for people in the United States. This is basically giving US multinationals a free pass to dodge taxes in the United States and in Australia and around the world.\"\n\n91 millionaires paid no tax, ATO stats reveal Photo shows A row of champagne flutes. There were 91 Australians who earned more than $1 million in total income yet paid no tax in 2022-23, new Australian Taxation Office (ATO) shows.\n\nMr Ward says with the G7 tax backflip allowing the US to pull out of global negotiations, \"we're going to see a trend towards these global discussions happening at the United Nations level\".\n\n\"We're well advanced in terms of the development of the UN tax convention,\" he said.\n\n\"And I think we're going to start seeing a lot more regional action to shore up the global tax systems to make sure that multinationals don't continue to steal the funding that we need to fund our healthcare, our hospitals, our public schools, education, and the infrastructure that we all need.\n\n\"I think countries need to stand up and protect their own sovereignty and their own rights and collect the tax revenues that are due from multinational profits in their own jurisdiction.\"\n\nThe Tax Justice Network's Mark Zirnsak also fears \"Australia is likely to miss out on revenue that it otherwise would have counted on\".\n\n\"It also just creates an unequal playing field again further where these companies who are not paying taxes get an unfair advantage over companies who are doing the right thing and paying the taxes as they should be paying them,\" Mr Zirnsak said.\n\n\" It is disappointing because setting a global minimum tax rate, even if it was only for very large multinational corporations, was setting a good precedent that might be expanded upon into the future. \"\n\nMark Zirnsak says Australia needs to join the UN tax convention that aims to collect more tax from multinationals. (Supplied: Uniting Church in Australia)\n\nHe says Australia should now join the move to set up a UN tax convention.\n\n\"This is where the action now needs to move to,\" he said.\n\n\"It will work on a two-thirds majority for substantive matters, so it won't be possible for certain individual countries to derail or block it.\n\n\"The other thing we probably need to keep in mind is that the Trump administration only has one more term and if there were to be a change in US administration, we might find a far more cooperative administration that thinks it is actually in the interest of everybody to have a more reasonable and fair tax global system.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-22/back-to-the-frontier-what-to-watch-july-washington-black/105546692",
        "title": "Sick of scrolling through streaming services? Here are five new shows",
        "publish_date": "Mon, 21 Jul 2025 19:50:01 +0000",
        "category": "finance",
        "authors": [],
        "text": "What happens when you take a bunch of technology-dependent teenagers and force them to swap their 21st-century lives for an 1880s homestead?\n\nThis is the premise of new reality series Back to the Frontier, which sees three families stripped of their creature comforts and hauled off to spend a summer in the wilderness.\n\nEach hopes that trying something this big will change the way they not only relate to each other, but to the world around them.\n\nAlso new this month, we have a whirlwind adaptation of Canadian author Esi Edugyan's Booker-nominated novel Washington Black, as well as a reality show that looks at what it takes to write a number one song.\n\nBut that's not all — there's also a fresh nature documentary led by the ABC's resident nature journalist, Ann Jones, and a powerful queer Pasifika story set in Western Sydney.\n\nBack to the Frontier — HBO Max, out now\n\nReality series Back to the Frontier opens as the extremely particular Hanna-Riggs, the incredibly emotional Halls, and the frankly very capable Loper families are dropped at the foothills of the Rocky Mountains of western North America with little more than the clothes on their backs and three scarcely habitable cabins to call home.\n\nThey have one objective: to prove they can work the land.\n\nThe Hanna-Riggs family live their lives surrounded by tech, from robot vacuums to the kids' smart watches. And yet, parents Jason and Joe (far left and left) want them all to unplug. (Supplied: HBO Max)\n\nJust like the real-life 1880s homesteaders, they will be judged on their ability to build a secure, comfortable home, farm the land and fill their pantries with enough meat, vegetables, baked goods and dairy to survive an entire winter.\n\nDon't go into this show expecting things to get that tough: the fact this series focuses on families should be enough to tell you HBO was never going to let these people struggle like the contestants on hit survival competition Alone.\n\nBut, unlike the competitors on Alone, these people have little to no skills. And while they presumably went into this fully aware they wouldn't have makeup or any technology whatsoever, let alone electricity or running water, they can't handle it. There is a lot of crying — and not just from the kids.\n\nThis is a show that wants you to lean into peak voyeurism. But it also provides a surprising amount of information about the original homesteaders, with experts including historians and modern homesteaders dropping in along the way.\n\nThe result is a series that's quietly heartfelt, and which features some wholesome conversations around confidence and the importance of community. Not everyone is into it, though — some conservative Christians in the US are furious a gay couple was cast.\n\nMake of that what you will.\n\nFor fans of: Colonial House, Alone\n\nWashington Black — Disney+, July 23\n\nLoading Instagram content\n\nWhen 11-year-old George Washington \"Wash\" Black (Eddie Karanja) escapes the 19th century Barbados sugar cane plantation where he was born at the beginning of this series, it feels like an against-all-odds miracle, never to be repeated.\n\nBut then he hitches a ride away from the Caribbean in a bizarre flying machine with his white saviour/scientific mentor Titch (Tom Ellis) and takes up with a band of pirates. The adult version of Wash (played by Ernest Kingsley Jr) goes on to find not only freedom, but love, in Halifax, Nova Scotia.\n\nExecutive produced by Sterling K Brown (who also stars in the series as Wash's friend, Medwin) Washington Black isn't your typical narrative about the horrors of slavery.\n\nTold from the perspective of a sensitive and brilliant young boy, this eight-part series is a story about daring to dream, despite the circumstances.\n\nYou'll frequently have to suspend your disbelief to enjoy this odyssey; adapting a fantastical story like this for the screen is immensely difficult.\n\nBut this series has just as much to say on white guilt, romance across class lines, and the notion of freedom as the book that inspired it.\n\nFor fans of: Kindred, Belle\n\nHitmakers — Netflix, July 24\n\nNetflix's latest unscripted series is for everyone who's ever looked at the songwriting credits of a hit song like Sabrina Carpenter's Espresso and wondered how it took so many people to come up with the lyrics \"Say you can't sleep, baby, I know / That's that me espresso\".\n\nHitmakers offers a behind-the-scenes look at what it takes to create a number one song. The show follows 12 hit writers and producers from the US as they compete against each other for the privilege of writing new tracks for John Legend, Shaboozey and Lisa of Blackpink/The White Lotus season three.\n\nOver six episodes, the creatives behind the likes of BTS' Butter, Ariana Grande's Thank U, Next and Beyoncé's Cuff It attend three different songwriting camps, where they have just six hours to come up with a hit.\n\nBlackpink's Lisa (pictured) is the most-followed K-pop artist on Instagram. (Supplied: Netflix)\n\nHitmakers isn't sure whether it wants to be a documentary or a reality show.\n\nIt has the tension and pacing of a reality show and goes out of its way to confect drama, and yet it treats the craft of songwriting as a docuseries would. The famous musicians almost feel like an afterthought, dropping in at odd moments.\n\nHitmakers ends with a bizarre dinner with just 10 of the 12 songwriters, whereas a reality show-proper would surely have a dramatic song choice reveal ceremony. (Supplied: Netflix)\n\nWho knows if there will be a Hitmakers season two?\n\nThe idea that this may never be repeated somehow makes the first season more compelling.\n\nFor fans of: Pop Star Academy: KATSEYE, Formula 1: Drive to Survive\n\nMoni — SBS, out now\n\nWhen Moni (Chris Alosio) returns to Western Sydney for his baby sister's wedding after 10 years in London, he doesn't expect to see his dead mother Tina (Tina Leaitua) there.\n\nShe has no idea she's dead and he has no idea how she's returned — or why he's the only one who can see her.\n\nLoading Instagram content\n\nThen Moni is reminded of the Samoan proverb, \"Teu le Va\", which roughly translates to, \"tend to your sacred spaces\". To achieve this, one must live a life of truth.\n\nMoni reluctantly comes to the realisation his mother's apparition has to do with their avoidance of two very different things. If she has any hope of passing on, they must both accept their truths.\n\nFor Moni, this means embracing his sexuality and learning how to be part of his Samoan community as his full self.\n\nFor Tina, it's about admitting her failures as a parent.\n\nThis genre-bending, queer, Pasifika-led series packs a lot into its six 10-minute episodes — from explorations of the varying lived experiences of queer Samoan-Australians, to the importance of remembering the cultural lessons of one's parents.\n\nMoni could have used a hell of a lot more funding (it's part of the SBS Digital Originals initiative, which supports new Australian stories), but the messages at the heart of this layered and intimate series will stay with you, regardless.\n\nFor fans of: White Fever, Swift Street\n\nDr Ann's Secret Lives — ABC iview, out now\n\nNature journalist Ann Jones joins scientists trying to gain a deeper understanding of some of the world's most reclusive — and dangerous — animals in this moreish six-part docuseries.\n\nIs a pangolin a mammal or reptile? Take our secretive animals quiz to find out Photo shows Three women kneel down on a beach next to a large sea turtle at sunset. They smile at the camera Ann Jones is on a mission to uncover the secret lives of some of the world's most elusive animals. Test yourself — or learn a thing or two — about these intriguing creatures.\n\nStarting with bull sharks on the Great Barrier Reef, each episode offers an intimate look at one animal. The deadly sea snakes of the Pilbara in WA are next, followed by the orangutans of Borneo, three different species of turtle in the Dampier Archipelago region of WA, and the dugongs of Queensland's Moreton Bay region. Last up: the elusive pangolins, again of Borneo.\n\nAs the ABC's beloved \"nature nerd\", Ann brings a contagious blend of enthusiasm and curiosity to this immersive series.\n\nIn less than 30 minutes, she'll have you reconsidering your understanding of each of these creatures. Bull sharks, for example, are more than just opportunistic killers. And did you know there's a breed of sea snake that hatches its eggs internally?\n\nFor fans of: The Kimberley, Australia's Wild Odyssey",
        "source": "ABC"
    },
    {
        "url": "https://www.smh.com.au/national/western-australia/wa-news-live-eagle-harley-reid-linked-to-the-biggest-contract-deal-in-afl-history-20250721-p5mgpc.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "WA news LIVE: New challenger emerges for Perth’s top breakfast radio spot",
        "publish_date": "Tue, 22 Jul 2025 12:17:35 +1000",
        "category": "sports",
        "authors": [],
        "text": "Eagles young gun Harley Reid is reportedly chasing the biggest contract deal in AFL history, worth more than $20 million.\n\nFooty Classified journalist Cal Twomey said the 20-year-old has had contract offers from the Eagles in front of him since April.\n\n“In recent weeks his management have sent counter-offers to the Eagles, and part of that … includes a mammoth offer that would be a two-year extension, plus an extension on top of that of another nine years, so an 11-year arrangement,” he said.\n\n“This is groundbreaking really ... it would take him through to the end of 2037.\n\n“The Eagles are still weighing this up and going through their own negotiation process and clubs are continuing to hunt him in Victoria. I think Hawthorn are near on obsessed with Harley Reid and getting him to the club and are willing to go to eight to 10 years at $1.7m, $1.8m [per season] to get him across the line.”\n\nReid is contracted to West Coast until the end of next season.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/culture/tv-and-radio/bride-devastated-after-trying-on-jennifer-anistons-wedding-dress-20250722-p5mgvv.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Bride devastated after trying on Jennifer Aniston's wedding dress",
        "publish_date": "Tue, 22 Jul 2025 12:10:53 +1000",
        "category": "finance",
        "authors": [],
        "text": "Bride devastated after trying on Jennifer Aniston's wedding dress\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/culture/tv-and-radio/bride-in-tears-over-friends-wedding-dress-reaction-20250722-p5mgvw.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Bride in tears over friend's wedding dress reaction",
        "publish_date": "Tue, 22 Jul 2025 12:10:45 +1000",
        "category": "finance",
        "authors": [],
        "text": "Bride in tears over friend's wedding dress reaction\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/parliament-returns-after-labors-stunning-may-victory-20250722-p5mgvm.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Parliament returns after Labor's stunning May victory",
        "publish_date": "Tue, 22 Jul 2025 12:04:05 +1000",
        "category": "finance",
        "authors": [],
        "text": "Parliament returns after Labor's stunning May victory\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/business/markets/the-world-is-more-scared-of-trump-than-america-20250722-p5mgsl.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "The world is more scared of Trump than America is",
        "publish_date": "Tue, 22 Jul 2025 11:59:52 +1000",
        "category": "finance",
        "authors": [
            "Stephen Bartholomeusz"
        ],
        "text": "Either of Trump’s tariffs or the attempted assault on the independence and reputation of the Fed would normally cause conniptions in financial markets. They, however, sail serenely on. The S&P 500 is up more than 7 per cent this year, Nasdaq 8.6 per cent and the AI-driven bigger technology stocks, as a group, 15 per cent. Bond yields, at both the short and long ends of the yield curve, have fallen since the start of the year. The apparent complacency of investors could be explained by the “TACO” trade – a conviction that Trump Always Chickens Out – but that would suggest a lack of sophistication and awareness. Wall Street is brushing off the effects of the Trump chaos. Credit: Bloomberg Trump’s tariffs are real.\n\nHis 10 per cent baseline tariffs are in place, as are his sectoral tariffs on steel, aluminium, copper, autos, auto parts, small packages, imports from China and some from Canada and Mexico. Loading His punitive “reciprocal” tariffs are scheduled to go live on August 1. Whether or not they are as Draconian as those unveiled on April 2, they will exacerbate the existing effects of Trump’s trade wars and lengthen the time it will take before the full effects of the tariffs are felt and can be assessed. Trump’s transparent attempts to force the Fed to cut US interest rates and his foreshadowing of the appointment of a Fed chair who will accede to his wishes are also very real. Rather than chickening out, as he did when he deferred the introduction of the reciprocal tariffs he announced on April 2 after the markets shuddered, Trump now seems emboldened by the return of investor optimism.\n\nWhether the market calm will survive when the reality of Trump’s reciprocal tariffs hits home in 10 days’ time or when he appoints his “yes man” to be Powell’s successor is the trillion-dollar (multi-trillion dollars?) question. Investors ought to be concerned about Trump’s tariffs because they are already having an impact on inflation and some corporate profits. Loading Last week’s June inflation data, while apparently benign, did blip up to 2.7 per cent (the Fed’s target is 2 per cent) and there were material increase in the prices of those goods most exposed to the tariffs already in place, even though importers had rushed to stockpile their imports to get ahead of the imposition of the tariffs. Those indications of rising inflation can only strengthen as those inventories are run down and the cost pressures on US importers – who pay the tariffs – rise. Already retailers and others are talking about price rises to offset the tariffs’ cost.\n\nOn Monday, Stellantis, the manufacturer of Chrysler, Jeep, Ram, Peugeot and Fiat vehicles, announced a €2.3 billion ($4.1 billion) first-half loss. It said the tariffs cost it €300 million after factory shutdowns had caused a 25 per cent reduction in deliveries of its cars to US buyers. It also wrote off another €300 million from the value of clean air credits that it held after Trump’s One Big Beautiful Bill (the Republicans’ budget bill) removed the penalties for companies’ failure to comply with clean air standards. Trump has continued his attacks on Fed chair Jerome Powell. Credit: Bloomberg General Motors, which also reports this week, has said the impact of Trump’s tariffs will cost it about $US4.5 billion ($6.9 billion) this year. It imported nearly half the cars it sold last year from Mexico and South Korea. So far, the tariffs haven’t had a material impact on the price of cars – they actually fell in June – or the volumes sold. That may be because buyers acted to get in ahead of the tariffs, as they may have done in other categories. That would explain the reasonably healthy retail sales numbers.\n\nAs the impact of the tariffs gradually shows up in companies’ costs as their inventories run down and their capacity to absorb those costs lessens, there will be price rises and increased inflation and, inevitably, a response from consumers. There’s also the impact of the One Big Beautiful Bill, which added a raft of new tax and spending measures to Trump’s 2017 tax cuts for companies and the wealthy. The Congressional Budget Office’s most recent update of the impact of that legislation is that it will add a net $US3.4 trillion to US government debt over the next decade. Foreign investors, it seems, are more wary of the Trump trade and central bank agendas than the locals. The bill is stimulatory at a time when inflation is just starting to accelerate. In those circumstances, Trump’s repeated demand for the Fed to cut its policy rate by 3 percentage points would look ludicrous and the markets would start to fear rising, not falling interest rates.\n\nAny undermining of Powell before his term expires next May, or the appointment of someone obviously going to try to do Trump’s bidding, would also see the US yield curve steepen. The yields on short-term securities would fall in expectation of a lower federal funds rate (analogous to the Reserve Bank’s cash rate), but the yields on longer-term bonds would rise to compensate for the likely higher inflation rates. Loading The mixture of Trump’s tariffs and the politicisation of the Fed would probably impact both economic growth and the inflation rate. With the S&P 500 trading at 27 times the earnings of its constituent companies last year and 22 times the bullish forecasts for this year’s earnings, any significant rise in market interest rates would have a very material impact on share prices.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/nsw/giraffe-and-unborn-calf-die-in-latest-sydney-zoo-tragedy-20250722-p5mgud.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Giraffe and unborn calf die in latest Sydney Zoo tragedy",
        "publish_date": "Tue, 22 Jul 2025 11:51:26 +1000",
        "category": "finance",
        "authors": [
            "Josefine Ganko"
        ],
        "text": "A female giraffe and her unborn calf have died during labour at Sydney Zoo.\n\nOn Thursday night, Nzuri went into active labour at the zoo in Bungarribee in Sydney’s western suburbs, with animal care staff quickly observing that something was wrong.\n\nNzuri died during labour at Sydney Zoo on Thursday. Credit: Sydney Zoo\n\nThree veterinarians and two nurses from institutions across Sydney were mobilised to assist in the complex labour, and Nzuri was anaesthetised for a complete assessment, the zoo said.\n\nThe team found the calf was positioned with its front two legs emerging, and its head and neck were out of position. With the calf deceased and its mother in considerable pain, zoo staff decided to euthanise Nzuri.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/lifestyle/life-and-relationships/kiss-cam-whammy-made-us-chuckle-but-it-has-triggered-my-bonk-ban-fixation-20250721-p5mgq0.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Kiss Cam whammy made us chuckle, but it has triggered my bonk ban fixation",
        "publish_date": "Tue, 22 Jul 2025 11:50:58 +1000",
        "category": "lifestyle",
        "authors": [
            "Jenna Price"
        ],
        "text": "We could and should emulate prime ministers Malcolm Turnbull and Anthony Albanese. Turnbull imposed the bonk ban after the chaos of Barnaby Joyce’s love life. Albanese continued the policy because it was the sensible thing to do. My god, I loved watching the musical chairs among staffers in the wake of the first round of BB.\n\nWhen advocating for workplace bonk bans, I’ve been reprimanded by former students who tell me that work is the only place they meet people. My advice? Get out more.\n\nI have zero idea why workplaces can’t institute a bonk ban. Sure, at the same level and with no chain of command issues, there’s barely a risk – except for the one where you can say to a trusted colleague: Geez, that bloke [you’re rooting] is utterly useless.\n\nKiss Cam, the harbinger of doom that picks out smooching couples in a crowd and projects them for everyone to see, brought out the ugly truth for us all. Every workplace hosts a dodgy relationship, and that hurts the rest of us. I can tell you from personal experience in both newspapers and universities. The relationship, even when consensual, damages how work works.\n\nWhy does workplace bonking hurt the rest of us? Here are my own personal experiences.\n\nExhibit A. Let’s call him Leaden Fool. He had come along to an event I’d organised. He’d spotted a gorgeous young talent and asked for contact details. A few months later, the young thing got a job with us. They then embarked on a relationship that both denied ever existed. Exhausting. They backed each other up in every single crucial decision made. There was never any room for discussion. If they weren’t bonking, they were certainly barracking for each other in every way possible. One has gone on to bigger things, the other consigned to the dustbin of history. But it took a long time and damaged people and processes along the way.\n\nLoading\n\nBut probably my least favourite experience of working with a couple was working with a throuple (strictly speaking, throuples are consensual all ways). Anyhow, this drunken sleaze was bonking two junior reporters in the same period of time. The sweeties apparently had no idea, although all the other junior reporters knew because, well, journalists are trained observers unless they are in a sex haze. That didn’t end well either. And there were civilians hurt in the process who should have had the chance to grieve in private.\n\nMegan Kerrigan didn’t get a chance to grieve in private. She discovered the bad news when everyone else did, when millions of others did. Her husband, Andy Byron, and his, ahem, date, Kristin Cabot, were caught on Kiss Cam at a Coldplay concert. Sure, it’s easy to get swept up in what the Conservatorium’s Dr Brad Fuller describes to me as looping chords, shimmering guitars and falsetto vocals, both intimate and epic. But you could tell, even under the veil of shame, these two knew each other. In a biblical sense.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/politics/nsw/eviction-jail-and-1-5-million-fines-for-illegal-tobacco-sellers-20250722-p5mguk.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Eviction, jail and $1.5 million fines for illegal tobacco sellers",
        "publish_date": "Tue, 22 Jul 2025 11:49:55 +1000",
        "category": "finance",
        "authors": [
            "Jessica Mcsweeney"
        ],
        "text": "Landlords would be given the power to evict retailers caught selling illegal tobacco under sweeping laws to be introduced by the state government to combat Sydney’s booming illicit cigarette trade.\n\nAlong with allowing for evictions, NSW Health would be able to shut down a business for 28 days, which could be extended to 12 months with a court order. Those found with a commercial quantity of illegal cigarettes face maximum sentences of seven years in prison, and $1.5 million in fines.\n\nAustralian Border Force officers with a container of illegal cigarettes. Credit: Luis Enrique Ascui\n\nPremier Chris Minns flagged the powerful new legislation, which includes similar measures to the Coalition plan, would be introduced to parliament in the coming sitting weeks.\n\n“In a few days time we’ll unveil our response to what has been a massive increase in the illegal tobacco marketplace in NSW and across the country, and that is for some of the toughest penalties in the country,” Minns told Ben Fordham on 2GB.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/nsw/the-sister-the-lover-and-the-300-000-inheritance-fight-20250721-p5mgh5.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "The sister, the lover and the $300,000 inheritance fight",
        "publish_date": "Tue, 22 Jul 2025 11:45:00 +1000",
        "category": "finance",
        "authors": [
            "Michaela Whitbourn"
        ],
        "text": "A NSW man who died without a will left his entire estate to his estranged “on and off” partner, a court has ruled in a dispute between the man’s sister and his one-time fiancee.\n\nThe man died in August 2023, aged 56, and his former partner found out about his death on Facebook about six weeks later. She had left his home in May, after what the NSW Supreme Court heard was “another drunken and abusive outburst” by him.\n\nThe couple had been engaged at one point and he had given his fiancee an amethyst ring, the Supreme Court heard.\n\nBecause the man had no other siblings, no children and no living parents, his sister stood to inherit his entire estate, valued at about $300,000, under rules relating to the distribution of estates where there is no will.\n\nThe man’s ex-fiancee brought court proceedings, seeking a share of his estate under NSW succession laws that allow eligible people to seek a “family provision order” if inadequate provision has been made for them from an estate.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/culture/tv-and-radio/smooth-fm-rolls-2gb-to-take-no-1-sydney-radio-spot-as-abc-struggles-20250722-p5mgum.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Smooth FM rolls 2GB to take No.1 Sydney radio spot as ABC struggles",
        "publish_date": "Tue, 22 Jul 2025 11:45:00 +1000",
        "category": "finance",
        "authors": [
            "Michael Lallo"
        ],
        "text": "Smooth FM is now Sydney’s No.1 radio station, overtaking 2GB* in the fourth ratings survey of the year.\n\nThe music-based network attracted 12.3 per cent of the available audience – just 0.1 percentage point lower than its previous result – while 2GB suffered the greatest loss of any broadcaster, falling 2 points to 11.6 per cent.\n\n2GB breakfast host Ben Fordham is still No. 1, despite the station’s overall losses. Credit: James Brickwood\n\nAlthough Kiis remains in third place, it enjoyed the biggest increase during the 10-week survey period, climbing 1.1 points to an audience share of 10.4 per cent. Classic hits station Gold ranked fourth, followed by Nova, ABC Sydney, Triple M and 2Day FM.\n\nIt is important to note that survey time slots do not always correspond precisely with program time slots.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/world/long-delayed-tesla-diner-opens-up-in-los-angeles-united-states-20250722-p5mgv7.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Long-Delayed Tesla Diner opens up in Los Angeles United States",
        "publish_date": "Tue, 22 Jul 2025 11:41:38 +1000",
        "category": "finance",
        "authors": [],
        "text": "Long-Delayed Tesla Diner opens up in Los Angeles United States\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/money/investing/australiana-auction-why-your-old-mambo-shirt-could-be-worth-hundreds-20250722-p5mgtg.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Australiana auction: Why your old Mambo shirt could be worth hundreds",
        "publish_date": "Tue, 22 Jul 2025 11:41:02 +1000",
        "category": "finance",
        "authors": [
            "Stephen Crafti"
        ],
        "text": "Dare Jennings, the name behind clothing label Mambo, has enjoyed an illustrious career. In the 1970s, he took the simple T-shirt and worked with leading artists to transfer this piece of cotton into ‘art to wear’.\n\nWhat started out as this great idea with his business partner Andrew Rich led to other successes, including producing Phantom Records and designing surf gear. A couple of decades later, Jennings established the fashion business Deus Ex Machina, swapping surf for motorbike culture.\n\nDecades after founding Mambo, Dare Jennings established the fashion business Deus Ex Machina, swapping surf for motorbike culture. Credit: Louie Douvis\n\nPart of this extraordinary legacy will be sold at Shapiro Auctioneers in Sydney on September 23, giving those who recall the Mambo period an opportunity to purchase a piece of nostalgia.\n\nThe T-shirts, shirts, record covers, posters and one-off art pieces, including a couple of pinball machines, will go under the hammer. Living the life of a hippie in the 1970s, travelling up and down the New South Wales Coast, Dare reflects on the incidents that started this trajectory.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/cricket/get-stuck-into-them-england-reveal-sledging-meetings-and-plans-to-bring-the-lip-for-the-ashes-20250722-p5mguh.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘Get stuck into them’: England reveal sledging meetings – and plans to bring the lip for the Ashes",
        "publish_date": "Tue, 22 Jul 2025 11:38:34 +1000",
        "category": "sports",
        "authors": [
            "Daniel Brettig"
        ],
        "text": "England’s vice-captain Harry Brook has revealed the dressing room conversations that led the Ashes combatants to take up premeditated, tactical sledging against India, as Ben Stokes’ team gears up for the trip to Australia this summer.\n\nAnd pace bowler Brydon Carse has explicitly linked this abrasive approach to how England want to battle Australia for the Ashes here, where England have not won a Test match since 2011, the last time they retained the urn away from home.\n\nBen Stokes with Harry Brook. Credit: Reuters\n\nAfter a spiteful Lord’s Test where players on both sides lost their cool on several occasions, Brook said that coach Brendon McCullum – who has employed his friend and former New Zealand psychologist Gilbert Enoka to help motivate the England players – told the team before the game that they were “too nice” to opponents.\n\nWhen India’s captain Shubman Gill harried the England openers Zak Crawley and Ben Duckett as they tried to avoid another over being bowled on the third evening, Brook used the episode as a pretext to initiate a sledging barrage for the remainder of the match, which England went on to win narrowly.",
        "source": "SMH"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/report-finds-people-with-chronic-pain-continue-to-suffer-from-stigma/ma8onyink",
        "title": "Report finds people with chronic pain continue to suffer from stigma",
        "publish_date": "Mon, 21 Jul 2025 22:39:47 +0000",
        "category": "finance",
        "authors": [],
        "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nNelli Stevenson has suffered from chronic pelvic pain since the age of 14.\n\n\n\n\n\nShe spoke to SBS World News, saying it became drastically worse after the birth of her child.\n\n\n\n\n\n\"I've had several medical professionals tell me that I'll be in pain for the rest of my life. There's only so much they can do for me surgically.\"\n\n\n\n\n\nA new report that surveyed 5,000 Australians found Australians living with chronic pain continue to suffer from stigma.\n\n\n\n\n\nThat research by Chronic Pain Australia found 74 per cent feeling ignored or dismissed; and 48 per cent experiencing prejudice from health professionals.\n\n\n\n\n\nIt found nearly three-quarters of chronic pain sufferers experience mental health issues as a result of their pain.\n\n\n\n\n\nNearly two-thirds are unable to work and experience financial strain.\n\n\n\n\n\nThe chairperson of Chronic Pain Australia, Nicolette Ellis, says one in five Australians live with chronic pain.\n\n\n\n\n\n\"It's more burdensome than or more prevalent than mental health conditions. It costs our economy more than cardiovascular disease, cancer and diabetes combined and one in five Australians, that's about 3.6 million live with chronic pain.\"\n\n\n\n\n\nShe says more effort needs to be made to ensure people can get help.\n\n\n\n\n\n\"Chronic pain is a complex condition to treat and it usually needs a team of health professionals, with different skillsets to help build that person's toolkit. Unfortunately, in the National Pain Report we saw that only 18 per cent of people are referred to what we call multidisciplinary care where they can get access to those different health professionals to help support their care.\"\n\n\n\n\n\nThe report found this year - 2025 - 54 per cent of survey respondents reported waiting more than two years for a diagnosis, and 44 per cent waited over three years.\n\n\n\n\n\n\"One woman quoted that she lost her marriage, her work and her identity before she even received a diagnosis.\"\n\n\n\n\n\nThis in turn can drastically affect the mental health of individuals.\n\n\n\n\n\nMs Stevenson shares how some people with chronic pain talk about grief.\n\n\n\n\n\n\"I often see folks within chronic pain communities talk about grief, they talk about grieving their healthy bodies or grieving their former life or former abilities.\"\n\n\n\n\n\nDespite the prevalence of the condition, many people who suffer from chronic pain say their concerns are dismissed and often thought as normal.\n\n\n\n\n\nThey say it's not just by family and friends, but sometimes health professionals too.\n\n\n\n\n\n\"I ended up almost dying at one point because I had normalised such chronic abdominal pain that my appendix had ruptured and I didn't present to hospital until 12 days after it had happened.\"\n\n\n\n\n\nChronic Pain Australia's report calls on the federal government to make chronic pain a national priority through changes like providing more localised funding to primary care and the coding system.\n\n\n\n\n\nMs Ellis says they are also calling for pain to be recognised as a health condition, not just a symptom.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/parliament-is-back-heres-what-the-parties-have-on-their-agenda/57wfg5mjy",
        "title": "Parliament is back. Here's what the parties have on their agenda",
        "publish_date": "Mon, 21 Jul 2025 19:37:51 +0000",
        "category": "finance",
        "authors": [],
        "text": "Labor's honeymoon period continues this week as a large cohort of new politicians joins the 48th parliament, ready to implement the mandate Australians voted for.\n\n\n\n\n\nTuesday will largely be ceremonial before parliament resumes on Wednesday, and with it, a marathon of first speeches across several days, with 40 new senators and MPs to be sworn in.\n\n\n\n\n\nWith an increased majority, holding 94 of 150 lower house seats, Labor will have 24 new MPs deliver their opening addresses.\n\n\n\nNewly elected federal MPs will be sworn in this week after a training session learning about their new roles. Source: AAP / Lukas Coch First up will be \"leader slayers\" Ali France and Sarah Witty, who ousted former Liberal leader Peter Dutton and former Greens leader Adam Bandt, respectively.\n\n\n\n\n\nAmid the formalities, the re-elected government now faces pressure to deliver the priorities it set out during the election.\n\n\n\n\n\nAll eyes will also be on Question Time as Prime Minister Anthony Albanese adjusts to a new opponent in the House of Representatives chamber, with Liberal leader Sussan Ley taking her place across from him.\n\n\n\n\n\nSo what can we expect from the major parties?\n\n\n\nLABOR\n\nThe Albanese government has made its first sitting fortnight agenda clear: wiping student debt, increasing safety measures for children in childcare and protecting penalty rates.\n\n\n\n\n\nLabor will introduce a bill cutting student debt by 20 per cent retrospectively from 1 June, slashing roughly $16 billion from balances, amid wider reforms to the repayment system.\n\n\n\n\n\nThe legislation should be passed quickly, breezing through the lower house where Labor holds a majority, and the upper house, where the Greens are expected to vote for the changes.\n\n\n\n\n\nWhile childcare subsidies were pivotal to the election campaign, horrific allegations of child abuse across centres have made safety reform a priority.\n\n\n\nREAD MORE When your share of $80 billion in student debt is set to be cut\n\nSpeaking to Labor Party caucus on Monday, Albanese said he hopes to \"restore confidence in a system in which we should be confident caring for our vulnerable little ones\".\n\n\n\n\n\nThe Albanese government has vowed to strengthen protections, increase fines for poor quality operators and establish an independent regulator as part of the childcare centre reforms.\n\n\n\n\n\nLabor also plans to enshrine penalty rates into law, protecting about 3 million workers who rely on the extra pay.\n\n\n\nTHE COALITION\n\nAfter a short-lived split in May, the Liberal and National parties are adamant that they are back together, united and ready to hold Labor accountable with a strong opposition.\n\n\n\n\n\nNew Liberal leader Sussan Ley sought to boost morale on Monday after May's election loss, firing up the Opposition caucus with vows not to \"get out\" of Labor's way.\n\n\n\n\n\n\"Mr Albanese is giving interviews and suggesting we should just get out of the way. We will not,\" Ley said.\n\n\n\nLiberal leader Sussan Ley says the Coalition is ready to work hard for the millions of Australians that voted for them. Source: AAP / Mick Tsikas She singled out cost-of-living relief as a key issue to prosecute, as well as fighting against raising taxes , after ABC reported leaked documents show Treasury advised the government to raise taxes and cut spending after the election.\n\n\n\n\n\n\"I have not met a single Australian who wants to pay more tax, who thinks they are paying not enough tax,\" she said.\n\n\n\n\n\n\"What I do know is that every single Australian expects this government to minimise their tax bill, to work hard for them and to make sure that they run a responsible budget with responsible economic management across the country.\"\n\n\n\n\n\nWhile the Opposition's policies are still under review following the election, education spokesperson Jonathan Duniam conceded the pitch to cut international student numbers by 80,000 \"wasn't as constructive as it could have otherwise been\".\n\n\n\n\n\n\"I think we need to have a proper and open discussion with both the university sector and the community more broadly about how we can approach this,\" he told ABC's Insiders program on Sunday.\n\n\n\nTHE GREENS\n\nSimilarly to the Coalition, the Greens are finding their feet under new leadership with Larissa Waters now at the helm.\n\n\n\n\n\nWith the balance of power in the Senate, the Greens will be crucial to Labor passing its agenda.\n\n\n\n\n\nSenator Jordon Steele John has indicated the party may use the power to pressure Labor to review policies, like adding dental to Medicare.\n\n\n\nWhile points of contention remain unclear, Senator Sarah Hanson-Young stressed the party will be \"constructive\" as it scrutinises the bills introduced to parliament.\n\n\n\n\n\n\"They don't have the numbers in the Senate, and that is because the Australian people want to make sure the Senate is a backstop for them, an insurance for them,\" she told reporters on Monday.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/video/pm-albanese-outlines-labors-plan-as-politicians-return-to-parliament/9ci20pktp",
        "title": "PM Albanese outlines Labor's plan as politicians return to parliament",
        "publish_date": "Mon, 21 Jul 2025 09:43:11 +0000",
        "category": "finance",
        "authors": [],
        "text": "PM Albanese outlines Labor's plan as politicians return to parliament\n\nPublished 21 July 2025, 8:12 am\n\nCanberra's corridors of power are about to be pulsing again. Prime Minister Anthony Albanese wants his large mandate to be respected, but the Coalition and the Greens are unwilling to roll over.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/video/chronic-pain-sufferers-feel-dismissed-by-healthcare-professionals/ss1uikhlp",
        "title": "Chronic pain sufferers feel dismissed by healthcare professionals",
        "publish_date": "Mon, 21 Jul 2025 09:34:05 +0000",
        "category": "finance",
        "authors": [],
        "text": "Chronic pain sufferers feel dismissed by healthcare professionals\n\nPublished 21 July 2025, 8:12 am\n\nAround four million Australians of all ages suffer from chronic pain. Many say they feel unheard and invisible in the healthcare system. Experts are calling for national investment in the space, including a holistic care approach to deal with often complicated causes.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/stock-sell-off-sparks-asxs-worst-day-since-april/io1yxrwuq",
        "title": "Stock sell-off sparks ASX’s worst day since April",
        "publish_date": "Mon, 21 Jul 2025 08:33:10 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/nelli-lives-with-chronic-pain-it-took-her-20-years-to-find-the-right-help/7rherwbif",
        "title": "Nelli lives with chronic pain. It took her 20 years to find the right help",
        "publish_date": "Mon, 21 Jul 2025 08:01:35 +0000",
        "category": "lifestyle",
        "authors": [],
        "text": "Nelli Stevenson has been living with chronic pain since she was a teenager — but it has taken her many years, and a serious medical emergency, to find the help she needed.\n\n\n\n\n\nStevenson, 37, started experiencing chronic pelvic pain, along with a nerve pain called sciatica, when she was around 14 years old. These conditions later worsened after the birth of her child, and became chronic around three years ago.\n\n\n\n\n\n\"I live with chronic persistent pain. I've had several medical professionals tell me I'll likely be in pain for the rest of my life,\" she told SBS News.\n\n\n\n\n\n\"There is only so much they can do for me surgically. So, I manage my pain on a day-to-day basis through a number of physical interventions, as well as medical interventions as well.\"\n\n\n\nStevenson works for a community legal service with flexible arrangements, and says she is fortunate to have access to a specialist GP and team who support her physical therapy and pain management.\n\n\n\n\n\n\"However, it took me about 20 years of pushing through the medical system, constantly advocating for myself and fighting to be taken seriously, to be able to find that group of people,\" she said.\n\n\n\n\n\nThis started in her late teens.\n\n\n\n\n\n\"I was told, like most people with pelvic pain, that it's just part of being a woman, it's part of your period. I was gaslit for several years,\" she said.\n\n\n\n\n\nThis had serious consequences. At one point, Stevenson says she had normalised the chronic abdominal pain she was experiencing that she didn't notice her appendix had ruptured.\n\n\n\n\n\n\"I didn't present to hospital until 12 days after it had happened,\" she said. Stevenson ended up in ICU and needed two major surgeries to save her life. She says these caused significant scar tissue, which added to her chronic pain.\n\n\n\n\n\nShe said she has heard many stories of late diagnosis, misdiagnosis and gaslighting from the chronic pain community.\n\n\n\n\"They [medical professionals] aren't taking seriously these people who are saying, 'I cannot live like this anymore. I need more help.'\"\n\n\n\n\n\nChronic pain is taking longer to diagnose in 2025, according to a new report from peak consumer body Chronic Pain Australia.\n\n\n\n\n\nThe 11th edition of its National Pain Survey, released on Monday to kick off a week-long awareness campaign, has revealed what it calls a \"devastating national crisis\" marked by diagnosis delays and a severe mental health toll.\n\n\n\nWaiting for a diagnosis\n\nChronic pain is a common and complex condition characterised by persistent pain experienced on most days of the week, according to the Australian Institute of Health and Welfare.\n\n\n\n\n\nApproximately one in five Australians, or 3.6 million, live with chronic pain. However, Chronic Pain Australia believes the figure is higher.\n\n\n\n\n\n\"That figure came from a study that was done about 15 years ago,\" Chronic Pain Australia chair Nicolette Ellis said.\n\n\n\n\n\n\"What we're predicting chronic pain is sitting at in [terms of] prevalence is about four million Australians in this day and age, and [this is] projected to go up to five million in 2050.\"\n\n\n\nOf the almost 5,000 survey respondents, many had multiple conditions, including pain, joint pain and nerve pain, often experienced at the same time.\n\n\n\n\n\nOver half (54 per cent) of respondents reported waiting more than two years for a diagnosis, and 44 per cent waited over three years. This has increased from 42 per cent waiting over three years in 2024, and 41 per cent in 2023.\n\n\n\nMental health impacts — and a 'pervasive' stigma\n\nEllis said delayed diagnoses can contribute to the \"vicious cycle\" of chronic pain, including mental ill health.\n\n\n\n\n\n\"For a lot of people, it takes away their identity, increases their mental health issues … and that's because of [what] pain can take away,\" she said.\n\n\n\n\n\n\"If you're waiting for a diagnosis, typically you lose function. That might be reduced hours at work, or it might be leaving the workforce altogether.\"\n\n\n\n\n\nThe report revealed 74 per cent of respondents had experienced mental health impacts, with 87 per cent experiencing sleep disturbances.\n\n\n\nAmong other impacts was 63 and 59 per cent of respondents who experienced strain on family relationships and friendships.\n\n\n\n\n\nStigma around chronic pain is \"pervasive\", according to the report, which found 74 per cent reported feeling ignored or dismissed. Ellis said this can come from health professionals along with friends, family, and community members. However, reported stigma from health professionals was higher than overall levels.\n\n\n\n\n\n\"Many people feel gaslit or stigmatised by health professionals — that this is all in their head and it's not a true condition,\" she said.\n\n\n\nCalls for more complex care\n\nDespite the complex nature of chronic pain, the report found access to appropriate multidisciplinary and specialist care is falling short.\n\n\n\n\n\nOnly 18 per cent of respondents received a referral to multidisciplinary pain management, and 30 per cent of those referred never secured an appointment.\n\n\n\n\n\nEllis said access to multidisciplinary care is limited and dependent on location.\n\n\n\n\n\n\"If you're in a metropolitan area, usually you can get into a tertiary or hospital-based pain clinic. But they have massive wait lists,\" she said.\n\n\n\n\n\n\"Access to that kind of care is very limited.\"\n\n\n\nChronic Pain Australia has been advocating for integrating multidisciplinary care programs into primary care settings.\n\n\n\n\n\nUltimately, it wants to see chronic pain recognised as a condition in its own right — and made a national health priority.\n\n\n\n\n\n\"Currently, we don't recognise pain as a condition in its own right; we recognise it as a symptom. What that means is that not only is chronic pain invisible to society, it's invisible in our health system data and in our policies,\" Ellis said.\n\n\n\n\n\nEllis said recognising chronic pain in its own right would increase awareness of the condition, to guide adequate funding and resources.\n\n\n\n\n\nSBS News has contacted the federal health department for comment. It's understood the latest report will be presented to parliament later this week.\n\n\n\n\n\nFor Stevenson, having access to early diagnosis and complex care can make an \"extraordinary difference\".\n\n\n\n\n\n\"It means that someone who may otherwise be bedridden for weeks and weeks on end can actually participate in society, can maintain a healthy work-life balance, and can go about their days as a person living as pain free as possible, which surely we all deserve.\"\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/china-increases-southeast-asia-development-spend-as-west-leaves-the-region/nn5es1wiw",
        "title": "China increases Southeast Asia development spend as West leaves the region",
        "publish_date": "Mon, 21 Jul 2025 07:20:15 +0000",
        "category": "finance",
        "authors": [],
        "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\n\"The lack of Western and European money going into Southeast Asia is a real problem.\"\n\n\n\n\n\nThat's Grace Stanhope from the Lowy Institute.\n\n\n\n\n\n\"We're projecting a 20 per cent drop in bilateral foreign aid to the region by 2026.\"\n\n\n\n\n\nThe third edition of the think tank's Southeast Asia Aid Map has found China leads the development race in Southeast Asia, boosting its financing in 2023 after reducing its development spend in the region by 68 per cent over five years.\n\n\n\n\n\nThe regional superpower favouring market-rate loans for infrastructure projects, with rail ventures in Indonesia and Malaysia accounting for most of the annual increase.\n\n\n\n\n\nBut it's the loans to the region's poorest countries, like Myanmar, Laos, and Cambodia that have some concerned.\n\n\n\n\n\nMs Stanhope says the reduced competition is leaving few options other than taking on China-funded debt.\n\n\n\n\n\n\"These countries have far less options in terms of other development providers, and also far higher development needs, so there's really, there's very little option for them. Increasingly, these countries have little room to manoeuvre in their negotiations.\"\n\n\n\n\n\nGlobally, a third of developing nations spend more on interest repayments than health each year.\n\n\n\n\n\nExecutive Director at the Asia Pacific Development Diplomacy and Defence Dialogue, Melissa Conley Tyler doesn't want that to become the case in Southeast Asia.\n\n\n\n\n\n\"In our region, thankfully, debt has not been as much of an issue, and I think we want to keep it that way. We don't want countries in the Indo Pacific to be heavily indebted. That's a huge problem if countries can't provide the services that they need to their citizens because they're paying back debt, which is usually at very, very high interest rates.\"\n\n\n\n\n\nThe full impact of ongoing aid cuts is yet to be seen in the region.... with the US cutting its aid spend by more than 80 per cent this year, and the UK planning to redirect billions in foreign assistance towards its defence budget.\n\n\n\n\n\nMs Conley Tyler says some of that has already been felt.\n\n\n\n\n\n\"We know that the first deaths because of the US A-I-D cuts happened in Southeast Asia. It was in hospitals on the Myanmar border, where refugees who were fleeing the conflict.\"\n\n\n\n\n\nThe Lowy Institute says that will result in the \"centre of gravity\" shifting in Southeast Asian development financing, with China, Japan, and South Korea making up most of the financing.\n\n\n\n\n\nAustralia increased its aid to Southeast Asia in 2023, with Labor committed to raising its international assistance budget annually in line with inflation.\n\n\n\n\n\nSpeaking at the ASEAN Leaders Summit earlier this month, Foreign Minister Penny Wong reaffirmed Australia's commitment to the area.\n\n\n\n\n\n\"We now dedicate 75 cents of every Australian development dollar to our region, the Indo-Pacific. And our response to others reducing their funding has been to pivot and reprioritise, ensuring we respond to the most acute needs.\"\n\n\n\n\n\nConley-Tyler says its critical for Australia to maintain that focus.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/pogacar-sad-over-evenepoels-departure-from-tour-de-france/ewdtw25tx",
        "title": "Pogacar \"sad\" over Evenepoel's departure from Tour De France",
        "publish_date": "Mon, 21 Jul 2025 07:15:21 +0000",
        "category": "sports",
        "authors": [],
        "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nIt's one of the world's most popular professional cycling races.\n\n\n\n\n\nThe Tour de France not only tests the strength of individual elite athletes, but also their capacity to work as a team.\n\n\n\n\n\nThis year, over 180 riders from 23 teams have joined the 21-day tour.\n\n\n\n\n\nBy the end of the race they're expected to have travel around 3,300 kilometres across 11 regions in France.\n\n\n\n\n\nThe Tour attracts ten million spectators each year and now as it reaches its midpoint, there have been some surprising moments.\n\n\n\n\n\nOne is the withdrawal of Belgian cyclist Remco Evenepoel on the 14th day of the 21-day race on Saturday, after struggling with difficult mountain routes two days ago.\n\n\n\n\n\nThe Olympian said he was already in a poor training condition before entering the Tour, with fatigue a factor.\n\n\n\n\n\nEvenepoel was seen as one of the big challengers for Slovenian cyclist Tadej Pogacar who won his third Tour last year.\n\n\n\n\n\nPogacar says he's disappointed that Evenepoel has had to leave the race.\n\n\n\n\n\n\" In cycling you never know when it's your last day of riding, or riding the Tour or your career, so I'm really sad that he left the Tour.\"\n\n\n\n\n\nA few days earlier, the World No.1 cyclist also paid tribute to Samuele Privitera, a 19-year-old Italian cyclist who died after a crash in the Giro della Valle, another cycling race held at a similar time in Italy.\n\n\n\n\n\n\"I was thinking in the last kilometre about him and yeah, how tough this sport can be - and how much pain it can cause.\"\n\n\n\n\n\nThe Tour has also seen one spectator hit by a team car on Sunday.\n\n\n\n\n\nSo why is the Tour de France this year so crash-prone?\n\n\n\n\n\nAdam Gill is a level-two cycling coach and owner of Bikestyle Tours, which organises holiday tours for fans.\n\n\n\n\n\nHe says accidents are not uncommon in any given year.\n\n\n\n\n\n\"It's, you know, the largest global bike race in the world to be successful at the Tour de France. It's unbelievably important for the teams and sponsors. So when you have 180 cycles on a small bit of road all trying to get to the front and when, sadly, accidents happen.\"\n\n\n\n\n\nHe also says the improvements in technology also allow riders to compete at much faster speeds than even ten years ago.\n\n\n\n\n\n\" So obviously, they're riding consistently at 50 and 60km an hour. You know, the margins of error are so small that it doesn't take much for someone to, touch the brakes and next, 30 or 40 cycles are hitting ground. And I think the speeds that they're going now are exceptional compared to what they used to a couple years ago.\"\n\n\n\n\n\nFor elite cyclists, technology also means the intensity of their training has increased, meaning they are starting their careers at an earlier age.\n\n\n\n\n\n\"They used to say that the peak rider age for a Tour de France rider would be in the late 20s, early 30s. That's definitely changed. The younger riders are doing a lot better, and that comes down to the science and their preparation for the races, they feel a lot better now, like in terms they can get a lot more carbohydrates and calories into the system, where that never used to be the case. So Nutrition has definitely improved. But again, you know, they got full time scientists working on their preparation, from training, the altitude, strength and conditioning, flexibility, nutrition.\"\n\n\n\n\n\nIn Australia cycling remains a popular form of exercise.\n\n\n\n\n\nBut now, researchers are studying if the sport also has a dark side.\n\n\n\n\n\nDr Daniel Wundersitz is a research fellow at La Trobe University's Holsworth Biomedical Research Centre.\n\n\n\n\n\n\" In Bendigo, Australia, we've noticed there's been a higher proportion of people showing up at the cardiology department with heart abnormalities, and it turns out that a few of them were cyclists. So we've done some research looking at the effect of endurance exercise on the hearts of cyclists and expanding it to runners as well.\"\n\n\n\n\n\nDr Wundersitz says they are still not sure why more cyclists are showing up with heart abnormalities, and whether the sport has any role to play.\n\n\n\n\n\nBut he adds cycling is still a great hobby as long as moderation is practiced.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/protesters-rally-against-climate-catastrophe-coal-mine-plan/xi0w7nubo",
        "title": "Protesters rally against 'climate catastrophe' coal mine plan",
        "publish_date": "Mon, 21 Jul 2025 07:11:36 +0000",
        "category": "finance",
        "authors": [],
        "text": "Protesters have rallied outside a court opposing what is set to be one of Australia's biggest coal mines, saying the multibillion-dollar proposal will contribute to a \"climate catastrophe\".\n\n\n\n\n\nSeveral dozen people gathered on Monday to object to Whitehaven's Winchester South open-cut mine, comparing it with a 1960s proposal to dredge up the Great Barrier Reef to produce fertiliser.\n\n\n\n\n\nIt came as the Land Court in Brisbane began hearing an objection against the proposal, which would extract 17 million tonnes of coal from the Bowen Basin each year.\n\n\n\nWho is opposing the mine proposal?\n\nAustralian Conservation Foundation's Adam Beeson compared the proposed mine with reef dredging and oil drilling, ideas blocked by the courts decades ago as he addressed protesters outside.\n\n\n\n\n\n\"What really is the difference between excavating coral and digging up coal, increasing the global temperature which causes coral bleaching and coral death?\", Beeson said.\n\n\n\nHe said his foundation along with the Mackay Conservation Group would tell the court the mine's return was \"not worth this impact\".\n\n\n\n\n\nMackay Conservation Group climate campaigner Imogen Lindenberg said Winchester South could be the nation's biggest new coal mine.\n\n\n\n\n\n\"If this mine goes ahead, it will create more pollution than Australia produces in one year,\" she said.\n\n\n\n\n\n\"We are already living in a time of climate catastrophe.\n\n\n\n\n\n\"Many folks' homes have been flooded, there are bushfires - it's not just us, it's all the beautiful threatened species.\"\n\n\n\nWhat has Whitehaven said?\n\nBarrister Saul Holt KC, acting for Whitehaven, said in his opening address that the Winchester South project would bring significant economic benefits.\n\n\n\n\n\nHe said the mine had widespread community support and would bring $696 million in state royalties and 500 new jobs during construction and operations.\n\n\n\n\"It's the right project, in the right place, by the right miner at the right time,\" he said.\n\n\n\n\n\nHolt said Winchester would also support manufacturing that was vital for Australia's transition to renewable energy.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/japan-pm-vows-to-stay-on-despite-key-election-loss-as-far-right-party-makes-gains/zp6k6pcyk",
        "title": "Japan PM vows to stay on despite key election loss as far-right party makes gains",
        "publish_date": "Mon, 21 Jul 2025 06:57:30 +0000",
        "category": "finance",
        "authors": [],
        "text": "Japanese Prime Minister Shigeru Ishiba has vowed to remain in office after his ruling coalition suffered a defeat in upper house elections, prompting some of his own party to deliberate on his future.\n\n\n\n\n\nIshiba told a news conference he would remain in office to oversee tariff talks with the United States and other pressing matters, such as rising consumer prices that are straining the world's fourth-largest economy.\n\n\n\n\n\nOxford Economics' lead Japan economist Norihiro Yamaguchi said: \"The political situation has become fluid and could lead to a leadership change or the reshuffling of the coalition in coming months, but Prime Minister Shigeru Ishiba will likely stay to complete the tariff negotiations with the US for now.\"\n\n\n\n'Harsh result'\n\nIshiba's Liberal Democratic Party (LDP) and coalition partner Komeito returned 47 seats, short of the 50 seats it needed to ensure a majority in the 248-seat upper chamber in an election where half the seats were up for grabs.\n\n\n\nREAD MORE Tofu gan: The Chinese and Taiwanese favourite now trending in Japan\n\nThat comes on top of its worst showing in 15 years in October's lower house election, a vote that has left Ishiba's administration vulnerable to no-confidence motions and calls from within his own party for leadership change.\n\n\n\n\n\nSpeaking after exit polls closed, Ishiba told NHK he \"solemnly\" accepted the \"harsh result\".\n\n\n\n\n\n\"We are engaged in extremely critical tariff negotiations with the United States ... we must never ruin these negotiations. It is only natural to devote our complete dedication and energy to realising our national interests,\" he later told TV Tokyo.\n\n\n\n\n\nAsked whether he intended to stay on as premier, he said: \"That's right.\"\n\n\n\nREAD MORE Australians are obsessed with Japan, but a new travel hotspot is emerging\n\n'Japanese First' campaign\n\nJapan, the world's fourth-largest economy, faces a deadline of 1 August to strike a trade deal with the US or face tariffs in its largest export market.\n\n\n\n\n\nThe main opposition Constitutional Democratic Party finished second with 22 seats.\n\n\n\n\n\nMeanwhile, the right-leaning Sanseito party announced its arrival in mainstream politics, winning 14 seats on top of its single existing seat.\n\n\n\n\n\nLaunched on YouTube a few years ago, the populist party found wider appeal with its \"Japanese First\" campaign and warnings about a \"silent invasion\" of foreigners.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/fiona-is-not-ready-to-retire-but-at-58-employers-may-be-labelling-her-too-old/0duhm12if",
        "title": "Fiona is not ready to retire but at 58, employers may be labelling her 'too old'",
        "publish_date": "Mon, 21 Jul 2025 05:06:12 +0000",
        "category": "finance",
        "authors": [],
        "text": "Key Points Despite many reporting hard-to-fill vacancies, not all employers are as open to hiring people of certain age groups.\n\nA recent survey found employers were most reluctant to hire those over 50 or under 24 years.\n\nHesitancy to hiring over 50s is leaving job seekers like Fiona feeling irrelevant, years before retirement age.\n\nFiona Cootes has more than two decades of experience working in events management but she wonders if she should include that detail when applying for jobs.\n\n\n\n\n\nThe 58-year-old has been looking for work for more than a year since finishing her last contract and is concerned potential employers may not want to hire someone her age.\n\n\n\n\n\nCootes said despite believing she was \"the perfect fit\" for a recent role she applied for, she was told the other applicant she was up against was \"a better culture fit\", which she feels was likely a reference to her age.\n\n\n\n\n\n\"I used to write in applications that I had 20 plus years of experience, and a friend actually advised me not to say that, they suggested I should say 'extensive experience' instead,\" she told SBS News.\n\n\n\n\n\nShe now only includes roles she has worked in across the past 10 years on her resume, but said she could not hide the fact she was not in her 20s or 30s when showing up for an interview.\n\n\n\n\"I've never felt old, but this is the first time in my life that I've been made to feel old and irrelevant and scared for my future, that I might not get another job,\" Cootes said.\n\n\n\n\n\nNew research from the Australian HR Institute (AHRI) and the Australian Human Rights Commission (AHRC) suggests employers may be overlooking experienced professionals due to their age.\n\n\n\nNearly 24 per cent of this year's respondents consider workers aged between 51 and 55 to be older, more than double the proportion from 2023 (10 per cent), according to the report. Source: SBS News\n\nHow old is 'old'?\n\nThe report, Older and Younger Workers: What Do Employers Think?, the fifth such national survey of employers and human resources professionals, revealed almost one in four employers considered workers in their 50s 'old' and were reluctant to hire people over 50.\n\n\n\n\n\nSarah McCann-Bartlett, CEO of the Australian HR Institute, said despite growing labour shortages, the findings suggested many employers remained hesitant to hire workers over 50.\n\n\n\n\n\n\"It found that employers are increasingly viewing workers as older at a younger age,\" she said.\n\n\n\n\n\n\"People are being written off well before retirement age, with nearly one in four respondents stating that a 51 to 55-year-old is considered old and that's more than double the figure in 2023.\"\n\n\n\nJust 56 per cent of HR professionals say they are open to hiring people aged between 50 to 64, and only 28 per cent report being open to hiring those aged 65 and over \"to a large extent\", the findings state. Source: SBS News Cootes said despite having what she described as \"a broad wealth of experience and knowledge\", having worked for the Queensland government, a five-star hotel and the Census, among a number of other employers, she had found it challenging to get an interview.\n\n\n\n\n\n\"It just makes me feel totally irrelevant and redundant,\" she said.\n\n\n\n\n\nCootes is almost a decade away from Australia's retirement age of 67 and said she is nowhere near ready to retire.\n\n\n\n\n\nShe said while she wanted to put her skills and experience to the best use, she had recently applied for a role that was a more junior position than the ones she had worked in and still never got an interview.\n\n\n\n\n\nAt the same time, she said it did not seem fair that people of a certain age should have to feel as though they should take on much more junior roles simply because they were considered 'old'.\n\n\n\n\n\n\"I'm worth more than that to start at the bottom of the chain again,\" she said.\n\n\n\n\n\n\"And what does that do for my confidence when I've had dozens of years in the workforce, and for someone to say, oh, just get any job, it doesn't matter, just get an income, it does matter.\"\n\n\n\nProductivity growth\n\nDespite more than half of respondents reporting hard-to-fill vacancies, just 56 per cent stated they are open to hiring workers aged 50–64 \"to a large extent\", with that number halving for those over 65.\n\n\n\n\n\nMcCann-Bartlett said sidelining certain people due to irrelevant factors, such as age, in the current economy, which was experiencing skills shortages, made little sense.\n\n\n\n\n\n\"In a tight labour market, there is a clear economic imperative to tap into the full potential of the available labour pool, and that means building inclusive practices that support employees at every stage of their careers,\" she said.\n\n\n\nA substantial majority of employers rate older workers higher than younger workers in terms of reliability, commitment, loyalty, awareness, and ability to cope with stress, according to the report. Source: SBS News Economists have expressed concern about Australia's lagging productivity rate, and Treasurer Jim Chalmers has identified improving it as one of his key priorities, having called it the most significant structural problem facing the economy.\n\n\n\n\n\nProductivity growth fell by 1 per cent in the year to March, according to the Australian Bureau of Statistics.\n\n\n\nREAD MORE Anthony Albanese announces new move to tackle Australia's productivity problem\n\nThe results indicated employers thought younger workers were less able to cope with stress and less reliable, while they rated older workers relatively low in terms of career ambition and their ability to use technology.\n\n\n\nAge-based assumptions\n\nMcCann-Bartlett said while most HR professionals agreed job performance did not differ by age, the research found that many age-based assumptions were being made in the workplace.\n\n\n\nAmong the most commonly cited advantages of employing younger workers are perceived proficiency with technology (79 per cent), being more physically capable (59 per cent), and having more energy (52 per cent). Source: SBS News \"Younger workers were seen as less likely to cope with stress and less reliable, while older workers were rated relatively low for career ambition and their ability to use tech,\" McCann-Bartlett said.\n\n\n\nEncouraging multigenerational workplaces\n\nOver 50s were not the only age group for whom employers showed reluctance in hiring; the research also showed that employers were wary of hiring those under 24.\n\n\n\n\n\nOf those surveyed, 41 per cent said they were open to recruiting job seekers aged 15 to 24 \"to a large extent\".\n\n\n\n\n\nMcCann-Bartlett said hesitancy around hiring people from certain age groups only limited employers' access to essential skills and experience that different groups of people have to offer.\n\n\n\n\n\n\"If we want to lift productivity in Australia, we need to use better use of the talent we already have and that means hiring based on skills, not age and keeping great experience in the workforce for longer,\" she said.\n\n\n\n\n\n\"To support a multigeneration workforce employers can do things like implement training and inclusivity initiatives that support age diversity, this is things like training leaders to better lead across generations, offering phased retirement, job sharing, and providing career planning to encourae workers to stay in the workforce longer.\"\n\n\n\nRobert Fitzgerald, age discrimination commissioner at AHRC, said the recent report's findings highlighted the need for sustained action against ageism.\n\n\n\n\n\n\"What we're seeing is bias at both ends of the age range. Sadly, this undermines diversity of thought and productivity,\" he said.\n\n\n\n\n\n\"Older and younger workers can be a real advantage for businesses.\"\n\n\n\n\n\nFitzgerald said age-diverse teams bring different life experiences to the table and that such workforces are better at solving problems.\n\n\n\n\n\n\"Employers need to support inclusive workplaces, where competency isn’t assessed against age or career stage.\n\n\n\n\n\n\"Providing equal opportunity for people of all ages to remain engaged in meaningful work can enhance productivity, while also helping close skills gaps.\"\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/new-season-of-parliament-opens-in-canberra-with-old-hands-and-newcomers/01s99hq6d",
        "title": "New season of Parliament opens in Canberra - with old hands and newcomers",
        "publish_date": "Mon, 21 Jul 2025 03:43:36 +0000",
        "category": "finance",
        "authors": [],
        "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\n\"I just want to say that it augurs well for this Parliament because the weather today is spectacular. The calm on that lake, the sun, the clear skies, in a remarkably cold time for Canberra.\"\n\n\n\n\n\nThat's Australia's Governor General, Sam Mostyn, welcoming the cohort of new members to Canberra in a formal ceremony days ahead of the official start of Parliament.\n\n\n\n\n\nAmong the new arrivals is Matt Smith - a stand-out among Labor's coterie, at more than two metres in height.\n\n\n\n\n\nThe former basketball player is now in Canberra after taking the far north Queensland seat of Leichhardt from the Coalition for the first time in almost two decades.\n\n\n\n\n\nHe's a vocal advocate for the far north, and has made clear on his own social media that adjusting to life in Canberra has not been without challenges.\n\n\n\n\n\n\"Now I'm going for a walk here in Canberra. Obviously the Chihuahuas aren't here with me, but it's cold. It's so, so cold... Look, if there was ever an excuse to go to far North Queensland, because right now at Trinity Beach it's 20 degrees and you could be watching the sun come up over the ocean would be beautiful.\"\n\n\n\n\n\nThen there's New South Wales One Nation senator Warwick Stacey, who dropped out of high school and headed to France where he worked as a handyman and English teacher before joining the British army.\n\n\n\n\n\nHe eventually settled into a job as a kidnap and response consultant, advising clients on ways to navigate kidnappings, and even planning and implementing a ransom delivery to Somali pirates.\n\n\n\n\n\nAhead of the federal election in May, Senator Stacey told 2GB radio his past life experience offers him an important point of difference from other politicians, and keeps him connected to voters.\n\n\n\n\n\n\"When I was trained at Sandhurst, the motto of Sandhurst is serve to lead. And as a leader, you put your men, your people before yourself, and that is certainly not being done by the so-called leaders that we have in Parliament today. They're not putting Australia and Australians first.\"\n\n\n\n\n\nThese new faces are among about 40 politicians who are entering parliament for the first time.\n\n\n\n\n\nDuring an event for new and returning politicians hosted by the Governor-General at Government House, Prime Minister Albanese reminded newcomers to take their responsibilities seriously.\n\n\n\n\n\n\"It is such a privilege to sit either in the House of Representatives or the Senate. And something that none of us should ever take for granted. There are always far more people wanting to be in this position than can fulfil it, and it is an honour each and every day.\"\n\n\n\n\n\nAnd while he skipped the ceremony at Government House, National Party's Barnaby Joyce has echoed this sentiment, telling Seven's Sunrise working in politics is a privilege not to be taken lightly.\n\n\n\n\n\n\"I had to split firewood and check the cattle before I headed off for a while. But look, it is really important. It's an incredible honour to come in the door here. It's an incredible honor to work here and you've got to understand part of the ritual is government house.\"\n\n\n\n\n\nAlongside those new to parliament house, there are some old hands as well.\n\n\n\n\n\nGoldstein MP Tim Wilson, for example, is no stranger to politics, and will return to parliament as the only Liberal to win back their seat from a 'teal' independent at the 2025 election.\n\n\n\n\n\nBoth major parties are stepping into Parliament with a few items already on the agenda.\n\n\n\n\n\nBack in May, Prime Minister Anthony Albanese made it clear what his first task would be.\n\n\n\n\n\nREPORTER: \"What is the first item on the agenda for you?\"\n\n\n\n\n\nALBANESE: \"A 20 percent cut in student debt, as I promised.\"\n\n\n\n\n\nEmployment Minister Amanda Rishworth has already flagged the government wants to introduce a bill to protect penalty rates for award workers.\n\n\n\n\n\nThe legislation would ensure workers on award wages can't have their penalty rates reduced in return for higher rates of base pay, if that would leave individual workers worse off.\n\n\n\n\n\n\"We know there are a number of cases on foot in the commission where worker's take home pay could be reduced. And we want to make it clear in law that these penalty rates and overtime rates should be protected because we don't want people earning less and working harder.\"\n\n\n\n\n\nAnd Liberal Senator Dave Sharma has told Sky News improving productivity will be high on his party's list.\n\n\n\n\n\n\"We need to fix our productivity. We need to improve our living standards. We need to get government spending under control. We need to balance the fiscal books again. We will work with Labor constructively on all of those if they're prepared to actually grasp the net and deal with these challenges.\"\n\n\n\n\n\nAlso looming large is the prospect of new childcare safety laws.\n\n\n\n\n\nLegislation to strip childcare centres of federal funding if they do not meet national safety standards will be brought to federal parliament when it resumes.\n\n\n\n\n\nAttorney-General Michelle Rowland has told Sky News the government is also working with states and territories on developing a national register of childcare workers.\n\n\n\n\n\n\"We've got different states and territories with their own schemes for working with children checks and reportable conduct. They do not talk to other states and there is no system of oversight.\"\n\n\n\n\n\nThe new term will see Labor with an increased majority, holding 94 of the 150 seats in the House of Representatives after a landslide election win.\n\n\n\n\n\nThe win has Prime Minister Anthony Albanese returning to Parliament in high spirits.\n\n\n\n\n\n\"Look, we have a clear plan for the second term of government, and I will work constructively with the Parliament as I did in the first term. And what I want to see is a positive agenda going forward, and we'll see how we go.\"\n\n\n\n\n\nOpposition Leader Ley says the coalition are ready to support policies in the national interest, including new childcare legislation.\n\n\n\n\n\nBut she says they also return to parliament ready to put up a fight.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/prime-minister-to-push-childcare-reform-as-parliament-returns-midday-news-bulletin-21-july-2025/0zgvzvllc",
        "title": "Prime Minister to push childcare reform as parliament returns | Midday News Bulletin 21 July 2025",
        "publish_date": "Mon, 21 Jul 2025 01:58:44 +0000",
        "category": "finance",
        "authors": [],
        "text": "Key Points Parliament to resume for first time since election\n\nTasmanian business leaders concerned over state politics\n\nVenus Williams returns to professional tennis\n\nListen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nPrime Minister Anthony Albanese says he supports a greater role for the federal government in childcare.\n\n\n\n\n\nUniversal affordable childcare was identified by the prime minister during the recent federal election as the one reform he'd most want to be remembered for.\n\n\n\n\n\nBut the accusations levelled against Joshua Brown, whose 70 counts of alleged abuse at Melbourne early learning centres have raised concerns that the rapid expansion of government subsidies into the sector has not been met with a commensurate increase in safety and scrutiny.\n\n\n\n\n\nMr Albanese says he sees the need for a stronger role for the federal government in childcare.\n\n\n\n\n\nAnd with Parliament resuming, he says he wants this to be a year of delivery for the government's policy agenda.\n\n\n\n\n\n\"To all the MPs and senators elected to the 48th Parliament, firstly congratulations across the board. It is such a privilege to sit either in the House of Representatives or the Senate. And it is something that none of us should ever take for granted. And it is an honour each and every day.\"\n\n\n\n\n\nThe first parliamentary sitting since the May election begins on tomorrow.\n\n\n\n\n\nThe second term of Albanese government will see Labor with an increased majority, holding 94 of the 150 seats in the House of Representatives after a landslide election win in May.\n\n\n\n\n\nAbout 40 politicians are entering parliament for the first time.\n\n\n\n---\n\n\n\n\n\nBusiness leaders in Tasmania have urged politicians to work together to overcome the hurdle of a hung parliament - and resume parliamentary activity soon.\n\n\n\n\n\nSaturday's election was the state's fourth in seven years – and the second in two years, brought on by a motion of no confidence in Premier Jeremy Rockliff in June.\n\n\n\n\n\nIt has returned the result of another hung parliament, with neither major party winning the 18 seats required to rule as a majority government.\n\n\n\n\n\nNegotiations are underway to finalise a power sharing arrangement.\n\n\n\n\n\nThe CEO of the Tasmanian Chamber of Commerce and Industry, Michael Bailey says political uncertainty is hurting businesses.\n\n\n\n\n\n\"It is time for Parliament to get back to work. This has been a huge distraction for Tasmanian business, for investment and it is time that we see the Parliament back working again. What we can't afford is to have weeks of horse-trading behind the scenes with governments trying to form. We simply need parliament to get back - and to get on with the job of leading Tasmania.\"\n\n\n\n---\n\n\n\n\n\nA new report has found Australians living with chronic pain continue to suffer from stigma, with 74 per cent feeling ignored or dismissed; and 48 per cent experiencing prejudice from health professionals.\n\n\n\n\n\nThe research released by Chronic Pain Australia surveyed 5,000 Australians.\n\n\n\n\n\nIt found nearly three-quarters of chronic pain sufferers experience mental health issues as a result of their pain, while nearly two-thirds are unable to work and experience financial strain.\n\n\n\n\n\nThe chairperson of Chronic Pain Australia, Nicolette Ellis, says with around 3.6 million Australians impacted by chronic pain, more effort needs to be made to ensure people can get help.\n\n\n\n\n\n\"Chronic pain is a complex condition to treat and it usually needs a team of health professionals, with different skillsets to help build that person's toolkit. Unfortunately, in the National Pain Report we saw that only 18 per cent of people are referred to what we call multidisciplinary care where they can get access to those different health professionals to help support their care.”\n\n\n\n\n\nThe report calls on the federal government to make chronic pain a national priority through changes like providing more localised funding to primary care and the coding system to recognise it as a health condition.\n\n\n\n---\n\n\n\n\n\nExit polls show Japan's ruling coalition is likely to lose its majority in the upper house, with 75 uncontested seats out of the 125 needed to maintain control.\n\n\n\n\n\nThe vote does not determine whether prime minister Shigeru Ishiba's minority Liberal Democratic Party remains in power, but increases the pressure on the leader, after the bloc lost its majority in the lower house following elections in October.\n\n\n\n\n\nA loss at this election would mark the first time in the history of the party that it leads a coalition that does not control either house, and would likely result in calls for Mr Ishiba to step down.\n\n\n\n\n\nRising prices, low incomes and burdensome social security payments are among key issues for voters.\n\n\n\n---\n\n\n\n\n\nIn sport, former world number one Venus Williams is preparing for her return to professional tennis.\n\n\n\n\n\nAfter 16 months away from the sport, the seven-time Grand Slam champion is competing in the Washington Open.\n\n\n\n\n\nThe 45-year-old has won the Wimbledon singles title five times and the US Open twice, as well as 14 Grand Slam women's doubles titles alongside her younger sister Serena.\n\n\n\n\n\nShe has not competed since the Miami Open in March 2024.\n\n\n\n\n\nShe faces fellow American Peyton Stearns in the first round of the Washington Open today.\n\n\n\n\n\n\n\nWilliams says after time away, her definition of success has shifted.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.theage.com.au/national/western-australia/wa-news-live-eagle-harley-reid-linked-to-the-biggest-contract-deal-in-afl-history-20250721-p5mgpc.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "WA news LIVE: New challenger emerges for Perth’s top breakfast radio spot",
        "publish_date": "Tue, 22 Jul 2025 12:17:35 +1000",
        "category": "sports",
        "authors": [],
        "text": "Eagles young gun Harley Reid is reportedly chasing the biggest contract deal in AFL history, worth more than $20 million.\n\nFooty Classified journalist Cal Twomey said the 20-year-old has had contract offers from the Eagles in front of him since April.\n\n“In recent weeks his management have sent counter-offers to the Eagles, and part of that … includes a mammoth offer that would be a two-year extension, plus an extension on top of that of another nine years, so an 11-year arrangement,” he said.\n\n“This is groundbreaking really ... it would take him through to the end of 2037.\n\n“The Eagles are still weighing this up and going through their own negotiation process and clubs are continuing to hunt him in Victoria. I think Hawthorn are near on obsessed with Harley Reid and getting him to the club and are willing to go to eight to 10 years at $1.7m, $1.8m [per season] to get him across the line.”\n\nReid is contracted to West Coast until the end of next season.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/culture/tv-and-radio/bride-devastated-after-trying-on-jennifer-anistons-wedding-dress-20250722-p5mgvv.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Bride devastated after trying on Jennifer Aniston's wedding dress",
        "publish_date": "Tue, 22 Jul 2025 12:10:53 +1000",
        "category": "finance",
        "authors": [],
        "text": "Bride devastated after trying on Jennifer Aniston's wedding dress\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/culture/tv-and-radio/bride-in-tears-over-friends-wedding-dress-reaction-20250722-p5mgvw.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Bride in tears over friend's wedding dress reaction",
        "publish_date": "Tue, 22 Jul 2025 12:10:45 +1000",
        "category": "finance",
        "authors": [],
        "text": "Bride in tears over friend's wedding dress reaction\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/parliament-returns-after-labors-stunning-may-victory-20250722-p5mgvm.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Parliament returns after Labor's stunning May victory",
        "publish_date": "Tue, 22 Jul 2025 12:04:05 +1000",
        "category": "finance",
        "authors": [],
        "text": "Parliament returns after Labor's stunning May victory\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/business/markets/the-world-is-more-scared-of-trump-than-america-20250722-p5mgsl.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "The world is more scared of Trump than America is",
        "publish_date": "Tue, 22 Jul 2025 11:59:52 +1000",
        "category": "finance",
        "authors": [
            "Stephen Bartholomeusz"
        ],
        "text": "Either of Trump’s tariffs or the attempted assault on the independence and reputation of the Fed would normally cause conniptions in financial markets. They, however, sail serenely on. The S&P 500 is up more than 7 per cent this year, Nasdaq 8.6 per cent and the AI-driven bigger technology stocks, as a group, 15 per cent. Bond yields, at both the short and long ends of the yield curve, have fallen since the start of the year. The apparent complacency of investors could be explained by the “TACO” trade – a conviction that Trump Always Chickens Out – but that would suggest a lack of sophistication and awareness. Wall Street is brushing off the effects of the Trump chaos. Credit: Bloomberg Trump’s tariffs are real.\n\nHis 10 per cent baseline tariffs are in place, as are his sectoral tariffs on steel, aluminium, copper, autos, auto parts, small packages, imports from China and some from Canada and Mexico. Loading His punitive “reciprocal” tariffs are scheduled to go live on August 1. Whether or not they are as Draconian as those unveiled on April 2, they will exacerbate the existing effects of Trump’s trade wars and lengthen the time it will take before the full effects of the tariffs are felt and can be assessed. Trump’s transparent attempts to force the Fed to cut US interest rates and his foreshadowing of the appointment of a Fed chair who will accede to his wishes are also very real. Rather than chickening out, as he did when he deferred the introduction of the reciprocal tariffs he announced on April 2 after the markets shuddered, Trump now seems emboldened by the return of investor optimism.\n\nWhether the market calm will survive when the reality of Trump’s reciprocal tariffs hits home in 10 days’ time or when he appoints his “yes man” to be Powell’s successor is the trillion-dollar (multi-trillion dollars?) question. Investors ought to be concerned about Trump’s tariffs because they are already having an impact on inflation and some corporate profits. Loading Last week’s June inflation data, while apparently benign, did blip up to 2.7 per cent (the Fed’s target is 2 per cent) and there were material increase in the prices of those goods most exposed to the tariffs already in place, even though importers had rushed to stockpile their imports to get ahead of the imposition of the tariffs. Those indications of rising inflation can only strengthen as those inventories are run down and the cost pressures on US importers – who pay the tariffs – rise. Already retailers and others are talking about price rises to offset the tariffs’ cost.\n\nOn Monday, Stellantis, the manufacturer of Chrysler, Jeep, Ram, Peugeot and Fiat vehicles, announced a €2.3 billion ($4.1 billion) first-half loss. It said the tariffs cost it €300 million after factory shutdowns had caused a 25 per cent reduction in deliveries of its cars to US buyers. It also wrote off another €300 million from the value of clean air credits that it held after Trump’s One Big Beautiful Bill (the Republicans’ budget bill) removed the penalties for companies’ failure to comply with clean air standards. Trump has continued his attacks on Fed chair Jerome Powell. Credit: Bloomberg General Motors, which also reports this week, has said the impact of Trump’s tariffs will cost it about $US4.5 billion ($6.9 billion) this year. It imported nearly half the cars it sold last year from Mexico and South Korea. So far, the tariffs haven’t had a material impact on the price of cars – they actually fell in June – or the volumes sold. That may be because buyers acted to get in ahead of the tariffs, as they may have done in other categories. That would explain the reasonably healthy retail sales numbers.\n\nAs the impact of the tariffs gradually shows up in companies’ costs as their inventories run down and their capacity to absorb those costs lessens, there will be price rises and increased inflation and, inevitably, a response from consumers. There’s also the impact of the One Big Beautiful Bill, which added a raft of new tax and spending measures to Trump’s 2017 tax cuts for companies and the wealthy. The Congressional Budget Office’s most recent update of the impact of that legislation is that it will add a net $US3.4 trillion to US government debt over the next decade. Foreign investors, it seems, are more wary of the Trump trade and central bank agendas than the locals. The bill is stimulatory at a time when inflation is just starting to accelerate. In those circumstances, Trump’s repeated demand for the Fed to cut its policy rate by 3 percentage points would look ludicrous and the markets would start to fear rising, not falling interest rates.\n\nAny undermining of Powell before his term expires next May, or the appointment of someone obviously going to try to do Trump’s bidding, would also see the US yield curve steepen. The yields on short-term securities would fall in expectation of a lower federal funds rate (analogous to the Reserve Bank’s cash rate), but the yields on longer-term bonds would rise to compensate for the likely higher inflation rates. Loading The mixture of Trump’s tariffs and the politicisation of the Fed would probably impact both economic growth and the inflation rate. With the S&P 500 trading at 27 times the earnings of its constituent companies last year and 22 times the bullish forecasts for this year’s earnings, any significant rise in market interest rates would have a very material impact on share prices.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/nsw/giraffe-and-unborn-calf-die-in-latest-sydney-zoo-tragedy-20250722-p5mgud.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Giraffe and unborn calf die in latest Sydney Zoo tragedy",
        "publish_date": "Tue, 22 Jul 2025 11:51:26 +1000",
        "category": "finance",
        "authors": [
            "Josefine Ganko"
        ],
        "text": "A female giraffe and her unborn calf have died during labour at Sydney Zoo.\n\nOn Thursday night, Nzuri went into active labour at the zoo in Bungarribee in Sydney’s western suburbs, with animal care staff quickly observing that something was wrong.\n\nNzuri died during labour at Sydney Zoo on Thursday. Credit: Sydney Zoo\n\nThree veterinarians and two nurses from institutions across Sydney were mobilised to assist in the complex labour, and Nzuri was anaesthetised for a complete assessment, the zoo said.\n\nThe team found the calf was positioned with its front two legs emerging, and its head and neck were out of position. With the calf deceased and its mother in considerable pain, zoo staff decided to euthanise Nzuri.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/lifestyle/life-and-relationships/kiss-cam-whammy-made-us-chuckle-but-it-has-triggered-my-bonk-ban-fixation-20250721-p5mgq0.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Kiss Cam whammy made us chuckle, but it has triggered my bonk ban fixation",
        "publish_date": "Tue, 22 Jul 2025 11:50:58 +1000",
        "category": "lifestyle",
        "authors": [
            "Jenna Price"
        ],
        "text": "We could and should emulate prime ministers Malcolm Turnbull and Anthony Albanese. Turnbull imposed the bonk ban after the chaos of Barnaby Joyce’s love life. Albanese continued the policy because it was the sensible thing to do. My god, I loved watching the musical chairs among staffers in the wake of the first round of BB.\n\nWhen advocating for workplace bonk bans, I’ve been reprimanded by former students who tell me that work is the only place they meet people. My advice? Get out more.\n\nI have zero idea why workplaces can’t institute a bonk ban. Sure, at the same level and with no chain of command issues, there’s barely a risk – except for the one where you can say to a trusted colleague: Geez, that bloke [you’re rooting] is utterly useless.\n\nKiss Cam, the harbinger of doom that picks out smooching couples in a crowd and projects them for everyone to see, brought out the ugly truth for us all. Every workplace hosts a dodgy relationship, and that hurts the rest of us. I can tell you from personal experience in both newspapers and universities. The relationship, even when consensual, damages how work works.\n\nWhy does workplace bonking hurt the rest of us? Here are my own personal experiences.\n\nExhibit A. Let’s call him Leaden Fool. He had come along to an event I’d organised. He’d spotted a gorgeous young talent and asked for contact details. A few months later, the young thing got a job with us. They then embarked on a relationship that both denied ever existed. Exhausting. They backed each other up in every single crucial decision made. There was never any room for discussion. If they weren’t bonking, they were certainly barracking for each other in every way possible. One has gone on to bigger things, the other consigned to the dustbin of history. But it took a long time and damaged people and processes along the way.\n\nLoading\n\nBut probably my least favourite experience of working with a couple was working with a throuple (strictly speaking, throuples are consensual all ways). Anyhow, this drunken sleaze was bonking two junior reporters in the same period of time. The sweeties apparently had no idea, although all the other junior reporters knew because, well, journalists are trained observers unless they are in a sex haze. That didn’t end well either. And there were civilians hurt in the process who should have had the chance to grieve in private.\n\nMegan Kerrigan didn’t get a chance to grieve in private. She discovered the bad news when everyone else did, when millions of others did. Her husband, Andy Byron, and his, ahem, date, Kristin Cabot, were caught on Kiss Cam at a Coldplay concert. Sure, it’s easy to get swept up in what the Conservatorium’s Dr Brad Fuller describes to me as looping chords, shimmering guitars and falsetto vocals, both intimate and epic. But you could tell, even under the veil of shame, these two knew each other. In a biblical sense.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/politics/nsw/eviction-jail-and-1-5-million-fines-for-illegal-tobacco-sellers-20250722-p5mguk.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Eviction, jail and $1.5 million fines for illegal tobacco sellers",
        "publish_date": "Tue, 22 Jul 2025 11:49:55 +1000",
        "category": "finance",
        "authors": [
            "Jessica Mcsweeney"
        ],
        "text": "Landlords would be given the power to evict retailers caught selling illegal tobacco under sweeping laws to be introduced by the state government to combat Sydney’s booming illicit cigarette trade.\n\nAlong with allowing for evictions, NSW Health would be able to shut down a business for 28 days, which could be extended to 12 months with a court order. Those found with a commercial quantity of illegal cigarettes face maximum sentences of seven years in prison, and $1.5 million in fines.\n\nAustralian Border Force officers with a container of illegal cigarettes. Credit: Luis Enrique Ascui\n\nPremier Chris Minns flagged the powerful new legislation, which includes similar measures to the Coalition plan, would be introduced to parliament in the coming sitting weeks.\n\n“In a few days’ time we’ll unveil our response to what has been a massive increase in the illegal tobacco marketplace in NSW and across the country, and that is for some of the toughest penalties in the country,” Minns told Ben Fordham on 2GB.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/nsw/the-sister-the-lover-and-the-300-000-inheritance-fight-20250721-p5mgh5.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "The sister, the lover and the $300,000 inheritance fight",
        "publish_date": "Tue, 22 Jul 2025 11:45:00 +1000",
        "category": "finance",
        "authors": [
            "Michaela Whitbourn"
        ],
        "text": "A NSW man who died without a will left his entire estate to his estranged “on and off” partner, a court has ruled in a dispute between the man’s sister and his one-time fiancee.\n\nThe man died in August 2023, aged 56, and his former partner found out about his death on Facebook about six weeks later. She had left his home in May, after what the NSW Supreme Court heard was “another drunken and abusive outburst” by him.\n\nThe couple had been engaged at one point and he had given his fiancee an amethyst ring, the Supreme Court heard.\n\nBecause the man had no other siblings, no children and no living parents, his sister stood to inherit his entire estate, valued at about $300,000, under rules relating to the distribution of estates where there is no will.\n\nThe man’s ex-fiancee brought court proceedings, seeking a share of his estate under NSW succession laws that allow eligible people to seek a “family provision order” if inadequate provision has been made for them from an estate.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/culture/tv-and-radio/smooth-fm-rolls-2gb-to-take-no-1-sydney-radio-spot-as-abc-struggles-20250722-p5mgum.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Smooth FM rolls 2GB to take No.1 Sydney radio spot as ABC struggles",
        "publish_date": "Tue, 22 Jul 2025 11:45:00 +1000",
        "category": "finance",
        "authors": [
            "Michael Lallo"
        ],
        "text": "Smooth FM is now Sydney’s No.1 radio station, overtaking 2GB* in the fourth ratings survey of the year.\n\nThe music-based network attracted 12.3 per cent of the available audience – just 0.1 percentage point lower than its previous result – while 2GB suffered the greatest loss of any broadcaster, falling 2 points to 11.6 per cent.\n\n2GB breakfast host Ben Fordham is still No. 1, despite the station’s overall losses. Credit: James Brickwood\n\nAlthough Kiis remains in third place, it enjoyed the biggest increase during the 10-week survey period, climbing 1.1 points to an audience share of 10.4 per cent. Classic hits station Gold ranked fourth, followed by Nova, ABC Sydney, Triple M and 2Day FM.\n\nIt is important to note that survey time slots do not always correspond precisely with program time slots.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/world/long-delayed-tesla-diner-opens-up-in-los-angeles-united-states-20250722-p5mgv7.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Long-Delayed Tesla Diner opens up in Los Angeles United States",
        "publish_date": "Tue, 22 Jul 2025 11:41:38 +1000",
        "category": "finance",
        "authors": [],
        "text": "Long-Delayed Tesla Diner opens up in Los Angeles United States\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/money/investing/australiana-auction-why-your-old-mambo-shirt-could-be-worth-hundreds-20250722-p5mgtg.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Australiana auction: Why your old Mambo shirt could be worth hundreds",
        "publish_date": "Tue, 22 Jul 2025 11:41:02 +1000",
        "category": "finance",
        "authors": [
            "Stephen Crafti"
        ],
        "text": "Dare Jennings, the name behind clothing label Mambo, has enjoyed an illustrious career. In the 1970s, he took the simple T-shirt and worked with leading artists to transfer this piece of cotton into ‘art to wear’.\n\nWhat started out as this great idea with his business partner Andrew Rich led to other successes, including producing Phantom Records and designing surf gear. A couple of decades later, Jennings established the fashion business Deus Ex Machina, swapping surf for motorbike culture.\n\nDecades after founding Mambo, Dare Jennings established the fashion business Deus Ex Machina, swapping surf for motorbike culture. Credit: Louie Douvis\n\nPart of this extraordinary legacy will be sold at Shapiro Auctioneers in Sydney on September 23, giving those who recall the Mambo period an opportunity to purchase a piece of nostalgia.\n\nThe T-shirts, shirts, record covers, posters and one-off art pieces, including a couple of pinball machines, will go under the hammer. Living the life of a hippie in the 1970s, travelling up and down the New South Wales Coast, Dare reflects on the incidents that started this trajectory.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/cricket/get-stuck-into-them-england-reveal-sledging-meetings-and-plans-to-bring-the-lip-for-the-ashes-20250722-p5mguh.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘Get stuck into them’: England reveal sledging meetings – and plans to bring the lip for the Ashes",
        "publish_date": "Tue, 22 Jul 2025 11:38:34 +1000",
        "category": "sports",
        "authors": [
            "Daniel Brettig"
        ],
        "text": "England’s vice-captain Harry Brook has revealed the dressing room conversations that led the Ashes combatants to take up premeditated, tactical sledging against India, as Ben Stokes’ team gears up for the trip to Australia this summer.\n\nAnd pace bowler Brydon Carse has explicitly linked this abrasive approach to how England want to battle Australia for the Ashes here, where England have not won a Test match since 2011, the last time they retained the urn away from home.\n\nBen Stokes with Harry Brook. Credit: Reuters\n\nAfter a spiteful Lord’s Test where players on both sides lost their cool on several occasions, Brook said that coach Brendon McCullum – who has employed his friend and former New Zealand psychologist Gilbert Enoka to help motivate the England players – told the team before the game that they were “too nice” to opponents.\n\nWhen India’s captain Shubman Gill harried the England openers Zak Crawley and Ben Duckett as they tried to avoid another over being bowled on the third evening, Brook used the episode as a pretext to initiate a sledging barrage for the remainder of the match, which England went on to win narrowly.",
        "source": "TheAge"
    },
    {
        "url": "https://ca.news.yahoo.com/big-name-toronto-winger-makes-050149803.html",
        "title": "Big name Toronto winger makes sense to take Corey Perry's old job on Oilers",
        "publish_date": "2025-07-21T05:01:49Z",
        "category": "sports",
        "authors": [
            "David Staples",
            "Edmonton Journal"
        ],
        "text": "All of the top NHL unrestricted free agents have already signed contracts, but there’s one big name player still available that makes good sense for the Edmonton Oilers to pursue.\n\nThis doesn’t mean this veteran NHL forward will sign with the Oilers. But his skillset — think Corey Perry, only far more physical — fits with what Edmonton needs and would provide said free agent forward, Max Pacioretty, with a solid chance of winning his first Stanley Cup.\n\nIndications are that Pacioretty will sign elsewhere if he decides to play one more NHL season at age 37. I’m not an insider telling you the Oilers are keen on him or he’s keen on the Oilers. But in looking at what Edmonton now needs, having lost power forwards Evander Kane and Dylan Holloway in the past two years, as well as aggressive forwards Warren Foegele, Corey Perry, Connor Brown and Viktor Arvidsson — Pacioretty would might well be an excellent fit here, especially come playoff time.\n\nmax\n\nPacioretty started out ranked 16th on The Daily Faceoff’s Matt Larkin’s Top 75 NHL free agents on July 1. He’s now the third highest ranked player left unsigned, behind only Jack Roslovic and Matt Grzelcyk.\n\nADVERTISEMENT\n\nI didn’t think Pacioretty would still be available at this point of free agency, but here we are.\n\nPacioretty has played 939 NHL games with 336 goals and 681 points, along with 58 points in 89 playoff games.\n\nOf course, he’s slowing down. He had just five goals this past regular season in 37 games for Toronto, that after four goals in 47 games for Washington in 2023-24. But in small doses, Pacioretty still brings it as a power forward. It’s fair to be worried about his cumulative injuries but if the Oilers manage him properly, he’s a decent bet to be healthy when needed most, for the 2026 playoff run.\n\nIn the last two playoffs season, if we rank NHL forwards giving equal weight three categories, goals and assists per 60 minutes of even strength play and hits per 60 even strength, Pacioretty ranks second overall of all NHL forwards, with 21.9 hits per 60, 1.77 assists per 60, and 0.71 goals per 60.\n\nTop of the list is Vasily Podkolzin of the Oilers, with Edmonton’s Zach Hyman ranking sixth and former Oiler Evander Kane ranking 15th.\n\nADVERTISEMENT\n\nKasperi Kapenen ranks 26th, Adam Henrique, 31st, Connor McDavid, 39th and Trent Frederic 47th.\n\nPerry — and Pacioretty would essentially be taking Perry’s role on the Oilers line-up — ranks 152nd.\n\nmax\n\nIf we use the same hits and points per 60 markers for the 2024-25 regular season at even strength, Pacioretty also comes out well, ranking 10th overall for all NHL forwards for the season, just behind Washington’s Tom Wilson and ahead of Dallas Stars beast Jame Benn.\n\nIs it likely Pacioretty will sign here? No. But last season he played for $873,770. If he was willing to take about the same from the Oilers, the price would certainly be right.\n\nThere was some indication he might return to the Toronto Maple Leafs for the coming year, as he’d proven to be a good fit there. More recently, that prospect has come into some doubt, with Pacioretty perhaps signing in Detroit instead mentioned on rumour boards.\n\nADVERTISEMENT\n\nIt seems most likely that if Pacioretty does play, Toronto or Detroit or some other eastern team will sign him.\n\nBut the lure of taking on Corey Perry’s role here in Edmonton is not insignificant. Here’s hoping, as Pacioretty would be a decent bet and a solid signing for the Oilers.\n\nAt the Cult of Hockey\n\nLEAVINS: He isn’t bionic, but this Edmonton Oiler may still become The Six-Million-Dollar-Man: 9 Things",
        "source": "Yahoo"
    },
    {
        "url": "https://ca.news.yahoo.com/neighbours-changed-coastline-want-fixed-090000835.html",
        "title": "Their neighbours changed the coastline and they want it fixed",
        "publish_date": "2025-07-21T09:00:00Z",
        "category": "finance",
        "authors": [],
        "text": "Their neighbours changed the coastline and they want it fixed\n\nWhen it empties into Greville Bay at high tide, Wards Brook splits the beach in half. (Brian MacKay/CBC - image credit)\n\nA long, quiet beach in the tiny community of Wards Brook, N.S., used to be a place locals would visit for calming walks and family gatherings, but in recent years it's become a source of discord and the root of sadness and frustration.\n\nOralee O'Byrne lived in a house next to Wards Brook Beach in her teenage years, and still lives nearby.\n\nShe said generations of her family have cherished the beach. She scattered her late son's ashes there. She's watched, mournfully, as the landscape has changed.\n\n\"It's been really painful, actually,\" said O'Byrne.\n\nFirst, someone built a causeway across the community's namesake brook and used it to bring in heavy machinery to change the brook's path.\n\nADVERTISEMENT\n\nWards Brook used to take a sharp turn at the top of the beach and meander along, parallel to the coastline, until it emptied into a small wetland. The redirection sent it across the beach and into the ocean – Greville Bay, to be specific, an appendage of the Bay of Fundy.\n\nNext, someone built a wall of armour rock in the brook's former path, intersecting with a right-of-way to the beach. Locals say it used to be possible to drive a vehicle across the brook, directly onto a large sand bar, but now access is limited to those who are capable of climbing down a pile of boulders.\n\n\"It just seems like it's taken a lot away from us … a lot of memories that still could be made aren't being made,\" O'Byrne said.\n\n\"We can't, we don't go to that beach anymore,\" she added.\n\nOralee O'Byrne has lived much of her life in Wards Brook, and says it's been painful to see the community's namesake brook and beach undergo man-made changes. (Taryn Grant/CBC)\n\nWhen the tide is out, the brook is narrow enough to walk or jump across, but when the tide is in, the new mouth of the brook is so wide that it makes a watery chasm in the middle of the beach.\n\nADVERTISEMENT\n\nIt isn't only the beach that's divided. The issue has caused a rift in the community.\n\nDara Bowser lives in the house where O'Byrne spent her youth, ever since he bought it from O'Byrne's mother several years ago. He blames two neighbouring property owners for the changes to the landscape.\n\n\"They don't talk to me,\" Bowser said. \"I don't talk to them.\"\n\nLooking for government action\n\nBowser and other locals who spoke to CBC News believe the changes to the brook and the beach were done illegally.\n\nThey point to regulations under the Environment Act that prohibit altering a watercourse without a permit, and prohibit interfering with the path of a watercourse until it's been dry for 40 years.\n\nThey want the provincial government to enforce the rules and to ensure that any possible remediation is carried out.\n\nADVERTISEMENT\n\nA spokesperson for the provincial department of environment said the case is \"an ongoing matter.\" They wouldn't make Environment Minister Tim Halman available for an interview or answer any questions.\n\nFor Bowser, it's been \"an ongoing matter,\" for far too long. He recalls the causeway being built in 2016, followed in 2019 with the brook's diversion and the construction of the rock wall.\n\nDara Bowser stands on Wards Brook Beach at low tide. He says the armour rock wall built by his neighbours is preventing the brook from returning to its original course. (Mark Crosby/CBC)\n\nHe's made repeated complaints to authorities and grown increasingly frustrated with the apparent lack of action.\n\nBowser has received several sets of documents about the case under freedom of information laws, which show provincial officials began issuing warnings in 2016 against using equipment and moving gravel on the beach.\n\nThey also show an investigation into the diversion of Wards Brook was underway in the spring of 2019. There was talk of the possibility of charges, but it's not clear whether any were laid.\n\nADVERTISEMENT\n\nA couple of months later, a conservation officer compiled notes describing an interview with a person who admitted to altering the path of the brook without a permit. The interviewee's name is redacted, but they're described as a resident of the area.\n\nThe documents also include records of an investigation into the rock wall, including talk of a potential violation of the Environment Act. In 2021, the province ordered the people who built it to move part of it back, out of the brook's original path.\n\nSome rocks were moved, but it didn't appease Bowser, who thinks that what remains still stands in the brook's way.\n\nBowser asked for an update in the spring of 2024, and was told in a letter from the department of environment that \"the responsible parties\" would be required \"to re-establish Wards Brook in its pre-disturbance location.\"\n\nThe letter said restoration work was expected to be completed by Sept. 30, 2024, but nearly 10 months later, no such work has taken place.\n\n\"They are not disclosing, they are not being transparent about this at all,\" said Bowser.\n\nThe cleared property on the left belongs to Dara Bowser. He accuses the owner of the cleared property on the right of diverting Wards Brook, and the owner of the white home in the centre of building the rock wall. (Brian MacKay/CBC)\n\nPat Mason, another Wards Brook resident, thinks it comes down to political priorities.\n\n\"When you're a small town, you really don't get noticed,\" he said.\n\nMason said he and his neighbours have looked for help from a multitude of officials at every level of government and are at a loss for what more they can do.\n\n\"It's just unfortunate that we have to go to this great length of getting things done,\" he said. \"I mean, something so simple can take so long.\"\n\nWhy'd they do it?\n\nAccording to the conservation officer's notes, the person who admitted to diverting the brook said they did it to improve beach access.\n\n\"[They] claimed that the brook that has always flowed over the beach access road was high (no culvert was ever put in the road). [They] wanted to create a better access road for the locals who go down the beach to enjoy,\" the officer wrote.\n\nIn a separate report, an Environment Department inspector said the rock wall was built to prevent erosion, which is a common practice on coastal properties in Nova Scotia.\n\nBowser suspects different motives. With the brook no longer bisecting the coastline, his two neighbours have clearer ocean access from their properties.\n\nCBC News made multiple attempts to reach the owners of both properties, but did not receive a response.\n\nWhy does it matter?\n\nNicolas Winkler, coastal adaptation co-ordinator at the Ecology Action Centre in Halifax, said conflicts between community members over coastal issues are common in Nova Scotia.\n\n\"They can be very visceral…. In some cases we've heard of near-violence happening. We've heard over the years on different coastal access stories of guns making an appearance,\" he said.\n\nWards Brook is a tiny community in Cumberland County made up of a couple dozen residences and a small shipbuilding museum. (Taryn Grant/CBC)\n\nWinkler said there is not a good mechanism for resolving these issues, and they often drag on for years. Wards Brook, he said, exemplifies this problem.\n\nWards Brook is a sleepy community made up of a couple dozen residences and a shipbuilding museum that's only open six months of the year. There are no signs leading to Wards Brook Beach; it's known and used primarily by locals.\n\nBut Winkler said this case goes beyond the immediate impact it has on a small number of locals. He said it's part of a broader issue of coastal stewardship and the importance of the ocean to Nova Scotia's economy and culture.\n\n\"As we chip away at coastal spaces and we lose that access, whether it's the physical access to the coast or whether it's the quality of the access … we are losing that sense of connection to the coast,\" he said.\n\nMORE TOP STORIES",
        "source": "Yahoo"
    },
    {
        "url": "https://ca.news.yahoo.com/canucks-real-drew-oconnor-dakota-210904317.html",
        "title": "Canucks: Who is the real Drew O'Connor? Dakota Joshua trade may provide answer",
        "publish_date": "2025-07-21T21:09:04Z",
        "category": "sports",
        "authors": [
            "Ben Kuzma"
        ],
        "text": "Is Drew O’Connor the new Dakota Joshua?\n\nThe Vancouver Canucks’ left-winger measures up in size, speed, smarts and willingness to engage. With Joshua dealt to the Toronto Maple Leafs on Thursday for a 2028 fourth-round draft choice — it adds $US3.25 million in salary-cap space for the pursuit of a support centre — opportunity now awaits O’Connor.\n\nHe could be a third-line fit because of lessons he learned from Sidney Crosby. The Pittsburgh Penguins are a shadow of their once dominant presence, but their captain always plays like he practises, which is very hard.\n\n“He’s so good at teaching you things on the ice with where he wants you to be,” O’Connor told Postmedia News. “He likes to play close in the offensive zone and move the puck really quickly, work the down-low game. He explains the little details, like how to grab pucks off the wall and tight turns that he’s really good at.\n\nADVERTISEMENT\n\n“It was awesome playing on a line with him because every time you come to the bench, he shows you different ways of learning new things.”\n\nDrew O’Connor of the Canucks goes on the offensive against Artturi Lehkonen of the Avalanche on April 10 in Denver.\n\nCrosby turns 38 on Aug. 7 and remains a bull-like centre who is difficult to defend off the rush, hard to contain along the walls and almost impossible to deny at the net. He’s built to hold his ground. For the undrafted O’Connor, it was a master class of top-flight tutelage.\n\n“You notice it going in practice against him,” laughed O’Connor, who is 6-foot-4 and 209 pounds, and should be able to win his battles. “It’s hard to get the puck off him. And the one thing I got from him is he tries to get better at one specific thing every off-season and has done it for a while.”\n\nThere is untapped potential in O’Connor, much like Joshua displayed in his 2023-24 breakout season. His 18 goals and 32 points plus a team-leading 244 hits, which ranked ninth overall in the NHL, earned a four-year contract extension that became a management problem last season.\n\nADVERTISEMENT\n\nJoshua’s testicular cancer diagnosis last summer and September surgery meant missing the first 14 games. Playing catch-up in the NHL is never easy, especially with physical and mental hurdles to clear. At age 29, he understandably lost his moxie and slumped to seven goals and 14 points in 57 games.\n\nSuddenly, that US$3.25 million in annual average value was perceived as an anchor. O’Connor is certainly more affordable following a two-year, US$5 million extension Feb. 18. But can he be more productive?\n\nO’Connor, 27, piqued the Canucks’ interest after 16 goals and 33 points in 2023-24 because he played hard for the struggling Penguins. He dipped to six goals and 16 points in 53 games last season before being dealt to the Canucks in a multiplayer swap on Feb. 1.\n\nO’Connor’s four goals and nine points in 31 games here in a season of transition didn’t produce that ‘wow’ factor, but his first impression was favourable. He was visible and effective in a 3-0 win over the Colorado Avalanche on Feb. 4 that left former Canucks head coach Rick Tocchet gushing.\n\n“I don’t want to overstate it, but (Filip) Chytil and (Drew) O’Connor with their speed and willingness to take the puck to the middle on a rush is a little breath of fresh air,” he stressed. “You see Chytil take the puck to the middle and that’s when things happen. Just adding those two guys has helped our rush game.\n\nADVERTISEMENT\n\n“We’re smiling. That’s the stuff we need.”\n\nCanucks winger Drew O’Connor sets a screen against Wild goaltender Filip Gustavsson on April 12 at Rogers Arena.\n\nFast-forward and the trade addition of Evander Kane on the left side makes the east Vancouver native a candidate to work with Elias Pettersson or Chytil. However, that depends on what pivot the Canucks do or don’t acquire in free agency or trade. If it’s a significant acquisition and Chytil slides down to the No. 3 hole, O’Connor won’t complain.\n\nConor Garland gave Chytil, who was shut down in March after a brutal hit and placed in concussion protocol, quite the initial compliment on his effectiveness.\n\n“Fantastic speed, sees the ice well, makes a lot of plays,” said Garland. “A real good pickup. Good zone entries and drive. He’s a winger’s dream.”\n\nAs for O’Connor, the dream was to live up to his own hopes, which once seemed like a stretch for the Chatham, N.J., product.\n\nADVERTISEMENT\n\nHe was 5-foot-10 in Grade 12 and didn’t initially attract collegiate interest. It was demoralizing but he pressed on. A growth spurt to 6-foot-3 when he arrived at Dartmouth College in the East Coast Athletic Conference made a difference. So did a dedication to diet and fitness.\n\n“I’ve had a lot of stretches where things weren’t going well and high school was a real struggle for me,” admitted O’Connor. “I was always one of the better players growing up, but when I got to that point in high school, I was really kind of fading and dropping off.\n\n“But I was a late bloomer. I was able to overcome and eventually get my way into college hockey because that was my goal growing up. I just learned how to deal with it all.”\n\nSweden’s William Karlsson shoots by American Drew O’Connor during the semifinals at the world hockey championships in Stockholm on May 24.\n\nbkuzma@postmedia.com",
        "source": "Yahoo"
    },
    {
        "url": "https://ca.news.yahoo.com/heart-attack-patient-waits-13-090000364.html",
        "title": "Heart attack patient waits 13 hours in Moncton Hospital ER",
        "publish_date": "2025-07-21T09:00:00Z",
        "category": "lifestyle",
        "authors": [],
        "text": "Jonah Imeson, 35, says he was having a heart attack at the Moncton Hospital but could not get past the ER waiting room, to be seen by a physician, for 12 hours. (submitted by Jonah Imeson - image credit)\n\nJonah Imeson says he'd heard plenty of stories about people waiting for hours in New Brunswick's emergency rooms and even dying before being seen by a physician, but then he had his own scare and he's still shaken.\n\nThe 35-year-old graphic designer, with Type 2 diabetes, said he waited 13 hours at the Moncton Hospital ER with chest discomfort, arm pain, nausea, high blood pressure and a sensation like heartburn before he was seen by a doctor, who told him he'd likely had a heart attack and could have died.\n\nImeson's story puts a face to the untold number of patients in New Brunswick who wait far too long in a hospital system that has openly declared a critical state of over-capacity.\n\nAnd although the Moncton Hospital has been left out of a new protocol demanding some hospital patients be fast-tracked into nursing homes — to help free up beds, including those in ERs — Horizon's dashboard paints a troubling picture.\n\nADVERTISEMENT\n\nIt shows wait times in the Moncton Hospital ER, from triage to assessment by a physician, reached 400 minutes (6.6 hours) in June — the highest since April 2022 and well above the national target of 30.\n\nThat makes Imeson a remarkable outlier in a system already under-performing by a significant margin.\n\nBonnie Matchett of the Horizon Health Network confirmed that a high volume of patients in the Moncton Health ER on June 4 had 'high acuity\" or urgent medical needs. (Guy LeBlanc/Radio-Canada)\n\nFrom 3 p.m. on June 4 until 4 a.m. the next day, he waited in a room so full, he lost his seat a few times after getting up to vomit and when he went to call his mother.\n\n\"You always hear stories, then it actually happens to you,\" he said of his ER experience.\n\nTime-stamped text messages tell wait-time story\n\nImeson was able to reconstruct it from the text messages he sent home to his wife and to his parents in Oromocto. He didn't ask them to come to the hospital, he said, because he was concerned about his wife, who had to work the next day, and didn't want to trouble his mother or father.\n\nADVERTISEMENT\n\nThe experience began at 1 p.m., when he was scheduled to see his dietitian on the hospital campus. He reported chest discomfort and a numb sensation in his arm.\n\nThe dietitian took his blood pressure, and when she got a reading of 210/119, she walked him to the ER herself.\n\nAt the triage station, Imeson reported that his own father had had a heart attack at 49 and that diabetes ran in the family.\n\nImeson was registered shortly after 3 p.m., then sat down to wait.\n\nWATCH | Why a Moncton man fears going to the hospital again:\n\n\"While I was there, I started sweating profusely,\" he said. \"I had to go to the bathroom a few times and vomit.\"\n\nAs the hours ticked by, Imeson updated his mother by text:\n\n4:11 p.m. \"168 over 107 pulse is 95.\"\n\n5:13 p.m. \"151 over 92. They gave me some Tylenol\"\n\nADVERTISEMENT\n\n6:44 p.m. \"147 over 78 pulse is 76 I just had to run and throw up again.\"\n\n7:48 p.m. \"148/78 pulse is 76. This heartburn feeling is weird.\"\n\n9:05 p.m. \"153 over 12 pulse 97 *112\"\n\n11:11 p.m. \"160 over 94 pulse 90. room's filled\"\n\nAs midnight approached, Imeson thought about leaving the hospital, walking down the street and calling an ambulance.\n\n\"To see if that might rush me in more,\" he said. \"I guess a part of me never would have done that, but it definitely crossed my mind.\"\n\nJonah Imeson stayed in touch with his family all through the night by texts. Every time his blood pressure was taken, he relayed the results, providing a record of the hours he passed waiting in the emergency department (submitted by Jonah Imeson)\n\nHis mother texted him encouragement, told him to stay and that a doctor would likely see him soon.\n\nShortly after 4 a.m., Imeson saw a physician and was given an electrocardiogram.\n\nIt was the first time he heard from a doctor that he might have had a heart attack. More tests ensued.\n\nADVERTISEMENT\n\n\"They did the ultrasound and they had mentioned that it appears the bottom section of my heart was damaged.\"\n\nOn June 6, Imeson was sent by ambulance to the heart centre at the Saint John Regional Hospital, where he underwent more examinations.\n\nImeson says his diabetes health counsellor walked him over to the ER after taking his blood pressure. He was registered and seated shortly after 3 p.m. (submitted by Jonah Imeson)\n\n\"When I went to Saint John and they did the ink dye test, it became more apparent what the situation was with that blocked artery. So that's why … it appeared damaged, because that artery was blocked.\"\n\nLater that day, an ambulance returned Imeson to the Moncton Hospital, and he was discharged June 8.\n\nOn Monday, June 16, he returned to work, while taking medication.\n\nOnce he had his \"foot in the door\" and could speak to doctors, he said, his care was excellent.\n\nCardiologist Dr. Zeeshan Ahmed says cardiac risk factors include high blood pressure, cholesterol, diabetes, smoking and family history of premature heart disease. (Dragana Gordic/Shutterstock)\n\nCardiologists say heart attacks need immediate attention\n\nCBC News contacted Dr. Zeeshan Ahmed, a cardiologist at the University of Ottawa Heart Institute and an assistant professor of medicine at the University of Ottawa, for a better understanding of what happens when a heart attack occurs.\n\nHe was not asked to diagnose Imeson or comment on his care.\n\nAhmed said heart attacks are caused by the gradual buildup of plaque in the artery and the sudden rupture of that plaque, which then blocks the artery.\n\nImeson says the emergency room was full most of the afternoon and late into the night, and if he got up to go to the bathroom or to call his family, he sometimes lost his seat. (submitted by Jonah Imeson)\n\n\"And when that specific artery becomes blocked, the portion of the heart muscle it's supplying will have a lack of blood supply, and as a consequence those muscles will start to die,\" he said.\n\nIdeally, patients presenting with heart attack symptoms would receive an electrocardiogram test within 15 minutes of arrival at the hospital.\n\n\"Someone presents with chest pain, immediately, an ECG within 10 to 15 minutes, and then the physician has to read it,\" Ahmed said.\n\nAn ECG is a simple test, where a lead is attached to the patient's chest and the doctor looks at the electricity the heart generates, which helps a diagnosis.\n\nAhmed said chest pain happens when the artery is partially blocked or blocked completely, and it's important for patients who do feel severe chest pain to get medical attention as soon as possible.\n\n\"The longer they wait, the heart muscle that is not being supplied by blood will eventually die,\" he said. \"And as it dies, it will start to scar.\"\n\n\"I urge people to come to the hospital. Don't sit on the symptoms. Don't delay, especially if there are risk factors like a family history of heart disease, high blood pressure, cholesterol, diabetes, or a history of smoking.\"\n\nAhmed said symptoms include a sensation of chest tightness or discomfort, a feeling the pain or tightness is travelling down one arm or both arms or up to the jaw. Patients may also have sudden sweating or shortness of breath. They might feel lightheaded or nauseous. They might also feel pain in their upper stomach.\n\nHorizon's dashboard shows the average wait time for level 3 acuity patients — patients who are considered medium urgency and who represent the most common patients in the ER — is running 400 minutes at the Moncton Hospital. That's the time from triage to physician assessment. The national benchmark is 30 minutes. (Horizon)\n\nHorizon Health said it could not comment on Imeson's file for privacy reasons, but provided a written statement from Bonnie Matchett, the network's clinical director of emergency and critical care.\n\n\"We can confirm a high volume of patients were experiencing high acuity medical needs in Horizon's The Moncton Hospital (TMH) Emergency Department (ED) on this date,\" Matchett wrote.\n\nShe said Horizon wants a \"positive patient experience,\" and people concerned about the care they've received should communicate with a Horizon patient representative.\n\nImeson said he's not sure he'll go to the patient advocate. He's focused on recovery.\n\nHe is also reflecting on what he might have done to get seen more quickly — or whether causing any fuss would have been proper.\n\n\"I just assumed they were doing the best with what they had and I just stuck through to the end,\" he said.\n\n\"But I was concerned if I made a scene, would they ask me to leave? And would it even have been fair for me to do that to them they were as busy as they were.\"",
        "source": "Yahoo"
    },
    {
        "url": "https://ca.news.yahoo.com/pandemic-drove-inflation-come-years-112338597.html",
        "title": "The pandemic drove up inflation. How come, years later, we're still paying more?",
        "publish_date": "2025-07-21T11:23:38Z",
        "category": "finance",
        "authors": [
            "Simon Tuck"
        ],
        "text": "The pandemic drove up inflation. How come, years later, we're still paying more?\n\nWhat happened to those “short-term” price increases from the pandemic?\n\nFrom 2021 to 2023, Canadians were told that prices jumped largely because of supply-chain bottlenecks, government spending on income supports and other pandemic-related issues.\n\nIf so, shouldn’t those temporary increases have disappeared once the pandemic subsided and those glitches were repaired?\n\nWhile inflation may have since been tamed, Statistics Canada’s monthly inflation figures show that the pandemic-era price hikes survived.\n\nAre consumers getting ripped off by not seeing prices slide back again?\n\nUnder typical circumstances, we would have seen some inflation, likely within the Bank of Canada’s “normal” band of between one and three per cent a year, even without the pandemic. Instead, the Consumer Price Index saw the annual rate jolt to 3.4 per cent in 2021, soar to 6.8 per cent in 2022, and load another nearly four per cent onto prices in 2023. That additional inflation that was supposed to be because of the impacts of COVID-19.\n\nADVERTISEMENT\n\nYet, more than five years after the deadly virus started to spread, and two years after the pandemic was declared over, we seem to still be paying for those price hikes. To find out why, National Post asked economists to shed some light on what happened to that “temporary” inflation and why we’re still paying for it.\n\nSome blame corporate greed. Others, a lack of competition in some markets. Or are there other economic trends at work that suggest that consumers aren’t actually being ripped off at all?\n\nWhat happened to consumer prices during the pandemic?\n\nAccording to Statistics Canada’s Consumer Price Index (CPI), prices rose 11.4 per cent between January 2020 and December 2022.\n\nBut that wasn’t an immediate response to the pandemic. Inflation didn’t spike for more than a year after the start of the pandemic. In fact, prices were rising at relatively normal and modest rates until May 2021, about 16 months after the first case of COVID-19 was reported in Canada, and didn’t peak until June 2022, at 8.1 per cent, the highest rate in almost four decades.\n\nADVERTISEMENT\n\n(The pandemic started in China in December 2019 and a pandemic was declared in Canada on March 11, 2020.)\n\nGasoline was among the products hit hardest by inflation, with a price increase of more than 50 per cent over that two-year period. Food and transportation jumped between 15 and 20 per cent, while appliances and rent each increased by between 10 and 15 per cent.\n\nWhat caused inflation during the pandemic?\n\nPrices at any time are, in general terms, a function of supply and demand. In short, the pandemic caused both simultaneous supply shocks and increased consumer demand.\n\nBarring innovation that leads to productivity improvements and lower costs, that formula will almost always mean price hikes.\n\nOn the supply side, some products were being produced less or not at all due to factories being closed or experiencing reduced hours, particularly in Asia. There were also shortages of some raw materials, such as lumber and metals, which also contributed to inflation.\n\nADVERTISEMENT\n\nAnd costs for many suppliers went up because transportation became more expensive due to shipping delays, congestion at many ports and the rising cost of fuel, which affects the prices of most products.\n\nThere were also supply problems that had little or nothing to do with the pandemic.\n\nRussia invaded Ukraine in early 2022, reducing the global supply of energy products, fertilizer and some grains.\n\nSome important agricultural areas also suffered from poor weather. In 2021, Western Canadian farmers were hit with the worst drought in 19 years, leading to wheat stocks to drop 38.7 per cent compared to the previous year. By April 2022, food manufacturers were paying more than double for wheat than they had been paying just two years earlier.\n\nAnd as usual, those costs were borne by consumers. According to Statistics Canada, consumers had to spend considerably more on bread (+12.2 per cent), pasta (+19.6 per cent) and cereals (+13.9 per cent) than they had a year earlier.\n\nADVERTISEMENT\n\nOn the demand side, consumers’ lives had changed because many started working from home, going out less and not travelling. That meant they were unintentionally saving money. Lower interest rates and billions of dollars in government support programs also put more money into consumers’ pockets.\n\nSome employees, meanwhile, were getting fatter paycheques because there was greater demand for their services. Health care workers were pulling overtime shifts, for example. Also, as people adjusted to staying at home and renovated or bought new houses, construction workers were in high demand.\n\nAs consumers responded to the shapes of their new lives there was increased demand for real estate, furniture, exercise equipment and home entertainment gadgets .\n\nDemand, and the upward pressure on inflation, was also fuelled by government spending.\n\nA new report from the C.D. Howe Institute concluded that the Trudeau government’s spending splurges played a major role in fuelling inflation during the pandemic. The report pointed the finger at Ottawa’s unfunded spending spree — more than the Bank of Canada’s monetary policies — that acted as “helicopter drops” of money for the private sector.\n\nIn 2020, about 20.7 million Canadians out of an adult population of 30.3 million received income from one of the federal pandemic-related programs, according to a 2022 report. During that year alone, the programs are estimated to have cost $270 billion — about 12.5 per cent of Canada’s gross domestic product (GDP) — and cumulatively have cost about $360 billion to date.\n\nWhile the programs broadly succeeded in providing relief to individuals and businesses and creating a cushion for the economy during a crisis, the C.D. Howe Institute noted that injecting that much extra money into an economy while unemployment is low results in inflation.\n\nDavid Andolfatto, chair of the department of economics at the University of Miami and an international fellow at the C.D. Howe Institute, said inflation should be expected when governments add that much extra demand to the economy. “Of course prices went up,” he said. “There’s no such thing as a free lunch. Somebody will have to pay.”\n\nAnd not only do consumers pay higher prices but they must then pay again with the higher interest rates the central bank then implemented to try bringing those prices back down. In 2020, interest rates were down to 0.25 per cent as the Bank of Canada aimed to cushion the blow from the pandemic; by 2023, the rate had risen 20-fold, to five per cent.\n\nJean-Francois Perrault, chief economist at the Bank of Nova Scotia, estimated in a November 2023 report that government spending and pandemic-era transfers to Canadians were responsible for about 42 per cent (200 of the 475 basis points) of the increase in the Bank of Canada’s prime interest rate during that period. About one-third of those interest rate hikes can be traced back to provincial governments, he calculated.\n\n“Our results suggest that fiscal policy at all levels of government has been badly miscalibrated,” the report concluded.\n\nHow much have prices gone up since the pandemic?\n\nSince the start of 2023, inflation has remained at less than four per cent, just over the Bank of Canada’s preferred band of between one and three per cent, but a big decrease from the peak of pandemic-era inflation.\n\nAnd, at least for now, it’s largely under control. Statistics Canada reported last week that Canada’s inflation rate accelerated to 1.9 per cent in June, up from 1.7 per cent the previous month.\n\nWhy have some prices kept rising since the pandemic?\n\nWhen the pandemic subsided, it removed a number of shocks and disruptions to markets. But not all of them.\n\nThe Russian invasion of Ukraine, for example, still hasn’t been resolved. Many of the people who started working from home during the pandemic still do so, either part-time or full-time, which puts a little more money in most of their pockets. The glut of baby boomers is also at the stage of life where many are retiring, having saved up their money, and now want to spend it.\n\nKatherine Judge, senior economist at CIBC Capital Markets said consumer markets are also still getting a boost from pent-up demand and extra savings that consumers accumulated during the pandemic.\n\nWages, meanwhile, have actually been growing faster than inflation since mid-2024, so household purchasing power has also increased.\n\nIn recent months, the tariff wars launched by U.S. President Donald Trump have started to put upward pressure on inflation in both components and finished goods and will continue to do so unless they are resolved.\n\nEconomists say that prices don’t normally drop — or even approach inflation of less than one per cent — unless demand falls because the economy is in a recession or governments adopt severe cost-cutting measures.\n\nNeither has happened since the pandemic. The federal government kept running large deficits in spending. And while it has spoken recently about cutting costs in the bureaucracy, it also plans to boost outlays on defence and infrastructure projects.\n\nAs poor weather played a role in fuelling inflation during the pandemic, it’s still a major factor.\n\nA new study by a team of international scientists led by Maximillian Kotz, a postdoctoral fellow at the Barcelona Supercomputing Center, found that foods affected by heat, drought, floods and other climatic extremes contributed directly to higher consumer prices.\n\nThis summer, for example, farmers in southwestern Saskatchewan have been hit by wildfires, heat waves and drought, driving up prices in the wheat market. But weather isn’t just affecting the Canadian Prairies.\n\nSevere weather events are also causing higher prices for Japanese rice and Spanish olive oil. In a phenomenon dubbed “heatflation,” the report also documents that South Korean cabbage prices rose 70 per cent last year after a period of hot weather and drought, and that seafood prices increased because rising water temperatures has meant fishermen have had smaller catches.\n\nWill prices even come down again from the pandemic inflation?\n\nIs there a chance that some of the pandemic spike in prices could still be eliminated if the world enjoys a period of relative peace, with no disruptive shocks?\n\nAndolfatto, at the University of Miami, said prices could in theory still come down in some markets, but that would be a function of changes in supply and demand at that time, not anything to do with what occurred during the pandemic.\n\nBut that’s unlikely to happen in Canada in the near term, Andolfatto said, because governments haven’t taken steps to reduce the extra demand in the economy.\n\nBut are corporations keeping prices artificially high?\n\nMany economists say they don’t believe that consumers, in broad terms, are being cheated. There may be some Canadian markets, such as banking, airlines or telecommunications services, where there are worries over a lack of competition. But in the markets that people usually point to when they think about inflation, groceries in particular, competition is robust. And the prices are, as is usually the case, largely a function of supply and demand.\n\n“I’m not going to blame corporate greed for this phenomenon,” said Andolfatto. “Corporate greed was there before.”\n\nNational Post\n\nstuck@postmedia.com\n\nOur website is the place for the latest breaking news, exclusive scoops, longreads and provocative commentary. Please bookmark nationalpost.com and sign up for our politics newsletter, First Reading, here.",
        "source": "Yahoo"
    },
    {
        "url": "https://ca.news.yahoo.com/ndp-government-reviewing-18m-manitoba-100049197.html",
        "title": "NDP government reviewing $18M Manitoba rail port grant PCs made before 2023 election",
        "publish_date": "2025-07-21T10:00:49Z",
        "category": "finance",
        "authors": [],
        "text": "NDP Finance Minister Adrien Sala said his government is reviewing an $18-million grant issued by the former PC government, with no announcement, one week before the 2023 election. (Travis Golby/CBC - image credit)\n\nManitoba's finance minister says the province is reviewing what he called a \"mysterious\" decision by the former Progressive Conservative government to give $18 million to a company planning to develop a rail port south of Winnipeg, without any public disclosure, only five weeks before the last provincial election.\n\nOn Aug. 29, 2023, Heather Stefanson's PC government issued the $18-million grant to JohnQ Public Inc., a company owned by 12 rural Manitoba municipalities, to develop a regional rail port in the rural municipality of Ritchot.\n\nThe cash was intended to allow JohnQ to purchase land west of Highway 75 for the rail park, and conduct engineering and environmental assessments, according to the province.\n\nThe Stefanson government did not issue a press release about the grant. One week later, the then premier kicked off the campaign period for the October election, which the PCs lost to Wab Kinew's NDP.\n\nADVERTISEMENT\n\n\"That's kind of mysterious, when a government sends $18 million out the door,\" NDP Finance Minister Adrien Sala said in a Thursday interview in his office.\n\n\"It is extremely unusual to issue a grant of that magnitude without communicating anything to Manitobans.\"\n\nThe 2023 election period began when then premier Heather Stefanson, right, visited the office of Lt.-Gov. Anita Neville on Sept. 5, one week after her government issued the $18-million grant to JohnQ Public Inc., a company owned by 12 rural Manitoba municipalities. (Bartley Kives/CBC)\n\nSeveral provincial departments are now trying to answer questions about the grant for the rail port, Sala said, which could require the construction of a new overpass on Highway 75, as well as a ring dike around the project to protect it from a one-in-200-year Red River flood.\n\nHe also compared the grant to Stefanson government efforts to approve a silica sand mine licence during what's referred to as the caretaker period — after the PCs lost the election, but before the NDP assumed office.\n\nADVERTISEMENT\n\n\"We need transparency when it comes to decision making. Manitobans deserve to know how that $18 million was spent, and we're going to get some answers,\" said Sala.\n\n'Fishing expedition': Tories\n\nHe did not say why the province is asking questions about the project now. Weeks after the 2023 election, Jamie Moses — the NDP minister for business, mining, trade and job creation — said the province was reviewing economic development projects that he said did not receive proper scrutiny by the former PC government.\n\nSala said the review is sparked by the size of the grant, the lack of public disclosure and questions about what the province will receive in exchange for the $18 million.\n\n\"The issue here is that we have no clarity over what that prospective return is, and when you pair that with the lack of transparency over how this went down, that's a concern,\" he said.\n\nADVERTISEMENT\n\nJohnQ Public is already under NDP government scrutiny. In April, the Kinew government asked Manitoba's auditor general to review a $100-million daycare construction program, initiated by the former PC government.\n\nThe NDP government has asked Manitoba's auditor general to review a $100-million daycare construction program, initiated by the former PC government and project managed by JohnQ. Tory MLA Wayne Ewasko says his government provided funding for 'hundreds of desperately needed child care spaces and other projects in the capital region.' (Randall McKenzie/CBC)\n\nJohnQ project managed that with the help of Boom Done Next, a company co-owned by Marni Larkin, the director of the PCs' 2023 re-election campaign.\n\nIn a statement, the now Opposition PCs said they welcome the results of any scrutiny of the JohnQ Public rail port grant.\n\n\"The NDP's current fascination with JohnQ Public is nothing more than a fishing expedition,\" said Wayne Ewasko, the Tory MLA for Lac du Bonnet.\n\n\"Our PC government, along with the federal Liberal government, provided funding for hundreds of desperately needed child care spaces and other projects in the capital region.\"\n\nADVERTISEMENT\n\nAnnouncement 'on the horizon': JohnQ CEO\n\nBut the finance minister also said it's unclear what else the province will have to pay for to allow the rail port to proceed.\n\n\"There's potential need for a new ring dike. There is a new need for an overpass. These are things that can be in the range of hundreds of millions of dollars,\" said Sala.\n\n\"As we look at the decision that was made here, we have to understand what the implications are.\"\n\nA progress report prepared by JohnQ Public for the NDP government in July 2024 stated the company was negotiating an agreement with Burlington Northern Santa Fe Railway, also known as BNSF, to serve as an anchor tenant and rail operator at the new rail port.\n\nJohnQ Public plans to build a rail port on what's now agricultural land west of Highway 75 in the rural municipality of Ritchot, south of Winnipeg. (Rudi Pawlychyn/CBC)\n\nBNSF, which operates a north-south rail line that terminates in Winnipeg, did not respond to a CBC News request for comment.\n\nColleen Sklar, John Q Public's CEO, said Thursday in a statement she can't discuss the proposed Ritchot project because all the parties involved \"remain under a non-disclosure agreement.\"\n\nSklar said \"a significant announcement is on the horizon\" that \"represents a transformative investment and an exciting new chapter for our region.\"\n\nShe did not respond to a subsequent request for comment on Sala's statements about the grant.\n\nJohn Q Public board chair Brad Erb, who is also the reeve of the RM of Macdonald, said he was not available for comment on Friday.\n\nCentrePort, an existing multi-modal trade area that straddles the border between Winnipeg and the RM of Rosser, also includes a 270-hectare rail park that is in the process of being developed.\n\nCentrePort CEO Carly Edmundson declined to comment on the public funding for the Ritchot project or how it would affect CentrePort.\n\nKen Mulligan, the reeve of the RM of Rosser, said there are a number of projects that aim to capitalize on Manitoba's transportation connectivity and central location.\n\n\"With the growth and success of CentrePort being recognized across the country, as well as the focus on trade, it makes sense that many are thinking about their growth strategies,\" Mulligan said in a statement.\n\nSala's office said if the Ritchot rail port does not proceed, there are provisions in the funding agreement that allow the province to demand JohnQ Public transfer the title of the properties it bought to the province or a third party.",
        "source": "Yahoo"
    },
    {
        "url": "https://ca.news.yahoo.com/exclusive-leaked-audio-cbc-disciplinary-133636363.html",
        "title": "EXCLUSIVE: Leaked audio of CBC disciplinary meeting with former TV host Travis Dhanraj",
        "publish_date": "2025-07-21T13:36:36Z",
        "category": "finance",
        "authors": [
            "Adrian Humphreys"
        ],
        "text": "A leaked audio recording of an internal CBC disciplinary meeting for a national news anchor reveals the public broadcaster’s tension over its policies on journalistic standards and freedom clashing with protecting its corporate image.\n\nTravis Dhanraj, once the host of a CBC television news show called Canada Tonight with Travis Dhanraj, resigned earlier this month with fiery letters accusing the CBC of “tokenism masquerading as diversity, problematic political coverage protocols, and the erosion of editorial independence.”\n\nHis letters, one to CBC leadership and another to CBC colleagues, were made public and created controversy, including over perceived political imbalance in news coverage at the publicly funded broadcaster. Last week, Conservative Members of Parliament called for a public hearing into Dhanraj’s “damning allegations” on workplace culture and biased reporting.\n\nADVERTISEMENT\n\nCBC has denied Dhanraj’s criticisms made in his letters.\n\nMore than a year before his still reverberating resignation, however, a disciplinary meeting for Dhanraj was convened by CBC shortly after he made a social media post on April 19, 2024. His post on X said: “At a time when the public broadcaster is under increasing scrutiny and when transparency is needed,” CBC’s president Catherine Tait had been asked to appear on his show. “We wanted to discuss new budget funding, what it means for jobs & the corporation’s strategic priorities ahead. Our request was declined. This is unfortunate.”\n\nThe disciplinary meeting preceded his removal from on-air duties for the CBC News Network show that bore his name.\n\nDhanraj declined to comment on the recording or the meeting, referring questions to his lawyer, Kathryn Marshall. Marshall confirmed the recording National Post has is an authentic portion of a longer disciplinary meeting between Dhanraj and CBC officials.\n\nADVERTISEMENT\n\nCBC did not dispute the disciplinary meeting or recording.\n\nThe CBC manager speaking in the recording is identified as Andree Lau, senior director of digital publishing and streaming. Lau’s LinkedIn page describes her job as overseeing the strategic and editorial direction of CBC News Network as well as other CBC news properties.\n\nIn the recording she appears to equate a CBC journalist reporting something critical about the CBC with a potential breach of journalistic conflict of interest ethics, on the grounds that a CBC journalist has a personal stake in the broadcaster’s success.\n\nThe recording excerpt begins with Dhanraj explaining the circumstances of his post about Tait.\n\n“The new budget funding was publicly put out in the budget on Tuesday. It was widely reported on, by not only CBC but other broadcasters. There is nothing in the tweet that is insider information,” Dhanraj says.\n\nADVERTISEMENT\n\nLau replies: “With exception of a unionized employee criticizing their employer; that is an employee who has a personal stake in the matter whose job is part of it…. The issue is, you know, does this post meet the standards of integrity, does it meet the conflict of interest under code of conduct.”\n\nDhanraj says: “I firmly stand by the fact that it does.”\n\nAsks Lau: “Do you understand the concern with this post as it relates to the principle of integrity?”\n\nDhanraj: “No, I really don’t. I don’t, and again, Andree, I find it problematic that we are in a meeting where we are discussing something that is in the interests of the corporation. So, I, I’m not seeing the separation right now between the journalism and the interest of the corporation. I see how it would be in the interest of the corporation for this tweet not to be out, but I don’t see how, journalistically, it’s not sound…”\n\nAn unidentified union representative then asks for context on how the appearance request to Tait came about. “I didn’t watch the show that night,” he says.\n\nADVERTISEMENT\n\n“We had an editorial discussion,” Dhanraj says, “as to whether or not now was the correct time, since there was a development, a significant development with the release of the federal budget and the new money, to put a request in for Catherine Tait. We had been discussing putting a request in for some time and we thought there was a news hook to it because of the new development….”\n\nI find it problematic that we are in a meeting where we are discussing something that is in the interests of the corporation\n\nLau: “… What is your understanding of the protocol and considerations when CBC journalists are covering the CBC?”\n\n“It, it’s the J.S.P. statement again,” Dhanraj says, likely referencing CBC’s Journalistic Standards and Practices.\n\n“Clear editorial separation,” Lau says.\n\nDhanraj: “So those who have the interest of the corporation should not be influencing reporters.”\n\nLau: “Yes.”\n\nDhanraj: “And if that is happening, well, that kind of goes against some core fundamentals of the public broadcaster.”\n\nLau then says there are other aspects of the JSP involved. In a sentence in which some words are unclear on the recording, she says “the principle of integrity and the perception of who has a stake in the matter,” finishing with “perceived impartiality because, as I mentioned, you are an employee, and you are criticizing your employer.”\n\nThe Post does not have a recording of the entire meeting.\n\nChuck Thompson, CBC’s head of public affairs, said the meeting was about more than just Dhanraj’s social media post, for which Dhanraj was “never formally disciplined for.”\n\n“The discussions in April with Mr. Dhanraj were about a range of issues outside the tweet; there was a particular emphasis on CBC News policies about conflicts of interest, violations of journalistic standards and protocols on how we report on ourselves.\n\n“Mr. Dhanraj violated these policies and was asked about them by his manager with his union representative present. He also secretly recorded the meeting after agreeing not to,” Thompson said.\n\nLau could not be reached for comment prior to publication. An email sent to her on Friday was returned with an automated out of office message; a detailed message to her cell phone was not responded to. A CBC official had said they would alert Lau to the Post’s request.\n\nMarshall, Dhanraj’s lawyer, said what is heard in the recording is “disturbing.”\n\n“It shows that Travis was intimidated for simply doing his job as a journalist. He was hauled into a meeting with human resources, his boss, and the union. The purpose of the meeting, I think, was to intimidate him, scare him and pressure him, making it clear to him that he’s not to do that, that he is not to post anything or say anything as a journalist that could be embarrassing to the public broadcaster,” Marshall said.\n\n“This is deeply concerning. I think it demonstrates that CBC, in that moment, was far more interested in preserving its own reputation than allowing their journalists to do their jobs.”\n\n“It shows that the CBC corporation has a disturbing level of control over their journalists and is involved in the types of stories that the journalists are covering or not covering. I think that speaks to significant concerns of bias and a lack of objectivity within the corporation.”\n\nThompson said late Friday that Dhanraj is still a CBC employee although currently on leave.\n\nMarshall said CBC has still not accepted Dhanraj’s resignation despite him voicing his clear intent and, in fact, are still paying him.\n\n“I want to be very clear: The CBC doesn’t get to hold him hostage. This is a free country. He’s allowed to resign.”\n\nMarshall said Dhanraj is pressing a human rights lawsuit against CBC over his departure.\n\n• Email: ahumphreys@postmedia.com | X: AD_Humphreys\n\nOur website is the place for the latest breaking news, exclusive scoops, longreads and provocative commentary. Please bookmark nationalpost.com and sign up for our daily newsletter, Posted, here.",
        "source": "Yahoo"
    },
    {
        "url": "https://ca.news.yahoo.com/varcoe-carney-government-needs-quick-070007692.html",
        "title": "Varcoe: Carney government needs 'quick wins' from energy projects and to address internal challenges on Bill C-5, says new report",
        "publish_date": "2025-07-21T07:00:07Z",
        "category": "finance",
        "authors": [
            "Chris Varcoe",
            "Calgary Herald"
        ],
        "text": "Varcoe: Carney government needs 'quick wins' from energy projects and to address internal challenges on Bill C-5, says new report\n\nThe Carney government needs to put some “quick wins” under its belt and advance major energy projects of national importance, but also address challenges created by “compressed timelines” under its new Bill C-5 and deepen Indigenous engagement, says a new report.\n\nA white paper by members of the Expert Group on Canada-U.S. Relations says significant energy sector proposals should be high on Ottawa’s major projects list, including oil and gas developments, nuclear, hydrogen and renewable infrastructure.\n\nBill C-5 was passed by the Carney government in June and aims to fast-track initiatives deemed to be in the national interest, such as ports, critical mineral developments, economic corridors and liquified natural gas (LNG) terminals.\n\nThe next six months will be critical for the legislation’s success and the federal cabinet should designate “low-risk, high-impact” priority projects to expedite through the approval process, says the study, to be released Monday.\n\nADVERTISEMENT\n\n“Ultimately, it will be crucial to achieve some early successes to establish support for the process and maintain momentum. The government will also need to quickly develop a couple of projects that have the potential to be quick wins,” it states.\n\n“Bill C-5 marks a potential turning point in Canada’s approach to nation-building projects . . .\n\n“With discipline, focus, and genuine Indigenous partnerships, Canada can seize this moment to deliver over $100 billion in investment, 50,000-plus jobs, and a resilient, cleaner energy future.”\n\nRelated\n\nThe bill was adopted as Canada faces tariffs from the U.S. administration, which has sparked a renewed focus on increasing this country’s ability to increase its exports with other nations, as well as attract more investment.\n\nADVERTISEMENT\n\nAlberta Premier Danielle Smith and oilpatch leaders want to see ambitious new energy projects included on the federal list, including an oil pipeline to the Pacific Coast and new LNG export facilities.\n\n“For too long, we’ve been a country of builders that can’t get anything built, and we have acted ashamed of our own resource inheritance at a time when the world is desperate for what we can produce,” said Perrin Beatty, co-chair of the group and former CEO of the Canadian Chamber of Commerce.\n\n“This is an existential moment for Canada where we have both an opportunity and an obligation to become both more prosperous and more sovereign.”\n\nHon. Perrin Beatty, President and CEO of the Canadian Chamber of Commerce, chats with Postmedia during the 2022 Global Business Forum in Banff, Alta. on Friday, Sept. 23.\n\nPrime Minister Mark Carney told the Calgary Herald recently it is “highly likely” an oil pipeline to the Pacific Coast will be included on the federal list, although he said it will be up to private sector proponents to drive any proposal.\n\nADVERTISEMENT\n\nThe report calls Bill C-5 a “welcome transformative step” as it will allow Ottawa to streamline the authorization of major projects and approve them within two years, co-ordinated by a single federal office. It will also help meet the growing need for energy in the world.\n\n“There is low-hanging fruit. Some things are ready to go . . . Time is ticking,” report co-author Heather Exner-Pirot said in an interview.\n\n“Let’s start seeing some action. Let’s start seeing some projects.”\n\nIf the changes under Bill C-5 had been in place for three energy projects that were completed earlier this decade — the Trans Mountain expansion, LNG Canada and the Coastal GasLink pipeline — it would have been valuable, but led to a “relatively modest” average time savings of 1.5 years, the study notes.\n\nThese findings highlight the need to address challenges early in the development of a major project, it states.\n\nADVERTISEMENT\n\nProjects that should be on the list and can move quickly include the Ksi Lisims LNG project on the northwest B.C. coast, a second phase of LNG Canada, and steps to boost the capacity of Trans Mountain, said Exner-Pirot, who is also director of natural resources, energy and environment at the Macdonald-Laurier Institute.\n\nHeather Exner-Pirot of the Macdonald-Laurier Institute.\n\nHowever, the bill has sparked some criticism about the impact of speeding up the approval process, and Carney met with First Nations leaders last week and heard some of their concerns with Bill C-5.\n\n“Free, prior and informed consent on First Nations Lands is non-negotiable. An advisory role is inadequate for real partnership,” Grand Chief Greg Desjarlais of the Confederacy of Treaty 6 First Nation said Friday in a news release.\n\n“I will trust actions over words as we look to move forward.”\n\nTo mitigate risks and concerns about an expedited approval process, Ottawa needs to “deepen Indigenous engagement . . . to ensure genuine, equitable partnerships and meaningful participation,” states the report from the Expert Group on Canada-U.S. Relations, which includes academics, energy experts and business leaders.\n\n“Consultation should begin as early as possible and continue throughout the project lifecycle.”\n\nThe report says Ottawa should launch a formal process surrounding co-developing benefit-sharing and equity ownership agreements with Indigenous communities for major projects. It recommends transparent standards for consultation, such as timelines and public disclosure of the outcomes.\n\n“Meaningful consultation with First Nations and Indigenous groups is both a practical and legal necessity. The prime minister was clear (last week) in stating that he understood this reality, but the follow-through will be vital,” Beatty said in an e-mail.\n\nEquity ownership in major energy projects is a huge economic opportunity for some Indigenous communities, but Bill C-5 will require a lot of work from Ottawa, said Stephen Buffalo, chair of the Alberta Indigenous Opportunities Corp. and CEO of the Indian Resource Council of Canada.\n\n“It’s going to take a lot of consultation, and I think we all need to work together on this,” said Buffalo. “If Canada is going to be a superpower, it’s going to be with First Nations, which is pretty exciting, in my view.”\n\nStephen Buffalo is President and Chief Executive Officer of the Indian Resource Council of Canada.\n\nIt’s imperative that the federal government continue the momentum that has seen some Indigenous communities become equity owners in major natural resource projects in recent years, said Exner-Pirot.\n\nIt’s also important that Ottawa unleashes the energy sector, she added.\n\n“We have a tremendous competitive resource when the government isn’t blocking it.”\n\nThe Carney government should publish a list of major projects within the next six months that includes many forms of energy, allocate new federal funds for cleaner energy initiatives, and articulate the benefits of projects to establish broad-based support, according to the report.\n\nThe study also discusses the role of potential government financial involvement in some higher risk projects such as hydrogen hubs or large-scale Arctic LNG terminals, through tax credits, targeted subsidies or loan guarantees.\n\nIt calls on Ottawa to “implement prudent financial risk management, prioritize projects with strong private sector backing and reserve government support when appropriate for high-risk, high-impact ventures.”\n\nChris Varcoe is a Calgary Herald columnist.\n\ncvarcoe@postmedia.com",
        "source": "Yahoo"
    },
    {
        "url": "https://ca.news.yahoo.com/notre-dame-loses-short-route-090000877.html",
        "title": "Notre-Dame loses short route across river when province closes another covered bridge",
        "publish_date": "2025-07-21T09:00:00Z",
        "category": "finance",
        "authors": [],
        "text": "Robert Babineau used the covered bridge on Poirier Office Road six days a week to get to work. (Rhythm Rathi/CBC - image credit)\n\nRobert Babineau was surprised one morning on his way to work to find concrete blocks barricading the covered bridge he takes across the Cocagne River.\n\nHe had to take an alternative road to his lumber business, which added 40 kilometres to his round trip.\n\nBabineau and other residents of the community, a drive of about 30 kilometres northwest of Moncton, say they need a crossing. And they're having trouble getting answers from the province about one.\n\nNew Brunswick's Department of Transportation and Infrastructure confirmed the bridge was closed the first week of July because of its condition.\n\nADVERTISEMENT\n\nWATCH | 'If you want to build a new bridge, like I'm all for it there':\n\nSpokesperson Jacob MacDonald said in an email that the department is exploring options to determine the future of the bridge, which was built in 1942.\n\n\"Improvements to detour roads have been made for better access to the area around the affected bridge,\" MacDonald.\n\nBabineau said he owns some woodland, a sawmill, and a sugar shack, where he makes maple syrup. All parts of his business are across the river.\n\nHe goes to work six days a week and said the detour not only causes wear and tear on his truck but is expensive on gas.\n\n\"I've got to maybe do about 230 kilometres, like, every week,\" Babineau said as he imagined the detour and the increased cost of gas. \"And I just got a small business.\"\n\nADVERTISEMENT\n\nBabineau said he was born in the area and has been using the covered bridge for about 60 years.\n\nThe covered bridge across the Cocagne River was built in 1942. (Rhythm Rathi/CBC)\n\nWhile he has many memories tied to the bridge and would like it saved, what he needs now is a solution.\n\n\"Sure, I would like to save that bridge but just as long as it's passable,\" he said.\n\n\"If not, if they want to build a new bridge, like, I'm all for it there.\"\n\nHe said there is no clarity on what the decision would be, but the closure has got him \"thinking a lot.\"\n\nBabineau said he fears his business would only survive a couple of years without a bridge.\n\nThe province's response did not say there were plans to demolish the covered bridge but didn't provide a reopening date either.\n\nGilles Leblanc owns 40 acres across the river, which he likes to visit once a week for recreation.\n\nGilles Leblanc has been crossing the bridge every week for 20 years because he has property on the other side. (Rhythm Rathi/CBC)\n\nHe said he and others in his community cross the bridge for barbecues, bonfires, hunting, fishing and access to ATV and snowmobile trails. Leblanc said he fears this won't continue if there is no bridge.\n\nADVERTISEMENT\n\n\"The travelling [is] what's going to really kill us to go all the way around, and on the other end it's a long, long dirt road that's not very accessible in the springtime because it is muddy.\"\n\nGinette Leblanc, who lives within 100 metres of the bridge, said her family took their ATV and snowmobile to the main trail across the bridge four to five times a week.\n\nShe said this has not been possible since the closure because she could not drive either of those on the road for 40 kilometres.\n\n\"It affects a lot because one of the reasons that we bought this land 30 years ago was because we were beside a covered bridge … and that we like to have the access to the outdoors that we use all the time.\"\n\nMany people have used the bridge as a backdrop for their graduation and wedding pictures.\n\nGinette Leblanc says she wouldn't take her ATV or snowmobile on the 40-kilometre detour recommended after the bridge closure. (Rhythm Rathi/CBC)\n\nLeblanc said her priority would be to have the bridge restored, but \"if they cannot fix it, just give us a way to have access anyways.\"\n\nADVERTISEMENT\n\nLeblanc said she worries the detour would be too great a distance for emergency vehicles if there is an accident on the ATV trail or her neighbour's house across the river catches fire.\n\nPatrick Toth, vice-president of the Covered Bridges Conservation Association of New Brunswick, said his organization is trying to arrange a meeting with the provincial government regarding the Poirier Office Road bridge.\n\nPatrick Toth, vice-president of Covered Bridges Conservation Association of New Brunswick, says the Poirier Office Road Covered Bridge should be protected, although the province's record just this year isn't good. (Patrick Toth)\n\nHe said the association intends to seek information about the structure's future, as two bridges in the province have already been demolished this year because their condition had deteriorated.\n\nThe William Mitton Covered Bridge in the Moncton area was demolished in late February, and the Germantown Lake or Shepody River bridge in Albert County was removed in April.\n\n\"We need to get the word out to the public that many of our covered bridges in New Brunswick are in serious trouble and indeed in danger of being lost forever,\" Toth said.\n\n\"We want to see all of them saved that are remaining.\"",
        "source": "Yahoo"
    },
    {
        "url": "https://ca.news.yahoo.com/decades-dawson-city-music-festival-004535576.html",
        "title": "After decades as a Dawson City Music Festival volunteer, he's hanging up his lanyard",
        "publish_date": "2025-07-22T00:45:35Z",
        "category": "entertainment",
        "authors": [],
        "text": "Longtime Dawson City Music Festival volunteer Xander Mann said the festival has been a part of his family for decades. This was the final year he'll attend the festival as he's soon moving out of town, and possibly out of territory. (Chris MacIntyre/CBC - image credit)\n\nThe 47th Dawson City Music Festival has wrapped up — and so has one man's decades-long relationship with the festival as a loyal volunteer.\n\n\"It's really tough,\" Xander Mann told CBC News on Sunday. \"[The] music fest has been a big part of my life, and my family's lives, for decades.\"\n\nMann said he will be moving out of Dawson City later this year after 40 years in the Yukon community, and there's a chance his family might move out of the territory.\n\nMann said his family first moved to Dawson City in 1985 and that shortly after, his mother started volunteering at the festival. He said the festival then was nowhere near the size it is today, but he says it's always been the \"heart and soul\" of the community.\n\nThe 47th annual Dawson City Music Festival wrapped up on Sunday. (Chris MacIntyre/CBC)\n\n\"Back then it was such a small group of people that made this happen,\" he said. \"But it's the people of the community that come together and put tents up, cook meals, drive people around, and put performers up in their homes. That's what I mean by the heart and soul of this community.\"\n\nADVERTISEMENT\n\nThe Dawson City Music Festival (DCMF) is one of the territory's biggest and most popular annual events. For three days, the town hosts musicians, entertainers, locals, and visitors from all over the country, and sometimes beyond, for a weekend of good music and good vibes.\n\nPerformances at this year's festival, which wrapped up on Sunday, included big names like Jeremy Dutcher, Charlotte Cornfield, Rich Aucoin, and Toronto hip-hop artist Shad.\n\nCorbin Murdoch is DCMF's executive director.\n\n\"All of the artists have been blown away by the community and how supportive they are of the arts, and supportive they are of this festival,\" he said. \"That's really what it's all about, is getting to introduce about a hundred artists to this amazing community and this part of the world.\"\n\nMurdoch said upward of 250 volunteers were involved with this year's event with many wearing multiple hats over the weekend but also in the weeks leading up to the event. He said the festival wouldn't be possible without all the volunteers.\n\nADVERTISEMENT\n\n\"When you throw a party for 1,200 people, and there's 250 volunteers, there's a few mountains you've got to climb — but this is an amazing team,\" Murdoch said.\n\nXander Mann said he'll always cherish the times he spend on the grounds, rocking out to bands, and being security on the final night of the festival. He said it's bittersweet to finally hang up his \"volunteer\" lanyard for the last time, but he knows the festival will continue to live on in Dawson, and his heart.\n\n\"Welcome to Dawson music fest,\" he said. \"Feel the fury. Feel the passion. And feel the love.\"",
        "source": "Yahoo"
    },
    {
        "url": "https://ca.news.yahoo.com/residents-notre-dame-street-encampment-233549908.html",
        "title": "Residents of Notre-Dame Street encampment spared from eviction for another month",
        "publish_date": "2025-07-21T23:35:49Z",
        "category": "finance",
        "authors": [],
        "text": "Tents have reappeared on a stretch of green space along Notre-Dame Street East ever since the homeless encampment was dismantled by Montreal city officials in 2020. (Graham Hughes/The Canadian Press - image credit)\n\nA group of people living in a tent encampment in Montreal's east end has won a reprieve from eviction until the end of August.\n\nTheir camp, which is on property belonging to Quebec's Transport Ministry, was supposed to be dismantled after an injunction blocking the operation was set to expire Monday.\n\nBut in a ruling issued Monday, a Quebec Superior Court judge said that neither the ministry or anyone else can proceed with the eviction or a cleanup operation targeting the camp until Aug. 27.\n\nThe order applies to the strip of green space running along Notre-Dame Street East between Pie-XI Boulevard and St-Clément Street.\n\nADVERTISEMENT\n\nJustice Gregory Moore said the province and the City of Montreal can only intervene on the site to make sure access to the nearby bike path and Morgan Park are clear. More specifically, tents cannot be set up within three metres of the bike path or 15 metres from the park, and cannot be fixed to or leaned against a fence or other property belonging to a private citizen.\n\nThe encampment was already cleared out once, in 2020, when Montreal firefighters issued an eviction order after a propane tank fire broke out on the site.\n\nIn November 2024, the Transport Ministry initiated another round of evictions and partially dismantled the camp.\n\nWATCH | Report urges Montreal to adapt care for people experiencing homelessness:\n\nNotices were once again distributed in June of this year before a legal clinic advocating for the homeless population, the Clinique juridique itinérante (CJI), demanded an injunction on the dismantlement.\n\nADVERTISEMENT\n\nQuebec's Superior Court awarded the CJI the injunction until the end of June. The CJI, the city and Quebec's attorney general then agreed to extend the injunction again until July 10. That day, the court extended it until July 21.\n\nEarlier this month, Montreal's public consultations office published a report on cohabitation, saying the city should not dismantle homeless encampments until it develops a policy governing when and how they can be taken down.\n\nAt the time the report came out, on July 10, the city said dismantling encampments, though a \"last resort,\" was sometimes necessary to protect the safety of people in and around the sites.\n\nThe CJI said it would not comment on Monday's ruling.",
        "source": "Yahoo"
    },
    {
        "url": "https://ca.news.yahoo.com/tennis-vernons-vasek-pospisil-retires-140054968.html",
        "title": "Tennis: Vernon's Vasek Pospisil retires with 'no regrets', but stays in fight to protect players",
        "publish_date": "2025-07-21T14:00:54Z",
        "category": "sports",
        "authors": [
            "Ben Kuzma"
        ],
        "text": "Tennis: Vernon's Vasek Pospisil retires with 'no regrets', but stays in fight to protect players\n\nTennis: Vernon's Vasek Pospisil retires with 'no regrets', but stays in fight to protect players\n\nVasek Pospisil was always up for a good fight on the court, or off it.\n\nWhether competing against Association of Tennis Professionals (ATP) elite, fighting for players’ rights to combat suppressed earnings and off-court opportunities, or growing the game in his home province, the Vernon native met challenges with vigour.\n\nThe 35-year-old Pospisil is retiring after accomplishments that include a 2014 Wimbledon doubles title, helping Canada capture the 2022 Davis Cup crown, and a string of strong singles and doubles finishes on the Grand Slam circuit.\n\nHe received a main draw wild-card entry for the National Bank Open in Toronto next weekend for his final farewell.\n\nADVERTISEMENT\n\nPospisil, who turned pro in 2007, rose to a No. 4 raking in doubles (2015) and No. 25 (2014) in singles and finished with US$7.2 million in career earnings. He also endured a lot of pain. A trio of elbow tears, herniated disk surgery in 2019, and then another back setback last summer, in the long grind to keep mind and body in sync.\n\n“There can always be a little bit of bittersweet, no question about it,” Vasek told Postmedia on Sunday. “Tennis has been my whole life and all I ever wanted to do, and there’s going to be a little difficulty saying goodbye, but I’ll keep it in perspective. I’m ready to move on to the next thing. There’s so much I want to do.\n\n“The last three or four years have been very tiring and it’s quite safe to say I’m burned out to a point where I’m not getting as much enjoyment out of training or being on the court. It’s incredibly exhausting, and all year long, you’re always on and always travelling.\n\nVasek Pospisil (right) and Jack Sock celebrate 2014 Wimbledon doubles title at The All England Tennis Club.\n\n“A lot of times, it’s a very lonely sport with enormous stress. Eventually, that weighs on you and burns you out. I definitely feel like a shell of the player I was. The injuries played a huge factor especially the last three years. It gets very discouraging and you have to be realistic.”\n\nADVERTISEMENT\n\nHowever, it’s also rewarding, if you put in the time to get to a rare level, and have the will to press on as the career clock ticks.\n\nPospisil advanced to the Wimbledon singles quarterfinal (2015), fourth round of the U.S. Open (2020), and third round of the Australian Open (2014, 2015). In doubles, he also made the quarterfinals in the French Open (2015), Australian Open (2016) and third round of the U.S. Open (2013, 2014).\n\nIt spoke to longevity and longing to always get his game to the next level. Does Pospisil believe he left it all out on the court and did the best under different circumstances?\n\n“I do,” he stressed. “Until 2022, I did everything I could. I left no stone unturned and confident to say I have no regrets.”\n\nPospisil was named the ATP’s comeback player of the year in 2020 for advancing to his first singles final since 2014, collecting his seventh doubles title and getting to fourth round of singles at the U.S. Open.\n\nHome is where the heart is\n\nPospisil didn’t have to look very far find his work ethic.\n\nADVERTISEMENT\n\nTwo years before he was born in 1990, his parents Milos and Mila, along with older brothers Petr and Tom, escaped Communist Czechoslovakia by driving unlawfully to Austria. They worked long hours at low wages to save money for an eventual move to Canada and arrived in Vernon in the summer of 1989.\n\nMilos worked two jobs and took to tennis because his older sons started playing. He would coach on outdoor courts and a three-year-old Vasek tagged along as ball boy at practices. He even dragged a mini tennis racquet around the house and seemed destined for the sport.\n\nA young Vasek Pospisil works on his swing in Vernon. He’s retiring from ATP Tour. Photo: Pospisil family.\n\nAt age six, Pospisil won an Under-12 tournament and by 2002, it became apparent that the family had to move to Vancouver to find the right coach for the prodigy, who was home-schooled. They found the mentor in Vadim Korkh, who worked with Andrei Chesnokov while also a professor at the Central Sport Academy in Moscow.\n\nIn November 2002, Vasek went to Florida and won the Prince Cup, beating several of the best under-12 players from Europe. In 2004, he won the Canadian Nationals at the U14 level, to become best player in the country in his age group. His father saw the obvious potential and returned to coaching his son.\n\nADVERTISEMENT\n\n“I wouldn’t be where I am if it wasn’t for my parents and family and what they sacrificed,” said Pospisil. “It made me the man I am today and I’m forever grateful for the tennis career I had. I still look back to this day as it’s a family project. This is just so much — my dad quitting his job so he could coach me.\n\n“I’m so lucky. They mean everything to me and this is a very important week.”\n\nSo, when will Pospisil pick up a racket again?\n\n“It might take a while,” he laughed. “It will be for fun, but who knows? I will say, I do have a love-hate relationship with the sport right now, but it is a huge part of me. I know that. I still love the game so much and when I’m hitting balls with my friends, it’s so much fun.\n\n“It won’t take me too long to pick up a racket again.”\n\nHow about the Oldlum-Brown VanOpen that returns in 2026? Pospisil won the singles title in 2013.\n\n“Maybe that will be it,” teased Pospisil.\n\nFighting the good fight off courts\n\nPospisil’s connection with the game is now a higher calling to protect players’ rights.\n\nHe formed the Professional Tennis Players Association (PTPA) with Novak Djokovic in 2019. In March, a dozen players sued the sport’s four major tennis organizations — they oversee four Grand Slam events and men’s and women’s pro tours — to contest economic restraints placed among competing players.\n\nThe PTPA alleges the organizations suppress tournament earnings and withhold opportunities for players to have additional opportunities to supplement incomes away from the courts. Potential earnings with name, image and likeness (NIL), are also reportedly under fire because organizations have players sign over the NIL right without compensation.\n\nVasek Pospisil celebrates upset win over Milos Raonic at 2020 U.S. Open on Sept. 3, 2020 in Flushing Meadows, N.Y.\n\n“It’s one of the contentions with my injuries and eventually burning out,” said Pospisil. “It (lawsuit) is for the right cause and something I really believe in. When you look under the hood, it (tennis) is very broken. It was important to stand up for what I believe in. It’s something I’ll continue to work on. It’s in hands of the lawyers right now.”\n\nIn 2024, a Spotrac list of 100th-ranked players of salary and incomes in a variety of sports had the ATP and WTA (Women’s Tennis Association) ranked seventh globally.\n\nThe NFL was first at $17.3 million, followed by the NBA ($14M), Major League Baseball ($13M), European Professional Soccer (EPL, $8.1M), NHL ($7.7M), PGA, LPGA ($3.1M) and ATP, WTA ($1.2M).\n\n“Those (tennis) players are also paying their own expenses,” added Pospisil. “Team sports have everything paid for and there’s something wrong with it. Tennis is definitely broken.”\n\nbkuzma@postmedia.com",
        "source": "Yahoo"
    },
    {
        "url": "https://ca.news.yahoo.com/cancel-culture-us-talk-show-124313688.html",
        "title": "Cancel culture: US talk show hosts react to axing of Stephen Colbert’s 'Late Show'",
        "publish_date": "2025-07-21T12:43:13Z",
        "category": "finance",
        "authors": [
            "Elise Morton"
        ],
        "text": "Late-night talk shows are enormous totems on the US media landscape so news that CBS is axing its version after more than 30-years has sent shockwaves across the industry.\n\nStephen Colbert is bidding farewell to 'The Late Show' after the network confirmed the programme will wrap up next May, triggering a wave of support from fellow hosts, with many calling the decision both shocking and sad.\n\n“I’m just as shocked as everyone,” said Jimmy Fallon, adding that Colbert is “one of the sharpest, funniest hosts to ever do it.” Fallon posted on Instagram that he had hoped to “ride this out with him for years to come”, and joked that his friends and family would now need a new 11:30pm routine.\n\nSeth Meyers echoed the sentiment, calling Colbert “an even better person” than he is a comedian. “I’m going to miss having him on TV every night,” he added, before teasing that Colbert can no longer use the excuse that he’s “too busy to hang out”.\n\nJimmy Fallon, left, Stephen Colbert, center, and Seth Meyers, right. - AP Photo\n\n'Last Week Tonight' host John Oliver called the news “terrible” and “very, very, very sad”, saying he’d always loved both Stephen and the show. “It’s incredibly sad,” he said during an appearance in Erie, Pennsylvania. “Late-night shows mean a lot to me, not just because I work in them, but because even growing up in England, I would watch Letterman’s show, which of course was Stephen’s show, and think about what a glamorous world that was,\" he remembered, adding that he was \"partly excited to see what they’re going to do for the next 10 months.\"\n\nADVERTISEMENT\n\nJimmy Kimmel kept it short and sweet – “Love you Stephen” – while Andy Cohen told interviewers it was “a very sad day for CBS” and described the network as “turning off the lights after the news”.\n\nBut not everyone was mourning. US president Donald Trump – a long-time target of Colbert’s monologues – took to Truth Social to say, “I absolutely love that Colbert was fired.”\n\nColbert, 61, told his audience last week at the Ed Sullivan Theater in New York that he’d only just been informed of the decision. “Next year will be our last season,” he said. “It’s the end of 'The Late Show' on CBS. I’m not being replaced. This is all just going away.” The crowd responded with groans and boos. “Yeah, I share your feelings,” Colbert replied.\n\nCBS insists the cancellation was “purely a financial decision against a challenging backdrop in late night” – and that it had nothing to do with content or performance. In a joint statement, senior executives called the show “a staple of the nation’s zeitgeist”.\n\nADVERTISEMENT\n\nStill, the timing raised eyebrows. The news came just three days after Colbert criticised the legal settlement between Donald Trump and Paramount Global, CBS’s parent company, regarding a long-running dispute over a 60 Minutes segment. Two US senators have since called for transparency on the matter, questioning whether the show’s end is really about the bottom line.\n\nThe Ed Sullivan theatre, where 'The Late Show with Stephen Colbert' is filmed. - Yuki Iwamura/Copyright 2025 The AP. All rights reserved.\n\nColbert took over 'The Late Show' in 2015, following David Letterman’s retirement. Over nearly a decade, he transformed the programme into one of the most politically pointed and consistently sharp voices on American television – regularly skewering Trump and other political figures with satirical precision.\n\nNow, with 10 months left, fans and fellow comedians alike are watching closely to see how Colbert plans to wrap things up. As Oliver put it: “That man will not stop.”",
        "source": "Yahoo"
    },
    {
        "url": "https://ca.news.yahoo.com/makes-st-lawrence-river-dangerous-080000723.html",
        "title": "What makes the St. Lawrence River so dangerous for swimmers?",
        "publish_date": "2025-07-21T08:00:00Z",
        "category": "finance",
        "authors": [],
        "text": "CBC\n\nThere are about 370 North Atlantic right whales left in the world — and a Newfoundland man spotted one off the southern Avalon Peninsula earlier this month.Tour guide Jared Clarke was taking a group bird watching off St. Shott's when he noticed a whale surfacing out of the corner of his eye.Spotting a whale isn't unusual for Clarke, but then he noticed something odd.The whale's head was covered in callosities, \"these big rough patches,\" Clarke told CBC Radio's The Broadcast.When he saw the creat",
        "source": "Yahoo"
    },
    {
        "url": "https://ca.news.yahoo.com/union-claims-prime-minister-broke-205440877.html",
        "title": "Union claims prime minister broke promise to 'cap, not cut' public service",
        "publish_date": "2025-07-21T20:54:40Z",
        "category": "finance",
        "authors": [
            "Matteo Cimellaro"
        ],
        "text": "Sean O'Reilly, the president of PIPSC, has compared proposed cuts to those under former prime minister Stephen Harper. (Credit: File)\n\nOne of the largest unions representing federal public servants says it’s gearing up to fight cuts that have been proposed by the Liberal government.\n\nThe Professional Institute of the Public Service of Canada (PIPSC), which represents knowledge-based professionals such as government scientists, has taken aim at Prime Minister Mark Carney’s plan to find savings in government departments and agencies.\n\n“Let’s not forget: this government ran on a promise of ‘caps, not cuts.’ That promise has been torched,” the union said in a news release on July 18. “These aren’t caps or ‘efficiencies’ — they’re deep, dangerous cuts that put jobs and critical public services at risk.”\n\nOn July 7, Finance Minister François-Philippe Champagne sent letters to ministers asking them to find 15 per cent savings over three years in their departments. He has asked them to come up with savings of 7.5 per cent during the 2026-27 fiscal year, with an additional 2.5 per cent the year after and 5 per cent in 2028-29.\n\nADVERTISEMENT\n\nIt isn’t clear yet whether there will be widespread layoffs, as ministers will have until the end of the summer to propose cuts to their departments. But personnel costs, such as salaries and benefits make up a significant chunk of departmental budgets.\n\nEconomists, including Parliamentary Budget Officer Yves Giroux, have said that it could be difficult to achieve Carney’s spending promises without significant cuts.\n\nSome departments, such as the Department of National Defence, will only have to find up to 2 per cent in savings over three years, and likely will see a boost in funding as the Liberal government looks to keep its new NATO pledge to spend 2 per cent of GDP on defence by the end of the fiscal year.\n\nIn a press release, PIPSC compared the recently announced spending review to former prime minister Stephen Harper’s Deficit Reduction Action Plan, noting that the union “is going to the wall to defend what matters.”\n\nSean O’Reilly, president of PIPSC, told the Ottawa Citizen that the union is planning to run an advertising campaign opposing the cuts. O’Reilly said he also hopes to lobby ministers, members of Parliament and the prime minister.\n\nADVERTISEMENT\n\nO’Reilly claimed that the Harper cuts “cut into bone, they cut into meat, it was not surgical,” adding he is concerned the current government’s spending review will do the same.\n\nThe Prime Minister’s Office did not immediately respond to requests for comment.\n\nO’Reilly also criticized the Liberal government for not consulting with unions ahead of announcing the spending review, adding that he learned about it through the media.\n\n“They had known about it for a few days, and they never brought us in,” O’Reilly said. “That’s not a partnership. That’s not the way I want to work with this government.”\n\nConservative Leader Pierre Poilievre recently told CBC that he believed his proposals to cut the size of the public service were what led to his loss in the riding of Carleton. He accused the Liberals of lying about whether they would lay off government workers and blamed campaigning from public sector unions in his riding for his loss.\n\nADVERTISEMENT\n\nSharon DeSousa, president of Public Service Alliance of Canada (PSAC), told the Ottawa Citizen that she chalked up Poilievre’s local loss to his tendency to alienate voters in an election campaign that unfolded against the backdrop of U.S. President Donald Trump’s threats to make the country the 51st state.\n\n“I think that cost him more that just the seat,” DeSousa said. “I think it cost him the election.”\n\nWhen asked whether PSAC, which is the largest federal public sector union, campaigned specifically in Carleton, DeSousa said her union ran a similar nationwide campaign to previous elections.\n\nThe PSAC leader said she is calling for Carney to “make good on his promise” to cap, not cut the public service.\n\n“Canadians are watching closely to see what he will do,” she added.\n\nAnother public sector union, the Canadian Association of Professional Employees (CAPE) has also sounded the alarm on the proposed cuts.\n\nADVERTISEMENT\n\nIn a statement to the Ottawa Citizen, CAPE President Nathan Prier said he “welcomes” Pierre Poilievre for holding Carney accountable on the “broken promise” to “cap and not cut the federal public service.”\n\n“Departments are now told to find savings that could amount to a drastic reduction in the quality of public services that Canadian rely on to navigate our current political and economic challenges,” Prier added.\n\nPrier said that Poilievre campaigned against the interest of his “constituents and all Canadians” and “as a result his ideas were rejected.”\n\nOur website is your destination for up-to-the-minute news, so make sure to bookmark our homepage and sign up for our newsletters so we can keep you informed.",
        "source": "Yahoo"
    },
    {
        "url": "https://ca.news.yahoo.com/brett-sutter-rising-star-coaching-110058386.html",
        "title": "Is Brett Sutter a rising star in the coaching ranks? The Calgary Flames believe so",
        "publish_date": "2025-07-21T11:00:58Z",
        "category": "sports",
        "authors": [
            "Wes Gilbertson"
        ],
        "text": "On the other end of the line was a proud papa.\n\nAnd a potential co-worker?\n\nWhen Brett Sutter was hired earlier this summer as head coach of the American Hockey League’s Calgary Wranglers, one of his first calls was to his father, Darryl, who happens to be among the most successful bench bosses in the history of the sport.\n\n“He was a typical dad — just really excited for me,” said Brett, himself a father of three, starting to chuckle as he recounted the next part of this special conversation. “And then he asked if he could be my assistant coach.”\n\nFrom the family farm in Viking, Alta., Darryl doesn’t make it sound like a very enticing offer.\n\nADVERTISEMENT\n\n“I told him if he needed a 66-year-old has-been, that I’m available,” he quipped.\n\n‘He was ready for this job’\n\nThe Flames believe that Brett Sutter could be a rising star in the behind-the-bench business.\n\nIt’s why they were willing to hand him the reins to their affiliate — one of the most important jobs in any organization, and especially crucial for a team in the midst of a retool — less than a year after he announced his retirement as a player and just a few weeks after his 38th birthday.\n\nBrett is set to be the third-youngest skipper in the AHL next season and also among the least experienced. While he logged nearly 1,100 games as a minor-league forward, his coaching resume is so far limited to spending last winter as an assistant with the Wranglers.\n\n“Obviously, during the interview process, experience was something that I was asked about a lot,” Brett said. “Yeah, it’s just the one year as a coach, but it is my 19th year coming into the American League and I feel like there hasn’t been much I haven’t seen or done or been a part of, or any situation that will be able to surprise me too much.\n\nADVERTISEMENT\n\n“I’ve tried to be a sponge and take things from coaches and experiences along the way that have helped me prepare for this. And on top of that, just the relationships I’ve built in the organization, whether that be with staff or the players that are currently here, I think I’m set up to give myself a really good chance to be successful right away.”\n\nThe Flames seem confident in that, too.\n\n“He made sure we knew he was ready for this job,” said general manager Craig Conroy. “He didn’t duck any of the questions. He just told us, ‘I know I’m ready, and nobody is going to work harder than me if I get this job.’ And I believe that, I do.\n\n“He has a presence already, with the way that he carries himself and the way he speaks. We were in meetings at the end of the year and he was talking about some of the players and the pro scouts that were in that meeting listening to what he said, they said to me later, ‘Wow, he’s very impressive.’ Even they started talking — ‘This guy is going to be a head coach one day.’ ”\n\nWidespread interest in Wranglers head coaching gig\n\nThat day has already arrived.\n\nADVERTISEMENT\n\nThe Wranglers were searching for a new head coach after Trent Cull was promoted to become a full-time assistant with the Flames, a role he filled on an interim basis for a big chunk of last season.\n\nSutter was one of two internal candidates — Joe Cirella will remain on staff to tutor the defencemen — but there was widespread interest in the position.\n\nWord is, the Flames completed close to 20 interviews.\n\nRelated\n\nWhen they narrowed in on their top choice, there was one potential reference they didn’t contact, and that is not a case of any hard feelings after Darryl was dismissed as the Flames’ skipper at the end of the 2022-23 campaign.\n\n“I didn’t want him to think, ‘Did my Dad help me get this?’ ” Conroy explained. “Because that wasn’t the case.\n\nADVERTISEMENT\n\n“Darryl was an amazing coach. The whole family, really, at one point or another, coached. So for Brett to be able to lean on them if he needs any help, I think that’s great. And then when you listen to what he says and how he thinks the game, you do see some of the qualities that maybe Darryl had. He’s different from his dad. He has a different personality in the way he talks to players, his demeanour, stuff like that. But the way he thinks the game, there’s a lot of similarities, which is something I really valued.”\n\nSutter family well-known in hockey world\n\nThe Sutter name has been synonymous with hockey and with the NHL. This family is as competitive as they come.\n\nDarryl was one of six brothers to skate on the biggest stage. Brett and two of his cousins, Brandon and Brody, carried on the tradition. (Brett totalled 60 career games in ‘The Show,’ including 18 in the Flames logo. He suited up for 1,090 more in the minors, capped by his two-season stint wearing the ‘C’ for the Wranglers.)\n\nBench management also runs in these bloodlines. It’s clear that Brett inherited that savvy strategizing, high standard and burning desire to win, although he also blends the player-friendly approach that is increasingly required.\n\nDarryl, who was notoriously demanding but widely respected for his ability to squeeze every drop out of a group, racked up 737 regular-season victories as an NHL head coach, which ranks 10th on the all-time list. His name is twice engraved on the Stanley Cup.\n\nA hat-trick of Brett’s uncles — Brent, Brian and Duane — have also been big-league bosses, while Ron was previously Calgary’s director of player development.\n\nForced to hang up his gear due to injuries, Darryl was still in his late 20s when he switched to a suit and tie. His coaching climb included two campaigns of calling the shots in the minors.\n\nBrett had just turned three when Darryl led the Indianapolis Ice to the IHL’s Turner Cup in 1990.\n\nHe grew up around the rink as his dad was guiding Ed Belfour, Chris Chelios and Jeremy Roenick in Chicago, then Patrick Marleau, Owen Nolan and Teemu Selanne in San Jose.\n\nFlames fans don’t need any sort of refresher on what happened in 2004, when ‘The Jolly Rancher’ spurred Jarome Iginla, Miikka Kiprusoff, Conroy and the rest of a hard-hatted squad on an improbable run to Game 7 of the Stanley Cup final. If only replay technology was a little more advanced back then …\n\nFlames captain Jarome Iginla and head coach Darryl Sutter chat during practice at the Saddledome on Sunday, May 23, 2004.\n\n“Even though Brett only has the one year of coaching experience, I just think the whole career part of it and the blue-collar work ethic that he has, quite honest, I think it leads up to a long career for him,” Darryl told Postmedia. “He was raised in a locker room, so he understands the team part of it. I remember taking him into the locker room in Chicago when he was a little boy. You learn a lot being in the locker room, and he has basically done that his whole life. He’s lucky in that sense.\n\n“Brett, his leadership skills are off the charts. He was captain of, what, three or four teams? And his hockey IQ is really high. He knows the game. I think he understands what it takes and the roles, that sort of thing.\n\n“And he’s obviously familiar with the whole organization, from ownership right down to the trainers. So I think it’s perfect for him and it’s great for the Flames to develop a young coach like that.”\n\nWranglers looking to roster filled with young players\n\nThe pipeline has been a positive story for the Flames over the past few seasons, with Matt Coronato, Dustin Wolf and Connor Zary among the graduates from farmhand to fixture.\n\nAs Conroy seeks to build a contender, that trend must continue. Brett Sutter now plays a vital role.\n\nThe Wranglers’ roster for this upcoming season should be stocked with youngsters. It’s possible that more than half the guys in their lineup on any given night will be in their early 20s — among them, forwards Andrew Basha, Matvei Gridin, Sam Honzek, Rory Kerins, William Stromgren and Aydar Suniev, defencemen Hunter Brzustewicz, Artem Grushnikov, Yan Kuznetsov and Etienne Morin and goaltender Arsenii Sergeev. (The oldest dude on this list is 23.)\n\nThe Flames seldom fast-track a prospect straight to the NHL, so it’s highly likely that many of their other future pieces — from Jacob Battaglia, Henry Mews and Luke Misa to recent first-rounders Cole Reschny and Cullen Potter — will eventually start their pro path with the Wranglers.\n\nBrett Sutter, left, works with forward prospect William Stromgren during a Calgary Wranglers practice.\n\n“Brett understands that the job of the American League head coach is to, first and foremost, develop the young players for the NHL,” Conroy said. “It’s going to be, ‘Hey, if you want to get to the NHL, you have to do X, Y and Z. You can’t cheat. You don’t want to be here forever. You want to get to the NHL. But if you don’t put all this work in, it’s not going to happen.’ Because every year, there are more and more young guys coming. Everybody is fighting for the same jobs. Brett understands that better than anyone, and I think that’s going to be a huge asset for us.”\n\nThe Wranglers’ new skipper will tell you that sort of guidance has been a part of his everyday role for longer than his HockeyDB page might indicate, back before he was in charge of determining the lines or planning the drills for practice.\n\nDue to the AHL’s development rules, and the appeal of potentially better paydays in Europe, there are not a ton of 30-somethings on this stepping-stone circuit.\n\n“When you’re an older player in the American League, there’s usually a pretty good age gap between you and the other players on your team,” said Brett, who sits fourth in AHL history in career games played. “So I think you’re almost taking on that leadership role right away. You’re starting to almost be a coach, in your own sense. So I started to really enjoy that part of it, the teaching part of it, when I was still playing.\n\n“For me, just the opportunity to work with these young players and to watch them grow, I don’t think there is anything more rewarding. When you see these kids succeed, it makes you feel great. It makes you want to be a bigger part of that.”\n\n‘It’s all about communication and trust’\n\nFor Calgary’s cast of up-and-comers, he’s now arguably the biggest part of it.\n\nThe Flames have also made a habit of springboarding their AHL coaches to the top level. Their past four farm-team honchos are currently working on NHL staffs — Ryan Huska, Cail MacLean and Cull in Calgary, and Mitch Love as an assistant in Washington.\n\nCould Brett Sutter be another rising star in the bench business? A lot of folks believe so.\n\nLove, who was mentioned among the contenders for several of the NHL’s head-coaching vacancies this summer and will sooner than later land one of those jobs, had high praise for his former captain, reminding that “Brett has seen and done it all the hard way — nothing given, all earned.” Love added: “With his hockey bloodlines and leadership qualities, he’s a great choice to lead the Flames’ next wave of talent with the Wranglers.”\n\nIt hasn’t been uncommon, when you’re chatting with the Flames’ latest call-up, to hear of the impact that Brett has already made as both a veteran teammate and then a rookie assistant.\n\nAs an example, when Jakob Pelletier cleared waivers after an underwhelming performance at training camp last fall, the since-traded forward credited this Sutter with helping to rebuild both his game and his confidence.\n\nKerins, who was the Wranglers’ leading scorer in 2024-25, has also talked about the value of having “one of probably the biggest AHL legends” to lean on through the early stages of his pro career.\n\n“It’s all about communication and trust,” Brett said, detailing his approach. “You know, hockey players are simple guys. They want to hear the truth. They want to know exactly where they stand. They want to know the things they’re doing well, the things they need to improve on. And I think just having that no-games, open-and-honest relationship, it makes your team better, but it also makes the individuals better.\n\n“These are really single-track-mind guys. When they decide they want to make it to the NHL, they’re all-in on that goal. Those are the kinds of kids that you want to work really hard for, and that’s part of the reason this job is so great. It is rewarding when you see their dreams do come true.”\n\nBrett Sutter is seen coaching the Calgary Wranglers in 2025 — including Adam Klapka, who finished the season in the NHL with the Flames.\n\nWho could possibly be more proud than the coach when one of those kids — at any age — achieves a career goal?\n\nWell, the dad would be one.\n\n“Brett is a really good fit for ’em, I think,” Darryl said. “I think he’s ready for it. He’ll do a really good job.”\n\nWhile Brett has now filled that assistant-coaching vacancy, plucking another former AHL captain in David Liffiton from the Calgary Hitmen, he knows that a former Jack Adams Trophy winner and two-time Stanley Cup champion is always just a phone call away.\n\n“When you grow up in the locker room, you kind of understand how things work, how people work, things you like, things you don’t like,” Brett said. “For me, it’s just nice having that support system. I know my dad is always there if I have any questions. He doesn’t interfere too much. He’s more stay-in-the-background unless I ask him something.\n\n“The more time you spend in the locker room, you see things and you decide, ‘Yeah, that’s how I want my locker room to be,’ or, ‘That’s not how I want my locker room to be.’ After 19 years in the American League, I’ve seen a lot of different locker rooms and have a pretty clear picture in my mind of how I’d like ours to look. I look forward to starting to build that now.”\n\nwgilbertson@postmedia.com",
        "source": "Yahoo"
    }
]