[
    {
        "url": "https://www.9news.com.au/national/australia-public-holidays-2026-how-to-maximise-your-annual-leave-state-by-state-guide/84a48e89-bc6f-4799-a502-95e39eb9a890",
        "title": "Turn 20 days off into 53 with this simple annual leave trick",
        "publish_date": "Fri, 28 Nov 2025 00:51:13 +0000",
        "category": "finance",
        "authors": [
            "Nov"
        ],
        "text": "﻿Planning holidays in advance can help Australians transform the typical 20-day annual leave entitlement into more than 50 days off in 2026.\n\nBy carefully choosing dates around Christmas and New Year, Australia Day, Easter, the King's Birthday, and Labour Day (or equivalent state/territory holiday), Aussie workers who typically work Monday to Friday can clock up 53 days off.\n\nAnd that's before you factor in specific regional public holidays.﻿\n\nHere are all the public holidays for 2026, plus tips to make the most of your annual leave next year.﻿\n\nAustralia's public holidays by state and territory for 2026\n\nJanuary\n\nBook four days of leave from January 27 to 30 and get nine days off between Saturday, January 24 and Sunday, February 1 (all states and territories).\n\nPublic holidays for the month fall on: ﻿\n\nThursday, January 1: New Year's Day\n\nMonday, January 26﻿: Australia Day\n\nFebruary\n\nBook four days of leave from February 10 to 13 for nine days off between Saturday, February 7 and Sunday February 15 (parts of Tasmania only).\n\nPublic holidays for the month fall on: ﻿\n\nMonday, February 9: Royal Hobart Regatta (parts of Tasmania)\n\nMarch\n\nBook four days of leave from March 3 to 6 for nine days off between Saturday, February 28 and Sunday, February 8 (WA only).\n\nBook ﻿four days of leave from March 10 to 13 for nine days off between Saturday, March 8 and Sunday, March 15 (ACT, SA, Tasmania and Victoria only).\n\nPublic holidays for the month fall on: ﻿\n\nMonday, March 2: Labour Day (WA)\n\nMonday, March 9: Canberra Day (ACT), Adelaide Cup Day (SA), Eight Hours Day (Tasmania), Labour Day (Victoria)\n\nMake the most of the last of the warm weather with some extra time off before winter. (Getty)\n\nApril\n\nBook eight days of leave from March 30 to April 2 and from April 7 to 10 for 16 days off between Saturday, March 28 and Sunday, April 12 (all states and territories).\n\nBook another four days of leave from April 28 to May 1 for nine days off between ﻿Saturday, April 25 and Sunday, May 3 (WA only).\n\nPublic holidays for the month fall on: ﻿\n\nFriday, April 3: Good Friday\n\nSaturday, April 4: Easter Saturday\n\nSunday, April 5: Easter Sunday\n\nMonday, April 6: Easter Monday\n\nSaturday, April 25: ANZAC Day\n\n﻿Monday, April 27: ANZAC Day day in lieu (WA)\n\nMay\n\nBook four days of leave from May 5 to 8 for nine days off between Saturday, May 2 and Sunday, May 10﻿ (NT and Queensland only).\n\nPublic holidays for the month fall on: ﻿\n\nMonday, May 4: May Day (NT, Queensland)\n\nJune\n\nBook four days of leave from June 2 to June 5 for nine days off between Saturday, May 30 and Sunday, June 7﻿ (ACT and WA only).\n\nBook four days of leave from June 9 to June 12 for nine days off between Saturday, June 6 and Sunday, June 14﻿ (ACT, NSW, NT, SA, Tasmania and Victoria).\n\nPublic holidays for the month fall on: ﻿\n\nMonday, June 1: Reconciliation Day (ACT), Western Australia Day (WA)\n\nMonday, June 8: King's Birthday (ACT, NSW, NT, SA, Tasmania, Victoria)\n\nThe June long weekend is the perfect opportunity to stretch your annual leave. (Getty)\n\nJuly\n\nThere are no public holidays in July.﻿\n\nAugust\n\nBook four days of leave from August 4 to 7 for nine days off between Saturday, August 1 and ﻿Sunday, August 9 (NT only).\n\nBook four days of leave from August 10 to 11 and 13 to 14 for nine days off between Saturday, August 8 and ﻿Sunday, August 16 (Brisbane area of Queensland only).\n\nPublic holidays for the month fall on: ﻿\n\nMonday, August 3: Picnic Day (NT)\n\nWednesday, August 12: Royal Queensland Show (Brisbane area only)\n\nSeptember\n\nBook four days of leave from September 29 to October 2 for nine days off between Saturday, September 26 and ﻿Sunday, October 4 (WA only).\n\nPublic holidays for the month fall on: ﻿\n\nMonday, September 28: King's Birthday (WA)\n\nOctober\n\nBook four days of leave from October 6 to 9 for nine days off between Saturday, October 3 and Sunday, October 11 (ACT, NSW, SA and Queensland only).\n\n﻿Book four days of leave from October 23 to 26 for nine days off between Saturday, October 20 and Sunday, October 28 (Tasmania only).\n\nPublic holidays for the month fall on: ﻿\n\nMonday, October 5: Labour Day﻿ (ACT, NSW, SA), King's Birthday (Queensland)\n\nThursday, October 22: Royal Hobart Show (parts of Tasmania)\n\nQueenslanders take the King's Birthday long weekend in October. (Getty Images/iStockphoto)\n\nNovember\n\nBook ﻿four days of leave from November 3 to 6 for nine days off between Saturday, October 31 and Sunday, November 8 (parts of Tasmania only).\n\nBook ﻿four days of leave on November 2 and November 4 to 6 for nine days off between Saturday, October 31 and Sunday, November 8 (Victoria only).\n\nPublic holidays for the month fall on: ﻿\n\nMonday, November 2: Recreation Day (parts of Tasmania)\n\nTuesday, November 3: Melbourne Cup (Victoria)\n\nDecember\n\nBook ﻿eight days off from December 21 to 24 and December 28 to 31 for 16 days off between Saturday, December 19 and Sunday, January 3, 2026 (all states and territories).\n\nPublic holidays for the month fall on: ﻿\n\nThursday, December 24: Christmas Eve - 6pm to midnight (Queensland), 7pm to midnight (NT, SA)\n\nFriday, December 25: Christmas Day\n\nSaturday, December 26: Boxing Day (all states and territories except Tasmania)\n\nMonday, December 28: Boxing Day (day in lieu)\n\nThursday, December 31: New Year's Eve - 7pm to midnight (NT, SA)\n\nFriday, January 1, 2027: New Year's Day﻿",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/aldi-australia-social-media-scam-targeting-grocery-shoppers-warning/039df921-f422-4dfe-a180-fab8d1c3e30b",
        "title": "Aldi issues urgent warning amid supermarket scam",
        "publish_date": "Thu, 27 Nov 2025 21:50:41 +0000",
        "category": "finance",
        "authors": [
            "Nov"
        ],
        "text": "A﻿ldi Australia is taking urgent action over a recent supermarket scam that has seen Aussie grocery shoppers promised significant savings on their weekly shop.\n\nThe discount supermarket retailer tells nine.com.au they \"have been actively pursuing\" the removal of scam videos that have been appearing on social media channels.\n\nThe videos have been appearing primarily on TikTok, as well as other social media outlets. They are labelled The Aldi Method, The Coles Method and The Woolies Method.\n\nThe scam has been appearing primarily on TikTok as well as other social media channels. (Nine)\n\nEach video follows a similar format: a voiceover sharing a method to save on groceries atop footage of someone placing groceries into a trolley at Aldi, Coles or Woolies.﻿\n\nViewers are then directed to a web address, which appears to be an Aldi or corresponding supermarket website, which is placed in the description or the comments section and requests a customer's personal details.﻿\n\nA spokesperson for Aldi ﻿Australia has told nine.com.au they are \"aware of some websites impersonating Aldi and we have been actively pursuing their removal to protect our customers\".\n\n\"We encourage Australians to always remain wary of any offers seen on unofficial social media pages or websites, and to report any scams to Scamwatch,\" they said.\n\nCustomers are promised massive savings on their groceries. (Nine)\n\nAldi has reminded customers DoorDash is the only platform that sells Aldi products online.\n\nAny other website claiming to do so is not legitimate and may be a fake website pretending to be Aldi, customers are being warned.\n\nToday money expert Joel Gibson says the scams, which target vulnerable Aussies struggling to make ends meet, are easy to spot once you know what to look for.\n\n\"There are dozens of these ﻿accounts, not many followers, if you scratch the surface, you will see that, but people don't often see that when they first see the post,\" he explained.\n\n﻿Some of the scam videos allege savings of up to $750 on grocery costs.\n\n\"The problem is they are complete BS,\" he says.\n\n\"It's a scam. They ask you to go to a website and put your data in.\"\n\nGibson said the scam is working because so many people are struggling to afford their weekly shop.\n\n﻿Some of the scam videos allege savings of up to $750 on grocery costs. (Getty)\n\nA Coles spokesperson has told nine.com.au: \"Coles advises customers to be aware of websites, competitions and other unsolicited communications that use the Coles brand without Coles' permission, or which promote Coles rewards or other incentives, in an attempt to appear legitimate.\n\n\"These offers predominantly attempt to collect your personal details or financial information and Coles will never request personal or banking details in unsolicited communications.\n\n\"We encourage people to report any suspicious communication you may have received to the ACCC via their Scamwatch page.\"\n\nA spokesperson from Woolworths has issued the following warning.\n\n\"It's important for our customers to remain vigilant when it comes to scam activity,\" they said.\n\n\"It's important for our customers to remain vigilant when it comes to scam activity.\" (Supplied)\n\n\"To help our customers, we frequently post notices on our website with the different types of scams we see reported to us, how to stay safe from them and where to get help.\n\n\"Online scams seek to imitate well-known brands to collect personal information, but we would never ask our customers for their personal or banking details in unsolicited communications.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/world/hong-kong-fire-deadly-fire-breaks-out-in-highrise-residential-buildings-in-tai-po-district/c6a4aeb1-5d20-4a54-aad6-4c98eb4b1103",
        "title": "Hong Kong fire death toll rises to 94 as firefighters continue to fight burning buildings",
        "publish_date": "Thu, 27 Nov 2025 23:54:07 +0000",
        "category": "finance",
        "authors": [
            "Nov"
        ],
        "text": "Firefighters battled for a second day to extinguish a blaze at a high-rise apartment complex in Hong Kong yesterday, as the death toll rose to 94 in one of the deadliest blazes in the city's modern history.\n\nRescuers holding flashlights were going from apartment to apartment at the charred towers as thick smoke poured out from some windows at the Wang Fuk Court complex, a dense cluster of buildings housing thousands of people in Tai Po district, a northern suburb near Hong Kong's border with the mainland.\n\nOfficials said firefighters were still working on a handful of apartments and trying to enter all of the units in the seven towers to ensure there were no further casualties.\n\nREAD MORE: Crowdsourced site reveals devastating reality of Hong Kong inferno\n\nSmoke rises after a fire broke out at Wang Fuk Court, a residential estate in the Tai Po district of Hong Kong's New Territories on Wednesday, Nov. 26 2025. (AP Photo/Chan Long Hei) (AP)\n\n\"Our firefighting operation is almost complete,\" said Derek Armstrong Chan, deputy director of Fire Services Operations.\n\nFirefighters were working hard \"to prevent the debris and embers from flaring up. What's next is the search and rescue operation,\" he added.\n\nIt was unclear how many people remained missing or trapped. Hong Kong leader John Lee said contact had been lost with 279 people early yesterday.\n\nAuthorities did not provide updates on the missing people or how many were still inside the ravaged buildings yesterday during a press conference.\n\nVideo showed rescuers searching in some apartments in the dark.\n\nOrange flames were still seen from inside several windows, though the whole complex was now largely a blackened ruin.\n\n﻿Almost 300 people still remain unaccounted for, while at least 66 others have been hospitalised. (AP)\n\nFirefighters have been trying to control the flames since mid-afternoon on Wednesday, when the fire was believed to have started in bamboo scaffolding and construction netting and then spread across seven of the complex's eight buildings.\n\nChan said the blaze spread \"exceptionally fast\" across the towers, and emergency workers struggled to gain access inside.\n\n\"Debris and scaffolding were falling from upper floors,\" he told reporters.\n\n\"There are also other reasons like high temperature, darkness ... (and) emergency vehicle access was blocked by fallen scaffolding and debris, making our access to the building very difficult.\"\n\nMore than 70 people were injured, including 11 firefighters, as well as the 94 killed, the Fire Services Department said.\n\nAbout 900 people were evacuated to temporary shelters overnight.\n\nFirst responders work the scene of a fire at Wang Fuk Court, a residential estate in the Tai Po district of Hong Kong's New Territories on Wednesday, Nov. 26 2025. (AP Photo/Chan Long Hei) (AP)\n\nFlames engulf a building after a fire broke out at Wang Fuk Court, a residential estate in the Tai Po district of Hong Kong's New Territories, on Wednesday, November 26, 2025. (AP Photo/Chan Long Hei)\n\nPope Leo XIV sent a telegram to Hong Kong's bishop yesterday, saying he was saddened by the fire and offering prayers for the injured, their families and emergency workers.\n\nResident Lawrence Lee was waiting for news about his wife, who he believed was still trapped in their apartment.\n\n\"When the fire started, I told her on the phone to escape. But once she left the flat, the corridor and stairs were all filled with smoke and it was all dark, so she had no choice but to go back to the flat,\" he said, as he waited in one of the shelters overnight.\n\nWinter and Sandy Chung, who lived in one of the towers, said they saw sparks fly around as they evacuated on Wednesday afternoon.\n\nAlthough they were safe, they were worried about their home. \"I couldn't sleep the entire night,\" Winter Chung, 75, told The Associated Press yesterday.\n\nThe buildings sustained serious damage. (AP)\n\nFirefighters battled the blaze for hours. (AP)\n\nThree arrested on suspicion of manslaughter\n\nThree men, the directors and an engineering consultant of a construction company, were arrested on suspicion of manslaughter.\n\nPolice have not directly named the company where they work.\n\n\"We have reason to believe that those in charge of the construction company were grossly negligent,\" said Eileen Chung, a senior superintendent of police.\n\nPolice on Thursday also searched the office of Prestige Construction and Engineering Company, which the AP confirmed was in charge of renovations in the tower complex.\n\nPolice seized boxes of documents as evidence, according to local media. Phones for Prestige rang unanswered.\n\nAuthorities suspected some materials on the exterior walls of the high-rise buildings did not meet fire resistance standards, allowing the unusually fast spread of the fire.\n\nPeople look on as thick smoke and flames rise during a major fire at the Wang Fuk Court residential estate in Hong Kong's Tai Po district. (Tommy Wang/AFP/Getty Images via CNN)\n\nPolice also said they found plastic foam panels – which are highly flammable – attached to the windows on each floor near the elevator lobby of the one unaffected tower.\n\nIt was believed to have been installed by the construction company. but the purpose was not clear.\n\nSecretary for Security Chris Tang said they would investigate the materials further.\n\nBuildings were covered in scaffolding\n\nThe housing complex consisted of eight buildings with almost 2000 apartments for about 4800 residents, including many older people.\n\nIt was built in the 1980s and had been undergoing a major renovation. Hong Kong's anti-corruption agency said yesterday it was launching a probe into possible corruption relating to the renovation project.\n\nOfficials said the fire started on the external scaffolding of a 32-story tower, then spread on the bamboo scaffolding and construction netting to the inside of the building and then to the other buildings, likely aided by windy conditions.\n\nFirefighters try to extinguish a fire which broke out at Wang Fuk Court, a residential estate in the Tai Po district of Hong Kong's New Territories, on Wednesday, November 26, 2025. (AP Photo/Chan Long Hei)\n\nBamboo scaffolding is a common sight in Hong Kong at building construction and renovation projects, though Lee said officials will meet with industry representatives to discuss a switch to metal scaffolding amid safety concerns.\n\n\"While we know that bamboo scaffolding has a long history in Hong Kong, its flame retardancy is inferior to that of metal scaffolding,\" said Eric Chan, the Chief Secretary for Administration.\n\n\"For safety reasons, the government believes that a complete switch to metal scaffolding should be implemented in suitable working environments\"\n\nAuthorities will also be carrying out immediate inspections of all housing estates that are undergoing major renovation work to ensure scaffolding and construction materials meet safety standards.\n\nThe fire was the deadliest in Hong Kong in decades.\n\nIn November 1996, 41 people died in a commercial building in Kowloon in a fire that lasted for around 20 hours.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/world/austria-avalanche-rescuers-launch-search-after-stubai-glacier-avalanche-in-tyrol/62537c1f-abcf-4c19-b2d4-9f08cc9044ac",
        "title": "Hundreds launch search after avalanche buries skiers and snowboarders",
        "publish_date": "Thu, 27 Nov 2025 15:48:13 +0000",
        "category": "sports",
        "authors": [
            "Nov"
        ],
        "text": "and snowboarders have been buried in an avalanche on the Stubai Glacier in the\n\nThree injured skiers were airlifted to a hospital after being rescued on Thursday morning (Thursday night AEDT) in Tyrol, Austria, according to the Austria Press Agency. It was unclear how serious their injuries were.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/queensland-stroms-warwick-brisbane-weather/a8987a0d-3e1a-4682-a57f-c0259f683735",
        "title": "Severe storm tears roofs off houses, shuts race track in Queensland town",
        "publish_date": "Thu, 27 Nov 2025 09:29:13 +0000",
        "category": "sports",
        "authors": [
            "Nov"
        ],
        "text": "South-east Queensland has been hit by more severe storms, with hail dumped in coastal areas and winds of more than 100km/h battering regions south-west of Brisbane.\n\nIn Warwick, about 140 kilometres west of the Gold Coast, roofs were torn off houses, trees and powerlines were sent crashing down, and the turf club had some of its facilities destroyed overnight.\n\nThe morning light revealed sheets of metal roofing littering the front lawns of Victoria Street, with the garage door of a house on the street also being ripped away during the storm.\n\nREAD MORE: ﻿ Bride and groom caught up in wedding car crash\n\nThe Warwick Turf Club suffered damage to some of its facilities. (Nine)\n\nTrees also toppled onto backyards and even into houses, though no injuries have been reported from the storm, which ripped through the town about 8.30pm (9.30pm AEDT) yesterday.\n\nThe Warwick Turf Club was forced to temporarily close after some of its facilities and infrastructure were destroyed.\n\nThe machinery shed was torn to pieces and collapsed within minutes, while part of the clubhouse roof also went flying.\n\nREAD MORE: ﻿ European backpackers mauled by shark in deadly attack on NSW coast\n\nTrees and powerlines were down across Warwick. (Nine)\n\n\"It's a bit devastating,\" track manager Maurice Monckton said.\n\n\"At the end of the day, at least the track's still good.\"\n\nThe golf club is also expected to be closed for several days, losing about $10,000 in trade as a result.\n\nDespite the school being in what locals describe as \"a mess\", it remained open today and hasn't suffered significant damage.\n\nA storm rolled through coastal areas this afternoon, dumping hail on the Brisbane CBD, Milton and Bardon, as well as Elanora and Palm Beach on the Gold Coast.\n\nLots of clean-up work remains following six weekends in a row of severe storms in south-east Queensland.\n\nLots of clean-up work remains following six weekends in a row of severe storms in south-east Queensland. (9News)\n\nIn Beachmere, on the mainland north of Brisbane near Bribie Island, which was smashed particularly hard at the weekend just passed, residents are complaining they've been forgotten.\n\n\"Everyone's been over at Bribie, which obviously has a bigger population and potentially more damage than what we had, but our whole area has been without power since Monday,\" resident Kim Thomas said.\n\nDisaster payments have been activated for five south-east Queensland government areas, $180 for individuals and up to $900 for families.\n\nPremier David Crisafulli suggested more could be done.﻿\n\n\"The level of damage, both to individuals, to their homes and cars and to council infrastructure, warrants the federal government and the state government and the state government coming together and having a look at what opportunities are there to help residents in their hour of need,\" he said.",
        "source": "9News"
    },
    {
        "url": "https://www.abc.net.au/news/2025-11-28/f1-qatar-grand-prix-start-time-how-to-watch-driver-standings/105995172",
        "title": "F1 standings, title scenarios and start times for this weekend in Qatar",
        "publish_date": "Fri, 28 Nov 2025 01:50:53 +0000",
        "category": "sports",
        "authors": [],
        "text": "Lando Norris has match point heading into the penultimate weekend of the Formula 1 season, with the British driver having one hand on a maiden drivers' championship.\n\nNorris enters this weekend's racing in Qatar with a 24-point advantage over his McLaren teammate Oscar Piastri, and reigning world champion Max Verstappen.\n\nDespite being in pole position to win the title, Norris is not guaranteed the title and will still need to produce a solid drive to make his championship dream a reality.\n\nPiastri has already said he will not be helping his teammate, with the Australian still daring to dream that he can snatch the world championship late.\n\nHere is what you need to know about the Qatar Grand Prix weekend, the penultimate round of the 2025 F1 season.\n\nHow can Lando Norris win the F1 title this weekend?\n\nMcLaren driver Norris is in pole position to become the F1 drivers' champion, and the British racer can seal the title this weekend.\n\nWhat Piastri needs to do in the final rounds to snatch the F1 championship Here is how the drivers' championship is poised with two rounds remaining.\n\nNorris leads the championship on 390 points, which is a 24-point advantage over Piastri and Verstappen, who are both on 366.\n\nHere is how Norris can win the title this weekend.\n\nOutscore Piastri and Verstappen by two points\n\nAt the conclusion of this weekend, there will be one grand prix to race in 2025.\n\nThe maximum amount of points a driver can score in the final round is 25 points.\n\nTherefore, if Norris holds a lead of 26 points leaving Qatar, he will be the world champion.\n\nIn Qatar, there will be one grand prix and one sprint race held, with a maximum of 33 points to be won.\n\nPosition Grand prix points Sprint race points First 25 8 Second 18 7 Third 15 6 Fourth 12 5 Fifth 10 4 Sixth 8 3 Seventh 6 2 Eighth 4 1 Ninth 2 0 Tenth 1 0\n\nThere are many combinations of results that can happen for Norris to score two, or more, points than Piastri and Verstappen.\n\nBut in simple terms, Piastri and Verstappen need to finish ahead of Norris to keep the title fight alive.\n\nNorris wins the Qatar Grand Prix, and holds a 25-point lead in the championship\n\nSo, what if Norris only has a 25-point lead at the end of the Qatar weekend?\n\nWell, he will go into Abu Dhabi needing to finish 10th or better to win the title.\n\nBut what if Piastri or Verstappen are 25 points behind, win the Abu Dhabi Grand Prix while and Norris fails to score, and the drivers are tied for points?\n\nWell, then the title will be decided on countback.\n\nIf points are equal, then the driver with the most grand prix wins is crowned champion.\n\nIf the number of wins is the same, then the driver with the most second-place finishes is the champion, and so on.\n\nHeading into the Qatar weekend, Norris and Piastri have seven wins, while Verstappen has six.\n\nSo, if Norris wins in Qatar (his eighth grand prix victory) and is 25 points ahead of Verstappen, then the Dutchman cannot win the title.\n\nIf Norris wins in Qatar and Piastri then equals his points tally the following week in Abu Dhabi with a victory, both drivers will have won eight grands prix.\n\nThe countback would then go to the driver with the most second-place finishes, which Norris leads Piastri 8-3.\n\nLando Norris (left) can win the F1 title this weekend, but teammate Oscar Piastri (right) can also reclaim the lead of the championship in Qatar. (Reuters: Jakub Porzycki)\n\nWhile Norris has a terrific chance of winning the title this weekend, he can also lose the lead of the championship.\n\nIn the absolute worst-case scenario, Norris could leave Qatar sitting third in the championship. But a lot would need to go wrong for Norris not to leave Qatar with the lead of the championship, at the very least.\n\nWhen does the F1 Qatar Grand Prix begin?\n\nIn Australia, the Formula 1 Qatar Grand Prix will be held on Monday, December 11.\n\nHere is when the race will begin in each of Australia's states and territories:\n\n3am AEDT: NSW, ACT, Vic, Tas\n\n2:30am ACDT: South Australia\n\n2am AEST: Queensland\n\n1:30am ACST: Northern Territory\n\n12am AWST: Western Australia\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\nThere is also a sprint race this weekend in Qatar.\n\nThe sprint race, which is one-third of a grand prix distance, will run overnight on Saturday, November 29 and Sunday, November 30, depending on where you are in Australia.\n\nHere is when the sprint race will begin in each of Australia's states and territories:\n\n1am AEDT, Sunday, November 30: NSW, ACT, Vic, Tas\n\n12:30am ACDT, Sunday, November 30: South Australia\n\n12am AEST, Sunday, November 30: Queensland\n\n11:30pm ACST, Saturday, November 29: Northern Territory\n\n10pm AWST, Saturday, November 29: Western Australia\n\nHow can I watch and follow the F1 Qatar Grand Prix?\n\nFox Sports and its streaming platform Kayo will be broadcasting the Qatar Grand Prix.\n\nThose watching on Foxtel can watch the race on Fox Sports, channel 506.\n\nYou can also follow all the action with the ABC Sport live blog, from pre-race drama to the post-race synopsis.\n\nABC Sport will have a live blog of the Formula 1 Qatar Grand Prix, which will begin at 3am AEDT on Monday, December 1.\n\nWhat do I need to know about the Lusail International Circuit?\n\nThe Lusail International Circuit was built with motorcycle racing as its primary focus.\n\nHosting its first MotoGP race in 2004, it is a fast and flowing track that is well-suited to bikes.\n\nThe Lusail International Circuit in Qatar. (F1)\n\nMedium to high-speed corners are the defining features of the circuit, a tough challenge for any driver who is on older tyres.\n\nThe triple right-hand turns of corners 12 to 14 will really test the stability and downforce of any F1 car.\n\nThe best overtaking spot is turn one, after the long straight, which stretches more than 1km.\n\nFast facts about the Lusail International Circuit?\n\nFirst race: 2021\n\nNumber of laps: 57\n\nLap distance: 5.419km\n\nRace distance: 308.611km\n\nGrand prix lap record: 1:22.384 — Lando Norris (2024)",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-11-28/jane-edmanson-gardening-australia-retires/106027658",
        "title": "Jane gave up teaching to learn about plants — she ended up on TV for 38 years",
        "publish_date": "Fri, 28 Nov 2025 01:05:48 +0000",
        "category": "finance",
        "authors": [],
        "text": "Since Jane Edmanson first presented Gardening Australia in 1990, millions of Australians have tuned in for inspiration and advice on cultivating an oasis of their own.\n\nBut her impressive career had a slightly rocky start.\n\nAfter working as a school teacher for three years, Edmanson realised her passion actually lay with native plants, and she decided to change direction.\n\n\"In those days, plant nurseries didn't really take women,\" Edmanson says.\n\n\"They said, 'Oh no, no, we've got men here.'\"\n\nStream Gardening Australia on ABC iview Inspiring, entertaining and full of practical advice, join Costa Georgiadis and the team as they unearth gardening ideas, meet avid gardeners and look at some of the most inspiring gardens from across the country.\n\nIt was the mid-1970s, and Edmanson rang 25 different nurseries before finding one willing to give her a go.\n\nThat opportunity set her up as \"a jack of all trades\", working with everything from indoor plants to perennials, shrubs and Australian natives.\n\nAs well as working in the nursery, Edmanson went to technical college two nights a week, the start of what became a lifetime of learning about plants and gardening.\n\n\"I loved it. It was very practical. I just thought, 'This is the career for me','' she recalls.\n\nA lucky start in TV\n\nA decade later, a chance encounter became a career turning point.\n\nWhile giving an evening talk about native plants, Edmanson met pioneering ABC TV gardening presenter Kevin Heinze, who was preparing to retire from Victoria's Sow What program after more than two decades.\n\nImpressed by her knowledge and natural teaching style, Heinze offered Edmanson his hosting role.\n\nLoading...\n\n\"I thought, 'Kevin don't joke with me — it's a silly joke'. But he was serious,\" she recalls.\n\n\"He wanted someone younger and a woman, so he told the ABC he had found his replacement.\n\n\" It was the luck of the draw — I was there at the right time. \"\n\nEdmanson says it's a great example of why people should have the courage to back themselves.\n\n\"Take a risk. If there's a barrier in front of you, don't be put off by it. Jump over it — you never know where it is going to lead you,\" she says.\n\nJane Edmanson's career pivot into television in 1988 (left) led her to become a founding presenter (right) on Gardening Australia. (ABC Archives)\n\nWithout any media training, Edmanson began hosting the Victorian program in 1988, kickstarting her nearly four-decade career in gardening television.\n\nNot long after, state-based gardening shows were consolidated into a national ABC program: Gardening Australia.\n\nAs a founding presenter, Edmanson joined a team of horticultural experts supporting host Peter Cundall when the show launched in 1990.\n\nNo-rules, no-worries gardening\n\nAs the show wraps up another season, Edmanson attributes its long-running success to both its audience and its enthusiastic presenters.\n\n\"It's always had a good following of people. Peter Cundall was really essential in making it. He was a real, true gardener with a great veggie garden,\" she says.\n\n\"He'd say, 'That's your bloomin' lot for the week' — he was very famous for his saying.\"\n\nGardening Australia presenters in the early 1990s: Jane Edmanson (top-left), Malcolm Campbell, Peter Cundall (bottom left), Neville Passmore, Colin Campbell and Mary Moody. (ABC Archives)\n\nBut she says the show has developed a cult following in recent years, which she credits to Costa Georgiadis's infectious enthusiasm for sustainable gardening.\n\n\"He brings a huge energy, and I admire him amazingly,\" she says.\n\n\"He brings in young people, old people and inspires community gardens.\"\n\nEdmanson shares the same \"no-rules, no-worries\" gardening philosophy as Georgiadis.\n\nEdmanson speaks with Georgiadis in her final episode of Gardening Australia this week. (ABC iview)\n\n\"We both feel it doesn't matter how you do it — it's that you actually do it,\" she says.\n\n\"Some people are born with that gardening knack, and other people are not. It's just a matter of trying, giving it a go.\"\n\nConnecting with communities\n\nAfter filming thousands of episodes, Edmanson says the stories that have stuck with her are those that allowed her to connect meaningfully with people.\n\n\"I love the people behind their garden,\" she says.\n\n\" I love hearing about the feelings they get when they get out there, and the background story of why they garden. \"\n\nShe remembers meeting a woman who grew up in Papua New Guinea, who had been volunteering at an urban farm in Melbourne.\n\n\"All she wanted to grow was sweet potato, because that's what she grew back home,\" Edmanson recalls.\n\nAnother memorable episode was when she and Georgiadis went to a market garden and met a Tamil refugee from Sri Lanka.\n\n\"He was making beautiful feasts out of the lovely ingredients that he picked freshly from the garden — it was very meaningful for him,\" she says.\n\nLoading...\n\nEdmanson says that sense of connection through gardening starts right outside her own front gate.\n\n\"People walk past my garden and peek over the picket fence, and I'll just say, 'Good morning, how are you?'\" she says.\n\n\"I'm always swapping plants — 'Try this', 'Grow that'. It's amazing how gardening brings people together.\"\n\nAs one season ends, a new begins\n\nAs Edmanson hangs up her Gardening Australia hat — and the show wraps on December 5 for another year — she's adamant she's not putting her feet up any time soon.\n\n\"I don't like using that word 'retiring',\" she jokes.\n\n\"I'm moving back from Gardening Australia, but I'm still doing a lot in the horticultural industry.\"\n\nShe plans to continue volunteering at botanic gardens and sharing her passion for plants and people by giving gardening talks to community groups.\n\nFrom her fragrant garden to her worm farm, Edmanson relishes every aspect of gardening. (Supplied: David Morgan)\n\nEdmanson will continue to champion the simple act of stepping outdoors — a practice she believes reconnects us not only with each other, but with the rhythm of the seasons and the natural world around us.\n\n\"When you go out into the garden, what are the five senses you're using? You can listen to the birds. You can smell the flowers.\n\n\"It's really good for you — not just for connecting with nature, but for that sense of accomplishment.\"\n\nShe wants people to remember that \"gardening\" can mean many things: indoor plants; edible beds; fragrant flowers; or simply noticing what's changed overnight.\n\n\"It doesn't matter if you dig, just so long as you get out and look at what's been happening.\"\n\nWatch Jane Edmanson's final episode of Gardening Australia tonight at 7:30pm on ABC TV or stream anytime on ABC iview.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-11-28/regional-paper-printers-uncertain-future-in-modern-media-market/106074732",
        "title": "Outback printing press faces scrap or museum as Barrier Truth winds down",
        "publish_date": "Fri, 28 Nov 2025 01:04:16 +0000",
        "category": "finance",
        "authors": [],
        "text": "When Broken Hill journalist Emily McInerney drives past her old workplace, the Barrier Daily Truth, its peeling paint and locked doors leave her feeling emotional.\n\nIt has been nearly 18 months since the independently owned newspaper abruptly closed after more than 125 years, with operators, the Barrier Industrial Council (BIC), citing financial difficulties.\n\nWhile Ms McInerney now works for a new publication established in the aftermath of the closure, she said the Truth, where she worked for about 11 years, always remained close to her heart.\n\n\"I love the building … it was very old, but it had so much history, and there were so many parts to it that you always enjoyed exploring,\" Ms McInerney said.\n\nEmily McInerney started as a cadet journalist with the then Barrier Daily Truth and worked her way up the ranks to acting editor before moving on. (ABC News: Oliver Brown)\n\n\"Even being able to see the printing presses was amazing … you were watching history in action when you worked there.\"\n\nBut this printing press, along with everything else within the more than a century-old building, is now being sold or removed entirely.\n\nBIC president and Barrier Truth board chair Roslyn Ferry said a recent garage sale was the first in many steps to recoup some of its losses.\n\n\"Obviously, we were already looking at our creditors and our debtors, trying to wind up that part of the business,\" Ms Ferry said.\n\n\"So, it was decided that we would empty the building as much as possible.\"\n\nMuch of the former newspaper's still-usable equipment is being sold, with the proceeds going towards paying off creditors. (ABC News: Oliver Brown)\n\nMore valuable as scrap?\n\nMs Ferry still hopes to preserve some of the building's contents, particularly the tens of thousands of printed editions archived there in varying stages of condition.\n\nAnother person interested in the paper's historical value is Gavin Schmidt, who worked there in various roles over more than 40 years, including as its manager.\n\nMr Schmidt said he understood the need to pay back the paper's creditors, but worries some items will be difficult to sell, particularly the printing press that was installed in the late 70s.\n\nFormer employee Gavin Schmidt says the paper's printing presses were kept in good condition during his time. (ABC News: Callum Marshall)\n\n\"We used to get our press serviced by a Melbourne company, [and] the guy was [telling me] presses are worth nothing because there's so many of them sitting in deserted buildings in Melbourne, Sydney, and all around the country region,\" Mr Schmidt said.\n\n\" He said the only thing they're worth is as scrap metal … that was nearly 10 years ago, and it's even worse now. \"\n\nRegional decline of in-house printing\n\nThis experience rings true for generational Mildura-based publishers, the Lanyon family, who sold their newspaper interests to national media group SA Today in September.\n\nRoss Lanyon said their print press, which once printed several mastheads, including the Sunraysia Daily and the Silver City's newest publication, the Broken Hill Times, has recently been dismantled.\n\n\"Parts of it were sold to other newspapers who acquired it, and a portion was also unfortunately sold as scrap metal because there isn't a demand for it anywhere in the world at the moment,\" he said.\n\nPresident of Country Press New South Wales and fourth-generation newsman Edward Higgins estimated \"well over 90 per cent\" of newspaper publishers have been outsourcing their printing for many years.\n\nEdward Higgins's (right) family currently produces around 20 weekly publications across country NSW and Victoria. (Supplied: Edward Higgins)\n\n\"The investment that you have to put in to have a press is significant, and staffing is also a major challenge,\" Mr Higgins said.\n\n\"The second-hand market has [also] reduced … often you can pick up the presses for not a considerable amount of money, but it's a very large investment still to install them.\"\n\nDreams of preservation\n\nMs Ferry said she was well aware of the challenge the board faces with selling the press in today's market.\n\nHowever, she said she had not ruled out exploring other options, including the possibility of preserving it as a relic of the city's history.\n\nRoslyn Ferry says some things in the building have purely historical value, such as the paper's archives. (ABC News: Oliver Brown)\n\n\"The press still works, it's just totally immovable at this point, so it would be great if someone wanted to jump in and say, 'Let's use [one] part of the building as a museum,'\" she said.\n\n\"All those sorts of decisions will be totally up to the affiliated unions, [so] probably nothing's going to be happening in the next year or two, but we'll see how we go.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-11-28/monash-ivf-victorian-health-regulator-conditions/106077192",
        "title": "Major IVF provider hit with restrictions after embryo bungle",
        "publish_date": "Fri, 28 Nov 2025 00:58:16 +0000",
        "category": "finance",
        "authors": [],
        "text": "Monash IVF will have a greater obligation to check the biological origin of embryos following highly-publicised mix-ups, under conditions imposed by Victoria's health regulator.\n\nThe Victorian Health Regulator has announced it is imposing conditions on Monash IVF's registration following the bungles in Brisbane and Melbourne.\n\nIn April, the fertility group apologised after a patient unknowingly gave birth to a stranger's baby after the wrong embryo was transferred.\n\nJust two months later it was revealed Monash IVF incorrectly transferred the wrong embryo into a patient in Melbourne.\n\nThe bungle in Victoria prompted an investigation by the Victorian Health Regulator, which conducted site inspections at Monash IVF facilities and spoke with staff.\n\nThe regulator said it has now imposed conditions on Monash IVF's registration to ensure there was no repeat.\n\n\"The conditions focus on matters such as ensuring the integrity and traceability of genetic material through comprehensive consent and documentation processes, rigorous verification and patient checks, accurate recording in management systems, and strengthened staff capability,\" the regulator said.\n\nMonash IVF has apologised for embryo mix-ups in Brisbane and Melbourne. (Pixabay, DrKontogianniIVF)\n\nThe regulator said the conditions would remain in place until it was \"satisfied the risks identified, as the result of its investigations into the incident, are effectively mitigated and Monash IVF has demonstrated sustained compliance\".\n\nIn a statement to the Australian Securities Exchange (ASX), Monash IVF said the conditions imposed by the regulator have already been implemented.\n\n\"The Company does not expect that the Conditions will have a material impact on its existing operations,\" Monash IVF said in the statement.\n\n\" The Company will continue to prioritise the care and safety of its patients and will keep ASX informed of any material developments in accordance with its disclosure obligations. \"\n\nMonash IVF launched an independent review into the embryo mix-ups, engaging barrister Fiona McLeod to look into the errors.\n\nThe review concluded the Brisbane incident was the result of human error.\n\nIt found the Melbourne incident resulted from a range of factors, including human error at multiple stages and IT system limitations \"in the very limited circumstances of an embryo transfer to a partner\".\n\nMonash IVF has resisted calls to publicly release the review, saying it would be kept secret to \"protect the privacy of the affected patients\".",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-11-28/why-the-banking-regulator-is-targeting-property-investors/106074360",
        "title": "Politics and property — why the regulator was forced to act on investor loans",
        "publish_date": "Fri, 28 Nov 2025 00:49:38 +0000",
        "category": "finance",
        "authors": [],
        "text": "More a shot across the bows than a direct hit to the engine room.\n\nJohn Lonsdale, the banking industry regulator's big kahuna, has finally taken aim at the Australian economy's biggest threat — an overheated property market that once again is accelerating.\n\nLoading...\n\nCritics have variously described the new lending restrictions as a wet lettuce or damp squib.\n\nProblem loans, they argue, are nowhere near the level of the soon-to-be-imposed limits. So, there's unlikely to be any immediate flow through to property prices.\n\nIt's difficult to argue otherwise, especially if the numbers are averaged across the industry.\n\nBut loans to property investors are growing at an alarming clip, now making up more than 40 per cent of all new loans.\n\nAnd given some banks are far more aggressive than others, it doesn't take too much for things to get out of hand.\n\nThe Australian Prudential Regulation Authority (APRA) made a similar move back in 2014 with limited success.\n\nBut three years later, it specifically took aim at investors and engineered a significant drop in housing prices before the pandemic hit.\n\nHome loan caps coming The banking regulator will impose restrictions on home loans from early next year to limit the number of \"high-risk\" large loans being issued to customers.\n\nThe move also highlights two important issues.\n\nThe first is that all our financial regulators, from Australian Securities and Investments Commission (ASIC) and APRA to the Reserve Bank, are actively eyeing off potential threats to the economy.\n\nAnd, more importantly, it perfectly illustrates why economic management across the developed world has been largely removed from government.\n\nOur housing price bubble has been ably assisted by governments stretching back more than half a century.\n\nTax incentives to invest in property and to then limit taxes on the capital gains have directed much of our savings into merely putting a roof over our heads.\n\nLoading...\n\nWhile we delude ourselves each year into believing those reports about the enormous growth in Australian household wealth — driven mostly by hugely expensive housing values — we rarely look on the other side of the ledger.\n\nThat's where close to $3.3 trillion worth of debt is sitting, overwhelmingly driven by enormous mortgages.\n\nAustralian household debt is among the highest in the world.\n\nThat poses a potential threat to our financial stability, limiting the Reserve Bank's ability to cut interest rates.\n\nThat is why APRA is acting, even if ever so meekly.\n\nLoading...\n\nThe never-ending boom\n\nIt's been called a bubble for more than 15 years. But the great Aussie housing price boom has barely skipped a beat in the intervening years.\n\nIt's outrun a global financial crisis, a pandemic that brought the global economy to a halt, and kept on rolling even through the most punishing rate-hiking program in history.\n\nHuge population growth propelled by a large rise in immigration and large amounts of fiscal and monetary stimulus have driven the momentum.\n\nOver the years, the debate has shifted.\n\nThe bubble fears — and the threat that poses to the broader economy — have been overtaken by concerns about affordability and the potential shift in Australian society that beckons.\n\nForget AI. Here's a real Aussie bubble Amid global warnings of impending financial doom, APRA and the Reserve Bank are far more concerned about a home-grown bubble, one that's been taking in oxygen for almost three decades.\n\nOnly those born into a household with property will likely ever end up owning one themselves, widening a wealth chasm that threatens to fundamentally change the way Australians see themselves.\n\nAttempts to reform the system have been political suicide.\n\nBill Shorten came to grief in 2019 with his proposal to wind back the generous tax concessions for property investors and no-one has been game to touch it since.\n\nInstead, our political leaders resort to policies that throw cash at the problem, making a dire situation even worse.\n\nIn addition to endless first home buyers' schemes, there have been repeated calls to give first home buyers access to their superannuation for a deposit.\n\nEven APRA has come under pressure to abandon or decrease its mortgage serviceability buffers.\n\nThese were implemented to specifically limit risky lending by ensuring borrowers could repay loans if rates suddenly rose.\n\nNational home prices have continued to climb over 2025. (AAP: Dan Himbrechts)\n\nPulling on the handbrake\n\nOur banks have grown fat on the back of the housing boom. And they would very much like it to continue.\n\nMortgage lending is far and away the biggest money spinner among our big banks.\n\nThe biggest, Commonwealth Bank, now holds around a quarter of all home loans across the country.\n\nWorth more than $600 billion, that's a huge exposure to one sector at just one institution.\n\nLoading\n\nNot that there are any signs of imminent trouble.\n\nOur banking system sailed almost unscathed through the worst inflationary bout in 50 years, which backed straight into a cost-of-living crisis and an incredibly steep rate-hiking cycle.\n\nDespite all that, default rates remain incredibly low, a little over 1.1 per cent, and are trending down as three rate cuts have delivered welcome relief to strained household budgets.\n\nBuying a home has never been harder Home prices have risen by almost 50 per cent in the past five years, pushing housing affordability to its worst levels on records, a new report has found.\n\nThat's largely thanks to unexpectedly strong labour markets, which kept Australians in work during the past few years even as interest rates soared.\n\nAPRA clearly is concerned that may not always be the case, given the sudden growth in investor loans and a property market on a tear, combined with a potentially weakening economy.\n\nFormer prime minister John Howard once famously quipped that he never had a home owner complain to him about rising house prices.\n\nIt's now a major cause of political division amid a roiling undercurrent of social dissent.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-11-28/aflw-grand-final-2025-what-time-does-the-game-start/106049752",
        "title": "Everything you need to know ahead of the 2025 AFLW grand final",
        "publish_date": "Fri, 28 Nov 2025 00:28:25 +0000",
        "category": "sports",
        "authors": [],
        "text": "The finale of another captivating AFLW season is finally here as North Melbourne and Brisbane meet on they final day of the season for the third straight year.\n\nHere is everything you need to know about this year's AFLW grand final.\n\nWho is playing in the AFLW grand final?\n\nLoading...\n\nThis year's AFLW grand final will be contested between North Melbourne and the Brisbane Lions.\n\nIt is the third straight year that the two sides will face off for the AFLW premiership.\n\nThe Kangaroos took out last year's grand final, while the Lions won the first grand final meeting between the two teams in 2023.\n\nIf Brisbane is successful in this year's grand final, it will be the club's third AFLW premiership — tying Adelaide for the competition record.\n\nWhat time is the AFLW grand final?\n\nThe two teams will once again play with a yellow football, given the match will finish up in night conditions. (Getty Images: Michael Willson)\n\nThe AFLW grand final takes place on Saturday, November 29. Here is the first bounce time according to which state or territory you're in:\n\n7:45pm AEDT: Victoria, New South Wales, Tasmania\n\nVictoria, New South Wales, Tasmania 6:45pm AEST: Queensland\n\nQueensland 7:15pm ACST: Northern Territory, South Australia\n\nNorthern Territory, South Australia 4:45pm AWST: Western Australia\n\nWhere is the AFLW grand final being played?\n\nThis year's grand final venue — Princes Park — hosted the first ever AFLW contest in 2017. (Getty Images: AFL Media/Adam Trafford)\n\nThis year's grand final will be once again be played at Melbourne's Princes Park.\n\nThe venue has hosted the last two grand finals as well as the 2018 decider between the Western Bulldogs and Brisbane.\n\nWhere can I watch the AFLW grand final?\n\nFans will be able to watch the game on free-to-air TV on Channel 7 as well as its streaming services.\n\nKayo Sports will also broadcast the grand final.\n\nABC Sport will run a live blog where you can follow along for all the action and analysis while you can also listen to the match live on ABC Sport via the website, local radio or the Listen app.\n\nWho is doing the pre-match entertainment?\n\nAustralian band Peking Duk will be this year's AFLW grand final pre-match entertainment. (ABC News: ABC: Greg Ryan)\n\nThis year's pre-match entertainment for the AFLW grand final will be headlined by Peking Duk.\n\nPeking Duk — which consists of Canberra-born duo Adam Hyde and Reuben Styles — are known for hits such as High, Stranger and Fire and have collected 27 platinum music awards and surpassed 400 million streams worldwide.\n\nWhat are the teams for the AFLW grand final?\n\nJasmine Garner (right) will captain North Melbourne in the AFLW grand final. (Getty: Quinn Rooney/Getty Images)\n\nNORTH MELBOURNE\n\nB: 2. Libby Birch, 20. Jasmine Ferguson\n\nHB: 9. Emma Kearney, 11. Eliza Shannon, 14. Erika O'Shea\n\nC: 15. Amy Smith, 19. Ruby Tripodi, 8. Taylah Gatt\n\nHF: 6. Alice O'Loughlin, 10. Blaithin Bogue, 35. Jenna Bruton\n\nF: 16. Tahlia Randall, 60. Emma King\n\nFOLL: 26. Kim Rennie, 7. Ash Riddell, 25. Jasmine Garner (C)\n\nINT: 33. Kate Shierlaw, 3. Bella Eddey, 5. Tess Craven, 4. Eilish Sheerin, 13. Vikki Wall\n\nEMG: 24. Tessa Boyd, 23. Mia King, 21. Amy Gavin Mangan\n\nBreana Koenen (centre) will captain Brisbane in another AFLW grand final. (Getty Images: Albert Perez)\n\nBRISBANE LIONS\n\nB: 20. Shannon Campbell, 8. Jennifer Dunne\n\nHB: 3. Breanna Koenen (C), 10. Natalie Grider, 6. Lily Postlethwaite\n\nC: 9. Orla O'Dwyer, 18. Alexander Anderson, 28. Charlotte Mullins\n\nHF: 21. Courtney Hodder, 31. Taylor Smith, 12. Sophie Conway\n\nF: 25. Catherine Svarc, 14. Dakota Davidson\n\nFOLL: 2. Tahlie Hickie, 5. Jade Ellenger, 17. Isabel Dawes\n\nINT: 11. Shanae Davison, 13. Neasa Dooley, 7. Ellie Hampson, 1. Eleanor Hartill, 29. Ruby Svarc\n\nEMG: 15. Poppy Boltz, 16. Evie Long, 22. Sophie Peters\n\nWho are the key players for each team?\n\nKangaroos midfielder Ash Riddell was named the league's best and fairest winner for this season. (Getty Images: Steve Bell)\n\nThere will be no shortage of talent on either side in the AFLW grand final. Jennifer Dunne and Courtney Hodder are Brisbane's All-Australian representatives, while Tahlia Randall, Jasmine Garner, Ash Riddell and Blaithin Bogue were North's All-Australians.\n\nRiddell was recently voted as the league best and fairest for the 2025 season after averaging a career-high 35.3 disposals and 5.1 clearances per game in 14 appearances so far this season.\n\nCourtney Hodder looms as a potential game-changer in the forward half for Brisbane. (Getty: Janelle St Pierre/AFL Photos)\n\nBogue is currently the equal leading goal-kicker in the league having kicked 25 majors this season, while Randall has 23.\n\nWhile she didn't make the All-Australian team, Alexandra Anderson also looms as a key player for Brisbane, having averaged 24.9 disposals per game through 14 appearances this season.\n\nWho are the coaches for each team?\n\nDarren Crocker (left) is aiming to become the first AFLW coach to win back-to-back premierships.\n\nNorth Melbourne is coached by Darren Crocker, who was the coach of the Kangaroos' premiership side last season.\n\nCrocker played 165 games for North Melbourne's men's side and was a part of the 1996 men's premiership team.\n\nHe also holds the rare distinction of having coached both North Melbourne's men's and women's teams.\n\nCrocker has coached North's women's side since 2021.\n\nCraig Starcevich is aiming to win his third AFLW premiership as Brisbane coach. (AAP: Jason O'Brien)\n\nBrisbane is coached by Craig Starcevich, who has already coached the Lions to two premierships in 2021 and 2023.\n\nStarcevich played 144 games in the VFL/AFL, first with Collingwood and then the Brisbane Bears between 1987 and 1995.\n\nHe was a member of Collingwood's men's premiership side in 1990 and has been the only coach of Brisbane's women's team.\n\nWhat is the recent history between North and Brisbane?\n\nThe most recent history favours North Melbourne, with the Kangaroos having won the previous three clashes against the Lions to hold a 3-2 head-to-head record in the two teams' last five clashes.\n\nRound 5, 2025: North Melbourne 10.5 (65) def. Brisbane 5.6 (36)\n\nGrand Final, 2024: North Melbourne 6.3 (39) def. Brisbane 1.3 (9)\n\nRound 1, 2024: North Melbourne 12.6 (78) def. Brisbane 5.4 (34)\n\nGrand Final, 2023: Brisbane 7.2 (44) def. North Melbourne 4.3 (27)\n\nRound 4, 2023: Brisbane 5.5 (35) def. North Melbourne 5.3 (33)\n\nHow many AFLW premierships have these teams won?\n\nNorth Melbourne and Brisbane are meeting in the AFLW grand final for the third straight year. (Getty Images: Michael Willson)\n\nNorth Melbourne is gunning for its second straight premiership having broken through last season. If the Kangaroos are successful, they will become the first team in AFLW history to win back-to-back premierships.\n\nBrisbane is aiming to win its third AFLW premiership after successes in 2021 and 2023. The Lions have made the grand final in seven out of nine AFLW seasons since the competition's inception in 2017.\n\nWhat is the weather forecast for the AFLW grand final?\n\nIt is set to be a classic cold Melbourne day on Saturday night when the grand final kicks off.\n\nThe temperature is expected to hover between 14 and 16 degrees but conditions are expected to be dry with no rainfall during match action.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-11-28/super-netball-could-grow-to-10-teams-by-2027/106077068",
        "title": "Super Netball eyes expansion as it seeks two new teams",
        "publish_date": "Fri, 28 Nov 2025 00:21:14 +0000",
        "category": "sports",
        "authors": [],
        "text": "Super Netball could have two additional teams by 2027, with Netball Australia (NA) calling for expressions of interest to expand the competition.\n\nThe league is currently operating with eight teams, with the Melbourne Mavericks the most recent to join the competition last year.\n\nThe Mavericks effectively replaced Collingwood, who handed back their licence at the end of the 2023 season after seven years.\n\nBut with more international players joining the world's strongest league and demand from Australian players and fans growing, NA is also keen to keep rival competitions like the AFLW from raiding the talent pool.\n\nJo Weston (right) celebrates with her Melbourne Vixens teammates after winning the 2025 Super Netball title. (AAP: Joel Carrett)\n\nThe NA board has not approved expansion, but it has \"formally endorsed the strategic intent to explore and evaluate opportunities for growth\" and is expected to sign off.\n\nThe governing body announced they were inviting expressions of interest (EOI) from qualified organisations and consortia seeking to secure a new team owner licence.\n\nThis follows the release of a 10-year strategic plan this week to entrench Super Netball as Australia's most popular women's sports league and have the Diamonds become the most-recognised national women's sports team.\n\nWhen the Mavericks, owned by media mogul Craig Hutchison's Sport Entertainment Network, won the last bid, Netball Victoria had made a submission for the eighth licence for a regional-based team in the state's western corridor in Geelong, Ballarat or Bendigo.\n\nNetball Tasmania has also previously signalled interest in joining Super Netball.\n\nStream End Game with Tony Armstrong on ABC iview Tony Armstrong tackles Australia's overdue reckoning with racism in sport with the help of some of its biggest sports stars.\n\nNetball Australia boss Stacey West said the EOI process reflected the ambition of the sport, which had record-breaking attendance at games this season, including a sold-out grand final crowd of more than 15,000.\n\n\"The Super Netball League has never been stronger … it is clear the league has grown significantly over the past decade,\" West said in a statement on Friday.\n\n\"As we look toward the next era, it is vital that any expansion is strategic, sustainable and aligned with the long-term vision of Australian netball.\n\n\"Investing in women's sport presents a dynamic space for innovation, growth and purpose, and we look forward to engaging with interested parties as we consider the next stage of evolution for [Super Netball].\"\n\nAAP",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-11-28/pharmacist-award-ouyen-regional-communities-rural-healthcare/105999812",
        "title": "Regional pharmacist wins award for dedication to patients and community",
        "publish_date": "Fri, 28 Nov 2025 00:17:04 +0000",
        "category": "finance",
        "authors": [],
        "text": "When residents of the north-west Victorian town of Ouyen stop by their local pharmacy, they know they are getting much more than just their prescription filled.\n\nThe pharmacy is a one-stop shop for not only medical supplies, but community connection and advice that can save lives.\n\nOwner Alex Look, 34, has become a familiar face in the town of about 1,000 people since purchasing the pharmacy in 2021.\n\nHe said the relationship between community pharmacists and their patients was not just transactional, but often \"unique and special\".\n\n\"Sometimes that's very rewarding because we can see the journey that people make throughout their life, but also it can be quite challenging because people sometimes come to us in times of crisis and times of need,\" he said.\n\n\"The fact that they can come in at any time without an appointment and discuss a wide range of issues, joys and troubles, at the same time, it's really powerful.\"\n\nAlex Look says the relationship between pharmacists and patients is \"unique\". (Supplied: Ouyen Pharmacy)\n\nIn early November, Mr Look was awarded International Pharmacist of the Year by the Pharmacy Innovation Assembly in Melbourne.\n\nThe award recognises pharmacists from diverse backgrounds who are making meaningful and lasting impacts on the profession.\n\nMr Look said it was an honour to be recognised for his contribution to the community, which he believed should receive the same level of healthcare as any in the city.\n\n\"We shouldn't be second class citizens just because we live in a rural town; we deserve access to high quality medications and care,\" he said.\n\n\"That's why we're fighting for our patients and our community for all these different services that we can offer to make it more accessible because we know it's difficult living in country towns.\n\n\"We want to be able to be the solution.\"\n\nIncreasing vaccination access\n\nEarlier in the year, Mr Look introduced Q Fever vaccination services to the pharmacy.\n\nQ Fever is a disease caused by bacteria, which spreads from cattle, sheep and goats, as well as other domestic and wild animals, to humans.\n\nAlex Look with farmer Linton Hahnel at the the Ouyen Livestock Exchange. (Supplied: Ouyen Pharmacy)\n\nMr Look said accessing the vaccination had been difficult for people in Ouyen, which is known for its grain and livestock farming.\n\n\"We were getting a lot of inquiries from people in the community and within hundreds of kilometres away saying they can't access this vaccination very readily,\" he said.\n\n\"The reason for that is it is a multi-step process requiring blood tests, skin tests and then the vaccination itself.\n\n\" A lot of people were requiring this, and they just weren't getting the vaccination done. \"\n\nAlex Look is a much-loved member of the Ouyen community. (Supplied: Ouyen Pharmacy)\n\nNow farmers do not have to travel further than Ouyen to access the service.\n\n\"We're actually saving patients approximately six to seven hours at least per course of vaccination,\" he said.\n\n\"It's been really helpful for our local community.\"\n\nOuyen Inc co-chair Jason Wills said Mr Look had been a strong advocate for the town, continually pushing for health equity.\n\n\"He really cares about people and he's showing that with all the services that he's offering out of the pharmacy,\" he said.\n\n\"It's a huge thing in small towns for people to know that people are out there helping them.\"\n\nInnovative approach\n\nPharmacy Innovation Assembly founder Ann Coo said Mr Look was selected from over 100 nominations due to his \"exceptional\" repertoire and his care for the community.\n\n\"You can see on his socials he is very active, and he really connects with the patients on a personal level rather than just seeing that patient as someone that walks in your door,\" she said.\n\n\"He really goes that extra mile in saying 'what does the community need and how can I treat my patients better' … that is who Alex is.\"\n\nAnn Coo says Alex Look goes above and beyond for his patients. (Supplied: Pharmacy Innovation Assembly)\n\nMr Look is also a Justice of the Peace, has been involved in Ouyen Inc, runs a food van and offers delivery services for patients.\n\nMs Coo said Mr Look's introduction of the Q Fever vaccination had really stood out to the assembly.\n\n\"That is a major contribution to local healthcare, it's not very usual practice for a pharmacist to do that,\" Ms Coo said.\n\nPositive move to the regions\n\nBefore moving to Ouyen, Mr Look had worked in various locations, including in Western Australia, Queensland, Broken Hill, and Mildura.\n\nHe said moving to Ouyen was the \"best decision\" he had ever made and the community's drive inspired him.\n\n\"I think that often pharmacists or people in general have some concerns about going to small towns about what they can do or making friends or whatnot,\" he said.\n\n\"But in fact, my experience has been incredible and even as a person of diverse background … I've had nothing but positive experiences.\"\n\nAlex Look and Alexandra Lynn service the rural town of about 1,100 people. (Supplied: Phil Down)\n\nMr Wills said the town was lucky to have Mr Look as a part of the community.\n\n\"He's putting his own time and money into the town, the pharmacy, and that's not his only business; he has a food van as well,\" he said.\n\n\"He puts himself out there, he calls this place his home and we really appreciate that.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-11-28/wa-challenged-over-fast-tracking-mining-exploration-approvals/106055862",
        "title": "Court to test claims mining exploration fast-tracked at expense of native title",
        "publish_date": "Thu, 27 Nov 2025 22:29:31 +0000",
        "category": "finance",
        "authors": [],
        "text": "Traditional owners in Western Australia's north have launched legal action against the state government claiming it is fast-tracking mining and exploration projects at cultural expense.\n\nUnder the Native Title Act 1993 mining companies are required to negotiate with traditional owners before getting approval to work on Country.\n\nBut this process can be bypassed using \"expedited procedure\", intended for projects unlikely to interfere with traditional owners' rights or damage culturally significant sites.\n\nHighest rate in country\n\nWA has the highest rate of approving mining exploration tenements through expedited procedure, according to the National Native Title Tribunal.\n\nWA QLD NT NSW VIC SA TAS Expedited 80,538 7,131 4,707 7 0 0 N/A Not expedited 9,469 2,864 515 633 855 57 N/A\n\nKimberley Land Council (KLC) chief executive Tyronne Garstone said it was \"a loophole being exploited\".\n\n\"We believe the expedited procedure process is limiting the ability for traditional owners to protect their cultural heritage and really exercise their native title rights,\" he said.\n\n\" There's a blatant position by the state government to try and fast-track development and disengage with traditional owners. \"\n\nCalls for meaningful engagement\n\nThe Kimberley Land Council has launched a Federal Court appeal claiming the unfair fast-tracking of mining exploration. (Supplied )\n\nThe Federal Court appeal made by KLC, alongside Malarngowem Aboriginal Corporation, Yanunijarra Aboriginal Corporation and Walalakoo Aboriginal Corporation, said a significant amount of resources were used to fight expedited procedure cases.\n\nIt said Australian business tycoon Andrew Forrest's Fortescue Metals Group (FMG) applied for 110 exploration licences in the Kimberley between 2021 and 2022.\n\nUnder expedited procedure the WA government fast-tracked 92 applications.\n\nAndrew Forrest's FMG has exploration projects approvals fast-tracked under expedited procedure. (ABC Capricornia: Katrina Beavan)\n\nKLC objected to every expedited case and after three years of negotiations, in 2025, FMG had withdrawn from about 90 of the licence applications.\n\n\"The state government is pushing the responsibility [to challenge cases] back onto traditional owners and also the land councils … and that is onerous and traumatic,\" Mr Garstone said.\n\n\"We've collected enough evidence now for a strong case to prove the use of expedited procedure has been inappropriately applied.\"\n\nThe appeal comes as the WA Law Society said the government's new State Development Bill gave Premier and State Development Minister Roger Cook \"extraordinary powers to override\" conventional environmental protection safeguards.\n\nThe State Development Bill is before the Legislative Council of Western Australia.\n\n'Disrespectful and counter-productive'\n\nWalalakoo Aboriginal Corporation executive chairperson Robert Watson said the expedited procedure created legal conflict and harmed cultural authority.\n\nRobert Watson says the current system makes shortcuts around traditional owners rights. (Supplied)\n\n\"We fought for years to have our native title recognised, but the way the state applies the expedited procedure means companies and government can walk straight past us,\" he said.\n\n\"It feels like we are again being marginalised in decisions about our own Country.\n\n\" We have always complied with the western legal system, but the system keeps looking for shortcuts around our rights. \"\n\nMr Watson said positive relationships that engaged with traditional owners were essential for the long-term success of development projects.\n\nA state government spokesperson said it was not appropriate to comment given the matter was before the courts.\n\n\"The WA government complies with the statutory requirements of the Native Title Act and notes the full Federal Court has heard argument and reserved its decision on this matter,\" they said.\n\nThe Federal Court is reviewing the evidence and arguments before making a determination.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-11-28/fuzzy-zoeller-masters-and-us-open-champion-dies-aged-74/106076532",
        "title": "Fuzzy Zoeller, who beat Greg Norman to win 1984 US Open playoff, dies",
        "publish_date": "Thu, 27 Nov 2025 22:25:35 +0000",
        "category": "sports",
        "authors": [],
        "text": "Fuzzy Zoeller, a two-time major champion and one of golf's most gregarious characters whose career was tainted by a racially insensitive joke about Tiger Woods, has died aged 74.\n\nA cause of death was not immediately available. Brian Naugle, the tournament director of the Insperity Invitational in Houston, said Zoeller's daughter called him Thursday with the news.\n\nZoeller was the last player to win the Masters on his first attempt, a three-man playoff in 1979.\n\nIn the 1984 US Open at Winged Foot, Zoeller famously waved a white towel when he thought Greg Norman had beat him, only to defeat Norman in an 18-hole playoff the next day.\n\nBut it was the 1997 Masters that changed his popularity.\n\nWoods was on his way to a watershed moment in golf with the most dominant victory in Augusta National history.\n\nZoeller had finished his round and had a drink in hand under the oak tree by the clubhouse when he was stopped by CNN and asked for his thoughts on 21-year-old Woods.\n\n\"That little boy is driving well and he's putting well. He's doing everything it takes to win. So, you know what you guys do when he gets in here? You pat him on the back and say congratulations and enjoy it and tell him not serve fried chicken next year. Got it?,\" Zoeller said.\n\nThe Champions Dinner, where the defending Masters champion chooses the menu, is traditionally held on Tuesday at Augusta National, two days before the opening round.\n\nHe smiled and snapped his fingers, and as he was walking away he turned and said, \"Or collard greens or whatever the hell they serve\".\n\nThat moment haunted him the rest of his career.\n\nZoeller apologised. Woods was travelling and it took two weeks for him to comment as the controversy festered. Zoeller later said he received death threats for years after that moment.\n\nWriting for Golf Digest in 2008, he said it was \"the worst thing I've gone through in my entire life\".\n\n\"If people wanted me to feel the same hurt I projected on others, I'm here to tell you they got their way,\" Zoeller wrote.\n\n\"I've cried many times. I've apologised countless times for words said in jest that just aren't a reflection of who I am. I have hundreds of friends, including people of colour, who will attest to that.\n\n\"Still, I've come to terms with the fact that this incident will never, ever go away.\"\n\nIt marred a career filled with two famous major titles, eight other PGA Tour titles and a Senior PGA Championship among his two PGA Tour Champions titles.\n\nMore than winning was how he went about it. Zoeller played fast and still had an easygoing nature to the way he approached the game, often whistling between shots.\n\nHe made his Masters debut in 1979 and got into a three-way playoff when Ed Sneed bogeyed the last three holes. Zoeller defeated Sneed and Tom Watson with a birdie on the second playoff hole, flinging his putter high in the air.\n\n\"I've never been to heaven, and thinking back on my life, I probably won't get a chance to go,\" Zoeller once said.\n\n\"I guess winning the Masters is as close as I'm going to get.\"\n\nZoeller was locked in a duel with Norman at Winged Foot in the 1984 US Open, playing in the group behind and watching Norman make putt after putt. So when he saw Norman make a 40-footer on the 18th, he assumed it was for birdie and began waving a white towel in a moment of sportsmanship.\n\nOnly later did he realise it was for par, and Zoeller made par to force a playoff. Zoeller beat him by eight shots in the 18-hole playoff (67-75). Zoeller's lone regret was giving the towel to a kid after he finished in regulation.\n\nStream End Game with Tony Armstrong on ABC iview Tony Armstrong tackles Australia's overdue reckoning with racism in sport with the help of some of its biggest sports stars.\n\n\"If you happen to see a grungy white towel hanging around, get it for me, will you?\" he once said.\n\nHe was born Frank Urban Zoeller Jr in New Albany, Indiana.\n\nZoeller said his father was known only as \"Fuzzy\" and he was given the same name. He played at a junior college in Florida before joining the powerful Houston golf team before turning pro.\n\nZoeller was awarded the Bob Jones Award by the USGA in 1985, the organisation's highest honour given for distinguished sportsmanship.\n\nAP/Reuters",
        "source": "ABC"
    },
    {
        "url": "https://www.smh.com.au/national/australia-news-live-hong-kong-fire-death-toll-climbs-senate-inquiry-to-scrutinise-corrupt-nauru-deals-20251128-p5nj5l.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Australia news live: Hong Kong fires death toll climbs as recovery efforts continue in Tai Po; Environment laws overhauled for first time in 25 years",
        "publish_date": "Fri, 28 Nov 2025 12:38:44 +1100",
        "category": "finance",
        "authors": [
            "Emily Kaine",
            "Cassandra Morgan"
        ],
        "text": "The controversial law protecting feral horses in Kosciuszko National Park was repealed in a late-night sitting of the NSW upper house last night.\n\nThe private members bill, moved by independent MP Joe McGirr MP, has now passed both houses of parliament after clearing the lower house in October.\n\nFeral horses, also known as brumbies or wild horses, in Kosciuszko National Park in 2021. Credit: Alex Ellinghausen\n\nThe repeal, supported by the Minns government, the Liberals, the Greens and a number of independents, means that future decisions on feral horse management in Kosciuszko National Park can be made in the same way as other feral management decisions in other national parks.\n\nThe Kosciuszko Wild Horse Heritage Act 2018 was spearheaded by former NSW Nationals leader John Barilaro during the former Coalition government, and required the population of feral horses to be maintained at no less than 3000 in certain retention areas of the park. The rationale was that the presence of the horses, also called brumbies, in the Snowy Mountains landscape was considered part of Australia’s colonial heritage.\n\nHowever, the feral horses also damaged the delicate Alpine ecosystems of the High Country on the NSW-Victorian border and put native species at threat.\n\nLoading\n\nThe population of 3000 wild horses will be maintained until mid-2027 when the current statutory management plan for the national park expires.\n\nNSW Environment Minister Penny Sharpe said this was a landmark decision by a cross-party group to protect the state’s only alpine national park.\n\n“I have visited Kosciuszko National Park and clearly seen that control of wild horses is enabling the natural ecosystem to bounce back,” Sharpe said. “This bill will ensure that horses are treated the same way as other invasive species in NSW national parks.”\n\nBe the first to know when major news happens. Sign up for breaking news alerts on email or turn on notifications in the app.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/victoria/monash-ivf-hit-with-conditions-after-melbourne-embryo-mix-up-20251128-p5nj7i.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Monash IVF hit with conditions after Melbourne embryo mix-up",
        "publish_date": "Fri, 28 Nov 2025 12:38:32 +1100",
        "category": "finance",
        "authors": [
            "Henrietta Cook"
        ],
        "text": "Victoria’s health watchdog has placed conditions on Monash IVF’s registration after a Melbourne patient’s own embryo was mistakenly transferred to her, during a procedure in which she was supposed to receive her partner’s embryo.\n\nThe conditions, imposed by Victoria’s Health Regulator, are focused on making sure all genetic material is clearly tracked and accounted for, requiring better patient consent and record-keeping.\n\nVictoria’s health regulator has placed conditions on Monash IVF following a second embryo mix-up. Credit: Getty Images/iStockphoto\n\nThe conditions will also require Monash IVF to conduct rigorous verification and patient checks, accurate recording in management systems and strengthened staff capabilities.\n\nThe regulator said it met with Monash IVF several times, conducted site visits and ordered the IVF company to hand over documents, which it complied with.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/business/markets/asx-set-to-slide-global-sharemarkets-steady-20251128-p5nj54.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "ASX edges higher despite falls in miners, banks; Woolworths jumps",
        "publish_date": "Fri, 28 Nov 2025 12:38:04 +1100",
        "category": "finance",
        "authors": [
            "Staff Reporters"
        ],
        "text": "The Australian sharemarket has erased early losses and crept into the green at lunchtime but the big four banks and iron ore miners are weighing on the bourse.\n\nThe S&P/ASX 200 was 10.6 points, or 0.1 per cent, lower to 8606.7 in early trade, with seven of 11 industry sectors in positive territory.\n\nSome big names are weighing on the ASX on Friday. Credit: Oscar Colman\n\nFinancial stocks are weaker with the big four banks all lower. Commonwealth Bank retreated 0.3 per cent, National Australia Bank shed 0.4 per cent, ANZ Bank lost 0.7 per cent and Westpac gave up 0.2 per cent in early afternoon trade.\n\nMining stocks are mixed with iron ore giants BHP (down 0.2 per cent), Rio Tinto (down 0.5 per cent) and Fortescue (down 0.1 per cent) losing ground. Gold miners have strengthened during the session, with Northern Star up 1.1 per cent and Evolution Mining adding 0.4 per cent.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/culture/comedy/is-this-the-world-s-most-infuriating-comedian-he-certainly-hopes-so-20251120-p5nh2o.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Is this the world’s most infuriating comedian? He certainly hopes so",
        "publish_date": "Fri, 28 Nov 2025 12:20:08 +1100",
        "category": "entertainment",
        "authors": [
            "Richard Jinman"
        ],
        "text": "Save Log in , register or subscribe to save articles for later. Save articles for later Add articles to your saved list and come back to them any time. Got it Normal text size Larger text size Very large text size Luke McQueen once sold out a theatre in Edinburgh by telling a big lie: he promoted the show as a gig by the hugely popular Scottish comedian Frankie Boyle. When McQueen, who bears no resemblance to Boyle, sidled onto the stage, he was met by stunned silence. “Er, Frankie Boyle’s not coming,” he told the audience. “It’s just me, Luke McQueen. Give me a cheer if you’ve heard of me.” No one cheered. The only sound was the scraping of chairs as people stood up and headed for the exit. One enraged punter kicked McQueen’s collection bucket across the stage on his way out. “Guys, don’t go. I’m funny,” pleaded the man on stage. Deliberately upsetting a crowd of Frankie Boyle fans would make most people nervous, but McQueen isn’t one of them. “I thought the whole thing was so exciting,” he says of the 2014 gig. “The thing I love more than anything is committing to an idea.” The bogus Frankie Boyle show is typical of McQueen’s highly conceptual approach to comedy. His work often starts with a palpable truth – in this case, the fact it’s extremely hard to sell tickets to Edinburgh shows that don’t feature big names – before spinning off into the realms of pure imagination. The McQueen who walked out on stage and told the audience they weren’t going to see Frankie Boyle was a character; his attempt to turn confusion and disappointment into comedy was the performance. “I was originally going to tell people they were going to see a gig by Ricky Gervais,” admits McQueen when I meet him at a theatre in London’s Soho. “I emailed Ricky and said ‘I’ve had this idea – do you mind if I do it?’ He replied that he thought it was really funny, but he couldn’t say yes because he couldn’t knowingly upset his fans. Which is totally fair. So, I used Frankie Boyle without asking.” Another example of comedic identity theft from McQueen’s oeuvre is a performance in which he claimed (entirely fictitiously) to be the former stage partner of the English comedian Jack Whitehall. McQueen professed to be so embittered at being usurped by Whitehall’s dad, he’d written an entire show about it. There is video footage of Whitehall walking on stage during a performance of the show in Edinburgh, an incident McQueen insists was not staged. McQueen says his comedy often plays with notions of likeability. Unlikeability might be a better description. There’s a video of him shaving his head in the middle of a crowded ice rink, an act of atonement designed to win back an ex-girlfriend.\n\nAdvertisement\n\nHe once poured a can of soup on his head in front of a Van Gogh at London’s National Gallery in a parody of the Just Stop Oil protests and he’s staged a fake reality show called The Luke of Love, offering a group of unsuspecting female contestants the chance to date him. The perplexed women were hooked up to a polygraph machine and asked questions such as: “Do you know where my biological mother is?” In every case, he insists he was firmly in character. “I couldn’t do this kind of thing as me,” he shrugs. “It would be obnoxious.” He’s very much in character – albeit a character who happens to be a comedian called Luke McQueen – in the show he’s bringing to next year’s Melbourne International Comedy Festival. It’s called Luke McQueen: Comedian’s Comedian, and it takes some explaining. Loading The title refers to a popular podcast hosted by an English comedian called Stuart Goldsmith. Since the first episode was recorded in 2012, hundreds of guests – a who’s-who of hilarity ranging from Jimmy Carr and Tim Minchin to Stewart Lee and Katherine Ryan – have discussed the serious business of making people laugh. One person who has never been asked to appear is ... Luke McQueen. Furious at being ignored, McQueen phones Goldsmith and demands to know why he’s been snubbed. A recording of their toe-curling conversation – which ends with Goldsmith hanging up the phone – is played at the start of the show. McQueen runs the recording through an AI voice generator and clones the podcast host’s voice. Like a malignant ventriloquist, he has acquired the ability to put words in his nemesis’s mouth.\n\nAdvertisement\n\nWith Goldsmith represented on stage by a shop mannequin topped with a disturbing homemade head, McQueen sets about staging his own edition of Comedian’s Comedian. At first, things go to plan. McQueen, a preening figure in a brown suit, answers a series of fawning questions he’s written himself. “You’re largely regarded as one of the most innovative comedians in the world,” says AI Goldsmith. “How does that make you feel?” “Bored,” sniffs McQueen, running a hand through his lustrous hair. Halfway through the show, things take a dark turn. The AI – which everyone knows can’t be trusted – malfunctions. The questions go off script; they become hostile and deeply personal. What follows is an unhinged, brutally funny journey into the darkest corners of McQueen’s psyche as he’s eviscerated by his algorithmic interlocutor. As ever, it’s hard to discern how much of the show is real. Was Goldsmith in on the joke all along? McQueen ponders the question, then replies, “You’ll think this is a lie, but I swear it’s the truth: I simply don’t know.” Luke McQueen outside the BBC in 2018, protesting against the airing of his show The Luke McQueen Pilots. Credit: PA Images via Getty Images He’s just as evasive when I ask him what happened when Goldsmith attended a performance of the show in Edinburgh. “I don’t want to ruffle those feathers,” he says. “I’ve got to be careful.” While McQueen is happy to discuss his comedy, he hands-down refuses to talk about himself. Requests for basic biographical details are met with silence. “I expect I’ll regret this interview because I don’t like being myself in public,” he says at one point. “My personal life is not anyone’s business. The only thing you need to know about me is my work.” He smiles apologetically. “I’m not trying to be difficult. I don’t mind if you know my age or where I was born. But I also think ’why do I have to tell you?’”\n\nAdvertisement\n\nIn an age when relentless self-promotion is the norm for entertainers seeking to connect with their audience, this is an unusual stance, to say the least. But McQueen is something of a digital ghost. Wikipedia has yet to discover him, he ditched most of his social media accounts during the pandemic and there are no interviews in which he sheds light on anything relating to his personal life. Under pressure, he reveals that he studied performing arts at the University of Bedfordshire, where an inspirational tutor encouraged him to see comedy as a gateway to acting. “When I started, I genuinely didn’t know much about comedy,” he says. “Ricky Gervais was probably the most alternative comedian I knew. Obviously, I’m friends with a lot of comedians now and a lot of them are comedy nerds. They love it. But even now I’m not a super fan.” Luke McQueen says he’s “not a super fan” of comedy. At times, he admits, comedy has felt like a straitjacket. He’d love to do more acting and directing, but it can be difficult breaking free of the festival circuit and the exhausting demands of writing and performing a new comedy show every couple of years. Producers and commissioners can have a blinkered view of performers and often want facsimiles of successful shows. “I think repetition is the most disgusting thing in terms of creativity,” he says. “The idea that we need to find something that’s like something that’s come before is pathetic.” His persona in Luke McQueen: Comedian’s Comedian – a fragile, thin-skinned man who responds to rejection by turning his impotent rage on a podcast host – is not entirely fictitious. “I play with the truth, but that doesn’t mean there isn’t any truth in it,” he says. “A lot of the character’s arrogance and bravado is like me screaming at the industry ‘what is your problem?’” He is, by his own admission, still trying to make it. He’s brimming with ideas for films, TV shows and stage productions, but acknowledges it’s tough standing out from the crowd. “There’s loads more that I want to do in this world, but I don’t know if I ever will,” he says.\n\nAdvertisement",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/10-of-pauline-hansons-most-controversial-moments-20251128-p5nj81.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "10 of Pauline Hanson's most controversial moments",
        "publish_date": "Fri, 28 Nov 2025 12:11:35 +1100",
        "category": "finance",
        "authors": [],
        "text": "10 of Pauline Hanson's most controversial moments\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/culture/books/are-the-doomsayers-right-are-we-living-in-post-literate-times-20251121-p5nhee.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Are the doomsayers right? Are we living in post-literate times?",
        "publish_date": "Fri, 28 Nov 2025 12:00:00 +1100",
        "category": "finance",
        "authors": [
            "Jane Sullivan"
        ],
        "text": "Let the bells toll as we bid a sad farewell to the book because we will never see its like again.\n\nI’ve been hearing laments like this all my life, and so far, the book has been remarkably chirpy for a species constantly threatened with extinction. But could the doomsayers be right this time?\n\nHas the bell finally tolled for books? Credit: Alamy Stock Photo\n\nThere’s been a flurry of recent articles on this subject, and perhaps the longest and most terrifying jeremiad has come from The Times writer James Marriott. “Welcome to the post-literate society,” he says in his Substack newsletter Cultural Capital. He gives us a potted history of the print revolution and how it changed the world. And now, he says, we are living through the counter-revolution. Back to a feudal age. Nothing will ever be the same again. Blimey.\n\nHe quotes statistics showing that reading is “in free-fall”. In the US, reading for pleasure has fallen by 40 per cent in the past 20 years. In the UK, more than a third of adults say they have given up reading. The OECD found recently that literacy levels were declining or stagnating in most developed countries.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/queensland/steamy-to-sweltering-how-to-get-80-000-grants-after-severe-hail-20251128-p5nj71.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Steamy to sweltering: How to get $80,000 grants after severe hail",
        "publish_date": "Fri, 28 Nov 2025 11:54:34 +1100",
        "category": "finance",
        "authors": [
            "Catherine Strohfeldt"
        ],
        "text": "Queenslanders battered by severe hail storms will get access to payments of $80,000 after repeated weather blows triggered government-funded hardship assistance, as the region swaps storms for intense heat.\n\nThe joint-funded federal and state grants are available for suburbs north of Brisbane, including Bribie Island, parts of the Moreton Bay region along the coast, through Caboolture and inland up to Woodford.\n\nThe largest grants cover uninsured homes that suffered significant structural damage, although payments up to $900 are available for residents severed from power, water or essential goods and services.\n\nMinister for Disaster Recovery Ann Leahy said power had been restored to more than 170,000 homes since Saturday, with the rolling storms a reminder to “be ready for anything”.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/cricket/how-the-changing-nature-of-test-cricket-has-left-lyon-in-a-spin-20251127-p5niup.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "How the changing nature of Test cricket has left Lyon in a spin",
        "publish_date": "Fri, 28 Nov 2025 11:50:54 +1100",
        "category": "sports",
        "authors": [
            "Tom Decent"
        ],
        "text": "He carried the drinks that week in Jamaica during a pink ball game, bowled two overs in Perth last week as England were skittled twice, and might be surplus to requirements in Brisbane. What does that say about the future of spin bowling in Australia? And what does it say that Joe Root’s part-time off-spin is all England think they need? Joe Root took 0-12 from one over in the first Test in Perth. Credit: Getty Images “Joe Root as your national team spin bowler would make anyone who cares about cricket cry. It’s so totally embarrassing,” MacGill says. “How haven’t they cultivated other spinners? “However, I don’t think we’ve done a good enough job developing our own spin bowlers.”\n\nShane Warne was spin bowling’s most powerful advocate, always spruiking the value of having a slow bowler in an XI. His presence is missed by tweakers everywhere. “Shane Warne would be turning in his grave,” says ex-Australian leg-spinner Kerry O’Keeffe. “He’d just be teeing off, wouldn’t he? Former Australian cricketer Stuart MacGill. Credit: Getty Images “Warnie contends – and it’s fair – that if it seams, it spins. It sounds like a cliché, but when it seams, matches end early. “Is it now just marking time on Australian pitches and waiting for the trips to the subcontinent? That can disillusion young spinners on the way up that they’re only going to play in certain parts of the world.”\n\nLast summer, Lyon bowled 122.4 overs – the fewest he has sent down in a home campaign in his career. There is every chance Lyon plays a pivotal role in Adelaide, Melbourne and Sydney. But if Australia’s greatest off-spinner isn’t even guaranteed a game – or bowling fewer overs – what does that mean for a craft already under siege as Australian pitches offer more for the quicks? Lyon spoke about the issue in August. “I know how important spin bowling is, but there is a degree of me that’s concerned about spin bowling around the world, not just Australia, with the wickets we’re playing on,” Lyon said.\n\n“If you look at spin bowling and your younger spin bowlers around the country, they’re not getting the overs or the opportunities to bowl on day-three, day-four wickets, or spinning wickets, or even green seamers because the fast bowlers are dominating.” O’Keeffe understands where Lyon is coming from. “He was such a big part of home campaigns and now every pitch they play on affords sideways movement for the quicker bowlers and it lasts most of the match,” O’Keeffe says. “Nine wickets for Lyon last summer in a winning series against India is bittersweet.” Former Test spinner Stephen O’Keefe, who took 301 first-class wickets at 24.66, remains bullish about Australia’s depth but concedes Lyon’s situation could disillusion some.\n\n“Domestically, I think we’re in the strongest position we’ve been in a long time in terms of depth,” O’Keefe says. “Mitch Swepson, Tanveer Sangha, Corey Rocchiccioli, Todd Murphy, Ben Manenti and Matt Kuhnemann are there, and I think all of them have the potential to play for Australia. The hard part is when they look up and don’t see a spinner playing. “I’m picking a spinner every day of the week, even in this pink ball game. Steve O’Keefe celebrates one of his 12 wickets during the 2017 Test in Pune. Credit: AP “If Nathan doesn’t play at the Gabba and bowls two overs in Perth, I think is really worrisome for domestic spinners. Five Tests, and you don’t need a spinner for two? That would be so disappointing. “Maybe do what Beau Webster did. Stop bowling offies and take up medium pace. That might be the shortest path into the Australian team because that seems more effective. In Australia, it is quite tough, so we need to judge our spinners a little differently.”\n\nIt is expected England will only double down with the bat in Brisbane. Even at 2-0 down, Ben Stokes and Brendon McCullum won’t deviate from their aggressive method. Lyon loves bowling on day-five pitches, but unless Australia’s batters pile on runs, that scenario may not materialise this series. “I think Bazball, if anything, increase his chances of playing,” O’Keefe says. “They may go hard at him, but in Australia he’s one of the hardest spinners to attack on bigger grounds. I’m backing him as a weapon. He’s just as effective to break a partnership or knock over one of their top order batters as much as Scotty Boland is.” Both Kerry O’Keeffe and MacGill have an eye on the future. They are excited by young Sydney leg-spinner Tom Brooks, who took 6-44 for NSW’s second XI this week against Tasmania and bowls “big ripping leg breaks”. But Lyon’s predicament could have a ripple effect in the years to come.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/soccer/rodriguez-on-target-from-halfway-20251128-p5nj9h.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Rodriguez on target from halfway",
        "publish_date": "Fri, 28 Nov 2025 11:50:18 +1100",
        "category": "finance",
        "authors": [],
        "text": "Rodriguez on target from halfway\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/nsw/sydney-woolies-that-time-forgot-faces-uncertain-future-20251126-p5niq6.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Sydney Woolies ‘that time forgot’ faces uncertain future",
        "publish_date": "Fri, 28 Nov 2025 11:50:00 +1100",
        "category": "finance",
        "authors": [
            "Siena Fagan"
        ],
        "text": "Nestled in the back corner of the first floor of a northern Sydney shopping centre is an artefact of the 1970s.\n\nWith its classic red and green logo and checked tile floors, seemingly untouched by almost 50 years of time, is Eastwood Woolworths.\n\nEastwood Woolworths opened in 1976, and little has changed about its facade since then. Credit: Peter Rae\n\nWoolworths was an original tenant of Eastwood Shopping Centre when it opened in 1976. Just two years ago it underwent one of its biggest and only aesthetic changes since that time: the addition of self-checkouts.\n\nOn Monday this masthead reported that the centre is among a number of local malls set for redevelopments to add high-rise apartments to retail hubs across the city.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/today-in-history-the-story-of-the-kelly-gang-1906-20251128-p5nj9c.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "TODAY IN HISTORY: The Story of the Kelly Gang (1906)",
        "publish_date": "Fri, 28 Nov 2025 11:46:30 +1100",
        "category": "finance",
        "authors": [],
        "text": "TODAY IN HISTORY: The Story of the Kelly Gang (1906)\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/culture/trailer-wicked-for-good-20251128-p5nj99.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Trailer: Wicked: For Good",
        "publish_date": "Fri, 28 Nov 2025 11:40:18 +1100",
        "category": "finance",
        "authors": [],
        "text": "Trailer: Wicked: For Good\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/cricket/ashes-combatants-should-forget-golf-and-give-fans-what-they-want-more-cricket-20251128-p5nj6s.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Ashes combatants should forget golf and give fans what they want: more cricket",
        "publish_date": "Fri, 28 Nov 2025 11:33:00 +1100",
        "category": "sports",
        "authors": [
            "Malcolm Knox"
        ],
        "text": "England’s bowlers were cooked after one. And some tee times had been booked, so you can forget about more cricket. McKenna made the radical point that the thousands of fans who had travelled to Perth in hopes of seeing cricket might have deserved more respect. In 1970-71, a washed-out Melbourne Test was replaced by what turned out to be the first one-day international. Usman Khawaja and Steve Smith on the way to the course in January last year. Credit: Getty Images More than 46,000 spectators got to see some cricket, and in a speech at the end of the one-dayer Sir Donald Bradman said: “You have seen history made.” He wasn’t wrong. The lesser-known story was that England’s captain Ray Illingworth was furious the match was scheduled without consultation and angry that a seventh Test was added to the series.\n\nHe was less furious when England, by winning that seventh game, recovered the Ashes in Australia for the first time since Bodyline. In December 1978, I was at a World Series Cricket day-night game in Sydney that was over before the dinner break. The West Indies were all out for 66 in 33.4 overs, and Australia knocked off the target in the 19th. Instead of going home without having seen the new SCG lights come on, we were treated to a second match. The teams came out in coloured uniforms for the first time: Australia in canary yellow, the West Indies in coral pink. Three weeks later, the coloured clothing was worn in a scheduled match. Nobody remembers the result of the extra game, but that wasn’t the point. The Packer organisation put the fans first. And the players seemed happy enough to play more cricket.\n\nThe implausibility of this happening in Perth, or even being seriously considered, says a lot about today’s approach to the game. Workloads, or their lack of, have to be micromanaged. Superb golf courses have to be played. Fans have to be ignored. There are probably contractual prohibitions on anything spontaneous taking place after the rigours of a Test lasting 141 overs – not two days, but a day and a half. I’m reluctant to join the pile-on against England, who, until the last quarter in Perth, appeared likely to win. If they turn around and win in Brisbane, or win the Ashes, there will be enough egg on enough distinguished faces to go around. But it’s hard to get around the absence of cricket in their preparation and what it says about how they view the game. They have scheduled extra net sessions in Brisbane, which is all very well if efficiency comes first: have a bowl, have a hit, get away for 18 holes.\n\nIt leaves out the rhythmic demands of playing actual games of actual cricket: the hours spent waiting to bat or ruing what you’ve done to get out; the hours in the field; the hours of doing\n\nnothing. England – and Australia too – are preparing for a game that swings on sudden bursts of energy, wickets falling in clumps, one explosive innings, a match decided in a session or even a few overs. It’s exciting to watch if you have a short attention span. It also looks like a self-fulfilling system of shortcuts. We shouldn’t be surprised at the frankly atrocious standard of batting in Perth: it was what the teams practised for. And England practised much more intently for it than Australia did. So we go on to Brisbane, where fans will hope they aren’t dudded like those in Perth. You really worry for those English tourists who have booked tickets for both.\n\nMuch focus has been placed, rightly, on England’s batting, but presumably they will be able to catch lightning in a bottle at some point and pile up a match-winning total in quick time or, better still, no time. I thought their bowling should cause them real worry. Mark Wood, who had not played a game since February, was spent after eight overs in the first innings. Jofra Archer and the England attack fatigued quickly in Perth. Credit: Getty Images Jofra Archer was good for a Twenty20 spell with the new ball on the Friday, but that pretty much did it for him. The lack of endurance should come as no surprise when the preparation consists of eliminating endurance in favour of efficient little bursts.\n\nAfter the match, Wood considered driving from Perth to Brisbane until he found out that it might last five days. Loading If we get another abbreviated Test in Brisbane, whichever way it goes, the question must be asked more directly: do these players owe their fans more than lip service? Ought a limited-overs match be staged on the missing day three or four? Nervous players and management tend only to see potential downsides: injuries, giving away their secrets, more damned cricket. But as the 1971 and 1978 experiences showed, impromptu games delivered long-suffering spectators a measure of respect. A contract between players and fans existed.",
        "source": "SMH"
    },
    {
        "url": "https://www.sbs.com.au/news/article/environmental-win-parliament-adjourns-until-february/j1jtrlwur",
        "title": "PM praises 'yes-alition' as environmental reforms pass and parliament adjourns for the year",
        "publish_date": "Fri, 28 Nov 2025 00:30:05 +0000",
        "category": "finance",
        "authors": [],
        "text": "Prime Minister Anthony Albanese has happily returned for an extra sitting day to pass Labor's environmental law reforms before wrapping up the parliamentary year.\n\n\n\n\n\nLooking relaxed as he strolled into parliament on foot from the Lodge, Albanese said it was a \"good day for the environment\".\n\n\n\n\n\nAfter weeks of negotiations, Environment Minister Murray Watt announced Labor had struck a deal with the Greens on Thursday to overhaul the Environment Protection and Biodiversity Conservation (EPBC) Act, which has long been criticised as \"broken\".\n\n\n\n\n\nMPs had to return on Friday morning to vote on the amendments made during negotiations, passing the changes with the support of the Greens and all crossbenchers.\n\n\n\n\n\nWatt and Greens senator Sarah Hanson-Young, the team who finalised the deal, sat in the lower house as the bill passed, with MPs embracing them both after the vote.\n\n\n\nEnvironment Minister Murray Watt and Greens senator Sarah Hanson-Young were all smiles after finally striking a deal on Australia's environmental laws. Source: AAP / Lukas Coch Speaking inside the chamber, Albanese praised the Greens for not allowing \"the perfect be the enemy of the good\", a criticism he has often hurled at the minor party.\n\n\n\n\n\n\"These reforms are a win for business, a win for our natural environment and a win for the country,\" Albanese said.\n\n\n\n\n\n\"They mean more investment, more jobs, more housing and more infrastructure, and they protect something that every Australian values and has a deep connection to — our treasured and unique natural environment.\"\n\n\n\n\n\n\"This was a 'yes'-alition,\" he said, a play on the \"no-alition\" tag Albanese uses when the Greens and Coalition team up to oppose Labor bills.\n\n\n\nOpposition leader Sussan Ley has criticised the government for striking a deal with the Greens. Source: AAP / Lukas Coch Shortly before the vote, Opposition leader Sussan Ley fired up, telling parliament the deal showed an alliance between Labor and the Greens was \"well and truly back in business\".\n\n\n\n\n\n\"We're not here for dirty deals with the Greens,\" Ley said.\n\n\n\n\n\n\"After a disastrous year of no delivery with inflation and interest rates rising, we had to have this. Shame on this government for letting down the people of this country who pay the bills.\"\n\n\n\n\n\nCoalition environmental spokesperson Angie Bell has described the deal as \"disastrous\" for business and productivity.\n\n\n\n\n\nThe lower house also passed an education integrity bill — addressing departmental powers and course requirements for domestic students — before adjourning for the year.\n\n\n\n\n\nPoliticians will now return to their home states and territories for the summer break and will resume sitting on 3 February 2026.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/the-most-common-holiday-season-scams-targeting-australians-and-how-to-spot-them/50uucmt8g",
        "title": "The most common holiday-season scams targeting Australians — and how to spot them",
        "publish_date": "Thu, 27 Nov 2025 18:44:43 +0000",
        "category": "finance",
        "authors": [],
        "text": "If that unbelievable holiday bargain or too-perfect TikTok find seems tempting, experts suggest to pause and think.\n\n\n\n\n\nScammers hit Australians hard during holiday seasons, with one in five reporting being scammed at least once in this time, according to a recent report.\n\n\n\n\n\nOn average, these Australians have lost $445 during the holiday season, with 4 per cent of victims losing more than $5,000, according to the new findings from cybersecurity firm McAfee, which analysed data from October to early November.\n\n\n\n\n\nThe company also sells cybersecurity products.\n\n\n\n\n\nThis year, the numbers might get worse, as 89 per cent of Australians have reported that ads from unfamiliar retailers are exposing them to more scams and fake websites.\n\n\n\nScams to watch\n\nMcAfee highlights four main holiday scams: fake retail websites and counterfeit deal pages, scams on TikTok and social media, delivery and shipping text frauds, and gift card and account verification scams.\n\n\n\n\n\nOnline brand impersonation is another type of scam that targets online shoppers, in which scammers copy a brand's identity to deceive customers.\n\n\n\nREAD MORE The new 'widespread' scam to watch out for this Black Friday\n\nMcAfee's survey of Australians shows 36 per cent have abandoned a purchase because something didn’t feel right.\n\n\n\n\n\nFake versions of these sites frequently feature stolen product images, similar design layouts, authentic-sounding customer service language, and holiday sale graphics designed to encourage shoppers to enter payment details, according to the cybersecurity firm.\n\n\n\n\n\nThe report shows the most impersonated luxury brands are Coach, Dior, Ralph Lauren, Rolex, and Gucci, while the most impersonated mainstream brands are Apple, Nintendo, Samsung, Disney, and Steam.\n\n\n\n'Most believable tricks we’ve ever seen'\n\nThese scams are becoming more convincing as artificial intelligence advances.\n\n\n\n\n\nCompared to last year, 60 per cent of Australians are now more worried about AI scams, and 38 per cent reported they or someone they know has \"encountered holiday-sale scams that use deepfakes or fake celebrity endorsements\".\n\n\n\n\"Scammers have always taken advantage of the holiday rush to exploit people looking for deals,\" Tyler McGee, head of the Asia-Pacific and Japan region at McAfee, said.\n\n\n\n\n\n\"But AI has made it easier for them to copy trusted brands with speed and accuracy that is hard to spot.\"\n\n\n\nHow to spot online scams\n\nBut there are still tips that can help shoppers avoid being scammed.\n\n\n\n\n\nAccording to Scamwatch, if an offer is too good to be true, that might be a sign of a potential scam, and if the seller lacks terms and conditions, an ABN, or a privacy policy on their website, you should be cautious.\n\n\n\n\n\nMcAfee also warns that pressure to act quickly, requests for payment through gift cards or wire transfers, requests for personal information, or insisting that you stay on the line or remain silent are all \"classic scam signals\".\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/video/barnaby-joyce-leaves-the-nationals-considering-defection-to-one-nation/h2902clu1",
        "title": "Barnaby Joyce leaves the Nationals, considering defection to One Nation",
        "publish_date": "Thu, 27 Nov 2025 08:05:13 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/video/government-strikes-landmark-deal-with-the-greens-to-pass-environmental-reform/f01grqjvz",
        "title": "Government strikes landmark deal with the Greens to pass environmental reform",
        "publish_date": "Thu, 27 Nov 2025 08:01:27 +0000",
        "category": "finance",
        "authors": [],
        "text": "Government strikes landmark deal with the Greens to pass environmental reform\n\nPublished 27 November 2025, 6:04 am\n\nThe second term Albanese Government has struck a landmark deal to pass new environmental protection laws through the federal parliament. In the end Labor secured support from The Greens, with a series of concessions. The bills are now set to pass through parliament this week meeting the self-imposed deadline the government set.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/apra-tightens-lending-rules-and-investors-continue-to-question-rate-outlook/u5090hd9o",
        "title": "APRA tightens lending rules, and investors continue to question rate outlook",
        "publish_date": "Thu, 27 Nov 2025 06:56:11 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/barnaby-joyce-quits-nationals-after-30-years-evening-news-bulletin-27-november-2025/jncuc96v2",
        "title": "Barnaby Joyce quits Nationals after 30 years | Evening News Bulletin 27 November 2025",
        "publish_date": "Thu, 27 Nov 2025 05:04:26 +0000",
        "category": "finance",
        "authors": [],
        "text": "Key Points Former Nationals leader Joyce defects from party\n\nFederal Government says work needed to meet new emissions reductions target\n\nArne Slot admits his job is on the line after Liverpool’s shock loss against PSV\n\nListen to Australian and world news, and follow trending topics with SBS News Podcasts .\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nNew England MP, Barnaby Joyce, has announced he is leaving the Nationals party after three decades as a member.\n\n\n\n\n\nFormer party leader, Joyce, says he has been placed in the \"ejection seat\" and has been pushed to leave by colleagues.\n\n\n\n\n\nHe says he has had no communication with Nationals Leader David Littleproud, to resolve the issues between the pair.\n\n\n\n\n\nHe says he is considering defecting to Pauline Hanson's One Nation Party but would not confirm his next move.\n\n\n\n\n\n\"So, after 30 years with the national party, I am resigning from the party. That really leaves me with a heavy heart, and I apologize for all the hurt that that will cause other people I really do.\"\n\n\n\n---\n\n\n\n\n\nClimate Change Minister Chris Bowen says Australia will need additional work in order to meet the 2035 target.\n\n\n\n\n\nThe government has set a national target to reduce emission by 26 to 28 per cent below 2005 levels by 2030, and 62 to 70 per cent by 2035.\n\n\n\n\n\nMr Bowen says while Australia is on track to achieve the 2030 target in budget term, but the government projects that additional work will be needed to get to the 2035 goal.\n\n\n\n\n\n\"It's normal for there to be a gap between projected emission and a target ten years into the future. That's why you set a target, and as new policies are now developed and implemented, emissions outlook improves, that's what a target is for, it drives new initiatives and work.\"\n\n\n\n---\n\n\n\n\n\nOpposition leader Sussan Ley has accused Labor and the Greens of making what she calls a dirty deal, after the two parties reached a consensus to pass the environmental law this week.\n\n\n\n\n\nMs Ley says the bill will push energy prices up and accuses Labor of making the cost of living worse.\n\n\n\n\n\n\"What is very clear from the reaction so far to the dirty deal done by the Labor party with the Greens, a deal that wasn't necessary to conclude today or this year, what is absolutely clear is that this is going to put energy prices up.\"\n\n\n\n\n\nAngie Bell, the Opposition's environment spokesperson, says the bill will deliver more red tape for energy producers, and says it will not just have impacts on gas and electricity prices, but also jobs and productivity.\n\n\n\n---\n\n\n\n\n\nA bystander has been praised by police for saving the life of a swimmer who was attacked by a shark in New South Wales mid north coast.\n\n\n\n\n\nTwo swimmers, a man and a woman, were attacked by the shark on Thursday morning [[November 27]]. The woman died before paramedics arrived at the scene, and the man has suffered from serious injuries.\n\n\n\n\n\nNew South Wales Superintendent Joshua Smyth says a witness of the attack has played key role in saving the swimmer's life.\n\n\n\n\n\n\"It's really important to know that a very good bystander's first aid was administered to the male patient, she made a tourniquet on the male's leg, obviously potentially save the male patient, allow paramedics to get there and render further medical aid.\"\n\n\n\n---\n\n\n\n\n\nNew South Wales emergency services have received over 2000 calls for assistance due to the severe thunderstorms overnight.\n\n\n\n\n\nThe state's central west and Western Sydney were hit by heavy rainfalls and strong winds yesterday, leading several communities to power outage.\n\n\n\n\n\nAn SES Spokesperson says there were around 100 volunteers working in the impacted areas in Blacktown and Paramatta, which received over 1000 calls for assistance last night.\n\n\n\n\n\n\"Central West, we did receive a surge of calls across Belfast, Orange and Dubbo, significant property damage was experienced in Nvertire, where the entire roofs were blown off homes and sheds. And in those area, we are gonna expect clean up to take several days.\"\n\n\n\n\n\nA heatwave warning is in place across the state till November 29.\n\n\n\n---\n\n\n\n\n\nTo sport now and in football, Liverpool has hit a low, with a four to one defeat by PSV Eindhoven in the Champions League.\n\n\n\n\n\nLiverpool has lost nine of their last 12 games across all competitions, dropping to 12th place on the ladder on nine points.\n\n\n\n\n\nAfter the win, PSV climbed to 14th in the Champions League table, with eight points.\n\n\n\n\n\nReds manager, Arne Slot, shared his shock at the home ground loss - the first in the past 14 games the side has playerd at Anfield.\n\n\n\n\n\nSlot, acknowledging that after such a miserable season, he could lose his job.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/ukraine-peace-plan-or-putin-power-play-climate-cop-out-and-trumps-new-bromance/orl8iybao",
        "title": "Ukraine peace plan or Putin power play? Climate COP-out and Trump’s new bromance…",
        "publish_date": "Thu, 27 Nov 2025 04:49:35 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/barnaby-joyce-quits-the-nationals/nypvsuice",
        "title": "'Disappointing': Littleproud says Joyce let down Nationals by quitting party",
        "publish_date": "Thu, 27 Nov 2025 03:01:18 +0000",
        "category": "finance",
        "authors": [],
        "text": "National Party leader David Littleproud says Barnaby Joyce's decision to quit the party was \"disappointing\" and he had broken his contract with those who elected him.\n\n\n\n\n\n\"It is disappointing for the people of New England and disappointing for the loyal National Party members who tirelessly volunteered over the past two decades to support his political ambitions,\" Littleproud said in a statement on Thursday.\n\n\n\n\n\nLittleproud said the party had supported Joyce through \"tough times\" and his \"darkest moments\" and he had been encouraged to stay.\n\n\n\n\n\n\"Barnaby has chosen to walk away from The Nationals’ team — a strong team that fights for regional Australia and delivers genuine solutions for regional Australians in Government,\" he said.\n\n\n\n\n\n\"The Nationals will continue to fight for regional Australia and work as a team to get things done for local communities.\"\n\n\n\nREAD MORE Barnaby Joyce reveals he spoke with Pauline Hanson amid National Party split plans\n\nEarlier, the former deputy prime minister used the final sitting day to deliver a brief speech to the chamber announcing his decision.\n\n\n\n\n\nHe cited differences with Littleproud.\n\n\n\n\n\n\"After 30 years with the National Party, I am resigning from the party. And that leaves me with a heavy heart,\" he said.\n\n\n\n\n\n\"What I have to do, if I'm going to continue on that fight, is get myself into a better position than the ejection chair of the backbench of the Coalition in Opposition.\"\n\n\n\n\n\nJoyce said he was concerned about dealing with the cost of living crisis, regional communities and hospitals, as well as an ever more \"provocative\" Chinese government.\n\n\n\n\n\nHowever, it is unclear how he will continue to advocate for these issues as his political future remains uncertain.\n\n\n\nHe previously led the party on two occasions and announced earlier this year he would not recontest his seat in New England in 2028.\n\n\n\n\n\nThat could leave the door open for him to pursue a seat in the Senate.\n\n\n\nTipped to join One Nation\n\nIn recent weeks, there had been speculation Joyce would resign and join One Nation, and he had been asked about his plans on several occasions.\n\n\n\n\n\n\"I just don't want any circus. I'm trying to wait till the end of the sitting week,\" Joyce told 2GB radio on Monday when asked about his political future.\n\n\n\n\n\nBut he later told reporters on Thursday he hadn't made up his mind on whether to join One Nation.\n\n\n\n\n\nBut former National Party colleague and current senator Bridget McKenzie told reporters earlier Joyce's reputation would be \"trashed\" if he ran with One Nation.\n\n\n\n\n\n\"He's actually done serious things, and his legacy is significant, but that will be trashed if he goes to One Nation, and I think that's the big difference, and that's the question he's going to have to ask himself.\"\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.theage.com.au/national/australia-news-live-hong-kong-fire-death-toll-climbs-senate-inquiry-to-scrutinise-corrupt-nauru-deals-20251128-p5nj5l.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Australia news live: Hong Kong fires death toll climbs as recovery efforts continue in Tai Po; Environment laws overhauled for first time in 25 years",
        "publish_date": "Fri, 28 Nov 2025 12:38:44 +1100",
        "category": "finance",
        "authors": [
            "Emily Kaine",
            "Cassandra Morgan"
        ],
        "text": "The controversial law protecting feral horses in Kosciuszko National Park was repealed in a late-night sitting of the NSW upper house last night.\n\nThe private members bill, moved by independent MP Joe McGirr MP, has now passed both houses of parliament after clearing the lower house in October.\n\nFeral horses, also known as brumbies or wild horses, in Kosciuszko National Park in 2021. Credit: Alex Ellinghausen\n\nThe repeal, supported by the Minns government, the Liberals, the Greens and a number of independents, means that future decisions on feral horse management in Kosciuszko National Park can be made in the same way as other feral management decisions in other national parks.\n\nThe Kosciuszko Wild Horse Heritage Act 2018 was spearheaded by former NSW Nationals leader John Barilaro during the former Coalition government, and required the population of feral horses to be maintained at no less than 3000 in certain retention areas of the park. The rationale was that the presence of the horses, also called brumbies, in the Snowy Mountains landscape was considered part of Australia’s colonial heritage.\n\nHowever, the feral horses also damaged the delicate Alpine ecosystems of the High Country on the NSW-Victorian border and put native species at threat.\n\nLoading\n\nThe population of 3000 wild horses will be maintained until mid-2027 when the current statutory management plan for the national park expires.\n\nNSW Environment Minister Penny Sharpe said this was a landmark decision by a cross-party group to protect the state’s only alpine national park.\n\n“I have visited Kosciuszko National Park and clearly seen that control of wild horses is enabling the natural ecosystem to bounce back,” Sharpe said. “This bill will ensure that horses are treated the same way as other invasive species in NSW national parks.”\n\nBe the first to know when major news happens. Sign up for breaking news alerts on email or turn on notifications in the app.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/victoria/monash-ivf-hit-with-conditions-after-melbourne-embryo-mix-up-20251128-p5nj7i.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Monash IVF hit with conditions after Melbourne embryo mix-up",
        "publish_date": "Fri, 28 Nov 2025 12:38:32 +1100",
        "category": "finance",
        "authors": [
            "Henrietta Cook"
        ],
        "text": "Victoria’s health watchdog has placed conditions on Monash IVF’s registration after a Melbourne patient’s own embryo was mistakenly transferred to her, during a procedure in which she was supposed to receive her partner’s embryo.\n\nThe conditions, imposed by Victoria’s Health Regulator, are focused on making sure all genetic material is clearly tracked and accounted for, requiring better patient consent and record-keeping.\n\nVictoria’s health regulator has placed conditions on Monash IVF following a second embryo mix-up. Credit: Getty Images/iStockphoto\n\nThe conditions will also require Monash IVF to conduct rigorous verification and patient checks, accurate recording in management systems and strengthened staff capabilities.\n\nThe regulator said it met with Monash IVF several times, conducted site visits and ordered the IVF company to hand over documents, which it complied with.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/business/markets/asx-set-to-slide-global-sharemarkets-steady-20251128-p5nj54.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "ASX edges higher despite falls in miners, banks; Woolworths jumps",
        "publish_date": "Fri, 28 Nov 2025 12:38:04 +1100",
        "category": "finance",
        "authors": [
            "Staff Reporters"
        ],
        "text": "The Australian sharemarket has erased early losses and crept into the green at lunchtime but the big four banks and iron ore miners are weighing on the bourse.\n\nThe S&P/ASX 200 was 10.6 points, or 0.1 per cent, lower to 8606.7 in early trade, with seven of 11 industry sectors in positive territory.\n\nSome big names are weighing on the ASX on Friday. Credit: Oscar Colman\n\nFinancial stocks are weaker with the big four banks all lower. Commonwealth Bank retreated 0.3 per cent, National Australia Bank shed 0.4 per cent, ANZ Bank lost 0.7 per cent and Westpac gave up 0.2 per cent in early afternoon trade.\n\nMining stocks are mixed with iron ore giants BHP (down 0.2 per cent), Rio Tinto (down 0.5 per cent) and Fortescue (down 0.1 per cent) losing ground. Gold miners have strengthened during the session, with Northern Star up 1.1 per cent and Evolution Mining adding 0.4 per cent.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/culture/comedy/is-this-the-world-s-most-infuriating-comedian-he-certainly-hopes-so-20251120-p5nh2o.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Is this the world’s most infuriating comedian? He certainly hopes so",
        "publish_date": "Fri, 28 Nov 2025 12:20:08 +1100",
        "category": "entertainment",
        "authors": [
            "Richard Jinman"
        ],
        "text": "Save Log in , register or subscribe to save articles for later. Save articles for later Add articles to your saved list and come back to them any time. Got it Normal text size Larger text size Very large text size Luke McQueen once sold out a theatre in Edinburgh by telling a big lie: he promoted the show as a gig by the hugely popular Scottish comedian Frankie Boyle. When McQueen, who bears no resemblance to Boyle, sidled onto the stage, he was met by stunned silence. “Er, Frankie Boyle’s not coming,” he told the audience. “It’s just me, Luke McQueen. Give me a cheer if you’ve heard of me.” No one cheered. The only sound was the scraping of chairs as people stood up and headed for the exit. One enraged punter kicked McQueen’s collection bucket across the stage on his way out. “Guys, don’t go. I’m funny,” pleaded the man on stage. Deliberately upsetting a crowd of Frankie Boyle fans would make most people nervous, but McQueen isn’t one of them. “I thought the whole thing was so exciting,” he says of the 2014 gig. “The thing I love more than anything is committing to an idea.” The bogus Frankie Boyle show is typical of McQueen’s highly conceptual approach to comedy. His work often starts with a palpable truth – in this case, the fact it’s extremely hard to sell tickets to Edinburgh shows that don’t feature big names – before spinning off into the realms of pure imagination. The McQueen who walked out on stage and told the audience they weren’t going to see Frankie Boyle was a character; his attempt to turn confusion and disappointment into comedy was the performance. “I was originally going to tell people they were going to see a gig by Ricky Gervais,” admits McQueen when I meet him at a theatre in London’s Soho. “I emailed Ricky and said ‘I’ve had this idea – do you mind if I do it?’ He replied that he thought it was really funny, but he couldn’t say yes because he couldn’t knowingly upset his fans. Which is totally fair. So, I used Frankie Boyle without asking.” Another example of comedic identity theft from McQueen’s oeuvre is a performance in which he claimed (entirely fictitiously) to be the former stage partner of the English comedian Jack Whitehall. McQueen professed to be so embittered at being usurped by Whitehall’s dad, he’d written an entire show about it. There is video footage of Whitehall walking on stage during a performance of the show in Edinburgh, an incident McQueen insists was not staged. McQueen says his comedy often plays with notions of likeability. Unlikeability might be a better description. There’s a video of him shaving his head in the middle of a crowded ice rink, an act of atonement designed to win back an ex-girlfriend.\n\nAdvertisement\n\nHe once poured a can of soup on his head in front of a Van Gogh at London’s National Gallery in a parody of the Just Stop Oil protests and he’s staged a fake reality show called The Luke of Love, offering a group of unsuspecting female contestants the chance to date him. The perplexed women were hooked up to a polygraph machine and asked questions such as: “Do you know where my biological mother is?” In every case, he insists he was firmly in character. “I couldn’t do this kind of thing as me,” he shrugs. “It would be obnoxious.” He’s very much in character – albeit a character who happens to be a comedian called Luke McQueen – in the show he’s bringing to next year’s Melbourne International Comedy Festival. It’s called Luke McQueen: Comedian’s Comedian, and it takes some explaining. Loading The title refers to a popular podcast hosted by an English comedian called Stuart Goldsmith. Since the first episode was recorded in 2012, hundreds of guests – a who’s-who of hilarity ranging from Jimmy Carr and Tim Minchin to Stewart Lee and Katherine Ryan – have discussed the serious business of making people laugh. One person who has never been asked to appear is ... Luke McQueen. Furious at being ignored, McQueen phones Goldsmith and demands to know why he’s been snubbed. A recording of their toe-curling conversation – which ends with Goldsmith hanging up the phone – is played at the start of the show. McQueen runs the recording through an AI voice generator and clones the podcast host’s voice. Like a malignant ventriloquist, he has acquired the ability to put words in his nemesis’s mouth.\n\nAdvertisement\n\nWith Goldsmith represented on stage by a shop mannequin topped with a disturbing homemade head, McQueen sets about staging his own edition of Comedian’s Comedian. At first, things go to plan. McQueen, a preening figure in a brown suit, answers a series of fawning questions he’s written himself. “You’re largely regarded as one of the most innovative comedians in the world,” says AI Goldsmith. “How does that make you feel?” “Bored,” sniffs McQueen, running a hand through his lustrous hair. Halfway through the show, things take a dark turn. The AI – which everyone knows can’t be trusted – malfunctions. The questions go off script; they become hostile and deeply personal. What follows is an unhinged, brutally funny journey into the darkest corners of McQueen’s psyche as he’s eviscerated by his algorithmic interlocutor. As ever, it’s hard to discern how much of the show is real. Was Goldsmith in on the joke all along? McQueen ponders the question, then replies, “You’ll think this is a lie, but I swear it’s the truth: I simply don’t know.” Luke McQueen outside the BBC in 2018, protesting against the airing of his show The Luke McQueen Pilots. Credit: PA Images via Getty Images He’s just as evasive when I ask him what happened when Goldsmith attended a performance of the show in Edinburgh. “I don’t want to ruffle those feathers,” he says. “I’ve got to be careful.” While McQueen is happy to discuss his comedy, he hands-down refuses to talk about himself. Requests for basic biographical details are met with silence. “I expect I’ll regret this interview because I don’t like being myself in public,” he says at one point. “My personal life is not anyone’s business. The only thing you need to know about me is my work.” He smiles apologetically. “I’m not trying to be difficult. I don’t mind if you know my age or where I was born. But I also think ’why do I have to tell you?’”\n\nAdvertisement\n\nIn an age when relentless self-promotion is the norm for entertainers seeking to connect with their audience, this is an unusual stance, to say the least. But McQueen is something of a digital ghost. Wikipedia has yet to discover him, he ditched most of his social media accounts during the pandemic and there are no interviews in which he sheds light on anything relating to his personal life. Under pressure, he reveals that he studied performing arts at the University of Bedfordshire, where an inspirational tutor encouraged him to see comedy as a gateway to acting. “When I started, I genuinely didn’t know much about comedy,” he says. “Ricky Gervais was probably the most alternative comedian I knew. Obviously, I’m friends with a lot of comedians now and a lot of them are comedy nerds. They love it. But even now I’m not a super fan.” Luke McQueen says he’s “not a super fan” of comedy. At times, he admits, comedy has felt like a straitjacket. He’d love to do more acting and directing, but it can be difficult breaking free of the festival circuit and the exhausting demands of writing and performing a new comedy show every couple of years. Producers and commissioners can have a blinkered view of performers and often want facsimiles of successful shows. “I think repetition is the most disgusting thing in terms of creativity,” he says. “The idea that we need to find something that’s like something that’s come before is pathetic.” His persona in Luke McQueen: Comedian’s Comedian – a fragile, thin-skinned man who responds to rejection by turning his impotent rage on a podcast host – is not entirely fictitious. “I play with the truth, but that doesn’t mean there isn’t any truth in it,” he says. “A lot of the character’s arrogance and bravado is like me screaming at the industry ‘what is your problem?’” He is, by his own admission, still trying to make it. He’s brimming with ideas for films, TV shows and stage productions, but acknowledges it’s tough standing out from the crowd. “There’s loads more that I want to do in this world, but I don’t know if I ever will,” he says.\n\nAdvertisement",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/10-of-pauline-hansons-most-controversial-moments-20251128-p5nj81.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "10 of Pauline Hanson's most controversial moments",
        "publish_date": "Fri, 28 Nov 2025 12:11:35 +1100",
        "category": "finance",
        "authors": [],
        "text": "10 of Pauline Hanson's most controversial moments\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/culture/books/are-the-doomsayers-right-are-we-living-in-post-literate-times-20251121-p5nhee.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Are the doomsayers right? Are we living in post-literate times?",
        "publish_date": "Fri, 28 Nov 2025 12:00:00 +1100",
        "category": "finance",
        "authors": [
            "Jane Sullivan"
        ],
        "text": "Let the bells toll as we bid a sad farewell to the book because we will never see its like again.\n\nI’ve been hearing laments like this all my life, and so far, the book has been remarkably chirpy for a species constantly threatened with extinction. But could the doomsayers be right this time?\n\nHas the bell finally tolled for books? Credit: Alamy Stock Photo\n\nThere’s been a flurry of recent articles on this subject, and perhaps the longest and most terrifying jeremiad has come from The Times writer James Marriott. “Welcome to the post-literate society,” he says in his Substack newsletter Cultural Capital. He gives us a potted history of the print revolution and how it changed the world. And now, he says, we are living through the counter-revolution. Back to a feudal age. Nothing will ever be the same again. Blimey.\n\nHe quotes statistics showing that reading is “in free-fall”. In the US, reading for pleasure has fallen by 40 per cent in the past 20 years. In the UK, more than a third of adults say they have given up reading. The OECD found recently that literacy levels were declining or stagnating in most developed countries.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/queensland/steamy-to-sweltering-how-to-get-80-000-grants-after-severe-hail-20251128-p5nj71.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Steamy to sweltering: How to get $80,000 grants after severe hail",
        "publish_date": "Fri, 28 Nov 2025 11:54:34 +1100",
        "category": "finance",
        "authors": [
            "Catherine Strohfeldt"
        ],
        "text": "Queenslanders battered by severe hail storms will get access to payments of $80,000 after repeated weather blows triggered government-funded hardship assistance, as the region swaps storms for intense heat.\n\nThe joint-funded federal and state grants are available for suburbs north of Brisbane, including Bribie Island, parts of the Moreton Bay region along the coast, through Caboolture and inland up to Woodford.\n\nThe largest grants cover uninsured homes that suffered significant structural damage, although payments up to $900 are available for residents severed from power, water or essential goods and services.\n\nMinister for Disaster Recovery Ann Leahy said power had been restored to more than 170,000 homes since Saturday, with the rolling storms a reminder to “be ready for anything”.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/cricket/how-the-changing-nature-of-test-cricket-has-left-lyon-in-a-spin-20251127-p5niup.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "How the changing nature of Test cricket has left Lyon in a spin",
        "publish_date": "Fri, 28 Nov 2025 11:50:54 +1100",
        "category": "sports",
        "authors": [
            "Tom Decent"
        ],
        "text": "He carried the drinks that week in Jamaica during a pink ball game, bowled two overs in Perth last week as England were skittled twice, and might be surplus to requirements in Brisbane. What does that say about the future of spin bowling in Australia? And what does it say that Joe Root’s part-time off-spin is all England think they need? Joe Root took 0-12 from one over in the first Test in Perth. Credit: Getty Images “Joe Root as your national team spin bowler would make anyone who cares about cricket cry. It’s so totally embarrassing,” MacGill says. “How haven’t they cultivated other spinners? “However, I don’t think we’ve done a good enough job developing our own spin bowlers.”\n\nShane Warne was spin bowling’s most powerful advocate, always spruiking the value of having a slow bowler in an XI. His presence is missed by tweakers everywhere. “Shane Warne would be turning in his grave,” says ex-Australian leg-spinner Kerry O’Keeffe. “He’d just be teeing off, wouldn’t he? Former Australian cricketer Stuart MacGill. Credit: Getty Images “Warnie contends – and it’s fair – that if it seams, it spins. It sounds like a cliché, but when it seams, matches end early. “Is it now just marking time on Australian pitches and waiting for the trips to the subcontinent? That can disillusion young spinners on the way up that they’re only going to play in certain parts of the world.”\n\nLast summer, Lyon bowled 122.4 overs – the fewest he has sent down in a home campaign in his career. There is every chance Lyon plays a pivotal role in Adelaide, Melbourne and Sydney. But if Australia’s greatest off-spinner isn’t even guaranteed a game – or bowling fewer overs – what does that mean for a craft already under siege as Australian pitches offer more for the quicks? Lyon spoke about the issue in August. “I know how important spin bowling is, but there is a degree of me that’s concerned about spin bowling around the world, not just Australia, with the wickets we’re playing on,” Lyon said.\n\n“If you look at spin bowling and your younger spin bowlers around the country, they’re not getting the overs or the opportunities to bowl on day-three, day-four wickets, or spinning wickets, or even green seamers because the fast bowlers are dominating.” O’Keeffe understands where Lyon is coming from. “He was such a big part of home campaigns and now every pitch they play on affords sideways movement for the quicker bowlers and it lasts most of the match,” O’Keeffe says. “Nine wickets for Lyon last summer in a winning series against India is bittersweet.” Former Test spinner Stephen O’Keefe, who took 301 first-class wickets at 24.66, remains bullish about Australia’s depth but concedes Lyon’s situation could disillusion some.\n\n“Domestically, I think we’re in the strongest position we’ve been in a long time in terms of depth,” O’Keefe says. “Mitch Swepson, Tanveer Sangha, Corey Rocchiccioli, Todd Murphy, Ben Manenti and Matt Kuhnemann are there, and I think all of them have the potential to play for Australia. The hard part is when they look up and don’t see a spinner playing. “I’m picking a spinner every day of the week, even in this pink ball game. Steve O’Keefe celebrates one of his 12 wickets during the 2017 Test in Pune. Credit: AP “If Nathan doesn’t play at the Gabba and bowls two overs in Perth, I think is really worrisome for domestic spinners. Five Tests, and you don’t need a spinner for two? That would be so disappointing. “Maybe do what Beau Webster did. Stop bowling offies and take up medium pace. That might be the shortest path into the Australian team because that seems more effective. In Australia, it is quite tough, so we need to judge our spinners a little differently.”\n\nIt is expected England will only double down with the bat in Brisbane. Even at 2-0 down, Ben Stokes and Brendon McCullum won’t deviate from their aggressive method. Lyon loves bowling on day-five pitches, but unless Australia’s batters pile on runs, that scenario may not materialise this series. “I think Bazball, if anything, increase his chances of playing,” O’Keefe says. “They may go hard at him, but in Australia he’s one of the hardest spinners to attack on bigger grounds. I’m backing him as a weapon. He’s just as effective to break a partnership or knock over one of their top order batters as much as Scotty Boland is.” Both Kerry O’Keeffe and MacGill have an eye on the future. They are excited by young Sydney leg-spinner Tom Brooks, who took 6-44 for NSW’s second XI this week against Tasmania and bowls “big ripping leg breaks”. But Lyon’s predicament could have a ripple effect in the years to come.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/soccer/rodriguez-on-target-from-halfway-20251128-p5nj9h.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Rodriguez on target from halfway",
        "publish_date": "Fri, 28 Nov 2025 11:50:18 +1100",
        "category": "finance",
        "authors": [],
        "text": "Rodriguez on target from halfway\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/nsw/sydney-woolies-that-time-forgot-faces-uncertain-future-20251126-p5niq6.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Sydney Woolies ‘that time forgot’ faces uncertain future",
        "publish_date": "Fri, 28 Nov 2025 11:50:00 +1100",
        "category": "finance",
        "authors": [
            "Siena Fagan"
        ],
        "text": "Nestled in the back corner of the first floor of a northern Sydney shopping centre is an artefact of the 1970s.\n\nWith its classic red and green logo and checked tile floors, seemingly untouched by almost 50 years of time, is Eastwood Woolworths.\n\nEastwood Woolworths opened in 1976, and little has changed about its facade since then. Credit: Peter Rae\n\nWoolworths was an original tenant of Eastwood Shopping Centre when it opened in 1976. Just two years ago it underwent one of its biggest and only aesthetic changes since that time: the addition of self-checkouts.\n\nOn Monday this masthead reported that the centre is among a number of local malls set for redevelopments to add high-rise apartments to retail hubs across the city.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/today-in-history-the-story-of-the-kelly-gang-1906-20251128-p5nj9c.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "TODAY IN HISTORY: The Story of the Kelly Gang (1906)",
        "publish_date": "Fri, 28 Nov 2025 11:46:30 +1100",
        "category": "finance",
        "authors": [],
        "text": "TODAY IN HISTORY: The Story of the Kelly Gang (1906)\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/culture/trailer-wicked-for-good-20251128-p5nj99.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Trailer: Wicked: For Good",
        "publish_date": "Fri, 28 Nov 2025 11:40:18 +1100",
        "category": "finance",
        "authors": [],
        "text": "Trailer: Wicked: For Good\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/cricket/ashes-combatants-should-forget-golf-and-give-fans-what-they-want-more-cricket-20251128-p5nj6s.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Ashes combatants should forget golf and give fans what they want: more cricket",
        "publish_date": "Fri, 28 Nov 2025 11:33:00 +1100",
        "category": "sports",
        "authors": [
            "Malcolm Knox"
        ],
        "text": "England’s bowlers were cooked after one. And some tee times had been booked, so you can forget about more cricket. McKenna made the radical point that the thousands of fans who had travelled to Perth in hopes of seeing cricket might have deserved more respect. In 1970-71, a washed-out Melbourne Test was replaced by what turned out to be the first one-day international. Usman Khawaja and Steve Smith on the way to the course in January last year. Credit: Getty Images More than 46,000 spectators got to see some cricket, and in a speech at the end of the one-dayer Sir Donald Bradman said: “You have seen history made.” He wasn’t wrong. The lesser-known story was that England’s captain Ray Illingworth was furious the match was scheduled without consultation and angry that a seventh Test was added to the series.\n\nHe was less furious when England, by winning that seventh game, recovered the Ashes in Australia for the first time since Bodyline. In December 1978, I was at a World Series Cricket day-night game in Sydney that was over before the dinner break. The West Indies were all out for 66 in 33.4 overs, and Australia knocked off the target in the 19th. Instead of going home without having seen the new SCG lights come on, we were treated to a second match. The teams came out in coloured uniforms for the first time: Australia in canary yellow, the West Indies in coral pink. Three weeks later, the coloured clothing was worn in a scheduled match. Nobody remembers the result of the extra game, but that wasn’t the point. The Packer organisation put the fans first. And the players seemed happy enough to play more cricket.\n\nThe implausibility of this happening in Perth, or even being seriously considered, says a lot about today’s approach to the game. Workloads, or their lack of, have to be micromanaged. Superb golf courses have to be played. Fans have to be ignored. There are probably contractual prohibitions on anything spontaneous taking place after the rigours of a Test lasting 141 overs – not two days, but a day and a half. I’m reluctant to join the pile-on against England, who, until the last quarter in Perth, appeared likely to win. If they turn around and win in Brisbane, or win the Ashes, there will be enough egg on enough distinguished faces to go around. But it’s hard to get around the absence of cricket in their preparation and what it says about how they view the game. They have scheduled extra net sessions in Brisbane, which is all very well if efficiency comes first: have a bowl, have a hit, get away for 18 holes.\n\nIt leaves out the rhythmic demands of playing actual games of actual cricket: the hours spent waiting to bat or ruing what you’ve done to get out; the hours in the field; the hours of doing\n\nnothing. England – and Australia too – are preparing for a game that swings on sudden bursts of energy, wickets falling in clumps, one explosive innings, a match decided in a session or even a few overs. It’s exciting to watch if you have a short attention span. It also looks like a self-fulfilling system of shortcuts. We shouldn’t be surprised at the frankly atrocious standard of batting in Perth: it was what the teams practised for. And England practised much more intently for it than Australia did. So we go on to Brisbane, where fans will hope they aren’t dudded like those in Perth. You really worry for those English tourists who have booked tickets for both.\n\nMuch focus has been placed, rightly, on England’s batting, but presumably they will be able to catch lightning in a bottle at some point and pile up a match-winning total in quick time or, better still, no time. I thought their bowling should cause them real worry. Mark Wood, who had not played a game since February, was spent after eight overs in the first innings. Jofra Archer and the England attack fatigued quickly in Perth. Credit: Getty Images Jofra Archer was good for a Twenty20 spell with the new ball on the Friday, but that pretty much did it for him. The lack of endurance should come as no surprise when the preparation consists of eliminating endurance in favour of efficient little bursts.\n\nAfter the match, Wood considered driving from Perth to Brisbane until he found out that it might last five days. Loading If we get another abbreviated Test in Brisbane, whichever way it goes, the question must be asked more directly: do these players owe their fans more than lip service? Ought a limited-overs match be staged on the missing day three or four? Nervous players and management tend only to see potential downsides: injuries, giving away their secrets, more damned cricket. But as the 1971 and 1978 experiences showed, impromptu games delivered long-suffering spectators a measure of respect. A contract between players and fans existed.",
        "source": "TheAge"
    },
    {
        "url": "https://au.news.yahoo.com/bunnings-unveils-new-five-floor-mega-store-as-retailers-dominance-grows-new-features-010055584.html",
        "title": "Bunnings unveils new five-floor mega store as retailer's dominance grows: 'New features'",
        "publish_date": "2025-11-28T01:00:55Z",
        "category": "finance",
        "authors": [],
        "text": "A new jumbo-sized Bunnings is about to open on the east coast. On Monday, the hardware giant will open its second-largest store in NSW, a five-level giant featuring three floors of retail and a two-level car park.\n\nThere are an incredible 101 aisles spread across the building, and the retailer said the supersized layout is packed with upgraded features. It's one of the biggest in Australia.\n\nThe Sydney store includes six aisles dedicated solely to tools, an in-store tile shop, and a brand-new drive-in trade level where builders can pull up directly beside building materials, and a rooftop nursery.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nSituated at the corner of Warringah Road and Allambie Road in Frenchs Forest on Sydney's Northern Beaches, the new Bunnings warehouse covers over 20,000 square metres and offers more than 400 customer car spaces.\n\nPaul Burgess, Complex Manager at Bunnings Frenchs Forest, who has 13 years of experience with the company and previously managed the Balgowlah and Alexandria stores, said the new site represents a significant investment in the local community.\n\nHe told Yahoo News the team have spent the past five weeks getting a lay of the land ahead of the store opening.\n\n\"Our team have been busy learning the store layout for the past five weeks, so that we can assist shoppers in finding anything they need across all 101 aisles,\" he said. For those who want to locate the products they need quickly, he advised using the Bunnings app.\n\n120 staff members have been brought on board to man the new Bunnings warehouse at Frenchs Forest. Source: 9News\n\nBunnings' dominance grows as retailer hires 120 new staff\n\nThe store has hired 120 new team members, ranging in age from 15 to 82.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\n\"It's been designed to deliver the very best experience for our customers, whether they’re trade professionals or weekend DIYers,\" Burgess said.\n\n\"The team can’t wait to welcome everyone through the doors and showcase all the new features, from the rooftop nursery to our new kitchen design centre.\"\n\nThe new store, in Frenchs Forest in Sydney's north, is set to open on Monday. Source: Bunnings\n\nThe multi-level site is the second-largest Bunnings store in NSW and the fourth-largest nationally, boasting the largest fully enclosed trade and timber yard in Australia.\n\nIn response to long-standing local concerns about traffic, Bunnings said it has shifted the main entrance to help ease congestion.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nWhile the opening might be exciting for residents embarking on a renovation, retail experts warn that Bunnings' growing dominance — now pushing beyond DIY and hardware into other categories — could squeeze local operators even further.\n\nHowever, Bunnings points to the boost in local jobs and its focus on sustainability in the area.\n\nIt said sustainability was a central consideration in the store’s design and construction, featuring solar panels, rainwater harvesting, and a recycled water system for the nursery.\n\nDo you have a story tip? Email: newsroomau@yahoonews.com.\n\nYou can also follow us on Facebook, Instagram, TikTok, Twitter and YouTube.",
        "source": "Yahoo"
    },
    {
        "url": "https://au.news.yahoo.com/proud-day-labor-passes-sweeping-225434448.html",
        "title": "‘This is nuts’: Bold claim about new Aussie laws",
        "publish_date": "2025-11-28T00:40:38Z",
        "category": "finance",
        "authors": [],
        "text": "Nationals MP Michael McCormack says Labor was only paying “lip service” to the Coalition over environmental reforms before it made an 11th hour deal with the Greens.\n\nAmendments to the Environment Protection and Biodiversity Conservation Act returned to the lower house on Friday morning after receiving support from the Greens in the Senate on Thursday.\n\nThe reforms will establish a federal environmental protection agency, national environmental standards and higher penalties for the most significant breaches of environmental law.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nThey also give the federal government oversight over native forest logging.\n\nAfter a contentious early-morning sitting on Friday, the Bill passed 89 to 34 at 9.40am, prompting cheers from the crowd.\n\nPrime Minister Anthony Albanese said it was a ‘proud day for me as Labor leader’ to pass the reforms. Picture: NewsWire / Martin Ollman\n\nMr McCormack mirrored comments from the Australian Chamber of Commerce and Industry chief executive Andrew McKellar on Thursday, calling the reform package “Frankenstein’s monster”\n\n‘(It) is going to be unleashed onto the Australian economy at a time when we’re already paying higher power prices, at a time of cost of living costs,” Mr McCormack, a former deputy Prime Ministers said.\n\n“I mean, this is nuts.”\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nMr McCormack denied that the Coalition was ineffective on the reforms and said the party would be “fighting ard over summer”, including over power prices.\n\n‘Proud day’: Labor passes sweeping green reforms\n\nAddressing the Bill, Anthony Albanese accused the Coalition, who had been in talks with the government over a deal as late as Wednesday night, of being a “mess … incapable of coming up with plans that were consistent”.\n\n“They changed their decision from hour to hour,” he said.\n\n“The final documentation from the Coalition said: ‘Oh, and there’s more’. This is yesterday afternoon.\n\n“They couldn’t tell us what their amendments would be.”\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nMr Albanese said it was a “proud day for me as Labor leader” to pass the reforms.\n\n“This was a yes-olition,” he said.\n\n“People who wanted reform, making a big difference on housing, energy, critical minerals, and resources.\n\nNationals MP Michael McCormack has claimed Labor was only paying ‘lip service’ to the Coalition over the EPBC. Picture: NewsWire / Martin Ollman\n\n“Projects that make a difference, unleashing our nation’s capability and backing our economy, because the stronger economy and cleaner environment depend on each other, and with these laws, our government is delivering both.”\n\nMr Albanese said the reforms would provide certainty to businesses, with “quicker yeses and quicker nos”, and would speed up delivery of renewable energy projects and housing.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nSussan Ley said the “Greens alliance is well and truly back in business”.\n\n“Because, we listen to you Prime Minister every question time laying into the Greens, but today, the Greens are amazing, so nice to the Greens,” the Opposition Leader said.\n\n“This is economy wrecking.”\n\nMs Ley said the Bill could have been pushed until next year.\n\n“We know a political fix when we see one,” she said.\n\n“This piece of rubbish was pulled out of the hat because this could have gone on to next year.\n\n“Fifteen-hundred pages of legislation could have been properly consulted, done systematically.”\n\nMs Ley said energy producers claimed the Bill would put “all approvals in the slow lane”.\n\nOpposition Leader Sussan Ley said the ‘Greens alliance is well and truly back in business’. Picture: NewsWire / Martin Ollman\n\n“That’s what’s really going to happen here if you want approvals for resources, projects, for gas,” she said.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\n“I thought, Prime Minister, you had a future gas strategy.\n\n“You have no gas strategy now, nothing to provide and the affordability to bring people’s energy prices down.\n\n“Energy producers said this will delay the new gas that has to come online to keep our electricity grid functioning.”\n\nGreens MP Elizabeth Watson-Brown credited her party for having negotiated an end to the regional forestry agreement exemption for native forest logging.\n\n“It shouldn’t have to be like this. We shouldn’t have to fight like this, but we do,” she said.\n\n“If Labor had their way under the original Bill, big logging corporations would still be destroying our native forests.”\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nEnvironment Minister Murray Watt went on to deny the Bill entailed an end to regional forestry agreements or native forest logging.\n\nInstead, he said the Bill meant the same environmental standards applied to other industries would apply to logging.\n\nEnvironment Minister Murray Watt with Greens Senator Sarah Hanson-Young during the passing of the EPBC Bill. Picture: NewsWire / Martin Ollman\n\n“I can categorically assure your listeners that we have not agreed to shut down native forestry in Tasmania or any other part of the country,” he told ABC Radio Hobart.\n\n“Now, we all know that that is what the Greens have wanted to do, but we stared them down on that and rejected their demand to do that.”\n\nHe claimed the Coalition and the Greens had been “running around Tasmania telling people that we’re going to be shutting down native forestry, and that’s because that’s just a political scare campaign that works for both of them”.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nCoalition environment spokeswoman Angie Bell took a swipe at Ms Watson-Brown, describing her as “the new deputy prime minister”.\n\nThe Bill also received support from independent Wentworth MP Allegra Spender, though she said it was “imperfect”.\n\nThe reforms stem from a 2020 review by Professor Graeme Samuel into the EPBC Act.\n\nSenator Watt had indicated earlier this week an intention to strike a deal either with the Greens or the Coalition to secure support in the Senate.",
        "source": "Yahoo"
    }
]