[
  {
    "url": "https://www.9news.com.au/national/ato-reveals-outrageous-tax-deduction-attempts/9bd2d248-7785-4d58-ac4d-ee50dd8b38c1",
    "title": "Swimmers, an airfryer and a TV: ATO reveals 'outrageous' tax deduction attempts",
    "publish_date": "Wed, 07 May 2025 01:13:34 +0000",
    "category": "finance",
    "authors": [
      "May"
    ],
    "text": "T﻿he Australian Taxation Office has revealed some of the most \"outrageous\" things people tried to deduct from their tax returns last year.\n\nTax deductions are reserved for work-related expenses, ﻿but the ATO says not everyone got the memo.\n\nOne mechanic tried to claim an airfyer, microwave, two vacuum cleaners, a television, a gaming console and gaming accessories as work-related expenses - his request was denied.\n\nTax deductions are reserved for work-related expenses. (Louie Douvis/AFR)\n\nIn another case, a truck driver tried to claim a pair of swimmers ﻿because it was hot where he stopped on his journey, and he wanted to go for a swim.\n\nThere was even an instance where a manager working in the fashion industry﻿ tried to claim $10,000 in designer clothes to be well-presented at work and business events.\n\nHer request was denied because the clothes were \"conventional\" and not uniforms, so they are considered a personal item, not a work item, the ATO said.\n\nThe ATO called the tax deduction claims \"outrageous\" and \"wild\".\n\nREAD MORE: Vatican to deactivate mobile phone signal ahead of secret meeting to elect new pope\n\nOne mechanic tried to claim an airfyer, microwave, two vacuum cleaners, a television, a gaming console and gaming accessories as work-related expenses. (Getty)\n\nATO Assistant Commissioner ﻿Rob Thomson told taxpayers that exaggerated deduction attempts would not be tolerated.\n\n\"While some people have tried their luck with unusual work-related deduction claims, most people realise to be able to claim an expense, it needs to meet strict criteria,\" he said.\n\n\"While a lunchtime dip might clear your head for work, swimwear for a truck driver is clearly not deductible.\n\n\"We know in many instances mistakes relating to work-related expenses could be avoided with a little time and effort.\"\n\nREAD MORE: The key seats still too close to call as counting continues in the 2025 federal election\n\nATO Assistant Commissioner ﻿Rob Thomson told taxpayers that exaggerated deduction attempts would not be tolerated. (AFR/ Luis Enrique Ascui)\n\nThis year, the ATO says it will be focusing on areas it often sees errors in, like work-related expenses and work-from-home deductions.\n\n\"﻿Work-related expenses must have a close connection to your income-earning activities, and you should be prepared to back it up, with records like a receipt or invoice,\" Thomson said.\n\n\"If your deductions don't pass the 'pub test', it's highly unlikely your claim would meet the ATO's strict criteria.\"",
    "source": "9News",
    "cluster_id": 0
  },
  {
    "url": "https://www.9news.com.au/national/woolworths-announces-major-change-everyday-rewards-points-program-consumer-cost-of-living-supermarkets-national-australia/327f781d-4f87-42bd-adc3-211c35ee1f3c",
    "title": "Woolworths announces second change Everyday Rewards program",
    "publish_date": "Wed, 07 May 2025 00:00:00 +0000",
    "category": "finance",
    "authors": [
      "May"
    ],
    "text": "Woolworths will no longer offer its double Everyday Rewards points benefit to Delivery Unlimited customers from June 1.\n\nThe move comes as the company plans to streamline the Delivery Unlimited program to \"focus on the primary benefit for subscribers which is providing timely and convenient delivery\".\n\nCustomers have received an email notifying them about the change.﻿\n\nWoolworths will no longer offer its double Everyday Rewards points benefit to Delivery Unlimited customers from June 1. (Louie Douvis)\n\n\"Our Delivery Unlimited service continues to be very popular with customers and with an unlimited number of deliveries for $15 per month or $119 for an annual subscription, it provides great value and convenience to customers,\" a Woolworths spokesperson said.\n\nCustomers will instead receive three months complimentary Direct to Boot Now from Sunday, June 1 to Sunday, August 31.\n\nThe service, which offers direct to boot pick up in less than 60 minutes, normally costs shoppers $5 per order.\n\nCustomers have received an email notifying them about the change.﻿ (Getty)\n\n\"We believe Delivery Unlimited still provides compelling benefits to subscribers,\" the spokesperson said.\n\n\"However if anyone would like to cancel their subscription they can do so by contacting our customer service team.\"\n\nWoolworths will remove another popular benefit from its Everyday Rewards program next month.\n\nCustomers will no longer be able to access the monthly Big W 10 per cent off discount from the subscription-based Everyday Extra program on Sunday, June 1.",
    "source": "9News",
    "cluster_id": 1
  },
  {
    "url": "https://www.9news.com.au/world/what-name-the-new-pope-chooses-can-signal-whats-ahead/adae0672-b3b4-4fa3-9238-16a3640d765c",
    "title": "What name the new pope chooses can signal what's ahead",
    "publish_date": "Tue, 06 May 2025 22:36:37 +0000",
    "category": "entertainment",
    "authors": [
      "May"
    ],
    "text": "The first clue of the next pope's direction will be the name the winner chooses.\n\nThe announcement “Habemus Papam” – “We have a pope\" – from the balcony of St Peter’s Basilica is followed first by the revelation of the new pontiff's baptismal name, in Latin, followed by his papal name, wrought with meaning.\n\nA Pope Francis II would signify continuity with the late pontiff's pastoral legacy and his prioritising of the marginalised.\n\nREAD MORE: Trucking boss reveals staggering damage bill from nightmare M1 spill\n\nThe first clue of the next pope's direction will be the name the winner chooses, which could be Francis II. (AP)\n\nFrancis himself quipped that his successor would be John XXIV, after the progressive Vatican II-era pope.\n\nThe most popular papal name of the 20th century, Pius, would be a clear signal that a traditionalist is taking back the throne of St Peter.\n\n“In the deepest recesses of their mind, when they start the conclave, everyone will walk in there with a name in their head,\" Natalia Imperatori-Lee, chair of religious studies at Manhattan University, said.\n\nHistory of papal names\n\nFor most of the Catholic Church's first millennium, popes used their given names.\n\nThe first exception was the 6th century Roman Mercurius, who had been named for a pagan god and chose the more appropriate name of John II.\n\nThe practice of adopting a new name became ingrained during the 11th century, a period of German popes who chose names of early church bishops out of “a desire to signify continuity,\" the Reverend Roberto Regoli, a historian at Rome's Pontifical Gregorian University, said.\n\nFor many centuries, new popes tended to choose the name of the pope who had elevated them to cardinal.\n\nJohn was the most popular, chosen by 23 popes, followed by Benedict and Gregory, each with 16.\n\nFuneral of Pope Francis: World leaders and royals pay their respects View Gallery\n\nOnly starting in the mid-20th century did new popes begin to choose names signalling the aim of their papacy, Regoli said.\n\n“Even now, as we are waiting for the new pope, the name with which he will present himself will help us to understand the horizon towards which he wants to proceed,\" Regoli said.\n\nSome names have been out of use for centuries, like Urban or Innocent.\n\n“I don’t think anyone will pick Innocent,″ Imperatori-Lee said, given the abuse and other scandals that have rocked the church.\n\n”I don’t think that would be the right choice.\"\n\nRecent names\n\nFRANCIS: Pope Francis, elected in 2013, took the name of St Francis of Assisi, known for his humility, life of poverty and love of all creatures.\n\nWith it, Francis signalled a papacy focused on those who are often seen as outsiders, including the poor, prisoners and the LGBTQ+ community, while promoting peace, brotherhood and care of the environment.\n\nBENEDICT: Last chosen by German Cardinal Joseph Ratzinger, elected in 2005.\n\nPope Benedict XVI said he wanted to pay homage to Benedict XV, who led the church during World War I and dedicated himself to healing the rifts of war, and to the 6th century St Benedict, founder of Western monasticism, who helped spread Christianity throughout Europe.\n\nOne of Benedict XVI’s priorities was trying to revive the faith in Europe.\n\n“If we get a Benedict, then we will know that the cardinals chose to see Francis as an anomaly,\" Imperatori-Lee said.\n\nREAD MORE: Greens leader under threat from political earthquake in one state\n\nPope Benedict XVI said he wanted to pay homage to Benedict XV. (AP Photo/Markus Schreiber)\n\nJOHN PAUL: The papacy's first composite name was chosen by Cardinal Albino Luciani in 1978 to honour Pope John XXIII, who opened the Vatican Council II process that reformed the Catholic Church, and Paul VI, who closed it.\n\nThe name signalled a commitment to reforms, including sidelining the Latin Mass in favour of local languages and opening to other faiths, most significantly Judaism.\n\nJohn Paul I’s papacy lasted just 33 days.\n\nPolish Cardinal Karol Wojtyla, who succeeded him, chose the name John Paul II.\n\nJOHN: Chosen 23 times by popes, most recently in 1958 by Pope John XXIII.\n\nJohn can refer to St John the Apostle, one of Jesus' 12 apostles and the author of one of the Gospels, or St John the Baptist, the prophet who baptised Jesus.\n\n“John the XXIII was a pope that no one expected a lot from, but had a colossal impact on the church,\" Imperatori-Lee said.\n\n”So that could be a sign of what they want their pontificate to be like.\"\n\nPAUL: Chosen six times, most recently in 1963 by Paul VI.\n\nSt Paul the Apostle spread the teachings of Jesus in the 1st century.\n\nPIUS: It is associated with popes known for their traditionalist, anti-reform bent.\n\nPius IX ordered the kidnapping of the Jewish boy Edgardo Mortara in 1858 and raised him Catholic in the Vatican after learning he had been secretly baptised by a housekeeper; Pius X was the early 20th century anti-modernist who inspired the anti-Vatican II schismatic group, the Society of St. Pius X; Pius XII was the World War II-era pope criticsed for not speaking out sufficiently about the Holocaust.\n\n\"It is now a name that is hostage to some Catholic groups that can be considered traditionalists,\" Regoli said.\n\nREAD MORE: Fury after hundreds of koalas shot dead from helicopters\n\nPope Francis's tomb seen for first time in images released by Vatican View Gallery\n\nNew directions\n\nA new pope is free to choose a name never used before, as Francis did.\n\n“This would open a new season and could mean that his program is not in line with any of his predecessors, so an even more personalised program,\" Regoli said.\n\nImperatori-Lee suggested another name that might signal a continuation of Francis' legacy: Ignatius, for the founder of Francis' Jesuit order.\n\n“It would be interesting,\" she said.\n\n\"We've never had one of those.\"",
    "source": "9News",
    "cluster_id": 2
  },
  {
    "url": "https://www.9news.com.au/world/met-gala-2025-red-carpet-celebrities-in-pictures/f455cfc6-c69b-4f86-abce-f6042dd47453",
    "title": "Met Gala 2025: See all the celebrity looks",
    "publish_date": "Tue, 06 May 2025 06:25:00 +0000",
    "category": "entertainment",
    "authors": [
      "May"
    ],
    "text": "1 of 145 Attribution: Evan Agostini/Invision/AP\n\nThe 2025 Met Gala is underway, with celebrities showing off stunning looks on the (metaphorically) red carpet.\n\nThe Metropolitan Museum of Art's Costume Institute benefit gala this year celebrates the opening of the \"Superfine: Tailoring Black Style\" exhibition.\n\nThis year, it's about tailoring and suiting as interpreted through the history and meaning of Black dandyism across the Atlantic diaspora.\n\nContinue through the gallery to see some of the standout looks as we keep updating throughout the morning.",
    "source": "9News",
    "cluster_id": 3
  },
  {
    "url": "https://www.abc.net.au/news/2025-05-07/caleb-ewan-retirement-leaves-us-wanting-more-cycling/105262390",
    "title": "Like all great performers, Caleb Ewan bowed out leaving fans wanting more",
    "publish_date": "Wed, 07 May 2025 01:16:43 +0000",
    "category": "sports",
    "authors": [],
    "text": "Caleb Ewan's retirement from the professional peloton, with immediate effect, has taken the majority of the sport by surprise.\n\nAged just 30, the pocket rocket from Sydney looked to have rediscovered himself at an Ineos Grenadiers team that itself was undergoing something of a metamorphosis in 2025.\n\nTwo bunch sprints. Two wins.\n\nA career reborn?\n\nSadly not, another \"what if\" in a career that has, unfortunately, been dogged by them.\n\nEwan has — despite managing to resurrect a career that looked to be petering out last season — stuck with a performers golden rule of leaving them wanting more.\n\nHowever, most importantly, there was a sentence in the midst of his unfailingly honest and open retirement statement that hit home more than any other and shows that if the heart is not in it, there's little point in continuing.\n\n\"What once felt like everything to me no longer does,\" he wrote.\n\n\"The truth is that even when I crossed the line first, that feeling — the one you chase for years — faded quicker than it used to.\"\n\nIn the furious and frantic world of high-level sprinting, if the heart is not there, then the immeasurable risks are certainly not worth it.\n\nCaleb Ewan's extraordinary, unique forward sprinting style earned him 65 career victories. (Getty Images: Corbis/Tim De Waele)\n\nThe timing of this announcement will surprise plenty.\n\nEwan has never been one to conform though.\n\nWhen he burst onto the scene as a precocious youngster at the 2015 Herald Sun Tour and the 2016 Tour Down Under, there was nothing orthodox about his sprinting style.\n\nCrouched impossibly low over his handlebars, leaning so far forward it looked almost as if he was dragging his bike along behind him, Ewan seemingly popped his way out of the chaos of the charging peloton like a cork from the champagne that would invariably flow soon after he crossed the line.\n\nHis 65 career victories tell part of his story. The way he won them says the rest.\n\nBouncing behind and through opposition sprint trains, weaving Mark Cavendish-like into minuscule gaps before dropping the power to surge home, Ewan often had to fend for himself, a 165cm will-o'-the-wisp appearing at the front of the pack at the key moment.\n\nEwan used his diminutive size to superb effect, standing as one of the giants of sprinting.\n\nEwan Caleb's (centre) low sprinting style was unique in the professional peloton. (Getty Images: Kei Tsuji)\n\nContemporaries André Greipel (183cm), Fabio Jakobsen (181cm), Sam Bennett (178cm), Elia Viviani (177cm), Dylan Groenewegen (177cm) Jasper Phillipsen (176cm) and Mark Cavendish (175cm) all towered over the Sydneysider — not that it mattered when they were on the steps below him on the podium.\n\n\"For as long as I can remember, my world has revolved around racing,\" Ewan wrote in his retirement statement.\n\n\"The intense routine, the sacrifice, the search for constant improvement, the hunger to win — it's been my rhythm, my identity.\n\n\"The last few years haven't been easy but in 2025 I found something again — not just legs, but belief — thanks to the Ineos Grenadiers. They gave me space, trust, and the environment to rediscover what I am capable of.\n\n\"I won again. I felt like myself again and I felt respected again. For that, I can't thank them enough.\"\n\nCaleb Ewan returned to winning ways in his first race of the year at the 40th Settimana Internazionale Coppi e Bartali. (Getty Images: Dario Belingheri)\n\nWinning as a sprinter is everything.\n\nAnd winning was something Ewan was good at.\n\nHe is, after all, one of just 111 riders in the history of the sport who has claimed victory in each of cycling's three grand tours in the 90 years the Giro d'Italia, Tour de France and Vuelta a España have all co-existed, with five victories at the Tour de France, five at the Giro and one at the Vuelta.\n\nHe is one of just five, alongside Simon Gerrans, Michael Matthews, Rohan Dennis and, last year, Ben O'Connor, to have done so from Australia.\n\nCaleb Ewan earned his first Tour de France stage win in Toulouse by an inch from Dylan Groenewegen. (Getty Images: Chris Graythen)\n\nAnd yet there have always been disappointments too.\n\nTwice Ewan came agonisingly close to winning the sprinters monument, Milano-Sanremo, finishing behind Jasper Stuyven in 2021 and, in 2018, winning the bunch sprint behind Vincenco Nibali's bold solo win.\n\nEarlier in his career, despite his impressive form in the sprints in minor races, it took a move to Lotto Soudal in 2019 before he was given his first crack at the Tour de France.\n\nHis inclusion was instantly vindicated, winning three stages having also won two at that year's Giro — the first sign of many \"what ifs\" that may come to define his career.\n\nEwan competed at every Tour between then and 2023, but won his last stage at cycling's most high profile race in 2020. His last grand tour win came the following year at the Giro d'Italia, although he did manage two second place finishes at the Giro and Tour in subsequent seasons.\n\nOne of Ewan's five Tour de France wins came on the historic Champs-Élysées. (Getty Images: Justin Setterfield)\n\nThose diminishing returns led to a total breakdown in trust between himself and the Belgian team, prompting a move back to GreenEdge.\n\nThere, things went from bad to worse.\n\nAt the 2024 Giro, where Ewan finished no higher than sixth in bunch sprints, GreenEdge allowed German rider Max Walscheid — Ewan's lead-out man following Luka Mezgec's withdrawal — to sprint against him.\n\nIt was described as \"bonkers\" by Ineos rider Geraint Thomas, as \"a pretty shitty situation\" by Ewan himself.\n\n\"My experiences of the past two seasons, in particular the second half of 2024, has taken a significant toll on my relationship with the sport,\" Ewan said in his statement.\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\n\"I'm happy I didn't let that period define the end of my career and I am proud of what I achieved in a short but successful time with the Ineos Grenadiers.\"\n\nWhat he did achieve, those two wins against a questionable standard of opposition at the Itzulia Basque Country and the Settimana Internazionale Coppi e Bartali, offered a glimpse at a revival.\n\nBut, instead, we're left with another what if — albeit from the entirely understandable position of not wanting to go on if his heart is not in it.\n\nCycling commentator Matthew Keenan told ABC Sport in Adelaide earlier this year that he \"would hate for him [Ewan] to finish his career thinking that he's left anything on the table\".\n\nWhether he did leave any major wins on the table will be one of the great unknowns.\n\nBut given that from his perspective the cupboard was well and truly bare, one cannot fault his choice.",
    "source": "ABC",
    "cluster_id": 4
  },
  {
    "url": "https://www.abc.net.au/news/2025-05-07/laura-tingle-announced-as-abc-global-affairs-editor/105262626",
    "title": "7.30's Laura Tingle to become ABC's new Global Affairs Editor",
    "publish_date": "Wed, 07 May 2025 01:03:27 +0000",
    "category": "finance",
    "authors": [],
    "text": "The ABC's 7.30 Political Editor Laura Tingle is leaving the current affairs program after six years to take up a new position as Global Affairs Editor, the broadcaster has announced.\n\nTingle, a Walkley-Award-winning journalist, will take up the post mid-year, joining a network of foreign correspondents, the Asia Pacific Newsroom and Foreign Correspondent staff.\n\nAs one of Australia's most highly respected journalists, Tingle takes over from John Lyons who was announced as the ABC's new Americas Editor in February.\n\nAs Global Affairs Editor, Lyons, a former editor of The Sydney Morning Herald, reported heavily from the Middle East after the October 7 attacks and from inside Iran for Four Corners.\n\nLaura Tingle, pictured on the set of 7.30, is a respected political journalist of more than 40 years.\n\nTingle said she was \"exceptionally excited\" to use her skills to report on global events \"around the world that also shape our nation\".\n\n\"I started my journalistic career at a time when Australia and the world were being challenged and transformed by the forces of deregulation and the freeing up of global trade,\" she said.\n\n\"Forty years on, we are in even more uncertain times.\n\n\" It's so important that the national public broadcaster has Australian eyes on the world, putting the significance of major global events into context for local audiences. \"\n\nABC chair calls for return of China correspondent Photo shows Williams wears black rimmed glasses at his home, looking outward to some greenery Kim Williams says the ABC is \"eager to restore\" a bureau in Beijing after the last correspondent was forced to leave in 2020.\n\nThe ABC's choice of Tingle, a respected political journalist of more than 40 years, comes after ABC Chair Kim Williams spoke on the importance of the ABC's continued international coverage.\n\nIn a September speech, Mr Williams flagged his desire to return ABC correspondents to China as a \"critical centre\" of the world.\n\nABC News currently has correspondents in 11 overseas locations and another seven local reporters based around our region under the Pacific Local Journalism Network.\n\nABC Director of News Justin Stevens said Tingle had the \"experience, knowledge and skills to help audiences make sense of the extraordinary times we're living in\".\n\n\"International reporting is a cornerstone of the ABC News service,\" he said in a statement.\n\n\"We have an outstanding group of foreign correspondents and technical specialists and Laura will add even more firepower to this busy and productive team.\"\n\nABC News will now advertise for a new 7.30 Political Editor.\n\nABC",
    "source": "ABC",
    "cluster_id": 5
  },
  {
    "url": "https://www.abc.net.au/news/2025-05-07/willie-rioli-explainer-threats-to-other-players/105262442",
    "title": "Koch 'incredibly angry' with Rioli as AFL scrambles to take action",
    "publish_date": "Wed, 07 May 2025 00:49:26 +0000",
    "category": "sports",
    "authors": [],
    "text": "More claims of threats towards opposition players have emerged against Port Adelaide's Willie Rioli, with three different clubs now involved.\n\nThe claims range from threats made on the field to at least one made via a message off the field.\n\nHere's everything you need to know in a quickly unfolding story.\n\nWhat sparked the claims and what did Willie Rioli say?\n\nThe Western Bulldogs claimed Rioli sent a message to one of their players, indirectly threatening violence against Bailey Dale following an altercation on the field on the weekend.\n\nThe claim suggested that Rioli had told Dale's teammate that the defender should be careful during the club's visit to Darwin this weekend to play the Gold Coast Suns — which was an indirect threat to Dale's safety.\n\nWhile Rioli was fined $1,000 for the on-field physical altercation with Dale, the AFL deemed there was no case to answer for the off-field threat as Rioli had apologised to Dale.\n\n\"The AFL has today spoken to both Port Adelaide and the Western Bulldogs and while confirming it will take no further action to that undertaken by the clubs and players, it has reminded both clubs to ensure any communications remain respectful,\" a statement read.\n\nWhat are the claims that have come out since?\n\nAfter the AFL announced it would not take action against Rioli, two further claims emerged of the forward making \"pretty violent\" threats against players from Geelong and Essendon during the 2024 season.\n\nFootage has emerged of Rioli engaged in an aggressive push and shove with Cats players in their round nine match at Kardinia Park, after Rioli gave away a 100m penalty to Cats defender Zach Guthrie.\n\nRioli is then seen arguing with Zach's brother, Cameron, before a short clip shows him speaking aggressively towards Cats forward Brad Close.\n\nClose is believed to have been the target of what has been described as a \"horrific\" personal threat.\n\nAn angry Jeremy Cameron is then seen confronting Rioli after the alleged comment.\n\nClaims have been made that Laura Kane knew about the Geelong incident, but the AFL has denied it. (Getty Images: AFL Photos/Michael Willson)\n\nAfter the match, Close and his fellow Cats players decided not to officially raise the incident with the AFL, but it was mentioned to Cats football boss Andrew Mackie.\n\nConflicting reports have since emerged about whether Mackie then communicated the incident to the AFL's football boss, Laura Kane, with The Age reporter Caroline Wilson saying that it had been raised — a claim the AFL dismissed as \"entirely false\" while the Cats said they did not approach the AFL.\n\nAfter the Geelong incident came to light, a further alleged threat towards Essendon player Archie Roberts came to light from a game in early 2024. Both Roberts and the club did not take the matter further.\n\nWhat is the AFL doing about the alleged threats?\n\nThe AFL initially decided to clear Rioli over the message to Dale, despite a flood of outrage from fans who questioned why players were being fined for incidents as small as flipping the bird at the crowd, while the Power star managed to escaped sanction.\n\nHowever, the emergence of further alleged threats has sent the AFL scrambling, with claims it was unaware of the incidents from 2024.\n\nHigh level discussions were underway on Wednesday morning to discuss the issue, with a \"distressed\" Rioli now potentially facing a significant fine or a suspension over the claims.\n\nPort Adelaide are set to face cross-town rivals Adelaide on Saturday night in what is expected to be a heated match.\n\nWhat have key figures said?\n\nPort Adelaide coach Ken Hinkley is set to face his usual press conference on Wednesday afternoon and will be pushed on the matter.\n\nClub chair David Koch said he and the board were \"incredibly angry\" with Rioli.\n\n\"We're incredibly angry about the situation and Willie knows that. And what's said on the field is one thing. What's done off the field — particularly on social media — and a private message to another player who he thought would stay private but then was passed on, it gets very complicated,\" Koch said on Adelaide radio.\n\nDavid Koch says the board is angry with Rioli, adding that comments made on the field are less problematic than those made off it. (AAP Image: Julian Smith)\n\n\"We've talked pretty sternly to Willie about it and said it's just not on.\n\n\"On field in the heat of the battle is one thing. Off-field and on social media is totally different. That's why we're really angry with Willie and what he did, and there's absolutely no excusing that, and don't get me wrong on it. But we've got a duty of care to support the players and turn a bit of attention on what society is doing to these players.\"\n\nKoch reiterated that he thought on-field comments were a different situation from off-field.\n\n\"If you're going to start examining every comment, not only against Indigenous players but other players as well, then I'm not sure where that will end up, because it happens constantly,\" he said.\n\n\"You can't just isolate a couple of comments from a particular player. Otherwise you then start to open it up — or you should start to open it up — for comments across every player, and it would be never-ending at that stage.\n\n\"You'd either have to crack down on every comment and say, 'OK there's no sledging, there's no sledging getting inside people's heads, there's no sexual references, there's no racial comments,' all that sort of thing and you just ban it altogether.\"\n\nEssendon coach Brad Scott said his club had no issues with Rioli.\n\nLoading...\n\n\"It's not an Essendon issue. Our players have zero concerns,\" Scott said on Wednesday.\n\n\"There are community expectations around player behaviour on and off the field, but within those expectations, I have a pretty firm belief of what happens on the field should stay on the field, provided that it's within general community expectations.\n\n\"Our players feel that whatever was said or done on field against Port Adelaide should stay on the field. We're not interested in engaging further.\"\n\nGeelong said in a statement that the alleged incident at Kardinia Park had be dealt with.\n\n\"In regards to a report on Tuesday night relating to an incident during the Geelong v Port Adelaide game in round nine, 2024, the club can confirm the matter was not raised with the AFL,\" a Cats statement said.\n\n\"The club spoke directly with Port Adelaide after the match and considered the matter dealt with.\"",
    "source": "ABC",
    "cluster_id": 6
  },
  {
    "url": "https://www.abc.net.au/news/2025-05-07/asic-macquarie-bank-licence-conditions-compliance-failure/105262220",
    "title": "ASIC takes action against Macquarie for 'significant' failures",
    "publish_date": "Tue, 06 May 2025 23:18:45 +0000",
    "category": "finance",
    "authors": [],
    "text": "Macquarie Bank has been hit with additional licence conditions after being slammed by the corporate regulator for \"multiple and significant compliance failures\".\n\nThe Australian Securities and Investments Commission (ASIC) has taken action against the investment bank by imposing additional conditions on its financial services licence.\n\nASIC said the failures related to Macquarie's futures dealing and derivatives trading divisions, noting some went undetected for many years — in one case, for a decade.\n\nASIC identified nine market conduct matters of concern in the past 18 months, with seven matters related to misreporting of more than 375,000 over-the-counter (OTC) derivative transactions, and two futures dealing matters related to the prevention and detection of suspicious trading activity and the withholding of orders on the ASX24 market.\n\nOTC derivatives are financial contracts traded directly between two counterparties rather than via an exchange, such as the ASX.\n\n\"Our intervention underscores our concern with the recurrent nature of Macquarie's failures, which were caused by ineffective supervision and weak compliance and control management,\" ASIC commissioner Simone Constant said.\n\nThe incidents include the repeated failure to prevent a number of suspicious orders on the electricity futures market.\n\n\"We were particularly disappointed that Macquarie failed to prevent 11 suspicious orders being placed on the electricity futures market via Macquarie terminals shortly after ASIC had referred similar failures to the Markets Disciplinary Panel which fined the bank just under $5 million,\" Ms Constant added.\n\nWhat are the extra conditions on Macquarie's licence?\n\nThe additional licence conditions ASIC imposed on the bank will require Macquarie to:\n\nPrepare a remediation plan to address the failures in its futures dealing business and OTC derivatives trade reporting functions and their root causes;\n\nAppoint an independent expert to review and report on the adequacy of Macquarie's remediation plan to address the failures and their root causes; and\n\nHave the independent expert assess the operational effectiveness of Macquarie's remediation activities to prevent, detect and respond to similar issues occurring in the future.\n\n\"Misreporting of OTC derivative transactions can undermine market transparency and hinders ASIC's ability to monitor potential risks in Australia's financial system,\" Ms Constant explained.\n\n\"These licence conditions are necessary to give ASIC confidence the remediation will be effective and drive sustainable change.\"\n\nMacquarie released a statement this morning responding to ASIC's action.\n\n\"MBL [Macquarie Bank Limited] takes its role as a licensed entity extremely seriously, including the importance of ensuring the integrity of the markets in which it operates and learning from instances where compliance has been inadequate,\" the bank said.\n\n\"In addition to working constructively with ASIC on these remediation activities, MBL continues to invest in a broader range of existing programs to strengthen its systems, controls and supervisory arrangements.\n\n\"ASIC has acknowledged Macquarie's cooperation throughout the process and its consent to the licence conditions.\"",
    "source": "ABC",
    "cluster_id": 7
  },
  {
    "url": "https://www.abc.net.au/news/2025-05-07/petra-kvitova-wins-at-italian-open/105262416",
    "title": "Kvitová wins on tour for first time since becoming a mother",
    "publish_date": "Tue, 06 May 2025 23:12:08 +0000",
    "category": "sports",
    "authors": [],
    "text": "Petra Kvitová has won her first match since returning to the WTA Tour following the birth of her son last year.\n\nKvitová, a two-time Wimbledon champion, gave birth to son Petr in July and made a comeback to the tour in February.\n\nThe former world number two had spent 15 months away from the game and lost all four of her matches since returning.\n\nBut the losing streak ended at the Italian Open in Rome via a 7-5, 6-1 first-round victory over Romania's Irina-Camelia Begu.\n\nNaomi Osaka's win is a rallying cry for mums on tour Photo shows Naomi Osaka looks at a tennis ball she's just hit with her curly hair flying behind her. Female tennis players face agonising decisions about fertility, but pioneers like Naomi Osaka are forging new paths for future athletes.\n\n\"I was 95 per cent [sure] that I would never come back,\" Kvitová said.\n\n\"I had enough of tennis at that time. I was like, 'I can't do it anymore,' so we decided to try for a baby.\n\n\"I didn't say anything because it wasn't 100 per cent. When I could do something finally after pregnancy, I played some tennis and it felt so good.\n\n\"I was laughing. Every shot I hit smoothly, I was like, 'Wow, it's still there.'\"\n\nKvitová faces Tunisia's three-time major finalist Ons Jabeur, seeded 27, in the second round.\n\nMeanwhile, Australia's Kimberly Birrell lost to Briton Sonay Kartel 3-6, 6-4, 6-3 in the first round.\n\nBirrell's exit leaves three Australians in the main draw after Ajla Tomljanović beat compatriot Olivia Gadecki in the final round of qualifying.\n\nTomljanović now plays Varvara Gracheva of France.\n\nAnother Australian qualifier, Maya Joint, meets former US Open champion Emma Raducanu.\n\nRussia-born 14th seed Daria Kasatkina, who recently switched allegiance to Australia, has a bye to the second round.\n\nAAP",
    "source": "ABC",
    "cluster_id": 8
  },
  {
    "url": "https://www.abc.net.au/news/2025-05-07/wa-bush-firefighters-industrial-action-impacting-burnoffs/105258310",
    "title": "Concerns industrial action could delay critical controlled burns in WA",
    "publish_date": "Tue, 06 May 2025 22:31:25 +0000",
    "category": "finance",
    "authors": [],
    "text": "An ecologist and bushfire management expert says delays to scheduled fuel reduction burn-offs across southern Western Australia may increase the risk of bushfires next summer.\n\nThe state's prescribed burns have fallen behind schedule due to industrial action by hundreds of firefighters employed by the Department of Biodiversity, Conservation and Attractions (DBCA), which manages the program.\n\nUnlike Department of Fire and Emergency Services firefighters, the DBCA workers deal with the management of state-owned and operated forests and land throughout the year, which includes bushfire responses.\n\nDelays have mounted in recent weeks as the firefighters have been working to rule — meaning no overtime or work on public holidays.\n\nDespite the industrial action, the firefighters are committed to responding to any wildfires.\n\nJoe Fontaine says further delays to the burning program could increase bushfire risk. (ABC News: Rhiannon Shine)\n\nMurdoch University ecology lecturer Joe Fontaine said there was less broad-scale burning during autumn, which was usually busy.\n\n\"That takes a lot of work, a lot coordination … because of the hours and staffing required,\" he said.\n\n\"Right now, burning is focusing on high-risk areas closer to where people live.\"\n\nDr Fontaine said the overall fuel load was likely to mount in fire-prone areas ahead of next summer's bushfire season if the burn-off delays increased.\n\nIndustrial action is 'mild'\n\nThe Australian Workers' Union, which represents the firefighters, said the 300 workers had been seeking better conditions and wages for more than two years.\n\nAustralian Worker's Union DBCA delegates met in Bunbury. (Supplied: AWU WA)\n\nWA Branch president Andy Hacking said the firefighters were paid between 15 to 20 per cent lower than other government sectors, with many on a yearly salary between $60,000 and $70,000 per year.\n\n\"They're just not paid well for the type of work they do,\" he said.\n\n\" In the fire season they are right in the thick of it. \"\n\nHe said the challenging nature of the work warranted improved conditions.\n\n\"We need an uplift because if we have a mild fire season, these guys are struggling to pay their bills,\" he said.\n\nThe WA government declined to reveal the impact the industrial action was having. (Supplied: Department of Biodiversity, Conservation and Attractions)\n\nWorkers will still fight wildfires\n\nIn response to questions from the ABC, a state government spokesperson declined to detail the direct impact of the industrial action.\n\n\"We value the hard work of our frontline bushfire staff,\" the spokesperson said.\n\n\"The state government continues to bargain in good faith with the AWU and is committed to reaching a negotiated settlement as soon as possible.\n\n\"The AWU has assured [the] government that industrial action will not affect emergency bushfire suppression.\"",
    "source": "ABC",
    "cluster_id": 9
  },
  {
    "url": "https://www.abc.net.au/news/2025-05-07/asx-markets-business-live-news-may-7-2025/105262110",
    "title": "Live: NAB profit falls 2.5pc, ASX buoyed by US-China talks to 'de-escalate' trade war",
    "publish_date": "Tue, 06 May 2025 22:04:25 +0000",
    "category": "finance",
    "authors": [
      "David Chau",
      "Emily Stewart",
      "Stephanie Chalmers",
      "Michael Janda"
    ],
    "text": "Good morning and welcome to the ABC's daily finance blog! I'll be your guide for the next few hours.\n\nThe Australian share market is set to begin its day lower, following another weak performance on Wall Street on the back of Trump-related headlines (again).\n\nASX futures are down 0.4%, so that points to a slight drop for the local market (make it the third day in a row it has fallen).\n\nUS President Donald Trump has met with newly-elected Canadian Prime Minister Mark Carney in the White House, who reiterated his country is \"not for sale\" and \"won't be for sale ever\".\n\nTrump, meanwhile, made some remarks which made investors a little nervous.\n\n\"Everyone says, ‘When, when, when are you going to sign deals?’ We don’t have to sign deals,\" the President said. “They have to sign deals with us. They want a piece of our market. We don’t want a piece of their market.”\n\nOnce again, investors are getting 'mixed messages' from the White House about how long it will take for America's trade war with the rest of the world to de-escalate.\n\nEarlier this week, Treasury Secretary Scott Bessent said \"we’re very close to some deals\".\n\nEven Trump himself, on the weekend, said some trade deals could happen as early as this week.\n\n\n\nLately, stock markets across the world have been surging on speculation some deals would be announced soon.\n\nSome of that enthusiasm faded on Wall Street overnight, with the Dow Jones (-1%), S & P 500 (-0.8%)and Nasdaq Composite (-0.9%) recording sizable losses.\n\nThere were also signs of 'trade anxiety' on currency markets.\n\nThe US Dollar Index, which measures the greenback against a basket of currencies including the yen and the euro, fell 0.6% to 99.19.\n\nThe weaker greenback helped push the Australian dollar (briefly) above 65 US cents overnight, the highest it's been since the year began.",
    "source": "ABC",
    "cluster_id": 10
  },
  {
    "url": "https://www.abc.net.au/news/2025-05-07/road-cycling-australia-caleb-ewan-retires/105262164",
    "title": "'A wild ride': Aussie sprint ace Ewan stuns cycling world with retirement",
    "publish_date": "Tue, 06 May 2025 21:57:31 +0000",
    "category": "sports",
    "authors": [],
    "text": "Australian cycling star Caleb Ewan has retired from the sport, effective immediately, only a few months after joining a new professional team.\n\nEwan delivered his bombshell decision on social media, saying events in the past two years — especially around his messy exit from top Australian team Jayco AlUla — had \"taken a significant toll on my relationship with the sport\".\n\nThe 30-year-old sprint ace started this year without a team and it looked as though his career could end prematurely.\n\nBut he joined high-profile British outfit INEOS Grenadiers and made a successful return in late March, winning his first comeback race.\n\nHe then claimed a UCI World Tour-level win last month and appeared to be back on track.\n\nCaleb Ewan calls out Jayco AlUla after 'bonkers' Giro situation Photo shows Caleb Ewan signs his name before starting a stage Australian cyclist Caleb Ewan is looking forward to continuing his career at Ineos Grenadiers after being put in a \"pretty shitty situation\" at Jayco AlUla.\n\nWriting on X, Ewan described his career as \"a wild ride\".\n\n\"The last few years haven't been easy, but in 2025 I found something again — not just legs, but belief — thanks to the INEOS Grenadiers,\" Ewan wrote.\n\n\"They gave me space, trust and the environment to rediscover what I am capable of. I won again.\n\n\"But the truth is that even when I crossed the line first, that feeling — the one you chase for years — faded quicker than it used to.\n\n\"My experiences of the last seasons, in particular the second half of 2024, has taken a significant toll on my relationship with the sport. I'm glad I didn't let that period define the end of my career.\"\n\nEwan's woes can be traced back to 2021, when he was at the peak of his powers and one of road cycling's premier sprinters.\n\nHe publicly declared his bold ambition that season to win stages in each of cycling's Grand Tours, and he was on track, with two in the Giro d'Italia.\n\nBut Ewan crashed at the end of stage four in the Tour de France and suffered a broken collarbone that needed surgery.\n\nWhile he returned to racing a few weeks later, he was never the same rider.\n\nHe left Belgian team Lotto Dstny in strained circumstances at the end of 2023 and returned to Jayco AlUla, where he started his professional career.\n\nBut that did not go well and in early January it suddenly became apparent that Ewan's profile had disappeared from the team website.\n\nAussie Vine back on podium Photo shows Jay Vine on the podium with other placegetters at Tour de Romandie. Jay Vine takes another major step on his remarkable comeback to professional cycling by making the podium in third place at one of Europe's top stage races.\n\nBy the end of the month, he had signed with INEOS Grenadiers.\n\nEwan has had a rich cycling career, with five stage wins at the Tour de France and another five at the Giro d'Italia.\n\nHe was also runner-up twice at Milano-Sanremo, one of cycling's five one-day monuments and a major career goal that Ewan never quite cracked.\n\nEwan won nine stages at Adelaide's Tour Down Under.\n\n\"Over the course of my 11-year career, I've achieved more than I ever imagined possible,\" Ewan wrote.\n\n\"The journey has exceeded every expectation I once had and I'm deeply grateful.\n\n\"But what once felt like everything to me no longer does.\"\n\nAAP",
    "source": "ABC",
    "cluster_id": 11
  },
  {
    "url": "https://www.abc.net.au/news/2025-05-07/what-the-election-revealed-about-the-china-relationship/105260770",
    "title": "China congratulated Albanese on election night. That tells us a lot",
    "publish_date": "Tue, 06 May 2025 21:46:53 +0000",
    "category": "finance",
    "authors": [],
    "text": "On election night, as Labor secured a second term, China's foreign ministry released a statement congratulating the Albanese government — time-stamped just before midnight on a national public holiday.\n\nFor a government that rarely rushes to comment on foreign elections, the timing alone was notable.\n\nThe language was even more revealing.\n\nThe statement referenced the \"important consensus\" reached between President Xi Jinping and Prime Minister Anthony Albanese — a deliberate nod to personal diplomacy and Beijing's desire to \"continue promoting a more mature, stable and productive China-Australia comprehensive strategic partnership\".\n\nIn the careful world of Chinese diplomatic language, it was a clear message: Beijing had been closely watching — and was keen to rebuild trust with the Australian public.\n\nXi sees Australia as a strategic partner — a relatively stable player amid the turbulence of Beijing's deteriorating relationship with the United States.\n\nHe sees the re-election of the Albanese government not just as political fact, but as strategic opportunity.\n\nThe next three years will test whether Albanese's measured approach can hold under pressure — from Beijing, from Washington, and from domestic critics.\n\nBeijing may not want to be the story. But it's already one of the biggest stories in our region.\n\nFederal politics live updates: Get the latest on the post-election election landscape\n\nLive results: Find out what's happening in your seat as counting continues\n\nThe Darwin Port dilemma\n\nWhen Chinese Foreign Minister Wang Yi met his Australian counterpart Penny Wong on the sidelines of the G20 in Johannesburg in February, he made a specific point.\n\nChina had no interest in meddling with Australia's federal election, Wang said.\n\nIt was a diplomatic assurance that suited both sides.\n\nLabor presented itself as calmly confident in dealing with China during the campaign. (ABC News: Luke Stephenson)\n\nChina didn't dominate the campaign — but the story of China lingered just beneath the surface of the debate between Albanese and his rival Peter Dutton.\n\nAnd while China said it didn't want to interfere in Australian elections, the signs of interest were unmistakable.\n\nChina's ambassador to Australia, Xiao Qian, published two opinion pieces during the campaign — one in the Australian Financial Review, the other in The Australian — outlining Beijing's vision for the bilateral relationship.\n\nTogether it formed a careful choreography: not overt interference, but strategic visibility.\n\nNow that the election result is settled, deeper challenges will surface.\n\nChief among them is the future of the Darwin Port lease — a politically charged issue first raised under the Morrison government, and a recurring flashpoint in Australia's China debate.\n\nChinese community urges rethink on Labor, Coalition's Darwin Port plans Photo shows Shuqin Li Darwin's Chinese community is calling for federal Labor and the Coalition to reconsider plans to take back the Darwin Port lease.\n\nIn 2015, Chinese company Landbridge secured a 99-year lease on the port in a $506 million deal.\n\nSince then, it has undergone multiple national security reviews — all of which have so far upheld the lease.\n\nBut in the final weeks of the campaign, pressure mounted again. Critics argued the lease undermines sovereignty and national security.\n\nLabor, pre-empting attacks, pledged to \"reconsider\" the deal if re-elected.\n\nLandbridge has known ties to China's military through its founder's reported involvement in state-led defence logistics programs.\n\nIt was the Northern Territory's Country Liberal Party government that signed the 99-year lease with Landbridge in 2015 under the Coalition government led by Malcolm Turnbull — and any move by Labor to overturn it now would face significant legal, diplomatic and commercial hurdles.\n\nFormer Australian ambassador to China Geoff Raby sees it differently.\n\n\"My view is the whole issue is ridiculous,\" said Raby, now the chair and CEO of a Beijing-based business advisory firm.\n\nLabor pledged to \"reconsider\" the Darwin Port deal if re-elected. (ABC News: Michael Franchi)\n\n\"It's been reviewed again and again. The Port of Darwin isn't a national security risk. This is about political opportunism — and if we keep moving the goalposts, we risk damaging Australia's credibility as an investment destination.\"\n\nRaby also warned of a broader consequence: sovereign risk.\n\nIf foreign investors — not just in China — believe that legally binding deals can be overturned for political reasons, Australia's reputation as a reliable destination could suffer.\n\nChina's silent campaign gift\n\nThen there was maritime theatre.\n\nChinese military and research vessels were observed moving along Australia's coastline in March, stirring debate in the media and defence circles.\n\nChinese warships re-enter Australia's Exclusive Economic Zone and head closer to Tasmania Photo shows A black and white image of a navy ship. Three Chinese warships that completed live-fire drills in the Tasman Sea re-entered Australia's Exclusive Economic Zone and were tracked operating east of Hobart.\n\nThe sighting of these vessels sparked controversy across Australia, reigniting debate over how the nation should respond to a rising China asserting its presence in the region.\n\nThe prime minister and other senior Labor figures responded calmly.\n\nAlbanese said that while he'd \"prefer\" the ship wasn't in Australian waters, he emphasised China hadn't broken international law.\n\n\"That was not just a coincidence,\" said Liu Luxin, a Chinese-Australian political commentator.\n\n\" It actually helped Labor. These moves had a positive effect for the Albanese government. \"\n\nAll seven of the marginal seats with the largest Chinese populations have turned to Labor.\n\nLoading...\n\nOnly Menzies, where Labor candidate Gabriele Ng leads, is still too close to call.\n\nLabor didn't campaign on foreign policy — but its message of stability, especially on China, with all of the chaos from the US-China trade war, resonated in key multicultural electorates.\n\n\"It reminded people that Labor has kept the relationship with China steady. People didn't want instability — they wanted continuity,\" Liu said.\n\n\"That presence might have been subtle, but it mattered more than people realised.\"\n\nStill, others argue that the link between the vessels and the election outcome is tenuous.\n\nThe government itself made no public comment connecting the two, and defence analysts stopped short of attributing political intent.\n\nWhat's clear, however, is that China remains a powerful backdrop to how many Australians think about security, stability and leadership.\n\nWhat does China want from another Albanese term?\n\nFor Beijing, a second Albanese term offers opportunity.\n\nAfter inheriting one of the lowest points in the bilateral relationship in 2022, the foreign minister re-established diplomatic contact and softened the tone.\n\nNow, with US-China tensions intensifying — and Donald Trump's re-election inflaming global uncertainty — Beijing sees Australia as a stable market and business partner, particularly as it faces steep tariffs in the US.\n\nWith both Canada and Australia returning centre-left governments this year, China may view them as useful interlocutors amid broader global economic and diplomatic fragmentation.\n\nAlbanese's big challenge is straddling the US-China fence Photo shows Donald Trump frowns as he looks off camera while Xi Jinping stands behind him. America has decided to sever its trading relationship with China — a strategy that ultimately will come at enormous cost. And Australia, more than any other nation, will be caught smack in the middle.\n\nXi also remains interested in joining the Comprehensive and Progressive Agreement for Trans-Pacific Partnership (CPTPP).\n\nBut Taiwan's inclusion in early-stage discussions has aggravated Beijing, which insists the island is a province of China.\n\nHow Albanese and Wong navigate Taiwan's role — while maintaining support for democratic norms — will be closely watched by officials in Beijing.\n\nAfter securing Australian journalist Cheng Lei's release in 2023, the Albanese government was praised for its quiet diplomacy.\n\nThe fate of Australian citizen Yang Hengjun presents a far tougher test.\n\nDetained in China since 2019, Yang was sentenced earlier this year to a suspended death penalty — a ruling that has drawn strong criticism from human rights advocates and the Australian government.\n\n\"The Albanese government raises it at every opportunity,\" said Raby.\n\n\"They are focused, and committed to pursuing it without megaphone diplomacy. And I think they will keep doing that — carefully and persistently.\"",
    "source": "ABC",
    "cluster_id": 12
  },
  {
    "url": "https://www.abc.net.au/news/2025-05-07/melioidosis-outbreak-bacteria-study-scientists-epidemic/105255232",
    "title": "Scientists racing against the clock to tackle an 'unprecedented' threat",
    "publish_date": "Tue, 06 May 2025 21:46:02 +0000",
    "category": "lifestyle",
    "authors": [],
    "text": "Under the hum of filtered air and fluorescent light in an air-locked university lab, Jeff Warner lifts an agar plate to eye level, inspecting its potentially deadly contents.\n\nTilting the violet dish in his double-gloved hand, he notes several streaks of pink — a cross hatching of colonies; tiny microbial clusters teeming with life, invisible to the naked eye.\n\nThe distinct colours and formations are instantly recognisable to him: it's the killer bacterium linked to 30 deaths in a \"mysterious\" and unprecedented outbreak that's devastating Queensland families and putting immense pressure on regional hospitals.\n\n\"This organism has currently killed almost one in five people who have acquired it from the environment, here in Cairns and Townsville,\" Associate Professor Warner told 7.30.\n\nThe veteran microbiologist first came across the disease close to 30 years ago and is now considered a global research leader on the topic, based at James Cook University in the tropical north.\n\n\"You can toy with the words all you want,\" he says.\n\n\" But the cases up here, this wet season, are unprecedented. \"\n\nScientists at James Cook University are studying the bacteria that leads to melioidosis. (ABC News: Brendan Mounter)\n\nThe bacterium on the plate is Burkholderia pseudomallei, classified by the US Centers for Disease Control and Prevention as a Category B biowarfare agent, for its high fatality rate and its potential to be aerosolised and weaponised.\n\nIn Queensland, however, the threat isn't theoretical or military. It's real and environmental — lurking in soil and muddy water, stirred up by flooding rains and inhaled, ingested, or entered into the bloodstream through cuts and scratches.\n\nFor the unlucky, it leads to melioidosis — a virulent disease that enables chronic skin ulcers, sepsis, and serious lung infections like pneumonia. If left untreated, or diagnosed too late, it can be fatal.\n\n\"It replicates [and] produces proteins that are toxins to our body, and that's fundamentally what causes the fatality,\" Professor Warner said.\n\nThe bacterium is typically confined to tropical climates where it thrives in heat and humidity, but scientists and health authorities are increasingly concerned it could be pushed further south as Australia's climate warms and our urban footprint expands.\n\n\"In the end, we don't really know why so many cases have happened,\" he said.\n\nDr Jeff Warner has been studying melioidosis for decades. (ABC News: Tom Hartley)\n\nIn the water and on the move\n\nIn Townsville, a different pattern is emerging. The city has long been considered the unofficial home of melioidosis — early cases of the disease were once clustered around Castle Hill, the city's granite monolith.\n\nDr Warner says that is no longer the case.\n\nIn recent months, new clusters have surfaced north of the city — Professor Warner believes they are not random.\n\nThe melioidosis mystery plaguing scientists Photo shows A middle-aged man wearing a grey singlet and beige cap sits in his backyard. Luke Bantoft has survived melioidosis but the experience has left him \"petrified\" of returning to his home where he believes he caught it.\n\nHe suspects the bacterium is moving, and is investigating if it is changing in the same way a flu can, becoming better adapted to the climate, the people who live in the area, or both.\n\n\"We have proven in the past that the organism is available in ground water as it goes through Castle Hill,\" Professor Warner said.\n\n\"That's now changed the actual demographic and the case notifications [have] now quite substantially changed.\n\n\"Why has it changed? Have we got any evidence that it's moving? We don't ... so the missing link in melioidosis research is ... trying to understand the environmental microbiology of the disease.\n\n\"Until we do, we're not going to be able to really develop good quality, targeted [and] informed public health messaging to actually help people understand risk.\"\n\nThe data shows melioidosis is on the move in Townsville. (ABC News: Tom Hartley)\n\nGiven its presence in groundwater, Professor Warner says that may explain how cases have spread.\n\n\"Water seems to be important in the organism's mobility,\" he explained.\n\n\"We all know that when the wet season breaks, you smell the rain.\n\n\" There are hundreds of thousands of bacteria in single water droplets — that you could potentially inhale. \"\n\nThe working theory is the bacteria is liberated by rising water tables and during extreme rainfall, then able to spread into rivers and creeks, and carried over long distances. Once settled in new terrain, it can survive — and thrive.\n\nTownsville has seen a surge in melioidosis cases this wet season. (ABC News: Brendan Mounter)\n\nIn Townsville, researchers have already matched strains of the bacterium found in local watercourses to those found in infected patients. But whether that water is the direct source of human infection is still unknown.\n\n\"That's what we are embarking upon, for the first time ever in North Queensland,\" Professor Warner says, out to solve the \"fundamental mystery\" of melioidosis.\n\n\"Where you get it from, what behaviour encourages transmission and does climate and environmental change affect disease patterns?\"\n\nProfessor Warner also believes there's merit in a theory by public health physician Dr Simon Smith, which hypothesises that an upgrade to the Bruce Highway, south of Cairns, has contributed to a sudden increase in melioidosis cases due to it disrupting the soil.\n\n\"You tend not to see this organism in the soil environment where we've got highly fertile soils,\" he said.\n\n\"That's probably because it gets out-competed by other organisms which really enjoy fertility and high nutrition.\n\n\" This organism has got the ability to survive without requiring much nutrition in the environment. \"\n\nDr Jeff Warner is leading a team of researchers to better understand the potentially deadly bacteria. (ABC News: Tom Hartley)\n\nThe public health conundrum\n\nWith a $1.5 million federal grant, Professor Warner is now leading a five-year investigation to trace the organism's movements.\n\nThe project will unite clinicians and scientists from across the north, including Menzies School of Health Research in Darwin, and teams in Cairns and Townsville, with assistance from several university and phd students.\n\nThousands of environmental samples will be taken across northern Australia, while genomic and spatial data will help map exactly where the organism persists — and predict where it might emerge as the climate becomes warmer.\n\n\"There are literally squillions, zillions of microorganisms in that 10 grams of soil, and we've got to try and find the melioidosis in that zoo of bacteria,\" Professor Warner says.\n\nScientists will be extracting bacteria from thousands of soil samples over five years. (ABC News: Tom Hartley)\n\nThe ultimate goal is to move beyond broad warnings and into tailored public health messaging.\n\n\"There is essentially very limited evidence to describe where people get this disease, what behaviour encourages transmission,\" Professor Warner said.\n\nQueensland's Health Minister has been called to deliver funding to help solve the melioidosis mystery. (ABC News: Tom Hartley)\n\nProfessor Warner's optimism belies concerns the state government, and the health minister, headquartered 1,300 kilometres away, are not giving this outbreak the deserved attention, with zero dollars from the coffers on the table.\n\n\"Melioidosis is a disease that describes very well the differences between urban and rural health expectations,\" he said.\n\n\"The disease is very rare in capital city populations, but in regional northern Australia is one of the leading causes of fatal bacterial pneumonia and blood poisoning, that particularly affects the elderly and vulnerable people and their communities.\n\n\"If we're fair dinkum about Australians looking after the underprivileged, there's lots of things we can do better for regional communities, and that includes our leaders investing more.\"\n\nA Queensland Health spokesperson confirmed to 7.30 there was no extra funding in the pipeline for melioidosis research.\n\nThere are concerns more people will die from the disease if research isn't better funded. (ABC News: Tom Hartley)\n\nIn Cairns, infectious diseases expert Dr Simon Smith suggested information-sharing between district health services needs to be urgently improved.\n\n\"I think it's really key that we start working more closely with our colleagues in Townsville and Darwin … that we join together and pool our resources to try and identify why we're seeing this large increase in northern Queensland,\" Dr Smith said.\n\n\" What the concern is, if the rates stay as high as what they have been this year, or indeed, they increase, then we're just going to see a lot of people with the disease, and even with the best access to care, we still see people dying. \"\n\nWatch 7.30, Mondays to Thursdays 7:30pm on ABC iview and ABC TV",
    "source": "ABC",
    "cluster_id": 13
  },
  {
    "url": "https://www.smh.com.au/politics/federal/australian-federal-election-2025-live-results-victoria-key-swing-seats-news-updates-start-time-liberal-labor-independent-teal-kooyong-goldstein-wills-bruce-zoe-daniel-tim-wilson-peter-khalil-samantha-ratnam-julian-hill-zahid-safi-monique-ryan-amelia-hamer-20250502-p5lw46.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Victoria hot seats LIVE results: Wilson wins Goldstein; Khalil holds Wills after strong Greens challenge; AEC federal election vote count updates for Calwell, Kooyong, Bendigo and key Melbourne electorates",
    "publish_date": "Wed, 07 May 2025 12:01:25 +1000",
    "category": "finance",
    "authors": [
      "Rachael Dexter",
      "Charlotte Grieve",
      "Clay Lucas",
      "Cara Waters"
    ],
    "text": "With the campaign behind her – and her party reeling from a crushing national defeat – Liberal Party candidate for Kooyong Amelia Hamer has taken a swipe at her own side, including the main slogan plastered on her corflutes.\n\nThis is the most candid she’s sounded all campaign – despite her own political future still hanging in the balance. Speaking with Jacqui Felgate on 3AW Drive, Hamer was asked to reflect on what went wrong for the opposition and said one theme emerged repeatedly: the campaign lacked substance.\n\n“The one piece of feedback I was hearing consistently throughout the campaign is that people wanted to see more substantial policy from us – and they wanted to see it earlier,” she said.\n\n“Not just ‘hey nuclear’ and a little bit of tax here and there, but substantive taxation reform and a real vision as to what our country should look like, and what it would look like under a Coalition government.”\n\nShe pointed to the Coalition’s central slogan – “Getting Australia Back on Track” – and questioned its meaning.\n\n“We talked a lot about getting Australia back on track, but the question is: back on track to what?” she said.\n\n“We didn’t set that. We didn’t make that clear.”\n\n(Side note: I asked Hamer this very question during the campaign — what does the slogan actually mean? You can watch what she said at the time below.)\n\nHamer said voters, especially in Kooyong, wanted to “be treated like adults” and engage with real policy.\n\n“They want to have that adult discussion where we can actually say, ‘Here’s a policy on income tax indexation’. Yeah, it’s complex to explain to people, but people are willing to take the time to understand that and understand how it’s going to make their lives better.”\n\nAsked if Peter Dutton remained unpopular with women, Hamer sidestepped the gender framing.\n\n“I think it just comes down to what alternative vision we were providing … how clear was that? In this uncertain global environment, where on the one hand you’ve got Trump running around doing different things, and then an economy which is really going in the wrong direction, and a cost-of-living crisis,” Hamer said.\n\n“We needed to be able to say to people that we were a safe pair of hands. That they could trust us to run the country in a way that was going to make their lives better, and I don’t think that we did enough to show that we could do that.”\n\nHamer also acknowledged that the Liberals are struggling with younger voters – a cohort she’s part of at just 31 – and said the party’s approach to digital campaigning needs serious work.\n\n“There’s a lot more we can do in the social media and digital marketing space.\n\n“I think a lot of our content on social media is still very much geared towards … letting people know who the candidate is. So you have a video that says, ‘Hi, I’m Amelia!’ and after a while, people start to go, ‘Yeah, I know that Amelia Hamer’s my candidate, but tell me something more.’\n\n“Traditionally, you didn’t need to, but today you do need to tell them something more, and you need to tell them something that’s hyper relevant to them.”",
    "source": "SMH",
    "cluster_id": 14
  },
  {
    "url": "https://www.smh.com.au/national/victoria/erin-patterson-trial-live-updates-more-witnesses-appear-before-jury-in-trial-of-mushroom-cook-20250507-p5lx8f.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Erin Patterson trial LIVE updates: More witnesses appear before jury in trial of mushroom cook",
    "publish_date": "Wed, 07 May 2025 12:00:26 +1000",
    "category": "finance",
    "authors": [
      "Marta Pascual Juanola",
      "Erin Pearson"
    ],
    "text": "Under cross-examination, Anna-Marie Terrington described another lunch earlier in 2023, attended by her parents Don and Gail Patterson, at Erin Patterson’s house.\n\n“They didn’t tell me who was present apart from themselves being the only adults there,” Terrington said.\n\nTerrington said Don had told her they had eaten a pie on that occasion. They did not get sick, she said.\n\nShe also described how she was pregnant at the same time as Erin.\n\nTerrington said that she had a close relationship with Erin during that pregnancy.\n\nThe pair were also part of the same Bible study group some 18 years ago, and spent time together at Erin’s mother’s house in Eden on the NSW south coast.\n\nThe jury heard that at some point, Simon and Erin had loaned Terrington hundreds of thousands of dollars, interest free, to help with her family home.\n\nAfter Erin and Simon separated about 2015, future repayments for the loan went to Simon.\n\nFollowing the separation, Terrington said that Erin continued to be part of the family group chat and maintained a good relationship with Don and Gail.",
    "source": "SMH",
    "cluster_id": 15
  },
  {
    "url": "https://www.smh.com.au/goodfood/recipes/a-bunch-of-banana-cakes-and-loaves-to-make-for-mother-s-day-20250507-p5lx9h.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "A bunch of banana cakes (and loaves) to make for Mother’s Day",
    "publish_date": "Wed, 07 May 2025 11:58:51 +1000",
    "category": "finance",
    "authors": [],
    "text": "Recipe collection\n\nA bunch of banana cakes (and loaves) to make for Mother’s Day\n\nTurn sweet, ripe bananas into a gift or a treat to share for Mother’s Day using one of these recipes for banana cake, loaf or bread.",
    "source": "SMH",
    "cluster_id": 16
  },
  {
    "url": "https://www.smh.com.au/business/companies/laura-tingle-to-leave-7-30-for-global-abc-role-20250507-p5lx9k.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Laura Tingle to leave 7.30 for global ABC role",
    "publish_date": "Wed, 07 May 2025 11:58:09 +1000",
    "category": "finance",
    "authors": [
      "Calum Jaspan"
    ],
    "text": "One of the ABC’s most prominent broadcasters, Laura Tingle will leave her position as political editor of flagship current affairs program 7.30 for a new global reporting role.\n\nTingle has been appointed the ABC’s global affairs editor, a position until recently occupied by John Lyons, who recently became Americas editor, based in Washington, DC.\n\nLaura Tingle will move on from 7.30 after seven years to become the ABC’s global affairs editor. Credit: Alex Ellinghausen\n\nTingle has held the position since 2018, and was elected the ABC staff representative on its board in 2023. Her position as a board director will remain unchanged.\n\nThe global affairs editor leads the ABC’s international coverage, with reporting and analysis of major world events. The ABC said it would be advertising for a replacement for Tingle on 7.30. She will switch roles mid-year.",
    "source": "SMH",
    "cluster_id": 5
  },
  {
    "url": "https://www.smh.com.au/national/nsw-top-cop-set-to-resign-20250507-p5lx9b.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "NSW top cop set to resign",
    "publish_date": "Wed, 07 May 2025 11:55:53 +1000",
    "category": "finance",
    "authors": [],
    "text": "NSW top cop set to resign\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 17
  },
  {
    "url": "https://www.smh.com.au/business/consumer-affairs/flying-blind-inside-the-90-second-blackout-that-sparked-chaos-at-a-major-us-airport-20250507-p5lx4m.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Flying blind: Inside the 90-second blackout that sparked chaos at a major US airport",
    "publish_date": "Wed, 07 May 2025 11:52:43 +1000",
    "category": "finance",
    "authors": [
      "Allyson Versprille",
      "Siddharth Philip"
    ],
    "text": "When the computer screens shut off without warning, the room erupted in panic. First came curses, then tears.\n\nOn April 28 at about 1.27 pm, the air traffic controllers monitoring the skies above New Jersey’s Newark Liberty International Airport, which services New York, came face to face with their worst-case scenario: with radar and radio contact suddenly cut, they couldn’t communicate with the dozens of aircraft coming in or out of one of the most congested airspaces in the US.\n\nThe blackout sparked chaos inside air traffic control towers at Newark Airport last week. Credit: Bloomberg\n\nControllers braced for tragedy and destruction that some worried they’d be helpless to prevent, according to accounts of people familiar with the events. One person described workers in the room letting out curses and frustrated cries.\n\nThen, about 90 seconds later, the power blinked back on as abruptly as it had vanished. No one was injured and no planes had crashed. But several controllers were left visibly shaken, with some crying, said one of the people, who were not authorised to speak publicly on the matter. One was suffering heart palpitations. Several had to leave their posts because the stress was too much to bear, further thinning out the ranks of an already strained command post.",
    "source": "SMH",
    "cluster_id": 18
  },
  {
    "url": "https://www.smh.com.au/national/queensland/brisbane-news-live-qld-police-failed-to-get-bondi-junction-killer-help-before-stabbing-spree-20250506-p5lx08.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Brisbane news live: Child dead in house fire; Homeless to be moved on for Paniyiri; Chandler-Mather laments ‘sick’ parliament after ousting",
    "publish_date": "Wed, 07 May 2025 11:42:55 +1000",
    "category": "finance",
    "authors": [],
    "text": "Queensland Rail’s Doomben line will run on Sundays and public holidays from June 1, as part of more than 100 new weekly train services to be added to the commuter railway network in the coming weeks.\n\nThe new weekday services are “contra-peak”, which means they run outbound from the CBD in the morning, and inbound in the afternoon.\n\nMore than 100 new weekly services will be added to south-east Queensland’s commuter railway network. Credit: Tammy Law\n\nMore than 45 contra-peak services will be added to the Cleveland line that runs through Brisbane’s south-eastern suburbs, and more than 40 will be added to the Ferny Grove line servicing suburbs in Brisbane’s north-west.\n\nThe Cleveland and Ferny Grove changes will take effect from Monday, May 19.\n\n“We’re always looking to make it easier and more accessible to catch public transport and we’re pleased to be delivering these improvements for customers,” Minister for Transport and Main Roads Brent Mickelberg said in a statement.",
    "source": "SMH",
    "cluster_id": 19
  },
  {
    "url": "https://www.smh.com.au/sport/nrl/around-the-clubs-nrl-round-10-20250506-p5lx10.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Brandon Smith set to join Dominic Young in Roosters’ departure lounge",
    "publish_date": "Wed, 07 May 2025 11:42:46 +1000",
    "category": "sports",
    "authors": [
      "Adrian Proszenko",
      "Robert Dillon"
    ],
    "text": "Roosters coach Trent Robinson has recently preferred Daniel Tupou, Billy Smith, Robert Toia and rugby recruit Mark Nawaqanitawase as his three-quarter options. By informing Young he is free to look around, the winger has the chance to find a new club before the June 30 deadline window closes. The Knights never wanted Young to leave, and have always been open to the prospect of welcoming him back should he become available. Roosters winger Dom Young appears poised to leave Bondi Junction. Credit: Getty Bennett shakes up Bunnies in bid to snap losing streak South Sydney coach Wayne Bennett has replaced his entire front row for Friday’s clash with Brisbane at Suncorp Stadium, as pressure mounts on the Rabbitohs to arrest a four-game losing run.\n\nAfter their 30-4 trouncing by Newcastle last week, Bennett has dropped prop Junior Tatola to 18th man and relegated Davvy Moale to the interchange bench. Hooker Peter Mamouzelos was unavailable because of a dislocated elbow. Wayne Bennett has dropped Junior Tatola to 18th man for the clash against Brisbane. Credit: NRL Photos In their absence, Jai Arrow and Keaon Koloamatangi will be the Rabbitohs’ starting props, while experienced Siliva Havili has been named at hooker. Tatola has gone from caretaker captain to out of the 17 within a week. Bennett, meanwhile, has welcomed back Latrell Mitchell from a one-game suspension and immediately reinstated him at fullback, replacing the dynamic Jye Gray, who drops back to the interchange bench. Halfback Jamie Humphreys has also been recalled after recovering from a hamstring injury that has kept him sidelined for the past four games. He will partner Jayden Sullivan in the halves, with Cody Walker and Jack Wighton on the injured list.\n\nIn contrast to Bennett, Brisbane coach Michael Maguire has shown faith in the Broncos, retaining the majority of his squad who were thumped 32-8 by Penrith last week. Their only change is the inclusion of Fletcher Baker on the bench. Maguire resisted the urge to rush back Ezra Mam, who has completed a nine-game suspension for a drug-driving offence. Mam will instead return in the Queensland Cup. In other team news, David Fifita appears set to continue serving his reserve grade penance after being left out for the second consecutive week by Gold Coast coach Des Hasler for their clash with the Knights in Newcastle on Friday. Loading Canterbury have welcomed Matt Burton back from suspension for their blockbuster showdown with the Raiders in Canberra on Saturday.\n\nSt George Illawarra teenager Loko Jnr Pasifiki Tonga will make his top-grade debut against the Warriors at WIN Stadium on Saturday, replacing injured Emre Guler. Experienced winger Dallin Watene-Zalezniak returns for the Warriors. Premiers Penrith will receive a double boost before taking on the Cowboys in Townsville on Saturday, with Brian To’o returning from a hamstring injury and hooker Mitch Kenny available after serving a suspension. Manly stars Jake Trbojevic and Jason Saab return from injury to take on Cronulla at Brookvale on Sunday. Cronulla centre interested in joining best of British in Ashes series He’s a proud Cook Islander, but emerging Cronulla centre KL Iro has expressed interest in representing England in the end-of-season Ashes series against the Kangaroos.\n\nIro qualifies for a possible England call-up because he was born in Leeds in 2000 while his father Kevin – one of the best centres of his era – was playing for Super League heavyweights St Helens. Emerging Cronulla centre KL Iro was born in England. Credit: Getty Images While KL remains committed to helping the Cook Islands qualify for the 2026 World Cup, he admitted the prospect of playing for England held appeal – especially given Australia are set to embark on a three-Test tour of the Old Dart for the first time in 22 years. Mal Meninga’s Kangaroos will play Tests at Wembley, Everton and Headingley and, judging by early ticket sales, huge crowds are anticipated for what shapes as a landmark series. Asked if he would be interested in representing the land of his birth, Iro replied: “Yeah, for sure. I’m not sure if I’m eligible. I’m not sure how it works.\n\n“But, yeah, I wouldn’t say no ... I would never say no to that, bro. I think it’s pretty cool if you could do that.” The 25-year-old has strung together 29 NRL games for the Sharks, scoring 12 tries – including six in five games this season. Dolphins centre Herbie Farnworth has played six Tests for England and presumably will be one of the first players picked to face the Kangaroos. Farnworth partnered Harry Newman, of Leeds Rhinos, in last year’s home series against Samoa, which the Lions won 2-0. Herbie Farnworth is likely to be the first centre chosen for England in the Test series against Australia. Credit: AP\n\nOther NRL-based players likely to feature for England include Roosters duo Victor Radley and Dominic Young, Canberra forwards Morgan Smithies and Matty Nicholson, Newcastle back-rower Kai Pearce-Paul and North Queensland veteran John Bateman. Roosters half Sam Walker and Canterbury prop Max King are both also eligible because, like Iro, they were born in England while their fathers were playing in the Super League. Loading After his dad retired in 2001, the Iros returned to Rarotonga, where KL spent most of his childhood before eventually moving to Auckland, and then Australia. He has since represented the Cook Islands in eight internationals. “Cook Islands is my strong point, and that’s where I grew up, and that’s my culture … after my career, I probably want to move back there as well,” Iro said.\n\nHe added that his “main goal” this year was to help the Aitu in their World Cup quest, and hopefully provide young Cook Islanders with inspiration. “When I was growing up back there, I always had my dad as a role model to follow, so I hope that I can be, like, a role model for the younger kids that it is possible to get out of the island and achieve good things,” he said. Iro explained his recent decision to change from his Christian name of Kayal to “KL”, saying it was partly because it was often mispronounced, but also a tribute to his father, who was christened Kevin Leslie Iro. “My dad always wanted that, and I like it that way too, because it’s easier to pronounce,” he said. “There’s no confusion around pronunciation and stuff like that as well. “When I first moved to Australia, my dad always wanted me to change it. I’m a shy guy, so, like, I’m just too scared to step on anyone’s toes ... but I guess I’ve built a relationship with these fellas now, so I thought I’d just ask a question and they got it done pretty quick.”",
    "source": "SMH",
    "cluster_id": 20
  },
  {
    "url": "https://www.smh.com.au/sport/nrl/a-grateful-jarryd-hayne-to-make-unlikely-return-to-semi-professional-footy-20250507-p5lx8b.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "A ‘grateful’ Jarryd Hayne to make unlikely return to semi-professional footy",
    "publish_date": "Wed, 07 May 2025 11:41:00 +1000",
    "category": "sports",
    "authors": [
      "Adrian Proszenko"
    ],
    "text": "Jarryd Hayne has spoken about his return to competitive rugby league for the first time in seven years, describing the game as “something I’ve truly missed.”\n\nHayne has been named at five-eighth for Wentworthville for Sunday’s clash against the Bulldogs, in the semi-professional Ron Massey Cup competition. The two-time Dally M winner will mix it with part-time footballers, his first major on-field appearance since last playing in the NRL for Parramatta in 2018.\n\nThe Magpies were previously a feeder team for the Eels during their time in the NSW Cup.\n\n“I’m incredibly grateful for the opportunity to return to the field with the Wenty Magpies,” Hayne said in a statement.",
    "source": "SMH",
    "cluster_id": 21
  },
  {
    "url": "https://www.smh.com.au/business/companies/nine-definitely-keen-on-formula-1-broadcast-deal-amid-epl-speculation-20250430-p5lvfb.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Piastri factor puts heat on Formula 1 TV rights race",
    "publish_date": "Wed, 07 May 2025 11:40:30 +1000",
    "category": "finance",
    "authors": [
      "Calum Jaspan"
    ],
    "text": "Nine is planning a swoop on the Formula 1 broadcast rights for its Stan Sport platform, with home-grown star Oscar Piastri’s championship lead adding extra value to the sport’s already-rapidly growing fan base.\n\nThe company’s chief executive Matt Stanton confirmed the company’s interest in the lucrative rights package on Wednesday morning, joking that Piastri’s career-best form is pushing the price up.\n\nOscar Piastri celebrates another Grand Prix win this week. Credit: Getty\n\nAsked if Nine is interested in the rights package, Stanton responded “yep, definitely”, while speaking at the Macquarie Investor Conference.\n\n“I am the only person cheering he doesn’t actually win,” Stanton jokingly added on Piastri’s early-season dominance.",
    "source": "SMH",
    "cluster_id": 22
  },
  {
    "url": "https://www.smh.com.au/national/two-cars-torched-in-south-west-sydney-arson-attack-20250507-p5lx9r.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Two cars torched in south-west Sydney arson attack",
    "publish_date": "Wed, 07 May 2025 11:38:46 +1000",
    "category": "finance",
    "authors": [],
    "text": "Two cars torched in south-west Sydney arson attack\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 23
  },
  {
    "url": "https://www.smh.com.au/sport/afl/pies-give-up-free-kick-20250507-p5lx9o.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Pies give up free kick",
    "publish_date": "Wed, 07 May 2025 11:34:38 +1000",
    "category": "sports",
    "authors": [],
    "text": "Pies give up free kick\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 24
  },
  {
    "url": "https://www.smh.com.au/business/markets/asx-set-to-slide-trump-tariffs-hurt-wall-street-20250507-p5lx4t.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "ASX opens flat after Trump tariffs unsettle Wall Street giants; NAB gains defy market",
    "publish_date": "Wed, 07 May 2025 11:26:23 +1000",
    "category": "finance",
    "authors": [
      "Nick Newling"
    ],
    "text": "Investment bank Macquarie Group was down 0.3 per cent after the markets regulator ASIC called it out over “significant compliance failures” in its futures dealing business and over-the counter derivatives trade reporting. Loading Continuing their trend from Tuesday, the worst performing sectors were health care and consumer discretionary stocks, down 1.5 per cent and 1.4 per cent, respectively. Health care’s biggest hits were at imaging software company Pro Medicus (down 2.3 per cent), hearing device maker Cochlear (down 2 per cent) and biotech firm CSL (down 1.7 per cent). In consumer discretionary, JB Hi-Fi was down 5.4 per cent – making it the worst performing stock of the morning – after a trading update showed its sales growth slowed in the March quarter. On Wall Street overnight, stocks fell and bonds rose as Trump said he would prescribe tariff levels and concessions for partners looking to avoid higher duties, appearing to move away from the idea that he would engage in back-and-forth negotiations. After almost wiping out losses, the S&P 500 closed with a drop of 0.8 cent. The Dow Jones was down 1 per cent and the Nasdaq composite lost 0.9 per cent.\n\nPalantir Technologies was one of the heaviest weights on Wall Street after falling 11.9 per cent. The company, which offers an AI platform for customers, dropped even though it reported a profit for the latest quarter that met analysts’ expectations and raised its forecast for revenue over the full year. Loading AI-related companies have been finding it more difficult recently to convince investors to support their stocks after they’ve already shot so high. Palantir’s stock’s price remains near $US110, when it was sitting at only $US20 less than a year ago. The return to earth for AI stocks is happening as Trump’s tariffs change the economic landscape for other companies. Clorox chief executive Linda Rendle said her company detected changes in shopping behaviour during the first three months of the year, for example, that led to lower revenue. The company reported both weaker revenue and profit for the latest quarter than analysts expected. Clorox expects the slowdowns to continue in the current quarter, and its stock fell 2.4 per cent.\n\nToy maker Mattel, meanwhile, was swinging between losses and gains after it said it was “pausing” its financial forecasts for 2025, in part because the “evolving US tariff landscape” was making it difficult to predict how much US shoppers would spend during the holiday season and the rest of the year. Mattel ended up 2.8 per cent higher, having reported better results for the latest quarter than analysts feared. Mattel, the toy company behind Barbie, is pausing its financial forecasts amid the economic uncertainty. Credit: New York Times The toy maker was one of the latest companies to join a lengthening list that have yanked their forecasts for the year given uncertainty about what Trump’s on-again, off-again rollout of tariffs will do to the economy. The hope is that Trump will relent on some of his tariffs after reaching trade deals with other countries. Without them, many investors expect the economy to fall into a recession. Regardless, all the will-he-won’t-he uncertainty around tariffs has already made American households more pessimistic about the economy and could affect their long-term plans for purchases. That uncertainty has helped fuel a surge in imports ahead of potentially more severe tariffs ahead.\n\nThe US trade deficit soared to a record $US140.5 billion in March as consumers and businesses alike tried to get ahead of tariffs that went into effect in April and others that have been postponed until July. That follows another update from last week showing that the US economy shrank at a 0.3 per cent annual pace during the first quarter of the year because of a surge in imports. Loading Some companies say they’re already seeing impacts to their business from the uncertainty created by tariffs. DoorDash fell 7.4 per cent after reporting weaker revenue than analysts expected for the latest quarter, though it may have also offered a more encouraging snapshot of how US households are doing. The company said order growth in its US marketplace remained healthy. The US Federal Reserve has begun its two-day meeting, and will announce its next move on interest rates Wednesday (Thursday morning AEST). Virtually no one expects it to do anything to its main rate, even though Trump has been advocating for cuts.",
    "source": "SMH",
    "cluster_id": 25
  },
  {
    "url": "https://www.sbs.com.au/news/article/max-chandler-mather-says-working-in-parliament-was-bloody-awful-and-miserable/ipyjlgfkb",
    "title": "Max Chandler-Mather says working in parliament was 'bloody awful' and 'miserable'",
    "publish_date": "Wed, 7 May 2025 01:45:10 +0000",
    "category": "finance",
    "authors": [],
    "text": "Max Chandler-Mather says he is \"really proud\" of his work in giving renters a voice on the national stage, as he reflected on his \"miserable\" time in parliament.\n\n\n\n\n\nThe outgoing Greens housing spokesperson said they operated against \"often very hostile two major parties\" and that he is \"quite happy\" about not spending more time in the House of Representatives.\n\n\n\n\n\nChandler-Mather spoke to Triple J's Hack program after conceding his Brisbane seat of Griffith to Labor's Renee Coffey in the federal election.\n\n\n\n\n\nRedbridge Group director Simon Welsh is predicting the Greens will lose the seat to Labor.\n\n\n\n\n\n\"I really feel really proud of a lot of the work we have done over the last three years,\" Chandler-Mather said on Tuesday evening.\n\n\n\n\n\n\"Perhaps what I feel most proud of is giving renters a bit of a voice on the national stage. So often we are ignored and treated like second-class citizens. It felt like at the very least we were able to force that issue onto the national stage.\"\n\n\n\n'I don't regret a thing'\n\nHe said the result \"is always a possibility\".\n\n\n\n\n\n\"It was always going to be a risk, when you're fighting these really big institutions — the property and banking industry, the major political parties, parts of the media establishment — and you're going out there saying renters deserve a little bit, and people on low incomes deserve a bit more.\n\n\n\n\n\n\"There was always going to be a risk that you were going to cop a bit of hostility.\n\n\n\n\n\n\"I take that as a point of pride, but it always comes with risk. I don't regret a thing, really.\"\n\n\n\n\n\nBut he said he feels he has let a lot of people down.\n\n\n\n\n\n\"We helped build a lot of hope and then we lost in Griffith. Ultimately, I have to take responsibility for that.\"\n\n\n\nA 'bloody awful', 'miserable' workplace\n\nThe election was a night of mixed results for the Greens, with the party losing two of its Brisbane seats.\n\n\n\n\n\nParty leader Adam Bandt's seat of Melbourne remains undecided at time of publication.\n\n\n\n\n\nDespite this, Bandt said on Monday that the party has received a record Senate vote this election, and is on track to take 11 upper house seats.\n\n\n\n\n\nChandler-Mather said the Greens were subject to a \"massive collapse in the Liberal vote that transferred to Labor\".\n\n\n\n\n\n\"We were operating against often very hostile two major parties,\" he said.\n\n\n\n\n\n\"I'll be honest — one of the things I'm quite happy about at the moment is I don't have to spend more time in the House of Representatives. Because basically every time I stood up, I got screamed and yelled at.\n\n\n\n\n\n\"In terms of a workplace, it was bloody awful, and frankly a lot of the time, miserable.\"\n\n\n\nLater responding to a question on criticisms directed towards the Greens, including slowing progress on issues such as housing and undelivered promises like rent freezes, he said: \"Parliament is a sick place, can I just say? Genuinely.\"\n\n\n\n\n\n\"There were times when I was sitting in parliament and you'd watch both sides of politics team up to defend the stage three tax cuts.\n\n\n\n\n\n\"Then we were getting attacked because we said we should spend a bit more on public housing and give something for renters.\n\n\n\n\n\n\"I feel proud of that work … and I think if I had my time again, I would do it all again.\"\n\n\n\n\n\n\"Did it have an effect? Maybe that lost us some votes.\"\n\n\n\n'Of course we have fallen short'\n\nChandler-Mather acknowledged the party had fallen short when it came to lower house seats — which was \"bitterly disappointing\".\n\n\n\n\n\n\"But I think there is a lot of reason for hope,\" he said.\n\n\n\n\n\n\"We need to work out how to do better. Two days out from the election, [I] don't have all the answers.\"\n\n\n\n",
    "source": "SBS",
    "cluster_id": 26
  },
  {
    "url": "https://www.sbs.com.au/news/article/flu-season-australia-alarm-vaccination/kie1ztkyo",
    "title": "Australia has had over 60,000 flu cases already this year. Here’s why experts are worried",
    "publish_date": "Tue, 6 May 2025 19:47:55 +0000",
    "category": "lifestyle",
    "authors": [],
    "text": "Tens of thousands of influenza cases have already been reported in Australia so far this year , and with flu season around the corner, experts are concerned that many people aren't taking the consequences seriously enough.\n\n\n\n\n\nMore than 63,000 flu cases have been reported this year, tracking above the average number of cases for the past five years.\n\n\n\n\n\nThe number of cases seen so far, combined with a persistently low vaccination rate for flu, have set off alarm bells in the medical community.\n\n\n\n\n\nEarlier this year, the Royal Australian College of General Practitioners (RACGP) called for action after over 48,000 cases were reported in the first quarter of the year.\n\n\n\n\n\nIn 2024, there were 30,494 cases, and in 2023, there were 18,582 cases in the same period.\n\n\n\nLISTEN TO Severe 2025 flu season likely, prompting calls to get vaccinated SBS News 06/01/2025 06:50 Play\n\nRACGP president Dr Michael Wright said vaccination rates for the flu have fallen and brought attention to the most severe consequences of the illness.\n\n\n\n\n\n\"More than 1,000 deaths last year involved the flu, a 67.3 per cent increase on 2023, while more than 4200 people were admitted to hospital,\" he said.\n\n\n\n\n\nWhile the number of cases seen in flu seasons is difficult to predict, as Australia moves into the colder months, there will be an exponential increase in the number of cases.\n\n\n\n\n\nFlu seasons have become harder to predict since the COVID-19 pandemic, so it's currently unclear whether this season will continue on its record trajectory.\n\n\n\n\n\nHowever, professor Julie Leask from the University of Sydney said the consequences of the flu can be serious, regardless of comparisons to previous years.\n\n\n\n\n\n\"It doesn't necessarily need to be a record flu season for it to be important,\" she said.\n\n\n\nIn January, 16 Australians died from the flu, according to the Australian Bureau of Statistics.\n\n\n\nImpacts of the flu\n\nThe flu is typically caused by influenza A or B, but there are many subtypes and strains of these viruses, and dominant strains tend to change year to year.\n\n\n\n\n\nThe illness can cause fever and chills, sneezing, coughing, a sore throat, and gastrointestinal issues in children.\n\n\n\n\n\nProfessor Paul Griffin from the University of Queensland told SBS News that while many people believe that flu is \"just like a cold\", it has huge impacts on the community and can cause severe illness.\n\n\n\n\n\nWhile the flu is predominantly a respiratory infection, it can have impacts on \"basically the whole body\", Griffin said.\n\n\n\nSevere bronchitis, inflammation of the brain (known as encephalitis), heart issues like myocarditis and muscle issues such as acute viral myositis can occur in rare cases. The flu is also known to contribute to heart attacks, strokes and other cardiovascular issues.\n\n\n\n\n\n\"Obviously that's not the most common outcome from the flu, and most people won't require hospitalisation or get all of those things. But the unfortunate reality is enough people do that it's a big problem,\" Griffin said.\n\n\n\n\n\nYoung children, older adults, Aboriginal and Torres Strait Islander people, people with chronic medical conditions, immunocompromised people and smokers are at greater risk of severe illness or complications. But adults who don't belong to these groups can also experience these issues.\n\n\n\nLeask told SBS News the flu has a \"personality problem\" because it can be confused with other less-serious viruses.\n\n\n\n\n\n\"It's estimated that around 3,000 people a year die from flu, whether it's on their death certificate or there's some other death, such as a cardiac death that flu brought on. That's the estimate. So, it's really quite a burdensome disease that's underappreciated,\" she said.\n\n\n\n\n\nThe flu also places a massive weight on the medical system every year, with hundreds of thousands of GP visits and thousands of hospitalisations.\n\n\n\n\n\n\"The flow-on effect of that is that people who need to seek primary care or go to hospital then struggle to get those issues addressed,\" Griffin said\n\n\n\nWhy aren't more Australians getting vaccinated?\n\nVaccination rates for the flu have been trending downwards in recent years.\n\n\n\n\n\nIn 2020, 13.6 per cent of people aged 15 to 50 had been vaccinated by May, according to the National Centre for Immunisation Research and Surveillance.\n\n\n\n\n\nThis year, 8.2 per cent have been vaccinated so far.\n\n\n\nLeask said Australia's vaccination rates for the flu are consistently \"dire\", and while the majority of Australians complete childhood vaccinations, the uptake of yearly flu vaccinations is more subject to motivation and access.\n\n\n\n\n\nIn Australia, the flu shot is free for young children, pregnant women, adults aged 65 and older, Aboriginal and Torres Strait Islander people and people with certain medical conditions under the National Immunisation Program. Most others have to pay out-of-pocket for the flu shot.\n\n\n\n\n\nLeask said vaccination rates are improved by services that remind Australians they're due for their shots, encourage them to get one and provide services and systems that make it as convenient as possible.\n\n\n\n\n\nPeople are also much more likely to receive the flu shot in a year if they have had at least one in the past two years.\n\n\n\n\n\n\"We know that flu vaccination is a habit, and once you start that habit, you tend to continue with it,\" Leask said.\n\n\n\nVaccination rates for the flu have been trending downwards in Australia in recent years. Source: Getty / Witthaya Prasongsin\n\nMyths about the flu vaccine\n\nHowever, there are many prevailing myths about the flu vaccination that can also discourage people from getting the shot, Griffin said.\n\n\n\n\n\nOne issue is that many people believe they will get sick from the flu regardless of whether they have been vaccinated. While the vaccine can't provide total coverage against infection, Griffin said there are still strong benefits to getting the shot.\n\n\n\n\n\n\"Breakthrough infections can happen relatively commonly, so you can be vaccinated and still get the flu,\" Griffin said.\n\n\n\n\n\n\"But what we know is that no matter what happens when you get the flu after you're vaccinated, it's going to help at least a little bit in terms of reducing the severity, perhaps duration, and perhaps the ability to pass it on. There's a whole host of benefits.\"\n\n\n\nLeask also stressed that vaccination is not just about protecting yourself — it is also about trying to ensure the safety of others in the community who may develop more severe illness.\n\n\n\n\n\n\"We need to remind people that this is not just about protecting yourself from what could be a rotten couple of weeks laid out, days of work, feeling really crook,\" she said.\n\n\n\n\n\n\"If I get a flu vaccine, I'm less likely to get the flu and therefore much less likely to pass it on to my old mother, who I really don't want to make sick from influenza because she could get really sick from it.\"\n\n\n\n",
    "source": "SBS",
    "cluster_id": 27
  },
  {
    "url": "https://www.sbs.com.au/news/video/spotlight-on-heart-health-in-the-bush/pij2r82i2",
    "title": "Spotlight on heart health in the bush",
    "publish_date": "Tue, 6 May 2025 09:38:42 +0000",
    "category": "sports",
    "authors": [],
    "text": "Spotlight on heart health in the bush\n\nPublished 6 May 2025, 7:35 am\n\nAustralians are this week being reminded about the importance of heart health. One football charity is taking that message directly to the pitch, finding regional athletes are experiencing more cardiovascular issues than their city counterparts.",
    "source": "SBS",
    "cluster_id": 28
  },
  {
    "url": "https://www.sbs.com.au/news/video/skype-hangs-up-operations-after-more-than-20-years/nd90qwr67",
    "title": "Skype hangs up operations after more than 20 years",
    "publish_date": "Tue, 6 May 2025 09:33:25 +0000",
    "category": "finance",
    "authors": [],
    "text": "Skype hangs up operations after more than 20 years\n\nPublished 6 May 2025, 7:34 am\n\nYou'd recognise the sound... For decades, the ringtone of one of the world's pioneer video calling platforms Skype was iconic. It launched 22 years ago, connecting friends, families and businesses around the world. But now — it's been disconnected.",
    "source": "SBS",
    "cluster_id": 29
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/skype-disconnected-after-22-years-investors-turn-cautious-amid-corporate-earnings-concerns/lkjdue432",
    "title": "Skype disconnected after 22 years & investors turn cautious amid corporate earnings concerns",
    "publish_date": "Tue, 6 May 2025 07:52:19 +0000",
    "category": "finance",
    "authors": [],
    "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
    "source": "SBS",
    "cluster_id": 30
  },
  {
    "url": "https://www.sbs.com.au/news/article/why-new-zealands-pm-wants-to-copy-australias-controversial-legislation-on-teens/xetz54czr",
    "title": "Why New Zealand's PM wants to copy Australia's controversial legislation on teens",
    "publish_date": "Tue, 6 May 2025 05:35:24 +0000",
    "category": "finance",
    "authors": [],
    "text": "Key Points New Zealand Prime Minister Christopher Luxon has proposed a social media ban for children under-16.\n\nThe proposal is similar to Australia's ban approved by parliament last year.\n\nUnder Luxon's plan social media companies would need to verify users were at least 16 years old or face big fines.\n\nNew Zealand's prime minister has proposed banning children under 16 from social media, stressing the need to shield them from the perils of big tech platforms.\n\n\n\n\n\nRegulators the world over are wrestling with how to keep children safe online, as social media is increasingly flooded with violent and disturbing content.\n\n\n\n\n\nPrime Minister Christopher Luxon unveiled draft laws on Tuesday that would force social media companies to verify users were at least 16 years old, or face fines of up to NZ$2 million ($1.85 million).\n\n\n\n\n\nThe proposed ban was modelled on strict laws recently passed by Australia , which sits at the forefront of global efforts to regulate social media.\n\n\n\n\n\n\"It's time that New Zealand acknowledged that, for all the good things that come from social media, it's not always a safe place for our young people to be,\" Luxon told reporters.\n\n\n\n\n\n\"It's time we put the onus on these platforms to protect vulnerable children from harmful content, cyberbullying, and exploitation.\"\n\n\n\n\n\nIt was not clear when the legislation would be introduced to parliament, but Luxon said he was hopeful of garnering support across the chamber.\n\n\n\nThe laws were drafted by Luxon's centre-right National Party, the biggest member of New Zealand's three-way governing coalition.\n\n\n\n\n\nTo be passed, they would need the support of Luxon's two other coalition partners.\n\n\n\n\n\n\"Parents are constantly telling us that they are really worried about the impact that social media is having on their children,\" Luxon said.\n\n\n\n\n\n\"And they say they are really struggling to manage access to social media.\"\n\n\n\n'Online exposure'\n\nThe National Party's Catherine Wedd, who drafted the bill, said it would hold social media companies to account.\n\n\n\n\n\n\"As a mother of four children I feel very strongly that families and parents should be better supported when it comes to overseeing their children's online exposure,\" she said.\n\n\n\n\n\nThe proposed laws do not specify which social media companies would be covered in New Zealand.\n\n\n\n\n\nLast year, New Zealand banned children from using mobile phones while at school — a policy designed to turn around the country's plummeting literacy rates.\n\n\n\nREAD MORE What to know about Australia's new social media ban\n\nAustralia passed landmark laws in November restricting under-16s from social media — one of the world's toughest crackdowns on popular sites such as Facebook, Instagram and X.\n\n\n\n\n\nBut video-sharing website YouTube will likely be exempt from the ban so children can use it for their school work.\n\n\n\n\n\nOfficials are yet to solve basic questions surrounding the laws, such as how the ban will be policed.\n\n\n\n\n\nThe move sparked a fierce backlash from big tech companies who variously described the laws as \"rushed\", \"vague\", and \"problematic\".\n\n\n\n\n\nAustralia's ban is set to come into effect by December.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 31
  },
  {
    "url": "https://www.theage.com.au/politics/federal/australian-federal-election-2025-live-results-victoria-key-swing-seats-news-updates-start-time-liberal-labor-independent-teal-kooyong-goldstein-wills-bruce-zoe-daniel-tim-wilson-peter-khalil-samantha-ratnam-julian-hill-zahid-safi-monique-ryan-amelia-hamer-20250502-p5lw46.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Victoria hot seats LIVE results: Wilson wins Goldstein; Khalil holds Wills after strong Greens challenge; AEC federal election vote count updates for Calwell, Kooyong, Bendigo and key Melbourne electorates",
    "publish_date": "Wed, 07 May 2025 12:01:25 +1000",
    "category": "finance",
    "authors": [
      "Rachael Dexter",
      "Charlotte Grieve",
      "Clay Lucas",
      "Cara Waters"
    ],
    "text": "With the campaign behind her – and her party reeling from a crushing national defeat – Liberal Party candidate for Kooyong Amelia Hamer has taken a swipe at her own side, including the main slogan plastered on her corflutes.\n\nThis is the most candid she’s sounded all campaign – despite her own political future still hanging in the balance. Speaking with Jacqui Felgate on 3AW Drive, Hamer was asked to reflect on what went wrong for the opposition and said one theme emerged repeatedly: the campaign lacked substance.\n\n“The one piece of feedback I was hearing consistently throughout the campaign is that people wanted to see more substantial policy from us – and they wanted to see it earlier,” she said.\n\n“Not just ‘hey nuclear’ and a little bit of tax here and there, but substantive taxation reform and a real vision as to what our country should look like, and what it would look like under a Coalition government.”\n\nShe pointed to the Coalition’s central slogan – “Getting Australia Back on Track” – and questioned its meaning.\n\n“We talked a lot about getting Australia back on track, but the question is: back on track to what?” she said.\n\n“We didn’t set that. We didn’t make that clear.”\n\n(Side note: I asked Hamer this very question during the campaign — what does the slogan actually mean? You can watch what she said at the time below.)\n\nHamer said voters, especially in Kooyong, wanted to “be treated like adults” and engage with real policy.\n\n“They want to have that adult discussion where we can actually say, ‘Here’s a policy on income tax indexation’. Yeah, it’s complex to explain to people, but people are willing to take the time to understand that and understand how it’s going to make their lives better.”\n\nAsked if Peter Dutton remained unpopular with women, Hamer sidestepped the gender framing.\n\n“I think it just comes down to what alternative vision we were providing … how clear was that? In this uncertain global environment, where on the one hand you’ve got Trump running around doing different things, and then an economy which is really going in the wrong direction, and a cost-of-living crisis,” Hamer said.\n\n“We needed to be able to say to people that we were a safe pair of hands. That they could trust us to run the country in a way that was going to make their lives better, and I don’t think that we did enough to show that we could do that.”\n\nHamer also acknowledged that the Liberals are struggling with younger voters – a cohort she’s part of at just 31 – and said the party’s approach to digital campaigning needs serious work.\n\n“There’s a lot more we can do in the social media and digital marketing space.\n\n“I think a lot of our content on social media is still very much geared towards … letting people know who the candidate is. So you have a video that says, ‘Hi, I’m Amelia!’ and after a while, people start to go, ‘Yeah, I know that Amelia Hamer’s my candidate, but tell me something more.’\n\n“Traditionally, you didn’t need to, but today you do need to tell them something more, and you need to tell them something that’s hyper relevant to them.”",
    "source": "TheAge",
    "cluster_id": 14
  },
  {
    "url": "https://www.theage.com.au/national/victoria/erin-patterson-trial-live-updates-more-witnesses-appear-before-jury-in-trial-of-mushroom-cook-20250507-p5lx8f.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Erin Patterson trial LIVE updates: More witnesses appear before jury in trial of mushroom cook",
    "publish_date": "Wed, 07 May 2025 12:00:26 +1000",
    "category": "finance",
    "authors": [
      "Marta Pascual Juanola",
      "Erin Pearson"
    ],
    "text": "Under cross-examination, Anna-Marie Terrington described another lunch earlier in 2023, attended by her parents Don and Gail Patterson, at Erin Patterson’s house.\n\n“They didn’t tell me who was present apart from themselves being the only adults there,” Terrington said.\n\nTerrington said Don had told her they had eaten a pie on that occasion. They did not get sick, she said.\n\nShe also described how she was pregnant at the same time as Erin.\n\nTerrington said that she had a close relationship with Erin during that pregnancy.\n\nThe pair were also part of the same Bible study group some 18 years ago, and spent time together at Erin’s mother’s house in Eden on the NSW south coast.\n\nThe jury heard that at some point, Simon and Erin had loaned Terrington hundreds of thousands of dollars, interest free, to help with her family home.\n\nAfter Erin and Simon separated about 2015, future repayments for the loan went to Simon.\n\nFollowing the separation, Terrington said that Erin continued to be part of the family group chat and maintained a good relationship with Don and Gail.",
    "source": "TheAge",
    "cluster_id": 15
  },
  {
    "url": "https://www.theage.com.au/goodfood/recipes/a-bunch-of-banana-cakes-and-loaves-to-make-for-mother-s-day-20250507-p5lx9h.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "A bunch of banana cakes (and loaves) to make for Mother’s Day",
    "publish_date": "Wed, 07 May 2025 11:58:51 +1000",
    "category": "finance",
    "authors": [],
    "text": "Recipe collection\n\nA bunch of banana cakes (and loaves) to make for Mother’s Day\n\nTurn sweet, ripe bananas into a gift or a treat to share for Mother’s Day using one of these recipes for banana cake, loaf or bread.",
    "source": "TheAge",
    "cluster_id": 16
  },
  {
    "url": "https://www.theage.com.au/business/companies/laura-tingle-to-leave-7-30-for-global-abc-role-20250507-p5lx9k.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Laura Tingle to leave 7.30 for global ABC role",
    "publish_date": "Wed, 07 May 2025 11:58:09 +1000",
    "category": "finance",
    "authors": [
      "Calum Jaspan"
    ],
    "text": "One of the ABC’s most prominent broadcasters, Laura Tingle will leave her position as political editor of flagship current affairs program 7.30 for a new global reporting role.\n\nTingle has been appointed the ABC’s global affairs editor, a position until recently occupied by John Lyons, who recently became Americas editor, based in Washington, DC.\n\nLaura Tingle will move on from 7.30 after seven years to become the ABC’s global affairs editor. Credit: Alex Ellinghausen\n\nTingle has held the position since 2018, and was elected the ABC staff representative on its board in 2023. Her position as a board director will remain unchanged.\n\nThe global affairs editor leads the ABC’s international coverage, with reporting and analysis of major world events. The ABC said it would be advertising for a replacement for Tingle on 7.30. She will switch roles mid-year.",
    "source": "TheAge",
    "cluster_id": 5
  },
  {
    "url": "https://www.theage.com.au/national/nsw-top-cop-set-to-resign-20250507-p5lx9b.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "NSW top cop set to resign",
    "publish_date": "Wed, 07 May 2025 11:55:53 +1000",
    "category": "finance",
    "authors": [],
    "text": "NSW top cop set to resign\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 17
  },
  {
    "url": "https://www.theage.com.au/business/consumer-affairs/flying-blind-inside-the-90-second-blackout-that-sparked-chaos-at-a-major-us-airport-20250507-p5lx4m.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Flying blind: Inside the 90-second blackout that sparked chaos at a major US airport",
    "publish_date": "Wed, 07 May 2025 11:52:43 +1000",
    "category": "finance",
    "authors": [
      "Allyson Versprille",
      "Siddharth Philip"
    ],
    "text": "When the computer screens shut off without warning, the room erupted in panic. First came curses, then tears.\n\nOn April 28 at about 1.27 pm, the air traffic controllers monitoring the skies above New Jersey’s Newark Liberty International Airport, which services New York, came face to face with their worst-case scenario: with radar and radio contact suddenly cut, they couldn’t communicate with the dozens of aircraft coming in or out of one of the most congested airspaces in the US.\n\nThe blackout sparked chaos inside air traffic control towers at Newark Airport last week. Credit: Bloomberg\n\nControllers braced for tragedy and destruction that some worried they’d be helpless to prevent, according to accounts of people familiar with the events. One person described workers in the room letting out curses and frustrated cries.\n\nThen, about 90 seconds later, the power blinked back on as abruptly as it had vanished. No one was injured and no planes had crashed. But several controllers were left visibly shaken, with some crying, said one of the people, who were not authorised to speak publicly on the matter. One was suffering heart palpitations. Several had to leave their posts because the stress was too much to bear, further thinning out the ranks of an already strained command post.",
    "source": "TheAge",
    "cluster_id": 18
  },
  {
    "url": "https://www.theage.com.au/national/queensland/brisbane-news-live-qld-police-failed-to-get-bondi-junction-killer-help-before-stabbing-spree-20250506-p5lx08.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Brisbane news live: Child dead in house fire; Homeless to be moved on for Paniyiri; Chandler-Mather laments ‘sick’ parliament after ousting",
    "publish_date": "Wed, 07 May 2025 11:42:55 +1000",
    "category": "finance",
    "authors": [],
    "text": "Queensland Rail’s Doomben line will run on Sundays and public holidays from June 1, as part of more than 100 new weekly train services to be added to the commuter railway network in the coming weeks.\n\nThe new weekday services are “contra-peak”, which means they run outbound from the CBD in the morning, and inbound in the afternoon.\n\nMore than 100 new weekly services will be added to south-east Queensland’s commuter railway network. Credit: Tammy Law\n\nMore than 45 contra-peak services will be added to the Cleveland line that runs through Brisbane’s south-eastern suburbs, and more than 40 will be added to the Ferny Grove line servicing suburbs in Brisbane’s north-west.\n\nThe Cleveland and Ferny Grove changes will take effect from Monday, May 19.\n\n“We’re always looking to make it easier and more accessible to catch public transport and we’re pleased to be delivering these improvements for customers,” Minister for Transport and Main Roads Brent Mickelberg said in a statement.",
    "source": "TheAge",
    "cluster_id": 19
  },
  {
    "url": "https://www.theage.com.au/sport/nrl/around-the-clubs-nrl-round-10-20250506-p5lx10.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Brandon Smith set to join Dominic Young in Roosters’ departure lounge",
    "publish_date": "Wed, 07 May 2025 11:42:46 +1000",
    "category": "sports",
    "authors": [
      "Adrian Proszenko",
      "Robert Dillon"
    ],
    "text": "Roosters coach Trent Robinson has recently preferred Daniel Tupou, Billy Smith, Robert Toia and rugby recruit Mark Nawaqanitawase as his three-quarter options. By informing Young he is free to look around, the winger has the chance to find a new club before the June 30 deadline window closes. The Knights never wanted Young to leave, and have always been open to the prospect of welcoming him back should he become available. Roosters winger Dom Young appears poised to leave Bondi Junction. Credit: Getty Bennett shakes up Bunnies in bid to snap losing streak South Sydney coach Wayne Bennett has replaced his entire front row for Friday’s clash with Brisbane at Suncorp Stadium, as pressure mounts on the Rabbitohs to arrest a four-game losing run.\n\nAfter their 30-4 trouncing by Newcastle last week, Bennett has dropped prop Junior Tatola to 18th man and relegated Davvy Moale to the interchange bench. Hooker Peter Mamouzelos was unavailable because of a dislocated elbow. Wayne Bennett has dropped Junior Tatola to 18th man for the clash against Brisbane. Credit: NRL Photos In their absence, Jai Arrow and Keaon Koloamatangi will be the Rabbitohs’ starting props, while experienced Siliva Havili has been named at hooker. Tatola has gone from caretaker captain to out of the 17 within a week. Bennett, meanwhile, has welcomed back Latrell Mitchell from a one-game suspension and immediately reinstated him at fullback, replacing the dynamic Jye Gray, who drops back to the interchange bench. Halfback Jamie Humphreys has also been recalled after recovering from a hamstring injury that has kept him sidelined for the past four games. He will partner Jayden Sullivan in the halves, with Cody Walker and Jack Wighton on the injured list.\n\nIn contrast to Bennett, Brisbane coach Michael Maguire has shown faith in the Broncos, retaining the majority of his squad who were thumped 32-8 by Penrith last week. Their only change is the inclusion of Fletcher Baker on the bench. Maguire resisted the urge to rush back Ezra Mam, who has completed a nine-game suspension for a drug-driving offence. Mam will instead return in the Queensland Cup. In other team news, David Fifita appears set to continue serving his reserve grade penance after being left out for the second consecutive week by Gold Coast coach Des Hasler for their clash with the Knights in Newcastle on Friday. Loading Canterbury have welcomed Matt Burton back from suspension for their blockbuster showdown with the Raiders in Canberra on Saturday.\n\nSt George Illawarra teenager Loko Jnr Pasifiki Tonga will make his top-grade debut against the Warriors at WIN Stadium on Saturday, replacing injured Emre Guler. Experienced winger Dallin Watene-Zalezniak returns for the Warriors. Premiers Penrith will receive a double boost before taking on the Cowboys in Townsville on Saturday, with Brian To’o returning from a hamstring injury and hooker Mitch Kenny available after serving a suspension. Manly stars Jake Trbojevic and Jason Saab return from injury to take on Cronulla at Brookvale on Sunday. Cronulla centre interested in joining best of British in Ashes series He’s a proud Cook Islander, but emerging Cronulla centre KL Iro has expressed interest in representing England in the end-of-season Ashes series against the Kangaroos.\n\nIro qualifies for a possible England call-up because he was born in Leeds in 2000 while his father Kevin – one of the best centres of his era – was playing for Super League heavyweights St Helens. Emerging Cronulla centre KL Iro was born in England. Credit: Getty Images While KL remains committed to helping the Cook Islands qualify for the 2026 World Cup, he admitted the prospect of playing for England held appeal – especially given Australia are set to embark on a three-Test tour of the Old Dart for the first time in 22 years. Mal Meninga’s Kangaroos will play Tests at Wembley, Everton and Headingley and, judging by early ticket sales, huge crowds are anticipated for what shapes as a landmark series. Asked if he would be interested in representing the land of his birth, Iro replied: “Yeah, for sure. I’m not sure if I’m eligible. I’m not sure how it works.\n\n“But, yeah, I wouldn’t say no ... I would never say no to that, bro. I think it’s pretty cool if you could do that.” The 25-year-old has strung together 29 NRL games for the Sharks, scoring 12 tries – including six in five games this season. Dolphins centre Herbie Farnworth has played six Tests for England and presumably will be one of the first players picked to face the Kangaroos. Farnworth partnered Harry Newman, of Leeds Rhinos, in last year’s home series against Samoa, which the Lions won 2-0. Herbie Farnworth is likely to be the first centre chosen for England in the Test series against Australia. Credit: AP\n\nOther NRL-based players likely to feature for England include Roosters duo Victor Radley and Dominic Young, Canberra forwards Morgan Smithies and Matty Nicholson, Newcastle back-rower Kai Pearce-Paul and North Queensland veteran John Bateman. Roosters half Sam Walker and Canterbury prop Max King are both also eligible because, like Iro, they were born in England while their fathers were playing in the Super League. Loading After his dad retired in 2001, the Iros returned to Rarotonga, where KL spent most of his childhood before eventually moving to Auckland, and then Australia. He has since represented the Cook Islands in eight internationals. “Cook Islands is my strong point, and that’s where I grew up, and that’s my culture … after my career, I probably want to move back there as well,” Iro said.\n\nHe added that his “main goal” this year was to help the Aitu in their World Cup quest, and hopefully provide young Cook Islanders with inspiration. “When I was growing up back there, I always had my dad as a role model to follow, so I hope that I can be, like, a role model for the younger kids that it is possible to get out of the island and achieve good things,” he said. Iro explained his recent decision to change from his Christian name of Kayal to “KL”, saying it was partly because it was often mispronounced, but also a tribute to his father, who was christened Kevin Leslie Iro. “My dad always wanted that, and I like it that way too, because it’s easier to pronounce,” he said. “There’s no confusion around pronunciation and stuff like that as well. “When I first moved to Australia, my dad always wanted me to change it. I’m a shy guy, so, like, I’m just too scared to step on anyone’s toes ... but I guess I’ve built a relationship with these fellas now, so I thought I’d just ask a question and they got it done pretty quick.”",
    "source": "TheAge",
    "cluster_id": 20
  },
  {
    "url": "https://www.theage.com.au/sport/nrl/a-grateful-jarryd-hayne-to-make-unlikely-return-to-semi-professional-footy-20250507-p5lx8b.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "A ‘grateful’ Jarryd Hayne to make unlikely return to semi-professional footy",
    "publish_date": "Wed, 07 May 2025 11:41:00 +1000",
    "category": "sports",
    "authors": [
      "Adrian Proszenko"
    ],
    "text": "Jarryd Hayne has spoken about his return to competitive rugby league for the first time in seven years, describing the game as “something I’ve truly missed.”\n\nHayne has been named at five-eighth for Wentworthville for Sunday’s clash against the Bulldogs, in the semi-professional Ron Massey Cup competition. The two-time Dally M winner will mix it with part-time footballers, his first major on-field appearance since last playing in the NRL for Parramatta in 2018.\n\nThe Magpies were previously a feeder team for the Eels during their time in the NSW Cup.\n\n“I’m incredibly grateful for the opportunity to return to the field with the Wenty Magpies,” Hayne said in a statement.",
    "source": "TheAge",
    "cluster_id": 21
  },
  {
    "url": "https://www.theage.com.au/business/companies/nine-definitely-keen-on-formula-1-broadcast-deal-amid-epl-speculation-20250430-p5lvfb.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Piastri factor puts heat on Formula 1 TV rights race",
    "publish_date": "Wed, 07 May 2025 11:40:30 +1000",
    "category": "finance",
    "authors": [
      "Calum Jaspan"
    ],
    "text": "Nine is planning a swoop on the Formula 1 broadcast rights for its Stan Sport platform, with home-grown star Oscar Piastri’s championship lead adding extra value to the sport’s already-rapidly growing fan base.\n\nThe company’s chief executive Matt Stanton confirmed the company’s interest in the lucrative rights package on Wednesday morning, joking that Piastri’s career-best form is pushing the price up.\n\nOscar Piastri celebrates another Grand Prix win this week. Credit: Getty\n\nAsked if Nine is interested in the rights package, Stanton responded “yep, definitely”, while speaking at the Macquarie Investor Conference.\n\n“I am the only person cheering he doesn’t actually win,” Stanton jokingly added on Piastri’s early-season dominance.",
    "source": "TheAge",
    "cluster_id": 22
  },
  {
    "url": "https://www.theage.com.au/national/two-cars-torched-in-south-west-sydney-arson-attack-20250507-p5lx9r.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Two cars torched in south-west Sydney arson attack",
    "publish_date": "Wed, 07 May 2025 11:38:46 +1000",
    "category": "finance",
    "authors": [],
    "text": "Two cars torched in south-west Sydney arson attack\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 23
  },
  {
    "url": "https://www.theage.com.au/sport/afl/pies-give-up-free-kick-20250507-p5lx9o.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Pies give up free kick",
    "publish_date": "Wed, 07 May 2025 11:34:38 +1000",
    "category": "sports",
    "authors": [],
    "text": "Pies give up free kick\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 24
  },
  {
    "url": "https://www.theage.com.au/business/markets/asx-set-to-slide-trump-tariffs-hurt-wall-street-20250507-p5lx4t.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "ASX opens flat after Trump tariffs unsettle Wall Street giants; NAB gains defy market",
    "publish_date": "Wed, 07 May 2025 11:26:23 +1000",
    "category": "finance",
    "authors": [
      "Nick Newling"
    ],
    "text": "Investment bank Macquarie Group was down 0.3 per cent after the markets regulator ASIC called it out over “significant compliance failures” in its futures dealing business and over-the counter derivatives trade reporting. Loading Continuing their trend from Tuesday, the worst performing sectors were health care and consumer discretionary stocks, down 1.5 per cent and 1.4 per cent, respectively. Health care’s biggest hits were at imaging software company Pro Medicus (down 2.3 per cent), hearing device maker Cochlear (down 2 per cent) and biotech firm CSL (down 1.7 per cent). In consumer discretionary, JB Hi-Fi was down 5.4 per cent – making it the worst performing stock of the morning – after a trading update showed its sales growth slowed in the March quarter. On Wall Street overnight, stocks fell and bonds rose as Trump said he would prescribe tariff levels and concessions for partners looking to avoid higher duties, appearing to move away from the idea that he would engage in back-and-forth negotiations. After almost wiping out losses, the S&P 500 closed with a drop of 0.8 cent. The Dow Jones was down 1 per cent and the Nasdaq composite lost 0.9 per cent.\n\nPalantir Technologies was one of the heaviest weights on Wall Street after falling 11.9 per cent. The company, which offers an AI platform for customers, dropped even though it reported a profit for the latest quarter that met analysts’ expectations and raised its forecast for revenue over the full year. Loading AI-related companies have been finding it more difficult recently to convince investors to support their stocks after they’ve already shot so high. Palantir’s stock’s price remains near $US110, when it was sitting at only $US20 less than a year ago. The return to earth for AI stocks is happening as Trump’s tariffs change the economic landscape for other companies. Clorox chief executive Linda Rendle said her company detected changes in shopping behaviour during the first three months of the year, for example, that led to lower revenue. The company reported both weaker revenue and profit for the latest quarter than analysts expected. Clorox expects the slowdowns to continue in the current quarter, and its stock fell 2.4 per cent.\n\nToy maker Mattel, meanwhile, was swinging between losses and gains after it said it was “pausing” its financial forecasts for 2025, in part because the “evolving US tariff landscape” was making it difficult to predict how much US shoppers would spend during the holiday season and the rest of the year. Mattel ended up 2.8 per cent higher, having reported better results for the latest quarter than analysts feared. Mattel, the toy company behind Barbie, is pausing its financial forecasts amid the economic uncertainty. Credit: New York Times The toy maker was one of the latest companies to join a lengthening list that have yanked their forecasts for the year given uncertainty about what Trump’s on-again, off-again rollout of tariffs will do to the economy. The hope is that Trump will relent on some of his tariffs after reaching trade deals with other countries. Without them, many investors expect the economy to fall into a recession. Regardless, all the will-he-won’t-he uncertainty around tariffs has already made American households more pessimistic about the economy and could affect their long-term plans for purchases. That uncertainty has helped fuel a surge in imports ahead of potentially more severe tariffs ahead.\n\nThe US trade deficit soared to a record $US140.5 billion in March as consumers and businesses alike tried to get ahead of tariffs that went into effect in April and others that have been postponed until July. That follows another update from last week showing that the US economy shrank at a 0.3 per cent annual pace during the first quarter of the year because of a surge in imports. Loading Some companies say they’re already seeing impacts to their business from the uncertainty created by tariffs. DoorDash fell 7.4 per cent after reporting weaker revenue than analysts expected for the latest quarter, though it may have also offered a more encouraging snapshot of how US households are doing. The company said order growth in its US marketplace remained healthy. The US Federal Reserve has begun its two-day meeting, and will announce its next move on interest rates Wednesday (Thursday morning AEST). Virtually no one expects it to do anything to its main rate, even though Trump has been advocating for cuts.",
    "source": "TheAge",
    "cluster_id": 25
  },
  {
    "url": "https://au.news.yahoo.com/furious-sign-appears-on-busy-aussie-road-after-gross-driveway-act-223154282.html",
    "title": "Furious sign appears on busy Aussie road after 'gross' driveway act",
    "publish_date": "2025-05-06T22:31:54Z",
    "category": "finance",
    "authors": [],
    "text": "It's not the first time a mystery defecator has wreaked havoc in suburban streets.\n\nResidents across two affluent inner-city suburbs fear a phantom pooper may be on the loose, after two smelly surprises were discovered in separate driveways just days apart.\n\nLate last month, a local living in the inner-eastern Adelaide suburb of Kensington Gardens captured a female dogwalker doing her business in their driveway on the home security cameras.\n\nThe resident urged the woman to fess up and return to clean her mess, posting flyers around the community, or risk being outed online. \"We have clear video footage of the incident. You have 48 hours to return and properly clean up the mess. If not, we will have no choice but to circulate photos from the footage to identify you. Please do the right thing,\" the sign read.\n\nJust three days later, it appears the driveway dumper struck again, this time at a home in Norwood, only five minutes down the road. Home security footage captured a woman wearing a pink bucket hat, a mask, and — fittingly — gloves, slipping behind a fence, crouching down, and appearing to relieve herself during an early morning escapade.\n\nThe local resident was less than impressed, so fought back in a very public way. Source: 7News\n\nAdelaide's inner suburbs targetted by rogue pooper\n\nThe owner of the home told 7News he walked outside to find the unwelcome surprise wrapped in a napkin and was forced to clean up the filth himself. It's understood both recent incidents took place before 7.30am.\n\nADVERTISEMENT\n\nOne local branded the rogue relief-taker \"a bit sick\". \"I don't know what their problem is,\" she told 7News. Another labelled the act \"pretty disrespectful\" while one local labelled it simply \"gross\".\n\nTwo women have been caught in the act in adjacent suburbs in the space of just days. It currently remains unknown if they are the same person. Source: 7News\n\nIt's not the first time a mystery defecator has caused frustration in suburban streets — both Sydney and Brisbane have, in recent years, seen strange cases of individuals leaving human waste in public or private areas, often under the cover of darkness.\n\nIn one Sydney incident, a jogger was caught repeatedly relieving themselves outside the same business premises, earning them the nickname \"the poo jogger.\"\n\nADVERTISEMENT\n\nBrisbane residents were similarly disturbed after a string of unexplained driveway incidents that left authorities scratching their heads and locals calling for increased patrols. The mystery man was later identified as a corporate manager, after he was photographed with his pants down on a suburban street.\n\nHe was suspected of having relieved himself more than 30 times outside a city apartment block. The man was later forced to resign from his high-ranking position after pictures of him in the act went viral.\n\nDo you have a story tip? Email: newsroomau@yahoonews.com.\n\nYou can also follow us on Facebook, Instagram, TikTok, Twitter and YouTube.",
    "source": "Yahoo",
    "cluster_id": 32
  }
]