[
    {
        "url": "https://www.9news.com.au/national/banks-pass-on-rate-rise-for-savers-consumer-finance-news/311ddc18-3726-47f5-a818-706b71b040e3",
        "title": "Banks pass on interest rate rises to savers",
        "publish_date": "Sat, 07 Feb 2026 00:50:15 +0000",
        "category": "finance",
        "authors": [
            "Feb"
        ],
        "text": "T﻿wo of the big banks have hiked their interest rates on savings accounts in response to Tuesday's cash rate rise.\n\nBoth the Commonwealth Bank and Westpac have increased select saving rates by 0.25 per cent, at the same time as hiking their home loan rates.﻿\n\nA number of smaller banks have also passed on the increase.\n\nREAD MORE: Deal reached to save collapsed private hospitals\n\nTwo of the big banks have announced they will raise their interest rate on select savings accounts. (Dominic Lorrimer)\n\n﻿But according to Canstar, many account holders don't meet the criteria to enjoy the bonus interest.\n\nA recent survey of more than 1000 Australians with a savings account that has terms and conditions required to reach the maximum interest found 41 per cent do not meet the conditions each month.\n\nThis includes 11 per cent who say they never meet the conditions.\n\nThe standard rate is often inconsequential in comparison.\n\nFor example, the Commonwealth Bank's Goal Saver account attracts 4.50 per cent bonus interest, but only 0.25 per cent in standard interest.\n\nConditions can include terms like making a deposit, or increasing the account balance, each month or making no withdrawals.\n\n﻿\"CBA has lifted the maximum rate on its popular Goal Saver account to 4.50 per cent, which will be a win for engaged savers. However, like Westpac, customers need to meet the bank's monthly terms and conditions or risk seeing their rate fall to an inch off the floor,\" Canstar.com.au's data insights director, Sally Tindall, said.\n\n\"﻿CBA is also lifting the rate on its NetBank Saver, to a headline rate of 4.70 per cent for new customers for the first five months, however, existing customers will only see a boost of 0.15.\n\n\"That said, it's more than Westpac's online saver rate for existing customers, which isn't moving at all.\n\n\"These rate decisions, where banks pick and choose which rates within a savings account get a boost and which miss out, are a great reminder of how important the fine print is when it comes to something as seemingly simple as a savings rate.\"\n\nShe said customers must check the conditions regularly to ensure they're making the most of their money.﻿\n\n\"Canstar research shows two in five bonus savers miss out on earning the maximum interest every month, so it's imperative people understand the conditions and consider whether a simpler account might suit them better.\n\n\"In a market where top savings rates are now pushing into the 5's again, savers should shop around if their bank isn't rewarding them for their loyalty.\"",
        "source": "9News"
    },
    {
        "url": "https://www.abc.net.au/news/2026-02-07/how-to-keep-safe-skiing-and-snowboarding-in-japan/106310604",
        "title": "Australians are obsessed with Japan's snow. It's starting to cost them",
        "publish_date": "Sat, 07 Feb 2026 02:37:49 +0000",
        "category": "finance",
        "authors": [],
        "text": "Australians are addicted to powder and it's coming at a cost.\n\nThe thrill of \"Japow\", or Japanese powder, attracts more tourists from Australia than any other country to Japan's snow-covered slopes.\n\nSkiers and snowboarders are drawn to the unique snow, which is softer and easier on the joints.\n\nBut it's not all fun and games.\n\nThe tragic deaths of three Australians on Japan's ski slopes already this year have reinforced the dangers of alpine sports.\n\nFurther underlining the risks, figures from two insurance companies suggest claims related to injuries from snow sports in Japan have spiked in recent years.\n\nSouthern Cross Travel Insurance's chief customer officer Jess Strange said the number of customers who claimed for skiing and snowboarding accidents in Japan increased 75 per cent between 2023 and 2025.\n\nShe said the average cost of each claim during that time was between $1,100 and $1,500.\n\nNatalie Ball, 1Cover's chief operating officer, also said there was a \"significant increase\" over the past three years, including a 43 per cent spike in claims from 2024 to 2025.\n\n\"While overall Japan policy sales have grown strongly, winter sports add-ons are growing faster, indicating a rising number of travellers heading to Japan specifically for skiing and snowboarding,\" Ms Ball said.\n\nVisits peak in January where Australian tour operators and accommodation providers are booked up with tourists from all over the world — coining the term \"Japanuary\".\n\nOwen Lansbury is the communications director from the Mountain Safety Collective, a not-for-profit that supports back-country skiers with condition reports and avalanche training.\n\n\"It's easily the best ski destination for Australians in terms of ease of travel, value for money, amazing food, fascinating culture, welcoming people, and of course the incredible snow,\" he said.\n\nBut the rise in foreigners hitting the slopes seems to be contributing to more accidents, said Makoto Takayanagi, the head of Japan's National Ski Safety Measures Council.\n\nJust in Hokkaido, 48 of the 53 off-piste ski-related accidents from November 1 to February 2 involved foreigners, he said.\n\nSo what can Australians visiting Japan's snowfields do to stay safe both at resorts and in the back-country?\n\nRespect nature\n\nCompared to Australia, Japan receives much more \"dry\" snow throughout winter.\n\nIt is the result of frigid Siberian winds meeting the warm air from Sea of Japan and condensing into snow clouds that blow across Hokkaido and Japan's alps, blanketing them with fine powder.\n\nJapan's snow and resorts are unique and need to be understood by those hitting the slopes according to experts. (Kyodo via Reuters/file)\n\nThomas Gellie, a ski coach and founder of Big Picture Skiing, said this made Japan's snow softer, more forgiving on the body and joints, and easy to ski on.\n\n\"Good snow quality makes skiing so much easier and it's why people travel to find it,\" Mr Gellie said.\n\nBut Mr Lansbury said soft, deep snow could also turn a minor accident like a face plant into a fatal incident if no help was close by.\n\nAustralians in Japan shaken by ski deaths but say its snowfields are safe Australians working in Japan's ski fields say while the sport has unpredictable risks, there are ways to be prepared.\n\nShota Tanaka, a wilderness medicine physician in Japan and back-country skier, said skiing and snowboarding were inherently dangerous sports regardless of which country people visit.\n\n\"It is essential to recognise that winter sports involve a continuous interaction with environmental stressors — cold exposure, altitude, terrain variability, and weather instability,\" Dr Tanaka said.\n\nCompared to other winter sport destinations like Switzerland, the United States, and New Zealand, Japan has smaller mountains with smaller vertical drops which people can mistakenly perceive as less risky, he said.\n\nBut he added that although access to off-piste areas can feel easier in Japan, the country's terrain is often steep and heavily forested, and should not be underestimated.\n\nObserve local culture\n\nMr Lansbury has been visiting Japan's snow fields for 20 years and said the differences in skiing there compared to Australia can be significant.\n\nHe said the weather and snow conditions can be more intense, with deeper snow and limited visibility even when skiing on-piste, mainly at resorts.\n\nSome resort infrastructure like ski lifts might be less modern or well maintained than in Australia so people needed to take more responsibility for their personal safety than they would back home, he added.\n\nSome facilities may not be kept up to Australian standards in Japanese snow resorts. (Reuters: Mariko Katsumura, file)\n\n\"Be aware that the lift attendants may not speak fluent English to provide warnings and some warning signs may not be translated into English,\" he said.\n\nDespite the many Australian tour operators and accommodation providers in Japan, ski coach Thomas Gellie urged people to look up and respect Japanese culture and etiquette.\n\nEating and drinking while walking might be fine in Australia but it's frowned upon in Japan, as was drinking too much and talking loudly, he said.\n\n\"It might not be for their safety but it is if we want to continue being welcomed in the country,\" Mr Gellie said.\n\nKnow your limitations\n\nExperts stressed the importance of not overestimating one's abilities.\n\nFor those planning to ski off-piste or in deep powder, taking an avalanche education course was imperative to understand the risks and how to use a safety kit.\n\nNiseko's drawcard is making it too expensive for locals International tourists, especially Australians, started to arrive en masse in the famous Japanese ski resort of Niseko in the early 2000s. Now the influx has pushed the cost of housing so high it's almost impossible for locals to compete with wealthy foreigners for property.\n\nMr Lansbury said skiing powder snow was its own skill that should not be rushed and to make use of local instructors to build skills and confidence.\n\n\"You can have 40 years of skiing experience and still be learning new things,\" he said.\n\n\"Accidents happen when people overestimate their abilities and underestimate the [potentially fatal] consequences of going into terrain without the required skills, experience and equipment.\"\n\nOnce skiing within resorts was mastered, Dr Shota said people looking to go off-piste should travel with a certified guide with extensive knowledge of the local terrain.\n\n\"I avoid pushing limits in poor weather and never hesitate to cancel plans when conditions are unfavourable,\" he said.\n\nUnderstand travel insurance\n\nAustralians should ensure they check their travel insurance included snow sports and to take out additional cover if needed, insurance providers said.\n\nOwen Lansbury says Australians need to take a higher degree of personal safety when skiing in Japan than they would back home. (Supplied: Matt Nethery)\n\n\"Failing to do so can turn a serious injury into an enormously expensive and highly stressful ordeal,\" said Ms Ball from 1Cover.\n\nMr Lansbury warned skiers about leaving a resort's boundary for fresh, unmarked snow, saying the consequences could be worse than in Australia because of the deeper volume of snow.\n\n\"The moment you go underneath a boundary rope there is no avalanche control and no ski patrol to help you if you get stuck or injured,\" he said.\n\nHe added that Japanese ski patrols will typically not go beyond the resort's boundary, leaving rescues to the police which can take much longer and cost thousands of dollars.\n\nExperts say following warnings signs and staying away from blocked-off areas is critical to keeping safe at ski resorts. (Reuters: Mariko Katsumura, file)\n\nMs Strange from Southern Cross Travel Insurance said skiers and snowboarders are likely to be covered when they stick to designated commercial ski areas that are open for use, follow resort rules and signage, and wear a helmet at all times.\n\nShe also said while medical expenses are covered by travel insurance, damage to equipment is generally not covered so this needed to be factored in.\n\n\"Understanding your cover before you travel means you can focus on enjoying Japan's amazing snow safely and confidently,\" she said.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2026-02-07/pregnant-women-kimberley-high-rates-heart-condition-and-diabetes/105995596",
        "title": "Relocating weeks before birth among challenges pregnant women face in outback WA",
        "publish_date": "Sat, 07 Feb 2026 02:32:18 +0000",
        "category": "lifestyle",
        "authors": [],
        "text": "For expectant mothers living across Western Australia's vast remote north, getting to the nearest hospital is not always straightforward.\n\nFar from having a go-bag ready for when contractions start, pregnant women living in towns across the Kimberley are often expected to relocate weeks, if not months, before they are due to give birth.\n\nThe tyranny of distance hits close to home for Darlene Cox, from Noonkanbah, a 5.5-hour, 380-kilometre drive from the main hospital offering maternity care in Broome.\n\nAdding to the challenges facing both expectant mums and their obstetrics carers is the greater number of moderate-to-high-risk pregnancies.\n\nA mobile ultrasound unit, which can travel to remote communities, has been suggested as a possible solution. (ABC Kimberley: Ruby Littler)\n\nThese are driven by high rates of preventable conditions across the Kimberley, including potentially fatal rheumatic heart disease, and diabetes, which disproportionately affects First Nations women.\n\nKimberley obstetricians and midwives say this is largely due to social and environmental factors and the difficulties in detecting and diagnosing conditions early in remote Indigenous communities.\n\nMs Cox, who is diabetic, has been staying in motels and Aboriginal Short Stay accommodation in Broome for the past two months.\n\nDarlene Cox has been receiving prenatal care in Broome and is considered to be at higher risk due to her diabetes. (ABC Kimberley: Ruby Littler)\n\n\"It is a challenge being away from your community, especially where you grew up and lived for that long, not seeing family and friends' faces,\" Ms Cox said.\n\n\" This is my first child and I don't get to see my mother because she's back in her home town. \"\n\nMs Cox said the hundreds of kilometres of travel was getting too difficult to manage.\n\n\"There is transport, but it's the distance and because of raining season, it's hard vehicle-wise in and out of town,\" she said.\n\n\"It would be hard for a pregnant woman travelling in the bus or the car for hours, and you're nearly eight-and-a-half months pregnant.\"\n\nHigher-risk challenges\n\nBroome Hospital obstetrician and gynaecologist Lauren Kite said the Kimberley had a very different patient profile to metropolitan areas.\n\nLauren Kite says early detection of rheumatic heart disease can make a world of difference. (ABC Kimberley: Ruby Littler)\n\n\"One of the biggest ones we see is diabetes, which we do see in other areas, but much more frequently here,\" Dr Kite said.\n\n\"And then we have more uncommon conditions than in capital cities, like rheumatic heart disease.\"\n\nCardiovascular diseases are the leading cause of maternal death in Australia, and, often, issues such as rheumatic heart disease should be entirely preventable.\n\nThe hospital provides pamphlets with advice to young expectant parents. (ABC Kimberley: Ruby Littler)\n\n\"It goes back to our social and environmental situation,\" Dr Kite said.\n\n\"If you're repeatedly exposed to it, if you don't have access to clean water, if you live in overcrowded housing, all of that can make it more likely that you develop the condition.\"\n\nMobile outreach services, telehealth and increased education for medical staff and community members are among the solutions being explored.\n\n\"It'd be amazing to be able to get to more places with some of our obstetric practitioners, doctors and midwives,\" Dr Kite said.\n\n\"We do have reasonable midwifery coverage, but not as frequent as would be best … to have the money to do that and the time and staff would make a big difference.\"\n\nMobile monitoring a possibility\n\nBroome hospital acting clinical maternity manager Verity Bradley said the service was looking into a mobile ultrasound unit that could be used remotely.\n\nVerity Bradley says pregnant women presenting to Broome Hospital are considered a moderate to high-risk cohort. (ABC Kimberley: Ruby Littler)\n\n\"We say, 'Right, off you pop, jump on the bus and come to Broome; we need to do some sugar monitoring, you might need an echocardiogram or an obstetric ultrasound,'\" she said.\n\n\" But for some that's 8 hours away and they've got other children, they've got work commitments, financial commitments, partners … it's not as simple. \"\n\nWhile promising in theory, the outreach approach poses its own challenges — particularly finding the staff to work and support patients in remote locations.\n\n\"Staffing's really challenging in the Kimberley, we have lots of housing issues in Broome,\" Ms Bradley said.\n\n\"We also have … crime, so getting recruitment and retention of staff can be really hard.\"\n\nEducation led solutions\n\nThe Royal Australian and New Zealand College of Obstetricians and Gynaecologists (RANZCOG) has started running an in-person training program in remote locations across the country.\n\nDubbing access to maternity and gynaecological care in the Kimberley a \"postcode lottery\", the organisation has been working to bridge the barriers also faced by clinicians in their training.\n\nMaternity access in the Kimberley has been described as a \"postcode lottery\". (ABC Kimberley: Ruby Littler)\n\nRANZCOG vice-president Jared Watts said the training sessions would improve the skills of regional medical practitioners, in turn leading to better care for patients.\n\n\"Trying to keep up to date can be really hard wherever you live, but in places like the Kimberley or anywhere rural it can be really difficult,\" he said.\n\n\"Because you can't get into conferences in the big cities or go to a workshop.\n\n\"So we take the teaching to where to people actually are.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2026-02-07/the-mark-of-cain-lead-singer-josie-scott-transgender/106315830",
        "title": "The Mark of Cain lead singer on a lifetime masking the truth",
        "publish_date": "Sat, 07 Feb 2026 01:55:32 +0000",
        "category": "entertainment",
        "authors": [],
        "text": "There was always going to be something difficult behind the hard, unapologetic music by legendary Adelaide rockers The Mark of Cain.\n\nA dark and powerful band that uses combat themes in its imagery — yet screams with an expressive intelligence that could start a riot in the right setting — could only be so strong with something deep at its core.\n\nPeople identify with the band and attach their own trials to the lyrics, but this week, its lead singer revealed what that \"thing\" was, and it's far more brutal than their music.\n\nFor nearly 60 years, the lead singer has hidden the fact that she identifies as a woman, having learnt her true nature as a child.\n\nOn Monday, she announced that family and friends know her Josie Scott, or \"Jo for short\".\n\n\"I knew who I was when I was eight or nine years old, like many transpeople, and it was just a matter of what I saw as trying to endure it,\" she told ABC Radio Adelaide's Jo Laverty.\n\n\" No-one knew. I didn't share it with anyone. I always kept journals, and if they were found in the event of my death, that would have been the revealing aspect of it. \"\n\nLGBTQI+ community support services ABCQueer has compiled this list of national and state-based support services relevant to LGBTQI+ people, their families and friends.\n\nWhile her journal entries became more honest in recent years, Scott said as a young person she would write about this \"thing\", this \"thing I have\".\n\n\"I didn't really spell it out. I did later on, but I kept it very close to my heart.\"\n\nScott said that, like many people, she would self-medicate with a \"different variety of things\" to deal with hiding herself.\n\n\"A lot of it was in denial, but also for me, I was searching for some sort of philosophy that would get me through, whether it was stoicism, existentialism, something that could say, 'Everything's bad, but you push through',\" she said.\n\nMaking their mark\n\nTMOC was formed in the mid-1980s with Scott on lead guitar and brother, Kim Scott, on bass.\n\nBrother and TMOC bass player Kim Scott has played alongside Josie since the mid-1980s. (Website: The Mark of Cain)\n\nIts original lead singer, Rod Archer, left after a short period and Scott took over vocals, with TMOC releasing their first album, Battlesick, in 1989.\n\nTheir critically acclaimed work was followed up with The Unclaimed Prize in 1991, and then their breakthrough album, Ill At Ease, in 1995.\n\nThe latter is in Rolling Stone's top 200 Australian albums of all time.\n\nScott said she left \"little trails, pieces and breadcrumbs\" in her music about her true identity, which was \"always informing it\".\n\nBut it was Ill At Ease, she says, that became the \"real encapsulation of everything, and ill at ease is how I felt\".\n\n\"I felt it also described other people's feelings about the world, how they feel and whether they connect or not,\" she said.\n\n\"It was also about a relationship that had broken up, there's all sorts of threads through that, but I think you'll find something about it in every album.\"\n\nDavid Bowie inspires\n\nScott was always impressed by artists like The Cure, or David Bowie, and people who were \"just themselves, people who were loud and proud\".\n\n\"Music was my saviour. Also, music allows some expression, although I never allowed myself that expression,\" she said.\n\n\" I looked at David Bowie and thought, 'Wow, that would be really cool to express like that', but I never allowed myself. \"\n\nJosie Scott fronts the band alongside brother and bass player Kim Scott. (Facebook: The Mark of Cain)\n\nShe put it down to \"social conditioning\".\n\n\"Put yourself out like that, it's ridicule, shame, there's a whole lot of things to work through,\" Scott said.\n\nScott said it was also of the era to deny your true nature if it didn't fit in, a generation that tended not to just \"be who I wanted to be, do what I wanted to do\", but instead worked to be the best person they could for their parents.\n\n\"No-one knew, not even Kim. It was a surprise for him, that's how well guarded I was,\" she said.\n\nScott said it was while being sick with COVID-19 during her \"normal end-of-decade reflection\", that she made the decision to come out.\n\n\" I was like, 'Are you going to be OK if that kills you, and do we have any regrets?' And it was like, 'Yeah, I have regrets. I have never been authentic', and that's what led me to say, 'Right, let's do something about this.' \"\n\nScott made her public announcement at exactly 9pm CDST on Monday, which she posted on social media before going to bed feeling \"sick\" with worry about the responses her post might attract.\n\nHer brother, Kim, and partner, Maggie, told Scott she could stop worrying because it had been met with a near-resounding positivity by TMOC's audience and colleagues.\n\nAs well as more than 1,000 encouraging comments from fans, other Australian bands like Regurgitator, Frenzel Rhomb and Spiderbait have given Scott their support.\n\n\"In the morning, I had a lot of people reaching out, people from 30 years ago, people from the US, the UK, people I didn't even know,\" Scott said.\n\n\"I was like, 'Wow, it restores your faith in humanity' … almost.\"\n\nNew album in the works\n\nSince Ill at Ease, TMOC has released two more studio albums, This is This and Songs of the Third and Fifth, and two live albums, including 2023's Livid Live '96.\n\nThe band was inducted into the SA Music Hall of Fame in 2022.\n\nTMOC's most recent drummer, Eli Green, has brought new songs to the band. (Website: The Mark of Cain)\n\nAside from perhaps appearing a little more \"androgynous\" at the band's next live show, Scott said nothing would change for TMOC.\n\nThe band still rehearses every Saturday, and has been writing new songs, having about eight songs that \"we're looking at recording and getting out\".\n\n\"It's all acoustic. It's just me,\" Scott jests, before adding that nothing has changed.\n\nThey even had a couple of new songs written by drummer Eli Green that were \"sounding awesome\".\n\n\"There's no difference in what we're doing. It's still nice and brutal and heavy,\" Scott said.\n\n\"For me, it feels really good. I feel like there's a blockage gone.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2026-02-07/fifth-generation-butcher-ends-150-year-etheridge-family-legacy/106307698",
        "title": "Fifth-generation butcher retires ending 150-year family legacy",
        "publish_date": "Sat, 07 Feb 2026 01:19:45 +0000",
        "category": "finance",
        "authors": [],
        "text": "Bernard Etheridge has the butchery trade in his blood.\n\nSince arriving in Australia in the 1800s, the Etheridge family has built a butchery legacy that spans five generations across three regional towns in New South Wales.\n\nBernard Etheridge's father Gus in the 1940s delivering meat for Mornington Butchery. (Supplied: Bernard Etheridge)\n\nOriginally from England, the Etheridges started their Australian story in Scone in the Upper Hunter region.\n\nThere, Mr Etheridge's great-great-grandfather Edward worked as a butcher before moving further north to Barraba in the 1870s to open the family's first shop.\n\nIn 1946, Mr Etheridge's grandfather moved to the north west town of Gunnedah, about 75 kilometres west of Tamworth, and purchased the old bootmaker's shop that soon became Mornington Butchery.\n\nThe butchery was passed down from generation to generation, and in 1997, Mr Etheridge bought the shop from his parents and has run it since.\n\nBernard Etheridge with his parents Gus and Majella circa 2000. (Supplied: Bernard Etheridge)\n\nThe end of an era\n\nMr Etheridge said the shop's 80-year success story was part people, part product.\n\n\"I enjoy what I do, and also the interaction with the public every day is good,\" he said.\n\n\"The quality in a product, quality of service and the staff have been a big part of the success of the business.\n\n\"Without good staff, you won't have a good business.\"\n\nBefore: Mornington Butchery in the early 1980s. . . After: The shopfront today. . . Instructions: Use left and right arrow keys to control image transition Before and after images SLIDE Mornington Butchery in the early 1980s. / The shopfront today.\n\nMr Etheridge said his parents would be happy that he's hanging up the knives.\n\n\"Dad built the business to quite a large size and he'd be quite pleased that we've been able to add to that and maintain the business,\" he said.\n\n\"They'd be quite pleased that I get to put my feet up.\"\n\nBernard Etheridge says butchery has become less physical in recent years thanks to new machinery. (ABC News: Brigitte Murphy)\n\nButchery business changes\n\nReflecting on the four decades spent working in the shop Mr Etheridge said he had observed significant changes in the meat and butchery industry.\n\n\"There's been big changes that you don't really notice as it happens, but looking back there's been a lot,\" he said.\n\nThe shop in 1997. (Supplied: Bernard Etheridge)\n\n\"I started working here straight out of school at 16 … it was a lot more physical, hands-on work,\n\n\"[Now] there's a lot more machinery; better machinery made life a lot easier.\"\n\nHe said there has also been change in the public's eating habits.\n\nLoading...\n\n\"Back when I first started off the family Sunday roast was a big thing.\n\n\"These days people just don't do that, if they have a family get together, it's usually a BBQ, so that's a big change.\"\n\nWhile he said it didn't contribute to his decision to resign, Mr Etheridge said changes in shopping habits and the emergence of fast-food chains had been a challenge for local businesses in the region.\n\nBernard Etheridge says fast food has been a challenge for local businesses. (ABC News: Brigitte Murphy)\n\n\"The takeaway food industry has taken off,\" he said.\n\n\" When I first started there were 13 butcher shops in town, now there's only two. \"\n\nHanding over the reins\n\nAfter 46 years working in the shop Mr Etheridge said he was ready to let go.\n\n\"It's still quite a profitable industry to be in, it's just that date of birth is catching up; it's time to hand the reins on to a younger group of people.\n\n\"All of my kids have worked here in various roles, in smaller roles. My daughter still works here on a casual basis, but they've all gone off into different areas, so it's time to sell the business.\n\n\" After five generations, this is the finish of the Etheridge family connection to [the] meat industry. \"\n\nWhile Mr Etheridge's retirement marks the end of an era, a new chapter is just beginning for local cattle farmers the James family.\n\nNew owner Kate James says she is looking forward to continuing the legacy of Mornington Butchery.\n\nKate James's family will take over the reins in February. (ABC News: Brigitte Murphy)\n\n\"I'm super excited and also a bit nervous,\" she said.\n\n\"I believe all the things that everybody loves about Mornington are all the things that I love about Mornington.\n\n\"And those are the things that we're going to be concentrating on going forward.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2026-02-07/winter-olympics-2026-daily-guide-day-one/106287722",
        "title": "Winter Olympics 2026 quick guide: What to watch today",
        "publish_date": "Sat, 07 Feb 2026 01:07:03 +0000",
        "category": "sports",
        "authors": [],
        "text": "What's on today?\n\nThe Aussie women's cross country skiers will be in action from 11pm AEDT.\n\nwill be in action from Valentino Guseli is up in the final round of the Big Air snowboarding from 5.30am AEDT on Sunday .\n\nis up in the final round of the from . And if Heated Rivalry has piqued your interest in ice hockey, you can see some action from 7.10am AEDT tomorrow.\n\nICYMI\n\nLook back over the ABC's live coverage of the opening ceremony which featured Mariah Carey as the headline act.\n\nStay across the action\n\nABC Sport will be live blogging the Winter Olympics every day.\n\nYou can also stay across the highs and lows of the Games with the ABC Sport Daily podcast and ABC Sport.\n\nAnd you can stream the Games live on 9 Now or Stan Sport.\n\nGive me more",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2026-02-07/winter-olympics-2026-opening-ceremony-chilly-global-outlook/106316092",
        "title": "Jeers, cheers and pleas for peace kick off Milano Cortina 2026",
        "publish_date": "Fri, 06 Feb 2026 23:59:27 +0000",
        "category": "sports",
        "authors": [],
        "text": "The Milano Cortina Winter Olympic Games, the 25th in the history of the Olympic movement, got underway in a delight of colour and style and celebration of music and Italian culture.\n\nA total of 1,200 performers across four venues, headlined by Mariah Carey and Andrea Bocelli in Milan's La Scala of Football, San Siro, put on a performance as gloriously spectacular as anything that the city's famous Teatro alla Scala could claim to have produced.\n\nThe future of this grand old stadium is marked, the 99-year-old site of Italian glory and despair, is set to be replaced by 2032.\n\n\"The San Siro was always full of emotions,\" former AC Milan player and manager Fabio Capello said earlier this week.\n\nThe San Siro is one of the jewels of Italian football. (Getty Images: picture aliance/Michael Kappeler)\n\n\"For me, San Siro is history. San Siro is life. San Siro is a monument.\n\n\"For the people, for the fans, it is something different.\"\n\nWinter Olympics live updates: Calls for unity at Milano Cortina opening ceremony You can also stay across the highs and lows of the Games with the ABC Sport Daily podcast and ABC Sport.\n\nHe noted that athletes should take time to look up at its towering stands when they marched and, when they surely did, they would have been greeted with a wall of sparkling lights that towered into the distinctive rafters.\n\nBut all eyes from within those stands would not have strayed from the kaleidoscope of colour and light being meted out on the stadium floor.\n\nThe choreography was immaculate, a posthumous nod to style icon Giorgio Armani with a catwalk of models in the colours of the Italian flag a particularly stylish touch ahead of a glorious rendition of the Italian national anthem.\n\nThe choreography at the opening ceremony was sensational. (Getty Images: Gregory Shamus)\n\nDiva in chief Carey stole the stage with a glorious performance of Italian classic Nel blu, dipinto di blu — yeah, that's the song better known as Volare — followed by Nothing is Impossible before her retinue came to clear her from the stage.\n\nBut Bocelli's Nessun Dorma was simply spine-tingling in its beauty and intensity, the 67-year-old's soaring vocals enveloping everyone in attendance with a shiver of deep, primal emotion that had the hairs on the back of your neck stand to attention.\n\nBut in truth, the music, whether a fantasia of operatic classics or the pumping trance that added tempo to the athlete's parade, was all as spectacular as the clean visuals.\n\nThe opening ceremony was a study of stunning colours and patterns. (Getty Images: Jared C. Tilton)\n\nThe idea of Armonia, or Harmony — the theme of this year's opening ceremony — we're told, is to bring different elements together:\n\nMilano and Cortina, city and mountain, humanity and nature. Armonia is not a compromise between opposing forces, but a dialogue between them — a necessary foundation for imagining a better future.\n\nThis ceremony was no doubt a bold, ambitious undertaking.\n\nIn keeping with the dispersed nature of these Games, the Opening Ceremony was being conducted over four venues, bringing together the two main hubs situated over 400km apart and their two satellites even deeper into the mountains.\n\nAustralia's athletes entered the Winter Olympics at four different venues. (Getty Images: Maddie Meyer)\n\nSimultaneous national anthems. Simultaneous cauldrons being lit — the Milanese one at Arco della Pace, the Arch of Peace, the Cortina one in the city's Piazza Angelo Dibona. Simultaneous parades of athletes.\n\nAlthough the sight of giant spaces behind the place holders inside the San Siro was odd at times, the director did a stellar job of transmitting the simultaneous pictures of athletes marching in Livigno, Predazzo and Cortina.\n\nIt was a joyous occasion and exactly what International Olympic Committee president Kirsty Coventry had hoped for when she had spoken earlier in the week.\n\n\"What is keeping my faith alive is that when the opening ceremony happens and those athletes start competing, suddenly, the world remembers magic and the spirit that the Games have,\" she said.\n\n\"And they get to suddenly remember what's actually important, and they get to be inspired.\"\n\nBut Olympics do not happen in isolation.\n\nIsrael were roundly jeered when their quartet of athletes marched into the San Siro, the first reaction that was not overwhelmingly positive from the highly responsive crowd all night.\n\nUS vice President JD Vance was in Milan too, appearing almost at the right hand of Coventry.\n\nWhen he was shown on the big screen applauding the Americans, who had been mostly well received by the crowd, he was roundly booed and jeered too.\n\nJD Vance received a frosty reception. (Getty Images: Andreas Rentz)\n\nPeace was a constant, underlying theme — not unusual in Olympic opening ceremonies but coupled this year with a sense of urgency directly corresponding to the perilous state of global politics that provided such a dour backdrop to events.\n\nEven before the televised aspect got underway, the spectators in San Siro were shown a video message from UN Secretary General António Guterres with a message highlighting the peaceful mission the Games could hope to achieve.\n\n\"At a time when so much of the world is divided by conflict, your very presence demonstrates that another world is possible. One of unity, respect and harmony,\" Giovanni Malagò, President of the organising committee, said in his speech.\n\nYet outside the rings of unity linking the Games hubs, protests had been taking place across the city.\n\nStudents at the Politecnico di Milano in the city's east held up placards decrying the presence of United States Immigration and Customs Enforcement agents, known as ICE, in the city, while there have also been protests against the Israeli-Palestine conflict.\n\nStudents gathered to protest against the presence of ICE agents in Milan earlier in the day. (Getty Images: Emanuele Cremaschi)\n\nMayor Beppe Sala described ICE as \"a militia that kills\" and that the agents are \"not welcome\".\n\nRussia, of course, is not here to jeer though, banned as a result of the war in Ukraine that kicked off in earnest at the conclusion of the last Winter Olympics in Beijing and continues to rage — just a day ago, Russian military commander Lieutenant General Vladimir Alexeyev was shot multiple times in Moscow.\n\nUkraine, incidentally, got the largest cheer up to that point of anyone.\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\nAdd America's increasingly bold approach to both friend and foe to foreign conflicts in Sudan, Haiti, The Sahel, Myanmar and Syria, and the Olympics feels less like a welcome distraction and more like the late Lesley Nielsen's Detective Frank Drebin standing in front of a firework factory telling everyone to move on.\n\n\"We understand politics and we know we don't operate in a vacuum,\" Coventry said earlier this week.\n\n\"But our game is sport. That means keeping sport a neutral ground. A place where every athlete can compete freely, without being held back by the politics or divisions of their governments.\"\n\nWishful thinking? Or blind ignorance?\n\nEither way, may the Games begin.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2026-02-07/winter-olympics-2026-opening-ceremony-quick-hits/106308482",
        "title": "Winter Olympics quick hits: Star power and harmony ignite historic opening ceremony",
        "publish_date": "Fri, 06 Feb 2026 23:34:44 +0000",
        "category": "sports",
        "authors": [],
        "text": "Athletes parade across Italy, Mariah Carey ignites a historic opening ceremony, and 'Coach Snoop' makes an appearance at the curling.\n\nHere are the quick hits from the Milano Cortina Winter Olympics opening ceremony.\n\n1. Aussies makes their … entrances\n\nThe parade of athletes broke new ground with four locations used for arguably the centrepiece of any opening ceremony.\n\nThe Australians were present at all four, making their presence felt with an excitable entrance at each, as Italian DJ MACE provided the soundtrack with his signature dance music.\n\nJakara Anthony and Matt Graham carry the Australian flag in Livigno. (Getty Images: Cameron Spencer)\n\nFlag bearers Jakara Anthony and Matt Graham led the contingent at Livigno in a fitting recognition for two of our greatest Winter Olympians.\n\nAussie athletes also appeared at the San Siro, Cortina and Predazzo.\n\nThey took part in the parade at the site closest to where they will compete.\n\nThe format was designed to unite \"different places into a single, continuous narrative\".\n\n2. Carey provides international flavour\n\nMariah Carey's appearance at the San Siro wasn't kept a secret, although opinion on social media was divided as to whether she should perform at an Olympics hosted by Italy.\n\nNevertheless, the US pop star made quite the entrance in a stunning sequined dress — with feather boa details — designed by Italian Fausto Puglisi.\n\nUS pop star Mariah Carey performed at the San Siro. (AP: Natacha Pisarenko)\n\nCarey first sang in Italian, performing Domenico Modugno's 1958 song Nel blu dipinto di blu, with its famous refrain of \"Volare\".\n\nShe then moved to familiar territory with an abbreviated rendition of her ballad Nothing Is Impossible, sung in her native tongue.\n\nOpening ceremony organisers wanted Carey's performance to represent themes such as sporting spirit, harmony and colour.\n\n3. Italian president meets 'The Doctor'\n\nA fuss is always made of the arrival of a head of state at an opening ceremony, but the Milano Cortina Games did it in unique style.\n\nVia video, Italian president Sergio Mattarella travelled to the San Siro aboard one of the Milan's most iconic symbols — a Carrelli tram.\n\nMattarella first appeared in the video picking up a toy dropped by a child, but he wasn't the only well-known Italian to feature.\n\nThe tram diver was revealed to be MotoGP great Valentino Rossi, who smiled as he opened the doors for Mattarella when arriving at the San Siro.\n\nKnown as \"The Doctor\", Rossi won seven 500CC/MotoGP titles, and nine world championships across all classes.\n\n4. 'A celebration of what unites us'\n\nThe theme for the opening ceremony was Armonia, or harmony.\n\nOrganisers described the concept as \"bringing together what is different,\" and it was on show throughout a vibrant, colourful evening.\n\nWinter Olympics live updates: Calls for unity at Milano Cortina opening ceremony You can also stay across the highs and lows of the Games with the ABC Sport Daily podcast and ABC Sport.\n\nAt San Siro, a stadium that rival football teams AC Milan and Inter Milan both call home, two aerialists were very brave in performing some seriously impressive moves as the Olympic rings rose over the stadium and drew together.\n\nWe were also treated to a representation of the myth of Cupid and Psyche, as well as three giant, suspended paint tubes from which cascaded the three primary colours: yellow, red and blue.\n\nThe theme of armonia was a constant throughout the opening ceremony. (Getty Images: Jared C. Tilton)\n\nAnd that theme was further emphasised by swimming great and groundbreaking first female IOC President, Kirsty Coventry.\n\n\"Let these Games be a celebration of what unites us, of everything that makes us human,\" Coventry said in her address in Milan.\n\nAnd with the first-ever simultaneous cauldron lighting, the Milano Cortina Games were officially opened.\n\n5. 'Coach Snoop'\n\nEarlier on Friday, we finally received an answer to the age old question: is Snoop Dogg a curling fan?\n\nWearing a \"Coach Snoop\" beanie, the US rapper was among the crowd at Cortina Olympic Curling Stadium during the pre-opening ceremony competition.\n\nHe was there to watch US pair Korey Dropkin and Cory Thiesse defeat Canada's Brett Gallant and Jocelyn Peterman 7-5 in the mixed doubles competition.\n\nSnoop Dogg took to the ice at the curling competition. (Getty Images: Richard Heathcote)\n\nSnoop — who was ever-present at the 2024 Paris Summer Olympics — went all out at the curling, wearing a custom jacket featuring the faces of Dropkin and Thiesse.\n\n\"Snoop Dogg's here cheering us on,\" beamed Dropkin.\n\n\"It (the jacket) was so cool. Loved it. Coach Snoop looked good today.\"\n\nSnoop Dogg cheered on the US to victory. (Getty Images: Andrew Milligan)\n\nSnoop, who was named Team USA honorary coach in December, even hit the ice after the match, getting hands-on as he learned the basics from squad members.\n\nHe also asked British competitor Bruce Mouat for a photo together.\n\n\"That was so cool,\" Mouat's mixed doubles partner Jennifer Dodds said.\n\n\"He said to Bruce he's heard about him and he knows who he is, so that was pretty cool.\n\n\"I was like, 'Snoop Dogg!', when we got out there. I was proper, like, fangirling.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2026-02-07/tiffani-phelps-de-wildt-suspected-heat-death-remote-australia/106301164",
        "title": "Family's warning after 27yo dies of suspected heatstroke on cattle station",
        "publish_date": "Fri, 06 Feb 2026 23:16:43 +0000",
        "category": "lifestyle",
        "authors": [],
        "text": "It was a family's worst nightmare, delivered by telephone from the other side of the world.\n\n\"I really couldn't believe it,\" Brandon De Wildt said.\n\n\"Because it's so sudden, I thought it was a really sick joke.\"\n\nMr De Wildt's sister, Tiffani, had moved to Western Australia from the Netherlands six years prior.\n\nTiffani Phelps de Wildt worked as a jillaroo. (Supplied)\n\nShe divided her time between Esperance on the state's south coast and Ashburton Downs, a vast Pilbara pastoral station where she worked casually as a jillaroo.\n\nOn December 10, 2025, she was mustering cattle on horseback when she began to complain of exhaustion.\n\nTiffani Phelps De Wildt had no pre-existing health complications, according to her family. (Supplied)\n\nHer colleagues sat her in the shadow of her horse, radioed her husband, and took her to the nearest road.\n\n\"Corey [her husband] came from the station and they met together on the freeway ... then he drove as fast as he possibly could to the hospital,\" Mr De Wildt said.\n\n\"She lost consciousness in the car, then he stopped, he took her out of the car and gave her CPR.\n\n\"We know she said some words in Dutch, and her husband isn't too good at Dutch.\n\n\" So nobody could hear her last words. \"\n\nSuspected heatstroke\n\nTiffani Phelps De Wildt was found unresponsive by paramedics on the Paraburdoo-Tom Price Highway, 30 kilometres from the nearest medical centre.\n\nShe was 27 years old.\n\nTiffani Phelps de Wildt had lived in Australia for six years and was recently married. (Supplied)\n\n\"What the paramedics said at the scene was that it could possibly be heatstroke,\" Mr De Wildt said.\n\nThe Bureau of Meteorology recorded a maximum temperature of 44.8 degrees Celsius in Paraburdoo, the nearest town, on the day Ms Phelps De Wildt died.\n\nIt was the hottest day of December 2025.\n\n\"They advised her not to go [out], but she really wanted to go for the animals,\" Mr De Wildt said.\n\n\"My sister is who she is and she likes to be outside, and she loves the animals.\"\n\nInvestigation ongoing\n\nWorkSafe is investigating the incident, a process that can take up to two years.\n\nWA Police said it was not treating Ms De Wildt's death as suspicious, but it was preparing a report for the coroner.\n\nAshburton Downs could not be reached for comment.\n\nTiffani Phelps De Wildt's brother says she was a keen horseback rider who adored animals. (Supplied)\n\nMr De Wildt said an initial autopsy was done, but further testing was set to occur in the coming months.\n\nMost of her remains were released to her family, who travelled to WA to hold a funeral shortly before Christmas Day.\n\n\"The ashes are split in half, so half of it stays in Australia, because she moved there and she really liked the country, the freedom that you guys have there.\n\n\" We don't want to take all of her back home. \"\n\nEveryone susceptible to heat\n\nMs Phelps De Wildt's death has not been reported in the Australian media until now.\n\n\"If she told us that she was going out on such a hot day, we would obviously rule against it, like her colleagues also did,\" Mr De Wildt said.\n\nHe said more should be done to protect workers vulnerable to extreme temperatures.\n\nHow to avoid heatstroke and when to call Triple Zero Extreme heat forecast for the next few days has prompted warnings form health experts. Here's how to stay safe.\n\nSt John WA acting head of medicine Andy Bell called Ms Phelps De Wildt's death an \"absolute tragedy\".\n\n\"This is a classic case of somebody who was working in a very, very hot environment; they were displaying signs and symptoms of heat-related illness,\" he said.\n\n\"And because of the tyranny of distance ... particularly in rural Western Australia, it's very, very difficult for people to get to the help that they need in a timeframe that would be most appropriate.\n\n\" This was a young, fit, healthy woman, and she was still susceptible to this type of environment. \"\n\nAndy Bell warns it is not just the very young and old who are vulnerable to heat stress. (ABC News: Keana Naughton)\n\nNo 'tools down' temperature\n\nSafe Farms WA chief executive Stephen Brown said a sudden death such as Ms Phelps De Wildt's was felt across the agricultural sector.\n\n\"All the workers, all her friends, her family, wherever they may be, and the word gets out to other stations and it just ripples right across the whole industry,\" he said.\n\nMr Brown said more should be done to educate people about heat.\n\n\"A dry, hot heat of 45 degrees, which is measured on a back verandah, is a lot different to 45 degrees out in a paddock, or out on a pastoral station somewhere, with the sun beating down on you,\" he said.\n\nStephen Brown says a \"tools down\" temperature should be considered. (ABC News: Keana Naughton)\n\nEarlier this month, the Australian Council of Trade Unions issued a call for national safety rules that require employers to stop or change duties when temperatures reach dangerous levels.\n\nMr Brown said while a blanket policy might be impractical, a responsibility to assess the risks remained.\n\n\"The building industry has it in Perth, the wharfies have it, [it] gets to a certain temperature and it's down tools for the day,\" he said.\n\n\"Not quite that simple in agriculture, I appreciate, but I think there has to be a temperature when the risk is just too great to the farm owner, farm manager or pastoral lease owner and also to the workers.\"\n\nA 'wonderful' sister remembered\n\nIt comes as parts of WA's north continue to face brutal heat, with a severe heatwave in place until Sunday for the Gascoyne and Central West.\n\nMr De Wildt said he hoped his sister's story might help others facing tough conditions and that her memory would have a lasting impact.\n\n\"Tiffani ... was a wonderful person,\" he said.\n\n\"She has a really kind smile, one of those that when you when you see her, you smile yourself.\n\n\" She loved everything that lives. \"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2026-02-07/nine-year-old-jackson-mackay-deadlifting-world-record/106275110",
        "title": "Nine-year-old deadlifts into the record books",
        "publish_date": "Fri, 06 Feb 2026 23:06:40 +0000",
        "category": "sports",
        "authors": [],
        "text": "After joining a gym to boost his confidence, Jackson Mackay, nine, is aiming for a second world record deadlift title just 18 months after he first started weightlifting.\n\nIn January, the Sunshine Coast boy claimed a world record with an 80-kilogram deadlift, beating the previous record of 72 kilograms.\n\n\"I can't believe I just beat a world record. That's insane, I never thought it would come to this,\" he said.\n\nKids World Records verified footage of the lift and awarded the Heaviest Deadlift Title in its boys' 7-9-year-old category.\n\nThe Twin Waters local said his desire to achieve a weightlifting goal was initially sudden.\n\n\"I just woke up and… because I was at the gym, I'm like, 'Well, gyms are for weights, so I'm gonna break a world record,'\" Jackson said.\n\nHe trained three hours a week for 18 months, initially using a hex bar designed to build core stability before claiming the record with a standard straight bar.\n\nJackson achieved the world record with the support of his coach, Joshua Hodges (left), and his mother and father, Cara and Brett Mackay. (ABC News: Jake Kearnan)\n\nThe year 4 student said achieving his goal was an emotional moment.\n\n\"[My parents were] jumping up and down in excitement and, like, impressed and… my mum even cried.\"\n\nJackson's mother, Cara Mackay, said she \"couldn't believe\" her son had completed the lift.\n\n\"He'd set this goal a year before, and he wrote out on a piece of paper what he wanted to achieve in the next 10 years, and seeing him actually achieve that was just amazing,\" Ms Mackay said.\n\n\" I felt really, really proud as his mum to be able to see my son do that. \"\n\nStrength and conditioning coach Joshua Hodges said it was \"really special\" witnessing Jackson reach his goal, and he was also \"a little bit emotional\".\n\n\"Jackson just started to well up with joy and then Cara, seeing her son achieve that, started to [cry],\" Mr Hodges said.\n\n\"I was like, 'How cool is this?' I get to be a part of this moment Jackson's wanted to do for quite a while now.\"\n\nJackson's coach Joshua Hodges was emotional when the young athlete completed the lift he had worked towards. (ABC News: Jake Kearnan)\n\nMr Hodges, who has trained Jackson since October 2024, said the boy was drawn to weightlifting for the social aspect after dropping out of rugby league.\n\n\"We sort of found that he was quite strong for his age, he was quite determined,\" Mr Hodges said.\n\n\"He came to me just to help build that self-confidence back, really … he's got back into team sports since being with us, so his confidence has grown.\"\n\nIt has also led the nine-year-old to set a new goal.\n\n\"I might do the 10-year-old record for deadlift,\" Jackson said.\n\nThe science of pumping iron\n\nUniversity of the Sunshine Coast sports and exercise scientist Daniel Van Den Hoek said supervised weightlifting was a great option for children and adolescents.\n\n\"We hear myths like resistance training stunts growth, and it damages growth plates, but those things, they're just not true,\" Dr Van Den Hoek said.\n\n\"Resistance training is quite healthy as long as we make sure that it's supervised and progressed correctly.\"\n\nHe said the benefits of weightlifting were similar to other exercise, including improved mental health, improved performance at school, muscle growth and injury reduction.\n\nHe also said that Jackson's pursuit of other sports — rugby league, wakeboarding and motocross — may have contributed to his success in the gym, and vice versa.\n\n\"We see it at the elite levels of Australian sport… [athletes] that have grown up playing multiple sports, getting new skills, new knowledge about how their body moves and adapts that they then apply to each of those different sports,\" he said.\n\n\"And as a child, the evidence says that engaging in more sports and more diverse programmes is really beneficial later on for specialising.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2026-02-07/trump-endorses-japan-pm-takaichi-ahead-of-sunday-election/106317102",
        "title": "Trump endorses Japan's prime minister ahead of Sunday election",
        "publish_date": "Fri, 06 Feb 2026 23:05:47 +0000",
        "category": "finance",
        "authors": [],
        "text": "US President Donald Trump has given his \"total endorsement\" of Japanese Prime Minister Sanae Takaichi ahead of Japan's national elections, adding he would meet her at the White House on March 19.\n\nJapan's first female premier, whose coalition is widely expected to win, is seeking a public mandate for spending plans that have rattled investors, and a defence build-up that could further strain relations with China.\n\nMs Takaichi's Liberal Democratic Party and its partner, the Japan Innovation Party, known as Ishin, could capture ⁠around 300 seats in the 465-seat lower house of parliament, the polls show, well up from the razor-thin majority they now control.\n\nFear of 'silent invasion' by foreigners in Japan spurs far-right popularity The once fringe Sanseito has become the fourth largest opposition party in parliament by pushing a nationalist \"Japanese First\" agenda.\n\n\"Prime Minister Takaichi is someone who deserves powerful recognition for the job she and her Coalition are doing,\" Mr Trump posted on his Truth Social platform on Thursday.\n\n\"Therefore, as President of the United States of America, it is my Honor to give ​a Complete and Total Endorsement of her, and what her highly respected Coalition is representing.\"\n\nOne of Ms Takaichi's first engagements after she was elevated to prime minister in October was to host Trump in Tokyo.\n\nShe gave him a putter used by ​his ⁠former golfing buddy, the late Japanese prime minister Shinzo Abe.\n\nAnalysts say Donald Trump's endorsement of Sanae Takaichi signals a growing pattern of aligning with right-wing leaders abroad. (Reuters: Evelyn Hockstein, file)\n\nLauded by Mr Trump for breaking Japan's glass ceiling, Ms Takaichi pledged billions of dollars in investments in a meeting analysts said helped underline the strength of the Japan-US alliance.\n\nWeeks later, however, she touched off the biggest diplomatic dispute with China in over a decade by publicly outlining how Tokyo might respond to a Chinese attack on Taiwan.\n\nTrump has asked Takaichi not to anger China\n\nMr Trump, who is ‌seeking to maintain a fragile trade truce with China, asked Ms Takaichi in a private phone call in November not to further aggravate Beijing, sources told Reuters.\n\nA resounding victory could ​hand Ms Takaichi new clout in the dispute with China, current and former Japanese officials said, though Beijing has shown no signs of backing down.\n\nMs Takaichi's plans to strengthen Japan's defences will likely also draw more anger from Beijing, which has cast her endeavours as an attempt to ​revive Japan's past ‍militarism.\n\nThe long-ruling Liberal Democratic Party and its coalition is expected to win Sunday's election. (AP: Louise Delmotte)\n\nWhile the row with China is ⁠starting to weigh on the world's fourth-largest economy, it has hardly dented Ms Takaichi's high approval ratings.\n\nShe has even become an unlikely idol for some voters, who have been buying up the bag she carries and the pink pen she scribbles with in parliament.\n\nTurnout among young supporters, who tend to vote less than older cohorts, could help determine the margin of a Takaichi victory.\n\nHow one comment sparked threats against Japan's PM Sanae Takaichi has been in the top job for less than a month, but her comments detailing what Japan could do if China invaded Taiwan has sparked a diplomatic war.\n\nRecord snowfall in some parts of the country could ‌also crimp turnout.\n\nIf the polls have it all wrong, and Ms Takaichi loses her majority, she has said she will resign.\n\nMs Takaichi \"has already proven to be a strong, powerful and wise Leader, and one that truly loves her ⁠country,\" Mr Trump said in his endorsement.\n\nThe US president has increasingly sought to shape foreign elections.\n\nHe backed Argentine President Javier Milei, highlighting US financial support as a factor in Mr Milei's 2025 legislative success.\n\nOn Thursday, he endorsed Hungarian Prime Minister Viktor Orban for a vote there in April.\n\nAnalysts say such interventions signal a growing pattern of aligning with right-wing leaders abroad.\n\nReuters",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2026-02-07/russia-belars-winter-olympics-2026-milano-cortina-ain/106306898",
        "title": "Is Russia competing at the Milano Cortina Olympics?",
        "publish_date": "Fri, 06 Feb 2026 22:23:59 +0000",
        "category": "sports",
        "authors": [],
        "text": "Another Olympic Games. Another festival of sport without Russia or Belarus.\n\nAs was the case in Paris two years ago, there will be no sign of the Russian or Belarusian flag, name or colours at the 2026 Winter Olympics.\n\nBut there will be a handful of athletes with Russian or Belarusian passports competing in northern Italy.\n\nWhy was Russia banned from the Olympics?\n\nRussia was banned from the Olympics in October 2023, 20 months after the invasion of Ukraine that took place in the days after the Beijing Winter Olympics.\n\nBelarus, due to the country's support of Russia's war, was also banned.\n\nThe principal reason for the ban was not the war specifically, although the IOC did recommend that individual sporting organisations suspend Russia in March 2022.\n\nIt was actually when the Russian Olympic Committee took over sporting organisations in several regions within Ukraine, such as Donetsk, Kherson and Luhansk, that the IOC confirmed the ban.\n\nThat constituted \"a breach of the Olympic Charter because it violates the territorial integrity of the NOC [National Olympic Committee] of Ukraine\", according to the IOC.\n\nWasn't Russia called something else in Beijing?\n\nTennis players Mirra Andreeva and Diana Shnaider (front) had to wear bland uniforms, devoid of national colours in Paris. (Getty Images: DeFodi Images/Tnani Badreddine)\n\nIn Tokyo in 2021 and at the 2022 Winter Olympics in Beijing, Russian athletes competed under the moniker ROC.\n\nROC stands for Russian Olympic Committee, and Russian athletes were allowed to represent the committee, even though they could not represent their own country.\n\nThat acronym was used due to a long-running state doping scandal that further intensified at those Games after the positive test of 15-year-old figure skater Kamila Valieva.\n\nRussia sent 200 athletes to the 2022 Beijing Winter Games under the ROC moniker, winning 32 medals, including five golds.\n\nWhat is the AIN at the Winter Olympics?\n\nAIN stands for Athlètes Individuels Neutres, which in English is Individual Neutral Athletes.\n\nThe AIN is the name used to represent approved Russian and Belarusian athletes at the 2026 Winter Olympics.\n\nIt is the same designation that approved athletes from those two countries were given at the 2024 Paris Olympics.\n\nThere, 32 athletes competed, winning a gold, three silvers and a bronze medal.\n\nThose athletes are banned from using the neutral Olympic flag and Olympic anthem, which has been used in the past for neutral athletes.\n\nIt will, instead, use a flag depicting a circular AIN emblem and a one-off instrumental anthem that has been assigned by the IOC.\n\nWhich Russian or Belarusian athletes are eligible?\n\nFigure skater Adeliia Petrosian, of Russia, will perform as an individual neutral athlete at the Milano Cortina Games. (Getty Images: Anadolu/Sefa Karacan)\n\nA total of 20 athletes will compete under the AIN banner at these Games; 13 from Russia and seven from Belarus.\n\nThey cannot compete in team events, the IOC justifiably stating that individuals cannot be part of a team, which rules out ice hockey, curling and the team figure skating events.\n\nThe \"principles of participation\" state that only athletes who have \"not acted against the peace mission\" of the IOC \"by actively supporting the war\" will be invited.\n\nThe BBC conducted an investigation that suggested four of the Russian athletes cleared to compete have, in fact, breached the terms laid out by the IOC, either by being members of the Russian armed forces or by liking pro-War material online.\n\nThe athletes have to be approved by their sport's governing body, so FIS for skiing, ISU for ice skating events, the FIL for luge and the ISMF for skimo.\n\nThey are then vetted by an IOC-appointed panel.\n\nHere is the list:\n\nRussia:\n\nYulia Pleshkova — Alpine skiing\n\nSimon Efimov — Alpine skiing\n\nSavelii Korostelev — cross-country skiing\n\nDaria Nepriaeva — cross-country skiing\n\nPetr Gumennik — figure skating\n\nAdeliia Petrosian — figure skating\n\nDaria Olesik — luge\n\nPavel Repilov — luge\n\nIvan Posashkov — short-track\n\nAlena Krylova — short-track\n\nNikita Filippov — ski mountaineering\n\nKseniia Korzhova — speed skating\n\nAnastasiia Semenova — speed skating\n\nBelarus:\n\nMarina Zueva — speed skating\n\nHanna Karaliova — cross-country skiing\n\nViktoriya Safonova — figure skating\n\nMaria Shkanova — Alpine skiing\n\nAnastasiya Andryianava — freestyle skiing\n\nAnna Derugo — freestyle skiing\n\nHanna Huskova — freestyle skiing\n\nRussian athletes took FIS to court to compete\n\nDaria Olesik fought a legal challenge to be able to compete. (Getty Images: Carmen Mandato)\n\nOnly a handful of Russians and Belarusians have been invited to compete in skiing events, but even that number is controversial.\n\nSkiing governing body, the FIS — which oversees Alpine, Nordic and freestyle skiing as well as snowboarding events at the Games, 57 of the 116 medal events — had banned all Russian and Belarusian athletes from competing in sanctioned events since February 2022 and renewed the ban in October last year.\n\nHowever, Russia appealed to the Court of Arbitration for Sport (CAS) which overturned the ban on December 2.\n\nThe FIL (International Luge Federation) had also issued a blanket ban on athletes from those countries but had that overturned by CAS\n\nSports bodies had justified the exclusion of Russians for security reasons, to protect athletes and prevent protests that also could disrupt events.\n\nAre Russia ever going to come back into the Olympic fold?\n\nYou'd argue it will be inevitable at some point, not least since FIFA president Gianni Infantino said the ban on Russia competing in football should \"definitely\" be lifted, \"at least at youth level\".\n\nInfantino told Sky News that the ban had \"not achieved anything\" and \"created more frustration, and hatred.\"\n\nThat was described by Matvii Bidnyi, Ukraine's sports minister, as \"irresponsible\" and \"infantile\".\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\n\"They detach football from the reality in which children are being killed,\" he said.\n\n\"Let me remind you that since the start of Russia's full-scale aggression, more than 650 Ukrainian athletes and coaches have been killed by Russians.\"\n\nNevertheless, this came after a recommendation from the Olympic Summit that international sports federations allow Russian teams and athletes to compete under their national flag at youth level.\n\nAnd IOC president Kirsty Coventry said sport should be a \"neutral ground\" where athletes can \"compete freely, without being held back by politics\".\n\nHowever, she also noted that \"the October 2023 decision [to suspend Russia and Belarus] still stands. We have kept in place the neutral athletes' status, as per Paris, and that decision has not been spoken about in the last couple of weeks\".",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2026-02-07/lithium-ion-battery-fires-on-increase-waste-collection/106300480",
        "title": "Waste collection program to tackle rising number of lithium-ion battery fires",
        "publish_date": "Fri, 06 Feb 2026 22:14:15 +0000",
        "category": "finance",
        "authors": [],
        "text": "A new waste collection program in north Queensland is aimed at reducing increasing numbers of lithium-ion battery fires caused by items such as electric toothbrushes, cordless vacuums and e-scooters.\n\nAuthorities say the incidents have more than doubled across Queensland since 2022.\n\nEmergency services responded to 260 lithium-ion battery fires across the state last year.\n\nThe program is run by the North Queensland Regional Organisation of Councils (NQROC) and offers free disposal of items with embedded lithium-ion batteries before they are processed interstate.\n\nNQROC waste coordinator Rachel Cunningham said people might be unaware some household items had embedded batteries.\n\nRachel Cunningham says the program is a bid to reduce the risk of battery fires. (ABC North Qld: Gabrielle Becerra Mellet)\n\n\"Things like, your electric toothbrushes and … your shavers, your vacuums, your cordless vacuums, they all have embedded batteries in them and at some point they have an end of life,\" she said.\n\nMs Cunningham said the project was a bid to reduce fires at waste networks and increase safety messaging.\n\n\"One battery in a bin can cause a fire,\" she said.\n\n\"The risks to human health and life as well as infrastructure is really high from that.\"\n\nRachel Cunningham says vapes have been the most common item dropped off since the program started. (ABC North Qld: Gabrielle Becerra Mellet)\n\nThe Burdekin, Charters Towers, Hinchinbrook and Townsville councils are all running the embedded battery program, which will also extend to the Palm Island Aboriginal Shire Council.\n\nCouncils will individually review the program at its conclusion in November.\n\n'It puts you on edge'\n\nLast year, the Townsville City Council had 24 fires across its waste and recycling sites that required emergency service attendance.\n\nTownsville waste truck driver Kirk Tracey has had two battery-related fires on his trucks while driving.\n\nKirk Tracey has dealt with two rubbish truck fires while driving. (ABC News: Baz Ruddick)\n\n\"The first time I was on recycle in Aitkenvale and I was looking at the camera and I just saw a bright flash,\" he said.\n\n\" That's when you start to panic and your heart rate starts to speed up a bit and you call emergency to clear the air. \"\n\nMr Taylor said he had safely dumped the load at a school car park, which was empty due to a public holiday.\n\n\"When we're driving and looking for a dumping spot, we've got to be careful of wires too,\" he said.\n\n\"It could end up disastrous if we just panic and put it up in the wrong spot and then we've just shorted out all these houses due to power lines.\"\n\nTownsville had 24 fires across its waste and recycling sites in 2025. (Supplied: Townsville City Council)\n\nHe said battery fires caused ongoing concern for drivers.\n\n\"It puts you on edge for the rest of the day,\" he said.\n\n\"Because you've had this fire, you've cleared the truck, you've had the fire brigade … you start picking up bins then you're thinking, 'Oh, what if it happens again?'\"\n\nIncreasing incidents, injuries\n\nQueensland Fire Investigation Unit head Daren Mallouk said emergency services were regularly responding to reported battery fires.\n\n\"Linked with the increase, we've also seen unfortunately an increase in serious injuries and fatalities as well,\" he said.\n\nDaren Mallouk says fires involving lithium-ion batteries are increasing every year. (Supplied: QFD)\n\nHe said e-scooters and e-bikes were the most common devices seen to have started battery fires.\n\nMr Mallouk said the risk of fire associated with e-mobility devices was being exacerbated by a secondhand market.\n\n\"A lot of these things are sold without a charger so people are sourcing their own battery charger which is a common occurrence of people using the incorrect or incompatible charger to charge the device,\" he said.\n\n\"If they're using an incorrect charger, so a charger that's supplying a greater power supply than that the battery is designed to take, that in itself is part of the reason why the battery will fail.\"\n\nDaren Mallouk says e-mobility devices are commonly involved in lithium-ion battery incidents. (Supplied: QFD)\n\nResidents can drop off embedded batteries to participating council waste facilities until November 15.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2026-02-07/nancy-guthrie-potentially-abducted-in-41-minute-window/106313064",
        "title": "Nancy Guthrie may have been abducted in a 41-minute window",
        "publish_date": "Fri, 06 Feb 2026 22:04:54 +0000",
        "category": "finance",
        "authors": [],
        "text": "Nancy Guthrie is a funny, spunky and clever 84-year-old whose grandchildren crowd around her and cover her with kisses.\n\n\"She is full of kindness and knowledge. Talk to her, and you'll see,\" her daughter Savannah said, in an apparent plea to whoever may have abducted her mother.\n\nFlanked by her siblings Camron and Annie, NBC Today show host Savannah Guthrie had a message for her missing mother.\n\n\"Everyone is looking for you, Mommy, everywhere,\" she said.\n\nNancy Guthrie was last seen a week ago after a family games night on Saturday.\n\nAfter sharing a meal and a few card games, a relative dropped her off outside her home in Arizona's Catalina Foothills desert mountains community.\n\nIn the early hours of Sunday morning, she vanished.\n\nInvestigators believe it was against her will, zeroing in on a 41-minute window about four hours after she arrived home.\n\nFirst, the doorbell camera was disconnected. Then, her pacemaker app disconnected from her mobile phone.\n\n\"Her health, her heart is fragile. She lives in constant pain. She's without any medicine. She needs it to survive. She needs it not to suffer,\" the television anchor said in the video message.\n\nThe 84-year-old has now been missing for seven days.\n\n\"We will not rest — your children will not rest — until we are together again,\" Savannah said.\n\nLoading...\n\nWhat we know about Nancy Guthrie's disappearance\n\nIn the evening of Saturday, January 31, at 9:48pm (local time) the garage door of Mrs Guthrie's red-brick Tucson home was opened.\n\nIt was closed about two minutes later.\n\nLocal authorities believe Mrs Guthrie had likely gone to bed not long after earlier arriving home.\n\nIt was not until the early hours of Sunday morning that authorities say things began to change.\n\nAt 1:47am on Sunday, Mrs Guthrie's doorbell camera was disconnected.\n\nLess than 30 minutes later, at 2:12am, surveillance camera software detected movement but no footage was retained.\n\nAuthorities say the camera's owner did not have a subscription to allow for footage to be saved.\n\nAt 2.28am, Mrs Guthrie's pacemaker disconnected from its monitoring app on her phone.\n\nAfter Mrs Guthrie did not make an appearance at her local church friends and family began to worry.\n\nThe timeline of Nancy Guthrie's disappearance released by local authorities. (ABC News Graphics: Lindsay Dunbar)\n\nAt 11:56 am relatives visited her home, and found she was not there.\n\nIt took them just seven minutes to raise the alarm.\n\nTwelve minutes later, Pima County Sheriff's Office patrols arrived at the house.\n\nOnce authorities began searching the property, they found what has been described as a minimal amount of Mrs Guthrie's blood on the front porch.\n\nChris Nanos says he believes Nancy Guthrie is still alive. (AP: Sejal Govindarao)\n\nPima County Sheriff Chris Nanos said Mrs Guthrie was taken against her will, with her wallet and medication left in her home.\n\n\"This isn't somebody that just wandered off,\" Mr Nanos said.\n\n\"She couldn't walk 50 yards by herself.\"\n\nHe also said he believed she was still alive.\n\n\"Absolutely, absolutely. There's nothing to say she isn't,\" he said.\n\nOn Thursday (local time), FBI special agent Heith Janke said the agency was investigating an alleged ransom letter sent to media outlets.\n\nThe FBI is yet to confirm the authenticity of the notes.\n\n\"If those that may have Nancy are watching this, the family is ready to talk, get proof of life,\" he said.\n\n\"Because there has been no contact after that ransom note went to the media.\"\n\nAuthorities have also made an arrest over an \"imposter\" ransom note, saying there was no evidence it had any connection to Mrs Guthrie's disappearance.\n\nWho is Nancy Guthrie?\n\nMrs Guthrie is a widow and mother of three. She lost her husband, Charles Guthrie, in 1988 when he had a heart attack while working on an expedition project as an engineer in Mexico.\n\nShe also has a connection to Australia. Her daughter, Savannah, was born in Melbourne.\n\nSavannah Guthrie has not been on the Today Show since the disappearance of her mother Nancy. (Supplied: Instagram)\n\nSavannah wrote about the loss of her father in the decades since his passing, describing him as an affectionate and funny man.\n\n\"My father was a seemingly unlikely mix of qualities: always strong, sometimes terrifying, loyal to the end, and disarmingly gentle and tender when it counted,\" she wrote in 2014.\n\nThe NBC host later returned to Australia with her mother Nancy Guthrie, saying it was a lifelong dream.\n\n\"For my mum to come back and get to see where she used to live brings back a lot of happy memories with my dad,\" Savannah Guthrie told the Daily Telegraph in 2015.\n\nA sign of solidarity from neighbours at Nancy Guthrie's home in Tucson, Arizona. (AP: Caitlin O'Hara)\n\nMs Guthrie describes her mother as \"a kind, faithful, loyal, fiercely loving woman of goodness and light\".\n\nA week on from Mrs Guthrie's disappearance, the FBI has offered a US$50,000 ($72,088) reward for any information about her whereabouts.\n\nIn a video posted on Wednesday local time, Ms Guthrie delivered a prepared message to whoever had taken her mother.\n\n“We are ready to talk,\" she said, her voice shaking.\n\n\"We need to know without a doubt that she is alive and that you have her. We want to hear from you and we are ready to listen. Please reach out to us.”",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2026-02-07/aussies-to-watch-milano-cortina-winter-olympic-games-2026/106273742",
        "title": "The Aussies to watch from our 'iconic' 2026 Winter Olympics team",
        "publish_date": "Fri, 06 Feb 2026 21:53:49 +0000",
        "category": "sports",
        "authors": [],
        "text": "Australia heads into the 2026 Winter Olympic Games in Milano Cortina (and Livigno) with arguably its strongest team in history.\n\nThis season alone, 11 different Australians have won a total of 26 medals at World Cup level across seven different sporting disciplines.\n\nThat doesn't even include the two X Games medals won by Scotty James and Indra Brown in Aspen last week.\n\nThirteen of those World Cup medals have been gold, while three Aussies — Jakara Anthony, Brown and Adam Lambert — currently wear the yellow bib as leaders of their respective World Cup standings.\n\nAustralia has never won more than four medals at a single Winter Olympic Games — Beijing 2022 was the most successful in terms of total number of medals with one gold, two silvers and a bronze. Australia won two golds and a silver at the 2010 Vancouver Games, which is technically a more successful Games if we were to plot it on a medal table.\n\nFive of the 53-person team already have Olympic medals to their name, with Anthony looking to defend her Olympic title.\n\n\"Sochi was our greatest size of team, but I think the breadth and the depth of our performances over the last quad is a testament to our national sporting organisations and the Olympic Winter Institute,\" Alisa Camplin-Warner said at the team announcement at the MCG last month.\n\n\"I think the breadth and depth is really unique, that's why I call this an iconic team … we've not gone into a Games with that kind of profile before.\"\n\nIt's shaping up to be a very interesting Games.\n\n\"I'm sure it'll be our best team yet,\" Valentino Guseli said of the squad.\n\n\"We're aiming to get the most medals that we have so far.\"\n\nOf course, anything can happen on the day of the competition, but Australia has grounds to be extremely confident that these Games could be the most successful in history.\n\nHere's a look at a handful of Australia's genuine medal chances to keep an eye on these Games.\n\nWho else should we pay attention to?\n\nWith 53 Aussies competing across northern Italy, there's plenty to keep your attention through the early hours of the night this February.\n\nAnd although, of course, Australia is desperately keen for medals — that is not the only measure of success.\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\nWhat about Abbey Willcox, who missed out on qualifying for Beijing due to injury?\n\nWhat about Rosie Fordham, the cross-country skier pushing new boundaries for Australians in what is one of the most competitive competitions around?\n\nHow about Daisy Thomas, whose Olympic dream was almost over before it started after suffering an injury in November?\n\nAnd then there's Madison Hoffman, who qualified for Beijing only to rupture her ACL in the weeks leading up to competition and miss out as a result?\n\nSuccess is not just measured in medals, with a multitude of storylines from athletes across the sporting spectrum set to light up the Games.",
        "source": "ABC"
    },
    {
        "url": "https://www.smh.com.au/property/news/young-couple-outbid-downsizers-for-2-3m-inner-west-home-20260206-p5o04e.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Young couple outbid downsizers for $2.3m inner west home",
        "publish_date": "Sat, 07 Feb 2026 13:32:05 +1100",
        "category": "finance",
        "authors": [
            "Robyn Willis"
        ],
        "text": "A young couple with plans to marry outbid a downsizing couple, paying $2,303,000 for a three-bedroom home in Burwood on Saturday.\n\nThe property at 17A Gloucester Avenue, had a price guide of $1.8 million but eventually sold $453,000 above the reserve of $1.85 million. It last sold in 1997 for $330,000.\n\nThere is no legal requirement for a vendor’s reserve to be in line with their property’s price guide.\n\nThe opening bid was $1.8 million and there were six active bidders.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/nsw/divorce-season-the-surge-in-couples-separating-after-the-holidays-20260203-p5nz3u.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘Divorce season’: The surge in couples separating after the holidays",
        "publish_date": "Sat, 07 Feb 2026 13:30:00 +1100",
        "category": "finance",
        "authors": [
            "Michaela Whitbourn"
        ],
        "text": "Advertisement\n\nExclusive NationalNSWDivorce ‘Divorce season’: The surge in couples separating after the holidays Michaela Whitbourn February 7, 2026 — 1:30pm Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share A A A\n\nLawyers are reporting a surge in requests for advice about separation and divorce after the summer holidays, as couples emerge from extended periods together resolving to part ways. Jodylee Bartal, an accredited specialist in family law and a principal solicitor at Melbourne firm KHQ Lawyers, said she typically observed a “spike” in requests for advice about divorce in December, “just before Christmas, and in January”. Requests for advice about separation and divorce increase after summer, lawyers say. Monique Westermann This year, the trend ramped up. Bartal said new client enquiries in family law matters in January more than tripled the December figure. One new client had received a “rather unexpected letter from her ex’s lawyer on December 24 and needed urgent advice about property, parenting and child support matters”, she said.\n\n\n\nAdvertisement\n\nAnother client had agreed with his wife that their marriage was at an end and to separate under the same roof but to “delay telling the kids”. “It ‘blew up’ over the holidays,” Bartal said. Related Article Sex & relationships More baggage, fewer expectations: How Gen X is redefining love in midlife “People get to the end of the calendar year and think about what they want to bring into the new year. “Financial pressures are often a trigger for conflict. There is also the stress of managing the care of kids over the almost seven-week break and work commitments.” Bartal said that “for the more complex financial matters, such as where there are businesses involved, December and January makes sense from a financial reporting point of view”.\n\nAdvertisement\n\n“Fourth-quarter financials are in, [and] six months of data gives a pretty good indication of the likely end of financial year results. “The parties think, sometimes optimistically, they have six months to negotiate an in-principle agreement and ‘close out’ their financial relationship by the end of financial year.” She said couples or individuals thinking about separating from their partner needed to consider issues such as strategies for separating safely, whether they “should move out or is it better to stay in the house”, and interim financial and parenting arrangements. Under Australian family law, couples must have been separated for at least 12 months before they can apply for a divorce. It is possible to be separated while living under the same roof, but there may be safety and other considerations. Court filings\n\nAdvertisement\n\nThe increase in requests for advice about divorce in the New Year is not reflected in court filings in January due to the lag between starting the separation process and filing an application for divorce in the Federal Circuit and Family Court. Court registries and law firms also shut down in late December to early January. A monthly breakdown of divorce applications filed between 2021 and January, supplied by the Federal Circuit and Family Court, reveals applications for divorce have been relatively steady in January over the past six years. This year, 3381 applications were filed, compared with 3449 last year. The 2021-25 figures show divorce applications increased each February compared with the previous month. Last year, applications peaked in July and August, at 4345 and 4272 respectively, and decreased towards the end of the year, ending with 3265 in December.\n\nAdvertisement\n\n‘Divorce season’ Hayder Shkara, principal of Justice Family Lawyers, said: “What makes January different is not that relationships suddenly fail, but that people finally feel able, emotionally and practically, to act on decisions they’ve been sitting with for some time. “While there isn’t a single official dataset that labels January as ‘divorce season,’ there is a well-recognised and consistent trend across the family law sector that enquiries ... spike in the first quarter of the year, particularly in January and February.” Hayder said that “in the last week of January, our office was contacted by a parent who had stayed in an unhappy relationship through Christmas so their children could enjoy the holidays”. “Within days of school returning, they moved out of the family home and urgently sought advice because there were no agreed arrangements in place for the children.\n\nAdvertisement\n\n“January was the point where living in limbo became unworkable and the need for formal advice became immediate.” Michael Tiyce, principal of Sydney law firm Tiyce & Lawyers, said his firm often saw “peaks in enquiry after long periods of time that people have spent together”, such as after school holidays and when COVID lockdowns were lifted. Tiyce said “underlying tensions and issues come to a head when people are spending more time together”. “Often people are consuming more alcohol, and sometimes other substances, which can lead to frayed tempers,” he said. “In other cases, people simply come to the realisation that they have had enough and that it is time to bring the relationship to a close.”\n\nAdvertisement\n\nRelated Article Sunday Life Do you need a midlife coach? The professionals helping to answer life’s big questions Tiyce said that “while we always provide people with details for therapy or counselling, which some take up and others choose not to, following these sorts of periods we make a point of ensuring that people are clear that they are making a final decision”. “It should not be a decision made simply out of exhaustion caused by changed routines or environments. “This is particularly important given the significant impact such a decision will have on their own lives, as well as on the lives of their spouse or partner and any children involved.” An application for divorce must be filed in court. Other issues between the parties such as parenting arrangements and property division can be settled outside court.\n\nAdvertisement\n\n“If couples do decide to separate,” Tiyce said, “they should expect to receive very clear advice from their family lawyer that the matter should be negotiated and, where possible, resolved through negotiation or mediation. “It is now very unusual for parties to simply proceed directly to the Family Court. There are rules governing why that cannot or should not occur, but as a matter of practicality, the cost – both financial and emotional – and the level of stress and conflict involved in litigation are so great that people should do everything they reasonably can to avoid it.”",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/environment/weather/when-the-mercury-soars-these-local-pools-prove-the-place-to-stay-cool-20260205-p5nzvh.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "When the mercury soars, these local pools prove the place to stay cool",
        "publish_date": "Sat, 07 Feb 2026 13:30:00 +1100",
        "category": "finance",
        "authors": [
            "Angus Thomson",
            "Kate Geraghty"
        ],
        "text": "Joyce and Gordon Newton left Sydney 20 years ago for a new life in Gulargambone, a quiet farming town 100 kilometres north of Dubbo. They might never leave.\n\n“We love it,” Joyce says. “It’s the peace, the quiet, the open space, the fresh air … [and] the pool means a lot.”\n\nJoyce Newton enters the pool with friend Kay O’Dell for their daily early morning swim. Kate Geraghty\n\nMost mornings, Joyce and a group of half a dozen women descend upon Gulargambone’s Alan Walker Memorial Baths to swim laps and catch up on what’s been happening in town.\n\nThe sign welcoming visitors to Gulargambone (pronounced “Goolaa-gam-bone” but known as Gular to locals) says 503 people live here, but Newton says it is fewer these days. The town lost its cypress mill in the 2000s and, when the workers moved away to find other jobs, so did their families.\n\n“A lot of the women are widows, and it’s their time that they spend with other people, instead of being home alone all day long,” Joyce says. “We just enjoy each other’s company and do whatever exercise we need to do.”\n\nJust as Sydney flocks to its beaches and ocean baths, the public swimming pool sits at the heart of regional towns like Gulargambone. The Herald’s chief photographer, Kate Geraghty, has spent the summer travelling to these pools, documenting the daily routines of the people who rely on them for exercise, social connection and relief from the brutal summer heat.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/lifestyle/health-and-wellness/ozempic-neck-is-the-latest-side-effect-of-glp-1s-it-s-a-symptom-of-something-uglier-20260206-p5o058.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘Ozempic neck’ is the latest ‘side effect’ of GLP-1s. It’s a symptom of something uglier",
        "publish_date": "Sat, 07 Feb 2026 13:30:00 +1100",
        "category": "lifestyle",
        "authors": [
            "Hannah Vanderheide"
        ],
        "text": "Advertisement\n\nFebruary 7, 2026 — 1:30pm Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share A A A\n\nThe first time I read the words “Ozempic face” I clicked, genuinely alarmed by the implication that this class of drug might be disfiguring its users. I was relieved to find nothing pointing to actual harm, especially given how many people in my immediate circle had started taking it. But the relief was short-lived. “Ozempic neck” is not a medical issue. Getty Images As the months rolled on, my feeds filled with articles, TikToks and Instagram posts with disparaging descriptions of facial changes resulting from the use of GLP-1s; a class of drug originally developed to treat type 2 diabetes, now also prescribed for weight management. Words like “sagging”, “hollow”, and “deflated” suddenly dominated the discourse around the drugs. And the “concerns” seemed to be migrating south, as “Ozempic neck” entered the chat, along with mention of “Ozempic arms” and “Ozempic butt” popping up in mainstream reporting. Conversations about aesthetic changes linked to GLP-1 medications have been growing online since the term “Ozempic face” entered the lexicon around early 2023, finding a comfortable home in a TikTok ecosystem where Ozempic-related content has amassed hundreds of millions of views. Unsurprisingly, much of the chatter comes from the pages of cosmetic surgeons offering expensive and invasive procedures as a “fix”.\n\nAdvertisement\n\nBut what doesn’t seem to be catching on is the fact that these changes are not, strictly speaking, a medical side effect, or a formal diagnosis. They’re a purely aesthetic observation – one that is by no means unique to taking GLP-1 medication. Related Article Medicine ‘Not for human consumption’: Warning to Australians injecting bootlegged weight-loss drug Phrases like “Ozempic neck”, or “Ozempic face” might imply an air of medical legitimacy, but they’re media buzzwords working to draw conversation away from anything medical and back to the real heart of the issue – physical attractiveness. These biting critiques really give away the game for those who purport to be concerned only about the health of those taking the drugs for weight loss. I would suggest that gawking at those whose bodies are changing rapidly on the drugs does nothing to improve their health. And absurd as this nomadic “concern” might be, it shows the speed at which we’re careening ever closer to a world where a person’s appearance is all that matters. Singling out Ozempic also implies the drug is uniquely “disfiguring”, which is inaccurate. Looser skin, facial volume loss, and changes to the neck can happen with any significant or rapid weight loss, and in some cases, the natural ageing process. But that doesn’t matter when the point is to frame bodily changes as failures, and to reinforce the idea that people in bigger bodies MUST lose weight, but not too fast! And certainly not in a way that shows.\n\nAdvertisement\n\nUnfortunately, this is nothing new. It’s something people living in marginalised bodies have been dealing with forever, repackaged for the algorithm age: concern-trolling dressed up as clinical concern. And given these online spaces thrive on a combination of impossible beauty standards and body scrutiny (at least 500,000 Aussies are taking GLP-1s and climbing), we will no doubt have a new body part to nitpick within the month. Related Article Weight loss Game changing weight-loss drugs need to be taken for life, or health benefits are lost To be clear, this is not some new brand of stigma now targeting thin bodies. It’s an extension of the stigma that people in bigger bodies face in almost every corner of our culture. What we’re seeing now is a kind of unapologetic admission that we really, truly don’t give a rat’s furry behind about the health of people in larger bodies; we care about the way they look. Indeed, if your body is deemed “unhealthy” due to its size, we offer a barrage of stigma and shame with a few “helpful” weight loss suggestions thrown in. If you lose weight quickly with medication or otherwise, we go about scrutinising your face, neck, arms and butt for “damage”. And perhaps most galling (and least surprising) is the pace at which clinics and specialists are jumping to offer fixes ... for a price. You might call it concern. You might call it a side effect. But in the end, it’s the same worn out permission slip to condemn fat bodies, with a checkout link attached.\n\nAdvertisement\n\nChanging bodies remain season for public scrutiny, and when drastic weight changes are involved, cruelty becomes acceptable, even marketable. Let’s be honest. That’s not “concern for health”, is it? It’s punishment for losing weight the “wrong” way. Hannah Vanderheide is a freelance health writer and an actor. Get a weekly wrap of views that will challenge, champion and inform your own. Sign up for our Opinion newsletter.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/victoria/it-s-getting-pretty-dire-disasters-leave-communities-stranded-without-phone-service-20260204-p5nzm2.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘It’s getting pretty dire’: Disasters leave communities stranded without phone service",
        "publish_date": "Sat, 07 Feb 2026 13:00:00 +1100",
        "category": "finance",
        "authors": [
            "Benjamin Preiss"
        ],
        "text": "Advertisement\n\nNationalVictoriaElectricity ‘It’s getting pretty dire’: Disasters leave communities stranded without phone service Benjamin Preiss February 7, 2026 — 1:00pm Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share A A A\n\nFrom the boundary fence of her dairy farm in western Victoria, Janet Rogerson can see a scorched treeline from bushfires on the horizon of a neighbouring property. The charred trees are a reminder that the Carlisle River fires, although not currently a threat, are still burning in the Otways and could pose a danger to nearby communities if conditions take a turn for the worse. But Rogerson’s worries about safety extend far beyond the flames. Janet Rogerson on her farm just outside of Simpson in western Victoria. Nicole Cleary During electricity outages, Rogerson routinely loses mobile coverage, as do many other residents in the small town of Simpson and its surrounds. It is a problem plaguing regional and rural communities across Victoria.\n\nAdvertisement\n\nDuring the catastrophic fire danger day on January 9, Rogerson, who is a Telstra customer, said she lost mobile service. She was unable to make calls or access data to check the Vic Emergency app. “My elderly dad was trying to ring me to find out what was happening with the fires,” she said. “He couldn’t get through to me.” Rogerson said she lost Telstra network coverage a second time later in the month. Mobile towers in the town of Simpson. Nicole Cleary “They’re happy to take our premium payments but not so happy to help us out when we need them in an emergency, which is very disappointing,” she said.\n\nAdvertisement\n\nFellow Simpson resident and community centre co-ordinator Debra Smith became so fed up with the regular mobile network outages that she eventually took it to the top and emailed Telstra’s chief executive, Vicki Brady. “And I still got nowhere,” Smith said. Simpson is served by Telstra and Optus towers. During Telstra outages, customers can supposedly access coverage on the Optus tower. But that only allows SOS calls, not data. Debra Smith is raising the alarm about mobile network failures. Nicole Cleary When the Telstra network fails and customers are not within range of an Optus tower, Smith says they lose mobile connection altogether. It means they cannot call Triple Zero or notify authorities in the case of a car accident or other emergencies.\n\nAdvertisement\n\n“It could be life-threatening,” Smith said. Smith noticed the problem was getting worse in 2019 and has made numerous attempts to work with Telstra to rectify the issue. “The bulk of people in this area are with Telstra because it does have superior coverage out here,” she said. RMIT electronics and telecommunications engineering associate professor Mark Gregory agrees the regular mobile coverage failures are a serious and worsening problem. “We’re seeing more events like fires, floods and heat, and we’ve got more outages occurring,” he said.\n\nAdvertisement\n\nGregory said other links in the telecommunications chain were also problematic, including telephone exchanges. He argued that regulations governing when telecommunications companies must keep customers and the public notified about major and significant local outages were too weak. The Australian Communications and Media Authority defines a major outage as one that affects or is likely to affect 100,000 or more services or all carriage services using the network in a state or territory and is expected to last at least 60 minutes. It defines a significant local outage as one that affects 250 or more services in remote Australia and is expected to last at least three hours. A significant local outage is also one affecting at least 1000 services in regional Australia and is expected to last six or more hours. Gregory said telecommunications companies should have to report all outages so they were held accountable.\n\nAdvertisement\n\n“All outages are important,” he said. “It doesn’t matter if it’s big or small – people can’t call Triple Zero.” The Carlisle River fire has caused extensive damage and is still burning. Justin McManus In the north Victorian town of Euroa, power outages resulting in mobile phone coverage losses are an ongoing problem. Euroa Chamber of Business and Commerce president Stephanie Swift said regular mobile outages were dangerous and disrupted the town’s ability to trade, particularly for retailers. “It’s getting pretty dire here,” she said. A Telstra spokesperson said the company understood the importance of telecommunications during the recent bushfires that had affected Simpson and Euroa.\n\nAdvertisement\n\n“When fires like this occur, power outages and extreme heat are the main causes of network interruptions, with some infrastructure also being damaged due to the conditions,” the spokesperson said. Firefighters putting out spot fires on the Colac-Lavers Hill road. Nearby residents are concerned the fire danger is still not over. Justin McManus They said Telstra had back-up power systems at most sites and some key locations had fixed generators. The company said that in the recent fires, restoration efforts were hampered by blocked roads and safety exclusion zones that impeded access to damaged infrastructure. The federal government has introduced legislation to establish the Universal Outdoor Mobile Obligation, which will require network operators to provide outdoor mobile voice and text coverage nationwide. A federal government spokesperson said the obligation would be achieved partly through “satellite direct-to-device technology”. It is set to commence in December next year.\n\nAdvertisement\n\nMobile network failures are a common occurrence in Simpson. Nicole Cleary But Victorian Liberal MP Richard Riordan, whose Polwarth electorate covers south-west Victoria, said phone towers across high-risk fire zones must be upgraded to have battery and diesel generator back-up. “Our community is now highly reliant on mobile and internet connection for safety, work and home use,” he said. “City communities would not tolerate prolonged outages, and nor do regional communities.” He said communities in the Otways could have tens of thousands of visitors from cities and overseas travelling through high-danger flood and fire areas, and they relied on mobile communications for safety. A spokeswoman for Powercor, which covers south-west Victoria, said the company’s crews worked quickly to restore electricity during extreme weather events, but critical infrastructure providers were encouraged to have their own power supply.\n\nAdvertisement\n\nJanet Rogerson says locals are now hoping for rain. Nicole Cleary Janet Rogerson said many people in her community were still on edge with fires burning nearby and the prospect of more hot weather. “Summer’s not over yet,” she said. In the absence of reliable mobile coverage, Rogerson said only one thing would bring relief to many exhausted people in her community. That’s rain and plenty of it. Start the day with a summary of the day’s most important and interesting stories, analysis and insights. Sign up for our Morning Edition newsletter.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/queensland/how-maori-expats-are-keeping-their-culture-alive-in-brisbane-20260203-p5nz8v.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "How Maori expats are keeping their culture alive in Brisbane",
        "publish_date": "Sat, 07 Feb 2026 12:30:00 +1100",
        "category": "finance",
        "authors": [
            "Brittney Deguara"
        ],
        "text": "Advertisement\n\nNationalQueenslandCity life How Maori expats are keeping their culture alive in Brisbane Brittney Deguara February 7, 2026 — 12:30pm Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share A A A\n\nTangaroa Hau-Hadfield has a simple rule for his three kids: when they’re in the car, they can only speak Te Reo Maori. “Whether it’s a five-minute trip, a 20-minute trip, a two-hour trip, sometimes it makes the trip nice and quiet,” he says, laughing. It’s just one way he’s working to keep the language and te ao Maori (Maori culture) alive in his Brisbane household. Brisbane-based father-of-three Tangaroa Hau-Hadfield has one rule in the car: the kids can only speak Te Reo Maori. Brittney Deguara “[We’re] grateful to be able to practise our culture here in another country because it’s a lost culture, a lost language, and so it’s our responsibility to get that back for us and for our kids.”\n\nAdvertisement\n\nLike many of the almost 10,000 Kiwis who moved to Queensland in the last financial year, Hau-Hadfield came across the Tasman Sea in search of a better lifestyle. He left Hokianga in Aotearoa/New Zealand’s far north over a decade ago to work in Australia’s mining industry. He then met his wife, and they welcomed three tamariki (children). However, it took him five years to find his Brisbane whanau (family). That emerged as the competitive kapa haka group Te Kapa Haka o Te Kahu Ariki, based in Eagleby. “We always say we’re more than a kapa haka group, it’s more so a family – we know what makes each other tick, what makes each other happy,” he says.\n\nAdvertisement\n\n“This time last year, my partner and I were talking about moving back to New Zealand, and the only real thing that kept us here was our kapa haka group. That’s the commitment and the ties that we have to these people, and I’m happy that we chose to stay.” The group formed in Brisbane three years ago to “keep our culture alive”, said leader Andre Ahipene. Te Kahu Ariki are busy preparing for the upcoming 10th Australian Maori Kapa Haka Festival. Te Kahu Ariki “When one practises who they truly are through tradition and through culture, you become closer to the land in which you live on,” he said. “It’s a lifestyle. “We’re very fortunate and privileged that our mana whenua – the people of this land, our Indigenous peoples – really support our consistency and being able to practise who we are.”\n\nAdvertisement\n\nCo-leader Gaylene Ahipene added: “To have someone [who] understands you, to speak the same language, to think the same thoughts … it helps us really stay connected, not only to ourselves but to one another, and in this world that we live in, it helps us be very grounded.” The couple moved to Brisbane almost two decades ago to “have a break” from their world. But just days after they arrived, they found themselves doing haka. Gaylene and Andre Ahipene are the head tutors and founders of Te Kahu Ariki, a Brisbane-based kapa haka group. Te Kahu Ariki “It was inevitable that haka was never going to let us get away from who we truly are. This is truly ... a lifestyle. We would not be as healthy, as well, and as vibrant as we are – fit and able – if we didn’t have haka in our life. I think we would seize up,” Andre said. “Haka has been our oranga, our fountain of youth, and the spring in our step in life.”\n\nAdvertisement\n\nThe group is in the thick of rehearsals for the upcoming 10th Australian Maori Kapa Haka Festival, taking place on the Gold Coast at the end of March. They will be one of nine groups vying for the chance to compete in the largest traditional Maori performing arts celebration in the world, Te Matatini 2027 in Waikato. Te Kahu Ariki are one of nine Australian kapa haka groups competing in this year’s event on the Gold Coast. Te Kahu Ariki “That would be life-changing, especially for our members as well, they’ve worked so hard here, but to actually go home and stand on your own whenua [land], to perform with your own people, it just takes it that whole other step higher,” Gaylene said during a Sunday rehearsal. “That would be our kapa, our members, our ropu [group] retracing their ancestral steps home,” Andre added.\n\nAdvertisement\n\nLarge-scale opportunities like this for Maori living in Brisbane to connect are rare. Andre hopes developmental conferences and language retreats will become more frequent, as many Maori come to Queensland for better employment opportunities and to “get ahead in life”. “What I believe would mobilise us extremely would be opportunities to come together and unite, so our people can consistently find us,” he said. But for Hau-Hadfield and the Ahipenes, the continuation of te ao Maori in Brisbane is for their children. “They just come in the space and they’re sponges, they pick things up just as fast as we do – or probably even faster,” Hau-Hadfield explained. “[We’ve] had our four children here, it’s evolution – we’re evolving with the time, and we’re just bringing our babies along,” Gaylene said. Start the day with a summary of the day’s most important and interesting stories, analysis and insights. Sign up for our Morning Edition newsletter.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/carey-s-lip-syncing-allegations-bocelli-s-chill-inducing-aria-memorable-moments-from-milano-cortina-2026-s-opening-ceremony-20260206-p5o094.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Carey’s lip-syncing allegations, Bocelli’s chill-inducing aria: Memorable moments from Milano Cortina 2026’s opening ceremony",
        "publish_date": "Sat, 07 Feb 2026 12:21:43 +1100",
        "category": "sports",
        "authors": [
            "Bronte Gossling"
        ],
        "text": "For Italy’s Winter Olympics, Paris 2024’s opening ceremony was always going to be a hard act to follow. The French organisers had not one, but two, internationally renowned divas on hand to make the most of one of the world’s most photogenic cities.\n\nViewers had almost no time to recover from Lady Gaga’s cabaret performance on the banks of the Seine before Céline Dion was hoisted up on the Eiffel Tower for an emotional rendition of Édith Piaf’s Hymne à l’amour. Adding to the drama was the songstress’ surprise live performance being her first after sharing her stiff-person syndrome diagnosis two years prior.\n\nBut if anyone was going to match that level of flair, it was the Italians. The fact Milano Cortina 2026 is the most spread-out Winter Olympics in history – competition venues dot an area of more than 22,000 square kilometres – was no handicap to organisers, who turned lemons into Limoncello by treating the four-site opening ceremony as an opportunity to make it compelling for those watching at home.\n\nThere were hints ahead of time that they would deliver. After all, only someone with their finger on the pulse would understand the best way to court the Gen Z audience – who presents a challenge for the International Olympic Committee in how they consume sporting content less than half as much as entertainment content – is to tap fictional gay Canadian ice hockey players to be torchbearers (Heated Rivalry hive, rise).",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/aussie-withdraws-from-event-after-shock-ski-fall-20260207-p5o0bu.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Aussie withdraws from event after shock ski fall",
        "publish_date": "Sat, 07 Feb 2026 12:10:58 +1100",
        "category": "sports",
        "authors": [],
        "text": "Aussie withdraws from event after shock ski fall\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/victoria/the-age-photos-of-the-week-february-7-2026-20260207-p5o0bl.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "The Age photos of the week, February 7, 2026",
        "publish_date": "Sat, 07 Feb 2026 11:59:15 +1100",
        "category": "finance",
        "authors": [
            "Danie Sprague"
        ],
        "text": "1 / 27\n\nAnnabelle Cleeland and her five-year-old daughter Quinn (c) with Lou Webb (l) and her children Tom and Fred, 3, and George, 6, and Felicity Jeffrey and her children Jemima,6, Sebastien,4 and Claudio,1, stand in the burnt out Jeffrey property in Whiteheads Creek. All three families homes were decimated by the Longwood fire in early January and now the kids are looking to head back to school. A number of schools and kindergartens in the Seymour area are either closed, have had delayed starts impacted by the bushfires. Credit:Chris Hopkins",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/milano-cortina-2026-opens-with-a-bang-20260207-p5o0c2.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Milano Cortina 2026 opens with a bang",
        "publish_date": "Sat, 07 Feb 2026 11:22:55 +1100",
        "category": "finance",
        "authors": [],
        "text": "Milano Cortina 2026 opens with a bang\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/woman-dead-following-collision-in-melbourne-s-north-20260207-p5o0c0.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Woman dead following collision in Melbourne’s north",
        "publish_date": "Sat, 07 Feb 2026 11:16:34 +1100",
        "category": "finance",
        "authors": [],
        "text": "Remove items from your saved list to add more.\n\nYou have reached your maximum number of saved items.\n\nSave this video for later\n\nAdd videos to your saved list and come back to them anytime.\n\nGot it",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/perth-bushfires-downgraded-to-watch-and-act-20260207-p5o0bz.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Perth bushfires downgraded to watch and act",
        "publish_date": "Sat, 07 Feb 2026 11:14:32 +1100",
        "category": "finance",
        "authors": [],
        "text": "Perth bushfires downgraded to watch and act\n\nA bushfire on the outskirts of Perth has been downgraded to a watch and act level after burning through 27-hectares and power lines yesterday.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/renewed-bid-to-crack-down-on-dangerous-e-bike-behaviour-20260207-p5o0by.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Renewed bid to crack down on dangerous e-bike behaviour",
        "publish_date": "Sat, 07 Feb 2026 11:11:51 +1100",
        "category": "finance",
        "authors": [],
        "text": "Remove items from your saved list to add more.\n\nYou have reached your maximum number of saved items.\n\nSave this video for later\n\nAdd videos to your saved list and come back to them anytime.\n\nGot it",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/three-people-dead-following-plane-crash-off-sas-south-coast-20260207-p5o0bw.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Three people dead following plane crash off SA's south coast",
        "publish_date": "Sat, 07 Feb 2026 11:10:19 +1100",
        "category": "finance",
        "authors": [],
        "text": "Remove items from your saved list to add more.\n\nYou have reached your maximum number of saved items.\n\nSave this video for later\n\nAdd videos to your saved list and come back to them anytime.\n\nGot it",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/flame-lit-on-milano-cortina-20260207-p5o0bv.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Flame lit on Milano Cortina",
        "publish_date": "Sat, 07 Feb 2026 11:03:42 +1100",
        "category": "finance",
        "authors": [],
        "text": "Flame lit on Milano Cortina\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.sbs.com.au/news/article/in-pictures-milan-cortina-2026-winter-olympics-opening-ceremony/2tl518ldk",
        "title": "In pictures: Twin flames and message of unity open Milano Cortina Winter Olympics",
        "publish_date": "Sat, 7 Feb 2026 00:18:21 +0000",
        "category": "sports",
        "authors": [],
        "text": "Australian flag bearers Jakara Anthony and Matt Graham have led a small but enthusiastic team in the Milano Cortina Winter Olympics, with the parade of athletes split over four locations.\n\nIn an Olympic first, the main ceremony was held at the San Siro Stadium in Milan while athletes marched at different clusters across Italy. With competition venues dotting an area of about 22,000km it will be the most spread-out Games in Winter Olympics history.\n\nThe largest Australian contingent was in Livigno, some 250km from Milan in the Italian alps, where Olympic moguls medallists Anthony and Graham led a 23-strong team that included other freestyle skiers, as well as the team's snowboarders.\n\nFive ice skaters were marching in Milan, 10 sliders and alpine skiers in Cortina and only two in Predazzo, with Australia's female cross-country quartet skipping the ceremony to prepare for the skiathlon on Saturday (local time).\n\nWearing traditional green with gold beanies, Anthony and Graham rallied the troops with a traditional \"Aussie, Aussie, Aussie, oi oi oi,\" before setting off.\n\nIn another shift, the Olympic flame was lit in two cauldrons with former Italian champion skiers Deborah Compagnoni and Alberto Tomba given the honour in Milan and current alpine star Sofia Goggia, who will for compete Italy next week, lighting the cauldron in Cortina, 400km away.\n\nItalian torchbearers Deborah Compagnoni and Alberto Tomba light the Olympic cauldron in Milan. Source: Getty / Jamie Squire\n\nDuring the two-hour long ceremony American songstress Mariah Carey delivered the iconic Volare in Italian, there was a tribute to famous composers like Giuseppe Verdi and the late design king Giorgio Armani at the main stadium.\n\nTenor Andrea Bocelli wowed the 61,000 ticket-holders in Milan, while Italian pop singer Laura Pausini performed the Italian national anthem before Italian President Sergio Mattarella formally opened the 25th Winter Olympics.\n\nMattarella was introduced in a video suggesting he was arriving at San Siro by a tram driven by Italian motorcycle legend Valentino Rossi.\n\nAmerican singer Mariah Carey hit performed \"Nel Blu Dipinto Di Blu\" aka \"Volare\" to kick off the the 25th Winter Olympics. Source: Getty / Andreas Rentz\n\nInternational Olympic Committee (IOC) president Kirsty Coventry, overseeing her first Games since succeeding Thomas Bach last year, told the athletes to \"enjoy every second\".\n\n\"You'll show us what it means to be human. To dream. To overcome. To respect one another. To care for each other. You'll show us that strength isn't just about winning — it's about courage, empathy and heart,\" she said.\n\n\"Thank you for believing in the magic of the Olympic Games. The spirit of the Olympic Games is about so much more than sport.\n\n\"Let these Games be a celebration of what unites us — of everything that makes us human. This is the magic of the Olympic Games: inspiring us all to be the best that we can be — together.\"\n\nREAD MORE Your Milano Cortina 2026 Winter Olympics guide: Aussie athletes and how to watch\n\nThe Games bring together around 2,900 athletes from 92 countries who will compete for 116 gold medals. They are in first Games in Italy since Torino 2006.\n\nAfter Vancouver (2010) and Sochi (2014), Asia hosted the last two Olympics in Pyeongchang (2018) and Beijing (2022).\n\nSBS News has compiled some of the best photographs from the opening ceremony.\n\nIn pictures: Milano Cortina Winter Olympics opening ceremony\n\nFlagbearers Matt Graham and Jakara Anthony led the Australian contingent. Source: AAP / Dan Himbrechts\n\n93 countries are competing at this year's Games. Credit: Matthew Stockman/Getty Images\n\nMilan-born rapper Ghali performs Promemoria (Memorandum) by Gianni Rodari during the ceremony. Source: Getty / Sarah Stier\n\nPerformers form into the shape of the Milky Way. Source: Getty / Matthias Hangst\n\nPerformers form into the shape of the Milky Way. Source: Getty / Matthew Stockman\n\nItalian mezzo-soprano Cecelia Bartoli performing. Source: Getty / Alexander Hassenstein\n\nItalian actress Sabrina Impacciatore with performers on stage. Source: Getty / David Davies\n\nAn outside view of the San Siro stadium in Milan. Source: Getty / Alessandro Levati\n\nLaura Mattarella, (left) the first lady of Italy, Sergio Mattarella, (centre) the President of Italy, and Kirsty Coventry, president of the IOC, watching on. Source: Getty / Andreas Rentz\n\nHow to watch the Milano Cortina Winter Olympic Games from Australia\n\nYou can watch the Games on the Nine Network, its streaming service Nine Now or on Stan Sport.\n\nThe opening ceremony will be on Friday 6 February at 8pm (local time) — so 6am Saturday, AEDT.\n\nThe closing ceremony will be held on Sunday 22 February (Saturday 23 February AEDT).\n\nYou can view the full schedule of the Games' events here.\n\nFor the latest from SBS News, download our app and subscribe to our newsletter.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/interview-sbs-talks-to-milduras-mayor-on-managing-heatwaves-and-overcoming-climate-change-scepticism/2f65oth3c",
        "title": "INTERVIEW: SBS talks to Mildura's mayor on managing heatwaves, and overcoming climate change scepticism",
        "publish_date": "Fri, 6 Feb 2026 22:04:17 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/how-does-where-you-live-in-australia-affect-your-income/zc6kzm5iq",
        "title": "Do you earn more or less than others working in the same job?",
        "publish_date": "Fri, 6 Feb 2026 19:36:47 +0000",
        "category": "finance",
        "authors": [],
        "text": "The average wage in Australia is $1,611.10 a week, but this figure can change dramatically depending on where you live, your sex and occupation.\n\nEmployee Earnings and Hours data released by the Australian Bureau of Statistics on 23 January reveals which workers are the most highly paid and how wages vary by state.\n\nThe business survey was conducted in May last year and is completed every two years. The average wage figure includes people working part-time and full-time, as well as those in managerial roles.\n\nExcluding part-time workers and managerial staff — who have strategic responsibilities or oversee a significant number of employees — the survey found the average weekly wage for a full-time worker in Australia is $2,061 before tax.\n\nThe state with the highest average wage is the Australian Capital Territory (ACT), where full-time workers earn an average of $2,206 a week. This drops to $1,784 in Tasmania.\n\nWhen you exclude high-level managerial staff, workers in WA have the highest average wages for full-time adult employees in Australia.\n\nThe data also shows which Australian workers are earning more or less based on their industry and gender.\n\nMen employed in the mining industry are on average the highest-earning full-time workers, bringing home $3,319 a week.\n\nThe most highly paid women in the country are also those working in mining, earning an average of $2,750 a week.\n\nMen and women working in the mining industry earn on average the highest wages in Australia.\n\nThe most highly paid workers\n\nThat picture changes slightly when you look at specific occupations.\n\nThe highest-paid occupations in Australia — based on average weekly earnings for all employees — are anaesthetists, who earn $5,366 on average before tax, followed by surgeons on $4,159 and engineering managers on $3,939.\n\nAnaesthetists are the highest-paid workers in Australia based on average weekly earnings for all employees. Source: SBS News\n\nAverage wage data can be skewed by a few exceptionally high earners whose income can push the average higher. It's also important to note that these figures include part-time workers, who earn considerably less than full-time workers.\n\nThe data can also be broken down by gender, but there are some limitations to this, as it is not available for every occupation (anaesthetists are not included, for example).\n\nOf the occupations that do provide a breakdown, among women, the highest earners are engineering managers, who earn an average weekly wage of $3,818, and surgeons, who earn $3,752. They are followed by \"commissioned officers (management)\" — those employed in high-ranking positions in the defence forces, fire and police services — on $3,605.\n\nEngineering managers are the highest paid women on average. Source: Getty / chain45154\n\nAmong men, \"other medical practitioners\" takes the top spot with an average income of $4,990 a week. This is a category that includes dermatologists, emergency medicine specialists, obstetricians, gynaecologists, ophthalmologists, pathologists and radiologists.\n\nThey are followed by surgeons on $4,486, and commissioned officers (management) on $3,990.\n\nSBS News has created a searchable database, showing average wages for specific occupations. The figures include both part-time and full-time workers. Enter your occupation below to explore.\n\nGender pay gap is closing\n\nWhile average weekly earnings for different occupations appear to show a stark difference in what men and women are being paid, ABS head of labour statistics Sean Crick says comparing hourly pay is more useful when looking at the gender pay gap because women are more likely to work part-time than men.\n\nAcross all professions, men earned $50 an hour on average, while women earned $46.\n\nThe gender pay gap in May 2025 was 8.4 per cent, a 0.5 percentage point improvement on the figure two years prior, when it was 8.9 per cent.\n\nHow wages change depending on your state and age\n\nIncluding part-time workers, the ABS survey found those employed in the ACT have the highest average wage, earning $1,821 a week before tax.\n\nThose aged 45 to 54 in the ACT are the most highly paid age group in Australia, earning on average $2,456 a week, while those aged 20 years and younger in the territory are the fourth lowest earners, bringing home $497 on average.\n\nTasmania is the state or territory with the lowest average wage overall, with employees earning around $1,389 a week.\n\nBut the demographic with the lowest average wage in the country is South Australians aged 20 years and younger, who are paid around $464 per week.\n\nWorkers in the ACT are the highest paid employees in Australia. Source: SBS News\n\nNon-managerial staff exclude high-level managers with strategic responsibilities or who oversee a significant number of employees. Source: SBS News\n\nIt can also be helpful to look at median wages when seeking to understand what a typical Australian earns. The median wage is the middle value in a list of incomes ranging from lowest to highest — so half of all people earn more than that figure, and half earn less.\n\nIn Australia, the median wage is $1,436 a week — $1,674 for men and $1,250 for women. This includes both full and part-time workers.\n\nYou can find out more information about where your wages sits compared to others in the interactive below, which has been based on data from the latest ABS release on Characteristics of Employment, August 2025.\n\nInteractive design by Ken Macleod\n\nFor the latest from SBS News, download our app and subscribe to our newsletter.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/asx200s-worst-day-since-april-2025-as-technology-rout-continues/53xb4haxx",
        "title": "ASX200's worst day since April 2025 as technology rout continues",
        "publish_date": "Fri, 6 Feb 2026 07:03:36 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/impossible-choices-the-data-that-proves-living-costs-are-rising-for-australians/smm4voks8",
        "title": "'Impossible choices': The data that proves living costs are rising for Australians",
        "publish_date": "Fri, 6 Feb 2026 05:06:31 +0000",
        "category": "finance",
        "authors": [],
        "text": "If things feel like they're getting more expensive, that's because they are.\n\nNew data from the Australian Bureau of Statistics (ABS) shows living costs rose for all household types in the year to the December 2025 quarter, with annual increases ranging from 2.3 per cent to 4.2 per cent.\n\nThe rises were driven largely by higher housing and food costs — two of the biggest and least avoidable expenses in household budgets — as well as recreation and culture.\n\nThe ABS living cost indexes track changes in households' out-of-pocket expenses, offering a clearer picture of how rising costs are felt day to day.\n\nIt comes as a major food charity warns that this week's interest rate rise will push people who are already struggling even further into financial hardship.\n\nWhich households were hit hardest?\n\nThose relying primarily on government payments — including pensioner and beneficiary households — recorded the largest rise in living costs over the year, with living costs rising by 4.1 to 4.2 per cent.\n\nThat was driven in part by higher electricity prices as state-based rebates in Queensland and Western Australia were used up.\n\nEmployee households — where wages and salaries are the main source of income — recorded the smallest annual rise in living costs, up 2.3 per cent.\n\nThose on government payments — particularly pensioners — have seen the greatest cost-of-living increase, according to new data from the Australian Bureau of Statistics. Source: SBS News\n\nThe ABS said this group benefited most from earlier falls in mortgage interest charges, which make up a larger share of their spending than for other household types.\n\nLast year, the Reserve Bank of Australia cut rates in February, March and August.\n\nThis week, the RBA lifted the cash rate to 3.85 per cent — its first hike in more than two years — raising concerns that housing costs could once again climb, particularly for mortgage holders and renters.\n\nWhat's driving higher living costs?\n\nOver the year, housing, food and non-alcoholic beverages, recreation and culture remained the biggest contributors to rising costs.\n\nHousing costs rose sharply, led by a 21.5 per cent jump in electricity prices as state-based rebates were wound back. Rents rose 3.9 per cent, while new dwelling costs increased 3 per cent.\n\nFood prices increased 3.5 per cent, reflecting higher grocery and eating-out costs.\n\nMeat and seafood rose 4.4 per cent, with particularly steep increases for beef and veal (+10.8 per cent) and lamb and goat (+13.4 per cent). Fruit and vegetable prices were up 4 per cent, affected by extreme rainfall in Queensland.\n\nHousing saw the greatest price increase over the last year with a 5.5 per cent rise. Source: SBS News\n\nRecreation and culture costs also climbed, driven by higher travel prices. Holiday travel and accommodation rose 5.8 per cent, with domestic travel up 9.6 per cent and international travel and accommodation jumping 24.4 per cent.\n\nBut compared to the September 2025 quarter, the rise in living costs across all household types slowed.\n\n\"This quarter, lower electricity and health costs offset rises in other areas of living costs,\" ABS head of prices statistics Michelle Marquardt said.\n\nShe noted Commonwealth Energy Bill Relief Fund payments and falling medical costs helped reduce out-of-pocket expenses for some households during the quarter.\n\nInterest rate rises to 'squeeze' households further, warns charity\n\nStill, some warn that cost of living pressures are already pushing households into crisis — and that this week's interest rate rise could make things worse.\n\nFood relief charity OzHarvest says it is struggling to keep up with demand amid growing food insecurity.\n\n\"This is a national emergency hiding in plain sight,\" OzHarvest founder Ronni Kahn AO told SBS News.\n\n\"Charities are stretched beyond their limits, as the gap between demand and resources keeps widening.\"\n\nKahn said it was the toughest conditions the organisation had seen and expected pressures to intensify following the Reserve Bank's latest rate hike.\n\n\"Rising rents, repeated moves, and unstable living situations are already putting enormous pressure on families,\" she said. \"This week's interest rate rise will only squeeze household budgets further.\"\n\n\"Many are already facing impossible choices between paying rent and putting food on the table. With costs continuing to climb, even the basics — like a meal for your children — can become a daily struggle.\"\n\nThe Australian Council of Social Service (ACOSS) said people on the lowest incomes were bearing the brunt of rising costs, with many forced to go without essentials.\n\n\"The cost of living crisis shows no sign of easing for people on the lowest incomes,\" ACOSS CEO Cassandra Goldie told SBS News.\n\n\"Our surveys show that people receiving income support are being forced to skip meals, go without critical medication or sleep in their cars because payments are woefully inadequate.\"\n\nGoldie said the high cost of everyday items was driving widespread deprivation, particularly among single parents and First Nations people.\n\n\"People receiving JobSeeker are 14 times more likely to lack a substantial meal at least once a day,\" she said, adding they were also significantly more likely to lack access to necessities such as a mobile phone, internet or a washing machine.\n\n\"JobSeeker is just 42 per cent of the minimum wage. We know minimum wage workers are doing it tough, but people who lose their job must try and survive on an income less than half of that.\"\n\nFor the latest from SBS News, download our app and subscribe to our newsletter.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/pressure-mounts-on-keir-starmer-to-resign-over-epstein-scandal/4b8ujahuh",
        "title": "Pressure mounts on Keir Starmer to resign over Epstein scandal",
        "publish_date": "Fri, 6 Feb 2026 03:31:43 +0000",
        "category": "finance",
        "authors": [],
        "text": "Listen to Australian and world news and follow trending topics with SBS News Podcasts.\n\nTRANSCRIPT\n\nUK Prime Minister Keir Starmer is battling for his political future, as the fallout grows in the wake of last week's Epstein files release.\n\nThe latest crisis to hit Starmer's government follows scrutiny over his appointment of Peter Mandelson as US ambassador in 2024, when Mr Mandelson's ties to the late sex offender Jeffrey Epstein were already known.\n\nMr Starmer has apologised to Epstein's victims in a public address over the matter.\n\n\"I am sorry. Sorry for what was done to you. Sorry that so many people with power failed you. Sorry for having believed Mandelson's lies and appointed him. And sorry that even now, you're forced to watch this story unfold in public once again.\"\n\nMr Starmer confirmed on Thursday he was aware that ties between Mr Mandelson and Epstein had endured despite Epstein's 2008 conviction in the US for soliciting a minor.\n\nBut he claims Mr Mandelson repeatedly lied about the depth of his relationship with the disgraced financier, both before and after he was appointed as ambassador.\n\n\"Mandelson was asked directly about the nature of his relationship with Epstein. He was asked whether he had stayed at Epstein after his conviction. And when, later, further information came to light, he was asked whether he had accepted gifts and hospitality, about whether he had been fully transparent about the relationship. The information now available makes clear that the answers he gave were lies.\"\n\nFollowing an earlier release of files relating to Epstein in September last year, Mr Starmer fired the former UK minister after he had served only seven months as ambassador.\n\nThe September release revealed Mr Mandelson had remained close to Epstein for much longer than he had previously acknowledged.\n\nThe ex-envoy is one of numerous prominent figures in the spotlight again this week, after the latest release of documents by the US Justice Department.\n\nThe files included emails appearing to show just how close the relationship between the former ambassador and Epstein was, and also suggested Mr Mandelson had shared government documents with Epstein while serving as a Cabinet Minister.\n\nDuring a cabinet meeting on Wednesday, Starmer attempted to distance himself from Mr Mandelson, calling the alleged leaks to Epstein 'disgraceful'.\n\n\"To learn that there was a Cabinet Minister leaking sensitive information at the height of the response to the 2008 crash is beyond infuriating, and I am as angry as the public and any member of this House. Mandelson betrayed our country, our Parliament and my party.\"\n\nThe latest release has raised doubts about Mr Starmer's judgement and left some questioning if he can remain prime minister.\n\nOpposition leader Kemi Badenoch [[bade-knock]]on Thursday described Starmer's position as \"clearly untenable\".\n\nShe urged Labour MPs to support calls to hold a no-confidence vote in Mr Starmer in parliament — where Labour has a comfortable majority.\n\n\"It is now up to Labour MPs to do the right thing. I know there are many of them who are horrified by what has happened. We saw that in the House of Commons just yesterday. They might now expect the Prime Minister to take responsibility, but we know he won't. He will have to be dragged out of Number 10.\"\n\nFacing questions about whether he could remain in power, Mr Starmer said he intended to continue doing what he described as his \"vital work\" as prime minister.\n\nLocal media are speculating this latest release could see the end of Mr Starmer's leadership, while Londoners have expressed mixed views over his political future.\n\n\"I feel that Starmer probably made the best choice at the time, but obviously information has come out since then and the rest will be up to the politicians around him, I suspect.\"\n\n\"As a whole, Labour has sort of lost a lot of trust, especially with all of the little problems which keep adding up and then scandal upon scandal, like with the Rachel Reeves thing as well, it's sort of, yeah, adding up to the point where I do feel, I don't know how soon, but maybe he'll have to go.\"\n\nMr Mandelson has not publicly commented on the latest release, but the saga has prompted his resignation from parliament's House of Lords earlier this week.\n\nFor decades he's been a divisive figure in British politics, having twice resigned from government for alleged misconduct.\n\nAfter the latest revelations, the 72 year old is now the subject of a police investigation into claims of misconduct in a public office which — if charged and convicted — could lead to a prison term.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/melbourne-median-strip-grass-dispute/i77zne9ot",
        "title": "Turf war: Why this median strip conflict is being compared to the division of Korea",
        "publish_date": "Fri, 6 Feb 2026 00:56:19 +0000",
        "category": "finance",
        "authors": [],
        "text": "They say the grass isn't always greener on the other side — but on Victoria Parade in Melbourne's inner city, it quite literally is.\n\nA tram line runs down the centre of Victoria Parade. On one side of the tracks, in East Melbourne, the grass is green and neatly managed by the City of Melbourne, one of Victoria's wealthiest councils.\n\nOn the other side, in Fitzroy, the median strip is dry, overgrown and unmowed.\n\nThat strip has become the centre of a growing dispute between local and state government over who is responsible for maintaining the road — and a fresh flashpoint in broader criticism of the Victorian Labor government, led by Premier Jacinta Allan.\n\nDivided road, divided responsibilities\n\nWhile Victoria Parade and its median strip are state-managed assets, the City of Yarra — which the road runs through — has refused to continue footing the bill for maintenance, arguing the responsibility sits squarely with the state government.\n\nCity of Yarra mayor Stephen Jolly has likened the stalemate to a geopolitical stand-off.\n\n\"Either we give in and spend hundreds of thousands of dollars of ratepayers' money doing Jacinta Allan's job or we keep pressuring them to actually do their job,\" Jolly told radio station 3AW recently.\n\nThe City of Yarra has refused to mow a median strip on a major Melbourne arterial road, saying it's \"being bled\" by the state government not maintaining assets it is responsible for. Source: SBS News / Zacharias Szumer\n\nAs a form of protest, the City of Yarra stopped mowing the Victoria Parade median strip, saying it has not received additional funding to cover the work.\n\n\"It is embarrassing. It's like North and South Korea kind of thing. That's where we are at the moment.\"\n\nJolly has argued the dispute is part of a broader pattern of \"cost shifting\" from the state government, which he says is costing local councils close to $24 million.\n\nOpposition seizes on grass dispute\n\nVictorian Opposition leader Jess Wilson has seized on the dispute, releasing a social media video on the weekend showing Opposition MPs mowing part of the median strip.\n\n\"This is the grass the Labor Government can't afford to mow,\" Wilson says in the video. \"It seems Jacinta Allan can't do her job, so we're here to do it for her.\"\n\nThe video shows several members of the Opposition wearing high-visibility vests and protective eyewear, claiming the job took \"only thirty minutes\".\n\nWhen SBS News visited Victoria Parade on Monday, it appeared a small section of the median strip had been mowed.\n\nAsked about the issue at a press conference on Monday, Transport and Infrastructure Minister Gabrielle Williams said the Opposition's weekend grass cutting was a \"stunt\".\n\n\"I think it’s fair to say the Liberal party is embracing stunts as they head into an election year,\" Williams said. \"It is a slight sidestep from their usual practice of fighting with each other either through the courts or through the media.\"\n\nSBS News has contacted Premier Jacinta Allan's office for comment.\n\nCost-shifting a 'major concern'\n\nCost-shifting refers to situations where one level of government transfers responsibility for services or infrastructure to another — often without providing enough funding to cover the cost.\n\nA spokesperson for the Australian Local Government Association (ALGA) said it was an issue of \"major concern for councils\".\n\n\"Every new Commonwealth policy or strategy has cost implications for other levels of government — most of which local governments aren’t compensated for,\" ALGA told SBS News.\n\nIt says the practice is challenging the long-term financial sustainability of councils in Australia.\n\n\"Cost-shifting is having a real effect on communities across Australia. Every service shifted to local government without compensation reduces the services the council can provide.\"\n\nLocal Government NSW's latest cost-shifting report revealed a total cost shift to councils of $1.36 billion in 2021-22, equivalent to more than $460 per ratepayer annually.\n\nIn Queensland, that figure amounted to $360 million in 2021-22 — a 378 per cent increase from $47 million in 2002.\n\n\"The impact of this cost-shifting isn’t academic. Cuts to councils are cuts to community liveability,\" the ALGA said.\n\n\"Every service shifted to local government means that people miss out because funding, policies and legislation from federal and state governments haven't kept pace with the needs of every local community.\"\n\n'Being bled', says local council\n\nThe City of Yarra has pointed to other major arterial roads within its boundaries — including Bridge Rd, Alexandra Pde, Burnley St and Hoddle St — which it says also require maintenance from the state government.\n\nThat last one was mowed last week \"at last\" by the state government, Jolly said.\n\nJolly has also said the council has been forced to pick up responsibility for services such as school crossing supervision and needle collection near a safe injecting room — tasks he argues should be funded by the state.\n\n\"We're being bled,\" he said.\n\nIn late 2023, the City of Yarra stopped monthly maintenance on state-managed roads after receiving $88,000 from the state government for work it says costs more than $1 million a year, according to The Age newspaper.\n\nThe City of Melbourne maintains its side of the median strip under an agreement with VicRoads and the Department of Transport and Planning.\n\nA spokesperson for the City of Yarra told SBS News that the City of Melbourne has a revenue and budget surplus \"three times the size of ours\".\n\nAcross Victoria, responsibility for road maintenance is split between different levels of government. The Department of Transport and Planning manages about 11 per cent of the road network, largely freeways and major arterial roads, while the Department of Energy, Environment and Climate Action and Parks Victoria are responsible for a further 28 per cent, mostly roads through parks and forests.\n\nLocal councils manage around 60 per cent, primarily local roads.\n\nFor the latest from SBS News, download our app and subscribe to our newsletter.",
        "source": "SBS"
    },
    {
        "url": "https://www.theage.com.au/property/news/young-couple-outbid-downsizers-for-2-3m-inner-west-home-20260206-p5o04e.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Young couple outbid downsizers for $2.3m inner west home",
        "publish_date": "Sat, 07 Feb 2026 13:32:05 +1100",
        "category": "finance",
        "authors": [
            "Robyn Willis"
        ],
        "text": "A young couple with plans to marry outbid a downsizing couple, paying $2,303,000 for a three-bedroom home in Burwood on Saturday.\n\nThe property at 17A Gloucester Avenue, had a price guide of $1.8 million but eventually sold $453,000 above the reserve of $1.85 million. It last sold in 1997 for $330,000.\n\nThere is no legal requirement for a vendor’s reserve to be in line with their property’s price guide.\n\nThe opening bid was $1.8 million and there were six active bidders.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/nsw/divorce-season-the-surge-in-couples-separating-after-the-holidays-20260203-p5nz3u.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘Divorce season’: The surge in couples separating after the holidays",
        "publish_date": "Sat, 07 Feb 2026 13:30:00 +1100",
        "category": "finance",
        "authors": [
            "Michaela Whitbourn"
        ],
        "text": "Advertisement\n\nExclusive NationalNSWDivorce ‘Divorce season’: The surge in couples separating after the holidays Michaela Whitbourn February 7, 2026 — 1:30pm Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share A A A\n\nLawyers are reporting a surge in requests for advice about separation and divorce after the summer holidays, as couples emerge from extended periods together resolving to part ways. Jodylee Bartal, an accredited specialist in family law and a principal solicitor at Melbourne firm KHQ Lawyers, said she typically observed a “spike” in requests for advice about divorce in December, “just before Christmas, and in January”. Requests for advice about separation and divorce increase after summer, lawyers say. Monique Westermann This year, the trend ramped up. Bartal said new client enquiries in family law matters in January more than tripled the December figure. One new client had received a “rather unexpected letter from her ex’s lawyer on December 24 and needed urgent advice about property, parenting and child support matters”, she said.\n\n\n\nAdvertisement\n\nAnother client had agreed with his wife that their marriage was at an end and to separate under the same roof but to “delay telling the kids”. “It ‘blew up’ over the holidays,” Bartal said. Related Article Sex & relationships More baggage, fewer expectations: How Gen X is redefining love in midlife “People get to the end of the calendar year and think about what they want to bring into the new year. “Financial pressures are often a trigger for conflict. There is also the stress of managing the care of kids over the almost seven-week break and work commitments.” Bartal said that “for the more complex financial matters, such as where there are businesses involved, December and January makes sense from a financial reporting point of view”.\n\nAdvertisement\n\n“Fourth-quarter financials are in, [and] six months of data gives a pretty good indication of the likely end of financial year results. “The parties think, sometimes optimistically, they have six months to negotiate an in-principle agreement and ‘close out’ their financial relationship by the end of financial year.” She said couples or individuals thinking about separating from their partner needed to consider issues such as strategies for separating safely, whether they “should move out or is it better to stay in the house”, and interim financial and parenting arrangements. Under Australian family law, couples must have been separated for at least 12 months before they can apply for a divorce. It is possible to be separated while living under the same roof, but there may be safety and other considerations. Court filings\n\nAdvertisement\n\nThe increase in requests for advice about divorce in the New Year is not reflected in court filings in January due to the lag between starting the separation process and filing an application for divorce in the Federal Circuit and Family Court. Court registries and law firms also shut down in late December to early January. A monthly breakdown of divorce applications filed between 2021 and January, supplied by the Federal Circuit and Family Court, reveals applications for divorce have been relatively steady in January over the past six years. This year, 3381 applications were filed, compared with 3449 last year. The 2021-25 figures show divorce applications increased each February compared with the previous month. Last year, applications peaked in July and August, at 4345 and 4272 respectively, and decreased towards the end of the year, ending with 3265 in December.\n\nAdvertisement\n\n‘Divorce season’ Hayder Shkara, principal of Justice Family Lawyers, said: “What makes January different is not that relationships suddenly fail, but that people finally feel able, emotionally and practically, to act on decisions they’ve been sitting with for some time. “While there isn’t a single official dataset that labels January as ‘divorce season,’ there is a well-recognised and consistent trend across the family law sector that enquiries ... spike in the first quarter of the year, particularly in January and February.” Hayder said that “in the last week of January, our office was contacted by a parent who had stayed in an unhappy relationship through Christmas so their children could enjoy the holidays”. “Within days of school returning, they moved out of the family home and urgently sought advice because there were no agreed arrangements in place for the children.\n\nAdvertisement\n\n“January was the point where living in limbo became unworkable and the need for formal advice became immediate.” Michael Tiyce, principal of Sydney law firm Tiyce & Lawyers, said his firm often saw “peaks in enquiry after long periods of time that people have spent together”, such as after school holidays and when COVID lockdowns were lifted. Tiyce said “underlying tensions and issues come to a head when people are spending more time together”. “Often people are consuming more alcohol, and sometimes other substances, which can lead to frayed tempers,” he said. “In other cases, people simply come to the realisation that they have had enough and that it is time to bring the relationship to a close.”\n\nAdvertisement\n\nRelated Article Sunday Life Do you need a midlife coach? The professionals helping to answer life’s big questions Tiyce said that “while we always provide people with details for therapy or counselling, which some take up and others choose not to, following these sorts of periods we make a point of ensuring that people are clear that they are making a final decision”. “It should not be a decision made simply out of exhaustion caused by changed routines or environments. “This is particularly important given the significant impact such a decision will have on their own lives, as well as on the lives of their spouse or partner and any children involved.” An application for divorce must be filed in court. Other issues between the parties such as parenting arrangements and property division can be settled outside court.\n\nAdvertisement\n\n“If couples do decide to separate,” Tiyce said, “they should expect to receive very clear advice from their family lawyer that the matter should be negotiated and, where possible, resolved through negotiation or mediation. “It is now very unusual for parties to simply proceed directly to the Family Court. There are rules governing why that cannot or should not occur, but as a matter of practicality, the cost – both financial and emotional – and the level of stress and conflict involved in litigation are so great that people should do everything they reasonably can to avoid it.”",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/environment/weather/when-the-mercury-soars-these-local-pools-prove-the-place-to-stay-cool-20260205-p5nzvh.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "When the mercury soars, these local pools prove the place to stay cool",
        "publish_date": "Sat, 07 Feb 2026 13:30:00 +1100",
        "category": "finance",
        "authors": [
            "Angus Thomson",
            "Kate Geraghty"
        ],
        "text": "Joyce and Gordon Newton left Sydney 20 years ago for a new life in Gulargambone, a quiet farming town 100 kilometres north of Dubbo. They might never leave.\n\n“We love it,” Joyce says. “It’s the peace, the quiet, the open space, the fresh air … [and] the pool means a lot.”\n\nJoyce Newton enters the pool with friend Kay O’Dell for their daily early morning swim. Kate Geraghty\n\nMost mornings, Joyce and a group of half a dozen women descend upon Gulargambone’s Alan Walker Memorial Baths to swim laps and catch up on what’s been happening in town.\n\nThe sign welcoming visitors to Gulargambone (pronounced “Goolaa-gam-bone” but known as Gular to locals) says 503 people live here, but Newton says it is fewer these days. The town lost its cypress mill in the 2000s and, when the workers moved away to find other jobs, so did their families.\n\n“A lot of the women are widows, and it’s their time that they spend with other people, instead of being home alone all day long,” Joyce says. “We just enjoy each other’s company and do whatever exercise we need to do.”\n\nJust as Sydney flocks to its beaches and ocean baths, the public swimming pool sits at the heart of regional towns like Gulargambone. The Herald’s chief photographer, Kate Geraghty, has spent the summer travelling to these pools, documenting the daily routines of the people who rely on them for exercise, social connection and relief from the brutal summer heat.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/lifestyle/health-and-wellness/ozempic-neck-is-the-latest-side-effect-of-glp-1s-it-s-a-symptom-of-something-uglier-20260206-p5o058.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘Ozempic neck’ is the latest ‘side effect’ of GLP-1s. It’s a symptom of something uglier",
        "publish_date": "Sat, 07 Feb 2026 13:30:00 +1100",
        "category": "lifestyle",
        "authors": [
            "Hannah Vanderheide"
        ],
        "text": "Advertisement\n\nFebruary 7, 2026 — 1:30pm Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share A A A\n\nThe first time I read the words “Ozempic face” I clicked, genuinely alarmed by the implication that this class of drug might be disfiguring its users. I was relieved to find nothing pointing to actual harm, especially given how many people in my immediate circle had started taking it. But the relief was short-lived. “Ozempic neck” is not a medical issue. Getty Images As the months rolled on, my feeds filled with articles, TikToks and Instagram posts with disparaging descriptions of facial changes resulting from the use of GLP-1s; a class of drug originally developed to treat type 2 diabetes, now also prescribed for weight management. Words like “sagging”, “hollow”, and “deflated” suddenly dominated the discourse around the drugs. And the “concerns” seemed to be migrating south, as “Ozempic neck” entered the chat, along with mention of “Ozempic arms” and “Ozempic butt” popping up in mainstream reporting. Conversations about aesthetic changes linked to GLP-1 medications have been growing online since the term “Ozempic face” entered the lexicon around early 2023, finding a comfortable home in a TikTok ecosystem where Ozempic-related content has amassed hundreds of millions of views. Unsurprisingly, much of the chatter comes from the pages of cosmetic surgeons offering expensive and invasive procedures as a “fix”.\n\nAdvertisement\n\nBut what doesn’t seem to be catching on is the fact that these changes are not, strictly speaking, a medical side effect, or a formal diagnosis. They’re a purely aesthetic observation – one that is by no means unique to taking GLP-1 medication. Related Article Medicine ‘Not for human consumption’: Warning to Australians injecting bootlegged weight-loss drug Phrases like “Ozempic neck”, or “Ozempic face” might imply an air of medical legitimacy, but they’re media buzzwords working to draw conversation away from anything medical and back to the real heart of the issue – physical attractiveness. These biting critiques really give away the game for those who purport to be concerned only about the health of those taking the drugs for weight loss. I would suggest that gawking at those whose bodies are changing rapidly on the drugs does nothing to improve their health. And absurd as this nomadic “concern” might be, it shows the speed at which we’re careening ever closer to a world where a person’s appearance is all that matters. Singling out Ozempic also implies the drug is uniquely “disfiguring”, which is inaccurate. Looser skin, facial volume loss, and changes to the neck can happen with any significant or rapid weight loss, and in some cases, the natural ageing process. But that doesn’t matter when the point is to frame bodily changes as failures, and to reinforce the idea that people in bigger bodies MUST lose weight, but not too fast! And certainly not in a way that shows.\n\nAdvertisement\n\nUnfortunately, this is nothing new. It’s something people living in marginalised bodies have been dealing with forever, repackaged for the algorithm age: concern-trolling dressed up as clinical concern. And given these online spaces thrive on a combination of impossible beauty standards and body scrutiny (at least 500,000 Aussies are taking GLP-1s and climbing), we will no doubt have a new body part to nitpick within the month. Related Article Weight loss Game changing weight-loss drugs need to be taken for life, or health benefits are lost To be clear, this is not some new brand of stigma now targeting thin bodies. It’s an extension of the stigma that people in bigger bodies face in almost every corner of our culture. What we’re seeing now is a kind of unapologetic admission that we really, truly don’t give a rat’s furry behind about the health of people in larger bodies; we care about the way they look. Indeed, if your body is deemed “unhealthy” due to its size, we offer a barrage of stigma and shame with a few “helpful” weight loss suggestions thrown in. If you lose weight quickly with medication or otherwise, we go about scrutinising your face, neck, arms and butt for “damage”. And perhaps most galling (and least surprising) is the pace at which clinics and specialists are jumping to offer fixes ... for a price. You might call it concern. You might call it a side effect. But in the end, it’s the same worn out permission slip to condemn fat bodies, with a checkout link attached.\n\nAdvertisement\n\nChanging bodies remain season for public scrutiny, and when drastic weight changes are involved, cruelty becomes acceptable, even marketable. Let’s be honest. That’s not “concern for health”, is it? It’s punishment for losing weight the “wrong” way. Hannah Vanderheide is a freelance health writer and an actor. Get a weekly wrap of views that will challenge, champion and inform your own. Sign up for our Opinion newsletter.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/victoria/it-s-getting-pretty-dire-disasters-leave-communities-stranded-without-phone-service-20260204-p5nzm2.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘It’s getting pretty dire’: Disasters leave communities stranded without phone service",
        "publish_date": "Sat, 07 Feb 2026 13:00:00 +1100",
        "category": "finance",
        "authors": [
            "Benjamin Preiss"
        ],
        "text": "Advertisement\n\nNationalVictoriaElectricity ‘It’s getting pretty dire’: Disasters leave communities stranded without phone service Benjamin Preiss February 7, 2026 — 1:00pm Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share A A A\n\nFrom the boundary fence of her dairy farm in western Victoria, Janet Rogerson can see a scorched treeline from bushfires on the horizon of a neighbouring property. The charred trees are a reminder that the Carlisle River fires, although not currently a threat, are still burning in the Otways and could pose a danger to nearby communities if conditions take a turn for the worse. But Rogerson’s worries about safety extend far beyond the flames. Janet Rogerson on her farm just outside of Simpson in western Victoria. Nicole Cleary During electricity outages, Rogerson routinely loses mobile coverage, as do many other residents in the small town of Simpson and its surrounds. It is a problem plaguing regional and rural communities across Victoria.\n\nAdvertisement\n\nDuring the catastrophic fire danger day on January 9, Rogerson, who is a Telstra customer, said she lost mobile service. She was unable to make calls or access data to check the Vic Emergency app. “My elderly dad was trying to ring me to find out what was happening with the fires,” she said. “He couldn’t get through to me.” Rogerson said she lost Telstra network coverage a second time later in the month. Mobile towers in the town of Simpson. Nicole Cleary “They’re happy to take our premium payments but not so happy to help us out when we need them in an emergency, which is very disappointing,” she said.\n\nAdvertisement\n\nFellow Simpson resident and community centre co-ordinator Debra Smith became so fed up with the regular mobile network outages that she eventually took it to the top and emailed Telstra’s chief executive, Vicki Brady. “And I still got nowhere,” Smith said. Simpson is served by Telstra and Optus towers. During Telstra outages, customers can supposedly access coverage on the Optus tower. But that only allows SOS calls, not data. Debra Smith is raising the alarm about mobile network failures. Nicole Cleary When the Telstra network fails and customers are not within range of an Optus tower, Smith says they lose mobile connection altogether. It means they cannot call Triple Zero or notify authorities in the case of a car accident or other emergencies.\n\nAdvertisement\n\n“It could be life-threatening,” Smith said. Smith noticed the problem was getting worse in 2019 and has made numerous attempts to work with Telstra to rectify the issue. “The bulk of people in this area are with Telstra because it does have superior coverage out here,” she said. RMIT electronics and telecommunications engineering associate professor Mark Gregory agrees the regular mobile coverage failures are a serious and worsening problem. “We’re seeing more events like fires, floods and heat, and we’ve got more outages occurring,” he said.\n\nAdvertisement\n\nGregory said other links in the telecommunications chain were also problematic, including telephone exchanges. He argued that regulations governing when telecommunications companies must keep customers and the public notified about major and significant local outages were too weak. The Australian Communications and Media Authority defines a major outage as one that affects or is likely to affect 100,000 or more services or all carriage services using the network in a state or territory and is expected to last at least 60 minutes. It defines a significant local outage as one that affects 250 or more services in remote Australia and is expected to last at least three hours. A significant local outage is also one affecting at least 1000 services in regional Australia and is expected to last six or more hours. Gregory said telecommunications companies should have to report all outages so they were held accountable.\n\nAdvertisement\n\n“All outages are important,” he said. “It doesn’t matter if it’s big or small – people can’t call Triple Zero.” The Carlisle River fire has caused extensive damage and is still burning. Justin McManus In the north Victorian town of Euroa, power outages resulting in mobile phone coverage losses are an ongoing problem. Euroa Chamber of Business and Commerce president Stephanie Swift said regular mobile outages were dangerous and disrupted the town’s ability to trade, particularly for retailers. “It’s getting pretty dire here,” she said. A Telstra spokesperson said the company understood the importance of telecommunications during the recent bushfires that had affected Simpson and Euroa.\n\nAdvertisement\n\n“When fires like this occur, power outages and extreme heat are the main causes of network interruptions, with some infrastructure also being damaged due to the conditions,” the spokesperson said. Firefighters putting out spot fires on the Colac-Lavers Hill road. Nearby residents are concerned the fire danger is still not over. Justin McManus They said Telstra had back-up power systems at most sites and some key locations had fixed generators. The company said that in the recent fires, restoration efforts were hampered by blocked roads and safety exclusion zones that impeded access to damaged infrastructure. The federal government has introduced legislation to establish the Universal Outdoor Mobile Obligation, which will require network operators to provide outdoor mobile voice and text coverage nationwide. A federal government spokesperson said the obligation would be achieved partly through “satellite direct-to-device technology”. It is set to commence in December next year.\n\nAdvertisement\n\nMobile network failures are a common occurrence in Simpson. Nicole Cleary But Victorian Liberal MP Richard Riordan, whose Polwarth electorate covers south-west Victoria, said phone towers across high-risk fire zones must be upgraded to have battery and diesel generator back-up. “Our community is now highly reliant on mobile and internet connection for safety, work and home use,” he said. “City communities would not tolerate prolonged outages, and nor do regional communities.” He said communities in the Otways could have tens of thousands of visitors from cities and overseas travelling through high-danger flood and fire areas, and they relied on mobile communications for safety. A spokeswoman for Powercor, which covers south-west Victoria, said the company’s crews worked quickly to restore electricity during extreme weather events, but critical infrastructure providers were encouraged to have their own power supply.\n\nAdvertisement\n\nJanet Rogerson says locals are now hoping for rain. Nicole Cleary Janet Rogerson said many people in her community were still on edge with fires burning nearby and the prospect of more hot weather. “Summer’s not over yet,” she said. In the absence of reliable mobile coverage, Rogerson said only one thing would bring relief to many exhausted people in her community. That’s rain and plenty of it. Start the day with a summary of the day’s most important and interesting stories, analysis and insights. Sign up for our Morning Edition newsletter.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/queensland/how-maori-expats-are-keeping-their-culture-alive-in-brisbane-20260203-p5nz8v.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "How Maori expats are keeping their culture alive in Brisbane",
        "publish_date": "Sat, 07 Feb 2026 12:30:00 +1100",
        "category": "finance",
        "authors": [
            "Brittney Deguara"
        ],
        "text": "Advertisement\n\nNationalQueenslandCity life How Maori expats are keeping their culture alive in Brisbane Brittney Deguara February 7, 2026 — 12:30pm Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share A A A\n\nTangaroa Hau-Hadfield has a simple rule for his three kids: when they’re in the car, they can only speak Te Reo Maori. “Whether it’s a five-minute trip, a 20-minute trip, a two-hour trip, sometimes it makes the trip nice and quiet,” he says, laughing. It’s just one way he’s working to keep the language and te ao Maori (Maori culture) alive in his Brisbane household. Brisbane-based father-of-three Tangaroa Hau-Hadfield has one rule in the car: the kids can only speak Te Reo Maori. Brittney Deguara “[We’re] grateful to be able to practise our culture here in another country because it’s a lost culture, a lost language, and so it’s our responsibility to get that back for us and for our kids.”\n\nAdvertisement\n\nLike many of the almost 10,000 Kiwis who moved to Queensland in the last financial year, Hau-Hadfield came across the Tasman Sea in search of a better lifestyle. He left Hokianga in Aotearoa/New Zealand’s far north over a decade ago to work in Australia’s mining industry. He then met his wife, and they welcomed three tamariki (children). However, it took him five years to find his Brisbane whanau (family). That emerged as the competitive kapa haka group Te Kapa Haka o Te Kahu Ariki, based in Eagleby. “We always say we’re more than a kapa haka group, it’s more so a family – we know what makes each other tick, what makes each other happy,” he says.\n\nAdvertisement\n\n“This time last year, my partner and I were talking about moving back to New Zealand, and the only real thing that kept us here was our kapa haka group. That’s the commitment and the ties that we have to these people, and I’m happy that we chose to stay.” The group formed in Brisbane three years ago to “keep our culture alive”, said leader Andre Ahipene. Te Kahu Ariki are busy preparing for the upcoming 10th Australian Maori Kapa Haka Festival. Te Kahu Ariki “When one practises who they truly are through tradition and through culture, you become closer to the land in which you live on,” he said. “It’s a lifestyle. “We’re very fortunate and privileged that our mana whenua – the people of this land, our Indigenous peoples – really support our consistency and being able to practise who we are.”\n\nAdvertisement\n\nCo-leader Gaylene Ahipene added: “To have someone [who] understands you, to speak the same language, to think the same thoughts … it helps us really stay connected, not only to ourselves but to one another, and in this world that we live in, it helps us be very grounded.” The couple moved to Brisbane almost two decades ago to “have a break” from their world. But just days after they arrived, they found themselves doing haka. Gaylene and Andre Ahipene are the head tutors and founders of Te Kahu Ariki, a Brisbane-based kapa haka group. Te Kahu Ariki “It was inevitable that haka was never going to let us get away from who we truly are. This is truly ... a lifestyle. We would not be as healthy, as well, and as vibrant as we are – fit and able – if we didn’t have haka in our life. I think we would seize up,” Andre said. “Haka has been our oranga, our fountain of youth, and the spring in our step in life.”\n\nAdvertisement\n\nThe group is in the thick of rehearsals for the upcoming 10th Australian Maori Kapa Haka Festival, taking place on the Gold Coast at the end of March. They will be one of nine groups vying for the chance to compete in the largest traditional Maori performing arts celebration in the world, Te Matatini 2027 in Waikato. Te Kahu Ariki are one of nine Australian kapa haka groups competing in this year’s event on the Gold Coast. Te Kahu Ariki “That would be life-changing, especially for our members as well, they’ve worked so hard here, but to actually go home and stand on your own whenua [land], to perform with your own people, it just takes it that whole other step higher,” Gaylene said during a Sunday rehearsal. “That would be our kapa, our members, our ropu [group] retracing their ancestral steps home,” Andre added.\n\nAdvertisement\n\nLarge-scale opportunities like this for Maori living in Brisbane to connect are rare. Andre hopes developmental conferences and language retreats will become more frequent, as many Maori come to Queensland for better employment opportunities and to “get ahead in life”. “What I believe would mobilise us extremely would be opportunities to come together and unite, so our people can consistently find us,” he said. But for Hau-Hadfield and the Ahipenes, the continuation of te ao Maori in Brisbane is for their children. “They just come in the space and they’re sponges, they pick things up just as fast as we do – or probably even faster,” Hau-Hadfield explained. “[We’ve] had our four children here, it’s evolution – we’re evolving with the time, and we’re just bringing our babies along,” Gaylene said. Start the day with a summary of the day’s most important and interesting stories, analysis and insights. Sign up for our Morning Edition newsletter.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/carey-s-lip-syncing-allegations-bocelli-s-chill-inducing-aria-memorable-moments-from-milano-cortina-2026-s-opening-ceremony-20260206-p5o094.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Carey’s lip-syncing allegations, Bocelli’s chill-inducing aria: Memorable moments from Milano Cortina 2026’s opening ceremony",
        "publish_date": "Sat, 07 Feb 2026 12:21:43 +1100",
        "category": "sports",
        "authors": [
            "Bronte Gossling"
        ],
        "text": "For Italy’s Winter Olympics, Paris 2024’s opening ceremony was always going to be a hard act to follow. The French organisers had not one, but two, internationally renowned divas on hand to make the most of one of the world’s most photogenic cities.\n\nViewers had almost no time to recover from Lady Gaga’s cabaret performance on the banks of the Seine before Céline Dion was hoisted up on the Eiffel Tower for an emotional rendition of Édith Piaf’s Hymne à l’amour. Adding to the drama was the songstress’ surprise live performance being her first after sharing her stiff-person syndrome diagnosis two years prior.\n\nBut if anyone was going to match that level of flair, it was the Italians. The fact Milano Cortina 2026 is the most spread-out Winter Olympics in history – competition venues dot an area of more than 22,000 square kilometres – was no handicap to organisers, who turned lemons into Limoncello by treating the four-site opening ceremony as an opportunity to make it compelling for those watching at home.\n\nThere were hints ahead of time that they would deliver. After all, only someone with their finger on the pulse would understand the best way to court the Gen Z audience – who presents a challenge for the International Olympic Committee in how they consume sporting content less than half as much as entertainment content – is to tap fictional gay Canadian ice hockey players to be torchbearers (Heated Rivalry hive, rise).",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/aussie-withdraws-from-event-after-shock-ski-fall-20260207-p5o0bu.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Aussie withdraws from event after shock ski fall",
        "publish_date": "Sat, 07 Feb 2026 12:10:58 +1100",
        "category": "sports",
        "authors": [],
        "text": "Aussie withdraws from event after shock ski fall\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/victoria/the-age-photos-of-the-week-february-7-2026-20260207-p5o0bl.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "The Age photos of the week, February 7, 2026",
        "publish_date": "Sat, 07 Feb 2026 11:59:15 +1100",
        "category": "finance",
        "authors": [
            "Danie Sprague"
        ],
        "text": "1 / 27\n\nAnnabelle Cleeland and her five-year-old daughter Quinn (c) with Lou Webb (l) and her children Tom and Fred, 3, and George, 6, and Felicity Jeffrey and her children Jemima,6, Sebastien,4 and Claudio,1, stand in the burnt out Jeffrey property in Whiteheads Creek. All three families homes were decimated by the Longwood fire in early January and now the kids are looking to head back to school. A number of schools and kindergartens in the Seymour area are either closed, have had delayed starts impacted by the bushfires. Credit:Chris Hopkins",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/milano-cortina-2026-opens-with-a-bang-20260207-p5o0c2.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Milano Cortina 2026 opens with a bang",
        "publish_date": "Sat, 07 Feb 2026 11:22:55 +1100",
        "category": "finance",
        "authors": [],
        "text": "Milano Cortina 2026 opens with a bang\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/woman-dead-following-collision-in-melbourne-s-north-20260207-p5o0c0.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Woman dead following collision in Melbourne’s north",
        "publish_date": "Sat, 07 Feb 2026 11:16:34 +1100",
        "category": "finance",
        "authors": [],
        "text": "Remove items from your saved list to add more.\n\nYou have reached your maximum number of saved items.\n\nSave this video for later\n\nAdd videos to your saved list and come back to them anytime.\n\nGot it",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/perth-bushfires-downgraded-to-watch-and-act-20260207-p5o0bz.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Perth bushfires downgraded to watch and act",
        "publish_date": "Sat, 07 Feb 2026 11:14:32 +1100",
        "category": "finance",
        "authors": [],
        "text": "Perth bushfires downgraded to watch and act\n\nA bushfire on the outskirts of Perth has been downgraded to a watch and act level after burning through 27-hectares and power lines yesterday.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/renewed-bid-to-crack-down-on-dangerous-e-bike-behaviour-20260207-p5o0by.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Renewed bid to crack down on dangerous e-bike behaviour",
        "publish_date": "Sat, 07 Feb 2026 11:11:51 +1100",
        "category": "finance",
        "authors": [],
        "text": "Remove items from your saved list to add more.\n\nYou have reached your maximum number of saved items.\n\nSave this video for later\n\nAdd videos to your saved list and come back to them anytime.\n\nGot it",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/three-people-dead-following-plane-crash-off-sas-south-coast-20260207-p5o0bw.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Three people dead following plane crash off SA's south coast",
        "publish_date": "Sat, 07 Feb 2026 11:10:19 +1100",
        "category": "finance",
        "authors": [],
        "text": "Remove items from your saved list to add more.\n\nYou have reached your maximum number of saved items.\n\nSave this video for later\n\nAdd videos to your saved list and come back to them anytime.\n\nGot it",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/flame-lit-on-milano-cortina-20260207-p5o0bv.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Flame lit on Milano Cortina",
        "publish_date": "Sat, 07 Feb 2026 11:03:42 +1100",
        "category": "finance",
        "authors": [],
        "text": "Flame lit on Milano Cortina\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    }
]