[
    {
        "url": "https://www.9news.com.au/national/australia-day-2026-trading-hours-whats-open-closed-january-26-state-by-state-guide/f202cad5-6645-4015-9e19-a57f6c4a5890",
        "title": "Your guide to what's open on Australia Day",
        "publish_date": "Sat, 24 Jan 2026 20:22:59 +0000",
        "category": "finance",
        "authors": [
            "Jan"
        ],
        "text": "Australia Day is a national public holiday but retail workers around the country will still be hard at work.\n\nMany stores will remain open on Monday, January 26 but trading hours may change depending on where you live.\n\nHere is your guide to the public holiday trading hours.\n\nREAD MORE: PhD candidate accused of plotting Australia Day terror attack ﻿\n\nAustralia Day is a national public holiday ﻿but many retail workers will still be hard at work. (Getty)\n\nColes﻿\n\nAll Coles stores will be open on ﻿the Australia Day public holiday in Victoria, NSW, Queensland, Western Australia and the Northern Territory.\n\nMost Coles supermarkets will be closed in South Australia except for ﻿Port Lincoln, Port Pirie, Port Augusta, Mount Barker, Adelaide Rundle Place, Whyalla, Murray Bridge Green, Mount Gambier and Victor Harbor.\n\nShoppers in the Australian Capital Territory and Tasmania should check the Coles website as hours may differ on the public holiday.\n\nWoolworths\n\nAll Woolworths stores will be open on Monday, January 26 in NSW, the Australian Capital Territory, Victoria, Queensland, Tasmania and Western Australia.\n\nOnly some stores will be open in South Australia and the Northern Territory.\n\nShoppers in SA and the NT are encouraged to check opening hours for individual stores on the Woolworths website .\n\nAldi﻿\n\nAldi stores in NSW, the Australian Capital Territory, the Northern ﻿Territory, Tasmania and Victoria will be open on Monday, January 26.\n\nStores in Queensland and Western Australia will be open with public holiday hours.\n\nSome stores in South Australia will be closed while other stores will be subject to public holiday hours.﻿\n\nIGA\n\nIGA stores are independently owned and operated, which means opening hours vary.\n\nSome stores will be trading as normal and others will have operate on public holiday hours.\n\nShoppers should check with their local store for individual opening hours.\n\nDepartment stores﻿\n\nMost Kmart, Target and Big W stores across Australia will trade on Australia Day, however some South Australian and regional stores will not be open.﻿\n\n﻿Bunnings Warehouse stores will be open but some Bunnings Trade Centres will be closed over the long weekend.\n\nLiquor stores\n\n﻿Bottle shops will be open in most locations but some will close or trade with different hours.\n\nAll Liquorland stores will be open on ﻿the Australia Day public holiday in Victoria, NSW, the Australian Capital Territory, South Australia, Tasmania and the Northern Territory (except for Alice Springs)﻿.\n\nAll Liquorland stores will be open in Western Australia except for ﻿Secret Harbour, Northgate and Bunbury.\n\nShoppers in Queensland should check with their local store for details as hours may differ on the public holiday.\n\nMany BWS and Dan Murphy's stores will trade with public holiday hours, depending on the location.﻿",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/shark-attack-victim-nico-antic-dies-in-hospital-12-dies-in-hospital/197eb532-ac6e-43ca-8532-29dbaee8c831",
        "title": "Shark attack victim Nico Antic, 12, dies in hospital",
        "publish_date": "Sat, 24 Jan 2026 08:08:33 +0000",
        "category": "lifestyle",
        "authors": [
            "Jan"
        ],
        "text": "Shark attack victim Nico Antic has died in a Sydney hospital.\n\nThe 12-year-old was attacked by a suspected bull shark as he was jumping off a rock face at Neilson Park, near Shark Beach in Vaucluse, on Sunday.\n\nThe boy's friends jumped into the water to pull him to safety, but Nico suffered serious leg wounds and was taken to hospital in a critical condition.\n\nShark attack victim Nico Antic has died in a Sydney hospital. (Supplied)\n\nNico's parents, Lorena and Juan, said in a statement they were \"heartbroken\" to deliver the news of his death.\n\n\"Nico was a happy, friendly, and sporty young boy with the most kind and generous spirit,\" they said.\n\n\"He was always full of life and that's how we'll remember him.\n\n\"We would like to sincerely thank the first responders and the teams at Sydney Children's Hospital, Randwick for everything they did to care for Nico.\n\n\"We would also like to thank everyone in the community for their support and kind messages.\n\nThe 12-year-old is being remembered as a \"happy, friendly and sporty young boy\". (Nine)\n\n\"We ask you please respect our privacy during this exceptionally difficult time.\"\n\nThe 12-year-old's friends have also posted tributes to Nico online, with one posting a bouquet of flowers with the message \"long live Nico\".\n\nString of shark attacks ﻿\n\nNico, a junior lifesaver, was the first of four shark attack victims in 48 hours on NSW beaches this week after last weekend's wild weather.\n\nA surfer, 27-year-old musician Andre De Ruyter, was attacked in the water at a Manly beach on Monday .\n\nHe was pulled to shore by fellow surfers and was taken to hospital in a critical condition, with part of his lower right leg amputated.\n\nHe is now in a stable condition.\n\nHours early at nearby Dee Why Beach, also on the northern beaches, an 11-year-old surfer had his board bitten by a shark.﻿\n\nREAD MORE: Autopsy results give unclear answers as to how Piper James died\n\nAndre De Ruyter was attacked in the water at a Manly beach on Monday. (Supplied)\n\nThe whole stretch of beaches were closed on Monday.\n\nThe next day Paul Zvirzdinas was surfing at Point Plomer, north of Port Macquarie on the NSW Mid North Coast, when a ﻿shark took a bite out of his board and wetsuit at about 10am.\n\nThe 39-year-old said he saw his board shake then paddled to shore .\n\n\"Just paddle as hard as you can,\" he said he recalled thinking.\n\nHe only suffered minor injuries and has since been discharged from hospital.\n\nThis morning a shark sighting at Manly forced the closure of the beach just hours after flags were set up for the day .\n\nPaul Zvirzdinas was attacked by a shark at Point Plomer on the NSW Mid North Coast. (9News)\n\nThe state's recent wet weather, considered a once-in-a-500 year event, has been a perfect storm for bull sharks to lurk in coastal waters around Sydney and the rest of NSW.\n\nHeavy rain means more fresh water than usual is running through rivers and estuaries﻿ into saltwater systems and beaches, creating brackish water.\n\nThis is a phenomenon where fresh and saltwater mix , being saltier than normal freshwater, but less salty than typical seawater.\n\n\"Bull sharks are also one of the few species of sharks and rays that can tolerate brackish and even freshwater for extended periods,\" Professor Jodie Rummer from James Cook University said.\n\n\"Which means they are especially comfortable moving in and out of river mouths and turbid coastal waters after heavy rain.\"",
        "source": "9News"
    },
    {
        "url": "https://www.abc.net.au/news/2026-01-25/queensland-family-trades-cattle-breeding-for-steak-searing/106176382",
        "title": "Family to farewell herd to grow restaurant dream",
        "publish_date": "Sun, 25 Jan 2026 01:29:20 +0000",
        "category": "finance",
        "authors": [],
        "text": "In the emerald-green hills near Yarraman, Bradley Frohloff stands quietly as his cattle move through the grass.\n\nIt's a view he and his wife Jodie have taken in almost every day for 20 years while they've been building their purebred Limousin stud in southern Queensland.\n\nBut this year, that all changes.\n\nThe Frohloffs are selling all their stud cattle — the females offered next month and bulls to follow a few months later.\n\nEvery carefully selected bloodline, offered to new hands.\n\n\"It will be a culmination of 20 years of hard yards,\" Mr Frohloff said.\n\n\" We're pretty emotional guys, so it doesn't take much for the tears to start rolling. \"\n\n\"But it's also an exciting day to see those animals find new homes and see what new breeders can do with them.\"\n\nBradley and Jodie Frohloff have spent more than 20 years building up their Limousin stud. (ABC News: Brandon Long)\n\nWith their three daughters not keen on breeding cattle, the couple knew the next generation wouldn't be taking the reins.\n\n\"We're not getting any younger and the younger generation are not so interested in the stud,\" Mr Frohloff said.\n\n\"It was the logical decision to disperse the stud and concentrate on the other businesses.\"\n\nTheir eldest daughter, Isabelle, 26, said while she respected the work behind the stud, it wasn't something she wanted to pursue.\n\n\"It's a very hard game,\" she said.\n\n\"It's a lot about genetics and just not as interesting for me.\"\n\nFrom stud to steak\n\nDespite what the sale might suggest, retirement is not on the agenda.\n\nThe Frohloffs are keeping some crossbred cattle for beef production, as well as holding onto their butcher shop — and they've just added a new venture to the mix — a restaurant showcasing their own beef.\n\nFor Mr Frohloff, it was also about offering an alternative dining option to his community.\n\n\"My wife and I are not pub sort of people,\" he said.\n\n\"Sometimes at a pub it can get a bit rowdy and it's just not our scene.\n\n\"We thought, if that's the way we feel, there'd be more people out there that feel like us.\"\n\nBradley Frohloff cooks a steak in his new restaurant. (ABC News: Brandon Long)\n\nWhile stud breeding hasn't piqued their children's interest, the other parts of the family business have.\n\nIsabelle and her partner have bought into the butcher and grill, committing to a paddock-to-plate model that keeps the family working together.\n\n\"Working with family is definitely a nice thing to be able to do,\" she said.\n\n\"With the grill now, we get that extra step again where we get to serve it directly to the customers and they get to see all the hard work that we put in,\" she said.\n\nIsabelle Frohloff and her father Bradley run the family butcher shop and restaurant. (ABC News: Brandon Long)\n\nThe Frohloffs' youngest daughter, Jessica, has taken a keen interest in managing the beef herd that supplies both the butcher shop and the new restaurant.\n\nPrecision beyond the paddock\n\nWhile the family's focus has gone from breeding to hospitality — animal welfare remains a key priority — even in processing.\n\n\"We like to send all the animals off our own farm because we've proven that we can keep the stress down,\" Mr Frohloff said.\n\n\"We take them early every Monday morning — last cattle in, first cattle killed — so they literally stand in the yard for 20 minutes.\n\n\"All the little things added up make a big difference in the eating quality.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2026-01-25/sharn-davidson-tourette-syndrome-dinosaur-roar/105083252",
        "title": "Sharn's Tourette's makes her roar like a dinosaur at odd moments",
        "publish_date": "Sun, 25 Jan 2026 00:56:33 +0000",
        "category": "lifestyle",
        "authors": [],
        "text": "Sharn Davidson has lived with Tourette syndrome (TS), a neurological condition that causes involuntary movements and vocalisations, known as tics, for most of her life.\n\nHer Tourette's takes an unusual form — her tic involves making two distinct roaring sounds, which she describes as dinosaur noises.\n\n\"They definitely sound different. One is really high-pitched, screechy, and the other is more 'raptory',\" Ms Davidson says.\n\nThe Perth high-school teacher and mother of three says the kids in her life aren't bothered by the noises; in fact, they think they are hilarious and have given them names.\n\n\"My dinosaurs' names are Kevin and Terry,\" she says.\n\n\"My year 12 students actually named Kevin, and my children named Terry.\"\n\nOf the two, Kevin is more talkative and comes out more often.\n\n\"He's so loud and noisy,\" Ms Davidson says.\n\nSharn Davidson's tattoos of the two dinosaurs that \"live inside her\", Terry and Kevin. (ABC News: Christine Layton)\n\nTrauma a trigger for tics\n\nAs a child, Ms Davidson had the odd tic, roughly once a month, for years without knowing she had Tourette's.\n\nBut after witnessing a traumatic incident on a freeway when she was 21, her tics increased to more than 100 a day.\n\n\"It was really random. It was a really obscure event. [The woman on the freeway] was driving, said she wanted to prove her innocence, and tried to end her own life in her car,\" she says.\n\n\"Luckily, she did not successfully do that, and all the people on site were really cool and helped and stopped her.\n\n\"But it was just like a really profound moment, I suppose, for me.\"\n\nAfter her tics dramatically increased, Ms Davidson went in search of answers, but it took five years for a doctor to tell her what was going on.\n\n\"I went to quite a few doctors and was lucky enough to come across a gentleman who said, 'Don't worry, it's just Tourette's',\" she says.\n\n\" It was kind of cool actually. It's nice to be able to put a label on something that you do that you don't have any control over. \"\n\nShe has realised that stress is a trigger, and that means that the noises often come out when they are least welcome.\n\n\"Inappropriate situations really trigger me,\" she says.\n\n\"[It happens in] situations that I'm not supposed to do it in — classrooms, in libraries, during exams, lots of times when I don't know people.\"\n\nLiving with dinosaurs\n\nWhen the ABC met Ms Davidson, she was with her own children and 40 other kids and parents at a road safety workshop when a roar came out.\n\nShe is now accomplished at handling such situations and simply announced, without embarrassment, \"I have Tourette's; I make dinosaur noises, sorry,\" and the workshop continued without fuss.\n\nShe also uses her tics in the classroom to educate her students about diversity.\n\n\"I could take medication for it, but I really don't feel that that's necessary,\" she says.\n\n\"I think that if you make your differences into something really fun and something that doesn't bother you, then I think other people reflect that and they feel the same way.\n\n\"I am quite lucky; I have quite a mild form of Tourette's.\"\n\nShe also has students who have been diagnosed with the syndrome and tells them about her tics.\n\n\"I don't obviously tell them about the road incident or anything like that. That's too much for tiny people,\" she says.\n\n\"But they feel a little bit better that there is somebody out there who doesn't hide away, it's not shameful.\n\n\"It's something that I embrace, something that I make a part of my personality.\"\n\nShe now has two tattoos on her arms of Kevin and Terry, the dinosaurs she's welcomed into her life.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2026-01-25/british-passport-fallout-overcharging-middleman/106253650",
        "title": "'I was sucked in': Dual citizen's warning over middleman passport websites",
        "publish_date": "Sun, 25 Jan 2026 00:22:56 +0000",
        "category": "finance",
        "authors": [],
        "text": "When British-born Australian Jane MacDonald read in the news that she would need a new British passport to travel back to the UK under changing rules, she jumped onto the computer to apply straight away.\n\nMs MacDonald, who lives in Tasmania, is one of hundreds of thousands of UK-Australians who will now need to enter the UK on a British passport or purchase a certificate of entitlement.\n\nUnder the changes, all dual citizens of the UK will require a valid British passport or certificate of entitlement — both taking three to six weeks to be processed — ahead of their departure to the country.\n\nThe British government said the new regulations were in line with other countries' border policies and would strengthen national security.\n\nAfter a quick Google search for \"renew British passport\", Ms MacDonald clicked on the top result, which was what she thought was an official UK government website, and went through the application process.\n\nWhat we know about UK entry requirements for dual citizens from February 25 Hundreds of confused UK and Irish dual citizens in Australia have written to the ABC with questions around the new changes for entry requirements into the UK. Here's what we know.\n\n\"They used a lovely little crown logo, which you'll see on the proper British government stuff and a lovely little Union Jack flag,\" she said.\n\n\"It said it was going to cost 314 pounds, which is … about $650 Aussie dollars, which is insane.\n\n\"But I thought, maybe it's so expensive because my British passport has been expired for so long.\"\n\nMs MacDonald showed her family group chat the site and told her children that they had better get theirs sorted too.\n\n\"My cluey son said, 'That's not right,' so I said, 'Well, I know my passport expired a long time ago,' and he said, 'No mum, it should be about 100 pounds.'\"\n\nMs MacDonald realised she had accessed a third-party website, which she said overcharged her for assistance in her application.\n\n\"It was a classic ... scenario where I'd created a sense of urgency in getting this done while trying to balance other stuff.\n\n\" I was sucked in good and proper. \"\n\nThe price of a new British passport costs $AU191 (about £100).\n\nShe said at no point did she read anything from the website to suggest it wasn't the British passport office.\n\nMs MacDonald contacted the bank to stop the payment from going through but they said nothing could be done.\n\nWhen she contacted the service several times, the website sent her terms and conditions, which stated they would partially refund her but keep 3 per cent if she asked for one within 12 hours of the transaction.\n\nJane MacDonald hopes her experience will serve as a warning to those rushing to get passport applications in. (Supplied)\n\nThe terms also said if a refund was requested outside of that window, the site would keep 25 per cent of the fee.\n\n\"Overall, I'd say they're sailing very close to the wind using what I regard as deceptive and misleading practices to give the impression they are the UK government passport service,\" she said.\n\nEventually, Ms MacDonald was able to secure a refund and will reapply for a British passport with the official website.\n\nShe said she hopes her story will serve as a warning to the many British dual citizens applying for new passports to scrutinise the websites they land on.\n\nMishal Patel, a UK nationality and immigration specialist, said he has not heard of too many instances of dual citizens being exploited by passport assistance services as of yet.\n\n\"But the odd person has [had] a rogue agent/advisor [and] that did lead to ill advice and loss of money,\" he said.\n\nIt has been reported on before that intermediaries claiming to have access to migration officials have overcharged people eager to come into Australia.\n\nA common pattern\n\nUniversity of Sydney's senior lecturer at the School of Computer Science, Associate Professor Suranga Seneviratne, said when new rules and laws come into effect, many misleading websites using government logos tend to pop up.\n\n\"It's not only about new rules, sometimes it's when there is a natural disaster, and we saw after the Bondi incident there were some fake government assistance websites [popping up too], so it's a very common pattern that scammers use when something happens. They try to stay ahead of the curve and publish these websites,\" he said.\n\n\"It's relatively easy to create websites because the vetting process for domains doesn't include legal checks.\n\n\"But these are relatively short-lived [websites] once society becomes aware.\"\n\nBritish Australians feel 'punished' by new UK entry rules Confused dual citizens are voicing their frustrations as they grapple with changes to the UK's entry requirements, which roll out next month.\n\nDr Seneviratne said there were a few ways to easily detect if a website is legitimate or not.\n\n\"The first is to look into what the typical government domain name is for websites from that country,\" he said.\n\n\"The second is not trusting one single source.\n\n\"With Google search, what happens is these websites do some search engine optimisation or they come through sponsored ads.\n\n\"It is difficult for someone not careful enough to see these are not government sites.\"\n\nHe said to never click on anything that comes via an email address.\n\nRather, search for it on the web.\n\n\"Most browsers have alerts that say this might be a potential scam website but this may not happen in real time and the scam list on Google may not be updated,\" he said.\n\n\"So I suggest using at least two of these kinds of methods.\"\n\nHe said other indications a website might not be legitimate or could be looking to overcharge customers is if it creates a sense of urgency with offers of expedited services or asks for non-traditional payment methods.\n\n\"There are some signals around that, but unfortunately, it's a mixed bag that you need to be aware of all of this and make a decision.\"\n\nYou can apply online for a UK passport on the official government website here.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2026-01-25/prince-harry-daily-mail-court-case-begins/106262650",
        "title": "Prince Harry sues the Daily Mail, but in the court of public opinion, he is on trial",
        "publish_date": "Sun, 25 Jan 2026 00:12:57 +0000",
        "category": "finance",
        "authors": [],
        "text": "Prince Harry, his wife Meghan Markle and their two children live in a 16-bedroom Montecito mansion they call their \"safe haven\".\n\nThe Duchess of Sussex once said of the Californian abode, \"you walk in and exhale, it's so calming, you feel free\".\n\nThe pair escaped the gilded cage of royalty hoping for a quieter, less complicated life in America, but the serenity has done little to temper the prince's unbridled compulsion to take on an industry he loathes — the British tabloid press.\n\nThis week, the renegade royal traded the sunny West Coast for drizzly London and dove back into the fishbowl he fled to give evidence in a \"super claim\" against the publishers of the Daily Mail and the Mail on Sunday, Associated Newspapers.\n\nHe's one of seven high-profile claimants who allege the Daily Mail was using shadowy and illegal tactics to gather sensitive, personal information in pursuit of a salacious front page.\n\nBut the case, which has taken three years to get to trial, has been plagued by issues and many of them have revolved around Harry's legal team.\n\nThe Daily Mail has described the prince's allegations as preposterous, while others have said Harry is \"clutching at straws\".\n\nThe trial is complex, but the stakes are particularly high for Harry because royal insiders say that not only is the British press on trial, but so is the prince's judgement.\n\nThe prince who hates the press\n\nHarry has long loathed British tabloids and believes a toxic culture on Fleet Street was to blame for the death of his mother, Diana Spencer.\n\nLiving a life of constant paranoia, the duke was convinced he was being spied on by private investigators on the tabloid's payroll for nearly two decades.\n\nRoyal commentator Afua Hagan said Harry's lifelong issues with the media led him to hate it.\n\n\"I think Harry looks at the tabloids with utter contempt. I think he doesn't think they're worth the paper they're written on,\" she told the ABC.\n\nIn court this week, Harry said he was instructed to \"never speak out about it because of the institution I was in\".\n\n\"We're told to never complain, never explain. I accepted it as part of my life,\" he said.\n\nBut his passive approach to the media's intrusion began to shift when he first met Markle and introduced her to the British public.\n\nIn early 2020, Prince Harry and his wife Meghan Markle announced their plan to step back as senior working royals. (AP: John Stillwell/Pool Photo, file)\n\nWriting in his witness statement, he said he \"became increasingly troubled by the approach of not taking action against the press\" in the wake of \"vicious, persistent attacks on, harassment of and intrusive, sometimes racist articles\".\n\nBy then, several Fleet Street outlets had already been exposed for having a nefarious culture of hacking the phones of everyone from pop stars and politicians to police officers and families of murder victims.\n\nThe Leveson inquiry into the culture of the British press found illegality was rife in the London tabloid scene and that the \"outrageous\" tactics used to uncover secrets had caused \"severe harm to innocent people\".\n\nAfter the inquiry came a rush of lawsuits, with angry phone hacking victims eager to make the tabloids pay for the extraordinary breaches of privacy.\n\nBy 2019, the prince was on the verge of what became known as \"megxit,\" a term used by the tabloids to seemingly blame the royal's exit from the firm on his wife.\n\nPrince Harry says tabloids made wife Meghan's life 'absolute misery' An emotional Prince Harry held back tears as he described the impact of media coverage on his wife Meghan Markle.\n\nIt was also at this time it became clear Harry was now eager to sue.\n\nHis first target was Britain's most notorious rags: the Rupert Murdoch-owned The Sun and the now-defunct News of The World.\n\nThe latter's former editor admitted to hacking Harry's phone nine times.\n\nThe case against the Murdoch press was settled in 2025, with the prince receiving an apology and reportedly a cheque for the equivalent of $20 million.\n\nHarry also took on The Mirror, citing similar allegations of egregious privacy breaches.\n\nIn 2023, he gave evidence against the tabloid and became the first royal in more than a century to testify in a courtroom and break ranks from the \"never complain, never explain\" ethos.\n\nThe high court ruled in favour of the duke, and he won about $280,000 of the $900,000 in damages he was seeking.\n\nBut the prince still wasn't satisfied and was after one last tabloid scalp — the Daily Mail.\n\nHarry versus the Daily Mail\n\nHarry's pursuit of the tabloid is less cut and dry than his previous lawsuits.\n\nUnlike the Mirror and the Murdoch papers, there has never been a police inquiry into the Daily Mail, and no journalists at the title have ever admitted illegality.\n\nThere are also serious concerns over how the royal's legal team have gathered evidence.\n\nA key member of Harry's legal research team is journalist-turned-anti-tabloid evangelist Graham Johnson.\n\nIn a London court, Prince Harry is out to slay dragons — but will it bring peace? The Duke of Sussex takes on the publisher he believes poisoned his childhood, his marriage, and his peace of mind in a legal battle driven by anger as well as principle.\n\nJohnson is a self-confessed phone hacker himself and was charged and convicted of the offence in 2014.\n\nIn November last year, one of the private investigators who supposedly blew the whistle on the Daily Mail said his signature on a witness statement was forged.\n\nIn a statement submitted to the court, Gavin Burrows, who was central to the case brought by Harry and the other claimants, said he was on painkillers and drinking heavily when Johnson approached him and asked him to help him with research into phone hacking.\n\nThe statement goes on to say he \"never\" carried out illegal work for the Daily Mail.\n\nThe legal team taking on the Daily Mail is also likely to call infamous phone hacker and former private investigator Jonathan Rees.\n\nRees, a convicted criminal who planted drugs on a woman so a client could win a custody battle, had initially said he carried out bugging and phone hacking for the Daily Mail, but in an interview with UK network Channel Four, he said Harry and the other claimants \"would have to rethink that\".\n\n\"Yes, I did hear about it. I know it was going on, but I can't provide any evidence for it,\" Rees told journalist Cathy Newman on Channel Four.\n\nThe Mail says it has never used the services of Rees.\n\nThe prince has been a key driver of the case, but it's unclear whether he is comfortable with his legal team's willingness to involve shady former crooks in their case against the tabloid.\n\nHarry the recruiter\n\nA critical element of the case against the Daily Mail's publisher revolves around the mother of murder victim Stephen Lawrence.\n\nIn 1993, when Stephen Lawrence was 18 years of age, he was murdered while waiting for a bus in what was determined to be a race-based hate crime.\n\nHis mother, Doreen Lawrence, now a member of the House of Lords, became frustrated with the London Metropolitan Police's perceived lack of enthusiasm for the case and the lack of interest from the press.\n\nStephen Lawrence's father, Neville, however, was a friend of Daily Mail editor Paul Dacre, who took an interest in the case and ordered journalists to chase down the story and eventually two men were convicted of the murder.\n\nStephen Lawrence was murdered in a race-based hate crime in 1993. (Reuters: Toby Melville)\n\nThe Daily Mail's intrepid pursuit of Stephen Lawrence's killers was praised because mainstream tabloids had a reputation for showing editorial bias when it came to matters of race, which often meant the deaths of black people were under-reported.\n\nLady Lawrence had been grateful for Mr Dacre and the Daily Mail for their effective investigative journalism, until 2022 when a call changed everything.\n\nAccording to court documents, Lady Lawrence received a call from Harry, who told her he believed the Daily Mail had been hacking her phone.\n\nShe told the BBC, \"[Harry] was busy looking at his own case and then my name kept cropping up and so he felt that I should know about it\".\n\nLady Lawrence said she met with Harry's lawyer, David Sherborne, who also said she'd been the victim of illegal surveillance.\n\n\"I would like an apology for what they've done. We as a family [have] been going through so much, and they've added to the trauma,\" she said.\n\nMr Dacre is expected to be called as a witness in the case and the Daily Mail has described the allegations of illegally spying on Lady Lawrence as \"groundless smears and appalling\".\n\nLawyers for Lady Lawrence had previously pointed to statements given by Mr Rees as key evidence she was hacked, but it is unclear whether they will still prosecute this in court.\n\nHarry's role in recruiting Lady Lawrence into the case has never been made clear, but the fact she is part of it ups the ante for the prince.\n\nLady Lawrence is not a royal or a pop star and her harrowing story has added a human element to the case.\n\nBut it also means that if the suit against the Daily Mail is unsuccessful, Harry could be blamed for roping her into a losing side that will owe the publication millions of dollars in court costs.\n\nHarry wants protection. The women who could help are the ones he's lost Prince Harry may be testing the thread of unconditional love that is supposed to connect a parent and child. But in royal life, that thread is stitched into a complicated tapestry, frayed by protocol, duty and terms set by the king.\n\nHagan said she believed Harry had taken a risk, but a calculated one.\n\n\"As well as the Daily Mail being on trial, Prince Harry is on trial a little bit for his credibility,\" the royal commentator said.\n\n\"But it's not just him suing, there [are] six others, and for him that means strength in numbers.\"\n\nFor a very lonely prince, estranged from his family, bereaved by the death of his mother and his monarch grandmother, the risk of recruiting others might be offset by its comfort.\n\nWhen Harry left court, he smiled and waved at the dozens of waiting photographers, many of them employees of the tabloid press he is on a crusade to crush.\n\nFor now, the boy who always knew he was the spare will return to his \"safe haven\" in Southern California, where he'll await the ruling of the High Court, and the judgement of his public.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2026-01-25/australian-open-live-blog-day-eight-results-updates/106266662",
        "title": "Live: Sabalenka storms in quarterfinals, Djokovic apologises at Aus Open",
        "publish_date": "Sat, 24 Jan 2026 23:30:47 +0000",
        "category": "sports",
        "authors": [
            "Andrew Mcgarry",
            "Luke Pentony"
        ],
        "text": "The stars are out as the action heats up on day eight of the 2026 Australian Open.\n\nWomen's top seed Aryna Sabalenka defeated Canada's Victoria Mboko in straight sets, 6-1, 7-6 (7/1), to reach the quarterfinals.\n\nLater in the afternoon, men's world number one Carlos Alcaraz will take on American Tommy Paul before Australia's own Alex de Minaur faces his toughest test thus far against world number ten Alexander Bublik.\n\nFollow all the action from Melbourne Park below in our live blog.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/rural/2026-01-25/western-australia-harvest-wraps-up-with-record-breaking-year/106253596",
        "title": "'Amazing' WA grain harvest set to break record with 27 million tonnes",
        "publish_date": "Sat, 24 Jan 2026 23:25:17 +0000",
        "category": "finance",
        "authors": [],
        "text": "Western Australia's grain industry is looking at breaking the harvest record by 2 million tonnes after favourable seasonal conditions and a shift away from livestock production.\n\nThe Grain Industry Association of WA (GIWA) is due to release its final report next month, but author Michael Lamond said the figures were expected to exceed 27 million tonnes.\n\nMichael Lamond says growers produced an exceptional volume of grain, far exceeding early forecasts. (Supplied)\n\n\"Harvest is pretty well done and dusted in Western Australia now,\" Mr Lamond said.\n\n\"There will still be a trickle of grain coming in, but it is looking around 27.2 million tonnes.\n\n\" That's about 2 million more tonnes than the previous record set in 2022. \"\n\nThe author described the outcome as exceptional, noting it was not a result many farmers would have anticipated at the start of the grain-growing season.\n\nMichael Lamond says some farmers are in \"desperate need\" of rain. (ABC Rural: Jo Prendergast)\n\n\"It wasn't a particularly good start further north, particularly in the Geraldton zone, where it was a very late start,\" Mr Lamond said.\n\n\"The central areas are probably not in record territory, but each year there are areas that aren't particularly good.\"\n\nHowever, Mr Lamond noted that the higher volume of crops sown this season, particularly in areas with above-average rainfall, contributed to the increase in overall yields compared with 2022.\n\n\"In 2022, there were about 8.96 million hectares sown in the state; in 2025, there are about 9.44 million hectares.\"\n\nMichael Lamond says \"central areas are probably not in record territory\". (Supplied: Stevi Filipowski, The Poppy Files)\n\nReap what you sow\n\nLake Grace farmer Royce Taylor has been working in the Great Southern for 37 years and said it was his second-largest production year on record.\n\n\"The barley yields in the Lake Grace area this year were huge; we refer to it as the Barley Belt now,\" Mr Taylor said.\n\n\"Sheep going out of our systems, more hectares going in, varieties improving, not huge amounts of frost around, just a number of factors that contributed to a great year.\"\n\nRoyce Taylor describes the year as \"amazing\". (ABC Great Southern: Mark Bennett)\n\nMr Taylor believed the whole state was set to benefit from the huge crop.\n\n\"You're looking around $10 billion plus going back in to the WA economy,\" he said.\n\nDespite the exceptional season, Mr Taylor said the global market was \"awash\" with grain, putting downward pressure on prices.\n\nRoyce Taylor says a global oversupply of wheat may put downward pressure on prices. (ABC Midwest: Joanna Prendergast)\n\nMollerin grower Cathy Cooke said some areas had missed out on the positive harvest.\n\n\"There is a pocket that has missed out, like Goodlands through the north of Kalannie down to east of Merredin,\" Ms Cooke said.\n\n\" It is the minority, but you still need to be mindful of them because its always tough when you see everyone have a great season and you haven't had one. \"\n\nDeliveries all but wrapped up\n\nIn the state's south east, a record-breaking 4.05 million tonnes has been received by major grain storer and handler the CBH Group, in the Esperance port zone.\n\nThe previous record of 3.7 million tonnes was well and truly surpassed in mid-December, which zone general manager Paul Channon said was no surprise.\n\n\"We always planned our harvest receivals out to around the 4 million tonne mark,\" he said.\n\nMr Channon said on-farm grain storage in bags, the use of a train to empty out the site at Grass Patch, and plenty of in-season shipping all helped to bring in the record crop.\n\nA CBH train at the Port of Albany in the Great Southern. (ABC Great Southern: Rosemary Murphy)\n\nAlbany general port zone manager Will Piercey said their district had received 5.35 million tonnes, which was 700,000 tonnes above the previous zone record.\n\n\"There were multiple days of over 150,000 tonnes of daily receivals, which is a massive effort from growers, contractors and staff,\" Mr Piercey said.\n\nFinal crop figures are expected to be released on February 13. (Supplied)\n\nA similar sentiment was shared in the Kwinana South zone, where general manager Irving Carey said out-loading had already begun.\n\n\"We had 4.6 million come in; quality was great this year too,\" Mr Carey said.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2026-01-25/scotland-replaces-bangladesh-at-t20-world-cup/106266812",
        "title": "Scotland replaces Bangladesh in last-minute T20 World Cup switch",
        "publish_date": "Sat, 24 Jan 2026 23:10:13 +0000",
        "category": "sports",
        "authors": [],
        "text": "Bangladesh has been replaced by Scotland for next month's Twenty20 World Cup after the South Asian side refused to travel to co-hosts India, the International Cricket Council (ICC) says.\n\nThe decision follows weeks of uncertainty, during which the Bangladesh Cricket Board (BCB) repeatedly said it would not play its scheduled matches in India, citing safety concerns following soured political relations between the neighbours.\n\nBangladesh had asked the ICC to move its games to tournament co-host Sri Lanka instead, but the governing body rejected the demand, dismissing any security threat to the team.\n\n\"Following a meeting on Wednesday, the Bangladesh Cricket Board had been given a 24-hour timeframe to confirm whether its team would participate in India as scheduled,\" the ICC said in a statement.\n\n\"As no confirmation was received within the deadline, the ICC proceeded in line with its established governance and qualification processes to identify a replacement team.\"\n\nScotland has been added to the tournament on just a few weeks' notice. (Getty Images: Stu Forster )\n\nScotland has replaced Bangladesh in Group C, joining England, Nepal, Italy and West Indies.\n\n\"Scotland are the next-highest-ranked T20 international team that had originally missed T20 World Cup qualification. They are currently ranked 14th, which in fact is ahead of competing teams Namibia, the United Arab Emirates, Nepal, the United States, Canada, Oman and Italy,\" the ICC added.\n\nScotland's national cricket body said it had accepted the ICC's invitation to compete in its fifth-straight T20 World Cup.\n\n\"This is an exciting opportunity for Scotland's players to compete on the global stage in front of millions of supporters,\" Cricket Scotland chief executive Trudy Lindblade said in a statement.\n\n\"We also acknowledge this opportunity has arisen out of challenging and unique circumstances. Our squad have been training for some weeks in preparation for upcoming tours and are now preparing to arrive in India imminently to acclimatise to local conditions.\"\n\nLast month, hundreds of people protested near Bangladesh's high commission in New Delhi after Hindu factory worker Dipu Chandra Das was beaten and set on fire in Bangladesh's Mymensingh district by a crowd that accused him of making derogatory remarks about Prophet Muhammad.\n\nA total of 12 people were arrested in connection with his death.\n\nThe incident worsened relations between India and its neighbour, with ties already strained after Bangladesh's former prime minister Sheikh Hasina fled to New Delhi following protests against her.\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\nPolitical tensions have since spilled into cricket.\n\nBangladesh bowler Mustafizur Rahman was dropped from this year's Indian Premier League despite signing with its Kolkata franchise. Bangladesh responded by banning IPL broadcasts in the country and demanding to play World Cup matches in Sri Lanka.\n\nThe stand-off mirrors previous tensions in South Asian cricket.\n\nFor the Champions Trophy last year, the Indian cricket board (BCCI) stuck to its policy of not touring Pakistan because of the strained political ties between the bitter neighbours, who play each other only in ICC events.\n\nLike for the 2023 Asia Cup in Pakistan, a \"hybrid model\" was agreed on under which India was allowed to play its Champions Trophy matches in Dubai to salvage the tournament.\n\nUnder the agreement running until 2027, Pakistan will play in a neutral venue for any ICC event, including the T20 World Cup where it is scheduled to play its matches in Sri Lanka.\n\nThe 20-team World Cup will begin on February 7.\n\nReuters",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2026-01-25/what-were-the-top-baby-names-in-australia-2025/106254306",
        "title": "Australia's most popular baby names from 2025 revealed",
        "publish_date": "Sat, 24 Jan 2026 23:05:06 +0000",
        "category": "entertainment",
        "authors": [],
        "text": "Darwin parents Abbey and Tom Kiem left their newborn daughter nameless for the first two weeks of her life, as they struggled to pare down an overwhelming list of potential names to the perfect one.\n\nThey said they wanted a traditional, feminine name that would also convey strength — ideally, something unique that could be shortened into a nickname.\n\n\"So if she wanted to be a CEO some day, her name would suit that type of role, or if she wanted to be an artist, it was friendly,\" Abbey said.\n\nAbbey says she doesn't mind her children — Amelia and Oliver — sharing names that have proved popular in recent years. ( )\n\nNora, Emmie and Emily were among the names tossed around and tested out, before they were ultimately scratched off the list.\n\n\"Finally we were like … she's an Amelia,\" Abbey said.\n\nThe Top End parents had unwittingly chosen the Northern Territory's most popular baby girl name of 2025, which also proved to be a crowd favourite across the country.\n\n2025 top baby names revealed\n\nEvery year, each Australian state and territory compiles data from their Births, Deaths and Marriages registries to reveal the most popular names parents picked for their babies.\n\nCharlotte, Isla and Amelia reclaimed their status as popular female baby names in 2025, with hundreds of babies given those names across a number of regions.\n\nMeanwhile, the latest data on male baby names revealed Oliver and Noah made the top 10 list in every jurisdiction.\n\nHere are the top 10 baby boy and baby girl names from around the country.\n\nACT Evelyn and Oliver took out the top spots for baby names in the Australian Capital Territory, with the government confirming the boy's name has appeared in previous lists over the years. Last year was the first time Evelyn topped the girls' list, with 2025 marking the sixth time it made the top 10, growing in popularity and bumping it up from fifth place in 2024. Olivia, which shared sixth place with Isla and Matilda last year, has appeared in every top 10 list since 1998 — except for 2016. Meanwhile, crowd favourite Oliver has made every one of the ACT's lists since 2008, taking out the top spot for the fourth time after it won in 2022, 2019 and 2010. ACT's most popular girl names (2025) ACT's most popular boy names (2025) Evelyn Hazel Grace Charlotte Lily Isla Matilda Olivia Amelia Eleanor Oliver Henry Noah Levi Elijah Oscar Liam Muhammad Theodore Charlie NSW Noah and Charlotte continued their reign as favourites in New South Wales, sharing the top spot on their respective lists for the third time in four years. With 542 baby Noahs born last year, this classic was a strong contender — almost 100 births separated first and second place on the male list, with 446 boys given the name Oliver. Among the baby girls, 403 Charlottes were born in 2025 while the name Amelia — which took out second place in NSW — was picked 349 times. Most popular girl names in NSW (2025) Most popular boy names in NSW (2025) Charlotte Amelia Isla Olivia Mia Sophia Lily Chloe Hazel Sienna Noah Oliver Theodore Luca Leo Henry Elijah Hudson Levi Jack NT Of the 3,166 births in the NT in 2025, Noah proved the most popular boys' name and Amelia — which means hardworking — topped the list of girls' names. Isla ranked second on the female list, followed by Hazel, Ruby, then Evelyn. Long-time favourites Archie and Oliver once again dominated the boys' list, while Muhammad ranked sixth and Malakai came in at number 10. NT's most popular girl names (2025) NT's most popular boy names (2025) Amelia Isla Hazel Ruby Evelyn Isabella Olivia Harper Mia Sophia Noah Elijah Oliver Archie Levi Muhammad Eli Henry Mason Malakai QLD Queensland is the only jurisdiction that hasn't revealed their most popular baby names from 2025. The ABC contacted the state's Registry of Births, Deaths and Marriages but the data was not available by the time this story was published. SA In South Australia, just two births separated the most popular baby girl name from second place. Charlotte took out first spot, with 95 babies given the name in 2025, while 93 girls were named Isla. Oliver proved the most popular male name, with 122 baby boys given the name. Coming in at the bottom of their respective top 10 lists, 59 baby Rubys and 70 little Oscars were born last year. South Australia's most popular girl names (2025) South Australia's most popular boy names (2025) Charlotte Isla Olivia Harper Hazel Amelia Elsie Violet Lily Daisy Ruby Oliver Noah Henry Leo Theodore Levi Luca Charlie Elijah Jack Oscar TAS Noah, which appeared on every state and territory's list last year, took out first place for the boys in Tasmania. Charlotte was most popular among the state's top girls' names, followed by Isla. George, which placed ninth on the list of male names, is the only pick between both lists that wasn't featured in any other jurisdiction's top 10 from 2025. Tasmania's most popular girl names (2025) Tasmania's most popular boy names (2025) Charlotte Isla Hazel Eleanor Elsie Harper Matilda Ruby Mia Violet Noah Charlie Oliver Archie Hudson Henry Leo Theodore George Levi VIC More than 500 baby boys were named Noah across Victoria in 2025, while 362 baby girls were given the name Charlotte. Between both lists, Ava was the only name that doesn't appear in the top 10 for any other state or territory. There were 234 baby girls given the name last year, making it 10th on the list, while William took out the final spot on the list of popular boys' names. Victoria's most popular girl names (2025) Victoria's most popular boy names (2025) Charlotte Amelia Hazel Mia Isla Olivia Lily Sienna Matilda Ava Noah Oliver Henry Leo Theodore Charlie Luca Jack Levi William WA In Western Australia, Isla proved most popular for baby girls, followed by Charlotte then Grace. Among the boys, Noah placed first, Oliver ranked second and Theodore came in third. Sofia was the only name from either list that doesn't also appear in last year's top 10 for another Australian jurisdiction — although a similar name, spelt Sophia, did place in both New South Wales and the Northern Territory. WA's most popular girl names (2025) WA's most popular boy names (2025) Isla Charlotte Grace Olivia Amelia Lily Mia Hazel Matilda Sofia Noah Oliver Theodore Jack Luca Henry Hudson Charlie Levi William\n\nThe 100-year return\n\nMark McCrindle, a Sydney-based demographer, has spent years analysing baby names.\n\nHe said drilling down into the data uncovers several deeper, national trends.\n\nAmelia was the Northern Territory's most popular baby name in 2025, also taking out second place in New South Wales and Victoria. ( )\n\nMr McCrindle said Oliver — which has been the number one boys' name in Australia for 12 years in a row — was expected to keep that crown again in 2026 once Queensland's data was included, while Noah was rapidly rising as a top contender.\n\nData shows Charlotte has also been dominating among girls' names for a number of years, but Amelia is now making a strong run for the top spot.\n\nMark McCrindle is a social researcher who has spent years looking at baby name trends. ( )\n\nMr McCrindle said his research showed today's parents had been avoiding names that were popular with their own parents, instead choosing names from their great-grandparents' era because they balance \"a sense of uniqueness [with] a sense of tradition\".\n\nHe said names popular over the past few decades — such as Charles, Michael, Chloe and Lara — were no longer making the top 100 names, however \"older names\" including Greyson, Theodore and Grace were making a big comeback.\n\n\"The 100-year return means that names we haven't seen for a long time, like Penelope and also Ava, are doing very strongly at the moment,\" Mr McCrindle said.\n\n\"Names like Michael, Craig, Kevin and Tony don't make the top 100 lists anymore.\n\n\"For girls, names like Nicole, Kylie and Karen — which dominated the list 50 years ago — are nowhere to be seen.\"\n\nLoading...\n\nMr McCrindle said he had noticed a shift as the tech-savvy Generation Z — born roughly between 1997 and 2012 — emerged as a new cohort of parents.\n\nThose mums and dads are increasingly outsourcing the task of naming their children to baby name consultants, he said, and some are turning to artificial intelligence for inspiration.\n\nNames like Oliver and Amelia are currently surging in popularity. ( )\n\nHe said while some believed popular culture and celebrities dictated on the popularity of baby names, the royal family was actually still the biggest influence.\n\n\"They're the ultimate celebrities and they tend to choose names themselves that have tradition, which lines up with what Australian parents are looking for,\" Mr McCrindle said.\n\nAbbey isn't phased by the likelihood her daughter Amelia — and two-year-old son Oliver — will share their names with several children in the playground.\n\nAmelia and Oliver both have popular names. ( )\n\n\"Amelia is such a beautiful name, and obviously other people think it's a beautiful name as well,\" the Darwin mum said.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2026-01-25/first-nt-jockey-takes-maternity-leave/106244210",
        "title": "First female jockey to win Darwin Cup returns from maternity leave",
        "publish_date": "Sat, 24 Jan 2026 22:59:30 +0000",
        "category": "sports",
        "authors": [],
        "text": "Jessie Philpot is a speck of shimmering yellow hunched over the neck of a dark brown gelding, galloping around the race track in Alice Springs.\n\n\"It's addictive,\" said the jockey of 15 years.\n\nMs Philpot has been racking up wins in the Northern Territory over the past few years and rode past the finish line to become the first female jockey to win the Darwin Cup in 2021.\n\nJessie Philpot riding race horse Square Cut in Alice Springs. (Supplied: Jessie Philpot)\n\nLast year Ms Philpot marked a different type of win by becoming a mother and the first jockey in the Northern Territory to take maternity leave.\n\n\"I was actually the first female jockey in the NT to have a baby, so we had to work a little bit of stuff out,\" she said.\n\n\"Jockeys aren't allowed to ride once they're 12 weeks, so after that you go onto your maternity leave.\"\n\nJessie Philpot rode Highly Decorated to win the 2021 Darwin Cup. (Supplied: Greg Irvine)\n\nThoroughbred Racing NT paid Ms Philpot's maternity leave and superannuation during her second and third trimesters, until she became eligible for the Commonwealth's Paid Parental Leave Scheme.\n\nChief executive Andrew O'Toole said jockeys had not been eligible to take maternity leave because they operated as sole traders or were self-employed, but about five years ago, the rules were changed.\n\nMr O'Toole said the new rules were \"pretty standard\" across the country, but the industry was not yet offering paternity leave.\n\nJessie Philpot is racing again after giving birth. (ABC Alice Springs: Xavier Martin)\n\nBack in the saddle\n\nMs Philpot gave birth to her daughter Harper six months ago.\n\n\"She is an amazing little girl, lots of personality,\" Ms Philpot said.\n\nBaby Harper is six months old. (ABC Alice Springs: Victoria Ellis)\n\nMr O'Toole said jockey riding was physically demanding work, but from four months after giving birth, Ms Philpot was already racing again — and winning.\n\n\"It's a tremendous feat for all our riders what they do,\" he said.\n\n\" For Jess to make such a quick comeback after having her little one, and do so well, it's just fantastic. \"\n\nMs Philpot was humble.\n\n\"A lot of women have had babies around Australia that are jockeys and most of them come back and come back to what they used to be,\" she said.\n\nMs Philpot says many jockeys have babies and return strongly to the sport. (ABC Alice Springs: Xavier Martin)\n\nFemale jockeys 'huge part of the industry'\n\nMr O'Toole said although male jockeys still slightly outnumbered female jockeys in the NT's racing industry, women were a \"huge part of the industry\" across Australia.\n\nHe said in previous years female jockeys faced beliefs they weren't strong or skilled enough to race horses, but those days were gone.\n\nAndrew O'Toole says other female jockeys will feel reassured by how Jessie Philpot has returned after pregnancy. (ABC News: Marcus Kennedy)\n\n\"Some of the top riders all over the world ... are female riders, so I think that stigma that was certainly in place years ago has passed,\" he said.\n\n\"The greater majority of trainers are not frightened to put female riders on their horses on race day or for track work, and their record speaks for themselves, their feats speak for themselves.\"\n\nPaving the way for future jockeys\n\nMr O'Toole said Ms Philpot's experience would help half a dozen other female riders in the Northern Territory.\n\n\"I'm sure that seeing Jess was looked after, as she should be ... will give the others confidence that if they get to that stage of their life where they want to have a baby, there's nothing stopping them,\" he said.\n\nMs Philpot hoped her experience would lead the way for future jockeys to take maternity leave.\n\nJessie Philpot defied bookmakers to become the first female jockey to win the Darwin Cup. (ABC News: Myles Houlbrook-Walk)\n\n\"It's set the way for someone else, because I'm sure there will be someone else who'll have a baby for sure,\" she said.\n\nBut in the meantime, she is keen to enjoy her sport.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2026-01-25/york-told-to-stay-positive-after-author-craig-silvey-charged/106256812",
        "title": "Promotional material for the movie Runt taken down in York",
        "publish_date": "Sat, 24 Jan 2026 22:13:25 +0000",
        "category": "entertainment",
        "authors": [],
        "text": "A regional community in Western Australia, which was the backdrop for the children's book turned motion picture Runt, is grappling with how to \"separate the art from the artist\" after high-profile author Craig Silvey was arrested on child exploitation material charges.\n\nThe author is also renowned for his books Jasper Jones and Honeybee.\n\nIn York, 100 kilometres east of Perth, the council has removed some promotional material for the locally filmed movie Runt, but the shire president urged the community to remain proud of their involvement with the film.\n\nMany people in York featured in the film. (Supplied: Court McAllister)\n\nSeparating art from artist 'challenging'\n\nYork shire president Chris Gibbs said Runt, which hit Australian screens in 2024 and injected almost a million dollars into the community, was a landmark production that positioned the shire as an ideal filming location.\n\nBut he said the serious allegations against Silvey brought up difficult emotions.\n\n\"We're now in a cultural environment worldwide where separating the artist from the art has become increasingly challenging,\" Mr Gibbs said.\n\n\"I think every single one of us could look at our book collection or movie collection and probably go, OK, there's something that's happened with a person or persons from those pieces of art.\n\n\"As a broader community, these are things we grapple with because of access to information now and the way that information can be disseminated to our communities.\"\n\nChris Gibbs says it is challenging to separate the art from the artist. (Supplied: Shire of York)\n\nMr Gibbs urged the community to remain positive about its contribution to the film.\n\n\"There were many of us in town who had a small part in the film. There were volunteers, people who donated set pieces … there's a big piece of York in that whole production,\" he said.\n\n\"I think that it's really important that we don't put ourselves in a situation where we start to feel down about the positive things that we did with that piece of art.\n\n\" There's still work there that the Shire of York and the people of York should be proud of. \"\n\nYork and its residents featured heavily in the film. (ABC Midwest & Wheatbelt: Chloe Henville)\n\nMemorabilia removed\n\nMr Gibbs said the shire decided to remove the promotional material to reflect the seriousness of the allegations.\n\n\"We recognise the seriousness of the charges involving Mr Silvey … matters involving child safety are deeply concerning,\" he said.\n\n\"We certainly don't want a situation where people might feel uncomfortable because of what's going on, so we'll continue to monitor that.\"\n\nThe Shire of York will continue to monitor the situation. (Supplied: Court McAllister)\n\nSilvey's high-profile arrest also prompted the WA government to request the author's books be removed from the curriculum while the investigation continued, and many bookstores took his work off their shelves.\n\nThe theatre adaptation of Runt, which was set for the Belvoir St Theatre stage in New South Wales in November, has also paused promotion.\n\n\"Belvoir is taking this matter seriously,\" a Belvoir St spokesperson said.\n\n\"Whilst Mr Silvey is not directly involved with Belvoir's adaptation of Runt, Belvoir nonetheless indefinitely paused work on promotion of sales for that production while these charges are dealt with by police and the court.\"\n\nEarlier this month, Silvey was granted bail with strict conditions, including not accessing the internet except for his work, banking, legal services, and medical reasons, and not having any unsupervised access to minors.\n\nA $100,000 personal undertaking was required for bail, and $100,000 surety.\n\nThe ABC was told that, despite being granted bail by the court, Silvey did not meet the surety bail condition and remains in custody.\n\nSilvey is yet to enter a plea and is due back in court in February.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2026-01-25/brisbane-2032-olympic-games-village-what-athletes-want/106243500",
        "title": "Videos of life in the Olympic village go viral. How will Brisbane avoid negative reviews?",
        "publish_date": "Sat, 24 Jan 2026 22:03:33 +0000",
        "category": "sports",
        "authors": [],
        "text": "Cardboard beds, no air conditioning in rooms and concerns over undercooked meat made headlines as the world's best descended on Paris for the 2024 Olympic and Paralympic Games.\n\nA teammate's scathing review of the \"shit\" beds in the athletes' village posted by Australian boxer Tina Rahimi attracted more than 3 million views on TikTok.\n\nTo avoid similar criticism on an international scale come 2032, developers have been speaking to athletes about what they'd like to see in Brisbane.\n\nTina Rahimi says she found the beds in the Olympic village comfortable, but understood that wasn't the case for other athletes. (Supplied)\n\nRahimi reflects on living in the village as one of the best and most unique experiences she's had. But for heptathlete Tori West, the novelty wore off after about 24 hours.\n\n\"I liked being in the stadium, but the village I felt was not very conducive to high performance,\" she said.\n\nFour-time Para-canoe gold medallist Curtis McGrath has been among those providing insights to developers.\n\nCurtis McGrath won his fourth para canoe gold at the Paris Games. (Supplied: Curtis McGrath)\n\n\"I think the athletes have a very broad and thorough understanding of what it is like to be in these villages,\" McGrath said.\n\nThe main village at the Brisbane showgrounds will house more than 10,000 athletes during the Olympics, and 5,000 during the Paralympics.\n\nEarly works on the project started last year with design upgrades on the main arena at the showgrounds underway.\n\nThere will be two more smaller villages — at Mayoochydore on the Sunshine Coast and the Royal Pines Resort on the Gold Coast — as well as a village in Rockhampton for rowing.\n\nThe main village for 2032 Games will be at the Brisbane showgrounds. (Supplied: Queensland Government)\n\nWhat athletes would like to see\n\nHaving facilities that can accommodate teams of wheelchair athletes will be key to ensuring everyone has a positive experience, McGrath said.\n\nHe said in Rio in 2016 the lifts were only big enough for two wheelchairs at a time. This was an issue for wheelchair basketball and rugby teams.\n\nOn a lighter note, McGrath has floated the idea of a space where athletes can meet Aussie icons — like koalas and kangaroos.\n\n\"Some athletes may never come to Australia again and I think it would be a great opportunity for them to experience part of our country,\" he said.\n\nCreating a place where \"sports mad\" athletes can watch and cheer on their teammates while relaxing in the village or grabbing a bite to eat would also be well received, according to McGrath.\n\nCurtis McGrath says in the village in Paris, there were two places to watch the Games, but he believes more screens would be a hit. (Supplied: Curtis McGrath)\n\nWhen it comes to things that could be adopted from Paris, McGrath said the bikes available to ride between the accommodation and food hall were a hit.\n\nTina Rahimi says being in the Olympic village was one of the most unique experiences of her life. (Supplied)\n\nRahimi said she believed creating a way for athletes staying in the same apartment, but who have different competition schedules, to concentrate on their event would be welcomed.\n\nWest said the focus at Brisbane should be to deliver on the \"foundations of high performance\" before turning to building the experience around it.\n\n\"If you don't have your sleep and nutrition right you break down,\" she said. \"You can't train at the level that you need to, that's just the way it is.\"\n\nTo make athletes more comfortable in Paris, some countries, including Australia, provided mattress toppers and portable air conditioners for their rooms.\n\nMcGrath said he felt at times the focus on sustainability was prioritised over ensuring athletes could perform.\n\n\"As the peak sporting event on the planet that is a bit of a slap in the face to the athletes who worked so hard to get there and then don't have the right environment to perform on the day,\" he said.\n\nHe said while sustainability was important — with the Paris Games powered entirely by renewable energy and emitting half the amount of emissions compared to previous editions — so was striking a balance.\n\nThere was no air conditioning in the rooms at the village in Paris. (Reuters: Benoit Tessier)\n\nThe key to delivering best-ever catering\n\nWhile a chocolate muffin became the must-try treat in Paris — with a TikTok of Rahimi's six out of 10 rating getting 1 million views — it was somewhat overshadowed by reports of foods that are a staple for athletes, like eggs and chicken, being in short supply.\n\nRahimi said she was pleased there was a section dedicated to halal food, while West relied more on the options provided by the Australian team at their accommodation.\n\nNotably, two baristas travelled to Paris to staff a cafe at the Australian team's accommodation.\n\nHow the 2000 Olympics changed the face of Sydney Largely regarded as one of the most successful modern Olympics, years of work went into ensuring Sydney could fully capitalise on its moment in the spotlight.\n\nGary Slater, who was the lead sports dietitian for the Australian team in Paris, said Australia had led the way in making sure favourites from home were on hand.\n\n\"We are simply trying to create a food environment that enables athletes to execute on their well-established performance nutrition plans they have developed with their sports dietitians back in Australia,\" he said.\n\n\"One big learning we took away from the unique Tokyo Olympic and Paralympic Games was that athletes gravitated to familiar foods from home, made available in close proximity to their accommodation within the Games village.\n\n\"Not surprisingly, we also confirmed that athletes, coaches and performance support staff come together over good food and coffee.\"\n\nThe Australian team provided familiar foods for athletes that weren't on offer at the food hall. (Supplied: Gary Slater)\n\nIn a bid to ensure the offerings are up to scratch, Professionals in Nutrition for Exercise and Sport (PINES), a global organisation, has conducted an independent review of the food on offer in the lead-up to the Games on behalf of the international Olympic and Paralympic committees.\n\nDr Slater said while it helped, it did not necessarily prevent issues from coming up on a day-to-day basis as pressure is placed on food supply.\n\nTo better enable equity for all competing in the 2032 Olympic and Paralympic Games, Dr Slater said it was important to ensue athletes from diverse populations have access to food that meets their unique cultural needs and is available at a time and in amounts that meet their unique needs.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2026-01-25/shopping-habits-fashion-moving-overseas/105996352",
        "title": "How moving overseas helped me learn to shop my wardrobe",
        "publish_date": "Sat, 24 Jan 2026 22:00:00 +0000",
        "category": "finance",
        "authors": [],
        "text": "For as long as I can remember, I've wanted to live overseas.\n\nAnd in January of 2025, at the ripe age of 28, I decided there was no better time to bring this dream to fruition.\n\nWith my visa secured and passport in hand, I packed my little life into a few bags and boxes and made the well-trodden pilgrimage from Australia to the northern hemisphere, settling in Paris.\n\nA year on, my curiosity about life abroad has been more than satiated.\n\nBut amid all the adventure and growth, I've noticed a surprisingly quiet shift I didn't expect: my relationship with shopping.\n\nLearning to value the functionality of her clothes was one of Ella's biggest shifts. (Supplied: Ella Taverner)\n\nThough the term has had its fair share of buzz online in recent years, I'd like to think I fall pretty firmly into the category of a \"considered\" shopper, someone who values ethical transparency and quality over cheap-and-cheerful trends.\n\nI studied fashion at university, and I've been rifling through Salvos bins since age 14, so the concept of shopping sustainably is hardly a revelation.\n\nBut what began as a practical response to higher living costs and limited wardrobe space (not to mention the looming reality of eventually lugging it all back home) has evolved into a deeper recalibration of my consumption habits altogether.\n\nIn with the old\n\nI knew a little reverse lifestyle creep was inevitable — that quiet shift where you tighten your spending to match a smaller income.\n\nThe casual purchases I once wouldn't have thought twice about (a takeaway coffee, a midweek sweet treat) suddenly felt like luxuries.\n\nIt forced me to stop and reassess where my money was going, particularly when it came to more frivolous non-essentials, like another pair of shoes I didn't really need.\n\nSign up to the ABC Lifestyle newsletter Get a mid-week boost and receive easy recipes, wellbeing ideas, and home and garden tips in your inbox every Wednesday. You’ll also receive a monthly newsletter of our best recipes.\n\nWith less room (both physically and financially) for wardrobe newness, I had to get creative.\n\nFeeling like a kid in a toy store, I started playing dress-up with the pieces I already owned, rediscovering and finding joy in remixing old favourites.\n\nSeeing my clothes in a new light, it became clear that the most dependable items were those I'd owned for years; pieces that prioritised longevity over trendiness.\n\nThe oversized denim jacket I'd owned for five years became a staple in my new-found capsule wardrobe, proof that quality and timeless design always outlive passing trends. I found myself re-energised by my clothes again, not because they were new, but because I was seeing them differently.\n\nLearning to value the functionality of my clothes was one of the biggest shifts. I began to realise It's one thing to love an item on its own, but knowing exactly how it fits into your daily rotation is a different skill entirely.\n\nLearning to shop slower\n\nSurrounded by an entirely different rhythm of life, I noticed my urge for impulse buys began to fade.\n\nWhen you spend enough time in the same place, surrounded by the same people and scrolling the same social algorithm, it's easy to be swayed by what everyone else is wearing, to lose sight of your own personal style and what genuinely resonates with you.\n\nIs the Victoria's Secret catwalk a 'lone gesture'? Curve model Annika Nielsen says representation is sometimes \"something that you don't realise that you miss or that you need until you see it\".\n\nInspired by a city so rich in history and culture, I've found real joy in wandering through the buzzing flea markets on the weekends.\n\nThe handful of pieces I've bought this year carry a story, each with a life before mine, something that now feels especially sentimental.\n\nThere's a certain thrill in hunting for a one-of-a-kind gem, knowing you can breathe a whole new life into it.\n\nThis sort of sartorial treasure hunt has given me a clearer sense of my own style, free from the constant churn of \"new in\" edits and \"must-have\" trends.\n\nThe joy of reinvention\n\nNow my mental checklist for new purchases has become much more extensive.\n\nInspired by the recent Thneed movement — a playful homage to multifunctional fashion — I now look for pieces that are versatile and inventive.\n\nA dress that can be layered over pants, a midi-skirt that doubles as a strapless top — these are the ways I'm injecting fresh energy into my wardrobe without chasing the constant need for newness.\n\nSomewhere between Pinterest boards and laundry days, I've realised that living with less isn't about restriction, but intention.\n\nIn a world that moves fast and sells faster, slowing down became my own quiet rebellion.\n\nTurning inward — to my habits, my home, my own sense of self — might just be the most sustainable form of self-expression there is for me.\n\nElla Taverner is a writer and freelance creative from Naarm/Melbourne whose work spans fashion, beauty, health and First Nations culture.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2026-01-25/iranians-chant-for-a-revolution-amid-economic-chaos-corruption/106262220",
        "title": "How Iranians' economic struggles left the regime unstuck",
        "publish_date": "Sat, 24 Jan 2026 21:51:56 +0000",
        "category": "finance",
        "authors": [],
        "text": "In a small town near Rasht, the largest city on Iran's Caspian Sea coast, small business owner Ali is struggling to live.\n\nIran's economy is in ruins, and Ali (whose real name has been concealed to protect his safety) says putting food on the table has become a daily struggle.\n\n\"With the situation of the rial falling against the dollar, business has come to a standstill,\" he tells ABC News in Farsi during a rare moment when he gets internet connection.\n\n\" This is a revolution stemming from economic troubles. \"\n\nAli adds that rampant corruption has also led to the country's demise.\n\nWhen Iran's Islamic regime ousted the Shah and took power in 1979, $A1 was worth around 70 Iranian rials.\n\nToday $A1 buys about 700,000 rials.\n\nIt is a staggering illustration of the currency's collapse.\n\nOn December 28, Iran's currency plunged to an all-time low, unleashing an unprecedented wave of public anger as hundreds of market owners from Tehran's bazaar — a group that rarely joins mass protests — turned to the streets to demand economic relief.\n\nOver the next fortnight, the demonstrations turned political and spread beyond the markets and across the country, as people rallied against the Islamic regime.\n\nIran's currency lost 84 per cent of its value in 2025 and the cost of food jumped 72 per cent.\n\nPeople walk past closed shops following protests over a plunge in the currency's value, in the Tehran Grand Bazaar. (Majid Asgaripour/WANA via Reuters)\n\nAli says as peoples' finances have dwindled, many young people and bright minds have left his town.\n\nThere is, he says, no opportunities and no hope of a brighter future.\n\nWhile economic discontent has been a factor in some previous protest movements in Iran, Ali says this time something far bigger is at play.\n\nAnd it's why he joined the nationwide protests on January 8.\n\nLoading...\n\n\"Now someone goes to protest, gets beaten up, comes home, opens the fridge and there's nothing there to eat,\" he said.\n\n\"I don't feel like this [the protests] will die down.\n\n\"The people of Iran have played their cards.\"\n\n'A profound crisis of governance'\n\nFor more than two weeks, Iranians have lived in a near-total communications blackout and videos of the government's use of violent force against unarmed civilians, including protesters being shot in the face, continue to surface.\n\nIran protester has a message for Trump From inside Iran, a defiant voice bravely breaks through the internet blackout to ask Donald Trump to intervene.\n\nA report from doctors in Iran shared with media outlets, including the ABC, puts the death toll at least 16,500.\n\nAnd as Mai Sato, special rapporteur on the situation of human rights in the Islamic Republic of Iran, told ABC News, the figures could rapidly rise.\n\nUS sanctions, the fall of Iran's regional allies, a 12-day war with Israel and America, and the collapse of Iran's largest bank are among factors that experts say have pushed Iran's economy into freefall.\n\nLoading...\n\nBut, as Iranians like Ali point out, economic mismanagement and entrenched corruption are at the centre of the country's sick economy.\n\n\"What we want from the world is that 90 million Iranians be rescued from this dictator regime that has stolen our money and is using it for themselves,\" he said.\n\n\"The mafia of the IRGC [Islamic Revolutionary Guard Corp] has taken control of everything.\"\n\nBank collapse exacerbated Iran's financial crisis\n\nA key sign that Iran's economy had reached tipping point was when Iran's largest bank, Ayandeh Bank, collapsed in October.\n\nIran's young are dying for the freedom they see in black and white photos As protests shake Iran, massive crowds rising up against the hard-line mullahs and their supporters have been bolstered by the country's younger generations.\n\nFounded in 2013 by Ali Ansari, a wealthy Iranian businessman, and run by allies of the regime, Ayandeh was more than $A7.3 billion in debt, when it went bust.\n\nIt offered some of the highest interest rates in Iran, attracting millions of depositors.\n\nTo sustain those returns, it borrowed heavily from the central bank, which repeatedly printed money to keep the institution afloat, former deputy director of the IMF's Middle East department Adnan Mazarei told the ABC.\n\n\"The banking system in Iran is bankrupt,\" he said.\n\n\"Iran's banks are in a very weak condition with large non-performing loans, considerable accumulated losses and in order to keep things going they offer high interest rates to depositors.\n\n\"But more important, they have access to central bank liquidity [emergency cash].\"\n\nEconomists and officials had long warned that propping up Ayandeh by printing money from the central bank would drive up inflation.\n\nA customer buys Iranian gold coins at a currency exchange office in Tehran's business district. (Reuters: Raheb Homavandi)\n\nIts flagship investment was the Iran Mall, which opened in 2018 and is reportedly twice the size of the Pentagon, complete with swimming pools, car showrooms, cinemas, and sports complex.\n\nIn October, Iran's judiciary chief threatened legal action if bank authorities failed to act and the central bank announced Ayandeh's closure the very next day.\n\nThe central bank labelled the institution a \"Ponzi scheme\".\n\nThe government ultimately absorbed the bank's debts and forced it to merge with Iran's state-owned lender.\n\nAt least five other banks are reportedly facing a similar fate, raising fears the crisis is far from over.\n\nLoading...\n\n\"Eighty-five per cent of Iran's population are public employees and the government needs to pay their salaries,\" head of economy at the Centre for Middle East and Global Order, Dr Mahdi Ghodsi told the ABC.\n\n\"And when they become bankrupt it's the government that should take the role of paying for that.\n\n\" The way they do that is they go to the central bank and get some more debt, and the central bank prints more money, so it's a vicious cycle. \"\n\nUS sanctions, Iran-Israel 12-day war caused further strain\n\nIn addition to a failure of governance and economic mismanagement, Iran has faced years of US-led sanctions that some commentators say have put its economy under strain.\n\nUN could investigate 'crimes against humanity' in Iran An independent fact-finding mission should investigate potential crimes against humanity committed in Iran, according to a UN-appointed representative.\n\n\"Sanctions did two things: it lowered the level of oil revenue, and it led to restrictions on financial transactions,\" Mr Mazarei said.\n\n\" The circumvention of sanctions created new opportunities for corruption. \"\n\nThe 12-day war between Israel and Iran in June 2025 marked another turning point for Iran's economy.\n\nThe United States was directly involved in the conflict, launching air strikes on Iranian nuclear facilities.\n\n\"The June attack led to pressures on the exchange rate because as soon as they could, people wanted to get out of the rial into foreign currency,\" Mr Mazarei said.\n\n\"That led to a considerable lowering of purchasing power and an increase in poverty.\"\n\nOver the past two years, some of Iran's key allies were also weakened, leaving the country economically vulnerable.\n\nIn late 2024, Syria's president Bashar al-Assad was overthrown, which was one of Iran's most important partners.\n\nIn 2025, Israeli attacks on Hezbollah in Lebanon took out many of the group's leadership, including its longtime head Hassan Nasrallah.\n\n\"All of these have led to a considerable loss of faith and hope inside the country,\" Mr Mazarei said.\n\nCrowds cram into a Beirut stadium to attend the funeral of former Hezbollah leader Hassan Nasrallah. (ABC News: Cherine Yazbeck)\n\nWhile Iran sits on some of the world's largest oil and gas reserves, international sanctions have limited its ability to sell.\n\nSo the regime has turned to selling to China at a discount, Mr Mazarei said.\n\n\"This is a very rich country that cannot use its resources because of a combination of sanctions, domestic mismanagement and a lack [of] technology,\" he said.\n\nThe Islamic Revolutionary Guard controls vast swaths of the country's economy, profiting from airlines, shipping and oil companies.\n\nBut analysts say decades of mismanagement and corruption have widened wealth gaps and left ordinary Iranians struggling even as the state generates revenue from resources.\n\nBack in that small town near Rasht, Ali sums it up this way:\n\n\"In Iran, people are without a good car, without a good life, without good clothing, without medication, a [proper] healthcare system, they can't travel, they don't have internet,\" he said.\n\n\"We just want to be rescued from this and live life like in other normal countries.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2026-01-25/rod-laver-arena-rockhampton-tennis-courts/106261184",
        "title": "Rod Laver's first arena: A backyard court where a legend was born",
        "publish_date": "Sat, 24 Jan 2026 21:17:39 +0000",
        "category": "sports",
        "authors": [],
        "text": "For an academic who studies the significance of sporting places, it seemed almost too good to be true when Dr Kate Kirby stumbled upon a little known tennis court carrying the name of Australian tennis legend Rod Laver.\n\nThe unobtrusive clay court on Main Street, Park Avenue, Rockhampton — 1,900 kilometres away from the 15,000-seat Rod Laver arena in Melbourne — is accessible to any player with the initiative to obtain the key from a grocery store across the road.\n\nFor much of the last 80 years, the backyard court built by Roy Laver for his tennis-mad sons has attracted little attention, despite being the birthplace of an Australian sporting phenomenon. It is, in effect, Australian tennis' answer to the tank stand at Sir Donald Bradman's boyhood home in Bowral.\n\nDr Kirby, whose doctoral thesis on high performance sport in regional Queensland ended up containing a passage on the Laver court, was amazed on two levels.\n\nThe first was that, having herself grown up in the birthplace of the \"Rockhampton Rocket\", she'd never previously heard of the court.\n\nRod Laver has is 11 grand slam singles titles. (AAP Image: Lukas Coch)\n\nThe second was that, despite being lovingly maintained by a dedicated group of volunteers for the last 35 years, the court wasn't and still isn't protected by a heritage overlay. About 15 years ago, the old Laver home abutting it was sold and relocated by owners unaware of its significance.\n\n\"I was surprised,\" Dr Kirby says of the court's uncertain status.\n\n\"This court represents that Australia's best athletes can come from anywhere in the country.\n\n\"You don't have to be living near a metropolitan city, next to the best facilities to become one of Australia's best and most cherished athletes.\"\n\nAccording to Rod Laver, the construction of the court was not just an expression of fatherly love but a move to make sure that Roy Laver's athletically gifted children shared his passion for tennis.\n\nIn fact, it is the second Laver court — the first, which was made from ant hills on a cattle farm in remote Langdale and needed daily watering, perished not long after the Lavers relocated, first to Marlborough and then Rockhampton.\n\nIn Rocky, the Laver family lived in a classic Queenslander on a block Roy Laver chose for its capacity to accommodate the court he and sons Trevor, Bob and Rod duly built with soil and silt trucked in from the Fitzroy river.\n\nRod Laver (centre, holding sign) was a schoolboy at Park Avenue Primary when his father Roy built a clay tennis court in the backyard of the family home. (Supplied)\n\n\"This time, we fitted out our home court for night play by stringing four 1500-watt light bulbs on an overhead wire down the centre of the court,\" Laver wrote in his autobiography.\n\n\" Any of us kids who broke a bulb with a lob or smash was in for it. \"\n\nThe court was a magnet for local players, including another future grand slam champion, Mal Anderson. The youngest of the Laver boys by four years, Rod was sometimes kicked off the court and had to content himself with hitting against a wonky wall, whose unpredictable bounce developed the reflexes and footwork that would later serve him so well as a pro.\n\nAccording to Laver, the most fateful of the visitors at the backyard court was Charlie Hollis, the army veteran turned tennis coach who would change his life. Sweetened up with a rum and milk, Roy Laver convinced Hollis to coach his sons for free, and in time, he would play a part in the rise to the top of not just Laver, but Anderson, Fred Stolle and Roy Emerson.\n\nRod Laver (seated, bottom) with his family, LR: brother Bob, mother Melba, father Roy and brother Trevor, in the years before the Lavers made their move to Rockhampton. (Supplied)\n\nLaver's recollection of what followed still resonates:\n\n\"The first time Charlie laid eyes on me, I was 10 and he was putting Bob and Trevor through their paces. I'd crept out of bed to watch them and was peeping at them through the chicken wire perimeter fence of our court when he spied me. Before I could run away, he said to Dad, 'Aw, let the little bugger have a hit. I can see he's keen as mustard'. And there, under the 1500-watt bulbs, barefoot and in my pyjamas, Charlie and I had a knock, and I got that ball back over the net more times than I didn't.\"\n\nEleven grand slam singles titles and 80 years later, promising juniors can still drop by Main Street Park Avenue to sample that rare thing: a clay court in Rockhampton.\n\nSue Young's eyes light up when she's asked what Rod Laver means to the Rockhampton tennis community. \"He is a true gentleman… and he's my hero,\" Young says. She is a member of the Rod Laver Tennis Club and one of the Rockhampton court's current custodians.\n\nIndeed, the club itself was formed in 1991 amid fears that the court, then in a state of disrepair, would be bulldozed and built over. In the 35 years since, with some financial assistance from the local parish and a can-do attitude, the club has restored the court to its former glory and maintained it admirably.\n\nAmong other volunteers from the Rod Laver Tennis Club, Sue Young has spent decades lovingly maintaining the clay court built 80 years ago by the Laver family. (ABC: Russell Talbot)\n\nYoung figures that only one in 10 locals even know of the court, a matter the club has tried to address with signage, and the rebranding of the entire club, previously known as the Park Avenue Parish Social Tennis Club.\n\n\"Playing on the clay court is amazing,\" Young says. \"I believe it is the only clay tennis court available in the community in Rockhampton. It's different than playing on other surfaces.\"\n\nAnd yes, she says, the stories of it being accessible via an old-timey honour system are true. \"We have a little shop across the road, the Foodworks, [that] has held the key for 25 years now,\" Young says.\n\nKeys to the court\n\n\"You can just go over there and ask for the key of the court facilities here. You come over, open it up, use it and just return [the key]. It's open to the community seven days a week.\n\n\"We wanted it to be very accessible to the community. \"Some people like to say Melbourne has the RLA, but we have the RLC here in Rockhampton.\"\n\nTo this day, Young says, promising junior players who are destined for bigger and better things are eager to experience a clay court. But like a lot of community club members, she is worried about what the future holds.\n\nThe Rod Laver court has undergone decades of repairs to keep the local sporting landmark alive. (Supplied)\n\n\"As the tennis club members get older, sometimes we are concerned that the younger generation aren't coming forward to look after it,\" Young says.\n\n\"Will it be here in another 20 years? The present members are reaching our 70s now. It is a bit of a worry, and it would be a shame because the experience of playing on a clay court is amazing. I don't know how we address and how we get younger people interested in coming and helping look after the court.\n\n\"It is four or five hours a week [of work] to get the court ready for use.\"\n\nCourt preservation\n\nShe says the club is very open to any move that would ensure the court's preservation and ongoing use, but would \"want to look at the parameters of heritage listing\" to make sure appropriate guard rails are in place. For members it is, above all else, a place to play.\n\nLaver, for his part, has been back several times — including an impromptu hit in 2012. \"I think I screamed when he left,' Young says. \"He gave us a big hug and said he totally appreciates the effort we go to to keep the court looking so nice.\"\n\nRod Laver chats with volunteers at the Rod Laver Tennis Club in 2012, when he made his last pilgrimage to the court his father built him as a young boy. (Supplied)\n\nYoung says it is \"a little bit disappointing\" that neither the local council nor Tennis Queensland helps out with the court, either financially or by promoting its pivotal role in the sport's history in Queensland.\n\n\"No one is interested, and I find it amazing that people aren't interested,\" says Young. \"It's not even on the list at the tourist information centre. Tourists would love to come and hit. It might keep people another day in Rockhampton. The club is only small and our time is taken up keeping it nice and playable.\"\n\nBattle for heritage listing\n\nDr Kate Kirby says that, ideally, the court would be heritage listed in such a way that it continues to function as it presently does, with anyone able to play on it, but is prevented from being altered or built over.\n\nDr Kate Kirby stumbled upon the story of the Rod Laver court while completing her Doctor of Philosophy. (ABC: Michael Lloyd)\n\n\"Rockhampton doesn't have a local heritage register, so what I'm most interested in now is, given Laver's reputation and just the cultural value of this court to the community and for Queenslanders in the future, is to focus on trying to get it listed at the Queensland [state] level,\" Dr Kirby says.\n\nThough the Rockhampton Regional Council confirmed it had \"no position\" on the heritage matter, Mayor Tony Williams said that given the history of the court and Laver's status in the local community, it was \"only prudent\" that the court be preserved for future generations.\n\n\"We've positioned ourselves as a sporting hub, and why not go to your history and someone like Rod and having that history of that court in the Park Avenue area there would be a great example of what that history could look like — building on the future and preserving the past,\" Williams said.\n\n\"It would have my full support and, and I'd say, in principle, council support too.\"\n\nIn the absence of a local heritage register, heritage protection of the Laver court would need to be driven by the Queensland government. (ABC: Russell Talbot)\n\nCome what may, Sue Young and the other volunteers at the Rod Laver Tennis Club will keep the court tidy and available to the public for as long as possible.\n\n\"We can only hope and keep pushing,\" Young says. \"Hopefully in another 50 years it's still here.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.smh.com.au/sport/tennis/sabalenka-extends-historic-tiebreak-streak-20260125-p5nwu6.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Sabalenka extends historic tiebreak streak",
        "publish_date": "Sun, 25 Jan 2026 13:26:36 +1100",
        "category": "sports",
        "authors": [],
        "text": "Sabalenka extends historic tiebreak streak\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/tennis/australian-open-2026-live-updates-de-minaur-takes-on-bublik-teen-star-faces-up-to-sabalenka-alcaraz-charges-closer-to-title-aussies-in-doubles-action-20260124-p5nwr9.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Australian Open 2026 LIVE updates: Sabalenka surges into quarter-finals; Aussie defending champs win; De Minaur takes on Bublik; Alcaraz in action",
        "publish_date": "Sun, 25 Jan 2026 13:21:17 +1100",
        "category": "sports",
        "authors": [
            "Scott Spits",
            "Billie Eder",
            "Roy Ward"
        ],
        "text": "World No.1 Aryna Sabalenka has just spoken after her fourth-round victory, after teenager Victoria Mboko pushed her to the limit in that second set.\n\n“What an incredible player for such a young age. It’s incredible to see these kids coming up on tour,” she said.\n\nA wave for the fans. Credit: AP\n\n“I can’t believe I say that, I feel like a kid still. Incredible player, pushed me really hard today. Super happy with the win ... she played incredible tennis, she pushed me so much.”\n\nSpeaking on her incredible tie-break record – now 20 in a row at grand slam level – Sabalenka said she wasn’t sure what the secret to her success was.\n\n“I just go into the tie-breaks, I try not to think that this is a tie-break, play point-by-point, and I guess that’s the key to this consistency.”",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/tennis/rugby-stars-hit-australian-open-20260125-p5nwu4.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Rugby stars hit Australian Open",
        "publish_date": "Sun, 25 Jan 2026 13:17:11 +1100",
        "category": "sports",
        "authors": [],
        "text": "Rugby stars hit Australian Open\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/nsw/sydney-swans-player-knocked-unconscious-at-new-hemmes-venue-20260125-p5nwtr.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Sydney Swans player knocked unconscious at new Hemmes venue",
        "publish_date": "Sun, 25 Jan 2026 12:49:56 +1100",
        "category": "sports",
        "authors": [
            "Chris Barrett"
        ],
        "text": "Advertisement\n\nNationalNSWSydney Swans Sydney Swans player knocked unconscious at new Hemmes venue Chris Barrett January 25, 2026 — 12:49pm Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share A A A\n\nVeteran Sydney Swans midfielder Taylor Adams was knocked unconscious in an incident at hotelier Justin Hemmes’ new eastern suburbs venue on Saturday night. The 32-year-old was taken to hospital for treatment after being punched in the face during an altercation with two men at Club Rose Bay. Taylor Adams has been recovering from an Achilles injury. AAPIMAGE NSW Police said officers were called to the premises just after 10pm on Saturday night following reports of an assault. “Officers attached to Eastern Suburbs Police Area Command attended and were told a 32-year-old man was involved in an argument and a subsequent assault with two men,” police said.\n\nAdvertisement\n\n“The 32-year-old man was allegedly punched in the face by one of the men, causing a small cut to his cheek, as well as being knocked to the ground, where he lost consciousness briefly. “The men left prior to the arrival of police. Police have been told the two men are not known to the 32-year-old man.” Club Rose Bay re-opened in December under the management of Merivale. Sitthixay Ditthavong The Swans have been contacted for comment. Adams has been recovering from a partial Achilles tear he suffered at pre-season training in mid-December after playing only four matches last year due to injury.\n\nAdvertisement\n\nRelated Article House of Merivale Merivale’s pokie empire expands to Rose Bay He joined the Swans in 2024 after a decade at Collingwood, where he was the club’s best and fairest player 2020 as well as winning All Australian honours. He featured in the Magpies’ narrow defeat to West Coast Eagles in the 2018 grand final but missed out on playing in Collingwood’s 2023 premiership win over Brisbane because of a hamstring injury. Adams was drafted by the Greater Western Sydney Giants in 2011 and played 31 games for the AFL expansion team before heading to Melbourne. He was treated by NSW Ambulance paramedics before being taken to St Vincents Hospital for further treatment.\n\nAdvertisement\n\nPolice said inquiries were continuing into the incident. Club Rose Bay re-opened in December after being given a makeover by Hemmes-led hospitality giant Merivale, which is managing the venue. It had been closed since August 2024, when it was placed into administration with debts of $600,000. The redeveloped club features a retro cocktail bar with a 1960s airport theme, a sports bar and a beach bar with a pickleball and basketball court, as well as an Italian restaurant called Notti’s. The re-opening drew a queue down the street as patrons turned out for a look inside the decades-old RSL club. Be the first to know when major news happens. Sign up for breaking news alerts on email or turn on notifications in the app.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/culture/live-reviews/rawness-and-urgency-in-couple-s-sydney-festival-dance-debut-20260125-p5nwtj.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Rawness and urgency in couple’s Sydney Festival dance debut",
        "publish_date": "Sun, 25 Jan 2026 12:47:57 +1100",
        "category": "finance",
        "authors": [
            "Chantal Nguyen",
            "Kate Prendergast"
        ],
        "text": "Advertisement\n\nCultureLive reviewsStage shows Rawness and urgency in couple’s Sydney Festival dance debut Chantal Nguyen and Kate Prendergast January 25, 2026 — 12:47pm Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share A A A\n\nDANCE\n\nSISA-SISA\n\nBankstown Arts Centre, January 23\n\nReviewed by CHANTAL NGUYEN\n\n★★★★ The double bill SISA-SISA (Indonesian for “the remains” or “remnants”) marks the Sydney Festival debut of the extraordinary husband and wife duo Murtala and Alfira O’Sullivan, co-directors of the Indonesian cultural company Suara Dance. Comprising two autobiographical solos, SISA-SISA represents long-awaited recognition for the couple, who have spent years channelling their energy into dance troupe choreography. Alfira O’Sullivan in SISA-SISA. Victor Frankowski Both husband and wife possess an artistic maturity that makes its presence felt immediately: the kind that sears with intense honesty and a stage presence earned after only decades of experience.\n\nAdvertisement\n\nO’Sullivan’s work, Jejak & Bisik (which can be translated to “traces and whispers”), explores O’Sullivan’s life as an ageing female dancer caught in the crosshairs of unrelenting professional demands, motherhood and community leadership, and a traumatic misdiagnosed miscarriage. Alfira and Murtala O’Sullivan in the Sydney Festival show SISA-SISA. Victor Fankowski As O’Sullivan changes costumes and fixes her hair on stage, her mobile phone buzzes with voice messages while emails from a management company pop up on-screen. A polite corporate voiceover reads them out: As O’Sullivan’s profession is relegated to “the multicultural stage” and deemed unsuitable for “mainstream” white Australian audiences, it will be subject to various constraints including a fee reduction. Could she create a dance piece for a conference, sandwiched between the Monday morning speaker and the keynote speaker, designed to keep people awake? Using her community troupe? For less than $500? During a period when she is recovering from reproductive surgery? O’Sullivan, blessed with a striking natural glamour, demonstrates a beautiful sense of embodied theatricality and poise as she communicates this emotional journey. Murtala’s piece, Gelumbang Raya (which can be translated as “the Great Wave”), is his danced memory of recovering the bodies of victims of the Boxing Day Tsunami. A local of Aceh, Murtala returned after the tsunami as a disaster relief volunteer, working with survivors and — quite literally — staring death in the face as he carried thousands of bodies out of the mud.\n\nAdvertisement\n\nGelumbang Raya is haunting in its rawness and urgency, performed on a stage strewn with sand and visual projections of tides washing in and out. It incorporates Acehnese body percussion, singing, and the frame drum — 11 of which lie buried in the sand, like lives frozen in time by the tsunami. One of the piece’s final images — Murtala, lifted upside down in a head stand amidst the sand, singing in a piercing tenor as the drums lie around him — lands like a rip in your gut. THEATRE\n\nASSES.MASSES\n\nDrama Theatre, Sydney Opera House, January 24, until January 25\n\nReviewed by KATE PRENDERGAST\n\n★★★½ By the fourth hour, you’ve entered a state of trance. Your communal gaming herd is cheering on a self-elected temporary controller who’s playing a version of Guitar Hero in the Sydney Opera House to get a donkey to maximise who’s playing a version of Guitar Hero in the Sydney Opera House to help a donkey maximise its fornicating delights. This is Sick Ass, one of many donkey avatars, who’s just reached the Astral Plane (aka donkey heaven) as a casualty in the worker-animal uprising. What began as a peaceful protest against the human overlords’ exploitative machine-first system went horribly wrong, leading to death, displacement and disunification within the movement.\n\nAdvertisement\n\nYour own ass is getting sore. Level complete, you all break for snacks. The audience may have thinned after the third interval, with another four hours to go. But those who are spiritually invested for the long haul in this multidisciplinary, multidimensional epic and graphic radical allegory are all in – and rewarded for their loyalty. Travelling through farm and village, circus and abattoir, nightmare and nirvana; through hundreds of ass puns and inventively obscene animations, while conquering button-mashing challenges and philosophical puzzles, we become a pack immersed through live social experiment in a stunningly rendered universe – comrades in a common goal towards “true progress”, united by the liberating mindset of play. Canadians Patrick Blenkarn and Milton Lim are behind the asses.masses project, brought to Sydney Festival for one weekend, and touring as far as Finland, Istanbul and Chicago next. Conceived with vast ambition, a collectivist sensibility and total nerd passion, it’s a unique animal of modern participatory theatre, using the language of video games and dorm-room humour to tell its staunch and timeless revolutionary tale. The game art is truly dope. The “material world” is built with nostalgia-infused pixels, its textures, dialogue boxes, tessellated realms and soundscapes recalling Legend of Zelda or Pokemon. The “astral plane” is of the realism style, transporting us to sublime desert canyons (where donkey souls rave) and rolling infinity pathways (where the player-crowd yells “don’t do drugs!” when a power-boost orb appears). Classics games such as Space Invaders and Pac-Man are built into the narrative to either create obstacles, or simply offer fun little inconsequential diversions. For example, we spent a gleefully inordinate amount of time in the mines getting the donkey foal avatar (whom we voted to name Bitch Ass) to play a version of Pong called Rocks. Later, another controller has Hard Ass hoof-kick a swarm of riot policeman dead a la Karate Champ. The difficulty level ramps up on our quest, with veteran pros stepping up to earn our thunderous applause.\n\nAdvertisement\n\nFar closer to Animal Farm than Animal Crossing, there are some intentionally lurid depictions of violence, particularly against humans – from the life-like screams of burning villagers, to a factory worker getting eviscerated by his own meat hook. Most hilariously macabre is a grim, surreal sequence in which Hard Ass has to sacrifice himself many times to create a corpse bridge for/of himself over a bloody trench. Obviously, with scores of people in the room, not everyone gets (or wants) a go at the controller. The majority are basic spectators – our ‘agency’ limited to adding to the cacophony of yelled dialogue options and directions, jokes and commentary. More theoretically than actually active, the player-herd moves through cycles of elation and fatigue, agony and ecstasy, frustrated boredom and shared jubilation. The durational aspect can take you to the edge: at one point I found myself cry-laughing at the excessively cautious way a controller was moving a mutinous gang of equines hidden inside packing boxes. During the seventh hour, we spontaneously rose to our feet to sing the “song of ascension”, a donkey funeral dirge. Would I have better enjoyed this marathon on a friend’s sofa, where we could have a more equitable share of the controller, and partake of snacks superior to Doritos and dry vegan buns? Sure. But enjoyment isn’t the only marker of a worthwhile experience. Sometimes you have to endure the discomfort to come out the other side, finding yourself, in some way, new.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/tennis/ousted-ukrainian-player-aims-another-political-shot-at-sabalenka-20260125-p5nwta.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Ousted Ukrainian player aims another political shot at Sabalenka",
        "publish_date": "Sun, 25 Jan 2026 12:20:36 +1100",
        "category": "sports",
        "authors": [
            "Billie Eder"
        ],
        "text": "The Ukrainian player who took aim at Aryna Sabalenka and other Belarusian and Russian players earlier this week, claiming they should be banned by the sport because of their countries of origin, has hit out at the world No.1 again following her collaboration with Gucci.\n\nUkrainian Oleksandra Oliynykova told this masthead earlier this week that the presence of top Belarusian and Russian players on tour and at grand slams was “very wrong”, despite the fact they do not compete under their countries’ flags.\n\nBelarusian Sabalenka, who is playing in the fourth round against Canadian Victoria Mboko on Sunday, has previously repeatedly said that she didn’t support the Russian invasion of Ukraine or Belarusian President Alexander Lukashenko, and that she only wanted peace in Ukraine.\n\nHowever, the Ukrainian world No.92 has since taken to social media to comment on Sabalenka’s collaboration with Gucci, which was announced three days ago.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/tennis/what-osaka-bombshell-means-for-ao-20260125-p5nwts.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "What Osaka bombshell means for AO",
        "publish_date": "Sun, 25 Jan 2026 12:08:03 +1100",
        "category": "finance",
        "authors": [],
        "text": "What Osaka bombshell means for AO\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/tennis/ukrainian-player-targets-world-no-1-aryna-sabalenka-on-social-media-20260125-p5nwtp.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Ukrainian player targets world No. 1 Aryna Sabalenka on social media",
        "publish_date": "Sun, 25 Jan 2026 11:44:05 +1100",
        "category": "sports",
        "authors": [],
        "text": "Ukrainian player targets world No. 1 Aryna Sabalenka on social media\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/business/entrepreneurship/medicinal-cannabis-dispensaries-like-aesop-the-rise-of-high-street-weed-boutiques-20260121-p5nvwa.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Medicinal cannabis dispensaries ‘like Aesop’: The rise of high street weed boutiques",
        "publish_date": "Sun, 25 Jan 2026 11:09:43 +1100",
        "category": "finance",
        "authors": [
            "Jessica Yun"
        ],
        "text": "Advertisement\n\nBusinessEntrepreneurshipLegal Cannabis Medicinal cannabis dispensaries ‘like Aesop’: The rise of high street weed boutiques Jessica Yun January 25, 2026 — 11:09am Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share A A A\n\nIn Melbourne’s cosmopolitan South Yarra is a glossy glass-walled dispensary. Wood-panelled shelves are lined with pothos plants, palm-sized boxes and protein powder-looking packets. It’s a fully licensed pharmacy, but the casual browser could easily mistake it for a high-end skincare boutique. It happens all the time. “We get a lot of walk-in patients who don’t know what we are. A lot of the times they think we’re like Aesop,” says pharmacist and Astrid Clinic and Dispensary founder Lisa Nguyen. Lisa Nguyen, pharmacist, founded Astrid Healthcare, a medicinal cannabis dispensary with outlets in South Yarra and Byron Bay. Danielle Smith Founded in 2021, Astrid was one of the first of a growing number of upscale medicinal cannabis dispensaries that are starting to pop up on Australia’s busiest shopping strips. An eight-minute walk away from Astrid is “boutique pharmacy” V22 Dispensary. In Sydney’s Enmore, there is High St, a mustard-yellow shopfront that has the vibe of a record store; 500 metres up the road in Newtown is True Green Dispensary, where you can only purchase things such as incense, hemp seed oil or skincare made from tallow – unless you have a script for something stronger.\n\nAdvertisement\n\nIt’s a far cry from the traditional pharmacy presided over by a dour man in a white coat, or the harsh fluorescent lights and raw concrete floors of a Chemist Warehouse. Sleek and inviting, the new boutiques are staffed by registered pharmacists and cater to the 2.4 million Australians who are turning to marijuana through legal means, according to the Australian Institute of Health and Welfare’s latest household survey on drug use. More than one in 10 (11.6 per cent of) Australians consumed a combined 7.4 million units of medicinal cannabis products last year, according to Penington Institute’s Cannabis in Australia 2025 report. By 2023, Australians are forecast to spend $1.3 billion on medicinal cannabis, according to market research firm IMARC Group. Five years after opening Astrid, Nguyen still gets DMs from people who seek advice on how to open a high-end ‘specialist pharmacy’ of their own. “So many people are starting to do it now,” she says. The front entrance of High St, a medical cannabis dispensary in Enmore, Sydney. KATE GERAGHTY These dispensaries can appear both alluring and mysterious. It’s not immediately clear what they dispense: you won’t find references to weed, marijuana, pot or even cannabis. The Therapeutic Goods Administration (TGA) prohibits the advertising of any prescription-only medicine, including cannabis, forcing dispensaries to market their services using hazy phrases like “alternative medicine”, “natural therapies” and “holistic health”.\n\nAdvertisement\n\nThe prohibition is designed to safeguard the doctor-patient relationship over commercial interests, where advertising and marketing can drive consumer demand for medication that doesn’t suit them or is too expensive. “If you are a business that promotes treatment services, you need to take care to ensure that you are not, in addition to promoting your services, also promoting medicinal cannabis,” the TGA states. Fear of regulatory scrutiny has forced specialist dispensaries to hide in plain sight. “It’s very, very discreet. There’s not even a picture of the cannabis plant, because you can’t advertise that,” says Nguyen. “That social stigma around cannabis has decreased a lot. That doesn’t mean it’s gone,” she added. “The industry is moving very rapidly, in terms of products. There are so many more patients now, so many products, but the policy is slow.” True Green Health Dispensary on King Street in Newtown, NSW. KATE GERAGHTY\n\nAdvertisement\n\nIn the weeds For the uninitiated, medicinal cannabis dispensaries can create confusion because they don’t fall neatly into two categories people grasp more intuitively: a traditional pharmacy, or a recreational weed store you might walk into in San Francisco or Amsterdam. None of the items on open display contain cannabis. As with any prescription medicine, you must present a script to a pharmacist. About 80 per cent of Australia’s 6000 community pharmacies have dispensed medicinal cannabis at least once, but many doctors remain hesitant to prescribe cannabis. Most products are not officially registered with the TGA. “We’ve seen a concentration of medicinal cannabis prescribing among a smaller number of GPs and nurse practitioners and pharmacists. I suspect that the bricks-and-mortar services are one way of accessing patients,” says public-health think tank Penington Institute chief executive John Ryan.\n\nAdvertisement\n\n“There are a lot of plain-Jane access points, telehealth access points. I think these services are more geared to try create a niche within that ecosystem of prescribers.” Editor's pick Investigation\n\nLegal Cannabis Cannabis Inc: Australia’s booming medicinal weed industry The inviting atmosphere of a health and wellness centre can convert an onlooker’s curiosity into conversation and address lingering taboos around cannabis. They could also lure in new customers. “[The dispensary] makes it real, makes it accessible. There are so many online businesses that don’t seem real,” says Nguyen. “So much of Astrid is people coming in and knowing all of our pharmacists and doctors by name. We know all their backgrounds. It’s a community.” Incidental conversations between fellow patients can lead to more. “We’ve even had people start dating.”\n\nAdvertisement\n\nA medicinal cannabis patient may feel uncomfortable visiting a normal chemist because of inherited stigma around cannabis, says Penington Institute’s Ryan. ‘Leaf Doctor’ sign at the rear of True Green Health Dispensary located on King Street in Newtown, NSW. KATE GERAGHTY “You can imagine that from the patient journey perspective, getting this calming health spa vibe is probably addressing their own internalised anxiety around medicinal cannabis,” he says. This new wave of Australian dispensaries are taking their design cues from more mature overseas markets like the US. “It was the whole rebrand – taking it from the street into a clinic in a legal setting,” says social impact investor Kyah Bell. But many of these clinics appear to be using the same pricing models around initial consults, follow-up consults and product pricing, she added.\n\nAdvertisement\n\nHealthcare and wellness has been earmarked as an economic ‘megatrend’ for years. Chemist Warehouse’s $32 billion back-door float made billionaires of its pharmacist founders. More broadly, the Australians’ rapid uptake of weight loss drugs Mounjaro and Wegovy has highlighted just how money there is to be made in the healthcare sector. Many of Australia’s largest cannabis businesses operate online, operating via video-call consultations with doctors and shipping direct from a pharmacy. But that has opened a lane for the dedicated medicinal cannabis dispensaries to carve out their own share of the market with unique brands and inviting stores. “Competition has a lot to do with the design, because everybody’s trying to own part of that market,” says Bell. “I rarely see any other GP clinics advertising in the same way that cannabis clinics are.” Not quite legal\n\nAdvertisement\n\nAustralia’s peculiar patchwork rules around cannabis consumption and advertising has bred a reluctance among clinics and dispensaries to attract attention for fear of falling afoul of the rules. When contacted by this masthead, Sydney’s High St and True Green Dispensary declined to be interviewed. Related Article Exclusive\n\nInvestigations There’s a loophole in telehealth – the industry ‘drove a Mack truck through it’ Recreational use is still an offence everywhere in Australia bar the ACT, despite legalisation of medicinal cannabis a decade ago. Criminal suppliers are making over $5 billion a year from the illicit market, and billions spent on enforcing “outdated and counterproductive” criminalisation laws have not dented supply or use, according to Penington Institute’s Cannabis in Australia 2025 report. “In the best of worlds, we would have had a regulated market for adult use cannabis simultaneously with medicinal cannabis for people with genuine health conditions that need treatment,” says Ryan. “It’s a very bumpy, lumpy sort of way of approaching regulation of this substance.”\n\nAdvertisement\n\nReports of those who are gaming the system have been widely publicised: a proliferating telehealth industry has sparked concerns about unsafe practices after this masthead revealed that a single doctor wrote 72,000 prescriptions to 10,000 patients in two years. Therapeutic Goods Administration chief medical adviser Robyn Langham raised concerns about the “abuse” of medical prescriptions for recreational use. “Most doctors behave very responsibly, but some of them don’t, and the ones that don’t need to be chased down,” says Ryan. “They wreck the reputation of the whole sector.” Many of Nguyen’s patients are dealing with complex pain issues, like endometriosis patients who also have insomnia or anxiety. Having a clinic and a dispensary in the same premise means health professionals and pharmacists can accompany the patient throughout the entire process. “We have the whole experience down pat,” she says. Some walk-ins will say cannabis is not for them, but most interactions are educational.\n\nAdvertisement\n\n“Most of them are like, ‘my mum’s got arthritis. Do you think it will be helpful?’ That’s a very common question.” The Business Briefing newsletter delivers major stories, exclusive coverage and expert opinion. Sign up to get it every weekday morning.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/tennis/tjs-pickleball-joke-after-on-air-tumble-20260125-p5nwtc.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "TJ's Pickleball joke after on-air tumble",
        "publish_date": "Sun, 25 Jan 2026 10:57:21 +1100",
        "category": "finance",
        "authors": [],
        "text": "TJ's Pickleball joke after on-air tumble\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.sbs.com.au/news/article/who-is-the-average-australian-january-26/x7yorayup",
        "title": "Who is the 'average' Australian? We've run the numbers to find out",
        "publish_date": "Sat, 24 Jan 2026 19:33:58 +0000",
        "category": "finance",
        "authors": [],
        "text": "More than 100 years ago, the typical Australian was a 24-year-old male. Today, it's a 38-year-old woman.\n\nThat statistic captures just one of the ways the country has changed since the Australian Bureau of Statistics (ABS) began conducting its Census surveys in 1911.\n\nThe first survey — which took place more than 100 years after the First Fleet arrived in 1788 — counted 4.4 million people in Australia. That number didn't include Aboriginal or Torres Strait Islander communities.\n\nOnly \"full-blooded Australian Aboriginals\" in the employ of white settlers or those living in the vicinity of settlements were recorded, and in 1911, there 19,939 were counted — 11,385 of which, were men.\n\nThe 'average' Australia is a 38-year-old woman who was born in Australia and speaks English at home. Source: SBS News\n\nThe picture remained largely incomplete until a full count of First Nations people was mandated in the 1967 referendum. The most recent Census in 2021 tells us that 3.2 per cent of Australia's total population of 25 million people identify as Aboriginal or Torres Strait Islander — approximately 812,000 residents.\n\nAustralia's population has also ballooned since that first Census, and as of June 2024, is now estimated to be 27 million.\n\nSo, on the eve of January 26, SBS News wanted to ask: who are we, really?\n\nLet's find out.\n\nWe were born in Australia and live in major cities\n\nAlmost 70 per cent of residents were born in Australia, according to Australian Institute of Health and Welfare (AIHW) estimates from June 2023.\n\nTasmania has the highest Australian-born population (79 per cent), while Victoria has the lowest (65 per cent).\n\nThe overwhelming majority of Australians live in major cities — making up 73 per cent of the population.\n\nA quarter live in inner regional and outer regional areas, while the remaining 1.9 per cent live in remote and very remote areas.\n\nOctober 2024 housing in western Sydney, as seen from the air. Source: AAP / Dean Lewins\n\nThree-bedroom homes are the most common form of housing, according to the 2021 Census, with 37 per cent of Australians living in a three-bedroom property. However, those in Western Australia are more likely to live in a four-bedroom home, with 37 per cent doing so.\n\nWe're married and have more than one child\n\nA couple with children is still the most common family composition in Australia, representing almost 30 per cent of residents, according to Census data from 2021.\n\nThis trend is consistent across most jurisdictions, except South Australia, Tasmania and the Northern Territory, where couples with no children are more common.\n\nMost families have at least two or more children in Australia. Source: SBS News\n\nThe average number of children per family in Australia is 1.8, and 58 per cent of families have two or more children in the household.\n\nAround a third of Australians are married, and this is the most common marital status response everywhere except the NT, where \"not married\" is the most common answer (29 per cent).\n\nWe earn around $1,436 per week\n\nThe median wage for Australians is $1,436 a week ($74,672 a year) before tax, so if you earn more than this, your income is higher than half of all working Australians.\n\nIf you're working full-time, the median is higher, rising to $1,887 a week before tax ($98,124 a year), according to the latest ABS employee earnings release published on Friday.\n\nThe median for men is even higher — $1,994 a week — which equates to $103,688 a year. For women working full-time, it is $1,758 a week ($91,416 a year).\n\nWe're a nation of migrants\n\nAustralians are slightly more likely to have at least one parent born overseas (48 per cent), than for both parents to be born in Australia (46 per cent).\n\nBut the picture can vary widely depending on which state you live in.\n\nIn Queensland, South Australia, Tasmania and the NT, residents are more likely to have both parents born in Australia.\n\nAlmost half of all Australians have at least one parent born overseas.\n\nNotably, 67 per cent of Tasmanians report both parents were born in Australia.\n\nBut in other states, you are slightly more likely to have at least one parent born overseas. In Western Australia, 56 per cent of residents had at least one overseas-born parent.\n\nBut we mostly speak English at home\n\nAround 72 per cent of residents speak English at home, nationally — this increases to 86 per cent in Tasmania.\n\nThe second most common language is Mandarin, with 2.7 per cent speaking it at home. It holds this rank in every jurisdiction except the NT, where Kriol is the second most common language. The NT also has the highest proportion of people who speak a language other than English (32 per cent).\n\nThe most common ancestry in Australia is also English (32 per cent), which remains the top response in all jurisdictions, except the NT, where 24 per cent are Australian Aboriginal.\n\nMost Australians speak English at home. Source: Getty / Maskot/Maskot\n\nMigrants are also commonly from England\n\nFor those not born in Australia, the most common birthplace is England, with 4 per cent being of English origin.\n\nBut this varies widely depending on the state or territory.\n\nIn NSW, migrants were most commonly born in China (3 per cent); in Victoria and ACT, India was the most common birthplace (around 4 per cent); in Queensland, New Zealand (4 per cent); and in the NT, it was the Philippines (3 per cent).\n\nREAD MORE How multicultural is your suburb?\n\nWe're slaves to our mortgages\n\nThe most common housing tenure type — which describes whether a property is owned or rented — in Australia is a home owned with a mortgage. Nearly a third of Australians (30 per cent) are in this situation.\n\nBut the picture changes if you live in NSW and the NT, where it's more common to rent (28.5 per cent of people rent in NSW, and 37.5 per cent in the NT).\n\nIt's a completely different story in Tasmania, where it's more common for people to own their homes outright, with 32 per cent doing so.\n\nTwenty years ago, it was most common for Australians to own their home outright (that is, without a mortgage), with 30 per cent doing so in 2006. But by 2011, this changed to owning a home with a mortgage (30 per cent ).\n\nIn NSW, the shift has been even more stark, with renting now the most common response (29 per cent).\n\nRenting was the most common housing tenure in NSW in 2021, according to ABS Census data, but in 2006 people were more likely to own their home outright. Source: SBS News\n\nWe own two cars\n\nThe typical Australian owns two cars, with 34 per cent having access to two vehicles.\n\nBut in NSW and the NT, it is more common to own just one car (35 per cent in NSW and 32 per cent in NT).\n\nWe're getting older, and more of us are female\n\nThe median age in Australia is 38, but some jurisdictions skew older or younger. In Tasmania, the median is 42, while in the NT, it's 33.\n\nAustralians are getting older. In 2001 the median age was 35.7, and in 1911, the median age was 24.\n\nTasmania has a higher proportion of older residents, while the Northern Territory has a higher proportion of younger residents, than other areas of Australia. Source: SBS News\n\nWe are also slightly more likely to be female, with 51 per cent of the population identifying as such.\n\nThis holds true for every state and territory except the NT, where 50.5 per cent are male.\n\nMore than half of all men aged 15 and over do some housework each week — 56 per cent perform up to 14 hours of unpaid domestic duties — but 27 per cent did none.\n\nAround 25 per cent of women did no housework, but 46.15 per cent reported completing between five and 29 hours of unpaid domestic duties in one week.\n\nFor the latest from SBS News, download our app and subscribe to our newsletter.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/after-a-night-out-men-and-women-face-very-different-heart-health-risks/fp2srcqjf",
        "title": "After a night out, men and women face very different heart health risks",
        "publish_date": "Fri, 23 Jan 2026 21:25:01 +0000",
        "category": "lifestyle",
        "authors": [],
        "text": "New research has found that your sex and alcohol intake could be related to your risk of developing a \"major\" condition called atrial fibrillation, which could lead to stroke or heart failure.\n\nAustralian and Swedish analyses of past studies have found that while one standard drink a day affects both men and women the same, between one and four standard drinks a day increased the risk of the condition for men only.\n\nHowever, at higher levels of consumption of six standard drinks a day, women had a significantly higher risk to their heart health when compared to men.\n\nMohammad Hossein Hadi, a research fellow at the University of Melbourne, was an author of the study.\n\n\"The sex-specific pattern we observed may reflect a mix of factors, including biological differences, such as alcohol metabolism, hormonal influences, and body composition,\" he told SBS News.\n\nAustralian health guidelines recommend no more than 10 standard drinks a week for men and women, while other experts have told SBS News there is \"no safe amount\" of alcohol consumption.\n\nThere is a daily recommended limit of no more than four standard drinks a day.\n\nWhat is atrial fibrillation?\n\nAlcohol consumption can lead to a range of health issues, including atrial fibrillation, a common heart rhythm disorder.\n\nHadi described it as a \"major heart condition\" that presents similar symptoms in men and women.\n\n\"Some people are asymptomatic, while others have persistent symptoms that affect daily functioning,\" he said.\n\n\"Some people notice palpitations, shortness of breath, fatigue, dizziness, or reduced exercise tolerance, while others have no symptoms and are diagnosed incidentally.\"\n\nHe said that atrial fibrillation can increase a person's morbidity and mortality, often requiring ongoing management.\n\n\"It is associated with a substantial health burden.\"\n\nWhile the relative risk of atrial fibrillation differed between men and women based on intake, risk increased across the board among people who drink more frequently.\n\nDifferences in men and women\n\nRachel Visontay, a postdoctoral research fellow at the University of Sydney, explained that different groups of people break down alcohol at varying rates.\n\nMen are more efficient at metabolising alcohol for a few reasons, according to Visontay.\n\n\"One, they've got a higher amount of water, which is what disperses alcohol,\" she said.\n\n\"And they've also got higher concentrations of the enzymes in the stomach that do the first part of breaking down the alcohol, which means you've got less of it going into the liver and less of it going into the bloodstream.\"\n\nTypically, this means men are less likely to experience the short and long-term health impacts of drinking when compared to women consuming a comparable amount.\n\nVisontay explained that Australia has a set guideline — recommending no more than 10 standard drinks a week for men and women — whereas in some countries, the threshold for men is higher, reflecting a greater ability to tolerate alcohol.\n\nGeneric variations in different ethnicities can also affect a person's capacity to break down alcohol.\n\nOne group that is often less able to break down acetaldehyde — one of the first byproducts the body makes when processing alcohol — is people of East Asian background, who can be more likely to experience what is colloquially termed 'Asian flush'.\n\n\"They'll start to get quite red quite quickly, and they might get some uncomfortable side effects like heart palpitations and nausea,\" she said.\n\n\"That will not just cause problems in the short term, like making drinking unpleasant, but in the long term as well.\"\n\nLong-term harms of alcohol are \"numerous\" and include an increased risk of cancers, dementia and cognitive impairment.\n\n\"There's really strong evidence for the relationship between alcohol and increased risk for cancers, and in particular the parts of the body where alcohol is making contact,\" she said.\n\nNo safe amount of alcohol\n\nClaire Gardner, manager of food and nutrition at the Australian Heart Foundation, told SBS News that following the Australian guidelines helps lower the risk of alcohol-related harm, but it does not remove all risk.\n\n\"There is no completely safe level of alcohol consumption,\" she said.\n\n\"High-quality studies, including those looking at just one standard drink, have found that even low levels of alcohol can raise the risk of heart disease.\n\nEven small amounts of alcohol increase the risk of developing neck, throat, colorectal or liver cancer.\n\nREAD MORE From cheers to fears: This is what happens to your body when you have a hangover\n\nGardner and Visontay also explained that past studies saying alcohol like red wine can be good for heart health are now outdated, and have been disproved by newer research.\n\n\"The supposed benefits of light drinking were likely influenced by the fact that light drinkers often have healthier lifestyles overall, not because alcohol itself is protective,\" Gardner said.\n\n\"Alcohol is not a defining feature of heart‑healthy eating patterns, even in the Mediterranean diet, where benefits come from the overall diet, not the wine.\"\n\nFor the latest from SBS News, download our app and subscribe to our newsletter.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/heats-on-for-aussie-survivor-against-two-time-australian-open-champ-naomi-osaka/pt0ac3ckj",
        "title": "Aussie survivor through to next round after Naomi Osaka pulls out of Australian Open",
        "publish_date": "Fri, 23 Jan 2026 21:23:04 +0000",
        "category": "sports",
        "authors": [],
        "text": "Dual Australian Open champion Naomi Osaka has pulled out of the tournament, giving local qualifier Maddison Inglis a spot in the fourth round.\n\nOnly hours before their scheduled match on Saturday night, Osaka announced she was withdrawing because of an abdominal injury.\n\n\"I've had to make the difficult decision to withdraw to address something my body needs attention for after my last match,\" the 28-year-old wrote on her Instagram story.\n\n\"I was so excited to keep going and this run meant the most to me, so having to stop here breaks my heart but I can't risk doing any further damage so I can get back on the court.\n\n\"Thanks for all the love and support ... I'm so grateful everyone embraced me so much.\n\n\"And thank you to my whole team for always having my back and the tournament organisers for being so kind.\"\n\nNaomi Osaka has turned heads with her on-court fashion. Source: AAP / Dita Alangkara\n\nInglis, in her first major in four years, is through to the round of 16 for the first time to join Alex de Minaur as the only other Australian left in the tournament.\n\nThe 28-year-old from Western Australia will face either world No.2 Iga Swiatek or Russian Anna Kalinskaya in the fourth round on Monday.\n\nSpeaking before Osaka pulled out of the tournament, Inglis predicted she would face \"a tough match\".\n\nHowever, she was savouring every moment of her journey.\n\n\"Right now, I'm going to soak it all in. You're not in the third round of a grand slam every day,\" said Inglis, who had advanced to the third round for a second time.\n\nFor the latest from SBS News, download our app and subscribe to our newsletter.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/50-years-since-concordes-first-commercial-flight-memories-linger-on/9u9bcpqfw",
        "title": "50 years since Concorde's first commercial flight, memories linger on",
        "publish_date": "Fri, 23 Jan 2026 20:30:00 +0000",
        "category": "finance",
        "authors": [],
        "text": "Listen to Australian and world news and follow trending topics with SBS News Podcasts.\n\nTRANSCRIPT\n\nConcorde's occasional visit to Australia made headline news.\n\nThis report was from Channel Nine's John Collis in 1985, who watched Concorde set off on a record-breaking trip from Sydney to London.\n\n“She received the all clear and huge jets roaring bulleted down the runway. Concorde soared rapidly to 5,000 feet, turned left through 180 degrees and set necks craning again as she swept above the harbour in a farewell salute to Sydney. She should be on the ground at Heathrow just 17 hours after takeoff, meaning yet another record for Concorde. Because no one has bothered to claim a new record for the Sydney to London flight since 1938, it still stands at 130 hours.”\n\nWhile there were ambitious plans, consistent, profitable commercial routes to Australia were never established.\n\nIt was Just nine years earlier, in January 1976, that Concorde made its maiden commercial flight.\n\nNewsreel commentators waxed lyrical about the revolutionary aircraft.\n\n“Concorde's paper dart appearance promises performance and it keeps its promise. It's twice the plane in more than looks. It can fly twice as fast and twice as high as other airliners and can cut journeys in half. “\n\nConcorde combined raw power with a sleek elegance that made it unlike any passenger aircraft before or since.\n\nIt was the aircraft that carried royalty, celebrities and business leaders across the Atlantic at unheard-of speed.\n\nDeveloped through a joint project between Britain and France in the 1960s by the British Aircraft Corporation and Sud Aviation, later Aérospatiale, Concorde was designed to cruise at more than twice the speed of sound and at altitudes of nearly 60,000 feet, on the edge of space, far above conventional airliners.\n\nPeter Archer is the chairman of Duxford Aviation Society in Britain.\n\n“Concorde design, it was in 1962, both the French and British governments had people working on it. They couldn't afford to do it separately so it came in a combined operation and over the next seven years, British designers and French designers and engineers all worked together. And it was pretty remarkable because they didn't have a lot of computing power, not like we have today. And one lot were working in metric system and the other lot in imperial, and they were building it in two factories but they all joined together and it worked.”\n\nAir France and British Airways wanted to fly Concorde to the US on the lucrative trans-Atlantic route.\n\nBut American authorities were reluctant, citing sonic booms and environmental impact, banning Concorde because it was the world's noisiest plane - though many believed the ban was really because the plane had not been built by a US manufacturer.\n\nThe Europeans argued that the ban was discriminatory and detrimental to Concorde’s operations - and in August 1977, the US Supreme Court agreed and the ban was lifted.\n\n“The famous nose scents a victory that a few weeks ago seemed defeat. With the skies clear to New York for supersonic flight, it's felt the rest of the world will go Concorde.”\n\nThere was no getting away from the fact that Concorde looked beautiful but was, indeed very noisy.\n\nFormer chief engineer John Britton says, however, the engines were revolutionary.\n\n“One of the first things I started working on at that time, so we're talking about 1968, we were building the prototypes, so I was actually working on the engine. The engine we called the power plant because it's the engine (controls) the air intake and then the primary and the secondary nozzle. So there's three main bits of it. And the whole of it goes to make up the power plant.”\n\nConcorde only ever had one crash - but it grounded the supersonic jet forever.\n\nOn the 25th of July 2000, a piece of metal dropped from a Continental Airlines DC10 on to the runway at Charles De Gaulle airport in Paris.\n\nAir France Flight 4590 ran over the debris, causing a tyre to explode and disintegrate. Tyre fragments, launched upwards at great speed damaged parts of the landing gear and ruptured a fuel tank.\n\nThe images of Concorde with flames streaming behind it in the seconds before it crashed were hard to forget.\n\nAll nine crew and one hundred passengers on board were killed, as well as four people on the ground.\n\nJohn Britton again.\n\n“The next morning we were on the crash site in Gonesse and that was a terrible experience because all our training and experience was aimed at keeping aircraft in perfect airworthiness condition and that is my responsibility. I held the airworthiness signature to the CAA in the UK for our work share of the Concorde fleet. And so to be confronted with something that we thought we would never see that was a Concorde crash was absolutely terrible and it was a real low point in our career.”\n\nThe entire fleet was grounded and later returned to service after extensive and costly safety modifications, including strengthened fuel tanks and reinforced tyres.\n\nFlights resumed after 18 months, but passenger numbers never fully recovered, and maintenance requirements increased significantly.\n\nIn 2003, both British Airways and Air France permanently retired Concorde, citing rising costs, ageing aircraft and declining demand.\n\nJohn Britton says for those who worked on it, Concorde remains unmatched.\n\n“My son says, ‘How am I going to tell the grandchildren that their grandpa flew to New York in three hours 20 minutes and it takes us if we want to go to Disneyland in Florida it’s going to take us eight hours to get there?’ And the answer to that is Concorde.”",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/life-for-afghan-women-under-taliban-rule/vbxloya9s",
        "title": "Allowed to beg, forbidden to study: Why conditions for Afghan women are worsening",
        "publish_date": "Fri, 23 Jan 2026 19:54:04 +0000",
        "category": "finance",
        "authors": [],
        "text": "When the Taliban took control of Afghanistan in August 2021, millions of Afghan women and girls saw their futures disappear.\n\nUnder the regime, they have been denied access to secondary education and universities, excluded from most jobs and faced severe restrictions on their freedom and mobility.\n\nAccording to the United Nations, nearly 80 per cent of young women aged 18 to 29 are not currently in education, employment or training in Afghanistan. Restrictions have now become the norm, with not a single decree restricting the rights of women and girls having been repealed in the four years of Taliban rule.\n\nRoya was in her final year of university in 2021 and among the last women to graduate before the regime closed the doors of higher education to women. SBS News has changed her name for safety reasons.\n\nDuring her studies, she also held down jobs in various industries including education and media, aspiring to independence.\n\nShe graduated in 2022, but since then has been \"unemployed and unable to work\" and forced to stay at home.\n\n\"The Taliban's restrictions didn't just take away my job, I think they took away my identity and a part of my future because I was an independent girl, standing on my own feet and making my own decisions,\" she tells SBS News.\n\n\"Anyone who finds themselves in these circumstances feels worthless; a sense of fear and despair arises in them. And the hardest part is knowing that a person has the ability to do something but unfortunately is not allowed to do it, which is the most painful of all.\n\nThis situation has not only destroyed my life, but I think it has also silently destroyed the future of a generation of Afghan women.\n\n'Erased from public space'\n\nAfghan women experienced harsh suppression under the first Taliban rule in the 1990s.\n\nThe post-Taliban era, starting in 2001, saw significant gains for women, including access to education and employment, as well as positions in prominent political roles.\n\nZaki Haidari, a strategy campaigner at Amnesty International Australia, says after 2001, when NATO and its allies went into Afghanistan, Afghan women had access to certain freedoms and rights, particularly in major cities.\n\n\"They could go to university. [Afghanistan] had a parliament where we had women MPs ... and ministers. We had women in all sorts of government offices and public spaces,\" he says.\n\n\"In rural Afghanistan, again, there were some restrictions because the movement of the Taliban and some parts of Afghanistan were still controlled by the Taliban.\"\n\nDespite progress over the following decade, in 2011, Afghanistan was named the most dangerous place in the world to be a woman by a Thomson Reuters Foundation survey, which cited the country's high levels of violence, poor healthcare and poverty as primary factors.\n\nAnother decade on, in August 2021, the US withdrew its troops after 20 years of war and the Taliban regained power.\n\nThe rights of women and girls were rapidly rolled back. Women are now prohibited from travelling more than 75km without a male guardian, barred from public spaces such as parks and gyms, and forced to comply with strict dress codes that limit their presence in public life.\n\nHaidari tells SBS News that under the Taliban, women in Afghanistan have been \"completely erased from public space\".\n\nWhen the Taliban took over Afghanistan, all the rights were taken away from women and they were forced to stay home.\n\n\"Afghanistan is one of the only countries in the world which deprived women from having access to their basic rights.\"\n\nMore than 1,500 days without education\n\nAccording to a 2025 UN Women report, 92 per cent of Afghans support girls continuing their education beyond year 6. Yet for many high school-aged women, four out of a potential six years of secondary education has now lapsed.\n\nMariam (not her real name) was in Year 5 when the Taliban banned girls from secondary school. She was allowed to continue her studies until she completed primary education but was not allowed to progress further. She says it's a difficult reality to accept.\n\nWomen on the Ghazni highway, Afghanistan in 2025. Source: Getty / Image digitally altered\n\n\"When the school doors closed and they said girls could not study after year 6, it had a bad impact not only on me, but on all Afghan girls,\" she says.\n\n\"It is truly a great inequality that in foreign countries girls can pursue education and build a bright future, while in Afghanistan there are many girls who have no hope for the future to work for it and achieve it.\"\n\nAfghanistan is the only country in the world where girls are banned from secondary education and most forms of work, but they can still be seen on the streets begging to financially support their families.\n\nMariam, who is now 14, says she is deeply disappointed by the ongoing injustice in Afghanistan, but still hopes the international community can help make education possible for girls.\n\n\"Seeing women begging while they do not have the right to go to school is an injustice,\" she says.\n\n\"My request to the international community is to reach an agreement with the Afghan government through negotiations so that they can open schools for girls and allow girls to continue their education.\"\n\nSBS News contacted the Taliban for comment on the situation for women and girls in Afghanistan but did not receive a response.\n\nIn an August 2025 interview with SBS Pashto, the Taliban's spokesperson, Zabiullah Mujahid, stated that work has been done on women's rights, noting women are employed in various government sectors, including health, education and security.\n\nHe added restrictions on women's education are \"temporary\", and they are trying to address the existing challenges.\n\n\"Women have now found a place for themselves that was their rightful [Sharia-based] right, from which they had been deprived for many years. Nowadays, they have access to it, they can easily obtain their rights, make their own decisions, and determine their own destiny in life,\" he told SBS Pashto.\n\n\"It was initially stated that this is a temporary decision and that the needs would be assessed. We want to find a way that respects our Sharia principles and also achieves consensus in society.\"\n\nAustralian aid to Afghanistan\n\nSince 2001, the Australian government has provided more than $1.7 billion in development and humanitarian assistance to Afghanistan.\n\nThis support continued even after the country fell under Taliban control in 2021, with Australia contributing more than $260 million to support the Afghan people in the years since. The Department of Foreign Affairs and Trade (DFAT) says this funding has a strong focus on women and girls.\n\nAs Australia has no diplomatic presence in Afghanistan, SBS News understands the funding has been instead distributed to UN agencies such as the United Nations Office for the Coordination of Humanitarian Affairs and the World Food Programme.\n\nA spokesperson for DFAT says the Australian government is \"committed to supporting the people of Afghanistan\" during \"one of the world's most protracted humanitarian crises\".\n\n\"We also recently established the world's first autonomous sanctions framework for Afghanistan, which enables Australia to directly impose its own sanctions and travel bans to increase pressure on the Taliban, targeting the oppression of the Afghan people, particularly women and girls.\"\n\nAccording to the spokesperson, a further $50 million is allocated for 2025/26.\n\nSBS News understands aid is also provided in line with autonomous and UN Security Council sanctions, ensuring it does not directly benefit the Taliban. It is delivered through trusted partners, including UN agencies, to reach those most in need, including minority groups such as the Hazara.\n\nAfghan women look at the skyline of Kabul, Afghanistan in September 2020. Source: AP / Image digitally altered\n\nArafat Jamal is the United Nations High Commissioner for Refugees' (UNHCR) country representative in Afghanistan. He explains that Australian aid is delivered through the UNHCR's \"people-to-people approach\", avoiding bureaucracies and adhering to the UN's policy prohibiting assistance to the Taliban.\n\n\"The overall picture for women is very bleak, whether it's in education or jobs. At the same time, I think this is really the strength of the United Nations and why the funding that Australia and others provide is so essential, is that with that funding, we do have leverage,\" Jamal says.\n\n\"We try to ensure that every dollar that we spend in Afghanistan goes to the people ... Wherever we can, whether it's in entrepreneurship, whether it is in community centres, whether it is in counselling, gender-based violence, we do focus on women.\n\n\"And in fact, in our statistics, we end up providing more assistance to women and children than we do to men.\"\n\nAfghanistan's secret schools\n\nAlongside the Australian government, Afghan communities in Australia are also contributing to humanitarian efforts. They are providing aid and helping to run secret education programs to support women and girls in Afghanistan.\n\nDr Nilofar Ibrahimi was a gynaecologist in Afghanistan and served as a member of parliament before the Taliban's return to power. After resettling in Australia in 2021, she has remained deeply committed to advocating for Afghan women and girls.\n\n\"Women in Afghanistan are living in the darkest period of history, and the world should not remain silent in the face of this darkness,\" Ibrahimi tells SBS News.\n\nDr Nilofar Ibrahimi founded the ZamZam Foundation to support and empower vulnerable women and girls. Credit: SBS News.\n\nIn 2019, she founded the ZamZam Foundation to support and empower vulnerable women and girls, particularly orphans and widows.\n\nFollowing the fall of Afghanistan two years later, the Canberra-based foundation also started helping newly arrived Afghan refugees in Australia.\n\nIbrahimi says the focus of the foundation's work now is running secret schools in Afghanistan, where girls take risks to attend classes and learn.\n\n\"We gathered these girls very carefully and our classes focus mainly on the English language and science,\" she says.\n\n\"Through fundraising here, we send money to them to cover teachers' salaries and some expenses for the girls who travel from distant areas to different places where they study. Of course, their locations are confidential.\"\n\nBut she says the foundation's reach is limited.\n\nAccording to the United Nations Population Fund, as of 2025 Afghanistan's population is estimated to be 43.8 million. Approximately half are women, according to World Bank statistics from 2024.\n\n\"If Afghanistan has a population of 40 million, certainly 20 million of them are women,\" Ibrahimi says.\n\n\"Among these 20 million women, who are deprived of the right to work, the right to education, and even the most basic human rights, our services are very insignificant.\"\n\nThe Afghan embassy in Australia — staffed by diplomats appointed by the previous Afghan government — continues to work with the Afghan community to organise programs supporting women.\n\nAfghan ambassador in exile Wahidullah Waissi told SBS News in November 2025: \"Afghanistan is an isolated land under the Taliban regime\", adding that the embassy is \"providing a platform for people\" to come together.\n\nHe says its greatest responsibility is to \"enable an environment for greater advocacy for the girls and women of Afghanistan who are under the biggest repressive regime\".\n\nWe call it 'gender apartheid'.\n\n\"That's the biggest responsibility on us, when we are thinking about a free Afghanistan, to do something and be the voice of the silenced girls and women in Afghanistan and make the noise in a way that we see them and we are caring about their future, and we are caring about the future of our country.\"\n\nThis story was produced in collaboration with SBS Pashto.\n\nFor the latest from SBS News, download our app and subscribe to our newsletter.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/japans-prime-minister-dissolves-parliament-ahead-of-snap-election-morning-news-bulletin-24-january-2026/0y4xagudk",
        "title": "Japan's Prime Minister dissolves parliament ahead of snap election | Morning News Bulletin 24 January 2026",
        "publish_date": "Fri, 23 Jan 2026 19:12:36 +0000",
        "category": "finance",
        "authors": [],
        "text": "Listen to Australian and world news and follow trending topics with SBS News Podcasts.\n\nTRANSCRIPT\n\nJapan's Prime Minister dissolves parliament ahead of a snap election\n\nMillions brace for severe heat over the long weekend\n\nCanadian teen Victoria Mboko advances to a fourth-round match-up with Aryna Sabalenka in the Australian Open.\n\nJapan's Prime Minister, Sanae Takaichi, has dissolved the lower house of parliament, paving the way for a snap election on February 8.\n\nElected in October as Japan's first female leader, Ms Takaichi has been in office only three months, but she has seen strong approval ratings of about 70 per cent.\n\nBut her decision to dissolve parliament will delay a vote on a budget that aims to boost a struggling economy and address soaring prices.\n\nThe Speaker of the House of Representatives, Fukushiro Nukaga, announced the formalities.\n\n\"I am reading out the prime minister's announcement. Following Article 7 of Japan's Constitution, the House of Representatives is dissolved.\"\n\nThe Danish Prime Minister is visiting Greenland as officials from Denmark, Greenland and the United States met in Washington DC.\n\nUS President Donald Trump told the World Economic Forum in Davos on Wednesday that the US would not use force to acquire Greenland and dropped his threat of tariffs against European countries.\n\nPresident Trump said a framework of a deal for the arctic territory had been established with NATO.\n\nDanish Prime Minister described the situation as 'serious' during her visit.\n\nMillions of Australians are bracing for severe heat over the long weekend, with experts urging people to stay hydrated and be aware of heat-related health impacts.\n\nBureau of Meteorology senior meteorologist Kevin Parkin says a so-called \"heat dome\" could bring record-breaking temperatures and fire danger to parts of the nation.\n\nSouth Australia is first in the firing line as heatwave conditions drift eastwards, bringing 40-degree Celsius days to capitals along Australia's southeast.\n\nTemperatures will start to build across Victoria, inland New South Wales, the ACT and southern Queensland from Saturday and into next week.\n\nDirector of the heat and health research centre at the University of Sydney, Professor Ollie Jay, says heat can contribute to a number of dangerous health outcomes.\n\n\"People get hospitalised for a variety of different reasons. Heat exhaustion, but often cardiovascular complication, people with heart disease and having heat related complications due to that, and also people with kidney disorders, people with respiratory disorders so lung disease also struggle in the heat.\"\n\nHome Affairs Minister Tony Burke and Multicultural Affairs Minister Anne Aly have described the sending of a threatening letter to the Lakemba Mosque in western Sydney as disgraceful.\n\nThe letter, delivered on Thursday, reportedly contained explicit threats of violence targeting multiple communities.\n\nIn a joint statement, Minister Burke - whose electorate of Watson covers the Lakemba Mosque - and Minister Aly - who is Muslim - says the Albanese government takes these threats extremely serious and they \"have no place in Australia\".\n\nThe Lebanese Muslim Association confirmed the mosque had received a letter containing a very serious threat and says in a statement that Muslim communities have \"become accustomed to receiving such disgusting and dangerous threats\".\n\nNew South Wales Police tells SBS News it is aware of the incident and has started an investigation.\n\nThe impact of war in Sudan on children's education has been revealed in data analysed by aid agency Save the Children.\n\nNearly half of Sudan’s 17 million school-aged children [[more than eight million students]] have now spent around 484 days without stepping into a classroom over the last three years.\n\nThe agency's CEO Inger Ashing says the international community is failing the children of Sudan.\n\n\"Children in Sudan are now facing one of the world's worst education crises and in the midst of conflict and hunger and displacement, education is often seen as something that cannot wait. But for children, that is not the case for them, education is a lifeline. It is not something that you can wait for. It's not luxury. It is about their wellbeing, their ability to build a future here and now. And education provides safety, stability and hope for the future. And right now, the international community is failing the children of Sudan.\"\n\nVictoria Mboko did not place any expectations on herself coming into her first Australian Open, but the Canadian teen ticked off another milestone by reaching the fourth round of a Grand Slam for the first time.\n\nThe 19-year-old's reward for a 7-6 5-7 6-3 win over Clara Tauson at Melbourne Park is a first career meeting against world number one Aryna Sabalenka with a place in the quarterfinals on the line.\n\nMboko shot into the spotlight when she became the youngest player since Serena Williams to beat four major winners in a tournament enroute to claiming last year's Canadian Open in Montreal and has continued to impress in Australia.\n\nMboko's win over 14th-seeded Dane, Tauson, marks her best result at a Grand Slam.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/video/made-right-here-new-20m-campaign-urges-australians-to-buy-local/gb8p2k768",
        "title": "'Made Right Here' : New $20m campaign urges Australians to buy local",
        "publish_date": "Fri, 23 Jan 2026 09:06:15 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.theage.com.au/sport/tennis/sabalenka-extends-historic-tiebreak-streak-20260125-p5nwu6.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Sabalenka extends historic tiebreak streak",
        "publish_date": "Sun, 25 Jan 2026 13:26:36 +1100",
        "category": "sports",
        "authors": [],
        "text": "Sabalenka extends historic tiebreak streak\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/tennis/australian-open-2026-live-updates-de-minaur-takes-on-bublik-teen-star-faces-up-to-sabalenka-alcaraz-charges-closer-to-title-aussies-in-doubles-action-20260124-p5nwr9.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Australian Open 2026 LIVE updates: Sabalenka surges into quarter-finals; Aussie defending champs win; De Minaur takes on Bublik; Alcaraz in action",
        "publish_date": "Sun, 25 Jan 2026 13:21:17 +1100",
        "category": "sports",
        "authors": [
            "Scott Spits",
            "Billie Eder",
            "Roy Ward"
        ],
        "text": "World No.1 Aryna Sabalenka has just spoken after her fourth-round victory, after teenager Victoria Mboko pushed her to the limit in that second set.\n\n“What an incredible player for such a young age. It’s incredible to see these kids coming up on tour,” she said.\n\nA wave for the fans. Credit: AP\n\n“I can’t believe I say that, I feel like a kid still. Incredible player, pushed me really hard today. Super happy with the win ... she played incredible tennis, she pushed me so much.”\n\nSpeaking on her incredible tie-break record – now 20 in a row at grand slam level – Sabalenka said she wasn’t sure what the secret to her success was.\n\n“I just go into the tie-breaks, I try not to think that this is a tie-break, play point-by-point, and I guess that’s the key to this consistency.”",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/tennis/rugby-stars-hit-australian-open-20260125-p5nwu4.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Rugby stars hit Australian Open",
        "publish_date": "Sun, 25 Jan 2026 13:17:11 +1100",
        "category": "sports",
        "authors": [],
        "text": "Rugby stars hit Australian Open\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/nsw/sydney-swans-player-knocked-unconscious-at-new-hemmes-venue-20260125-p5nwtr.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Sydney Swans player knocked unconscious at new Hemmes venue",
        "publish_date": "Sun, 25 Jan 2026 12:49:56 +1100",
        "category": "sports",
        "authors": [
            "Chris Barrett"
        ],
        "text": "Advertisement\n\nNationalNSWSydney Swans Sydney Swans player knocked unconscious at new Hemmes venue Chris Barrett January 25, 2026 — 12:49pm Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share A A A\n\nVeteran Sydney Swans midfielder Taylor Adams was knocked unconscious in an incident at hotelier Justin Hemmes’ new eastern suburbs venue on Saturday night. The 32-year-old was taken to hospital for treatment after being punched in the face during an altercation with two men at Club Rose Bay. Taylor Adams has been recovering from an Achilles injury. AAPIMAGE NSW Police said officers were called to the premises just after 10pm on Saturday night following reports of an assault. “Officers attached to Eastern Suburbs Police Area Command attended and were told a 32-year-old man was involved in an argument and a subsequent assault with two men,” police said.\n\nAdvertisement\n\n“The 32-year-old man was allegedly punched in the face by one of the men, causing a small cut to his cheek, as well as being knocked to the ground, where he lost consciousness briefly. “The men left prior to the arrival of police. Police have been told the two men are not known to the 32-year-old man.” Club Rose Bay re-opened in December under the management of Merivale. Sitthixay Ditthavong The Swans have been contacted for comment. Adams has been recovering from a partial Achilles tear he suffered at pre-season training in mid-December after playing only four matches last year due to injury.\n\nAdvertisement\n\nRelated Article House of Merivale Merivale’s pokie empire expands to Rose Bay He joined the Swans in 2024 after a decade at Collingwood, where he was the club’s best and fairest player 2020 as well as winning All Australian honours. He featured in the Magpies’ narrow defeat to West Coast Eagles in the 2018 grand final but missed out on playing in Collingwood’s 2023 premiership win over Brisbane because of a hamstring injury. Adams was drafted by the Greater Western Sydney Giants in 2011 and played 31 games for the AFL expansion team before heading to Melbourne. He was treated by NSW Ambulance paramedics before being taken to St Vincents Hospital for further treatment.\n\nAdvertisement\n\nPolice said inquiries were continuing into the incident. Club Rose Bay re-opened in December after being given a makeover by Hemmes-led hospitality giant Merivale, which is managing the venue. It had been closed since August 2024, when it was placed into administration with debts of $600,000. The redeveloped club features a retro cocktail bar with a 1960s airport theme, a sports bar and a beach bar with a pickleball and basketball court, as well as an Italian restaurant called Notti’s. The re-opening drew a queue down the street as patrons turned out for a look inside the decades-old RSL club. Be the first to know when major news happens. Sign up for breaking news alerts on email or turn on notifications in the app.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/culture/live-reviews/rawness-and-urgency-in-couple-s-sydney-festival-dance-debut-20260125-p5nwtj.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Rawness and urgency in couple’s Sydney Festival dance debut",
        "publish_date": "Sun, 25 Jan 2026 12:47:57 +1100",
        "category": "finance",
        "authors": [
            "Chantal Nguyen",
            "Kate Prendergast"
        ],
        "text": "Advertisement\n\nCultureLive reviewsStage shows Rawness and urgency in couple’s Sydney Festival dance debut Chantal Nguyen and Kate Prendergast January 25, 2026 — 12:47pm Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share A A A\n\nDANCE\n\nSISA-SISA\n\nBankstown Arts Centre, January 23\n\nReviewed by CHANTAL NGUYEN\n\n★★★★ The double bill SISA-SISA (Indonesian for “the remains” or “remnants”) marks the Sydney Festival debut of the extraordinary husband and wife duo Murtala and Alfira O’Sullivan, co-directors of the Indonesian cultural company Suara Dance. Comprising two autobiographical solos, SISA-SISA represents long-awaited recognition for the couple, who have spent years channelling their energy into dance troupe choreography. Alfira O’Sullivan in SISA-SISA. Victor Frankowski Both husband and wife possess an artistic maturity that makes its presence felt immediately: the kind that sears with intense honesty and a stage presence earned after only decades of experience.\n\nAdvertisement\n\nO’Sullivan’s work, Jejak & Bisik (which can be translated to “traces and whispers”), explores O’Sullivan’s life as an ageing female dancer caught in the crosshairs of unrelenting professional demands, motherhood and community leadership, and a traumatic misdiagnosed miscarriage. Alfira and Murtala O’Sullivan in the Sydney Festival show SISA-SISA. Victor Fankowski As O’Sullivan changes costumes and fixes her hair on stage, her mobile phone buzzes with voice messages while emails from a management company pop up on-screen. A polite corporate voiceover reads them out: As O’Sullivan’s profession is relegated to “the multicultural stage” and deemed unsuitable for “mainstream” white Australian audiences, it will be subject to various constraints including a fee reduction. Could she create a dance piece for a conference, sandwiched between the Monday morning speaker and the keynote speaker, designed to keep people awake? Using her community troupe? For less than $500? During a period when she is recovering from reproductive surgery? O’Sullivan, blessed with a striking natural glamour, demonstrates a beautiful sense of embodied theatricality and poise as she communicates this emotional journey. Murtala’s piece, Gelumbang Raya (which can be translated as “the Great Wave”), is his danced memory of recovering the bodies of victims of the Boxing Day Tsunami. A local of Aceh, Murtala returned after the tsunami as a disaster relief volunteer, working with survivors and — quite literally — staring death in the face as he carried thousands of bodies out of the mud.\n\nAdvertisement\n\nGelumbang Raya is haunting in its rawness and urgency, performed on a stage strewn with sand and visual projections of tides washing in and out. It incorporates Acehnese body percussion, singing, and the frame drum — 11 of which lie buried in the sand, like lives frozen in time by the tsunami. One of the piece’s final images — Murtala, lifted upside down in a head stand amidst the sand, singing in a piercing tenor as the drums lie around him — lands like a rip in your gut. THEATRE\n\nASSES.MASSES\n\nDrama Theatre, Sydney Opera House, January 24, until January 25\n\nReviewed by KATE PRENDERGAST\n\n★★★½ By the fourth hour, you’ve entered a state of trance. Your communal gaming herd is cheering on a self-elected temporary controller who’s playing a version of Guitar Hero in the Sydney Opera House to get a donkey to maximise who’s playing a version of Guitar Hero in the Sydney Opera House to help a donkey maximise its fornicating delights. This is Sick Ass, one of many donkey avatars, who’s just reached the Astral Plane (aka donkey heaven) as a casualty in the worker-animal uprising. What began as a peaceful protest against the human overlords’ exploitative machine-first system went horribly wrong, leading to death, displacement and disunification within the movement.\n\nAdvertisement\n\nYour own ass is getting sore. Level complete, you all break for snacks. The audience may have thinned after the third interval, with another four hours to go. But those who are spiritually invested for the long haul in this multidisciplinary, multidimensional epic and graphic radical allegory are all in – and rewarded for their loyalty. Travelling through farm and village, circus and abattoir, nightmare and nirvana; through hundreds of ass puns and inventively obscene animations, while conquering button-mashing challenges and philosophical puzzles, we become a pack immersed through live social experiment in a stunningly rendered universe – comrades in a common goal towards “true progress”, united by the liberating mindset of play. Canadians Patrick Blenkarn and Milton Lim are behind the asses.masses project, brought to Sydney Festival for one weekend, and touring as far as Finland, Istanbul and Chicago next. Conceived with vast ambition, a collectivist sensibility and total nerd passion, it’s a unique animal of modern participatory theatre, using the language of video games and dorm-room humour to tell its staunch and timeless revolutionary tale. The game art is truly dope. The “material world” is built with nostalgia-infused pixels, its textures, dialogue boxes, tessellated realms and soundscapes recalling Legend of Zelda or Pokemon. The “astral plane” is of the realism style, transporting us to sublime desert canyons (where donkey souls rave) and rolling infinity pathways (where the player-crowd yells “don’t do drugs!” when a power-boost orb appears). Classics games such as Space Invaders and Pac-Man are built into the narrative to either create obstacles, or simply offer fun little inconsequential diversions. For example, we spent a gleefully inordinate amount of time in the mines getting the donkey foal avatar (whom we voted to name Bitch Ass) to play a version of Pong called Rocks. Later, another controller has Hard Ass hoof-kick a swarm of riot policeman dead a la Karate Champ. The difficulty level ramps up on our quest, with veteran pros stepping up to earn our thunderous applause.\n\nAdvertisement\n\nFar closer to Animal Farm than Animal Crossing, there are some intentionally lurid depictions of violence, particularly against humans – from the life-like screams of burning villagers, to a factory worker getting eviscerated by his own meat hook. Most hilariously macabre is a grim, surreal sequence in which Hard Ass has to sacrifice himself many times to create a corpse bridge for/of himself over a bloody trench. Obviously, with scores of people in the room, not everyone gets (or wants) a go at the controller. The majority are basic spectators – our ‘agency’ limited to adding to the cacophony of yelled dialogue options and directions, jokes and commentary. More theoretically than actually active, the player-herd moves through cycles of elation and fatigue, agony and ecstasy, frustrated boredom and shared jubilation. The durational aspect can take you to the edge: at one point I found myself cry-laughing at the excessively cautious way a controller was moving a mutinous gang of equines hidden inside packing boxes. During the seventh hour, we spontaneously rose to our feet to sing the “song of ascension”, a donkey funeral dirge. Would I have better enjoyed this marathon on a friend’s sofa, where we could have a more equitable share of the controller, and partake of snacks superior to Doritos and dry vegan buns? Sure. But enjoyment isn’t the only marker of a worthwhile experience. Sometimes you have to endure the discomfort to come out the other side, finding yourself, in some way, new.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/tennis/ousted-ukrainian-player-aims-another-political-shot-at-sabalenka-20260125-p5nwta.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Ousted Ukrainian player aims another political shot at Sabalenka",
        "publish_date": "Sun, 25 Jan 2026 12:20:36 +1100",
        "category": "sports",
        "authors": [
            "Billie Eder"
        ],
        "text": "The Ukrainian player who took aim at Aryna Sabalenka and other Belarusian and Russian players earlier this week, claiming they should be banned by the sport because of their countries of origin, has hit out at the world No.1 again following her collaboration with Gucci.\n\nUkrainian Oleksandra Oliynykova told this masthead earlier this week that the presence of top Belarusian and Russian players on tour and at grand slams was “very wrong”, despite the fact they do not compete under their countries’ flags.\n\nBelarusian Sabalenka, who is playing in the fourth round against Canadian Victoria Mboko on Sunday, has previously repeatedly said that she didn’t support the Russian invasion of Ukraine or Belarusian President Alexander Lukashenko, and that she only wanted peace in Ukraine.\n\nHowever, the Ukrainian world No.92 has since taken to social media to comment on Sabalenka’s collaboration with Gucci, which was announced three days ago.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/tennis/what-osaka-bombshell-means-for-ao-20260125-p5nwts.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "What Osaka bombshell means for AO",
        "publish_date": "Sun, 25 Jan 2026 12:08:03 +1100",
        "category": "finance",
        "authors": [],
        "text": "What Osaka bombshell means for AO\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/tennis/ukrainian-player-targets-world-no-1-aryna-sabalenka-on-social-media-20260125-p5nwtp.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Ukrainian player targets world No. 1 Aryna Sabalenka on social media",
        "publish_date": "Sun, 25 Jan 2026 11:44:05 +1100",
        "category": "sports",
        "authors": [],
        "text": "Ukrainian player targets world No. 1 Aryna Sabalenka on social media\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/business/entrepreneurship/medicinal-cannabis-dispensaries-like-aesop-the-rise-of-high-street-weed-boutiques-20260121-p5nvwa.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Medicinal cannabis dispensaries ‘like Aesop’: The rise of high street weed boutiques",
        "publish_date": "Sun, 25 Jan 2026 11:09:43 +1100",
        "category": "finance",
        "authors": [
            "Jessica Yun"
        ],
        "text": "Advertisement\n\nBusinessEntrepreneurshipLegal Cannabis Medicinal cannabis dispensaries ‘like Aesop’: The rise of high street weed boutiques Jessica Yun January 25, 2026 — 11:09am Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share A A A\n\nIn Melbourne’s cosmopolitan South Yarra is a glossy glass-walled dispensary. Wood-panelled shelves are lined with pothos plants, palm-sized boxes and protein powder-looking packets. It’s a fully licensed pharmacy, but the casual browser could easily mistake it for a high-end skincare boutique. It happens all the time. “We get a lot of walk-in patients who don’t know what we are. A lot of the times they think we’re like Aesop,” says pharmacist and Astrid Clinic and Dispensary founder Lisa Nguyen. Lisa Nguyen, pharmacist, founded Astrid Healthcare, a medicinal cannabis dispensary with outlets in South Yarra and Byron Bay. Danielle Smith Founded in 2021, Astrid was one of the first of a growing number of upscale medicinal cannabis dispensaries that are starting to pop up on Australia’s busiest shopping strips. An eight-minute walk away from Astrid is “boutique pharmacy” V22 Dispensary. In Sydney’s Enmore, there is High St, a mustard-yellow shopfront that has the vibe of a record store; 500 metres up the road in Newtown is True Green Dispensary, where you can only purchase things such as incense, hemp seed oil or skincare made from tallow – unless you have a script for something stronger.\n\nAdvertisement\n\nIt’s a far cry from the traditional pharmacy presided over by a dour man in a white coat, or the harsh fluorescent lights and raw concrete floors of a Chemist Warehouse. Sleek and inviting, the new boutiques are staffed by registered pharmacists and cater to the 2.4 million Australians who are turning to marijuana through legal means, according to the Australian Institute of Health and Welfare’s latest household survey on drug use. More than one in 10 (11.6 per cent of) Australians consumed a combined 7.4 million units of medicinal cannabis products last year, according to Penington Institute’s Cannabis in Australia 2025 report. By 2023, Australians are forecast to spend $1.3 billion on medicinal cannabis, according to market research firm IMARC Group. Five years after opening Astrid, Nguyen still gets DMs from people who seek advice on how to open a high-end ‘specialist pharmacy’ of their own. “So many people are starting to do it now,” she says. The front entrance of High St, a medical cannabis dispensary in Enmore, Sydney. KATE GERAGHTY These dispensaries can appear both alluring and mysterious. It’s not immediately clear what they dispense: you won’t find references to weed, marijuana, pot or even cannabis. The Therapeutic Goods Administration (TGA) prohibits the advertising of any prescription-only medicine, including cannabis, forcing dispensaries to market their services using hazy phrases like “alternative medicine”, “natural therapies” and “holistic health”.\n\nAdvertisement\n\nThe prohibition is designed to safeguard the doctor-patient relationship over commercial interests, where advertising and marketing can drive consumer demand for medication that doesn’t suit them or is too expensive. “If you are a business that promotes treatment services, you need to take care to ensure that you are not, in addition to promoting your services, also promoting medicinal cannabis,” the TGA states. Fear of regulatory scrutiny has forced specialist dispensaries to hide in plain sight. “It’s very, very discreet. There’s not even a picture of the cannabis plant, because you can’t advertise that,” says Nguyen. “That social stigma around cannabis has decreased a lot. That doesn’t mean it’s gone,” she added. “The industry is moving very rapidly, in terms of products. There are so many more patients now, so many products, but the policy is slow.” True Green Health Dispensary on King Street in Newtown, NSW. KATE GERAGHTY\n\nAdvertisement\n\nIn the weeds For the uninitiated, medicinal cannabis dispensaries can create confusion because they don’t fall neatly into two categories people grasp more intuitively: a traditional pharmacy, or a recreational weed store you might walk into in San Francisco or Amsterdam. None of the items on open display contain cannabis. As with any prescription medicine, you must present a script to a pharmacist. About 80 per cent of Australia’s 6000 community pharmacies have dispensed medicinal cannabis at least once, but many doctors remain hesitant to prescribe cannabis. Most products are not officially registered with the TGA. “We’ve seen a concentration of medicinal cannabis prescribing among a smaller number of GPs and nurse practitioners and pharmacists. I suspect that the bricks-and-mortar services are one way of accessing patients,” says public-health think tank Penington Institute chief executive John Ryan.\n\nAdvertisement\n\n“There are a lot of plain-Jane access points, telehealth access points. I think these services are more geared to try create a niche within that ecosystem of prescribers.” Editor's pick Investigation\n\nLegal Cannabis Cannabis Inc: Australia’s booming medicinal weed industry The inviting atmosphere of a health and wellness centre can convert an onlooker’s curiosity into conversation and address lingering taboos around cannabis. They could also lure in new customers. “[The dispensary] makes it real, makes it accessible. There are so many online businesses that don’t seem real,” says Nguyen. “So much of Astrid is people coming in and knowing all of our pharmacists and doctors by name. We know all their backgrounds. It’s a community.” Incidental conversations between fellow patients can lead to more. “We’ve even had people start dating.”\n\nAdvertisement\n\nA medicinal cannabis patient may feel uncomfortable visiting a normal chemist because of inherited stigma around cannabis, says Penington Institute’s Ryan. ‘Leaf Doctor’ sign at the rear of True Green Health Dispensary located on King Street in Newtown, NSW. KATE GERAGHTY “You can imagine that from the patient journey perspective, getting this calming health spa vibe is probably addressing their own internalised anxiety around medicinal cannabis,” he says. This new wave of Australian dispensaries are taking their design cues from more mature overseas markets like the US. “It was the whole rebrand – taking it from the street into a clinic in a legal setting,” says social impact investor Kyah Bell. But many of these clinics appear to be using the same pricing models around initial consults, follow-up consults and product pricing, she added.\n\nAdvertisement\n\nHealthcare and wellness has been earmarked as an economic ‘megatrend’ for years. Chemist Warehouse’s $32 billion back-door float made billionaires of its pharmacist founders. More broadly, the Australians’ rapid uptake of weight loss drugs Mounjaro and Wegovy has highlighted just how money there is to be made in the healthcare sector. Many of Australia’s largest cannabis businesses operate online, operating via video-call consultations with doctors and shipping direct from a pharmacy. But that has opened a lane for the dedicated medicinal cannabis dispensaries to carve out their own share of the market with unique brands and inviting stores. “Competition has a lot to do with the design, because everybody’s trying to own part of that market,” says Bell. “I rarely see any other GP clinics advertising in the same way that cannabis clinics are.” Not quite legal\n\nAdvertisement\n\nAustralia’s peculiar patchwork rules around cannabis consumption and advertising has bred a reluctance among clinics and dispensaries to attract attention for fear of falling afoul of the rules. When contacted by this masthead, Sydney’s High St and True Green Dispensary declined to be interviewed. Related Article Exclusive\n\nInvestigations There’s a loophole in telehealth – the industry ‘drove a Mack truck through it’ Recreational use is still an offence everywhere in Australia bar the ACT, despite legalisation of medicinal cannabis a decade ago. Criminal suppliers are making over $5 billion a year from the illicit market, and billions spent on enforcing “outdated and counterproductive” criminalisation laws have not dented supply or use, according to Penington Institute’s Cannabis in Australia 2025 report. “In the best of worlds, we would have had a regulated market for adult use cannabis simultaneously with medicinal cannabis for people with genuine health conditions that need treatment,” says Ryan. “It’s a very bumpy, lumpy sort of way of approaching regulation of this substance.”\n\nAdvertisement\n\nReports of those who are gaming the system have been widely publicised: a proliferating telehealth industry has sparked concerns about unsafe practices after this masthead revealed that a single doctor wrote 72,000 prescriptions to 10,000 patients in two years. Therapeutic Goods Administration chief medical adviser Robyn Langham raised concerns about the “abuse” of medical prescriptions for recreational use. “Most doctors behave very responsibly, but some of them don’t, and the ones that don’t need to be chased down,” says Ryan. “They wreck the reputation of the whole sector.” Many of Nguyen’s patients are dealing with complex pain issues, like endometriosis patients who also have insomnia or anxiety. Having a clinic and a dispensary in the same premise means health professionals and pharmacists can accompany the patient throughout the entire process. “We have the whole experience down pat,” she says. Some walk-ins will say cannabis is not for them, but most interactions are educational.\n\nAdvertisement\n\n“Most of them are like, ‘my mum’s got arthritis. Do you think it will be helpful?’ That’s a very common question.” The Business Briefing newsletter delivers major stories, exclusive coverage and expert opinion. Sign up to get it every weekday morning.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/tennis/tjs-pickleball-joke-after-on-air-tumble-20260125-p5nwtc.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "TJ's Pickleball joke after on-air tumble",
        "publish_date": "Sun, 25 Jan 2026 10:57:21 +1100",
        "category": "finance",
        "authors": [],
        "text": "TJ's Pickleball joke after on-air tumble\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://au.finance.yahoo.com/news/eyes-crucial-data-ahead-first-010000205.html",
        "title": "All eyes on crucial data ahead of first RBA meeting",
        "publish_date": "2026-01-25T01:00:00Z",
        "category": "finance",
        "authors": [
            "Tess Ikonomou",
            "Sat January At Pm",
            "Min Read"
        ],
        "text": "Australia's central bank is expected to rely on key inflation numbers ahead of its first monetary policy meeting of the new year, amid fears of an interest rate hike.\n\nThe Australian Bureau of Statistics will on Wednesday release consumer price index figures for the December quarter from 2025.\n\nThe Reserve Bank monetary policy board meeting will hand down the first interest rate decision for the year on February 3.\n\nLeading economist Justin Smirk anticipates the central bank will use the December quarter results to guide its decision.\n\nThe RBA will rely on key inflation numbers ahead of its first 2026 monetary policy meeting. (Dean Lewins/AAP PHOTOS)\n\nThe RBA is projecting a .5 per cent rise in the quarter, a slight downgrade from its earlier estimate.\n\nOffsetting inflation over the time frame is a 4.7 per cent fall in electricity prices despite \"strong\" increases in November and December, according to a written report filed by Mr Smirk for Westpac.\n\nWestpac is forecasting the monthly trimmed mean - an alternate measure used to reduce the impact of temporary price changes - will continue easing to 3.1 per cent for January.\n\n\"Inflation picked up in the September quarter but the key drivers were not domestic demand or labour market pressures,\" Mr Smirk said.\n\n\"Supply‑related factors, including disruptions affecting coffee, lamb and goat, and beef and veal, as well as strong export demand, have also contributed to price pressures, though both effects have begun to moderate, easing inflationary momentum.\"\n\nThe cash rate sits at 3.6 per cent where it has remained since the central bank last delivered a rate cut in August.\n\nSupply‑related factors for goods including coffee have contributed to inflationary pressure. (James Ross/AAP PHOTOS)\n\nNAB is estimating two 0.25 percentage point rises in February and May, while the CBA is projecting one rate hike in February.\n\nWestpac and ANZ are forecasting rates to remain on hold but note risks for a potential hike.\n\nA target between 2 and 3 per cent is pursued by the RBA, which uses ABS data to track progress.\n\nRBA governor Michele Bullock has previously said the incoming data would be watched to decide if inflation is continuing to persist.\n\n\"If inflation ... looks like it is not coming back down towards the target ... the board might have to consider whether or not it's appropriate to keep interest rates where they are or in fact at some point raise them,\" she said.\n\nInvestors on Wall Street have meanwhile been subjected to a zigzag week punctuated by threats and pullbacks that finished with a quiet and tentative close.\n\nIn a week full of loud threats and pullbacks, Wall Street drifted to a quieter close. (AP PHOTO)\n\nThe S&P 500 was basically flat on Friday, edging up less than 0.1 per cent but still notching a second straight week with a modest loss.\n\nThe Dow Jones Industrial Average dipped 285 points, or 0.6 per cent, and the Nasdaq composite rose 0.3 per cent.",
        "source": "Yahoo"
    }
]