[
  {
    "url": "https://www.9news.com.au/national/nsw-floods-live-updates-latest-news-warnings-evacuations-weather-forecast/839af588-4d15-44f6-921e-42dcb25ec969",
    "title": "Residents stranded as NSW town lashed by rain",
    "publish_date": "Wed, 21 May 2025 01:45:00 +0000",
    "category": "finance",
    "authors": [
      "May"
    ],
    "text": "H﻿ello and welcome to our live rolling coverage of the floods on NSW's Mid North Coast, this Wednesday, May 21.\n\nDozens of residents in the city of Taree are stranded on the roof of their homes and awaiting rescue as the region is forecast to receive between 150mm to 300mm of rainfall.\n\nThe Manning River has surged past six metres, breaking its all-time flood record set in 1929 and threatening thousands more homes.\n\n﻿READ MORE: 'We really need to get rescued': NSW residents stranded as floodwaters continue to rise\n\nREAD MORE: Too late to leave as floodwaters rise in Hunter region\n\nIN PICTURES: ﻿Family stranded on roof as floodwaters all but swallow house",
    "source": "9News",
    "cluster_id": 0
  },
  {
    "url": "https://www.9news.com.au/national/mass-cattle-sheep-slaughter-nsw-victoria-amid-drought-season/214fd48a-a0d0-45e2-9d3c-2c781760a477",
    "title": "Cattle, lamb slaughters rocket up as droughts, floods hit farmers",
    "publish_date": "Wed, 21 May 2025 01:34:30 +0000",
    "category": "finance",
    "authors": [
      "May"
    ],
    "text": "Cattle and lamb slaughter numbers are through the roof for early 2025, with producers selling off livestock amid tough conditions from drought to floods around the country.\n\nData from the Australian Bureau of Statistics﻿ showed cattle slaughter was up to 2.2 million in the first quarter of the year, up 20 per cent for the same time in 2024.\n\nIt was the largest quarterly cattle slaughter in Victoria since 1979, and the largest since 2015 in New South Wales.\n\nCattle slaughter numbers have shot up in Australia in recent months. (Getty Images/iStockphoto)\n\nIn South Australia, where drought conditions are hitting hard, slaughter numbers rose 16 per cent to the highest level since 2017.﻿\n\nCrucially, the slaughter of female cattle rose to 52.7 per cent of the total, particularly in South Australia and Victoria, indicating producers are unable to maintain their current levels of breeding stock.\n\nBut MLA market information manager Stephen Bignell this is not indicative of widespread herd liquidation across the country.\n\n\"The elevated female slaughter rate reflects regional responses to seasonal pressures, particularly in the south where a prolonged and expanding drought is impacting numbers,\" Bignell said.\n\nSheep and lamb slaughter numbers are also high. (Getty)\n\n\"While some areas are destocking, others are benefiting from improved conditions and holding onto stock.\n\n\"This is most evident in Queensland where generally good conditions are resulting in stock retention and even herd growth.\"\n\nBeef production rose three per cent during the quarter to 679,000 tonnes, with South Australia recording the highest growth of 16 per cent.\n\nVolunteers and crews perform more than 150 flood rescues View Gallery\n\nMeanwhile, lamb slaughter for the quarter was the second highest level on record, at 6.86 million head.﻿\n\nVictoria alone was responsible for more than half that number with 3.83 million lambs slaughtered, followed by NSW at 1.48 million - a 27 per cent increase.﻿\n\nSheep slaughter, however, was down 14 per cent on the previous quarter, though still seven per cent higher than this time last year.﻿\n\nSheep and lamb slaughter across the country for the quarter ﻿reaped $1.58 billion in gross value.",
    "source": "9News",
    "cluster_id": 1
  },
  {
    "url": "https://www.9news.com.au/world/nude-beaches-25-of-the-worlds-best-nude-beaches/bc28fd65-d933-4540-870b-baecac695bb7",
    "title": "Australian beach makes list of top 25 nude beaches worldwide",
    "publish_date": "Tue, 20 May 2025 23:37:53 +0000",
    "category": "finance",
    "authors": [
      "May"
    ],
    "text": "1 of 25 Attribution: CNN\n\nIn places like Jamaica, Indonesia, Mexico and the Dominican Republic, where public nudity is illegal, a growing number of private naturist resorts are the best way to get naked.\n\nDespite all this clothing-optional innovation, nude beaches remain the primary means to achieve an overall tan.\n\nFrom rocky coastlines to talcum-powder fine sands and big city bays to secluded shores, there are now hundreds of beaches where it's perfectly legal (or at least de facto legal) to frolic beside the sea in nothing more than your birthday suit.\n\nIncluding one Australian beach, here is the list of the top 25 nude beaches in the world, according to CNN. ﻿",
    "source": "9News",
    "cluster_id": 2
  },
  {
    "url": "https://www.9news.com.au/world/cassies-mother-says-sean-diddy-combs-demanded-20k-because-her-daughter-was-seeing-someone-else/f6117a9b-4b25-414b-ba23-604caed4b37a",
    "title": "Cassie's mother says Sean 'Diddy' Combs demanded more than $30K",
    "publish_date": "Tue, 20 May 2025 21:37:10 +0000",
    "category": "finance",
    "authors": [
      "May"
    ],
    "text": "An angry Sean “Diddy” Combs demanded US$20,000 (A$31,150) from Casandra “Cassie” Ventura's mother and threatened to release explicit sex tapes of his longtime girlfriend after learning she was dating someone else, the mother testified at the hip-hop mogul's sex trafficking trial.\n\nRegina Ventura said she felt “physically sick” when her daughter sent her an email in late 2011 to say Combs threatened to release two explicit videos of her and send someone to hurt her and the man she was seeing, the rapper Kid Cudi.\n\n“I did not understand a lot of it. The sex tapes threw me,” Ventura told the Manhattan federal court.\n\nSean “Diddy” Combs and his ex-girlfriend Casandra “Cassie” Ventura. (Supplied)\n\nVentura, of New London, Connecticut, said she then received a demand from Combs for the $31,150.\n\n“He was angry that he had spent money on her and she went with another person,” she said.\n\nCudi, whose real name is Scott Mescudi, is expected to testify by Thursday.\n\nVentura said she tapped a home equity loan to pay Combs because she was \"scared for my daughter's safety.” Days later, she said, the money was returned and Cassie was soon dating Combs again.\n\nVentura testified for less than a half-hour, in part because defence attorney Marc Agnifilo declined to cross-examine her. During her testimony, the jury viewed photos of bruises on Cassie's body that Ventura testified were taken when her daughter came home for Christmas in 2011.\n\nBefore the jury arrived Tuesday, Agnifilo tried to persuade Judge Arun Subramanian to disallow the testimony, saying it was “purely prejudicial.” The judge allowed it though, saying the threats to release sex tapes and harm Cassie made it an instance of “potential extortion.”\n\nSean Diddy Combs, left, stands as his defence attorney, Teny Geragos, gives her opening statement to the jury on the first day of trial in Manhattan federal court, Monday, May 12, 2025, in New York. (AP)\n\nA federal agent describes a raid of Combs' home\n\nJurors also saw parts of two AR-15 rifles found last year during a raid on Combs’ mansion on Star Island, a celebrity enclave off of Miami.\n\nHomeland Security Agent Gerard Gannon testified that investigators in March 2024 rammed through Combs’ security gate in an armoured vehicle and had teams on boats nearby. Besides weapons, they found 7-inch high heels and items prosecutors say Combs used at his freak-off sex marathons like lingerie, sex toys, baby oil, lubricant and condoms.\n\nThe testimony came in week two of a projected two-month trial. Combs, 55, has pleaded not guilty. If convicted, the Bad Boy Records founder could face 15 years to life in prison.\n\nA former assistant describes working for Combs\n\nEarlier Tuesday, David James, Combs’ personal assistant from 2007 to 2009, testified that the job seemed to have increasing perils. He said he quit when he realised Combs had put his life in danger by forcing him to drive a car as the angry rapper sat in the back with three handguns on his lap.\n\nJames said his job sometimes required him to ensure that hotel rooms where Combs stayed under the name “Frank Black” were stocked with the musician's comforts, including fresh underwear, an iPod, apple sauce, vodka, baby oil, Viagra and condoms.\n\nThere were also surprising moments, James said, like once in 2008 when he obeyed a Combs command to bring an iPod from his Miami home to a hotel room, where he opened the door to see Cassie on the bed with a white comforter pulled up to her neck and an unfamiliar naked man fleeing the room.\n\nAnother time, he said, Combs showed him a video he'd recorded at a party of James dancing wildly and said: “Ok. I'm going to keep this footage in case I ever need it.” James said he took it as a threat to keep him in line.\n\nSean 'Diddy' Combs participates in \"The Four\" panel during the FOX Television Critics Association Winter Press Tour in Pasadena, Calif., Jan. 4, 2018. (AP)\n\nCassie testified last week that Combs threatened that if she didn’t do as he said, he would release videos of her having sex with male escorts during freak-offs.\n\nJames also described being required to take lie detector tests twice when Combs was trying to learn who stole cash and a watch.\n\nHe said Combs was on drugs nearly every day, often taking Percocet by day and ecstasy by night. When he stocked Combs' hotel rooms, he said, drugs were in a bag dropped off by security, including a pill meant to look like former President Barack Obama.\n\nThe moment when James saw the three guns on Combs' lap came when he testified that he was involved in Combs’ attempt to confront his music industry rival Suge Knight at a Los Angeles diner in November 2008 — an incident that Cassie also testified about. He said he quit soon afterward.\n\n“I was real shook up by it,” James testified. “This was the first time being Mr. Combs’ assistant that I realised my life was in danger.”\n\nMore testimony about freak-offs\n\nBefore Tuesday's lunch break, Sharay Hayes, an exotic dancer known as “The Punisher,” testified that Combs and Cassie brought him into the freak-offs world. He said a woman — Cassie using a pseudonym — called and told him it was her birthday and that her husband said she should hire a dancer.\n\nHayes said he arrived at a Manhattan hotel room expecting to perform a striptease for a small group of people but instead found the woman who hired him — whom he later found out was Cassie — alone with an otherwise naked man who hid his face with a burqa-like cloth. That man, he said, turned out to be Combs.\n\nHayes recalled seeing bottles of baby oil in bowls of water and getting handed a stack of US$800 (A$1246) in cash.",
    "source": "9News",
    "cluster_id": 3
  },
  {
    "url": "https://www.9news.com.au/national/qantas-apology-for-illegal-sackings-slammed-as-hollow/c46d7b64-e5b2-4010-804d-9c2c611e83da",
    "title": "Qantas' apology for illegal sackings slammed as 'hollow'",
    "publish_date": "Tue, 20 May 2025 05:37:19 +0000",
    "category": "finance",
    "authors": [
      "May"
    ],
    "text": "An apology by Qantas for sacking 1820 ground crew rings \"wholly hollow\" and it has failed to make changes that ensure such actions never happen again, a judge has been told.\n\nIn the Federal Court in Sydney today, Justice Michael Lee continued hearing submissions on the penalty to be imposed on Qantas for the biggest case of illegal sackings in Australian history.\n\nLast October, Justice Lee ordered Qantas to pay $120 million to the ground staff as compensation for their economic loss, pain and suffering since their jobs were outsourced during the COVID-19 pandemic.\n\nREAD MORE: Relief for millions as RBA cuts interest rates\n\nAn apology by Qantas for sacking 1820 ground crew rings \"wholly hollow\" and it has failed to make changes that ensure such actions never happen again, a judge has been told. (Supplied/Qantas)\n\n﻿The Transport Workers Union is seeking that he impose the maximum penalty of $121 million and order that the money be paid to the union.\n\nNoel Hutley SC, for the union, told Justice Lee that he should reject Qantas' submission that after four-and-a-half years of litigation, it was now contrite.\n\n\"Your Honour will not brush aside, as Qantas urges in its submissions, its vehement and regular denials of wrongdoing (and) its rejection of Your Honour's findings, which persisted all the way to the High Court,\" he said.\n\n\"These reveal an attitude of adamantine self-righteousness.\"\n\nSince the High Court ruled against Qantas' appeal no senior executive of the airline had publicly accepted it broke the law or Justice Lee's conclusions until yesterday, Mr Hutley said.\n\n\"The contrition rings wholly hollow.\"\n\nThere had been \"a profound failure\" within Qantas \"to come to terms with what needs to occur to avoid these things happening again\", he said.\n\nLast October, Justice Lee ordered Qantas to pay $120 million to the ground staff as compensation for their economic loss, pain and suffering since their jobs were outsourced during the COVID-19 pandemic. (Supplied)\n\nThe court should order that the penalty be paid to the TWU, which had taken on enormous risks and burdens to fight the sackings, Hutley said.\n\n\"If the penalty is paid to my client, my client is an organisation charged with advancing the interests of its members … and the money would be applied to the proper purposes of the organisation.\"\n\nYesterday, Qantas chief people officer Catherine Walsh told Justice Lee that \"hopefully you'll see from the size of the compensation payment that, in fact, we are very sorry\".\n\n\"We do wish for the workforce that was impacted to be properly remediated and the compensation that has been agreed could go some way to deal with that,\" she said.\n\nOutside court, former Qantas worker Damien Pollard said union members were looking forward to the conclusion of the case \"to allow us to get on with our lives\".\n\n\"It's been a long fight, it's been very stressful for a lot of employees, so we are looking forward to the end,\" he said.",
    "source": "9News",
    "cluster_id": 4
  },
  {
    "url": "https://www.9news.com.au/world/cruise-captain-michele-bartolomei-dies-diamond-princess/3152e071-5d1a-45fd-8804-a027cba8ed90",
    "title": "'Profound sadness:' Cruise ship captain dies on board after medical emergency",
    "publish_date": "Tue, 20 May 2025 03:04:24 +0000",
    "category": "finance",
    "authors": [
      "May"
    ],
    "text": "T﻿he captain of a cruise ship has died while working on board, guests have been told.\n\nCaptain Michele Bartolomei, who was at the helm of Diamond Princess, died while the ship was on a 19-night cruise around Japan, Korea, Taiwan, and China.\n\nA letter, which has been shared online, was delivered to passengers' cabins announcing the devastating update.\n\nCaptain Michele Bartolomei, who was at the helm of Diamond Princess, died while the ship was on a 19-night cruise around Japan, Korea, Taiwan, and China. (LinkedIn)\n\n\"It is with profound sadness that we share the news of the passing of Captain Michele Bartolomei, who died onboard Diamond Princess earlier of a sudden medical emergency,\" it said.﻿\n\n\"Our hearts are with ﻿Captain Bartolomei's family during this incredibly difficult time.\"\n\nIt added that the Italian captain was a \"respected leader' with \"decades of service at sea\".\n\nThe letter told passengers said the ship would be commanded by Captain Salvatore Macera alongside the rest of the \"experienced\" bridge team.\n\nCaptain Michele Bartolomei, left, has died. (Supplied)\n\nPassengers reported being woken up in the early hours by an announcement asking the medical team to report to the medical centre.\n\nAnnouncements of the captain's death were also made over the ship's PA.\n\nIn January, Bartolomei joined Captain Mario Consentino from Crown Princess to share a coffee in Sydney Harbour to mark the special occasion of the two ships meeting.﻿\n\nHe was about to celebrate 30 years of service with the company, according to his LinkedIn page.﻿\n\nHe also had his own fishing boat and had worked 18 seasons cruising Alaska, he said.﻿\n\nHe lived in Canada and had studied at nautical schools in Italy.\n\nREAD MORE: Prime Minister invites Pope to Australia during private meeting\n\nThe captain of Diamond Princess has suddenly died. (AP/AAP)\n\nFriends and cruisers paid tribute to the Captain.\n\n﻿Dave Wallensky said: \"Captain Bartolomei spent almost 30 years flying the Princess flag. He was a legend on the sea - but he was my friend.\"\n\n\"Very much loved, and will be very much missed,\" another said.",
    "source": "9News",
    "cluster_id": 5
  },
  {
    "url": "https://www.abc.net.au/news/2025-05-21/adam-lindsay-gordon-dingley-dell-cottage-glamping-delay/105296608",
    "title": "Revered poet's house in balance as fans pan glamping plan",
    "publish_date": "Wed, 21 May 2025 01:18:37 +0000",
    "category": "finance",
    "authors": [],
    "text": "The home of one of the first Australian poets to be recognised internationally has sat mostly closed to the public for the past five years amid a stoush over a former dot-com-boom millionaire's bid to install glamping tents.\n\nSouth Australia's National Parks and Wildlife Service is set to reveal its plans next month for the Dingley Dell Conservation Park, in which Adam Lindsay Gordon's house sits.\n\nGordon was born in England in 1833, moved to Australia in 1853 and bought Dingley Dell, near Port MacDonnell, in the state's far south-east, in 1862.\n\nA statue of Adam Lindsay Gordon near Parliament House in Melbourne. (Supplied: City of Melbourne Art and Heritage Collection)\n\nHis poems that romanticised the Australian bush and particularly horse racing were first published locally in 1864.\n\nHis most well-known work, Bush Ballads and Galloping Rhymes, was published in 1870, just a day before he died in Melbourne.\n\nHe is the only Australian poet to have a bust at Poets' Corner in London's Westminster Abbey.\n\nPlan for glamping delayed\n\nApart from a few open days, the Dingley Dell cottage has mostly been closed to the public since the operators gave up their lease in 2020.\n\nIn 2021, amid a push to find more innovative uses for parks during the COVID-19 pandemic, Stephen Moignard was given $233,000 by the previous state government to set up 20 glamping tents within the 6-hectare Dingley Dell park.\n\nMr Moignard's company Davnet brought high-speed internet to Australia before failing in 2001.\n\nGlamping tents are set up at Stephen Moignard's Coonawarra Bush Holiday Park. (Supplied)\n\nHe has also run several other internet-based businesses and now owns the Coonawarra Bush Holiday Park, which also offers glamping in the South East.\n\nWork on Mr Moignard's project was delayed while a new park management plan was being developed.\n\nThe National Parks and Wildlife Service said last year it would be completed by the end of 2024, but has since said it should be released in June.\n\nDingley Dell is named after a gum tree of the same name that produces pink flowers. (ABC South East SA: Eugene Boisvert)\n\nBalancing different views\n\nThe Adam Lindsay Gordon Commemorative Committee held an open day at Dingley Dell on Saturday.\n\nTreasurer Lorraine Day said she wanted the cottage to be open more often.\n\n\"We hope so but we need to attract the right person with the right interest to … carry the cottage forward with what it should be,\" she said.\n\nLorraine Day reads out a poem by Adam Lindsay Gordon at the open day. (ABC South East SA: Eugene Boisvert)\n\nShe was sceptical of Mr Moignard's plan.\n\nAsked if she approved of the proposal, she said, \"Not particularly, no\".\n\n\"It's got to be done properly and certainly not the amount [of glamping tents] that was planned to be erected there,\" she said.\n\nMr Moignard told the ABC he was frustrated by the time the National Parks and Wildlife Service had taken to develop the plan and allow his operation to start.\n\n\"But we're inching forward with it now,\" he said.\n\nAdam Lindsay Gordon loved competing in steeplechases. (Supplied: State Library of South Australia)\n\nThe service's manager on the Limestone Coast, Nick McIntyre, said he was still trying to make everyone happy after last year's consultation.\n\n\"There were some community interests which were made known to us through that process and then of course it becomes a matter of trying to join and relate and work through those various issues that are raised to work out what best sits within the plan and what doesn't fit within the plan and just trying to get a good match of some of the aspirations for the site,\" he said.\n\nThe previous plan for the park was approved in 1994.\n\nIt noted that attendance was low.\n\nStables have been reconstructed at Dingley Dell. (ABC South East SA: Eugene Boisvert)\n\nMr McIntyre said open days worked better than regular opening hours to entice visitors interested in Gordon's life and poetry.\n\n\"Not only does it build an awareness of the history and the heritage associated with Dingley Dell, it keeps the memory and the spirit of Adam Lindsay Gordon alive,\" he said.\n\n\"It also is probably a pretty good use of time, as well, because you're getting quite a number of people making the most of the opportunity to attend due to the advertising.\"\n\nPopular open day\n\nAbout 70 people attended Saturday's open day.\n\nPeter O'Rourke visited from Mount Lonarch, near Ararat, in Victoria.\n\nHe said the cottage and the garden gave a real feel of what it would have been like when Gordon lived at the cottage.\n\n\"I think that something like glamping or similar development would really spoil it,\" Mr O'Rourke said.\n\nAngela Goode is the Limestone Coast ambassador for South Australia's history festival. (ABC South East SA: Eugene Boisvert)\n\nAngela Goode, from Mount Gambier, has written a film script about Gordon.\n\nShe said his poetry was popular at the time but now was \"past its used-by date\" .\n\nShe said his life as an \"eccentric toff\" who became a police officer in South Australia and then later a politician and horseman was more interesting.\n\n\"He was a very strange muddled mix of many different qualities and I think an enigmatic character that perhaps we could learn something from or admire or feel sorry for,\" she said.",
    "source": "ABC",
    "cluster_id": 6
  },
  {
    "url": "https://www.abc.net.au/news/2025-05-21/wa-pioneer-jarrah-axemen-worked-in-terrible-conditions/105297658",
    "title": "Timber, gold and blood: How axemen survived the mighty jarrah forests",
    "publish_date": "Wed, 21 May 2025 01:00:37 +0000",
    "category": "finance",
    "authors": [],
    "text": "The grim, back-breaking work of Western Australia's pioneering logging families should not be forgotten, according to historians, who say their contribution to the construction, railway and shipbuilding industries was vital.\n\nUnder often treacherous conditions, loggers climbed and then felled giant jarrah trees prized for their hardy timber.\n\nThe trees, which can grow to 40 metres and live for 1,000 years, became known as \"Swan River mahogany\" to European colonisers in the 1800s, however the species is known as djarraly in the Noongar language.\n\nIt is almost 18 months since native timber logging was banned in the state, bringing an end to 200 years of forest harvesting.\n\nA worker felling trees at Greenbushes in 1962. (Supplied: Vittorio DA Re)\n\nBut historian Don Briggs said the stories of the early workers and their families should not be forgotten just because logging in native forests has been banned.\n\nDuring its peak, logging in the only area of Australia where jarrah grows naturally — WA's south-west — had axemen working under terrible conditions.\n\nThe pay, particularly for southern European migrants, was so low there were reports of some severing their own fingers for workers' compensation and income.\n\nThis grizzly chapter of WA's history has been archived with interviews and records.\n\nEuropean colonisers called jarrah trees \"Swan River Mahogany\". (Supplied: WA State Library)\n\nBut not all woodsmen were treated harshly.\n\nOne such logger, Norman Smith, travelled west from Victoria at the turn of the 20th century to earn his way in WA's burgeoning native timber industry.\n\nIn an archival interview recorded in 1971 and provided to the ABC, Mr Smith, who has since died, recalled his life as an axeman when the pay was more agreeable.\n\nHe said he was paid in gold pieces, known as sovereigns.\n\n\"We considered we weren't doing much good unless we made 50 pounds a month,\" Mr Smith said.\n\n\" And they paid us in gold — there were no notes or anything in those times. \"\n\nFifty pounds from the early 1900s equates to about $10,000 today.\n\nA resilient timber\n\nHistorian Mr Briggs has spent years researching and writing the history of the South West's native timber industry.\n\n\"It goes right back to the 1830s, when the first ships arrived. One of the ships was Captain James Stirling's boat, the HMS Success,\" he said.\n\nA painting of the HMS Success by Ross Shardlow. (Supplied: Margaret River and Districts Historical Society)\n\nThe HMS Success crashed into Carnac Island, but the crew managed to throw enough weight overboard to float the ship to Garden Island, where it was repaired.\n\n\"The timber used was called Swan River mahogany, which later became known as jarrah,\" Mr Briggs said.\n\nWhen the HMS Success returned to England with no sign of marine borer damage in the jarrah repairs, WA's timber export industry boomed as demand for jarrah wood soared.\n\nNative timber was a thriving export industry in WA's South West in the early 1900s. (Supplied: WA State Library)\n\nJarrah country\n\nJarrah wasn't just prized by shipbuilders — it was also used in the construction of railway networks throughout Western Australia, thanks to its natural resistance to termites.\n\nInitially, railway sleepers, especially in the Great Southern region, were made from timber harvested in the karri forests near Torbay, about 20 kilometres west of Albany.\n\nMr Briggs said once the construction workers realised that the karri wood was often riddled with white ants, they set their sights on harvesting the jarrah forests.\n\nHistorian Don Briggs with a piece of jarrah. (Supplied: Margaret River and Districts Historical Society)\n\n\"They had to get the jarrah, and they had to replace all of the karri sleepers,\" he said.\n\nIn the early 1900s, thousands of men made their way to jarrah country to work on the railways.\n\nWhile men, including Mr Smith, toiled on the forest floor, where they cut railway sleepers by hand, others risked life and limb climbing the giant trees to make fire-lookout towers, such as the iconic Gloucester Tree at Pemberton, 320km south of Perth.\n\nMr Smith said the men would ascend the trees on precarious spikes driven into the wood.\n\n\"They drove one in, say up three feet, and then the other one would be up a couple of feet … and they kept driving these spikes in and they climbed up them,\" he said.\n\nAxemen had to replace karri wood railway sleepers full of white ants with jarrah. (Supplied: WA State Library)\n\nBut it was risky work, and not everyone was keen to climb 40 metres up a tree trunk.\n\n\"Some blokes would never get up there … but other blokes that could climb, well, they revelled in that,\" Mr Smith said.\n\nHarsh treatment of European migrants\n\nWaves of European migrants eventually flocked to WA's southern forests for work from the 1920s to the 1970s.\n\nChristina Gillgren has detailed migrants' stories in the book Growing Roots — the Italians and Croatians in the Development of the Western Australian Timber Industry.\n\nPompeo Paganoni with a dragsaw in Karnup circa 1947. (Supplied: Ben Gherardi)\n\n\"These early settlers came and did a lot of the clearing of the land, especially on private property,\" Dr Gillgren said.\n\n\" The reality was they could only work in rural areas: unattractive, isolated, harsh and dangerous work with low pay. \"\n\nDr Gillgren, who has a doctorate in philosophy from Murdoch University, said casual migrant workers in the native timber industry went to great lengths to maintain their income.\n\nFrank Da Re and Vittorio Da Re cutting jarrah into sleepers in Greenbushes in 1969. (Supplied: Vittorio Da Re)\n\n\"Especially when they didn't get paid, they would resort to very extreme acts to get some income. Sometimes they would cut off fingers and toes,\" she said.\n\nDr Gillgren said a severed finger or toe would be enough for a workers' compensation claim from the timber mills.\n\n\"It was very grim,\" she said.\n\nA hewing team at Roelands in 1926. (Supplied: S. Viskovich)\n\nLife for the workers' spouses and children was also unforgiving, according to Dr Gillgren.\n\nOne example was the life of an Australian woman called Elsie, who married a Croatian hewer.\n\n\"She came out of hospital with a baby, straight into the tent in the bush,\" Dr Gillgren said.\n\n\"She ended up having 13 children.\n\n\"Her husband would come home and tell her they had to shift camp.\n\n\"She'd have to pack everything up — she'd probably only just finished washing the nappies.\"",
    "source": "ABC",
    "cluster_id": 7
  },
  {
    "url": "https://www.abc.net.au/news/2025-05-21/south32-gemco-manganese-mine-resumes-exports-groote-eylandt/105314952",
    "title": "Major NT mine resumes exports after 14-month halt from cyclone damage",
    "publish_date": "Wed, 21 May 2025 00:51:31 +0000",
    "category": "finance",
    "authors": [],
    "text": "South32's Groote Eylandt manganese mine has resumed exports for the first time since severe cyclone damage to its wharf halted operations last year.\n\nThe Groote Eylandt Mining Company (GEMCO) mine was badly damaged when Tropical Cyclone Megan hit the Northern Territory island in March 2024.\n\nIts wharf was destroyed by a loaded bulk carrier that smashed into the structure during cyclonic winds and high tides.\n\nHeavy rainfall also flooded the mine's pits and damaged a critical bridge and several roads.\n\nThe Australian Maritime Safety Authority said the Groote Eylandt wharf was severely damaged. (Supplied)\n\nThe damage led to GEMCO — a subsidiary of South32 — suspending mining and manganese exports, with the expectation shipments would resume between January and March 2025.\n\nIn a statement this week, South32 announced export sales had resumed after a \"recovery effort of immense scale and complexity\".\n\nHeavy rainfall during Tropical Cyclone Megan lead to water bubbles forming under the roads on Groote Eylandt. (Supplied)\n\nSouth32 chief operating officer Vanessa Torres told the NT Country Hour the first ship docked at the new wharf on Monday.\n\n\"That will be the first export of ore from GEMCO over the last year since Cyclone Megan hit,\" she said.\n\nMs Torres said rebuilding the wharf had been a huge effort, with about 317,000 hours of work involved and the removal of some 970 tonnes of steel and 740 tonnes of concrete.\n\nShe said the mine's old wharf — constructed 60 years ago — had been completely rebuilt with new technology, making for \"a significantly upgraded facility\" that could withstand another cyclone event.\n\n\"I think what we experienced was a one-in-1,000-year event,\" she said.\n\nMs Torres said GEMCO had been able to retain its workforce of about 1,000 workers throughout the exports suspension period.\n\nLocal member for Arnhem Selena Uibo said it was \"great news\" exports were resuming.\n\n\"The export of manganese off Groote Eylandt will make a huge impact in terms of the territory's economy, but particularly for Groote Eylandt and the income that provides,\" she said.\n\nLoading...\n\nCosts remain unclear\n\nMs Torres said the cost of the clean-up and rebuild at the GEMCO mine had not been finalised, but would be revealed when the company provided its annual results to the market.\n\nVegetation dieback on Groote Eylandt Photo shows dead and dying trees on Groote Eylandt. It's feared damage to the environment near a manganese mine on Groote Eylandt may have been caused by the dewatering of mining pits that were flooded by a cyclone in March.\n\nIn its 2024 annual report, South32 said the mining halt had cost the company $US93 million ($137 million at the then exchange rate), while repairs to the wharf, a bridge and other infrastructure were expected to cost $US125 million ($184 million).\n\nSouth32 received $555 million in insurance payments for the cyclone damage.\n\nIn its statement this week, South32 said it expected export sales from the GEMCO mine to increase over the June 2025 quarter and return to \"normalised rates\" over the 2025-26 financial year.",
    "source": "ABC",
    "cluster_id": 8
  },
  {
    "url": "https://www.abc.net.au/news/2025-05-21/are-you-lonesome-tonight-outback-tour-success/105308088",
    "title": "Two music genres people 'love to hate' find success in the outback",
    "publish_date": "Wed, 21 May 2025 00:36:22 +0000",
    "category": "entertainment",
    "authors": [],
    "text": "There are two genres of music people love to hate — opera and country.\n\nUnder a kaleidoscope of stars in outback Queensland the two styles have merged and found a surprising audience.\n\n\"Slim Dusty and Puccini, who would have thought,\" Melbourne opera fanatic Rosey Boyd said.\n\nOpera lovers from across Australia gathered at the Age of Dinosaurs museum for a performance. (ABC Western Qld: Grace Nakamura)\n\nCountry songs are said to be made up of \"loving, drinking, fighting and cussing\" — similarly inspired themes that feature in opera, according to Opera Queensland.\n\nIt is a hypothesis that Opera Queensland's Laura Hansford has transformed into the nationally touring country-opera production Are You Lonesome Tonight.\n\n\"They both have a commitment to deep emotions — you love so hard you're going to throw somebody off a castle or die,\" Ms Hansford said.\n\nSouth Korean soprano Sumi Jo is the star headliner of the opera this year. (ABC Western Qld: Grace Nakamura)\n\nOpera is not the typical genre of choice in rural communities, but the Festival of Outback Opera has been running for five years in western Queensland, bringing an influx of tourists from across Australia.\n\nIt is a welcome boost for the local communities of Longreach and Winton where destructive flooding in parts of the outback earlier this year led to mass cancellations at the start of the tourist season.\n\n\"We were actually very pleased that we were able to come and support the community given that they've had really hard times,\" said Brisbane attendee Elizabeth Wray.\n\nInterstate visitors and outback locals watch the Opera Queensland performance. (ABC Western Qld: Grace Nakamura)\n\n'Brilliance in storytelling'\n\nLaura Hansford recalled her initial apprehension four years ago when she was tasked with the challenge of creating a show that somehow combined John Williamson, Verdi, Slim Dusty and Puccini.\n\n\"I said 'that's crazy' and then I went away and thought 'that's actually really cool and interesting,'\" she said.\n\nLaura Hansford is the director of Opera Queensland's Are You Lonesome Tonight. (Supplied: Opera Queensland)\n\nIt turns out that after \"ruining\" her Spotify algorithm researching the two genres, they unexpectedly had a lot in common.\n\n\"One of the big things is the brilliance in storytelling,\" she said.\n\n\" I think it's about giving it a go and letting go of what you think about something. Just stripping it back to good music. \"\n\nShe said the show had found success particularly with regional Queensland audiences, which led to Opera Queensland taking the show nationally this year.\n\n\"Whether you're an opera fan, whether you are a country fan, whether you're a Taylor Swift fan, there is something in this show for everybody — and that's what connects us all,\" she said.\n\nDinosaurs and opera under the outback sky drew a record crowd. (ABC Western Qld: Grace Nakamura)\n\nSinger Gabrielle Diaz never thought she would end up in a production like this after studying classical voice at Brisbane's Conservatorium of Music.\n\nShe loved the exploration of the two styles, switching effortlessly from American twang to the full vowels of an operatic aria.\n\n\"This is kind of like my dream come true,\" she said.\n\nOpera in the outback\n\nWith grey nomad tourist numbers on the decline, a different niche of silver-haired travellers is boosting visitor numbers in western Queensland.\n\nRetirees, often from Melbourne or Sydney, make up the majority of the crowd at the Festival of the Outback Opera.\n\nA broken down car did not stop these opera lovers from making it to the production in Longreach. (ABC Western Qld: Grace Nakamura)\n\nRosey Boyd and her crew are on a three-month road trip and were crunched for time to get to the show in Longreach.\n\n\"We broke down two hours out of Melbourne, but we didn't let that stop us,\" Ms Boyd said.\n\n\"We love the opera. We go as often as we can afford in Melbourne.\"\n\nMarg Morgan said she had always wanted to see the outback, and the opera was a bonus. (ABC Western Qld: Grace Nakamura)\n\nWrapped in a fur coat, Margaret Morgan flew from Brisbane just to experience the outback.\n\n\"You're sitting here out in the fresh air, with stars shining up above, and you're just part of the joy of music,\" she said.\n\n\"It's one of those things you have to be here to feel.\"\n\nThis is the fifth year Opera Queensland has performed in Winton. (ABC Western Qld: Grace Nakamura)\n\nOpera Queensland chief executive Patrick Nolan said the vast outback made for a perfect stage.\n\n\"There's a clarity you get acoustically, once the sun sets, something happens in this environment which really lifts the singers' voices in a way,\" he said.\n\nAs for the outback residents themselves?\n\nOpera has won over more than a few fans.\n\n\"It's actually enjoyable. I don't usually like opera but from this I do. It tells a story,\" said Longreach country music enthusiast Kelsey Silburn.",
    "source": "ABC",
    "cluster_id": 9
  },
  {
    "url": "https://www.abc.net.au/news/2025-05-21/pilbara-indigenous-leaders-selected-new-york-marathon-project/105309190",
    "title": "Years of effort sees WA woman locked in for New York Marathon",
    "publish_date": "Tue, 20 May 2025 23:58:25 +0000",
    "category": "sports",
    "authors": [],
    "text": "Growing up, Chanti McHenry says she was surrounded by bad habits and had few positive role models.\n\nA desire to offer leadership to her children and others in Karratha, 1,530 kilometres north of Perth, has seen her embark on a new challenge — running the New York Marathon.\n\nIn just six months, McHenry, a Bardi, Noongar and Ngarluma woman, will swap the red dirt tracks of the Pilbara for the streets of Manhattan, running the landmark race as part of the Indigenous Marathon Project.\n\nShe felt disbelief when her coach said she had been selected as one of 12 First Nations people across Australia to join the squad.\n\n\"He said to me, 'Congratulations Chanti, you've been picked out of 320-odd people,'\" she said.\n\n\"And I was like, 'It can't be!'\"\n\nMost people joining the project have no prior running experience. (ABC Pilbara: Alistair Bates)\n\nThose selected live in all corners of the country and recently met for the first time in Canberra for a series of workshops.\n\n\"We connected on the purpose of why we're doing it, and it's so much more than running,\" McHenry said.\n\nLeadership focus\n\nHer purpose is to become an even stronger leader in the community.\n\nCurrently an Aboriginal Islander education officer at a primary school in Karratha, McHenry has worn many hats, including supporting Indigenous students through high school and advocating for a Headspace clinic in town.\n\nShe also helped establish a community kitchen and was heavily involved in her local football club.\n\n\"I train hard no matter what I do and I dream big,\" she said.\n\n\"But that only started when I was in my late teens, when I saw the right way of living and positive attitudes.\n\n\" I want to mirror that to my community, because I didn't have that when I was young. \"\n\nMcHenry says she broke down when told she was selected for the squad. (ABC Pilbara: Mietta Adams)\n\nThe program, now in its 16th year, is dedicated to improving the health and wellbeing of Indigenous Australians by creating a ripple of change in their communities.\n\nHead coach and Gunggandji man Jack Stevens said many applicants had dealt with trauma and difficulties, but were driven to create change.\n\nStevens will also coach Yinhawankga man Kiet Cook, who lives in Onslow, 300km south-west of Karratha.\n\nJack Stevens completed the Indigenous Marathon Project two years ago. (Supplied: Indigenous Marathon Project)\n\nHe said both trainees stood out because of their drive to \"break down the cycles\" in their communities and build leadership skills.\n\n\"We use the marathon as a vehicle to highlight and drive Indigenous excellence across the country, especially in remote communities like the Pilbara,\" Stevens said.\n\n\"Being able to take that to a large-scale international event like the New York City Marathon is one way to show that there is so much good happening within those communities.\"\n\nMcHenry is focused on training her body and mind for the event. (ABC Pilbara: Mietta Adams)\n\nChallenge of the 'wall'\n\nMcHenry remains focused on training her body and mind for the November race.\n\nShe said she was keen to feel her \"wall\", the point in the race where the body runs out of energy.\n\n\"Even though it's going to be painful, I just want to know what that wall is. And I guess if I can undertake that and experience it and do it, I can do anything.\"",
    "source": "ABC",
    "cluster_id": 10
  },
  {
    "url": "https://www.abc.net.au/news/2025-05-21/postecoglou-puts-spurs-first-ahead-of-europa-league-final/105317306",
    "title": "'I'm not a clown': Defiant Postecoglou puts Spurs first ahead of Europa League final",
    "publish_date": "Tue, 20 May 2025 22:39:17 +0000",
    "category": "sports",
    "authors": [],
    "text": "Tottenham Hotspur manager Ange Postecoglou has dismissed questions about his job during a bullish press conference performance ahead of the Europa League final, angrily refuting a suggestion that he is a clown.\n\nThe Spurs boss insisted his job was not a concern ahead of Thursday morning's (AEST) game against Manchester United and that his focus was on winning Tottenham's first European silverware in 41 years and its first trophy since 2008.\n\n\"My future is assured, mate,\" Postecoglou, whose side has suffered its worst domestic season in nearly 50 years, said.\n\n\"I wouldn't be the first person who changes jobs. I've got a beautiful family. I've got a great life. Don't waste a minute of sleep thinking about it.\"\n\nSpurs' last European trophy was the UEFA Cup in 1984, while their last domestic trophy came when they lifted the League Cup in 2008.\n\nThe coach, who spoke passionately about his parents' journey from Greece to Australia, stressed that his primary concern was seizing the opportunity to provide something special for Tottenham and their supporters.\n\n\"Whatever happens beyond tomorrow is kind of irrelevant if you think about the opportunity that is presented for us right now,\" Postecoglou said.\n\n\"There's so many years without winning a trophy. If I was worried about my tenure with this club, it's fair to say that we wouldn't be in this position because I would have been too distracted with unimportant things.\"\n\nPostecoglou insisted he had not discussed his future with his players and he reacted angrily at one stage in response to a newspaper article that suggested he would be seen as either a hero or a clown.\n\n\"I'm not a clown,\" he said.\n\n\"I'll keep on winning trophies until I finish, whenever that is.\"\n\nHe also suggested that winning the Europa League final, which provides a path into next season's Champions League, could cement his role at Spurs.\n\n\"I don't think my job is done here. I really feel like we were building something here and what a trophy does is hopefully accelerate this,\" Postecoglou said.\n\n\"I still think there's a lot of work to be done. That's quite obvious with what sort of the challenges we've had this year, which I think are well chronicled. But also there's been some growth that I'd like to see continue.\n\n\"So don't worry about my future, mate. I'll be OK.\"\n\nTottenham will play Manchester United in the Europa League final on Thursday, May 22, at 5am (AEST). Join ABC Sport's Simon Smale as he live blogs all the action.\n\nReuters",
    "source": "ABC",
    "cluster_id": 11
  },
  {
    "url": "https://www.abc.net.au/news/2025-05-21/sewing-classes-teaching-english-in-outback-mount-isa-cams/105299732",
    "title": "Outback sewing classes help migrants learn English and find friendship",
    "publish_date": "Tue, 20 May 2025 22:17:33 +0000",
    "category": "finance",
    "authors": [],
    "text": "Outback Queensland is a long way from Pakistan — but when you do not speak English, it can feel even further.\n\nThat all changed for Amina Faisal when she made a Pakistani friend on the streets of Mount Isa.\n\n\"I used to wander here and there, just exploring Mount Isa, then suddenly I met one of my Pakistani friends,\" she said.\n\nThe friend suggested she head to the local library, where she found a community of residents from around the world.\n\nMs Faisal learnt English through sewing classes with the group.\n\nAmina Faisal says she has found a community through sewing classes at the local library. (ABC North West Qld: Maddie Nixon)\n\nNow, she has a job at the local supermarket, a group of friends in town and has just given birth to her first child.\n\n\"[Before] my husband had to explain everything to me, what they are talking about,\" Ms Faisal said.\n\n\"The biggest barrier is the language, if you don't know the language, in any country, you can't have a job.\"\n\nA multicultural outback city\n\nTherese Sexton is the Multicultural Program Coordinator at Community Action for a Multicultural Society (CAMS) Mount Isa.\n\n\"We assist the migrant community in feeling welcome for social and economic inclusion,\" she said.\n\nCAMS has 19 locally run branches funded by the state government across Queensland, with each program tailored to meet the needs of its community.\n\nTherese Sexton says CAMS has been in Mount Isa since 2015. (ABC North West Qld: Maddie Nixon)\n\nIn Mount Isa, CAMS facilitates weekly sewing classes, where women from different countries come together to sew, drink tea and practice their English.\n\n\"It's an opportunity for those who are quite capable of sewing to teach the beginner sewers as well — [it is] a great opportunity to interact,\" Ms Sexton said.\n\nKitika Lambden and Amina Faisal with their sewing creations. (ABC North West Qld: Maddie Nixon)\n\nAccording to the ABS, 23 per cent of Australians speak a language other than English at home.\n\nAnd in the remote city of Mount Isa that figure is still significant at 15 per cent .\n\nLike Ms Faisal's husband, many people migrate to the region for employment in the mining industry.\n\nA travel pillow Amina Faisal made for her husband. (ABC North West Qld: Maddie Nixon)\n\nThe first project she worked on with the group was sewing blankets for the maternity ward at Mount Isa Hospital, the same ward where she would deliver her first child.\n\nWhen Ms Faisal fell pregnant, her mother back in Pakistan was worried she would have no help.\n\n\"I told her, 'No, I'm not all alone, I have some very good friends here,'\" she said.\n\n'I feel so proud'\n\nKitika \"Bird\" Lambden moved from Thailand in September last year after her husband secured work in the mine.\n\n\"I like Mount Isa because … [it's] quiet and not traffic jam — the opposite of my hometown\" she said.\n\nKitika Lambden is happy with what she has learnt so far. (ABC North West Qld: Maddie Nixon)\n\nMs Lamden is excited to learn how to repair her clothes rather than replace them, but loves the social aspect of the group too.\n\n\"This helped me learn a conversation with my friend,\" she said.\n\n\"My friend is international from India, Pakistan, Indonesia, Australia, and Thai, and [we] have fun.\"\n\nThe more experienced sewers help the others in the class. (ABC North West Qld: Maddie Nixon)\n\n\"I feel so proud of myself and say, 'Oh! I can do!'\n\n\"I know everything is different but I'm so happy living in Mount Isa.\"\n\nSeeking job opportunities\n\nMashell Ortac moved to Mount Isa three weeks ago.\n\n\"I came here … looking for job opportunities because I am geologist,\" she said.\n\nAfter leaving her home country of Ecuador, Ms Ortac lived in Sydney for five months and then the small town of Bedourie for a year and a half.\n\nShe said Mount Isa was a whole new remote Australian experience.\n\nMashell Ortac moved to the region to find work as a geologist. (ABC North West Qld: Maddie Nixon)\n\n\"I was shocked because it's a city in the middle of nowhere,\" Ms Ortac said.\n\nShe had never sewn before but jumped at the opportunity to meet new people.\n\n\"The ladies help me a lot because I didn't [have any] idea how to turn on the machine,\" Ms Ortac said.\n\n\"It's perfect for me because I would like to improve my English and I like to learn about other people [and] their stories.\"",
    "source": "ABC",
    "cluster_id": 12
  },
  {
    "url": "https://www.abc.net.au/news/2025-05-21/asx-markets-business-live-news-may-21/105317164",
    "title": "Live: ASX rises as markets price in further rate cuts",
    "publish_date": "Tue, 20 May 2025 22:06:55 +0000",
    "category": "finance",
    "authors": [
      "Stephanie Chalmers",
      "Daniel Ziffer",
      "Emilia Terzon",
      "Michael Janda",
      "David Chau"
    ],
    "text": "I read on Reuters last night that many corporations (Play Station, Birkenstock, and Pandora were named) are going to raise prices everywhere so that they won't have to raise prices as much in the US, to offset the tariffs. This seems grossly unfair to me. Do you know if there's a website that lists the companies that are doing this, so that we know what NOT to buy?\n\nMorning Carolyn — thanks for alerting me to that piece. I'm not aware of any official list along those lines but we could start crowdsourcing one in the blog comments?\n\nAs you say, Birkenstock and Pandora are among the global retailers increasing prices beyond US borders to spread the price pain beyond American consumers.\n\nHere's the story from Reuters:\n\nGlobal retailers including sandal maker Birkenstock and jeweller Pandora are looking at spreading the cost of US tariffs by raising prices across markets to avoid big hikes in the United States that could hurt sales.\n\nA global presence gives large retailers an advantage to minimise higher tariff costs in the US. But it is putting central banks on watch as the strategy could fuel inflation in other markets like the European Union and Britain, where consumer prices have finally started to stabilise.\n\nBirkenstock's chief financial officer said last week that a \"low-single-digit\" price increase globally would be enough to offset the US tariff impact.\n\nPandora CEO Alexander Lacik said the Danish company is debating whether to raise prices globally or more in the US, its biggest market.\n\n\"Companies are really thinking about distributing the tariff,\" said Markus Goller, partner at consultancy Simon Kucher in Bonn, Germany.\n\n\"A manufacturer from outside of the US might say, OK, I cannot increase my prices to the US market that much, so I will do a little increase in the US, and a little increase in Europe, and in other markets.\"\n\nUS President Donald Trump has imposed a blanket tariff of 10% on all global imports and is threatening higher so-called \"reciprocal\" tariffs on its trading partners.\n\nWhen US behemoth Walmart said it would have to raise prices in response to tariffs, Trump ordered the world's biggest retailer via social media to 'eat the tariffs'.\n\nAnnouncing price increases in non-U.S. markets could be a way for retailers to avoid a similar backlash from Trump.\n\n\"Obviously if your products coming into the US are now subject to tariffs, then math says that you have to raise your prices in the US,\" said Jean-Pierre Dubac, professor of marketing at the University of Chicago Booth School of Business.\n\n\"But you don't want to be accused by the White House of raising prices purely because of US tariffs, so if you can demonstrate that your prices are going up everywhere then… it's kind of a shield.\"\n\nRetailers could raise prices on certain products or in certain markets where consumers are less price-sensitive, and use that to subsidise other products or countries where price hikes would hurt sales more, said Jason Miller, professor of supply chain management at Michigan State University.\n\n\"Maybe a US-only firm has to raise (US) prices by 12%. But you, as a global firm, raise prices by 8% because you can play with pricing in other markets,\" he said.\n\nIf many multinational retailers do spread the tariff pain, higher inflation could spread even to countries which, like Britain, have already struck trade agreements with the US in a bid to minimise the economic fallout of tariffs.\n\nBank of England Governor Andrew Bailey earlier this month raised the issue of \"global companies that don't make that distinction (on tariff rates) and just say, we're going to impose a pricing solution which goes right across the world irrespective of those differences.\"\n\n\"I think we do have to watch that carefully,\" he said.\n\nINFLATION UNCERTAINTY\n\nIn the euro zone, inflation was finally gliding towards the European Central Bank's 2% target. European companies surveyed by the European Central Bank (ECB) in late March said price growth in the retail sector was subdued.\n\nBut that was before Trump unveiled his tariff policy on April 2, and later hiked tariffs on Chinese goods to 145%.\n\nHowever, the US tariffs on China — lowered last week to 30% — have allowed some European retailers to source goods more cheaply than before.\n\nMartino Pessina, CEO of Takko Fashion, which sells clothes in 17 European countries, said suppliers in China had offered lower prices as US retailers cancelled orders from factories there, and shipping costs also fell.\n\n\"What we don't know is if there's going to be inflation in the US and if that inflation comes to Europe or not,\" Pessina said.\n\nSome big retailers have in any case ruled out raising prices outside the US.\n\n\"There is no reason to raise prices outside the US because of the tariffs,\" Adidas CEO Bjorn Gulden told investors after reporting results late last month.\n\n\"The discussion we're having on tariffs is only for the US.\"\n\nECB executive board member Isabel Schnabel has said the euro zone's inflation rate may initially dip below the central bank's 2% target, but that tariffs might prove inflationary further down the road.\n\n\"In order to compensate for the hit to input costs, firms also tend to raise the prices of goods not directly affected by tariffs,\" Schnabel said in a speech earlier this month.\n\nWhile every company has its own pricing strategy, economists warn some could take advantage of tariffs to raise prices by more than rising costs, boosting their profits similarly to the inflation surge of 2021-2022 during the pandemic.\n\n\"It will be very difficult for a firm's customers to know what portion of the product's total costs are subject to the tariff, or even the tariff rate that applies.\n\n\"This information asymmetry creates a ripe environment for exploitation. Just as it did during COVID,\" said Hal Singer, professor of economics at the University of Utah.\n\nUS consumers' 12-month inflation expectations jumped in April to 6.7%, the highest reading since 1981. And in the euro zone, too, consumers are expecting inflation to rise.\n\n\"If people are expecting inflation, well then it gives firms a little bit more room to raise prices,\" said Miller.",
    "source": "ABC",
    "cluster_id": 13
  },
  {
    "url": "https://www.abc.net.au/news/2025-05-21/american-rugby-player-alev-kelter-ban-for-wallaroos-head-stop/105317204",
    "title": "American handed three-game ban for stamping on Wallaroo's head",
    "publish_date": "Tue, 20 May 2025 22:03:58 +0000",
    "category": "sports",
    "authors": [],
    "text": "United States centre Alev Kelter has been banned for three matches for her ugly head stomp on her Wallaroos opposite during Australia's Pacific Four win in Canberra.\n\nThe former ice hockey and soccer player was sent off late in the Wallaroos' 27-19 win for an act which referee Aimee Barrett-Theron labelled \"thuggery\".\n\nA three-time Olympian who won bronze for the American sevens team in Paris last year, Kelter took a hit-up and then stamped repeatedly with her boot on Georgina Friedrichs's head as she was clinging to her other leg.\n\nLoading TikTok content\n\nOn Tuesday, Kelter appeared before an independent disciplinary committee in New Zealand, where the US will face the Black Ferns in the next round.\n\nKelter told the committee, chaired by Michael Heron KC (New Zealand) and former international players Becky Essex (England) and Ofisa Tonu'u (New Zealand), she accepted she had committed an act of foul play and that the referee's decision to award a red card was correct.\n\nThe committee, however, accepted Kelter's evidence she did not intend to contact the head and her act was reckless rather than deliberate.\n\nThe three-game ban rules her out of the last round of the Pacific Four and two club games with her Bay Breakers team back in the USA.\n\nAAP",
    "source": "ABC",
    "cluster_id": 14
  },
  {
    "url": "https://www.abc.net.au/news/2025-05-21/nsw-sydney-trains-delays-power-cable-outage-live-updates/105317196",
    "title": "Live: 'Challenging afternoon' ahead for Sydney trains despite repairs",
    "publish_date": "Tue, 20 May 2025 21:57:31 +0000",
    "category": "finance",
    "authors": [
      "Millie Roberts",
      "Caroline Riches",
      "Nabil Al-Nashar"
    ],
    "text": "Ben Ivey from Hornsby was kicking himself this morning when he remembered he'd left his laptop at his Parramatta office, leaving him unable to work from home and having to brave the commute.\n\n\"It was awful,\" he laughed.\n\nBen usually takes the train from Hornsby to Strathfield to change at Parramatta, but when he reached the interchange today, he could go no further.\n\nBen Ivey's commute doubled this morning. (Supplied)\n\n\"There was nothing at all. The trains were coming, but they weren't heading in the right direction, they were all going to the city,\" he told ABC News.\n\n\"I must have been there for half an hour. And then they said no trains were going and if you're heading west, you need to take the bus. \"Then the 526 bus was full, so we had to wait for another. It was chaotic and incredibly frustrating.\"\n\nMr Ivey says his normal commute is about an hour, but today it was almost two.",
    "source": "ABC",
    "cluster_id": 15
  },
  {
    "url": "https://www.abc.net.au/news/2025-05-21/why-has-william-goodge-s-trans-australia-run-turned-toxic/105313388",
    "title": "Why 'the fear of the unknown' has some runners questioning this man's record",
    "publish_date": "Tue, 20 May 2025 21:43:53 +0000",
    "category": "sports",
    "authors": [],
    "text": "When William Goodge arrived at Bondi Beach on Monday afternoon, he did so as a record holder.\n\nJust 35 days earlier, the 31-year-old British runner had set off from Cottesloe Beach in Western Australia and traversed the 3,800 kilometres across the nation on foot.\n\nGoodge beat the previous record, set by Australian Chris Turnbull, by a whopping four days, regularly running around 110km per day.\n\nSo why has such an incredible achievement raised questions among the tight-knit ultra-running community?\n\nWho is William Goodge?\n\nGoodge and his father laid some lillies at Bondi Beach after he completed his run in memory of his mother. (AAP Image: Dean Lewins)\n\nGoodge is a 31-year-old ultra runner from Ampthill, 70km to the north of London in Bedfordshire, England.\n\nHe is a former model and used to play semi-pro rugby for the Ampthill Rugby Club in the third tier of English rugby — and still has the physique to match — but gave up after he \"got knocked out too many times\".\n\nIn 2018, his mother passed away from non-Hodgkins lymphoma and, amidst that grief, he turned to running.\n\n\"Obviously she was such a special woman to me and the only reason I got into this stuff was because of her passing,\" Goodge told ABC Sport from Sydney, little over 24 hours after he completed his record run.\n\n\"So it's really a celebration of who she was and what she instilled in me as a person.\n\n\"No one truly dies unless you stop talking about them, so I know she was with me the whole time, pushing me along.\n\n\"It was really nice at the end, a gentleman actually brought us out a bottle of port [when] we're in South Australia. and my mum would always have a glass of port after a rugby game, so yeah it was cool to do that and give her a little cheers and a nod.\n\n\"And we laid some flowers down at Bondi Beach as well for her.\"\n\nSo Goodge is not new to ultra running then?\n\nGoodge set off from Cottesloe Beach in Perth. (AAP Image: William Goodge)\n\nDefinitely not.\n\nGoodge's previous feats have included a 16-day, 1,350km run from John O'Groats in Scotland to Land's End along the length of the United Kingdom and, in 2021 he ran 48 marathons — one in each of England's counties — in just 30 days.\n\nIn 2023 Goodge completed the TransCon, a 5,109km cross-country run across the United States from Huntington Beach, California, to New York in 55 days, making him the fastest Englishman to ever do so.\n\nThe record, incidentally, is held by American Pete Kostelnick, who did it in a staggering 42 days and six hours.\n\nGoodge has also competed in the 257km Marathon des Sables across the Sahara Desert in 2022 and finished 11th at the Moab 240, a 240-mile (386km) ultra race in Utah.\n\nHe has raised thousands of dollars for charity and has been fundraising for the Cancer Council of Australia, as well as the UK-based Macmillan Cancer Support and the American Cancer Society for this run.\n\nSo what's the issue?\n\nBefore Goodge began his Transcontinental USA run in 2023, some ultra runners began to ask questions about his data, most vocally Englishman William Cockerell.\n\nUltra running over these sorts of distances is almost entirely self-reporting. People take a GPS watch and run a particular distance and then submit their data for ratification to either the Guinness World Records or Fastest Known Time (FKT).\n\nCockerell, a fellow runner and author, raised concerns over Goodge's heart rate data.\n\nLoading Instagram content\n\nSimply put, he believes Goodge's heart rate is too low for the distances he is running and that after an initial period where his heart rate does vary, it then stabilises.\n\nCockerell even travelled out to America to observe Goodge's run in the USA, hoping to catch him \"watch muling\" — or swapping his official tracking watch between different runners while he has a rest.\n\nThis sort of thing is not unheard of in ultra running record attempts but it is an allegation that Goodge denied strenuously, inviting Cockerell to observe him for as long as he wanted to.\n\nThe pair ended up having an altercation on the side of the road — which was documented in an episode of his run on YouTube.\n\nIt's not just Cockerell though. Rob Pope, another ultra runner, told The Times in April that although he hopes Goodge's records are legit, his \"heart rate doesn't make sense\".\n\nThe suspicious among ultra running community are still pointing out issues from his recent Australia run.\n\nHis run from April 16, day two of his challenge, has been flagged on Strava after users noted that he set a personal record of 23 seconds for 400m — that's 20 seconds faster than Wayde van Niekerk's world record on the track and is a speed of about 62 km/h — with his pace analysis recording that, for 42 seconds, he ran faster than 3:33 per km.\n\nCanadian Running Magazine has also observed his InReach data recording movement at speeds exceeding 80 km/h.\n\nThese blips in the data can be easily explained away by transmission errors in what is a very remote part of the country, but it certainly adds fuel to the doubters.\n\nDid Goodge track his run?\n\nGoodge was greeted by a big crowd in Bondi on Monday. (AAP Image: Dean Lewins)\n\nConscious of the doubters, Goodge tracked his run by Garmin InReach and on Strava, which records his position and his basic stats, like speed and heart rate.\n\n\"I knew it was gonna come,\" Goodge told ABC Sport in regard to the sceptics.\n\n\"I was prepared for that and just, it comes with the territory. And you can't blame people for coming at you and questioning your stuff. Like, it's just part and parcel of it.\n\n\"Like, we're out in the middle of nowhere running all day. It's not like you can see me on TV.\n\n\"Obviously we do everything we can, like, put the tracker up live so if anyone ever wanted to come and see us — and we had a lot of people that wanted to come out and run — just come and find us. So yeah, you do everything you can.\n\n\"But there's obviously a limit. I can't live stream the whole event. Maybe that would be something you could do in the future but being on roads like that as well, it's really tough. It's tough to be able to even think about like having a car near me because it's too dangerous.\"\n\nThis is true. And just as when Cockerel came out to watch him run, he found no evidence of any wrongdoing whatsoever.\n\n\"I've done everything I've ever said I've done,\" Goodge told the Australian Financial Review (AFR) before his run.\n\n\"But I appreciate that there is a higher burden of proof when you say you're going for an actual record.\"\n\nIs this his first record?\n\nWill Goodge completed his trans-Australia run in a record 35 days. (Supplied: Instagram/Will Goodge)\n\nIt is, and one he's understandably very proud of and one he felt was important to add another level to his fundraising.\n\n\"It was really important,\" Goodge told ABC Sport.\n\n\"All the other events have obviously been impressive and I've had to give everything to them — even though I do maintain this is the hardest thing I've ever done, just because of the the scope of it and not having like any room for error.\n\n\"But it was something for me … maybe it's for my ego, but I've been in this game, what, six years since I did my first challenge? And I feel like it's time for me to step up.\n\n\"Like, I get a lot of stuff in media talking about my modelling stuff and former rugby player, and that's cool, but that's not who I am, right?\n\n\"It's like, the main thing I do is I'm an ultra endurance athlete, and not a normal one by any stretch, but that's how I want to be presented.\n\n\"So yeah, it's a cool one to achieve for me.\"\n\nTell me about Goodge's heart rate\n\nWill Goodge completed the vast majority of his run with a very low heartrate. (Supplied: Instagram/Will Goodge)\n\nGoodge's heart rate data comes from a wrist-worn device — research papers say that these devices only have a moderate degree of accuracy.\n\nHe told the AFR that he always tries to run in Zone 1 or Zone 2 — and that is born out in his data, available publicly on Strava.\n\nThere are five heart rate zones, with Zone 1 rated as Endurance for low heart rates, all the way up to Zone 5, for Anaerobic activities where your heart rate goes very high — think walking as endurance and sprinting as anaerobic.\n\nZone 1 is the lowest intensity training zone and is characterised by being about 50 per cent of your maximum heart rate, so you can easily talk and breathe while doing exercise.\n\nIt's different for everyone but, according to Strava, for Goodge it's anything below 123 beats per minute.\n\nZone 2 is a relatively common state of training for endurance athletes and where a lot of training takes place and, for Goodge, is anything between 123 and 153 beats per minute.\n\nThe science behind Zone 2 training for athletes Photo shows Pogačar The concept of Zone 2 training is all the rage for endurance sports like cycling or running, but is the hype real?\n\nLet's take a typical day in the middle of Goodge's run, May 11, where he ran 112km in 13 hours, 15 minutes, at an average pace of 7 minutes and 6 seconds per kilometre.\n\nHis highest recorded heart rate was 156 beats per minute, but his average was 104bpm.\n\nIncredibly, 92 per cent of his run took place with his heart rate in Zone 1, with eight per cent in Zone 2.\n\nWhen Australian endurance runner Nedd Brockmann did his trans-Australia run, he tended to run more in Zone 2 — while running across similar terrain around the flat country of Kimba in South Australia, Goodge ran 110km at 7:55 per km with an average of 101bpm, 93 per cent in Zone 1, while Brockmann ran 102km at 5:42 pace with an average heart rate of 130bpm, 85 per cent of which was in Zone 2.\n\nThere were days when there were similarities though.\n\nNedd Brockmann (top) and Will Goodge completed a similar run leg on their trans-Australia runs. The red line is heartrate data, with the blue line pace and the grey shading the elevation of the terrain. (Supplied: Strava)\n\nBoth men ran similar distances late in their attempts, from near Yass to Goulburn in New South Wales which, according to the Strava data, took place in similar conditions, clear and 6C.\n\nBrockmann ran 106km in 11 hours and 25 minutes at an average pace of 6:28 per km, with an average heart rate of 114bpm, 73 per cent of which was in Zone 1.\n\nGoodge ran 113km in 14 hours and 40 minutes at 7:47 per km, averaging 110bpm with 81 per cent in Zone 1.\n\nHow does Goodge explain his low heart rate?\n\nGoodge's low heart rate could come down to many things, including running with a mask over his face. (Supplied: Instagram/Will Goodge)\n\n\"The thing is, I don't really look at it, but on day one, it [my heart rate] is probably going to be higher because I can push more,\" Goodge said in response to the criticism.\n\n\"But it gets to a point where your legs are so bad you can't really go very fast.\n\nHRV is an increasingly standard smart watch stat. What is it? Photo shows A woman wearing a yellow top looks down at her smart watch, which has a graphic of a red heart above it with numbers circling. HRV has long been used by elite athletes to dictate their training schedule and it has now become a \"buzzword\" among the broader community.\n\n\"I've done so much of this — like, my foundational training and all the events I've done, challenges — meaning that I can just ride out and I'm very much [running at] a conversational pace.\n\n\"But there's also just so many other aspects to this that you can't really consider all the time.\n\n\"Like, I'm running past roadkill and I'm putting something over my face, or a dust storm has come in, or a road train has come close to me, or I'm literally running along and I'm singing.\n\n\"So there's so many variables involved of why my heart rate might go up at a particular point, even though my pace is the same, or go down.\n\n\"Also, I'm running slowly.\n\n\"Like, really slowly … it's not sustainable to try and push that hard for that long, so I have to keep, basically, a steady effort the whole time.\"\n\nThe burden of proof in endurance racing\n\nThe run behind him, Goodge now has to show proof that he completed the run. (AAP Image: Dean Lewins)\n\nBy their very nature, endurance events are somewhat difficult to ratify outside of the competitor's honesty.\n\nDistance running has always had this issue, right from the early days of the Olympic Marathon in St Louis in 1904, when American runner Fred Lorz was disqualified after getting a lift for the majority of the race.\n\nThe strangest marathon in history Photo shows A man in shorts and a t-shirt crossing a finishing line while surrounded by men in suits and hats This week should have marked the beginning of the Tokyo Olympics. While we're missing three weeks of sporting endeavours, we can revisit one of the most bizarre races in modern Olympic history.\n\nWith ever more demanding events over longer and longer distances outside of ratified events, self-reporting is vital.\n\nGoodge has not shied away from confronting those who are doubting the authenticity of his feats head on.\n\n\"If it's fight or flight, I'm a fight kind of guy,\" Goodge said when asked about his somewhat brash social media response to critics.\n\n\"Today’s effort is rage,\" he wrote on Instagram on April 28, to give an example.\n\n\"Keep talking motherf******, keep adding fuel to the fire and I’ll make it even more unbelievable.\"\n\nAnother post, this one on his Instagram story, showed Goodge relaxing with his crew, nursing a beer and a cigarette, with the caption: \"And from all of us at the record down under team, to the nay sayers we sincerely say f*** you.\"\n\nWhy does Goodge think he rubs runners up the wrong way?\n\nGoodge's post-day routine is not for his nutritional benefit, but his mental health. (Supplied: Instagram/Will Goodge)\n\nThere's no doubt that Goodge is not the average endurance runner.\n\nNot many men who pound the pavement have a modelling contract.\n\nNeither do they have a beer and a cigarette after a long day pounding the pavement.\n\n\"I didn't do it every night,\" Goodge said.\n\n\"And also, the calories I'm consuming and stuff like the alcohol and the carbs will just get going me and get out the other end.\n\n\"[American ultra runner] Robbie [Ballinger] had a really interesting rule that we kind of took on which is always one beer, sometimes two, never three.\n\n\"But yeah, if there is an element of just like getting into some kind of normality after finish. And like sitting down and having dinner with the crew is a big one for me … it brings the level down and doesn't make it such a absolutely horrendous experience.\"\n\nBut maybe it's not that at all. Maybe it's just the extra attention.\n\n\"It's almost, kind of like the fear of the unknown,\" Goodge said about why there is criticism directed towards him.\n\n\"And I can understand why as like, a traditional runner in the sport, especially one that's pretty underfunded.\n\n\"It's traditionally [a sport full of] people that just want to go and do some crazy stuff and there's never been brands that have been that interested in it.\n\n\"And then obviously someone like me comes along and I'm fortunate enough to have been in this social media world, not through any real trying. I just would share what I was doing online, and fortunately, it's obviously picked up and I get a lot of messages from people saying that they've seen what I've done and it's helped them go through something.\n\nGoodge had to consume around 7,000 calories per day, and still lost 10kg in weight. (Supplied: Instagram/Will Goodge)\n\n\"Everything I'm doing is trying to be positive.\n\n\"But yeah, I can understand why they see it as unfair, so I'm aware of that.\n\n\"And just the way I do stuff, I'm quite brash, I'll say it as it is, I show the other sides of my life.\n\n\"And yeah, it might rub people up the wrong way, and that's fine. It's a small percentage of people.\"\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\nIt should be stressed that those doubting Goodge are in the minority.\n\nGoodge credits ultra-runner Robbie Ballinger as being a key source of advice in his career, such as helping him switch styles of trainers so his feet don't get battered in the exact same position mile after mile.\n\nHe also made special mention of Aussie runners Chris Turnbull and Nedd Brockmann on his website.\n\n\"The beautiful thing about ultra in general is we help our fellow competitors,\" Goodge wrote.\n\nBrockmann, who did his own trans-Australia run in 46 days was one of the first to congratulate Goodge upon him finishing his run.\n\n\"Incredible my man,\" he wrote.\n\n\"You deserve it all mate. What a feat of human endurance, thanks for the daily inspiration and reminding us all we can always do more!! King Goodge!\"",
    "source": "ABC",
    "cluster_id": 16
  },
  {
    "url": "https://www.abc.net.au/news/2025-05-21/old-silos-get-second-life-transformed-into-farm-accommodation/105295708",
    "title": "It was not cheap, but these old silos have been transformed into luxury",
    "publish_date": "Tue, 20 May 2025 21:41:47 +0000",
    "category": "finance",
    "authors": [],
    "text": "Farmers are converting disused silos into beautiful and quirky places to stay as they aim to future-proof their businesses and diversify their incomes.\n\nNew South Wales farmers Nicholas and Amber Heffernan renovated their old silos to gain an added income stream and give the structures a second life.\n\n\"We just thought we'd cut a hole and build inside and it would be all easy,\" Mr Heffernan said.\n\n\"As we dove a bit deeper, we worked out that we had to change the structure.\n\n\"It was a complete rebuild, because it's a tin can, basically.\n\n\"We had to insulate it well to get it up to [our] standards.\"\n\nThe conversion wasn't quite as simple as Amber and Nicholas Heffernan first thought. (Supplied: The Silos Accommodation)\n\nAfter years of toying with design plans and creating small models, they sought the help of architect Sarah Lebner, who they said was able to think outside the box, or in this case, outside the can.\n\nTogether they transformed one 60-year-old silo into accommodation, while the cement base of another silo was used as paving for outdoor entertainment.\n\n'Surprisingly' spacious\n\nForbes cattle farmers Adrian and Kylie Matthews also converted their disused silos into a farmstay, after hearing about the unusual accommodation style in New Zealand.\n\nKylie Matthews says there is a lot of interest in the silos from people wanting a rural weekend getaway. (Supplied: Lauren McConnell)\n\n\"It's actually gone a lot better than what we thought it would to begin with,\" Ms Matthews said.\n\n\"We put a second story into the taller silo, which has a queen bed up there. It's actually quite spacious, surprisingly.\"\n\nWhile the couple sat on the idea for a few years as they raised their children, Ms Matthews said the plan was always to repurpose the silos.\n\n\"As the word spreads, we are getting busier,\" she said.\n\n\"Most weekends we have someone in here. I can't really ask for much more than that at this stage without giving up my day job.\"\n\nAn interior kitchen links two silos that cattle farmers Adrian and Kylie Matthews repurposed into accommodation. (Supplied: Lauren McConnell)\n\nNot an easy feat\n\nThe Heffernans only opened their accommodation last October, and while the new venture offers a helpful income stream, the addition didn't come cheap.\n\n\"We still have debts to pay out, but definitely … it will help. It's about future-proofing,\" Ms Heffernan said.\n\n\"The generation that's following can't stay on the farm because it's not financially viable.\n\n\" This is about making [our farm] able to sustain three generations; not barely sustaining one. \"\n\nBut Ms Heffernan said turning a silo into accommodation might not be for everyone.\n\n\"It depends on what someone wants to do. People can do whatever they can dream up if they're willing to take that extra step, but it's not a simple undertaking by any means,\" she said.\n\nThe second floor bedroom provides views across the farm. (Supplied: Matt Beaver)\n\nMr Heffernan agreed that anyone considering a restoration didn't have to go to the lengths they did.\n\n\"Building in circles is very difficult. We wanted to have it very luxurious, so it cost a lot to do that,\" he said.\n\nFrom marriage proposals to interstate and international visitors, the Junee-based couple now enjoy sharing their farming experience and getting to know their guests.\n\n\"It's fantastic,\" Mr Heffernan said.\n\nGrowing interest\n\nUniversity of Newcastle's International Hotel School director, Marianna Sigala, said the novelty of sleeping in a silo could help farms stand out from the competition.\n\n\"[For] many decades now, interesting public or private places have been converted into accommodation, like prisons, old hospitals, caves. People are always looking to experience new things,\" Professor Sigala said.\n\n\"You can find luxury hotels … everywhere in the globe. But these [silos] are not things you can easily imitate or copy and paste.\"\n\nThe silo has been the site of many special moments, including marriage proposals. (Supplied: Jarrad Di Mauro)\n\nHaving stayed in a silo herself, the marketing professor also said they were a great way to connect with a location, as tourists were increasingly looking for authentic and meaningful rural experiences.\n\n\"By converting a silo … you actually provide the trigger for people to learn who are the locals, how they live, how they use the silo, and how this relates to their daily life,\" Professor Sigala said.",
    "source": "ABC",
    "cluster_id": 17
  },
  {
    "url": "https://www.abc.net.au/news/2025-05-21/aussies-keep-roland-garros-dream-alive-in-french-open-qualifying/105317154",
    "title": "Aussies keep Roland Garros dream alive in French Open qualifying",
    "publish_date": "Tue, 20 May 2025 21:29:31 +0000",
    "category": "sports",
    "authors": [],
    "text": "West Australia's Talia Gibson has taken the opening step in qualifying for a grand slam for the first time, defeating returning veteran Michaela Buzarnescu of Romania 6-2, 6-3 in the first round of French Open qualifying.\n\nThe 20-year-old has competed twice in the Australian Open, but through a wildcard each time.\n\nBuzarnescu, 37, was a useful first opponent for the 23rd seed. Though a former top-20 player, she has not played on tour since 2022, having taken a break and suffered an injury, and now being in the foothills of a return.\n\nGibson took just over an hour to complete her match, having had to move swiftly to court eight as she was following fellow Perth player Astra Sharma, who made quick work of dismissing American Emina Bektas 6-0, 6-0 in 36 minutes.\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\nDaria Saville was the day's third Australian success, but she needed rather longer to see off Briton Heather Watson 7-6 (7/2), 6-2, the match taking 6 minutes shy of 2 hours despite the second set score.\n\nWhile that trio joined Bernard Tomic, Jason Kubler and Maddison Inglis in the second round of qualifiers, there were four losers on Tuesday, reducing to six the original 15 Australians who entered qualifying.\n\nLizette Cabrera lost to Thailand's Mananchaya Sawangkaew 6-4, 6-2 while Storm Hunter went down to China's Shuai Zhang 6-3, 6-2.\n\nIn men's qualifying, Li Tu let slip a first-set advantage to lose to French wildcard Clement Tabur 3-6, 6-3, 7-5 and Omar Jasika battled hard, but was eventually overwhelmed by Colombia's experienced world number 115 Daniel Galan 6-3, 4-6, 6-1.\n\nThey joined the five Australians eliminated on Monday: James Mccabe, Alex Bolt, Arina Rodionova, Taylah Preston and Priscilla Hon.\n\nA dozen Australians have already earned a place through their ranking, with Destanee Aiava and Tristan Schoolkate joining them via wildcards.\n\nAAP",
    "source": "ABC",
    "cluster_id": 18
  },
  {
    "url": "https://www.abc.net.au/news/2025-05-21/local-football-clubs-concerned-player-returner-after-sentence/105311514",
    "title": "Clubs dismayed star footballer allowed to return to play following criminal sentence",
    "publish_date": "Tue, 20 May 2025 21:22:25 +0000",
    "category": "sports",
    "authors": [],
    "text": "Clubs in the West Kimberley Football League (WKFL) are dismayed a star player has been allowed to return to play following a criminal conviction in what they believe is at the risk of women and girls.\n\nThe player, in his late 20s, was sentenced in May last year to 16 months in jail after pleading guilty to using electronic communication to expose a person under 16 to indecent matter and procure them to engage in sexual activity.\n\nThe Broome District Court heard he contacted a girl on social media apps between January and August 2023, while she was aged 13 and 14. He sent explicit images and videos of himself to the girl and tried to convince her to meet him for sexual activity.\n\nJudge Mark Herron made the player eligible for parole and he was released earlier this year.\n\nSeveral clubs in the league believe not enough risk assessment has been done before allowing the player for Cable Beach Football and Sporting Club to resume his footballing career.\n\nOne club in the WKFL has requested the league refer the matter to the AFL integrity unit, as it was concerned the decision could set a \"dangerous\" precedent for their league being used as a gateway of integration back into the community for people convicted of serious crimes, particularly against women and children.\n\nThe WA Football Commission has its own integrity unit which oversees reports and complaints in the state.\n\nMembers of the Kimberley region are concerned about the welfare of women and girls in the football community. (Getty: Matthew Mallett)\n\nAn email sent by Cable Beach Football Club's president to fellow club presidents said while they \"acknowledge the seriousness of the circumstances\", they also \"recognise the important role that football and community can play in supporting individuals through challenging periods\".\n\nThe league issued a response to clubs informing them that the player was being supported to return to football after a considered process by the club, which included risk assessment, internal governance under their club constitution and consultation with relevant authorities, including WA police.\n\nTheir position is that there are no rules or regulations that currently prohibit the player from participating in the WKFL senior men's competition.\n\nLast week the league held a meeting with club presidents where a forum was created to discuss the matter.\n\nFollowing this, the league sent an email to club presidents advising them that the matter was investigated and under competition rules and regulations, the player was eligible to return and would do so this season.\n\n\"The WKFL understands the importance football plays within the community and is committed to supporting the health and wellbeing of all participants,\" the email read.\n\n\"The WKFL takes this opportunity to remind all clubs of their leadership role and responsibility to ensure positive game day environments.\"\n\nHowever, one club that spoke to ABC Sport said they were \"heartbroken\" by the decision and believed not enough due diligence was done in determining the risk to other members of the football community.\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\nThey said they would like experts to be involved in order to find \"a balance of healthy paranoia around child safety and also a really intense integrity plan and community safety plan\".\n\n\"I feel like if we accept it now (football as an integration program), it'll be harder to overturn,\" a committee member of one club told ABC Sport.\n\n\"It's also the timing, the integration has happened too quick. We're not resourced to handle this type of integration.\n\n\"They claim to have a reintegration program or safety plan (but) that wasn't consulted or shared with any other club.\n\n\"I think if we are integrating people back into our community, I think it's something that we collectively have to do. I think we all collectively have to agree that it's something that we want to do.\"",
    "source": "ABC",
    "cluster_id": 19
  },
  {
    "url": "https://www.abc.net.au/news/2025-05-21/junior-rugby-league-behaviour-towards-referees/105314980",
    "title": "‘Appalling’ behaviour derails junior rugby league season",
    "publish_date": "Tue, 20 May 2025 21:10:51 +0000",
    "category": "sports",
    "authors": [],
    "text": "Junior rugby league referees, who can be as young as 13, are being threatened and copping verbal abuse, with families and team staff lashed for \"appalling behaviour\".\n\nIn one instance, a Sunshine Coast junior rugby league referee had to be escorted to their car due to threatening behaviour from players and families.\n\nIn another incident Rugby League Sunshine Coast said a referee was told \"let's take this out to the car park\" by staff members for a team of under 12s.\n\nYet another was shocked when a player called them a \"f***ing r****d\", and a fourth refused to referee some teams after consistent poor behaviour.\n\nThe league made the incidents public in a missive to all clubs and a post on social media.\n\nAshley Robinson describes the reported behaviour as \"embarrassing\". (Supplied: Ashley Robinson)\n\nSunshine Coast Falcons chairperson Ashley Robinson said the behaviour was \"embarrassing\", particularly with officials and volunteers starting as teenagers.\n\n\"For them to be treated poorly by players and parents is appalling because if there are no officials there is no game and a lot of these referees are young kids,\" he said.\n\n\"If you think you can do a better job, go do a referee's course and get involved because you wouldn't want to see that abuse happen to your own child.\"\n\nLearning to become a better sport parent Photo shows Artwork of David Beckham, Nathan and Alice Burke Most parents would admit to being a little too pushy at times when their kids have taken to the sporting field. But there are ways to find the right balance and keep things fun, writes Paul Kennedy.\n\nMr Robinson said one of the problems was that parents were \"living through their children\" on the field.\n\nAnd he said other parents and fans also had a role to play.\n\n\"We are all responsible to speak out when we see someone doing the wrong thing,\" he said.\n\n\"If it is a player, [the referee] needs to stop the game, call the coach onto the field and tell them if they can't get their kids under control 'then I will'.\n\n\"If it's a parent they need to stop the game, go over to the sideline and actually single them out and say that they will not continue this game until this club sorts out whoever is misbehaving.\"\n\nMr Robinson said in his decades in the sport it had always been hard to recruit officials and volunteers, and the bad behaviour only made it tougher.\n\nA widespread problem\n\nBad behaviour in junior sport is not unique to the competition on the Sunshine Coast.\n\nEarlier this week a former elite soccer coach on the Gold Coast urged parents to stop yelling from the sidelines.\n\nIn early 2024, Queensland Rugby League (QRL) introduced a \"green socks\" program so fans and players could tell when referees were under 18.\n\nQRL introduced a \"green socks\" program so fans and players could identify young referees. (Supplied: Queensland Rugby League)\n\nQRL's Clayton Sharpe said it was about protecting emerging referees and officials from aggression.\n\n\"Primarily it is about treating young referees with respect, refraining from abuse, and understanding that our emerging match officials are still learning — just like the players,\" he said at the time.\n\nIn 2021, New South Wales Rugby League began banning competitive games for children under 13 and banned tackling until midway through under 7s.\n\nWarnings of further action\n\nIn a statement Rugby League Sunshine Coast warned there would be penalties if the behaviour continued.\n\n\"Sunshine Coast Junior Rugby League firmly stands behind our referees in all instances regardless of excuses given by those who are of the belief that their actions are justified,\" a spokesperson said.\n\n\"We are an organisation which fosters a safe environment where referees, just like players, are allowed to make mistakes without fear of retribution.\n\n\"For any player, team staff or spectator who disagrees with our values then we ask you to reconsider your involvement with rugby league on the Sunshine Coast.\"\n\nCompetition organisers have warned the league is considering penalties, including fines and the de-registration of players.",
    "source": "ABC",
    "cluster_id": 20
  },
  {
    "url": "https://www.abc.net.au/news/2025-05-21/yorke-peninsula-housing-developments-halted-by-sa-water-budget/105303452",
    "title": "More than 1,000 homes in limbo as SA Water money dries up",
    "publish_date": "Tue, 20 May 2025 21:00:46 +0000",
    "category": "finance",
    "authors": [],
    "text": "Development has stalled on at least 1,000 homes on the Yorke Peninsula because of unfinished water infrastructure upgrades.\n\nConstruction has yet to begin on two lifestyle villages in the Copper Coast and Port Wakefield regions while developers and SA Water negotiate cost-splitting for millions of dollars in upgrades.\n\nDeveloper Metacap unveiled plans for the 680-home Riverbend lifestyle village in October 2023 and advised Copper Coast Council the first sod would be turned last July.\n\nHowever, council chief executive Dylan Strong said the project at Port Hughes hit a roadblock which SA Water and the developer blamed on insufficient water capacity.\n\nMetacap and SA Water are locked in negotiations about water and sewerage to the Riverbend development in Port Hughes. (Supplied: Metacap Property)\n\n\"The lack of capacity within the SA Water network is not unique to the Copper Coast,\" Mr Strong said.\n\n\"But it is compounded in the regions of SA that are experiencing the growth that most regions want, but not all of them have.\n\n\"What's happened over time is the area has continued to grow and the insufficient capacity has gotten worse.\n\n\" We're at a point now where we need an injection of support from the state government to ensure the trunk upgrades are undertaken. \"\n\nMr Strong said SA Water had carried out ongoing expansion work for \"the past few decades\" but \"not all of those works occurred when scheduled\" because population growth exceeded forecasts.\n\nDylan Strong says water upgrades in the region are decades behind schedule. (ABC Riverland: Matt Stephens)\n\nWith retirees and young workers flocking to the region, he said the council's population of 16,000 was expected to double by 2055 if housing could be built.\n\nMr Strong added that SA Water had indicated there was no capital expenditure left in its 2024–28 business plan, which limited its options.\n\nWakefield Regional Council Mayor Rodney Reid said similar disagreements about costs had beset the Hamley Bridge development, where up to 400 homes have been earmarked by developer Robert Moore.\n\nNeither SA Water nor Mr Moore have signalled delivery time frames yet, according to Mr Reid.\n\n\"Increased revenue through rates on developed properties has not occurred and this means less funding to spend on existing and new projects\" he said.\n\n\"It also means that we continue to have a shortage of housing both owned and rented across the council district.\"\n\nThe Meadows in Hamley Bridge, near Port Wakefield, is earmarked for at least 400 new homes. (Supplied: ELM Property)\n\nAn SA Water spokesperson said \"developers are expected to make financial contributions to any network upgrades or expansions\".\n\n\"This protects affordability for our existing customers by ensuring SA Water — and our broader customer base — is not subsidising any realised profits from private development,\" the spokesperson said.\n\n\" Should a developer want to fully fund the upgrades, we would enter into an agreement with them and undertake the work. \"\n\nThe developer, Robert Moore, declined to comment.\n\nScarce resources targeting 'priority areas'\n\nIn November, the state government pledged $1.5 billion in new water and sewerage pipes as part of its Housing Roadmap, but no additional funding was set aside for the aforementioned developments.\n\nWith the aim of servicing 40,000 new homes, planning authorities have prioritised developments immediately north and south of Adelaide.\n\nSA Water's spokesperson said planning was occurring this year for the water networks servicing Yorke Peninsula, which would \"incorporate the latest growth forecasts\" for 2028–32.\n\n\"As part of the state government's Housing Roadmap we are investing $1.5 billion during the current four-year regulatory period to grow and expand our water and wastewater networks in South Australia, where it's needed the most,\" they said.\n\n\"This investment will deliver large-scale infrastructure, such as new trunk water and wastewater mains, to unlock capacity for new homes to be built and connect to our networks, specifically across Adelaide's northern growth front.\n\n\"We currently do not have funding capacity as part of the Housing Roadmap to invest in upgrading our water and wastewater networks outside of priority areas.\n\n\"In Kadina, some development has been enabled through minor network augmentations, and since 2016 we have invested in water main upgrades, installed larger water mains and valves in Moonta, and upgraded water storages in Lower and Upper Paskeville.\n\n\"We understand the important economic benefits that developments across the state will deliver and have prioritised engaging with councils and developers in areas like this to understand the specific upgrades required to our infrastructure.\"\n\n'Building over many years'\n\nThe Housing Roadmap blamed South Australia's water woes on under-investment, calling it \"a major failure of previous governments at all levels\".\n\nLocal Government Association SA chief executive Clinton Jury said councils were actively rezoning land and offering incentives to developers.\n\n\"Councils raised this issue at last year's LGA Annual General Meeting because they want to be part of the solution,\" Mr Jury said.\n\n\"The government's recent investment in water infrastructure in metropolitan Adelaide is a welcome step, and we now need to see that same level of strategic focus extended to regional areas.\n\n\"This is a complex issue that's been building over many years, it won't be fixed overnight. We need continued investment and collaboration to support more housing and growth in regional areas.\"\n\nLast June the state government introduced an extra charge to water bills in order to finance new capital works, costing households on average an additional $80 per year.\n\nMetacap and Housing Minister Nick Champion were contacted for comment.",
    "source": "ABC",
    "cluster_id": 21
  },
  {
    "url": "https://www.smh.com.au/culture/tv-and-radio/the-bear-season-four-trailer-jeremy-allen-white-ayo-20250430-p5lvcv.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "The Bear is back with a new season. But will you be watching?",
    "publish_date": "Wed, 21 May 2025 12:01:12 +1000",
    "category": "entertainment",
    "authors": [
      "Meg Watson"
    ],
    "text": "But, while all major cast members have returned – including Jamie Lee Curtis, as Carmy’s mum Donna – we’ll have to wait and see if viewers do the same. After two seasons of effusive praise for this star-making FX hit, last year’s third instalment left many fans cold, saddled with criticisms of being “aimless” and “undercooked” , and ultimately landing with an audience score of just 51 per cent on Rotten Tomatoes (compared to previous seasons’ scores in the nineties). Can season four reignite our passion?\n\nWelcome back, cousin. We’re about to get another serving of The Bear. The trailer for season four of the Emmy award-winning comedy/drama has just dropped featuring all the gang – there’s Carmy (Jeremy Allen White) obsessing about the beauty of culinary excellence, Sydney (Ayo Edebiri) trying to drag him back to reality, and Natalie, aka Sugar (Abby Elliott), adjusting to life with her new baby.\n\nSeason three ended on a cliffhanger, as Carmy gets a Google alert for The Chicago Tribune’s review of his restaurant. A collection of words flash on the screen – confusing, excellent, brilliant, sloppy, complex, simple, stale, talent – before the beleaguered chef utters one more: “Motherf---er”.\n\nLoading\n\nMeanwhile, Syd has just excused herself from partying with all her hospo mates to hyperventilate in a stairwell. Carmy’s increasingly erratic behaviour has been dragging her down, and she’s now been thrown a lifeline in the form of a position as chef de cuisine at Chef Adam’s (Adam Shapiro) new restaurant. What’s stopping her? All the happy smiley faces, her chosen family, wooping to ’90s bangers in the next room.\n\nFor all the criticism season three faced for being too slow or self-indulgent – that final episode also featured a parade of real-life chefs waxing lyrical about the “controlled chaos” of the kitchen around a dinner table – the season did have standout episodes.\n\nNapkins, which was also Edebiri’s directorial debut, offered a rich and unvarnished throwback to how middle-aged mum Tina (Liza Colon-Zayas) came to work at The Bear after struggling to find a job following lay-offs. And Ice Chips, an emotional two-hander between Sugar (Elliott) and her dysfunctional mother Donna (Curtis) during labour, was another highlight that was described by some critics as “quietly radical” – particularly by those who have experienced birth and motherhood.",
    "source": "SMH",
    "cluster_id": 22
  },
  {
    "url": "https://www.smh.com.au/sport/swimming/james-magnussen-s-wild-doping-experiment-and-the-birth-of-the-enhanced-games-20250520-p5m0qn.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "James Magnussen’s wild doping experiment and the birth of the Enhanced Games",
    "publish_date": "Wed, 21 May 2025 12:00:04 +1000",
    "category": "sports",
    "authors": [
      "Tom Decent"
    ],
    "text": "Save Log in , register or subscribe to save articles for later. Save articles for later Add articles to your saved list and come back to them any time. Got it Normal text size Larger text size Very large text size James Magnussen spent an entire swimming career fighting for clean sport and despising drug cheats. It’s why it’s hard to fathom the words motoring out of his mouth in an interview with this masthead in the week before he flew out to Las Vegas for the worldwide launch of the Enhanced Games on Wednesday (Thursday morning Australian time). “The first time you stick a needle of testosterone in your butt, you have to do it in the muscle at the top just above your undie line,” Magnussen explained with a laugh. “I never thought I’d be sticking a needle with testosterone into my bum at any point in my life.” Magnussen, the Australian Olympian who famously fell short of winning a gold medal in the 100m freestyle by one hundredth of a second at the London 2012 Olympics, is the face of the Enhanced Games. The controversial, privately funded event has been dubbed the “Steroid Olympics”. Magnussen, 34, has been on whirlwind doping journey since February last year, when he made the bombshell claim he would consider signing up as the Enhanced Games’ first athlete … if the price was right.\n\nAdvertisement\n\nAll with the assistance of performance-enhancing drugs. Although many things didn’t go to plan, the polarising Australian is ready to divulge the inside story of a stunning ploy to take substances in the pursuit of unprecedented human achievement. “It was pretty wild,” Magnussen said. “I mean, nothing really is out of the norm for me.” Australian Olympian James Magnussen features in a new Enhanced Games documentary. Credit: Enhanced Games From clean champion to Enhanced Games frontman “If they came to the party with $1 million for the [50m freestyle] world record, I would 100 per cent do it.” With that quote in February, after initially floating his interest in the Enhanced Games on the Hello Sport Podcast, the “Missile” was off and away, despite being retired since 2019.\n\nAdvertisement\n\nThings moved quickly. Enhanced Games founder Aron de Souza, also an Australian, confirmed he wanted Magnussen to be the “star” of a new venture, which would encourage athletes to take performance-enhancing drugs and compete against each other for prizemoney. De Souza agreed that if Magnussen could break the 50m freestyle world record he would win $US1 million ($1.56 million). Contracts and confidentiality agreements were signed as a documentary crew prepared to follow Magnussen’s every move ahead of his journey to the US. Understandably, there was scepticism. Magnussen certainly had a good time at the Olympics in Paris last year – he didn’t mind a drink at local French watering holes – while juggling media commitments with News Corp. Australian James Magnussen features in the new Enhanced Games documentary. Credit: Enhanced Games When Magnussen returned to Australia, he found it difficult to find pools to train in. “I can’t train with any squads or registered coaches,” Magnussen said. “You also can’t dive off the blocks in pools in Sydney.\n\nAdvertisement\n\n“If you don’t have a coach keeping you on track and doing programs, getting times, keeping an eye on stroke rates … you’re very isolated. I was of the opinion that under those circumstances, I wasn’t going to be able to do a proper preparation. That’s why I linked up with Hawkey [former Australian Olympic swimmer Brett Hawke]. He’s not connected to any clubs or colleges.” After some initial medical testing, Magnussen flew to the US in October and shared an Airbnb with his strength-and-conditioning trainer Dan Malmberg. Under the guidance of respected Australian coach and Olympian Hawke, who mentored 50m freestyle world record holder Cesar Cielo, the trio got to work. Again, the issue of pools was a problem. “We had to turn our training to a public pool that is in my complex,” Hawke said. “It was a four-lane 25-yard pool that was heated. We did that for three months. “The enhancements were working. He was getting stronger and faster in the pool.” James Magnussen after taking performance-enhancing substances. Credit: Enhanced Games\n\nAdvertisement\n\nThe drugs and the dilemma All of Magnussen’s performance-enhancing drugs were administered by medical professionals, who continually monitored his preparation. Athletes at the Enhanced Games are not obliged to publicly disclose what drugs they have taken, but Magnussen is more than happy to go on the record. “I’m definitely allowed to say that I was taking peptides and testosterone, which is pretty much it to be honest,” he said. “We tried a few different things on top of that. “We used BPC-157, CJC-1295, Ipamorelin and Thymosin. The BPC-157 and Thymosin is for recovery and to prevent injuries. It promotes healing in the body. The CJC and Ipamorelin enhances your body’s natural production of growth hormone. You’re not injecting growth hormone into you. You’re maximising your body’s own potential. “The testosterone is the superpower. That’s what gets you bounding out of bed in the morning, lifting massive weights and feeling your best.” Was there any trepidation?\n\nAdvertisement",
    "source": "SMH",
    "cluster_id": 23
  },
  {
    "url": "https://www.smh.com.au/culture/books/a-haunting-memoir-of-a-broken-girl-saved-by-rock-and-roll-20250520-p5m0pw.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "A haunting memoir of a broken girl saved by rock and roll",
    "publish_date": "Wed, 21 May 2025 12:00:00 +1000",
    "category": "entertainment",
    "authors": [
      "Michael Dwyer"
    ],
    "text": "MEMOIR\n\nThe Harder I Fight The More I Love You: A Memoir\n\nNeko Case\n\nHachette, $34.99\n\nI’m a tiny bit miffed with Neko Case right now. When we spoke about her Hell-On album in 2018, she rather gallantly mentioned her respect for music writers. “I don’t envy your job,” she said. “Coming up with ways to describe music? That’s hard. I’d just say everything was ‘awesome’.” Naw shucks, etc.\n\nNow, it turns out, she writes about music as brilliantly as she makes it. “Gramma would sing along in the proper ‘barely louder than your breath’ lady volume,” she tells us in one childhood car-seat memory. “It sounded just like the last three Certs candies from the bottom of a purse tasted, like the last candy on earth.”\n\nLater, a rock-club epiphany goes like this: “They tapped into some feral vein that ran to the centre of the earth, like a stick of dynamite that could control how much it exploded while still preserving its sweating cylinder … something unlocked for me that day … making music could become a physical manifestation of the blazing wild horse energy inside of my body.”",
    "source": "SMH",
    "cluster_id": 24
  },
  {
    "url": "https://www.smh.com.au/business/companies/elon-musk-bows-out-of-politics-to-try-to-rescue-tesla-20250521-p5m0xl.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Elon Musk bows out of politics to try to rescue Tesla",
    "publish_date": "Wed, 21 May 2025 11:57:57 +1000",
    "category": "finance",
    "authors": [
      "Stephen Bartholomeusz"
    ],
    "text": "He also said Tesla’s sales had turned around after a disastrous first quarter. In the three months to the end of March, Tesla reported a 13 per cent fall in deliveries of its vehicles, a 20 per cent drop in revenue from auto sales, and a 71 per cent fall in net income. Musk’s close relationship with Trump, his controversial role in the administration and his support for far right political groups in Europe have seen a collapse in Tesla’s sales in Europe and elsewhere. Tesla needs more of Musk’s attention. Credit: Bloomberg In the March quarter they were down 62 per cent in Germany, for instance, and by a similar amount in Europe. In China, they fell 20 per cent and in its key American market, California, its market share in EVs slumped from 56 per cent to per cent.\n\nTesla dealerships have attracted protests, Teslas have been set on fire and Tesla owners have taken to using anti-Musk bumper stickers to distance themselves from his political activities. Musk said sales were “doing well” and that “it’s already turning around” amid a major rebound in demand and that he didn’t anticipate any major shortfall in sales this year, although he conceded that Europe remained the company’s weakest region. Loading He pushed back at suggestions that he has damaged the Tesla brand, arguing that while it might be losing sales on the political left it has gained them on the right. The numbers say that he has lost a lot more than he has gained. Tesla needs more of his attention. Separate to the impact on its brand of Musk’s political activities is the fact that, while its Chinese competitors are churning out new models almost, it seems, on a daily basis, Tesla’s only new vehicle in the past five years has been the Cybertruck, which has been less than successful.\n\nTesla has an unsold inventory of about 10,000 of those controversial vehicles, worth about $US800 million. One-year-old Cybertrucks with less than 10,000 kilometres on their odometers have seen their value crash 35 per cent. Musk is betting Tesla’s future on autonomous vehicles and robotics, with a handful of his robotaxis scheduled to operating in Austin, Texas, by the end of June. He says there will probably be a thousand of the self-driving EVs on US roads within a few months and hundreds of thousands by the end of next year. Musk has, however, been making a similar prediction for the best part of a decade, conceding last year that he has been “overly optimistic” in the past. Tesla’s $US1.1 trillion market value is dependent on Musk realising his vision for robotaxis and robotics. It would be worth a fraction of that amount if that vision isn’t realised. Musk must ask himself on occasion whether the $US250 million-plus that he spent helping to get Trump re-elected and his role in DOGE has been worth it, given the damage done to Tesla.\n\nHe has made no secret of his opposition to Trump’s trade wars, which will also harm the company. Tesla imports batteries from China and other components from Mexico. DOGE has also been far less successful than he promised. At the outset, Musk claimed he could cut $US2 trillion from government spending. He later reduced the target to $US1 trillion. Now, it seems, $US160 billion is about as much as can be achieved. DOGE claims to have reduced spending by $US170 billion, but numerous analyses of the list of cuts it posts on its website have demonstrated that the list is riddled with errors. It claims credit for contracts that had already expired or had been cancelled before DOGE was created. There’s double-counting, the confusing of one-off savings or cash inflows from asset sales with recurrent savings.\n\nThe “savings” so far represent about 0.2 per cent of last year’s US government spending. They are immaterial. DOGE has, however, created chaos within the federal bureaucracy with its mass sackings and subsequent reinstatements. It has spawned dozens of legal challenges and created tension within Trump’s cabinet, where the cabinet secretaries resent the Musk team’s intrusions into their portfolios. Musk must ask himself on occasion whether the $US250 million-plus that he spent helping to get Trump re-elected and his role in DOGE has been worth it, given the damage done to Tesla. Whether it has been effective at all won’t be known for some time, when the longer-term effects of the loss of expertise and capabilities become clearer. DOGE has, for instance, sacked thousands of Internal revenue Service employees – more than 10 per cent of its employees so far, with plans to cut numbers by 40 per cent this year. The cuts include nearly a third of the IRS tax auditors.\n\nThe Yale Budget Lab has estimated that the cuts could cost the US $US323 billion of revenue over the next decade. It is estimated that every $US1 spent on auditing the top 0.1 per cent of earners generates a return of about $US26 of increased revenue. Loading The disregard for the longer-term effects of the assault on the IRS fits with the way DOGE has operated. It has created havoc within key government agencies without regard for the consequences and often, it seems, with little understand of how the agencies operate or of the work they do. (DOGE sacked staff at the Energy Department, including 500 at the National Nuclear Security Administration, without realising they were responsible for the safety and security of America’s nuclear weapons and then had to scramble to try to rehire them). While the way DOGE has operated fits with the Silicon Valley mantra of “move fast and break things,” there’s no sense that DOGE is working to any plan other than to slash and burn, indiscriminately, whatever it can. The DOGE team is now embedded within US agencies so, regardless of whether Musk retains some role, it will continue to create chaos and dysfunction for little meaningful return.",
    "source": "SMH",
    "cluster_id": 25
  },
  {
    "url": "https://www.smh.com.au/lifestyle/official-teaser-for-the-hunger-games-sunrise-on-the-reaping-movie-20250521-p5m110.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Official teaser for The Hunger Games: Sunrise on the Reaping movie",
    "publish_date": "Wed, 21 May 2025 11:54:08 +1000",
    "category": "lifestyle",
    "authors": [],
    "text": "Official teaser for The Hunger Games: Sunrise on the Reaping movie\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later. Dismiss\n\nOur network\n\nOpen Navigation Menu The Sydney Morning Herald",
    "source": "SMH",
    "cluster_id": 26
  },
  {
    "url": "https://www.smh.com.au/sport/nrl/how-tenacious-toia-defied-three-years-of-pain-to-achieve-maroons-dream-20250520-p5m0m3.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Why Origin champion knows Maroons rookie can thwart Latrell Mitchell",
    "publish_date": "Wed, 21 May 2025 11:53:14 +1000",
    "category": "sports",
    "authors": [
      "Nick Wright"
    ],
    "text": "Save Log in , register or subscribe to save articles for later. Save articles for later Add articles to your saved list and come back to them any time. Got it Normal text size Larger text size Very large text size This is a tale of perseverance and defiance, when the world seemed to scream at Robert Toia to cast aside his NRL dreams. Few would have begrudged the talented centre from pursuing other avenues, amid an injury carnage that threatened to end his career before it began. But that was never an option for Toia, who thwarted two ruptured ACLs and suffered a serious back injury and a broken jaw before making his Sydney Roosters debut. As he stands on Suncorp Stadium’s hallowed turf, soaking in his ascension to the State of Origin arena, the 20-year-old reflects on those who got him here. “I’d be lying if I said there wasn’t any doubt, but just the support from my family and the club – their support was through the roof every time, and just the assurance they gave,” Toia says. Robert Toia announced himself as a future Queensland Maroons star in Magic Round. Credit: Getty Images “I can’t thank them enough for their loyalty. Despite what other people have said about the club, the club have had my back since day one.\n\nAdvertisement\n\n“It just doesn’t feel real [that I’m playing State of Origin]. I was in disbelief, and even now, I still don’t think it’s real.” Loading After just 10 games, Toia’s answering of Queensland coach Billy Slater’s SOS puts him alongside Payne Haas as the least-experienced Origin player in the NRL era. The call was far from expected, one he thought was a prank but that eventually left him “speechless” and in “total disbelief”. It has been a remarkable rise from his past agony, having stuck with the Roosters despite advances from Wayne Bennett and the Dolphins to keep his hopes of emulating Greg Inglis’ Origin feats alive. Rugby union could have even been on the cards, having gone through Nudgee College’s First XV program as one of their most prolific centres. “Rugby league was always what I was going to do. Ever since I was young, I always wanted to be an NRL player,” Toia says.\n\nAdvertisement\n\n“[But] I feel like they [Nudgee] moulded me as a person in a way, and taught me core beliefs and values, and I definitely am the man I am today because of them.” Signs that Toia – described as “world-class” by Slater – was more than just a supremely gifted player were on show throughout his three years recovering from a gamut of challenges. His Roosters, and now Maroons, teammate Lindsay Collins watched as the then-teenager spent day after day away from the main group trying to one day rejoin them. Robert Toia joins Payne Haas as the least experienced player to make his State of Origin debut in the NRL era. Credit: NRL Photos Collins, a veteran of 12 Origin caps who tore his ACL in 2021, says the challenges of the rehabilitation phase are difficult to explain. “I don’t think many people would understand that time in your life; it’s pretty hard to make a scenario similar to that sort of thing,” Collins tells this masthead. “To leave school, move down to Sydney away from your family, and then have back-to-back ACLs ... a lot of players at that age would have questioned a lot of things.\n\nAdvertisement\n\nLoading “Bobby is pretty quiet, he sort of keeps to himself, but he’s always working – especially his arms, he loves doing biceps. “The boys inside the four walls of the Roosters knew what he was capable of, it was just whether he was going to get back or not. It gives me goosebumps just thinking about it, the perseverance he’s had just to stick it out.” It is that strength of character that has caught Slater’s eye. And Toia will need to dig into every bit of mental fortitude he developed while away from the game, as he plots a boilover of New South Wales superstar Latrell Mitchell. “Character is really important – that’s what you’re going to lean on when you get tired. You can’t go to Coles and buy that, you’ve got to go through it.” Billy Slater on Robert Toia He admits to being starstruck at the prospect of facing Mitchell, having “looked up to him for a while”.\n\nAdvertisement",
    "source": "SMH",
    "cluster_id": 27
  },
  {
    "url": "https://www.smh.com.au/national/nsw/good-food-good-craic-as-bestselling-author-marian-keyes-gets-real-20250519-p5m0kb.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Good food, good craic as bestselling author Marian Keyes gets real",
    "publish_date": "Wed, 21 May 2025 11:51:43 +1000",
    "category": "finance",
    "authors": [
      "Margot Saville"
    ],
    "text": "“I never saw any reason to hide it. I kind of thought, well, I was a 30-year-old woman and I was educated and I was middle class and all of those things,” she says. “So if it could happen to me, it was probably happening to an awful lot of other people and if it’s not been spoken about, nobody can get help.” Vegetarian amuse bouche. Credit: Thomas Wielecki After Keyes came out of rehab, she wrote her first novel, Watermelon. She has stayed sober and written books – all bestsellers – ever since. Life seemed good but, in 2009, completely out of the blue, the author experienced the onset of a debilitating four-year depression during which she barely got out of bed and suffered ongoing suicidal tendencies. It eventually lifted, which she attributes to time and the support of her loved ones. And hormone replacement therapy! Nothing is off the table at a Marian Keyes lunch. I asked her if she thought it was a great comfort to readers going through tough times to read about someone similarly afflicted and know they’re not alone. She agreed. “Every single one of us on earth, we think that bad things only happen to other people. It’s a survival technique – but sooner or later, the terrible thing happens to us,” she says.\n\nKeyes’ latest book My Favourite Mistake. “You know, the spotlight of doom is above our head. There’s such an endless list of awful ways for your life to be unbended. But most things are survivable; you can, you will be happy again. You can be happy again, in a different way. We can never go back to the person we were before the terrible thing. Back to your old self isn’t really possible in big trauma, I think, but you’re still there.” One of the things Keyes discovered, after the darkness had lifted, was her capacity for resilience. “We only really discover the resilience when it’s required, but we’re given it at terrible times or difficult times, I think. Whatever loss there is, that kind of muscle of resilience is still available to us, maybe in a different form. We are stronger than we know, but it doesn’t mean it’s going to be pleasant. Feeling resilient doesn’t mean that you’re feeling good. No, in the storm, it means you’re surviving.” Keyes is prolific on social media; her Instagram feed is a riot and includes candid photos of her family: mother (“Old Vumman”), four siblings and several nieces and nephews. They are a close family. Keyes and her husband Tony Baines (“Himself”) have been married for 29 years. Earlier this year, she spoke about their inability to have children, saying she was at peace with it.\n\nThe bill for lunch at Sails at Lavender Bay. “We’re fine now, you know, we’re grand,” she said. “I also felt like ... I’d been given so much by the universe, like I was given the ability to stop drinking alcoholically, and then I met this lovely man who was really, really nice to me, and then I got a job doing something that I was able to do when people were willing to kind of pay me for it. And I just think I thought, like nobody gets everything. “But I feel like some kind of grace was afforded to me and my husband and we were just able to go, ‘Let’s focus on what we have rather than what we haven’t.’ You get what you get, and this is what I’ve got. And I’m absolutely grateful for my life.” We’ve been talking so much that we’ve hardly touched the food, which is light and delicious. The sun is refusing to come out. But I’m so engrossed in our conversation, which ranges from mental illness to lip liner, I stop noticing. Keyes revealed that she has become addicted to online personality quizzes – in particular, about the diagnosis du jour, ADHD. And after watching Andrew Scott in Ripley, she did several quizzes titled, “Am I a psychopath?” (The answer was no.)\n\n“I am very much self-diagnosed as (someone with ADHD). I’ve met a lovely woman who says she will diagnose it with a test. And I’m so scattered that I haven’t got it together to go and do it – the proof is already there. I don’t even need to do the test. If I’m too scatty to actually get it together to do it I should already be getting my green tick.” I asked her about My Favourite Mistake, which features a 48-year-old woman called Anna Walsh. At the start of the story, she jettisons her relationship, her job and her entire life in New York to go back to Ireland, without a plan of action. We discussed the phenomenon of older women increasingly deciding to upend their lives to run away and experience life on their own terms. When Keyes turned 60, she didn’t run away but blocked out a year to pause her writing and go back to university to study design. “The older I get, the more I realise that you can start again at any stage,” she says. “Last year, I took a year off and I went back to college, just to do something that I had always wanted to do. And I think with better health care and longer life expectancy, women are far more vocal about what they expect from their lives than they used to be. Keyes says “feeling resilient doesn’t mean that you’re feeling good. No, in the storm, it means you’re surviving.” Credit: Thomas Wielecki\n\n“I do think burnout is very real. Anna doesn’t have children, but I often see it when the children are grown, the children have gone to university, that’s it, and women are deciding, this is my time and I’m going to do all the things that I wanted to do when I was told I had to be doing other things. And I love it.” Lunch passed in a rush and Keyes’ minder arrived to whisk her away. I stepped outside, suffused with the contentment you feel after a meal of good food and great “craic”, in Irish terms. Turning to take in one of the world’s iconic views, I spotted a patch of blue. Like a Keyes novel – the clouds part, and the light returns. Marian Keyes is appearing at a Sydney Writers’ Festival event at the Sydney Town Hall at 8pm today. Stan is owned by Nine which also owns this masthead. If you or anyone you know needs help, call Lifeline on 13 11 14 (and see lifeline.org.au).",
    "source": "SMH",
    "cluster_id": 28
  },
  {
    "url": "https://www.smh.com.au/lifestyle/life-and-relationships/real-straight-shooter-lady-chu-s-founder-is-famously-brusque-she-has-her-reasons-20250507-p5lxf1.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "‘Real straight-shooter’: Lady Chu’s founder is famously brusque. She has her reasons",
    "publish_date": "Wed, 21 May 2025 11:50:00 +1000",
    "category": "lifestyle",
    "authors": [
      "Sue Williams"
    ],
    "text": "Save Log in , register or subscribe to save articles for later. Save articles for later Add articles to your saved list and come back to them any time. Got it Normal text size Larger text size Very large text size The first time I meet Vietnamese food dynamo Nahji Chu, I mention, apologetically, that I’m in a bit of a hurry as I have theatre tickets. She’s unmoved. “If you don’t have time, then don’t come here,” she says, airily, snatching the menu back off her restaurant table. “This isn’t a fast-food outlet.” A lot of people in hospitality would probably love to serve up similar home truths to their demanding customers. The difference with Chu is that she actually does. As the head of the MissChu empire that once included a catering business and a series of nine restaurant-tuckshops in Sydney, Melbourne and London, the “rice-paper-roll queen” could afford to be direct. But even now, after that company crashed spectacularly, and she was forced to start again from scratch, she is no less blunt. Along the way, the diminutive figure with the over-sized personality has become loathed by some but, in truth, loved by many more. And even those who don’t admire her style adore her food. With her Lady Chu restaurant expanding rapidly to colonise most of a Potts Point side street at Sydney’s Kings Cross, it’s hard to deny her entrepreneurial flair and culinary genius. But at the same time, she’s also extremely skilled at making enemies. Very recently, when City of Sydney rangers demanded, mid-service, that she move some restaurant planters they said were obstructing the footpath, she let fly a foul-mouthed rant against both them and the anonymous complainants who had brought them to the scene. “I’m just trying to make Australia a better place for everyone,” she told Good Weekend. “I think we’ve lost our way with ridiculous laws in hospitality and, if I have to go to jail to fight them, I will.” It’s that brusque manner that sees her regularly branded an Australian Basil Fawlty or our version of Seinfeld’s outrageous Soup Nazi – impatient, dismissive and belligerent. “She’s been called so many names over the years,” says Warren Fahey, musician, cultural historian and former chair of the Potts Point Business Group. “The Dragon Lady, Nazi Nahji … but, really, she’s extraordinarily generous and can be very welcoming. She’s a force to be reckoned with. Instead of knocking politely on doors, she knocks them down and rides straight through the red tape.” Vietnamese-Laotian Chu, 55, who was given asylum in Australia in 1978, knows she has a reputation for being pushy and terse to the point of rudeness to some of her customers, but she’s unapologetic. Sometimes, she thinks, people deliberately wind her up just to see her in full flight. “I’m not like that all the time, but because I have that reputation, people coerce it out of me. They want that. It’s a little bit like when someone is grinding metal and the sparks are flying, you’re meant to look away and put some protective sunglasses on. But with me, people go, ‘Let’s grind the metal and all watch.’ ”\n\nAdvertisement\n\nLady Chu’s signature Peking duck pancakes and rice paper rolls. Credit: Louie Douvis Roslyn Street is a backwater off the main Kings Cross drag of Darlinghurst Road, or it used to be before Chu took over a lease of one empty shopfront in 2020 during COVID-19, and then another, and another, until she, these days, has five shops in a row. Now, from Wednesday to Sunday each week, the pavement is transformed into an alfresco 90-seat restaurant with white-clothed tables, sofas, parasols, candles and huge pot plants festooned with fairy lights. Locals have dubbed it Rue de Chu. Chu thinks of it like Monopoly, with her own Mayfair being the Gaudi-inspired building on the end that once housed fine-diners Gastro Park and Metisse, where she can now operate her commercial kitchen. Her get-out-of-jail card, she says, is the tens of thousands of dollars she says she’s paid the City of Sydney in fees and fines for putting tables – and pot plants – where she’s not allowed. “She’s a real straight-shooter,” says film producer Rebel Penfold-Russell, who first met Chu when she catered a charity event. “But I wouldn’t like to stand in front of her! She works so hard, though, and is incredibly generous and great fun.” Every working day, Chu’s there on the frontline, as executive chef, restaurant manager and maître d’, taking bookings, seating people (or not), writing down orders, supervising the kitchen, doing the accounts and the marketing. “I’m doing at least three jobs at once,” she says, as the orders flood in for her signature tiger prawn and green mango rice paper rolls, her roast suckling pig banh mi, her Peking duck pancakes and rich and spicy beef and pork soup, bún bò Hue. “What comes out of that is my efficiency, which comes off as being quite abrupt. Loading “But when did you ever see Kylie Kwong seating people? When was the last time you got seated by Justin Hemmes? When you come to Lady Chu, I’m the one who’s there, doing it all. And that comes with me yelling sometimes. But it comes more from a place of efficiency than anything else.” In 1975, after the Laotian civil war was won by the Communist Pathet Lao, Chu’s mother and four of her siblings vanished overnight. A few months later, her father took her and her remaining brother on a stealthy nighttime crossing of the Mekong river to Thailand, daubing them in mud so they wouldn’t be seen. Just as they reached the Thai side, however, they were caught and thrown into a Thai jail cell with 40 other prisoners. They stayed there for three months, Chu suffering a bout of TB, until her father was able to bribe the guards to free them using hidden silver bars from Laos’ heroin trade. When they reached a Thai refugee camp, they were met by a miracle. “On the first day, standing in the distance, was my mother!” Chu says. “So I was reunited with her and my other brothers and sisters and aunty, and from then on, we always stayed together as a family.”\n\nAdvertisement\n\nIn her aunt’s makeshift cafe in a Thai refugee camp in 1977 (Chu fourth from left, her aunt Yen and mum at left.) Credit: Courtesy of Nahji Chu After three years being shuffled around camps and eking out a living growing vegetables and selling Vietnamese pho, in March 1978, they were flown to Australia and arrived at the migrant hostel in Villawood, in Sydney’s south-west. Chu was thrilled. “There was a tap for water, and I had my own bed,” she says. “But the food was terrible. Tip Top bread and butter that you ate with sugar on, and cereal out of cardboard boxes. We’d never seen anything like it. And school was brutal. The Australian children used to taunt us and bully us, there was so much racism.” Five months on, the family was sent to the NSW Hunter Valley to work on a chicken farm in Cessnock. After the mandatory year, the family piled into their old Ford Falcon 500 station wagon to drive to Melbourne, where Chu’s aunt was running a black-market noodle shop in her home. They moved into a house in Richmond, where neighbours were amazed they kept and killed their own chickens. Chu’s family were similarly alarmed at and disgusted by frozen chickens in supermarkets. Quitting university early, Chu worked in fashion, where she helped dress Kylie Minogue in her famous leather jacket for the movie The Delinquents. Later, she studied marketing and journalism, then worked for small-bar entrepreneur Vernon Chalker, becoming his catering manager, and later James Orloff in his business BITE, modelled on the UK’s Pret A Manger.\n\nBurnt out by hospitality at 34, she found a job in banking and was promoted to a post in Sydney in 2004. There, she was surprised to find long lunchtime queues at takeaways but no Vietnamese food on offer. The next step was obvious: she had learnt to cook from her grandmother, who once rattled pans for the king of Laos, and she knew about catering. She quit her job, sold some art to raise cash, and in 2007, MissChu was born in a Darlinghurst back street. Loading The MissChu fax machine was instantly jammed with orders, so Chu started using email and organised a team of e-bike riders to deliver her rice paper rolls, dumplings and Peking duck pancakes. “It was way before Uber Eats started,” says Chu, who used her photo on her refugee visa as her logo. “I was the first person in Australia to do something like that. I knew this business was my calling. I could be fast and supply good, healthy food. It was an instant success.” Expansion was rapid, with five outlets in Sydney, two in Melbourne, and one in London, a total staff of 280 and an annual turnover of $25 million. By 2014, she was planning more outlets and having talks with a franchise company which had worked with restaurateur Bill Granger to globalise her business, incorporating streetwear and a TV show. She became the poster child for refugee chic and a champion of Vietnamese culture.\n\nAdvertisement",
    "source": "SMH",
    "cluster_id": 29
  },
  {
    "url": "https://www.smh.com.au/national/taree-woman-rescued-from-home-20250521-p5m10r.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Taree woman rescued from home",
    "publish_date": "Wed, 21 May 2025 11:45:59 +1000",
    "category": "finance",
    "authors": [],
    "text": "Taree woman rescued from home\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 30
  },
  {
    "url": "https://www.smh.com.au/sport/nrl/wests-tigers-to-grant-galvin-permission-to-negotiate-with-rival-clubs-20250519-p5m0cd.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Wests Tigers to grant Galvin permission to negotiate with rival clubs",
    "publish_date": "Wed, 21 May 2025 11:45:33 +1000",
    "category": "sports",
    "authors": [
      "Michael Chammas",
      "Danny Weidler"
    ],
    "text": "The Wests Tigers are poised to grant Lachlan Galvin permission to negotiate with rival clubs after a board meeting on Monday.\n\nThe Tigers will grant Galvin permission to open negotiations with prospective teams before the November 1 free agency date, but with conditions.\n\nSources with knowledge of the situation talking on the condition of anonymity due to confidentiality told the Sydney Morning Herald one of those conditions will be reconsidering the legal case against the club following allegations of bullying against Galvin.\n\nThe other condition set to be put on any formal permission to negotiate with rival teams will be an agreed transfer fee which is still being determined.",
    "source": "SMH",
    "cluster_id": 31
  },
  {
    "url": "https://www.smh.com.au/sport/nrl/injured-star-haas-sits-out-opening-blues-training-session-20250520-p5m0sz.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Injured star Haas sits out opening Blues training session",
    "publish_date": "Wed, 21 May 2025 11:43:49 +1000",
    "category": "sports",
    "authors": [
      "Adrian Proszenko"
    ],
    "text": "Payne Haas did not participate in NSW’s first full training session on Wednesday as officials took a cautious approach with their star forward.\n\nHaas is nursing a quad strain that he suffered in Brisbane’s loss to the Dragons on Sunday. The star front-rower watched on as his Blues teammates trained in the rain on the fields of the Blue Mountains Grammar School at Wentworth Falls on Wednesday morning. Stephen Crichton, who has been troubled by a groin strain, took part in the training session.\n\nWhile the fields prepared for the Blues are kept in pristine condition, recent downpours made them wet and slippery underfoot. The Blues chose not to risk Haas so early in their preparation, and are likely to give him until the weekend, if required, to prove his fitness.\n\nHaas cut a forlorn figure on the sidelines as Laurie Daley’s men were put through their paces. At times he conferred with Gilbert Enoka – the leadership management and mental skills coach for the All Blacks – who was part of last year’s Blues campaign under previous coach Michael Maguire.",
    "source": "SMH",
    "cluster_id": 32
  },
  {
    "url": "https://www.smh.com.au/sport/bryson-dechambeau-wants-a-golf-ball-that-flies-straighter-his-nerds-are-working-on-it-20250520-p5m0la.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Bryson DeChambeau wants ‘a golf ball that flies straighter’. His nerds are working on it",
    "publish_date": "Wed, 21 May 2025 11:40:00 +1000",
    "category": "sports",
    "authors": [
      "James Corrigan"
    ],
    "text": "As Scottie Scheffler’s rivals left North Carolina considering how they can possibly deny the world No 1 further major victories this season, it was perhaps no surprise to hear “The Mad Scientist” sounding the most confident of discovering the secret.\n\nHowever, Bryson DeChambeau’s “trick up my sleeve” of which he boasted is not as highbrow as one might think and is instead simply the wish of anybody who has ever picked up a club – hacker or superstar alike.\n\n“What I really think needs to happen is to get a golf ball that flies straighter,” he said. Sign us all up for that, Bryson.\n\nDeChambeau recognises that he and his suppliers have only three weeks to meet his demanding order before the year’s third major at Oakmont, but the 31-year-old is adamant it can be achieved. “I’m going to be working my butt off to bring it for the US Open, but I’ve got to get some equipment here soon,” he said. “It’s all up to manufacturing.”\n\nOf course, there will be accusations of a workman blaming his tools, but, again, DeChambeau is perhaps merely summing up the feelings of many frustrated golfers in this regard. In fairness to the American, he does have science in his corner and, as the player who hits the ball hardest and highest, his Titleist ProV1x Left Dash is affected more than his fellow pros.",
    "source": "SMH",
    "cluster_id": 33
  },
  {
    "url": "https://www.smh.com.au/lifestyle/fashion/princess-catherine-spreads-the-kate-effect-in-butter-yellow-20250521-p5m0vu.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Princess Catherine spreads ‘the Kate effect’ in butter yellow",
    "publish_date": "Wed, 21 May 2025 11:30:59 +1000",
    "category": "lifestyle",
    "authors": [
      "Damien Woolnough"
    ],
    "text": "If the plan for Princess Catherine’s return to royal duties was to steer attention away from her clothing, things couldn’t be worse.\n\nHosting a royal garden party at Buckingham Palace with Prince William, the Duke and Duchess of Edinburgh, Princess Eugenie and Zara Tindall for 8000 guests, Catherine was on trend in a butter yellow dress from New Zealand designer Emilia Wickstead, with a matching hat by Irish milliner Philip Treacy.\n\nThe outfit was last worn by Catherine in 2022, at the Platinum Jubilee celebrations for Queen Elizabeth II, further demonstrating her status as an early adopter of key trends. Butter yellow was spread across collections last week in Sydney at Australian Fashion Week with Aje, Gary Bigeni and Nicol & Ford.\n\nPrincess Catherine in an Emilia Wickstead dress and Philip Treacy hat at Buckingham Palace for a garden party. Credit: Getty Images\n\nAt the spring 2025 international ready-to-wear shows, Chanel, Jacquemus, Zimmermann and Chloe all made liberal use of buttery yellow, which was named by interior designers Timothy Corrigan, Heidi Callier and Robin Standefer as the colour of 2025 in Vogue’s annual interior design trend report.",
    "source": "SMH",
    "cluster_id": 34
  },
  {
    "url": "https://www.smh.com.au/sport/soccer/i-m-not-a-clown-mate-why-winning-the-europa-league-would-be-postecoglou-s-biggest-achievement-20250519-p5m0dt.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "‘I’m not a clown, mate’: Why winning the Europa League would be Postecoglou’s biggest achievement",
    "publish_date": "Wed, 21 May 2025 11:30:00 +1000",
    "category": "sports",
    "authors": [
      "Vince Rugari"
    ],
    "text": "“I’m really disappointed that you would use such terminology about a person who for 26 years without any favours from anyone has worked his way to a position where he’s leading out a club in a European major competition [final]. For you to suggest that somehow us not being successful means that I’m a clown … not really sure how to answer that question.” Spurs and United: similar, but different Postecoglou and his Manchester United counterpart, Ruben Amorim, are walking parallel paths. Each are trying to restore identity and pride to clubs haunted by their own mythology. Both are in charge of institutions that still see themselves as “big clubs″⁣, even if recent history suggests otherwise. Tottenham and Manchester United have become relics of their former selves, but in very different ways. Spurs are starved of silverware and defined by a reputation for self-sabotage. United are bloated by expectation, yet bereft of structure. Both clubs are stuck between what they used to be and what they are trying to become. Ange Postecoglou and Ruben Amorim. Credit: Getty Images\n\nBoth managers are dealing with fan bases that say they want a rebuild, but recoil at the grim reality of one. Patience is contingent upon results. Faith erodes with each defeat. In the Premier League, both clubs have endured historically bad seasons: Spurs fell out of the title conversation after a brutal winter of injuries and inconsistency, while United’s campaign has been, at times, utterly farcical. Neither club should be where they are on the table – but there they are. Spurs are 17th, United are 16th. No European final has ever taken place between two teams in such lowly positions. For United, this is not so much about the trophy itself; as a club that has won bigger things more often, the Europa League feels almost beneath them. What they want is the prizemoney and a spot in next season’s Champions League, which would allow Amorim to accelerate his rebuild. Most United fans would gladly take those things and forego the silverware if it was an option. For Spurs, the trophy is the prize. “The game is about glory,” legendary manager Danny Blanchflower once said. It’s not about what Postecoglou once described as chasing “Willy Wonka golden tickets” to nowhere. They want the glory. They need the glory. Postecoglou came into the job dismissing the urge from supporters for them to just win something – anything – because it wouldn’t “cure all ills”. But over time, he seems to have slowly come to the understanding that a trophy is exactly what Spurs need, to serve almost as a psychological palate cleanser, to change the way not only the rest of the football world sees them, but the way they see themselves. His tactical approach has shifted accordingly.\n\nHow Postecoglou has adapted on the field Despite what his knockers say, Postecoglou has tweaked his tactics. To a greater extent than perhaps he ever has, and certainly much later than many would have liked. But it’s happened. Belatedly, in the Europa League, Spurs have embraced pragmatism. Postecoglou’s teams usually dominate possession; in their three most recent wins in Europe, against Eintracht Frankfurt and Bodo/Glimt (twice), they have had just 39, 42 and 33 per cent of the ball, three of the lowest such numbers on record throughout his entire reign. In the Premier League this season, Spurs have launched their goal kicks (meaning a long pass beyond 40 yards) just 7.9 per cent of the time for an average pass length of 16.4 yards; in Europe, it’s 29.7 per cent and 29.2 yards. Ange Postecoglou on the training pitch. Credit: Getty Images Domestically, Postecoglou kept asking his team to play the same high-octane way, even at the expense of defensive solidity. But in Europe, they have been far more direct with their passing and conservative with their positioning and pressing. It has worked.\n\nIs it just a natural response to the unique demands of knockout soccer against unfamiliar opponents, and the personnel challenges Spurs have faced? Or, perhaps, to the prevailing trends in the sport, making this a mere iteration of Angeball? Or has Postecoglou finally abandoned his principles – the ones he has said he will take to his footballing grave? That’s one for him to answer, but there’s no denying Spurs look different. Why this would be Ange’s biggest achievement All of Postecoglou’s major achievements have been forged through adversity. But he’s never encountered adversity quite like this. Injuries are one of few constants in soccer, but few teams have had to deal with the volume of injuries Tottenham have had to contend with. Their season spiralled out of control through an unprecedented run of player losses, which left them without up to 11 first-teamers for weeks on end. Even worse, most of them were defenders: centre-backs Mickey van de Ven and Cristian Romero, so key to the way Postecoglou wants to play, missed four months simultaneously and, since returning, have been sparingly used in the league to ensure they were fit for Europe. Ange Postecoglou loses his cool on the sideline. Credit: Getty Images\n\nThese injuries, particularly to the centre-backs, had a cascading effect, and not only on team cohesion. More and more was being asked of their ill-fitting replacements and, in turn, those players’ bodies collapsed under the heavy demands of playing two games a week, every week. It’s not an excuse, but a reason Spurs have fallen so far down the table. Judging by his rotations, at some point in the past few months, Postecoglou effectively put the cue in the Premier League rack and put all his and Tottenham’s eggs in the European basket. Loading Injuries will again be a factor in the final. This time it’s their three most creative midfielders who have been struck down, one after the other: first Lucas Bergvall, then James Maddison, then Dejan Kulusevski. Other players – perhaps fit-again captain Son Heung-min – will have to provide the attacking spark in their absence. Add to all of that the deafening noise about his future, the constant doubting of his track record and the negative rhetoric that always seems to swirl around Tottenham – which he has tried desperately to stop his players from internalising – and this is a situation that would have destroyed most other managers. Yet Postecoglou is still standing, his team has the chance to win a significant competition, and his players are still 100 per cent on board with him. That matters. They are completely dialled in. Even the “Ange Out” crew have laid down their guns for now.",
    "source": "SMH",
    "cluster_id": 11
  },
  {
    "url": "https://www.smh.com.au/sport/nrl/locky-pinpoints-source-of-broncos-frustration-20250521-p5m10i.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Locky pinpoints source of Broncos 'frustration'",
    "publish_date": "Wed, 21 May 2025 11:29:18 +1000",
    "category": "sports",
    "authors": [],
    "text": "Locky pinpoints source of Broncos 'frustration'\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 35
  },
  {
    "url": "https://www.smh.com.au/business/markets/asx-set-to-rise-wall-street-slides-musk-commits-to-leading-tesla-20250521-p5m0vt.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "ASX rises amid bets for more rate cuts; banks and gold miners advance",
    "publish_date": "Wed, 21 May 2025 11:24:33 +1000",
    "category": "finance",
    "authors": [
      "Staff Reporters"
    ],
    "text": "The Australian sharemarket jumped at the open amid optimism for more rate cuts after the Reserve Bank lowered its benchmark interest rate by a quarter of percentage point on Tuesday.\n\nThe S&P/ASX 200 rose 50.20 points, or 0.6 per cent, to 8393.50 as of 11.07am AEST, ignoring a fall in US stocks overnight. Ten of the local bourse’s 11 sectors advanced, led by banks, energy stocks and utilities. The ASX rose 0.6 per cent in the previous session.\n\nReserve Bank Governor Michele Bullock raised hopes when she said the central bank had even considered a jumbo cut. Credit: Louie Douvis\n\nThe Australian dollar, which fell 0.6 per cent to 64.21 US cents overnight, traded at 64.38 US cents as of 11.05am AEST.\n\nAt a press conference following the decision, RBA governor Michele Bullock said the possibility of holding rates steady was quickly cast aside for a debate on how deeply to cut.",
    "source": "SMH",
    "cluster_id": 36
  },
  {
    "url": "https://www.sbs.com.au/news/article/when-the-rba-could-next-cut-rates/3bn4zpo99",
    "title": "After a 'cautious' move, when could the Reserve Bank next cut interest rates?",
    "publish_date": "Wed, 21 May 2025 02:05:03 +0000",
    "category": "finance",
    "authors": [],
    "text": "Mortgage holders could be waiting until September to see a reduction in their home loan repayment rates as some economists predict the Reserve Bank of Australia (RBA) will not make a further cut at its next meeting in July.\n\n\n\n\n\nThe RBA reduced the cash rate target by 0.25 per cent on Tuesday , taking the key interest rate down to 3.85 per cent following what it described as a healthy reduction in inflation.\n\n\n\n\n\nRBA governor Michele Bullock said the board had considered a 0.50 per cent cut before reaching consensus on the 0.25 per cent reduction to the cash rate target.\n\n\n\n\n\n\"Does it mean we're headed into a long series of interest rate cuts? I don't know at this point,\" she said on Tuesday afternoon.\n\n\n\n\n\nShe described the 0.25 per cent cut as \"cautious\", adding that it came \"with a recognition that if we need to move quickly, we can. We have got space.\"\n\n\n\nHow interest rates have risen and fallen in Australia\n\nWhat do economists make of the decision?\n\nBetashares chief economist David Bassanese said Bullock's explanation suggested the RBA was not \"seriously considering\" not cutting interest rates on Tuesday.\n\n\n\n\n\n\"That tells me that a rate cut was definitely on the table. The only question was the size,\" he told SBS News.\n\n\n\n\n\n\"There's an element of stability that's returned to markets. Recession fears have eased, and so they don't need a big cut of 0.5 per cent.\"\n\n\n\n\n\nHe flagged that trimmed mean inflation, one of the board's most valued economic indicators, was within its target range of 2–3 per cent and sat at 2.9 per cent in the most recent March quarter data.\n\n\n\n\n\n\"The RBA is forecasting inflation will go to 2.6 per cent, so if that's what happens, then they can take rates back to normal, which I think is below three per cent, he said.\n\n\n\nRSM Australia economist Devika Shivadekar said the reduction was \"welcome news\" for businesses.\n\n\n\n\n\n\"Financing has been quite restrictive, and given low productivity, businesses would have been struggling. Even though inflation was going down, costs have been higher,\" she told SBS News.\n\n\n\n\n\nShe described trimmed mean inflation as consistently reducing, which could underpin further rate cut decisions.\n\n\n\n\n\nThe RBA's next opportunity to cut rates is at its 8 July meeting, but some economists say that's too soon for a cut, with a reduction more likely at its August meeting.\n\n\n\n\n\nAfter a rate cut, it can take at least a month to see your loan payments reduce, and some banks do not automatically pass on the savings.\n\n\n\nWhen will the RBA cut rates again?\n\nAMP chief economist Shane Oliver said there was a 50 per cent chance there could be a cut in July but the most likely scenario was that the RBA would keep the rate on hold at 3.85 per cent.\n\n\n\n\n\n\"Our base case is for 0.25 per cent cuts in each of August, November and February, taking the cash rate to 3.1 per cent,\" he told SBS News.\n\n\n\n\n\nBassanese also predicted the same reductions in August and November, anticipating \"one more rate cut next year\".\n\n\n\n\n\nShivadekar anticipated a 0.25 per cut each quarter of 2025 and had correctly forecast a cut in February and May this year.\n\n\n\nSource: SBS News Looking forward, she also predicted 0.25 per cent cuts in August and November.\n\n\n\n\n\n\"That would leave the cash rate at 3.35 per cent at the end of the year. Looking to next year, the RBA will have a lot to consider domestically and globally,\" she said.\n\n\n\n\n\nKey quarterly inflation data for the June quarter will only be released after the board's July meeting, meaning the RBA could hold the rate until August, when it has access to that important data.\n\n\n\n\n\nHowever, the decision to change the cash rate target is ultimately up to Bullock and her board.\n\n\n\nWhat to watch in the meantime?\n\nOliver flagged a number of upcoming domestic data releases that would weigh into the RBA's decision-making, as well as news from overseas.\n\n\n\n\n\n\"Key data points to watch ahead of the July meeting are the monthly inflation readings next week and in late June, growth in household spending, jobs data, and developments regarding [US President] Donald Trump's tariffs, which risk ramping up again ,\" he said.\n\n\n\n\n\nBut the three economists agreed that quarterly inflation data, due to be released 30 July and 29 October, were the most critical to managing Australia's economy.\n\n\n\n\n\nShivadekar also flagged that \"soft\" data, like consumer confidence, would also be key.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 37
  },
  {
    "url": "https://www.sbs.com.au/news/article/the-public-sector-gender-pay-gap-data-has-been-revealed-heres-what-to-know/yt30vo1j8",
    "title": "The public sector gender pay gap data has been revealed. Here's what to know",
    "publish_date": "Tue, 20 May 2025 21:35:16 +0000",
    "category": "finance",
    "authors": [],
    "text": "Gender pay gaps at Australia's biggest public sector employers have been revealed for the first time, showing lower gaps compared to the private sector.\n\n\n\n\n\nBut men account for just 11 per cent of all primary carers leave taken, and 49 per cent of employers still have a gender pay gap in favour of men.\n\n\n\n\n\nWell-known employers such as Australia Post, the Australian Tax Office, the Reserve Bank, CSIRO and dozens of federal government departments have had their pay gaps published.\n\n\n\n\n\nThe Workplace Gender Equality Agency was able to publish the data after law changes in 2023, with private sector gaps published earlier in 2025.\n\n\n\nREAD MORE The Australian employers reducing their gender pay gap — and those falling short\n\nHow does the public sector stack up against the private sector?\n\nHalf of Commonwealth public sector employers have a median total remuneration gender pay gap lower than 4.8 per cent, compared to 8.9 per cent in the private sector.\n\n\n\n\n\nNearly half have a median total remuneration gender pay gap in the target range of within +/-5 per cent, compared to 31 per cent in the private sector.\n\n\n\n\n\nMore than half of employers improved their median total remuneration gender pay gap in the past 12 months.\n\n\n\nSo why the gap between public and private?\n\nWhen compared to the private sector, women and men have more balanced representation in the upper pay areas of the Commonwealth public sector.\n\n\n\n\n\nWomen also comprise 47 per cent of the highest-paid positions.\n\n\n\nThe results showed how progress could be achieved when employers used long-term and deliberate actions that addressed gender equality, agency chief executive Mary Wooldridge said.\n\n\n\n\n\n\"Pleasingly, we have also seen large rises in the number of employers conducting a gender pay gap analysis, acting on the results and consulting with employees to understand their experience at work,\" she said.\n\n\n\nWhat’s the next focus for boosting workplace gender equality?\n\nAlthough progress had been made, Wooldridge said there was still work to do to improve gender equality.\n\n\n\n\n\n\"Workplace gender equality benefits everyone, so it is important that barriers for men are also addressed,\" she said.\n\n\n\n\n\nShe said public sector employers needed to \"ensure more men have confidence to take primary carer's leave\", urging them to \"drive cultural change that removes real or perceived penalties for taking time out for caring roles\".\n\n\n\n",
    "source": "SBS",
    "cluster_id": 38
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/one-on-one-nationals-deputy-leader-kevin-hogan-talks-about-the-split-with-the-liberals/zautqji8o",
    "title": "One on One: Nationals Deputy Leader Kevin Hogan talks about the split with the Liberals",
    "publish_date": "Tue, 20 May 2025 21:00:00 +0000",
    "category": "finance",
    "authors": [],
    "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nA week after being elected into the deputy position, Kevin Hogan says the National Party was forced to breakaway from its traditional alliance with the Liberal Party over issues that were considered non-negotiable.\n\n\n\n\n\nBut they included supermarket divestiture powers, a multi-billion dollar regional fund, bush telecommunications and a continued commitment to nuclear energy.\n\n\n\n\n\nMr Hogan says the party offered to step back from the original demands for state owned nuclear power plants, and just advocate for the ban on nuclear power to be lifted.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 39
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/rba-cuts-interest-rates-for-second-time-in-2025/fj9scdl5b",
    "title": "RBA cuts interest rates for second time in 2025",
    "publish_date": "Tue, 20 May 2025 08:09:40 +0000",
    "category": "finance",
    "authors": [],
    "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
    "source": "SBS",
    "cluster_id": 40
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/the-federal-coalition-splits-why-and-what-it-means/wp3vp0flb",
    "title": "The federal coalition splits- why, and what it means",
    "publish_date": "Tue, 20 May 2025 07:23:44 +0000",
    "category": "finance",
    "authors": [],
    "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nIt's a partnership that has lasted the better part of eighty years - but it's now no more.\n\n\n\n\n\nThe Coalition, made up of the Liberal and National Parties, has collapsed- a victim of its own crushing electoral defeat on May the 3rd.\n\n\n\n\n\nIt was the National Party who quit the deal, as their leader, David Littleproud, explains.\n\n\n\n\n\n\"Our party room has got to a position we will not be re-entering a Coalition agreement with the Liberal Party after this election. What we have got to a position is that the National Party will sit alone on a principle basis.\"\n\n\n\n\n\nIt's not the first time a coalition agreement hasn't been reached- they briefly split in 1972, and again before the federal election of 1987.\n\n\n\n\n\nAnd Deputy Nationals Leader Kevin Hogan has left the door open for them to come back together again.\n\n\n\n\n\n\"Sometimes, if you have a relationship breakup, when you get back, and I hope we do get back together. And my intention is we do get back together, it will be greater clarity and greater focus from the time that was spent apart.\"\n\n\n\n\n\nSo how did they get into this situation in the first place?\n\n\n\n\n\nTo start off, you need to understand a bit about the parties.\n\n\n\n\n\nThe National Party of Australia- originally the Country Party- has been around for a lot longer than the Liberal Party - more than 100 years.\n\n\n\n\n\nAnd it has a simple mandate - represent rural, remote, and regional Australia, as Dr Jill Sheppard from the Australian National University explains.\n\n\n\n\n\n\"They have a clear sense of their purpose, and generally, they are a pretty cohesive group who have a shared set of principles and a really strong identity around representing Australian agricultural interests.\"\n\n\n\n\n\nThe Liberal Party on the other hand is a relative newcomer to the game - established in 1944 by Sir Robert Menzies.\n\n\n\n\n\nDr Sheppard explains that his assessment at the time was that no one spoke for middle Australia, so that's who the Liberal Party would represent.\n\n\n\n\n\n\"So the Liberal Party really just formed in response to the Labor Party. Leaders have always found it really difficult to keep a cohesive sense of why are we here? You know, what are we doing? Except for opposing Labor.\"\n\n\n\n\n\nWhen the Liberal Party came around, the Nationals were no strangers to coalitions.\n\n\n\n\n\nThe first coalition was with the now extinct Nationalist Party in 1922.\n\n\n\n\n\nIn 1946, the Liberals and Nationals signed the first coalition agreement, and in 1949 they formed government together for the first time, with Robert Menzies as Prime Minister.\n\n\n\n\n\nThat was the longest serving government in history - lasting 23 years.\n\n\n\n\n\nBut despite working together for a long time, Dr Sheppard says they are ideologically different parties, often with opposing views on issues.\n\n\n\n\n\n\"Deep down, they really don't like each other.\"\n\n\n\n\n\nBut because the Nationals have never had the numbers to govern in their own right, and the Liberals have only been able to score an outright majority twice, the two have consistently worked together.\n\n\n\n\n\nCoalition agreements are secret, so we don't know for sure what was in the last one.\n\n\n\n\n\nThe Liberal Party claims that they're just about logistics, like who gets to be the official spokesperson on various portfolios.\n\n\n\n\n\nBut the Nationals say they can include promises on policies.\n\n\n\n\n\nThis time around, Mr Littleproud says the policy sticking points have been around energy, regional funding, and supermarkets.\n\n\n\n\n\n\"Those positions that we couldn't get comfort around nuclear being a part of an energy grid into the future. About the Regional Australia Future Fund - a $20 billion fund paying a $1 billion dividend every year to change the lives of regional Australians. To training doctors, filling in potholes, to giving young families the hope of childcare. What we fight for every day, that's the principled position that we took that we needed to have comfort around. It's around divestiture powers for supermarkets. We've been very principled about that, about the impact it's had on farmers but the impact that it had on the Australian consumer.\"\n\n\n\n\n\nAnother issue, according to Ms Ley, was around how they would vote on the floor of parliament.\n\n\n\n\n\n\"The Liberal Party also insisted that Shadow Cabinet solidarity be maintained in any coalition agreement, and that was unable to be resolved.\"\n\n\n\n\n\nBasically, under coalition agreements, the Nationals and Liberals share positions in what is known as the shadow cabinet.\n\n\n\n\n\nWhen you have a position in that shadow cabinet, you generally have to vote with the position of the coalition.\n\n\n\n\n\nThe Nationals wanted to have those cabinet positions, but be able to vote against the positions of the Liberals.\n\n\n\n\n\nThe dissolution of the coalition means the Liberal Party is the official opposition.\n\n\n\n\n\nBy not holding any so-called shadow ministries, the Nationals sacrifice entitlements, including additional staff, and a 25 per cent pay bonus.\n\n\n\n\n\nExactly how many staff the Nationals will be allocated is up to Prime Minister Anthony Albanese.\n\n\n\n\n\nMs Ley says she wanted a shadow cabinet in place as soon as possible.\n\n\n\n\n\n\"Our perspective is not about the individual policies themselves, but the approach that we said we would take to our party room about policies. I asked the Nationals to respect those party room processes, and similarly, I would respect their attachment to the policies that they announced as very important to them. In good faith, I proposed that we stand up a joint shadow ministry and that we go forward in a united way and that we then work separately on policies. And the Nationals did not agree to that approach.\"\n\n\n\n\n\nBoth party leaders say the door remains open for negotiations, and want the two parties to come back together in the future.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 41
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/evening-news-bulletin-20-may-2025/mjkr1pdmb",
    "title": "Evening News Bulletin 20 May 2025",
    "publish_date": "Tue, 20 May 2025 06:13:37 +0000",
    "category": "finance",
    "authors": [],
    "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\nAn interest rate cut announced by the Reserve Bank\n\nThe Liberals and Nationals announce an end to their Coalition agreement\n\nOfficials from the International Olympic Committee visit Brisbane to discuss plans for 2032 Games\n\nThe Reserve Bank has cut the official interest rate for the second time this year, announcing a reduction of 25 basis points to 3.85 per cent.\n\n\n\n\n\nThe last time the cash rate was at this level was in May 2023.\n\n\n\n\n\nIn a statement, the central bank board says inflation continues to moderate, but the outlook remains uncertain.\n\n\n\n\n\nTreasurer Jim Chalmers says the decisions taken by the RBA are independent, but he is pleased to see economic conditions are improving.\n\n\n\n\n\n\"I don't see today's decision in political terms. I see it in economic terms. It is the right decision made for the right reasons - and the right reasons to make an interest rate cut - like we're seeing today is the fact that together as Australians we've made a heap of progress on inflation. The global environment is uncertain. And for reasons outlined in the independent Reserve Bank's statement today. They felt the conditions warranted this cut.\"\n\n\n\n\n\n---\n\n\n\n\n\nThe Nationals have ended their partnership with the Liberals, following a disastrous result for the Coalition at the federal election.\n\n\n\n\n\nNationals Leader David Littleproud says an agreement could not be reached to continue the partnership of 79 years.\n\n\n\n\n\nNationals MP Michael McCormack says this decision was made to better serve their constituents.\n\n\n\n\n\n\"Yeah, but look Labor has won the election. And I acknowledge and respect that. And we will work together with the Liberals to form a credible opposition - albeit going a different way at the moment. And I hope things work out. That by 2028, a long way off, that we can again win the faith of the voters of Australia and return to government.\"\n\n\n\n\n\n---\n\n\n\n\n\nForeign Minister Penny Wong has delivered a speech in Fiji as part of a three-country tour of the Pacific, which will also include Tonga and Vanuatu.\n\n\n\n\n\nLabor has a target of cutting emissions 43 per cent by 2030.\n\n\n\n\n\nIn Suva, Ms Wong did not make any new announcements on climate action for Pacific Island countries, despite calls for more ambition.\n\n\n\n\n\nMs Wong says reducing emissions is a challenge for Australia.\n\n\n\n\n\n\"And I am very open and honest with your leaders and your people about this. Now we have been historically a very fossil fuel dependent economy, a very emissions intensive economy. So we have to transform it. And that is a big task. I often liken it to a large ship being turned. That is what we have to do. And we have legislated very ambitious targets. So our action is to meet them.\"\n\n\n\n\n\n---\n\n\n\n\n\nAustralia has joined 22 other nations in condemning Israel over its decision to allow limited aid into Gaza.\n\n\n\n\n\nIsrael's Prime Minister, Benjamin Netanyahu, says his troops are \"making progress\" on taking control of Gaza as part of an expanded military operation.\n\n\n\n\n\nIn the joint statement, Australia along with other nations - such as the UK, Canada, and New Zealand - called for the full resumption of aid into Gaza; and also for unimpeded access for the UN and humanitarian groups.\n\n\n\n\n\n---\n\n\n\n\n\nOfficials from the International Olympic Committee are in Brisbane for meetings on preparations for the 2032 Olympics, which will be hosted in Queensland.\n\n\n\n\n\nOutgoing president Thomas Bach is in the delegation, along with his successor, incoming IOC president Kirsty Coventry.\n\n\n\n\n\nHe told Channel Nine, there will be affordable tickets available for local residents.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 37
  },
  {
    "url": "https://www.sbs.com.au/news/article/banks-passing-on-latest-rate-cut/ncdlfg9ia",
    "title": "Which banks have passed on the RBA's latest interest rate cut?",
    "publish_date": "Tue, 20 May 2025 05:42:12 +0000",
    "category": "finance",
    "authors": [],
    "text": "The Reserve Bank of Australia (RBA) has cut interest rates to a two-year low amid cooling inflation, though it continues to warn of an uncertain economic outlook.\n\n\n\n\n\nThe central bank cut the cash rate to 3.85 per cent on Tuesday following its two-day meeting of the monetary policy board — a move Treasurer Jim Chalmers said would be \"welcome relief\" for mortgage holders.\n\n\n\n\n\nIt comes after inflation came in at 2.4 per cent in the March quarter while underlying inflation — the RBA's preferred measure, which excludes volatile components — came in at 2.9 per cent.\n\n\n\n\n\nThe latter figure is at the top of the RBA's inflation target band of 2-3 per cent.\n\n\n\n\n\nWhile acknowledging the substantial fall in inflation since its peak in 2022, the monetary policy board said headline inflation was likely to rise to the top of the band over the coming year as \"temporary factors\", like energy bill rebates, come to an end.\n\n\n\nHowever, it did expect underlying inflation would moderate to around the midpoint of its target band over the forecast period — until July 2027.\n\n\n\n\n\nIt also warned of an uncertain economic outlook, pointing to, among other things, concerns over US tariffs, \"pronounced\" geopolitical uncertainties, and domestic economic activity.\n\n\n\n\n\nStill, it determined that the \"risks to inflation have become more balanced\" and decided to cut rates given inflation is projected to remain around target.\n\n\n\nHow much will the rate cut save mortgage holders?\n\nThose with a $500,000 loan would save around $76 a month if their lender passes on the rate cut, according to an analysis by financial comparison website Canstar.\n\n\n\n\n\nMortgage holders with a $600,000 loan would save $91 a month; those with a $750,000 loan would have $114 shaved off their monthly repayments; and those who've borrowed $1 million would save about $152 a month.\n\n\n\nWhich banks are passing on the latest interest rate cut?\n\nLenders will likely continue to make announcements over the coming days.\n\n\n\n\n\nBut so far, these banks and lenders have said they will pass on the quarter-point cut from:\n\n\n\n\n\n23 May: Macquarie Bank\n\n\n\n\n\n30 May: Commonwealth Bank, NAB, ANZ, Bankwest, Suncorp, People's Choice Credit Union\n\n\n\n\n\n2 June: AMP\n\n\n\n\n\n3 June: Westpac, ING, RACQ Bank, Bank SA, Bank of Melbourne, St George\n\n\n\n\n\n5 June: Pepper Money\n\n\n\n\n\n11 June: Homeloans\n\n\n\n\n\nOnline lenders Athena and Unloan have also passed on the cut immediately.\n\n\n\nHow far could interest rates fall?\n\nThe Commonwealth Bank expects the cash rate will fall by a further 0.50 percentage points — to 3.35 per cent — by the end of 2025\n\n\n\n\n\nANZ and Westpac also expects it will fall to 3.35 per cent, with the former predicting August and the latter by the end of the year.\n\n\n\n\n\nUnlike the other big four banks, NAB had predicted a 0.50 per cent cut in May — a move that ultimately didn’t eventuate. It has yet to update its forecasts.\n\n\n\nWhen will the RBA make its next interest rates decision?\n\nThe monetary policy board will next meet on 7-8 July.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 37
  },
  {
    "url": "https://www.sbs.com.au/news/video/qantas-faces-121-million-penalty-for-illegal-outsourcing-of-ground-staff/0mi62mvd3",
    "title": "Qantas faces $121 million penalty for illegal outsourcing of ground staff",
    "publish_date": "Tue, 20 May 2025 04:41:16 +0000",
    "category": "finance",
    "authors": [],
    "text": "Qantas faces $121 million penalty for illegal outsourcing of ground staff\n\nPublished 19 May 2025, 10:25 am\n\nA compensation hearing is underway in the Federal Court for what unions are calling the biggest illegal sacking in Australian corporate history. The Transport Workers Union is calling for a maximum penalty of $121 million to be imposed against Qantas for illegally outsourcing 1,800 ground workers in 2020. This is in addition to the $120 million already being administered to those impacted employees.",
    "source": "SBS",
    "cluster_id": 4
  },
  {
    "url": "https://www.sbs.com.au/news/article/interest-rates-set-to-fall-after-rba-cuts-the-cash-rate-to-a-two-year-low/of5wt1ltj",
    "title": "'Unpredictable': RBA's 'trade war' forecast revealed amid interest rate 'relief'",
    "publish_date": "Tue, 20 May 2025 04:30:24 +0000",
    "category": "finance",
    "authors": [],
    "text": "Interest rates have been cut for a second time this year, to their lowest since 2023, and future rate cuts could be on the cards.\n\n\n\n\n\nTreasurer Jim Chalmers said the Reserve Bank of Australia's (RBA) decision to cut the cash rate to 3.85 per cent from 4.1 per cent will mean someone with a $750,000 mortgage will save $118 a month in reduced repayments\n\n\n\n\n\nMeanwhile, the RBA has modelled the impact of a trade war on Australia, saying unemployment could reach 6 per cent should the United States' so-called Liberation Day tariffs be reintroduced and all countries retaliate.\n\n\n\n\n\nChalmers said on Tuesday: \"This is the second interest rate cut in the last three months. This is very welcome relief for millions of Australians.\"\n\n\n\n\n\n\"We are really pleased to see more help is on the way.\"\n\n\n\nHow interest rates have risen and fallen in Australia When asked about potential future cuts, Chalmers said: \"The market has expected for some time that there would be multiple interest rate cuts this year.\n\n\n\n\n\n\"That is a matter for the independent Reserve Bank, and it's a matter for the market and for the economists to make those sorts of assessments.\n\n\n\n\n\n\"The market expects there to be further interest rate cuts, but market expectations change over time.\"\n\n\n\n\n\nBanks, including Westpac, ANZ, NAB and the Commonwealth Bank, have announced they will pass the 0.25 percentage point rate cut onto their customers .\n\n\n\n\n\nThe RBA said there was uncertainty about the world economy, saying in its statement following Tuesday's rates decision: \"There is still considerable uncertainty about the final scope of the tariffs and policy responses in other countries.\n\n\n\n\n\n\"The Board considered a severe downside scenario and noted that monetary policy is well placed to respond decisively to international developments if they were to have material implications for activity and inflation in Australia.\"\n\n\n\nWhat the rate cut could mean for borrowers. In the RBA's latest quarterly Statement of Monetary Policy, released on Tuesday, the central bank has modelled the impact of 'trade war' and 'trade peace' scenarios on GDP, unemployment and inflation.\n\n\n\n\n\nUnder the trade war scenario, in which trade conflicts brought about by US tariffs escalate and lead to a protracted trade war, growth \"slows sharply\", GDP would be 3 per cent lower than the baseline forecast, and unemployment rises to 6 per cent.\n\n\n\n\n\nThe bank also warned a protracted trade war could fuel global inflationary pressures.\n\n\n\n\n\nUnder the trade peace scenario, there is a swift resolution to trade conflicts resulting in potential increased demand for goods and services in Australia. The bank warns this could potentially fuel inflationary pressures and further expected rate cuts may not follow.\n\n\n\n\n\nGovernor Michele Bullock told reporters: \"The key point about the situation we're in is it's not just uncertain, it's actually unpredictable.\"\n\n\n\n\n\n\"And so I think in terms of our focus, part of the reason ... we put those scenarios in was to demonstrate that the range of outcomes here could be quite wide.\n\n\n\n\n\n\"I'm not putting a strong possibility on a really, really bad outcome, but I think we have to be alert that there might be.\"\n\n\n\nOn trade with the US, Chalmers said: \"We engage wherever we can and whenever we can, because this relationship is of mutual economic benefit.\"\n\n\n\n\n\n\"We've got a lot of skin in the game when it comes to these escalating trade tensions.\n\n\n\n\n\n\"Our gross debt position is better than the US. Our budget balance is better than the US. We've got the triple-A credit rating from all three of the agencies.\n\n\n\n\n\n\"The US have just been downgraded by Moody's [credit rating company].\n\n\n\n\n\n\"We've got lower unemployment here, we've got stronger employment growth here, and we've got lower interest rates here in Australia as well, at the same time as we've got similar levels of inflation.\n\n\n\n\n\n\"And so that comparison, I think, is another reminder that Australia is especially well placed and well prepared to deal with all this global uncertainty.\"\n\n\n\n",
    "source": "SBS",
    "cluster_id": 37
  },
  {
    "url": "https://www.sbs.com.au/news/video/triple-zero-call-was-made-too-late-counterterrorism-expert-tells-bondi-inquest/2raanfv8b",
    "title": "Triple Zero call was made too late, counterterrorism expert tells Bondi inquest",
    "publish_date": "Tue, 20 May 2025 04:12:39 +0000",
    "category": "finance",
    "authors": [],
    "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
    "source": "SBS",
    "cluster_id": 40
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/sbs-news-in-easy-english-20-may-2025/oqd1b42vt",
    "title": "SBS News in Easy English 20 May 2025",
    "publish_date": "Tue, 20 May 2025 03:37:04 +0000",
    "category": "finance",
    "authors": [],
    "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts .\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nI'm Biwa Kwan. This is SBS News in Easy English.\n\n\n\n\n\nThe Nationals and Liberals are ending a 79-year partnership.\n\n\n\n\n\nThe agreement between the two parties was being renegotiated, after the results from the federal election.\n\n\n\n\n\nThe Liberals lost 11 seats in the House of Representatives, while the Nationals lost just one seat.\n\n\n\n\n\nNationals Leader David Littleproud says the two parties have decided to go their separate ways.\n\n\n\n\n\n\"Our party room has got to a position we will not be re-entering a Coalition agreement with the Liberal Party after this election. What we have got to a position is that the National Party will sit alone on a principle basis.\"\n\n\n\n\n\n---\n\n\n\n\n\nThe Vatican says a meeting between Pope Leo the Fourteenth and Australia's Prime Minister has been cordial, with an focus on strengthening bilateral relations.\n\n\n\n\n\nIt is the first time an Australian prime minister has had a private audience with the head of the Catholic Church since 2008.\n\n\n\n\n\nAnthony Albanese says he took the opportunity to formally invite the new pontiff to Australia for a major Catholic conference to be hosted in Sydney in 2028.\n\n\n\n\n\n\"I spoke to him about my mother would be - is I am sure looking down from heaven with the biggest smile she has ever had. The fact that her son was at the inaugural mass of a pope in Vatican. It was quite extraordinary. So for me, it was a very personal moment.\"\n\n\n\n\n\n---\n\n\n\n\n\nForeign Minister Penny Wong has begun a three-country tour of the Pacific.\n\n\n\n\n\nShe is planning to visit Vanuatu, Tonga and Fiji across three days this week.\n\n\n\n\n\nThe UN climate change conference COP31 will be on the agenda.\n\n\n\n\n\nAustralia is hoping to co-host the event with the region next year, with Adelaide proposed as the host city.\n\n\n\n\n\n---\n\n\n\n\n\nA new report, marking World Bee Day, has highlighted emerging threats to their existence.\n\n\n\n\n\nExperts say a decline in bee populations globally will have a huge impact on food security, reducing the quality and quantity of crops, including the micronutrients in food.\n\n\n\n\n\nEcologist Dr Deepa Senapathi - at the University of Reading [[Red-ing]] in the UK - is the co-author of the report.\n\n\n\n\n\nShe has identified the 12 top new threats to bees, including pollution related to plastics, artificial light and antibiotics.\n\n\n\n\n\n\"I think we need stronger policies and regulations. We also can, I think, take advantage of lots of new and emerging technology that can help us monitor pollinator populations. So unless we know what's there and whether it's doing better or worse or at a status quo, unless we have those monitoring initiatives in place, we won't be able to know if something is declining.\"\n\n\n\n\n\n---\n\n\n\n\n\nOscar-winning Australian actress, Nicole Kidman, has been awarded with the 2025 Women in Motion Award at the Cannes Film Festival.\n\n\n\n\n\nMs Kidman was praised for her commitment to supporting female filmmakers, including working with a female director every 18 months since 2017.\n\n\n\n\n\nShe has worked with 27 female directors in eight years as a actor and producer, and was praised for her \"bold\" and \"uncompromising\" storytelling.\n\n\n\n\n\nMs Kidman says she is detemined to continue to support female filmmakers.\n\n\n\n\n\n\"I am very happy to be here in support of women's voices and storytelling - not just directors, but writers, producers, actors, cinematographers - just so that we can start to have more parity.\"\n\n\n\n\n\n---\n\n\n\n\n\nIn cycling, Isaac del Toro says he does not know how long he can hold onto the leader's jersey in the Giro d’Italia.\n\n\n\n\n\nThe 21-year-old has become the first Mexican cyclist to lead the Giro.\n\n\n\n\n\nDel Toro has an overall lead of 1 minute, 13 seconds going into the stage 10.\n\n\n\n\n\nHe says it is incredible to achieve this result in his first time competing in the Giro.\n\n\n\n\n\n\"It's unbelievable for me. It is so difficult to describe. Everyone wants to wear it when they (dream about it) as a child. For me, I want to do it. Now, it's insane. And I cannot describe this feeling now.\"\n\n\n\n",
    "source": "SBS",
    "cluster_id": 42
  },
  {
    "url": "https://www.theage.com.au/culture/tv-and-radio/the-bear-season-four-trailer-jeremy-allen-white-ayo-20250430-p5lvcv.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "The Bear is back with a new season. But will you be watching?",
    "publish_date": "Wed, 21 May 2025 12:01:12 +1000",
    "category": "entertainment",
    "authors": [
      "Meg Watson"
    ],
    "text": "But, while all major cast members have returned – including Jamie Lee Curtis, as Carmy’s mum Donna – we’ll have to wait and see if viewers do the same. After two seasons of effusive praise for this star-making FX hit, last year’s third instalment left many fans cold, saddled with criticisms of being “aimless” and “undercooked” , and ultimately landing with an audience score of just 51 per cent on Rotten Tomatoes (compared to previous seasons’ scores in the nineties). Can season four reignite our passion?\n\nWelcome back, cousin. We’re about to get another serving of The Bear. The trailer for season four of the Emmy award-winning comedy/drama has just dropped featuring all the gang – there’s Carmy (Jeremy Allen White) obsessing about the beauty of culinary excellence, Sydney (Ayo Edebiri) trying to drag him back to reality, and Natalie, aka Sugar (Abby Elliott), adjusting to life with her new baby.\n\nSeason three ended on a cliffhanger, as Carmy gets a Google alert for The Chicago Tribune’s review of his restaurant. A collection of words flash on the screen – confusing, excellent, brilliant, sloppy, complex, simple, stale, talent – before the beleaguered chef utters one more: “Motherf---er”.\n\nLoading\n\nMeanwhile, Syd has just excused herself from partying with all her hospo mates to hyperventilate in a stairwell. Carmy’s increasingly erratic behaviour has been dragging her down, and she’s now been thrown a lifeline in the form of a position as chef de cuisine at Chef Adam’s (Adam Shapiro) new restaurant. What’s stopping her? All the happy smiley faces, her chosen family, wooping to ’90s bangers in the next room.\n\nFor all the criticism season three faced for being too slow or self-indulgent – that final episode also featured a parade of real-life chefs waxing lyrical about the “controlled chaos” of the kitchen around a dinner table – the season did have standout episodes.\n\nNapkins, which was also Edebiri’s directorial debut, offered a rich and unvarnished throwback to how middle-aged mum Tina (Liza Colon-Zayas) came to work at The Bear after struggling to find a job following lay-offs. And Ice Chips, an emotional two-hander between Sugar (Elliott) and her dysfunctional mother Donna (Curtis) during labour, was another highlight that was described by some critics as “quietly radical” – particularly by those who have experienced birth and motherhood.",
    "source": "TheAge",
    "cluster_id": 22
  },
  {
    "url": "https://www.theage.com.au/sport/swimming/james-magnussen-s-wild-doping-experiment-and-the-birth-of-the-enhanced-games-20250520-p5m0qn.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "James Magnussen’s wild doping experiment and the birth of the Enhanced Games",
    "publish_date": "Wed, 21 May 2025 12:00:04 +1000",
    "category": "sports",
    "authors": [
      "Tom Decent"
    ],
    "text": "Save Log in , register or subscribe to save articles for later. Save articles for later Add articles to your saved list and come back to them any time. Got it Normal text size Larger text size Very large text size James Magnussen spent an entire swimming career fighting for clean sport and despising drug cheats. It’s why it’s hard to fathom the words motoring out of his mouth in an interview with this masthead in the week before he flew out to Las Vegas for the worldwide launch of the Enhanced Games on Wednesday (Thursday morning Australian time). “The first time you stick a needle of testosterone in your butt, you have to do it in the muscle at the top just above your undie line,” Magnussen explained with a laugh. “I never thought I’d be sticking a needle with testosterone into my bum at any point in my life.” Magnussen, the Australian Olympian who famously fell short of winning a gold medal in the 100m freestyle by one hundredth of a second at the London 2012 Olympics, is the face of the Enhanced Games. The controversial, privately funded event has been dubbed the “Steroid Olympics”. Magnussen, 34, has been on whirlwind doping journey since February last year, when he made the bombshell claim he would consider signing up as the Enhanced Games’ first athlete … if the price was right.\n\nAdvertisement\n\nAll with the assistance of performance-enhancing drugs. Although many things didn’t go to plan, the polarising Australian is ready to divulge the inside story of a stunning ploy to take substances in the pursuit of unprecedented human achievement. “It was pretty wild,” Magnussen said. “I mean, nothing really is out of the norm for me.” Australian Olympian James Magnussen features in a new Enhanced Games documentary. Credit: Enhanced Games From clean champion to Enhanced Games frontman “If they came to the party with $1 million for the [50m freestyle] world record, I would 100 per cent do it.” With that quote in February, after initially floating his interest in the Enhanced Games on the Hello Sport Podcast, the “Missile” was off and away, despite being retired since 2019.\n\nAdvertisement\n\nThings moved quickly. Enhanced Games founder Aron de Souza, also an Australian, confirmed he wanted Magnussen to be the “star” of a new venture, which would encourage athletes to take performance-enhancing drugs and compete against each other for prizemoney. De Souza agreed that if Magnussen could break the 50m freestyle world record he would win $US1 million ($1.56 million). Contracts and confidentiality agreements were signed as a documentary crew prepared to follow Magnussen’s every move ahead of his journey to the US. Understandably, there was scepticism. Magnussen certainly had a good time at the Olympics in Paris last year – he didn’t mind a drink at local French watering holes – while juggling media commitments with News Corp. Australian James Magnussen features in the new Enhanced Games documentary. Credit: Enhanced Games When Magnussen returned to Australia, he found it difficult to find pools to train in. “I can’t train with any squads or registered coaches,” Magnussen said. “You also can’t dive off the blocks in pools in Sydney.\n\nAdvertisement\n\n“If you don’t have a coach keeping you on track and doing programs, getting times, keeping an eye on stroke rates … you’re very isolated. I was of the opinion that under those circumstances, I wasn’t going to be able to do a proper preparation. That’s why I linked up with Hawkey [former Australian Olympic swimmer Brett Hawke]. He’s not connected to any clubs or colleges.” After some initial medical testing, Magnussen flew to the US in October and shared an Airbnb with his strength-and-conditioning trainer Dan Malmberg. Under the guidance of respected Australian coach and Olympian Hawke, who mentored 50m freestyle world record holder Cesar Cielo, the trio got to work. Again, the issue of pools was a problem. “We had to turn our training to a public pool that is in my complex,” Hawke said. “It was a four-lane 25-yard pool that was heated. We did that for three months. “The enhancements were working. He was getting stronger and faster in the pool.” James Magnussen after taking performance-enhancing substances. Credit: Enhanced Games\n\nAdvertisement\n\nThe drugs and the dilemma All of Magnussen’s performance-enhancing drugs were administered by medical professionals, who continually monitored his preparation. Athletes at the Enhanced Games are not obliged to publicly disclose what drugs they have taken, but Magnussen is more than happy to go on the record. “I’m definitely allowed to say that I was taking peptides and testosterone, which is pretty much it to be honest,” he said. “We tried a few different things on top of that. “We used BPC-157, CJC-1295, Ipamorelin and Thymosin. The BPC-157 and Thymosin is for recovery and to prevent injuries. It promotes healing in the body. The CJC and Ipamorelin enhances your body’s natural production of growth hormone. You’re not injecting growth hormone into you. You’re maximising your body’s own potential. “The testosterone is the superpower. That’s what gets you bounding out of bed in the morning, lifting massive weights and feeling your best.” Was there any trepidation?\n\nAdvertisement",
    "source": "TheAge",
    "cluster_id": 23
  },
  {
    "url": "https://www.theage.com.au/culture/books/a-haunting-memoir-of-a-broken-girl-saved-by-rock-and-roll-20250520-p5m0pw.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "A haunting memoir of a broken girl saved by rock and roll",
    "publish_date": "Wed, 21 May 2025 12:00:00 +1000",
    "category": "entertainment",
    "authors": [
      "Michael Dwyer"
    ],
    "text": "MEMOIR\n\nThe Harder I Fight The More I Love You: A Memoir\n\nNeko Case\n\nHachette, $34.99\n\nI’m a tiny bit miffed with Neko Case right now. When we spoke about her Hell-On album in 2018, she rather gallantly mentioned her respect for music writers. “I don’t envy your job,” she said. “Coming up with ways to describe music? That’s hard. I’d just say everything was ‘awesome’.” Naw shucks, etc.\n\nNow, it turns out, she writes about music as brilliantly as she makes it. “Gramma would sing along in the proper ‘barely louder than your breath’ lady volume,” she tells us in one childhood car-seat memory. “It sounded just like the last three Certs candies from the bottom of a purse tasted, like the last candy on earth.”\n\nLater, a rock-club epiphany goes like this: “They tapped into some feral vein that ran to the centre of the earth, like a stick of dynamite that could control how much it exploded while still preserving its sweating cylinder … something unlocked for me that day … making music could become a physical manifestation of the blazing wild horse energy inside of my body.”",
    "source": "TheAge",
    "cluster_id": 24
  },
  {
    "url": "https://www.theage.com.au/business/companies/elon-musk-bows-out-of-politics-to-try-to-rescue-tesla-20250521-p5m0xl.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Elon Musk bows out of politics to try to rescue Tesla",
    "publish_date": "Wed, 21 May 2025 11:57:57 +1000",
    "category": "finance",
    "authors": [
      "Stephen Bartholomeusz"
    ],
    "text": "He also said Tesla’s sales had turned around after a disastrous first quarter. In the three months to the end of March, Tesla reported a 13 per cent fall in deliveries of its vehicles, a 20 per cent drop in revenue from auto sales, and a 71 per cent fall in net income. Musk’s close relationship with Trump, his controversial role in the administration and his support for far right political groups in Europe have seen a collapse in Tesla’s sales in Europe and elsewhere. Tesla needs more of Musk’s attention. Credit: Bloomberg In the March quarter they were down 62 per cent in Germany, for instance, and by a similar amount in Europe. In China, they fell 20 per cent and in its key American market, California, its market share in EVs slumped from 56 per cent to per cent.\n\nTesla dealerships have attracted protests, Teslas have been set on fire and Tesla owners have taken to using anti-Musk bumper stickers to distance themselves from his political activities. Musk said sales were “doing well” and that “it’s already turning around” amid a major rebound in demand and that he didn’t anticipate any major shortfall in sales this year, although he conceded that Europe remained the company’s weakest region. Loading He pushed back at suggestions that he has damaged the Tesla brand, arguing that while it might be losing sales on the political left it has gained them on the right. The numbers say that he has lost a lot more than he has gained. Tesla needs more of his attention. Separate to the impact on its brand of Musk’s political activities is the fact that, while its Chinese competitors are churning out new models almost, it seems, on a daily basis, Tesla’s only new vehicle in the past five years has been the Cybertruck, which has been less than successful.\n\nTesla has an unsold inventory of about 10,000 of those controversial vehicles, worth about $US800 million. One-year-old Cybertrucks with less than 10,000 kilometres on their odometers have seen their value crash 35 per cent. Musk is betting Tesla’s future on autonomous vehicles and robotics, with a handful of his robotaxis scheduled to operating in Austin, Texas, by the end of June. He says there will probably be a thousand of the self-driving EVs on US roads within a few months and hundreds of thousands by the end of next year. Musk has, however, been making a similar prediction for the best part of a decade, conceding last year that he has been “overly optimistic” in the past. Tesla’s $US1.1 trillion market value is dependent on Musk realising his vision for robotaxis and robotics. It would be worth a fraction of that amount if that vision isn’t realised. Musk must ask himself on occasion whether the $US250 million-plus that he spent helping to get Trump re-elected and his role in DOGE has been worth it, given the damage done to Tesla.\n\nHe has made no secret of his opposition to Trump’s trade wars, which will also harm the company. Tesla imports batteries from China and other components from Mexico. DOGE has also been far less successful than he promised. At the outset, Musk claimed he could cut $US2 trillion from government spending. He later reduced the target to $US1 trillion. Now, it seems, $US160 billion is about as much as can be achieved. DOGE claims to have reduced spending by $US170 billion, but numerous analyses of the list of cuts it posts on its website have demonstrated that the list is riddled with errors. It claims credit for contracts that had already expired or had been cancelled before DOGE was created. There’s double-counting, the confusing of one-off savings or cash inflows from asset sales with recurrent savings.\n\nThe “savings” so far represent about 0.2 per cent of last year’s US government spending. They are immaterial. DOGE has, however, created chaos within the federal bureaucracy with its mass sackings and subsequent reinstatements. It has spawned dozens of legal challenges and created tension within Trump’s cabinet, where the cabinet secretaries resent the Musk team’s intrusions into their portfolios. Musk must ask himself on occasion whether the $US250 million-plus that he spent helping to get Trump re-elected and his role in DOGE has been worth it, given the damage done to Tesla. Whether it has been effective at all won’t be known for some time, when the longer-term effects of the loss of expertise and capabilities become clearer. DOGE has, for instance, sacked thousands of Internal revenue Service employees – more than 10 per cent of its employees so far, with plans to cut numbers by 40 per cent this year. The cuts include nearly a third of the IRS tax auditors.\n\nThe Yale Budget Lab has estimated that the cuts could cost the US $US323 billion of revenue over the next decade. It is estimated that every $US1 spent on auditing the top 0.1 per cent of earners generates a return of about $US26 of increased revenue. Loading The disregard for the longer-term effects of the assault on the IRS fits with the way DOGE has operated. It has created havoc within key government agencies without regard for the consequences and often, it seems, with little understand of how the agencies operate or of the work they do. (DOGE sacked staff at the Energy Department, including 500 at the National Nuclear Security Administration, without realising they were responsible for the safety and security of America’s nuclear weapons and then had to scramble to try to rehire them). While the way DOGE has operated fits with the Silicon Valley mantra of “move fast and break things,” there’s no sense that DOGE is working to any plan other than to slash and burn, indiscriminately, whatever it can. The DOGE team is now embedded within US agencies so, regardless of whether Musk retains some role, it will continue to create chaos and dysfunction for little meaningful return.",
    "source": "TheAge",
    "cluster_id": 25
  },
  {
    "url": "https://www.theage.com.au/lifestyle/official-teaser-for-the-hunger-games-sunrise-on-the-reaping-movie-20250521-p5m110.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Official teaser for The Hunger Games: Sunrise on the Reaping movie",
    "publish_date": "Wed, 21 May 2025 11:54:08 +1000",
    "category": "lifestyle",
    "authors": [],
    "text": "Official teaser for The Hunger Games: Sunrise on the Reaping movie\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later. Dismiss\n\nOur network\n\nOpen Navigation Menu The Age",
    "source": "TheAge",
    "cluster_id": 26
  },
  {
    "url": "https://www.theage.com.au/sport/nrl/how-tenacious-toia-defied-three-years-of-pain-to-achieve-maroons-dream-20250520-p5m0m3.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Why Origin champion knows Maroons rookie can thwart Latrell Mitchell",
    "publish_date": "Wed, 21 May 2025 11:53:14 +1000",
    "category": "sports",
    "authors": [
      "Nick Wright"
    ],
    "text": "Save Log in , register or subscribe to save articles for later. Save articles for later Add articles to your saved list and come back to them any time. Got it Normal text size Larger text size Very large text size This is a tale of perseverance and defiance, when the world seemed to scream at Robert Toia to cast aside his NRL dreams. Few would have begrudged the talented centre from pursuing other avenues, amid an injury carnage that threatened to end his career before it began. But that was never an option for Toia, who thwarted two ruptured ACLs and suffered a serious back injury and a broken jaw before making his Sydney Roosters debut. As he stands on Suncorp Stadium’s hallowed turf, soaking in his ascension to the State of Origin arena, the 20-year-old reflects on those who got him here. “I’d be lying if I said there wasn’t any doubt, but just the support from my family and the club – their support was through the roof every time, and just the assurance they gave,” Toia says. Robert Toia announced himself as a future Queensland Maroons star in Magic Round. Credit: Getty Images “I can’t thank them enough for their loyalty. Despite what other people have said about the club, the club have had my back since day one.\n\nAdvertisement\n\n“It just doesn’t feel real [that I’m playing State of Origin]. I was in disbelief, and even now, I still don’t think it’s real.” Loading After just 10 games, Toia’s answering of Queensland coach Billy Slater’s SOS puts him alongside Payne Haas as the least-experienced Origin player in the NRL era. The call was far from expected, one he thought was a prank but that eventually left him “speechless” and in “total disbelief”. It has been a remarkable rise from his past agony, having stuck with the Roosters despite advances from Wayne Bennett and the Dolphins to keep his hopes of emulating Greg Inglis’ Origin feats alive. Rugby union could have even been on the cards, having gone through Nudgee College’s First XV program as one of their most prolific centres. “Rugby league was always what I was going to do. Ever since I was young, I always wanted to be an NRL player,” Toia says.\n\nAdvertisement\n\n“[But] I feel like they [Nudgee] moulded me as a person in a way, and taught me core beliefs and values, and I definitely am the man I am today because of them.” Signs that Toia – described as “world-class” by Slater – was more than just a supremely gifted player were on show throughout his three years recovering from a gamut of challenges. His Roosters, and now Maroons, teammate Lindsay Collins watched as the then-teenager spent day after day away from the main group trying to one day rejoin them. Robert Toia joins Payne Haas as the least experienced player to make his State of Origin debut in the NRL era. Credit: NRL Photos Collins, a veteran of 12 Origin caps who tore his ACL in 2021, says the challenges of the rehabilitation phase are difficult to explain. “I don’t think many people would understand that time in your life; it’s pretty hard to make a scenario similar to that sort of thing,” Collins tells this masthead. “To leave school, move down to Sydney away from your family, and then have back-to-back ACLs ... a lot of players at that age would have questioned a lot of things.\n\nAdvertisement\n\nLoading “Bobby is pretty quiet, he sort of keeps to himself, but he’s always working – especially his arms, he loves doing biceps. “The boys inside the four walls of the Roosters knew what he was capable of, it was just whether he was going to get back or not. It gives me goosebumps just thinking about it, the perseverance he’s had just to stick it out.” It is that strength of character that has caught Slater’s eye. And Toia will need to dig into every bit of mental fortitude he developed while away from the game, as he plots a boilover of New South Wales superstar Latrell Mitchell. “Character is really important – that’s what you’re going to lean on when you get tired. You can’t go to Coles and buy that, you’ve got to go through it.” Billy Slater on Robert Toia He admits to being starstruck at the prospect of facing Mitchell, having “looked up to him for a while”.\n\nAdvertisement",
    "source": "TheAge",
    "cluster_id": 27
  },
  {
    "url": "https://www.theage.com.au/national/nsw/good-food-good-craic-as-bestselling-author-marian-keyes-gets-real-20250519-p5m0kb.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Good food, good craic as bestselling author Marian Keyes gets real",
    "publish_date": "Wed, 21 May 2025 11:51:43 +1000",
    "category": "finance",
    "authors": [
      "Margot Saville"
    ],
    "text": "“I never saw any reason to hide it. I kind of thought, well, I was a 30-year-old woman and I was educated and I was middle class and all of those things,” she says. “So if it could happen to me, it was probably happening to an awful lot of other people and if it’s not been spoken about, nobody can get help.” Vegetarian amuse bouche. Credit: Thomas Wielecki After Keyes came out of rehab, she wrote her first novel, Watermelon. She has stayed sober and written books – all bestsellers – ever since. Life seemed good but, in 2009, completely out of the blue, the author experienced the onset of a debilitating four-year depression during which she barely got out of bed and suffered ongoing suicidal tendencies. It eventually lifted, which she attributes to time and the support of her loved ones. And hormone replacement therapy! Nothing is off the table at a Marian Keyes lunch. I asked her if she thought it was a great comfort to readers going through tough times to read about someone similarly afflicted and know they’re not alone. She agreed. “Every single one of us on earth, we think that bad things only happen to other people. It’s a survival technique – but sooner or later, the terrible thing happens to us,” she says.\n\nKeyes’ latest book My Favourite Mistake. “You know, the spotlight of doom is above our head. There’s such an endless list of awful ways for your life to be unbended. But most things are survivable; you can, you will be happy again. You can be happy again, in a different way. We can never go back to the person we were before the terrible thing. Back to your old self isn’t really possible in big trauma, I think, but you’re still there.” One of the things Keyes discovered, after the darkness had lifted, was her capacity for resilience. “We only really discover the resilience when it’s required, but we’re given it at terrible times or difficult times, I think. Whatever loss there is, that kind of muscle of resilience is still available to us, maybe in a different form. We are stronger than we know, but it doesn’t mean it’s going to be pleasant. Feeling resilient doesn’t mean that you’re feeling good. No, in the storm, it means you’re surviving.” Keyes is prolific on social media; her Instagram feed is a riot and includes candid photos of her family: mother (“Old Vumman”), four siblings and several nieces and nephews. They are a close family. Keyes and her husband Tony Baines (“Himself”) have been married for 29 years. Earlier this year, she spoke about their inability to have children, saying she was at peace with it.\n\nThe bill for lunch at Sails at Lavender Bay. “We’re fine now, you know, we’re grand,” she said. “I also felt like ... I’d been given so much by the universe, like I was given the ability to stop drinking alcoholically, and then I met this lovely man who was really, really nice to me, and then I got a job doing something that I was able to do when people were willing to kind of pay me for it. And I just think I thought, like nobody gets everything. “But I feel like some kind of grace was afforded to me and my husband and we were just able to go, ‘Let’s focus on what we have rather than what we haven’t.’ You get what you get, and this is what I’ve got. And I’m absolutely grateful for my life.” We’ve been talking so much that we’ve hardly touched the food, which is light and delicious. The sun is refusing to come out. But I’m so engrossed in our conversation, which ranges from mental illness to lip liner, I stop noticing. Keyes revealed that she has become addicted to online personality quizzes – in particular, about the diagnosis du jour, ADHD. And after watching Andrew Scott in Ripley, she did several quizzes titled, “Am I a psychopath?” (The answer was no.)\n\n“I am very much self-diagnosed as (someone with ADHD). I’ve met a lovely woman who says she will diagnose it with a test. And I’m so scattered that I haven’t got it together to go and do it – the proof is already there. I don’t even need to do the test. If I’m too scatty to actually get it together to do it I should already be getting my green tick.” I asked her about My Favourite Mistake, which features a 48-year-old woman called Anna Walsh. At the start of the story, she jettisons her relationship, her job and her entire life in New York to go back to Ireland, without a plan of action. We discussed the phenomenon of older women increasingly deciding to upend their lives to run away and experience life on their own terms. When Keyes turned 60, she didn’t run away but blocked out a year to pause her writing and go back to university to study design. “The older I get, the more I realise that you can start again at any stage,” she says. “Last year, I took a year off and I went back to college, just to do something that I had always wanted to do. And I think with better health care and longer life expectancy, women are far more vocal about what they expect from their lives than they used to be. Keyes says “feeling resilient doesn’t mean that you’re feeling good. No, in the storm, it means you’re surviving.” Credit: Thomas Wielecki\n\n“I do think burnout is very real. Anna doesn’t have children, but I often see it when the children are grown, the children have gone to university, that’s it, and women are deciding, this is my time and I’m going to do all the things that I wanted to do when I was told I had to be doing other things. And I love it.” Lunch passed in a rush and Keyes’ minder arrived to whisk her away. I stepped outside, suffused with the contentment you feel after a meal of good food and great “craic”, in Irish terms. Turning to take in one of the world’s iconic views, I spotted a patch of blue. Like a Keyes novel – the clouds part, and the light returns. Marian Keyes is appearing at a Sydney Writers’ Festival event at the Sydney Town Hall at 8pm today. Stan is owned by Nine which also owns this masthead. If you or anyone you know needs help, call Lifeline on 13 11 14 (and see lifeline.org.au).",
    "source": "TheAge",
    "cluster_id": 28
  },
  {
    "url": "https://www.theage.com.au/lifestyle/life-and-relationships/real-straight-shooter-lady-chu-s-founder-is-famously-brusque-she-has-her-reasons-20250507-p5lxf1.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "‘Real straight-shooter’: Lady Chu’s founder is famously brusque. She has her reasons",
    "publish_date": "Wed, 21 May 2025 11:50:00 +1000",
    "category": "lifestyle",
    "authors": [
      "Sue Williams"
    ],
    "text": "Save Log in , register or subscribe to save articles for later. Save articles for later Add articles to your saved list and come back to them any time. Got it Normal text size Larger text size Very large text size The first time I meet Vietnamese food dynamo Nahji Chu, I mention, apologetically, that I’m in a bit of a hurry as I have theatre tickets. She’s unmoved. “If you don’t have time, then don’t come here,” she says, airily, snatching the menu back off her restaurant table. “This isn’t a fast-food outlet.” A lot of people in hospitality would probably love to serve up similar home truths to their demanding customers. The difference with Chu is that she actually does. As the head of the MissChu empire that once included a catering business and a series of nine restaurant-tuckshops in Sydney, Melbourne and London, the “rice-paper-roll queen” could afford to be direct. But even now, after that company crashed spectacularly, and she was forced to start again from scratch, she is no less blunt. Along the way, the diminutive figure with the over-sized personality has become loathed by some but, in truth, loved by many more. And even those who don’t admire her style adore her food. With her Lady Chu restaurant expanding rapidly to colonise most of a Potts Point side street at Sydney’s Kings Cross, it’s hard to deny her entrepreneurial flair and culinary genius. But at the same time, she’s also extremely skilled at making enemies. Very recently, when City of Sydney rangers demanded, mid-service, that she move some restaurant planters they said were obstructing the footpath, she let fly a foul-mouthed rant against both them and the anonymous complainants who had brought them to the scene. “I’m just trying to make Australia a better place for everyone,” she told Good Weekend. “I think we’ve lost our way with ridiculous laws in hospitality and, if I have to go to jail to fight them, I will.” It’s that brusque manner that sees her regularly branded an Australian Basil Fawlty or our version of Seinfeld’s outrageous Soup Nazi – impatient, dismissive and belligerent. “She’s been called so many names over the years,” says Warren Fahey, musician, cultural historian and former chair of the Potts Point Business Group. “The Dragon Lady, Nazi Nahji … but, really, she’s extraordinarily generous and can be very welcoming. She’s a force to be reckoned with. Instead of knocking politely on doors, she knocks them down and rides straight through the red tape.” Vietnamese-Laotian Chu, 55, who was given asylum in Australia in 1978, knows she has a reputation for being pushy and terse to the point of rudeness to some of her customers, but she’s unapologetic. Sometimes, she thinks, people deliberately wind her up just to see her in full flight. “I’m not like that all the time, but because I have that reputation, people coerce it out of me. They want that. It’s a little bit like when someone is grinding metal and the sparks are flying, you’re meant to look away and put some protective sunglasses on. But with me, people go, ‘Let’s grind the metal and all watch.’ ”\n\nAdvertisement\n\nLady Chu’s signature Peking duck pancakes and rice paper rolls. Credit: Louie Douvis Roslyn Street is a backwater off the main Kings Cross drag of Darlinghurst Road, or it used to be before Chu took over a lease of one empty shopfront in 2020 during COVID-19, and then another, and another, until she, these days, has five shops in a row. Now, from Wednesday to Sunday each week, the pavement is transformed into an alfresco 90-seat restaurant with white-clothed tables, sofas, parasols, candles and huge pot plants festooned with fairy lights. Locals have dubbed it Rue de Chu. Chu thinks of it like Monopoly, with her own Mayfair being the Gaudi-inspired building on the end that once housed fine-diners Gastro Park and Metisse, where she can now operate her commercial kitchen. Her get-out-of-jail card, she says, is the tens of thousands of dollars she says she’s paid the City of Sydney in fees and fines for putting tables – and pot plants – where she’s not allowed. “She’s a real straight-shooter,” says film producer Rebel Penfold-Russell, who first met Chu when she catered a charity event. “But I wouldn’t like to stand in front of her! She works so hard, though, and is incredibly generous and great fun.” Every working day, Chu’s there on the frontline, as executive chef, restaurant manager and maître d’, taking bookings, seating people (or not), writing down orders, supervising the kitchen, doing the accounts and the marketing. “I’m doing at least three jobs at once,” she says, as the orders flood in for her signature tiger prawn and green mango rice paper rolls, her roast suckling pig banh mi, her Peking duck pancakes and rich and spicy beef and pork soup, bún bò Hue. “What comes out of that is my efficiency, which comes off as being quite abrupt. Loading “But when did you ever see Kylie Kwong seating people? When was the last time you got seated by Justin Hemmes? When you come to Lady Chu, I’m the one who’s there, doing it all. And that comes with me yelling sometimes. But it comes more from a place of efficiency than anything else.” In 1975, after the Laotian civil war was won by the Communist Pathet Lao, Chu’s mother and four of her siblings vanished overnight. A few months later, her father took her and her remaining brother on a stealthy nighttime crossing of the Mekong river to Thailand, daubing them in mud so they wouldn’t be seen. Just as they reached the Thai side, however, they were caught and thrown into a Thai jail cell with 40 other prisoners. They stayed there for three months, Chu suffering a bout of TB, until her father was able to bribe the guards to free them using hidden silver bars from Laos’ heroin trade. When they reached a Thai refugee camp, they were met by a miracle. “On the first day, standing in the distance, was my mother!” Chu says. “So I was reunited with her and my other brothers and sisters and aunty, and from then on, we always stayed together as a family.”\n\nAdvertisement\n\nIn her aunt’s makeshift cafe in a Thai refugee camp in 1977 (Chu fourth from left, her aunt Yen and mum at left.) Credit: Courtesy of Nahji Chu After three years being shuffled around camps and eking out a living growing vegetables and selling Vietnamese pho, in March 1978, they were flown to Australia and arrived at the migrant hostel in Villawood, in Sydney’s south-west. Chu was thrilled. “There was a tap for water, and I had my own bed,” she says. “But the food was terrible. Tip Top bread and butter that you ate with sugar on, and cereal out of cardboard boxes. We’d never seen anything like it. And school was brutal. The Australian children used to taunt us and bully us, there was so much racism.” Five months on, the family was sent to the NSW Hunter Valley to work on a chicken farm in Cessnock. After the mandatory year, the family piled into their old Ford Falcon 500 station wagon to drive to Melbourne, where Chu’s aunt was running a black-market noodle shop in her home. They moved into a house in Richmond, where neighbours were amazed they kept and killed their own chickens. Chu’s family were similarly alarmed at and disgusted by frozen chickens in supermarkets. Quitting university early, Chu worked in fashion, where she helped dress Kylie Minogue in her famous leather jacket for the movie The Delinquents. Later, she studied marketing and journalism, then worked for small-bar entrepreneur Vernon Chalker, becoming his catering manager, and later James Orloff in his business BITE, modelled on the UK’s Pret A Manger.\n\nBurnt out by hospitality at 34, she found a job in banking and was promoted to a post in Sydney in 2004. There, she was surprised to find long lunchtime queues at takeaways but no Vietnamese food on offer. The next step was obvious: she had learnt to cook from her grandmother, who once rattled pans for the king of Laos, and she knew about catering. She quit her job, sold some art to raise cash, and in 2007, MissChu was born in a Darlinghurst back street. Loading The MissChu fax machine was instantly jammed with orders, so Chu started using email and organised a team of e-bike riders to deliver her rice paper rolls, dumplings and Peking duck pancakes. “It was way before Uber Eats started,” says Chu, who used her photo on her refugee visa as her logo. “I was the first person in Australia to do something like that. I knew this business was my calling. I could be fast and supply good, healthy food. It was an instant success.” Expansion was rapid, with five outlets in Sydney, two in Melbourne, and one in London, a total staff of 280 and an annual turnover of $25 million. By 2014, she was planning more outlets and having talks with a franchise company which had worked with restaurateur Bill Granger to globalise her business, incorporating streetwear and a TV show. She became the poster child for refugee chic and a champion of Vietnamese culture.\n\nAdvertisement",
    "source": "TheAge",
    "cluster_id": 29
  },
  {
    "url": "https://www.theage.com.au/national/taree-woman-rescued-from-home-20250521-p5m10r.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Taree woman rescued from home",
    "publish_date": "Wed, 21 May 2025 11:45:59 +1000",
    "category": "finance",
    "authors": [],
    "text": "Taree woman rescued from home\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 30
  },
  {
    "url": "https://www.theage.com.au/sport/nrl/wests-tigers-to-grant-galvin-permission-to-negotiate-with-rival-clubs-20250519-p5m0cd.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Wests Tigers to grant Galvin permission to negotiate with rival clubs",
    "publish_date": "Wed, 21 May 2025 11:45:33 +1000",
    "category": "sports",
    "authors": [
      "Michael Chammas",
      "Danny Weidler"
    ],
    "text": "The Wests Tigers are poised to grant Lachlan Galvin permission to negotiate with rival clubs after a board meeting on Monday.\n\nThe Tigers will grant Galvin permission to open negotiations with prospective teams before the November 1 free agency date, but with conditions.\n\nSources with knowledge of the situation talking on the condition of anonymity due to confidentiality told the Sydney Morning Herald one of those conditions will be reconsidering the legal case against the club following allegations of bullying against Galvin.\n\nThe other condition set to be put on any formal permission to negotiate with rival teams will be an agreed transfer fee which is still being determined.",
    "source": "TheAge",
    "cluster_id": 31
  },
  {
    "url": "https://www.theage.com.au/sport/nrl/injured-star-haas-sits-out-opening-blues-training-session-20250520-p5m0sz.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Injured star Haas sits out opening Blues training session",
    "publish_date": "Wed, 21 May 2025 11:43:49 +1000",
    "category": "sports",
    "authors": [
      "Adrian Proszenko"
    ],
    "text": "Payne Haas did not participate in NSW’s first full training session on Wednesday as officials took a cautious approach with their star forward.\n\nHaas is nursing a quad strain that he suffered in Brisbane’s loss to the Dragons on Sunday. The star front-rower watched on as his Blues teammates trained in the rain on the fields of the Blue Mountains Grammar School at Wentworth Falls on Wednesday morning. Stephen Crichton, who has been troubled by a groin strain, took part in the training session.\n\nWhile the fields prepared for the Blues are kept in pristine condition, recent downpours made them wet and slippery underfoot. The Blues chose not to risk Haas so early in their preparation, and are likely to give him until the weekend, if required, to prove his fitness.\n\nHaas cut a forlorn figure on the sidelines as Laurie Daley’s men were put through their paces. At times he conferred with Gilbert Enoka – the leadership management and mental skills coach for the All Blacks – who was part of last year’s Blues campaign under previous coach Michael Maguire.",
    "source": "TheAge",
    "cluster_id": 32
  },
  {
    "url": "https://www.theage.com.au/sport/bryson-dechambeau-wants-a-golf-ball-that-flies-straighter-his-nerds-are-working-on-it-20250520-p5m0la.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Bryson DeChambeau wants ‘a golf ball that flies straighter’. His nerds are working on it",
    "publish_date": "Wed, 21 May 2025 11:40:00 +1000",
    "category": "sports",
    "authors": [
      "James Corrigan"
    ],
    "text": "As Scottie Scheffler’s rivals left North Carolina considering how they can possibly deny the world No 1 further major victories this season, it was perhaps no surprise to hear “The Mad Scientist” sounding the most confident of discovering the secret.\n\nHowever, Bryson DeChambeau’s “trick up my sleeve” of which he boasted is not as highbrow as one might think and is instead simply the wish of anybody who has ever picked up a club – hacker or superstar alike.\n\n“What I really think needs to happen is to get a golf ball that flies straighter,” he said. Sign us all up for that, Bryson.\n\nDeChambeau recognises that he and his suppliers have only three weeks to meet his demanding order before the year’s third major at Oakmont, but the 31-year-old is adamant it can be achieved. “I’m going to be working my butt off to bring it for the US Open, but I’ve got to get some equipment here soon,” he said. “It’s all up to manufacturing.”\n\nOf course, there will be accusations of a workman blaming his tools, but, again, DeChambeau is perhaps merely summing up the feelings of many frustrated golfers in this regard. In fairness to the American, he does have science in his corner and, as the player who hits the ball hardest and highest, his Titleist ProV1x Left Dash is affected more than his fellow pros.",
    "source": "TheAge",
    "cluster_id": 33
  },
  {
    "url": "https://www.theage.com.au/lifestyle/fashion/princess-catherine-spreads-the-kate-effect-in-butter-yellow-20250521-p5m0vu.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Princess Catherine spreads ‘the Kate effect’ in butter yellow",
    "publish_date": "Wed, 21 May 2025 11:30:59 +1000",
    "category": "lifestyle",
    "authors": [
      "Damien Woolnough"
    ],
    "text": "If the plan for Princess Catherine’s return to royal duties was to steer attention away from her clothing, things couldn’t be worse.\n\nHosting a royal garden party at Buckingham Palace with Prince William, the Duke and Duchess of Edinburgh, Princess Eugenie and Zara Tindall for 8000 guests, Catherine was on trend in a butter yellow dress from New Zealand designer Emilia Wickstead, with a matching hat by Irish milliner Philip Treacy.\n\nThe outfit was last worn by Catherine in 2022, at the Platinum Jubilee celebrations for Queen Elizabeth II, further demonstrating her status as an early adopter of key trends. Butter yellow was spread across collections last week in Sydney at Australian Fashion Week with Aje, Gary Bigeni and Nicol & Ford.\n\nPrincess Catherine in an Emilia Wickstead dress and Philip Treacy hat at Buckingham Palace for a garden party. Credit: Getty Images\n\nAt the spring 2025 international ready-to-wear shows, Chanel, Jacquemus, Zimmermann and Chloe all made liberal use of buttery yellow, which was named by interior designers Timothy Corrigan, Heidi Callier and Robin Standefer as the colour of 2025 in Vogue’s annual interior design trend report.",
    "source": "TheAge",
    "cluster_id": 34
  },
  {
    "url": "https://www.theage.com.au/sport/soccer/i-m-not-a-clown-mate-why-winning-the-europa-league-would-be-postecoglou-s-biggest-achievement-20250519-p5m0dt.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "‘I’m not a clown, mate’: Why winning the Europa League would be Postecoglou’s biggest achievement",
    "publish_date": "Wed, 21 May 2025 11:30:00 +1000",
    "category": "sports",
    "authors": [
      "Vince Rugari"
    ],
    "text": "“I’m really disappointed that you would use such terminology about a person who for 26 years without any favours from anyone has worked his way to a position where he’s leading out a club in a European major competition [final]. For you to suggest that somehow us not being successful means that I’m a clown … not really sure how to answer that question.” Spurs and United: similar, but different Postecoglou and his Manchester United counterpart, Ruben Amorim, are walking parallel paths. Each are trying to restore identity and pride to clubs haunted by their own mythology. Both are in charge of institutions that still see themselves as “big clubs″⁣, even if recent history suggests otherwise. Tottenham and Manchester United have become relics of their former selves, but in very different ways. Spurs are starved of silverware and defined by a reputation for self-sabotage. United are bloated by expectation, yet bereft of structure. Both clubs are stuck between what they used to be and what they are trying to become. Ange Postecoglou and Ruben Amorim. Credit: Getty Images\n\nBoth managers are dealing with fan bases that say they want a rebuild, but recoil at the grim reality of one. Patience is contingent upon results. Faith erodes with each defeat. In the Premier League, both clubs have endured historically bad seasons: Spurs fell out of the title conversation after a brutal winter of injuries and inconsistency, while United’s campaign has been, at times, utterly farcical. Neither club should be where they are on the table – but there they are. Spurs are 17th, United are 16th. No European final has ever taken place between two teams in such lowly positions. For United, this is not so much about the trophy itself; as a club that has won bigger things more often, the Europa League feels almost beneath them. What they want is the prizemoney and a spot in next season’s Champions League, which would allow Amorim to accelerate his rebuild. Most United fans would gladly take those things and forego the silverware if it was an option. For Spurs, the trophy is the prize. “The game is about glory,” legendary manager Danny Blanchflower once said. It’s not about what Postecoglou once described as chasing “Willy Wonka golden tickets” to nowhere. They want the glory. They need the glory. Postecoglou came into the job dismissing the urge from supporters for them to just win something – anything – because it wouldn’t “cure all ills”. But over time, he seems to have slowly come to the understanding that a trophy is exactly what Spurs need, to serve almost as a psychological palate cleanser, to change the way not only the rest of the football world sees them, but the way they see themselves. His tactical approach has shifted accordingly.\n\nHow Postecoglou has adapted on the field Despite what his knockers say, Postecoglou has tweaked his tactics. To a greater extent than perhaps he ever has, and certainly much later than many would have liked. But it’s happened. Belatedly, in the Europa League, Spurs have embraced pragmatism. Postecoglou’s teams usually dominate possession; in their three most recent wins in Europe, against Eintracht Frankfurt and Bodo/Glimt (twice), they have had just 39, 42 and 33 per cent of the ball, three of the lowest such numbers on record throughout his entire reign. In the Premier League this season, Spurs have launched their goal kicks (meaning a long pass beyond 40 yards) just 7.9 per cent of the time for an average pass length of 16.4 yards; in Europe, it’s 29.7 per cent and 29.2 yards. Ange Postecoglou on the training pitch. Credit: Getty Images Domestically, Postecoglou kept asking his team to play the same high-octane way, even at the expense of defensive solidity. But in Europe, they have been far more direct with their passing and conservative with their positioning and pressing. It has worked.\n\nIs it just a natural response to the unique demands of knockout soccer against unfamiliar opponents, and the personnel challenges Spurs have faced? Or, perhaps, to the prevailing trends in the sport, making this a mere iteration of Angeball? Or has Postecoglou finally abandoned his principles – the ones he has said he will take to his footballing grave? That’s one for him to answer, but there’s no denying Spurs look different. Why this would be Ange’s biggest achievement All of Postecoglou’s major achievements have been forged through adversity. But he’s never encountered adversity quite like this. Injuries are one of few constants in soccer, but few teams have had to deal with the volume of injuries Tottenham have had to contend with. Their season spiralled out of control through an unprecedented run of player losses, which left them without up to 11 first-teamers for weeks on end. Even worse, most of them were defenders: centre-backs Mickey van de Ven and Cristian Romero, so key to the way Postecoglou wants to play, missed four months simultaneously and, since returning, have been sparingly used in the league to ensure they were fit for Europe. Ange Postecoglou loses his cool on the sideline. Credit: Getty Images\n\nThese injuries, particularly to the centre-backs, had a cascading effect, and not only on team cohesion. More and more was being asked of their ill-fitting replacements and, in turn, those players’ bodies collapsed under the heavy demands of playing two games a week, every week. It’s not an excuse, but a reason Spurs have fallen so far down the table. Judging by his rotations, at some point in the past few months, Postecoglou effectively put the cue in the Premier League rack and put all his and Tottenham’s eggs in the European basket. Loading Injuries will again be a factor in the final. This time it’s their three most creative midfielders who have been struck down, one after the other: first Lucas Bergvall, then James Maddison, then Dejan Kulusevski. Other players – perhaps fit-again captain Son Heung-min – will have to provide the attacking spark in their absence. Add to all of that the deafening noise about his future, the constant doubting of his track record and the negative rhetoric that always seems to swirl around Tottenham – which he has tried desperately to stop his players from internalising – and this is a situation that would have destroyed most other managers. Yet Postecoglou is still standing, his team has the chance to win a significant competition, and his players are still 100 per cent on board with him. That matters. They are completely dialled in. Even the “Ange Out” crew have laid down their guns for now.",
    "source": "TheAge",
    "cluster_id": 11
  },
  {
    "url": "https://www.theage.com.au/sport/nrl/locky-pinpoints-source-of-broncos-frustration-20250521-p5m10i.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Locky pinpoints source of Broncos 'frustration'",
    "publish_date": "Wed, 21 May 2025 11:29:18 +1000",
    "category": "sports",
    "authors": [],
    "text": "Locky pinpoints source of Broncos 'frustration'\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 35
  },
  {
    "url": "https://au.news.yahoo.com/locals-fume-as-22-year-old-roundabout-garden-destroyed-by-council-a-complete-stuff-up-012733296.html",
    "title": "Locals fume as 22-year-old roundabout garden destroyed by council: 'A complete stuff-up'",
    "publish_date": "2025-05-21T01:27:33Z",
    "category": "finance",
    "authors": [],
    "text": "Geoff Miers was 'stunned' to find his beloved flowers had been ripped out by council contractors in the Northern Territory.\n\nThe once blossoming roundabout has been reduced to dirt after council contractors ripped all the flowers out. Source: ABC Alice Springs/Emma Haskin & Supplied\n\nFlowers planted and lovingly tended to for over two decades by a local resident have been destroyed by workers contracted by the local council, with a whipper snipper turning the once blossoming roundabout into a pile of dirt.\n\nGeoff Miers, 75, was devastated to learn the hundreds of Sturt's desert peas were ripped out from the roundabout on the intersection of Undoolya Road and Lindsay Avenue in Alice Springs last Monday — one day after spending more than four hours tending to them with his wife Kaye.\n\n\"I was stunned. I couldn't believe it, especially as we had been tending to the roundabout the day before,\" he told Yahoo News. \"I've been looking after the roundabout for over 22 years when I first planted it out with a group of horticultural students from Charles Darwin University.\"\n\nGeoff, who is a horticulturalist himself, explained he wants to do his bit to \"keep Alice looking good\" and this was the reason behind his committed effort to the roundabout, which had long been renowned in the town.\n\nADVERTISEMENT\n\nYahoo News understand the contractors had mistaken the native flowers, not yet in bloom, for weeds and ripped them up.\n\n\"Simply it boils down to a lack of adequate training and a lack of direct and clear supervision,\" Geoff said. \"The roundabout garden was designed to be self-sustaining with weeding and the occasional watering to keep it looking wonderful.\"\n\nGeoff Miers had tended to the flowers for over 22 years. Source: Supplied & ABC Alice Springs/Emma Haskin\n\nCouncil in hot water after beloved flowers destroyed\n\nThe council has been slammed after word spread around town of the incident. The editor of local news outlet Alice Springs News published a scathing letter penned by a resident calling for an investigation.\n\nADVERTISEMENT\n\n\"The Town Council needs a rigorous, independent review to restore democratic representation, transparency and sanity,\" it reads. \"The council's wanton destruction of the iconic Undoolya Road and Lindsay Avenue roundabout planted with Sturt Desert Peas is final proof, if more was needed, that it lacks all three.\"\n\nJoshua Burgoyne, a local member of the legislative assembly, also questioned the council's actions online saying, \"We need to be encouraging locals to care for their spaces. Not destroying them by taking the whipper snipper to them.\" Geoff had recently propagated the Sturt's desert peas and planted them on a second roundabout outside Joshua's office.\n\n\"I want to thank him for his ongoing work ensuring Alice Springs looks it’s best,\" Joshua said.\n\nGeoff and his wife Kaye tended to the plants, not yet in bloom, for hours one day before the council ripped them up. Source: Supplied\n\nYahoo News reached out to the Alice Springs Town Council, however, it declined to comment. It is understood the council offered Geoff compensation, however Geoff told Yahoo News he wasn't interested in compensation and he doesn't know how much the council were willing to offer.\n\nADVERTISEMENT\n\n\"[I] didn't want to know about it so we never got that far [with a dollar amount],\" he told Yahoo News. \"They are full of apologies and realise it was a complete stuff-up. It will be discussed at the next full council meeting next Tuesday, 27th May.\"\n\nGeoff is adamant he will replant the flowers once the water supply is restored on the roundabout — something that was removed several years ago without explanation by council.\n\n\"It will come back again when I get some water put on, even if I have to treat and direct seed the roundabout,\" he said.\n\nDo you have a story tip? Email: newsroomau@yahoonews.com.\n\nYou can also follow us on Facebook, Instagram, TikTok, Twitter and YouTube.",
    "source": "Yahoo",
    "cluster_id": 43
  },
  {
    "url": "https://au.news.yahoo.com/fight-over-brutal-conditions-sees-a-thousand-tradies-strike-at-remote-camp-in-aussie-national-park-011800924.html",
    "title": "Fight over 'brutal' conditions sees a thousand tradies strike at remote camp in Aussie national park",
    "publish_date": "2025-05-21T01:18:00Z",
    "category": "finance",
    "authors": [],
    "text": "FIFO workers have walked off the job at the Snowy 2.0 renewable energy project site, with their representatives comparing life in the camp to a jail.\n\nAround 900 tradies have downed tools due to concerns about conditions and pay at a remote Snowy Mountains site. Source: Supplied/AAP\n\nTradies at a camp inside a remote national park have downed tools on Wednesday, forcing a $12 billion project to a standstill. The NSW-based crew building Snowy 2.0, Australia's biggest renewable energy project, say their employer, Italian-owned Webuild, needs to pay them the same as workers at Melbourne projects and improve conditions.\n\nThe Australian Workers Union (AWU) has amplified their concerns about the camp, noting the Snowy Mountains wilderness scorching in summer and freezing during winter. FIFO workers complete 12-hour underground shifts and 14-day stints at the camp in Snowy Mountains wilderness, before travelling home for seven days.\n\nNSW AWU secretary Tony Callinan has been scathing of the situation faced by the workers, comparing the isolated Kosciuszko National Park worksite to a “jail”.\n\n“Employees leave home, they get on a plane, when they get off at Cooma, they get put on a company-supplied bus, and then they’re stuck there for 14 days,” he told Yahoo News.\n\nADVERTISEMENT\n\n“There are no private vehicles allowed on site. It's not like you can just go up the road to the shops. You're stuck there. Even if you wanted to leave, there's no real ability to unless the company agrees to provide you with a bus to take you into Cooma.”\n\nWarning of 'disciplinary action' sparks uproar from tradies\n\nYesterday, the AWU was further angered after workers reported receiving a warning from the project’s manager, Future Generation (FGJV), a joint venture between Webuild, Clough and Lane Construction.\n\nThe email, seen by Yahoo News, detailed new rules from 5PM on Wednesday until 6AM on Thursday, covering the strike period. It included new restrictions on entering and leaving the site and warned of increased vehicle inspections. “Breaches may result in disciplinary action,” the company warned.\n\nWorkers are due to return to work on Thursday, and they are being surveyed by the union about how they'd like to proceed next week.\n\nADVERTISEMENT\n\nThe renewable energy project involves building a 27km-long tunnel. Source: Getty\n\nWhat is the union wanting from the company?\n\nThe AWU is calling for a pay increase of up to 12 per cent, in line with what workers are paid at the government’s North East Link Tunnel in Melbourne. Also on its list of demands are a $140 daily camp allowance for FIFOs, a doubling of night shift rates, and increased mental health days.\n\nFood is also reportedly an issue for workers at the camp. In 2023, they claimed maggots were found in meals, forcing a SafeWork NSW investigation.\n\n“I’ve got no negative comments to make about the chefs, they can only work with the limited resources and ingredients provided,” Callinan said.\n\nADVERTISEMENT\n\n“There's not much variance to the menu. And our members buy two-minute noodles and things like that to try and break up the cycle a bit. It's not a great environment to be living in.”\n\nYahoo News has contacted Snowy 2.0, Webuild and FGJV for comment.\n\nOn Tuesday, Snowy 2.0 told the ABC that negotiations between the FGJV and the union were ongoing.\n\n“As the employer of most of Snowy 2.0's workforce, Snowy 2.0's delivery partner, Future Generation Joint Venture, is engaged in ongoing negotiations for the enterprise agreements of surface and underground workers,\" it said.\n\nThe Snowy 2.0 project will have enough energy storage to power 3 million homes for a week. Source: Snowy 2.0\n\nHow much power will Snowy 2.0 create?\n\nThe Snowy 2.0 project expands on the original Snowy Mountains power scheme by connecting two existing dams through a 27km tunnel and building an underground pumped-hydro power station. It is the largest renewable energy project in Australia, and was developed as the centrepiece of the Turnbull Government’s green energy transition.\n\nADVERTISEMENT\n\nOnce completed, it will be able to supply three million homes with power over the course of a week. It will have roughly 2.2 gigawatts of capacity and create around 350,000 megawatt-hours of large-scale storage.\n\nBut the project has been plagued by cost blowouts, delays, and environmental concerns. Work has previously stopped at the site twice this year due to equipment safety concerns and malfunctions. The project is not expected to be completed until at least 2027.\n\nLove Australia's weird and wonderful environment? 🐊🦘😳 Get our new newsletter showcasing the week’s best stories.",
    "source": "Yahoo",
    "cluster_id": 44
  },
  {
    "url": "https://au.news.yahoo.com/live/nationals-mps-big-sacrifice-in-liberals-split-premier-offers-freebie-as-chaos-continues-odd-coles-detail-in-woolworths-store-232914741.html",
    "title": "Nationals MPs' big sacrifice in Liberals split, Premier offers freebie as chaos continues, odd Coles detail in Woolworths store",
    "publish_date": "2025-05-20T23:29:14Z",
    "category": "finance",
    "authors": [
      "Tom Flanagan",
      "Australian Associated Press"
    ],
    "text": "Plus see the 'devastating' data from the Salvation Army that shows how our most vulnerable are getting by day-to-day.\n\nIt's certainly been a turbulent start for Sussan Ley as leader of the Opposition. Source: Getty/ NewsWire\n\nHello and welcome to Yahoo's live news blog this Wednesday. Nationals MPs pushed through their split with the Liberal Party knowing they'd be copping a significant paycut. Seven Nationals will step back from shadow cabinet, including Mr Littleproud, meaning they lose their 20 to 25 per cent loading on their base salary rates of about $230,000.\n\nWhile it may be of little comfort to frustrated commuters, NSW Premier Chris Minns has offered free travel after large parts of Sydney's train network shut down yesterday. The chaos has continued into today, with Minns admitting the public had been let down.\n\nAn awkward detail on a Woolworths shelf has shown home brand products across the big supermarkets may be more similar than you might think.\n\nFollow along as we bring you regular updates throughout the day.\n\nLive 10 updates 'Impossible' situation only going to get worse Yesterday's rate cut is expected to trigger a rise in house prices as more buyers enter the market with more confidence about their lending capability. But even before Tuesday, Australians faced a dire situation. The recently-released 2025 Demographia International Housing Affordability report, found Sydney, Adelaide, Melbourne and Brisbane are \"impossibly unaffordable\". Out of those, Sydneysiders were in the worst spot. The report found it as the world's second most unaffordable location behind Hong Kong.\n\nCoalition split didn't have full party room support Key members of the Nationals party have defended its decision to split from the Liberal Party, with senator Bridget McKenzie insisting the decision wasn't rushed. But deputy leader Kevin Hogan has admitted not everyone in the party room was on board. \"It wasn't unanimous but it was quite conclusive,\" he told Sky News. \"I didn't make this decision. David Littleproud didn't make this decision. Bridget McKenzie didn't make this decision. The Nationals federal party room made this decision and that was their direction to us.\"\n\nVictoria Premier calls for probe into dung delivery A box of cow manure dumped on the Victorian premier's door has her steamed off and prompted calls for a parliamentary probe. A farmer made the delivery outside Premier Jacinta Allan's parliamentary office on Tuesday as a protest raged on the front steps over the Emergency Services and Volunteers Fund levy. A note on the box read: \"Dearest Jacinta, I have considered your levy and here's my feedback, it's bulls***. Love Brutus + family\". The vacuum-sealed dung package came wrapped in pink twine and with a photo of a cow attached. Manager of government business Mary-Anne Thomas accused Liberal MPs Bev McArthur and Nicole Werner of facilitating the placing of the \"offensive prop\". The dung delivered to Allan's office. Source: AAP She has written to parliament's privileges committee to request an investigation into the pair for bringing \"discredit\" on parliament. Ms Allan said it was disgraceful behaviour and would not be tolerated in any other workplace. \"It's not funny, it's not a joke, it's not larrikin,\" she told ABC Radio Melbourne on Wednesday. \"The staff member who had to deal with this told me that they didn't feel safe, they told me how their safety in their workplace was violated by this behaviour.\" She blasted Opposition Leader Brad Battin for failing to condemn the behaviour and suggested he had instead \"backed it because it was done by one of his backers\".\n\nDaunting flood vision as river surpasses record level Let's bring you some of the devastating conditions on NSW's Mid North Coast now. The Manning River has reached record levels at Taree, now surpassing a near 100-year record. The town is under an emergency warning, with reports of dozens of residents trapped on roofs. There's been more than 100 flood rescues in the area, with the Bureau of Meteorology saying up to 300mm of rain is expected on Wednesday in some areas, with those falls set to exacerbate the already-dangerous conditions. One video shared on Facebook shows floodwater rapidly passing a Taree property, highlighting the dangers the community faces.\n\nMajor update in search for missing teen Police in Queensland say two crime scenes have been declared in the search for a teenage girl missing for nearly a week. Pheobe Bishop, 17, was last seen at Airport Drive, Bundaberg around 8.30am on May 15. She did not check in for a booked flight and has not been seen or heard from since. \"A property in Gin Gin, where Phoebe was living prior to her disappearance, and a grey Hyundai ix35 believed to be the car Phoebe travelled to Airport Drive in, have been declared crime scenes.Police have seized the car,\" police said in an update. \"Police are continuing to appeal to the public for dashcam and CCTV footage of the grey Hyundai ix35 with Queensland registration 414EW3 (pictured) near the Airport Drive and Samuels Road area in Bundaberg and also the Gin Gin area on May 15.\" Police said they are treating her disappearance as suspicious and urged anyone with information to come forward immediately. Pheobe Bishop vanished last week. Source: Queensland Police\n\n$100k dinosaur causing a stir in NZ Well this dinosaur statue across the Tasman Sea is causing a bit of a stir. Costing $100,000 (A$92,000), Boom Boom, a three-metre stainless steel dinosaur, has divided public opinion in the NZ town of Taupō, with some calling it a waste of money. But its creator says that's not surprising. Artist Gregor Kregar told the BBC sculpture is meant to \"stop people from their everyday interactions\" and it was clear Boom Boom was doing just that. Why a dinosaur you may ask? Well the area has rich volcanic history and Sauropods used to roam those lands. Read more here. View this post on Instagram A post shared by Love Taupō | New Zealand (@lovetauponz)\n\n'Devastating' research exposes cost-of-living crisis for country's poorest One in four people who reach out to the Salvation Army have been forced to eat expired or spoiled food as they struggle through a cost-of-living crisis. The sad revelation comes as the charity is once again pleading for help to support those doing it tough. “It is truly shocking in a country like Australia that we are seeing these devastating numbers. No one should be forced to eat expired food or to eat out of rubbish bins,\" the Salvation Army's Major Bruce Harmer said. More than half of those who reached out were skipping meals, while six per cent were searching through bins and dumpsters. Nearly half of those asked said they couldn't afford nappies or baby formula for their young children and were forced to go without.\n\nOdd Coles detail on Woolworths shelf explained Coles has confirmed a suspicion of many shoppers, revealing it shares suppliers for its home brand products with rivals Woolworths. The supermarket responded to a photo of one of their apple juice bottles accidentally appearing on a Woolworths shelf. \"[We are] investigating with our supplier – who provides this product to both retailers – to understand how this happened and ensure it remains a one-off occurrence,\" a spokesperson told Nine. The bottle of juice (second left) somehow managed to make it onto the shelf. Source: Reddit\n\n'Not good enough': Premier's admission after chaotic scenes NSW Premier Chris Minns is doing what he can to ease the frustrations of commuters after Sydney's train network ground to a halt. Minns says next Monday will be a day of free travel, but admitted it won't \"make up\" for the disruptions commuters have faced. Trains were brought to a grinding halt on Tuesday afternoon after part of a train’s rooftop power connecter became tangled with overhead powerlines at Strathfield, in the city’s west, which were brought onto the track. The chaos continued into Wednesday morning where huge queues were seen outside stations across the city. “We’ve let the travelling public down,” Minns told 2GB on Wednesday morning. “This is nowhere near good enough, and it’s certainly not on par with international cities around the world.” Commuters pictured outside Sydney's Central Station. Source: Reddit\n\nNationals MPs' sacrifice to end Coalition Nationals MPs have put their money where their mouth is as they abandon a coalition arrangement. Half a dozen members have taken a haircut worth tens of thousands of dollars to their pay packet after walking away from leadership positions. Party leader David Littleproud has pulled the Nationals out of a partnership with the Liberals after they failed to agree on the retention of policies following an election defeat. With the Liberals now holding all the cards in opposition, the shadow cabinet - made up of just over 20 of the opposition's top generals with portfolios shadowing government ministers - will not contain any Nationals. The two parties carve up spots in government and opposition on a proportional basis dependent on seats won. Seven Nationals will step back from shadow cabinet, including Mr Littleproud, meaning they lose their 20 to 25 per cent loading on their base salary rates of about $230,000. Five are actively taking pay cuts, while two others will forego a promotion. It's certainly been a turbulent start for Sussan Ley as leader of the Opposition. Source: Getty/ NewsWire\n\nDo you have a story tip? Email: newsroomau@yahoonews.com.\n\nYou can also follow us on Facebook, Instagram, TikTok, Twitter and YouTube.",
    "source": "Yahoo",
    "cluster_id": 45
  }
]