[
  {
    "url": "https://www.9news.com.au/national/minimum-wage-increase-3-point-5-per-cent-fair-work-commission/ee00e22a-0a2f-4d59-9233-3a488a125ec9",
    "title": "Millions to get pay rise as wages boosted around the country",
    "publish_date": "Tue, 03 Jun 2025 01:17:42 +0000",
    "category": "finance",
    "authors": [
      "Jun"
    ],
    "text": "The largest union body in the country has hailed the Fair Work Commission's decision to boost minimum wages for millions of workers.\n\nThe Commission's annual review found that the national minimum wage, as well as modern award minimum wages, should all increase by 3.5 per cent.\n\nThe increase will come into effect from July 1 this year.﻿ The current national minimum wage is $24.10 per hour, or $915.90 per week. A 3.5 increase will increase that to $24.94 an hour, or just over $30 more a week.\n\nA 3.5 increase will increase that to $24.94 an hour, or just over $30 more a week. (Getty Images/iStockphoto)\n\nThe decision will affect up to about three million Australians, ﻿according to government estimates during the election campaign, though only a small number of those are on the national minimum wage.\n\nA further 20.7 per cent of Australian workers, according to Fair Work Commission president Justice Adam Hatcher﻿, are paid the minimum wage applicable under modern workplace awards.\n\n\"The principal consideration which has guided our decision is the fact that, since July 2021, employees who are reliant on modern award minimum wages or the national minimum wage have suffered a reduction in the real value of their wage rates,\" Hatcher said.\n\n\"In the case of modern awards, the benchmark C10 award rate of pay has declined by 4.5 percentage points relative to inflation as measured by the Consumer Price Index.\"\n\nREAD MORE: Huge eruption in Italy leaves tourists fleeing volcano\n\nThe decision will affect up to about three million people. (Louie Douvis/AFR)\n\nHatcher said that this had been due to the major spike in inflation which had begun in 2021.\n\n\"The result has been that living standards for employees dependent on modern award wages have been squeezed and the low paid have experienced greater difficulty in meeting their everyday needs,\" he said.\n\nHowever, with the Reserve Bank of Australia deeming inflation to be \"sustainably\" within the target rate of between 2 and 3 per cent, Hatcher said, it was appropriate to boost minimum wage payments above inflation.\n\nThe five qualifications in hot demand for Australia's future jobs View Gallery\n\n\"We are concerned that if this opportunity is not taken in this Annual Wage Review, the loss in the real value of wages which has occurred will become permanently embedded in the modern award system and the national minimum wage, and a reduction in living standards for the lowest paid in the community will thereby be entrenched,\" he said.﻿\n\nThe Australian Bureau of Statistics reported in March th﻿at inflation was at 2.4 per cent, unchanged from the previous quarter.\n\n﻿Australian Council of Trade Unions secretary Sally McManus praised the decision, despite the ACTU backing a larger 4.5 per cent increase.\n\n\"This decision delivers a 1.1 per cent real wage increase, one of the largest real wage increases the Fair Work Commission has awarded,\" McManus said.\n\n\"This wage increase means those who are paid award wages will start to get ahead again, easing pressure on their weekly budgets and part of the stress that comes from having to cut back on the basics.\"\n\nLast year, the commission increased the minimum wage by 3.75 per cent.﻿",
    "source": "9News",
    "cluster_id": 0
  },
  {
    "url": "https://www.9news.com.au/national/queensland-princess-alexandra-hospital-sudden-death-investigation/65e36449-149a-432f-9c59-e22f590b7e58",
    "title": "Man dies in Brisbane hospital after attack by fellow patient",
    "publish_date": "Mon, 02 Jun 2025 23:22:26 +0000",
    "category": "lifestyle",
    "authors": [
      "Jun"
    ],
    "text": "An investigation is underway after a man died in the psychiatric unit of a\n\nBrisbane\n\nhospital after being attacked by another patient.",
    "source": "9News",
    "cluster_id": 1
  },
  {
    "url": "https://www.9news.com.au/national/oz-lotto-70-million-dollar-jackpot-up-for-grabs/55e12fcd-1777-4039-abb9-2f662a46733e",
    "title": "Huge $70 million Oz Lotto jackpot prize up for grabs",
    "publish_date": "Mon, 02 Jun 2025 22:08:30 +0000",
    "category": "finance",
    "authors": [
      "Jun"
    ],
    "text": "M﻿illions of Australians are expected to enter tonight's $70 million Oz Lotto jackpot draw, the fourth biggest in the competition's 31-year history.\n\nAnyone lucky enough to capture the entire prize will take home the second-biggest lottery prize of the year.\n\nOz Lotto is forecasting one-in-five Australian adults will enter draw 1633, to be revealed tonight.\n\nAustralians have the chance to grab a $70 million prize in tomorrow's Oz Lotto jackpot draw. (The Lott)\n\nThe Lott spokesperson Matt Hart said Oz Lotto was eagerly awaiting its fourth division one win for this year.\n\n\"So far this year, three Oz Lotto division one winning entries have pocketed a total of $185 million.\n\n\"Could we add to our 2025 winners list and see our fourth division one win in Oz Lotto this week?\" he said.\n\n\"We'll be standing by ready to reach out to any registered division one winner immediately after the draw on Tuesday night, so make sure you register your ticket to The Lott Members Club for the chance to receive that winning phone call.\"\n\nHow Australia's lotto winners spent their cash View Gallery\n\nThe last Oz Lotto $70 million draw in April was won by a 15-share Queensland syndicate, with each receiving more than $4.7 million.\n\nIt attracted a surge of late entries, with the peak of sales recorded over the last 30 minutes before the draw closed at 7.30pm.\n\nWhether it is an individual or syndicate that scoop the cash today, ﻿the overnight millionaires will end the financial year on a high note.",
    "source": "9News",
    "cluster_id": 2
  },
  {
    "url": "https://www.9news.com.au/world/coffee-habit-may-affect-long-term-health-study-finds/0dd49635-599c-477d-a1a1-292d42a427f9",
    "title": "Your coffee habit could be a key to a healthy old age",
    "publish_date": "Mon, 02 Jun 2025 22:10:39 +0000",
    "category": "lifestyle",
    "authors": [
      "Jun"
    ],
    "text": "Want to reach older age with a sharp mind and healthy body?\n\nPart of the answer may be in your coffee cup, according to new research.\n\n\"Women who drank one to three cups of caffeinated coffee per day in their 50s were more likely to reach older age free from major chronic diseases and with good cognitive, physical, and mental health,\" said lead study author Dr Sara Mahdavi, adjunct professor in the faculty of medicine and department of nutritional sciences at the University of Toronto.\n\nResearchers analysed dietary data from more than 47,000 women who were part of the Nurses' Health Study, according to the research released at the annual meeting of the American Society for Nutrition in Orlando.\n\nPart of the answer may be in your coffee cup, according to new research. (Getty Images/iStockphoto)\n\nThe study was presented as an abstract, but a more in-depth manuscript of the investigation will be submitted for peer review in the coming months, Mahdavi said.\n\nThe women were surveyed in middle age and followed for 30 years to understand their rates of death and disease.\n\n\"In this study, we found that moderate caffeinated coffee consumption during midlife was associated with a higher likelihood of healthy aging 30 years later,\" Mahdavi said.\n\nDrinking one to three cups of coffee daily was associated with lower disease and better cognition is older age, a study showed. (Jacob Wackerhausen/iStockphoto/Getty/CNN)\n\nIt's not just any caffeinated drink\n\nThe effects were found in caffeinated coffee in particular, according to the research. The same link was not found for tea or decaffeinated coffee – and drinking more cola or other caffeinated sodas was tied to a lower chance of healthy aging.\n\n\"This would imply that coffee in particular has health preserving or promoting effects,\" said Dr David Kao, Jacqueline Marie Schauble Leaffer Endowed Chair in Women's Heart Disease and associate professor of medicine at the University of Colorado Anschutz Medical School in an email.\n\n\"As with other studies , they also appear to have found that coffee has a particular benefit over other caffeinated drinks.\"\n\nOther caffeinated beverages like cola didn't demonstrate the same benefits. (Getty Images/iStockphoto)\n\nThat said, the research is high quality, added Kao, who was not involved in the research.\n\nThe study is also observational, meaning it is limited in its ability to examine direct cause and effect. The new research can only show that a behaviour and an outcome are more likely to occur together.\n\nResearchers did take that into account and adjusted for other factors that could link coffee drinking and healthy aging such as lifestyle, demographic and other dietary differences, but it is still possible there is another variable at play, Mahdavi said.\n\nBut the link between coffee and healthy aging isn't surprising – it is consistent with prior research, Kao said.\n\nModerate coffee drinking has been linked before to lower risks of chronic diseases like type 2 diabetes and cardiovascular disease, he added.\n\nIs it time to start drinking coffee?\n\nDoes this mean you should take on a coffee habit if you don't have one already? Not necessarily, Mahdavi said.\n\n\"Coffee may support longevity, but it's not a universal prescription – especially for women. Hormonal shifts influence how caffeine is metabolised, so the benefits depend on timing, biology, and individual health,\" she said in an email.\n\nEstrogen inhibits a liver enzyme that is crucial for breaking down caffeine, which means that caffeine may last longer in the body of some people, especially those going through hormonal transitions such as menopause or pregnancy or those using oral contraception, Mahdavi said.\n\nThe study particularly emphasised potential benefits for women. (Getty)\n\nMidlife, the time period examined in this study, is a life stage marked by hormonal and metabolic shifts for women, she added.\n\n\"Moderate caffeinated coffee consumption – typically one to three cups per day – can be part of a healthy diet for many adults,\" Mahdavi said. \"However, this should not be taken as a blanket recommendation for everyone to begin or increase coffee intake with the goal of longevity.\"\n\nFor one thing, the data can't say whether increasing coffee consumption would help to preserve health, Kao said.\n\n\"In other words, although women who drink three cups of coffee/day might have better long-term functioning than non-coffee drinkers, we don't know if non-coffee drinkers started drinking three cups a day, whether they would have better functioning than if they remained non-coffee drinkers,\" he said in an email.\n\nMan armed with plastic bags defies world's biggest army View Gallery\n\nWho needs to watch their coffee intake?\n\nThe findings do suggest that people don't necessarily need to decrease their coffee consumption in the name of healthy aging, Kao said.\n\n\"Coffee is an important and positive part of daily life in many cultures around the world, he said. \"For many … the knowledge that a daily coffee or three is probably not harmful is welcome news.\"\n\nThat said, some people do need to watch their coffee consumption, including those with high blood pressure, heart disease, anxiety and sleep disorders, said Dr Lu Qi, HCA Regents Distinguished Chair and professor at Tulane University Celia Scott Weatherhead School of Public Health and Tropical Medicine in New Orleans.\n\nQi was not involved in the research but was involved in another recent study showing that having coffee in the morning had a better impact on lowering death rates than drinking it throughout the day.\n\nAlthough coffee may be an enjoyable aspect of good health, it does not replace other healthy behaviors such as eating nutritious foods, exercising and getting good sleep, Mahdavi added.",
    "source": "9News",
    "cluster_id": 3
  },
  {
    "url": "https://www.9news.com.au/national/colon-cancer-study-exercise-death/3731aaac-5996-4075-80de-9879965288fd",
    "title": "Exercise cuts risk of death from common cancer by 37 per cent, study finds",
    "publish_date": "Mon, 02 Jun 2025 09:11:26 +0000",
    "category": "lifestyle",
    "authors": [
      "Jun"
    ],
    "text": "Diagnosed with colon cancer in December 2015, Cherri Bullard is preparing to run her third marathon.\n\nMore than a personal accomplishment, she largely credits a structured exercise routine to her long-term﻿ survival.\n\n\"I think it just makes you realise you've got to keep exercising. Keep your body strong. Keep yourself out of hospital,\" Bullard said.\n\nREAD MORE: Mushroom poisoning trial enters sixth week\n\n(Nine)\n\nBullard was one of almost 900 ﻿stage 2 or 3 colon cancer patients across Australia and Canada to participate in a landmark study analysing the impact of a structured exercise routine on rates of disease-free survival, coupled with traditional treatment.\n\nResults from the 17-year study by the University of Sydney and Canadian Cancer Trials Group found patients who undertook a three-year structured exercise program had a 37 per cent lower risk of death, compared to those with no exercise program.\n\nAfter three years, there was an 80 per cent disease-free survival rate for those in the program, which rose to 90 per cent after eight years.\n\nColon cancer patients without a structured exercise routine had an 83 per cent survival rate after eight years.\n\n﻿\"It's been nearly 10 years now, which is pretty good,\" Bullard said.\n\nBullard was one of almost 900 ﻿stage 2 or 3 colon cancer patients across Australia and Canada to participate in the landmark study. (Nine)\n\n\"A lot of people don't last that long but I think if you exercise and you're surrounded by good support, you can get better ﻿and you can last longer.\"﻿\n\nAround 15,500 cases of colon cancer were diagnosed in Australia last year.\n\nWhile cases are declining in older people, it's becoming more common in people aged 50 or younger.\n\nUniversity of Sydney professor Janette Vardy said the study results were \"phenomenal\".\n\n\"This is really quite conclusive information that exercise saves lives in colon cancer patients,\" she said.\n\n\"We know that just telling people to exercise is not enough.﻿\n\n\"We now need to implement those structured exercise programs so that every patient coming through our system [is] given an exercise prescription by a qualified exercise specialist.\"",
    "source": "9News",
    "cluster_id": 4
  },
  {
    "url": "https://www.9news.com.au/world/eisenhttenstadt-european-town-offering-weeks-of-free-accommodation-to-lure-new-residents/92a26890-eabf-4c69-a195-15febf9192ac",
    "title": "European town offering weeks of free accommodation to lure new residents",
    "publish_date": "Mon, 02 Jun 2025 01:32:18 +0000",
    "category": "finance",
    "authors": [
      "Jun"
    ],
    "text": "A town in eastern Germany is offering two weeks free accommodation to encourage people to relocate there in a bid to boost its population.\n\nEisenhüttenstadt, which sits on the border with Poland around 60 miles from the German capital Berlin, is offering a 14-day trial stay for potential new residents, according to a statement from the local council on May 13.\n\n\"The project is aimed at anyone interested in moving to Eisenhüttenstadt—such as commuters, those interested in returning to the town, skilled workers, or self-employed individuals seeking a change of scenery,\" it said, with applications open until the beginning of July.\n\nEisenhüttenstadt sits on the river Oder on the Germany-Poland border. (CNN)\n\nSelected participants will live for free in a furnished apartment from September 6-20 as part of an \"innovative immigration project\" named \"Make Plans Now,\" said the council.\n\nThey \"will have the opportunity to get to know the life, work and community of (Eisenhüttenstadt) in a 14-day living trial — for free and in the middle of the town,\" reads the statement.\n\nIn order to help participants get a feel for the town, the council will lay on a number of activities including a tour, a factory tour and various outings.\n\nThe council will also encourage participants to stay permanently, with local businesses offering internships, job shadowing and interview opportunities.\n\nFounded in 1950, Eisenhüttenstadt, which can be translated as Steel Mill Town, was the first fully planned town built under the socialist government of the former East Germany.\n\nSitting on the banks of the Oder River, socialist planners built the town around a huge steelworks.\n\nREAD MORE: Ukraine destroys 40 military planes in drone attack planned for months ﻿\n\nWhere is the Aussie dollar still good value for travellers? View Gallery\n\nPreviously known as Stalinstadt, or Stalin Town, after former Soviet leader Joseph Stalin, it was renamed after East and West Germany reunified following the fall of the Berlin Wall in 1989.\n\nLike many towns and cities in the former East Germany, it has seen its population decline since reunification, from a peak of more than 50,000 to the current level of around 24,000, local official Julia Basan told local media outlet RBB24.\n\nThe scheme aims to attract more permanent residents, particularly skilled workers, said Basan.\n\nToday, Eisenhüttenstadt is home to the largest integrated steelworks in eastern Germany, which employs 2500 people, as well as being a hub for metals processing.\n\nMany of the socialist-era buildings are listed as historical monuments and the openness of the town's layout is striking, attracting visitors interested in architecture.\n\nOne recent new arrival said that the architecture was responsible for his decision to move to the town.\n\nIt was \"a complete coincidence,\" the man said in a video posted on the town hall Instagram account.\n\n\"We were travelling to Ratzdorf with friends and drove through Karl-Marx-Straße. And I saw these houses, this architecture that completely blew me away and I said to my wife, 'I'm going to move here,'\" he said.\n\nThe man later organised a tour of the town with a local historian to learn more.",
    "source": "9News",
    "cluster_id": 5
  },
  {
    "url": "https://www.abc.net.au/news/2025-06-03/gabby-thomas-harassed-by-gambler-at-track-meet-in-united-states/105370596",
    "title": "Olympic gold medallist harassed by gambler at track meet",
    "publish_date": "Tue, 03 Jun 2025 01:46:16 +0000",
    "category": "sports",
    "authors": [],
    "text": "Three-time Olympic track gold medallist Gabby Thomas says she was verbally abused at a meet in Philadelphia last weekend, the latest incident of harassment the American has reported this year.\n\nThomas, who won gold in the 200 metres, as well as the 4x100m and 4x400m relays at the Paris Games, said in a post on X that a man followed her around at the Grand Slam Track meet while she took pictures for fans and signed autographs, shouting insults at her.\n\nRaducanu brought to tears during match by man in crowd displaying 'fixated behaviour' Photo shows Emma Raducanu wipes her face while crying on court during a match against Karolina Muchova at the Dubai Tennis Championships. A man displaying \"fixated behaviour\" towards Emma Raducanu was removed from the Dubai Championships venue after the British player burst into tears after seeing him courtside.\n\n\"Anybody who enables him online is gross,\" Thomas wrote.\n\nThomas's post was in response to another on X that contained a video of a person heckling Thomas while she was on the starting line, shouting \"you're a choke artist — you're going down, Gabby\".\n\n\"I made Gabby lose by heckling her. And it made my parlay win,\" the social media user wrote, with a screenshot of two online multi-leg bets.\n\nThe track circuit said in a statement: \"Grand Slam Track is conducting a full investigation into the reprehensible behaviour captured on video.\n\n\"We are working to identify the individual involved and will take appropriate action as necessary.\n\n\"We will implement additional safeguards to help prevent incidents like this in the future. Let us be clear, despicable behaviour like this will not be tolerated.\"\n\nThomas finished third overall in the short sprints group for the Philadelphia meet, the third in the novel circuit's inaugural season.\n\nOne of America's brightest stars in track, the 28-year-old Thomas catapulted to mainstream fame after her breakout performance in Paris, gracing the cover of American Vogue magazine and appearing on US talk shows.\n\nBut Thomas has also suffered the darker side of fame, describing on TikTok this year how she was stalked by a group of men at several airports, as social media gives female athletes greater exposure.\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\nThe incident at Grand Slam Track also reflected a growing link between sports betting and harassment, with female tennis players, including Caroline Garcia, pointing to \"unhealthy betting\" as a key culprit.\n\nMajor tennis governing bodies moved to combat online abuse and published a report last year that attributed nearly half of abusive social media posts to angry gamblers.\n\n\"Thank you for pointing out this disgusting behaviour,\" retired former world 10,000m silver medallist Kara Goucher wrote on X.\n\n\"You are exposing the crap that women go through and will eventually help other women as well.\"\n\nReuters",
    "source": "ABC",
    "cluster_id": 6
  },
  {
    "url": "https://www.abc.net.au/news/2025-06-03/sermanni-pinching-himself-after-phenomenal-matildas-privilege/105370230",
    "title": "Sermanni departs Matildas pinching himself after 'phenomenal' privilege",
    "publish_date": "Tue, 03 Jun 2025 01:45:53 +0000",
    "category": "sports",
    "authors": [],
    "text": "When Tom Sermanni first took charge of the Australian women's national football team, they were not playing in front of sell-out crowds.\n\nThey were not even called the Matildas.\n\nTom Sermanni As international team manager Australia: 1994-1997 - 32 games, 13 wins\n\nMatildas*: 2004-2012 - 106 games, 61 wins\n\nUS Women's National Team: 2013-2014: 24 games, 18 wins\n\nNew Zealand Women's National Team: 2018-2021 - 24 games, 10 wins\n\nMatildas**: 2024-2025 - 13 games, 7 wins * - Australian women's team was first known as the Matildas in 1995 ** - Interim Matildas coach\n\nSermanni's first home game as coach of the Female Socceroos, as they were still known back in 1995, was played in front of a handful of spectators at a training ground at the Australian Institute of Sport in Canberra.\n\nHis last was in front of a capacity crowd of 25,125 next door at Canberra Stadium on Monday night.\n\nThat is a record not just for a women's football game in the ACT, but any football game played in the nation's capital.\n\nIt is the highest attendance of any sport at the venue in almost six years.\n\n\"It's bizarre,\" Sermanni reflected, following his final match as interim coach before Joe Montemurro steps into the role.\n\n\"It's just been a phenomenal experience. I've never witnessed a crowd such as the Matildas crowd.\n\n\"I kind of pinch myself when I go out and stand in front of it before the game starts.\n\nTom Sermanni gave Sam Kerr her full international debut in 2009. (AAP: Dan Himbrechts)\n\n\"I just can't believe I'm back and had the privilege to be back in this environment.\"\n\nAs he ends his third, and probably final, stint at the helm of the Matildas, the landscape of women's football in Australia is unrecognisable from when he first encountered it.\n\nThat is largely down to Sermanni, 70, himself.\n\nIn his first tenure, from 1994 to 1997, the charismatic Caledonian led the Matildas to their first World Cup.\n\nBut it was his contribution off the field that had the biggest impact.\n\nFrom a small office in the Canberra suburb of Hackett, Sermanni and a team of two or three running the entire women's program established the foundations for the National Training Centres that would incubate the golden generation of Australian women's football.\n\n\"I think that was one of the things, if I look back, that we created that I feel was really beneficial,\" he said\n\n\"And the second thing was the W-League. I think the W-League has been really instrumental in giving opportunities to domestic players that might not have had opportunities if we didn't have that league.\"\n\nTom Sermanni's second stint as the Australian women's team coach saw him take the Matildas to the FIFA 2007 World Cup in China. (Getty Images: Paul Gilham)\n\nIn his second stint, from 2004 to 2012, Sermanni handed debuts to a crop of young players — including the likes of Sam Kerr, Steph Catley and Caitlin Foord — who took the Matildas to another level and nearly a home World Cup final in 2023.\n\nBut the decision to can the National Training Centres program in 2014 set back the development of new talent and left a shortage of new players coming through to replace them, Sermanni lamented.\n\nABC Elite Athletes in Australian Women's Sport Survey: We want to hear from you Photo shows A stylised graphic with three silhouettes of unidentified a female footballer, tennis player, basketballer ABC Sport and Deakin University have partnered to produce the first ABC Elite Athletes in Australian Women's Sport Survey.\n\n\"We need to put resources into development,\" he said.\n\n\"You don't notice your development collapsing overnight. It takes time, and then all of a sudden, we turn around and say, we've got all these great players, but they're 30-plus.\"\n\nNow unemployed, the longest-serving coach of the Matildas does not know what his future holds, but he left the door open to continuing his relationship with Football Australia.\n\n\"We've had some chats, but there's been no particular concrete role. So I think everybody will just wait to see what happens when things change and things start to happen again,\" he said.\n\n\"If there's something there, fantastic. If there's not, I'll be quite happy to leave the building and relax.\"\n\nAAP",
    "source": "ABC",
    "cluster_id": 7
  },
  {
    "url": "https://www.abc.net.au/news/2025-06-03/pilbara-traditional-owner-shares-creation-story-of-sacred-hill/105286786",
    "title": "Outback community's imposing rock formation a 'peaceful place'",
    "publish_date": "Tue, 03 Jun 2025 01:02:08 +0000",
    "category": "finance",
    "authors": [],
    "text": "Just outside the remote mining town of Pannawonica, a trapezoid-shaped rock sits on top of a spinifex-covered hill.\n\nThe outcrop, about 1,400 kilometres north of Perth, has a touch of the supernatural.\n\nIts prominence in the surrounding Pilbara landscape draws comparisons with the Devils Tower outcrop in Wyoming made famous by Steven Spielberg in Close Encounters of the Third Kind.\n\nWhile many in town know it simply as the Panna Hill, the area's traditional owners — the Robe River Kuruma people — call it Parlapuni.\n\n\"It's the most peaceful place,\" Robe River Kuruma woman Tuesday Lockyer said.\n\n\" You don't know what true peace is until you get out of town and go out bush and sit down [here]. \"\n\nTuesday Lockyer says she feels the presence of spirits when she visits the rock formation. (ABC Pilbara: Charlie Mclean)\n\nAn ancient feud\n\nThe Robe River Kuruma people believe Parlapuni was not always on the outskirts of Pannawonica.\n\nThousands of years ago, the hill is believed to have sat on land belonging to a neighbouring Pilbara group — the Marthudunera people.\n\nMs Lockyer said that changed during a bitter feud between the two groups.\n\n\"While [everyone] was fighting one another, two old people decided to send out two birds from here called putt putts,\" she said.\n\nTuesday Lockyer says passing down stories is just as important as advocating for the protection of country. (ABC News: Charlie McLean)\n\nAccording to the story, the birds then sang a song that dragged the hill from Marthudunera country to where it sits today.\n\nIn the end, Ms Lockyer said each group's elders stepped in and ended the feud.\n\n\"[It] must have been going on for a while and they must have got tired of fighting one another,\" she said.\n\nToday, a clearing just in front of Parlapuni is one of Ms Lockyer's favourite places to gather with friends and share stories around a campfire.\n\n\"You feel that the spirits are here,\" she said.\n\n\"It's like home. It welcomes you home.\"\n\nSource of strength\n\nIn recent years, visiting Parlapuni has also meant confronting a distressing situation for the Robe River Kuruma people.\n\n\"It's sad the way the country is at the moment,\" Ms Lockyer said.\n\nJust in front of the hill is an empty river bed.\n\nThe dry riverbed in front of Parlapuni. (ABC News: Charlie Mclean)\n\nIt is one of several rivers that the Robe River Kuruma people say are running dry more often than usual.\n\nThey attribute the situation to years of groundwater extraction by mining giant Rio Tinto to supply local iron ore mines and provide drinking water to coastal towns in the Pilbara.\n\nMs Lockyer has been involved in a long-running campaign to reduce water extraction on Robe River Kuruma country.\n\nShe said she had drawn strength from Parlapuni to sustain what had been a draining campaign.\n\n\"It's like a David and Goliath fight. We are the little Davids,\" Ms Lockyer said.\n\n\"But still we gotta have hope, you know, and we always do, that the country will get rain, we will get water.\"\n\nIn response to the traditional owners' concerns, Rio Tinto is building a desalination plant in Dampier, which is set to be completed next year.\n\nThe company believes that from 2030, no more groundwater will be taken from Robe River country.\n\nTuesday Lockyer has been campaigning to reduce water extraction on Robe River Kuruma country. (ABC News: Charlie McLean)\n\nStorytelling obligation\n\nMs Lockyer said passing down stories, like the origin of Parlapuni, was just as important as advocating for the protection of country.\n\n\"Our obligation is not only to look after country but also to pass down the stories that have been passed down from our elderly generations,\" she said.\n\n\"That's why we keep these stories going, and it's good that the stories will keep on going for many, many years.\"",
    "source": "ABC",
    "cluster_id": 8
  },
  {
    "url": "https://www.abc.net.au/news/2025-06-03/hot-air-balloons-draw-tourists-to-northam-in-winter/105366584",
    "title": "Hot air balloons help town hold its own in the battle for tourists",
    "publish_date": "Tue, 03 Jun 2025 00:37:29 +0000",
    "category": "finance",
    "authors": [],
    "text": "Colour and light filled the skies in Northam during Western Australia's long weekend as the Wheatbelt town marketed itself as the \"ballooning capital of Australia\".\n\nHundreds woke up to foggy skies in the Avon Valley, 100 kilometres east of Perth, to admire the hot air balloons over three mornings, before 8,000 visitors flocked to see the balloons light up at night, in time to rock tunes, for the Elevate Festival.\n\nThe Northam Elevate festival attracted more than 8,000 visitors to the Wheatbelt town. (ABC Midwest and Wheatbelt: Eliza Bidstrup)\n\nA major drawcard of the Northam long weekend line-up was the inflation of the Skywhale and Skywhalepapa hot air balloons that were designed and made by Patricia Piccinini.\n\nPiccinini's artworks are travelling around the country with Northam one of six national showings.\n\nFor a hot air balloon to take flight, on-ground wind speeds must not exceed 10 kilometres per hour, and the Avon Valley largely protects the area from such wind speeds.\n\nUnfortunately, due to unfavourable weather conditions, Piccinini's balloons were unable to take flight over Northam, instead tethering and putting on a show from the ground.\n\nThe Skywhale and Skywhalepapa hot air balloon art display. (ABC Midwest and Wheatbelt: Eliza Bidstrup)\n\nShire of Northam president Chris Antonio said the town's ability to embrace the cool conditions of the Avon Valley that were ideal for hot air ballooning, and turn them into a thriving tourist economy, was vital to the growth of the region.\n\n\"Leveraging our unique climate and tying it in with ballooning is more important than I probably even realised,\" he said.\n\n\"Traditionally in WA, tourism booms through the sunny months of the year, but we've been able to make tourism work in the peak of winter — that's our busiest time of year.\n\n\"We are able to position ourselves as the ballooning capital of Australia.\"\n\nChris Antonio says the community is redefining tourism in the region. (ABC Midwest Wheatbelt: Eliza Bidstrup)\n\nMr Antonio said the town, which traditionally operated as a service town for smaller Wheatbelt communities, had previously struggled to establish a strong brand with tourists, but through hot air ballooning had become competitive with other tourism regions of the state.\n\n\"We're not going to compete with the Margaret Rivers of the world — we don't have beaches and we are OK with that,\" he said.\n\n\"But when winter comes, we have the flowing Avon River and the hot air balloons.\n\n\"You can't do that in other places. That is our point of difference.\"\n\nLinda Vernon says tourists are increasingly heading inland. (Supplied: Jessica McCartney)\n\nSpeaking at the Wheatbelt Futures Forum in Northam in May, North Eastern Wheatbelt TRAVEL's Linda Vernon said there was limited data on tourism in the region as a whole, with more focus on areas such as the South West.\n\nDespite limited data, she said there had been growth in visitor numbers to the Wheatbelt over the past decade that indicated an appetite for going inland.\n\n\"The tourism space in the Wheatbelt is still immature and emerging,\" she said.\n\nMs Vernon said feedback from tourists indicated that drawcards were niche events allowing visitors to connect with residents.\n\nHot air balloons float over the Avon River in Northam. (Supplied: Jacinta Negus)",
    "source": "ABC",
    "cluster_id": 9
  },
  {
    "url": "https://www.abc.net.au/news/2025-06-03/fwc-minimum-wage-award-2025-ruling/105367696",
    "title": "Millions of workers to get pay increase as minimum and award wages rise",
    "publish_date": "Tue, 03 Jun 2025 00:13:21 +0000",
    "category": "finance",
    "authors": [],
    "text": "Millions of Australian workers will get a 3.5 per cent pay rise from July 1, following the Fair Work Commission's (FWC) annual review of the minimum wage and award agreements.\n\nThe commission's decision increases the national minimum wage to $24.95 per hour or $948 per week, based on a full-time, 38-hour working week.\n\nInflation is currently at 2.4 per cent annually.\n\nWhile the national minimum wage covers a small proportion of the workforce, about a fifth of all employees in Australia are paid at a minimum award rate.\n\nWorkers reliant on award wages are disproportionately female and more than half are employed casually, while two-thirds work part-time hours and more than a third are low paid.\n\nThis means the wages paid to award workers only make up 10.5 per cent of the national \"wage bill\", the FWC noted.\n\nAward workers are concentrated in the accommodation and food services, health care and social assistance, retail trade, and administrative and support services sectors.\n\n\"The principal decision which has guided our decision is the fact that, since July 2021, the real value of modern award wages … has declined by 4.5 percentage points relative to inflation,\" the review read.\n\nThe FWC said at its last three annual decisions, it put off taking action to reverse the decline in real wages \"out of a concern that this might result in the further persistence of higher inflation\".\n\n\" The result has been that living standards for employees dependent on modern award wages have been squeezed and the low paid have experienced greater difficulty in meeting their everyday needs. \"\n\nIt said with inflation now back within the Reserve Bank's 2-3 per cent target range, it has now taken the opportunity to go some of the way to correcting the decline in real wages.\n\n\"We are concerned that if this opportunity is not taken in this Review, the loss in the real value of wages which has occurred will become permanently embedded in the modern award system, and the [national minimum wage] and a reduction in living standards for the lowest paid in the community will thereby be entrenched,\" the decision stated.\n\n3.5pc increase lands in between business and union calls\n\nThe FWC ruling was announced today after lobbying from various groups.\n\nThe federal government had argued for an \"economically sustainable real wage increase\" — while not putting a firm figure on its request, it indicated support for a wage rise above inflation.\n\nBusiness groups including the Australian Retailers Association and the Australian Chamber of Commerce and Industry had called for no more than 2.5 per cent, arguing any more would put too much pressure on employers.\n\nAustralian Industry Group was slightly higher at 2.6 per cent.\n\nMeanwhile, the Australian Council of Trade Unions (ACTU) had lobbied for a rise of up to 4.5 per cent.\n\nACTU secretary Sally McManus welcomed the FWC decision, describing it as a \"great outcome\".\n\n\"It's 1.1 per cent more than inflation, so it means that, finally, award wage workers in Australia — our lowest-paid workers — are getting ahead again,\" she told a press conference.\n\n\"The Fair Work Commission accepted the arguments made by unions that it was time for low-wage workers, award workers, to start catching up for what was lost during the inflation spike.\"\n\nThe FWC boosted the minimum wage and awards by 3.75 per cent last year, after higher inflation pushed real wage growth further down in comparison.",
    "source": "ABC",
    "cluster_id": 0
  },
  {
    "url": "https://www.abc.net.au/news/2025-06-03/woman-with-persistent-cough-diagnosed-b-cell-burkitt-lymphoma/105352730",
    "title": "Woman's stubborn cough turns out to be deadly disease",
    "publish_date": "Mon, 02 Jun 2025 23:22:16 +0000",
    "category": "lifestyle",
    "authors": [],
    "text": "Childhood educator Jessie Stott knew something was not right when she could not shake an aggressive cough for more than three months.\n\nMs Stott, 33, had always led an active and healthy lifestyle.\n\nJessie Stott and Lucas Vogelpoel had their lives turned upside down by what they thought was the flu. (Supplied: Jessie Stott)\n\nThe Nirimba resident, on Queensland's Sunshine Coast, trained at a gym five days a week, ate a balanced diet and had no family history of cancer.\n\nShe enjoyed her job and was studying nursing.\n\nShe and her high-school sweetheart partner, 37-year-old carpenter Lucas Vogelpoel, were even trying for a baby.\n\nBut her persistent cough would not go away.\n\n\"Doctors kept saying it was a viral infection, but then it kept getting worse,\" Ms Stott said.\n\nDeadly diagnosis\n\nAfter months of pushing for answers, her doctor ordered a CT scan in March.\n\nIt revealed an 80-millimetre growth on her chest — the size of an orange.\n\nShe was referred to a surgeon in April but the waiting time was more than two months.\n\nWith the growth pressing on her heart, no diagnosis and still no real answers, Ms Stott's symptoms worsened.\n\nThen in early May, late on a Friday night, she woke up unable to breathe and with a \"tingly\" left arm.\n\n\"I thought I was having a heart attack,\" Ms Stott said.\n\nShe was rushed to Sunshine Coast University Hospital.\n\nJessie Stott has been in hospital since early May. (Supplied: Jessie Stott)\n\nAfter advocating for herself again while in hospital, Ms Stott received a diagnosis.\n\nIt was B-cell lymphoma.\n\nJust a few weeks later she was told the mass had grown by another 20 centimetres.\n\nA biopsy confirmed it was Burkitt lymphoma, an aggressive form of cancer requiring immediate and intensive chemotherapy.\n\nBurkitt lymphoma is extremely rare and known for rapidly expanding.\n\nForgoing fertility\n\nMs Stott has since been undergoing intensive chemotherapy.\n\n\"We were booked in for an IVF cycle, which we had to forgo,\" Ms Stott said.\n\nMr Vogelpoel said it was heartbreaking to give up the IVF.\n\n\"But her health is more important,\" he said.\n\nMs Stott has four months of exhausting treatment ahead of her, involving 21-day chemotherapy cycles with a seven-day break in between.\n\nShe also has three lumbar punctures a week, where medical staff jab a needle into her spine to remove fluid, then inject her with chemotherapy.\n\n\"It's very painful,\" Ms Stott said.\n\nKnowing your body\n\nGeneral practitioner Katie Gardner, who is also clinical editor at Country to Coast Queensland, said it could be worth following up with a doctor if flu-like symptoms lasted longer than a week.\n\n\"Australians generally report high satisfaction with their GPs,\" she said.\n\n\"But if you feel your concerns aren't being heard or taken seriously, the first step is to raise them directly with your treating doctor, especially if you've noticed a pattern over time or worsening symptoms.\n\nShe said people who were still concerned could ask whether further tests or a referral might be appropriate, seek a second opinion from another GP, or call 13 HEALTH (13 43 25 84).\n\n\"You know your body best,\" she said.\n\n\"If something doesn't feel right, it's OK to keep asking questions or request additional follow-up.\"\n\nKatie Gardner says it is OK for patients to seek further treatment if they are concerned. (Supplied: Country to Coast Queensland)\n\nMs Stott said pushing doctors for answers saved her life.\n\n\"If I didn't keep pushing I'd still be waiting for a diagnosis,\" she said.\n\n\"Most people don't get to hospital until it's too late and their airways are closing.\n\n\"People know their own bodies and if you feel like something isn't right, just keep pushing.\"",
    "source": "ABC",
    "cluster_id": 10
  },
  {
    "url": "https://www.abc.net.au/news/2025-06-03/john-yoko-one-one-documentary-new-york-activism/105366464",
    "title": "New doco might make you rethink John Lennon and Yoko Ono's impact in the 70s",
    "publish_date": "Mon, 02 Jun 2025 23:10:48 +0000",
    "category": "entertainment",
    "authors": [],
    "text": "In 1971, John Lennon and his wife Yoko Ono swapped their Ascot mansion and 70-acre estate for a two-room loft in New York's Greenwich Village.\n\nThey threw themselves headfirst into the political and social movements of the time, helping the counterculture pick up the pieces after what Lennon perceived as the failure of the 'Flower Power' movement in the years prior.\n\nIt was a significant move for arguably the most famous singer of all time. Lennon turned his back on what could have been an enviable life as part of high society and instead invested his energy and money in ensuring the youth of America didn't become apathetic in the quest for non-violence and equality.\n\n\"I'm happy as Larry,\" Lennon said at the time. \"I feel like a student again. We're like a young married couple.\"\n\nThe only full concert John Lennon played after the break-up of The Beatles is a key part of this new documentary about his life with Yoko Ono in the early 1970s. (Supplied: Sydney Film Festival)\n\nOne To One: John and Yoko is a fascinating, fast-paced collage of old footage and taped phone conversations that take us inside the couples' movements at this time.\n\nThe phone calls are particularly compelling as we hear the couple scheming, cycling through a variety of causes, seemingly aching for places they can lend their celebrity clout to raise awareness.\n\nThere are a few recurring narratives throughout that keep us engrossed. One of them involves capturing thousands of live flies for a Yoko Ono art exhibit, another sees them convince infamous Bob Dylan stalker A. J. Weberman to back off his target, while there are chilling moments where Lennon — who was shot dead in 1980 — ruminates about becoming a target when appearing at key demonstrations.\n\nAnother through line revolves around the only full-length concert John Lennon gave after The Beatles's split and before his death.\n\nThe concert, which happened across two sessions at Madison Square Garden in 1972, was a benefit for the children of the Willowbrook School — an institution caring for children with intellectual disabilities. Footage from the show is great, but even more interesting is learning how the couple arrived at the idea to play the show.\n\nLoading YouTube content\n\nBecause there are so many individual examples of John and Yoko's activism, it makes for a fast-paced video diary with a frenetic energy that perhaps speaks to the couple's own chaotic momentum.\n\n\"I thought: There's enough here that we could just let them speak for themselves, allow the audience to eavesdrop on them and allow that to be part of the fun of the film,\" director Kevin Macdonald said in publicity materials around the film.\n\n\"I think that's much more interesting than a traditional biopic, where the filmmakers are trying to present a very coherent version of things. As we all know, life is chaotic and contradictory.\"\n\nEven if your interest in John and Yoko themselves is negligible, the film will still offer a captivating snapshot of the social and political climate of the time.\n\nWhether it's Carole Feraci's protest against Richard Nixon, the railing against inhumane conditions at Attica State prison, or the case of poet John Sinclair, who was jailed for 10 years for cannabis possession, the film covers plenty of historical moments that paint a riveting picture of the counterculture of the time. And people with a love for old New York City will revel in the way the film plops us right in that space and time.\n\nThe treatment of Yoko Ono by Lennon's adoring fans and even his Beatles band mates is laid bare in some confronting conversations, where the artist bluntly recounts the comments and violence she'd been subjected to.\n\nLoading YouTube content\n\nSpeaking of violence, Lennon's past behaviours are only vaguely hinted at. The takeaway message is that the John Lennon of the early 70s was a more enlightened man than the one who grew up scrapping in Liverpool and was violent towards his first wife, Cynthia, in the 1960s.\n\n\"I fell in love with an independent, eloquent, outspoken, creative genius,\" Lennon says at one point. \"I started waking up.\"\n\nWhile there may be a touch of hagiography about One To One, it's a rare example of a John Lennon documentary that offers something many fans might not have seen or even known about before. As far as history lessons go, it's totally compelling.\n\nAs we learned in the eight-hour 2021 documentary Get Back, which took us inside the recording of The Beatles's final album, being a fly on the wall for historical moments is a captivating prospect. This film moves far quicker, but the same idea applies: we're always shown what John and Yoko do rather than merely told about it.\n\n\"Very early on, I decided I wasn’t going to try and chase old men on their deathbeds to get their last John Lennon anecdote — which they've probably told before,\" director Macdonald said.\n\nOne To One: John & Yoko is a truly intimate capture of what drove this couple at a key point in their life, and how their very presence at this key moment had an impact on the countercultural movement of the time.\n\nOne To One: John & Yoko screens at the Sydney Film Festival this weekend.",
    "source": "ABC",
    "cluster_id": 11
  },
  {
    "url": "https://www.abc.net.au/news/2025-06-03/yalgoo-residents-wary-fijv-iron-ore-mine-groundwater-impacts/104357492",
    "title": "Shire unhappy with plans for iron ore mine that could destroy tunnel",
    "publish_date": "Mon, 02 Jun 2025 23:01:27 +0000",
    "category": "finance",
    "authors": [],
    "text": "Residents of a small inland community in Western Australia fear plans by a Chinese-backed company to build a large iron ore mine will cause irreversible damage to their underground water supply and damage a historic tourist hotspot.\n\nFI Joint Venture (FIJV) received environmental approval last year to build a 310-million-tonne open pit iron ore mine less than 20 kilometres from Yalgoo, a small Mid West WA community with historic roots in mining and pastoral operations.\n\nFIJV is owned by Hong Kong-based joint venture company Mineral Investment Technology Group (MITG), with shareholders in Oman.\n\nYalgoo residents are worried about the impact of the planned mine on their groundwater and the potential destruction of the historic Jokers Tunnel tourist attraction, a tunnel carved through solid rock by gold miners in the 1800s.\n\nYalgoo is a small inland town built on gold and pastoralism. (ABC Mid West Wheatbelt: Chris Lewis)\n\nThe Yogi mine has a groundwater licence to extract 4.5 gigalitres a year from the region.\n\nA gigalitre is 1 billion litres of water.\n\nThe Environmental Protection Authority has instructed that there must be \"no impact to quantity or quality of the Yalgoo Water Reserve\" and \"no adverse impacts to nearby groundwater users identified at risk within the drawdown area, including pastoral stations for stock use\".\n\nYalgoo shire's concerns\n\nShire of Yalgoo chief executive Ian Holland said he was worried.\n\nYalgoo Water Reserve is a priority public drinking water source. (ABC Mid West Wheatbelt: Chris Lewis)\n\n\"The paleochannels are not terribly well known. We won't see the effects of the drawdown and de-watering of the mine until it has physically happened,\" Mr Holland said.\n\n\"There's, unfortunately, no way of knowing until the water starts getting pumped out.\n\n\"It will definitely affect stock water. Chances are more bores will be needed in different areas.\"\n\nAfter identifying that bores used to water livestock could be impacted by FIJV plans, the company said it would find an alternative water supply for any affected pastoralists.\n\nIan Holland says water sources will be impacted by the development. (ABC Mid West Wheatbelt: Chris Lewis)\n\nThe shire has lodged an objection in WA's mining Wardens Court against FIJV's plans for the Yalgoo area, which Mr Holland said could result in mining the hill containing tourist attraction Jokers Tunnel, risking its destruction.\n\nMr Holland said the shire had unsuccessfully attempted to negotiate compensation from the company if the tunnel were destroyed.\n\n\"We would like to see it protected into the future; it is a fantastic cultural and local tourist spot that has existed for the past 100 years,\" he said.\n\n\" The shire is looking at options for shoring up land tenure in the future. \"\n\nThe Yalgoo landscape has a history of mining and pastoral activity. (ABC Mid West and Wheatbelt: Chris Lewis)\n\nMr Holland said he hoped the prospect of the mine's 1,000 workers \"just up the road\" in a camp would benefit the small town of 300 people, which had a pub, a shop and a nursing post.\n\nHe said the shire was hoping for co-location of essential services, such as healthcare.\n\nHe also hoped some people working at the mine would choose to live in Yalgoo, rather than flying or driving in and out of the mining camp.\n\nBut he said the miner would build its own airstrip rather than using Yalgoo's.\n\nYalgoo is a sleepy outback town famous for its wildflowers and historic sites. (ABC Mid West Wheatbelt: Chris Lewis)\n\nInfrastructure for exporting\n\nTrucks carrying iron ore from inland mines to the closest port in Geraldton pass through Yalgoo every few minutes.\n\nAlong with its Yogi magnetite iron ore mine, FIJV wants to construct a 250-kilometre slurry pipeline from the mine to the Geraldton port as a way to transport the mineral.\n\nIt also plans a return water pipeline and a gas supply pipeline from Dampier in the north to the Bunbury Natural Gas Pipeline in the south.\n\nMr Holland welcomed a proposal that would not put more trucks on the road.\n\nBut he said the prospect of an above-ground pipeline through the shire presented concerns for livestock and native animal movement, and bushfire control.\n\n\"It would be nice to see co-investment for things like rail,\" he said.\n\nIn a statement, FIJV director Leon Taylor said the company was confident and excited about its mining development in the Yalgoo area, saying it would benefit the community and the region.\n\nMr Taylor said the shire's concerns about groundwater impact were misplaced.\n\n\"The water licence was granted subject to anticipated and strict conditions, including monitoring, and the company will comply with all conditions,\" a statement read.\n\nMr Taylor said the mining warden had asked the shire to produce statements in support of its objections by July 4, 2025.\n\nHe said the company would consider any written statements that it received from the shire, but could not comment further while the process was still in the Wardens Court.\n\nEarlier this year, FIJV announced an agreement with Green Iron and Steel Australia to develop a magnetite processing hub, producing shippable hot briquetted iron as part of a supply chain for low-emission steel production.",
    "source": "ABC",
    "cluster_id": 12
  },
  {
    "url": "https://www.abc.net.au/news/2025-06-03/f1-max-verstappen-addresses-george-russell-incident/105369796",
    "title": "'Emotions can run high': Verstappen addresses Russell incident",
    "publish_date": "Mon, 02 Jun 2025 22:56:27 +0000",
    "category": "sports",
    "authors": [],
    "text": "Max Verstappen says frustration caused \"a move that was not right and shouldn't have happened\", a day after initially appearing unrepentant over his collision with George Russell at Formula 1's Spanish Grand Prix.\n\nBefore the collision, Verstappen's Red Bull team asked him to give up a place to Russell. It followed an earlier incident between the two drivers when Russell tried to get past Verstappen, who went off the track.\n\nThe race stewards ruled Verstappen \"suddenly accelerated\" before the collision and Russell said it \"felt very deliberate\".\n\nThe stewards gave Verstappen a 10-second penalty, which dropped him from fifth to 10th and left him 49 points off standings leader Oscar Piastri, who won Sunday's race.\n\n\"We had an exciting strategy and good race in Barcelona, 'till the safety car came out. Our tire choice to the end and some moves after the safety car restart fuelled my frustration, leading to a move that was not right and shouldn't have happened,\" Verstappen wrote on Instagram.\n\n\"I always give everything out there for the team and emotions can run high. You win some together, you lose some together. See you (at the next race) in Montreal.\"\n\nInitially in the aftermath of the race, Verstappen had said that \"next time I will bring a tissue\", responding to Russell claiming he set a poor example for young drivers. Russell finished fourth.\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\nThe collision followed a series of setbacks for Verstappen, who had been in third and pressuring the two McLaren drivers in front before the safety car came out.\n\nRed Bull decided to bring Verstappen into the pits for fresh tires, even though the only ones he had left were slower hard-compound tires, a type that no other driver used.\n\nAt the restart, Verstappen lost grip and was overtaken by Charles Leclerc, whose Ferrari made contact with Verstappen's Red Bull. Neither driver was ruled at fault for that.\n\nVerstappen then went off the track while defending against Russell and Red Bull asked Verstappen to give up the place to Russell, apparently because the team expected Verstappen would be given a penalty. The stewards later ruled they would not have taken action against the Dutch driver for that incident.\n\nVerstappen needs to be careful in the next two races because the penalty for the collision with Russell also brought him penalty points on his licence, taking him to 11 in the past 12 months. Drivers get a one-race suspension if they hit 12 points in a year.\n\nTwo of those points expire at the end of the month but, until then, Verstappen needs to get through the Canadian and Austrian races without any further penalty points.\n\nThe ABC of SPORT Sports content to make you think... or allow you not to. A newsletter delivered each Saturday.\n\nAP",
    "source": "ABC",
    "cluster_id": 13
  },
  {
    "url": "https://www.abc.net.au/news/2025-06-03/perth-e-scooter-crash-victim-thanh-phan-in-critical-condition/105368170",
    "title": "Family 'in denial' as man hit by e-scooter in intensive care after surgery",
    "publish_date": "Mon, 02 Jun 2025 22:18:58 +0000",
    "category": "finance",
    "authors": [],
    "text": "A 51-year-old man remains in critical condition after being hit by an e-scooter allegedly being ridden by a woman under the influence of alcohol.\n\nThanh Phan was going out for dinner in Perth's CBD when he was struck, at the intersection of Murray and King streets.\n\nMr Phan was taken to Royal Perth Hospital, has undergone surgery, and remains in the intensive care unit.\n\nThe incident occurred at the intersection of Murray and King streets. (ABC News: Glyn Jones)\n\nFriends of the engineer, from the inner city suburb of Menora, said his family was anxiously waiting for any sign of improvement.\n\n\"When we visited, they said he had a very brief period of waking up again and being able to say his name and he knew where he was,\" neighbour Siobhan O'Halloran told the ABC.\n\n\"But the swelling in the brain was such that they had to operate to save him.\"\n\nMan's wife 'in shock'\n\nMs O'Halloran said Mr Phan's family had already recently endured hardship after his wife Loan Phan had a suspected stroke.\n\n\"He eventually helped her with rehabilitation and has been working from home ever since to support her. One of their boys has very high-needs autism and she spends a lot of her time caring for him,\" Ms O'Halloran said.\n\nMs O'Halloran's husband Lee Carroll said Ms Phan was struggling to come to terms with her husband's condition.\n\nA woman was allegedly under the influence of alcohol while riding the e-scooter with a passenger when she hit Thanh Phan. (ABC News: Glyn Jones)\n\n\"She's just still in shock, she's just in denial,\" Mr Carroll said.\n\n\"She speaks English as her second language [and] is now facing this heartbreaking crisis alone — caring for their sons, navigating a complex medical system, and trying to stay strong while her husband remains in a critical condition.\"\n\nMr Carroll said Mr Phan was the sole breadwinner of the family.\n\n'Very friendly' couple\n\nMr Carroll said Mr Phan and his wife were always very generous with their time.\n\n\"When we got COVID in our house, he and Loan brought over trays and trays of food, we didn't know them that well [at the time],\" he said.\n\n\"He's always been very, very friendly, affectionate and kind and gentle.\n\n\"He's loved having our kids over at his house, he shows them the fish pond that he made and the budgies that they have, he's just very kind and very gentle man.\"\n\nE-scooter rider faces court after allegedly hitting man while drunk Photo shows Escooters A 24-year-old woman visiting Western Australia is remanded in custody after allegedly critically injuring a man in an e-scooter crash over the weekend.\n\nMs O'Halloran said it was \"terrible\" to hear the news Mr Phan had been struck by an e-scooter.\n\n\"Other states have already ended the trial of e-scooters in the city because there are so many deaths and serious injuries arising from them,\" she said.\n\n\"For this to happen … as somebody tries to get to a restaurant in the city, I feel like everyone I talk to doesn't want to take their children or doesn't want to spend time in the city unless they have to.\"\n\nPolice allege 24-year-old Alicia Kemp was riding the e-scooter with a passenger when she hit Mr Phan on Saturday evening. Ms Kemp is due to reappear in the Perth Magistrates Court on Tuesday.\n\nThe passenger, a 26-year-old woman, was also taken to hospital with non-life-threatening injuries.\n\nMs Kemp, who the court has already heard was visiting WA, has been charged with dangerous driving causing grievous bodily harm, and dangerous driving causing bodily harm, while under the influence of alcohol.",
    "source": "ABC",
    "cluster_id": 14
  },
  {
    "url": "https://www.abc.net.au/news/2025-06-03/asic-sues-choosi-allegedly-misleading-insurance-comparison/105365786",
    "title": "ASIC accuses comparison site of promoting single insurer",
    "publish_date": "Mon, 02 Jun 2025 22:00:18 +0000",
    "category": "finance",
    "authors": [],
    "text": "The corporate regulator is suing insurance comparison provider Choosi for allegedly misleading customers through its insurance comparison services.\n\nIn proceedings filed to the Federal Court, the Australian Securities and Investments Commission (ASIC) alleges Choosi has misled Australians by claiming to compare a range of funeral and life insurers.\n\nOn its website, Choosi states: \"Compare the benefits and prices of a range of products from leading insurers so you can confidently choose cover that suits your needs, budget and lifestyle.\"\n\nASIC alleges Choosi has misled Australians by stating it compares a range of funeral and life insurers. (ABC News: Adelaide Miller)\n\nHowever, ASIC claims that from the middle of July 2019, Choosi has only compared policies issued by a single insurer, except for on one occasion.\n\n\"Choosi is only comparing one insurer — Hannover Insurance — and so we're concerned that the representations to those consumers who looked at the website and heard that advertising have been misled,\" ASIC's deputy chair Sarah Court told The Business.\n\nSarah Court alleges Choosi was being used as a platform to distribute Hannover products. (ABC News: Carl Saville)\n\nASIC alleges that while the three funeral insurance products on Choosi's website have different branding, they are all issued by Hannover.\n\nSimilarly, despite Choosi comparing five life insurance policies with different branding, they are once again all issued by Hannover — except for the period prior to July 2023, when Choosi included a single policy from an additional insurer.\n\nASIC says all policies were distributed by Greenstone Financial Services — a company associated with Choosi.\n\n\"From a consumers perspective, they've come onto a website, they're told we will compare a range of products from a number of leading insurers,\" says Ms Court.\n\n\" What we're alleging is that there were not a number of leading insurers or multiple insurers being compared, there was but one insurer. \"\n\nDo you know more? Have you used Choosi? Contact reporter Adelaide Miller at miller.adelaide@abc.net.au.\n\nMillions exposed to allegedly misleading comparisons\n\nHannover is a global insurance provider with two entities in Australia — property and casualty insurance, and life and health insurance.\n\nASIC is alleging Hannover paid Choosi about $61 million in commissions since 2019 to solely advertise products from its company on the comparison website.\n\nASIC alleges Hannover paid Choosi about $61 million in commissions since 2019 to solely advertise products from its company on the comparison website. (ABC News: Adelaide Miller)\n\n\"What we're seeing here is the Choosi platform really being used by Hannover as just a platform to distribute its products, with no comparison going on with other insurers at all,\" says Ms Court.\n\nShe says \"millions of people\" would have been exposed to Choosi's messaging over the six years since this arrangement began.\n\n\"We know that this was a very widespread advertising campaign by Choosi over many years... and we know there have been thousands of policies that have been sold,\" says Ms Court.\n\nASIC alleges Choosi made the misleading representations on its website, across social media, and via television commercials and advertorials.\n\nChoosi says it finds policies from a range of trusted insurance brands. (Supplied)\n\nFrom July 1, 2019, until November 30, 2024, 4,225 funeral insurance policies and 9,478 life insurance policies have been sold.\n\nASIC seeking 'substantial penalties'\n\nMs Court has told the ABC if the Federal Court finds Choosi has misled customers, then \"it will be important for [ASIC] to seek substantial penalties\".\n\n\"[It's] to send a message to Choosi, but also as importantly, to send a message to the broader industry and others that run comparison websites…\n\n\"If you want to run these kind of sites then you certainly have to be very open and transparent with consumers about what it is that you're comparing.\"\n\nMs Court says insurance comparison websites have an important role when they are operated and used correctly.\n\n\"We know that people are finding it difficult to afford insurance, difficult to access insurance, and so comparison websites could play a really important role in helping consumers with what is out there and helping them choose the products that are best for them.\"\n\nBut she warns consumers to be \"wary\".\n\n\"[These comparison sites] are effectively commercial businesses, they make money in certain ways.\n\n\"So with Choosi, it was from getting commissions paid to it from the one insurer whose products it was selling,\" she says.\n\nWhile she urges consumers to do some \"due diligence\" by checking the policy's product disclosure statements, she says the onus is on the provider to do the right thing.\n\n\"Anyone that is a commercial provider offering a comparison website, you have to be up-front with what it is you are comparing, you need to be transparent with anyone, any consumer that's coming on to use your site.\"",
    "source": "ABC",
    "cluster_id": 15
  },
  {
    "url": "https://www.abc.net.au/news/2025-06-03/asx-markets-business-live-news-june-3/105366014",
    "title": "Live: Minimum wage to rise above inflation, ASX on the rise",
    "publish_date": "Mon, 02 Jun 2025 21:54:23 +0000",
    "category": "finance",
    "authors": [
      "Stephanie Chalmers",
      "Daniel Ziffer",
      "Clint Jasper"
    ],
    "text": "The minutes of the Reserve Bank's May meeting have been released, providing some more insight into why the central bank cut rates by 0.25 percentage points and where to from here for interest rates.\n\nWe'll bring you across the detail as we read through, but here's some of what they had to say on the economic outlook:\n\n\"Members noted that the outlook for the global economy had deteriorated over the preceding three months, given developments in trade policies, but that the extent of the deterioration was unusually uncertain.\n\n\"In the baseline forecast — which assumed that tariffs remain around their current levels and that policy uncertainty gradually falls but remains high — growth in Australia's major trading partners (weighted by their share of Australia's exports) was expected to slow in 2025 and 2026…\n\n\"In light of those developments, and the most recent domestic data, the baseline forecast was for Australian GDP growth to pick up a little less rapidly than forecast three months earlier.\n\n\"That reflected three main assumptions: global demand for Australian exports was projected to be somewhat weaker; some weight was placed on the possibility that heightened policy uncertainty might dampen domestic investment and household spending; and near-term momentum in consumption was a little weaker…\n\n\"Underlying inflation was now expected to be around the midpoint of the 2–3 per cent target range throughout the forecast period…\n\n\"Given that the rapidly evolving and unpredictable global policy environment was creating more uncertainty than usual around the baseline forecasts, members also considered a range of alternative scenarios for how the Australian economy might evolve under different policy assumptions.\n\n\"One of these scenarios involved an escalation of the trade conflict in which much higher levels of tariffs are imposed permanently, causing global sentiment, growth and asset prices to fall sharply.\n\n\"Absent a material policy response, this would be likely to cause a sharp slowing in Australian GDP growth and an associated sharp rise in the unemployment rate.\n\n\"By contrast, there were scenarios in which there was a swift easing in the trade conflict, which could reduce policy uncertainty.\n\n\"Such scenarios, if still accompanied by stronger policy stimulus abroad than previously expected, could result in a more pronounced recovery in Australian output growth and somewhat higher inflation.\"",
    "source": "ABC",
    "cluster_id": 16
  },
  {
    "url": "https://www.abc.net.au/news/2025-06-03/antibiotics-in-wild-fish-near-salmon-farm-huon-tasmania/105366750",
    "title": "Salmon company Huon used more than tonne of antibiotics in a fortnight, report finds",
    "publish_date": "Mon, 02 Jun 2025 21:40:04 +0000",
    "category": "finance",
    "authors": [],
    "text": "Samples of wild fish caught near a Huon Aquaculture lease in February were found to have antibiotic residue levels up to a dozen times higher than the threshold for commercially sold salmon, according to an Environment Protection Authority (EPA) report.\n\nThe interim report monitoring Huon's antibiotic use was completed by environmental consultants Aquenal.\n\nAccording to the report, 1,133 kilograms of the antibiotic Oxytetracycline (OCT) was administered via fish feed at Huon's Zuidpool lease between February 13 and February 26 this year.\n\nIn February, a mass mortality event caused by the bacterial pathogen Piscirikettsia salmonis devastated salmon farms in the D'Entrecasteaux Channel, south of Hobart.\n\nIn one sample of wild fish, antibiotic traces 12 times higher than the maximum antibiotic threshold for commercially sold salmon was found. (ABC News: Luke Bowden)\n\nBetween January and March, the death of more than 13,500 tonnes of salmon was reported to the EPA by the three major salmon companies operating in the state.\n\nSalmon die-off in Tasmania 'largest we've ever seen' Photo shows a skip bin with salmon carcasses With Tasmania's salmon companies reeling from unprecedented losses due to disease and warm weather, the industry is told it will face investigation by the Environment Protection Authority.\n\nBy late February, Huon's Zuidpool lease had begun to draw public and media attention after the Bob Brown Foundation released drone footage showing workers at the lease putting live salmon into tubs along with dead stock.\n\nOily globules made of salmon fat began washing up along beaches on the channel, which were found to contain low levels of antibiotics.\n\nThe company, which is owned by Brazilian company JBS, has since lost its RSPCA certification.\n\nLoading...\n\nConsumption 'does not raise public health concerns'\n\nAccording to the Australian New Zealand Food Standard Code, salmon destined for sale must comply with an antibiotic maximum residue limit (MLT) of 0.2 milligrams per kilogram.\n\nHow many salmon farms are there in Tasmania — and who owns them? Photo shows Salmon farm location map 4 Those black, circular things floating in the water off the Tasmanian coastline? They are salmon farms. Here is how many there are — and who owns them.\n\nThe report said eight samples of wild fish were taken in the Zuidpool North lease, with three samples — all blue mackerel — testing above the reporting threshold.\n\nIt found one sample site with wild fish showing \"relatively high\" antibiotic residue levels of up to 2.4 milligrams per kilogram, or 12 times higher than the maximum antibiotic threshold for commercially sold salmon.\n\nIn a statement, Tasmanian Public Health Director Mark Veitch said the results were consistent with estimates used in a Food Safety Australia New Zealand (FSANZ) risk assessment.\n\n\"That concluded that consuming foreseeable quantities of such wild fish does not raise public health concerns,\" Dr Veitch said.\n\n\"These samples were collected in late February 2025, in the days after the period of [antibiotic] dosing ended, when antibiotic residue was most likely to be present in fish and the environment.\"\n\nDuring the mass salmon deaths, staff from Huon were seen collecting \"fatty globules\" from a beach at Verona Sands. (Supplied: Huon)\n\nMonitoring program ongoing\n\nThe report also tested at Zuidpool South, with no samples returning antibiotic residue levels above the limit of reporting.\n\nWhat's happening in Tassie's waters? Photo shows Blue algae glow on the coastline As an algal bloom ravages South Australia's marine life, a Tasmanian scientist says a succession of events in her state suggests the environment is under a lot of stress.\n\nSamples were also taken at five locations several kilometres from the Zuidpool salmon pens.\n\nOne of those sites, Ventenat Point on Bruny Island, recorded noticeably elevated antibiotic levels in blue mackerel that was sampled.\n\nVerona Sands, Jetty and Conleys Beach on Bruny Island, and Roaring Beach near Surveyors Bay were also sampled for antibiotic levels.\n\nAquenal said the results of those surveys will be released \"in subsequent reports\".\n\nThe EPA will release a final report with all sample results after the monitoring program finishes.\n\nWild fish at Roaring Beach near Surveyors Bay were also sampled for antibiotic levels. (ABC News: Luke Bowden)\n\nAntibiotic use in decline as vaccines rise\n\nA study conducted in 2022 found high rates of Antibiotic resistance in the food chain purchased from Australian supermarkets.\n\nIt raised concerns that prolonged exposure to antibiotic treatment could result in resistant bacterial strainers that were more difficult to treat.\n\nThis year the EPA would not disclose how much antibiotic was being used by Huon, citing commercial in confidence.\n\n\"If individuals are concerned at all about potentially having antibiotics in wild fish, then of course they can choose to fish further away from the [affected] lease,\" former EPA Tasmania director Wes Ford said at the time.\n\nAntibiotics have been commonly used by salmon companies to treat bacterial diseases.\n\nHowever, the EPA said antibiotic treatment has declined since 2009 due to the development of vaccines.\n\nIn 2022, Tassal used 675 kilograms of the same antibiotic to treat a vibrio outbreak at its Sheppards lease off the coast of Coningham.\n\nThree flathead caught 2 kilometres from the lease were also found to contain more than the reportable threshold of antibiotics in their flesh that same year.",
    "source": "ABC",
    "cluster_id": 17
  },
  {
    "url": "https://www.abc.net.au/news/2025-06-03/french-open-tennis-daria-kasatkina-tribute-to-australia/105369520",
    "title": "'Something new to me': Kasatkina praises Aussie fans after French Open exit",
    "publish_date": "Mon, 02 Jun 2025 21:37:31 +0000",
    "category": "sports",
    "authors": [],
    "text": "A proud Daria Kasatkina says the embrace she has felt from Australia during her first grand slam under its flag was like nothing she had ever known in her tennis career.\n\nKasatkina finally bowed out at the French Open on Monday, beaten by the 18-year-old phenom and her fellow Russian-born friend Mirra Andreeva 6-3, 7-5 after what the victorious teenager rightly called a \"hell of a match\" in the fourth round at Roland-Garros.\n\nTwo months after being granted permanent residency, Kasatkina's hopes of becoming the first Australian woman to reach the quarterfinals since Ash Barty's triumphant year of 2019 fell short, but the 28-year-old said she enjoyed being the \"last Aussie standing\".\n\n\"It's been a good start,\" she said.\n\n\"First of all it's been a good result but also, I felt super good to step on the court as an Australian player.\n\n\"To feel the support from the stands so many times. I don't know if everyone who was screaming, 'Aussie', were from Australia, but I felt this support. Also, on social media I'm getting a lot of support from the Australians that they are so happy to welcome me, and they're happy for me.\n\n\"So this is the kind of support which I honestly didn't have before, it feels like it's something new to me — but it feels so nice.\"\n\nWhen asked if everyone was now allowed to call her \"an Aussie battler\" after she had given the sixth seed a real scare with her second-set counterattack when she even earned a set point, Kasatkina offered a wry smile and replied: \"If you want to …\"\n\nIt was a tremendous match full of variety, like blitz chess between two all-court grandmasters, played in a fabulous spirit by two training partners.\n\nTheir 94-minute duel on Court Suzanne Lenglen ended with Kasatkina chucking her wristband jokingly at her conqueror at the net, while Andreeva informed the crowd tongue-in-cheek that she only practised with the Aussie because she hated her.\n\n\"Maybe we know each other too good, maybe we have to take a break in practising … no, I'm kidding,\" Kasatkina said.\n\nThe only other time they had played a match was in the final of last October's Ningbo Open in China, with Andreeva ending in tears and needing to be comforted by the player 10 years her senior after blowing a 3-0 lead in the final set.\n\nThings have clearly changed. Andreeva has grown up. This time, she said it was easy to put friendship aside as she repelled Kasatkina's second-set surge when the world No.17 went from 3-1 down to 5-3 up, with a combination of the most extraordinary defensive resolve and some ferocious attacking shots.\n\nAll looked lost for Kasatkina at the start of the second, but she lived up to her promise that she was ready to \"die on court\" as she chased down seemingly impossible causes and even outlasted the youngster to win one remarkable 26-shot rally.\n\nAnd that utter determination did give Andreeva problems as Kasatkina earned a set point on the youngster's delivery at 5-4, only to be deprived by a powerful forehand.\n\nOnce back level, Andreeva began to dictate. One piece of amazing retrieving also induced a dismal Kasatkina smash into the net, and enabled her to break to love, before she sealed the deal on her second match point when the Aussie hit a forehand long.\n\nAndreeva has reached the quarters without dropping a set and is the youngest woman this century to achieve back-to-back last-eight appearances. Martina Hingis last did it in 1998.\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\nAsked if her input in practice might have helped Andreeva mature, Kasatkina said: \"I hope not!\"\n\nBut she did recognise a completely different force to the player she played in Ningbo.\n\n\"Well, she grew so much. I feel like she's taller and taller every single week, her serve's improving all the time and her movement is very good,\" she said.\n\nAustralian interest remains strong around the grounds, with world No.2 junior Emerson Jones through to the second round of the girls' event with a 6-1, 1-6, 6-2 win over American Capucine Jauffret.\n\nOlympic men's doubles champions John Peers and Matt Ebden beat Italian fourth seeds Andrea Vavassori and Simone Bolelli 6-2, 7-6 (8-6) to make the quarter-finals.\n\nSinner dominates Rublev to reach quarters\n\nTop-ranked men's player Jannik Sinner's latest dominant performance at the French Open was a 6-1, 6-3, 6-4 victory over No.17 Andrey Rublev to reach the quarterfinals and extend his Grand Slam winning streak to 18 matches.\n\nSinner is a three-time major champion who won the US Open last September and the Australian Open this January. Now he'll try to get to the semifinals at Roland-Garros for the second consecutive year and faces 62nd-ranked Alexander Bublik on Wednesday.\n\nSinner hasn't lost a set and has dropped a total of 30 games in Paris so far.\n\nSinner began somewhat slowly against Rublev under the lights at Court Philippe-Chatrier. Well, for four points, anyway. Rublev got two break points at 15-40 in the opening game, but Sinner erased those and was on his way.\n\nHe only faced one other break point the rest of the match and saved it, too.\n\nSinner finished the first set with 10 winners to just three unforced errors and kept the pressure on Rublev.\n\nEmotional Bublik creates history for Kazakhstan\n\nAlexander Bublik became the first man from Kazakhstan to reach the quarterfinals at a Grand Slam tournament, eliminating No.5 Jack Draper 5-7, 6-3, 6-2, 6-4.\n\nThe 27-year-old Bublik dropped to the court, smudging himself with the red clay, when he finished off the biggest win of his career.\n\n\"Sometimes in life, there is only one chance, and I had a feeling that that was mine and I couldn't let it slip,\" he told the crowd afterward.\n\n\"Standing here is the best moment of my life. Period.\"\n\nMoments later, he joked: \"I'm standing here like I won the thing.\"\n\nBublik managed to produce a total of 68 winners, 31 more than the left-handed Draper.\n\nAt No.62, Bublik is the lowest-ranked man to earn a pair of victories at Roland-Garros against opponents ranked in the top 10 since No.100 Andrei Medvedev in 1999. Bublik came back from a two-set deficit to defeat No.9 Alex de Minaur in the second round last week.\n\n\"I have a certain skill set to play tennis,\" Bublik said.\n\n\"And it worked marvelously today — 100 per cent one of the best days of my life and one of the best matches I have ever played in my life.\"\n\nDjokovic notches win number 100 at the Roland-Garros\n\nNovak Djokovic earned his 100th career French Open victory, a mark surpassed among men only by Rafael Nadal, by overwhelming Cam Norrie 6-2, 6-3, 6-2.\n\nDjokovic hasn't ceded a set on his way to the quarterfinals this year at Roland-Garros, where he has won three of his 24 Grand Slam titles.\n\n\"I feel good. Every day, I have more expectations about my game, (and with) 12 sets played, 12 sets won, everything is solid and positive,\" Djokovic said.\n\nThe 38-year-old Serbian had a pair of three-match losing streaks this season but seems to be in top form lately, including collecting his 100th title at the Geneva Open the week before play began in Paris. He also beat Norrie in Geneva.\n\n\"He was solid today, and he didn't give me anything,\" Norrie said.\n\n\"Defending well, serving well, returning well and very sharp.\"\n\nNext up for Djokovic is a matchup against No.3 seed Alexander Zverev.\n\n\"He definitely knows how to play tennis. He definitely knows what it means to be on the big stage and to play big matches,\" Zverev said about Djokovic.\n\n\"There is no doubt about that.\"\n\nDjokovic improved to 100-16 at the French Open. Nadal, who retired at the end of last season, went 112-4 while winning a record 14 championships at the clay-court major.\n\nGauff wins but still cops jokes about forgetting her racquets\n\nCoco Gauff earned her fifth consecutive trip to the French Open quarterfinals with a straight-sets victory, but she still is catching flak because she forgot to bring her racquets to a match earlier in the tournament.\n\nThe No.2-seeded Gauff, who won the 2023 US Open and was the runner-up in Paris in 2022, has been engaging in a bit of back-and-forth with another American and Roland-Garros quarterfinalist, Frances Tiafoe, over the equipment blunder.\n\nTiafoe teasingly called the 21-year-old Gauff \"Mrs Mature.\"\n\nGauff's retort: \"I feel like maybe just playing tennis, it forces you to grow up faster for some people. Maybe not him.\"\n\nIt was Tiafoe who first made that very mistake back in March, showing up for a match at the tournament in Indian Wells, California, without his racquets. He got plenty of ribbing on social media and from other players — including Gauff.\n\nSo when Gauff went to Court Philippe-Chatrier for her first-round match last week and opened her bag only to realise there weren't any rackets inside, the 27-year-old Tiafoe was only too happy to call her out.\n\n\"She was full out shaking her whole bag like it was an empty cookie jar on Chatrier. I was like, 'What are you doing?' … I'm going to keep ripping her for a long time. I've never seen someone (ranked No.2) in the world have zero things in her bag. That was incredible,\" Tiafoe said.\n\n\"That kind of thing is so big because it just makes everyone (realise) we're all human. People make mistakes, whether it's the team or her or whatever.\n\n\"That was a funny moment, especially (because) she tries to be Mrs Mature. That was great. I'm happy it happened to her. Hopefully it happens again.\"\n\nWild card wins through to the quarterfinals\n\nLoïs Boisson never had played at the French Open, let alone in the biggest arena at Roland-Garros. Nothing fazed the French wild card entry and now she is in the quarterfinals.\n\nBoisson, ranked 361st, threw her head back and roared after beating No.3 seed Jessica Pegula 3-6, 6-4, 6-4 on Court Philippe-Chatrier.\n\nShe is by far the lowest-ranked woman to beat someone ranked in the top five at the French Open in 40 years. The lowest previously in that span was No.179 Aniko Kapros, who eliminated No.5 Justine Henin in the first round in 2002.\n\nBoisson also is the lowest-ranked woman to reach the quarterfinals at Roland-Garros since at least 1985.\n\nQuite a victory, considering Pegula was the US Open runner-up last year. Understandably, Boisson was nervous as she served for the match and saved three break points.\n\nAfter Pegula missed an easy-looking winner at the net and clutched her head in her hands, Boisson had her first match point, the biggest point of her career.\n\nPegula returned a strong serve to the back of the court, where Boisson unleashed a forehand winner down the line. She then raised her arms and realised the enormity of her win.\n\n\"Thank you to all of you,\" Boisson told the crowd in her post-match interview.\n\n\"Playing on this court with such an atmosphere was really incredible.\"\n\nThe ABC of SPORT Sports content to make you think... or allow you not to. A newsletter delivered each Saturday.\n\nAAP/AP",
    "source": "ABC",
    "cluster_id": 18
  },
  {
    "url": "https://www.abc.net.au/news/2025-06-03/bare-knuckle-boxing-politics-metaphor/105366930",
    "title": "Politics as brutal as bare-knuckle boxing as leaders trade jabs",
    "publish_date": "Mon, 02 Jun 2025 21:19:37 +0000",
    "category": "sports",
    "authors": [],
    "text": "Bare-knuckle boxing is a fitting metaphor for politics — adults whacking each other for sport — but it's important to remember the difference: in politics, the public bears the brunt.\n\nNews of Perth potentially hosting its first official bare-knuckle boxing competition has tortured the WA government in recent weeks.\n\nThe West Australian newspaper revealed last month the WA branch of the Australian Medical Association (AMA) had written about the \"profound concern\" it held over fighters brandishing bare fists in a sanctioned bout.\n\nWhat's been glossed over in the ensuing debate is an admission from the AMA WA's president himself.\n\n\"It is argued that gloved boxing is more likely to result in brain injury than ungloved boxing,\" Dr Michael Page wrote in a blog post.\n\nA bare-knuckle boxing event is set to take place in Perth next month. (ABC News: Cason Ho)\n\nThat's right, it's arguably more dangerous to put fighters in a ring with gloves on than without, because they can punch harder and for longer without breaking their hands.\n\nMore long-term independent research is probably required to substantiate the claims either way, but it's worth considering if boxing gloves are for safety, or the theatre of safety.\n\nAnd just as gloves serve to protect a fighter's hands rather than the head of whoever's being punched, politics sometimes serves politicians rather than the people they represent.\n\nAthletes or barbarians\n\nIt would be inaccurate to say the AMA only believes getting punched by bare knuckles is dangerous — the group thinks getting hit in the head at all is dangerous, which is why it lobbied for mixed martial arts (MMA) competitions (fought with gloves) to be outlawed too.\n\nWA Premier Roger Cook has so far refused to step in and stop the event. (ABC News: Keane Bourke)\n\nLabor government ministers have repeatedly voiced their disdain for bare-knuckle boxing — including the premier, sports minister, and health minister — but they've refused to call off the competition proposed for next month.\n\nMeanwhile, the WA Liberals have pounced on the government for its inaction, and for allowing a sport that it says would set a \"shocking example\" for young men and the wider community.\n\nBasil Zempilas has called on the premier to step in over the bare-knuckle boxing event. (AAP: Richard Wainwright)\n\nShouting matches have ensued in parliament.\n\nBut let's be clear — both sides say organised fighting is OK. Just keep the gloves on.\n\nWoodside approval paves the way for the mother of all climate battles Photo shows Woodside future - North Rankin When all the hype and the fury are stripped away, the decision to extend the life of the gigantic North West Shelf LNG plant boils down to one thing — enabling the Browse gas project off the Kimberley coast.\n\nFor years the WA Labor government has supported MMA cage fight nights which inject millions of dollars into the economy, and the WA Liberal leader says the thin piece of padding on an MMA fighter's knuckles differentiates sport from \"barbaric\" violence.\n\nWhether bare-knuckle fighting should be allowed, or not, is a worthwhile discussion.\n\nThe question is whether debates should be guided by evidence, or by arbitrary lines drawn for political point scoring.\n\nAnd that goes for issues of national importance too — such as last week's controversial decision to extend the life of Australia's largest oil and gas project, Woodside Energy's North West Shelf.\n\nTheatre of politics\n\nYet that critically important decision was not devoid of theatre either.\n\nThe extension paves the way for Woodside's proposal to develop the Browse basin which contains gas reserves large enough to fuel all of Australia's domestic needs for almost 20 years, and environmentalists say it would make it Australia's largest carbon polluter.\n\nThe federal government has approved a plan to extend the life of the North West Shelf gas project in northern Western Australia. (ABC News: Charlie Mclean)\n\nIt's been a long road to get to this point. Countless discussions about balancing industry, economy, environment, and culture.\n\nAnd here comes the theatre.\n\nPart of those discussions is an ongoing study of the impact of industrial air emissions on ancient rock carvings in WA's north, near Woodside's Karratha gas plant.\n\nA progress report handed to the state government in June last year was only released a week ago on a late Friday afternoon, just days before the federal government gave the North West Shelf its tick of approval.\n\nThere are fears ancient petroglyphs could be degraded by increased emissions in the area. (ABC News: Alistair Bates)\n\nThe report came with a summary document stating \"the current levels of the pollutants of most concern for the rock art are lower than the interim guideline levels\".\n\nBut the summary omitted a graph line — still available in the full 800-page report — which showed five monitoring sites closest to industry were experiencing pollution above the interim guideline.\n\nPremier Cook's response: \"The science has said that modern industrial developments do not have a long-term impact.\"\n\nWoodside has been given approval to run the Karratha Gas Plant until 2070. (ABC News: Charlie Mclean)\n\nOne scientist involved in the study, who spoke to 7.30 on the condition of anonymity, said the premier's claim was \"simply false\".\n\nTraditional owners to keep fighting North West Shelf extension Photo shows A rock carving of an lizard on red rocks Traditional owners have pledged to continue fighting the decision to extend the North West Shelf gas plant, as environmentalists shift their focus to Woodside's next major project.\n\n\"We're talking about what is probably the cumulative effect of decades of pollution,\" the scientist said.\n\n\"There is this terminological or verbal gymnastic about whether it all happened in the past and is no longer happening ... but there's no reason to conclude that it has stopped.\"\n\nTheatre.\n\nPolitics is sometimes a spectacle, as bare-knuckle boxing is.\n\nThe difference is boxers volunteer to punch and get punched, while the public bears the consequences of politicians brandishing their knuckles in parliament.",
    "source": "ABC",
    "cluster_id": 19
  },
  {
    "url": "https://www.abc.net.au/news/2025-06-03/dairy-farmers-disappointed-farm-milk-prices/105346496",
    "title": "Struggling dairy farmers disappointed with milk prices",
    "publish_date": "Mon, 02 Jun 2025 21:15:10 +0000",
    "category": "finance",
    "authors": [],
    "text": "Dairy farmers have been disappointed by the farm gate milk prices announced for the next financial year as they continue to struggle with drought and floods.\n\nDairy companies have revealed their opening milk prices, a month before the start of the financial year, as required under the mandatory milk pricing code.\n\nThis year's milk prices are up slightly on last year, ranging from $8.60 to $9.20 per kilogram of milk solids.\n\nBut they are lower than what farmers were hoping for.\n\nDairy farmers are facing climate challenges and rising costs of production. (ABC Rural: Jane McNaughton)\n\n'Unprecedented' strain\n\nThe dairy heartlands of Victoria, South Australia and Tasmania are in the grips of drought, while many farms in New South Wales and Queensland are recovering from floods.\n\n\"This is not a normal year,\" Colac dairy farmer and Dairy Farmers Victoria president Mark Billing said.\n\n\"The climate challenges we are seeing right across Victoria, coupled with extraordinary cost increases on farm, mean that farmers are carrying unprecedented levels of financial and emotional strain.\"\n\nHe said companies risked the rapid decline of Australia's milk production if they did not increase prices to help dairy farmers through the tough times.\n\n\"Milk processors have repeatedly said they value their suppliers,\" Mr Billing said.\n\n\" This is the year where those words need to be backed by action. \"\n\nMark Billing says farmers are carrying unprecedented levels of strain. (ABC Rural: Jane McNaughton)\n\nHow much are they getting?\n\nThe majority of farmers are paid for the level of fat and protein in their milk, known as milk solids.\n\nMany were hoping to be paid at least $9.20 to $9.50 per kilogram of milk solids, which equated to about 70 cents per litre.\n\nMr Billing said the prices under $9.20 on offer from the dairy companies were not enough for farmers to get by.\n\nUnited Dairyfarmers of Victoria president Bernie Free agreed.\n\n\"It's pretty disappointing, really,\" he said.\n\nHe said some farmers would quit the industry if milk prices did not go up soon.\n\n\"I think it's a concern that farmers may move out of the industry at this price mark, especially in [drought-affected] western Victoria,\" he said.\n\n\"Gippsland is not far behind us, and there are pockets in north-east Victoria that are doing it pretty tough.\n\n\" There is only so long you can throw good money after bad. \"\n\nDairy farmers are disappointed by the price they will be paid for their milk. (ABC News: Warwick Long)\n\nMilk production drops\n\nDairy Australia's latest outlook shows the national milk pool is on track to drop 1 per cent this financial year, compared to the previous one.\n\nIt has also forecast a further drop in production of up to 2 per cent in 2025/26.\n\nIf that happened, milk production would sit around 8.24 billion litres, almost 3 billion less than the industry's peak in the early 2000s.\n\nDairy Australia analysis and insights manager, Eliza Redfern, said ongoing challenges with the weather were affecting production.\n\n\"We are also seeing a lower appetite for farm business growth, and we do expect some farm exits to continue within the new season,\" she said.\n\nDairy Australia is forecasting a drop in national milk production next financial year. (ABC News: Maren Preuss)\n\nHigher price than last year\n\nFonterra Oceania was the first milk company to announce its opening milk price for the next season, with one of the lowest prices — an average of $8.60 per kilo of milk solids.\n\nIts director of farm source and sustainability, Matt Watt, said while it was higher than last year's opening price, he understood farmers would like more.\n\n\"What we've got to do is make sure we're running a business that is here, not only this year, but for years to come,\" he said.\n\n\"That's our job, frankly, to make sure that we're continuing to make decisions that support paying a milk price that we're earning in the market.\n\n\"Sometimes that is a milk price that farmers appreciate and enjoy, and other times it takes a bit of time.\"",
    "source": "ABC",
    "cluster_id": 20
  },
  {
    "url": "https://www.smh.com.au/national/queensland/brisbane-news-live-investigation-under-way-after-patient-killed-at-brisbane-hospital-20250602-p5m44p.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Brisbane news live: Probe into death of man attacked by patient | Fair Work Commission lifts minimum wage | Revamped inner-city train station opens tomorrow",
    "publish_date": "Tue, 03 Jun 2025 12:01:43 +1000",
    "category": "finance",
    "authors": [],
    "text": "The state government has completed building the much-anticipated Exhibition station, but says it will only operate for major events, such as the Ekka, until Cross River Rail opens in 2029.\n\nSpeaking to ABC Radio, Transport Minister Brent Mickelberg said the station was “considerably upgraded” to better cope with large crowds and boost accessibility for people with disabilities.\n\nThe upgraded Exhibition station. Credit: Queensland Government\n\nMickelberg added the government was “really pleased” to open the station for its first event tomorrow, the Caravan and Camping Supershow, running until Sunday.\n\n“Once Cross River Rail is finished in the future, it will also be [part] of the existing loop – or the existing route, rather – so it’ll be used day to day as well,” he said.\n\nMickelberg said delays on both the station and Cross River Rail had caused disappointment, adding it “would be great” to have had the Exhibition station opened “a couple of years ago”, but he said the focus was on meeting revised deadlines.",
    "source": "SMH",
    "cluster_id": 21
  },
  {
    "url": "https://www.smh.com.au/money/planning-and-budgeting/this-kitschy-70s-fad-is-having-a-comeback-with-a-hefty-price-tag-20250603-p5m4gq.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "This kitschy ’70s fad is having a comeback (with a hefty price tag)",
    "publish_date": "Tue, 03 Jun 2025 12:00:18 +1000",
    "category": "entertainment",
    "authors": [
      "Stephen Crafti"
    ],
    "text": "Shell art isn’t a new genre; it’s been with us for centuries. The Victorians often framed their family photos with shells. The peacock, with its picturesque plumage, is frequently used as the subject for shell art, whether from the 19th century or the 1950s, when shell art gained momentum.\n\nThe medium also came to the fore in the 1970s when everything was embellished with shells, from photo frames and mirrors to trinket boxes and even furniture. And if you think these pieces should just be relegated to the ’70s beach shack then take another look, as shell art finds its own place in history decades later.\n\nA recently completed beach house featuring an extensive collection of shell art. Credit: Trevor Mein\n\nAlthough shell art can often be spotted in vintage stores, there’s no shortage of it on websites such as Etsy. This writer found some alluring pieces, such as a Victorian black-and-white photo of a mother and her child, ornately framed with seashells – as richly detailed as Victorian lace.\n\nPriced at $470, its workmanship is as impressive as that of the finest silver frames. Those searching may also be tempted by Chinese shell-art birds exquisitely depicted sitting in a blossom tree and priced at $373.",
    "source": "SMH",
    "cluster_id": 22
  },
  {
    "url": "https://www.smh.com.au/business/markets/why-america-may-never-be-great-again-20250603-p5m4fb.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Why America may never be great again",
    "publish_date": "Tue, 03 Jun 2025 11:59:01 +1000",
    "category": "finance",
    "authors": [
      "Stephen Bartholomeusz"
    ],
    "text": "America’s government finances are about to get a lot worse. The “One Big Beautiful Bill Act” currently before the US Senate, with its extension of Trump’s 2017 tax cuts, would add more than $US3.3 trillion to that debt within a decade and (because the spending measures are front-loaded, with expenditure cuts deferred) about 1.8 percentage points to the US debt-to-GDP ratio in its first year. Trump and his administration risk isolating America as they look to bully the rest of the world. Credit: Bloomberg Concern about the increase in debt the bill would generate, along with the chaos created by Trump’s tariffs, have already caused US bond yields to rise significantly and produced some weakness in demand in auctions of bonds with longer durations. Bond investors want to be compensated for the perceived increase in risk of holding bonds for 20 or 30 years. The demand versus supply challenge created by the sheer volume of debt the market is being asked to absorb is exacerbated by the changes to US bank regulation that were made after the 2008 financial crisis.\n\nLoading Dimon’s reference to market makers relates to the requirement that banks hold capital and liquidity against risks, with Treasury securities treated no differently to other assets. In a crisis, and a big short falling demand for a US bond issue, the banks, as “primary dealers,” would be expected to step up and fill the void, but those requirements might prevent them from doing so. The Trump administration has raised the prospect of bank deregulation, with the “supplementary leverage ratio,” which requires banks to hold a minimum 3 per cent of common equity relative to their total assets, likely to be lowered. Dimon isn’t the only senior Wall Street figure worried about the potential for an implosion in the bond market.\n\nSpeaking at the same Reagan National Economic Forum in California as Dimon, former Goldman Sachs president and Trump adviser in his first term, Gary Cohn, said that the US has “the most robust debt market in the world, until we don’t.” “If there lacks interest from foreign investors, and there lacks interest from US investors...rates will move out dramatically. “One or two auctions later, you could be in a completely different system. “And then, when the government gets to a point where it can’t efficiently finance itself, we have a completely different position. And when we’re there, it’s almost too late to deal with,” he said. The White House, of course, isn’t concerned, arguing that growth from its tax cuts and spending will grow the economy at a rate will resolve the threat of rising deficits and debt and shrink the deficit and debt ratios.\n\nThe Treasury Secretary, Scott Bessent, pushed back against criticism of the One Big Beautiful Bill Act impact on the deficits and debt. “This bill is going to create growth. I’m not worried about the US debt dynamics because a change in the growth trajectory takes care of a lot of that, he said, predicting that, within a year, the US economy will be growing at more than 3 per cent. That might be somewhat optimistic. Trump’s tariffs, if he is allowed by the courts to impose them, or finds other mechanisms for doing so, will subtract from growth. The US dollar is under increasing pressure. It is also the case that the $US4 trillion-plus of tax cuts aren’t actually stimulatory cuts, but an extension of the 2017 tax cuts that were scheduled to expire in December. Their extension might avoid what would otherwise be contractionary tax increases, but it is stretching it somewhat to see them as turbocharging growth.\n\nThere’s also, given the nervousness of investors, particularly foreign investors, about the Trump administration’s love of destabilising tariffs and the blow-out in government spending that would occur if the One Big Beautiful Bill is enacted, another potentially destructive element in the legislation. Section 899 of the bill would enable the US Treasury to impose penalties on foreign investors or companies by imposing punitive income and withholding taxes on them – up to 20 percentage points on their US investments – if the US deems their governments have imposed unfair taxes on US companies. Loading The European Union, the UK, Canada, Australia and others with valued-added taxes (our GST) or digital sales taxes would be obvious targets. Section 899 would apply to dividends, the interest on corporate (and possibly government) bonds and corporate profits and would also apply to the holdings of sovereign wealth funds that are currently exempt from taxes.\n\nThere’s already a “Sell America” trade underway. Even as US bond yields have risen, the US dollar has fallen almost 10 per cent this year, a reversal of the normal correlation. Trump’s trade wars and the expected spending binge and deterioration in America’s public finances – a prospect that saw the US lose its last AAA credit rating last month – are the reasons there have been outflows of capital from the US this year. If Section 899 were enacted – or if foreign investors thought it was likely to be enacted – there would be a real exodus of capital from the US. Interest rates would spike even more and investment and growth would shrink. The prospect of US Treasury calling a bond auction where no-one turned up would strengthen. If no-one wants to buy US assets, or are scared away from the US markets and economy by the administration’s policies, the dollar won’t remain dominant and America will never be great again. Trump and his administration want to bully the rest of the world. They want to dictate other countries’ trade, tax and social policies while still seeking their investment – indeed, demanding that they invest more – to “make America Great Again.”",
    "source": "SMH",
    "cluster_id": 23
  },
  {
    "url": "https://www.smh.com.au/sport/tennis/kasatkina-thanks-aussies-for-pulling-her-out-of-hole-20250603-p5m4j6.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Kasatkina thanks Aussies for pulling her out of 'hole'",
    "publish_date": "Tue, 03 Jun 2025 11:57:01 +1000",
    "category": "finance",
    "authors": [],
    "text": "Kasatkina thanks Aussies for pulling her out of 'hole'\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later. Dismiss\n\nOur network\n\nOpen Navigation Menu The Sydney Morning Herald",
    "source": "SMH",
    "cluster_id": 24
  },
  {
    "url": "https://www.smh.com.au/sport/greg-swann-announces-departure-from-brisbane-lions-20250603-p5m4j7.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Greg Swann announces departure from Brisbane Lions",
    "publish_date": "Tue, 03 Jun 2025 11:57:00 +1000",
    "category": "finance",
    "authors": [],
    "text": "Greg Swann announces departure from Brisbane Lions\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 25
  },
  {
    "url": "https://www.smh.com.au/national/victoria/erin-patterson-mushroom-trial-updates-live-accused-triple-killer-to-return-to-the-witness-box-20250603-p5m4eq.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Erin Patterson mushroom trial updates LIVE: Accused triple killer to return to the witness box",
    "publish_date": "Tue, 03 Jun 2025 11:56:07 +1000",
    "category": "lifestyle",
    "authors": [
      "Marta Pascual Juanola",
      "Erin Pearson"
    ],
    "text": "In the witness box, Erin Patterson occasionally grins and fiddles with her hands.\n\nHer lawyer, Colin Mandy, SC, has moved to a new line of questioning: Patterson’s health history.\n\nErin Patterson. Credit: Jason South\n\nPatterson said she had never been diagnosed with ovarian cancer or had a biopsy on her elbow, but she confirmed she had raised concerns with doctors that she might have cancer.\n\n“I’d been having for a few months a multitude of symptoms. I felt very fatigued, I had ongoing abdominal pain, I had chronic headaches. I put on a lot of weight in quite a short period of time ... my feet and my hands seemed to retain a lot of fluid,” she said.\n\nPatterson said that what sent her “over the edge” to go to the doctor was that her wedding ring would no longer fit. She said she had the ring resized, but it did not fit again within a short period. “I consulted with Dr Google,” she said.\n\nDefence counsel Colin Mandy, SC, outside court. Credit: Jason South\n\n“I had a family history of it [ovarian cancer] on both sides of my parents. I’d had an ovarian cyst myself in about 2002 and my daughter had an ovarian mass when she was a baby.”\n\nPatterson said her daughter would cry for long periods of time, so she took the child to doctors, who told her she was an “overanxious mother” and she should relax. “She was eight months old by the time it was actually diagnosed,” she said of her daughter’s ovarian mass.\n\nPatterson said she discovered the mass while massaging her daughter’s abdomen after a bath in August 2013.\n\n“They still dismissed me, even then. They thought she just had a very full bladder,” the accused said.\n\nBut the lump remained.\n\nIt was that experience, that moment, Patterson said, that considerably damaged her faith in the health system.\n\nPatterson said she didn’t like hospitals before, but the experience made her distrust health professionals. “I didn’t want to lose her,” she said.\n\nShe said the experience also played a part when she discharged herself from hospital in January 2015. “I didn’t want to be there,” she said.\n\nPatterson said that after the removal of the mass from her daughter’s ovary, the girl continued to have ongoing pain and gastrointestinal issues. “She got to a point where she was four and they finally did an X-ray on her which showed that she was completely backed up,” Patterson said.\n\nPatterson said the experience was distressing for her daughter. “She’s 11 and she still remembers that.”",
    "source": "SMH",
    "cluster_id": 26
  },
  {
    "url": "https://www.smh.com.au/goodfood/recipes/warm-korean-style-beef-noodle-salad-20250512-p5lyjl.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Warm Korean-style beef noodle salad",
    "publish_date": "Tue, 03 Jun 2025 11:56:02 +1000",
    "category": "lifestyle",
    "authors": [
      "Neil Perry"
    ],
    "text": "Step 1 Marinate the beef in half the soy sauce, sugar and sesame oil for 20 minutes.\n\nStep 2 In a wok, heat the vegetable oil until almost smoking. Add the beef and mushroom slices, and stir-fry for about 4 minutes until both are well cooked. Set aside in a bowl.\n\nStep 3 Add the onion and a pinch of salt to the hot wok and stir-fry for 1 minute until soft and coloured. Add the carrot and cook for a further minute, then add the spinach and remaining sugar, soy and sesame oil. Return the beef and mushrooms to the wok and toss to heat through.",
    "source": "SMH",
    "cluster_id": 27
  },
  {
    "url": "https://www.smh.com.au/sport/nrl/what-ezra-mam-really-thinks-of-you-booing-him-20250602-p5m45z.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "What Ezra Mam really thinks of you booing him",
    "publish_date": "Tue, 03 Jun 2025 11:45:00 +1000",
    "category": "sports",
    "authors": [
      "Christian Nicolussi"
    ],
    "text": "Ezra Mam initially believed Manly fans were booing him for calling out racism, rather than anything to do with the perceived light punishment he received from the NRL after he injured three people while driving under the influence of drugs.\n\nMam was heckled almost every time he caught the ball at 4 Pines Park during Brisbane’s 34-6 loss to the Sea Eagles.\n\nIt was his second game back in the NRL – but his first outside of Brisbane – since he returned from a nine-match ban from the NRL.\n\nMam crashed his ute in Brisbane’s west last October, injured an Uber driver and his two passengers, including a young girl, and was later charged with drug driving and driving without a licence. He was fined $850 and had his licence suspended for nine months, before the NRL handed down their own ban.",
    "source": "SMH",
    "cluster_id": 28
  },
  {
    "url": "https://www.smh.com.au/sport/rugby-union/anderson-leads-reds-into-finals-20250603-p5m4iv.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Anderson Leads Reds into Finals",
    "publish_date": "Tue, 03 Jun 2025 11:42:55 +1000",
    "category": "sports",
    "authors": [],
    "text": "Anderson Leads Reds into Finals\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 29
  },
  {
    "url": "https://www.smh.com.au/sport/rugby-union/controversy-in-canberra-20250603-p5m4it.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Controversy in Canberra",
    "publish_date": "Tue, 03 Jun 2025 11:42:03 +1000",
    "category": "finance",
    "authors": [],
    "text": "Controversy in Canberra\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 30
  },
  {
    "url": "https://www.smh.com.au/national/nsw/beneath-sydney-a-mini-city-is-being-dug-for-machines-bigger-than-an-aircraft-fuselage-20250207-p5lacw.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Beneath Sydney, a mini-city is being dug for machines bigger than an aircraft fuselage",
    "publish_date": "Tue, 03 Jun 2025 11:30:00 +1000",
    "category": "finance",
    "authors": [
      "Matt O'Sullivan"
    ],
    "text": "Save Log in , register or subscribe to save articles for later. Save articles for later Add articles to your saved list and come back to them any time. Got it Normal text size Larger text size Very large text size Deep under an inner-city Sydney suburb, two giant caverns each large enough to house an A380 superjumbo’s fuselage and tail are being carved out of sandstone. About 120 metres long, 26 metres high and 18 metres wide, the caverns illustrate the monumental scale of the task confronting engineers and other workers as they prepare to dig two motorway tunnels under Sydney Harbour between Birchgrove and Waverton. For the last decade, Sydney has become accustomed to tunnelling for metro train lines. Yet, two giant tunnelling machines to be shipped in parts from China later this year will dwarf those that completed Sydney’s first under-harbour rail crossing early this decade and are now worming their way under the city for the Metro West rail line between the central city and Parramatta. At about 16 metres in diameter, the tunnel boring machines for the $7 billion Western Harbour Tunnel will be the largest in the Southern Hemisphere. The twin three-lane wide motorway tunnels will each be large enough to fit four metro rail tunnels. While the project is the envy of tunnellers around the world, Transport for NSW project director Simon Cooper said the planned under-harbour crossing was “very, very complicated technically”. “We’re building little cities underground that nobody is ever going to see that will enable our project. And when all the work’s done, we will pack it away,” he said. “When you are abroad, you hear about Sydney Harbour; you hear about the bridge. An opportunity to go under a harbour as a tunneller is ... something any tunneller around the world wants to do.”\n\nAdvertisement\n\nLike mobile factories, each of the boring machines will house up to 20 workers at any one time. Spanish contractor Acciona will operate the machines around the clock, slicing through about 55 metres of rock and sediment a week. Making the project more challenging, the machines will be assembled in the tight confines of the so-called launch chambers beneath Birchgrove before starting their 1.5-kilometre journey early next year under the harbour towards Waverton. Excavation equipment known as road-headers with large rotating cutting heads began chiselling away at sandstone deep beneath an oval and several houses in February to create the launch chambers, which are due to be completed by the end of the year. Construction workers in one of the giant vent chambers for the Western Harbour Tunnel. Credit: Janie Barrett Cooper said it was hard enough assembling boring machines above ground where cranes could move freely, let alone in a tight space underground. In fact, the team decided to add extra height to the chambers to avoid regrets lifting parts when the assembly begins. “It is a factory down there because not only are we having to assemble and have these big cranes in there, we then also have piping that goes backwards and forwards to our slurry treatment plants,” he explained. After a practice assembly in a Chinese warehouse, the parts that will make up the boring machines will arrive by ship at Glebe Island in coming months. Once offloaded, they will cover most of the waterfront area seen by motorists as they cross Anzac Bridge. When the assembly starts early next year, two 400-tonne bearings – equivalent to 200 cars – will have to be lifted into the caverns by gantry cranes. The bearings will hold the cutter heads to each of the machines, allowing them to spin.\n\nAdvertisement\n\nHighlighting the task ahead, the boring machines will have to tunnel through a portion of alluvial fill – a mixture of clay, silt and sand – under the harbour. Before they reach one of the riskiest parts of the tunnelling, up to 47 metres below the harbour surface, the giant machines will temporarily stop for a “freshen up”, which will include changing teeth on the cutter heads. Once they resume churning through the alluvial fill, the priority will be to ensure the machines do not stop. Engineers want to avoid them getting stuck like a boring machine did under the Snowy Mountains for the federal government’s multibillion-dollar pumped-hydro project. “That’s something that causes me worry, which is getting stuck under the harbour because there’s only one way to then get to it, which is then sinking something down,” Cooper explained. “If something gets stuck or wears out, then you don’t want to be going and trying to fix things in that bad ground because it’s dangerous for people, and it’s usually under pressure.” During tunnelling for the M1 metro rail line under the harbour in 2019, bubbles rose to the water surface directly above a giant tunnelling machine, alarming senior transport officials who feared that one of the tunnels had been damaged, and possibly breached. However, it quickly turned out to be vibrations from the boring machine that had disturbed air pockets within sediment on the harbour floor. Heralding from Hong Kong, Cooper is no stranger to mega projects having worked in the UK on schemes such as the second stage of the Channel Tunnel rail link before moving in 2008 to Australia where he has been involved with Sydney’s rail projects and the WestConnex motorway. “Going under the harbour is a big risk for us, especially in such a large machine. The ground conditions are not ideal. We’re doing everything possible to make sure that [from the tunnel boring] selection through to how we’re working ... that we can do it safely,” he said.\n\nAdvertisement\n\nThe use of boring machines represents a major U-turn on earlier plans. The previous NSW Coalition government decided to dig deeper tunnels for the main section of the motorway between Birchgrove and Waverton, ditching plans to lay large tubes in a trench on the harbour floor. At the peak of construction, about 500 people will be working underground at any one time. Apart from underground offices, about five support centres complete with kitchen facilities provide respite for workers during their breaks. “Tunnel environments are noisy. They have got somewhere comfortable to sit and have a real break,” said delivery director Dean McAllister, who worked on the $2.6 billion Sydney Gateway motorway and the NorthConnex tunnel. Excavation equipment known as road-headers are being used to carve out massive caverns to assemble the tunnel boring machines. Credit: Janie Barrett Two other chambers each about 42 metres long and 25 metres high have already been excavated for the under-harbour crossing. One of them will house a slurry treatment plant, and the other filter pressers and centrifuges to remove water in the soil. As the boring machines burrow their way under the harbour, slurry will be pumped into their cutter heads to counteract pressure. The circulating slurry will be mixed with the excavated material and pumped back to the treatment plant. After the borers complete their job, the two giant chambers will be used to house ventilation fans to circulate air through the motorway tunnels. Loading Inside the tunnels and caverns already carved out for the project’s first stage, it is noisy and humid as workers, diggers and other excavation equipment navigate the underground world. Cross passages are situated at regular intervals along the twin tunnels, which extend to a spaghetti junction at Rozelle for WestConnex. Trucks queue in the tunnels to collect spoil before emerging above ground to take their loads to development sites across the city. “It’s busier than Trafalgar Square. There are so many different things going on down there,” Cooper said.\n\nAdvertisement",
    "source": "SMH",
    "cluster_id": 31
  },
  {
    "url": "https://www.smh.com.au/culture/music/she-s-seen-the-chaos-of-life-and-the-quiet-of-death-gordi-won-t-stand-still-20250430-p5lvfd.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "She’s seen the chaos of life and the quiet of death. Gordi won’t stand still",
    "publish_date": "Tue, 03 Jun 2025 11:30:00 +1000",
    "category": "entertainment",
    "authors": [
      "Cassandra Morgan"
    ],
    "text": "Save Log in , register or subscribe to save articles for later. Save articles for later Add articles to your saved list and come back to them any time. Got it Normal text size Larger text size Very large text size Jet-lagged but beaming, Gordi is riding high on love for her latest release. But first we need to talk about Ginger and the goat. When we meet in a light-flooded warehouse conversion cafe in Melbourne’s inner north, her song Peripheral Lover has just come out. It’s only a few days since Gordi was stuck in a blizzard on the tarmac at Dallas in the US – the same city where she filmed the music video for the queer bop almost three years ago. Gordi, aka Sophie Payten, says chaos comes with life as a musician. Credit: Simon Schluter Gordi, restless with boredom, kept herself busy during the three-hour stranding by reading the absurd text exchange of a woman sitting in front. “She had the most enormous phone, and she was trying to text this person named Ginger who’d obviously given her some flowers,” Gordi tells me, laughing. “She was trying to say to Ginger, ‘Instead of paying you with cash, would you accept a baby goat?’ And Ginger said, ‘Yes.’ “That’s kind of a look at the last two weeks.” The unexpected tends to follow globe-trotting musicians, but especially ones who, like Gordi, find it hard to settle for just one job.\n\nAdvertisement\n\nChaos, Chris Martin and impostor syndrome In choosing music – alongside change-making and medicine – Gordi chose chaos. It has led the 32-year-old, real name Sophie Payten, to three studio albums (the third is due for release in August), life-altering work in hospitals during the COVID-19 pandemic, a seat on the board of the Music Australia council and, more recently, an emotional encounter with fellow singer-songwriter Chris Martin. Payten at her Melbourne favourite, CIBI. Credit: Simon Schluter The Coldplay frontman was touring Australia when Payten was invited to join local artists hanging out with him. He singled her out, saying he listened to her music. “I ended up playing [Lunch at Dune] from the [new] record for him, and we had this beautiful exchange where he loved the song; he was moved to tears by it,” Payten says. “I only discovered [that] when I opened my eyes at the end of playing it.” She had closed her eyes because she was so nervous.\n\nAdvertisement\n\n“It was amazing – and no one in the room thought to get their phone out to film it.” Payten spent a few hours wrestling with what she saw as the potential cringe factor of sharing the story online, but friends convinced her to post a Reel about it on Instagram. The video has since been viewed more than 2 million times. The hesitation seems typical of Payten, who is grateful and a tad bashful in the face of her success. Our lunch at CIBI, a Collingwood favourite of Payten’s, is our fourth meeting. I’ve previously interviewed her about the grassroots live music initiative she set up with partner and musician Alex Lahey, Over Our Dead Body, and have gone along to a couple of their gigs.\n\nAdvertisement\n\nLoading Today, she pulls me into a hug, asking how I’ve been and saying, “I didn’t know it was you.” Later, as I’m getting stuck into a soba noodle salad, I say I’ve heard Payten is about to appear on a billboard in Times Square in New York. “Oh, yeah, so there’s actually going to be two billboards in Times Square – one for Spotify and one for Amazon Music,” she says with a shrug, smiling as I interrupt her attempts at eating CIBI’s special lunch plate. “[It’s] cool.” Payten breaks into a grin when I mention Peripheral Lover. Fans are loving the song, even if it is a departure from the deep, reverberating and ethereal sound they’ve come to expect from Gordi. Payten initially thought she would give it away, but it finally felt right after she reworked the chords. “Right up until its release, there was a part of me which felt like, ‘Are people going to think this is not me?’ I had some weird impostor syndrome,” she says.\n\nAdvertisement\n\nThe soba salad at CIBI. Credit: Simon Schluter Payten explains how, in high school, she would scrawl illegible song lyrics on the tiniest notepad she could find, out of fear her classmates might discover them and stick them up around her boarding house. When it came to performing at Sunday night chapel, she would pretend her own songs were written by obscure artists. “I didn’t want the kind of judgment that would come from people knowing that it was mine,” she says. “I wanted to hear their feedback but from a more objective [viewpoint].” Payten grew up on a farm in the NSW town of Canowindra, near Orange, but went to boarding school and university in Sydney. The city is still close to her heart, as is Melbourne, where she moved for love in 2020. She now spends her time between Brunswick in Melbourne’s inner north and Los Angeles. “Brunswick actually has the highest number of registered songwriters in Australia for any suburb,” she says. “[My parents] still work the farm. I call them in the middle of the day, and they’re moving pipes, or chipping burrs, or moving a mob of sheep or whatever. I feel like you’d be hard-pressed to find two other people who are closing in on 70 who work as physically hard as they do. “I try to get home every few months, which is good because it is such an important place to me.”\n\nAdvertisement",
    "source": "SMH",
    "cluster_id": 32
  },
  {
    "url": "https://www.smh.com.au/sport/motorsport/he-s-already-australia-s-biggest-sports-earner-now-oscar-piastri-is-climbing-another-list-20250508-p5lxni.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "He’s already Australia’s biggest sports earner, now Oscar Piastri is climbing another list",
    "publish_date": "Tue, 03 Jun 2025 11:30:00 +1000",
    "category": "sports",
    "authors": [
      "Brittany Busch"
    ],
    "text": "“Success helps people shift up in their marketability. And then it’s about how do you make hay while the sun shines and your and your marketability is high?” Berry said. “For brands, it’s about how do you try and identify people on the way up ... [which] is much more affordable and appealing than having to wait until they have ultimate success … when the fees that they would charge would be astronomical.” Piastri, who claimed a fifth grand prix win for the season in Spain at the weekend, inked a deal worth $41 million a year with McLaren in March, first reported in the Daily Mail UK and according to the Australian Financial Review. It was the seventh win of the Melburnian’s Formula 1 career, and he leads the championship race by 10 points to his McLaren teammate Lando Norris. Formula 1 contracts often also include bonuses for podium finishes or wins, the amount of which varies depending on the driver’s agreement with their team. Forbes Australia estimates Piastri made more than $17 million in bonuses last year.\n\nPiastri’s lucrative new deal, which will extend beyond 2026, rocketed him to the title of highest-paid Australian sports star, and bonuses from his five wins for the season will push him even further above the second highest-paid, the NFL’s Jordan Mailata. The Philadelphia Eagles offensive tackle, who last year was the first Australian to play in a Super Bowl victory, earns $24 million a season, which will jump to $33 million from 2026 after signing a three-year contract extension. Piastri’s spot at the top of the table was, until last year, held by NBA player Ben Simmons, who came to the end of his Brooklyn Nets contract worth more than $63 million-per-year. He signed with the Los Angeles Clippers in February for $1.7 million per season, according to Fox Sports, following years of injury and underperformance. The NBA is a boon for Australian athletes, with many of the nation’s highest-paid stars playing basketball in the United States, including Josh Green, Matisse Thybulle, Dyson Daniels and Josh Giddey.\n\nGiddey is in the midst of contract negotiations, and veteran NBA reporter Brian Windhorst has speculated he could re-sign with the Chicago Bulls for about $47 million – a number that would see the 22-year-old surpass Piastri for the biggest annual salary (excluding bonuses and endorsements). “The going rate for a starting point guard in the NBA is around $30 million [$A46.8 million],” Windhorst told ESPN, pointing to Immanuel Quickley on about $50 million a year. Josh Giddey is undergoing contract negotiations. Credit: AP “I’m sure Josh Giddey’s hoping for something like that.” Australia’s domestic sports stars pale in comparison, despite earning more than ever. In 2024, 10 AFL players pocketed salaries of at least $1.2 million, with the likes of Richmond’s Tom Lynch, Melbourne’s Christian Petracca and Western Bulldogs skipper Marcus Bontempelli among the top earners this year.\n\nIn the NRL, Kalyn Ponga, Nathan Cleary and Cameron Munster are reportedly among the highest earners, around the $1.3-$1.4 million mark. Professor of International Sport Business at Victoria University Hans Westerbeek said sports such as Formula 1 and NBA were the most lucrative because of their broad, global popularity. “It’s a very basic, simple marketing principle that the more eyeballs you attract, the more valuable the property is that attracts those eyeballs,” he said. He said performance was crucial but a sports personality’s narrative power could also give them an advantage when negotiating deals.\n\n“There’s one very big factor that drives the value up beyond their performance, and that is their ability to tell stories, to create a story about not only those 90 minutes on the racetrack, or four quarters on a football field, but everything that happens before, during and after,” he said. Jordan Mailata was the first Australian to play in a Super Bowl win. Credit: AP “When you’re top of your discipline or top of your sport, your inherent value is higher than those who do not get onto the podium. Having said that, there’s an increasing number of athletes who may never win an Olympic medal but still make a very healthy income because of the stories that they ... very strategically narrate on different social media platforms or in direct production with their management companies.” He pointed to the meteoric rise of Australian sprint sensation Gout Gout as an example of how an athlete who captured the public’s attention was quickly snapped up by brands. The 17-year-old signed an estimated $6 million deal with adidas last year.\n\n“It has this great story of a kid who suddenly is there and rivals one of the greatest of all time [Usain Bolt], and how quickly companies then jump on the bandwagon to sign him before he becomes too expensive,” Westerbeek said. Australian golfer Cameron Smith is also on the rich list, his deal to join the Saudi-backed LIV Golf League reportedly topping nine figures. LIV contracts are usually excluded from salary estimations because the number of years the deals span is unknown, meaning it is possible Smith is earning more than Piastri on an annual basis. Loading “[LIV] is a league fully owned by companies that directly associate with the government of Saudi Arabia, and it’s very much a disrupter in what has been a very traditional sport. The Saudis have done this because they know what kind of influence a platform like golf, or F1 for that matter, has in it, in order for them to have some kind of power base in global sport,” Westerbeek said. Gemba’s Berry said Netflix’s Drive to Survive series had broadened the popularity of motorsport, but Piastri’s on- track success had helped him climb the most marketable list above the other 263 Australian athletes the organisation tracked.",
    "source": "SMH",
    "cluster_id": 33
  },
  {
    "url": "https://www.smh.com.au/sport/nrl/crichtons-gus-jibe-cracks-up-panel-20250603-p5m4if.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Crichton's Gus jibe cracks up panel",
    "publish_date": "Tue, 03 Jun 2025 11:20:22 +1000",
    "category": "finance",
    "authors": [],
    "text": "Crichton's Gus jibe cracks up panel\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 34
  },
  {
    "url": "https://www.sbs.com.au/news/article/workers-on-minimum-wage-receive-pay-boost-in-annual-review/7n9loii6i",
    "title": "Australia's lowest-paid workers just got a pay rise. Here's how much wages will increase",
    "publish_date": "Tue, 3 Jun 2025 00:12:14 +0000",
    "category": "finance",
    "authors": [],
    "text": "Australia's lowest-paid workers have been handed a 3.5 per cent increase by the Fair Work Commission.\n\n\n\n\n\nThe national minimum wage will increase from $24.10 to $24.94 per hour or from $915.90 to $947.95 per 38-hour week.\n\n\n\n\n\nThe change will impact one in five Australian workers on an award wage from 1 July.\n\n\n\nThe commission's panel delivered the decision in Sydney on Tuesday morning after assessing submissions from the government and other stakeholders as part of the annual review process.\n\n\n\n\n\nFair Work Commission (FWC) president Adam Hatcher noted the workforce reliant on these wages was \"disproportionately female\" and largely consisted of casual and part-time employees.\n\n\n\n\n\n\"We are concerned that if this opportunity is not taken in this annual wage review, the loss in the real value of wages, which has occurred will become permanently embedded in the modern awards system,\" he said.\n\n\n\n\n\n\"And the national minimum wage and a reduction of living standards for the lowest paid in the community will thereby be entrenched.\"\n\n\n\nREAD MORE The sectors that have seen real growth in women's wages\n\nUnions had been calling for a 4.5 per cent increase, with Australian Council of Trade Unions national secretary Sally McManus labelling anything below 2.5 per cent \"disastrous\".\n\n\n\n\n\n\"We want people to get a bit more, because they've got to catch up with those inflation years where people went backwards,\" she told the ABC before the decision.\n\n\n\n\n\nIn its submission to the FWC, the Australian Chamber of Commerce and Industry suggested a wage increase no greater than 2.5 per cent, saying any greater increase would be at the expense of small to medium businesses.\n\n\n\n\n\nLabor backed an increase above inflation , which was 2.4 per cent at the end of March.\n\n\n\n\n\nIn 2024, the FWC increased award wages by 3.75 per cent, just below annual inflation at 3.8 per cent.\n\n\n\n\n\nThis is a developing story and this article will be updated.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 0
  },
  {
    "url": "https://www.sbs.com.au/news/article/government-to-establish-new-multicultural-affairs-office-under-promoted-anne-aly/g6ghsg5td",
    "title": "Government to establish new Multicultural Affairs Office under promoted Anne Aly",
    "publish_date": "Mon, 2 Jun 2025 23:30:15 +0000",
    "category": "finance",
    "authors": [],
    "text": "An Office for Multicultural Affairs will be established within the Home Affairs Department to combine the department's existing multicultural affairs stream with settlement services and community grants programs.\n\n\n\n\n\nIt falls short of the multicultural framework review's urgent recommendation to establish a standalone Department of Multicultural Affairs, Immigration and Citizenship with a dedicated minister.\n\n\n\n\n\nHome Affairs Secretary Stephanie Foster will make the announcement to the department at 11am on Tuesday with a mandatory consultation period to begin shortly after.\n\n\n\nSettlement services, including the Adult Migrant English Program, grants for humanitarian entrants and other eligible migrants and communities could be included in the Office, as well as translation and interpreting services, and multicultural affairs policy.\n\n\n\n\n\nExactly what's in the Office's remit will be considered as part of the department's mandatory consultation period.\n\n\n\n\n\nMulticultural Affairs Minister Anne Aly will be responsible for the office. Aly became the first female Muslim cabinet minister when she was elevated in the reshuffle last month .\n\n\n\n\n\nThe Office could begin operation from 17 July, a week before the first sitting of the new Parliament.\n\n\n\nREAD MORE This rural town has grown into a thriving multicultural hub\n\nIndependent review recommendation not met\n\nThe landmark multicultural framework review released in August last year recommended establishing a standalone Department of Multicultural Affairs, Immigration and Citizenship with a dedicated minister, alongside a Multicultural Affairs Commission and commissioner.\n\n\n\n\n\nThe review found that the Multicultural Affairs portfolio was unable to influence public policy and government decision making within the Department of Home Affairs, and \"the focus of policy and program approaches to culturally and racially marginalised communities has become one of being monitored and managed rather than inclusive and celebratory\".\n\n\n\n\n\nThe review also found that although multicultural policies are more than just immigration policy, the panel was \"repeatedly struck by the interplay of migration policy and planning in shaping our success as a multicultural nation\", recommending that immigration, citizenship, and multicultural responsibilities sit within a standalone department and single minister.\n\n\n\nAlthough a standalone Multicultural Affairs Minister has been elevated to cabinet, Home Affairs Minister Tony Burke will still hold the Immigration and Citizenship portfolios, and the Office of Multicultural Affairs will sit within the Home Affairs Department.\n\n\n\n\n\nAt the time of the review, Andrew Giles held the Immigration, Citizenship and Multicultural Affairs portfolios in the outer ministry, with the review recommending elevating the multicultural minister to cabinet to allow \"greater influence over decision-making across government rather than just within their own portfolio\".\n\n\n\n\n\nSBS News understands the government intends to create a level of separation between multicultural affairs and the mega Home Affairs department that is responsible for national security, including counterterrorism and border enforcement, the AFP, ASIO, as well as immigration and citizenship.\n\n\n\nReview of grants program\n\nThe office will be responsible for the grants programs currently administered by the Department of Home Affairs.\n\n\n\n\n\nSince the start of the Hamas-Israel war in 2023, the Department of Home Affairs has awarded more than $30 million in grants for \"community funding to support social cohesion initiatives\". This includes $2 million awarded to SBS to deliver reporting in multiple languages, and Australian Associated Press for fact-checking services.\n\n\n\n\n\nSBS News understands the grants process will be reviewed by the Office of Multicultural Affairs, with the intention of modernising the program and improving accessibility.\n\n\n\n\n\nThe special envoys for combatting antisemitism and Islamophobia currently fall under the Minister of Multicultural Affairs portfolio and may become part of the Office of Multicultural Affairs.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 35
  },
  {
    "url": "https://www.sbs.com.au/news/video/rare-books-exhibition-sheds-light-on-long-history-of-chinese-migrants-in-australia/32up8yjpn",
    "title": "Rare books exhibition sheds light on long history of Chinese migrants in Australia",
    "publish_date": "Mon, 2 Jun 2025 10:25:37 +0000",
    "category": "entertainment",
    "authors": [],
    "text": "Rare books exhibition sheds light on long history of Chinese migrants in Australia\n\nPublished 2 June 2025, 6:54 am\n\nA set of rare Chinese to English phrasebooks have been put on display at Victoria's State Library. The books were produced in 1862 during the state's gold rush; a time of massive Chinese migration to Australia and particularly Victoria.",
    "source": "SBS",
    "cluster_id": 36
  },
  {
    "url": "https://www.sbs.com.au/news/video/what-is-kashmir-in-60-seconds/7azd0tnhp",
    "title": "What is Kashmir in 60 seconds",
    "publish_date": "Mon, 2 Jun 2025 09:42:47 +0000",
    "category": "finance",
    "authors": [],
    "text": "What is Kashmir in 60 seconds\n\nPublished 2 June 2025, 6:47 am\n\nKashmir - home to some 10 million people - is located on the Himalayas and shares its borders with Pakistan, India and China. The area has been a flashpoint for decades. But why? This video is a very brief history and general overview on one of the world's most complex regions.",
    "source": "SBS",
    "cluster_id": 37
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/interest-rate-cuts-trigger-record-property-prices-trump-doubles-steel-tariffs/gyxvgvd1q",
    "title": "Interest rate cuts trigger record property prices & Trump doubles steel tariffs",
    "publish_date": "Mon, 2 Jun 2025 08:41:47 +0000",
    "category": "finance",
    "authors": [],
    "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
    "source": "SBS",
    "cluster_id": 38
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/calls-for-more-to-be-done-to-address-natural-disaster-costs/pb2skq18p",
    "title": "Calls for more to be done to address natural disaster costs",
    "publish_date": "Mon, 2 Jun 2025 07:54:15 +0000",
    "category": "finance",
    "authors": [],
    "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nIn Taree on the Mid North Coast of New South Wales, Holly Rankin is leading hundreds of volunteers to continue the clean up after the recent floods.\n\n\n\n\n\nThe floods have destroyed up to 10,000 homes in the region.\n\n\n\n\n\nEven with support from the State Emergency Service, Ms Rankin says the clean up hasn't been easy.\n\n\n\n\n\n\"A lot of people have experienced mud 1.5 meters up their walls. You know, you got dairy farmers with their entire infrastructure, their dairy farms destroyed. So you've got cows with mastitis. So over this week, we've brought together over 1000 community volunteers as part of our group, and we've been working alongside the SES to do those kind of easier to do, non dangerous jobs.\"\n\n\n\n\n\nMs Rankin says local residents impacted by the floods received a one-off payment of $1000 from the federal government, but she says the amount is too little to address the issue.\n\n\n\n\n\n\"Thousands of families in Taree, Wingham and surrounds have lost everything, all of their belongings, all of their clothes, their furniture, their kitchens. They're living in emergency accommodation right now. So anyone who does a weekly budget knows that $1,000 will only last you a week. It's not going to get very far. These people are standing in the face of an immense financial burden.\"\n\n\n\n\n\nAccording to the Australian government's Disaster Assist website, in the first five months of the year, there were over 25 natural disasters across the nation, including Cyclone Alfred and the latest floods in New South Wales.\n\n\n\n\n\nThe Treasury estimates these disasters have led to a $2.2 billion decline in national economic activity in the first half of the year.\n\n\n\n\n\nTreasurer Jim Chalmers says Australians are now in what he calls a stronger position to provide support for communities affected by natural disasters, due to lower inflation, debt and stable unemployment rates.\n\n\n\n\n\nBut according to Pradeep Philip, Lead Partner at Deloitte Access Economics, the $2.2 billion cost will be reflected in the upcoming GDP figures.\n\n\n\n\n\n\"So the government expects that the effects of Cyclone Alfred will be to shave about 0.2 per cent of GDP in the March quarter. This is because there's been damage done to a lot of assets, roads, bridges, homes. There are financial costs associated with this reduced economic activity, impacts on things like agriculture and logistics. And then third, there are social costs associated with this as people undergo enormous amount of trauma as a result of not just cyclone Alfred, but for some people, repeated severe weather events.\"\n\n\n\n\n\nMr Philip says Australia needs a much bigger plan than existing measures to address the issues, as the costs of severe weather events continue to go up.\n\n\n\n\n\n\" A few years ago, we had estimated that the cost of natural disasters in Australia would reach about $38 billion by 2050. Well, we're actually there now, right now, in Australia, the cost of natural disasters is around $38 billion a year. And by 2070 this could rise to between 73 and $94 billion a year. So these are really significant numbers, and what it means is that addressing climate change is actually an important economic issue.\"\n\n\n\n\n\nThis week the Government also announced an additional $2 million to support farmers and small businesses impacted by drought in South Australia and Victoria.\n\n\n\n\n\nThe government also rolled out the Disaster Ready Fund, providing up to $1 billion funding till 2028 to help local governments and communities prepare for future natural disasters.\n\n\n\n\n\nBut Climate Council Fellow, Dr Simon Bradshaw, says the government seems to prefer spending more money on disaster recovery than adopting proactive measures to build community resilience.\n\n\n\n\n\nWhile he agrees that there have been improvements in the government's approach, he thinks more has to be done.\n\n\n\n\n\n\"We still need the federal government to produce its long awaited national adaptation plan to guide some of this effort, and also an updated national climate risk assessment to ensure we have the information and data on risks that we need.\"\n\n\n\n\n\nDr Bradshaw says it's time to act faster to address the causes of natural disasters.\n\n\n\n\n\n\"Every new fossil fuel project we approve is increasing the dangers and the costs for communities in future. So our first priority always is to be moving more quickly beyond fossil fuels, renewable energy, getting to zero emissions as soon as possible. And that's fundamental to protecting people around today, and of course, all the more future generations beyond that.\"\n\n\n\n\n\nAssociate Professor Helen Boon at James Cook University has looked into four natural disasters in Queensland and Victoria.\n\n\n\n\n\nHer research found people who felt they were most prepared for the disasters, were often those who felt they had enough insurance and emergency kits for the event.\n\n\n\n\n\nShe also found people who received both federal and state government support tended to feel more prepared in the wake of disasters.\n\n\n\n\n\nBut this isn't the case for everyone she says - especially for those on low incomes.\n\n\n\n\n\n\"I think it's really important that the government will ensure that insurance cover is available at reduced rates for those whose incomes are too low to buy appropriate insurance for their properties. I think they Should subsidise in disaster insurance for those who are in vulnerable communities, particularly those of lower income.\"\n\n\n\n",
    "source": "SBS",
    "cluster_id": 39
  },
  {
    "url": "https://www.sbs.com.au/news/article/australians-choosing-foods-contibute-to-disease-why/1j5d3mbsx",
    "title": "Australians are choosing foods that contribute to leading causes of disease. Why?",
    "publish_date": "Mon, 2 Jun 2025 07:11:06 +0000",
    "category": "finance",
    "authors": [],
    "text": "Key Points New research suggests the cost of living is causing people to make poor dietary choices.\n\nPoor diet is among the top causes of disease in Australia.\n\nMeanwhile, millions of tonnes of edible food are thrown away each year.\n\nJust under one in 20 Australians are making dietary choices that are consistent with Australian dietary guidelines.\n\n\n\n\n\nAccording to CSIRO's latest Food System Horizons report, Australians are experiencing diseases due to unhealthy diets despite a relative abundance of safe, high-quality food.\n\n\n\n\n\nData from the Australian Bureau of Statistics shows that the local value of Australian fruit production (excluding wine grapes) was $6.3 billion in 2022-23, with 2.7 million tonnes sold the same year.\n\n\n\n\n\nSimilarly, the local value of vegetable production was $5.8 billion, with 3.6 million tonnes sold.\n\n\n\n\n\nAs a result of large quantities of fresh food remaining unused, 33 million tonnes of organic waste are generated each year.\n\n\n\nREAD MORE I thought I was following healthy habits — then I realised they were causing me harm\n\nThe CSIRO's report estimates that Australia's production, distribution and consumption of food is worth $800 billion and employs around 3.5 million people.\n\n\n\n\n\nBut researchers say it's not delivering for everyone, and that lack of affordable and nutritious food is a leading cause of disease in the nation.\n\n\n\nLack of choice driving poor diets\n\nLarelle McMillan, research director of CSIRO's agriculture and food sustainability program, said the cost of food and health issues is \"hitting Australians hard\".\n\n\n\n\n\nShe said a lack of choice is partially responsible for this situation.\n\n\n\n\n\n\"Health-related epidemics and issues are often interpreted as an acceptable consequence of personal choice,\" she told SBS News.\n\n\n\n\n\n\"However, there are elements to that personal choice that can lead us away from healthy food.\"\n\n\n\nSource: SBS News In particular, the cost of healthy food (like fruit and vegetables) compared to processed ones can make a nutritious diet out of reach for Australians on a smaller budget.\n\n\n\n\n\nPeople living in regional and remote areas are more likely to see higher prices at the checkout and have fewer options available, which could influence their food choices.\n\n\n\n\n\nAccording to the report, 6 per cent of those in regional areas only have access to a single food retailer, and that figure rises over five times to 34 per cent for residents in remote areas.\n\n\n\nREAD MORE Watchdog unveils proposal to end supermarket price-gouging, shrinkflation\n\nThese factors are contributing to a vast number of Australians not getting enough nutrition in their diet, which is leading to health consequences, the report says.\n\n\n\n\n\nLess than 5 per cent of Australians are eating enough fruits and vegetables as recommended in the federal government's Australian dietary guidelines.\n\n\n\n\n\nIn comparison, twice as much non-essential or \"discretionary food\" like biscuits and processed meat is being consumed.\n\n\n\n\n\nA lack of nutrition in one's diet can contribute to risks such as obesity, among other health issues.\n\n\n\n\n\nDietary risk is one of the leading factors contributing to disease burden in the country, according to data from the Australian Institute of Health and Welfare.\n\n\n\nSource: SBS News While cost is a driving factor in food insecurity, convenience also plays a role in how consumers choose to shop in the modern age.\n\n\n\nConvenience over nutrition\n\nLilly Lim-Camacho, a principal research scientist at CSIRO, explained that convenience can drive our habits when it comes to what we buy for our meals.\n\n\n\n\n\n\"When it comes to purchasing food, buying fresh food to prepare yourself isn’t as convenient when compared to other things,\" she told SBS News.\n\n\n\n\n\n\"In addition, it can be seen as expensive, not only because of the increased cost but the increased time that goes into preparing food.\"\n\n\n\n\n\nThe environments we are exposed to when buying food also play a part, as people can be swayed by marketing, she added.\n\n\n\nThe CSIRO report highlights that fast food outlets are heavily concentrated in areas of socio-economic disadvantage and around schools, which could be driving poor dietary patterns among these groups.\n\n\n\n\n\n\"For example, children's exposure to fast food advertisements can affect what they want to eat afterwards,\" she said.\n\n\n\n\n\nThe report added that people who are living with socio-economic disadvantage within regional and remote areas faced the biggest harms of food insecurity.\n\n\n\nFresh, healthy food thrown away each year\n\nAustralian food relief charities that assist people in accessing affordable and nutritious food say the cost of living remains a major barrier to healthy eating.\n\n\n\n\n\nAt the same time, millions of tonnes go to landfills each year, according to Foodbank Australia.\n\n\n\n\"Australia wastes over 7.6 million tonnes of perfectly edible food a year,\" the charity's chief operating officer, Sarah Pennell, told SBS News.\n\n\n\n\n\n\"We want to see more of that good surplus food diverted to charities like Foodbank rather than landfill. With the right incentives and infrastructure, we can dramatically reduce waste and boost food relief efforts.\"\n\n\n\nWhat could change?\n\nFood charity Second Bite's CEO, Daniel Moorfield, told SBS News they rescue around 25 million kilograms of food each year, which is equivalent to 50 million meals.\n\n\n\n\n\nBut there is more they could do with support.\n\n\n\n\n\n\"We strongly support the National Food Donation Tax Incentive, which encourages more businesses to donate surplus food rather than waste it, helping to feed more Australians in need,\" he said.\n\n\n\n\n\n\"This straightforward policy can help deliver millions of healthy meals to Australians in need, improving food security and nutrition while advancing our national food waste reduction goals.\"\n\n\n\nOne way to encourage people to make healthy choices, according to the CSIRO, is a levy on unhealthy foods and sugar-sweetened beverages, adds the report.\n\n\n\n\n\nThe World Health Organization encouraged a similar tax on sugary drinks in 2022.\n\n\n\n\n\nPennell said such a levy would need to be considered in the light of its impact on low-income households.\n\n\n\n\n\n\"We would support well-thought-out policies that improve dietary health and fund food relief efforts – but only if they don’t make life harder for those already struggling to afford the basics.\"\n\n\n\n",
    "source": "SBS",
    "cluster_id": 40
  },
  {
    "url": "https://www.sbs.com.au/news/article/what-is-the-gaza-humanitarian-foundation/h4r7vy8yb",
    "title": "The UN has disavowed this group delivering aid in Gaza. What is the GHF?",
    "publish_date": "Mon, 2 Jun 2025 04:32:05 +0000",
    "category": "finance",
    "authors": [],
    "text": "The Gaza Humanitarian Foundation (GHF) started delivering aid to civilians in Gaza at the end of May after aid, including food and medical supplies, was blocked from entering for almost three months by Israel.\n\n\n\n\n\n\n\nAid is much needed as the entire population is at risk of famine and one in five people in Gaza are facing starvation according to the United Nations (UN).\n\n\n\n\n\nHowever, there is criticism that the delivery of aid by GHF politicises and militarises aid.\n\n\n\nWho is behind the GHF?\n\nThe Israeli government developed the plan for the GHF when it was initially touted at the start of 2025, but the UN strongly rejected it.\n\n\n\n\n\nBut amid weeks of no aid entering the enclave due to Israel blocking access, the United States backed the newly created GHF to oversee aid distribution.\n\n\n\nThe foundation's aid is overseen by Israeli troops before being delivered by contracted US security personnel.\n\n\n\n\n\nA source familiar with the plan told Reuters the foundation had received more than US$100 million ($155 million) in commitments ahead of beginning operation, but it was not immediately clear where the money was coming from.\n\n\n\n\n\nIt has since been formed and started delivering aid on 26 May.\n\n\n\nHow aid has historically been delivered around the world\n\nMudasser Siddiqui, deputy CEO of humanitarian organisation Plan International Australia, told SBS News local organisations usually led the response to humanitarian situations on the ground.\n\n\n\n\n\nThose groups are supported by international organisations such as Plan International, while overall coordination was done by the UN.\n\n\n\n\n\n\"This makes sure there is coordination with the aid community as well as with the government and any other actors on the ground,\" he said.\n\n\n\nREAD MORE Three videos highlight 'heartbreaking' desperation for Gaza aid\n\nSiddiqui said the creation of a separate model completely disregards the well-established processes and procedures that already exist.\n\n\n\n\n\n\"The existing architecture of [humanitarian aid] has decades of experience delivering assistance across the globe, including in occupied Palestinian territories over the decades to communities and people in need,\" he said.\n\n\n\n\n\n\"This is unprecedented in this form, the removing of UN and other international and national actors has not happened before.\"\n\n\n\nHow had aid previously been delivered in Gaza?\n\nIsrael stopped all aid deliveries to Gaza on 2 March after accusing Hamas of stealing aid, which the Palestinian militants deny.\n\n\n\n\n\nAt that point, the Israeli government also demanded the release of all remaining hostages taken during the 7 October 2023 attack on Israel that killed 1,200 people, according to Israeli tallies.\n\n\n\n\n\nEarlier in the conflict, the UN had provided aid to the region under challenging circumstances.\n\n\n\n\n\nThe UN described its humanitarian operation in Gaza as opportunistic — facing problems with Israel's military operation, access restrictions by Israel into and throughout Gaza and looting by armed gangs.\n\n\n\nMudasser Siddiqui from Plan International Australia says well-established humanitarian structures have been utilised around the world, and there was no need for a new model. Source: Supplied Siddiqui said there were international mechanisms in place that could be used for robust monitoring to investigate and respond to such allegations.\n\n\n\n\n\nThe UN has said its aid distribution system worked and that this was particularly proven during a two-month ceasefire, which was abandoned by Israel in mid-March.\n\n\n\n\n\nIsrael would first inspect and approve aid before it was dropped off on the Gaza side of the border, where it was picked up by the UN and distributed.\n\n\n\nHow does GHF operate?\n\nThe foundation is initially operating from four distribution sites — considerably fewer than the 400 points the UN had distributed aid from before Israel's blockade.\n\n\n\n\n\nIt is understood that Israeli military personnel oversee the supplies until they are handed over to US security personnel to distribute in Gaza.\n\n\n\nIsrael has agreed to expand the number of distribution sites and explore ways to deliver aid to civilians who are unable to reach a distribution site, the foundation has stated.\n\n\n\n\n\nWhile the foundation has faced criticism from humanitarian groups for its limited reach and nature of the supplies it is set to provide, Alex de Waal, executive director of the World Peace Foundation at the US-based Tufts University, said it was \"better than nothing\".\n\n\n\n\n\nDe Waal, who writes on humanitarian issues and conflict, said the strategy behind the plan appeared to be aimed at providing just enough aid to Gaza's civilian population in an attempt to more precisely target Hamas and its operatives with starvation.\n\n\n\nConcerns about aid delivery\n\nIt is understood that the plan GHF is delivering would only allow aid to feed around 60 per cent of the estimated Gaza population.\n\n\n\n\n\nThe UN says the US-backed distribution plan does not meet its long-held principles of impartiality, neutrality and independence.\n\n\n\nUN humanitarian chief Tom Fletcher said such a model forces further displacement.\n\n\n\n\n\n\"It exposes thousands of people to harm ... It restricts aid to only one part of Gaza, while leaving other dire needs unmet. It makes aid conditional on political and military aims. It makes starvation a bargaining chip,\" he said.\n\n\n\n\n\nSiddiqui said the geographical reach of the four hubs was limited, as was the actual supply being provided to people in need.\n\n\n\n\n\nFurthermore, relying on this delivery model also provided little oversight of what was happening in Gaza.\n\n\n\nSecurity concerns\n\nThere were numerous reports of security issues at the aid hubs in the first week of their operation.\n\n\n\n\n\nIn one incident, which GHF and the Israeli military have denied occurred, it was reported that 31 Palestinians died as a result of gunfire near one of the aid hubs.\n\n\n\nLISTEN TO Israel investigating as Gazans killed trying to access aid SBS News 02/06/2025 06:20 Play\n\nSiddiqui said the way aid was being delivered took \"no regard for the fact that this is an active conflict zone and movement of people will expose them, which is what we are seeing right now\".\n\n\n\n\n\n\"This is an example of why we need experienced entities to manage the delivery rather than replacing them with this kind of limited scheme, because the communities are being asked to walk for hours to these sites and the necessary crowd management may not be there,\" he said.\n\n\n\nAid groups want access\n\nSiddiqui said there were almost 3,000 trucks waiting at the border to Gaza, full of supplies that could aid Palestinian civilians.\n\n\n\n\n\n\"We would like to move over and provide assistance to our partners who are right on the ground and are well connected and well aware of where the people in need go, and provide that assistance to them, they are just a few kilometres away,\" he said.\n\n\n\n\n\n\"Our approaches have been basically restricted while the Israeli government experiments with this new scheme.\"\n\n\n\n\n\nHe said it was not that humanitarian groups were unwilling to provide assistance, but that they needed to be allowed access into Gaza.\n\n\n\n\n\n— Additional reporting by Reuters\n\n\n\n",
    "source": "SBS",
    "cluster_id": 41
  },
  {
    "url": "https://www.theage.com.au/politics/federal/pm-narrows-down-wedding-date-settles-for-shorter-honeymoon-20250603-p5m4he.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "PM narrows down wedding date, settles for shorter honeymoon",
    "publish_date": "Tue, 03 Jun 2025 12:06:20 +1000",
    "category": "finance",
    "authors": [
      "Millie Muroi"
    ],
    "text": "Prime Minister Anthony Albanese says he will settle for a shorter honeymoon with fiancee Jodie Haydon following Labor’s election win as he narrows down the date for their highly anticipated wedding.\n\nAlbanese, who is set to become the first prime minister to get married while in office, told ABC Radio Perth on Tuesday that he and Haydon were yet to lock in a date.\n\nPrime Minister Anthony Albanese’s thumping election victory had one drawback… he’ll now have to take a shorter honeymoon. Credit: Dominic Lorrimer\n\n“We have now had an opportunity to discuss, and we have a few options between now and the end of the year,” he said. “But we’re waiting as well to look at the calendar.”\n\nAlbanese proposed to Haydon in February 2024, the first prime minister to get engaged while in office, but held off planning their wedding because of the May 3 election. “I deliberately did not get ahead of myself. So from May 3 and beyond, there was a blank diary,” he said.",
    "source": "TheAge",
    "cluster_id": 42
  },
  {
    "url": "https://www.theage.com.au/sport/tennis/andreeva-responds-to-wristband-throw-20250603-p5m4jd.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Andreeva responds to wristband throw",
    "publish_date": "Tue, 03 Jun 2025 12:05:47 +1000",
    "category": "finance",
    "authors": [],
    "text": "Andreeva responds to wristband throw\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 43
  },
  {
    "url": "https://www.theage.com.au/national/queensland/brisbane-news-live-investigation-under-way-after-patient-killed-at-brisbane-hospital-20250602-p5m44p.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Brisbane news live: Probe into death of man attacked by patient | Fair Work Commission lifts minimum wage | Revamped inner-city train station opens tomorrow",
    "publish_date": "Tue, 03 Jun 2025 12:01:43 +1000",
    "category": "finance",
    "authors": [],
    "text": "The state government has completed building the much-anticipated Exhibition station, but says it will only operate for major events, such as the Ekka, until Cross River Rail opens in 2029.\n\nSpeaking to ABC Radio, Transport Minister Brent Mickelberg said the station was “considerably upgraded” to better cope with large crowds and boost accessibility for people with disabilities.\n\nThe upgraded Exhibition station. Credit: Queensland Government\n\nMickelberg added the government was “really pleased” to open the station for its first event tomorrow, the Caravan and Camping Supershow, running until Sunday.\n\n“Once Cross River Rail is finished in the future, it will also be [part] of the existing loop – or the existing route, rather – so it’ll be used day to day as well,” he said.\n\nMickelberg said delays on both the station and Cross River Rail had caused disappointment, adding it “would be great” to have had the Exhibition station opened “a couple of years ago”, but he said the focus was on meeting revised deadlines.",
    "source": "TheAge",
    "cluster_id": 21
  },
  {
    "url": "https://www.theage.com.au/money/planning-and-budgeting/this-kitschy-70s-fad-is-having-a-comeback-with-a-hefty-price-tag-20250603-p5m4gq.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "This kitschy ’70s fad is having a comeback (with a hefty price tag)",
    "publish_date": "Tue, 03 Jun 2025 12:00:18 +1000",
    "category": "entertainment",
    "authors": [
      "Stephen Crafti"
    ],
    "text": "Shell art isn’t a new genre; it’s been with us for centuries. The Victorians often framed their family photos with shells. The peacock, with its picturesque plumage, is frequently used as the subject for shell art, whether from the 19th century or the 1950s, when shell art gained momentum.\n\nThe medium also came to the fore in the 1970s when everything was embellished with shells, from photo frames and mirrors to trinket boxes and even furniture. And if you think these pieces should just be relegated to the ’70s beach shack then take another look, as shell art finds its own place in history decades later.\n\nA recently completed beach house featuring an extensive collection of shell art. Credit: Trevor Mein\n\nAlthough shell art can often be spotted in vintage stores, there’s no shortage of it on websites such as Etsy. This writer found some alluring pieces, such as a Victorian black-and-white photo of a mother and her child, ornately framed with seashells – as richly detailed as Victorian lace.\n\nPriced at $470, its workmanship is as impressive as that of the finest silver frames. Those searching may also be tempted by Chinese shell-art birds exquisitely depicted sitting in a blossom tree and priced at $373.",
    "source": "TheAge",
    "cluster_id": 22
  },
  {
    "url": "https://www.theage.com.au/business/markets/why-america-may-never-be-great-again-20250603-p5m4fb.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Why America may never be great again",
    "publish_date": "Tue, 03 Jun 2025 11:59:01 +1000",
    "category": "finance",
    "authors": [
      "Stephen Bartholomeusz"
    ],
    "text": "America’s government finances are about to get a lot worse. The “One Big Beautiful Bill Act” currently before the US Senate, with its extension of Trump’s 2017 tax cuts, would add more than $US3.3 trillion to that debt within a decade and (because the spending measures are front-loaded, with expenditure cuts deferred) about 1.8 percentage points to the US debt-to-GDP ratio in its first year. Trump and his administration risk isolating America as they look to bully the rest of the world. Credit: Bloomberg Concern about the increase in debt the bill would generate, along with the chaos created by Trump’s tariffs, have already caused US bond yields to rise significantly and produced some weakness in demand in auctions of bonds with longer durations. Bond investors want to be compensated for the perceived increase in risk of holding bonds for 20 or 30 years. The demand versus supply challenge created by the sheer volume of debt the market is being asked to absorb is exacerbated by the changes to US bank regulation that were made after the 2008 financial crisis.\n\nLoading Dimon’s reference to market makers relates to the requirement that banks hold capital and liquidity against risks, with Treasury securities treated no differently to other assets. In a crisis, and a big short falling demand for a US bond issue, the banks, as “primary dealers,” would be expected to step up and fill the void, but those requirements might prevent them from doing so. The Trump administration has raised the prospect of bank deregulation, with the “supplementary leverage ratio,” which requires banks to hold a minimum 3 per cent of common equity relative to their total assets, likely to be lowered. Dimon isn’t the only senior Wall Street figure worried about the potential for an implosion in the bond market.\n\nSpeaking at the same Reagan National Economic Forum in California as Dimon, former Goldman Sachs president and Trump adviser in his first term, Gary Cohn, said that the US has “the most robust debt market in the world, until we don’t.” “If there lacks interest from foreign investors, and there lacks interest from US investors...rates will move out dramatically. “One or two auctions later, you could be in a completely different system. “And then, when the government gets to a point where it can’t efficiently finance itself, we have a completely different position. And when we’re there, it’s almost too late to deal with,” he said. The White House, of course, isn’t concerned, arguing that growth from its tax cuts and spending will grow the economy at a rate will resolve the threat of rising deficits and debt and shrink the deficit and debt ratios.\n\nThe Treasury Secretary, Scott Bessent, pushed back against criticism of the One Big Beautiful Bill Act impact on the deficits and debt. “This bill is going to create growth. I’m not worried about the US debt dynamics because a change in the growth trajectory takes care of a lot of that, he said, predicting that, within a year, the US economy will be growing at more than 3 per cent. That might be somewhat optimistic. Trump’s tariffs, if he is allowed by the courts to impose them, or finds other mechanisms for doing so, will subtract from growth. The US dollar is under increasing pressure. It is also the case that the $US4 trillion-plus of tax cuts aren’t actually stimulatory cuts, but an extension of the 2017 tax cuts that were scheduled to expire in December. Their extension might avoid what would otherwise be contractionary tax increases, but it is stretching it somewhat to see them as turbocharging growth.\n\nThere’s also, given the nervousness of investors, particularly foreign investors, about the Trump administration’s love of destabilising tariffs and the blow-out in government spending that would occur if the One Big Beautiful Bill is enacted, another potentially destructive element in the legislation. Section 899 of the bill would enable the US Treasury to impose penalties on foreign investors or companies by imposing punitive income and withholding taxes on them – up to 20 percentage points on their US investments – if the US deems their governments have imposed unfair taxes on US companies. Loading The European Union, the UK, Canada, Australia and others with valued-added taxes (our GST) or digital sales taxes would be obvious targets. Section 899 would apply to dividends, the interest on corporate (and possibly government) bonds and corporate profits and would also apply to the holdings of sovereign wealth funds that are currently exempt from taxes.\n\nThere’s already a “Sell America” trade underway. Even as US bond yields have risen, the US dollar has fallen almost 10 per cent this year, a reversal of the normal correlation. Trump’s trade wars and the expected spending binge and deterioration in America’s public finances – a prospect that saw the US lose its last AAA credit rating last month – are the reasons there have been outflows of capital from the US this year. If Section 899 were enacted – or if foreign investors thought it was likely to be enacted – there would be a real exodus of capital from the US. Interest rates would spike even more and investment and growth would shrink. The prospect of US Treasury calling a bond auction where no-one turned up would strengthen. If no-one wants to buy US assets, or are scared away from the US markets and economy by the administration’s policies, the dollar won’t remain dominant and America will never be great again. Trump and his administration want to bully the rest of the world. They want to dictate other countries’ trade, tax and social policies while still seeking their investment – indeed, demanding that they invest more – to “make America Great Again.”",
    "source": "TheAge",
    "cluster_id": 23
  },
  {
    "url": "https://www.theage.com.au/sport/tennis/kasatkina-thanks-aussies-for-pulling-her-out-of-hole-20250603-p5m4j6.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Kasatkina thanks Aussies for pulling her out of 'hole'",
    "publish_date": "Tue, 03 Jun 2025 11:57:01 +1000",
    "category": "finance",
    "authors": [],
    "text": "Kasatkina thanks Aussies for pulling her out of 'hole'\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later. Dismiss\n\nOur network\n\nOpen Navigation Menu The Age",
    "source": "TheAge",
    "cluster_id": 24
  },
  {
    "url": "https://www.theage.com.au/sport/greg-swann-announces-departure-from-brisbane-lions-20250603-p5m4j7.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Greg Swann announces departure from Brisbane Lions",
    "publish_date": "Tue, 03 Jun 2025 11:57:00 +1000",
    "category": "finance",
    "authors": [],
    "text": "Greg Swann announces departure from Brisbane Lions\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 25
  },
  {
    "url": "https://www.theage.com.au/national/victoria/erin-patterson-mushroom-trial-updates-live-accused-triple-killer-to-return-to-the-witness-box-20250603-p5m4eq.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Erin Patterson mushroom trial updates LIVE: Accused triple killer to return to the witness box",
    "publish_date": "Tue, 03 Jun 2025 11:56:07 +1000",
    "category": "lifestyle",
    "authors": [
      "Marta Pascual Juanola",
      "Erin Pearson"
    ],
    "text": "In the witness box, Erin Patterson occasionally grins and fiddles with her hands.\n\nHer lawyer, Colin Mandy, SC, has moved to a new line of questioning: Patterson’s health history.\n\nErin Patterson. Credit: Jason South\n\nPatterson said she had never been diagnosed with ovarian cancer or had a biopsy on her elbow, but she confirmed she had raised concerns with doctors that she might have cancer.\n\n“I’d been having for a few months a multitude of symptoms. I felt very fatigued, I had ongoing abdominal pain, I had chronic headaches. I put on a lot of weight in quite a short period of time ... my feet and my hands seemed to retain a lot of fluid,” she said.\n\nPatterson said that what sent her “over the edge” to go to the doctor was that her wedding ring would no longer fit. She said she had the ring resized, but it did not fit again within a short period. “I consulted with Dr Google,” she said.\n\nDefence counsel Colin Mandy, SC, outside court. Credit: Jason South\n\n“I had a family history of it [ovarian cancer] on both sides of my parents. I’d had an ovarian cyst myself in about 2002 and my daughter had an ovarian mass when she was a baby.”\n\nPatterson said her daughter would cry for long periods of time, so she took the child to doctors, who told her she was an “overanxious mother” and she should relax. “She was eight months old by the time it was actually diagnosed,” she said of her daughter’s ovarian mass.\n\nPatterson said she discovered the mass while massaging her daughter’s abdomen after a bath in August 2013.\n\n“They still dismissed me, even then. They thought she just had a very full bladder,” the accused said.\n\nBut the lump remained.\n\nIt was that experience, that moment, Patterson said, that considerably damaged her faith in the health system.\n\nPatterson said she didn’t like hospitals before, but the experience made her distrust health professionals. “I didn’t want to lose her,” she said.\n\nShe said the experience also played a part when she discharged herself from hospital in January 2015. “I didn’t want to be there,” she said.\n\nPatterson said that after the removal of the mass from her daughter’s ovary, the girl continued to have ongoing pain and gastrointestinal issues. “She got to a point where she was four and they finally did an X-ray on her which showed that she was completely backed up,” Patterson said.\n\nPatterson said the experience was distressing for her daughter. “She’s 11 and she still remembers that.”",
    "source": "TheAge",
    "cluster_id": 26
  },
  {
    "url": "https://www.theage.com.au/goodfood/recipes/warm-korean-style-beef-noodle-salad-20250512-p5lyjl.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Warm Korean-style beef noodle salad",
    "publish_date": "Tue, 03 Jun 2025 11:56:02 +1000",
    "category": "lifestyle",
    "authors": [
      "Neil Perry"
    ],
    "text": "Step 1 Marinate the beef in half the soy sauce, sugar and sesame oil for 20 minutes.\n\nStep 2 In a wok, heat the vegetable oil until almost smoking. Add the beef and mushroom slices, and stir-fry for about 4 minutes until both are well cooked. Set aside in a bowl.\n\nStep 3 Add the onion and a pinch of salt to the hot wok and stir-fry for 1 minute until soft and coloured. Add the carrot and cook for a further minute, then add the spinach and remaining sugar, soy and sesame oil. Return the beef and mushrooms to the wok and toss to heat through.",
    "source": "TheAge",
    "cluster_id": 27
  },
  {
    "url": "https://www.theage.com.au/sport/nrl/what-ezra-mam-really-thinks-of-you-booing-him-20250602-p5m45z.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "What Ezra Mam really thinks of you booing him",
    "publish_date": "Tue, 03 Jun 2025 11:45:00 +1000",
    "category": "sports",
    "authors": [
      "Christian Nicolussi"
    ],
    "text": "Ezra Mam initially believed Manly fans were booing him for calling out racism, rather than anything to do with the perceived light punishment he received from the NRL after he injured three people while driving under the influence of drugs.\n\nMam was heckled almost every time he caught the ball at 4 Pines Park during Brisbane’s 34-6 loss to the Sea Eagles.\n\nIt was his second game back in the NRL – but his first outside of Brisbane – since he returned from a nine-match ban from the NRL.\n\nMam crashed his ute in Brisbane’s west last October, injured an Uber driver and his two passengers, including a young girl, and was later charged with drug driving and driving without a licence. He was fined $850 and had his licence suspended for nine months, before the NRL handed down their own ban.",
    "source": "TheAge",
    "cluster_id": 28
  },
  {
    "url": "https://www.theage.com.au/sport/rugby-union/anderson-leads-reds-into-finals-20250603-p5m4iv.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Anderson Leads Reds into Finals",
    "publish_date": "Tue, 03 Jun 2025 11:42:55 +1000",
    "category": "sports",
    "authors": [],
    "text": "Anderson Leads Reds into Finals\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 29
  },
  {
    "url": "https://www.theage.com.au/sport/rugby-union/controversy-in-canberra-20250603-p5m4it.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Controversy in Canberra",
    "publish_date": "Tue, 03 Jun 2025 11:42:03 +1000",
    "category": "finance",
    "authors": [],
    "text": "Controversy in Canberra\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 30
  },
  {
    "url": "https://www.theage.com.au/national/nsw/beneath-sydney-a-mini-city-is-being-dug-for-machines-bigger-than-an-aircraft-fuselage-20250207-p5lacw.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Beneath Sydney, a mini-city is being dug for machines bigger than an aircraft fuselage",
    "publish_date": "Tue, 03 Jun 2025 11:30:00 +1000",
    "category": "finance",
    "authors": [
      "Matt O'Sullivan"
    ],
    "text": "Save Log in , register or subscribe to save articles for later. Save articles for later Add articles to your saved list and come back to them any time. Got it Normal text size Larger text size Very large text size Deep under an inner-city Sydney suburb, two giant caverns each large enough to house an A380 superjumbo’s fuselage and tail are being carved out of sandstone. About 120 metres long, 26 metres high and 18 metres wide, the caverns illustrate the monumental scale of the task confronting engineers and other workers as they prepare to dig two motorway tunnels under Sydney Harbour between Birchgrove and Waverton. For the last decade, Sydney has become accustomed to tunnelling for metro train lines. Yet, two giant tunnelling machines to be shipped in parts from China later this year will dwarf those that completed Sydney’s first under-harbour rail crossing early this decade and are now worming their way under the city for the Metro West rail line between the central city and Parramatta. At about 16 metres in diameter, the tunnel boring machines for the $7 billion Western Harbour Tunnel will be the largest in the Southern Hemisphere. The twin three-lane wide motorway tunnels will each be large enough to fit four metro rail tunnels. While the project is the envy of tunnellers around the world, Transport for NSW project director Simon Cooper said the planned under-harbour crossing was “very, very complicated technically”. “We’re building little cities underground that nobody is ever going to see that will enable our project. And when all the work’s done, we will pack it away,” he said. “When you are abroad, you hear about Sydney Harbour; you hear about the bridge. An opportunity to go under a harbour as a tunneller is ... something any tunneller around the world wants to do.”\n\nAdvertisement\n\nLike mobile factories, each of the boring machines will house up to 20 workers at any one time. Spanish contractor Acciona will operate the machines around the clock, slicing through about 55 metres of rock and sediment a week. Making the project more challenging, the machines will be assembled in the tight confines of the so-called launch chambers beneath Birchgrove before starting their 1.5-kilometre journey early next year under the harbour towards Waverton. Excavation equipment known as road-headers with large rotating cutting heads began chiselling away at sandstone deep beneath an oval and several houses in February to create the launch chambers, which are due to be completed by the end of the year. Construction workers in one of the giant vent chambers for the Western Harbour Tunnel. Credit: Janie Barrett Cooper said it was hard enough assembling boring machines above ground where cranes could move freely, let alone in a tight space underground. In fact, the team decided to add extra height to the chambers to avoid regrets lifting parts when the assembly begins. “It is a factory down there because not only are we having to assemble and have these big cranes in there, we then also have piping that goes backwards and forwards to our slurry treatment plants,” he explained. After a practice assembly in a Chinese warehouse, the parts that will make up the boring machines will arrive by ship at Glebe Island in coming months. Once offloaded, they will cover most of the waterfront area seen by motorists as they cross Anzac Bridge. When the assembly starts early next year, two 400-tonne bearings – equivalent to 200 cars – will have to be lifted into the caverns by gantry cranes. The bearings will hold the cutter heads to each of the machines, allowing them to spin.\n\nAdvertisement\n\nHighlighting the task ahead, the boring machines will have to tunnel through a portion of alluvial fill – a mixture of clay, silt and sand – under the harbour. Before they reach one of the riskiest parts of the tunnelling, up to 47 metres below the harbour surface, the giant machines will temporarily stop for a “freshen up”, which will include changing teeth on the cutter heads. Once they resume churning through the alluvial fill, the priority will be to ensure the machines do not stop. Engineers want to avoid them getting stuck like a boring machine did under the Snowy Mountains for the federal government’s multibillion-dollar pumped-hydro project. “That’s something that causes me worry, which is getting stuck under the harbour because there’s only one way to then get to it, which is then sinking something down,” Cooper explained. “If something gets stuck or wears out, then you don’t want to be going and trying to fix things in that bad ground because it’s dangerous for people, and it’s usually under pressure.” During tunnelling for the M1 metro rail line under the harbour in 2019, bubbles rose to the water surface directly above a giant tunnelling machine, alarming senior transport officials who feared that one of the tunnels had been damaged, and possibly breached. However, it quickly turned out to be vibrations from the boring machine that had disturbed air pockets within sediment on the harbour floor. Heralding from Hong Kong, Cooper is no stranger to mega projects having worked in the UK on schemes such as the second stage of the Channel Tunnel rail link before moving in 2008 to Australia where he has been involved with Sydney’s rail projects and the WestConnex motorway. “Going under the harbour is a big risk for us, especially in such a large machine. The ground conditions are not ideal. We’re doing everything possible to make sure that [from the tunnel boring] selection through to how we’re working ... that we can do it safely,” he said.\n\nAdvertisement\n\nThe use of boring machines represents a major U-turn on earlier plans. The previous NSW Coalition government decided to dig deeper tunnels for the main section of the motorway between Birchgrove and Waverton, ditching plans to lay large tubes in a trench on the harbour floor. At the peak of construction, about 500 people will be working underground at any one time. Apart from underground offices, about five support centres complete with kitchen facilities provide respite for workers during their breaks. “Tunnel environments are noisy. They have got somewhere comfortable to sit and have a real break,” said delivery director Dean McAllister, who worked on the $2.6 billion Sydney Gateway motorway and the NorthConnex tunnel. Excavation equipment known as road-headers are being used to carve out massive caverns to assemble the tunnel boring machines. Credit: Janie Barrett Two other chambers each about 42 metres long and 25 metres high have already been excavated for the under-harbour crossing. One of them will house a slurry treatment plant, and the other filter pressers and centrifuges to remove water in the soil. As the boring machines burrow their way under the harbour, slurry will be pumped into their cutter heads to counteract pressure. The circulating slurry will be mixed with the excavated material and pumped back to the treatment plant. After the borers complete their job, the two giant chambers will be used to house ventilation fans to circulate air through the motorway tunnels. Loading Inside the tunnels and caverns already carved out for the project’s first stage, it is noisy and humid as workers, diggers and other excavation equipment navigate the underground world. Cross passages are situated at regular intervals along the twin tunnels, which extend to a spaghetti junction at Rozelle for WestConnex. Trucks queue in the tunnels to collect spoil before emerging above ground to take their loads to development sites across the city. “It’s busier than Trafalgar Square. There are so many different things going on down there,” Cooper said.\n\nAdvertisement",
    "source": "TheAge",
    "cluster_id": 31
  },
  {
    "url": "https://www.theage.com.au/culture/music/she-s-seen-the-chaos-of-life-and-the-quiet-of-death-gordi-won-t-stand-still-20250430-p5lvfd.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "She’s seen the chaos of life and the quiet of death. Gordi won’t stand still",
    "publish_date": "Tue, 03 Jun 2025 11:30:00 +1000",
    "category": "entertainment",
    "authors": [
      "Cassandra Morgan"
    ],
    "text": "Save Log in , register or subscribe to save articles for later. Save articles for later Add articles to your saved list and come back to them any time. Got it Normal text size Larger text size Very large text size Jet-lagged but beaming, Gordi is riding high on love for her latest release. But first we need to talk about Ginger and the goat. When we meet in a light-flooded warehouse conversion cafe in Melbourne’s inner north, her song Peripheral Lover has just come out. It’s only a few days since Gordi was stuck in a blizzard on the tarmac at Dallas in the US – the same city where she filmed the music video for the queer bop almost three years ago. Gordi, aka Sophie Payten, says chaos comes with life as a musician. Credit: Simon Schluter Gordi, restless with boredom, kept herself busy during the three-hour stranding by reading the absurd text exchange of a woman sitting in front. “She had the most enormous phone, and she was trying to text this person named Ginger who’d obviously given her some flowers,” Gordi tells me, laughing. “She was trying to say to Ginger, ‘Instead of paying you with cash, would you accept a baby goat?’ And Ginger said, ‘Yes.’ “That’s kind of a look at the last two weeks.” The unexpected tends to follow globe-trotting musicians, but especially ones who, like Gordi, find it hard to settle for just one job.\n\nAdvertisement\n\nChaos, Chris Martin and impostor syndrome In choosing music – alongside change-making and medicine – Gordi chose chaos. It has led the 32-year-old, real name Sophie Payten, to three studio albums (the third is due for release in August), life-altering work in hospitals during the COVID-19 pandemic, a seat on the board of the Music Australia council and, more recently, an emotional encounter with fellow singer-songwriter Chris Martin. Payten at her Melbourne favourite, CIBI. Credit: Simon Schluter The Coldplay frontman was touring Australia when Payten was invited to join local artists hanging out with him. He singled her out, saying he listened to her music. “I ended up playing [Lunch at Dune] from the [new] record for him, and we had this beautiful exchange where he loved the song; he was moved to tears by it,” Payten says. “I only discovered [that] when I opened my eyes at the end of playing it.” She had closed her eyes because she was so nervous.\n\nAdvertisement\n\n“It was amazing – and no one in the room thought to get their phone out to film it.” Payten spent a few hours wrestling with what she saw as the potential cringe factor of sharing the story online, but friends convinced her to post a Reel about it on Instagram. The video has since been viewed more than 2 million times. The hesitation seems typical of Payten, who is grateful and a tad bashful in the face of her success. Our lunch at CIBI, a Collingwood favourite of Payten’s, is our fourth meeting. I’ve previously interviewed her about the grassroots live music initiative she set up with partner and musician Alex Lahey, Over Our Dead Body, and have gone along to a couple of their gigs.\n\nAdvertisement\n\nLoading Today, she pulls me into a hug, asking how I’ve been and saying, “I didn’t know it was you.” Later, as I’m getting stuck into a soba noodle salad, I say I’ve heard Payten is about to appear on a billboard in Times Square in New York. “Oh, yeah, so there’s actually going to be two billboards in Times Square – one for Spotify and one for Amazon Music,” she says with a shrug, smiling as I interrupt her attempts at eating CIBI’s special lunch plate. “[It’s] cool.” Payten breaks into a grin when I mention Peripheral Lover. Fans are loving the song, even if it is a departure from the deep, reverberating and ethereal sound they’ve come to expect from Gordi. Payten initially thought she would give it away, but it finally felt right after she reworked the chords. “Right up until its release, there was a part of me which felt like, ‘Are people going to think this is not me?’ I had some weird impostor syndrome,” she says.\n\nAdvertisement\n\nThe soba salad at CIBI. Credit: Simon Schluter Payten explains how, in high school, she would scrawl illegible song lyrics on the tiniest notepad she could find, out of fear her classmates might discover them and stick them up around her boarding house. When it came to performing at Sunday night chapel, she would pretend her own songs were written by obscure artists. “I didn’t want the kind of judgment that would come from people knowing that it was mine,” she says. “I wanted to hear their feedback but from a more objective [viewpoint].” Payten grew up on a farm in the NSW town of Canowindra, near Orange, but went to boarding school and university in Sydney. The city is still close to her heart, as is Melbourne, where she moved for love in 2020. She now spends her time between Brunswick in Melbourne’s inner north and Los Angeles. “Brunswick actually has the highest number of registered songwriters in Australia for any suburb,” she says. “[My parents] still work the farm. I call them in the middle of the day, and they’re moving pipes, or chipping burrs, or moving a mob of sheep or whatever. I feel like you’d be hard-pressed to find two other people who are closing in on 70 who work as physically hard as they do. “I try to get home every few months, which is good because it is such an important place to me.”\n\nAdvertisement",
    "source": "TheAge",
    "cluster_id": 32
  },
  {
    "url": "https://au.news.yahoo.com/byd-photos-show-ev-race-heating-up-as-china-looks-to-topple-tesla-its-insane-012054850.html",
    "title": "BYD photos show EV race heating up as China looks to topple Tesla: 'It's insane'",
    "publish_date": "2025-06-03T01:20:54Z",
    "category": "finance",
    "authors": [],
    "text": "Chinese EV makers like BYD are building out huge new capacity to ship cars around the world.\n\nThe Chinese EV giant is rolling out the world's largest roll-on/roll-off (ro-ro) carriers to send cars around the world. Source: BYD\n\nRising Chinese automaker BYD continues to build out its fleet of super-sized car carriers as it seeks to expand its international footprint, moving with \"unprecedented speed\" in a bid to topple Tesla as the global leader in electric vehicles.\n\nThe massive ships are the largest of their kind in the world, measuring some 220 metres long. The company's expansion of its ocean freight capabilities represents the “latest battleground” in China’s pursuit of EV dominance, according to industry watcher Christopher Chico, who writes about the technology in his newsletter The Battery Chronicle.\n\n\"China’s electric vehicle industry is entering a new phase of global expansion,\" he wrote on Monday, noting BYD's growing fleet of ro-ro (roll-on/roll-off) ships.\n\n\"This approach is about more than solving logistics delays. It reflects a broader strategy to control infrastructure, lower costs, and protect global operations from external bottlenecks.\"\n\nBYD's rapidly expanding fleet is ferrying cars around the world. Source: AP\n\nAs he pointed out, the concept of automaker-owned maritime logistics is not new with Japanese and South Korean car makers relying on their own specialised car carriers to send vehicles around the world.\n\nADVERTISEMENT\n\nBut Chinese automakers \"are scaling the model at unprecedented speed\", looking to capitalise on growing demand and replace Tesla car sales in overseas markets with a cheaper alternative as Elon Musk’s political antics drive many customers away.\n\nAmong BYD's fleet is a ship that reportedly boasts a 9,200 vehicle capacity which had its maiden voyage in late April to Brazil and another ship of the same size that is yet to set sail.\n\nChinese automakers are building massive shipping fleets to export EVs around the world, following in the footsteps of Japan and South Korea. Here’s BYD’s fleet so far.\n\n\n\nFrom Christopher Chico’s Battery Chronices newsletter: https://t.co/PbGVw1Y7wZ pic.twitter.com/7oRBDLGmas — Kyle Chan (@kyleichan) June 1, 2025\n\n'China is on another level'\n\nOne person who has seen firsthand China's rise in EV manufacturing is car expert Paul Maric who recently returned from the Shanghai International Automobile Industry Exhibition where Chinese car brands displayed their latest innovations.\n\nADVERTISEMENT\n\n\"It's insane, China is on another level entirely,\" he told Yahoo News.\n\n\"Anyone in Australia who thinks they’re just going to go away sometime soon is in for a shock.\n\n\"I think eventually it will just lead to cars becoming more affordable,\" he said of the growing expansion of the Chinese industry.\n\nBYD XI'AN hits the waves, as the world's largest roll-on/roll-off (ro-ro) carrier, BYD SHENZHEN, prepares to make its mark at sea.\n\n\n\nDrive the future. Sail with BYD.#BYD #BuildYourDreams pic.twitter.com/82txjrnNNb — BYD Global (@BYDGlobal) April 4, 2025\n\nAccording to BYD figures, the company sold 88,640 passenger vehicles to overseas markets in May, up 133 per cent year-on-year. As analysts noted this week, that run rate would put BYD on track to sell a million cars a year to overseas markets.\n\nADVERTISEMENT\n\nAnd it's putting incumbent — and typically more expensive — car manufacturers on notice.\n\n\"I think the people who are really in trouble are Japanese manufacturers… I don’t know whether they’ve got blinders on but they just don’t think it’s a problem. When you look at how much [Japanese manufacturer] Toyota charges for something like a RAV4 compared to literally any car from China, you’re just not going to be able to get away with that for too much longer, I don’t think,\" Maric said.\n\nTesla sales plunge in Australia, Europe\n\nTesla sales across Europe plunged by half in April even as growth in the electric car market picked up pace, according to newly released data.\n\nSales of Tesla vehicles in 32 European countries tumbled 49 per cent to 7,261 in April from 14,228 in the same month the previous year, according to figures released by the European Automobile Manufacturers Association, or ACEA.\n\nADVERTISEMENT\n\nAt the same time, sales of battery-electric vehicles by all manufacturers rose about 28 per cent.\n\nThe figures, which cover the European Union's 27 member countries and five other nations outside the bloc, back up early data from Sweden, the Netherlands and Denmark released earlier this month that had pointed to a sales collapse for Tesla, the hitherto dominant market leader in the EV race.\n\nIt's been a similar story in Australia, with Tesla sales showing a near 60 per cent fall in the first quarter of 2025 compared to the same time last year, according to data released by the EV Council.\n\nwith AP\n\nDo you have a story tip? Email: newsroomau@yahoonews.com.\n\nYou can also follow us on Facebook, Instagram, TikTok, Twitter and YouTube.",
    "source": "Yahoo",
    "cluster_id": 44
  },
  {
    "url": "https://au.news.yahoo.com/late-night-beach-find-highlights-dark-side-of-aussie-states-88-million-tourism-pledge-074215574.html",
    "title": "Late-night beach find highlights dark side of Aussie state's $88 million tourism pledge",
    "publish_date": "2025-06-02T07:42:15Z",
    "category": "finance",
    "authors": [],
    "text": "A giant ocean creature was discovered wrapped in chains and struggling to survive at a popular holiday beach.\n\nRescue volunteers worked for over an hour to free a manta ray they discovered had been caught in drumlines. Source: Noosa Wildlife/taylor_x_ocean\n\nWhile most Aussies were sitting down to dinner, watching TV on the couch, or out grabbing a beer at the pub, a small group of beachgoers was waist-deep in water to start the weekend. They were crowded around a manta ray, a large protected species of fish that visitors flock to Queensland’s warm waters to photograph.\n\nBut what occurred in the popular tourism town of Noosa on Friday night isn't something you’ll see in holiday brochures. This manta ray had rope and chain wrapped around it, and a hook deep in its mouth. Scratches around its body, and bites from tiny fish around its mouth and long lobes it uses for communication, indicate it had been unable to move for a long time.\n\nWhen wildlife rescuer William Watson arrived at the beach, his first thought was that the fish was wrapped in a boat's anchor. He worked with a group of locals for more than an hour to try and cut it free.\n\n“He was very tired and very weak. He must have been thrashing and got himself twisted around,” the Wildlife Noosa founder told Yahoo News. “He had a hook through the side of his mouth, I had to pull it out backwards, because you couldn’t cut it.”\n\nManta ray entanglement linked to beach 'safety' program\n\nAs the creature slowly swam away, he began to process what had happened. The equipment that had caught the manta ray wasn’t from an anchor. It appeared to have been deliberately set.\n\nADVERTISEMENT\n\nThe chain and hook looked to be part of a drumline, a type of baited hook placed strategically around the coast by the state government. The purpose of these devices is to catch seven target species of shark and make beachgoers feel safe, which is important given the tourism industry has an estimated value of $33 billion a year.\n\nRelated: Queensland bureaucrats accused of ‘sanitising’ bloody act against shark\n\nHowever, Friday’s incident highlights that more often than not, it’s not just sharks that are being snared in drumlines and nets, but also protected species like manta rays, endangered sea turtles, and dolphins.\n\nDocumentarian and Envoy Foundation director Andre Borell told Yahoo News the problem could potentially get worse, with the Crisafulli government announcing last week it would be expanding upon a decades-old shark control program with an $88 million investment, a plan it linked to \"upholding Queensland’s international tourism reputation\".\n\nADVERTISEMENT\n\n“It’s anti-science. Lethal methods don’t make beaches any safer… They’re proclaiming it as a great step forward, but in reality, they’re investing in something that doesn’t work,” he claimed to Yahoo News.\n\nHis concerns mirror those of the RSPCA, which responded to the Crisafulli Government announcement by joining the Nets Out Now coalition and warning nets create a “false sense of security” among beachgoers. “These devices are not physical barriers. Sharks can swim around or beneath them, and yet they continue to kill marine life indiscriminately, including protected species that pose no threat to humans,” its head of policy Rachel Woodrow said.\n\nVolunteers worked for an hour to free the hooked manta ray. Source: Noosa Wildlife\n\nBoth also raised concerns about the legality of the expansion of the program, which in its current state has an exemption from the Commonwealth’s threatened species protection laws, the EPBC.\n\nGovernment prioritising human life over wildlife\n\nQueensland's government has claimed shark controls like drumlines and nets “likely” lessen the chances of attacks. Its primary industries minister, Tony Perrett, said the planned expansion of the program was “big and bold”.\n\nADVERTISEMENT\n\n“It puts swimmer safety first, and it's the largest overhaul of funds this program has seen in over 60 years,\" he said.\n\nResponding to questions about Queensland's shark control program and bycatch of animals like manta rays, Perrett told Yahoo the government will \"prioritise the safety of people above all else.\"\n\nReferring to a report by international audit group KPMG, he said nets and drumlines are \"still the most effective way of protecting swimmers\".\n\n“Until the new technology is scientifically proven as effective at protecting beach goers as traditional methods, we will continue to invest in what keeps Queenslanders and our beaches safe,\" he said in a statement.\n\nThe expansion of the shark control program will see nets installed at up to seven new locations, and they'll be checked every day, which the department of primary industries claims will improve swimmer safety and lessen bycatch.\n\nADVERTISEMENT\n\nWith some of the money being directed to research, education and innovation, and the doubling of drone surveillance from 10 to 20 locations, the department said the plan \"strikes a balance\" between lethal and non-lethal methods.\n\nLooking generally at shark control in Australia, there is evidence that attacks are less likely at netted beaches. However critics argue that's because the same stretches are patrolled by lifeguards.\n\nConcern for whales as migration begins\n\nQueensland's tourism industry is already under pressure, with a major drawcard, the Great Barrier Reef severely degraded due to mass bleaching and extreme weather linked to climate change. Borell believes the shark control program will damage other ecosystems that draw holidaymakers to the Sunshine State.\n\n“Manta rays, dolphins, whales, turtles, everything you can picture on a tourism poster for Queensland, we’re catching and killing it in the shark control program,” he said.\n\nWhile shark nets cover just 0.03 per cent of Queensland's coast, because they are placed in populated areas, their impact on protected wildlife is routinely observed.\n\nSo with whales now migrating towards Queensland’s warmer waters from Antarctica, it’s almost certain they’ll soon be seen entangled in the nets. While NSW removes its shark nets during the winter migration, Queensland keeps them in place, and mothers and their inexperienced calves are regularly caught — an average of six per year.\n\nAnd that’s something that keeps Watson and his Noosa Wildlife rescue volunteers up at night.\n\n“Everyone’s got anxiety over them. It’s horrible. I’d love to be waiting for the whales to be coming in, rather than thinking, please don’t,” he said.\n\nIn Queensland, it is illegal for members of the public to remove drum lines or shark nets.\n\nLove Australia's weird and wonderful environment? 🐊🦘😳 Get our new newsletter showcasing the week’s best stories.",
    "source": "Yahoo",
    "cluster_id": 45
  }
]