[
    {
        "url": "https://www.9news.com.au/finance/rba-interest-rates-live-updates-february-2026-decision-latest-news-headlines/cec87747-a086-4fb9-aab2-29f5790794d1",
        "title": "RBA expected to hit millions of Aussies with interest rate pain",
        "publish_date": "Tue, 03 Feb 2026 01:17:34 +0000",
        "category": "finance",
        "authors": [
            "Feb"
        ],
        "text": "H﻿ello and welcome to 9news.com.au's live coverage of today's interest rates decision.\n\nThe Reserve Bank of Australia is widely expected to hand down a hike today, bringing the official cash rate up 25 basis points to 3.85 per cent.\n\nHowever, some economists and traders believe there is a chance Governor Michele Bullock will announce a hold, with the﻿ market pricing in a roughly 70 per cent chance of a rise.\n\nThe RBA will hand down its decision at 2.30pm (AEDT), and Bullock will hold her post-meeting press conference at 3.30pm.\n\nREAD MORE: Treasurer defends government spending ahead of expected rates hike\n\nREAD MORE: Home buyers' budgets could be cut by thousands overnight\n\nREAD MORE: 'Cold shower' for mortgage holders: Experts' gloomy rates' forecast\n\n﻿READ MORE: Three things could save Aussies from looming interest rate hell",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/ebikes-sydney-woman-left-brusied-and-with-brain-bleed-after-ebike-crash/8d85be36-89b5-4268-b948-43a7f96dccfd",
        "title": "NSW woman left brusied and with brain bleed after e-bike crash",
        "publish_date": "Mon, 02 Feb 2026 22:24:39 +0000",
        "category": "finance",
        "authors": [
            "Feb"
        ],
        "text": "A﻿n elderly woman has been left bruised and with a brain bleed after she was hit by a child on an e-bike.\n\nRobin*, from Balgowlah in Sydney's north, told 2GB's Ben Fordham that she had already spent a week in hospital after she was hit by the bike while she was waiting at a bus shelter.\n\nThe NSW woman said she remained in the hospital until her scans were stable﻿.\n\nA﻿n eldery woman has been left brusied and with a brain bleed after she was hit by a child on an e-bike. (2GB)\n\n\"I'm feeling a lot ﻿better but I'm still very, very sore and bad headaches,\" she said.\n\n\"I could see this ﻿kid coming, he was going so fast I actually thought he was out of control.\n\n\"I was trying to get away from the bus shelter, but before I could move he hit me and sent me flying.\n\n\"It was so fast, but ﻿all I know is my head and my hands hit the ground first, because my whole face is purple now.\n\n\"﻿My knees and everything, I just went crash bang onto the ground.\n\n\"Even the whites of my eyes were black.\"\n\nRobyn said the e-bike rider did not stop to help her. (Getty)\n\nShe said the child on the e-bike didn't stop ﻿to help her, and there was \"no sign of him\" after she fell to the ground.\n\nHowever the bus was stopped at the red light and the bus driver got off to help her.\n\n\"The bus driver got off and somebody else helped me up,\" she said.\n\n\"I sat in the bus shelter until I stopped shaking and took myself home which was across the road.\"﻿\n\nShe tried to get CCTV from the shop across the road but the bus was parked. She said she wasn't the only one in hospital who had been hit by one.\n\n\"When I was ﻿having x-rays, the girl said this is the third e-bike for the day,\" she said.\n\n\"﻿My daughter had her whole arm smashed up, she's had plates and screws in her, that was nine months ago, and she's still having physio trying to get the arm going.\"\n\n*Name changed at Robin's request.﻿",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/body-found-at-dee-why-beach/b55d8340-2926-425b-9241-226e714dff32",
        "title": "Body of man found on Sydney beach",
        "publish_date": "Mon, 02 Feb 2026 22:21:16 +0000",
        "category": "finance",
        "authors": [
            "Feb"
        ],
        "text": "P﻿olice say a man's body found at a popular Sydney beach early today is not shark-related.\n\nP﻿olice say a man's body found at a popular Sydney beach early today is not shark-related.\n\nThe man's body was discovered at Dee Why beach on the city's Northern Beaches about 6am.\n\nThe man's body was discovered at Dee Why beach on the city's Northern Beaches about 6am.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/brain-tumour-vaccine-trial-for-children-in-australia/0c929d47-a04b-476a-8da2-e0615483b0fd",
        "title": "Aussie vaccine trial offers 'glimmer of hope' for kids with brain tumours",
        "publish_date": "Mon, 02 Feb 2026 23:41:16 +0000",
        "category": "lifestyle",
        "authors": [
            "Feb"
        ],
        "text": "A world-first vaccine trial in Australia will treat children with advanced brain tumours using technology from the COVID-19 jab.\n\nThe clinical study – led by the University of Queensland and South Australia Health and Medical Research Institute (SAHMRI) – will harness mRNA medicine to encourage the body's immune system to fight cancerous cells.\n\nEach of the vaccines will be personalised using genetic markers, and scientists hope the shots will improve survival rates of childhood brain cancer.\n\nREAD MORE: ﻿ Fergie email sparks bombshell Epstein baby claim\n\nThe vaccine trial will use mRNA technology, known for the COVID-19 vaccines. (Scimex)\n\nREAD MORE: Treasurer defends government spending ahead of expected rates hike ﻿\n\nThe four-year trial will be rolled out at eight paediatric hospitals in Queensland, SA, New South Wales, Victoria﻿ and Western Australia later this year.\n\nYoung patients with \"dismal outlooks\" or a survival expectancy of between 12 and 24 months will be eligible for the trial.\n\nThis includes children with relapsed and unresponsive high-grade tumours, medulloblastoma, ependymoma, high-grade glioma and newly-diagnosed diffuse midline gliomas.\n\n\"This is a new, personalised approach to treating these especially difficult brain cancers that we believe has huge potential,\" SAHMRI and Adelaide University clinical lead Professor Jordan Hansford said.\n\n\"Phase I of the trial will help us determine the safest and most effective dose.\n\n\"Phase II will assess how well the treatment works, including whether it slows cancer progression and improves overall survival and quality of life for participating children and their families.\"\n\nHansford said half of all screened participants may be suitable for the trial.\n\nAround 70 children from around Australia will take part in the trial over four years.\n\nProfessor Brandon Wainwright of UQ's Frazer Institute is the trial's scientific lead. (The University of Queensland)\n\nIt takes about eight weeks to develop each vaccine, and each child is given eight shots, two weeks apart, before booster shots later down the track\n\nPersonalised mRNA vaccines have already shown promising results in adults with rare and difficult-to-treat cancers, such as pancreatic and melanoma.\n\n﻿The trial will provide a \"glimmer of hope\" for children with aggressive brain tumours, UQ's Frazer Institute scientific lead Brandon Wainwright explained.\n\nAround 70 children from around Australia will take part in the trial over four years. (iStock)\n\n\"After identifying unique cancer markers in each child's tumour using genome sequencing and advanced data analysis, we will select tumour-specific vaccine targets,\" Wainwright said.\n\n\"Customised vaccines for each child will then be manufactured in Queensland by Southern RNA and then sent to the trial sites for dosing.\n\n\"We expect to have a customised vaccine ready within about 10 weeks of them enrolling in the trial.\"\n\nAbout 40 Australian children die every year of brain cancer, which is the deadliest childhood cancer.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/world/melania-trump-box-office-bomb-session-times-australia-usa-politics-news/83eb9bc0-fd79-4667-bba5-6caef958fcab",
        "title": "Melania Trump's movie bombs hard at the Australian box office",
        "publish_date": "Mon, 02 Feb 2026 23:34:23 +0000",
        "category": "finance",
        "authors": [
            "Feb"
        ],
        "text": "The documentary about Melania Trump which cost Amazon more than a hundred million dollars has bombed at the Australian box office.\n\nMelania debuted on its opening weekend at 31st at the box office, selling just $22,284 worth of tickets.\n\nIn its first three days in release, it sold just $675 per screen.\n\nAmazon paid Melania Trump tens of millions of dollars for the rights to her documentary. (AP)\n\nThe documentary appeared in the box office list two spots above Dune: Part Two , which was showing on a single screen two years after it was first released.\n\nTopping the box office, horror film Iron Lung debuted to $1.153 million, making $4726 per screen.\n\nMelania , which tells the story of the weeks leading up to the president's inauguration from the perspective of the First Lady , fared much better in the US.\n\nThe film debuted in third place with $10 million in takings.\n\nThis makes it the highest debut for a documentary in years.\n\nMelania Trump at the premiere of her movie. (AP)\n\nIn the UK, the film sold $63,000 worth of tickets, debuting in eighth place. In New Zealand it debuted at 28th with $4647.\n\nBut Melania has a steep hill to climb if it intends to be profitable for the studio.\n\nAmazon paid $57 million for the rights to the movie, much of which went into the First Lady's pocket.\n\nIt also reportedly spent a further $50 million on promoting the movie.\n\nIn order for the movie to be a financial success for Amazon , it would need to have a historic run following its opening weekend.\n\nThe audience waits for Melania to begin at a screening in her home country of Slovenia. (AP)\n\nTypically movies need to make more than double their budget in order to turn a profit, given the cinemas themselves take a substantial cut of the ticket sales.\n\nMelania has also shown an enormous divide between critical reception and how general audiences responded.\n\nCritics reviews gathered by Rotten Tomatoes showed just seven per cent of them liked the movie.\n\nAmazon has spent tens of millions of dollars promoting Melania. (Amazon MGM)\n\nBy contrast, 98 per cent of audience members on the site said they liked the movie.\n\nThe film was directed by Brett Ratner , the Hollywood filmmaker behind blockbuster hits like Red Dragon, X-Men: The Last Stand and the Rush Hour franchise.\n\nMelania is his first movie since six women accused him of sexual misconduct in 2017 .\n\nHe is now working on Rush Hour 4 at the behest of Donald Trump.\n\nMelania Trump in the documentary. (Amazon MGM)",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/woman-crushed-by-machinery-in-perth/78c448b1-39d6-49a5-9928-505b29f834f0",
        "title": "Bobcat falls off trailer, crushing car and trapping woman",
        "publish_date": "Mon, 02 Feb 2026 11:15:25 +0000",
        "category": "finance",
        "authors": [
            "Feb"
        ],
        "text": "crews have rushed to free a woman after she became trapped under a bobcat in south-east\n\nIt's understood a car was towing a trailer with a bobcat on the back when it came off and hit the car behind it on Caulfield Street in Champion Lakes about 4pm today (7pm AEDT).",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/australian-real-estate-1-million-dollar-average-home-perth-melbourne-sydney/a8eed6c9-ed5a-4b7f-83b0-832e11f02725",
        "title": "New capital joins $1 million house club",
        "publish_date": "Mon, 02 Feb 2026 06:03:44 +0000",
        "category": "finance",
        "authors": [
            "Feb"
        ],
        "text": "A new capital has joined the ranks of Australian cities where the average house exceeds $1 million, as property prices continue their stubborn climb nationwide.\n\nThe median cost of a standalone home in Perth hit $1,003,804 in January, climbing 1.9 per cent from the previous month, according to Cotality's Home Value Index.\n\nIt is the fourth Australian city to reach that benchmark, trailing just behind Brisbane and Canberra where median house prices have crept up to $1,149,589 and $1,033,761 respectively.\n\nProperty values in Perth have jumped by 18.5 per cent in the last 12 months, with standalone houses now exceeding $1 million for the first time. (Getty Images/iStockphoto)\n\nIt comes amid persistent property price rises nationwide, despite renewed cost of living pressures on the eve of a forecast interest rate hike.\n\nThe newly released Home Value Index also shows that it is the most affordable properties - those in the lowest quarter of the price range - where prices are rising fastest, in a trend that risks pushing home ownership ever further out of reach for thousands of Australians.\n\nWhile Sydney remains by far the most unaffordable city for house ownership, with a median price of $1,598,819, growth has slowed to just 0.3 per cent in January.\n\n﻿Nationally, the value of Australian homes (both houses and apartments) rose by 0.8 per cent in January, according to Cotality's Home Value Index - a slight uptick from 0.6 per cent in December. ﻿\n\nStubbornly high property prices are a fresh blow to prospective home buyers who are bracing for a cut to their borrowing power if the Reserve Bank hikes interest rates tomorrow as forecast.\n\n\"Despite the most unaffordable conditions on record in many cities, along with a rebound in cost of living pressures and prospect of a rate hike as early as (tomorrow), we are still seeing a broad-based rise in housing values,\" Cotality's research director Tim Lawless said.\n\nHowever, Lawless suggested price rises are likely to ease this year, as demand eased and forecast interest rate hikes limited people's ability to service larger mortgages.\n\nFewer homes are being put on the market this month compared to the same time last year. (Supplied / Nine)\n\nThe number of homes advertised for sale is currently 19﻿ per cent below where it was at this time last year and 25 per cent below the five-year average.\n\nAt the same time, the quarterly number of home sales is one per cent higher than a year ago.﻿\n\nAustralia's smaller and mid-sized capitals have recorded the biggest jump in property prices, with Perth, Brisbane and Adelaide prices rising by between 1.2 and 2 per cent.\n\nThat compares to an incremental creep of just 0.2 and 0.1 per cent respectively for Sydney and Melbourne.﻿\n\nIn the past year, Darwin has seen the steepest property price increases, up by almost a fifth (19.7 per cent).\n\nThe second-largest increase is in Perth, where combined house and unit prices have risen by 18.5 per cent annually, making it the third most expensive city to buy a property after Sydney and Brisbane.\n\nSydney and Melbourne properties are up a comparatively ﻿small 6.4 and 5.4 per cent annually.\n\nIn worrying news for housing affordability and equality, homes at the most affordable end of the housing market are seeing the largest price hikes.\n\nHouse values in the lowest quartile rose by 1.3 per cent, compared to just 0.3 per cent rise in the top quartile.﻿\n\n\"This trend of stronger growth conditions at lower price points is supported by intense competition for more affordable houses,\" said Lawless.\n\n\"This is where first home buyers, investors and, progressively, mainstream demand is most concentrated.\"",
        "source": "9News"
    },
    {
        "url": "https://www.abc.net.au/news/2026-02-03/rural-community-launches-class-action-against-major-goldmine/106295724",
        "title": "Class action alleges contamination by one of world's biggest goldmines",
        "publish_date": "Tue, 03 Feb 2026 01:55:33 +0000",
        "category": "finance",
        "authors": [],
        "text": "Landowners living near one of the world's biggest goldmines in central west NSW have launched an environmental class action alleging contamination of more than 2,000 properties.\n\nLawyers for the claimants allege arsenic, heavy metals and forever chemicals known as PFAS have travelled from Newmont's Cadia goldmine onto properties in a 17-kilometre radius.\n\nThe EPA launched criminal proceedings against Newcrest Mining in the Land and Environment Court. (Supplied: Newcrest)\n\n\"This case follows … three years of investigation by the community, [looking] at the impact upon their properties from the dust and water pollution, \" principal lawyer Oliver Gayner said.\n\nMr Gayner said the community felt it had \"no choice\" other than to litigate.\n\n\"They've communicated those science-based results to the mine operator and sought a collaborative process to try and resolve the pollution issues, but those requests have been refused,\" he said.\n\nWater scientist Dr Ian Wright has contributed his expertise to the community's testing program. (ABC Central West: Micaela Hambrett)\n\nCommunity members are seeking compensation from the mining giant, saying the pollution has damaged their property values through a \"toxic trifecta\" of air, surface and groundwater pollution.\n\nThey are also seeking an injunction to restrain further pollution from the Cadia site, which has a production rate of more than 30 million tonnes of ore a year.\n\n\"Success for us is not about money, it will be measured by the change in operations at Cadia,\" Mr Gayner said.\n\nIn a statement, Newmont Cadia confirmed it had been served with proceedings in the Supreme Court of NSW and would \"respond through the appropriate legal processes\".\n\n\"As the matter is before court, it is not appropriate to comment further at this time,\" the statement read.\n\nDust up\n\nResidents of the Cadia and Errowanbang valleys near Orange flagged pollution concerns with the NSW Environment Protection Authority (EPA) in 2018, after the mine's tailings dam wall collapsed.\n\nJann Harries, who lives 2 kilometres from the mine's boundary, said the impact of the structural failure was obvious.\n\n\"Everything was covered in off-white dust, day in, day out,\" Ms Harries said.\n\n\"It had that taste and smell, if I breathed it in, I'd start coughing.\"\n\nA photograph taken at Jann Harries fence line during a dust event in May, 2023. (Supplied: Cadia Community Sustainability Network)\n\nConcerns were raised again after extractor fans over an underground crusher were found to be blasting unfiltered dust into the atmosphere at 18 times the legal limit.\n\nDrinking water tanks on neighbouring properties were subsequently found to contain heavy metals, including lead.\n\nFuture implications\n\nThe class action is being bankrolled by UK litigation fund Aristata, whose executives travelled from London to visit allegedly affected farms last year.\n\nIn a statement, head of portfolio management, Michael Hartridge, called the case \"important\", saying it supported the \"UN's sustainable development goals\".\n\nClaimants said they were not arguing the mine should be shut down, acknowledging its role in the region's economy.\n\nHowever, they claim the current operating rate is not sustainable for the health of their own interests.\n\nLawyer Oliver Gayner says the class action may end up being a test case for regulators. (ABC Central West: Micaela Hambrett)\n\nMr Gayner said the case was unusual because it was being bought by people with similarly valuable assets to protect.\n\n\"What's unusual is the close juxtaposition of a mine within an [organised and determined] community, with farmland and residential properties which are high value,\" he said.\n\n\"These people want to protect their interests now and for the future.\"\n\nCourt history\n\nIn 2023, Newmont pleaded guilty in the Land and Environment Court to three counts of air pollution and was fined $350,000.\n\nTwo additional charges were dropped in exchange for the mine installing five new dust monitors in 2024.\n\nThat same year, farmers on the mine's southern border reported slabs of white foam appearing on the Belubula River, an important source of irrigation for the region.\n\nFoam was recorded in the Belubula River in July 2024. (Supplied: Cadia Community Sustainability Network)\n\nLaboratory tests revealed the foam was predominantly PFOS, a synthetic chemical used in a variety of industrial applications, including firefighting.\n\nA year-long sampling program by the Environment Protection Authority established PFAS was present in the Upper Belubula River catchment at 16 sites, including the Blayney tip, landscape supplier ANL and Cadia, but the risk was low for livestock and the environment.\n\nThe EPA later banned fishing in the Belubula and erected warning signs after testing revealed the flesh of some fish species contained 40 times the daily intake limit for PFOS.\n\nA hearing has been directed for March.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2026-02-03/potato-company-zerella-plans-nt-katherine-expansion/106296502",
        "title": "Major potato supplier Zerella plans new NT farm",
        "publish_date": "Tue, 03 Feb 2026 01:51:59 +0000",
        "category": "finance",
        "authors": [],
        "text": "A potato supplier for major supermarkets and chip brands hopes to start operations in the Northern Territory which would mark the return of the sector after several decades.\n\nZerella Holdings has applied to clear about 210 hectares of vegetation on its Eagle Park property outside the town of Katherine, south of Darwin, for irrigated potato production and associated infrastructure.\n\nThe farm would produce seed potato, a tuber used to grow the harvestable version of the crop, for Zerella's 50,000-hectare operation in the Mallee region of South Austalia.\n\nIt is understood if the venture succeeds it would be the first commercial potato production in the Top End for about 20 years.\n\nOne of the properties owned by Zerella Holdings. (Supplied)\n\nGeneral manager Renee Pye said trials had identified the region, renowned for its mango and cattle sectors, as ideal for taking pressure off their other farms further south.\n\n\"The Katherine operation is really just to add another rotation for us with seed so we can move the process along at a better rate,\" she said.\n\n\"[Conditions] are not good when it comes to the wet season, so that's not when we are planning on planting and harvesting. We're trying to make sure that we hit that window of your dry season.\"\n\nShe said Zerella hoped to start planting in April, but a new shed, cool room and power upgrades would need to be completed first.\n\nMs Pye said rumours about the plan had circulated throughout the NT's agricultural community as potatoes had not been cultivated at a commercial scale in the region for many years.\n\n\"There's a lot of questions being asked because obviously potatoes haven't been grown in the Northern Territory for a long time,\" she said.\n\n\" There's been a few goes across the last 20 years. We're committed to it and it worked the first year, so we're keen to see it through. \"\n\nPrevious ventures too expensive\n\nMike Braun grows cut flowers in Darwin's rural area and tried his hand at potatoes in the late 1990s.\n\nMike Braun pictured with his freshly-cut Heliconias. (ABC Rural: Lisa Herbert)\n\nHe said the dry season provided suitable conditions for the crop but he could not get a good price and eventually moved his business away from potatoes.\n\n\"I had some success and I thought I might do it on a bigger scale,\" he said.\n\n\"[But] there's potato growers all over the country, even up north in the Atherton Tablelands in Queensland. So the market was really oversupplied.\n\n\"Looking back at my fertiliser cost and water and so on I thought it might not be viable. So I gave it up after a few years.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2026-02-03/working-port-bays-west-rezoning-sydney-harbour/106294212",
        "title": "Sydney's maritime history faces uncertain future amid rezoning plan",
        "publish_date": "Tue, 03 Feb 2026 00:00:04 +0000",
        "category": "finance",
        "authors": [],
        "text": "The future of some of Australia's oldest ships is uncertain as harbour leases near expiration and development pressure comes to bear.\n\nSydney Heritage Fleet maintains and restores some of Sydney's oldest marine vessels, including the James Craig tall ship built in 1884, the 1927 John Oxley steamship and the 1912 Kanangra Sydney ferry.\n\nThe Rozelle shipyard says its lease on the government-owned land is up in 2028. Vice-president Brett Smith is concerned the organisation may be left without a home if the land is acquired amid Bays West transport oriented development (TOD) rezoning.\n\nSydney Heritage Fleet workers restore and maintain some of the city's oldest vessels. (ABC Radio Sydney: Declan Bowring)\n\nMr Smith says there is nowhere else in Sydney that could accommodate the fleet.\n\n\"There's nowhere left because it's all been developed and sold off,\" he said.\n\n\"It's not just waterfrontage [we need] — it has to be waterfrontage in an area where you can make a bit of noise.\"\n\n\"If they did come to us and say, 'Sorry, you're out in '28', we don't know where we're going to go.\"\n\nBrett Smith from Sydney Heritage Fleet says there are no suitable alternatives to the Rozelle Bay site. (ABC Radio Sydney: Declan Bowring)\n\nAcross a 10-lane highway connecting the city's Inner West to the Anzac Bridge is the site of the future Bays Metro station, which is due to be completed in 2032.\n\nPlans for the development include rezoning land for new homes within 1,200 metres of the station.\n\nA Department of Planning, Housing and Infrastructure website said the the plan would be made public by 2025 but that date has been missed.\n\nA NSW planning department spokesperson said the plan was subject to a review of the working port by the state's Cabinet Office.\n\nThe volunteer-run Sydney Heritage Fleet fixes up century-old ships. (ABC Radio Sydney: Declan Bowring)\n\nMr Smith says moving the working port for housing will make repair and maintenance jobs in Sydney Harbour more expensive.\n\n\"If the right balance isn't struck on the housing versus commercial-industrial use of this land … I know that governments will look back and really regret that,\" he said.\n\n\"The the only way to maintain things in and around the harbour will be to bring things in from other ports via barges.\n\n\"There'll be extra costs involved in that, all sorts of issues with weather, when you can't actually do those sorts of transport work.\"\n\nThe shipyards at Rozelle Bay sit close to the future metro station. (ABC Radio Sydney: Declan Bowring)\n\nUncertainty at working port\n\nMarine companies based at Rozelle Bay say they have leases until 2028 and are also facing an uncertain future.\n\nClement Marine Constructions director Richard Oppedisano says he does not know whether the outfit will be able to continue to do emergency work on ferry wharves.\n\n\"I'm not sure if we can even carry out the work that we do now and meet our obligations under our contracts, because part of those obligations are we've got time limits on how long it takes us to get the equipment to the job site,\" he said.\n\nA metro station is planned for the Bays West precinct to connect open spaces and social infrastructure. (Supplied: Infrastructure NSW)\n\nMr Oppedisano said the company had not had alternative locations proposed by the state government.\n\nBrad Hosemans from Polaris Marine, a maintenance contractor for Transport for NSW, wrote a submission during the Bays station consultation process in which he said there was no other site on the harbour that would allow the company to continue at the same scale.\n\n\"That is because no such site exists,\" he said.\n\n\"The combination of deep-water access, industrial zoning, sufficient land area, and continuous navigational access does not exist elsewhere in the harbour.\"\n\nMr Hosemans rejected the idea of moving to Port Botany or Port Kembla, south of Wollongong, as it would make the day-to-day maintenance of harbour assets untenable.\n\nCabinet review of port ongoing\n\nDespite the planning department website stating the Bays West TOD rezoning plan would be publicly available in 2025, they have not been published.\n\nBays West is one of eight TOD precincts in Sydney and is the only one that does not have a finalisation report exhibited.\n\nThe website states that the Bays West TOD rezoning will track on a different timeline due to the need to \"resolve working harbour and ports uses\".\n\nA spokesperson for the Department of Planning, Housing and Infrastructure said the rezoning proposal was subject to a review led by the Cabinet Office.\n\nThe review is examining the potential of housing coexisting with the working port, according to a 2025 Transport for NSW report.\n\n\"The review has involved extensive consultation with stakeholders, including leaseholders operating out of the precinct,\" the spokesperson said.\n\n\"No decision has been made on the future of the precinct. The NSW government will have more to say once it has considered the findings of the review.\"\n\nThe precinct includes parts of the working harbour at Glebe Island in White Bay, which handles large amounts of the state's cement, sugar, salt and gypsum.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2026-02-03/nusantara-beat-psychedelic-take-on-indonesian-music-womadelaide/106295532",
        "title": "Nusantara Beat to bring 'psychedelic' take on Indonesian folk music to WOMADelaide",
        "publish_date": "Mon, 02 Feb 2026 23:55:44 +0000",
        "category": "entertainment",
        "authors": [],
        "text": "An Amsterdam-based band is bringing its psychedelic take on traditional Indonesian music to Australia for the first time in March.\n\nNusantara Beat topped the Transglobal World Music Chart in January and is scheduled to play in South Australia at world music, art and dance festival WOMADelaide.\n\nAll members of the Dutch band have Indonesian ancestry, and guitarist Jordy Sanger said they decided to dive into their roots through music.\n\n30 years of Womadelaide for a tree Womadelaide has grown in 30 years from small beginnings in Adelaide's Botanic Park, but so too have the trees its musical notes have bounced about.\n\n\"Psychedelic music, for me, is where your thoughts float away, not being afraid of making bold choices in a sonic way, trying to connect different harmonic realms, like a trip,\" Sanger said.\n\n\"And indeed, it's so much fun to combine that with traditional Indonesian music and instruments.\n\n\" The traditional instruments can make the music sound very dangerous … we love that. \"\n\nSanger said everyone in the six-piece band had sought to discover their ancestry.\n\nJordy Sanger says it felt \"unreal\" to hit number one on the Transglobal World Music Chart. (Instagram: @nusantara_beat)\n\n\"When I was a kid and living in the east of the Netherlands, all my friends were white; I was the only brown kid at school,\" Sanger said.\n\n\"So when I looked in the mirror, I always saw something different compared with my local environment and that was fine. I experienced it as something rather neutral.\n\n\"But when I grew older, I became more curious about my roots and ancestry, especially in my late 20s.\"\n\nLive music is integral to Indonesian culture — in traditional music settings, but also in guitar-based rock'n'roll that is exceptionally popular among locals.\n\n\"Live music runs in their veins,\" Sanger said.\n\n\"In the Netherlands, almost every Indonesian-descended person I know, knows how to play guitar.\"\n\nHe said it felt very \"exciting to discover 60s and 70s Indonesian pop music\".\n\nNusantara Beat is fronted by vocalist Megan de Klerk. (Instagram: @nusantara_beat)\n\n\"Although I don't understand all the words immediately, the music and the words do resonate with me,\" he said.\n\nSanger also studied the compositional aspect of Indonesian music.\n\nThis included the scales and harmony used in traditional Indonesian music and Sunda pop [Sundanese popular music].\n\nIn what he described as a generally unplanned approach, the band acquired some traditional instruments like gamelan gangsa (metallophones), kecapi, kendang, ceng-cengs and gongs.\n\n\"The gangsa and gongs were sampled and loaded into samplers,\" he said.\n\n\"The kecapi was played by Rouzy [Portier]. It's a sitar-ish instrument. Kendang is a drum from Java or Bali.\n\n\"Ceng-cengs are thick, brass cymbals you hit against each other and, together with the gongs, they were played by Gino [Groeneveld], our percussionist.\"\n\nThe result is a highly rhythmic sound, a mix of western electric guitar licks and Indonesian folk, and fun, playful grooves.\n\nTopping global chart\n\nNusantara Beat in January hit number one on the Transglobal World Music Chart, which is ranked by an international panel of music critics.\n\nIt makes its choices based on merit rather than popularity, big productions or record sales, and disbands with geographical barriers.\n\nSanger said it felt a bit \"unreal\" for a band that did not follow the charts.\n\n\"But when we actually looked at the chart and saw the other artists on it, it felt very special,\" he said.\n\n\" For us, it mostly feel like encouragement, something like, 'OK, this strange mix of Indonesian roots and psych folk actually connects with people far outside of our own bubble. \"\n\nThey have also built a following in Indonesia.\n\n\"On Instagram, about 70 per cent of our following is from Indonesia,\" Sanger said.\n\n\"We've been touring in Indonesia twice. We haven't played a show in Bali — yet, please invite us.\"\n\nSanger also met Indonesian family for the first time while touring there in 2024.\n\n\"That was mental. It felt like I'd known them for my whole life,\" he said.\n\n\"The immediate warmth is, for me, very special.\"\n\nNusantara Beat will play two sets at WOMADelaide.\n\nSanger said audiences could expect to hear \"Indonesian psych folk tunes served with good vibes and quite possibly jetlag\".",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2026-02-03/wallabies-rugby-world-cup-games-all-blacks-hong-kong-china-chile/106298576",
        "title": "Wallabies Rugby World Cup draw revealed ahead of home tournament",
        "publish_date": "Mon, 02 Feb 2026 23:35:20 +0000",
        "category": "sports",
        "authors": [],
        "text": "Australia's home Rugby World Cup campaign will kick off against debutants Hong Kong China rather than bitter rivals New Zealand, who also feature in the same pool.\n\nChile return for a second World Cup to round out Pool A at next year's hotly anticipated tournament, the first hosted in Australia since 2003.\n\nIt will be Australia's first match against the South American nation.\n\n\"It's incredibly exciting to have the schedule locked in for the Wallabies' pool fixtures, ahead of what's going to be a truly special tournament here in Australia next year,\" Rugby Australia chief executive Phil Waugh said.\n\nThe Wallabies will be rated favourites alongside the All Blacks, second on the World Rugby rankings, to finish in the top two of Pool A and advance to the knockout stage.\n\nFour of the six third-placed teams from the group stage will also progress.\n\nShould Australia place second in their pool, they will face the Pool F runners-up — one of England, Wales, Tonga and Zimbabwe — for their first knockout clash.\n\nWin their pool, and Australia would face the third-placed team from Pool C, E or F in the round of 16.\n\nPerth will host Australia's first pool match on October 1 next year, before the All Blacks clash in Sydney on October 9, then the match against Chile on October 16 in Brisbane.\n\n2027 Rugby World Cup Pools\n\nPool A: New Zealand, Australia, Chile, Hong Kong\n\nPool B: South Africa, Italy, Georgia, Romania\n\nPool C: Argentina, Fiji, Spain, Canada\n\nPool D: Ireland, Scotland, Uruguay, Portugal\n\nPool E: France, Japan, USA, Samoa\n\nPool F: England, Wales, Tonga, Zimbabwe\n\nAAP",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2026-02-03/matildas-captain-sam-kerr-is-back-for-the-womens-asian-cup/106291550",
        "title": "Sam Kerr is back for the Asian Cup after winning it as a teenager",
        "publish_date": "Mon, 02 Feb 2026 23:28:33 +0000",
        "category": "sports",
        "authors": [],
        "text": "Sam Kerr was just 16 when Australia last won soccer's Women's Asian Cup in 2010, the tournament in which she also scored her first international goal.\n\nIn the intervening 16 years, the Matildas have reached the tournament's final twice, losing both times to Japan, as well as taking part in three Olympics and four Women's World Cups.\n\nBut another major title has eluded a side that reached as high as fourth in the world.\n\n\"Sixteen years ago seems crazy. It feels like yesterday,\" Kerr told ABC Perth.\n\n\"I thought I would win many more. I think it shows how hard it is to win the Asian Cup and the importance of the tournament.\"\n\nThe Matildas had joy and relief after beating North Korea on penalties in the final of the Women's Asia Cup in Chengdu in 2010. (Getty Images: Visual China Group)\n\nKerr herself has experienced both the highs and lows professionally, signing with Chelsea in 2020 and winning five consecutive FA Women's Super League titles as well as three Women's FA Cups.\n\nBut she has also endured a torrid 20 months after suffering a knee injury and an ACL injury during a training camp in late 2023 and early 2024.\n\nAfter 637 days out of the game, Kerr returned for Chelsea last September and scored 13 minutes after coming off the bench.\n\nIt's been a steady build since then.\n\n\"I'm playing more minutes now. I feel like I'm hitting my stride,\" the 32-year-old said.\n\n\"I knew it would be a long process, and I've been back for about four or five months now, and every week, honestly, I feel better.\"\n\nSam Kerr has scored some memorable goals for the Matildas, including this stunner against England at the 2023 World Cup. (AAP Image: Dan Himbrechts)\n\nAustralia will host the Asian Cup in March, with the Matildas playing the Philippines in Perth to open the tournament, a side they thrashed 8-0 at Perth Stadium in 2023.\n\n\"We played really well last time at Perth. It was in front of a sold-out stadium, so there was a real buzz around it,\" Kerr said.\n\n\"Sixteen years ago at the last Asian Cup, I don't think there was many people around the country watching.\n\n\"But to be a part of the change of women's football in the last four to five years has been incredible.\n\nSam Kerr has scored 62 times for the Matildas, making her a favourite among fans (AAP Image/Mark Evans)\n\n\"I think this moment in time will be looked back on forever as the time that women's football changed in Australia and around the world.\"\n\nKerr's return to the Matildas came months after the appointment of Joe Montemurro as coach.\n\nThe former midfielder coached Arsenal, Juventus and Lyon's women's sides to titles, and has enjoyed a solid start with Australia winning five of the eight games he's taken charge of.\n\n\"(Montemurro) wants to play a certain style of football, which has been really clear,\" Kerr said of the national side's new manager.\n\n\"I think when you have a clear message and a clear identity as a team, it's been really easy to just [get] everyone focus on themselves, train on themselves, and make sure we're at our best physically and mentally.\n\n\"It's nice to have an Aussie in there. I think it just hits home when you've got an Aussie coach coaching you.\n\n\"He's a top coach, but he's been really good for the group off the pitch too.\"\n\nThe ABC of SPORT Sports content to make you think... or allow you not to. A newsletter delivered each Saturday.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2026-02-03/denmark-volunteers-unite-for-coastal-rehabilitation/106292930",
        "title": "Locals don't want tourists to stop visiting, but 'beg' them to look after beach",
        "publish_date": "Mon, 02 Feb 2026 22:31:12 +0000",
        "category": "finance",
        "authors": [],
        "text": "About 450 kilometres south of Perth on a remote stretch of pristine beach, 50 or so people spent their Saturday laying out weed matting and dragging around tree branches.\n\nThe volunteers, aged from eight to 88, are part of Friends of Boat Harbour, a community-led group trying to mend the damage caused by tourists who descend on their local beach each summer.\n\nSome of the volunteers were as young as eight. (Supplied: Benita Cattalini)\n\n\"It's a beautiful spot to come down to and go for a bit of a walk,\" Shire of Denmark revegetation officer Anais Schneider said.\n\n\"Some people come to fish, some people come to swim. It's a very rugged landscape and there's quite a few plants here that I have seen nowhere else in Denmark, so it's quite a unique little spot.\"\n\nDestroyed by tourism\n\nBut the beach's beauty is also its undoing, with the influx of visitors — and their four-wheel drives — causing significant damage to the dunes.\n\n\"The Great Southern [region] is iconic now [and considered] some of the best beaches in Australia. If you can drive a car you can get here,\" volunteer Liz Jack said.\n\nThe beach, accessible only by a four-wheel drive track, is a popular spot. (ABC Great Southern: Mark Bennett)\n\n\"And there isn't anybody monitoring whether you're camping out here or not because we don't have enough resources.\n\n\"We're not monitoring the impact of tourism on local communities sufficiently from an environmental perspective and a community-impact perspective.\n\n\" It's all about money, it's all about markets, it's all about economic input into the state, [which are] important — don't get me wrong — but this is the cost. \"\n\nVolunteer Benita Cattalini said the issue was largely a product of ignorance, with drivers unaware that when they left the designated track, they could be causing irreparable damage.\n\n\"It's the keen drivers of four-wheel drives and motorbikes that like to come out, which is great, but … we beg of them, please don't drive on the sand dunes,\" she said.\n\nVolunteers roll out weed mats. (Supplied: Benita Cattalini)\n\nMs Cattalini said the materials alone for that stage of the revegetation had cost more than $20,000, and that was not counting the habitat loss.\n\n\"Just over there to my left, there's plants that take 100 years to cover those rocks, and if people drive over the top of them, they don't recover,\" she said.\n\nVolunteers fighting back\n\nThe Friends of Boat Harbour volunteers were able to complete stage one of the rehabilitation project.\n\nTheir efforts have paved the way for the planting of about 2,500 native plants, currently held in the Shire of Denmark's nursery, once the wet weather arrives in autumn.\n\nVolunteers use native brush cuttings gathered from nearby bush to help stabilise the sand. (Supplied: Benita Cattalini)\n\n\"I've also taken about 1,000 cuttings, so we're trying to use endemic plants [from the area] that have the best chance of success because they're used to the harsh conditions,\" Ms Schneider said.\n\n\" We'll hopefully — over the next couple of years — see this area [get] back to how it's supposed to look. \"\n\nThe project, supported by CoastWA grants and the Shire of Denmark, forms part of the shire's coastal management plan for areas with a high risk of erosion.\n\nThe shire is also trialling a closure of the headland.\n\nVolunteers say education is the key to changing behaviour. (ABC Great Southern: Mark Bennett)\n\nShire of Denmark director of infrastructure and assets, Rob Westerberg, said it was a pristine piece of land.\n\n\"Our environmental groups are very passionate — and so is the Shire of Denmark — in trying to maintain it for future generations,\" he said.\n\nDespite their fears for the landscape, the locals remained welcoming.\n\n\"We're not trying to stop people coming here, we just want to look after it so it's here forever,\" Ms Cattalini said.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2026-02-03/elective-surgeries-cancelled-as-health-workers-strike-continue/106294564",
        "title": "Victorian woman 'heartbroken' after fertility surgery delayed again",
        "publish_date": "Mon, 02 Feb 2026 21:52:00 +0000",
        "category": "finance",
        "authors": [],
        "text": "Alli, who requested her surname be withheld for privacy reasons, wants to have a baby but is facing months of \"heartbreaking\" surgery delays while waiting for treatment of suspected endometriosis.\n\nFacing extreme pain, the Victorian woman in her 30s was told by the Ballarat Base Hospital that it was unable to set a date for her laparoscopy due to ongoing strikes across the state.\n\nBut for Alli, time is precious.\n\nShe opted to go through a private surgeon to help speed up the process, but it has made no difference.\n\n\"They [Ballarat Base] said since December they've had these strikes, and they're only assessing category 1 patients,\" she said.\n\n\" So I don't make the cut, and they have absolutely no idea when they'll be back up and running. \"\n\nAlli said she was frustrated and frightened.\n\n\"I don't know what state my reproductive organs are in, so I'm too scared to try [to get pregnant],\" she said.\n\n\"I'm also too scared to come off birth control now because that's the only little bit of pain relief that I get.\"\n\nIn a statement, Grampians Health said it was \"working hard to ensure elective surgeries can continue while respecting the rights of our colleagues who are taking protected industrial action\".\n\n\"We acknowledge the ongoing EBA negotiations and the Fair Work process, and we value the important contribution of our staff,\" a spokesperson said.\n\nMore than 10,000 health workers have taken part in strike action. (ABC News: Rochelle Kirkham)\n\nThe Health Workers Union Victoria said more than 10,000 workers have taken part in strike action at 82 services across the state, over a pay dispute that has dragged on for more than 14 months.\n\nLead organiser Jake McGuinness said this pay dispute relates to everybody in the hospital system, apart from the doctors, nurses and paramedics.\n\n\"Our theatre and instrument technicians, our orderlies, our allied health assistants and our essential support services … and our admin teams,\" he said.\n\nMr McGuinness said after two strikes and significant work bans since December, a deal had still not been made with the state government.\n\n\"Over the last week and a half, I've had what I thought were positive discussions with the government,\" Mr McGuiness said.\n\n\"We had come to a sort of verbal, informal agreement that it would be a two-year deal, 5 per cent increases in each of those years; there was still a discussion point around back pay.\n\n\" Despite our week of conversations, the offer they put [down] didn't resemble the deal that we had reached … they stretched the deal to three years. \"\n\nMr McGuiness said after months of pain for patients and healthcare workers, the state government was yet to make an offer that at least met inflation.\n\n'A slap in the face'\n\n\"We gave them a deadline for the month of February; we didn't want to extend,\" Mr McGuinness said.\n\nJake McGuinness says strike action will continue for the month of February. (Supplied: Jake McGuinness)\n\n\" But after this insulting offer and a slap in the face, we've been given no choice but to extend our work bans through the month of February. \"\n\nIn Victoria, category 2 and 3 surgeries are considered elective — that is, semi-urgent treatment that \"should\" be done within 90 days.\n\nIt can include heart valve replacements, orthopaedic procedures and fractures.\n\nThese elective surgeries will be paused at a number of hospitals during the strikes.\n\nAlli said the categorisation system for surgeries needed to be reassessed.\n\n\"For me, this is pretty important because we don't know how severe it is until we're in there [surgery],\" she said.\n\n\" What if this longer wait is restricting my chances of being able to have children in the future? \"\n\nA Victorian government spokesperson said it would always back its \"dedicated healthcare workforce and the extraordinary care they provide to Victorians who need it most\".\n\n\"The Victorian Hospitals Industrial Association continues to negotiate with the Health Workers Union with assistance from the Fair Work Commission,\" the spokesperson said.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2026-02-03/belinda-bencic-elina-svitolina-wta-top-10-ranking-mothers/106298230",
        "title": "Two mothers sit inside tennis's top 10 rankings for the first time",
        "publish_date": "Mon, 02 Feb 2026 21:47:35 +0000",
        "category": "sports",
        "authors": [],
        "text": "Two mothers are simultaneously inside the women's tennis top 10 rankings for the first time, as the governing body hails the success of initiatives to keep top players in the sport.\n\nThe latest rankings from the Women's Tennis Association (WTA) have Switzerland's Belinda Bencic ranked ninth and Ukrainian Elina Svitolina 10th, the first time two mothers have been in the top 10 at the same time.\n\nBencic, who has been ranked as high as world number four, returned to the top 10 in mid-January for the first time after the birth of her daughter in 2023.\n\nThe Swiss star has now been joined by Svitolina, who returns to the top 10 on the back of a semifinal run at last month's Australian Open in Melbourne.\n\nThe historic first is being touted as a success by the WTA, which has made efforts in recent years to help players maintain their professional careers and become parents.\n\nBelinda Bencic returned to the world's top 10 in mid-January for the first time since giving birth to her daughter in 2023. (Reuters: Imagn Images/Mike Frey)\n\nLast year, the WTA announced a maternity fund, while both Bencic and Svitolina have been aided by the WTA's Special Ranking Rule for returning mothers, the governing body said.\n\n\"Two mothers ranked inside the WTA Top 10 for the first time is an incredible moment for tennis and for women's sport,\" WTA chief executive Portia Archer said.\n\n\"Not only does this highlight the exceptional achievements of Belinda and Elina, it reaffirms the WTA's commitment to creating an environment where mothers can continue to compete and succeed, at the very highest level of sport — or any profession.\"\n\nBencic was the 10th seed at last month's Australian Open, but suffered an upset loss in the second round to Czech outsider Nikola Bartůňková.\n\nRybakina proves she is no one-hit wonder with AO title A consistent and composed Elena Rybakina claims her maiden Australian Open title by beating world number one Aryna Sabalenka in a thriller three years after her breakout Wimbledon win.\n\nDespite that disappointment, Bencic actually rose one spot in the latest rankings.\n\n\"Coming back to the WTA Top 10 one year after returning to competition after maternity leave is something I am incredibly proud of,\" the Swiss said.\n\n\"Very few people know or have experienced how difficult that journey is, but my family, my team and I have put all of our energy, work and dedication into it to accomplish this goal.\"\n\nSvitolina's return to the top 10 comes off the back of a magnificent performance at Melbourne Park, reaching the semifinal of the grand slam event.\n\nThe Ukrainian beat fellow top 10 players Coco Gauff and Mirra Andreeva in the tournament.\n\n\"It's a dream to return to the WTA Top 10 and doing it as a mother means so much to me,\" the world number 10 said.\n\n\"I'm proud of my fight and resilience and I can't thank the fans enough for their incredible support.\"\n\nMeanwhile, Australian Maya Joint has entered the WTA's top 30 for the first time in her career.\n\nDespite falling in the first round of her home slam to Czech player Tereza Valentová at Melbourne Park, the 19-year-old has moved up to a career-high number 29 in the latest ranking release.\n\nElena Rybakina has risen to number three in the world, up two places, after defeating world number one Aryna Sabalenka to claim the Australian Open title.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2026-02-03/james-valentine-tribute-long-time-abc-radio-cancer-retirement/106296950",
        "title": "How James Valentine's creative radio style could 'lift the mood of a city'",
        "publish_date": "Mon, 02 Feb 2026 21:45:07 +0000",
        "category": "finance",
        "authors": [],
        "text": "Listeners and former colleagues of retiring ABC Radio Sydney presenter James Valentine are paying tribute to his humour, creativity and warmth on air.\n\nThey were shocked and saddened by the veteran broadcaster's announcement yesterday that he was retiring due to cancer.\n\nValentine has hosted Afternoons for more than 20 years, but has been off the air since June after he was diagnosed with omentum cancer affecting a layer of tissue over the stomach and intestines.\n\nLoading...\n\nYesterday, he said he had made the sad decision to let someone else \"have a go at this marvellous shift\".\n\n\"I need to focus on getting better, on being with family and friends and making sure that I'm giving my health my best shot,\" he told listeners.\n\nFormer ABC Radio Sydney Drive presenter Richard Glover said Valentine made people feel proud to be a Sydneysider.\n\n\"I can't think of anybody else who really lifted the mood of a city over such a long time as James did,\" Glover said.\n\n\"It was a daily effort to get people to concentrate on life, ordinary life, and how important and beautiful it is, and he did that every day for 20 years.\"\n\nValentine often challenged his audience to get creative by writing poems, plays or even to come up with satirical proposals for new Sydney infrastructure.\n\nRichard Glover and James Valentine became close friends during their more than 20 years at ABC Radio Sydney. (ABC Radio Sydney: Declan Bowring)\n\n\"So you end up sitting, listening to radio, thinking, 'Gee, Sydneysiders are funny and lively and witty and gorgeous,'\" Glover said.\n\n\"He brought that out in people.\"\n\nValentine conducted his audience like a 'wonderful orchestra'\n\nFor more than 20 years, the two broadcasters would chat for 10 minutes on air as Valentine wrapped up his Afternoons program and handed over the mic.\n\n\"He was incredibly creative … I had complete confidence that I could start off in the oddest of places, and he'd find us somewhere amusing to go,\" Glover said.\n\nWhile many treat talkback radio as an opportunity for listeners to give their opinion on politics, Valentine had a different approach, focusing on social quirks or letting his audience air their petty grievances.\n\n\"I think James understood that it could be something a lot more nourishing and certainly a lot more entertaining if you actually asked about their lives,\" Glover said.\n\nA talented saxophonist, Valentine's musical training bled into his broadcasting style.\n\n\"He ended up really training his audience to be the most wonderful orchestra, and he was the conductor.\"\n\nJames Valentine was a master of talkback radio, encouraging listeners to tell stories and get creative. (ABC Radio Sydney: Declan Bowring)\n\nFormer ABC Radio Sydney manager Peter Wall, who hired Valentine in the early 1990s, said he could tell he was a natural in the studio from his first shift.\n\n\"When you listen to the first hour, you punch the air and you know that you're happy with what you got — that's what I did with him,\" he said.\n\nWhat separated Valentine from his peers was the \"looseness\" he projected on the airwaves.\n\n\"Some of those people just have this thing which breaks through. They manage to stay themselves, notwithstanding the pressures on them … he was one of those special people on radio.\"\n\nABC managing director Hugh Marks described Valentine as \"one of the great creative forces in Australian broadcasting\".\n\n\"He has an extraordinary gift for turning everyday moments into joyful, smart and surprising radio, and the connection he has built with his audience over decades simply cannot be overstated,\" he said.\n\n\"We're proud to celebrate everything he has brought to the ABC, and we wish him strength and support as he focuses on his health.\"\n\nListeners will have a chance to enjoy Valentine's most memorable moments with a special retrospective that will air on Friday, showcasing the best of Valentine's past programs.\n\nCallers thank Valentine for bringing joy to dull days\n\nHundreds of listeners flooded the text line, thanking Valentine for his work over the years and wishing him well as he dealt with cancer.\n\nIn March 2024, Valentine announced his initial diagnosis of oesophageal cancer and took a leave of absence to receive treatment.\n\nValentine returned to the program later that year, hosting Afternoons until June 2025, when the new tumours were discovered.\n\nJames Valentine, who is a talented jazz musician, is also stepping away from his ABC Jazz program Upbeat. (Supplied: James Valentine)\n\nLong-time listener Jacqueline said she was gutted Valentine was not returning.\n\n\"James Valentine turned me into a serial pest. I just couldn't resist his segments. He's kept me company through parental leave, through boring days during lockdown when I was living alone. I'm so sorry to hear he's not coming back. He's brought so much joy to all of us.\"\n\nListeners praised his welcoming, warm and kind style.\n\n\"No affectation, no feigned tolerance, it was legit,\" Sarah said.\n\nMany were fans of Valentine's This is What I Live With talkback segment, which allowed people to vent about their partner's foibles.\n\nTony described him as a free marriage counsellor while Louise credited the segment with helping keep couples together.\n\n\"I think it's probably helped normalise some of the madness of our pairings … sometimes it's those little quirky things that really irritate people more than important things,\" he said.\n\nValentine could also handle serious events, with Jill praising his coverage of the shootings at a Christchurch mosque in 2019.\n\n\"He was rightly shocked and horrified, but equally full of compassion and full of empathy. It was just a time where I felt we really need that, and I really will miss him in the afternoon,\" she said.\n\nJames O'Loghlin is filling in as host of Afternoons, but a permanent replacement has yet to be announced.",
        "source": "ABC"
    },
    {
        "url": "https://www.smh.com.au/sport/rugby-union/how-queenslanders-can-experience-once-in-a-generation-opportunity-20260203-p5nz4t.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "How Queenslanders can experience ‘once-in-a-generation opportunity’",
        "publish_date": "Tue, 03 Feb 2026 13:24:13 +1100",
        "category": "sports",
        "authors": [
            "Nick Wright"
        ],
        "text": "Wallabies halfback Tate McDermott says incoming national coach Les Kiss has enough time to transform Australia into a Rugby World Cup contender, as the schedule for the 2027 showcase on home soil has been revealed.\n\nQueensland has been locked in for 14 fixtures across the six-week tournament – 10 in Brisbane and four in Townsville.\n\nThe Wallabies failed to make it out of the group stages for the first time in their history at the last World Cup, leading to Eddie Jones’ departure as head coach.\n\nTate McDermott’s hamstring injury is expected to force him to miss a large chunk of the Queensland Reds’ preseason. Credit: Getty Images\n\nMcDermott, who featured in that squad, admitted there was a lingering thought of retribution fuelling their runway until their tournament launches in Perth on October 1, 2027, against Hong Kong.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/queensland/missing-link-in-riverside-path-reopens-after-three-years-20260203-p5nz3k.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Missing link in riverside path reopens after three years",
        "publish_date": "Tue, 03 Feb 2026 13:07:14 +1100",
        "category": "finance",
        "authors": [
            "Brittney Deguara"
        ],
        "text": "Advertisement\n\nNationalQueenslandCity life Missing link in riverside path reopens after three years Brittney Deguara February 3, 2026 — 1:07pm Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share A A A\n\nA key section of Brisbane’s Riverwalk has reopened, marking a milestone for the city and the revitalisation of the flood-prone CBD stretch. With the backdrop of the Story Bridge, the ribbon was cut on Tuesday by Lord Mayor Adrian Schrinner and representatives of Dexus to officially open the Riverwalk following a three-year, $42 million transformation. The 256-metre stretch from Charlotte Street to Alice Street creates a continuous walking and cycling route from the Story Bridge at Howard Smith Wharves to the Botanic Gardens. Lord Mayor Adrian Schrinner was among the group officially reopening the Riverwalk on Tuesday. Brittney Deguara “You couldn’t imagine Brisbane without the Riverwalk, just like you couldn’t imagine Brisbane without the CityCats and the Story Bridge,” Schrinner said.\n\nAdvertisement\n\nHe said the council contributed $22 million to the project to upgrade it from a narrow section of path to the wide, flood-resilient promenade, but the “lion’s share” came from Dexus. “This is the section that I have no doubt tourists in 2032 will be flocking to as this whole precinct is activated. This is about making sure that Brisbane embraces its river,” Schrinner said. He said ratepayers were getting “bang for their buck” through the funding partnership with Dexus, and that paying for the project in full would have cost the council tens of millions of dollars. The section has been fenced off since 2023, while work was done at the multibillion-dollar Waterfront Brisbane site, which will boast retail tenancies.\n\nAdvertisement\n\nThe entire project was scheduled to open in 2027, but was delayed last year owing to construction complexities and bad weather. “For [Dexus] to keep ploughing ahead and delivering this great outcome against the odds is a fantastic outcome,” Schrinner said. Schrinner walking the new path with Dexus chief executive Ross Du Vernet and project director for Waterfront Brisbane Matthew Beasley. Brittney Deguara “I’m more interested in what it does for the community rather than whether there [were] a few delays suffered. “For generations to come, people will forget about the extra few months it took, and they’ll remember the great outcome that’s been delivered.”\n\nAdvertisement\n\nLocals Wayne and Cathy Jeffries were among the first pedestrians to walk along the new path. “I think after the floods they had to do something to bring it back, and looking forward, we’ve got the Olympic Games coming up, so you’ve got to make it look impressive for all the overseas guests,” Wayne said. Wayne and Cathy Jeffries said they would use the walkway every couple of months when they ventured into the city. Brittney Deguara “It’s great to see Brisbane progress and the new Kangaroo Point Bridge as well, and lovely new restaurants around the city, Queen’s Wharf ... it is the place to be,” Cathy added. The passage has been rebuilt with new paths and banisters, and three local street artists painted a Brisbane-themed mural at the start of the walkway in three days.\n\nAdvertisement\n\n“It’s a great aquatic theme, which is appropriate for a river city and a city based on Moreton Bay,” Schrinner said. Waterfront Brisbane will eventually comprise two new office towers, shops, restaurants and public space. The aquatic-themed mural at Brisbane’s Riverwalk took just three days to complete. Brittney Deguara It is expected to be ready in late 2028, with construction costs totalling an estimated $2.5 billion. With William Davis Start the day with a summary of the day’s most important and interesting stories, analysis and insights. Sign up for our Morning Edition newsletter.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/business/markets/asx-set-to-jump-on-rba-day-as-wall-street-rebounds-gold-silver-swing-oil-dives-20260203-p5nz0b.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "ASX jumps ahead of RBA rates call; Musk merges xAI, SpaceX to create $1.8 trillion giant",
        "publish_date": "Tue, 03 Feb 2026 12:51:10 +1100",
        "category": "finance",
        "authors": [
            "Staff Reporter"
        ],
        "text": "Advertisement\n\nUpdated BusinessMarketsWorld markets ASX jumps ahead of RBA rates call; Musk merges xAI, SpaceX to create $1.8 trillion giant Staff reporter Updated February 3, 2026 — 12:51pm ,first published February 3, 2026 — 5:16am Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share A A A\n\nThe Australian sharemarket has surged higher with mining stocks recovering some of Monday’s losses in early trade, while investors are eagerly awaiting the RBA’s decision on interest rates this afternoon. The S&P/ASX 200 was up 102.8 points, or 1.2 per cent, at 8881.4 at 10.37am AEDT, with 10 of 11 industry sectors in positive territory. Only energy stocks are in the red after oil prices slumped overnight. Wall Street ended its three-day losing streak. Bloomberg The Reserve Bank announces its interest rate decision at 2.30pm AEDT today, with markets predicting rise of 0.25 percentage point in the cash rate, which would be the first hike in more than two years. The Australian dollar was trading at US69.69¢ at 12.30pm AEDT. Mining stocks bounced higher, with gold miners Northern Star (up 3.6 per cent) and Evolution Mining (up 5.2 per cent) clawing back some of Monday’s heavy losses as gold and silver prices were again in focus overnight. Gold prices rose 1.8 per cent while silver prices climbed 5.9 per cent. BHP jumped 2 per cent while Rio Tinto surged 2.6 per cent and Fortescue climbed 0.8 per cent. South32 rose 2.3 per cent.\n\nAdvertisement\n\nRelated Article Opinion\n\nScandal Why this charismatic corporate salesman’s reign came to an end Elizabeth Knight Business columnist Financial stocks shed some early gains but remain solidly in the green, with Commonwealth Bank rising 0.6 per cent, Westpac up 0.9 per cent, National Australia Bank climbing 0.7 per cent and ANZ Bank advancing 0.6 per cent in early trade. Macquarie Group rose 2.2 per cent. Energy stocks are mixed as oil prices steadied this morning after dropping more than 4 per cent overnight after US President Donald Trump told reporters that Iran is “seriously talking to us.” It’s a potential signal of improving relations between the two countries, which could keep oil flowing easily around the world. Woodside Energy edged up 0.2 per cent, Santos lost 0.3 per cent and Yancoal rose 0.5 per cent. In other news, Elon Musk’s SpaceX has acquired xAI, in a deal that encompasses the billionaire’s increasingly costly ambitions to dominate artificial intelligence and space exploration. The transaction was announced in a statement on SpaceX’s website signed by Musk and confirming an earlier Bloomberg News report. The deal, which gives the combined company a valuation of $US1.25 trillion ($1.8 trillion), was announced to employees in a memo on Monday, Bloomberg News reported earlier.\n\nAdvertisement\n\nOvernight on Wall Street, the S&P 500 added 0.5 per cent and snapped a three-day losing streak. The Dow Jones rose 515 points, or 1.1 per cent, and the Nasdaq composite gained 0.6 per cent. Related Article Opinion\n\nFederal Reserve Trump’s hand-picked man may not do his bidding Stephen Bartholomeusz Senior business columnist Elsewhere, the US and India reached a trade agreement cutting tariffs on Indian goods, Donald Trump announced, deescalating tensions between the two countries. Trump said Monday that he would lower his 25 per cent tariff on Indian goods to 18 per cent after Prime Minister Narendra Modi agreed during a phone call to stop buying Russian oil. On Wall Street, Sandisk leaped 15.4 per cent to lead the S&P 500. The data-storage company added to its 6.9 per cent gain from Friday, after it reported stronger profit for the latest quarter than analysts expected. It credited demand created by the artificial-intelligence boom, among other things. That helped offset a 2.9 per cent drop for Nvidia, whose chips are powering much of the world’s move into AI technology.\n\nAdvertisement\n\nWith AP The Market Recap newsletter is a wrap of the day’s trading. Get it each weekday afternoon.\n\nSave You have reached your maximum number of saved items. Remove items from your saved list to add more. Share More: World markets\n\nWall Street\n\nShares",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/how-much-does-it-cost-to-travel-australia-full-time-in-a-caravan-20260203-p5nz66.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "How much does it cost to travel Australia full-time in a caravan?",
        "publish_date": "Tue, 03 Feb 2026 12:49:23 +1100",
        "category": "finance",
        "authors": [],
        "text": "How much does it cost to travel Australia full-time in a caravan?\n\nAustralian couple Jess and Allan reveal how much it really costs to travel around the country in a caravan after several years on the road.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/world/painting-on-wall-of-chapel-that-resembles-premier-giorgia-meloni-creates-uproar-in-rome-20260203-p5nz5f.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Painting on wall of chapel that resembles premier Giorgia Meloni creates uproar in Rome",
        "publish_date": "Tue, 03 Feb 2026 12:49:06 +1100",
        "category": "finance",
        "authors": [],
        "text": "Remove items from your saved list to add more.\n\nYou have reached your maximum number of saved items.\n\nSave this video for later\n\nAdd videos to your saved list and come back to them anytime.\n\nGot it",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/traveller/inspiration/the-best-places-to-stay-in-cairns-20230619-p5dhlq.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "The best places to stay in Cairns",
        "publish_date": "Tue, 03 Feb 2026 12:42:19 +1100",
        "category": "finance",
        "authors": [
            "Angela Saurine"
        ],
        "text": "Advertisement\n\nInspirationCairns The best places to stay in Cairns Angela Saurine Updated February 3, 2026 — 12:42pm ,first published July 12, 2023 — 11:21am Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share A A A\n\nThis article is part of Traveller’s Destination Guide to Cairns. See all stories .\n\nA $600 million investment has transformed this Far North Queensland gateway to the Great Barrier Reef. Long known as a backpacker town, Cairns’ cool factor has skyrocketed in recent years. A $600 million investment by Syrian billionaire Ghassan Aboud, who’s opened three slick and sustainable Crystalbrook Collection hotels in the city since 2018, gave the city a much-needed boost, with many other revamps and refurbishments following in their wake. CAIRNS Novotel Cairns Oasis Resort Get into the holiday groove at Novotel Cairns Oasis Resort.\n\nAdvertisement\n\nPerfect for: Families with young kids, leisure seekers, business travellers Sign up for the Traveller Deals newsletter Get exclusive travel deals delivered straight to your inbox. Sign up now. With the only swim-up pool bar in Cairns and a large, lagoon-style pool with a sandy beach, it’s easy to slip into the holiday groove at this refurbished resort. Kids quickly make friends playing with the supplied beach toys, while parents lie back in a cabana or on a day bed sipping mojitos and margaritas. The resort underwent a multi-million-dollar transformation in 2019, refreshing its 314 rooms and suites, plus Moku Bar and Grill restaurant and Moku Beach Club. From $220 a night. 122 Lake St, Cairns. Phone: (07) 4080 1888. See novotelcairnsresort.com.au Crystalbrook Riley Riley’s 1000-square-metre lagoon pool.\n\nAdvertisement\n\nPerfect for: Instagrammers, eco-conscious travellers, families The first of three cool and sustainably focused Crystalbrook Collection hotels to open in Cairns – followed by the arty Bailey and fun and centrally located Flynn – this luxury hotel’s 12-storey tower is instantly recognisable on the city skyline. Its 1000-square-metre pool with a man-made beach makes it a great option for families. Dine on the Esplanade at its Asian fusion restaurant, Paper Crane; soak up the vibe at tropical rum bar and seafood kitchen Calypso Club, and take in the sensational views from one of the city’s highest rooftop bars, Rocco. From $349 a night. 131/141 Esplanade, Cairns. Phone: (07) 4252 7777. See crystalbrookcollection.com/riley Mercure Cairns This budget-friendly resort is made for the tropics.\n\nAdvertisement\n\nPerfect for: Budget-conscious travellers who like a splash of style This stylish four-star hotel is within cooee of several key attractions, including Cairns Aquarium and Cairns Performing Arts Centre, just a couple of blocks back from the Esplanade. The one-time Hotel Ibis Styles reopened in early 2022 after a stylish makeover, with its Queenslander-style architecture and cane furniture with palm-print cushions in the lobby quickly evoking a feeling of being in the tropics. The 75-room hotel’s tiered pool and tiled deck, complete with round wicker day-beds, is an inviting place to rejuvenate after a day’s sightseeing. From $179 a night. 15 Florence St, Cairns. Phone: (07) 4051 5733. See all.accor.com Shangri-La The Marina, Cairns As close as it gets … Shangri-La, The Marina overlooks Marlin Marina.\n\nAdvertisement\n\nPerfect for: Families and couples heading to the reef, solo travellers, business travellers As the closest accommodation you can get to Marlin Marina – where boats depart for the Great Barrier Reef – you can confidently hit the snooze button at least once before a must-do day trip when staying at this hotel. Many of its 255 rooms and suites offer views over the marina or Trinity Inlet, as does its produce-focused restaurant, The Backyard. There’s also a pool with a sun deck and a bar serving meals in biodegradable and recyclable cardboard packaging. From $250. Pier Point Rd, Cairns. Phone: (07) 4052 7500. See shangri-la.com Cairns Harbourside Hotel Great value on the Esplanade … The Cairns Harbourside Hotel.\n\nAdvertisement\n\nPerfect for: Families on a budget, business travellers When it comes to affordability and location, this hotel on Cairns Esplanade is hard to beat. The former Holiday Inn is just five minutes’ drive from the airport, and about 25 minutes’ walk along the boardwalk into the centre of town – or you can jump on the free shuttle bus. Each of its 173 rooms and suites has a balcony, and there’s a pool and a fresh, flower-filled restaurant, Harbourside Bar & Kitchen. And as a bonus for families, kids 12 and under stay and eat for free. From $180 a night. 209-217 Esplanade, Cairns. Phone: (07) 4080 3000. See cairnsharboursidehotel.com.au Little Drifter Cairns A bunk room at Little Drifter Cairns.\n\nAdvertisement\n\nPerfect for: Budget-conscious travellers After a multimillion-dollar revamp in early 2025, Little Drifter brings a smart and affordable stay close to the action. Previously known as The Village Cairns, the 54-room property, offers a mix of smart dorm-style digs and stylish private rooms. Interiors lean playful and punchy, with communal spaces designed for connection and relaxation. There’s a fully equipped kitchen, a cosy TV lounge, laundry facilities and free Wi-Fi add to its appeal. From $60 a night for a shared bunk suite and $150 per night for a private queen room. 1/7 Shields St, Cairns. Phone: 1800 180 288. See thedrifter.com/cairns Alivio Hotel Cairns The revamped pool deck area at Alivio Hotel Cairns.\n\nAdvertisement\n\nPerfect for: Style-seekers wanting fresh, eco-friendly luxury Cairns’ long-standing Sunshine Tower Hotel has been reborn as the Alivio Hotel Cairns following a top-to-toe refurbishment by the award-winning Alivio Group. The 61-room property on Sheridan Street now sports a fresh, contemporary look, complete with a Mediterranean-inspired pool surrounded by flowering frangipanis. The lobby and dining area showcase photographic feature walls that capture the spirit of Tropical North Queensland. Rooms offer views across the hinterland or the manicured gardens, with new glass balustrades adding a modern edge to private balconies. The Lobby Bar and Kitchen serves up light fare and cocktails in a relaxed setting. Sustainability has also had a moment, with the installation of a 100kW solar system. From $199. 136 Sheridan St, Cairns. Phone: (07) 4041 1133. See aliviohotelcairns.com.au BIG4 Ingenia Holidays Cairns Coconut Resort BIG4 Ingenia Holidays Cairns Coconut Resort’s playground and water park.\n\nAdvertisement\n\nPerfect for: Fun-loving families\n\nThe kids will love racing each other down dual waterslides into the pool, frolicking in the splash park and riding pedal carts around this epic holiday park, around seven minutes’ drive from Cairns. The pet-friendly holiday park offers accommodation for every budget, including villas, cabins, condos and caravan and camping sites. With resort-style pools, a playground, jumping pillows, mini golf, basketball court, tennis court and activities like outdoor movies, you’ll have to drag the offspring away to see the Great Barrier Reef. From $149 a night. 23-51 Anderson Rd, Woree. Phone (07): 4054 6644. See ingeniaholidays.com.au PORT DOUGLAS Silky Oaks Lodge One of the bedrooms at Silky Oaks Lodge. Tourism and Events Queensland\n\nAdvertisement\n\nPerfect for: A romantic getaway or special celebration Imagine swaying in a hammock on the deck of your private villa listening to the sounds of the Daintree Rainforest. Or soaking in your outdoor bath as you gaze out at the treetops. Or watching the trickling waters of the Mossman River from the open-air pavilion Jungle Perch as you enjoy a sunset drink before dining in the Treehouse Restaurant. These are the kind of experiences you can expect at this uber-luxury retreat at Mossman, north of Port Douglas. From $1200 a night. 423 Finlayvale Rd, Mossman. Phone: (07) 4098 1666. See silkyoakslodge.com.au Sheraton Grand Mirage Resort Port Douglas Two hectares of saltwater lagoon pools ... Sheraton Grand Mirage Resort in Port Douglas.\n\nAdvertisement\n\nPerfect for: Influencers out to impress on the ‘gram, families, couples Offering luxe experiences like the chance to step straight out of the pool onto the balcony of your room, a stay at this beachfront resort can feel more like being in Bali or the Maldives than Australia. Set among tropical gardens with its own golf course, the 295-room resort has a swim-up bar, a restaurant where you can watch your dinner being prepared in the open kitchen and a multi-award-winning Harrisons Restaurant. From $385 a night. 168-190 Port Douglas Rd, Port Douglas. Phone: (07) 4099 5888. See marriott.com Thala Beach Nature Reserve Eco accommodation among the trees at Thala Beach Nature Reserve.\n\nAdvertisement\n\nPerfect for: Nature-loving couples, special-occasion trips Embrace your inner naturalist with a stay among the treetops at this eco-retreat, about an hour’s drive north of Cairns and 15 minutes’ south of Port Douglas. Set on a former sugar cane farm with its own private beach and two free-form pools with rock waterfalls and grottos, it offers bungalow accommodation, with an open-air pavilion-style restaurant. Busy yourself with butterfly and nature walks and stargazing tours, or just lie in a hammock under a palm tree. From $562 a night. 5078 Captain Cook Hwy, Oak Beach, Port Douglas. Phone: (07) 4098 5700. See thalabeach.com.au PALM COVE The Reef House Adults Retreat Palm Cove\n\nAdvertisement\n\nRelax in the Tranquillity pool, serviced by a pool butler. Perfect for: Girls’ getaways, couples, wellness seekers, foodies Once the private residence of former federal minister Brigadier David Thomson, who hosted high-profile guests such as prime minister Gough Whitlam, this colonial-style, adults-only hotel is in the laid-back enclave of Palm Cove, around 30 minutes’ drive north of Cairns. Start the day with beachfront yoga, book a spa treatment, do a cocktail-making or wine-appreciation class, or just chill out by the Mineral or Tranquillity pools, where a pool butler delivers cold towels and sorbet. From $1029 for two. 99 Williams Esplanade, Palm Cove. Phone: (07) 4080 2600. See reefhouse.com.au Pullman Palm Cove Sea Temple Resort and Spa\n\nAdvertisement\n\nThe expansive lagoon pool at the Pullman Palm Cove Sea Temple Resort and Spa. Perfect for: Couples, families, spa lovers Set around an expansive pool with an even more inviting bar at the southern end of Palm Cove, this stylish resort makes an idyllic base for a tropical escape. Families love the modern, spacious apartments, while couples unwind with indulgent treatments at Vie Spa, romantic beach strolls and fire-lit dinners at poolside eatery Temple of Tastes, where Asian-inspired dishes are expertly crafted with fresh local produce. From $299 a night. 5 Triton St, Palm Cove. Phone: (07) 4059 9600. See pullmanpalmcove.com.au ISLANDS\n\nAdvertisement\n\nFitzroy Island Resort This affordable island resort is just a 45-minute boat ride from Cairns. Perfect for: Conservation-minded holidaymakers, budget-conscious families, groups of friends Pssst … want to know a secret? There’s an affordable resort on a tropical island just a 45-minute boat ride from Cairns with one of the most beautiful patches of sand you are ever likely to come across, Nudey Beach (not to be taken literally). The island is also home to a turtle rehabilitation centre, and guests can book citizen science tours with marine biologists and see coral nurseries being grown to help restore the Great Barrier Reef just offshore. From $185 a night. Fitzroy Island, Queensland. Phone: (07) 4044 6700. See fitzroyisland.com\n\nAdvertisement\n\nBedarra Island Resort One of the Pavilion villas with private plunge pool at Bedarra Island Resort. Perfect for: Honeymooners, privacy-seeking couples, luxury lovers Secluded, serene and strictly adults-only, Bedarra Island Resort is the epitome of barefoot luxury. The only resort on the island, just off the coast of Mission Beach, the boutique, all-inclusive property has just 12 private villas built around natural boulders overlooking the Coral Sea. Spend your days snorkelling in the stinger-free waters, paddling to private beaches and enjoying intimate dinners on private decks. But while it’s super exclusive, it’s also highly social, with guests gathering around a circular table at the bar for pre-dinner drinks each night. From $1690 a night. Bedarra Island. Phone: (07) 4068 8233. See bedarra.com.au\n\nAdvertisement\n\nLizard Island Resort All-inclusive luxury … Lizard Island Resort. Perfect for: Honeymooners, cashed-up nature lovers, baby boomers spending the kids’ inheritance This exclusive resort on Lizard Island at the northern end of the Great Barrier Reef is the stuff dreams are made of. It has 40 suites and villas – some with their own plunge pool – and a fine-dining waterfront restaurant. Order a hamper, borrow a dinghy and motor to a private beach for a picnic lunch, climb to Cook’s Lookout to take in the panoramic views, and check out the Australian Museum Lizard Island Research Station. From $2516 for two per night. Lizard Island, Queensland. Phone: 1800 867 169. See lizardisland.com.au\n\nAdvertisement\n\nThe Elandra Mission Beach The clifftop pool at The Elandra. Related Article Cairns The best places to stay in Cairns Perfect for: Boutique lovers, couples, destination wedding guests, privacy seekers Set high above the Coral Sea on a rainforest-cloaked hill, The Elandra on South Mission Beach is a dreamy tropical hideaway just a short drive from the hideaway of Mission Beach, about two hours’ drive south of Cairns. Once a glamorous celebrity haunt that fell into disrepair, the resort has been lovingly revived by the owners of Bedarra Island Resort. It now offers just a handful of beautifully refurbished, whitewashed suites. Days begin with yoga and end by the dazzling infinity pool, cocktail in hand. It’s intimate, exclusive and effortlessly chic – perfect for romantic getaways or show-stopping destination weddings. From $590 a night. 23 Explorers Dr, South Mission Beach. Phone: (07) 4054 9300. See elandraresorts.com\n\nTraveller Guides",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/goodfood/melbourne-eating-out/niagra-lane-cafe-tori-s-opens-a-second-cbd-location-with-a-new-exclusive-cloud-matcha-20260203-p5nz59.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Niagra Lane cafe Tori’s opens a second CBD location (with a new exclusive cloud matcha)",
        "publish_date": "Tue, 03 Feb 2026 12:29:51 +1100",
        "category": "finance",
        "authors": [
            "Tomas Telegramma"
        ],
        "text": "Add articles to your saved list and come back to them anytime.\n\nSave this article for later\n\nRemove items from your saved list to add more.\n\nYou have reached your maximum number of saved items.\n\nHead to the new Exhibition Street spot for new items including bagels, pretzels and more.\n\n1 / 6 Matcha and desserts reign at Tori’s second location on Exhibition Street. Supplied 2 / 6 Outside the new Tori’s. Supplied 3 / 6 Desserts are king. Supplied 4 / 6 Specialty iced drinks including matcha are on offer. Supplied 5 / 6 Tori’s is known for its cheesecake. Supplied 6 / 6 Earl Grey cloud matcha. Supplied Previous Slide Next Slide\n\nBakery$$$$\n\nThe matcha mania got so real at Niagara Lane cafe Tori’s that the crew opened a second city spot. It’s slicker than the vintage-furniture-filled original, but the offering is similar. Matcha drinks (and desserts) still reign, including exclusives such as the Earl Grey or jasmine matcha, but bagels and pretzels have also joined the line-up.\n\nWant to visit this venue? Save it in the Good Food app.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/politics/federal/ley-reveals-fresh-offer-to-littleproud-including-benching-rebels-for-6-months-20260203-p5nz1i.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Ley reveals fresh demand to Littleproud, including benching rebels for six months",
        "publish_date": "Tue, 03 Feb 2026 12:04:50 +1100",
        "category": "finance",
        "authors": [
            "Paul Sakkal",
            "Nick Newling"
        ],
        "text": "Advertisement\n\nPoliticsFederalPolitical leadership Ley reveals fresh demand to Littleproud, including benching rebels for six months Paul Sakkal and Nick Newling Updated February 3, 2026 — 12:04pm ,first published February 3, 2026 — 10:25am Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share A A A\n\nNationals MPs who were sacked for breaching shadow cabinet solidarity would be benched for six months under a fresh demand put by Opposition Leader Sussan Ley to Nationals leader David Littleproud. The pair met on Monday night and held what both parties described as constructive talks to reform the Coalition after it blew apart last month over a dispute about shadow cabinet discipline. Opposition Leader Sussan Ley on Tuesday morning. Alex Ellinghausen Ley revealed the offer in a Liberal Party room on Tuesday morning. According to sources in the room, Ley said the offer she made to Littleproud included that the three senators who resigned from the shadow cabinet a fortnight ago after crossing the floor would not be eligible to sit on the frontbench until July.\n\nAdvertisement\n\nHer second demand was that shadow cabinet solidarity be reaffirmed by both parties. The backbench party rooms of both parties would not be able to overturn decisions made by the shadow cabinet, a point that was queried by two conservative MPs who raised concerns about the party room’s right to have its say on party policy. These first two demands were put to Littleproud as non-negotiable by Ley, according to party sources. Opposition leader Sussan Ley addresses the media this morning. Alex Ellinghausen The Nationals expressed frustration that Ley’s offer leaked out to the media before its own MPs were briefed on the offer. Littleproud released a statement at midday saying he would take his time to respond. “As per media reports, the Nationals have received a written offer from the Liberal Party,” he said. “We will take our time to consider the details.\n\nAdvertisement\n\n“The Nationals are united in our endeavours to reset the Coalition, but we won’t be providing updates on any negotiations through the media.” As secondary requests, the Liberals would also reclaim the shadow assistant treasurer portfolio from the Nationals, with the skills portfolio given back in return. The Liberals covet the assistant treasurer portfolio because it takes in important policy areas such as superannuation. Nationals leader David Littleproud at the traditional pre-parliament church service on Tuesday morning. Alex Ellinghausen The Nationals would be able to pick three other MPs to fill the frontbench spots left by the resignations of Bridget McKenzie, Ross Cadell and Susan McDonald. Pressure has intensified on Littleproud this week as his own MPs backed a motion to get the Coalition back together, weeks after Liberals blamed him for recklessly allowing his party to vote against Labor’s post-Bondi hate speech laws despite the shadow cabinet agreeing to back it.\n\nAdvertisement\n\nBut both Littleproud and Ley have boxed themselves in, with Littleproud taking a hard line on a demand to reinstate the three frontbenchers who resigned last month, which Ley and her party room oppose, and also seeking greater flexibility for Nationals to cross the floor. While announcing the split 12 days ago, Littleproud said that the Nationals “cannot be part of a shadow ministry under Sussan Ley”, so any reconciliation would be a major backdown for the Nationals leader. Many MPs in both parties would like to see the two parties rejoin, even though some Moderate Liberals are keen to remain apart so that the Liberals can focus on city voters. Queensland backbencher Terry Young argued the split should be long-lasting. One Liberal MP said after Ley’s briefing that the Nationals were “parasitic” as the regional party “see the relationship with the Liberal Party as a way to enrich themselves” rather than achieve mutual success. “Many Liberals believe that are an unworthy coalition partner. Until they adopt a new mind set we are better off without them dragging us down to their level of mediocrity,” said the MP, who spoke off the record to be candid.\n\nAdvertisement\n\nPrime Minister Anthony Albanese and Opposition leader Sussan Ley take their seats for an ecumenical service for the commencement of Parliament at St Paul’s Anglican Church in Canberra. Alex Ellinghausen “David Littleproud is no longer credible as a leader and a parliamentarian. He should consider his future,” the MP said. “Preferably a vocation that does not require any form of relationship management.” This masthead reported on Monday that Ley’s allies, battling to stave off a challenge from leadership rival Angus Taylor, were asking MPs to keep Ley in the job until at least the time of the federal budget in May. Speaking outside a church service to mark the opening of parliament on Tuesday, Ley said: “Very confident of delivering a strong budget in reply speech in May.” “Lots of work between now and May because we have a big agenda to prosecute,” she said, adding that talks with Littleproud had been positive.\n\nAdvertisement\n\nLittleproud retained his position after facing a failed leadership challenge from rogue Nationals MP Colin Boyce on Monday. The Nationals leader said conversations last night between the two had been “positive” but did not end in the Coalition re-forming. Nationals MP Darren Chester, who has been pushing Littleproud to soften and reunite with Ley, said on Tuesday that the Liberals could not determine who the Nationals appointed to the frontbench. “I would have thought the leaders of both teams would choose their best performers in their eyes, to be on the shadow ministry, in the shadow cabinet. So that’s really a conversation they need to have behind closed doors,” he said on ABC Radio National. Cut through the noise of federal politics with news, views and expert analysis. Subscribers can sign up to our weekly Inside Politics newsletter.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/politics/federal/the-latest-illustrations-from-artist-simon-letch-20230608-p5df4g.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "The latest illustrations from artist Simon Letch",
        "publish_date": "Tue, 03 Feb 2026 12:04:33 +1100",
        "category": "finance",
        "authors": [],
        "text": "Remove items from your saved list to add more.\n\nYou have reached your maximum number of saved items.\n\nSave this gallery for later\n\nAdd galleries to your saved list and come back to them anytime.\n\nGot it",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/politics/federal/the-labor-minister-who-was-canadian-for-two-weeks-despite-trying-not-to-be-20260202-p5nyzx.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "The Labor minister who was Canadian for two weeks, despite trying not to be",
        "publish_date": "Tue, 03 Feb 2026 11:57:33 +1100",
        "category": "finance",
        "authors": [
            "James Massola"
        ],
        "text": "Advertisement\n\nExclusive PoliticsFederalCitizenship crisis The Labor minister who was Canadian for two weeks, despite trying not to be James Massola February 3, 2026 — 11:57am Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share A A A\n\nIndustry and Science Minister Tim Ayres was a Canadian citizen for two weeks in December after that country changed its citizenship laws, in a potential breach of section 44 of the Constitution. Ayres notified the federal parliament on Tuesday that, following a legal change late last year that extended Canadian citizenship eligibility to the grandchildren of people born in the country, he had involuntarily become a dual citizen. Minister for Industry and Innovation Tim Ayres. Alex Ellinghausen The episode revived memories of the federal parliament’s so-called constitutional crisis in 2017. Starting in July that year, a number of senators and members were disqualified from sitting in the federal parliament because they had failed to renounce or were eligible to hold citizenship of a second country, which they had failed to renounce. It eventually led to the disqualification of 15 MPs, including then-deputy prime minister Barnaby Joyce, now-Greens leader Larissa Waters and the current Finance Minister Katy Gallagher.\n\nAdvertisement\n\nPrior to his election in 2019, Ayres took all possible steps to renounce his Canadian citizenship by descent, but was told at the time by the Canadian government that he had nothing to renounce as he was not eligible for citizenship. Related Article Live\n\nNational News Live Australia news LIVE: RBA interest rate decision today; Cory Bernardi recruited by One Nation as Ley, Littleproud fail to reach Coalition resolution But that changed in June last year when laws were introduced into the Canadian parliament to expand the right to citizenship, automatically, to anyone born to a Canadian parent and, in many cases, grandparent. The Canadian parliament made the changes to its citizenship laws after a 2023 court decision found that the country’s laws, which limited citizenship by descent, were unconstitutional. After the laws to reclaim so-called “lost Canadians” were introduced into the nation’s parliament in June 2025, but before they came into effect on December 15 last year, Ayres sought advice from the Canadian government about how to renounce his citizenship, but was told he could not pre-renounce his dual citizenship.\n\nAdvertisement\n\nAyres also took advice from senior counsel, who told him that he was still eligible to be a senator and minister because “the implied qualification to s 44(i) of the Australian Constitution recognised by the High Court would prevent a newly enacted foreign law from disqualifying a sitting member of the Australian parliament”. Ayres’ lawyer also advised him to renounce his Canadian citizenship as quickly as possible, which he did. Ayres on December 10 last year, days before he involuntarily became a Canadian citizen. Dominic Lorrimer It was not until Bill C-3, as the law is known, came into effect on December 15 that Ayres could renounce his Canadian citizenship. The very next day, he contacted the Canadian government and was advised that he could finally renounce his citizenship of that country. The process took two weeks, according to a letter dated December 29 from the director-general of the Canadian passport office in Ottawa.\n\nAdvertisement\n\nThat letter states that “this document confirms that your application to renounce Canadian citizenship that was automatically conferred on you by operation of Canadian citizenship law was approved and you ceased to be a Canadian citizen on December 29, 2025”. “As this document attests that you ceased to be a Canadian citizen, we suggest that you keep this document in a secure place for future reference.” Ayres became a Canadian citizen because his grandfather was born in Canada in 1910, and was at that time a British subject. His grandfather later moved to Australia, and his father was born in Australia. The law change conferred Canadian citizenship on his father and, retrospectively, on the minister when the law change took effect. Ayres is one of Prime Minister Anthony Albanese’s most trusted lieutenants and a key powerbroker in the party’s left faction. He told this masthead that while grandfather was born in Canada, he had taken all steps possible to ensure before the 2019 and 2025 elections that he was only an Australian citizen and eligible to sit in parliament.\n\nAdvertisement\n\nEditor's pick Political leadership Ley reveals fresh demand to Littleproud, including benching rebels for six months “In December 2025, Canada’s Bill C-3 came into effect. As soon as the new Canadian law received Royal Assent, I established as soon as was legally possible that I was solely an Australian citizen,” he said. “The advice I have received from constitutional experts is clear: I have always been – and remain – eligible to sit in the parliament. I take my constitutional responsibilities seriously and today have made an addendum to my Qualification Checklist confirming that I remain not a Canadian citizen.” Professor Anne Twomey, a constitutional law expert at the University of Sydney, said previous High Court cases related to dual citizenship had not dealt with “the unusual case of a person being validly elected, but then, against their will, having foreign citizenship conferred upon them, and immediately renouncing it”. “If this matter came before a court, there would be a good case to argue that it fell within an exception from disqualification, just as an exception also arises where there is an irremediable impediment to renouncing foreign citizenship,” she said.\n\nAdvertisement\n\n“In practical terms, it is unlikely to come before a court, because it could only get there if the Senate referred it. Doing so would have no advantage, other than clarifying the law, because the senator could simply resign and then fill the resulting vacancy, as he is no longer a Canadian citizen.” Cut through the noise of federal politics with news, views and expert analysis. Subscribers can sign up to our weekly Inside Politics newsletter.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/business/markets/trump-s-vulnerable-america-is-a-target-for-china-20260203-p5nz1o.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Trump’s vulnerable America is a target for China",
        "publish_date": "Tue, 03 Feb 2026 11:57:05 +1100",
        "category": "finance",
        "authors": [
            "Stephen Bartholomeusz"
        ],
        "text": "Advertisement\n\nBusinessMarketsCurrencies Opinion Trump’s vulnerable America is a target for China Stephen Bartholomeusz Senior business columnist February 3, 2026 — 11:57am\n\nFebruary 3, 2026 — 11:57am Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share A A A\n\nWhy did the Chinese Communist Party’s flagship publication publish at the weekend comments made by Xi Jinping back in 2024? The obvious answer, given that their publication would have had to be made with Xi’s approval, is that he sees an opportunity as the “Sell America” trade gains traction. Trump’s chaotic policymaking is causing significant levels of distrust in America and its future. Getty The remarks published in Qiushi magazine focus on the role China’s renminbi can play in global trade and foreign exchange markets, with Xi posing the rhetorical question of “What constitutes a strong financial nation?” “First, it should have a powerful currency, widely used in international trade, investment and foreign exchange markets, holding the status of a global reserve currency,” he answered.\n\nAdvertisement\n\nTo achieve those objectives, China would need a powerful central bank capable of effective monetary management, globally competitive financial institutions and international financial centres able to attract global capital and exert influence over global pricing, he said. Xi’s ambition of internationalising China’s currency isn’t recent or secret. Related Article Opinion\n\nFederal Reserve Trump’s hand-picked man may not do his bidding Stephen Bartholomeusz Senior business columnist In recent years, it has accelerated its push to have the renminbi used as at least one side of trade transactions and has been doing that increasingly in trade with Russia, Iran, India, the Middle East and South American and African countries. About a third of its bilateral trade is now settled in renminbi. The recent stand-off with BHP, where China refused to allow the company to land some of its iron ore unless the trade was settled in renminbi, was a sign of a new willingness to use strong-arm tactics to coerce counterparties into using its currency.\n\nAdvertisement\n\nIt’s also built the payments infrastructure – its Cross-Border Interbank Payment System – to clear and settle international transactions in renminbi, to promote its internationalisation and to reduce reliance on the US dollar and the dominant US-dominated SWIFT financial messaging system. So, why dust off an old speech to articulate a previously largely unspoken but widely recognised ambition? With governance in the US apparently dysfunctional, its traditional allies unsettled and fearful and investors, governments starting to reduce their exposure to treasury markets and an economy whose settings are no longer regarded as risk-free, Xi senses a moment. Bloomberg It’s because the US and the US dollar appear vulnerable. Donald Trump’s chaotic policymaking, the international hostility and distrust generated by his trade war on the rest of the world, his assaults on multinational and domestic institutions, his threats to seize the territory of a NATO ally, his kidnapping of another country’s president, his disdain for the US Constitution and domestic laws, his attack of the Federal Reserve board’s independence, the accelerating build-up of US government debt and a fear that the administration is going to monetise that debt through money-printing and dollar depreciation are causing significant levels of distrust in America and its future.\n\nAdvertisement\n\nThe demonstrated effect of the US-led seizure of Russian foreign exchange reserves at the onset of the war in Ukraine is another reason for foreign governments and their central banks to look for alternatives which, at the moment, appear to be largely a switch from US assets to gold. Central banks have doubled their purchases of gold since the seizure of Russia’s reserves on 2022. In the post-war era, the US dollar and the US Treasury securities market have been regarded as the world’s “safe havens”, but their status has been eroding since Trump first took office in 2017 and has deteriorated in the first year of his second term. It is reflected starkly in a depreciation of the dollar approaching 11 per cent against the basket of America’s major trading partners since Trump’s inauguration last year. Last week, Trump said he welcomed that decline.\n\nAdvertisement\n\n“I think it’s great. Look at the business we’re doing. The dollar’s doing great,” he said. A weaker dollar makes US exports more competitive abroad. His Treasury Secretary, Scott Bessent, immediately tried to walk those comments back, saying America remained committed to a strong-dollar policy. “If we have sound policies, the money will flow in,” he said. That is, of course, a big “if,” given the nature of Trump’s policies to date. Xi’s ambition of internationalising China’s currency isn’t recent or secret. A concern for foreign investors in the US and central banks holding US dollar-denominated reserves is that the chairman of Trump’s council of economic advisers and his temporary appointee as a Fed board governor, Stephen Miran, authored a paper in 2024 which set out how to boost US exports and the US manufacturing sector, narrow its trade deficit and lower the cost of US government debt.\n\nAdvertisement\n\nThe key to the “Mar-a-Lago Accord”, as it has become known, is a controlled depreciation of the US dollar. While Miran seems to have envisaged a grand agreement with other countries to intervene in markets to achieve that objective, it’s been happening anyway, in an uncontrolled fashion – which might explain why Bessent was so quick to try to distance himself and US Treasury policy from Trump’s comments. For Miran’s thesis to work, if it could work, dollar depreciation would have to occur in a measured way over a significant period. The “Sell America” trade is gaining traction on markets. AP Igniting an exodus from US markets at a time when US government debt has surpassed $US38 trillion ($54.5 trillion) and is climbing – and when nearly half that debt will now roll over within two years because Bessent has replaced maturing longer-term bonds with lower interest cost Treasury bills and notes – would be a potentially destabilising and potentially crisis-inducing exercise.\n\nAdvertisement\n\nWith the US governance apparently dysfunctional, its traditional allies unsettled and fearful, investors and governments starting to reduce their exposure to Treasury markets and an economy whose settings are no longer regarded as risk-free, Xi senses a moment. Sensing it is one thing. Taking advantage of America’s moment of vulnerability is another. Related Article Analysis\n\nChina relations The 2027 question: Will Xi Jinping annex Taiwan this soon, or not? While the dollar’s share of foreign exchange transactions, trade and central bank reserves has been sliding, it still remains the dominant currency in global financial activity. It’s used in about 89 per cent of foreign-exchange transactions, about 60 per cent of global debt is denominated in dollars and 57 per cent of foreign exchange reserves are dollar-denominated. In contrast, China’s currency is used in fewer than 9 per cent of foreign exchange transactions and constitutes only 1.93 per cent of global reserves. The euro has a stronger position, used in about 29 per cent of FX transactions and is the currency for about 20 per cent of the world’s official reserves.\n\nAdvertisement\n\nTo ever challenge the dollar as a reserve currency, China would need to make very significant changes to its policy settings, changes that would probably be unpalatable to the Communist Party. A reserve currency needs to be completely freely traded, which requires an open capital account and a freely floating currency whose value is determined by the market. China has tight capital controls – cross-border transactions have to be approved by a government agency – and manages its exchange rate tightly to ensure its stability. Related Article Opinion\n\nTrump's White House Trump is pushing China and Europe together to create a new world order Xi isn’t going to relinquish control over his financial system so, even without the other features needed to achieve reserve currency status – transparent and trusted legal and judicial systems and deep and very liquid financial markets – his ambitions are unlikely to be realised within the forseeable future. China, and Europe, can, however, keep chipping away at the dollar’s dominance and the effective subsidies of borrowing costs and the US standard of living that the rest of the world provides America, if only to reduce their own vulnerabilities to the Trump-driven shifts in America’s relationship with the rest of the world. The Market Recap newsletter is a wrap of the day’s trading. Get it each weekday afternoon.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/kathy-lette-on-ageing-fabulously-and-giving-cheek-to-the-king-20260127-p5nx85.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Kathy Lette on ageing fabulously … and giving cheek to the King",
        "publish_date": "Tue, 03 Feb 2026 11:55:00 +1100",
        "category": "entertainment",
        "authors": [
            "Margot Saville"
        ],
        "text": "Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Share A A A\n\nI’m five minutes early to meet celebrated writer Kathy Lette at Crafted, the restaurant at the Art Gallery of NSW – and I’m feeling a little nervous. The previous evening, I’d watched her Australian Story profile – it ends with footage of a recent launch of one of her books, where she invites everyone to come up on stage and dance. She’s also famous for serving up a “Disco Diet” at her many London dinner parties, with participants bopping for hours after dessert. Would this lunch go the same way? As a founding member of Inhibited Anonymous – and the last person to join a Gloria Gaynor flashmob – I sincerely hope not. Suddenly, Lette arrives, dressed in a trademark brightly patterned frock with matching lipstick and a pair of stilettos. She has chosen the restaurant because the gallery is currently showing an exhibition of Australian women artists, which is firmly in her wheelhouse. I’m conscious she is going to visit her 91-year-old mother that afternoon, so we quickly peruse the menus and order what I call a “Standard Girl Lunch” – vegetables, fish and mineral water. Lette orders bottarga with crudite vegetables. The beetroot salad is calling me and we both order the barramundi. Kathy Lette says her mantra for her musician husband Brian O’Doherty is “that he adores me, doesn’t bore me, and does all my chores for me”. Photo: Sam Mooy I clearly radiate AA vibes as none of my lunchers ever orders a drink. Of course, eliciting personal secrets from interview subjects by getting them tipsy is a well-worn journalistic technique, but it turns out that here, it’s redundant. The 67-year-old author is quite capable of telling you her most intimate life stories – over a glass of water. Lette has been famous since 1979, when a book she co-wrote with the late Gabrielle Carey rocketed onto the Australian literary scene. Puberty Blues, about two very young women growing up in a surfer community in Cronulla, became a cause celebre for its graphic portrayals of underage sex and drug-taking, including heroin. Two years after publication, it was made into a movie directed by Bruce Beresford. Lette in 2021 at Elouera Beach, Cronulla, where the Puberty Blues movie based on her book was set. Photos: Louise Kennerley, Supplied\n\nAdvertisement\n\nHerald journalist Helen Pitt wrote about the movie on its 40th anniversary in 2021, saying it “was criticised for whitewashing the feminist themes of the book, in relation to rape, abortion and miscarriage ... The original movie shows a culture in which gang rape is incidental and unremarkable, and mindless violence is amusing. And yet it serves as a valuable timepiece”. I asked Lette, who grew up in Cronulla, how many of her 21 books were based on her own life. All of them, she says. “It’s cheaper than therapy – putting it on the page is a way of making sense of the drama. I’ve written about everything: being a single girl around town in Sydney, trying to find a man who wasn’t married or gay, moving to LA. I’ve written about pregnancy, motherhood, raising a teenage daughter, raising an autistic son. I’ve written about divorce, I’ve written about affairs, I’ve written about midlife trauma, and now I’m writing about women post-menopause, because I think that’s the most interesting time in a woman’s life.” The barramundi and spring vegetables. Kathy Lette’s order of bottarga with crudite vegetables. The heirloom beetroot salad with whipped sunflower seed, mustard greens and pieces of orange. Photos: Sam Mooy\n\nAdvertisement\n\nA woman’s 60s are liberating, she says. “We’ve had the marriages, the divorces, we’ve raised the children. We’ve had the betrayals, the affairs, the heartbreak, the backstabs, all of that and the financial ups and downs. That material is so rich. And women survive it with such a good sense of humour,” she says. Lette says hormones are key to women’s lives, joking that she’s book-ended her writing career with tomes about puberty and menopause. “I think women don’t come into their true selves till post-menopause, because women are brought up to be decorative and demure. But then after the menopause, when your estrogen drops, we no longer care what people think about us,” she says. “And so I just find women this age fabulous, funny, fascinating. I’m trying to encourage women my age to go forth and be fabulous because if not now, when?” The author is a generous interviewee, talking in long sentences that give me time to eat my heirloom beetroot salad, which has whipped sunflower seed, mustard greens and pieces of orange, and is absolutely scrumptious. She doesn’t have time to touch her entree of whipped cod roe, bottarga and crudites and asks to take it home to give to her partner, Irish-born musician Brian O’Doherty, whom she describes as a “brilliant cook”. We have both ordered the barramundi, which is on the menu as a special. It comes out as a thick wedge of beautifully tender fish topped with a crisp rectangle of skin, surrounded by a melange of mirepoix spring vegetables and crunchy seeds. For the thousandth time, I wonder why my own amateur kitchen offerings cannot achieve this perfect balance of textures and flavours.\n\nAdvertisement\n\nAfter a few mouthfuls, we return to a perennial topic – when are our unmarried offspring going to give us some grandchildren? Lette reveals that she has given her daughter a gift of egg freezing for her next birthday. She has written about it (with her daughter’s permission) for a British newspaper. The bill from Crafted, the restaurant at the Art Gallery of NSW. “I used to think women could have it all. I still think women can have it all, but it’s not all at once,” she says. Lette says that when she gives talks in schools, she tells the young women to choose their partner carefully. “Because if you choose an alpha male, he’s going to have a big career. If the child is sick, who do you think is the one who has to pull back? Yeah, it’s always the woman,” she says. “I’ve had two alpha men, whom I adore [her former husbands ABC chair Kim Williams and London barrister Geoffrey Robertson, KC]. I still love them both, and I’m very close to them. Right now, I’ve got a beta. My mantra for him is that he adores me, doesn’t bore me, and does all my chores for me. And it’s incredible to have a beta man, and he wants me to be shining, and I earn more money, right? That’s OK.” I’ve cyberstalked Lette’s social media, finding photos of her going on holidays with Robertson and the children.\n\nAdvertisement\n\n“Geoffrey’s and my divorce was pretty amicable. We’ve got two kids, one who has special needs [their 35-year-old son, Julius, is on the autism spectrum] so we’ve got to stay friends,” she says. “And I always say to my girlfriends, ‘there was something about that person you loved and it is still there’. Once you get over the pain and the wrangling, you can find that in that person again and try and concentrate on that. So especially if you’ve got kids, it makes it much easier.” Lette lives between a house in London and a light-filled apartment in Sydney’s inner east. Being an Australian means you can escape the worst aspects of the British class system, she says. Rubbing royal shoulders: Prince Charles (now the King) greets Kathy Lette at a reception to mark Camilla’s 70th birthday at Clarence House in 2017. Photo: Getty Images I ask her about her well-known friendship with the King and Queen. “When I’m with a member of the royal family and I say something cheeky, there’s an audible gasp from the minders – ‘did she really say that to the King?’ But he always finds it funny and so does Camilla. I mean, I always say to them, ‘I really like you, even though I don’t believe in you.’ I am a republican.” How do they take that? I ask. “They’re pretty sanguine,” she says. “I mean, look what they’ve been through.”\n\nAdvertisement",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/goodfood/melbourne-eating-out/is-this-new-southbank-spot-melbourne-s-first-armenian-bakery-20260203-p5nz4y.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Is this new Southbank spot Melbourne’s first Armenian bakery?",
        "publish_date": "Tue, 03 Feb 2026 11:49:56 +1100",
        "category": "finance",
        "authors": [
            "Tomas Telegramma"
        ],
        "text": "Add articles to your saved list and come back to them anytime.\n\nSave this article for later\n\nRemove items from your saved list to add more.\n\nYou have reached your maximum number of saved items.\n\nTatik’s Delights has graduated from online orders to bricks and mortar.\n\n1 / 2 The 12-tier honey cake (right) and choc-caramel mikado with 10 layers at Armenian bakery Tatik’s Delights. Supplied 2 / 2 Cake and coffee at Tatik’s Delights. Supplied Previous Slide Next Slide\n\nBakery$$$$\n\nBilling itself as Melbourne’s first Armenian bakery, Tatik’s has graduated from online orders to bricks and mortar in less than two years. At its red-splashed shopfront in Southbank, try layered cakes including the 12-tiered bestselling honey cake and the choc-caramel mikado with 10 layers. There’s also gata, the sweet, buttery Armenian bread.\n\nWant to visit this venue? Save it in the Good Food app.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/lifestyle/health-and-wellness/the-collapse-of-the-vegan-boom-20260115-p5nu8e.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "The collapse of the vegan boom",
        "publish_date": "Tue, 03 Feb 2026 11:45:00 +1100",
        "category": "lifestyle",
        "authors": [
            "Tom Haynes"
        ],
        "text": "Advertisement\n\nLifestyleHealth & wellnessVegan The collapse of the vegan boom Tom Haynes February 3, 2026 — 11:45am Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share A A A\n\nIt’s been seven years since The Economist boldly declared 2019 “the year of the vegan”, and it appears the vegan revolution is running out of steam, with some joking on social media that life has just become too depressing to swear off meat. Signs of veganism’s decline first appeared back in 2023 when a YouGov survey found that just 6 per cent of Australians follow a vegan or vegetarian diet. For many industry experts, the collapse in the vegan boom has been a long time coming. It appears the vegan revolution is running out of steam. Getty Images “I told investment companies 10 years ago that veganism is a niche of a niche,” says Ged Futter, a retail expert and former buyer.\n\nAdvertisement\n\nRelated Article Diet What’s for dinner? The debate over fresh, frozen or canned veg “It was no surprise to me at all. Veganism sits within vegetarianism and no one really talks about vegetarianism any more.” The current state of affairs is a far cry from five years ago, when shoppers could hardly move for vegan ad campaigns. Woolworths, Coles and Aldi all unveiled plant-based ranges while KFC, Krispy Kreme and Magnum made similar attempts to cash in on the vegan hype. But many are starting to realise that consumer appetite isn’t there. Last year, Woolworths confirmed to 9News that it had reduced its vegan offering due to a decline in customer interest. Similarly, Coles also told the outlet it had “refined” its vegan range “to better reflect customer demand”.\n\nAdvertisement\n\nIn the UK, popular restaurant chain Wagamama axed a string of vegan favourites from menus, including its “Vegatsu” curry and its “vegan K-Dogs”. Andy Hornby, the chief executive of the chain’s owner, The Restaurant Group, argued that interest from diners wasn’t high enough to justify continuing the dishes. Marketing for the chain’s most recent menu additions makes noticeably less of a fuss about its vegan credentials. “People are realising that the volumes going through fully vegan products are very low,” says Futter. “For manufacturers, when volumes are that small and you can’t see a long-term future, there comes a point where you decide to do something else.” Last year was also a reckoning for businesses that sought to dominate the vegan market.\n\nAdvertisement\n\nRelated Article Fitness The goal posts for a longer, healthier life are closer than you think In April, Neat Burger, the vegan burger chain backed by Leonardo DiCaprio and Lewis Hamilton, shut all of its UK restaurants after suffering substantial losses. Vegan specialities have also vanished from menus across Europe. The McDonald’s plant burger was quietly pulled from Austrian Branches in July while Domino’s shrank its vegan offering as part of a November relaunch. Meat-free menus are only a cost-saver for restaurants if vegan dishes sell, says Grace Withers, of the Agriculture and Horticulture Development Board (AHDB) – but consumer appetite has been overestimated.\n\nAdvertisement\n\n“Even when veganism was at its most popular, we saw far more people claiming to be vegan than actually managing to stick to it,” says Withers. “People often lapsed when they were hungry and wanted something tasty. We saw this during Veganuary as well.” Only 1 per cent of those who signed up for Veganuary made it to the end of the month having stuck to the diet, according to the AHDB, a public body which supports farmers and growers. Cost has also been a factor, as plant-based substitutes such as Quorn and tofu have increased in price more than cheaper meats in recent years. “Consumers are very price-driven because of the cost-of-living crisis,” says Withers. “Meat-free products are more expensive than pig meat and chicken, so they are not competing on price.”\n\nAdvertisement\n\nRelated Article Opinion\n\nNutrition RFK’s new food pyramid is all sizzle and no steak Sarah Berry Lifestyle Health Editor Compounding vegan woes is the fact that some health-conscious consumers have moved on to other fads. “As the trend for strength training continues to grow in popularity, protein intake has become more of a priority,” says Jenni Tardiff, a trainer at the Gym Group. Data from retail analyst Kantar show that 46 per cent of shoppers try to include high-protein in their diets, up from 38 per cent in 2022. Cultural headwinds have similarly shifted, particularly since Donald Trump re-entered the White House.\n\nAdvertisement\n\nThe food pyramid unveiled by his health department earlier this month put dairy and healthy fats at the top. “We are seeing culture swing back towards celebrating real, simple food: red meat, butter and full-fat milk,” says Bia Bezamat, of Kantar. “Protein is easier to get from animal sources. Simplicity is resonating with people in a world that feels increasingly multi-layered and complex.” The rise of weight-loss drugs has also been a factor, Bezamat says: “When you are on medication, you need to make sure you eat the nutrients you need and a diet as restrictive as veganism does not really support that.” Elsewhere, a growing pushback against so-called “ultra-processed foods” has dented the popularity of meat-free substitutes. “When you look at the back of the pack on some vegan products, the list of ingredients is enormous,” says Futter.\n\nAdvertisement\n\n“A large proportion of vegan products are made from things people don’t really recognise or understand. Brands and supermarkets have recognised that this is not what customers are looking for.” Despite the cut-through of the odd vegan product like oat milk, the hope of a wholesale vegan revolution has unravelled. “I think there was an overestimation of how popular veganism would be,” says Bezamat, who compares it to the rise and fall of gluten-free diets. “That was the original restrictive diet, where there was initially very little offer and then suddenly lots of products,” she says. “Now it just sits there on the shelf.” The Telegraph, London\n\nSave You have reached your maximum number of saved items. Remove items from your saved list to add more. Share More: Vegan\n\nNutrition\n\nDiet\n\nHealth and nutrition",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/money/tax/how-a-simple-slip-up-could-see-your-property-sale-taxed-twice-20260203-p5nz37.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "How a simple slip-up could see your property sale taxed twice",
        "publish_date": "Tue, 03 Feb 2026 11:38:24 +1100",
        "category": "finance",
        "authors": [
            "Julia Hartman"
        ],
        "text": "Advertisement\n\nMoneyTaxCapital gains tax How a simple slip-up could see your property sale taxed twice Julia Hartman February 3, 2026 — 11:38am Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share A A A\n\nIt is almost common knowledge these days that a capital gain is taxed in the financial year that the contract is signed, not the year of settlement, and getting this wrong can result in double taxation of the same capital gain. Edward Sunna’s case, ruled on by the Federal Court at the end of last year, highlights the danger of declaring the capital gain in the wrong year as you could end up being taxed in both years. Take careful note of the date you sign your sale contract, as it could be what saves – or costs – you thousands in tax. Suzanne White This is because the ATO has an unlimited time period to amend old tax returns to include a capital gain, but if the amendment period (usually 2 years) has passed, they cannot remove the capital gain from the incorrect year. In some scenarios, it is not so common knowledge as to which year applies. In Sunna’s case, he signed the contract on June 28, 2019, but did not receive the deposit – which was nearly 50 per cent of the sale price – until after June 30, now in the 2019-2020 financial year.\n\nAdvertisement\n\nHe then included the deposit in his 2020 tax return and when the sale of the $5.5 million Sydney unit went through in August 2022, he included the rest of the gain in his 2023 tax return. In reality, the whole of the gain should have been included in the 2019 tax return. So if you’re planning on buying or selling a house soon, here’s what you need to know: Sale of Asset: The capital gain goes in the tax return for the year that the contract was signed, regardless of when the deposit was received. If no contract was signed, then the year that the ownership of the asset transferred. As you can see, this can result in the deadline for lodging tax returns expiring before the outcome is known. You can lodge your tax return without the capital gai,n while the outcome remains uncertain, then amend within a month of settlement. The ATO undertakes not to charge interest or penalties providing the amendment is made within a reasonable time, generally a month.\n\nAdvertisement\n\nOptions: If you enter into an option to sell your property and the option is exercised, the option proceeds are just included with the sale proceeds in the financial year that the option is exercised – i.e., the year that the contract for an actual sale is signed. Editor's pick Opinion\n\nProperty development Knocking down and rebuilding? Don’t fall for these tax traps If the option is not exercised, then you need to include the option proceeds in the tax return for the year, back at the start, when the option was entered into. Forfeited Deposit: This goes into the tax return for the year that the deposit was forfeited. Note if the deposit is not forfeited, it just becomes part of the sale proceeds, so it applies to the tax return when the contract was signed. Section 107 of the Income Tax Assessment Act prevents the two-year amendment period limitation applying when an amendment is made to include a capital gain that has not been previously been included in the tax return for that year.\n\nAdvertisement\n\nThe catch is that there is no similar provision to extend the amendment period to correct a capital gain incorrectly included in another year. So, the ATO can go back as far as it likes to include your capital gain in the correct year without having to remove it from the tax return for the year in which it was mistakenly included. This will result in the capital gain being taxed twice. Sunna’s case found that there was no real impediment to this happening. If this article has raised any concerns, you can apply to the ATO to exercise their discretion to allow the amendment period to be extended on the tax return where the capital gain was incorrectly included. Julia Hartman founded BAN TACS Accountants more than 30 years ago and is still passionate about all things tax. Advice given in this article is general in nature and is not intended to influence readers’ decisions about investing or financial products. They should always seek their own professional advice that takes into account their own personal circumstances before making any financial decisions. Expert tips on how to save, invest and make the most of your money delivered to your inbox every Sunday. Sign up for our Real Money newsletter.",
        "source": "SMH"
    },
    {
        "url": "https://www.sbs.com.au/news/live-blog/rba-interest-rates-decision-live/hoc4etbow",
        "title": "Live updates: RBA to hand down its latest interest rates decision",
        "publish_date": "Tue, 3 Feb 2026 00:44:39 +0000",
        "category": "finance",
        "authors": [],
        "text": "A potential rate hike by the Reserve Bank on Tuesday could lift the Australian dollar, with implications for inflation and businesses, according to AMP chief economist Shane Oliver.\n\n\"If you hike, then rate hike expectations will be reinforced. The money market is assuming over two hikes here,\" Oliver told SBS News.\n\n\"In the US, the money market is assuming two cuts this year. So, a hike will probably reinforce the upwards pressure on the Aussie dollar.\"\n\nHe explained the broader impact: \"A rising Aussie dollar is great for Australians going on holiday, but tough news for Australian companies that have to compete internationally. That is a form of monetary tightening — over time it will lower prices for imports and take pressure off inflation.\"\n\nOliver added: \"It's not just rates going up, it's also the Aussie dollar going up. Ramp up rate hike expectations, and you'll end up with a stronger Australian dollar and further de facto monetary tightening.\"\n\n— Gabrielle Katanasho",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/ghb-party-drug-deaths-spike-tenfold/yyip6nno9",
        "title": "'It's now a daily occurrence': Warnings as deaths linked to party drug surge",
        "publish_date": "Mon, 2 Feb 2026 21:40:50 +0000",
        "category": "lifestyle",
        "authors": [],
        "text": "Deaths linked to a notorious party drug have surged tenfold in Australia, a study has found, as a prominent hospital warns overdose presentations are on the rise.\n\nGamma-hydroxybutyrate, also known as GHB and \"liquid ecstasy\" is used for its euphoric and disinhibiting effects at low doses.\n\nBut the clear, liquid substance is notorious for the razor-thin margin between the amount required for a positive experience and an overdose.\n\nA study has found the number of GHB-related deaths in Australia has increased tenfold since 2013, while the number of hospitalisations has tripled.\n\nThe study, led by the National Drug and Alcohol Research Centre (NDARC) at the University of New South Wales, analysed coronial records, hospital data, treatment services, population surveys and interviews with drug users.\n\nIt found there was a statistically significant increase in GHB-related deaths from 0.02 per 100,000 people in 2013 to 0.24 per 100,000 people in 2022.\n\n'These number are a cause for alarm'\n\nResearchers found GHB-related hospitalisations increased from 5.3 to 19.1 cases per 100,000 people, while treatment episodes increased tenfold, straining hospital and ambulance resources.\n\n\"GHB is a drug that carries quite a high risk of overdose and other harms,\" senior author of the study, NDARC deputy director Amy Peacock, told AAP.\n\n\"Those harms are rising and they are preventable.\"\n\n\"These numbers are a cause for alarm. Without targeted action, the situation will only worsen, and more people will be harmed,\" she warned.\n\nSt Vincent's Hospital Melbourne's emergency medicine director, Dr Jonathan Karro, said GHB-related presentations at the emergency department had spiked in recent years.\n\n\"It's now a daily occurrence,\" Karro told AAP.\n\n\"The spread of patients is much wider now too, with patients of all ages and backgrounds presenting at odd times.\"\n\nKarro said the substance poses unique challenges to clinicians because there is no antidote and patients are often unconscious.\n\nCall for better health messaging\n\nUsers are increasingly purchasing the substance by the litre, given its affordability at about $5 per dose, he added.\n\nAlthough overall use remains low, national survey data suggests the share of Australians who have used it in the past year tripled over the decade.\n\nPeacock called for urgent improvements in health messaging related to GHB, focusing on the risks posed by repeat dosing and drug mixing.\n\n\"Repeated dosing can quickly lead to overdose because GHB builds up in the body faster than people realise,\" Dr Peacock said.\n\n\"And using it with alcohol, ketamine, or other depressants greatly increases the risk of respiratory depression and loss of consciousness.\"\n\nIllegal imports on the rise\n\nThe study suggested increasing availability was behind the spike in GHB-related hospitalisations, with illegal imports on the rise.\n\nIn May, the Australian Federal Police (AFP) warned of a \"tidal wave\" of illegal importation of 1,4-Butanediol, the precursor to GHB.\n\nThe AFP seized more than 18.3 tonnes of the substance in the 12 months leading to March, more than any other drug.\n\nREAD MORE How an offer to carry a strange package to Australia almost turned Susi into a drug courier\n\n\"Our message to the community remains clear — there is no safe dose of this drug,\" AFP acting assistant commissioner Paula Hudson said at the time.\n\n\"By importing this substance into Australia, criminal networks are creating a demand and appetite for this illicit drug and the bigger the appetite, the bigger the profits.\"\n\nFor the latest from SBS News, download our app and subscribe to our newsletter.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/rba-rate-decision-mortgage-impact/jtp5wbh8s",
        "title": "What could disappear if rates rise today — and how much a hike would cost you",
        "publish_date": "Mon, 2 Feb 2026 18:33:27 +0000",
        "category": "finance",
        "authors": [],
        "text": "The Reserve Bank of Australia's first board meeting of the year could deliver a rate hike — though some economists say there's a case to hold.\n\nAll of Australia's 'big four' banks, as well as economists from major investment banks and consultancy firms, are forecasting a hike when the RBA's monetary policy board meets on Tuesday.\n\nIf they are right, the RBA would become the first major central bank to reverse course from a series of rate cuts as inflation eased following a surge between mid-2020 and late 2022 during the height of the COVID-19 pandemic.\n\nSally Tindall, data insights director at financial comparison site Canstar, said a 0.25 percentage point increase in the cash rate to 3.85 per cent would all but wipe out home loan rates below 5 per cent.\n\n\"There are now just six lenders offering fixed rates under five per cent,\" Tindall said.\n\n\"A February hike would almost certainly close the door on the last remaining options.\"\n\nHowever, some believe the board may opt to keep the cash rate at its current level.\n\nOn the Money podcast: Property values accelerate ahead of RBA meeting Property values accelerate ahead of RBA meeting & gold and silver prices smashed SBS News 20:05 English\n\nWhy some economists expect the RBA to hold\n\nAMP chief economist Shane Oliver expected the RBA to leave the cash rate unchanged, but he said a hike would likely follow soon after if inflation doesn't continue to ease.\n\nHe said that, if the board does not move today, an increase by March remains a strong possibility.\n\n\"Our initial reaction after the CPI was that they'll hike,\" Oliver said, referencing the Australian Bureau of Statistics' (ABS) latest release of consumer price index data last week.\n\n\"But then when we looked a bit more at the data, we thought it was a lot more complicated.\"\n\nCanstar's 'big four bank' forecast data shows broad agreement on a near-term hike, but less clarity on how far rates may rise through 2026. Source: SBS News\n\nOliver acknowledged that, across most measures, inflation remained above the RBA's 2-3 per cent target band and the labour market was still tight, with unemployment at 4.1 per cent.\n\nHowever, he said recent data suggested inflation momentum was easing.\n\n\"The monthly trimmed mean inflation rate (which strips out volatile items) has progressively fallen from a high in October … to 0.23 per cent in December,\" Oliver said.\n\n\"I don't think you can totally ignore that.\"\n\nHe also pointed to slower growth in rents and new dwelling prices in December, a stronger Australian dollar reducing imported inflation, and business surveys showing output price inflation closer to the RBA's target band.\n\n\"When you run through all of that, I think it's a close call,\" he said.\n\n\"We put [the odds] at 51 hold and 49 hike.\"\n\nA hike is not guaranteed, Westpac chief economist Luci Ellis said.\n\nWhile the former RBA assistant governor expected the central bank to raise rates, there is a chance the board could wait a little bit longer.\n\nThere is a case to be made that data shows inflation is not moving further away from target and there are also arguments to be cautious given the ABS' new monthly measure has made inflation harder to interpret, she said.\n\nBut HSBC chief economist Paul Bloxham said the case to hike is a strong one.\n\n\"By not having hiked as much, and not having delivered as big a downturn, it seems the RBA should have held its cash rate higher for a bit longer,\" he said in a research note.\n\nFinancial markets are pricing in roughly a 70 per cent chance of a 0.25 percentage point increase.\n\nWhat a rate hike could cost borrowers\n\nFor borrowers with variable-rate mortgages, the consequences of a rate hike would likely be immediate.\n\nCanstar analysis shows that a 0.25 per cent increase would lift minimum monthly repayments across a wide range of mortgage sizes, increasing pressure on household budgets already strained by elevated living costs.\n\nAn owner-occupier with a $600,000 mortgage and 25 years remaining would see their minimum monthly repayments rise by $90, assuming banks pass it on to their variable customers. Source: SBS News\n\nTindall said the impact would depend on how borrowers responded to last year's rate cuts.\n\n\"In 2025, we saw three cash rate cuts, and a number of variable borrowers didn't actually lower their minimum monthly repayments,\" she said.\n\n\"That meant they were paying more than required and building an important buffer.\"\n\nHowever, she acknowledged that many had reduced repayments out of necessity as grocery, fuel and essential costs rose.\n\n\"For those families, the pressure has intensified,\" Tindall said, warning that further increases could push some households into repayment stress.\n\nShe said Canstar's big four bank forecast data showed broad agreement on a near-term hike, but less clarity on how far rates might rise through 2026.\n\nCanstar modelling also shows how higher rates would reduce borrowing capacity for new buyers, while loan-size analysis highlights how repayment pressure escalates quickly for larger mortgages.\n\nCanstar modelling shows how higher rates would reduce borrowing capacity for new buyers.\n\n\"Prepare your budget as if we're going to see more than one rate hike,\" Tindall said.\n\n\"It's better to be overprepared than fall short.\"\n\nSpending risks and housing pressures\n\nOliver said the RBA would also be weighing how quickly higher rates could hit consumer spending.\n\nA pickup in household consumption late last year was partly driven by the three rate cuts in 2025 and expectations that more relief was coming, he said.\n\n\"There is a danger here that if we now move into rate hikes, we could see a setback in consumer spending,\" Oliver said.\n\nBeyond household budgets, the decision also carries broader consequences for housing.\n\nHousing Industry Association chief economist Tim Reardon said higher rates risk worsening housing inflation by constraining new supply, adding that, while not the only factor, housing costs remained the most persistent driver of inflation.\n\n\"We are seeing house prices rise due to a scarcity of housing,\" he said. \"Higher interest rates exacerbate that scarcity and make the problem worse.\"\n\nHe said the burden of higher rates would fall disproportionately on first home buyers and renters, the latter of which would feel the pain as landlords passed on higher repayment costs to their tenants.\n\n\"Raising rates to slow rental and home price growth is perverse,\" he said. \"It adds to supply shortages and inflationary pressure over the long run.\"\n\n— With additional reporting by the Australian Associated Press.\n\nFor the latest from SBS News, download our app and subscribe to our newsletter.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/property-values-accelerate-ahead-of-rba-meeting-gold-and-silver-prices-smashed/5b7iiniov",
        "title": "Property values accelerate ahead of RBA meeting & gold and silver prices smashed",
        "publish_date": "Mon, 2 Feb 2026 07:27:33 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/political-donations-2025-federal-election-leadup/pi0lbzm5h",
        "title": "Politicians' kids, billionaires and delivery giants: Australia's political donors revealed",
        "publish_date": "Mon, 2 Feb 2026 06:18:33 +0000",
        "category": "finance",
        "authors": [],
        "text": "Billionaires and delivery giants were among the donors who bet big on politics ahead of the 2025 election.\n\nOn Monday, the Australian Electoral Commission (AEC) released its annual financial disclosure return information, revealing the biggest donors and spenders in 2024-25.\n\nIt shows Clive Palmer's mining company, Mineralogy, was the biggest donor, funnelling $52.9 million into his Trumpet of Patriots party and a further $302,901 to his United Australia Party, which was deregistered in 2022.\n\nDespite a publicity campaign that featured a plethora of texts and advertisements, the right-wing political party failed to pick up a lower house seat.\n\nSeveral mining companies spent big in the lead-up to the election, with Coal Australia Limited the second-highest donor.\n\nIt donated $2.7 million to Australians for Prosperity, a coal-industry-funded group campaigning against progressive candidates and a further $1.3 million to an advocacy group promoting the interests of mining communities.\n\nMining magnate Gina Rinehart was the biggest contributor to Advance Australia.\n\nHancock Prospecting, run by Australia's richest person, Gina Rinehart, contributed $895,000 to the conservative lobby group Advance Australia, which focused on disrupting Greens seats.\n\nAnthony Pratt's recycling and packaging empire Pratt Holdings, which owns Visy Industries, donated $2 million to Labor and $1 million to the Liberal Party.\n\nClimate 200, founded by Simon Holmes à Court, declared $2,709,200 in donations to third parties, Hothousemag — a third-party entity that fundraises and spends on political advertising — and climate action advertising group It's Not a Race.\n\nThat's on top of the $10,875,934 declared to the AEC last year for specific 2025 election donations, which were made directly to independent candidates.\n\nPolitical parties are not required to submit election-specific returns to the AEC, only independent candidates.\n\nTurnbull's son and DoorDash among donors\n\nDelivery giant DoorDash donated $785,000 to the Liberal Party in the four months before the election, compared with $3,000 to Labor. It did not donate in the previous financial year.\n\nDoorDash and fellow delivery outfit Uber Eats vehemently opposed Labor's 2024 Fair Work laws to regulate the gig economy and protect workers. After two years of negotiations with the Transport Workers Union, a landmark minimum pay deal was struck in November.\n\nSBS News has confirmed former prime minister Malcolm Turnbull's son Alex donated $25,000 to independent Wentworth MP Allegra Spender, the same amount as before the 2022 election, as well as $50,000 to Climate200.\n\nOnline gambling company Sportsbet hedged its bets, donating exactly $71,500 to both Labor and the Coalition, with the latter split between the Nationals and Liberals.\n\nCrypto company Coinbase Australia did similarly, spending $100,000 on NSW Labor and $130,000 on the NSW Liberal Party.\n\nMeanwhile, telecommunications giant Optus spent $41,000 on several Labor branches and $42,800 across the Liberals and Nationals.\n\nCoalition outspent Labor in election loss\n\nThe annual snapshot also revealed how much the major parties spent on their 2025 election campaigns.\n\nLabor used $159 million in electoral donations on advertisements and campaign efforts to get Prime Minister Anthony Albanese re-elected, less than the $161 million it received.\n\nMeanwhile, the former Liberal-National Coalition spent $55 million more than Labor, with a total of $214 million across its federal, state and territory divisions.\n\nHowever, it also amassed larger donations, with a total of $221 million in receipts for the financial year.\n\nCommon uses of political donations include fundraising activities, research and polling and campaign material as well as advertising including on television and radio.\n\nAny donation above $16,900 needs to be declared to the AEC, and no foreign entities can donate to Australian parties.\n\nLast February, Labor passed electoral reforms which have reduced the disclosure threshold to $5,000, expedited reporting and introduced new donation caps, which independents claim will benefit the major parties. These come into effect on 1 July 2026.\n\n— With additional reporting by Rania Yallop.\n\nFor the latest from SBS News, download our app and subscribe to our newsletter.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/david-littleproud-remains-nationals-leader-after-failed-spill-motion-evening-news-bulletin-2-february-2026/mwld2e42n",
        "title": "David Littleproud remains Nationals leader after failed spill motion | Evening News Bulletin 2 February 2026",
        "publish_date": "Mon, 2 Feb 2026 05:12:31 +0000",
        "category": "sports",
        "authors": [],
        "text": "Listen to Australian and world news and follow trending topics with SBS News Podcasts.\n\nTRANSCRIPT\n\nDavid Littleproud remains Nationals leader after a failed spill motion\n\nAn Australian woman dies after a skiing accident in Japan\n\nRecord attendance figures at this year's Australian Open\n\nDavid Littleproud will remain the leader of the Nationals Party after a failed spill motion.\n\nQueensland MP Colin Boyce had launched the attempt to trigger a leadership challenge, but it has failed to garner any support from his colleagues in order to trigger a vote.\n\nEarlier, Mr Boyce was realistic about unseating the incumbent, but maintained he was doing it because it was 'political suicide' to separate from the Liberals.\n\nMr Littleproud will now meet with embattled Opposition Leader Sussan Ley to talk about reuniting the coalition - which Liberal MP Alex Hawke says is in everyone's interest to agree on.\n\n\"I think Littleproud is on the verge of scoring the biggest own goal on the centre right politics of all time... This happened quickly. It can unhappen quickly if people are willing to put aside their personal egos.\"\n\n---\n\nThere is speculation that former Liberal Senator Cory Bernardi could be One Nation's next recruit.\n\nThe South Australian conservative Cory Bernardi has praised the party's recent progress on his Substack and has been signalling his active support for Pauline Hanson's platform.\n\nOne Nation chief of staff James Ashby is teasing a shock announcement this week while party insiders are hinting at Mr Bernardi’s potential candidacy in South Australia.\n\nOne Nation MP and former National Barnaby Joyce has declined to provide further details when repeatedly pressed on the issue on Channel Seven, although he has expressly ruled out Nationals MPs Bridget McKenzie and Colin Boyce as defectors.\n\n\"It wouldn't be a big announcement if I made an announcement today, would it? It would be certainly a scoop. That's what the word is, a scoop. But I'm not going to make the announcement. I think I've got a pretty good idea what it is.\"\n\n---\n\nAn Australian woman has died following a ski lift accident in Japan.\n\nThe 22-year-old woman was at the Tsugaike Mountain Resort in Nagano Prefecture.\n\nJapanese media reports say the buckle on the woman's backpack belt became caught in the chair as she travelled in the ski lift, pulling her with it when she tried to get off.\n\nShe was rushed to hospital in a critical condition, where she later died.\n\n---\n\nBad Bunny is among the artists to pick up early prizes at the 68th annual Grammy Awards in Los Angeles.\n\nThe Puerto Rican reggaeton musician was up for six awards; and has won the award for música urbana album.\n\nHe has already made history as the first Spanish language artist to be nominated for song record and album of the year.\n\nHe used his acceptance speech to comment on the immigration raids in the United States.\n\n\"Before I say thanks to God, I'm going to say 'ICE out'.\"\n\nMeanwhile, Australian artist Tame Impala has picked up his first solo Grammy for the Best Dance Electronic Recording.\n\nHis award was presented during the Premiere Ceremony, in the adjacent Peacock Theater in Los Angeles, ahead of the main show.\n\n---\n\nTo Tennis,\n\nThe Million Dollar One Point Slam - introduced in this year's Australian Open - is here to stay.\n\nAustralian Open boss Craig Tilley says the event - won by 29-year-old amateur player Jordan Smith this year - has proved popular.\n\nMore than 1.3 million people attended this year's tournament, breaking the previous record set last year by more than 100,000.\n\nMr Tilley says organisers have learned lessons from the entire event, which include needing to find ways to expand capacity for fans.\n\n\"We had 40-thousand people show in about 30 minutes, which was really unexpected on the first day. And most of them were walk-ups, and we didn't know many of them still had to go and buy tickets. We stood up another entry overnight, which normally takes about two days. The team did a magnificent job of doing that. So going into next year there is no doubt, we'll have more seats, we'll have more shade, we'll have more space. We will work more closely with Melbourne Park on that opportunity. We know the plan because we had some of it for this year. And we know what we will need to do for next year.\"\n\nAnd that's the latest from the SBS Newsroom.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/australia-confirms-closure-of-afghan-embassy-amid-taliban-pressure/ute0yp0dz",
        "title": "Australia confirms closure of Afghan embassy amid Taliban pressure",
        "publish_date": "Mon, 2 Feb 2026 02:18:29 +0000",
        "category": "finance",
        "authors": [],
        "text": "Listen to Australian and world news and follow trending topics with SBS News Podcasts.\n\nTRANSCRIPT\n\nThe closure of the Afghan embassy in Canberra, in the pipeline for some time, has now been confirmed with a timeline.\n\nThe embassy will officially shut on the 30th of June this year.\n\nThe decision comes after reports late last year that the Australian government advised the embassy's ambassador, Wahidullah Waissi, that his diplomatic credentials would not be renewed.\n\nCEO of the Afghan Women on the Move organisation, Maryam Zahid, says it's a substantial loss for the Afghan diaspora in Australia.\n\n\"This announcement has created a lot of fear, confusion and disappointment. because this embassy for Afghan diaspora here in Australia, it was more than a diplomatic platform, especially for women and elders, it was a place of connection, identity. They could have or they should have worked with Afghan diaspora and ask us what we need and they didn't do that.\"\n\nThe Afghan embassy has served as a diplomatic, cultural and community bridge between Afghan Australians, civil society organisations, schools and universities, plus local, state and federal government.\n\nMs Zahid says the closure leaves a gap the government is yet to explain how it will fill.\n\n\"Because our government here in Australia hasn't offered us something to replace it in terms of having a community platform outside of religious views, community politics, and fights about who is who in the community, that hasn't been given to us, and it hasn't been invested in the Afghan community.\"]]\n\nThe diplomatic mission had been operating as an embassy-in-exile following the Taliban's takeover of Afghanistan in 2021.\n\nIt continued to issue official documents such as passports and visas, and to verify IDs for thousands of Afghan citizens living in Australia.\n\nHowever, its services haven't been operating normally since the Taliban announced in July 2024 that it would no longer recognise consular documents issued by 14 embassies related to the former republic, including the Canberra facility.\n\nDirector of the Afghan Cultural Association of Newcastle Sami Zakhil told SBS Pashto for this reason, he doesn't expect the closure to have a significant impact.\n\n\"The embassy has largely operated in a symbolic capacity and, by its own admission, has not been in contact with the current government in Kabul. As a result, it has not been able to meaningfully assist Afghans with consular or official matters.\"\n\nProfessor of Diplomacy at Australian National University, William Maley, says the decision to close the embassy follows a demand from the Taliban that all embassies under the control of an anti-Taliban ambassador be closed.\n\n\"Even though Australia might deny a connection between the letter and the decision, this really dents, if not fatally, Australia's credibility when complaining about the human rights performance of the Taliban. It's a terrible blow not only to the Afghan community, but also to Australian service personnel who served in Afghanistan, they really would feel like the government has spat in their faces.\"\n\nThe Department of Foreign Affairs and Trade said the government doesn't intend to accept a Taliban-appointed representative in a statement which in part reads:\n\n\"We do not recognise the Taliban as the legitimate representatives of the Afghan people. We strongly condemn the Taliban’s persistent systematic abuses of human rights, particularly against women and girls, and voices of dissent. We reaffirm our shared commitment to human rights and the dignity of the people of Afghanistan.\"\n\nA spokesperson for the foreign minister told SBS the Albanese government \"will not accept a Taliban representative.\"\n\nBut Professor Maley says DFAT's official statement doesn't rule it out as an option in future .\n\n\"If one looks at the statement that was put out of the Foreign Affairs Department, it's rather slippery on that particular point. It didn't say that Australia will never accept a Taliban diplomat representative or honorary consulate, it said Australia has no intention of doing so. And of course that's the kind of wording that people use if they want later to be able to say, oh, well we didn't intend it at the time, but we changed our minds.\"\n\nMs Zahid says she's firmly against the prospect of Australia accepting a Taliban representative as a diplomatic figurehead.\n\n“I'd be more than upset and women like me in communities that are very much against having that kind of mind-set and ideologies to represent us. That would be a big no for us. And I'm sure we can at least rust this promise from our government, that our embassy will not be controlled or represented by those views.\"\n\nHowever, not everyone is opposed to the idea.\n\nFazal Katawazai, a former Afghan diplomat in Australia, says a relationship should be established to avoid further practical issues for Afghan Australians.\n\n\"The closure will create significant practical hurdles for Afghan Australians planning to visit Afghanistan. And also the travel documents, passport problems. In some extent, I think Australia need to have some kind of consular relationship as an honorary consular in Australia with the existing Taliban government.\"\n\nNeither the Australian government nor the embassy have outlined how Afghan citizens will receive essential consular services.\n\nErfan Abidi is the founder of an underground network of schools for girls in Afghanistan, and an active member of the Afghan community in Adelaide.\n\nHe told SBS Pashto for his community, the decision to close the embassy is about much more than being able to travel back to Afghanistan.\n\n\"For many Afghans in Australia, the Afghanistan embassy is more than an office. It is a wider symbol of identity, dignity, and connection to your homeland. It has also been the only official space where Afghans, particularly Afghan women, could raise their voices, share their concerns, and advocate for their rights. The panned closure feels like another fall of Afghanistan, but this time in exile, not in Afghanistan.\"",
        "source": "SBS"
    },
    {
        "url": "https://www.theage.com.au/sport/rugby-union/how-queenslanders-can-experience-once-in-a-generation-opportunity-20260203-p5nz4t.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "How Queenslanders can experience ‘once-in-a-generation opportunity’",
        "publish_date": "Tue, 03 Feb 2026 13:24:13 +1100",
        "category": "sports",
        "authors": [
            "Nick Wright"
        ],
        "text": "Wallabies halfback Tate McDermott says incoming national coach Les Kiss has enough time to transform Australia into a Rugby World Cup contender, as the schedule for the 2027 showcase on home soil has been revealed.\n\nQueensland has been locked in for 14 fixtures across the six-week tournament – 10 in Brisbane and four in Townsville.\n\nThe Wallabies failed to make it out of the group stages for the first time in their history at the last World Cup, leading to Eddie Jones’ departure as head coach.\n\nTate McDermott’s hamstring injury is expected to force him to miss a large chunk of the Queensland Reds’ preseason. Credit: Getty Images\n\nMcDermott, who featured in that squad, admitted there was a lingering thought of retribution fuelling their runway until their tournament launches in Perth on October 1, 2027, against Hong Kong.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/queensland/missing-link-in-riverside-path-reopens-after-three-years-20260203-p5nz3k.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Missing link in riverside path reopens after three years",
        "publish_date": "Tue, 03 Feb 2026 13:07:14 +1100",
        "category": "finance",
        "authors": [
            "Brittney Deguara"
        ],
        "text": "Advertisement\n\nNationalQueenslandCity life Missing link in riverside path reopens after three years Brittney Deguara February 3, 2026 — 1:07pm Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share A A A\n\nA key section of Brisbane’s Riverwalk has reopened, marking a milestone for the city and the revitalisation of the flood-prone CBD stretch. With the backdrop of the Story Bridge, the ribbon was cut on Tuesday by Lord Mayor Adrian Schrinner and representatives of Dexus to officially open the Riverwalk following a three-year, $42 million transformation. The 256-metre stretch from Charlotte Street to Alice Street creates a continuous walking and cycling route from the Story Bridge at Howard Smith Wharves to the Botanic Gardens. Lord Mayor Adrian Schrinner was among the group officially reopening the Riverwalk on Tuesday. Brittney Deguara “You couldn’t imagine Brisbane without the Riverwalk, just like you couldn’t imagine Brisbane without the CityCats and the Story Bridge,” Schrinner said.\n\nAdvertisement\n\nHe said the council contributed $22 million to the project to upgrade it from a narrow section of path to the wide, flood-resilient promenade, but the “lion’s share” came from Dexus. “This is the section that I have no doubt tourists in 2032 will be flocking to as this whole precinct is activated. This is about making sure that Brisbane embraces its river,” Schrinner said. He said ratepayers were getting “bang for their buck” through the funding partnership with Dexus, and that paying for the project in full would have cost the council tens of millions of dollars. The section has been fenced off since 2023, while work was done at the multibillion-dollar Waterfront Brisbane site, which will boast retail tenancies.\n\nAdvertisement\n\nThe entire project was scheduled to open in 2027, but was delayed last year owing to construction complexities and bad weather. “For [Dexus] to keep ploughing ahead and delivering this great outcome against the odds is a fantastic outcome,” Schrinner said. Schrinner walking the new path with Dexus chief executive Ross Du Vernet and project director for Waterfront Brisbane Matthew Beasley. Brittney Deguara “I’m more interested in what it does for the community rather than whether there [were] a few delays suffered. “For generations to come, people will forget about the extra few months it took, and they’ll remember the great outcome that’s been delivered.”\n\nAdvertisement\n\nLocals Wayne and Cathy Jeffries were among the first pedestrians to walk along the new path. “I think after the floods they had to do something to bring it back, and looking forward, we’ve got the Olympic Games coming up, so you’ve got to make it look impressive for all the overseas guests,” Wayne said. Wayne and Cathy Jeffries said they would use the walkway every couple of months when they ventured into the city. Brittney Deguara “It’s great to see Brisbane progress and the new Kangaroo Point Bridge as well, and lovely new restaurants around the city, Queen’s Wharf ... it is the place to be,” Cathy added. The passage has been rebuilt with new paths and banisters, and three local street artists painted a Brisbane-themed mural at the start of the walkway in three days.\n\nAdvertisement\n\n“It’s a great aquatic theme, which is appropriate for a river city and a city based on Moreton Bay,” Schrinner said. Waterfront Brisbane will eventually comprise two new office towers, shops, restaurants and public space. The aquatic-themed mural at Brisbane’s Riverwalk took just three days to complete. Brittney Deguara It is expected to be ready in late 2028, with construction costs totalling an estimated $2.5 billion. With William Davis Start the day with a summary of the day’s most important and interesting stories, analysis and insights. Sign up for our Morning Edition newsletter.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/business/markets/asx-set-to-jump-on-rba-day-as-wall-street-rebounds-gold-silver-swing-oil-dives-20260203-p5nz0b.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "ASX jumps ahead of RBA rates call; Musk merges xAI, SpaceX to create $1.8 trillion giant",
        "publish_date": "Tue, 03 Feb 2026 12:51:10 +1100",
        "category": "finance",
        "authors": [
            "Staff Reporter"
        ],
        "text": "Advertisement\n\nUpdated BusinessMarketsWorld markets ASX jumps ahead of RBA rates call; Musk merges xAI, SpaceX to create $1.8 trillion giant Staff reporter Updated February 3, 2026 — 12:51pm ,first published February 3, 2026 — 5:16am Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share A A A\n\nThe Australian sharemarket has surged higher with mining stocks recovering some of Monday’s losses in early trade, while investors are eagerly awaiting the RBA’s decision on interest rates this afternoon. The S&P/ASX 200 was up 102.8 points, or 1.2 per cent, at 8881.4 at 10.37am AEDT, with 10 of 11 industry sectors in positive territory. Only energy stocks are in the red after oil prices slumped overnight. Wall Street ended its three-day losing streak. Bloomberg The Reserve Bank announces its interest rate decision at 2.30pm AEDT today, with markets predicting rise of 0.25 percentage point in the cash rate, which would be the first hike in more than two years. The Australian dollar was trading at US69.69¢ at 12.30pm AEDT. Mining stocks bounced higher, with gold miners Northern Star (up 3.6 per cent) and Evolution Mining (up 5.2 per cent) clawing back some of Monday’s heavy losses as gold and silver prices were again in focus overnight. Gold prices rose 1.8 per cent while silver prices climbed 5.9 per cent. BHP jumped 2 per cent while Rio Tinto surged 2.6 per cent and Fortescue climbed 0.8 per cent. South32 rose 2.3 per cent.\n\nAdvertisement\n\nRelated Article Opinion\n\nScandal Why this charismatic corporate salesman’s reign came to an end Elizabeth Knight Business columnist Financial stocks shed some early gains but remain solidly in the green, with Commonwealth Bank rising 0.6 per cent, Westpac up 0.9 per cent, National Australia Bank climbing 0.7 per cent and ANZ Bank advancing 0.6 per cent in early trade. Macquarie Group rose 2.2 per cent. Energy stocks are mixed as oil prices steadied this morning after dropping more than 4 per cent overnight after US President Donald Trump told reporters that Iran is “seriously talking to us.” It’s a potential signal of improving relations between the two countries, which could keep oil flowing easily around the world. Woodside Energy edged up 0.2 per cent, Santos lost 0.3 per cent and Yancoal rose 0.5 per cent. In other news, Elon Musk’s SpaceX has acquired xAI, in a deal that encompasses the billionaire’s increasingly costly ambitions to dominate artificial intelligence and space exploration. The transaction was announced in a statement on SpaceX’s website signed by Musk and confirming an earlier Bloomberg News report. The deal, which gives the combined company a valuation of $US1.25 trillion ($1.8 trillion), was announced to employees in a memo on Monday, Bloomberg News reported earlier.\n\nAdvertisement\n\nOvernight on Wall Street, the S&P 500 added 0.5 per cent and snapped a three-day losing streak. The Dow Jones rose 515 points, or 1.1 per cent, and the Nasdaq composite gained 0.6 per cent. Related Article Opinion\n\nFederal Reserve Trump’s hand-picked man may not do his bidding Stephen Bartholomeusz Senior business columnist Elsewhere, the US and India reached a trade agreement cutting tariffs on Indian goods, Donald Trump announced, deescalating tensions between the two countries. Trump said Monday that he would lower his 25 per cent tariff on Indian goods to 18 per cent after Prime Minister Narendra Modi agreed during a phone call to stop buying Russian oil. On Wall Street, Sandisk leaped 15.4 per cent to lead the S&P 500. The data-storage company added to its 6.9 per cent gain from Friday, after it reported stronger profit for the latest quarter than analysts expected. It credited demand created by the artificial-intelligence boom, among other things. That helped offset a 2.9 per cent drop for Nvidia, whose chips are powering much of the world’s move into AI technology.\n\nAdvertisement\n\nWith AP The Market Recap newsletter is a wrap of the day’s trading. Get it each weekday afternoon.\n\nSave You have reached your maximum number of saved items. Remove items from your saved list to add more. Share More: World markets\n\nWall Street\n\nShares",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/how-much-does-it-cost-to-travel-australia-full-time-in-a-caravan-20260203-p5nz66.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "How much does it cost to travel Australia full-time in a caravan?",
        "publish_date": "Tue, 03 Feb 2026 12:49:23 +1100",
        "category": "finance",
        "authors": [],
        "text": "How much does it cost to travel Australia full-time in a caravan?\n\nAustralian couple Jess and Allan reveal how much it really costs to travel around the country in a caravan after several years on the road.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/world/painting-on-wall-of-chapel-that-resembles-premier-giorgia-meloni-creates-uproar-in-rome-20260203-p5nz5f.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Painting on wall of chapel that resembles premier Giorgia Meloni creates uproar in Rome",
        "publish_date": "Tue, 03 Feb 2026 12:49:06 +1100",
        "category": "finance",
        "authors": [],
        "text": "Remove items from your saved list to add more.\n\nYou have reached your maximum number of saved items.\n\nSave this video for later\n\nAdd videos to your saved list and come back to them anytime.\n\nGot it",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/traveller/inspiration/the-best-places-to-stay-in-cairns-20230619-p5dhlq.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "The best places to stay in Cairns",
        "publish_date": "Tue, 03 Feb 2026 12:42:19 +1100",
        "category": "finance",
        "authors": [
            "Angela Saurine"
        ],
        "text": "Advertisement\n\nInspirationCairns The best places to stay in Cairns Angela Saurine Updated February 3, 2026 — 12:42pm ,first published July 12, 2023 — 11:21am Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share A A A\n\nThis article is part of Traveller’s Destination Guide to Cairns. See all stories .\n\nA $600 million investment has transformed this Far North Queensland gateway to the Great Barrier Reef. Long known as a backpacker town, Cairns’ cool factor has skyrocketed in recent years. A $600 million investment by Syrian billionaire Ghassan Aboud, who’s opened three slick and sustainable Crystalbrook Collection hotels in the city since 2018, gave the city a much-needed boost, with many other revamps and refurbishments following in their wake. CAIRNS Novotel Cairns Oasis Resort Get into the holiday groove at Novotel Cairns Oasis Resort.\n\nAdvertisement\n\nPerfect for: Families with young kids, leisure seekers, business travellers Sign up for the Traveller Deals newsletter Get exclusive travel deals delivered straight to your inbox. Sign up now. With the only swim-up pool bar in Cairns and a large, lagoon-style pool with a sandy beach, it’s easy to slip into the holiday groove at this refurbished resort. Kids quickly make friends playing with the supplied beach toys, while parents lie back in a cabana or on a day bed sipping mojitos and margaritas. The resort underwent a multi-million-dollar transformation in 2019, refreshing its 314 rooms and suites, plus Moku Bar and Grill restaurant and Moku Beach Club. From $220 a night. 122 Lake St, Cairns. Phone: (07) 4080 1888. See novotelcairnsresort.com.au Crystalbrook Riley Riley’s 1000-square-metre lagoon pool.\n\nAdvertisement\n\nPerfect for: Instagrammers, eco-conscious travellers, families The first of three cool and sustainably focused Crystalbrook Collection hotels to open in Cairns – followed by the arty Bailey and fun and centrally located Flynn – this luxury hotel’s 12-storey tower is instantly recognisable on the city skyline. Its 1000-square-metre pool with a man-made beach makes it a great option for families. Dine on the Esplanade at its Asian fusion restaurant, Paper Crane; soak up the vibe at tropical rum bar and seafood kitchen Calypso Club, and take in the sensational views from one of the city’s highest rooftop bars, Rocco. From $349 a night. 131/141 Esplanade, Cairns. Phone: (07) 4252 7777. See crystalbrookcollection.com/riley Mercure Cairns This budget-friendly resort is made for the tropics.\n\nAdvertisement\n\nPerfect for: Budget-conscious travellers who like a splash of style This stylish four-star hotel is within cooee of several key attractions, including Cairns Aquarium and Cairns Performing Arts Centre, just a couple of blocks back from the Esplanade. The one-time Hotel Ibis Styles reopened in early 2022 after a stylish makeover, with its Queenslander-style architecture and cane furniture with palm-print cushions in the lobby quickly evoking a feeling of being in the tropics. The 75-room hotel’s tiered pool and tiled deck, complete with round wicker day-beds, is an inviting place to rejuvenate after a day’s sightseeing. From $179 a night. 15 Florence St, Cairns. Phone: (07) 4051 5733. See all.accor.com Shangri-La The Marina, Cairns As close as it gets … Shangri-La, The Marina overlooks Marlin Marina.\n\nAdvertisement\n\nPerfect for: Families and couples heading to the reef, solo travellers, business travellers As the closest accommodation you can get to Marlin Marina – where boats depart for the Great Barrier Reef – you can confidently hit the snooze button at least once before a must-do day trip when staying at this hotel. Many of its 255 rooms and suites offer views over the marina or Trinity Inlet, as does its produce-focused restaurant, The Backyard. There’s also a pool with a sun deck and a bar serving meals in biodegradable and recyclable cardboard packaging. From $250. Pier Point Rd, Cairns. Phone: (07) 4052 7500. See shangri-la.com Cairns Harbourside Hotel Great value on the Esplanade … The Cairns Harbourside Hotel.\n\nAdvertisement\n\nPerfect for: Families on a budget, business travellers When it comes to affordability and location, this hotel on Cairns Esplanade is hard to beat. The former Holiday Inn is just five minutes’ drive from the airport, and about 25 minutes’ walk along the boardwalk into the centre of town – or you can jump on the free shuttle bus. Each of its 173 rooms and suites has a balcony, and there’s a pool and a fresh, flower-filled restaurant, Harbourside Bar & Kitchen. And as a bonus for families, kids 12 and under stay and eat for free. From $180 a night. 209-217 Esplanade, Cairns. Phone: (07) 4080 3000. See cairnsharboursidehotel.com.au Little Drifter Cairns A bunk room at Little Drifter Cairns.\n\nAdvertisement\n\nPerfect for: Budget-conscious travellers After a multimillion-dollar revamp in early 2025, Little Drifter brings a smart and affordable stay close to the action. Previously known as The Village Cairns, the 54-room property, offers a mix of smart dorm-style digs and stylish private rooms. Interiors lean playful and punchy, with communal spaces designed for connection and relaxation. There’s a fully equipped kitchen, a cosy TV lounge, laundry facilities and free Wi-Fi add to its appeal. From $60 a night for a shared bunk suite and $150 per night for a private queen room. 1/7 Shields St, Cairns. Phone: 1800 180 288. See thedrifter.com/cairns Alivio Hotel Cairns The revamped pool deck area at Alivio Hotel Cairns.\n\nAdvertisement\n\nPerfect for: Style-seekers wanting fresh, eco-friendly luxury Cairns’ long-standing Sunshine Tower Hotel has been reborn as the Alivio Hotel Cairns following a top-to-toe refurbishment by the award-winning Alivio Group. The 61-room property on Sheridan Street now sports a fresh, contemporary look, complete with a Mediterranean-inspired pool surrounded by flowering frangipanis. The lobby and dining area showcase photographic feature walls that capture the spirit of Tropical North Queensland. Rooms offer views across the hinterland or the manicured gardens, with new glass balustrades adding a modern edge to private balconies. The Lobby Bar and Kitchen serves up light fare and cocktails in a relaxed setting. Sustainability has also had a moment, with the installation of a 100kW solar system. From $199. 136 Sheridan St, Cairns. Phone: (07) 4041 1133. See aliviohotelcairns.com.au BIG4 Ingenia Holidays Cairns Coconut Resort BIG4 Ingenia Holidays Cairns Coconut Resort’s playground and water park.\n\nAdvertisement\n\nPerfect for: Fun-loving families\n\nThe kids will love racing each other down dual waterslides into the pool, frolicking in the splash park and riding pedal carts around this epic holiday park, around seven minutes’ drive from Cairns. The pet-friendly holiday park offers accommodation for every budget, including villas, cabins, condos and caravan and camping sites. With resort-style pools, a playground, jumping pillows, mini golf, basketball court, tennis court and activities like outdoor movies, you’ll have to drag the offspring away to see the Great Barrier Reef. From $149 a night. 23-51 Anderson Rd, Woree. Phone (07): 4054 6644. See ingeniaholidays.com.au PORT DOUGLAS Silky Oaks Lodge One of the bedrooms at Silky Oaks Lodge. Tourism and Events Queensland\n\nAdvertisement\n\nPerfect for: A romantic getaway or special celebration Imagine swaying in a hammock on the deck of your private villa listening to the sounds of the Daintree Rainforest. Or soaking in your outdoor bath as you gaze out at the treetops. Or watching the trickling waters of the Mossman River from the open-air pavilion Jungle Perch as you enjoy a sunset drink before dining in the Treehouse Restaurant. These are the kind of experiences you can expect at this uber-luxury retreat at Mossman, north of Port Douglas. From $1200 a night. 423 Finlayvale Rd, Mossman. Phone: (07) 4098 1666. See silkyoakslodge.com.au Sheraton Grand Mirage Resort Port Douglas Two hectares of saltwater lagoon pools ... Sheraton Grand Mirage Resort in Port Douglas.\n\nAdvertisement\n\nPerfect for: Influencers out to impress on the ‘gram, families, couples Offering luxe experiences like the chance to step straight out of the pool onto the balcony of your room, a stay at this beachfront resort can feel more like being in Bali or the Maldives than Australia. Set among tropical gardens with its own golf course, the 295-room resort has a swim-up bar, a restaurant where you can watch your dinner being prepared in the open kitchen and a multi-award-winning Harrisons Restaurant. From $385 a night. 168-190 Port Douglas Rd, Port Douglas. Phone: (07) 4099 5888. See marriott.com Thala Beach Nature Reserve Eco accommodation among the trees at Thala Beach Nature Reserve.\n\nAdvertisement\n\nPerfect for: Nature-loving couples, special-occasion trips Embrace your inner naturalist with a stay among the treetops at this eco-retreat, about an hour’s drive north of Cairns and 15 minutes’ south of Port Douglas. Set on a former sugar cane farm with its own private beach and two free-form pools with rock waterfalls and grottos, it offers bungalow accommodation, with an open-air pavilion-style restaurant. Busy yourself with butterfly and nature walks and stargazing tours, or just lie in a hammock under a palm tree. From $562 a night. 5078 Captain Cook Hwy, Oak Beach, Port Douglas. Phone: (07) 4098 5700. See thalabeach.com.au PALM COVE The Reef House Adults Retreat Palm Cove\n\nAdvertisement\n\nRelax in the Tranquillity pool, serviced by a pool butler. Perfect for: Girls’ getaways, couples, wellness seekers, foodies Once the private residence of former federal minister Brigadier David Thomson, who hosted high-profile guests such as prime minister Gough Whitlam, this colonial-style, adults-only hotel is in the laid-back enclave of Palm Cove, around 30 minutes’ drive north of Cairns. Start the day with beachfront yoga, book a spa treatment, do a cocktail-making or wine-appreciation class, or just chill out by the Mineral or Tranquillity pools, where a pool butler delivers cold towels and sorbet. From $1029 for two. 99 Williams Esplanade, Palm Cove. Phone: (07) 4080 2600. See reefhouse.com.au Pullman Palm Cove Sea Temple Resort and Spa\n\nAdvertisement\n\nThe expansive lagoon pool at the Pullman Palm Cove Sea Temple Resort and Spa. Perfect for: Couples, families, spa lovers Set around an expansive pool with an even more inviting bar at the southern end of Palm Cove, this stylish resort makes an idyllic base for a tropical escape. Families love the modern, spacious apartments, while couples unwind with indulgent treatments at Vie Spa, romantic beach strolls and fire-lit dinners at poolside eatery Temple of Tastes, where Asian-inspired dishes are expertly crafted with fresh local produce. From $299 a night. 5 Triton St, Palm Cove. Phone: (07) 4059 9600. See pullmanpalmcove.com.au ISLANDS\n\nAdvertisement\n\nFitzroy Island Resort This affordable island resort is just a 45-minute boat ride from Cairns. Perfect for: Conservation-minded holidaymakers, budget-conscious families, groups of friends Pssst … want to know a secret? There’s an affordable resort on a tropical island just a 45-minute boat ride from Cairns with one of the most beautiful patches of sand you are ever likely to come across, Nudey Beach (not to be taken literally). The island is also home to a turtle rehabilitation centre, and guests can book citizen science tours with marine biologists and see coral nurseries being grown to help restore the Great Barrier Reef just offshore. From $185 a night. Fitzroy Island, Queensland. Phone: (07) 4044 6700. See fitzroyisland.com\n\nAdvertisement\n\nBedarra Island Resort One of the Pavilion villas with private plunge pool at Bedarra Island Resort. Perfect for: Honeymooners, privacy-seeking couples, luxury lovers Secluded, serene and strictly adults-only, Bedarra Island Resort is the epitome of barefoot luxury. The only resort on the island, just off the coast of Mission Beach, the boutique, all-inclusive property has just 12 private villas built around natural boulders overlooking the Coral Sea. Spend your days snorkelling in the stinger-free waters, paddling to private beaches and enjoying intimate dinners on private decks. But while it’s super exclusive, it’s also highly social, with guests gathering around a circular table at the bar for pre-dinner drinks each night. From $1690 a night. Bedarra Island. Phone: (07) 4068 8233. See bedarra.com.au\n\nAdvertisement\n\nLizard Island Resort All-inclusive luxury … Lizard Island Resort. Perfect for: Honeymooners, cashed-up nature lovers, baby boomers spending the kids’ inheritance This exclusive resort on Lizard Island at the northern end of the Great Barrier Reef is the stuff dreams are made of. It has 40 suites and villas – some with their own plunge pool – and a fine-dining waterfront restaurant. Order a hamper, borrow a dinghy and motor to a private beach for a picnic lunch, climb to Cook’s Lookout to take in the panoramic views, and check out the Australian Museum Lizard Island Research Station. From $2516 for two per night. Lizard Island, Queensland. Phone: 1800 867 169. See lizardisland.com.au\n\nAdvertisement\n\nThe Elandra Mission Beach The clifftop pool at The Elandra. Related Article Cairns The best places to stay in Cairns Perfect for: Boutique lovers, couples, destination wedding guests, privacy seekers Set high above the Coral Sea on a rainforest-cloaked hill, The Elandra on South Mission Beach is a dreamy tropical hideaway just a short drive from the hideaway of Mission Beach, about two hours’ drive south of Cairns. Once a glamorous celebrity haunt that fell into disrepair, the resort has been lovingly revived by the owners of Bedarra Island Resort. It now offers just a handful of beautifully refurbished, whitewashed suites. Days begin with yoga and end by the dazzling infinity pool, cocktail in hand. It’s intimate, exclusive and effortlessly chic – perfect for romantic getaways or show-stopping destination weddings. From $590 a night. 23 Explorers Dr, South Mission Beach. Phone: (07) 4054 9300. See elandraresorts.com\n\nTraveller Guides",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/goodfood/melbourne-eating-out/niagra-lane-cafe-tori-s-opens-a-second-cbd-location-with-a-new-exclusive-cloud-matcha-20260203-p5nz59.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Niagra Lane cafe Tori’s opens a second CBD location (with a new exclusive cloud matcha)",
        "publish_date": "Tue, 03 Feb 2026 12:29:51 +1100",
        "category": "finance",
        "authors": [
            "Tomas Telegramma"
        ],
        "text": "Add articles to your saved list and come back to them anytime.\n\nSave this article for later\n\nRemove items from your saved list to add more.\n\nYou have reached your maximum number of saved items.\n\nHead to the new Exhibition Street spot for new items including bagels, pretzels and more.\n\n1 / 6 Matcha and desserts reign at Tori’s second location on Exhibition Street. Supplied 2 / 6 Outside the new Tori’s. Supplied 3 / 6 Desserts are king. Supplied 4 / 6 Specialty iced drinks including matcha are on offer. Supplied 5 / 6 Tori’s is known for its cheesecake. Supplied 6 / 6 Earl Grey cloud matcha. Supplied Previous Slide Next Slide\n\nBakery$$$$\n\nThe matcha mania got so real at Niagara Lane cafe Tori’s that the crew opened a second city spot. It’s slicker than the vintage-furniture-filled original, but the offering is similar. Matcha drinks (and desserts) still reign, including exclusives such as the Earl Grey or jasmine matcha, but bagels and pretzels have also joined the line-up.\n\nWant to visit this venue? Save it in the Good Food app.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/politics/federal/ley-reveals-fresh-offer-to-littleproud-including-benching-rebels-for-6-months-20260203-p5nz1i.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Ley reveals fresh demand to Littleproud, including benching rebels for six months",
        "publish_date": "Tue, 03 Feb 2026 12:04:50 +1100",
        "category": "finance",
        "authors": [
            "Paul Sakkal",
            "Nick Newling"
        ],
        "text": "Advertisement\n\nPoliticsFederalPolitical leadership Ley reveals fresh demand to Littleproud, including benching rebels for six months Paul Sakkal and Nick Newling Updated February 3, 2026 — 12:04pm ,first published February 3, 2026 — 10:25am Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share A A A\n\nNationals MPs who were sacked for breaching shadow cabinet solidarity would be benched for six months under a fresh demand put by Opposition Leader Sussan Ley to Nationals leader David Littleproud. The pair met on Monday night and held what both parties described as constructive talks to reform the Coalition after it blew apart last month over a dispute about shadow cabinet discipline. Opposition Leader Sussan Ley on Tuesday morning. Alex Ellinghausen Ley revealed the offer in a Liberal Party room on Tuesday morning. According to sources in the room, Ley said the offer she made to Littleproud included that the three senators who resigned from the shadow cabinet a fortnight ago after crossing the floor would not be eligible to sit on the frontbench until July.\n\nAdvertisement\n\nHer second demand was that shadow cabinet solidarity be reaffirmed by both parties. The backbench party rooms of both parties would not be able to overturn decisions made by the shadow cabinet, a point that was queried by two conservative MPs who raised concerns about the party room’s right to have its say on party policy. These first two demands were put to Littleproud as non-negotiable by Ley, according to party sources. Opposition leader Sussan Ley addresses the media this morning. Alex Ellinghausen The Nationals expressed frustration that Ley’s offer leaked out to the media before its own MPs were briefed on the offer. Littleproud released a statement at midday saying he would take his time to respond. “As per media reports, the Nationals have received a written offer from the Liberal Party,” he said. “We will take our time to consider the details.\n\nAdvertisement\n\n“The Nationals are united in our endeavours to reset the Coalition, but we won’t be providing updates on any negotiations through the media.” As secondary requests, the Liberals would also reclaim the shadow assistant treasurer portfolio from the Nationals, with the skills portfolio given back in return. The Liberals covet the assistant treasurer portfolio because it takes in important policy areas such as superannuation. Nationals leader David Littleproud at the traditional pre-parliament church service on Tuesday morning. Alex Ellinghausen The Nationals would be able to pick three other MPs to fill the frontbench spots left by the resignations of Bridget McKenzie, Ross Cadell and Susan McDonald. Pressure has intensified on Littleproud this week as his own MPs backed a motion to get the Coalition back together, weeks after Liberals blamed him for recklessly allowing his party to vote against Labor’s post-Bondi hate speech laws despite the shadow cabinet agreeing to back it.\n\nAdvertisement\n\nBut both Littleproud and Ley have boxed themselves in, with Littleproud taking a hard line on a demand to reinstate the three frontbenchers who resigned last month, which Ley and her party room oppose, and also seeking greater flexibility for Nationals to cross the floor. While announcing the split 12 days ago, Littleproud said that the Nationals “cannot be part of a shadow ministry under Sussan Ley”, so any reconciliation would be a major backdown for the Nationals leader. Many MPs in both parties would like to see the two parties rejoin, even though some Moderate Liberals are keen to remain apart so that the Liberals can focus on city voters. Queensland backbencher Terry Young argued the split should be long-lasting. One Liberal MP said after Ley’s briefing that the Nationals were “parasitic” as the regional party “see the relationship with the Liberal Party as a way to enrich themselves” rather than achieve mutual success. “Many Liberals believe that are an unworthy coalition partner. Until they adopt a new mind set we are better off without them dragging us down to their level of mediocrity,” said the MP, who spoke off the record to be candid.\n\nAdvertisement\n\nPrime Minister Anthony Albanese and Opposition leader Sussan Ley take their seats for an ecumenical service for the commencement of Parliament at St Paul’s Anglican Church in Canberra. Alex Ellinghausen “David Littleproud is no longer credible as a leader and a parliamentarian. He should consider his future,” the MP said. “Preferably a vocation that does not require any form of relationship management.” This masthead reported on Monday that Ley’s allies, battling to stave off a challenge from leadership rival Angus Taylor, were asking MPs to keep Ley in the job until at least the time of the federal budget in May. Speaking outside a church service to mark the opening of parliament on Tuesday, Ley said: “Very confident of delivering a strong budget in reply speech in May.” “Lots of work between now and May because we have a big agenda to prosecute,” she said, adding that talks with Littleproud had been positive.\n\nAdvertisement\n\nLittleproud retained his position after facing a failed leadership challenge from rogue Nationals MP Colin Boyce on Monday. The Nationals leader said conversations last night between the two had been “positive” but did not end in the Coalition re-forming. Nationals MP Darren Chester, who has been pushing Littleproud to soften and reunite with Ley, said on Tuesday that the Liberals could not determine who the Nationals appointed to the frontbench. “I would have thought the leaders of both teams would choose their best performers in their eyes, to be on the shadow ministry, in the shadow cabinet. So that’s really a conversation they need to have behind closed doors,” he said on ABC Radio National. Cut through the noise of federal politics with news, views and expert analysis. Subscribers can sign up to our weekly Inside Politics newsletter.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/politics/federal/the-latest-illustrations-from-artist-simon-letch-20230608-p5df4g.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "The latest illustrations from artist Simon Letch",
        "publish_date": "Tue, 03 Feb 2026 12:04:33 +1100",
        "category": "finance",
        "authors": [],
        "text": "Remove items from your saved list to add more.\n\nYou have reached your maximum number of saved items.\n\nSave this gallery for later\n\nAdd galleries to your saved list and come back to them anytime.\n\nGot it",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/politics/federal/the-labor-minister-who-was-canadian-for-two-weeks-despite-trying-not-to-be-20260202-p5nyzx.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "The Labor minister who was Canadian for two weeks, despite trying not to be",
        "publish_date": "Tue, 03 Feb 2026 11:57:33 +1100",
        "category": "finance",
        "authors": [
            "James Massola"
        ],
        "text": "Advertisement\n\nExclusive PoliticsFederalCitizenship crisis The Labor minister who was Canadian for two weeks, despite trying not to be James Massola February 3, 2026 — 11:57am Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share A A A\n\nIndustry and Science Minister Tim Ayres was a Canadian citizen for two weeks in December after that country changed its citizenship laws, in a potential breach of section 44 of the Constitution. Ayres notified the federal parliament on Tuesday that, following a legal change late last year that extended Canadian citizenship eligibility to the grandchildren of people born in the country, he had involuntarily become a dual citizen. Minister for Industry and Innovation Tim Ayres. Alex Ellinghausen The episode revived memories of the federal parliament’s so-called constitutional crisis in 2017. Starting in July that year, a number of senators and members were disqualified from sitting in the federal parliament because they had failed to renounce or were eligible to hold citizenship of a second country, which they had failed to renounce. It eventually led to the disqualification of 15 MPs, including then-deputy prime minister Barnaby Joyce, now-Greens leader Larissa Waters and the current Finance Minister Katy Gallagher.\n\nAdvertisement\n\nPrior to his election in 2019, Ayres took all possible steps to renounce his Canadian citizenship by descent, but was told at the time by the Canadian government that he had nothing to renounce as he was not eligible for citizenship. Related Article Live\n\nNational News Live Australia news LIVE: RBA interest rate decision today; Cory Bernardi recruited by One Nation as Ley, Littleproud fail to reach Coalition resolution But that changed in June last year when laws were introduced into the Canadian parliament to expand the right to citizenship, automatically, to anyone born to a Canadian parent and, in many cases, grandparent. The Canadian parliament made the changes to its citizenship laws after a 2023 court decision found that the country’s laws, which limited citizenship by descent, were unconstitutional. After the laws to reclaim so-called “lost Canadians” were introduced into the nation’s parliament in June 2025, but before they came into effect on December 15 last year, Ayres sought advice from the Canadian government about how to renounce his citizenship, but was told he could not pre-renounce his dual citizenship.\n\nAdvertisement\n\nAyres also took advice from senior counsel, who told him that he was still eligible to be a senator and minister because “the implied qualification to s 44(i) of the Australian Constitution recognised by the High Court would prevent a newly enacted foreign law from disqualifying a sitting member of the Australian parliament”. Ayres’ lawyer also advised him to renounce his Canadian citizenship as quickly as possible, which he did. Ayres on December 10 last year, days before he involuntarily became a Canadian citizen. Dominic Lorrimer It was not until Bill C-3, as the law is known, came into effect on December 15 that Ayres could renounce his Canadian citizenship. The very next day, he contacted the Canadian government and was advised that he could finally renounce his citizenship of that country. The process took two weeks, according to a letter dated December 29 from the director-general of the Canadian passport office in Ottawa.\n\nAdvertisement\n\nThat letter states that “this document confirms that your application to renounce Canadian citizenship that was automatically conferred on you by operation of Canadian citizenship law was approved and you ceased to be a Canadian citizen on December 29, 2025”. “As this document attests that you ceased to be a Canadian citizen, we suggest that you keep this document in a secure place for future reference.” Ayres became a Canadian citizen because his grandfather was born in Canada in 1910, and was at that time a British subject. His grandfather later moved to Australia, and his father was born in Australia. The law change conferred Canadian citizenship on his father and, retrospectively, on the minister when the law change took effect. Ayres is one of Prime Minister Anthony Albanese’s most trusted lieutenants and a key powerbroker in the party’s left faction. He told this masthead that while grandfather was born in Canada, he had taken all steps possible to ensure before the 2019 and 2025 elections that he was only an Australian citizen and eligible to sit in parliament.\n\nAdvertisement\n\nEditor's pick Political leadership Ley reveals fresh demand to Littleproud, including benching rebels for six months “In December 2025, Canada’s Bill C-3 came into effect. As soon as the new Canadian law received Royal Assent, I established as soon as was legally possible that I was solely an Australian citizen,” he said. “The advice I have received from constitutional experts is clear: I have always been – and remain – eligible to sit in the parliament. I take my constitutional responsibilities seriously and today have made an addendum to my Qualification Checklist confirming that I remain not a Canadian citizen.” Professor Anne Twomey, a constitutional law expert at the University of Sydney, said previous High Court cases related to dual citizenship had not dealt with “the unusual case of a person being validly elected, but then, against their will, having foreign citizenship conferred upon them, and immediately renouncing it”. “If this matter came before a court, there would be a good case to argue that it fell within an exception from disqualification, just as an exception also arises where there is an irremediable impediment to renouncing foreign citizenship,” she said.\n\nAdvertisement\n\n“In practical terms, it is unlikely to come before a court, because it could only get there if the Senate referred it. Doing so would have no advantage, other than clarifying the law, because the senator could simply resign and then fill the resulting vacancy, as he is no longer a Canadian citizen.” Cut through the noise of federal politics with news, views and expert analysis. Subscribers can sign up to our weekly Inside Politics newsletter.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/business/markets/trump-s-vulnerable-america-is-a-target-for-china-20260203-p5nz1o.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Trump’s vulnerable America is a target for China",
        "publish_date": "Tue, 03 Feb 2026 11:57:05 +1100",
        "category": "finance",
        "authors": [
            "Stephen Bartholomeusz"
        ],
        "text": "Advertisement\n\nBusinessMarketsCurrencies Opinion Trump’s vulnerable America is a target for China Stephen Bartholomeusz Senior business columnist February 3, 2026 — 11:57am\n\nFebruary 3, 2026 — 11:57am Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share A A A\n\nWhy did the Chinese Communist Party’s flagship publication publish at the weekend comments made by Xi Jinping back in 2024? The obvious answer, given that their publication would have had to be made with Xi’s approval, is that he sees an opportunity as the “Sell America” trade gains traction. Trump’s chaotic policymaking is causing significant levels of distrust in America and its future. Getty The remarks published in Qiushi magazine focus on the role China’s renminbi can play in global trade and foreign exchange markets, with Xi posing the rhetorical question of “What constitutes a strong financial nation?” “First, it should have a powerful currency, widely used in international trade, investment and foreign exchange markets, holding the status of a global reserve currency,” he answered.\n\nAdvertisement\n\nTo achieve those objectives, China would need a powerful central bank capable of effective monetary management, globally competitive financial institutions and international financial centres able to attract global capital and exert influence over global pricing, he said. Xi’s ambition of internationalising China’s currency isn’t recent or secret. Related Article Opinion\n\nFederal Reserve Trump’s hand-picked man may not do his bidding Stephen Bartholomeusz Senior business columnist In recent years, it has accelerated its push to have the renminbi used as at least one side of trade transactions and has been doing that increasingly in trade with Russia, Iran, India, the Middle East and South American and African countries. About a third of its bilateral trade is now settled in renminbi. The recent stand-off with BHP, where China refused to allow the company to land some of its iron ore unless the trade was settled in renminbi, was a sign of a new willingness to use strong-arm tactics to coerce counterparties into using its currency.\n\nAdvertisement\n\nIt’s also built the payments infrastructure – its Cross-Border Interbank Payment System – to clear and settle international transactions in renminbi, to promote its internationalisation and to reduce reliance on the US dollar and the dominant US-dominated SWIFT financial messaging system. So, why dust off an old speech to articulate a previously largely unspoken but widely recognised ambition? With governance in the US apparently dysfunctional, its traditional allies unsettled and fearful and investors, governments starting to reduce their exposure to treasury markets and an economy whose settings are no longer regarded as risk-free, Xi senses a moment. Bloomberg It’s because the US and the US dollar appear vulnerable. Donald Trump’s chaotic policymaking, the international hostility and distrust generated by his trade war on the rest of the world, his assaults on multinational and domestic institutions, his threats to seize the territory of a NATO ally, his kidnapping of another country’s president, his disdain for the US Constitution and domestic laws, his attack of the Federal Reserve board’s independence, the accelerating build-up of US government debt and a fear that the administration is going to monetise that debt through money-printing and dollar depreciation are causing significant levels of distrust in America and its future.\n\nAdvertisement\n\nThe demonstrated effect of the US-led seizure of Russian foreign exchange reserves at the onset of the war in Ukraine is another reason for foreign governments and their central banks to look for alternatives which, at the moment, appear to be largely a switch from US assets to gold. Central banks have doubled their purchases of gold since the seizure of Russia’s reserves on 2022. In the post-war era, the US dollar and the US Treasury securities market have been regarded as the world’s “safe havens”, but their status has been eroding since Trump first took office in 2017 and has deteriorated in the first year of his second term. It is reflected starkly in a depreciation of the dollar approaching 11 per cent against the basket of America’s major trading partners since Trump’s inauguration last year. Last week, Trump said he welcomed that decline.\n\nAdvertisement\n\n“I think it’s great. Look at the business we’re doing. The dollar’s doing great,” he said. A weaker dollar makes US exports more competitive abroad. His Treasury Secretary, Scott Bessent, immediately tried to walk those comments back, saying America remained committed to a strong-dollar policy. “If we have sound policies, the money will flow in,” he said. That is, of course, a big “if,” given the nature of Trump’s policies to date. Xi’s ambition of internationalising China’s currency isn’t recent or secret. A concern for foreign investors in the US and central banks holding US dollar-denominated reserves is that the chairman of Trump’s council of economic advisers and his temporary appointee as a Fed board governor, Stephen Miran, authored a paper in 2024 which set out how to boost US exports and the US manufacturing sector, narrow its trade deficit and lower the cost of US government debt.\n\nAdvertisement\n\nThe key to the “Mar-a-Lago Accord”, as it has become known, is a controlled depreciation of the US dollar. While Miran seems to have envisaged a grand agreement with other countries to intervene in markets to achieve that objective, it’s been happening anyway, in an uncontrolled fashion – which might explain why Bessent was so quick to try to distance himself and US Treasury policy from Trump’s comments. For Miran’s thesis to work, if it could work, dollar depreciation would have to occur in a measured way over a significant period. The “Sell America” trade is gaining traction on markets. AP Igniting an exodus from US markets at a time when US government debt has surpassed $US38 trillion ($54.5 trillion) and is climbing – and when nearly half that debt will now roll over within two years because Bessent has replaced maturing longer-term bonds with lower interest cost Treasury bills and notes – would be a potentially destabilising and potentially crisis-inducing exercise.\n\nAdvertisement\n\nWith the US governance apparently dysfunctional, its traditional allies unsettled and fearful, investors and governments starting to reduce their exposure to Treasury markets and an economy whose settings are no longer regarded as risk-free, Xi senses a moment. Sensing it is one thing. Taking advantage of America’s moment of vulnerability is another. Related Article Analysis\n\nChina relations The 2027 question: Will Xi Jinping annex Taiwan this soon, or not? While the dollar’s share of foreign exchange transactions, trade and central bank reserves has been sliding, it still remains the dominant currency in global financial activity. It’s used in about 89 per cent of foreign-exchange transactions, about 60 per cent of global debt is denominated in dollars and 57 per cent of foreign exchange reserves are dollar-denominated. In contrast, China’s currency is used in fewer than 9 per cent of foreign exchange transactions and constitutes only 1.93 per cent of global reserves. The euro has a stronger position, used in about 29 per cent of FX transactions and is the currency for about 20 per cent of the world’s official reserves.\n\nAdvertisement\n\nTo ever challenge the dollar as a reserve currency, China would need to make very significant changes to its policy settings, changes that would probably be unpalatable to the Communist Party. A reserve currency needs to be completely freely traded, which requires an open capital account and a freely floating currency whose value is determined by the market. China has tight capital controls – cross-border transactions have to be approved by a government agency – and manages its exchange rate tightly to ensure its stability. Related Article Opinion\n\nTrump's White House Trump is pushing China and Europe together to create a new world order Xi isn’t going to relinquish control over his financial system so, even without the other features needed to achieve reserve currency status – transparent and trusted legal and judicial systems and deep and very liquid financial markets – his ambitions are unlikely to be realised within the forseeable future. China, and Europe, can, however, keep chipping away at the dollar’s dominance and the effective subsidies of borrowing costs and the US standard of living that the rest of the world provides America, if only to reduce their own vulnerabilities to the Trump-driven shifts in America’s relationship with the rest of the world. The Market Recap newsletter is a wrap of the day’s trading. Get it each weekday afternoon.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/kathy-lette-on-ageing-fabulously-and-giving-cheek-to-the-king-20260127-p5nx85.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Kathy Lette on ageing fabulously … and giving cheek to the King",
        "publish_date": "Tue, 03 Feb 2026 11:55:00 +1100",
        "category": "entertainment",
        "authors": [
            "Margot Saville"
        ],
        "text": "Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Share A A A\n\nI’m five minutes early to meet celebrated writer Kathy Lette at Crafted, the restaurant at the Art Gallery of NSW – and I’m feeling a little nervous. The previous evening, I’d watched her Australian Story profile – it ends with footage of a recent launch of one of her books, where she invites everyone to come up on stage and dance. She’s also famous for serving up a “Disco Diet” at her many London dinner parties, with participants bopping for hours after dessert. Would this lunch go the same way? As a founding member of Inhibited Anonymous – and the last person to join a Gloria Gaynor flashmob – I sincerely hope not. Suddenly, Lette arrives, dressed in a trademark brightly patterned frock with matching lipstick and a pair of stilettos. She has chosen the restaurant because the gallery is currently showing an exhibition of Australian women artists, which is firmly in her wheelhouse. I’m conscious she is going to visit her 91-year-old mother that afternoon, so we quickly peruse the menus and order what I call a “Standard Girl Lunch” – vegetables, fish and mineral water. Lette orders bottarga with crudite vegetables. The beetroot salad is calling me and we both order the barramundi. Kathy Lette says her mantra for her musician husband Brian O’Doherty is “that he adores me, doesn’t bore me, and does all my chores for me”. Photo: Sam Mooy I clearly radiate AA vibes as none of my lunchers ever orders a drink. Of course, eliciting personal secrets from interview subjects by getting them tipsy is a well-worn journalistic technique, but it turns out that here, it’s redundant. The 67-year-old author is quite capable of telling you her most intimate life stories – over a glass of water. Lette has been famous since 1979, when a book she co-wrote with the late Gabrielle Carey rocketed onto the Australian literary scene. Puberty Blues, about two very young women growing up in a surfer community in Cronulla, became a cause celebre for its graphic portrayals of underage sex and drug-taking, including heroin. Two years after publication, it was made into a movie directed by Bruce Beresford. Lette in 2021 at Elouera Beach, Cronulla, where the Puberty Blues movie based on her book was set. Photos: Louise Kennerley, Supplied\n\nAdvertisement\n\nHerald journalist Helen Pitt wrote about the movie on its 40th anniversary in 2021, saying it “was criticised for whitewashing the feminist themes of the book, in relation to rape, abortion and miscarriage ... The original movie shows a culture in which gang rape is incidental and unremarkable, and mindless violence is amusing. And yet it serves as a valuable timepiece”. I asked Lette, who grew up in Cronulla, how many of her 21 books were based on her own life. All of them, she says. “It’s cheaper than therapy – putting it on the page is a way of making sense of the drama. I’ve written about everything: being a single girl around town in Sydney, trying to find a man who wasn’t married or gay, moving to LA. I’ve written about pregnancy, motherhood, raising a teenage daughter, raising an autistic son. I’ve written about divorce, I’ve written about affairs, I’ve written about midlife trauma, and now I’m writing about women post-menopause, because I think that’s the most interesting time in a woman’s life.” The barramundi and spring vegetables. Kathy Lette’s order of bottarga with crudite vegetables. The heirloom beetroot salad with whipped sunflower seed, mustard greens and pieces of orange. Photos: Sam Mooy\n\nAdvertisement\n\nA woman’s 60s are liberating, she says. “We’ve had the marriages, the divorces, we’ve raised the children. We’ve had the betrayals, the affairs, the heartbreak, the backstabs, all of that and the financial ups and downs. That material is so rich. And women survive it with such a good sense of humour,” she says. Lette says hormones are key to women’s lives, joking that she’s book-ended her writing career with tomes about puberty and menopause. “I think women don’t come into their true selves till post-menopause, because women are brought up to be decorative and demure. But then after the menopause, when your estrogen drops, we no longer care what people think about us,” she says. “And so I just find women this age fabulous, funny, fascinating. I’m trying to encourage women my age to go forth and be fabulous because if not now, when?” The author is a generous interviewee, talking in long sentences that give me time to eat my heirloom beetroot salad, which has whipped sunflower seed, mustard greens and pieces of orange, and is absolutely scrumptious. She doesn’t have time to touch her entree of whipped cod roe, bottarga and crudites and asks to take it home to give to her partner, Irish-born musician Brian O’Doherty, whom she describes as a “brilliant cook”. We have both ordered the barramundi, which is on the menu as a special. It comes out as a thick wedge of beautifully tender fish topped with a crisp rectangle of skin, surrounded by a melange of mirepoix spring vegetables and crunchy seeds. For the thousandth time, I wonder why my own amateur kitchen offerings cannot achieve this perfect balance of textures and flavours.\n\nAdvertisement\n\nAfter a few mouthfuls, we return to a perennial topic – when are our unmarried offspring going to give us some grandchildren? Lette reveals that she has given her daughter a gift of egg freezing for her next birthday. She has written about it (with her daughter’s permission) for a British newspaper. The bill from Crafted, the restaurant at the Art Gallery of NSW. “I used to think women could have it all. I still think women can have it all, but it’s not all at once,” she says. Lette says that when she gives talks in schools, she tells the young women to choose their partner carefully. “Because if you choose an alpha male, he’s going to have a big career. If the child is sick, who do you think is the one who has to pull back? Yeah, it’s always the woman,” she says. “I’ve had two alpha men, whom I adore [her former husbands ABC chair Kim Williams and London barrister Geoffrey Robertson, KC]. I still love them both, and I’m very close to them. Right now, I’ve got a beta. My mantra for him is that he adores me, doesn’t bore me, and does all my chores for me. And it’s incredible to have a beta man, and he wants me to be shining, and I earn more money, right? That’s OK.” I’ve cyberstalked Lette’s social media, finding photos of her going on holidays with Robertson and the children.\n\nAdvertisement\n\n“Geoffrey’s and my divorce was pretty amicable. We’ve got two kids, one who has special needs [their 35-year-old son, Julius, is on the autism spectrum] so we’ve got to stay friends,” she says. “And I always say to my girlfriends, ‘there was something about that person you loved and it is still there’. Once you get over the pain and the wrangling, you can find that in that person again and try and concentrate on that. So especially if you’ve got kids, it makes it much easier.” Lette lives between a house in London and a light-filled apartment in Sydney’s inner east. Being an Australian means you can escape the worst aspects of the British class system, she says. Rubbing royal shoulders: Prince Charles (now the King) greets Kathy Lette at a reception to mark Camilla’s 70th birthday at Clarence House in 2017. Photo: Getty Images I ask her about her well-known friendship with the King and Queen. “When I’m with a member of the royal family and I say something cheeky, there’s an audible gasp from the minders – ‘did she really say that to the King?’ But he always finds it funny and so does Camilla. I mean, I always say to them, ‘I really like you, even though I don’t believe in you.’ I am a republican.” How do they take that? I ask. “They’re pretty sanguine,” she says. “I mean, look what they’ve been through.”\n\nAdvertisement",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/goodfood/melbourne-eating-out/is-this-new-southbank-spot-melbourne-s-first-armenian-bakery-20260203-p5nz4y.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Is this new Southbank spot Melbourne’s first Armenian bakery?",
        "publish_date": "Tue, 03 Feb 2026 11:49:56 +1100",
        "category": "finance",
        "authors": [
            "Tomas Telegramma"
        ],
        "text": "Add articles to your saved list and come back to them anytime.\n\nSave this article for later\n\nRemove items from your saved list to add more.\n\nYou have reached your maximum number of saved items.\n\nTatik’s Delights has graduated from online orders to bricks and mortar.\n\n1 / 2 The 12-tier honey cake (right) and choc-caramel mikado with 10 layers at Armenian bakery Tatik’s Delights. Supplied 2 / 2 Cake and coffee at Tatik’s Delights. Supplied Previous Slide Next Slide\n\nBakery$$$$\n\nBilling itself as Melbourne’s first Armenian bakery, Tatik’s has graduated from online orders to bricks and mortar in less than two years. At its red-splashed shopfront in Southbank, try layered cakes including the 12-tiered bestselling honey cake and the choc-caramel mikado with 10 layers. There’s also gata, the sweet, buttery Armenian bread.\n\nWant to visit this venue? Save it in the Good Food app.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/lifestyle/health-and-wellness/the-collapse-of-the-vegan-boom-20260115-p5nu8e.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "The collapse of the vegan boom",
        "publish_date": "Tue, 03 Feb 2026 11:45:00 +1100",
        "category": "lifestyle",
        "authors": [
            "Tom Haynes"
        ],
        "text": "Advertisement\n\nLifestyleHealth & wellnessVegan The collapse of the vegan boom Tom Haynes February 3, 2026 — 11:45am Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share A A A\n\nIt’s been seven years since The Economist boldly declared 2019 “the year of the vegan”, and it appears the vegan revolution is running out of steam, with some joking on social media that life has just become too depressing to swear off meat. Signs of veganism’s decline first appeared back in 2023 when a YouGov survey found that just 6 per cent of Australians follow a vegan or vegetarian diet. For many industry experts, the collapse in the vegan boom has been a long time coming. It appears the vegan revolution is running out of steam. Getty Images “I told investment companies 10 years ago that veganism is a niche of a niche,” says Ged Futter, a retail expert and former buyer.\n\nAdvertisement\n\nRelated Article Diet What’s for dinner? The debate over fresh, frozen or canned veg “It was no surprise to me at all. Veganism sits within vegetarianism and no one really talks about vegetarianism any more.” The current state of affairs is a far cry from five years ago, when shoppers could hardly move for vegan ad campaigns. Woolworths, Coles and Aldi all unveiled plant-based ranges while KFC, Krispy Kreme and Magnum made similar attempts to cash in on the vegan hype. But many are starting to realise that consumer appetite isn’t there. Last year, Woolworths confirmed to 9News that it had reduced its vegan offering due to a decline in customer interest. Similarly, Coles also told the outlet it had “refined” its vegan range “to better reflect customer demand”.\n\nAdvertisement\n\nIn the UK, popular restaurant chain Wagamama axed a string of vegan favourites from menus, including its “Vegatsu” curry and its “vegan K-Dogs”. Andy Hornby, the chief executive of the chain’s owner, The Restaurant Group, argued that interest from diners wasn’t high enough to justify continuing the dishes. Marketing for the chain’s most recent menu additions makes noticeably less of a fuss about its vegan credentials. “People are realising that the volumes going through fully vegan products are very low,” says Futter. “For manufacturers, when volumes are that small and you can’t see a long-term future, there comes a point where you decide to do something else.” Last year was also a reckoning for businesses that sought to dominate the vegan market.\n\nAdvertisement\n\nRelated Article Fitness The goal posts for a longer, healthier life are closer than you think In April, Neat Burger, the vegan burger chain backed by Leonardo DiCaprio and Lewis Hamilton, shut all of its UK restaurants after suffering substantial losses. Vegan specialities have also vanished from menus across Europe. The McDonald’s plant burger was quietly pulled from Austrian Branches in July while Domino’s shrank its vegan offering as part of a November relaunch. Meat-free menus are only a cost-saver for restaurants if vegan dishes sell, says Grace Withers, of the Agriculture and Horticulture Development Board (AHDB) – but consumer appetite has been overestimated.\n\nAdvertisement\n\n“Even when veganism was at its most popular, we saw far more people claiming to be vegan than actually managing to stick to it,” says Withers. “People often lapsed when they were hungry and wanted something tasty. We saw this during Veganuary as well.” Only 1 per cent of those who signed up for Veganuary made it to the end of the month having stuck to the diet, according to the AHDB, a public body which supports farmers and growers. Cost has also been a factor, as plant-based substitutes such as Quorn and tofu have increased in price more than cheaper meats in recent years. “Consumers are very price-driven because of the cost-of-living crisis,” says Withers. “Meat-free products are more expensive than pig meat and chicken, so they are not competing on price.”\n\nAdvertisement\n\nRelated Article Opinion\n\nNutrition RFK’s new food pyramid is all sizzle and no steak Sarah Berry Lifestyle Health Editor Compounding vegan woes is the fact that some health-conscious consumers have moved on to other fads. “As the trend for strength training continues to grow in popularity, protein intake has become more of a priority,” says Jenni Tardiff, a trainer at the Gym Group. Data from retail analyst Kantar show that 46 per cent of shoppers try to include high-protein in their diets, up from 38 per cent in 2022. Cultural headwinds have similarly shifted, particularly since Donald Trump re-entered the White House.\n\nAdvertisement\n\nThe food pyramid unveiled by his health department earlier this month put dairy and healthy fats at the top. “We are seeing culture swing back towards celebrating real, simple food: red meat, butter and full-fat milk,” says Bia Bezamat, of Kantar. “Protein is easier to get from animal sources. Simplicity is resonating with people in a world that feels increasingly multi-layered and complex.” The rise of weight-loss drugs has also been a factor, Bezamat says: “When you are on medication, you need to make sure you eat the nutrients you need and a diet as restrictive as veganism does not really support that.” Elsewhere, a growing pushback against so-called “ultra-processed foods” has dented the popularity of meat-free substitutes. “When you look at the back of the pack on some vegan products, the list of ingredients is enormous,” says Futter.\n\nAdvertisement\n\n“A large proportion of vegan products are made from things people don’t really recognise or understand. Brands and supermarkets have recognised that this is not what customers are looking for.” Despite the cut-through of the odd vegan product like oat milk, the hope of a wholesale vegan revolution has unravelled. “I think there was an overestimation of how popular veganism would be,” says Bezamat, who compares it to the rise and fall of gluten-free diets. “That was the original restrictive diet, where there was initially very little offer and then suddenly lots of products,” she says. “Now it just sits there on the shelf.” The Telegraph, London\n\nSave You have reached your maximum number of saved items. Remove items from your saved list to add more. Share More: Vegan\n\nNutrition\n\nDiet\n\nHealth and nutrition",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/money/tax/how-a-simple-slip-up-could-see-your-property-sale-taxed-twice-20260203-p5nz37.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "How a simple slip-up could see your property sale taxed twice",
        "publish_date": "Tue, 03 Feb 2026 11:38:24 +1100",
        "category": "finance",
        "authors": [
            "Julia Hartman"
        ],
        "text": "Advertisement\n\nMoneyTaxCapital gains tax How a simple slip-up could see your property sale taxed twice Julia Hartman February 3, 2026 — 11:38am Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share A A A\n\nIt is almost common knowledge these days that a capital gain is taxed in the financial year that the contract is signed, not the year of settlement, and getting this wrong can result in double taxation of the same capital gain. Edward Sunna’s case, ruled on by the Federal Court at the end of last year, highlights the danger of declaring the capital gain in the wrong year as you could end up being taxed in both years. Take careful note of the date you sign your sale contract, as it could be what saves – or costs – you thousands in tax. Suzanne White This is because the ATO has an unlimited time period to amend old tax returns to include a capital gain, but if the amendment period (usually 2 years) has passed, they cannot remove the capital gain from the incorrect year. In some scenarios, it is not so common knowledge as to which year applies. In Sunna’s case, he signed the contract on June 28, 2019, but did not receive the deposit – which was nearly 50 per cent of the sale price – until after June 30, now in the 2019-2020 financial year.\n\nAdvertisement\n\nHe then included the deposit in his 2020 tax return and when the sale of the $5.5 million Sydney unit went through in August 2022, he included the rest of the gain in his 2023 tax return. In reality, the whole of the gain should have been included in the 2019 tax return. So if you’re planning on buying or selling a house soon, here’s what you need to know: Sale of Asset: The capital gain goes in the tax return for the year that the contract was signed, regardless of when the deposit was received. If no contract was signed, then the year that the ownership of the asset transferred. As you can see, this can result in the deadline for lodging tax returns expiring before the outcome is known. You can lodge your tax return without the capital gai,n while the outcome remains uncertain, then amend within a month of settlement. The ATO undertakes not to charge interest or penalties providing the amendment is made within a reasonable time, generally a month.\n\nAdvertisement\n\nOptions: If you enter into an option to sell your property and the option is exercised, the option proceeds are just included with the sale proceeds in the financial year that the option is exercised – i.e., the year that the contract for an actual sale is signed. Editor's pick Opinion\n\nProperty development Knocking down and rebuilding? Don’t fall for these tax traps If the option is not exercised, then you need to include the option proceeds in the tax return for the year, back at the start, when the option was entered into. Forfeited Deposit: This goes into the tax return for the year that the deposit was forfeited. Note if the deposit is not forfeited, it just becomes part of the sale proceeds, so it applies to the tax return when the contract was signed. Section 107 of the Income Tax Assessment Act prevents the two-year amendment period limitation applying when an amendment is made to include a capital gain that has not been previously been included in the tax return for that year.\n\nAdvertisement\n\nThe catch is that there is no similar provision to extend the amendment period to correct a capital gain incorrectly included in another year. So, the ATO can go back as far as it likes to include your capital gain in the correct year without having to remove it from the tax return for the year in which it was mistakenly included. This will result in the capital gain being taxed twice. Sunna’s case found that there was no real impediment to this happening. If this article has raised any concerns, you can apply to the ATO to exercise their discretion to allow the amendment period to be extended on the tax return where the capital gain was incorrectly included. Julia Hartman founded BAN TACS Accountants more than 30 years ago and is still passionate about all things tax. Advice given in this article is general in nature and is not intended to influence readers’ decisions about investing or financial products. They should always seek their own professional advice that takes into account their own personal circumstances before making any financial decisions. Expert tips on how to save, invest and make the most of your money delivered to your inbox every Sunday. Sign up for our Real Money newsletter.",
        "source": "TheAge"
    },
    {
        "url": "https://au.news.yahoo.com/unions-call-capital-gains-rethink-015018007.html",
        "title": "Unions call for capital gains rethink as approvals fall",
        "publish_date": "2026-02-03T01:50:18Z",
        "category": "finance",
        "authors": [],
        "text": "The peak union body has urged the Albanese government to push ahead with tax reform to help get more young workers into homes, as fresh data shows Australia falling behind its housing supply target.\n\nThe Australian Council of Trade Unions called for the capital gains tax discount to be cut in half from 50 per cent to 25 per cent, arguing the generous concession incentivises professional landlords to invest in property, driving up prices.\n\nIn a submission to a Greens-led parliamentary inquiry into the discount, the ACTU said it was at best \"a failed tax policy long in need of an overhaul\".\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nAt worst, it is a \"tax avoidance scheme for the richest Australians that is helping to drive record inequality and is pricing mostly younger people out of home ownership\".\n\nACTU president Michele O'Neil says more and more workers are unable to afford a home deposit. (Mick Tsikas/AAP PHOTOS)\n\n\"Too many workers can no longer afford to live near where they work, and a growing number of workers will never be able to save enough for a deposit,\" ACTU president Michele O'Neil said.\n\n\"At the same time, accelerating rents and house prices are outpacing the money people can save each week.\"\n\nCalls to scale back the discount, which was introduced by the Howard government in 1999 and aims to compensate investors for inflation, have been echoed by think tanks such as the Grattan Institute and NSW Treasury.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nIn a recent interview with Nobel-prize winning economist Joseph Stiglitz published in The Monthly, federal Treasurer Jim Chalmers said the government was instead focused on other ways to make housing more affordable, by encouraging new supply.\n\nOn Tuesday, the Australian Bureau of Statistics revealed just over 195,000 new homes were approved nationwide in 2025, after dwelling consents fell 14.9 per cent in December to 15,542.\n\nTo meet the national housing accord target of 1.2 million new homes over five years, the industry needs to be building new homes at a rate of 240,000 each year.\n\nThe drop in approvals in December was driven by a 29.8 per cent fall in approvals for private dwellings excluding houses, ABS head of construction statistics Daniel Rossi said.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nIt comes after a 29.6 per cent rise in November and demonstrates the volatile nature of the data.\n\nData shows home prices rose 8.6 per cent in 2025 and climbed a further 0.8 per cent in January. (James Ross/AAP PHOTOS)\n\nWhile approvals are still below target, the trend rate has been steadily rising since the start of 2024.\n\n\"We've seen three years of increases in building approvals and building approvals in 2025 were up 13 per cent on the year prior,\" Housing Minister Clare O'Neil said.\n\n\"We know there's still much more work to do to turn around a housing crisis a generation in the making.\"\n\nHome prices rose 8.6 per cent in 2025, according to property data firm Cotality.\n\nValues climbed another 0.8 per cent nationally in January, underpinned by chronic undersupply, Cotality research director Tim Lawless said.",
        "source": "Yahoo"
    }
]