[
    {
        "url": "https://www.9news.com.au/world/advice-to-feed-babies-peanuts-early-and-often-helped-thousands-of-kids-avoid-allergies/7977a316-c685-4c1b-a620-49fdea4151b0",
        "title": "Advice to feed babies peanuts early and often has helped thousands avoid allergies",
        "publish_date": "Tue, 21 Oct 2025 00:27:59 +0000",
        "category": "lifestyle",
        "authors": [
            "Oct"
        ],
        "text": "A decade after a landmark study proved that feeding peanut products to young babies could prevent development of life-threatening allergies, new research finds the change has made a big difference in the real world.\n\nPeanut allergies began to decline in the US after guidance first issued in 2015 upended medical practice by recommending introducing the allergen to infants starting as early as four months.\n\nThe rate of peanut allergies in children ages 0 to 3 fell by more than 27 per cent after guidance for high-risk kids was first issued in 2015, and by more than 40 per cent after the recommendations were expanded in 2017.\n\nAbout 2 per cent of children are affected by peanut allergy. (Getty)\n\n“That’s a remarkable thing, right?” said Dr David Hill, an allergist and researcher at Children’s Hospital of Philadelphia, and author of a study published on Monday in the medical journal Pediatrics.\n\nHill and colleagues analysed electronic health records from dozens of pediatric practices to track diagnoses of food allergies in young children before, during and after the guidelines were issued.\n\n“I can actually come to you today and say there are less kids with food allergy today than there would have been if we hadn't implemented this public health effort,” he added.\n\nAbout 60,000 children have avoided food allergies since 2015, including 40,000 children who otherwise would have developed peanut allergies.\n\nStill, about 8 per cent of children are affected by food allergies, including more than 2 per cent with a peanut allergy.\n\nPeanut allergy is caused when the body’s immune system mistakenly identifies proteins in peanuts as harmful and releases chemicals that trigger allergic symptoms, including hives, respiratory symptoms and, sometimes, life-threatening anaphylaxis.\n\nFor decades, doctors had recommended delaying feeding children peanuts and other foods likely to trigger allergies until age 3.\n\nParents are now urged to introduce peanuts to their kids early. (Getty)\n\nBut in 2015, Gideon Lack at King’s College London, published the groundbreaking Learning Early About Peanut Allergy, or LEAP, trial.\n\nLack and colleagues showed that introducing peanut products in infancy reduced the future risk of developing food allergies by more than 80 per cent.\n\nLater analysis showed that the protection persisted in about 70 per cent of kids into adolescence.\n\nThe study immediately sparked new guidelines urging early introduction of peanuts — but putting them into practice has been slow.\n\nOnly about 29 per cent of pediatricians and 65 per cent of allergists reported following the expanded guidance issued in 2017, surveys found.\n\nConfusion and uncertainty about the best way to introduce peanuts early in life led to the lag, according to a commentary that accompanied the study.\n\nEarly on, medical experts and parents alike questioned whether the practice could be adopted outside of tightly controlled clinical settings.\n\nThe data for the analysis came from a subset of participating practice sites and may not represent the entire US pediatric population, noted the commentary, led by Dr Ruchi Gupta, a child allergy expert at Northwestern University.\n\nHowever, the new research offers “promising evidence that early allergen introduction is not only being adopted but may be making a measurable impact,” the authors concluded.\n\nAdvocates for the 33 million people in the US with food allergies welcomed signs that early introduction of peanut products is catching on.\n\n“This research reinforces what we already know and underscores a meaningful opportunity to reduce the incidence and prevalence of peanut allergy nationwide,” said Sung Poblete, chief executive of the nonprofit group Food Allergy Research & Education, or FARE.\n\nThe new study emphasises the current guidance, updated in 2021, which calls for introducing peanuts and other major food allergens between four and six months, without prior screening or testing, Hill said.\n\nParents should consult their paediatricians about any questions.\n\n“It doesn’t have to be a lot of the food, but little tastes of peanut butter, milk-based yogurt, soy-based yogurts and tree butters,” he said.\n\n“These are really good ways to allow the immune system exposure to these allergenic foods in a safe way.”\n\nTiffany Leon, 36, a Maryland registered dietician and director at FARE, introduced peanuts and other allergens early to her two young sons.\n\nAt first, Leon’s own mother was shocked at the advice to feed babies such foods before the age of 3, she said.\n\nBut Leon explained how the science had changed.\n\n“As a dietician, I practice evidence-based recommendations,” she said.\n\n“So when someone told me, ‘This is how it’s done now, these are the new guidelines,’ I just though, OK, well, this is what we’re going to do.”\n\nThe Associated Press Health and Science Department receives support from the Howard Hughes Medical Institute’s Department of Science Education and the Robert Wood Johnson Foundation. The AP is solely responsible for all content.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/scientists-find-link-between-breast-feeding-and-child-birth-and-reduction-in-cancer-risk/14741c14-5efc-48a5-824f-9afcd46b3c78",
        "title": "Aussie researchers discover breakthrough link between breastfeeding and fighting cancer",
        "publish_date": "Mon, 20 Oct 2025 23:47:25 +0000",
        "category": "lifestyle",
        "authors": [
            "Oct"
        ],
        "text": "A﻿ustralian scientists have made a breakthrough discovery in why breastfeeding and pregnancy reduces the long-term risk of breast cancer in women.\n\nIt is widely accepted that childbirth and breastfeeding can protect women against the deadly disease – but until now, the biological reason has been linked to hormones.\n\nResearchers at ﻿the Peter MacCallum Cancer Centre in Victoria, led by Professor Sherene Loi, have found that childbirth develops infection-fighting T-cells in the breasts, which continue to \"live\" in breast tissue for decades.\n\nA﻿ustralian scientists made a breakthrough discovery in why breastfeeding and pregnancy reduces the long-term risk of breast cancer. (Getty)\n\nLoi and her team discovered ﻿that patients who had these T-cells had a better outcome of fighting cancer and generally had healthier breast tissue.\n\n\"These cells act like local guards, ready to attack abnormal cells that might turn into cancer,\" Loi said.\n\n\"This protection may have evolved to defend mothers during the vulnerable post-pregnancy period, but today it also lowers breast cancer risk, especially the aggressive type called triple-negative breast cancer.\"\n\nThe study used data from over 1000 breast cancer patients.\n\nOf those women, the ones who had children were found to have significant﻿ly more T-cells.\n\nAnd, in some groups, they lived longer after a breast cancer diagnosis.\n\nResearchers at ﻿the Peter MacCallum Cancer Centre in Victoria made the discovery. (Peter MacCallum Cancer Centre)\n\nAny period of breastfeeding provided benefits, however six months was the most ideal, Loi said.﻿\n\n\"When breast cancer cells were introduced, the models with this reproductive history were far better at slowing or stopping tumour growth but only if T cells were present,\" she added.\n\nIt is important to note the research does not claim breastfeeding or childbirth is a guaranteed protection against breast cancer.﻿\n\nDoctors first noticed the link between childbirth and a lower risk of cancer when observing that nuns had some of the highest rates of breast cancer back in the 18th century.\n\n﻿However it was long understood that pregnancy-related hormones were a major factor in preventing cancer.\n\nAround 58 Australians are diagnosed with breast cancer every day.\n\nIt is the most common cancer among women and second most-diagnosed cancer in Australia.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/2gb-breakfast-host-ben-fordham-involved-in-sydney-harbour-rescue/5073eb67-91e3-4d10-8ed8-c019b1f8d57c",
        "title": "Radio host helps rescue windsurfer from hazardous Sydney Harbour conditions",
        "publish_date": "Mon, 20 Oct 2025 03:04:34 +0000",
        "category": "finance",
        "authors": [
            "Oct"
        ],
        "text": "Talkback radio host Ben Fordham has rushed to the aid of a windsurfer who found themselves in trouble during a day out on Sydney Harbour.\n\n2GB breakfast host Fordham was about to attend the wedding reception of producer Liam McGuire on Friday afternoon when he heard whistling near Woolwich Dock.\n\nFordham looked over to the water, noticed a group in trouble and rushed over to help with several other wedding guests.\n\n2GB breakfast host Ben Fordham rushed to the aid of windsurfer who found themselves in trouble during a day out on Sydney Harbour. (2GB)\n\n\"They were still in the water﻿ with a windsurf and it was tipped over,\" he said.\n\n\"I yelled out to him 'do you want help?'﻿ and he said 'yes'.\"\n\nSeveral people pulled windsurfer Jonah Aiello onto the dock after he went out into choppy waters with friends.\n\nFordham looked over to the water, noticed a group in trouble and rushed over with his team. (2GB)\n\n\"What went wrong was the decision to go out,\" Aiello told 2GB this morning.\n\n\"﻿We knew the forecast, we knew what we were getting into but we thought we'd chase a bit of fun.\n\n\"We all just got super overpowered, hadn't been out in a while and everything broke loose.\n\n\"Luckily we had a support boat out there as well.\"\n\nAiello was uninjured but was left with a few scratches on his nose.\n\n\"I had someone say ﻿'I was disappointed', they were hoping I was going to dive right in,\" Fordham said.\n\n\"It was a great se﻿gway to pull you out of the water and start a wedding reception, it really made the afternoon.\"\n\nAfter the rescue, the windsurfer was invited into the event but he ﻿politely declined.\n\n\"I was in my wetsuit and had all of my windsurfing gear on,\" Aiello said.\n\nBut Aiello extended his own offer to Fordham and his team.﻿\n\n\"To any ﻿of the people who helped out, I know you got a bit of saltwater on your suits, so if you want to invoice me for some laundry fees, let me know,\" Aiello said.",
        "source": "9News"
    },
    {
        "url": "https://www.abc.net.au/news/2025-10-21/tony-armstrong-tackles-racism-in-sport-in-end-game/105897492",
        "title": "How Tony Armstrong's experience of racist trolling inspired series",
        "publish_date": "Tue, 21 Oct 2025 00:55:52 +0000",
        "category": "sports",
        "authors": [],
        "text": "Warning — this article contains images and references to offensive and racist language.\n\nGamilaroi man and ABC presenter Tony Armstrong has travelled Australia and abroad to unravel the drivers of racism in sport — and search for positive, practical solutions — in the documentary series End Game.\n\nIn it, some of the biggest names in sport leant into the collective ambition of eradicating racism on and off the field.\n\nFormer Liverpool football great John Barnes, US Navajo and Angel City FC footballer Madison Hammond, Australian cricketer Usman Khawaja, South Sydney NRL player Cody Walker and dual Brisbane AFL premiership winner Callum Ah Chee all joined the End Game team.\n\nTony Armstrong shares a laugh with Australian cricketer Usman Khawaja. (Supplied)\n\nSpeaking to the ABC as the series premiered, Armstrong was overcome with emotion as he recalled working with former Sydney Swans teammate and childhood hero Adam Goodes.\n\n\"It [End Game] wouldn't have worked without him. We didn't want to re-traumatise him, but that's not what happened. He's such a good bloke,\" Armstrong said, wiping away tears.\n\nBrothers standing united together against racism, Adam Goodes and Tony Armstrong at the SCG. (Supplied)\n\nGoodes is deeply respected by many First Nations peoples across the nation for standing up for himself, his culture, his people and his beliefs.\n\nBut despite being a premiership winner and a two-time Brownlow Medallist, in 2013 Goodes was called an \"ape\" by a teenager during an Indigenous Round match between Sydney and Collingwood.\n\nGoodes 'cut down' because he was powerful: King Charlie King lays down a challenge to AFL to prove it has changed, in the wake of a documentary chronicling the racism that ended Australian footballer Adam Goodes's career.\n\nIt was the catalyst for two years of relentless booing on-field and criticism from some media commentators.\n\n\"I totally felt like I wasn't getting any respect for the way I was verbalising my situation,\" Goodes told Armstrong.\n\n\" Sometimes you can say and do all the right things, and it still doesn't work. \"\n\nAfter playing for sixteen years at an elite level, the jeers took a huge toll on the former Sydney captain.\n\nGoodes walked away from the sport he loved at the end of 2015.\n\n\"For me, once I retired from football, I knew my role was taking a back seat.\"\n\nTrolling motivated Armstrong to make series\n\nIn the decade since Goodes' retirement racist trolling has moved online, with people of all ages suffering the consequences.\n\nA former ABC News Breakfast presenter and two-time Logie award winner, Armstrong said he was motivated to make the series after he faced a high degree of online trolling directed at him, his family and partner.\n\n\"I basically got to a point where I'm copping a fair bit. I can handle it at this point in time,\" he said.\n\n\" It's incumbent on me [to make the series] with the position I'm in professionally, how I'm seen in Australia. I felt like I could have an impact. \"\n\nSome of the racist trolling aimed at Tony Armstrong and his family. (Supplied)\n\nWhile in England, Armstrong caught up with Premier League Hall of Fame player Rio Ferdinand who spoke about his personal experiences with racism and the need to apply pressure on the highest levels of the sporting and corporate world to fight it.\n\n\"I think the social media companies need to take more of a responsibility to put the little things in place to have consequences for bad practice,\" he said.\n\nRio Ferdinand, regarded as one of football's greatest players, opens up about the toll racism took on him and his family. (Supplied)\n\nLegendary West Indian cricketer Michael Holding also shared his motivation for speaking out about racism during a live cricket broadcast at the height of the Black Lives Matter movement in July 2020.\n\n\"If you have a platform, use it, and I'm not just talking about black people, white people,\" he said.\n\n\"If you believe that there should be equality use that platform that you have got.\"\n\nWest Indian cricket legend and commentator Michael Holding is calling for athletes to step up. (Supplied)\n\nAustralian cricketer and proud Muruwari woman Ash Gardner recalled the attacks she faced for posting on social media her view that it was inappropriate for the Australian cricket team to play on January 26 due to the pain the day brings to First Nations people.\n\nGardner told Armstrong she found the abuse shocking, but stood by her comments.\n\n\"The legacy that I want to leave behind is not actually what I did on the cricket pitch but how I can change things for the greater good,\" she said.\n\nTony Armstrong and the End Game crew at the home of Australian cricketer Ash Gardner. (Supplied)\n\nArmstrong said the conversations he had with athletes, particularly from overseas, opened his eyes to the difficulties when calling out racism in Australia.\n\n\"One of the things that struck me and made me quite frustrated was overseas they actually say that they've got an issue,\" he said.\n\n\" Whereas here in Australia we're just like, 'nothing to see here, man. What do you mean? We're all happy, aren't we?' \"\n\nArmstrong wary of backlash\n\nThe series was directed by Guugu Yimithirr man Dean Gibson, who is no stranger to the subject of racism.\n\nIn 2021 he directed and wrote the award-winning documentary Incarceration Nation which examined the Australian justice system's treatment of Indigenous people and the historical systemic racism involved.\n\nEnd Game director Dean Gibson alongside cricketing great Michael Holding. (Supplied: Dean Gibson)\n\n\"Sadly, these things happen on a regular basis across the country — over the weekend, across all sporting codes, across all communities across Australia. So we're well aware that this a really prevalent, relevant topic,\" he said.\n\nThe director described Armstrong as \"brave and courageous\" for the stance he has taken and for being the face of the End Game series.\n\nHe acknowledged the risk that Armstrong will again come under significant racist trolling when the documentary airs.\n\n\"You could sense that it was weighing on him [Armstrong] as the production grew and he recognised this will be a national conversation, that people will have strong opinions either way,\" he said.\n\n\"He lifted the weight and he really rides that rollercoaster of those emotions. That's real, and I think that's the best part of what he brings to this production.\"\n\nTony Armstrong hopes the new series will help to inspire and educate people. (Supplied)\n\nThe documentary makers commissioned a survey of 2,111 Australians from social impact agency No 2nd Place about attitudes to sport, fandom and racism.\n\nOnly 27 per cent of respondents agreed that racism was an issue in their favourite sport, compared to almost double who agreed that racism was a problem in the country — something the report's authors described as \"the ultimate form of rose-coloured glasses\".\n\nKnow The Real Score Are you game to tackle racism in sport?\n\nThree out of four respondents denied they held prejudice against other cultures.\n\nWhen an incident of racism had been witnessed, only one out four bystanders agreed they would check on the wellbeing of a victim.\n\n\"We shouldn't underestimate how hard it is for a bystander to speak up,\" Race Discrimination Commissioner Giridharam Sivaraman told the ABC at the official launch of End Game.\n\n\" You might feel vulnerable as well. You might be the same colour of skin as the person that's being attacked, and then you're expected to step in and probably you're going to cop it as well. \"\n\nGiridharan Sivaraman says eliminating racism on and off the field requires a systemic, national approach. (ABC News: Jack Ailwood)\n\nMr Sivaraman said the National Anti-Racism Framework launched by the Australian Human Rights Commission last year offered \"much bigger solutions … that change our systems and institutions so that the racism that we see on streets, on trains, in schools doesn't happen\".\n\nMr Sivaraman said the neo-Nazi attack on the Camp Sovereignty protest site in August was a sign that racism was on the rise.\n\n\"The fact that neo-Nazis openly, without masks or sunglasses and in broad daylight, attacked Aboriginal and Torres Strait Islanders, that's hugely concerning,\" he said.\n\nLoading...\n\nCan sports drive positive change?\n\nWith the first of End Game's three episodes airing on Tuesday night, Tony Armstrong and Dean Gibson said they wanted it to inspire and educate.\n\n\"The tone from day one was we wanted it to be an empowering piece of television that really empowers First Nations people, but also … people from all backgrounds, to have this conversation and in a respectful, safe and understanding empathetic manner,\" Dean said.\n\nStream End Game with Tony Armstrong on ABC iview Tony Armstrong will tackle Australia's overdue reckoning with racism in sport, with the help of some of its biggest sports stars.\n\n\"People can overcome racism. I think society can overcome it. It just takes the bravery to be the people to talk about it.\"\n\nThe potential of sport to unify people showed up in the survey's finding that 91 per cent of those who felt like they belonged in their favourite sport also felt a sense of belonging in Australian society.\n\nFor the filmmakers, their hope is that sport can function as more than just a game, where inclusion transcends prejudice.\n\n\"I don't want them to watch this series and be like, 'oh, here's another 'racism sucks, woe is us [story]'. That's not what it's about. This is about giving a set of tools to people,\" Armstrong said.\n\nStream all episodes of End Game free on ABC iview or watch on ABC TV at 8:30pm.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-10-21/cowangie-sign-honouring-racing-legend-larry-perkins-stolen/105911228",
        "title": "Thieves steal Victorian town's sign honouring racing legend Larry Perkins",
        "publish_date": "Tue, 21 Oct 2025 00:38:41 +0000",
        "category": "sports",
        "authors": [],
        "text": "Since the early 1990s, a sign honouring local racing legend Larry Perkins has welcomed people to the far north-west Victorian town of Cowangie.\n\nLast week, however, it was cut down and stolen.\n\nLarry Perkins won the Bathurst 1000 six times. (ABC News)\n\nThe sign was believed to be taken between Wednesday and Friday.\n\nJack Perkins, son of Larry Perkins and a racing driver himself, condemned the act, labelling it as \"disappointing\" for the community.\n\n\"[The sign] is a really cool thing for the community and obviously in the motor racing world,\" he said.\n\n\"That's the thing that really annoys you; when community go to this effort to put something up, they're proud of their town and proud of that particular sign [and then someone steals it].\"\n\nInstalling sign a community-led initiative\n\nLarry Perkins, who retired in 2003, won the Bathurst 1000 race six times during his career and raced against some of the world's best in Formula 1.\n\nMildura councillor Glenn Milne said he was shocked by the theft because everyone in the district would be familiar with the sign.\n\n\"Larry Perkins is a legend of Cowangie. He was known as the Cowangie kid,\" he said.\n\n\" This isn't just any street sign. It's an iconic sign and it's a piece of Australia's history really … this is something different and it's a pretty low act. \"\n\nGlenn Milne says the theft is \"sad\". (Supplied: Mildura Rural City Council)\n\nThe sign was first installed by the Cowangie Country Women's Association in 1993.\n\nIt has been replaced twice since, with older, faded signs auctioned off.\n\nThose sales raised about $18,000, which went towards the town's Kow Plains Homestead and old nursing station.\n\nCr Milne said the funds were valuable to the community.\n\n\"That money goes towards looking after those and maintaining those facilities for the people of our community,\" he said.\n\n\"That’s now taken away an opportunity to raise $6,000 or $8,000.\"\n\nSon urges thieves to take a look in the mirror\n\nMr Perkins said damage done to the sign's metal poles meant installing a new one would come at an increased cost to the Cowangie community.\n\nJack Perkins says the theft occurred just days after this year's Bathurst 1000 race. (Supplied: Jack Perkins)\n\n\"We'd have to replace the posts,\" he said.\n\n\"Last time we changed the sign, we only had to change the visual sign. The post and everything was still there ... it becomes a bigger job and again it's community driven.\"\n\nMr Perkins urged the thieves to return the sign so it could be reinstalled.\n\nJack Perkins says it would be expensive to replace the stolen sign. (Supplied: Perkins Engineering)\n\n\"It doesn't matter if it's a couple of weeks away. If someone gets a conscience and just drops it back on the side of the highway at night, it's just easy. We would be able to weld it back together and it would live to see another day,\" Mr Perkins said.\n\n\"It's just disappointing in 2025 that there's people stealing signs off the highway, like you've honestly got to have a look in the mirror.\"\n\nHe also asked people to keep an eye out for the sign as it was unlikely the thief would be able to sell it without someone reporting it.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-10-21/afl-state-of-origin-coaches-chris-scott-dean-cox-victoria-wa/105915218",
        "title": "Victoria and WA coaches announced ahead of AFL State of Origin match",
        "publish_date": "Tue, 21 Oct 2025 00:19:12 +0000",
        "category": "sports",
        "authors": [],
        "text": "Chris Scott and Dean Cox have been appointed as the respective State of Origin coaches for next February's standalone exhibition match in Perth.\n\nTwo-time premiership coach Scott will take charge of Victoria, while Cox will lead Western Australia.\n\nAFL announces State of Origin return AFL chief executive Andrew Dillon confirms Western Australia will play Victoria in Perth next February in the first State of Origin match since 1999.\n\nThe two AFL Origin squads will be announced in the coming months.\n\nPlayers will be selected based on the junior club from where they were drafted.\n\nIt will be the first men's State of Origin match since Victoria played South Australia in 1999.\n\nVictoria and Western Australia have not played each other since 1992.\n\nScott — who grew up in Melbourne — will bring to the \"Big V\" his experience of winning two flags as Geelong coach, in 2011 and 2022.\n\nHe also guided the Cats to grand final appearances in 2020 and 2025.\n\nCox, who just finished his first season as Sydney Swans coach, came through the WAFL ranks as a player before making his AFL debut with West Coast in 2001.\n\nStream End Game with Tony Armstrong on ABC iview Tony Armstrong will tackle Australia's overdue reckoning with racism in sport, with the help of some of its biggest sports stars.\n\nHe was a member of the Eagles' 2006 premiership-winning squad.\n\n\"I'm a proud Western Australian and grew up watching State of Origin footy, so this is a real privilege to lead the team in February against the Vics,\" Cox said in a statement.\n\n\"We have a very strong contingent of WA boys playing at the top level so it's not going to be easy to pick a side, but we feel we will take it right up to Victoria.\n\n\"I love the fact the concept is back, and I can't wait for the game.\"\n\nBoth Cox and Scott will select three assistant coaches and a high-performance manager ahead of the February 14 match.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-10-21/critical-minerals-deal-what-do-we-use-them-for/105898652",
        "title": "From MRI scans to wind turbines, critical minerals are essential for modern life",
        "publish_date": "Tue, 21 Oct 2025 00:17:18 +0000",
        "category": "finance",
        "authors": [],
        "text": "Australia and the US have inked a deal on rare earths and critical minerals.\n\nThe critical minerals deal will see about $US8.5 billion invested into various projects over the next six months.\n\nPrior to the meeting, President Donald Trump told reporters on Air Force One, \"I don't want to play the rare earths game with China\", referencing export controls on a range of critical minerals China hit the US with in April, and expanded recently.\n\nAs Australia's ambassador to the US, Kevin Rudd, put it last month: \"Australia more or less equals the periodic table, geology has been kind to us.\"\n\nBut being able to mine the raw materials, and having the capacity to process them into something useful, represent two separate challenges.\n\nAustralian companies have mostly solved the latter part by selling to China.\n\nAustralia sits on huge reserves of critical minerals, but what do they do? Australia is joining the European Union and the United States in establishing strategic reserves of critical minerals, but what do they actually do, and why are they so important?\n\nEarlier this month China placed strict export controls on holmium, europium, ytterbium, thulium, erbium.\n\nIn April it slapped similar controls on samarium, gadolinium, terbium, dysprosium, lutetium, scandium and yttrium.\n\nChina's position as the world's factory over the past decades, combined with its successful position as the world's dominant miner and processor of rare earths, nickel, lithium and cobalt among others, has seen these minerals move into a massive amount of mundane household items, from vacuum cleaners to headphones.\n\nBut elements on this list are also being used in cutting edge nanotechnology and materials research.\n\nSome have also proven to be essential in the advancement of life-saving cancer treatments, powerful medical diagnostics and imaging tools, as well as more undetectable weapons and sharper military intelligence gathering.\n\nThe AI boom\n\nThe expansion in artificial intelligence (AI)'s capacity is underpinned by the rollout of data centres and high-powered Graphics Processing Units (GPUs).\n\nFor example, one of the steps in manufacturing a semi-conductor is polishing the wafer, and cerium oxide has proven to be an effective material in that process.\n\nOther rare earth elements can also improve the manufacturing process.\n\n\"Doping rare earth elements in semiconductor materials can adsorb impurities, thereby effectively improving the purity and integrity of semiconductor materials,\" according to US-based Stanford Advanced Materials.\n\nAs chips have become smaller and more powerful, lanthanum oxide has been identified as a better material than silicon dioxide as a component in transistors.\n\nRare earth elements have improved the manufacturing and performance of semiconductor chips. (Reuters: Florence Lo, file photo)\n\nMedical diagnostics\n\nOne heavy rare earth element, gadolinium, has become crucial for magnetic resonance imaging (MRI).\n\nIt's one of the most magnetic elements on the periodic table, and that's made it a useful part of MRI contrast injections.\n\nGadolinium is paramagnetic, which means it's attracted by an external magnetic force.\n\nSo when you're injected with a gadolinium-based contrast, it allows the MRI scanner to produce higher resolution and more accurate images.\n\nIn a 2019 paper, South Korean scientists found that adding a range of rare earth elements to CT scan contrast agents, including ytterbrium and gadolinium, provided much better results when compared with an iodine-based contrast agent.\n\n\"Doping\" an yttrium aluminium garnet with neodymium created the Nd:YAG laser, commonly used in cosmetic medicine as an ablative laser for the reduction of fine lines and wrinkles, tattoo and hair removal.\n\nGadolinium has proven to be an effective contrast solution in MRI scans. (ABC News: Alison Branley, file photo)\n\nRenewable energy\n\nThe magnetic properties of heavy rare earths like neodymium, dysprosium and praseodymium have made them essential in manufacturing of high-performance permanent magnets.\n\nIn direct-drive wind turbines, like the ones at the Mt Millar Wind Farm on South Australia's Eyre Peninsula for example, use of these magnets improves efficiency at low wind speeds.\n\nAnd since they don't have a gearbox, there are fewer moving parts that require maintenance, which lowers running costs.\n\n\"The increased demand for wind turbine components and rise in manufacturing capacity for wind energy will drive higher demand for specific materials, including [rare earth elements] such as neodymium, dysprosium, and praseodymium, as well as critical materials like copper, nickel and zinc,\" the Global Wind Energy Council said in its 2024 Global Wind Report.\n\nThey're also vital components of the electric motors and battery chemistry that power EVs, which is tipped to be a key driver of growth in rare earth element demand over coming years.\n\nWind turbines at Mt Millar use direct drive generators, which require rare earth magnets. (ABC audience submitted: timo29570)\n\nDefence applications\n\nA decade ago, David S Abraham's book The Elements of Power: Gadgets, Guns, and the Struggle for a Sustainable Future in the Rare Metal Age described the F-35 jet as a \"flying periodic table\".\n\n\"The nuts and bolts that hold the plane together are made from beryllium … gallium helps amplify the radar's signal … tantalum sits in the capacitors needed for laser targeting, controls, and cockpit displays',\" Mr Abrahams wrote.\n\nElements like yttrium, gadolinium, dysprosium and terbium have been incorporated into ceramics, alloys and coatings to improve the stealth of military aircraft, missiles and vehicles.\n\nEuropium and yttrium are used in night-vision goggles and rare earths have improved heads up displays.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-10-21/uncovering-a-workplace-culture-before-you-take-the-job/105862476",
        "title": "How to uncover a workplace's culture before you take the job",
        "publish_date": "Tue, 21 Oct 2025 00:08:40 +0000",
        "category": "finance",
        "authors": [],
        "text": "When job hunting, you might be looking at things such as pay, hours and location.\n\nBut how much do you think about the workplace culture?\n\n\"Organisational culture drives an awful lot of worker satisfaction and performance,\" explains Paula Brough, director of the Centre for Work, Organisation and Wellbeing at Grifith University.\n\nProfessor Brough defines workplace culture as the \"invisible way that behaviour in the workplace is governed\".\n\n\"It's often referred to as 'the way things are done around here',\" she says.\n\nWhen the culture at work is toxic, that can be detrimental, says Carol Kulik from the Centre for Workplace Excellence at the University of South Australia\n\n\"That's an extra day-to-day strain you are carrying on top of workload.\n\n\"And we know over the long run, there is a body of literature that shows having that extra layer of stress is what leads to heart attacks or high blood pressure,\" she says as examples of physical and mental health conditions that can result from working in a toxic work environment.\n\nIt is possible to get a sense of whether an organisation has healthy culture before you take a job.\n\nBut it's about more than having a pool table in the lunch room, our experts warn.\n\nSigns of a toxic workplace culture and how to break the cycle A difficult environment can be \"systemic\", says an expert, but with a new law in place to support employee wellbeing, everyone can play a part in change. It first starts with knowing the signs.\n\nDefining workplace culture\n\nThere is formal and informal culture in workplaces, says Professor Brough.\n\n\"The formal culture relates to policies and practices, of which there is normally a whole load of HR policies related to that: how you take leave,\" she says for example.\n\n\"Then there is the informal culture … [which] can be anything from the way you talk to colleagues and your managers, to the style of dress, when you take lunch, if you eat at your desk.\"\n\nWe need to care about workplace culture, Professor Kulik says, because organisations can't have a policy or standard operating procedure for every possible circumstance.\n\n\" What culture is supposed to do, is fill in any gaps. \"\n\nShe says when a company has shared values, it has a strong culture.\n\nSecurity and predictability\n\n'Bring your pet to work day' might be more of a gimmick than a sign of healthly workplace culture. (Pexels)\n\nA healthy workplace culture should give employees a sense of security and predictability, Professor Kulik says, using the example of US-based department store Nordstrom.\n\n\"Every department store will say they value customer service, but Nordstrom took it to an extreme and said the most important thing was the customer experience and good service.\"\n\nWhen a customer returns something, say a dress, and it appears to have been worn, Professor Kulik says the workplace culture makes it easy for the employee to know what to do.\n\n\"It gives it give them some freedom to say, what is most important is service to customer, so I can go ahead and accept this item [regardless of whether it has been worn].\"\n\nSign up to the ABC Lifestyle newsletter Get a mid-week boost and receive easy recipes, wellbeing ideas, and home and garden tips in your inbox every Wednesday. You’ll also receive a monthly newsletter of our best recipes.\n\nA toxic workplace culture may mean an employee feels unsafe, says Professor Brough.\n\n\"Any issues around conflict in workplace — that's one of the strongest predictors of psychological injury.\n\n\"Any sort of … racial, sexual, gender prejudice that happens — any of those issues obviously produce a very difficult, unsafe, toxic work environment.\"\n\nLeaving full-time work for comedy Leaving my day job was the only way to circuit break my life back into balance. Six months later, life is very different.\n\nSpotting a workplace culture\n\nThere are several ways you can identify a workplace's culture before working there, including their website, reputation, and asking the right questions.\n\nPublic image and consistency\n\nYou can tell a lot from an organisation's public image, our experts say.\n\n\"See what the company says is their culture,\" suggests Professor Kulik.\n\n\"Look at things like their website, their mission statement, their social media.\"\n\nShe says while naturally a company will only say positive things about itself, look for consistency.\n\n\"If every time the organisation talks about itself, it's always describing innovation, always talking about community, that is a really good signal.\"\n\nShe says if a company's mission statement says it values diversity and inclusion, you can also try to fact check.\n\n\" [If] you look at photos of management and it's all white men, you can maybe question that. \"\n\nReputation\n\nProfessor Kulik says to \"listen to the stories\" of past and current employees.\n\nShe says there are useful online workplace review platforms where current and former employees can anonymously share reviews and insights about their employers.\n\nWhile you are likely to mainly see negative reviews, Professor Kulik says look for consistency.\n\nIf the same issue is raised again and again, that might be a red flag.\n\nProfessor Brough says if you don't feel comfortable approaching employees directly, you could ask during your interview if there is anyone else you can talk to.\n\n\"Most companies, if they didn't have much to hide, would entertain that idea.\n\n\"Ask about the more informal aspects of the culture; what's it like working here? Where do people eat lunch?\"\n\nExperience with the organisation\n\nYou can get a sense of the culture by how the organisation responds to you as applicant, says Professor Kulik.\n\n\"If it takes months and months, and you never hear anything, that tells you something about how they value your time.\"\n\nIf you have any direct experience with the company as a customer, client or consumer, for example, that is also worth reflecting on.\n\nQuestions to ask\n\nProfessor Brough says you should feel confident to ask about company culture during an interview.\n\nQuestions like:\n\nHow much support do staff receive from managers and each other?\n\nIs there conflict between teams or departments?\n\nWhat are the career development opportunities?\n\nHow much autonomy do I have over where I work, my hours of work, who I work with?\n\n\"Autonomy and flexibility is an important predictor of a healthy workplace,\" Professor Brough says.\n\nWhat to watch for\n\nProfessor Kulik warns not to get \"distracted by rhetoric\".\n\n\"Look for actions, behaviours.\n\n\"Don't be distracted by free snacks or bring your pet to work day.\"\n\nAdd to your watchlist The critically acclaimed Mystery Road: Origin returns as Detective Jay Swan (Mark Coles Smith) and Mary (Tuuli Narkle) uncover dark secrets in a haunted timber town, where the past threatens to tear them apart.\n\nThose \"gimmicks\" might sound nice, but might not be true reflections of company values, says Professor Brough.\n\n\"There might be somewhere that talks about having a healthy workplace because they have a walking track to use at lunchtime.\n\n\"You think that sounds lovely, but in reality, people are eating lunch at their desks, or it's too hot to go for a walk because there's no shade.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-10-21/american-chess-grandmaster-daniel-naroditsky-dies/105915456",
        "title": "American chess grandmaster Daniel Naroditsky dies aged 29",
        "publish_date": "Mon, 20 Oct 2025 23:45:02 +0000",
        "category": "sports",
        "authors": [],
        "text": "American chess grandmaster Daniel Naroditsky has died at the age of 29, his family has said.\n\n\"It is with great sadness that we share the unexpected passing of Daniel Naroditsky,\" the family said in a statement released by his club, the Charlotte Chess Center, on Monday.\n\n\"Daniel was a talented chess player, commentator and educator, and a cherished member of the chess community, admired and respected by fans and players around the world.\"\n\nNo cause of death was given.\n\nBorn in California in 1995, Naroditsky was one of the United States' most recognisable chess figures.\n\nA former world youth champion, he became a grandmaster in 2013.\n\nStream End Game with Tony Armstrong on ABC iview Tony Armstrong will tackle Australia's overdue reckoning with racism in sport, with the help of some of its biggest sports stars.\n\nIn addition to competing – he finished ninth in the blitz world championship last year – he was a popular commentator, writer and online educator.\n\nNaroditsky streamed regularly on platforms such as Twitch and YouTube.\n\nPlayers and fans praised his teaching skills and friendly personality as tributes poured in from around the world.\n\n\"I'm devastated,\" American world number two Hikaru Nakamura said.\n\n\"This is a massive loss for the world of chess.\"\n\nDanny Rensch, one of the key figures with prominent chess website Chess.com, described Naroditsky as \"more than an amazing, inspirational face of our game — he was a friend and brother\".\n\n\"The news is devastating for the chess world and all who knew him. It’s impossible to put words to this kind of loss,\" Rensch said.\n\nReuters/ABC",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-10-21/agricultural-livestock-big-cow-art-popular-genre-paintings/105858568",
        "title": "The hidden story behind this painting of a huge bull",
        "publish_date": "Mon, 20 Oct 2025 23:13:32 +0000",
        "category": "entertainment",
        "authors": [],
        "text": "A visitor favourite at the Art Gallery of Ballarat is an 1887 oil painting of a man in a top hat standing next to what can only be described as an absolute unit of a bull.\n\nThe rectangular beast — built like a proverbial brick shithouse — elicits a giggle from even the most serious gallery-goer.\n\nBut the title, Henry Stone and his Durham Ox, does little to explain why such a painting was made in the first place.\n\nIf we look through the pages of art history, we can find several other artworks showcasing enormous livestock.\n\nSo what's the deal with this niche genre of painting I'm calling \"Big Cow\"?\n\nVery big cow, or very small man? You decide. (Supplied: National Museums Scotland, National Museum of Rural Life)\n\nBallarat's ox\n\nThomas Flintoff was an English-born painter and photographer who spent time in the US before following the gold rush to Victoria in 1853.\n\nHe set up a photography and painting studio in Ballarat where he made portraits of locals, and eventually relocated to Melbourne.\n\nThomas Flintoff's trade cut advertising his premises on Sturt Street, Ballarat. (Supplied: State Library Victoria)\n\nNear the end of his life, he executed the 1.2-metre-wide oil painting of Henry Stone — a wealthy Melbourne butcher — standing with an enormous red bull.\n\nBut this painting was no novelty. In fact, it was a very specific reference to a legendary animal from 100 years earlier.\n\nThe history of Big Cow art\n\nSince the dawn of time, humans have painted animals.\n\nIndeed, the \"Big Cow\" genre can be dated as far back as the Upper Palaeolithic period: the famous Lascaux Cave in France contains more than 30 paintings of bulls, the largest measuring over five metres long.\n\nThe Lascaux paintings date to around 17,000 to 22,000 years ago. (Image: wikimedia commons)\n\nThe Lascaux artists painted wild animals though, as it wasn't until 10,000 years ago that humans began domesticating cattle in the Middle East.\n\nHumanity's reverence for large cattle had always been linked to the ancient knowledge that big cow equals more food, but with the invention of farming came the realisation that more cow food equals bigger cow.\n\nBut it wasn't until the 18th century that a boom in selective breeding and animal science really took off in Europe, bringing about new, specially-bred bovine of truly phenomenal proportions.\n\nThe OG Durham Ox\n\nIn March, 1796 a calf was born on the Ketton Hall estate in Brafferton, north-east England. He was an early Shorthorn, a type of cattle bred specifically to grow to a gargantuan size.\n\nUnits of measurement were sometimes inconsistent (or prone to exaggeration) back then, but it's estimated this steer — who became known as the \"Durham Ox\" — weighed in at more than 1700kg. That's the same as an SUV.\n\nBritish livestock was going through a boom at the time. The introduction of turnip crops in the 1730s had provided a source of food for cows over the winter, allowing farmers to keep fattening their herds up for longer before sending them to slaughter.\n\nLoading Instagram content\n\nThe Durham Ox was a particularly juicy specimen.\n\nIn 1801 he was purchased by a travelling showman-agriculturalist named John Day who toured the creature all over the country, turning a nice profit on ticket sales.\n\nIt's hard to believe that in the early 19th century people really lined up and paid their hard-earned pennies to see a big cow (I guess they didn't have social media).\n\nBut part of John Day's genius marketing strategy was getting the image of the beast out there in front of the public's eyeballs.\n\nNot only did he sell merchandise at his shows, but artists were invited to make paintings, drawings, and (most importantly) prints of the Durham Ox, which circulated far and wide — as far as the fledgling colonies on the other side of the world.\n\nCeramics like this were popular merch at the fairs and exhibitions where John Day exhibited the Durham Ox. (Image: Bidsquare)\n\nTo viewers in the 1880s, Thomas Flintoff's painting in the Art Gallery of Ballarat was making a very clear reference to the original Durham Ox, telling us that this agricultural icon remained ingrained in people's memories for at least a century.\n\nIt's telling, too, that although Thomas Flintoff was also a photographer, he was asked to paint Stone's animal, not photograph it.\n\nOn one hand, an oil painting better replicates the style of the images of the original Durham Ox (who lived long before the invention of the camera). On the other hand, the painter is better placed to manipulate and exaggerate reality, while the photographer is more tethered to it.\n\nReplicating the style of English agricultural paintings — decades after the invention of photography had made this type of image redundant — was also a way for colonial Victoria to assert its ties to the old world.\n\nIndeed, the landscape in which Henry Stone and his tractor-sized ox stand barely looks recognisable as Australia.\n\nJoan Ross's hand-painted digital collage on paper, Balla Arat, was commissioned by the Art Gallery of Ballarat in 2024. (Courtesy of the artist and N.Smith Gallery, Sydney)\n\nA Ballarat icon\n\nSince it was acquired by the Art Gallery of Ballarat in 1979, Henry Stone and his Durham Ox has been a favourite of locals and visitors alike.\n\nAnd just as Thomas Flintoff referenced the original Durham Ox in his 1887 painting, contemporary Australian artists have even incorporated the iconic silhouette of Henry Stone's bull into their works, giving new life to this prodigious beast.\n\nAnna Glynn's Flintoff swallows von Guerard, created in 2020, is a tribute to Henry Stone and his Durham Ox. (Supplied: Anna Glynn)\n\nJoan Ross's 2024 digital collage Bella Arat uses Flintoff's Ox to playfully interrogate the ways the Victorian landscape has been shaped by colonialism, while Anna Glynn's 2020 watercolour, Flintoff swallows von Guerard critiques the canon of Australian landscape painting and reflects the sublimation of nature by two centuries of agriculture.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-10-21/accommodation-in-demand-in-rockhampton-before-2032-olympic-games/105909492",
        "title": "Abandoned hotels may help solve rental crisis ahead of Olympic Games",
        "publish_date": "Mon, 20 Oct 2025 22:37:29 +0000",
        "category": "finance",
        "authors": [],
        "text": "As the majority of regions in Queensland battle vacancy rates of less than 1 per cent and the 2032 Olympic Games pending, tourism organisations and a regional council are turning their attention to abandoned homes, hotels and commercial buildings.\n\nAccording to Australian Bureau of Statistics data, 192,393 properties were vacant on Census night in 2021, which equated to 8.7 per cent of the state's total dwellings.\n\nIn the central Queensland city of Rockhampton, the seven-storey Plaza Hotel with 66 rooms has been closed on and off for the past decade.\n\nRockhampton Regional Council's Grant Mathers said it was frustrating that the rooms were going to waste.\n\nGrant Mathers says rooms are going to waste while people are homeless. (ABC Capricornia: Vanessa Jarrett)\n\n\"Unfortunately, it doesn't send a good message at all. Everyone is dealing with homelessness, people sleeping in the parks and on the streets,\" the councillor said.\n\nAccording to REIQ's 2025 Residential Vacancy Rate Report for the June quarter, 34 regions out of 50 in the state have a rental vacancy rate at or below 1 per cent.\n\nRockhampton's was 0.7 per cent.\n\n\"Most parts of regional Queensland are sitting at well below what we consider to be a healthy range, [which is] one that sits between 2.6 up to 3.5 per cent, whereas most parts of regional Queensland and central Queensland in particular are sub 1 per cent,\" REIQ chief executive officer Antonia Mercorella said.\n\nAntonia Mercorella says rentals are tight across the whole country. (ABC News: Lucas Hill)\n\n\"So certainly very tight rental conditions, and I should point out that this issue is not necessarily exclusive to Queensland. We are seeing tight vacancy rates across most parts of the country at the moment.\"\n\nMs Mercorella said she understood why the community was asking why hotels could not be converted for permanent rental accommodation, but it was not that simple.\n\n\"The hotel may not be licensed for that purpose, and there could also be zoning and other council-related regulations that could prevent that, so that's probably one of the primary concerns,\" she said.\n\n\"The other issue is, of course, that in Queensland, permanent rental properties are governed by residential tenancies legislation, and that does come with a series of very strict legislative obligations that may be challenging to meet if you were trying to use a hotel for permanent rental accommodation.\n\n\"I'm not saying it's impossible, but there are certainly some prospective obstacles that one would face.\"\n\nThe council has installed a fence around the Plaza Hotel and boarded up access points to deter squatters. (ABC Capricornia: Vanessa Jarrett)\n\nIn Rockhampton, the council has gone down the legal route of action against the owners of the closed Plaza Hotel.\n\nIt recently had a Public Health Order enforced in court for the clean-up of the hotel site.\n\n\"I get it. I don't think local council should have the ability to be able to walk into private residences and demand for this to be done and that to be done, but there are times when we need to act and we need to take the legal opportunities that are available to us,\" Mr Mathers said.\n\nMore short-term accommodation needed\n\nTourism operators are also frustrated by a lack of short-term accommodation, something they believe needs to be addressed before the 2032 Olympics.\n\n\"When it comes to freehold land, it can be really frustrating for organisations like mine, for the general community, for local and state government in regards to them sitting there bare when we have a desperate need for accommodation,\" Capricorn Enterprise chief executive officer Mary Carroll said.\n\nMary Carroll says there is a desperate need for more short-term accommodation. (ABC Capricornia: Katrina Beavan)\n\nThe Capricorn Resort on the coast in Yeppoon closed in 2016, and its 331 rooms are now deteriorating.\n\nIndependent research from Tourism Events Queensland last year found 1,219 short-term accommodation rooms were needed in the Rockhampton and Capricorn Coast region before 2032.\n\nMost of the accommodation is filled by fly-in fly-out workers on construction projects like the $1.98 billion Rockhampton Ring Road and the $983 million Fitzroy to Gladstone pipeline.\n\n\"We are desperate for these new short-term rooms because I'm losing short-term accommodation in unit complexes to long-term bookings, either people living in them and taking them out of the rental pool, or major jobs like the Rockhampton Ring Road taking up a lot of rooms with their workers,\" Ms Carroll said.\n\nThe Fitzroy River in Rockhampton is set to host rowing and canoe sprints for the 2032 Games. (Supplied: Rockhampton Grammar School)\n\nThe figure was calculated before Rockhampton was named as the host of the 2032 Olympic rowing and canoe sprint.\n\n\"We're waiting for that work to be redone to see what that figure will be, but at the moment we're standing here with high 90 per cent occupancies across our region for much of the year,\" Ms Carroll said.\n\nWith more sports set to be held across regions in the state, Ms Mercorella said it would not be just accommodation needed for the games, but the construction leading up to it.\n\n\"We really need to be thinking about how we're going to be creative about ensuring that we have adequate accommodation,\" she said.\n\n\"We'll need to think very carefully about how we're going to ensure that this event is a success, and how we can continue to house our local population as well as some of those visitors who will be more transient in nature.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-10-21/mona-lisa-gold-toilets-louvre-jewels-history-art-heists/105914884",
        "title": "As this fascinating history of art heists shows, timing is everything",
        "publish_date": "Mon, 20 Oct 2025 22:23:33 +0000",
        "category": "entertainment",
        "authors": [],
        "text": "The world's largest art museum, the Louvre, has approximately half a million objects in its collection, with about 30,000 on display, and sees on average 8 million visitors per year. That's big on any scale, with a lot of people and objects to keep watch over. And Sundays are particularly busy.\n\nIn a cleverly conceived operation, four men wearing fluorescent vests pulled up at the Louvre in a flat-decked truck at 9:30 on Sunday morning. Quickly setting to work, they raised an extendable ladder to the second storey. Climbing it, they cut through a window, entered the Galerie d'Apollon and, brandishing power tools, helped themselves to nine exquisite objects.\n\nWhat we know about the Louvre jewellery heist Here are the details on the items stolen in the Louvre heist that unfolded in broad daylight in Paris.\n\nThe objects taken were France's royal jewels, formerly belonging to the Empress Eugénie, Napoleon III's wife and arts patron.\n\nThis is where it gets tricky for the thieves: What can you do with these priceless objects? They can't wear them — too big and glitzy to go unnoticed — and they can't sell them legitimately as images of them are all over the internet.\n\nThe best-case scenario, from the thieves' perspective, is to break them down, melt the precious metals and sell the gems separately.\n\nEmpress Eugenie's crown, which the perpetrators took and subsequently dropped as they fled the scene on motor scooters, contains eight gold eagles, 1,354 brilliant-cut diamonds, 1,136 rose-cut diamonds and 56 emeralds. In short, this amounts to a sizeable stash of individual gems to try and sell.\n\nTiming is everything\n\nFor the Louvre, any heist is a major blow. It calls into question their security, both electronic and human. Five security staff were nearby and acted to protect visitors, and the alarms did ring, but the entire heist was completed within seven minutes.\n\nTiming is crucial with heists.\n\nIn 2019, an 18-karat gold toilet titled America (2016), from the artist Maurizio Cattelan, was stolen from Blenheim Palace, England. It was taken in five and a half minutes. It weighed 98 kilograms and was fully functioning. In other words, the two men who took it (and were later caught and served prison sentences for their crimes) worked quickly and efficiently. At the time of the theft, as gold bullion it was estimated to be valued at $6 million.\n\nMaurizio Cattelan's 18-karat gold toilet, titled America, was stolen in 2019. It weighed 98 kilograms. (AP)\n\nVan Gogh's painting The Parsonage Garden at Neunen in Spring (1884) was stolen from the Singer Laren Museum, in the Netherlands, during its 2020 COVID closure. It was recovered in late 2023 after an investigation by Dutch art detective Arthur Brand.\n\nThe 2017 theft of two Gottfried Lindauer paintings from Auckland's International Art Centre took just a few minutes to complete. The thieves ram-raided the front window of the auction house where the paintings, valued at $NZ1 million ($882,000), were displayed. The portraits were recovered five years later through an intermediary, with only minor damage.\n\nRecovering the stolen\n\nThe National Gallery of Victoria's Picasso painting Weeping Woman (1937) was famously taken by the Australian Cultural Terrorists in 1986 — but only noticed as missing two days later.\n\nRecovered just over two weeks later, the painting was left for the gallery staff to collect in a locker at Spencer Street railway station. The motivation behind the theft was to highlight the lack of financial support given to Victorian artists, but the true identity of the thieves remains a mystery.\n\nPicasso's The Weeping Woman (1937) was stolen from the NGV by the Australian Cultural Terrorists in 1986. (AAP: Joe Castro)\n\nIn 1986, 26 paintings of religious subjects were stolen from the gallery at the Benedictine Monastery at New Norcia, Western Australia.\n\nThe thieves were poor planners: They hadn't factored in that three men and the stash of paintings couldn't fit into a Ford Falcon. The paintings were cut from their frames, ostensibly butchered. One was completely destroyed. The thieves were caught and charged.\n\nWhere to next for the thief?\n\nRecovery of objects from heists is low. It's impossible to put a number on, but some say art recoveries globally are possibly as low as 10 per cent.\n\nPaintings are more difficult to sell on — you can't change their physical appearance to the point of not being recognised.\n\nHowever, with objects such as the gold toilet or jewels, the precious materials and gems can be repurposed. Time will tell if the Napoleonic jewels will be recovered.\n\nNever say never. The Mona Lisa (1503), undoubtedly the main attraction at the Louvre, was stolen in 1911 and recovered two years later. The thief, Vincenzo Peruggia, was an Italian handyman working at the Louvre and was caught trying to sell it.\n\nThe Mona Lisa, at the Louvre, was stolen in 1911 and recovered two years later. (Reuters: Gonzalo Fuentes)\n\nThis latest heist at the Louvre highlights the vulnerability of objects in public collections — the irony being they're often gifted to such institutions for safekeeping.\n\nThose who guard objects are usually paid a minimum wage and yet they are tasked with a huge responsibility. When budget cuts are made, it's often security staff that are reduced — such as the Art Gallery of New South Wales's announcement just last week.\n\nThe thieves on Sunday knew what they were after and why. We aren't privy to their motivation. We know the stolen jewels are part of France's history and are irreplaceable. Their theft denies visitors of experiencing them individually for their beauty and craftsmanship, as well as collectively within the context of France's history.\n\nBut part of me can't help thinking how the French were partial to helping themselves to artworks and precious objects belonging to others. So perhaps this could be a case of déjà vu.\n\nPenelope Jackson is an adjunct research associate at the School of Social Work and Arts at Charles Sturt University. Her book Unseen: Art and Crime in Australia (Monash University Publishing) will be published in December 2025. This piece first appeared on The Conversation.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-10-21/nfl-star-doug-martin-dies-after-struggle-with-police/105914918",
        "title": "Former NFL running back Doug Martin dies after struggle with police",
        "publish_date": "Mon, 20 Oct 2025 22:02:48 +0000",
        "category": "sports",
        "authors": [],
        "text": "Former All-Pro NFL running back Doug Martin died on the weekend after a struggle with police officers who were taking him into custody in Oakland in the United States.\n\nMartin, best known for his stellar career with the Tampa Bay Buccaneers, became unresponsive after being arrested early Saturday local time, according to a statement released by the Oakland Police Department.\n\nHe was transported by paramedics to a hospital where he died, police said.\n\nHe was 36.\n\nA cause of death has not been released. An autopsy will be conducted, the Alameda County Coroner's Office said.\n\nPolice said in a statement that Martin was involved in a break-in and that a \"brief struggle\" happened as police were attempting to detain him.\n\nThe department did not release any other details.\n\nMartin, originally from Oakland, lived in Stockton, where he played high school football.\n\nHis family issued a statement over the weekend asking for privacy as they grieve.\n\nPolice and Oakland's mayor said they had reached out to the family.\n\n\"We mourn the loss of Doug Martin, an Oaklander, who had a distinguished NFL career and tragically passed away Saturday morning. Our condolences are with his family and loved ones,\" Mayor Barbara Lee said Monday in a statement.\n\nStream End Game with Tony Armstrong on ABC iview Tony Armstrong will tackle Australia's overdue reckoning with racism in sport, with the help of some of its biggest sports stars.\n\nHis death is being investigated by police, the city police commission, the community police review agency and the county district attorney's office.\n\nMartin was the 31st overall pick in the first round of the 2012 NFL draft after a stand-out career at Boise State.\n\nHe rushed for 1,454 yards and 11 touchdowns as a rookie and was selected to the Pro Bowl.\n\nHe was named first-team All-Pro and made the Pro Bowl again after rushing for 1,402 yards and six touchdowns in 2015.\n\nMartin finished his career with 5,356 yards rushing and 30 touchdowns in six seasons with the Buccaneers and one with the Raiders.\n\nHe also had 148 catches for 1,207 yards and two scores.\n\n\"We are deeply saddened to learn of the sudden and unexpected passing of Doug Martin,\" the Buccaneers said in a statement.\n\n\"Doug made a lasting impact on our franchise.\"\n\nMartin was selected one of the top 50 players in franchise history as part of the team's 50th anniversary celebration.\n\nThe ABC of SPORT Sports content to make you think... or allow you not to. A newsletter delivered each Saturday.\n\nAP",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-10-21/horse-racing-ws-cox-plate-winner-so-you-think-dies/105914886",
        "title": "'Perfection on four legs': Legendary Cox Plate winner So You Think dies",
        "publish_date": "Mon, 20 Oct 2025 22:00:34 +0000",
        "category": "sports",
        "authors": [],
        "text": "Two-time WS Cox Plate winner So You Think has died following a short illness.\n\nStud Coolmore Australia confirmed the 10-time Group 1 winner died while receiving care at Scone Equine Hospital in the New South Wales Hunter region.\n\nTrained by the late Bart Cummings and Aidan O'Brien, So You Think won back-to-back Cox Plates In 2009-10.\n\nJockey Glen Boss rode him to his first win and Steven Arnold took the reins the following year.\n\nSo You Think also triumphed overseas, with the 2012 Prince of Wales's Stakes at Ascot among his most famous victories.\n\nVia a statement on X, Coolmore Australia said So You Think was \"already responsible for 12 individual Group 1 winners\" as a sire.\n\n\"He was an absolute gentleman, an incredibly kind and intelligent horse and this is a sad day for all the staff that have looked after him so well at Coolmore since he retired in 2012,\" Coolmore Australia's Tom Magnier said.\n\n\"We are so lucky to have had him and watch him develop into one of the country's truly elite sires.\n\nStream End Game with Tony Armstrong on ABC iview Tony Armstrong will tackle Australia's overdue reckoning with racism in sport, with the help of some of its biggest sports stars.\n\n\"He provided me with so many great memories on racetracks throughout the world as both a racehorse and a stallion.\"\n\nCummings – who looked after 12 Melbourne Cup winners – described So You Think as \"perfection on four legs\" and the \"most genuine horse\" he had trained.\n\nBorn in 2006 and sired by High Chaparral, So You Think finished third in the 2010 Melbourne Cup.\n\nIn 2011-12, he won consecutive Tattersalls Gold Cup in Ireland.\n\nSo You Think was inducted into the Australian Racing Hall of Fame in 2019.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-10-21/strawberry-shortage-in-supermarkets-as-growers-face-challenges/105911558",
        "title": "Strawberries hard to come by as weather extremes affect supply",
        "publish_date": "Mon, 20 Oct 2025 21:34:12 +0000",
        "category": "finance",
        "authors": [],
        "text": "Strawberries have been harder to find on the supermarket shelves as growers across the country face challenges with the weather.\n\nQueensland's main strawberry season usually finishes in September and October, when growers further south take over.\n\nBut hot, dry weather in the Sunshine State is ending the peak season early there, while berries in other parts of the country are ripening later.\n\nMatt Gallace, a strawberry grower from the Mornington Peninsula in Victoria, said a cold winter had set his plants back.\n\n\"We're still probably two weeks behind where we would normally be at this time of year,\" he said.\n\nColes has informed customers that strawberry supply may be limited. (ABC Rural: Jennifer Nichols)\n\nProduction down in Queensland\n\nWith unreliable strawberry supplies in recent weeks, prices in the shops have edged up.\n\nStrawberries are currently retailing in the major supermarkets for around $4.50 to $5 for a 250g punnet.\n\nThat is much lower than the heady prices of $11.99/250g in Canberra in June 2022, but up from $2.50 a punnet more recently.\n\nQueensland Strawberry Growers Association president Adrian Schultz said weather extremes had resulted in a 20-30 per cent drop in yield during the winter/spring season.\n\nAdrian Schultz says hot weather is ending the Queensland season earlier than usual. (ABC Rural: Jennifer Nichols)\n\nThe start of the season was plagued by weeks of rain and damaged fruit that had to be thrown away.\n\nMr Schultz said a \"very, very hot and dry\" few days in September and hot days in October were ending the season earlier than usual in key growing areas.\n\n\"That finished off a lot of farms up here, there just was no fruit left. It got the plants to shut down,\" he said.\n\n\" It could have an effect on prices over the next couple of weeks until production goes back to normal. \"\n\nHydroponic farms in Queensland, which have more control over water and nutrition by growing strawberries on tabletops, have been able to continue growing fruit for longer.\n\nRipening has been delayed in Victoria because of cold weather. (ABC Rural: Jennifer Nichols)\n\nSlower ripening in the south\n\nMr Gallace plants his strawberries at Main Ridge in Victoria between April and June, and usually starts picking from October.\n\nBut this year the berries are ripening later.\n\n\"Strawberries like warm nights and we haven't had many warm nights over the last few months, so we're behind by about two weeks in terms of our season down here,\" he said.\n\nHe is not the only one, with growers in the Yarra Valley and other southern regions also delayed.\n\n\"Everyone is behind and it's just been purely because the climate, the cold winter has just set those plants back a little bit,\" Mr Gallace said.\n\nBut he said it would not be long until picking ramped up.\n\n\"Probably another week or two away, the price will start to ease in the supermarkets and your local fruit and veg shop,\" he said.\n\nHot, dry weather in the north and cold weather in the south have disrupted strawberry supplies. (ABC Rural: Jennifer Nichols)\n\nSupply to 'return to normal' soon\n\nMajor supermarkets Woolworths and Coles have placed signs on the shelves alerting shoppers to the shortages.\n\n\"Due to weather impacts on crops, we are experiencing some impact on strawberry supply,\" a Woolworths spokesperson said.\n\nThe spokesperson said there would be more strawberries on the shelves soon.\n\n\"We are working closely with our suppliers and anticipate these impacts will only be short-term and supply will soon return to normal,\" the spokesperson said.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-10-21/chris-minns-government-takeover-northern-beaches-hospital/105914848",
        "title": "Parents of boy who died at hospital say $190m deal will avert 'heartbreak'",
        "publish_date": "Mon, 20 Oct 2025 21:27:00 +0000",
        "category": "finance",
        "authors": [],
        "text": "The parents of a toddler who died at Northern Beaches Hospital and exposed concerns about its public/private model have applauded a proposed $190 million government deal to wrest back control.\n\nThe entire hospital will move into public hands, after the state government reached an in-principle agreement with the receivers of cash-strapped private operator Healthscope.\n\nTaxpayers will fork out $190 million to take control of all 494 beds, while clinical and support staff will be offered jobs with NSW Health.\n\nSince its opening in 2018, the hospital has operated under a public/private model, with Healthscope providing care to public patients under a contract with the government.\n\nHowever, the death of two-year-old Joe Massa last year exposed a series of deficiencies, leading the state government to negotiate taking back control of the hospital.\n\nToddler Joe Massa died at Northern Beaches Hospital last year. (Supplied)\n\nPremier Chris Minns said his government was reversing one of the \"worst decisions\" of the previous Coalition government, which he said had \"foisted\" a private hospital model on the people of the Northern Beaches.\n\n\"Our state's acute hospital services, that provide lifesaving care to the people of New South Wales, should not be privatised,\" he said.\n\n\"Thanks to this decision, no hospital in NSW will be.\"\n\nMr Minns confirmed this morning the government would pay $190 million to take over the hospital. (ABC News: Ethan Rix)\n\nHe also paid tribute Joe Massa's parents, Elouise and Danny, who have campaigned for the hospital to return to public hands.\n\n\"Their advocacy will leave a lasting legacy for every patient and every family who relies on our public health system,\" Mr Minns said.\n\nMs Massa said her son's case was not isolated and his love had given the couple the \"fierce determination\" to fight for the change to the operating model of the hospital.\n\n\"We don't want anyone else going through what we have gone through — the absolute torment, the heartbreak,\" Ms Massa told the media, while holding Joe's shoes.\n\n\"I believe it's also Joe's love that has guided the government to ensure that public safety is at the forefront of all decision-making at Northern Beaches Hospital and beyond.\n\n\" Joe will leave behind footprints that we will never forget in NSW. \"\n\n'Complex' change\n\nThe Northern Beaches Hospital. (ABC News: Nicolle Chettle)\n\nIn September, the government announced NSW Health staff had been embedded within the hospital, to begin its transition to public hands.\n\nHowever, Health Minister Ryan Park has repeatedly spoken of the difficulties in taking back a \"public portion\" of the hospital, while leaving another portion for a private provider.\n\nAMA NSW president Kathryn Austin urged the government to explain what the move to making the hospital a \"fully public operation with 'private services'\" will mean in practice for patients, staff and service providers.\n\nMr Park said on Tuesday the operating model and partnerships with private providers at the hospital had not yet been settled but he did not foreshadow a reduction in services.\n\nNSW Health Minister Ryan Park with Elouise and Danny Massa. (ABC News: Abbey Haberecht)\n\nMr Park said navigating the change in hospital structure and management had been \"complex\" and \"challenging\" and the deal was an \"important step forward\".\n\n\"It [the deal] marks the beginning, not the end, of what will be a change in model of the way in which that hospital works,\" he said.\n\nHe said he did not have an overall cost to the government for taking over the hospital.\n\nTreasurer Daniel Mookhey said the $190 million deal would just cover the money spent to build Healthscope's facilities, not past or future profit, in a departure from the initial contract.\n\nThe in-principle agreement will now go to Healthscope lenders group for approval, Mr Mookhey said.\n\nMany of the hospital's facilities are shared, creating significant challenges when it comes to the division of assets.\n\nWhile bringing the whole hospital into public control will eliminate that uncertainty, it will raise more questions about the future of the specialist services currently offered at the facility.\n\nNSW Nurses and Midwives' Association general secretary Shaye Candish said it had been an \"extremely unsettling and stressful time\" for staff at the hospital and welcomed the proposed deal.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-10-21/sa-government-confident-of-recouping-hydrogen-power-plant-costs/105910680",
        "title": "SA government hopes generator sales can recoup shelved hydrogen plant costs",
        "publish_date": "Mon, 20 Oct 2025 21:20:50 +0000",
        "category": "finance",
        "authors": [],
        "text": "South Australian taxpayers will fork out more than $250 million on generators for the scrapped Whyalla hydrogen plant — but the state government says it is confident it will recoup the money through a competitive sale process.\n\nA report by the state's auditor-general last week showed the government spent $285.2 million on hydrogen over the past three years, and another $125 million will be paid out this financial year.\n\nThe Energy and Mining Department also disclosed an $87.4 million \"contingent liability\", which the government could be forced to pay for electricity infrastructure around Whyalla.\n\nAt a parliamentary committee hearing on Monday, the opposition seized on the figures as evidence \"South Australian taxpayers may be up for $500 million and no hydrogen plant to show for it\".\n\nReports show the SA government has spent $285.2 million on the scrapped hydrogen plant at Whyalla. (ABC News: Brant Cumming)\n\nAuditor-general Andrew Blaskett replied: \"Certainly that is a correct interpretation if all of the costs come to fruition in terms of the contingent liability, but also if you don't include the recovery of costs through the turbine sale\".\n\nThe government insists much of the cost will be recouped or can be invested and used elsewhere.\n\nSA government's $285m spend on hydrogen revealed South Australia's Office for Hydrogen Power spent more than $280 million before the state government scrapped the agency amid the failure of its Whyalla hydrogen project.\n\nThe Malinauskas government had allocated $593 million to build a hydrogen power plant in Whyalla, setting up an Office for Hydrogen Power in May 2022 to deliver on its pre-election hydrogen promises.\n\nThe hydrogen project was effectively cancelled in February 2025 after months of speculation about a cost blowout as the private sector pulled out of green hydrogen projects across Australia.\n\nThe government said it diverted the money for the hydrogen project to support its takeover of the embattled Whyalla steelworks.\n\nAuditor asked not to reveal turbine costs\n\nMr Blaskett said the government intended to recover the cost of the turbines.\n\nBut he said the department asked him not to disclose how much the government had paid for them \"as it may impair their sale process\".\n\nHours later, Treasurer Tom Koutsantonis revealed the government was spending upwards of $250 million on the turbines.\n\n\"Currently today there is a three-year wait on anyone wanting to buy new generators so we are in an excellent position to recoup these costs in full,\" he said.\n\nTom Koutsantonis has said the expenditure on early works could be reinvested. (ABC News: Ashlin Blieschke)\n\n\"We spent money on land, which we own, we spent money on electrical infrastructure and substations for the steelworks which they will use and ultimately pay for, and we will recoup the cost of the generators in full if not more than they cost us.\"\n\nThe government's $285.2 million spend over three years included $85.7 million which was written off because it related to early works on designing hydrogen production and storage in Whyalla.\n\nMr Koutsantonis has said the $85.7 million expenditure on early works can be used in the future — but Mr Blaskett said such a scenario was unlikely.\n\n\"It's not unheard of but very rare, I think, for something that's been written off in the nature of this to come back and actually have value in the future,\" Mr Blaskett said.\n\nMr Blaskett said the extra $125 million, to be paid by the end of this financial year, also included some expenditure on the turbines — but he was unable to give a breakdown.\n\nRegarding the \"contingent liability\", Mr Blaskett said it is not yet known how much of the $87.4 million the government will need to pay.\n\n\"If industrial take-up in the Whyalla area means that electricity companies are able to recover the cost of the infrastructure they've put in by charging to other clients, then there's certainly potential for it to be much lower,\" he said.\n\nOpposition energy spokesperson Stephen Patterson said the government's spending on hydrogen was \"scandalous\".\n\n\"The government have been tricky in saying they'll use the turbine to recover some of the capital costs,\" he said.\n\n\"But it was quite clear in black and white that of this $500 million there is over hundreds of millions of dollars that is not related to capital costs that can't be recovered.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-10-21/west-australians-draft-usa-womens-professional-baseball-league/105905754",
        "title": "Caitlin grew up playing baseball with the boys. Now she's on the cusp of history",
        "publish_date": "Mon, 20 Oct 2025 21:13:09 +0000",
        "category": "sports",
        "authors": [],
        "text": "When Caitlin Eynon was 12, she faced a choice between following her peers into softball or pursuing the male-dominated sport she really loved — baseball.\n\nA decade later, it is a decision that has her on the cusp of history, as American baseball prepares for the return of a professional women's league after a 70-year hiatus.\n\nEynon, 22, who grew up playing baseball predominantly in male teams, was accepted into the draft for the upcoming Women's Pro Baseball League (WPBL) in the United States.\n\nCaitlin Eynon says she hopes to be a role model for girls. (Supplied: Caitlin Eynon)\n\nThe Perth local said she continued playing in the hope of one day inspiring others.\n\n\"A lot of girls get pushed into softball, so I think trying to be that person … to show them that you can play baseball — you can do what you want to do\" she said.\n\n\"I've got two older brothers. They both played baseball growing up, so it was sort of a family thing.\"\n\nEynon beat over 450 hopefuls to form part of a 150-prospect draft pool for the new league launched by women's baseball pioneer Justine Siegal.\n\nTurning hobby into a career\n\nThe shortstop fielder and batter continued playing baseball as a \"hobby\" and was entirely self-funded.\n\n\"The thought of actually being paid to play the thing that you love to do every day is pretty exciting,\" Eynon said.\n\n\"It was cool to see some sort of pathway being put in place for girls … they have something to look up to now. It's like no — you could actually make a professional career out of this.\"\n\nThe opportunity to earn a living from baseball comes despite what Eynon described as \"geographical challenges\" faced by Australian baseballers.\n\n\"We don't get exposed to anywhere near the level of competition than the rest of the world,\" she said.\n\nCaitlin Eynon fielding for the Australian Emeralds. (Supplied: Caitlin Eynon)\n\nEven applying for the WPBL was not easy with Eynon unable to attend in-person tryouts in the US, instead creating a video package highlighting her skills.\n\nPerth to world stage\n\nEynon has spent three years at the Braves Baseball Club in Perth, and said it been an \"awesome\" place to progress her journey.\n\n\"They're so supportive of women's baseball … it's a good, good place to be.\"\n\nAt 13, Eynon appeared destined for great things, making her state women's debut, and by 20, she had represented Australia at a World Cup in Canada.\n\nIn April, she received the Golden Arm and Golden Glove awards for her pitching and fielding efforts at the Australian National Championships.\n\nBut she is not the only Braves baseballer holding out hope of being drafted in early November, with youth prodigy Leah Cornish also in the pool.\n\n'One of the best'\n\nCornish, 18, is a catcher and a batter who started playing baseball with her brothers after stints in softball and tee ball.\n\nMuch like Eynon, Cornish's baseball resume speaks for itself.\n\nAt just 13, she was named the best batter in the WA women's league, and at 15, she won the Golden Bat at the National Championships as part of a title-winning WA side.\n\nCornish was selected for the 2023 World Cup in Canada as a 16-year-old.\n\nLeah Cornish batting for Perth's Braves Baseball Club. (Supplied: Leah Cornish )\n\nShe said representing Australia at such a young age was a great opportunity to observe the best.\n\n\"I learn a lot from watching people, so it was definitely cool to watch all of them play and train,\" she said.\n\nRecently, Cornish spent six months in Quebec playing in the Canada East League, the first elite women's league in the country.\n\n\"She's probably one of the best hitters in the country,\" Eynon said of her teammate.\n\n\"She's a lot younger than me but I still learn a lot from her as well.\"\n\nLoading Instagram content\n\nAmanda Mirco, who coaches both women at the Braves, said she is not surprised they made it into the draft pool.\n\n\"They are two of the hardest working players I've seen in my time at the club\" she said.\n\n\"It's exciting … especially to have two Braves players nominated as part of nine Australians.\n\n\"We couldn't ask for better leaders, they are fantastic with the younger girls.\"\n\nThe final draft for the Women's Pro Baseball League will be announced next month ahead of the start of the league in 2026.",
        "source": "ABC"
    },
    {
        "url": "https://www.smh.com.au/sport/afl/gowers-explains-why-hawks-rejected-ridiculous-demands-that-doomed-merrett-trade-bid-20251020-p5n3v4.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Gowers explains why Hawks rejected ‘ridiculous’ demands that doomed Merrett trade bid",
        "publish_date": "Tue, 21 Oct 2025 12:51:10 +1100",
        "category": "sports",
        "authors": [
            "Jon Pierik"
        ],
        "text": "Hawthorn president Andy Gowers has defended the Hawks’ decision to reject Essendon’s demands for Zach Merrett, declaring it would have been ridiculous to have acquiesced to the Bombers.\n\nAnd club great Jason Dunstall said he never expected a “cordial” deal to be done, considering the bad blood between the two heavyweight clubs over the decades.\n\nZach Merrett met with Hawthorn, but a deal couldn’t be done. Credit: Getty Images\n\nMerrett was desperate to join the Hawks during last week’s trade period, but the Hawks and Bombers could not agree to a deal.\n\nThe Hawks offered two first-round selections, a future first-rounder and fringe midfielder Henry Hustwaite, but the Bombers wanted four first-round selections and a second-rounder.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/australia-news-live-aukus-reaffirmed-critical-minerals-deal-signed-in-albanese-trump-meeting-11-7-million-cocaine-shipment-seized-by-afp-chilean-police-20251021-p5n3y9.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Australia news LIVE: AUKUS reaffirmed, critical minerals deal signed in Albanese-Trump meeting; $11.7 million cocaine shipment seized by AFP, Chilean police",
        "publish_date": "Tue, 21 Oct 2025 12:50:55 +1100",
        "category": "finance",
        "authors": [
            "Alexander Darling",
            "Emily Kaine"
        ],
        "text": "Speaking from the Osborne Naval Shipyard in Adelaide this afternoon – a site where nuclear-powered AUKUS submarines are being manufactured – Minister for Defence Richard Marles has praised the outcome of today’s meeting between Albanese and Trump as an “important affirmation of the AUKUS program”.\n\n“The meeting between our Prime Minister and President Trump was a really important affirmation of the United States’ and Australia’s commitment to the AUKUS program. But I want to make a point that we’ve been consistently saying: that this is a program which is very much in the interests of the United States, as it is in the interests of Australia, as it is in the interests of the United Kingdom.\n\nPresident Donald Trump, left, greets Australian Prime Minister Anthony Albanese at the White House Credit: AP\n\nThe USS North Dakota, a Virginia-class submarine of the type Australia would acquire under the AUKUS deal.\n\n“And AUKUS is moving at a pace. When you meet these workers around here, you can touch, feel and see AUKUS occurring. And in the process, what we will see at this site, at the Osborne Naval Shipyard, is the building of our nuclear-powered submarines. And in time, this workplace will have 7000 employees working on submarines … and it will be the largest, the most complex industrial facility in our country,” Marles told the press.\n\nEarlier today, in the first bilateral meeting between Australia and the US since Albanese took office, Trump vowed to uphold the AUKUS defence pact to sell nuclear-powered submarines to Australia.\n\n“It will be a great achievement for our country. At the end of it, what we will have is the single biggest increase in our military capability since the establishment of the Navy more than a century ago. It will be profoundly important for Australia’s national security,” Marles said.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/western-australia/wa-news-live-afl-announces-wa-s-state-of-origin-coach-20251021-p5n41l.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "WA news LIVE: AFL announces WA’s State of Origin coach",
        "publish_date": "Tue, 21 Oct 2025 12:40:40 +1100",
        "category": "sports",
        "authors": [],
        "text": "Former West Coast legend turned Sydney Swans coach, Dean Cox, will coach the West Australian side in the return of State of Origin next year.\n\nThe AFL, this morning, also announced the Victorian club will be coached by former two-time Geelong premiership coach, Chris Scott.\n\nDean Cox. Credit: Getty Images\n\nThe game is due to be held at Optus Stadium in Perth on February 14. It will be the first time an AFL State of Origin match has been played since 1999.\n\nEach coach will soon select their squads, with players to be announced at the start of November.\n\nPlayers will be picked based on their junior club location from where they were drafted.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/world/north-america/albanese-trump-meeting-live-updates-pm-set-to-meet-us-president-in-washington-20251020-p5n3sq.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "As it happened: US president vows speedy delivery of AUKUS submarines to Australia, tells Rudd ‘I don’t like you either’",
        "publish_date": "Tue, 21 Oct 2025 12:37:20 +1100",
        "category": "finance",
        "authors": [
            "Michael Koziol",
            "Ellen Connolly",
            "Brittany Busch"
        ],
        "text": "Despite Donald Trump’s rare earths deal with Anthony Albanese, it will take years for America to shed its dependence on China’s critical minerals.\n\nBut Beijing faces challenges, too. China’s economy is slowing, though it’s holding up better than expected in the face of Trump’s trade war.\n\nChinese President Xi Jinping. Credit: AP\n\nEven as China’s “Fourth Plenum” gathering of the most senior members of the Communist Party got underway on Monday to rubber-stamp Xi Jinping’s next five-year economic plan, the latest economic data shows Asia’s biggest economy grew 4.8 per cent in the third quarter, compared with the same period last year.\n\nWhile that represents a slowdown from the 5.2 per cent growth rate in the June quarter, it keeps the economy on track to meet Beijing’s “around 5 per cent” targeted growth for this year. It’s also a little better than most external forecasters had expected.\n\nBeneath the headline numbers, however, the detail highlights the unbalanced nature of China’s growth, with the divergence between the domestic economy and a boom in exports – despite Trump’s tariffs – stark. The domestic economy is decelerating even as exports are surging.\n\nLast week’s trade data showed that China’s exports were up 8.3 per cent last month, relative to September last year, despite a 27 per cent slump in exports to the US. Monday’s data showed a 6.5 per cent (year-on-year) increase in industrial production, which is clearly linked to that boom in exports.\n\nThe picture of the domestic economy, however, is quite different.\n\nRead senior business columnist Stephen Bartholomeusz’s take here.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/nsw-government-to-spend-190-million-to-take-over-troubled-hospital-20251021-p5n44y.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "NSW Government to spend $190 million to take over troubled hospital",
        "publish_date": "Tue, 21 Oct 2025 12:28:25 +1100",
        "category": "finance",
        "authors": [],
        "text": "NSW Government to spend $190 million to take over troubled hospital\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/politics/queensland/cash-was-temporarily-banned-on-brisbane-buses-and-trains-it-never-came-back-20251021-p5n41t.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Cash was ‘temporarily’ banned on Brisbane buses and trains. It never came back",
        "publish_date": "Tue, 21 Oct 2025 12:12:56 +1100",
        "category": "finance",
        "authors": [
            "Felicity Caldwell"
        ],
        "text": "Thousands of commuters are calling for cash to be reinstated at Queensland Rail ticket offices, and council parking meters.\n\nWith shops to be forced to accept cash for essential goods and services from next year, almost 3000 people have now signed a petition calling for cash to return for public transport tickets.\n\nCash was temporarily banned on south-east Queensland public transport during the pandemic, and then permanently banned. Credit: William Davis\n\n“There are cash-accepting ticket machines at railway stations, however, these 17-years-old machines are often out of service, at times don’t give change and are difficult or impossible to use for anyone with a vision, mental or dexterity impairment,” the petition reads.\n\n“Go Card retailers accept cash, however, many are not located in close proximity to transport hubs and have limited opening hours.”",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/cricket/it-takes-two-hits-to-get-sorted-smith-back-from-new-york-in-ashes-state-of-mind-20251021-p5n428.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘It takes two hits to get sorted’: Smith back from New York in Ashes state of mind",
        "publish_date": "Tue, 21 Oct 2025 12:07:28 +1100",
        "category": "sports",
        "authors": [
            "Tom Decent"
        ],
        "text": "Steve Smith insists he isn’t hellbent on batting at No.4 for Australia in the Ashes and believes his low-key preparation in New York, where he didn’t pick up a bat for about six weeks, hasn’t affected his readiness for this summer.\n\nThe Australian vice-captain, who will lead the Test side if Pat Cummins fails to recover from a back injury, had his first hit against bowlers since August 28, when his Welsh Fire side finished up their commitments in the limited-overs Hundred competition, on Tuesday at Cricket NSW headquarters.\n\nOne month out from the Ashes, Smith’s place in Australia’s XI is assured, though debate continues to rage about the batting order.\n\nThis masthead revealed earlier this month that selectors have discussed a possible reshuffle that would see Smith move to No.3 to accommodate Cameron Green at No.4. There is a school of thought that Green is better suited lower down the order if he is also bowling.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/business/markets/trump-brought-knives-but-china-brought-a-bazooka-20251021-p5n3zs.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Trump brought knives, but China brought a bazooka",
        "publish_date": "Tue, 21 Oct 2025 12:01:34 +1100",
        "category": "finance",
        "authors": [
            "Stephen Bartholomeusz"
        ],
        "text": "The property sector also continues to shrink, with a 13.9 per cent fall in property investment relative to the same period last year. New home prices fell 0.4 per cent from August and secondary market housing dropped 0.6 per cent. New home prices are now more than 10 per cent off their peaks and “used” homes nearly 20 per cent. Prices are now back to their levels before the pandemic and before Xi introduced the “three red lines” policy that blew up the market. Loading September was the worst month for the property market this year, which will cause some concern at the plenum as it is the major factor behind the weak levels of consumer confidence and spending that have resulted in deflation over the past two and a half years. Nominal GDP growth of 3.7 per cent underscores how significant the rate of deflation has become and how threatening it is to any rebound in domestic confidence and consumption. At the heart of the weaknesses in the domestic economy is the continuing slump in the property sector, which Beijing has been unable to arrest.\n\nThe outcomes from the plenum will be closely watched to see if the party leadership plans to do something more substantial to boost domestic consumption than the piecemeal and relatively ineffective measures it has tried to date. The strongest growth areas within China’s economy were, as expected, those targeted by (and subsidised by) the last five-year plan: electric vehicles, computers, communications and other electronic equipment manufacturing, ships and aircraft. The 16 per cent growth, year-on-year, in the value-add of the auto sector highlights both the unbalanced nature of the economy and the structural imbalances within it. Even though few, if any, of China’s auto manufacturers generate profits, they are producing a swelling tide of vehicles which – with domestic demand soft and endless cycles of price wars in the domestic market – have been pouring into export markets where there are better margins. That is creating tension and pushback from within those markets, with other countries starting to move to protect their own auto industries from China’s cheap electric vehicle exports.\n\nThe auto sector is one of the industries targeted by Beijing in its campaign against “involution,” or over-capacity, and the cut-throat competition that is helping to drive deflation. The sub-economic nature of those exports, and exports of other manufactured products also suffering from involution, shows up in the trade data, where growth in the volume of China’s exports is significantly outpacing the increase in their value. Chinese electric vehicle manufacturers are producing cars at breakneck speed. Credit: Bloomberg Other sectors earmarked for consolidation are China’s coal and steel industries, both of which produced less last month as demand weakened and companies started to fall into line with Beijing’s demand to reduce overcapacity. Coal production was down 1.8 per cent year-on-year and steel output 4.6 per cent, which isn’t good news for Australia’s iron ore miners. The increased reliance on exports for growth makes China vulnerable. It has largely shrugged off the direct effects of Trump’s trade wars, but the growing resistance to its exports elsewhere is a threat to its mercantilist strategy.\n\nIt needs a better balance between domestic activity and external trade, which is something the leadership has no doubt grappled with ahead of the plenum, although Xi is expected to double down on his long-term ambition of global domination of advanced manufacturing, along with self-sufficiency in the targeted sectors and their supply chains. Loading The plenum isn’t expected to set GDP growth targets for the next five years – the last one didn’t – but China needs growth of only about 4.5 per cent in the December quarter to meet the target of “around 5 per cent” that it began this year with. It needs growth of around 4.7 per cent or 4.8 per cent a year for the next five years to meet Xi’s ambition, set as part of the “Made in China 2025” strategy – the plan that has driven China’s global leadership in electric vehicles, solar cells and shipping and seen dramatic increases in its development of artificial intelligence, semiconductors, a domestic aviation industry, biotech and other strategic sectors – of doubling the size of economy by 2035, relative to its size in 2020 when the strategy was developed. Trump’s trade wars could complicate China’s ability to achieve that goal, even though the US now represents a market for only about 10 per cent of China’s exports.\n\nChina thrived in a free trade environment, but Trump’s tariffs on everyone is forcing other economies to become more defensive and protectionist. That adds to the need for China’s to rebalance the relationship between domestic consumption and exports. Loading Trump and Xi are supposed to meet on October 31, with Trump identifying rare earths, fentanyl and soybeans as his priorities. Tensions over China’s dominance of rare earths flared after China – in response to a US tightening of restrictions on sales of advanced semiconductors to Chinese companies – tightened and broadened its own export restrictions on rare earths and permanent magnets, which are essential to most advanced manufactures and critical to many military technologies. Trump then threatened a 100 per cent tariff on all imports from China. Even though Trump struck a deal with Anthony Albanese overnight to get access to Australia’s plentiful reserves of rare earths, it will take many years before the US can shed its dependence on China’s rare earths and rare earth magnets and the vulnerability that has created.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/culture/live-reviews/humour-and-depth-in-story-about-faith-family-and-finding-your-beat-20251019-p5n3k3.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "This is the funniest, whip-crackingest, heart-warmingest show in town",
        "publish_date": "Tue, 21 Oct 2025 11:52:33 +1100",
        "category": "entertainment",
        "authors": [
            "John Shand",
            "Bernard Zuel"
        ],
        "text": "Gregory Porter’s voice is like a log fire on a winter’s night. It doesn’t just radiate warmth, it has a comfort factor. It’s the voice of someone who’s worked out a thing or two about this very temporary exercise called life, and wants to ease the suffering and spread a little beneficence with a generosity of heart that’s the opposite of those people who win talent quests by impressing. Porter has bigger fish to fry than merely impressing. A mere nine years ago he was at the old Basement. Now he’s packing out the Concert Hall with fans who know all the songs, having been seduced by the voice of this barrel-chested man in the trademark hat, who can fleetingly remind you of singers ranging from Nat King Cole to Marvin Gaye, yet sounds only like himself. He lets jazz flow into soul as naturally as two rivers meeting, so it’s impossible to define where they merge. Gregory Porter in action on stage at the Opera House. Credit: Johannes Napp Most of the songs are his own, with lyrics about coping, loving, hoping and improving. The latter’s quite an attractive idea, given most of us seem to believe that bemoaning our lot is a form of conversation. You feel the truth of the magnanimity with Porter, not just via the lyrics and the amusing between-song chat, but via the voice itself, which seems to proclaim that goodness is possible, and you leave the two-hour show briefly believing it. His long-term quartet has been augmented by organist Ondrej Pivec, who maximises the inherent drama of a Hammond B-3, and provides another soloing voice to join tenor saxophonist Tivon Pennicott and pianist Chip Crawford. Bassist Jahmal Nichols anchors the music, while also providing the night’s most engrossing solo feature, which builds into a groove so wicked it must be barely legal, and then morphs into two rare covers: The Temptations’ My Girl and Papa Was a Rolling Stone. Drummer Emanuel Harrold remains the joker in the pack: unusually busy for the soul side of the idiom (if not the jazz), and ensuring the music is energised and studded with surprises.\n\nPorter’s anthemic Musical Genocide drops away to just Crawford’s piano, which slips into Waltzing Matilda. Although Porter doesn’t sing it, the audience does, and what could easily have been corny is actually quite touching. More moving is Porter’s Water Under Bridges, ostensibly about a break-up; more pertinently about how his brother helped him cope: a brother who died during the pandemic. Sung with only piano accompaniment this allows us to immerse ourselves in his voice’s richness. Seldom does he unleash its full magnificence, but when he does, as on the spiritual Wade in the Water, you are physically pushed back by its power. The sound was second-rate to start, and never became quite as sharply focused as it can be in this room, although it did keep improving, right through to the second (genuinely demanded) encore. MUSIC\n\nKarnivool\n\nEnmore Theatre, October 19\n\nReviewed by ROD YATES\n\n★★★★ When Karnivool guitarist Mark Hosking steps up to the microphone and thanks the audience for sticking with them over the years, he acknowledges that they are a band that require patience from their fans. They postpone shows, he says – a reference to the fact that this evening’s gig was originally scheduled to take place last July before illness rendered the quintet unable to perform – and they take years between albums.\n\nKarnivool in full flight at the Enmore Theatre. Credit: Kane Hibberd Indeed, when their new record In Verses comes out in 2026, it will be only their fourth full-length since forming in Perth in 1998 and will drop a whopping 13 years after predecessor Asymmetry. In the here-today-gone-later-today nature of music stardom in 2025, rare is the band that can treat their release schedule with such disdain yet still command the kind of loyalty that enables them to sell out the 2500-capacity Enmore Theatre with ease. That they share a special bond with their audience is obvious. From the genuine glee that flashes across the face of vocalist Ian Kenny when greeting the crowd to the way in which the punters morph into a mass choir during closer New Day and the thundering Themata, the overwhelming feeling from both band and audience is release. Contributing to that sense is the group’s mastery at creating musical tension.\n\nDrummer Steve Judd’s mindbogglingly complex rhythms and the intricate guitar interplay between Hosking and Drew Goddard combine to form a dark, dense, prog-metal symphony that they tease to a thundering climax in the epic Deadman and a gloriously heavy Roquefort. Of the two new tracks Karnivool have released this year they open with one in Drone and put the other, Aozora, third song in. That they do this rather than go for a cheap win by opening with an old favourite like Cote (which appears later in the set) speaks volumes about the confidence of the band and the trust they place in their audience to go along for the ride. After almost three decades, though, those fans know the deal – Karnivool will march to the beat of their own drum and indulge their musical whims without any care for the demands of the mainstream. In return, they will deliver a masterful show like this. MUSIC\n\nBURNA BOY\n\nQudos Bank Arena, October 18\n\nReviewed by SHAMIM RAZAVI\n\n★★★½ Burna Boy’s current tour takes him places no African artist has gone before, and his first Sydney headline show is no exception: it’s hard to imagine that Olympic Park has ever hosted a Nigerian party of these proportions, with even the food trucks putting on their best impersonations of jollof rice and swallows. Inside the arena, the mood was authentic Afrofusion: an Afrobeats base with aesthetic influences from the rest of the world.\n\nThat African base was ever present – in the Yoruba-Pidgin lyrics, in the use of the talking drum and shekere instruments, in the infectious familial informality — but fused with global elements ranging from Kingston Town rhythms to Ed Sheeran aesthetics straight from the badlands of Ipswich: a sound as global as it is grounded. Burna Boy in full flight at Qudos Bank Arena. Credit: Glenn Pokorny Burna’s studio production is glossy and complicated, which in the hands of a lesser artist might have been a disappointment live. Not so for the African Giant: in his case, less polish and more talent actually improved on his overstuffed recordings. His baritone especially benefited from the concert treatment – with AutoTune dialled back, we were reminded of the charm and intensity that sets his act apart from his peers. In fact, the a cappella intro to It’s Plenty drops the vocal filters altogether and he sounds properly masterful as a result. The price for this willingness to experiment and mix things up was the occasional misfire. Bank on It was transformed with a smooth-jazz vibe, complete with a sax line straight from the Kenny G songbook: more lounge than Lagos; the CGI screen backdrops were more artificial than intelligent, and the occasional keytar on stage, like an escapee from a wedding band, only highlighted the strange aesthetic choices. Not that anyone seemed to mind, judging by the assortment of audience underwear thrown on stage. Shirtless from the second song, Burna Boy worked that rich voice and charisma hard, building to a closing climax of Ye and Last Last. And yet, for all the heat and magnetism, there was something missing – a looseness and unrestraint that would have transformed this good night into a great one: the gap between smouldering and fire.\n\nMUSIC\n\nGORDI\n\nPlayhouse, Sydney Opera House, October 17\n\nReviewed by BERNARD ZUEL\n\n★★★½ Though neither of them occurred during the performance, two medical episodes punctuated this show and told us something about Sophie Payten in both normal and Gordi mode, in medical and musical personas. The lesser of them, told in comic semi-pantomime, concerned Payten at the dentist when one of her songs, Heaven I Know, came on the surgery’s playlist like the universe was helping convince them she really was a musician. On stage, that song built from looped and live vocal layers and slowly accreting instruments until we had an alterna-choir that served as a kind of halo around the simple lines of an ending and acceptance. “Yeah, I got older, and we got tired/Heaven I know, that we tried.” Gordi aka Sophie Payten performs at the Sydney Opera House. Credit: Gabrielle Clement More seriously, the other story featured a patient of hers – Payten completed her medical studies during and immediately after COVID lockdowns – who confronted news of his imminent death with a level of equanimity that would be beyond most of us, leaving an impact on his young doctor.\n\nThe two songs inspired by this experience were not leaden but rather a flow of warm energy that pushed everything forward and a blend of Elliott Smith and Bon Iver as pure pop immersed in hazy winter. Around these three songs, in material that included all the tracks of her new-ish album, Like Plasticine, and scattered shots from previous releases, Payten/Gordi moved between endings and rebuilding, back and forth from thickened layers to modestly proportioned instrumentation, counter-intuitively guitar-pushed vibrant when crushed and synth-filled solemn when emotionally buoyant, and often distorting her voice through various effects as if not wanting clarity to be confused with truth. Songs found her uncertain on questing love (“Do you care? Do you care?/Don’t make me your peripheral lover”), falling on a failure (“I made available a portion of my heart/Not anymore”) and rising again on the certainty of comfort (“I know the pressure you feel seems relentless/But everything is fleeting, except you and I”). And then, closing with Can We Work It Out, on the horns of a dilemma – ready to believe, but bracing for regret – she threw at us the bushiest and brightest song of the night with its solid propulsion and almost fizzing slices of vocals. THEATRE\n\nDAYTIME DEEWANE\n\nRiverside, October 18, until October 25\n\nReviewed by KATE PRENDERGAST\n\n★★★★\n\nIn 1980s Britain, after racist club bouncers wouldn’t give anyone with brown skin their share of night, a new underground subculture emerged. These were the Daytimers, day parties run by South Asian collectives, where shunned ravers could congregate on their own terms, to their own DJs, dancing to new music blending bass-kicked Bhangra, Asian garage and diaspora-mixed jungle. Azan Ahmed sets his award-winning 2022 play at the last Daytimer party, in London in 1997. Sixteen-year-old Farhan (Ariyan Sharma), wonders whether Islam forbids dancing as he scurries nervously in school uniform towards his first-ever rave. His 20-year-old rude-boy cousin Sadiq (Ashan Kumar), bounces about impatiently in wifebeater vest and chains, breaking into rhapsodies on the dancefloor’s true radical principles of defiance, humanism and transcendent release. Ariyan Sharma and Ashan Kumar are excellent as two cousins on clashing coming-of-age trajectories in Daytime Deewane. Credit: Phil Erbacher Built on the twists in its character foils, Daytime Deewane unfolds as a story about these two very different young Muslim men, each trying to define his means and methods of self-respect against the values and expectations of his heritage. It loses its beat in the last stretch – the time leap to a reunion scene strikes an off-key chord and leaves us with an ambiguous moral takeaway – but there’s a lot to rate highly in this play about migration, masculinity and faith. Its two leads go point-for-point in endowing Riverside’s Australian premiere with humour and depth. Sharma gives us signature goof as the duty-bound teenage square, cutting Farhan the weirdest of shapes as an aspirational “peacock” bro while asking where the prayer room’s at.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/lifestyle/tiktokers-mum-sabotages-gender-reveal-with-a-prank-20251021-p5n445.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Tiktoker's mum sabotages gender reveal with a 'prank'",
        "publish_date": "Tue, 21 Oct 2025 11:50:27 +1100",
        "category": "lifestyle",
        "authors": [],
        "text": "Tiktoker's mum sabotages gender reveal with a 'prank'\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/property/news/landscape-designer-paul-bangay-relists-dreamy-victorian-estate-for-6-6m-20251021-p5n3zx.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Dreamy Victorian estate of landscape designer Paul Bangay relisted for $6.6m",
        "publish_date": "Tue, 21 Oct 2025 11:49:21 +1100",
        "category": "finance",
        "authors": [
            "Orana Durney-Benson"
        ],
        "text": "Leading landscape designer Paul Bangay’s country estate in Victoria is back on the market, two years after a high-profile deal fell through.\n\nStonefields is a dreamy Tuscan-inspired escape in the hills near Daylesford that Bangay has previously called his “life’s greatest work”.\n\nOver twenty years, Bangay transformed a cow paddock into an extraordinary garden with sweeping lawns, oak avenues, and 4000 individual tulips.\n\nNow the estate is on the market for expressions of interest, with a price guide of $6 million to $6.6 million.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/soccer/after-two-years-out-sam-kerr-set-for-first-match-back-in-australia-20251021-p5n415.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "After two years out, Sam Kerr set for first match back in Australia",
        "publish_date": "Tue, 21 Oct 2025 11:43:50 +1100",
        "category": "sports",
        "authors": [
            "Frances Howe"
        ],
        "text": "Sam Kerr is set to play her first match on Australian soil in more than two years against New Zealand in Gosford next month, Football Australia announced on Tuesday.\n\nA two-game international series will be held at Polytec Stadium, with the first match scheduled for November 28.\n\nSam Kerr scored Australia’s only goal in their 2023 World Cup semi-final against England. Credit: AP\n\nInterim Football Australia chief executive Heather Garriock said Kerr should make an appearance in those matches, following her selection for two Matildas’ upcoming friendlies against Wales and England.\n\n“We’re excited to see Sam back on the football field,” Garriock said. “The squad will be announced in the near future, and we look forward to Sam being named in that squad and possibly in the game at Gosford for her to play her first minutes on Australian soil since she got injured.”",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/technology/why-one-company-s-glitch-just-broke-half-the-internet-20251021-p5n41g.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Why one company’s glitch just broke half the internet",
        "publish_date": "Tue, 21 Oct 2025 11:41:16 +1100",
        "category": "finance",
        "authors": [
            "David Swan"
        ],
        "text": "Australia is particularly reliant on AWS. The federal government inked a three-year whole-of-government deal in January 2025, giving federal, state and local agencies streamlined access to AWS services. The government has committed $2 billion over the next decade for AWS to build a “Top Secret Cloud” to host the nation’s most sensitive defence and intelligence data. Anthony Albanese at a press conference during the prime minister’s June visit to the Amazon Spheres in Seattle. Credit: Alex Ellinghausen More than 140 Commonwealth, state and territory agencies already rely on AWS for critical services in transport, health, education and tax collection. The root cause of this week’s issue hasn’t yet been identified, though it appears tied to a DNS (Domain Name System) failure within AWS’s US-EAST-1 region, in Virginia. To put it simply, the digital phone book for much of the cloud was broken, and when AWS stumbles, anything or anyone relying on its services stumbles too.\n\nThis isn’t a new story. AWS experienced similar outages in 2023 and 2021, when a five-hour disruption prevented customers from accessing airline reservations and payment apps. And just 15 months ago, the CrowdStrike disaster showed us what happens when critical infrastructure software fails at scale. Loading The July 2024 CrowdStrike incident was different in nature, but similar in its sheer impact. CrowdStrike makes cybersecurity software that runs on individual computers and servers to protect them from hackers. A faulty update caused roughly 8.5 million Windows systems to crash simultaneously, triggering an estimated $US10 billion ($15.3 billion) in global damage. Airlines grounded thousands of flights. Hospitals scrambled to access patient records. Supermarkets effectively shut down and emergency services went dark. The two incidents share a troubling pattern: single points of failure causing cascading global chaos.\n\nBut there’s a crucial difference. CrowdStrike affected individual machines that required technicians to manually fix them one by one. Monday’s AWS outage hit centralised infrastructure – the very foundation upon which modern digital services are built. Checkouts at Coles in New Farm were offline after the CrowdStrike outage of July 19, 2024. Credit: Cameron Atfield The outage underscores the critical role AWS plays in the functioning of the entire internet. And for one provider to have so much influence is a problem when something goes wrong, far beyond just inconveniences for businesses or customers. “When a single provider goes dark, critical services go offline with it,” advocacy organisation Article 19 warns. “Media outlets become inaccessible, secure communication apps stop functioning, and the infrastructure that serves our digital society crumbles.” They have a point. This isn’t just about missing a few hours on social media or not being able to respond to your Tinder match. It’s about systemic fragility in critical infrastructure that increasingly underpins finance, healthcare and ultimately democracy.\n\nTo be fair, cloud computing has brought real benefits, and has been one of the most transformative technologies over the last decade, alongside AI. It’s made technology cheaper and more accessible, allowing start-ups to compete without buying expensive servers. It’s enabled services to scale rapidly to meet demand. And companies like AWS do invest heavily in redundancy – back-up systems designed to kick in when something fails. They just don’t always work. So, what should we do differently? First, regulators and governments must treat cloud infrastructure like the critical public utility it has become. The internet is too important not to. We don’t allow one company to control 30 per cent of electricity generation for good reason and the same logic should apply to the digital infrastructure that powers modern life. This doesn’t mean breaking up tech companies, necessarily, but it does mean greater oversight, standards and accountability.\n\nSecond, governments need to mandate genuine redundancy. And not just within a single provider’s ecosystem, but across different providers. If your back-up generator runs on the same power grid as your main system, it’s not really a back-up. Loading Third, we need transparency. When AWS goes down, the public deserves to know immediately what failed, why, what’s at risk, and when full service will return. AWS did provide regular updates overnight, but the current system is inadequate for infrastructure this critical. None of this is straightforward or easy, but the status quo isn’t working either. The internet has become too important to be this fragile, and too important to be held hostage by any single company.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/goodfood/recipes/adam-liaw-s-ling-with-turmeric-rice-20251021-p5n43g.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Adam Liaw’s ling with turmeric rice",
        "publish_date": "Tue, 21 Oct 2025 11:35:14 +1100",
        "category": "lifestyle",
        "authors": [
            "Adam Liaw"
        ],
        "text": "Step 3\n\nAdd the onion, garlic and coriander root and stems and fry for 1 minute. Season very well with salt, then add the extra turmeric and the rice and cook for about 2 minutes until lightly toasted. Add the stock and stock powder, peas and bay leaf and bring to a simmer. Cover the pan and reduce the heat to very low and simmer for a further 12 minutes. Turn off the heat, then return the fish to the top of the rice, cover the pan and stand for 10 minutes. Uncover and scatter the coriander leaves over the top with a bit of chilli or paprika powder. Serve with yoghurt and lemon wedges.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/nsw/if-you-thought-sydney-s-diamond-about-was-bad-try-the-road-leading-up-to-it-20250825-p5mplh.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "If you thought Sydney’s ‘diamond-about’ was bad, try the road leading up to it",
        "publish_date": "Tue, 21 Oct 2025 11:30:00 +1100",
        "category": "finance",
        "authors": [
            "Mostafa Rachwani"
        ],
        "text": "Fifteenth Avenue in Austral has no turning lanes, no deceleration zones, no space to overtake, a bungled roundabout, no traffic lights and ends in the middle of bushland.\n\nAnd, yet, it is set to become one of western Sydney’s most important roads, connecting Liverpool to the new Western Sydney International Airport. It is intended to be central to greenfield areas where residential developments have become essential to easing the housing crisis.\n\nAustral’s Fifteenth Avenue is a traffic nightmare, with only one lane in each direction. Credit: Hannah Anderson\n\nAlready, thousands of people have piled into the surrounding suburbs, transforming a once quiet semi-rural region on the edge of the city into a thrumming construction zone, filled with new developments, schools and businesses.\n\nBut the road itself has struggled to keep up.",
        "source": "SMH"
    },
    {
        "url": "https://www.sbs.com.au/news/video/albanese-arrives-in-washington-dc-for-first-face-to-face-talks-with-trump/ajknztf53",
        "title": "Albanese arrives in Washington DC for first face to face talks with Trump",
        "publish_date": "Mon, 20 Oct 2025 23:38:05 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/five-key-things-to-know-from-the-trump-albanese-meeting/rgfdjrzum",
        "title": "'Friends', but with tariffs: Five key things to know from the Trump-Albanese meeting",
        "publish_date": "Mon, 20 Oct 2025 22:32:11 +0000",
        "category": "finance",
        "authors": [],
        "text": "Key Points Donald Trump and Anthony Albanese signed a significant rare earth minerals deal.\n\nThe pair's meeting appeared to be very warm, referring to each other as \"friends\".\n\nThere was an awkward moment with Australia's US ambassador Kevin Rudd.\n\nUnited States President Donald Trump has heaped praise on Prime Minister Anthony Albanese during what appeared to be a very warm first visit to the White House, with successes notched on both sides.\n\n\n\n\n\nThe highly anticipated bilateral meeting took ten months to secure, but Albanese has emerged with a new economic deal and strengthened ties to Australia's closest ally.\n\n\n\n\n\nThe two leaders met in the White House in the early hours of Tuesday morning to discuss trade, AUKUS, critical minerals and a potential visit to Australia.\n\n\n\n\n\nSurprisingly, it was a former prime minister who was involved in the meeting's tensest moment.\n\n\n\n\n\nHere are five key takeaways:\n\n\n\nSignificant rare earths deal secured\n\nThe meeting was relocated from the White House's Oval Office to the cabinet room so that Trump and Albanese could sign a rare earths deal .\n\n\n\nThe US and Australia will invest US$3 billion ($4.6 billion) in the first six months alone, with the multi-billion dollar deal designed to combat China's stronghold on the sector.\n\n\n\n\n\n\"In a year from now we'll have so much [critical minerals] ... you won't know what to do with them,\" Trump said.\n\n\n\n\n\nAlbanese explained it would create an US$8.5 billion ($13 billion) pipeline of projects, with US investment in Australia helping with the processing of critical minerals needed for manufacturing.\n\n\n\nAUKUS agreement to go ahead\n\nTrump reaffirmed the stability of the AUKUS agreement between Australia, the US and the United Kingdom which would give Australia nuclear submarines.\n\n\n\n\n\nThe deal, announced in 2021 under the Biden administration, has been under review by the US.\n\n\n\nUS navy secretary John Phelan elaborated on the review by the US defence department, stating it was working to \"make it better\" and \"clarify some of the ambiguity that was in the prior agreement\", which would be a \"win-win for everyone\".\n\n\n\n\n\nBut Trump said the plan was \"moving along rapidly\" and there were only \"minor details\" to be worked out, assuring Australia was \"getting\" the submarines.\n\n\n\nTrump doesn't budge on Australian tariffs\n\nTrump was asked whether he'd consider removing tariffs from his friend, Australia.\n\n\n\n\n\nHe defended the tariffs Australian exports are subject to — including a baseline 10 per cent rate and 50 per cent on steel and aluminium.\n\n\n\n\n\n\"Australia pays very low tariffs, very, very low tariffs. In fact, Australia pays among the lowest tariffs,\" Trump said.\n\n\n\nTense moment with US ambassador Kevin Rudd\n\nThe main moment of tension came as a journalist asked Trump's thoughts on disparaging comments made by Australia's ambassador to the US, Kevin Rudd.\n\n\n\n\n\nRudd called Trump the \"most destructive president in history\" in a 2020 social media post, one of several tweets deleted after Trump won the 2024 presidential election.\n\n\n\n\n\nTrump turned to ask Albanese what had been said, before changing his mind, saying: \"Don't tell me.\"\n\n\n\nRudd was in the room at the time, and after trying to explain, was quickly cut off by Trump, who said: \"I don't like you either, I don't, and probably never will.\" Albanese laughed during the exchange.\n\n\n\n\n\nAfter the meeting concluded, Rudd was overheard apologising to Trump off-camera, with the US president reportedly replying \"all is forgiven\".\n\n\n\nTrump praises PM as 'my friend'\n\nTrump gushed over his \"friend\" Albanese, during a very friendly first bilateral meeting between the pair, stating he was doing a \"fantastic job\" as prime minister.\n\n\n\n\n\n\"We've been long-term, longtime allies, and I would say there's never been anybody better,\" Trump said.\n\n\n\n\n\nAsked to compare Albanese to previous prime ministers Scott Morrison and Malcolm Turnbull, who were more politically aligned, Trump said it \"wouldn't be fair\".\n\n\n\n\"I don't want to compare one with the other, but they really have a great prime minister,\" Trump said.\n\n\n\n\n\nAlbanese joked he would use Trump's remarks in campaign ads at the next federal election in 2028.\n\n\n\n\n\nThe feeling was mutual, with Albanese praising Trump's work on a Middle East ceasefire as \"an extraordinary achievement\".\n\n\n\n\n\nThe US president said he had been extended an invite to visit Australia, which he was \"considering\".\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/amazon-says-aws-cloud-services-back-to-normal-after-massive-outage/ydottqgy7",
        "title": "Amazon says AWS cloud services back to normal after massive outage",
        "publish_date": "Mon, 20 Oct 2025 20:23:56 +0000",
        "category": "finance",
        "authors": [],
        "text": "Amazon said that the system at issue was back to \"pre-event levels\" and expected it would take two hours to work through the data backlog caused by the problem.\n\n\n\n\n\nThe disruption, one of the biggest since last year's CrowdStrike malfunction that crippled hospitals, banks and airports, has again exposed the fragility of global digital infrastructure.\n\n\n\n\n\nA huge spike in disruption logged at Downdetector on Monday was followed by an even bigger jump some nine hours later, with the internet trouble tracker posting that it had received more than 11 million reports in total.\n\n\n\n\n\nIn an update, Amazon said \"mitigations were applied to resolve launch failures\", linking a \"load balancer health\" issue to the problem at Amazon Web Services (AWS).\n\n\n\nREAD MORE Three people dead after Optus network upgrade sparked triple-zero call failure\n\nAWS handles nearly a third of the planet's cloud infrastructure market, powering millions of apps and websites around the world.\n\n\n\nWhat caused the AWS outage?\n\nAWS provides computing power, data storage and other digital services to companies, governments and individuals and is the world's largest cloud provider, followed by Microsoft's Azure and Google Cloud.\n\n\n\n\n\nDisruptions to its servers can cause outages across websites and platforms — ranging from food delivery apps to gaming platforms and airline systems — that rely on its cloud infrastructure.\n\n\n\n\n\nAWS said on its status page that Monday's outage originated at its US-EAST-1 location in northern Virginia, its oldest and largest for web services. The site suffered outages in 2021 and 2020.\n\n\n\n\n\nAccording to documentation on the AWS website, the US-EAST-1 site is often the default region for many AWS services.\n\n\n\n\n\nAsked for comment, AWS directed Reuters to its status page. Amazon did not respond to a request for comment.\n\n\n\nDependency on 'fragile infrastructures'\n\nThe problem highlights how interconnected everyday digital services have become and their reliance on a small number of global cloud providers, with one glitch wreaking havoc on business and day-to-day life, experts and academics said.\n\n\n\n\n\nJake Moore, a global cybersecurity adviser at European cybersecurity firm ESET, said: \"This outage once again highlights the dependency we have on relatively fragile infrastructures.\"\n\n\n\n\n\nIn the United Kingdom, Lloyd Bank, Bank of Scotland and telecom service providers Vodafone and BT were all hit, according to Downdetector's UK website, as was UK tax, payments and customs authority HMRC's website.\n\n\n\nNishanth Sastry, director of research at the University of Surrey's Department of Computer Science, said: \"The main reason for this issue is that all these big companies have relied on just one service.\"\n\n\n\n\n\nOokla, which owns Downdetector, said over four million users reported issues due to the incident.\n\n\n\n\n\nRyan Griffin, US cyber practice leader at insurance broker McGill and Partners, said: \"For major businesses, hours of cloud downtime translate to millions in lost productivity and revenue.\"\n\n\n\nThe websites and apps affected by the AWS outage\n\nOokla reported at least 1,000 companies were affected by the AWS outage.\n\n\n\n\n\nThe disruption also affected streaming platforms, including Amazon's Prime Video service and Disney+, as well as Perplexity AI, the Fortnite game, Airbnb and Duolingo.\n\n\n\n\n\nMobile telephone services and messaging apps Signal and Whatsapp were affected in Europe, according to Downdetector.\n\n\n\n\n\nArtificial intelligence start-up Perplexity, crypto exchange Coinbase, and trading platform Robinhood also experienced outages linked to AWS, as did Amazon's own services.\n\n\n\nAlthough there's no evidence of a cyberattack, the scale of the breakdown fuelled speculation.\n\n\n\n\n\nCybersecurity expert Rafe Pilling said such incidents are understandable given AWS’s vast and complex reach, warning that even minor issues can trigger major global disruption.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/trump-and-albanese-have-signed-a-rare-earth-minerals-deal-what-we-know-so-far/5ws9qzbf0",
        "title": "Here's what we know so far about Trump and Albanese's $13 billion rare earths deal",
        "publish_date": "Mon, 20 Oct 2025 20:12:15 +0000",
        "category": "finance",
        "authors": [],
        "text": "Prime Minister Anthony Albanese has secured a rare earths and critical minerals deal during his highly anticipated first meeting with United States President Donald Trump , although details are limited.\n\n\n\n\n\nTrump noted the deal had been \"negotiated over a period of four, five months\", speaking to reporters with Albanese from the White House on Tuesday morning.\n\n\n\n\n\nAustralia has some of the richest deposits of mineral sands and rare earth minerals in the world, necessary for the production of green energy technologies, as well as products like mobile phones and weapons.\n\n\n\n\n\nWestern countries have been seeking to disrupt China's dominance of the global supply chain — accounting for around 70 per cent of global mining and 90 per cent of global processing, according to the International Energy Agency.\n\n\n\nAs China tightens rules on its exports, threatening to halve them altogether, it has become the cause of heightened tensions between the US and China. The deal hopes to challenge China's stronghold.\n\n\n\n\n\n\"In a year from now we'll have so much (critical minerals) ... you won't know what to do with them,\" Trump said.\n\n\n\n\n\nWhile the full agreement has not been shared, Albanese said both Australia and the US will contribute $1 billion each over the next six months.\n\n\n\n\n\nHe said the deal \"isn't just about digging things up\" and would create an US$8.5 billion ($13 billion) pipeline of projects.\n\n\n\n\"Our plan is called a future made in Australia, which is about not just digging things up and exporting them, but how do we make sure that we have across the supply chains, with our friends, being able to benefit, seize those opportunities,\" Albanese explained.\n\n\n\n\n\n\"It's also about processing, including that joint ventures between Australia and the United States.\"\n\n\n\nThere are three main sections to the deal: joint investments between Australia and the US on rare earths, US investment in Australia to process critical minerals and planned projects between the US, Australia and Japan.\n\n\n\n\n\nThe deal will see coordinated work across the supply chain to identify vulnerabilities and accelerate processing, including the review of prices and unfair trade practices.\n\n\n\n\n\nA White House statement said both governments will spend $US 3 billion ($4.61 billion) over the next three months.\n\n\n\n\n\nFollowing the press conference, the Albanese government announced investment in two projects.\n\n\n\nThese were a US$200 million ($307 million) boost to the Alcoa-Sojitz Gallium Recovery Project in Wagerup, Western Australia and US$100 million ($154 million) in Arafura Nolans project in the Northern Territory.\n\n\n\n\n\nBoth projects will provide critical minerals required for defence and energy security manufacturing, the government says.\n\n\n\n\n\n\"Cooperation on critical minerals and rare earth supply chains is testament to the trusted partnership between Australia and the United States as strategic defence allies,\" Albanese said in a statement.\n\n\n\n\n\n\"I look forward to continuing to work with President Trump to strengthen our partnership and support American and Australian workers, businesses and investors.\"\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/global-amazon-outage-affects-hundreds-of-platforms-morning-news-bulletin-21-october-2025/g8y6nyv8g",
        "title": "Global Amazon outage affects hundreds of platforms | Morning News Bulletin 21 October 2025",
        "publish_date": "Mon, 20 Oct 2025 19:37:58 +0000",
        "category": "finance",
        "authors": [],
        "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\nA major global outage affects Amazon, disrupting hundreds of platforms\n\nDonald Trump and Anthony Albanese meet at the White House and sign a deal on critical minerals\n\nIn football, a first World Cup win for Morocco\n\nServices are in the process of coming back online after hundreds of websites and apps were affected by a global outage.\n\n\n\n\n\nSnapchat, Reddit and chat app Signal are among the popular services affected, while in Europe, several major mobile phone operators, some U-K banks, Whatsapp and Tinder were also affected.\n\n\n\n\n\nAmazon's cloud services unit AWS says it is still experiencing \"significant error rates\" and that engineers are \"actively working\" on the problem.\n\n\n\n\n\nNew York University cybersecurity expert Ed Amoroso says it could take time before the root cause is identified.\n\n\n\n\n\n\"It's sort of like an airplane pilot when there's a little bit of a problem, the first thing you do is fly the plane. So the first thing they need to do is get their arms around their systems and get them operational. Then at that point, you sort of, the pilot would say navigate, you make sure that you've got a good plan. And that's when you start to communicate out what the issues were, what the problems are. My guess is they're somewhere between getting their arms around this and then starting their plan for further fixes and for avoidance.\"\n\n\n\n\n\nThe turmoil is the largest internet disruption since last year's CrowdStrike malfunction hobbled technology systems in hospitals, banks and airports, and highlights the vulnerability of the world's interconnected technologies.\n\n\n\n\n\n---\n\n\n\n\n\nPrime Minister Anthony Albanese has met United States President Donald Trump in Washington D-C, with the pair signing a rare earths and critical minerals deal.\n\n\n\n\n\nBoth countries have agreed to invest a combined A$13.05 billion in critical minerals projects, including an immediate contribution of $A1.5 billion each into Australian and US projects.\n\n\n\n\n\nMr Trump says he deal had been in negotiation for around four to five months.\n\n\n\n\n\n\"In about a year from now, we'll have so much critical mineral and rare earths that you won't know what to do with them. They'll be worth about $2. But in the meantime we're working with Australia and other countries. They're working with us too. But other countries also on that. But we're really working on anything having to do with military, military protection, military ships, vehicles, guns, ammunition. Everything.\"\n\n\n\n\n\nPresident Trump has also agreed to honour and expedite the AUKUS security deal, which will supply nuclear-powered submarines to Australia.\n\n\n\n\n\n---\n\n\n\n\n\nGaza humanitarian aid delivery has restarted, a day after Israel resumed a fragile ceasefire.\n\n\n\n\n\nThere is a concern among Palestinians about how much aid Israel is letting into Gaza - a key part of the agreement.\n\n\n\n\n\nPalestinians, including women and children, queued outside a distribution centre in Khan Younis to receive boxes of food and supplies.\n\n\n\n\n\nRaafat al-Qarra says he wishes aid packages were bigger - or delivered more frequently.\n\n\n\n\n\n\"It's not enough for anything, it's only enough for four or five days for a family of six people. If the aid (package) was bigger than this, or even (delivered) weekly, it would be better. You can see how expensive prices are becoming, and we cannot afford to buy anything.\"\n\n\n\n\n\nThe next stages of the ceasefire are expected to focus on disarming Hamas, Israeli withdrawal from additional areas it controls in Gaza, and future governance of the devastated territory.\n\n\n\n\n\n---\n\n\n\n\n\nAn inquest has heard a 34-year-old Indigenous mother of three was sedated four times in one day by medical staff before dying of a toxic overdose.\n\n\n\n\n\nThe coronial inquest into the death of Kumunjayi Brogus, who died in Alice Springs hospital on November 23, 2023, got underway yesterday.\n\n\n\n\n\nMs Brogus suffered from schizophrenia and was in the grips of a psychotic episode in the days before she died.\n\n\n\n\n\nIn an opening statement, the Counsel assisting the Northern Territory Coroner Elisabeth Armitage has alleged Ms Brogus was \"given so many drugs for sleeping that it caused her to stop breathing\".\n\n\n\n\n\nThe inquest will examine if the care provided by N-T Health was appropriate and sufficient.\n\n\n\n\n\n---\n\n\n\n\n\nIn football, Morocco has become the first Arab nation to win the under-20 World Cup after beating Argentina 2-0 in the final in the Chilean capital, Santiago.\n\n\n\n\n\nYassir Zabiri opened the scoring in the 12th minute with a free kick and doubled Morocco's lead 17 minutes later from a close-range shot.\n\n\n\n\n\nArgentina, who holds the record with six titles, lost a final for the second time after their defeat by Brazil in 1983.\n\n\n\n\n\nThe roar from the Moroccan fans was deafening at the full time whistle, as heard on FIFA's match commentary.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/pms-balancing-act-ahead-of-us-talks-as-chinas-economy-expands-by-4-8/ne7mekta7",
        "title": "PM's balancing act ahead of US talks as China's economy expands by 4.8%",
        "publish_date": "Mon, 20 Oct 2025 07:37:13 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/what-are-rare-earth-minerals-and-why-is-trump-interested-in-australias-supply/mfxgjcwhy",
        "title": "What are rare earth minerals and why is Donald Trump interested in Australia's supply?",
        "publish_date": "Mon, 20 Oct 2025 07:11:34 +0000",
        "category": "finance",
        "authors": [],
        "text": "Australia has some of the richest deposits of mineral sands and rare earth minerals in the world, and the US wants access to them, hoping to counter China's dominance of the industry.\n\n\n\n\n\nHere's what the term rare earths refers to and why they're not actually that rare.\n\n\n\nWhat are rare earth minerals?\n\nRare earths are a group of 17 elements in the periodic table, most of them known as lanthanides.\n\n\n\n\n\nThey're used in consumer electronics, weapons, electric vehicles, medical equipment and robots for example, and often relate to new technologies.\n\n\n\nThey're crucial too for the green energy transition. Solar and wind energy and electric vehicles all depend on rare earth elements.\n\n\n\n\n\nDr Vlado Vivoda from the Sustainable Minerals Institute at the University of Queensland told SBS News earlier in the year that despite the name, they're not actually scarce.\n\n\n\n\n\n\"So a lot of them are not actually rare, but they're hard to mine and even harder to separate and process safely. So that's what makes them geopolitically important.\"\n\n\n\n\n\nRare earths are tightly bound together with other elements in nature, so separating them is a complex process often involving at least 50 stages.\n\n\n\n\n\nSuch operations are expensive, labour-intensive and often environmentally damaging.\n\n\n\nSource: SBS News Most countries have left the work to China, which Vivoda says emerged as a key player in the 1990s.\n\n\n\n\n\n\"China appeared as the ideal candidate to take in some of that industry, to do it at home with a bit more lax environmental regulations. And it was the cheapest place to do all this. Plus China had some of the largest reserves as well of rare earths.\"\n\n\n\n\n\nChina now controls the majority of the rare earths supply chain, accounting for around 70 per cent of mining and 90 per cent of processing, according to the International Energy Agency.\n\n\n\n\n\nThat lion's share is unlikely to change; however, over the next five years, Australia is on track to become the second-biggest producer of rare earth elements.\n\n\n\n\n\nEarlier this year, China threatened to halt exports of rare earth minerals to the United States, amid an ongoing tariff row, after which Trump funded billions of dollars of incentives for investors in the minerals, as part of his 'big, beautiful bill'.\n\n\n\n\n\nIn April, Albanese announced an initial investment of $1.2 billion to set up a strategic reserve of critical minerals, including rare earths, which he described as key to Australia's national security \"in a time of global uncertainty\".\n\n\n\nFarmers gathered this month to protest against a pipeline to enable the Donald Mineral Sands project, south-east of Minyip in Victoria. Source: Supplied The government has also agreed to loan over $2.6 billion to two firms to establish separate refineries — Arafura Rare Earths mine in the Northern Territory and Iluka Resources in Western Australia.\n\n\n\n\n\nBut Australia's push to become a bigger player in the global race for rare earth minerals relies on digging up prime agricultural land, which has led to pushback from some farmers.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/australia-recorded-more-flu-cases-than-ever-this-year-is-it-the-worst-year-on-record/me2opicyw",
        "title": "'Concerning' or a sign of 'good things'? What Australia's flu record means",
        "publish_date": "Mon, 20 Oct 2025 07:03:02 +0000",
        "category": "lifestyle",
        "authors": [],
        "text": "A \"record-breaking\" flu season has left medical experts worried about Australia's vaccination rates, with GPs warning declining figures should serve as a \"wake-up call\".\n\n\n\n\n\nMore than 410,000 lab-confirmed cases have been reported so far in 2025 across the country, eclipsing the previous record of 365,000 last year, according to the Royal Australian College of GPs (RACGP).\n\n\n\n\n\n\"This is not a record we want to be breaking,\" said RACGP president Michael Wright, urging Australia to boost vaccination rates.\n\n\n\nHow bad is 2025 for flu cases?\n\nThe RACGP described 2025 as \"the worst year on record\" for influenza cases adjusted for population, with around 1.5 per cent of Australians experiencing a notifiable flu infection, or 1,525 lab-confirmed cases per 100,000 people this year.\n\n\n\n\n\nJames McCaw, a professor in mathematical biology at the University of Melbourne, said the true number of infections is unknown, because it's likely fewer than 1 in 100 people infected with the virus become reported cases.\n\n\n\n\"Many people, appropriately, self-manage their illness or are supported by their GP but not tested,\" he told SBS News.\n\n\n\n\n\n\"Case counts, or notifications, depend very strongly on peoples' choices on whether or not to seek medical attention and on the choices that GPs make to test or not to test.\n\n\n\n\n\n\"These factors change every year, with generally increasing trends over the past decade — so people are becoming more and more likely to end up recorded as a case given that there were infected.\"\n\n\n\nLISTEN TO Influenza cases surge: time to get vaccinated say experts SBS News 06:40 English\n\nMcCaw pointed to reports compiled by Flutracking, which asks people to monitor for respiratory illness, which he said showed respiratory illness — caused by influenza and many other respiratory viruses — was \"not at all unusual in 2025\".\n\n\n\n\n\n\"Taken together, what this suggests is that in 2025 influenza transmission was fairly typical,\" he said.\n\n\n\n\n\n\"The higher number of reported cases likely reflects increased care-seeking behaviour and/or an increase in GPs' tendency to take a sample and submit it for testing - both good things.\n\n\n\n\n\n\"The increased case numbers are good news in that we may have a slightly better picture of how the virus is spreading.\"\n\n\n\nDr Catriona Vi Nguyen-Robertson, an immunologist and lecturer in science communication at the University of Melbourne, said a 10 per cent increase in flu cases was \"highly concerning\".\n\n\n\n\n\nBut whether it was the \"worst\" year depends on what is being measured, for example, the viruses' impact or transmissibility.\n\n\n\n\n\n\"These numbers are highlighting ... [that] transmission and spread among people this year was up,\" she told SBS News.\n\n\n\n\n\n\"And so if by worse, you mean you know, more people are being impacted, but perhaps it's not the most severe it's been, but a lot of people are being affected, then I think that's one thing to consider.\n\n\n\n\n\n\"And then ... if fewer people are getting it but they're sicker, are we calling that worse?\"\n\n\n\nHow many people were hospitalised with flu?\n\nIn NSW, the number of people admitted to hospital for \"influenza-like illness\" was broadly the same during the past winter season compared to last year, though admissions through July-August 2024 were notably higher.\n\n\n\n\n\nIn Queensland, hospitalisations for flu were slightly higher in 2024 compared to 2025, according to state health department figures.\n\n\n\n\n\nOther states and territories' reports differ in reporting practices. SBS News has sought national data on hospitalisations from the federal Department of Health.\n\n\n\nDrop in vaccination rates a concern\n\nWright said while flu notification rates were soaring, vaccine rates had plateaued. This was even among children and the elderly, who are most at risk from the flu.\n\n\n\n\n\nOnly a quarter of Australian children between six months and five years were vaccinated this year, the lowest rate since 2021, while 60 per cent of those over 65 were vaccinated, the lowest since 2020, the RACGP said.\n\n\n\n\n\nWright said he hoped to see free childhood vaccinations via nasal spray — which Queensland, NSW, South Australia and Western Australia have backed — rolled out across the country.\n\n\n\n\n\nHe said vaccination rates can be stalled due to childhood fears of needles and parental distress.\n\n\n\n\n\n\"Needle-free vaccinations make such a difference.\"\n\n\n\nNguyen-Robertson put the increase in flu cases down to a number of factors, including more people returning to work from home-based positions and the decrease in vaccinations.\n\n\n\n\n\nVaccine hesitancy that came after years of COVID-19 lockdowns was also at play.\n\n\n\n\n\n\"I think COVID really brought out the extremes in a way, she said.\n\n\n\n\n\n\"And so I think we're more aware of vaccine hesitancy, not that it wasn't a problem before, but it's clear that a lot of people are hesitant around vaccines.\"\n\n\n\n\n\nMcCaw said there would be fewer deaths and health system impacts because of influenza if vaccine coverage was higher.\n\n\n\n\n\n\"By getting vaccinated you may also help slow the spread of the virus through the community, thereby indirectly reducing the risk to those most vulnerable, including the elderly and infants.\"\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/video/chinese-students-bridge-language-gap-to-help-older-migrants-prevent-falls-and-stay-safe-in-hospital/ppx61hczk",
        "title": "Chinese students bridge language gap to help older migrants prevent falls",
        "publish_date": "Mon, 20 Oct 2025 05:49:04 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.theage.com.au/sport/afl/gowers-explains-why-hawks-rejected-ridiculous-demands-that-doomed-merrett-trade-bid-20251020-p5n3v4.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Gowers explains why Hawks rejected ‘ridiculous’ demands that doomed Merrett trade bid",
        "publish_date": "Tue, 21 Oct 2025 12:51:10 +1100",
        "category": "sports",
        "authors": [
            "Jon Pierik"
        ],
        "text": "Hawthorn president Andy Gowers has defended the Hawks’ decision to reject Essendon’s demands for Zach Merrett, declaring it would have been ridiculous to have acquiesced to the Bombers.\n\nAnd club great Jason Dunstall said he never expected a “cordial” deal to be done, considering the bad blood between the two heavyweight clubs over the decades.\n\nZach Merrett met with Hawthorn, but a deal couldn’t be done. Credit: Getty Images\n\nMerrett was desperate to join the Hawks during last week’s trade period, but the Hawks and Bombers could not agree to a deal.\n\nThe Hawks offered two first-round selections, a future first-rounder and fringe midfielder Henry Hustwaite, but the Bombers wanted four first-round selections and a second-rounder.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/australia-news-live-aukus-reaffirmed-critical-minerals-deal-signed-in-albanese-trump-meeting-11-7-million-cocaine-shipment-seized-by-afp-chilean-police-20251021-p5n3y9.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Australia news LIVE: AUKUS reaffirmed, critical minerals deal signed in Albanese-Trump meeting; $11.7 million cocaine shipment seized by AFP, Chilean police",
        "publish_date": "Tue, 21 Oct 2025 12:50:55 +1100",
        "category": "finance",
        "authors": [
            "Alexander Darling",
            "Emily Kaine"
        ],
        "text": "Speaking from the Osborne Naval Shipyard in Adelaide this afternoon – a site where nuclear-powered AUKUS submarines will be manufactured – Minister for Defence Richard Marles has praised the outcome of today’s meeting between Albanese and Trump as an “important affirmation of the AUKUS program”.\n\n“The meeting between our Prime Minister and President Trump was a really important affirmation of the United States’ and Australia’s commitment to the AUKUS program. But I want to make a point that we’ve been consistently saying: that this is a program which is very much in the interests of the United States, as it is in the interests of Australia, as it is in the interests of the United Kingdom.\n\nPresident Donald Trump, left, greets Australian Prime Minister Anthony Albanese at the White House Credit: AP\n\nThe USS North Dakota, a Virginia-class submarine of the type Australia would acquire under the AUKUS deal.\n\n“And AUKUS is moving at a pace. When you meet these workers around here, you can touch, feel and see AUKUS occurring. And in the process, what we will see at this site, at the Osborne Naval Shipyard, is the building of our nuclear-powered submarines. And in time, this workplace will have 7000 employees working on submarines … and it will be the largest, the most complex industrial facility in our country,” Marles told the press.\n\nEarlier today, in the first bilateral meeting between Australia and the US since Albanese took office, Trump vowed to uphold the AUKUS defence pact to sell nuclear-powered submarines to Australia.\n\n“It will be a great achievement for our country. At the end of it, what we will have is the single biggest increase in our military capability since the establishment of the Navy more than a century ago. It will be profoundly important for Australia’s national security,” Marles said.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/western-australia/wa-news-live-afl-announces-wa-s-state-of-origin-coach-20251021-p5n41l.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "WA news LIVE: AFL announces WA’s State of Origin coach",
        "publish_date": "Tue, 21 Oct 2025 12:40:40 +1100",
        "category": "sports",
        "authors": [],
        "text": "Former West Coast legend turned Sydney Swans coach, Dean Cox, will coach the West Australian side in the return of State of Origin next year.\n\nThe AFL, this morning, also announced the Victorian club will be coached by former two-time Geelong premiership coach, Chris Scott.\n\nDean Cox. Credit: Getty Images\n\nThe game is due to be held at Optus Stadium in Perth on February 14. It will be the first time an AFL State of Origin match has been played since 1999.\n\nEach coach will soon select their squads, with players to be announced at the start of November.\n\nPlayers will be picked based on their junior club location from where they were drafted.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/world/north-america/albanese-trump-meeting-live-updates-pm-set-to-meet-us-president-in-washington-20251020-p5n3sq.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "As it happened: US president vows speedy delivery of AUKUS submarines to Australia, tells Rudd ‘I don’t like you either’",
        "publish_date": "Tue, 21 Oct 2025 12:37:20 +1100",
        "category": "finance",
        "authors": [
            "Michael Koziol",
            "Ellen Connolly",
            "Brittany Busch"
        ],
        "text": "Despite Donald Trump’s rare earths deal with Anthony Albanese, it will take years for America to shed its dependence on China’s critical minerals.\n\nBut Beijing faces challenges, too. China’s economy is slowing, though it’s holding up better than expected in the face of Trump’s trade war.\n\nChinese President Xi Jinping. Credit: AP\n\nEven as China’s “Fourth Plenum” gathering of the most senior members of the Communist Party got underway on Monday to rubber-stamp Xi Jinping’s next five-year economic plan, the latest economic data shows Asia’s biggest economy grew 4.8 per cent in the third quarter, compared with the same period last year.\n\nWhile that represents a slowdown from the 5.2 per cent growth rate in the June quarter, it keeps the economy on track to meet Beijing’s “around 5 per cent” targeted growth for this year. It’s also a little better than most external forecasters had expected.\n\nBeneath the headline numbers, however, the detail highlights the unbalanced nature of China’s growth, with the divergence between the domestic economy and a boom in exports – despite Trump’s tariffs – stark. The domestic economy is decelerating even as exports are surging.\n\nLast week’s trade data showed that China’s exports were up 8.3 per cent last month, relative to September last year, despite a 27 per cent slump in exports to the US. Monday’s data showed a 6.5 per cent (year-on-year) increase in industrial production, which is clearly linked to that boom in exports.\n\nThe picture of the domestic economy, however, is quite different.\n\nRead senior business columnist Stephen Bartholomeusz’s take here.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/nsw-government-to-spend-190-million-to-take-over-troubled-hospital-20251021-p5n44y.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "NSW Government to spend $190 million to take over troubled hospital",
        "publish_date": "Tue, 21 Oct 2025 12:28:25 +1100",
        "category": "finance",
        "authors": [],
        "text": "NSW Government to spend $190 million to take over troubled hospital\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/politics/queensland/cash-was-temporarily-banned-on-brisbane-buses-and-trains-it-never-came-back-20251021-p5n41t.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Cash was ‘temporarily’ banned on Brisbane buses and trains. It never came back",
        "publish_date": "Tue, 21 Oct 2025 12:12:56 +1100",
        "category": "finance",
        "authors": [
            "Felicity Caldwell"
        ],
        "text": "Thousands of commuters are calling for cash to be reinstated at Queensland Rail ticket offices, and council parking meters.\n\nWith shops to be forced to accept cash for essential goods and services from next year, almost 3000 people have now signed a petition calling for cash to return for public transport tickets.\n\nCash was temporarily banned on south-east Queensland public transport during the pandemic, and then permanently banned. Credit: William Davis\n\n“There are cash-accepting ticket machines at railway stations, however, these 17-years-old machines are often out of service, at times don’t give change and are difficult or impossible to use for anyone with a vision, mental or dexterity impairment,” the petition reads.\n\n“Go Card retailers accept cash, however, many are not located in close proximity to transport hubs and have limited opening hours.”",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/cricket/it-takes-two-hits-to-get-sorted-smith-back-from-new-york-in-ashes-state-of-mind-20251021-p5n428.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘It takes two hits to get sorted’: Smith back from New York in Ashes state of mind",
        "publish_date": "Tue, 21 Oct 2025 12:07:28 +1100",
        "category": "sports",
        "authors": [
            "Tom Decent"
        ],
        "text": "Steve Smith insists he isn’t hellbent on batting at No.4 for Australia in the Ashes and believes his low-key preparation in New York, where he didn’t pick up a bat for about six weeks, hasn’t affected his readiness for this summer.\n\nThe Australian vice-captain, who will lead the Test side if Pat Cummins fails to recover from a back injury, had his first hit against bowlers since August 28, when his Welsh Fire side finished up their commitments in the limited-overs Hundred competition, on Tuesday at Cricket NSW headquarters.\n\nOne month out from the Ashes, Smith’s place in Australia’s XI is assured, though debate continues to rage about the batting order.\n\nThis masthead revealed earlier this month that selectors have discussed a possible reshuffle that would see Smith move to No.3 to accommodate Cameron Green at No.4. There is a school of thought that Green is better suited lower down the order if he is also bowling.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/business/markets/trump-brought-knives-but-china-brought-a-bazooka-20251021-p5n3zs.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Trump brought knives, but China brought a bazooka",
        "publish_date": "Tue, 21 Oct 2025 12:01:34 +1100",
        "category": "finance",
        "authors": [
            "Stephen Bartholomeusz"
        ],
        "text": "The property sector also continues to shrink, with a 13.9 per cent fall in property investment relative to the same period last year. New home prices fell 0.4 per cent from August and secondary market housing dropped 0.6 per cent. New home prices are now more than 10 per cent off their peaks and “used” homes nearly 20 per cent. Prices are now back to their levels before the pandemic and before Xi introduced the “three red lines” policy that blew up the market. Loading September was the worst month for the property market this year, which will cause some concern at the plenum as it is the major factor behind the weak levels of consumer confidence and spending that have resulted in deflation over the past two and a half years. Nominal GDP growth of 3.7 per cent underscores how significant the rate of deflation has become and how threatening it is to any rebound in domestic confidence and consumption. At the heart of the weaknesses in the domestic economy is the continuing slump in the property sector, which Beijing has been unable to arrest.\n\nThe outcomes from the plenum will be closely watched to see if the party leadership plans to do something more substantial to boost domestic consumption than the piecemeal and relatively ineffective measures it has tried to date. The strongest growth areas within China’s economy were, as expected, those targeted by (and subsidised by) the last five-year plan: electric vehicles, computers, communications and other electronic equipment manufacturing, ships and aircraft. The 16 per cent growth, year-on-year, in the value-add of the auto sector highlights both the unbalanced nature of the economy and the structural imbalances within it. Even though few, if any, of China’s auto manufacturers generate profits, they are producing a swelling tide of vehicles which – with domestic demand soft and endless cycles of price wars in the domestic market – have been pouring into export markets where there are better margins. That is creating tension and pushback from within those markets, with other countries starting to move to protect their own auto industries from China’s cheap electric vehicle exports.\n\nThe auto sector is one of the industries targeted by Beijing in its campaign against “involution,” or over-capacity, and the cut-throat competition that is helping to drive deflation. The sub-economic nature of those exports, and exports of other manufactured products also suffering from involution, shows up in the trade data, where growth in the volume of China’s exports is significantly outpacing the increase in their value. Chinese electric vehicle manufacturers are producing cars at breakneck speed. Credit: Bloomberg Other sectors earmarked for consolidation are China’s coal and steel industries, both of which produced less last month as demand weakened and companies started to fall into line with Beijing’s demand to reduce overcapacity. Coal production was down 1.8 per cent year-on-year and steel output 4.6 per cent, which isn’t good news for Australia’s iron ore miners. The increased reliance on exports for growth makes China vulnerable. It has largely shrugged off the direct effects of Trump’s trade wars, but the growing resistance to its exports elsewhere is a threat to its mercantilist strategy.\n\nIt needs a better balance between domestic activity and external trade, which is something the leadership has no doubt grappled with ahead of the plenum, although Xi is expected to double down on his long-term ambition of global domination of advanced manufacturing, along with self-sufficiency in the targeted sectors and their supply chains. Loading The plenum isn’t expected to set GDP growth targets for the next five years – the last one didn’t – but China needs growth of only about 4.5 per cent in the December quarter to meet the target of “around 5 per cent” that it began this year with. It needs growth of around 4.7 per cent or 4.8 per cent a year for the next five years to meet Xi’s ambition, set as part of the “Made in China 2025” strategy – the plan that has driven China’s global leadership in electric vehicles, solar cells and shipping and seen dramatic increases in its development of artificial intelligence, semiconductors, a domestic aviation industry, biotech and other strategic sectors – of doubling the size of economy by 2035, relative to its size in 2020 when the strategy was developed. Trump’s trade wars could complicate China’s ability to achieve that goal, even though the US now represents a market for only about 10 per cent of China’s exports.\n\nChina thrived in a free trade environment, but Trump’s tariffs on everyone is forcing other economies to become more defensive and protectionist. That adds to the need for China’s to rebalance the relationship between domestic consumption and exports. Loading Trump and Xi are supposed to meet on October 31, with Trump identifying rare earths, fentanyl and soybeans as his priorities. Tensions over China’s dominance of rare earths flared after China – in response to a US tightening of restrictions on sales of advanced semiconductors to Chinese companies – tightened and broadened its own export restrictions on rare earths and permanent magnets, which are essential to most advanced manufactures and critical to many military technologies. Trump then threatened a 100 per cent tariff on all imports from China. Even though Trump struck a deal with Anthony Albanese overnight to get access to Australia’s plentiful reserves of rare earths, it will take many years before the US can shed its dependence on China’s rare earths and rare earth magnets and the vulnerability that has created.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/culture/live-reviews/humour-and-depth-in-story-about-faith-family-and-finding-your-beat-20251019-p5n3k3.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "This is the funniest, whip-crackingest, heart-warmingest show in town",
        "publish_date": "Tue, 21 Oct 2025 11:52:33 +1100",
        "category": "entertainment",
        "authors": [
            "John Shand",
            "Bernard Zuel"
        ],
        "text": "Gregory Porter’s voice is like a log fire on a winter’s night. It doesn’t just radiate warmth, it has a comfort factor. It’s the voice of someone who’s worked out a thing or two about this very temporary exercise called life, and wants to ease the suffering and spread a little beneficence with a generosity of heart that’s the opposite of those people who win talent quests by impressing. Porter has bigger fish to fry than merely impressing. A mere nine years ago he was at the old Basement. Now he’s packing out the Concert Hall with fans who know all the songs, having been seduced by the voice of this barrel-chested man in the trademark hat, who can fleetingly remind you of singers ranging from Nat King Cole to Marvin Gaye, yet sounds only like himself. He lets jazz flow into soul as naturally as two rivers meeting, so it’s impossible to define where they merge. Gregory Porter in action on stage at the Opera House. Credit: Johannes Napp Most of the songs are his own, with lyrics about coping, loving, hoping and improving. The latter’s quite an attractive idea, given most of us seem to believe that bemoaning our lot is a form of conversation. You feel the truth of the magnanimity with Porter, not just via the lyrics and the amusing between-song chat, but via the voice itself, which seems to proclaim that goodness is possible, and you leave the two-hour show briefly believing it. His long-term quartet has been augmented by organist Ondrej Pivec, who maximises the inherent drama of a Hammond B-3, and provides another soloing voice to join tenor saxophonist Tivon Pennicott and pianist Chip Crawford. Bassist Jahmal Nichols anchors the music, while also providing the night’s most engrossing solo feature, which builds into a groove so wicked it must be barely legal, and then morphs into two rare covers: The Temptations’ My Girl and Papa Was a Rolling Stone. Drummer Emanuel Harrold remains the joker in the pack: unusually busy for the soul side of the idiom (if not the jazz), and ensuring the music is energised and studded with surprises.\n\nPorter’s anthemic Musical Genocide drops away to just Crawford’s piano, which slips into Waltzing Matilda. Although Porter doesn’t sing it, the audience does, and what could easily have been corny is actually quite touching. More moving is Porter’s Water Under Bridges, ostensibly about a break-up; more pertinently about how his brother helped him cope: a brother who died during the pandemic. Sung with only piano accompaniment this allows us to immerse ourselves in his voice’s richness. Seldom does he unleash its full magnificence, but when he does, as on the spiritual Wade in the Water, you are physically pushed back by its power. The sound was second-rate to start, and never became quite as sharply focused as it can be in this room, although it did keep improving, right through to the second (genuinely demanded) encore. MUSIC\n\nKarnivool\n\nEnmore Theatre, October 19\n\nReviewed by ROD YATES\n\n★★★★ When Karnivool guitarist Mark Hosking steps up to the microphone and thanks the audience for sticking with them over the years, he acknowledges that they are a band that require patience from their fans. They postpone shows, he says – a reference to the fact that this evening’s gig was originally scheduled to take place last July before illness rendered the quintet unable to perform – and they take years between albums.\n\nKarnivool in full flight at the Enmore Theatre. Credit: Kane Hibberd Indeed, when their new record In Verses comes out in 2026, it will be only their fourth full-length since forming in Perth in 1998 and will drop a whopping 13 years after predecessor Asymmetry. In the here-today-gone-later-today nature of music stardom in 2025, rare is the band that can treat their release schedule with such disdain yet still command the kind of loyalty that enables them to sell out the 2500-capacity Enmore Theatre with ease. That they share a special bond with their audience is obvious. From the genuine glee that flashes across the face of vocalist Ian Kenny when greeting the crowd to the way in which the punters morph into a mass choir during closer New Day and the thundering Themata, the overwhelming feeling from both band and audience is release. Contributing to that sense is the group’s mastery at creating musical tension.\n\nDrummer Steve Judd’s mindbogglingly complex rhythms and the intricate guitar interplay between Hosking and Drew Goddard combine to form a dark, dense, prog-metal symphony that they tease to a thundering climax in the epic Deadman and a gloriously heavy Roquefort. Of the two new tracks Karnivool have released this year they open with one in Drone and put the other, Aozora, third song in. That they do this rather than go for a cheap win by opening with an old favourite like Cote (which appears later in the set) speaks volumes about the confidence of the band and the trust they place in their audience to go along for the ride. After almost three decades, though, those fans know the deal – Karnivool will march to the beat of their own drum and indulge their musical whims without any care for the demands of the mainstream. In return, they will deliver a masterful show like this. MUSIC\n\nBURNA BOY\n\nQudos Bank Arena, October 18\n\nReviewed by SHAMIM RAZAVI\n\n★★★½ Burna Boy’s current tour takes him places no African artist has gone before, and his first Sydney headline show is no exception: it’s hard to imagine that Olympic Park has ever hosted a Nigerian party of these proportions, with even the food trucks putting on their best impersonations of jollof rice and swallows. Inside the arena, the mood was authentic Afrofusion: an Afrobeats base with aesthetic influences from the rest of the world.\n\nThat African base was ever present – in the Yoruba-Pidgin lyrics, in the use of the talking drum and shekere instruments, in the infectious familial informality — but fused with global elements ranging from Kingston Town rhythms to Ed Sheeran aesthetics straight from the badlands of Ipswich: a sound as global as it is grounded. Burna Boy in full flight at Qudos Bank Arena. Credit: Glenn Pokorny Burna’s studio production is glossy and complicated, which in the hands of a lesser artist might have been a disappointment live. Not so for the African Giant: in his case, less polish and more talent actually improved on his overstuffed recordings. His baritone especially benefited from the concert treatment – with AutoTune dialled back, we were reminded of the charm and intensity that sets his act apart from his peers. In fact, the a cappella intro to It’s Plenty drops the vocal filters altogether and he sounds properly masterful as a result. The price for this willingness to experiment and mix things up was the occasional misfire. Bank on It was transformed with a smooth-jazz vibe, complete with a sax line straight from the Kenny G songbook: more lounge than Lagos; the CGI screen backdrops were more artificial than intelligent, and the occasional keytar on stage, like an escapee from a wedding band, only highlighted the strange aesthetic choices. Not that anyone seemed to mind, judging by the assortment of audience underwear thrown on stage. Shirtless from the second song, Burna Boy worked that rich voice and charisma hard, building to a closing climax of Ye and Last Last. And yet, for all the heat and magnetism, there was something missing – a looseness and unrestraint that would have transformed this good night into a great one: the gap between smouldering and fire.\n\nMUSIC\n\nGORDI\n\nPlayhouse, Sydney Opera House, October 17\n\nReviewed by BERNARD ZUEL\n\n★★★½ Though neither of them occurred during the performance, two medical episodes punctuated this show and told us something about Sophie Payten in both normal and Gordi mode, in medical and musical personas. The lesser of them, told in comic semi-pantomime, concerned Payten at the dentist when one of her songs, Heaven I Know, came on the surgery’s playlist like the universe was helping convince them she really was a musician. On stage, that song built from looped and live vocal layers and slowly accreting instruments until we had an alterna-choir that served as a kind of halo around the simple lines of an ending and acceptance. “Yeah, I got older, and we got tired/Heaven I know, that we tried.” Gordi aka Sophie Payten performs at the Sydney Opera House. Credit: Gabrielle Clement More seriously, the other story featured a patient of hers – Payten completed her medical studies during and immediately after COVID lockdowns – who confronted news of his imminent death with a level of equanimity that would be beyond most of us, leaving an impact on his young doctor.\n\nThe two songs inspired by this experience were not leaden but rather a flow of warm energy that pushed everything forward and a blend of Elliott Smith and Bon Iver as pure pop immersed in hazy winter. Around these three songs, in material that included all the tracks of her new-ish album, Like Plasticine, and scattered shots from previous releases, Payten/Gordi moved between endings and rebuilding, back and forth from thickened layers to modestly proportioned instrumentation, counter-intuitively guitar-pushed vibrant when crushed and synth-filled solemn when emotionally buoyant, and often distorting her voice through various effects as if not wanting clarity to be confused with truth. Songs found her uncertain on questing love (“Do you care? Do you care?/Don’t make me your peripheral lover”), falling on a failure (“I made available a portion of my heart/Not anymore”) and rising again on the certainty of comfort (“I know the pressure you feel seems relentless/But everything is fleeting, except you and I”). And then, closing with Can We Work It Out, on the horns of a dilemma – ready to believe, but bracing for regret – she threw at us the bushiest and brightest song of the night with its solid propulsion and almost fizzing slices of vocals. THEATRE\n\nDAYTIME DEEWANE\n\nRiverside, October 18, until October 25\n\nReviewed by KATE PRENDERGAST\n\n★★★★\n\nIn 1980s Britain, after racist club bouncers wouldn’t give anyone with brown skin their share of night, a new underground subculture emerged. These were the Daytimers, day parties run by South Asian collectives, where shunned ravers could congregate on their own terms, to their own DJs, dancing to new music blending bass-kicked Bhangra, Asian garage and diaspora-mixed jungle. Azan Ahmed sets his award-winning 2022 play at the last Daytimer party, in London in 1997. Sixteen-year-old Farhan (Ariyan Sharma), wonders whether Islam forbids dancing as he scurries nervously in school uniform towards his first-ever rave. His 20-year-old rude-boy cousin Sadiq (Ashan Kumar), bounces about impatiently in wifebeater vest and chains, breaking into rhapsodies on the dancefloor’s true radical principles of defiance, humanism and transcendent release. Ariyan Sharma and Ashan Kumar are excellent as two cousins on clashing coming-of-age trajectories in Daytime Deewane. Credit: Phil Erbacher Built on the twists in its character foils, Daytime Deewane unfolds as a story about these two very different young Muslim men, each trying to define his means and methods of self-respect against the values and expectations of his heritage. It loses its beat in the last stretch – the time leap to a reunion scene strikes an off-key chord and leaves us with an ambiguous moral takeaway – but there’s a lot to rate highly in this play about migration, masculinity and faith. Its two leads go point-for-point in endowing Riverside’s Australian premiere with humour and depth. Sharma gives us signature goof as the duty-bound teenage square, cutting Farhan the weirdest of shapes as an aspirational “peacock” bro while asking where the prayer room’s at.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/lifestyle/tiktokers-mum-sabotages-gender-reveal-with-a-prank-20251021-p5n445.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Tiktoker's mum sabotages gender reveal with a 'prank'",
        "publish_date": "Tue, 21 Oct 2025 11:50:27 +1100",
        "category": "lifestyle",
        "authors": [],
        "text": "Tiktoker's mum sabotages gender reveal with a 'prank'\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/property/news/landscape-designer-paul-bangay-relists-dreamy-victorian-estate-for-6-6m-20251021-p5n3zx.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Dreamy Victorian estate of landscape designer Paul Bangay relisted for $6.6m",
        "publish_date": "Tue, 21 Oct 2025 11:49:21 +1100",
        "category": "finance",
        "authors": [
            "Orana Durney-Benson"
        ],
        "text": "Leading landscape designer Paul Bangay’s country estate in Victoria is back on the market, two years after a high-profile deal fell through.\n\nStonefields is a dreamy Tuscan-inspired escape in the hills near Daylesford that Bangay has previously called his “life’s greatest work”.\n\nOver twenty years, Bangay transformed a cow paddock into an extraordinary garden with sweeping lawns, oak avenues, and 4000 individual tulips.\n\nNow the estate is on the market for expressions of interest, with a price guide of $6 million to $6.6 million.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/soccer/after-two-years-out-sam-kerr-set-for-first-match-back-in-australia-20251021-p5n415.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "After two years out, Sam Kerr set for first match back in Australia",
        "publish_date": "Tue, 21 Oct 2025 11:43:50 +1100",
        "category": "sports",
        "authors": [
            "Frances Howe"
        ],
        "text": "Sam Kerr is set to play her first match on Australian soil in more than two years against New Zealand in Gosford next month, Football Australia announced on Tuesday.\n\nA two-game international series will be held at Polytec Stadium, with the first match scheduled for November 28.\n\nSam Kerr scored Australia’s only goal in their 2023 World Cup semi-final against England. Credit: AP\n\nInterim Football Australia chief executive Heather Garriock said Kerr should make an appearance in those matches, following her selection for two Matildas’ upcoming friendlies against Wales and England.\n\n“We’re excited to see Sam back on the football field,” Garriock said. “The squad will be announced in the near future, and we look forward to Sam being named in that squad and possibly in the game at Gosford for her to play her first minutes on Australian soil since she got injured.”",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/technology/why-one-company-s-glitch-just-broke-half-the-internet-20251021-p5n41g.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Why one company’s glitch just broke half the internet",
        "publish_date": "Tue, 21 Oct 2025 11:41:16 +1100",
        "category": "finance",
        "authors": [
            "David Swan"
        ],
        "text": "Australia is particularly reliant on AWS. The federal government inked a three-year whole-of-government deal in January 2025, giving federal, state and local agencies streamlined access to AWS services. The government has committed $2 billion over the next decade for AWS to build a “Top Secret Cloud” to host the nation’s most sensitive defence and intelligence data. Anthony Albanese at a press conference during the prime minister’s June visit to the Amazon Spheres in Seattle. Credit: Alex Ellinghausen More than 140 Commonwealth, state and territory agencies already rely on AWS for critical services in transport, health, education and tax collection. The root cause of this week’s issue hasn’t yet been identified, though it appears tied to a DNS (Domain Name System) failure within AWS’s US-EAST-1 region, in Virginia. To put it simply, the digital phone book for much of the cloud was broken, and when AWS stumbles, anything or anyone relying on its services stumbles too.\n\nThis isn’t a new story. AWS experienced similar outages in 2023 and 2021, when a five-hour disruption prevented customers from accessing airline reservations and payment apps. And just 15 months ago, the CrowdStrike disaster showed us what happens when critical infrastructure software fails at scale. Loading The July 2024 CrowdStrike incident was different in nature, but similar in its sheer impact. CrowdStrike makes cybersecurity software that runs on individual computers and servers to protect them from hackers. A faulty update caused roughly 8.5 million Windows systems to crash simultaneously, triggering an estimated $US10 billion ($15.3 billion) in global damage. Airlines grounded thousands of flights. Hospitals scrambled to access patient records. Supermarkets effectively shut down and emergency services went dark. The two incidents share a troubling pattern: single points of failure causing cascading global chaos.\n\nBut there’s a crucial difference. CrowdStrike affected individual machines that required technicians to manually fix them one by one. Monday’s AWS outage hit centralised infrastructure – the very foundation upon which modern digital services are built. Checkouts at Coles in New Farm were offline after the CrowdStrike outage of July 19, 2024. Credit: Cameron Atfield The outage underscores the critical role AWS plays in the functioning of the entire internet. And for one provider to have so much influence is a problem when something goes wrong, far beyond just inconveniences for businesses or customers. “When a single provider goes dark, critical services go offline with it,” advocacy organisation Article 19 warns. “Media outlets become inaccessible, secure communication apps stop functioning, and the infrastructure that serves our digital society crumbles.” They have a point. This isn’t just about missing a few hours on social media or not being able to respond to your Tinder match. It’s about systemic fragility in critical infrastructure that increasingly underpins finance, healthcare and ultimately democracy.\n\nTo be fair, cloud computing has brought real benefits, and has been one of the most transformative technologies over the last decade, alongside AI. It’s made technology cheaper and more accessible, allowing start-ups to compete without buying expensive servers. It’s enabled services to scale rapidly to meet demand. And companies like AWS do invest heavily in redundancy – back-up systems designed to kick in when something fails. They just don’t always work. So, what should we do differently? First, regulators and governments must treat cloud infrastructure like the critical public utility it has become. The internet is too important not to. We don’t allow one company to control 30 per cent of electricity generation for good reason and the same logic should apply to the digital infrastructure that powers modern life. This doesn’t mean breaking up tech companies, necessarily, but it does mean greater oversight, standards and accountability.\n\nSecond, governments need to mandate genuine redundancy. And not just within a single provider’s ecosystem, but across different providers. If your back-up generator runs on the same power grid as your main system, it’s not really a back-up. Loading Third, we need transparency. When AWS goes down, the public deserves to know immediately what failed, why, what’s at risk, and when full service will return. AWS did provide regular updates overnight, but the current system is inadequate for infrastructure this critical. None of this is straightforward or easy, but the status quo isn’t working either. The internet has become too important to be this fragile, and too important to be held hostage by any single company.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/goodfood/recipes/adam-liaw-s-ling-with-turmeric-rice-20251021-p5n43g.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Adam Liaw’s ling with turmeric rice",
        "publish_date": "Tue, 21 Oct 2025 11:35:14 +1100",
        "category": "lifestyle",
        "authors": [
            "Adam Liaw"
        ],
        "text": "Step 3\n\nAdd the onion, garlic and coriander root and stems and fry for 1 minute. Season very well with salt, then add the extra turmeric and the rice and cook for about 2 minutes until lightly toasted. Add the stock and stock powder, peas and bay leaf and bring to a simmer. Cover the pan and reduce the heat to very low and simmer for a further 12 minutes. Turn off the heat, then return the fish to the top of the rice, cover the pan and stand for 10 minutes. Uncover and scatter the coriander leaves over the top with a bit of chilli or paprika powder. Serve with yoghurt and lemon wedges.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/nsw/if-you-thought-sydney-s-diamond-about-was-bad-try-the-road-leading-up-to-it-20250825-p5mplh.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "If you thought Sydney’s ‘diamond-about’ was bad, try the road leading up to it",
        "publish_date": "Tue, 21 Oct 2025 11:30:00 +1100",
        "category": "finance",
        "authors": [
            "Mostafa Rachwani"
        ],
        "text": "Fifteenth Avenue in Austral has no turning lanes, no deceleration zones, no space to overtake, a bungled roundabout, no traffic lights and ends in the middle of bushland.\n\nAnd, yet, it is set to become one of western Sydney’s most important roads, connecting Liverpool to the new Western Sydney International Airport. It is intended to be central to greenfield areas where residential developments have become essential to easing the housing crisis.\n\nAustral’s Fifteenth Avenue is a traffic nightmare, with only one lane in each direction. Credit: Hannah Anderson\n\nAlready, thousands of people have piled into the surrounding suburbs, transforming a once quiet semi-rural region on the edge of the city into a thrumming construction zone, filled with new developments, schools and businesses.\n\nBut the road itself has struggled to keep up.",
        "source": "TheAge"
    },
    {
        "url": "https://au.finance.yahoo.com/news/submarines-sarcasm-best-quotes-trump-004052361.html",
        "title": "Submarines and sarcasm: best quotes from Trump meeting",
        "publish_date": "2025-10-21T00:40:52Z",
        "category": "finance",
        "authors": [
            "Tom Wark",
            "Mon October At Pm",
            "Min Read"
        ],
        "text": "Prime Minister Anthony Albanese and US President Donald Trump could not have had nicer things to say about each other during their first White House meeting, but others had mixed feelings about the love-in.\n\nBILATERAL RELATIONSHIP\n\nAnthony Albanese tried some golf diplomacy, inviting the president to visit for the President's Cup. (Lukas Coch/AAP PHOTOS)\n\n* \"We've been long-term, long-time allies and I would say there's never been anybody better.\" - Donald Trump\n\n* \"This is a relationship that's been forged in the battlefields of the world, we have stood side-by-side for freedom and democracy.\" - Anthony Albanese\n\n* \"In fact, I've been invited to go (to Australia) and I'll have to give it serious consideration.\" - Mr Trump\n\n* \"Perhaps we could time it ... with the President's Cup (golf tournament) that Australia hosts.\" - Mr Albanese\n\nCRITICAL MINERALS\n\nThe critical minerals deal was sealed with the flourish of the Sharpie pens favoured the president. (Lukas Coch/AAP PHOTOS)\n\n* \"We're going to be signing an agreement that's been negotiated over a period of four or five months.\" - Mr Trump\n\n* \"In about a year from now we'll have so much critical mineral and rare earths that you won't know what to do with them.\" - Mr Trump\n\n* \"This is an $8.5 billion pipeline that we have ready to go.\" - Mr Albanese\n\n* \"We have a natural affinity in working with each other to assure the supply of these critical minerals. It's good for Australia and it's good for global markets.\" - Foreign Minister Penny Wong\n\nAUKUS\n\nDonald Trump allayed fears that the AUKUS deal was in jeopardy. (Lukas Coch/AAP PHOTOS)\n\n* \"You've had the chief of the navy here as well which will play obviously a very critical role with the subs and increasing the security for the region and the world.\" - Mr Albanese\n\n* \"What we're really trying to do is take the original AUKUS framework and improve it for all three parties and ... clarify some of the ambiguity.\" - US Navy Secretary John Phelan\n\n* \"(The AUKUS deal) was made a while ago and nobody did anything about it ... we're starting that process now and I think it's really moving along very rapidly.\" - Mr Trump\n\n* \"The president said the right sort of things about AUKUS and his commitment to AUKUS was important.\" - former Australian ambassador to the US Arthur Sinodinos on Sky News\n\n* \"President Trump could not have been clearer on the submarines ... he was very clear that Australia will get the subs.\" - Senator Wong\n\nKEVIN RUDD\n\nKevin Rudd copped a presidential spray for his scathing tweets. (Lukas Coch/AAP PHOTOS)\n\n* \"The Australian ambassador? I don't know anything about him.\" - Mr Trump\n\n* \"Before I took this position, Mr President.\" - Australian ambassador to the US Kevin Rudd, when asked if he made negative comments about Mr Trump\n\n* \"I don't like you either. And I probably never will.\" - Mr Trump to Mr Rudd",
        "source": "Yahoo"
    }
]