[
    {
        "url": "https://www.9news.com.au/finance/gst-why-are-there-calls-to-change-it-australia-tax-system-explained/90b4e02e-8aec-4a15-8727-e2ba31209a98",
        "title": "Why experts want to raise one of Australia's least popular taxes",
        "publish_date": "Sat, 12 Jul 2025 20:06:23 +0000",
        "category": "finance",
        "authors": [
            "Jul"
        ],
        "text": "T﻿o most people, $80 billion is an extraordinary amount of money. Where the GST is concerned, though, experts say it's not enough.\n\nThe decision by the Howard government to introduce the goods and services tax was an unpopular one 25 years ago, and it's little surp﻿rise politicians today are keen to avoid talking about raising it from its current 10 per cent.\n\nHowever, that's exactly what economists say needs to happen . This is why.\n\nEconomists are calling for the GST to be overhauled. (AFR Louie Douvis)\n\nWhy are there calls to change the GST?\n\nThe federal budget is in a structural deficit and desperately needs more revenue.\n\nAt the same time, government coffers are overly reliant on individual income tax, which accounts for more than half of all taxation revenue, and Treasurer Jim Chalmers has spoken about wanting to reduce tax strain on personal earnings.\n\nIf the government wants to reduce income tax, it doesn't have many options to replace that revenue, much less to do so while returning the budget to surplus.\n\nWinding back negative gearing and capital gains concessions have been ruled out, and a carbon tax – something proposed by former Treasury secretary Ken Henry – has proven political suicide in the past.\n\nAt the same time, consumption taxes like the GST cause very little economic damage compared to other options like excises and stamp duties.\n\n\"The GST and taxes like it are a much more efficient way of raising revenue,\" Professor Richard Holden from the University of NSW told 9News last week.\n\n\"They create less distortions, they do less damage to productivity and the economy.\"\n\nAgainst the backdrop of this economic picture is the government's upcoming productivity roundtable.\n\nTo be held next month, Chalmers flagged in a Press Club speech that the roundtable could pave the way for a much-needed overhaul of the tax system ﻿– a speech that was quite quickly followed by calls to reform the GST.\n\nJim Chalmers said the government's productivity roundtable could lead to tax overhaul. (Rohan Thomson)\n\nHow does Australia's GST compare to the rest of the world?\n\nWhile there's a perception among Australians that ours is a high-taxing nation, the truth is taxes here are quite low compared to the rest of the world .\n\nThe GST is no exception.\n\nWhile the United States doesn't have a federal consumption tax (it instead has state-based sales taxes) and Canada has a lower rate of 5 per cent, Australia's 10 per cent GST is on the lower end of the global scale.\n\nIt's on par with the consumption taxes levelled in Japan and South Korea, but short of the GST in New Zealand (15 per cent) and of comparative value added taxes (VATs) in the likes of Germany (19 per cent), the United Kingdom (20 per cent) and Ireland (23 per cent).\n\nIt's also below the OECD average of 19.4 per cent.\n\nLittle surprise, then, that the amount of consumption tax Australia collects as a proportion of total revenue is far less than the global average.\n\nWhat could a change look like?\n\nExactly what a﻿ reformed GST could look like differs from economist to economist, but a common suggestion has been raising it to 15 per cent.\n\nThat's what Holden's proposal is, while at the same time cutting personal income tax and giving every worker a $12,500 GST-free threshold to make sure low earners are better off.\n\nThe point about shielding low-income earners from any ill effects of a GST increase has been made by several economists.\n\n﻿\"The GST is one of the most effective ways to tax those on higher incomes, but it affects lower-income earners more,\" Dr Venkat Narayanan from RMIT University said.\n\n\"Why not talk about a 10.5 per cent GST for the next few years and increase it by 0.5 per cent until we get to 15, rather than just straight to a higher percentage?\n\n\"Any reform should consider income taxation... so that any increases to the GST do not disproportionately affect low-income earners.\"\n\nSome measures have been proposed to shield low-income earners from the negative effects of a GST overhaul. (Luis Enrique Ascui/The Age)\n\nAnother option flagged by think tank the Australia Institute, which has found the government has so far collected $231 billion less in GST than what was originally intended, is broadening the tax to remove some exemptions.\n\n\"Higher-income households don't have to pay GST on private schools and private health and can find other ways of avoiding the tax,\" executive director Richard Denniss said.\n\n\"On the other hand, lower-income households are spending more on rent and mortgages, which means they have less money to spend on the things that would generate GST revenue.\n\n\"If the Australian government wants to fill this tax blackhole without hurting low-income households, it could broaden the GST so that it applies to private school fees and private health insurance.﻿\"\n\nSo will the government actually increase the GST﻿?\n\nProbably not.\n\n\"I think often an increase in the GST is spent three or four times over by the time people are finished with all of the things that they want to do with it,\" Chalmers said when taking questions following his Press Club address.\n\nAnd while the treasurer also called ﻿to an end to what he called the \"rule-in, rule-out game\", Prime Minister Anthony Albanese couldn't help himself last week.\n\n\"Consumption taxes by definition are regressive in their nature, so that's something that doesn't fit with the agenda,\" he said.",
        "source": "9News"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-14/nguni-cattle-an-alternative-farming-option-amid-climate-change/105507226",
        "title": "These tough African cattle could be ideal for Australia's environment",
        "publish_date": "Mon, 14 Jul 2025 02:04:36 +0000",
        "category": "finance",
        "authors": [],
        "text": "Farmers and researchers hope the birth of a new generation of hardier, more heat-resistant cattle on a West Australian farm will spur the breed's adoption across the country.\n\nOriginally from Eastern Africa, Nguni cattle are bred to survive in tough landscapes, which advocates say makes them ideal for regional Australia.\n\nThe new herd was born on Whitby Falls Farm, run by Murdoch University south of Perth, to educate veterinary students and research the breed.\n\nMurdoch University animal reproduction expert and research lead Pete Irons said Nguni cattle had adapted over many centuries to harsh environments.\n\n\"They're very light on the land … they're very efficient at utilising resources … their ability to conserve nitrogen [and] recycle nitrogen in their bodies is all very highly developed,\" he said.\n\nCaitlin Cooper and Pete Irons say Nguni cattle are a hardy breed. (ABC South West WA: Kate Forrester)\n\nThe cattle's skin contains an oily substance that reflects the sun's rays, and they are also able to regulate their body temperature very effectively.\n\nDr Irons said these characteristics contributed to the breed's ability to tolerate tough conditions, making them a desirable livestock option in drought and heatwave-prone regions like WA.\n\n\"[They're also] highly disease resistant and very fertile,\" he said.\n\n\"So despite being in very harsh environments, they're able to breed and reproduce very successfully.\"\n\nNguni produce less methane than other breeds. (ABC South West WA: Kate Forrester)\n\n'Eco-friendly' alternative\n\nNguni breeder Ed Rous said they produced less methane than other breeds, and were the best cattle for any sustainable farming operation.\n\nEd Rous breeds Ngunis on his farm in Gundaroo. (Supplied: Ed Rous)\n\nThe red-meat industry recently abandoned its target of net-zero emissions by 2030, claiming the goal was not possible.\n\nHowever, Dr Irons said the beef industry needed to reduce its greenhouse gas emissions, and the Nguni offered an environmentally friendly step in the right direction.\n\n\"Anything we can do to address [those emissions] by creatively using different breeds of animals with unique genetics like this and farming efficiently … that will, by its very nature, reduce methane emissions,\" he said.\n\n\"This breed has real advantages here in Western Australia that the farming community should take seriously, especially as we move more and more into drought conditions [and] resource constraints.\n\n\"We think it's a breed we should be looking at.\"\n\nMurdoch's Whitby Falls Farm school is a 45-minute drive south of Perth. (ABC South West WA: Kate Forrester)\n\nRaising awareness of the breed\n\nMr Rous said while interest in breeding Nguni cattle had been growing, the market remained focused on larger breeds such as Angus and Hereford.\n\n\"I feel the place in the sun for the Nguni is definitely more sustainable operations where people are farming paddock to plate because of their good meat … you can value-add by selling the product directly yourself,\" he said.\n\nEd Rous describes Nguni cattle as God's given breed. (Supplied: Ed Rous)\n\nMr Rous said he hoped research, like the studies being done by Murdoch University, would raise awareness about the breed.\n\n\"I have no doubt that they are capable of doing exceptionally well and they've proven to me that they [can], but I'm hoping we get more and more Australians interested in them,\" he said.\n\n\" Show people through scientific research that they are God's given breed of cattle to cattlemen. \"\n\nMurdoch student vet Caitlin Cooper said she expected the breed to have a \"huge impact\" moving forward.\n\n\"They truly are [the ultimate survivors] … they're tick resistant, heat resistant and in this current climate we need a resistant breed,\" she said.\n\n\"It's just about getting the word out about the Ngunis because I think that's the way into the future.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-14/burringurrah-grocery-shop-school-attendance-scurvy-benefits/105488210",
        "title": "Driving 10 hours for groceries a thing of the past as town welcomes new store",
        "publish_date": "Mon, 14 Jul 2025 00:28:18 +0000",
        "category": "finance",
        "authors": [],
        "text": "How far do you have to go to get your grocery shop done?\n\nProbably not 10 hours, which was the trip residents of Burringurrah, 1,000km north of Perth, had to do until this year.\n\nBut the opening of a community store has addressed more issues than empty fridges and long commutes — attendance at the local school has improved greatly.\n\n\"It was because families weren't going into Carnarvon and doing a food shop,\" Burringurrah Remote Community School principal Samantha Dalton said.\n\n\"They were able to do a food shop here.\"\n\nShelves of food are only steps away from locals rather than hours. (ABC Pilbara: Lina Elsaadi)\n\nAttendance problems\n\nFamilies were often out of town for weeks at a time, taking their children with them, Ms Dalton said. The absences would add up to months in a year.\n\n\"Sometimes they spend all their money and then they have to wait another payday to get diesel to come back to community,\" she said.\n\n\"Then they've probably eaten all of that food so then they need to go and do a food shop again.\n\n\" It's a bit of a cycle. \"\n\nChildren have attended school more frequently since the shop opened. (ABC Pilbara: Lina Elsaadi)\n\nMount Augustus Tourist Park hosts a small corner shop 40km from the community, but Ms Dalton said it was not an option for most.\n\n\"It's pretty expensive and you wouldn't want to do your weekly shopping there,\" she said.\n\n\"You just couldn't afford it.\"\n\nSamantha Dalton is the principal of the Burringurrah Remote Community School. (ABC Pilbara: Lina Elsaadi)\n\nThe sailor's disease\n\nSchool staff member Glenda Sibson said having fresh produce in town might have reduced a disease many would expect to have been left in the past — scurvy.\n\n\"You can see the difference,\" she said.\n\nNot eating enough fruits and vegetables can cause nutritional deficiencies. Ms Sibson said the previous lack of available produce meant the primary lifestyle was hunting.\n\nGlenda Sibson has been working at the school for four years. (ABC Pilbara: Lina Elsaadi)\n\n\"Although traditionally Aboriginal people were hunting for seeds and bush tucker … that can be quite labour intensive, so the meals were predominantly meat-based,\" she said.\n\n\"This causes issues because the kids get boils and scurvy.\"\n\nThe accessibility of fresh fruit and vegetables improved health in the community. (ABC Pilbara: Lina Elsaadi)\n\nFood security used to be front of mind for many as well, but Ms Sibson said the presence of a local store helped ease that — which she noticed in her students.\n\n\"You can certainly see that people are more relaxed because they know that there is a next meal.\"\n\nThe shop opening would make lasting impacts on the community and the lives of the children, she added.\n\n\" Everybody talks about closing the gap, but that's not going to happen if kids aren't regularly attending school. \"\n\nA return to Burringurrah\n\nTracy Parsons first came to Burringurrah from New Zealand 16 years ago.\n\nBack then, the town had a small shop which she worked at. Eventually it closed and she went to other WA communities.\n\nShe heard in January the shop was to open.\n\n\"I put my hand up to come back from New Zealand and see this lovely community,\" Ms Parsons said.\n\nOpen six days a week, the store is a one-stop shop. (ABC Pilbara: Lina Elsaadi)\n\nKeeping a shop in town was no easy feat but was worth it, she added.\n\n\"It's a huge effort by everyone involved to keep this door open and to keep it viable.\n\n\" It's really nice to get up and see people smiling because they know that they're OK. \"\n\nTracy Parsons says she loved her time in Burringurrah 16 years ago. (ABC Pilbara: Lina Elsaadi)\n\nMs Parsons has used the shop to broaden the horizons of the children as well.\n\n\"We just had one of our young high school girls come over … she wanted to do some work experience,\" she said.\n\n\"She came over during school time on Friday and it's just teaching her basic things.\n\n\"I do think it's important, especially for our high school kids, to realise that outside of our beautiful community there's another world they can be a part of.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-14/jannick-sinner-darren-cahill-wimbledon/105527950",
        "title": "The secret Wimbledon bet that could keep Aussie in Sinner's team",
        "publish_date": "Sun, 13 Jul 2025 23:08:52 +0000",
        "category": "sports",
        "authors": [],
        "text": "Jannik Sinner's Wimbledon title might mean he will be able to keep Darren Cahill around as one of his coaches beyond this season, all thanks to a friendly wager they made before Sunday's final at the All England Club.\n\nBack in January, while Sinner was on his way to winning the Australian Open, it came out that Cahill would be leaving his role as one of the top-ranked player's two coaches at the end of 2025.\n\nAfter Sinner beat Carlos Alcaraz 4-6, 6-4, 6-4, 6-4 for the championship at Wimbledon on Sunday, Cahill was asked whether he would reconsider the decision to depart the team.\n\n\"I don't want to answer this,\" Cahill responded. \"You know what? You just need to ask Jannik that.\"\n\nSo an Italian reporter followed those instructions and did put the topic to Sinner, who smiled and paused.\n\n\"It depends whether I want to tell the truth or not,\" Sinner said.\n\nWimbledon men's final, Sinner defeats Alcaraz live updates Photo shows Jannik Sinner poses with the Wimbledon trophy Jannik Sinner outclasses Carlos Alcaraz to claim the first Wimbledon title of his career, avenging his painful French Open final loss to the same opponent last month.\n\nAnd then he proceeded to explain the whole situation in Italian, revealing that maybe Cahill's exit is not set in stone, after all.\n\nThat's because the two of them had a conversation on Saturday night.\n\n\"We had a bet before the final. He said, 'If you win tomorrow, you can decide whether or not I stay,'\" Sinner said.\n\n\"Now the choice is mine. I've always looked for a person who is honest, a person who gives me a lot, not necessarily only on the tennis court, but [about] how to live.\"\n\nSinner went on to say that he would love to have Cahill stick around.\n\nSinner also did acknowledge that if Cahill did continue to work alongside co-coach Simone Vagnozzi, Cahill probably would not travel on tour as much as he does currently.\n\n\"The season is long. There are a lot of tournaments. You never know,\" Sinner said.\n\n\"But let's just say I won the bet, and so we'll see what happens.\"\n\nAP",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-14/australians-especially-men-are-reading-less-than-ever-before/105422070",
        "title": "Australians, especially men, are reading less than ever before",
        "publish_date": "Sun, 13 Jul 2025 23:05:09 +0000",
        "category": "finance",
        "authors": [],
        "text": "In the country Victorian town of Hamilton, nearly 300 kilometres west of Melbourne, a group of men meet in their local pub once a month to talk about the latest novel they are reading.\n\nFarmer Jack Kennedy, who formed the Hamilton branch of the Tough Guy Book Club nearly five years ago, grew up feeling like it was not normal for men to read books.\n\n\"[Fiction] is a great way to build empathy in men, when they're reading through someone else's eyes,\" Mr Kennedy said.\n\n\" It's a really important thing for men's mental health. \"\n\nBut according to data collected by the Australian Bureau of Statistics (ABS) that was published last year, Australians are reading less.\n\nThat was especially true for men.\n\nGender gap in reading\n\nTough Guy Book clubs were started by Melburnian Shay Leighton 13 years ago with the aim of getting men to \"read more, talk more, and have more friends\".\n\n\"It just really builds great connections among men,\" Mr Kennedy said, as a tractor hummed in the background.\n\n\"Which I think is something that we're really desperate for at the moment with a lot of the political things going on and the way that we currently interact socially with social media.\"\n\nBut growing up there was a social norm \"where you didn't want to be known as someone who reads books\", he said.\n\nThat is borne out by the ABS data, although it hints at a broader decline in reading, despite Aussies having more leisure time than ever before.\n\nThe population cohort that read the least was males aged 15–24, with only 10.1 per cent reading on any given day, according to the ABS.\n\nWhile Gen Z teenage girls and young women were not far ahead, the data showed females, on average, were reading more than males across all age groups.\n\nNearly one in four Generation X females (23 per cent) participated in reading compared to about one in eight Generation X males (12 per cent).\n\nAnna Burkey, president of book industry initiative Australia Reads, which aims to get more people reading, said part of the problem was boys and men did not see themselves reflected in the reading world.\n\nAnna Burkey says the gender gap in reading comes from men not seeing themselves as readers. (Supplied: Anna Burkey)\n\n\"If you see people around you regularly doing something, you want to do it,\" Ms Burkey said.\n\n\" If you see fewer men and boys [reading] then you think to yourself, 'Well, maybe that's not for me because I do not see myself reflected.' \"\n\nAccording to Ms Burkey, 29 per cent of Australian senior school students did not read or listen to a book at all in the previous 12 months, a 7 per cent increase on a previous study.\n\nAustralia Reads says well-funded school libraries are part of the solution to get younger people reading more. (ABC News: Rebecca Carmody)\n\n\"We're not just seeing people not reading for themselves … we're seeing people not reading to their children as much and that they are less likely to read to boys than to girls,\" she said.\n\n\"So this pattern is being reinforced very unconsciously.\"\n\nMs Burkey said she would like to see more dads reading to their children to set a positive example.\n\nWorrying decline\n\nAward-winning Victorian author Jock Serong said being read to as a child made an impact.\n\nJock Serong says some days he feels his profession is heading towards extinction. (Supplied: Jo O'Keefe)\n\n\"I was one of those kids who was lucky enough to be read to very, very heavily by my parents,\" Serong said.\n\nSerong said the decline in reading worried him.\n\n\"Everyone in the world of books is fighting a rearguard action for survival,\" he said.\n\n\"We're all driven at an absolutely astonishing pace by media and social media, and we don't do enough reflecting.\n\n\" We are overwhelmed with information and we are starved of contemplation. \"\n\nPreventable reading 'tragedy' Photo shows A young boy looking at a sheet of paper with words on it One-third of Australian students are failing to learn to read proficiently, at an estimated cost to the economy of $40 billion, according to a new study.\n\nSerong said while reading was a form of meditation and comfort, it could extend so much further to everyday life.\n\n\"[Not reading] means that we don't see the patterns in things, we don't see the human behaviours that keep repeating in politics and public life because we're not doing the deep, slow thinking and books are vital to the deep, slow thinking.\"\n\nWhy does this matter?\n\nMs Burkey said a 2015 study showed that people who read regularly were 58 per cent more empathetic, which she believed could have a \"knock-on effect\" for tolerance, social cohesion and democracy.\n\n\"Reading is proven to help you understand your place in the world, to walk in other people's shoes,\" she said.\n\nReading is considered to have wide-ranging benefits. (ABC News: Tom Joyner)\n\nMs Burkey said it could also have economic and social impacts, and even health benefits.\n\n\"Australia has a literacy problem,\" she said.\n\n\"Forty-four per cent of Australians struggle with literacy, which is fairly similar to some other Western nations, but a pretty shocking number given how wealthy Australia is.\"\n\n\"Reading brings down your blood pressure, it slows your heart rate, it calms you down and it allows focus and concentration in a world where our attention spans are getting ever more fragmented.\n\n\"So reading allows us to have more focus and concentration and, if you read regularly, you're more likely to sleep better at night.\"\n\nHome reading tips Photo shows A man and male child sit on a couch reading a book together, you can't see their faces but the child is pointing at the pictures While there's no substitute for a qualified teacher, we've asked experts for their best tips for parents who want to help teach their kids to read at home.\n\nMs Burkey said Australia needed a national strategy for reading that reminded people of the fun, comfort, entertainment and inspiration reading could bring.\n\n\"Reading for pleasure as a child is one of the biggest indicators of future success as an adult, and spending time reading increases empathy, while helping us feel less anxious,\" she said.\n\n\"Given the high anxiety rates amongst younger Australians growing up in a tumultuous world, reading offers the opportunity to relax, focus and ground ourselves for a while.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-14/england-vs-india-third-test-day-four-wrap/105527944",
        "title": "Third Test on a knife's edge as England sends Indian wickets tumbling late",
        "publish_date": "Sun, 13 Jul 2025 23:05:03 +0000",
        "category": "sports",
        "authors": [],
        "text": "England has dismissed four Indian batters and given the Lord's Test another twist of fate to leave it on a knife-edge heading toward the fifth and final day.\n\nIndia set itself a winning target of 193 runs but was reduced to 4-58 in its second innings overnight. Stumps, with eight overs remaining, came as a relief to India, with England fired up and a sun-soaked Lord's crowd turned happily hostile.\n\nFor one of the teams to take a 2-1 lead in the five-match series, England needs six more wickets or India needs 135 more runs.\n\nAsked for a prediction, India's Washington Sundar smiled and said his team was in the box seat to claim the win.\n\n\"Definitely India winning tomorrow. Just after lunch,\" he said.\n\n\"The position we are in right now, we would have taken. Maybe one down would be ideal.\"\n\nOpening batter Lokesh Rahul will resume on 33 not out but with the ball only 17.4 overs old and still juicy.\n\nIndia began its chase after tea and appeared to weather the early storm after Yashasvi Jaiswal fell to Jofra Archer for a duck and fellow opener Rahul was dropped on five by Chris Woakes.\n\nRahul and Karun Nair piled more hurt on England and were chipping runs off the target until nearly an hour later when Nair left a straight delivery from seamer Brydon Carse and was plumb LBW.\n\nIndia appeared to panic. In came captain Shubman Gill, the series' most prolific batter. But he was unusually anxious, played six false shots in the nine balls he faced, and was out LBW to Carse for six.\n\nThat huge wicket sent England into orbit and Carse into overdrive.\n\nIndia sent in fast bowler Akash Deep as a nightwatchman and for the last 15 minutes of the day he was targeted. Deep survived a video review on umpire's call and multiple LBW and catch appeals off Carse. But it was Stokes who smashed his off stump in what turned out to be the last ball of a remarkable day.\n\nThe inspired Carse had 2-11 and Stokes 1-15.\n\nIn all, 14 wickets fell on day four.\n\n\"When the ball gets a little bit softer, there are more runs to be had out there, but if you get it enough in the right place [the pitch is] very tricky,\" England batting coach Marcus Trescothick told the BBC.\n\n\"It'll come down to who holds the pressure best tomorrow.\"\n\nEngland was fielding on days two and three and gave its bowlers only 61 overs of rest before it was bowling again on day four.\n\nEngland was batting at 4-154 in the afternoon session and looking good to post a challenging target but it suffered a collapse of 6-38 to be all out for 192.\n\nFor some reason, the pitch turned nasty overnight. It was offering plenty for the new-ball seamers and India's Jasprit Bumrah and Mohammed Siraj made deliveries fly off a length and rear up almost dangerously. On this minefield, four England batters blew up in the morning.\n\nBen Duckett swatted straight to mid-on and Siraj followed through by screaming \"come on\" twice in Duckett's face and they brushed shoulders. Siraj got Ollie Pope next, LBW for four after a review.\n\nZak Crawley's brave but skittish innings finished on 22, edging a drive at Nitish Kumar Reddy.\n\nHarry Brook relieved the tension by scooping Deep for two boundaries and smashing him into the members' pavilion. But Brook then tried sweeping the seamer and was bowled around his pads on 23.\n\nCan't get enough cricket from Grandstand? Tune in for the latest cricket news, interviews and analysis from the ABC team in the Grandstand Cricket Podcast.\n\nJoe Root and Stokes took England to lunch on 4-98 and spent the afternoon edging their team toward a defendable target; 250 in the mind of most observers.\n\nThe pitch eased as the ball softened and Root and Stokes took England past 100 and 150.\n\nThen off-spinner Sundar regained the momentum for India when he found drift and spin and bowled Root on 40 (sweeping), Jamie Smith on 8 (defending), Stokes on 33 (sweeping) and Shoaib Bashir on 0 (defending).\n\nSundar had 4-22 in 12.1 overs, the best figures by an India spinner in England in 23 years.\n\nBumrah took 2-38 and Siraj 2-31.\n\n\"They were all big wickets, especially [at] the stage of play,\" Sundar said.\n\n\"The UK has been kind. I don't get as much drift in subcontinent conditions.\"\n\nA dozen England batters in the match were bowled, the most by England in a Test since 1887 in Sydney. It had never happened in England. Six of the bowleds in the match were by Bumrah. That was a first for India against England. The last bowler to bowl six Englishmen was Curtly Ambrose in 1994 at Port of Spain.\n\nBut India's terrific bowling effort showed England what kind of damage it can do, too, and set up the match for a thrilling finale at a sold-out Lords.\n\nThe ABC of SPORT Sports content to make you think... or allow you not to. A newsletter delivered each Saturday.\n\nAP",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-14/chelsea-beats-psg-club-world-cup-final-cole-palmer/105527808",
        "title": "Chelsea players bemused as Trump caught up in celebrations",
        "publish_date": "Sun, 13 Jul 2025 22:08:56 +0000",
        "category": "sports",
        "authors": [],
        "text": "Cole Palmer has scored two goals and provided one assist in a sensational first half as Chelsea have toppled Paris Saint-Germain 3-0 to win the FIFA Club World Cup.\n\nPalmer scored in the 22nd and 30th minutes and Joao Pedro tacked on the third goal right before half-time, capitalising on Palmer's fine touch into the box. Robert Sanchez, meanwhile, saved six shots in his best showing of the tournament.\n\nChelsea, who won the 2021 Club World Cup that featured only eight teams, battled past Portugal's Benfica and Brazilian sides Palmeiras and Fluminense in the knockouts to face Paris Saint-Germain — six weeks removed from their first UEFA Champions League trophy.\n\nPSG's goalkeeper Gianluigi Donnarumma had allowed just one goal in their first six matches of the Cup.\n\nThe frustrated Parisians went down to 10 men in the 85th minute when Joao Neves pulled Chelsea defender Marc Cucurella by the hair, was caught on video review and shown red.\n\nAltercations spilled past the final whistle, and PSG coach Luis Enrique appeared to grab at Pedro's neck while he and Donnarumma confronted Chelsea players.\n\nUS President Donald Trump presented the trophy to Chelsea after the match, and the player of the tournament award to Palmer, before finding himself caught up in the celebrations.\n\nUS President Donald Trump reacts as FIFA boss Gianni Infantino speaks to him after presenting Chelsea with the trophy. (Getty Images: Chris Brunskill/Fantasista)\n\nThe Chelsea players appeared bemused as Trump remained on the stage after the presentation, as FIFA boss Gianni Infantino motioned for the president to move out from the middle of the celebrations.\n\nTrump remained in place as the players briefly paused, before they lifted the trophy and Trump was guided out of the celebrations through the back of the pack.\n\nEarlier, Cucurella made a crucial stop to keep the game scoreless in the 16th minute. Fabian Ruiz made a great pass across the box to Desire Doue, who could have shot it but instead tried a centring pass to a teammate that Cucurella intercepted.\n\nSix minutes later, Palmer got the scoring started.\n\nMalo Gusto picked up a wayward header from PSG's Nuno Mendes and ran into the box. After creating space, his shot was blocked right back to his feet, so he fed Palmer for a left-footed finish into the bottom left corner.\n\nLevi Colwill earned the assist on the second goal for his long ball downfield to Palmer. From there, Palmer calmly dribbled toward the centre of the 18-yard box and fired the same low strike for an identical goal.\n\nIn the 43rd, Palmer tapped a pass between two defenders for Pedro, who popped his shot over a sprawling Donnarumma's right shoulder.\n\nReuters",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-14/giro-ditalia-donne-sarah-gigante-claims-overall-third/105527802",
        "title": "'I never expected this': Rising Aussie star third in Giro d'Italia Donne",
        "publish_date": "Sun, 13 Jul 2025 21:59:33 +0000",
        "category": "sports",
        "authors": [],
        "text": "Australian Sarah Gigante has completed her dazzling maiden Giro d'Italia by finishing third overall and winning the Queen of the Mountains jersey as the top climber.\n\nWhile Italian home favourite Elisa Longo Borghini held on to her overnight lead to take the title for a second straight year, Gigante was thrilled to finish her breakthrough event, in which she won two mountain stages in four days, with a place on the podium.\n\nBetter still, she produced the goods on the final hilly stage to take the Queen of the Mountains jersey as top climber, going past the overnight leader, Spain's Usoa Ostolaza.\n\n\"I can't believe how well this week went,\" said Gigante, who is making a remarkable comeback to the sport after surgery last year to fix the debilitating condition, Iliac artery endofibrosis.\n\n\"I never expected this. My main concern was just being able to compete again without pain.\"\n\nThe 24-year-old follows her compatriot Neve Bradbury, who also finished third in the 2024 event, and joins Amanda Spratt (third in 2018 and 2019), Kathy Watt (second in 1994 and 3rd in 1990) and Elisabeth Hepple (second in the inaugural 1988 event) in the Giro's Australian roll of honour.\n\nAfter taking the race lead off Marlen Reusser on the penultimate stage, Longo Borghini successfully defended the pink jersey on the final 134km stage eight from Forlì to Imola, finishing fourth behind her Swiss rival on the day.\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\nLongo Borghini (UAE Team ADQ) ended up victorious by 18 seconds ahead of Movistar's Reusser, with Gigante unable to make any inroads into the champion's overnight lead of 71 seconds over the Melbourne rider.\n\nThe stage was won by Movistar's Liane Lippert, who beat Anna van der Breggen (SD Worx-Protime) in a two-up sprint at the famous Imola racetrack, the Autodromo Enzo e Dino Ferrari, after the pair had escaped from a group of a dozen riders, including Gigante, in the last 3km.\n\nThe hilly route provided Gigante's key to the Queen of the Mountains blue jersey prize. She had been one point behind Ostolaza overnight, but won the first mountain sprint in Monticino to regain a lead that she wasn't about to relinquish.\n\nLorena Wiebes (SD Worx-Protime) then went on a solo breakaway to win an intermediate sprint and seal her points classification victory.\n\n\"It's been an incredible Giro — for me and for the team. The last eight days were full gas: we had a common goal, and we achieved it,\" Longo Borghini said.\n\nThe ABC of SPORT Sports content to make you think... or allow you not to. A newsletter delivered each Saturday.\n\nAAP",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-14/federal-politics-live-blog-july-14/105527744",
        "title": "Live: Chalmers 'pretty relaxed' about accidental release of Treasury advice",
        "publish_date": "Sun, 13 Jul 2025 21:58:15 +0000",
        "category": "finance",
        "authors": [
            "Courtney Gould",
            "Stephen Dziedzic In Shanghai",
            "Tom Crowley",
            "Laura Tingle In Shanghai",
            "Romy Stephens",
            "Tom Lowrey"
        ],
        "text": "Prime Minister Anthony Albanese is holding a press conference in Shanghai, following the conclusion of a high-powered roundtable with China's steel industry and some of the big Australian resources companies in China.\n\nAs China's steel industry moves to decarbonise, the government is looking for opportunities for Australia's iron ore exports. As Stephen Dziedzic reported earlier, one solution is finding ways that Australian resources companies can help Chinese companies produce \"green steel\" — that is, steel produced with less carbon emissions.\n\nThe PM tells reporters the discussion was \"very successful\".\n\n\"These discussions were an important step forward, between our two nations. We want to see a sustainable steel sector in China and globally. We want to build a future that keeps Australian jobs and our economy strong,\" he says.\n\nAlbanese then stepped so the chief executives form Rio Tinto, Fortescue, Hancock could share their views about the meeting.\n\nAll of them thanked the PM for hosting the meeting.\n\nMeanwhile, Fortescue boss Andrew 'Twiggy' Forrest told reporters he'd asked the PM to form a bilateral agreement with China on escaping the \"threats coming from AI to employment\" and to generate a \"serious jobs boom\" for green steel.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-14/tour-de-france-tadej-pogacar-tim-merlier/105527730",
        "title": "Pogačar loses key ally as TDF sprint stage produces thrilling finish",
        "publish_date": "Sun, 13 Jul 2025 21:41:27 +0000",
        "category": "sports",
        "authors": [],
        "text": "Belgian sprinter Tim Merlier has won the ninth stage of the Tour de France in a mass sprint after Mathieu van der Poel spent the whole day at the front before being caught by the chasing pack less than a kilometre from the finish.\n\nThere was no significant change in the overall standings and three-time Tour champion Tadej Pogačar kept the race leader's yellow jersey.\n\nSunday's stage headed into central France on a 174 kilometre flat stretch for sprinters.\n\nBut van der Poel, a one-day classics specialist with a flamboyant style of riding, almost foiled their plans.\n\nThe Dutch rider joined his Alpecin-Deceuninck teammate Jonas Rickaert in an early breakaway and produced a tremendous effort over 173 kilometres at a speed of about 48 kilometres per hour but could not go all the way and was swallowed less than a kilometre from the line.\n\nMerlier won the sprint ahead of Jonathan Milan, the winner of Saturday's stage, with Arnaud De Lie completing the podium. It was Merlier's second stage win of this year's Tour.\n\n\"I got boxed in a bit but then I managed to go all in and I was able to do my sprint like I wanted to and I'm happy to win my second stage here,\" Merlier said.\n\nIn the overall standings, double Olympic champion Remco Evenepoel remained 54 seconds behind Pogačar in second place.\n\nFrenchman Kévin Vauquelin was third at 1:11 behind, and two-time Tour champion Jonas Vingegaard sat 1:17 behind in fourth spot.\n\nEarlier in the stage, João Almeida, a key teammate of Pogačar, abandoned the race.\n\nAlmeida, who fractured a rib during stage seven, was dropped early and the UAE Team Emirates-XRG later announced over the race radio that the Portuguese rider had retired.\n\nThe Portuguese rider was caught in a high-speed crash earlier in the week as riders scrambled for position at the front, 6 kilometres from the finish line.\n\nHe escaped without a concussion but his rib fracture finally proved to be too painful to carry on in the three-week race.\n\nAlmeida finished fourth at the 2024 Tour de France and he started this year's edition on the back of strong results elsewhere, having won the Tour de Suisse, Tour de Romandie and Itzulia Basque Country.\n\nThe mountainous stage on Bastille Day from Ennezat to Le Mont-Dore features seven second-category hills or passes. The final climb has an 8 per cent gradient.\n\nAP",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-14/asx-markets-business-news-live-updates/105527078",
        "title": "Live: ASX down after Wall Street slips from record high on tariff worries",
        "publish_date": "Sun, 13 Jul 2025 21:27:08 +0000",
        "category": "finance",
        "authors": [
            "Stephen Letts",
            "Michael Janda",
            "Stephanie Chalmers"
        ],
        "text": "Having scaled yet another record high the day before, Wall Street's key indices all closed lower on Friday.\n\nThe S & P 500 slipped 0.3%, the blue-chip Dow was down 0.6%, while the tech-centric Nasdaq was comparatively better off, down just 0.2%.\n\nFor the week, the S & P 500 and Dow fell 0.3% and 1% respectively.\n\nThe slightly sour end for the week followed US President Donald Trump's move to intensify his tariff assault on Canada, saying Washington would impose a 35% tariff on imports next month.\n\nAlthough, virtually in the same breath, Mr Trump announced there was a further delay to the \"reciprocal\" tariffs, kicked down the road this time to August 1.\n\nThat, of course, was accompanied by the announcement that the base tariff rate would rise from 10% to 15-20% for countries without a trade deal.\n\nThe market's slight retreat was probably more a \"whatever, let's just trouser some profits\" sort of trade.\n\nThe ASX seems to be following a similar vibe and is priced to slip just 0.2% this morning.\n\nThe selling in Europe was a bit more anxious, with the pan-European Eurostoxx 50 index down 1% on Friday.\n\nGoing the other way, oil rebounded from Thursday's slide after the International Energy Agency forecast the market was tighter than the current price suggested.\n\nThe global benchmark Brent crude gained 2.5% to jump over $US70/barrel again, while the US WTI index gained 2.8%.\n\nGold (+1%) enjoyed all the Trumpian toing and froing on tariffs, as investors pivoted back to gold as a safe haven.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-14/grace-kim-wins-evian-championship-first-major-title/105527666",
        "title": "Grace Kim produces comeback for the ages to win first major title",
        "publish_date": "Sun, 13 Jul 2025 20:51:25 +0000",
        "category": "sports",
        "authors": [],
        "text": "Grace Kim has produced one of the most astonishing golfing fightbacks in history to join Australia's illustrious group of major champions.\n\nKim recovered from four shots behind in a dramatic final round to clinch victory over world number two Jeeno Thitikul on the second play-off hole at the Evian Championship in France.\n\n\"I don't know how it happened, really,\" said the incredulous Kim after her astounding eagle-birdie-eagle finish landed her the crown in the fourth major of the year.\n\nWith three eagles in a crazy final-round 67, Kim prevailed with a 14-under-par 270 winning total to join Karrie Webb, Minjee Lee, Hannah Green and Jan Stephenson as only Australia's fifth female major winner.\n\nThitikul appeared on track to herself capture her maiden major after the trio of Aussies, Kim, Lee and Gabriela Ruffels, faltered down the stretch at the Evian Resort Club on Sunday.\n\nRuffels had shared the lead while fellow 24-year-old Kim and triple-major-winning great Lee were just one shot behind entering the final round in the beautiful French Alps, near Lake Geneva.\n\nBut after a crazy day of twists and turns, Kim found herself in a play-off with Thitikul after delivering a contender for shot of the year for a spectacular eagle on the closing par-5 18th hole.\n\nThitikul still had the chance to win but missed a short sliding downhill putt before Kim tapped in for an eagle to force the play-off.\n\nThe Thai then looked certain to win on the first extra hole when Kim hit her second shot into the hazard.\n\nBut the Sydneysider miraculously chipped in for a birdie to extend the play-off, before prevailing on the second extra hole when Thitikul erred again and could not match Kim's eagle.\n\nGrace Kim remarkably chipped in for a birdie to keep the play-off alive. (Getty Images: Paul Devlin)\n\nBut earlier in the day, Kim felt she had missed the boat after she double-bogeyed the 12th hole.\n\n\"I thought I was out of it,\" she said. \"But I just said to myself and to my caddy, 'I've got nothing else to lose.'\"\n\nIt was the cue for her to play almost as if in a trance over the clutch late holes and in the play-off.\n\nWhat was she thinking when she stood over the eagle putt to make history on that second play-off hole?\n\n\"Just looked straight at the hole. That's what my caddie told me to do and I did it,\" she said.\n\nKim's epic victory secured Australia a second-straight major after Lee won the Women's PGA Championship only three weeks ago.\n\nAfter closing with a 67 to post a four-round 14-under-270 total, Kim ultimately only edged out Lee — who closed with a 68 — by one shot.\n\nFor Kim, a four-time winner of Webb's scholarship, which has given her the chance to learn from Australia's greatest champion, it was a potentially life-changing win.\n\n\"It's a huge achievement for me,\" she said.\n\n\"I've had a lot of doubts early this year. I was kind of losing motivation. I kind of had to get some hard conversations done with the team. Yeah, kind of had to wake up a little bit.\n\n\"So to be sitting here next to this trophy is definitely surreal.\"\n\nAAP",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-14/canberra-woman-with-cancer-has-payment-plan-rejected-by-strata/105526332",
        "title": "Amalia was having chemo when her mum died. Her strata didn't listen",
        "publish_date": "Sun, 13 Jul 2025 20:49:50 +0000",
        "category": "finance",
        "authors": [],
        "text": "Amalia Vatavalis was undergoing chemotherapy for cancer when her mother died from a brain tumour in April.\n\nIn the weeks leading up to her mother's death, the small Canberra business owner struggled to balance everything on her plate, including keeping on top of her bills.\n\n\"I was trying to balance the chemo, my treatment out with her care, as well having to run a business and work just to pay the bills — it was a lot,\" she said.\n\n\" Because I run my own business I don't get paid sick leave, so my body corporate fees started to fall a little bit behind. \"\n\nMs Vatavalis enjoys the company of her two pet dogs in her Canberra apartment. (ABC News)\n\nShe tried to organise a payment plan to keep up with the fees but unlike over the border in New South Wales, the ACT strata system does not allow for hardship provisions for people struggling to pay their strata fees.\n\nHer experience highlights issues with the ACT's strata system, issues that are likely to impact more people in the future, with about one in five Canberrans now living in apartments or units.\n\nEarlier this month, a Legislative Assembly inquiry into the management of strata properties heard half of all forced bankruptcies in the ACT last financial year were a result of strata companies seeking money from unit owners.\n\n'Banks more human than strata'\n\nAfter surviving seizures caused by her brain tumour, Ms Vatavalis's mother, Connie, was in \"great spirits\".\n\nSo, it came as a shock to Ms Vatavalis when her mum suddenly took a turn and died.\n\n\"I needed time out to grieve, I needed time out to cry and I was not functional for a certain period of time,\" she said.\n\n\"All I could do was cry. I've got one of her pillows, I just wanted to hug it.\"\n\nMs Vatavalis felt \"overwhelmed\" following the death of her mother. (ABC News)\n\nFeeling overwhelmed, Ms Vatavalis spoke to her home and car loan providers about hardship payment plans, and she said they were accommodating and understood her situation.\n\n\"I rang my bank. I said, 'I just can't do it, my mum has just passed, I'm overwhelmed', and they were so understanding, they put my mortgage payments on break for a couple of months, which was so lovely,\" she said.\n\nBut when it came to trying to set up a payment plan for her body corporate fees for her apartment, she couldn't reach an agreement with her strata manager.\n\n\"I contacted the strata manager so many times by phone, left messages, they were never available to talk, never got back to me. I emailed them asking [them] to get back to me,\" she said.\n\n\"They tell you to do something and it's their way or the highway, there's just no negotiation and that's what I found absolutely abhorrent.\n\n\" I don't understand how the banks can be more human than the strata companies! \"\n\nMs Vatavalis wanted a payment plan for her body corporate fees. (ABC News)\n\nMs Vatavalis eventually had to appear before the ACT Civil and Administrative Tribunal over her unpaid strata fees and was ordered to pay them back.\n\nShe said the ACT government needed to change legislation to ensure people struggling to pay their strata fees could access payment plans, similar to those for home loans, insurance and energy bills.\n\n\"We're only human, people fall into difficulties from time to time. You need to give people a chance to get back up on their feet,\" she said.\n\n'Critical cash flow'\n\nThe ACT Strata Community Association (SCA) said it was \"not opposed\" to a framework which would allow for hardship provisions, however it stressed the importance of paying strata levies.\n\nChris Miller says strata managers do not act autonomously and represent owners corporations. (ABC News: Simon Winter)\n\n\"This money goes towards things that are absolutely essential like insurance of the building,\" SCA CEO Chris Miller said.\n\n\"There's a statutory obligation to insure the building that's not something they can opt out of, and critical systems supporting life and property, fire systems, CO2 extraction from basements.\n\n\" Most of the time levies are critical cash flow to the owners corporation, most buildings cannot sustain a recalcitrant owner regardless for reason of hardship. \"\n\nThe ACT Strata Community Association says strata levies go towards things that are \"absolutely essential\". (ABC News: Mark Moore)\n\nMr Miller also defended a strata manager's role in the process when unit owners who have struggled to pay fees have had their requests for payment plans knocked back.\n\n\"The strata manger is simply an agent for the owners corporation and these matters are determined and decided by the corporation,\" Mr Miller said.\n\n\" The strata manager doesn't act autonomously. \"\n\nThe 'unethical' tactics of Australian strata companies Photo shows A man stands on the edge of a street in the foreground. Across the street are a number of large apartment buildings. Four Corners heard from more than 2,500 unit owners with horror stories of the strata industry's practices.\n\nThe SCA did however recognise a need for higher standards and mandatory qualifications for strata managers in the ACT, and called for changes to the current set-up.\n\n\"Strata managers, and potentially assistant strata managers, engaging with customers, doing work on behalf of owners corporations, there should be a requirement for minimum qualifications and ongoing professional development in those roles,\" Mr Miller said.\n\n\"Presently in the ACT the only requirement is for the principal of the strata business to have a minimum qualification and an ongoing licence and professional development, we think that should extend to a broader collection of operators in strata management.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-14/new-processing-method-transforms-table-olive-flavour/105501398",
        "title": "Why this farmer's olives now taste like passionfruit",
        "publish_date": "Sun, 13 Jul 2025 20:36:04 +0000",
        "category": "finance",
        "authors": [],
        "text": "Table olives are among one of the most polarising foods — people either love them or hate them.\n\nA world-first processing method crafting an Australian-style table olive is aiming to change that, transforming the fruit's flavour while also reducing labour and water usage.\n\nJohn Fielke, a professor of mechanical engineering at the University of South Australia, is behind the innovation set to revolutionise the table olive industry.\n\nHe is on a mission to change how people think about the complex fruit.\n\nThe Australian-style olives are processed differently and put into brine during harvest. (ABC Riverland: Will Hunter)\n\n\"With our process, we're not fermenting the olives, we're not degrading the oil that's in there, we're actually making olives that taste fruity,\" he said.\n\nProfessor Fielke said judges at table olive competitions he entered compared the tasting notes of his table olives to descriptors of what people would find \"on a fine bottle of wine\".\n\n\"The flavour comments [for the olives] are notes of passionfruit, citrus, berries,\" he said.\n\n\" The other one is [a taste of] musk — like those pink musk lollies. \"\n\nThe patented method coined \"Olives the Australian Way\" has also proven to be more sustainable and efficient, keeping the brine to cure the olives from start to finish.\n\nThe new flavours are described as fresh and fruity rather than salty and bitter. (ABC Riverland: Amelia Walters)\n\nProcessing methods craft flavours\n\nFor olives to be edible, the fruit requires processing to remove its natural bitterness.\n\nDifferent curing methods, like lye treatment or natural fermentation in brine, then form part of producing the olives' distinct characteristics and flavour notes.\n\nSpanish, Greek and Californian-style olives are the most common produced on a commercial scale, but their processing methods are time- and labour-intensive, known for their high water usage and wastewater disposal requirement.\n\nKalamata olives are among the well-known Greek-style olives produced commercially. (ABC News: Andrew Ware)\n\nProfessor Fielke's processing method relies on chemistry to capture the fruit's bitter compounds in the brine and filtration systems recirculating it.\n\n\"We are putting our olives in the brine in the orchard. [We] keep that brine clear through to our finished pack-out, and repack our brine with our olives.\n\n\" It's a huge saving in water and cost and the time to do it in. \"\n\nProfessor Fielke relies on chemistry and a filtering system to debitter the olives. (ABC Riverland: Amelia Walters)\n\nIndustry data shows most table olives sold in Australia are imported, with only 3,000 tonnes produced domestically.\n\nAustralian Olive Association chief executive Michael Southan sees large economic opportunities in the innovation to shift the country's industry.\n\n\"It will not only grow the production of locally produced table olives, but it's a technology that will be able to be used around the world. It has huge potential.\"\n\nThe new processing method is expected to ramp up table olive production in Australia. (ABC News: Michael Coggan)\n\nCutting labour costs and waste\n\nThe table olive processing innovation is a lifeline for farmers like George Kratopoulos, who has been battling low return prices and high labour costs.\n\nHe now regrets reducing his Taylorville family grove in South Australia from the initial 14,000 trees his father planted in the 1970s to 3,000 trees today.\n\n\"We've gone from basically wanting to step back out of the industry to expanding ourselves,\" Mr Kratopoulos said.\n\nGeorge Kratopoulos checks hand-picked olives destined for market. (ABC Riverland: Will Hunter)\n\nAs olives bruise easily, he previously had about 20 workers hand-picking each table olive to be sent to produce markets in Sydney and Brisbane.\n\nThe new method gives Mr Kratopoulos the opportunity to machine-harvest his crop, making the process more efficient.\n\n\"It's going to be a lot cheaper, there'll be not much labour costs and it's a win-win on both sides,\" he said.\n\nMr Kratopoulos machine-harvests his crop to be processed under the new method. (ABC Riverland: Will Hunter)\n\nHarvesting the crop straight into brine also cuts his on-farm food waste.\n\n\"Once we've shaken the fruit, if there's any damage, it stops the deterioration automatically, whereas in fresh markets that bruising will show and we'll have to take it out and there is a lot of wastage,\" Mr Kratopoulos said.\n\nHe described the new processing method as a \"game-changer\", giving him hope for a brighter future in the industry.\n\n\" I've gone from looking at trying to get ourselves out of the industry and retiring my parents, to the fact, hang on, there's good things on the horizon. \"\n\nThe innovation gives Mr Kratopoulos hope for the future. (ABC Riverland: Will Hunter)\n\nNot enough olives to scale up\n\nSupported by an Australian Economic Accelerator Seed grant, the innovation aims to raise the country's table olive production 30-fold to 100,000 tonnes in the next 10 to 15 years.\n\nThe project has reached semi-commercial scale and proven it has plated up fresh debittered olives to consumers quicker.\n\nProfessor Fielke processed 82 tonnes of table olives this season. (ABC Riverland: Amelia Walters)\n\n\"We can get edible olives ready for the market within five months from harvest,\" Professor Fielke said.\n\n\"That is more than halving the traditional time taken from the farm to the market.\"\n\nSue Fielke sorts and packs table olives at the processing facility in South Australia. (ABC Riverland: Amelia Walters)\n\nHe and his wife, Sue Fielke, processed 82 tonnes of table olives this season, with the aim to triple the intake next year.\n\nDespite the opportunities the innovation offers, there are major challenges to scaling up because not enough table olives are grown in Australia, according to Mr Southan.\n\n\"We really need to see more production of olives, and that's both from a productivity point of view, so getting more olives off each tree, and we need more trees,\" he said.\n\nMichael Southan says more tree plantings and table olives are needed for the project to expand. (ABC Central West: Xanthe Gregory)\n\nInvestment in further bulk processing facilities was an additional barrier to overcome, Professor Fielke said.\n\n\"We need larger-scale facilities that can be fully automated, computer-controlled and be reliable.\"\n\nProfessor Fielke says investment in large-scale processing facilities are needed. (ABC Riverland: Will Hunter)\n\nCaptivating the culinary world\n\nWhile getting table olives onto plates quicker, the new flavours are also attracting food producers and wholesalers.\n\nMount Zero Olives director Richard Seymour is one of the earlier adopters, who considers himself originally a traditionalist.\n\n\"I'm really interested in the thousands of years of history of fermentation of table olives, but now I'm certainly tending towards a convert to this method,\" he said.\n\n\"I think it's creating some really beautiful flavours.\"\n\nRichard Seymour says the new method creates distinctive flavours setting Australia apart. (ABC News: Andrew Ware)\n\nHe said he believed the surprisingly fresh, herbaceous, cut-grass characters akin to extra-virgin olive oil had the potential to put Australia on the world map.\n\n\" It's innovations like this that I hope we can really start to scale it and differentiate ourselves from the rest of the world and market in a unique but quality fashion. \"\n\nWatch ABC TV's Landline at 12:30pm AEST on Sunday or stream anytime on ABC iview.\n\nMr Seymour sees potential for the Australian-style olives to attract global attention. (ABC Riverland: Amelia Walters)",
        "source": "ABC"
    },
    {
        "url": "https://www.smh.com.au/sport/cricket/australia-v-west-indies-live-day-two-of-third-test-in-kingston-jamaica-20250713-p5memg.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Australia v West Indies LIVE: Top-order shambles gives hosts a sniff",
        "publish_date": "Mon, 14 Jul 2025 12:22:08 +1000",
        "category": "sports",
        "authors": [
            "Vince Rugari",
            "Tom Decent"
        ],
        "text": "A week ago, Australian coach Andrew McDonald leapt to the defence of four-Test rookie Sam Konstas following returns of 3, 5, 25 and 0 in the first two matches against the West Indies.\n\n“Four games, eight innings - it’s probably early for anyone to judge really,” McDonald told reporters, while acknowledging the performances hadn’t been spectacular.\n\nMcDonald and fellow selectors will now have 10 Konstas innings – or “data points”, as they like to call them – to assess ahead of Australia’s next Test assignment.\n\nThe only problem is that it’s the biggest of the lot: an Ashes series on home soil.\n\nHow many do they need? Is 10 enough? Or 20?\n\nRead the rest of Tom Decent’s stumps report here.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/cricket/worst-in-41-years-konstas-makes-another-duck-in-latest-nightmare-ahead-of-ashes-20250714-p5meoe.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Worst in 41 years: Konstas makes another duck in latest nightmare ahead of Ashes",
        "publish_date": "Mon, 14 Jul 2025 12:18:10 +1000",
        "category": "sports",
        "authors": [
            "Tom Decent"
        ],
        "text": "Kingston: A week ago, Australian coach Andrew McDonald leapt to the defence of four-Test rookie Sam Konstas following returns of 3, 5, 25 and 0 in the first two matches against the West Indies.\n\n“Four games, eight innings - it’s probably early for anyone to judge really,” McDonald told reporters, while acknowledging the performances hadn’t been spectacular.\n\nMcDonald and fellow selectors will now have 10 Konstas innings – or “data points”, as they like to call them – to assess ahead of Australia’s next Test assignment.\n\nThe only problem is that it’s the biggest of the lot: an Ashes series on home soil.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/business/the-economy/trump-makes-europe-his-next-target-in-his-war-on-the-world-20250714-p5meoy.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Trump makes Europe his next target in his war on the world",
        "publish_date": "Mon, 14 Jul 2025 11:57:21 +1000",
        "category": "finance",
        "authors": [
            "Stephen Bartholomeusz"
        ],
        "text": "It will take years before their commitments to increase their own defence spending might wean them off their reliance on the US for protection from an aggressively expansionist Russia. However, with Trump also announcing at the weekend that he is considering raising the baseline tariff rate to 15 to 20 per cent, they have to take his threat of a 30 per cent tariff – and additional tariffs to match any retaliatory measures they might take – seriously. Trump appears impatient that he hasn’t delivered the “90 deals in 90 days” the administration boasted it would deliver, let alone the 200 deals he once said were virtually done. European Commission President Ursula von der Leyen. EU and US trade officials have been negotiating for months. Credit: Bloomberg He’s also been boosted by the successful passage through Congress of his One Big Beautiful Bill Act and by the buoyancy of US financial markets, which have rebounded from their sell-offs in April, when Trump first unveiled his “reciprocal” tariffs.\n\nIn April, he deferred imposition of the tariffs until July (and subsequently deferred them again until next month) because the bond market was “getting a little queasy.” Now markets have settled, with the sharemarket posting record highs. That may be because investors don’t believe he will follow through with the reciprocal tariffs he has threatened – the “Trump Always Chickens Out” or TACO trade – or because any ill effects from tariffs, most notably increased inflation, have yet to show up in economic data. Loading No one, including Trump himself, it seems, knows what he might post next on his Truth Social, so markets are behaving as if nothing has happened until something actually happens. August 1 – the new deadline for his reciprocal tariffs – could be a wake-up moment for markets. The apparent complacency in markets, in the meantime, is encouraging Trump to be more aggressive and more impatient.\n\nThere is a risk that, rather than heed, as he has until now, the urgings of calmer voices in his cabinet to negotiate deals, he will follow his personal preference and unilaterally present trade partners with “take it or leave it” ultimatums. While the EU still appears to believe that Trump’s latest threat is a negotiating ploy, they have prepared countermeasures in case it isn’t. The EU had drawn up a list of US exports that it could target in response to the baseline tariff and the sectoral tariffs on steel, aluminium and autos, covering about €21 billion ($37 billion) of US exports. Items on that list included chicken, motorcycles and clothing. It has another list, targeting another €72 billion of products, ranging from aircraft to alcohol, with which it could respond to Trump’s reciprocal tariffs. It also has what it calls its “anti-coercion instrument,” or actions that could hit the trade in services, although it is reluctant to deploy that instrument, which it devised in response to a deluge of cheap imports from China.\n\nThe total trade between the US and EU is worth about $US1 trillion ($1.5 trillion), with the EU enjoying a trade surplus in goods of $US235 billion, but a trade deficit in services of about $US75 billion. The EU, in its negotiations with the US, had sought exemptions from Trump’s tariffs for key sectors, such as aircraft and alcohol, in exchange for a promise to buy more US goods, particularly weapons and LNG, that would narrow the US goods trade deficit. Von der Leyen said on Saturday that the EU was ready to continue negotiating but prepared to consider retaliation. Imposing 30 per cent tariffs on EU exports would disrupt essential transatlantic supply chains, harming businesses and consumers on both sides of the Atlantic, she said. The dilemma for the EU is that Trump’s view of its non-tariff policies and trade barriers includes its value-added tax and its regulation of digital activity to protect competition and consumers. No nation state – or, in the EU’s case, collection of 27 nation states – would surrender its sovereignty and allow Trump to dictate its domestic policy settings. Having seen what Trump has done to Brazil, threatening a 50 per cent tariff rate in response to unfair trade barriers (even though the US has a trade surplus with Brazil) and its trial of former president Jair Bolsonaro – an enthusiastic Trump supporter – for allegedly plotting a coup, the EU would be conscious of the risk that Trump’s demands may not be confined to its goods trade.\n\nThe potential for a trade confrontation is, therefore, quite significant. The EU will have to decide whether it should roll over and accede to Trump’s demands, damaging its industries and the sovereignty of its states. Alternatively, it could emulate China and allow the confrontation to escalate to the point where it threatens a trade embargo, which would, as China’s tot-for-tat tariffs did, scare the bejesus out of financial market participants and unnerve the White House. Loading Trump’s indiscriminate threats of trade sanctions against America’s friends and foes alike have ignited a scramble by the EU and others to secure new markets. There is potential for a new trading bloc, spanning Europe, the non-Chinese Asia Pacific and Latin America, to emerge. Trump and much of his hand-picked cabinet are protectionists and isolationists. At the conclusion of his trade wars on everyone, if much of the rest of the world decides to trade freely among themselves, he might get what he wished for.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/property/news/seller-80-auctions-carindale-home-for-2-2-million-before-his-wedding-20250714-p5meph.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Seller, 80, auctions Carindale home for $2.2 million before his wedding",
        "publish_date": "Mon, 14 Jul 2025 11:46:26 +1000",
        "category": "finance",
        "authors": [
            "Sarah Webb"
        ],
        "text": "A five-bedroom Carindale house has resold for $2.2 million just 12 months after its last sale, delivering a $220,000 windfall for its 80-year-old owner and closing the loop on a love story that began with a break-up.\n\nNewly single after the end of his marriage, the vendor bought 64 Oakley Street for $1.975 million last March. But after finding love again he decided it was time to sell, listing the property ahead of his upcoming wedding.\n\nThe house at 64 Oakley Street in Carindale has sold at auction in Brisbane. Credit: Place Bulimba\n\nSet on an 864-square-metre block, the home features a heated inground pool, pool house and media room, while sitting within the coveted Mansfield State School and Mansfield State High catchments.\n\nDescribed as move-in ready but still featuring its original kitchen, the property drew interest from both local and interstate buyers keen to break into the fast-growing Carindale market.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/goodfood/melbourne-eating-out/calle-bakery-s-cult-custard-croissant-wheels-arrive-in-northcote-20250714-p5merj.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Calle Bakery’s cult custard croissant wheels arrive in Northcote",
        "publish_date": "Mon, 14 Jul 2025 11:42:34 +1000",
        "category": "finance",
        "authors": [
            "Tomas Telegramma"
        ],
        "text": "Add articles to your saved list and come back to them anytime.\n\nSave this article for later\n\nRemove items from your saved list to add more.\n\nYou have reached your maximum number of saved items.\n\nThe Carlton North bakeshop has opened a second outpost on High Street.\n\n1 / 9 Calle’s lemon meringue croissant wheel. Paul Jeffers 2 / 9 The Northcote location allows Calle to ramp up its production. Paul Jeffers 3 / 9 A selection of croissants on display at Calle. Paul Jeffers 4 / 9 Fruit and custard croissant danish. Paul Jeffers 5 / 9 Sisters Vivian (left) and Ellena Ly, who own Calle Bakery. Paul Jeffers 6 / 9 More classic pastries, such as escargots, are also in the cabinet. Paul Jeffers 7 / 9 Desserts like banoffee pie and Dubai chocolate inspire many pastries. Paul Jeffers 8 / 9 Danishes filled with fruit are joined by globally trending pastries. Paul Jeffers 9 / 9 The space has just a few seats inside, plus some outdoors. Paul Jeffers Previous Slide Next Slide\n\nBakery$$$$\n\nCalle’s original Carlton North shop has been mobbed by ever-longer queues for its riffs on globally trending pastries since it opened on Rathdowne Street in 2022. Now, it has a second outpost on Northcote’s High Street with room for 20 diners.\n\nHeading up production is co-owner Vivian Ly’s husband, Huey Phung, a pastry chef of 25-plus years. Heading up production is Vivian’s husband, Huey Phung, a pastry chef of 25-plus years. The signature custard-filled croissant wheels – inspired by those that attract crowds to New York bakery Lafayette – have come to Northcote, but are available only Friday to Sunday (as in Carlton North). Two different flavours are on the roster every month.\n\nAlso popular is a croissant version of the internet-famous Dubai chocolate bar, with a filling of creamy pistachio spread and crispy kataifi pastry threads, and a topping of melted dark chocolate. Ooey-gooey cinnamon scrolls are a Northcote exclusive. There are also slabs of focaccia, sourdough loaves, sandwiches and other savoury items, including quiche and gougeres (cheese puffs).",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/soccer/where-would-a-league-teams-fit-in-the-english-pyramid-this-might-be-our-best-chance-to-find-out-20250711-p5me7u.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Where would A-League teams fit in the English pyramid? This might be our best chance to find out",
        "publish_date": "Mon, 14 Jul 2025 11:41:12 +1000",
        "category": "sports",
        "authors": [
            "Vince Rugari"
        ],
        "text": "This is, to the best of this masthead’s knowledge (and that of Australian soccer stats guru Andrew Howe; if he doesn’t know something, it’s not worth knowing), the first time a team that just been promoted from League One - England’s third tier - has toured Australia. Wrexham’s suddenly global appeal is the reason why it is happening; commercially and logistically, it just wouldn’t make sense for any other teams to come out here. Usually, it’s just Premier League clubs who turn up, cash in, have a little run around and sell some jerseys. Twice in recent memory - Leeds United (2019) and Wolverhampton Wanderers (2009) - have promoted teams from the Championship come here ahead of their return campaigns in the Premier League. But no lower. In that respect, there is some genuine intrigue about Wrexham AFC vs Sydney FC, a showdown that nobody would have dreamed of before the Reynolds-McElhenney revolution. The Sky Blues had a bit of a stinker in the A-League last season, somehow missing the top six despite boasting a star-studded squad. But most seasons, they would be considered one of the country’s top teams. So are how much better are Wrexham, who finished second in League One, than the Sky Blues? “It’s difficult,” Sydney FC’s Joe Lolley says.\n\nThere is probably no player better qualified to make a pre-match assessment than Lolley. His career began with Kidderminster Harriers in the Conference (now called the National League), or the fifth tier of English football. But he has also played in the Premier League with Huddersfield Town, in the Championship with them and Nottingham Forest, and, briefly, in League One when he was on loan at Scunthorpe United. That means he has taken the field in four of England’s top five divisions; though he has played cup matches against teams from League Two, the only one he hasn’t played in. He has also played against Wrexham - way back in 2013, three years before the first Deadpool movie came out, when Lolley was with Kidderminster, scoring twice in a 3-1 home win. Few in Australia are better placed to make this assessment than Joe Lolley. Credit: Getty Images Lolley reckons A-League teams compare favourably to those in the Championship and below when it comes to technique; like most Englishmen who come here to play, he was initially surprised by the extent of the local technical skill when he arrived. There are two major differences, he believes. First: physicality.\n\n“Everyone’s a bit of a beast in England when it comes physicality, defensively and off the ball and those sort of things,” he said. Not so much in the A-League. Secondly: squad depth, which is crucial in a gruelling 46-game season. When he was in the Championship, Lolley recalls most teams having about 20-odd players of approximately the same level, competing for starting spots, and the difference between the best and the worst in the division was not huge. The A-League, in contrast, is a lot more “spread out”, and the impact of losing two or three key players can be enormous. There are individuals in Australia who could arguably hold their own in the Premier League, he said, but then some who would probably be better suited to non-league. That’s not being harsh; that’s just the nature of A-League squads, most of which are backfilled by unproven scholarship players and journeymen, and a time when clubs are strapped for cash. But, hypothetically, where would the best teams he’s seen or been part of in Australia wash up in England, on the basis of quality in the starting XI? “Probably the lower end of the Championship,” Lolley says.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/lifestyle/beauty/beauty-is-more-than-skin-deep-20250709-p5mdq6.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘Beauty is more than skin deep’",
        "publish_date": "Mon, 14 Jul 2025 11:40:21 +1000",
        "category": "lifestyle",
        "authors": [
            "Jaymie Hooper"
        ],
        "text": "Lessons for life\n\nJodie now celebrates beauty no matter what season of life she may be in.\n\nFor Jodie, being in a workshop with other women going through a similar journey provided her with a level of comfort she couldn’t find anywhere else. When she was diagnosed with cancer for the second time last year, Jodie was again thankful for her Look Good Feel Better support team — and the life lessons she’d learned from that first round.\n\n“When I was re-diagnosed, those things that I’d held onto that I didn’t necessarily realise came to the forefront again,” she reflects. “Just that confidence in the thought that it’s OK to feel good about myself.”\n\nWhile Jodie acknowledges that going through cancer treatment can make you feel critical of wanting to feel good and putting effort into make-up and skincare, she’s also aware of how powerful you feel when you take the time to look after yourself.\n\n“It’s so valuable because beauty is more than skin deep,” she says. “How you feel as a person, make-up and skin care really can contribute to such a big part of that.”\n\nSince undergoing cancer treatment, Jodie now celebrates beauty no matter what season of life she may be in. “I’ve found there are days when you’re just going about your day-to-day errands, but there are also moments where you want to pop on a lippy and be vibrant.”\n\nWhen she wants to add a little pep to her step, Jodie’s go-to lipstick shade is the Revlon Super Lustrous Uncut Ruby. “I love the pop of colour that it has,” she says. “I pop it on and it just brings a smile to my face. Just like an uncut ruby, I’ve got potential. I’m going to shine.”\n\nWith no government funding, Look Good Feel Better relies on the generosity of its sponsors to provide support to people undergoing cancer treatment. Revlon has been supporting the charity for more than 30 years and this is its fourth year running its International Lipstick Day donation campaign, where between July 10 to August 6, Revlon will be donating $2 from every Super Lustrous Lipstick sold in Chemist Warehouse to Look Good Feel Better.\n\n“There’s something really special about the work they do,” Jodie says of Look Good Feel Better. “The investment in you as a person and in your value as a person is… I’ve never encountered anything like it.”\n\nLook Good Feel Better is free and available to any person undergoing any treatment for any cancer, anywhere in Australia. Visit lgfb.org.au or phone 1800 650 960 for more information or to register for the program.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/lifestyle/beauty/i-ve-always-believed-that-kindness-is-real-beauty-20250709-p5mdpw.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘I’ve always believed that kindness is real beauty’",
        "publish_date": "Mon, 14 Jul 2025 11:39:01 +1000",
        "category": "lifestyle",
        "authors": [
            "Jaymie Hooper"
        ],
        "text": "For most of her life, Kara was known for her long, red hair, but after undergoing treatment for breast cancer, it soon began to fall away. “Losing my hair was a big thing for me,” she explains. “I tried the cold cap to hang onto whatever I had, but I wasn’t seeing the best results.”\n\nTo learn how to best manage her changing appearance, Kara attended a free workshop by Look Good Feel Better, and it was here she gained the confidence to say goodbye to her remaining locks.\n\n“Wearing a headscarf into that room full of all those women that complimented me on how it was done, and then I was asked to show them how I had styled mine, that then gave me the confidence to walk out and make the decision on my terms,” Kara says.\n\n“I think I needed that workshop and that boost, and being part of that group to see that. Seeing the other women just rocking a bald head and just looking beautiful in it, it gave me the confidence to walk away and part with my hair.”",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/western-australia/wa-news-live-wa-could-soon-get-two-extra-public-holidays-20250713-p5mele.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "WA news LIVE: WA could soon get two extra public holidays",
        "publish_date": "Mon, 14 Jul 2025 11:38:42 +1000",
        "category": "finance",
        "authors": [],
        "text": "West Australians could soon get two extra days off every year with the state government looking to overhaul the public holiday calendar, but businesses are already pushing back against the proposal.\n\nWA currently has 11 public holidays a year, among the lowest in the nation.\n\nThe state government is considering adding two more to bring the state into line with Victoria and the territories.\n\nOne would be officially recognising Easter Saturday as a holiday, the other would be a new day off in September.\n\nOther proposed changes to the calendar include moving WA Day, held in June, away from winter, and aligning existing public holidays with the rest of the country.\n\nWhile unions support the additional days off, the Chamber of Commerce and Industry says it will cost small business.\n\nConsultation on the dates is open for the next four weeks.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/property/news/vendor-who-bought-1-7m-brick-two-bedroom-sydney-house-sells-for-8-15m-20250714-p5mepf.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Vendor who bought $1.7m brick two-bedroom Sydney house sells for $8.15m",
        "publish_date": "Mon, 14 Jul 2025 11:35:26 +1000",
        "category": "finance",
        "authors": [
            "Carmen Forward"
        ],
        "text": "A two-bedroom house in Rhodes sold for $8.15 million at auction on Saturday.\n\nThe red-brick home was the last freestanding house on an apartment-lined stretch of road opposite Rhodes railway station, at 16 Walker Street.\n\nGuided between $6 million and $7 million, the 676.6-square-metre block was put on the market at $8 million before a crowd of 150 people and sold for $8.15 million.\n\nEight registered and five placed bids for the development site with potential as either 14 apartments, a boarding house, or a hotel or fitness centre.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/lifestyle/fashion/fashion-fault-the-wimbledon-rule-ignored-by-princess-catherine-20250714-p5mep9.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Fashion fault: The Wimbledon rule ignored by Princess Catherine",
        "publish_date": "Mon, 14 Jul 2025 11:30:20 +1000",
        "category": "lifestyle",
        "authors": [
            "Damien Woolnough"
        ],
        "text": "A controversial error at the Wimbledon men’s singles final by the usually faultless Princess Catherine could force the hand of fashion umpires.\n\nAt the women’s singles final Catherine’s cream dress from Self-Portrait, accessorised with a tote from Anya Hindmarch (not from the handbag designer’s collection for Woolworths supermarkets) was a flawless example of day dressing.\n\nThe streamlined silhouette was repeated at the men’s final in a cornflower blue dress by Roksanda, where Catherine presented the winner’s trophy to Jannik Sinner, but it was her choice of accessory that challenged tennis club etiquette.\n\nPrincess Catherine in her LK Bennett hat alongside Princess Charlotte at the Wimbledon men’s singles final. Credit: Getty Images\n\nCatherine arrived at Wimbledon clutching a wide-brimmed, ribbon-trimmed hat from LK Bennett. During the final, Catherine wore the hat when the sun hit the royal box, while waving a fan to combat the effects of the London heatwave.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/tennis/why-accuracy-not-power-is-the-missing-piece-in-demon-s-serve-20250708-p5mdja.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "The change de Minaur must make to take it up to tennis’ best",
        "publish_date": "Mon, 14 Jul 2025 11:30:00 +1000",
        "category": "sports",
        "authors": [
            "Marc Mcgowan"
        ],
        "text": "The five-time major quarter-finalist’s percentage of unreturned first serves for the tournament was only 34 per cent (73/212), which ranked equal-98th in the men’s draw. De Minaur tested Novak Djokovic in a high-quality fourth-round contest at Wimbledon. Credit: Getty Images Woodbridge spoke with a still-disappointed de Minaur in the hours after his four-set defeat to Djokovic. De Minaur’s serve was among the topics. “Alex was playing against a guy [Djokovic] who has adjusted his serve throughout his career and made it better – and that’s the example you have to look at,” Woodbridge said. “He’s got a great team of people around him, got all the technology, and now it’s time to go back and keep tweaking the technique.\n\nLoading “He’s got to rotate his shoulders, get his right shoulder back, and get more turn and torque. What he does is take the racquet head out to the right, and that opens him up, and he gets too front-on. “That [results in] lack of control and trajectory. The best players have great shoulder rotation, hold it in there, and then they uncoil.” Respected Australian coach Craig O’Shannessy made the same observation about de Minaur’s front-on service motion, and said fixing that was not about adding more power but instead would add much-needed serving accuracy. ATP Tour serving analysis last year of the top-20 men’s players found that de Minaur was by far the least accurate in that group, based on placement in the service box.\n\nThat continued at Wimbledon this year, where the Australian’s serves went to the body, rather than the corners, about five times more often than Djokovic and Jannik Sinner. O’Shannessy, who previously worked with Djokovic, said that was an accuracy issue for de Minaur and not a deliberate strategy. The key serve numbers for Alex de Minaur at Wimbledon. Credit: Wimbledon website / IBM “Alex is hitting it in the strike zone [too often] … he’s losing so many points because the opponent is ready for that,” O’Shannessy told this masthead. “From a placement perspective, Novak is serving only [about] three per cent at the body, and everything else is an even mix, so it makes it almost impossible to do a game plan against him.\n\n“Alex has to improve his technique. He has to stay sideways longer. The lower body’s got to rotate and stop, and the upper body then receives that energy and throws that into the arm. He’s over-rotating with [both], and then he’s too front-on.” Djokovic boasts remarkable serving accuracy in 2025 and at this Wimbledon. Almost half Djokovic’s serves on the deuce and advantage sides landed wide or down the T, compared to between two and four per cent to the body, according to IBM tracking data. De Minaur, on the other hand, had about 50 per cent down the T on each side at Wimbledon, but went wide on only 28 and 36 per cent of serves, respectively, on the advantage and deuce sides.\n\nLoading He was at 20 and 17 per cent to the body on the advantage and deuce sides, respectively. Interestingly, Carlos Alcaraz’s percentage of serves to the body this event is even higher than de Minaur. However, Woodbridge said de Minaur should not beat himself up about the Djokovic defeat or become too preoccupied with his serving deficiencies. “Alex is a legitimate top-10 player. The hardest part in this game is getting there, and then it’s even harder to stay there – but he’s proven he can do that,” Woodbridge said. “I said to him [post-match], ‘Don’t you dare tell me that you’re not good enough to be in this space. You’re 10 times better a tennis player than I ever was, and a lot of us were, so take your strengths, keep them, and keep working on those small bits that can make you better’.”",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/nrl/heated-clash-of-teammates-shows-how-walsh-has-saved-broncos-season-20250714-p5mep1.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Heated clash of teammates shows how Walsh has saved Broncos’ season",
        "publish_date": "Mon, 14 Jul 2025 11:17:42 +1000",
        "category": "sports",
        "authors": [
            "Nick Wright"
        ],
        "text": "One final roll of the dice before the half-time break ended in frustration for the Broncos on Sunday night, as Reece Walsh’s bullet pass wide for his centre Kotoni Staggs was spilled to the turf.\n\nThe reaction was immediate.\n\nWalsh was seen delivering Staggs a spray, with the latter offering choice words of his own in reply.\n\nHalfback Adam Reynolds admitted Brisbane had left “a few tries” out there in the opening half against Gold Coast Titans, before emerging 26-14 victors.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/property/news/woman-pays-2-25m-at-auction-for-melbourne-home-she-earlier-rejected-20250714-p5mepg.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Woman pays $2.25m at auction for Melbourne beachside home she earlier rejected",
        "publish_date": "Mon, 14 Jul 2025 11:13:54 +1000",
        "category": "finance",
        "authors": [
            "Shona Hendley"
        ],
        "text": "A local woman paid $2.25 million at auction on Saturday for a newly built, beachside family home in Parkdale with water views that she had earlier rejected due to its location on a sometimes busy road.\n\nThe home at 23 Parkers Road was listed with a price range of $1.9 million to $2.05 million and had no predetermined reserve, said Belle Property Mentone auctioneer and sales manager Simon Wendt.\n\n“The vendor didn’t give me a firm reserve before the auction, so when bidding hit $2,110,000, I went inside to ask him for approval to put it on the market, which he gave,” Wendt said.\n\nWhile not having a predetermined reserve isn’t very common, Wendt said the most unusual part of the auction was that the vendor arrived late.",
        "source": "SMH"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/watershed-moment-kngwarray-at-the-tate-modern-marks-first-major-solo-exhibition-of-the-artist-in-europe/2nzozfw5g",
        "title": "'Watershed moment': Kngwarray at the Tate Modern marks first major solo exhibition of the artist in Europe",
        "publish_date": "Mon, 14 Jul 2025 02:08:05 +0000",
        "category": "entertainment",
        "authors": [],
        "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nEmily Kam Kngwarray came to art late in her life.\n\n\n\n\n\nBorn in 1914, an Anmatyerr woman from Alhalker Country, she started producing her first batiks in the 1980's.\n\n\n\n\n\nNow, hanging in London's Tate Modern Gallery, 83 pieces spanning her 19 year career are on display.\n\n\n\n\n\nWarumungu and Luritja woman and lead curator, Kelli Cole, says the works are an extension of culture.\n\n\n\n\n\n\"What you actually see in her work, batik and painting, is actually her culture, that is displayed or depicted onto those paintings. So everything that was important to Kngwarray is a part of her cultural connection to that country, is about her responsibilities to country. It is all about that body paint, that gestural mark that you actually paint when you're doing ceremony. So when you're looking at Kngwarray's paintings, they are just this total connection to who she is as an Anmatyerr woman.\"\n\n\n\n\n\nFive years in the making, the exhibition is the first major solo exhibition for an Indigenous Australian artist at the Tate.\n\n\n\n\n\nDescribed as one of Australia's preeminent artists, Emily Kam Kngwarray is one of the most celebrated artists of the 20th century.\n\n\n\n\n\nHer works include paintings, textiles, and works on paper, and draw their inspiration from a deep connection to Country and cultural traditions.\n\n\n\n\n\nHaving travelled to Kngwarray’s community upwards of twelve times over the years, Kelli Cole says working with community was central to the curatorial process.\n\n\n\n\n\n\"So when I talk about her cultural responsibilities, Kngwarray was a senior elder of her community, so she actually had to partake in ceremony. And so what that meant was they would go on country, they would paint themselves up, they would sing a song. That song had a specific song for each ceremony that she did. And with her gestural marks within her batiks and her paintings actually come from that extraordinary knowledge that she had. So prior to painting, she had been doing that for such a long time.\"\n\n\n\n\n\nThe exhibition includes 83 pieces, some of which have never been shown in public before and have come from private collections from across Europe and America.\n\n\n\n\n\nWhile Emily Kam Kngwarray is well known in the Australian art world, her works are less recognised in Europe.\n\n\n\n\n\nKelli Cole says by being on display somewhere like the Tate Modern, the works will gain even wider acclaim.\n\n\n\n\n\n\"Look, her impact in Australia is huge. Kngwarray's had several solo exhibitions in Australia and in Japan. So she's a name that is very well known in Australia as a major, major artist. By bringing her works here to the Tate Modern, we are hoping that her name is going to be synonymous with the European sort of vocabulary. It's gonna be Emily Kam Kngwarray, Jackson Pollock, all of these Picassos. We're really hoping that we can actually put her on the world scale or the world stage and people will start knowing her works.\"\n\n\n\n\n\nThe exhibition opened last week and runs until January 11th 2026 at the Tate Modern gallery in London.\n\n\n\n\n\nConsidered part of a wider shift to showcase artists previously left out of the spotlight, Art critic Tabish Khan says it is a historic moment for the gallery.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/interview-how-indigenous-businesses-are-creating-42-billion-in-social-value-each-year/2r4majrd8",
        "title": "INTERVIEW: How Indigenous businesses are creating $42 billion in social value each year",
        "publish_date": "Mon, 14 Jul 2025 01:49:50 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/heritage-listing-for-indigenous-rock-art-site-wont-impact-nearby-gas-project-extension/qwzr2kwvs",
        "title": "Australia insists industry and rock art 'can coexist' after heritage listing of ancient site",
        "publish_date": "Mon, 14 Jul 2025 01:35:13 +0000",
        "category": "entertainment",
        "authors": [],
        "text": "Key Points Murujuga, a peninsula in north-west WA near Karratha, contains the world's largest collection of rock art engravings.\n\nEnvironment Minister Murray Watt recently gave provisional approval to an extension of a nearby gas and oil project.\n\nThere are concerns the project could seriously degrade the Aboriginal rock art engravings.\n\nEnvironment Minister Murray Watt says the recent World Heritage listing of an ancient Indigenous rock art site will not influence the government's final decision about an extension of a contested gas project in the area.\n\n\n\n\n\nThe United Nations Educational, Scientific and Cultural Organisation (UNESCO) listed the Murujuga rock art landscape in Western Australia as a heritage site over the weekend, following lobbying by the federal government.\n\n\n\n\n\nMurujuga, a peninsula in north-west WA near Karratha, contains the world's largest collection of rock art engravings, known as petroglyphs, with some of its one million pieces estimated to be more than 50,000 years old.\n\n\n\n\n\nIt's also home to two gas plants, a fertiliser plant and iron ore and salt export facilities. In May, Watt gave conditional approval to an extension of oil and gas production company Woodside's North West Shelf project to 2070.\n\n\n\nREAD MORE This activist says she will continue legal challenge as Woodside gas extension approved\n\nThe project, Australia's largest gas and oil development, includes Woodside's Karratha Gas Plant, adjacent to Murujuga on the Burrup peninsula.\n\n\n\n\n\nThere are concerns that the project's continuation and subsequent pollution will cause significant damage to Indigenous rock art in the area.\n\n\n\n'Industry can coexist with rock art', Watt says\n\nOn Monday, when asked if the site's World Heritage listing could influence the final decision on the Woodside extension, Watt said it wouldn't.\n\n\n\n\n\n\"No, it won't apply to any decisions that are currently underway or that have happened previously\", Watt told ABC's RN Breakfast radio program.\n\n\n\nMurujuga contains the world's largest collection of rock art engravings, known as petroglyphs. Source: Supplied / Save Our Songlines The environment minister said the decision meant any future development in the precinct would need to comply with World Heritage rules. He also said that it was clear \"industry can coexist with rock art\".\n\n\n\n\n\n\"I said that we would be applying strict conditions, and preservation of the rock art was central to my decision [to provisionally approve the North West Shelf extension] when I made that a few weeks ago,\" Watt told ABC.\n\n\n\n\n\n\"But I guess this is also a way of keeping future governments and future industry honest, to make sure that it does have this extra layer of protection against any inappropriate development in the future.\"\n\n\n\n\n\nWatt visited UNESCO'S headquarters in Paris ahead of the listing, saying it would ensure stronger legal protections for the more than a million pieces of rock art.\n\n\n\nThe site was previously put forward to UNESCO for listing in 2023, with the application referred back in May this year.\n\n\n\n\n\nIn its decision to list Murujuga, UNESCO recommended that both state and federal government address concerns that nearby acid emissions — including from Woodside's Burrup gas hub — were degrading the art.\n\n\n\n\n\nBut it stopped short of implementing recommendations by the International Council on Monuments and Sites (ICOMOS) — an advisory body which offers guidance to UNESCO on heritage sites.\n\n\n\n\n\nThe association had recommended that the World Heritage listing be deferred until Australia detailed how it would eliminate \"harmful acidic emissions that currently affect the petroglyphs\".\n\n\n\nThere are concerns that nearby acid emissions are degrading the rock art at Murujuga. Source: Supplied / Save Our Songlines The government responded by saying the recommendation was driven by \"factual inaccuracies\", and successfully argued concerns would be met and that Murujuga should be heritage-listed immediately.\n\n\n\n\n\nMardathoonera woman and Murujuga traditional custodian Raelene Cooper, who was at the UNESCO meeting, welcomed the World Heritage listing but criticised the removal of recommended protections, including halting industry expansion.\n\n\n\n\n\n\"Today, Australia rewrote the World Heritage listing in the interests of the gas industry,\" she said.\n\n\n\nREAD MORE Save our Songlines: Custodian launches legal action to protect rock art from North West Shelf project\n\n\"Global scrutiny will now be applied to what is happening at Murujuga,\" Cooper said.\n\n\n\n\n\n\"You cannot have industry and culture coexist. It's never happened. It never works.\"\n\n\n\n\n\nShortly after Watt granted provisional approval to the North West Shelf extension, Cooper launched legal action to try and protect the site.\n\n\n\nMardathoonera woman and Murujuga traditional custodian Raelene Cooper said Australia had rewritten the World Heritage listing in the interests of the gas industry. Source: AAP / Dan Himbrechts The Greens welcomed Murujuga's World Heritage listing on Friday but warned that the world was watching and urged Watt to reconsider the draft approval.\n\n\n\n\n\n\"UNESCO had warned that Woodside's gas plant threatened the longevity of the rock art prior to the listing, but Minister Watt successfully lobbied other nations when he should have simply rejected Woodside's climate bomb extension in the first place,\" Greens leader Larissa Waters said in a statement.\n\n\n\n\n\nThe nomination process was driven by the Murujuga Aboriginal Corporation (MAC) on behalf of Traditional Owners the Ngarda-Ngarli.\n\n\n\n\n\nMAC chair Peter Hicks said on Friday it had been an \"Indigenous-led process\" in partnership with state and federal governments, thanking them for undertaking their roles \"without undermining Indigenous decision-making within the process\".\n\n\n\nCould industrial pollution damage rock art?\n\nLast month, a study out of Germany's Bonn University said the industrial emissions from the facilities cause lower pH and higher acid levels in the local rainwater and on the rock surfaces.\n\n\n\n\n\n\"The rock varnish on petroglyph-bearing rocks from Murujuga is highly likely impacted by local industrial pollution, with weathering rates most likely already accelerated due to the lower pH of the rainwater,\" the study said.\n\n\n\n\n\n— With additional reporting by the Australian Associated Press.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/never-expected-this-australian-sarah-gigantes-dream-comeback-after-major-surgery/tg43ybvxi",
        "title": "'Never expected this': Australian Sarah Gigante's dream comeback after major surgery",
        "publish_date": "Sun, 13 Jul 2025 20:35:37 +0000",
        "category": "sports",
        "authors": [],
        "text": "Sarah Gigante has completed her dazzling maiden Giro d'Italia by finishing third overall and winning the Queen of the Mountains jersey as the top climber.\n\n\n\n\n\nWhile Italian home favourite Elisa Longo Borghini held on to her overnight lead to take the title for a second straight year, Gigante was thrilled to finish her breakthrough event, in which she won two mountain stages in four days, with a place on the podium.\n\n\n\n\n\nBetter still, she produced the goods on the final hilly stage to take the Queen of the Mountains jersey as top climber, going past the overnight leader, Spain's Usoa Ostolaza.\n\n\n\n\n\n\"I can't believe how well this week went,\" said Gigante, who is making a remarkable comeback to the sport after surgery last year to fix the debilitating condition, Iliac artery endofibrosis.\n\n\n\n\n\n\"I never expected this. My main concern was just being able to compete again without pain,\" she said.\n\n\n\nThe 24-year-old follows her countrywoman Neve Bradbury, who also finished third in the 2024 event, and joins Amanda Spratt (third in 2018 and 2019), Kathryn Watt (second in 1994 and third in 1990) and Elisabeth Hepple (second in the inaugural 1988 event) in the Giro's Australian roll of honour.\n\n\n\n\n\nAfter taking the race lead off Marlen Reusser on the penultimate stage, Longo Borghini successfully defended the pink jersey on the final 134km stage eight from Forlì to Imola, finishing fourth behind her Swiss rival on the day.\n\n\n\n\n\nLongo Borghini (UAE Team ADQ) ended up victorious by 18 seconds ahead of Movistar's Reusser, with Gigante unable to make any inroads into the champion's overnight lead of 71 seconds over the Melbourne rider.\n\n\n\nThe stage was won by Movistar's Liane Lippert, who beat Anna van der Breggen (SD Worx-Protime) in a two-up sprint at the famous Imola racetrack, the Autodromo Enzo e Dino Ferrari, after the pair had escaped from a group of a dozen riders, including Gigante, in the last 3km.\n\n\n\n\n\nThe hilly route provided Gigante's key to the Queen of the Mountains blue jersey prize. She had been lying one point behind Ostolaza overnight, but won the first mountain sprint in Monticino to regain a lead that she wasn't about to relinquish.\n\n\n\n\n\nLorena Wiebes (SD Worx-Protime) then went on a solo breakaway to win an intermediate sprint and seal her points classification victory.\n\n\n\n\n\n\"It's been an incredible Giro — for me and for the team. The last eight days were full gas: we had a common goal, and we achieved it,\" Longo Borghini said.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/tour-de-france-tim-merlier-wins-another-stage-as-van-der-poels-efforts-denied/pmuhg4vyt",
        "title": "Tour de France: Tim Merlier wins another stage as Mathieu van der Poel's efforts denied",
        "publish_date": "Sun, 13 Jul 2025 20:16:43 +0000",
        "category": "sports",
        "authors": [],
        "text": "Tim Merlier won stage nine of the Tour de France at Châteauroux after a heroic long-range escape from Mathieu van der Poel was caught in the final kilometre.\n\n\n\n\n\nThere was no change atop the overall standings with Tadej Pogacar now holding a 54-second advantage over Remco Evenepoel in second, with French starlet Kevin Vauquelin third.\n\n\n\n\n\nThis was a second Tour win for Soudal Quick-Step sprinter Merlier this year, who was first across the line on stage three at Dunkirk.\n\n\n\n\n\nMerlier was led in by team leader Evenepoel.\n\n\n\n\n\n\"It's mad, we are supposed to be helping him [Evenepoel] but he's helping us,\" Merlier said.\n\n\n\n\"I need to make it through the mountains now, I won't be any use to Remco there, but I want to help him in the other ones,\" the 32-year-old said.\n\n\n\n\n\nOn a sun-drenched slog from the Chinon vineyards, Van der Poel and a teammate broke early and built up a lead of 5 minutes and 30 seconds on the flat roads to Châteauroux.\n\n\n\nNearly made it\n\nJonas Rickaert won the combativity award for accompanying Van der Poel to within 10km of the line before slumping over his handlebars.\n\n\n\n\n\n\"I'm really happy. That was one of his [Rickaert] dreams, to win the combativity award and that's why we went,\" Van der Poel said.\n\n\n\n\n\n\"In the end, we nearly made it, but we hadn't expected to get that far,\" he said of his 173km breakaway at an average speed of 49.9kph.\n\n\n\n\n\nAs with many exploits, their epic escape was ultimately ended in a near miss.\n\n\n\n\n\nBut with his all-in, full-throttle style Van der Poel grew his Tour de France legend here. Even though he was caught with 700m to go, the plaudits will be both his and Merlier's.\n\n\n\n\n\n\"It's hard to not be able to finish it off, but we put on a good show,\" the Dutch rider said.\n\n\n\nBelgian Tim Wellens of UAE Team Emirates, Spanish Marc Soler of UAE Team Emirates and Slovenian Tadej Pogacar of UAE Team Emirates pictured in action during stage nine. Source: AAP / Jasper Jacobs / Belga / Sipa USA As Van der Poel was reeled in, it looked as though Jonathan Milan would win a second consecutive stage, but Merlier got ahead with 30m remaining as Milan finished second, with Arnaud De Lie completing the podium.\n\n\n\n\n\nRoad signs in honour of British cycling great Mark Cavendish had been placed at entry points to Châteauroux — reading Cavendish City — in homage to the now-retired 40-year-old, after he won three stages there in 2008, 2011 and 2021.\n\n\n\n\n\nPogacar's Tour de France defence took a hit on Sunday as his key teammate João Almeida threw in the towel two days after his nasty fall at the Mur de Bretagne, where he fractured a rib.\n\n\n\n\n\n\"It's a big loss, he was in good shape. He's our hero. I was suffering today, so I understand how he must have felt. Every respect to him,\" the Slovenian said.\n\n\n\nStage 10 should shake up the race with eight classified climbs in the Massif Central on the 14 July French national holiday.\n\n\n\n\n\nAfter finishing in the peloton on Sunday, Pogacar was already looking ahead to Monday's mountainous 165.3km slog.\n\n\n\n\n\n\"Visma have a strong team for tomorrow and I think Jonas [Vingegaard] will be ready,\" Pogacar said of his great Danish rival.\n\n\n\n\n\n\"There will be attacks from the main contenders; it's up and down all day.\n\n\n\n\n\n\"I'm pretty confident in my team though. I'm looking forward to the hard stages.\"\n\n\n\n\n\nFor the latest from SBS News, download our app and subscribe to our newsletter .\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/pm-juggles-military-tensions-with-football-diplomacy-on-first-full-day-of-china-trip/72yhlovjp",
        "title": "PM juggles military tensions with football diplomacy on first full day of China trip",
        "publish_date": "Sun, 13 Jul 2025 09:20:20 +0000",
        "category": "sports",
        "authors": [],
        "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts .\n\n\n\n\n\nTRANSCRIPT:\n\n\n\n\n\nIt was a day of positivity for the Australian Prime Minister as he begins a six day tour of China.\n\n\n\n\n\nFirst there was a morning walk with former Socceroo Kevin Muscat along Shanghai's historic Bund promenade to promote the two nations' interpersonal links.\n\n\n\n\n\nMuscat now coaches Shanghai Port FC, and became the first Australian manager to lead a Chinese Super League team to the premiership.\n\n\n\n\n\nHe presented the PM with a jersey to mark the occasion.\n\n\n\n\n\nMUSCAT: \"We'd like to present you with your own Shanghai FC shirt.\"\n\n\n\nALBANESE: \"Thank you so much.\"\n\n\n\n\n\nThere was also a moment with officials from Tourism Australia, who have launched a new campaign to encourage more Chinese tourists to visit down under.\n\n\n\n\n\nChief executive Robin Mack says the campaign will feature Chinese actor Yu Shi.\n\n\n\n\n\n\"We always love to work with people who resonate with our target customers, and what Yu Shi is doing and bringing to our campaign, we're really excited.\"\n\n\n\n\n\nA burgeoning Chinese middle class with a new found appetite for travel has flocked to Australia in recent decades, though recent tourist numbers remain below pre-pandemic levels.\n\n\n\n\n\nMr Albanese says increasing the numbers of Chinese tourists who come to our shores is in Australia's best interest.\n\n\n\n\n\n\"Last year alone Chinese tourists spent more than 9 billion dollars in Australia. That's jobs for Australians, particularly in regional communities. The agreement that was signed today will focus on growing these tourism numbers back to our 2019 record of 1.4 million and beyond.\"\n\n\n\n\n\nAmid the positive rhetoric around Sino-Australian relations, Mr Albanese did his best to dodge the US-sized elephant in the room.\n\n\n\n\n\nAustralia and the United States have just begun joint military exercises in Queensland, alongside over a dozen other allies.\n\n\n\n\n\n\"Good afternoon everyone, and welcome to Talisman Sabre 2025.\"\n\n\n\n\n\nStill, there's been tensions - not so much around the Chinese ships that Acting Defence Minister Pat Conroy has acknowledged to the ABC's Insiders programme are monitoring the military exercises offshore.\n\n\n\n\n\n\"It would be unusual for them not to observe it. And we'll adjust accordingly.\"\n\n\n\n\n\nIt's more around comments by US defence strategist Elbridge Colby - who is running the US' review into the AUKUS pact.\n\n\n\n\n\nThere has already been pressure for Australia to increase its defence spending - and Colby has reportedly pushed Australia and Japan to clarify what role they would play in a potential conflict with China over Taiwan.\n\n\n\n\n\n\"A lot of the biggest economies in our alliance network really aren't pulling their weight... In some sense perhaps our closest ally in the world - they've been with us even in our less advisable wars, is the way I put it.\"\n\n\n\n\n\nBack in Australia, Pat Conroy has said Australia won't automatically follow the US into a future conflict, or pre-commit its troops.\n\n\n\n\n\n\"I don't disclose confidential discussions, but I make a couple of broad points. One, we don't engage in hypotheticals. We don't discuss hypotheticals. But secondly, the decision to commit Australian troops to a conflict will be made by the government of the day.\"\n\n\n\n\n\nThe PM himself has said nothing about Australia's position has changed.\n\n\n\n\n\n\"I think it's important that we have a consistent position, which Australia has had for a long period of time. We support the status quo when it comes to Taiwan. We don't support any unilateral action there.\"\n\n\n\n\n\nMeanwhile the Opposition has called for the Prime Minister to make the most of his visit to China.\n\n\n\n\n\nThe PM faces a precarious task navigating Australia's complex relationship with its most important trading partner as his week-long visit begins in earnest.\n\n\n\n\n\nAfter relations between China and Australia soured during the COVID-19 pandemic, Labor's election in 2022 precipitated a normalisation in trade and dialogue, with a return to regular high-level meetings.\n\n\n\n\n\nBut tensions remain fraught, with China's military assertiveness in the region an increasing concern for Canberra.\n\n\n\n\n\nNationals Leader David Littleproud has told Channel 9 the trip is an opportunity the PM can't waste in balancing these issues.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/traditional-owners-hope-rock-art-heritage-listing-will-attract-eyes-of-the-world/nh3plj9xb",
        "title": "Traditional owners hope rock art heritage listing will attract eyes of the world",
        "publish_date": "Sun, 13 Jul 2025 03:34:07 +0000",
        "category": "finance",
        "authors": [],
        "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts .\n\n\n\n\n\nTRANSCRIPT:\n\n\n\n\n\nAmong the red rock hills of Murujuga in Western Australia's Pilbara region are a million ancient rock engravings.\n\n\n\n\n\nSome of the engravings date back 50,000 years, making them older than Stone Henge and the Pyramids of Giza.\n\n\n\n\n\nThe ancient petroglyphs include the oldest known depiction of a human face, as well as engravings of plants and animals, some of which are now extinct.\n\n\n\n\n\nTraditional owners have long campaigned to protect the art - and now, their bid for a UNESCO World Heritage listing has ended with triumph in Paris.\n\n\n\n\n\n\"I therefore declare the decision 47-8B.13 adopted as amended.\"\n\n\n\n\n\nUNESCO says their decision recognises that the site represents “a masterpiece of human creative genius”; is a unique testimony to a cultural tradition; and finally, that the site is an outstanding example of a cultural or human settlement showing interaction with the environment.\n\n\n\n\n\nChair of the Murujuga Aboriginal Corporation ((MAC)), Peter Hicks, travelled to Paris for the momentous decision.\n\n\n\n\n\n\"Inscribed into the history books is a great, great outcome for us, the Aboriginal people. It's a nomination led by Aboriginal people, for Aboriginal people, and guided by the Aboriginal people. And therefore it is a world first.\"\n\n\n\n\n\nPeter Jeffries is also from the Murujuga Aboriginal Corporation, which has led the campaign.\n\n\n\n\n\nHe says it's been years in the making.\n\n\n\n\n\n\"It's been in motion now for two or three decades, and we've lost a lot of our old elders in the process. So this is also in recognition of their support, as well.\"\n\n\n\n\n\nBut while the Corporation's campaign has gone on for decades, it wasn't until 2023 that the Australian Government nominated the Murujuga Cultural Landscape for World Heritage status.\n\n\n\n\n\nAustralia's application was referred back to the government in May, after UNESCO suggested state and federal governments needed to do more to address concerns that acid emissions from Woodside's nearby gas project were damaging the engravings.\n\n\n\n\n\nThe peninsula in northwest WA near Karratha is home to two gas plants, a fertiliser plant and iron ore and salt export facilities.\n\n\n\n\n\nEnvironment Minister Senator Murray Watt argued those emission claims were based on inaccuracies, drawing on a report by about 50 scientists who said the emissions showed there was no ongoing risk to the engravings.\n\n\n\n\n\n\"In the end, what persuaded the committee was the scientific evidence that was put forward which disputed some of the claims being made but also the genuine passion from the traditional owners to see this world heritage listing be secured.\"\n\n\n\n\n\nThe Minister was also in Paris for the announcement, declaring the government was committed to protecting the site now and for future generations.\n\n\n\n\n\n\"On behalf of the Australian government I am honoured to accept this inscription. Australia is thrilled with the committee's decision to inscribe the Murujuga's Cultural Landscape on the World Heritage List. This has been an Indigenous-led nomination and this victory belongs to the Ngarda-Ngarli, the traditional owners and custodians of Murujuga, whose deep knowledge and cultural leadership and enduring connection to country are at the heart of this inscription.\n\n\n\n\n\nBut concerns about the potential impacts of pollution on the rock art have not gone away with the listing.\n\n\n\n\n\nAustralian Conservation Foundation chief executive Kelly O'Shanassy says the world is watching now Murujuga is a world heritage site, and has urged the federal environment minister to reject Woodside's provisional gas project extension.\n\n\n\n\n\nConditions of the approval which relate to emissions from the plant are still being negotiated.\n\n\n\n\n\nAnd while the 21 member nations unanimously supported the UNESCO listing, they requested Australia continue to research the effects neighbouring industry has on the rock art, and report its findings to the U-N next year.\n\n\n\n\n\nA Woodside spokesperson has responded in a statement to SBS:\n\n\n\n\n\n\"The company has been a proud supporter of the World Heritage nomination and assessment process, and the company looks forward to continuing to work closely with the Murujuga Aboriginal Corporation and Traditional Custodians on the continued protection and management of this globally significant area.\"\n\n\n\n\n\nStill, Mardathoonera woman and Murujuga traditional custodian Raelene Cooper says culture and industry cannot co-exist, and she remains worried about the long term impacts of emissions on the rock art.\n\n\n\n\n\nPeter Hicks says the Ngarda-Ngarli people will remain dedicated to protecting the site.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/tour-de-france-stage-eight-results/rnlktbke9",
        "title": "Tour de France: Jonathan Milan wins stage eight; Australian Kaden Groves misses out",
        "publish_date": "Sat, 12 Jul 2025 21:30:37 +0000",
        "category": "sports",
        "authors": [],
        "text": "Jonathan Milan has won stage eight of the Tour de France in a mass bunch sprint ahead of Wout van Aert and Kaden Groves.\n\n\n\n\n\nQueensland sprinter Groves came his closest yet to winning a stage at the Tour de France but ran out of steam as he had to settle for third place in Laval.\n\n\n\n\n\nOn a day for pure sprinters and with no change at the top of the overall rankings, Lidl-Trek's Milan was the first Italian to win a stage on the Tour since Vincenzo Nibali in the Alps in 2019.\n\n\n\n\n\nMilan, 24, took over the top of the sprint points rankings and had been wearing the green tunic in place of Tadej Pogacar, who had earned the sprint and the overall leader's yellow jersey by winning stage seven.\n\n\n\n\n\n\"It means a lot for me and also my country,\" Milan said.\n\n\n\nItalian Jonathan Milan and Belgian Wout van Aert sprint to the finish of stage eight of the 2025 Tour de France cycling. Source: SIPA USA / Jasper Jacobs \"I was placed in a perfect position to take this victory.\n\n\n\n\n\n\"And I'll try and win again tomorrow,\" he said of Sunday's flat stage also billed as one for the sprinters.\n\n\n\n\n\nPogacar retained the overall lead with Remco Evenepoel and Kevin Vauquelin rounding out the top three, with no change in the top 10 as the peloton kept its powder dry.\n\n\n\n\n\n\"It's nice to have a day like this,\" said 2020, 2021 and 2024 Tour winner Pogacar.\n\n\n\n\n\n\"It was a bit more relaxed and not necessary to push too hard in the sun all day.\n\n\n\n\"Especially as Monday is a brutal stage,\" the Slovenian added of the eight classified climbs and many more besides in a stage loaded with opportunities on France's national holiday in the Massif Central.\n\n\n\n\n\nPogacar, 26, also spoke of his teammate Joao Almeida who was hurt in a late fall Friday.\n\n\n\n\n\n\"It was good to see Joao finish the stage okay,\" he said.\n\n\n\n\n\n\"As I said, Monday is a brutal stage but nobody is expecting Joao to kill himself for a bike race,\" said Pogacar.\n\n\n\n\n\nA day after complaining of the heat and fatigue Pogacar also refused to be drawn on his participation at the Vuelta a Espana, the third and final Grand Tour of the season.\n\n\n\n\n\n\"I have to think about if I want to spend another month away from home,\" he said.\n\n\n\nFrench hopes dashed again\n\nBest young rider and Olympic champion Evenepoel hit a top speed of over 82kph (51mph).\n\n\n\n\n\n\"It was a nervy finale and I just wanted to stay up front in case of a fall,\" said Evenepoel\n\n\n\n\n\n\"It was a shame for Tim (Merlier, his team's sprinter) but he punctured in the run in,\" the 25-year-old Belgian added.\n\n\n\nThe remaining 177 riders from the original 184 rolled through the Brittany countryside with the harvest ongoing a month early and colossal crowds on the roadside.\n\n\n\n\n\nUnder clear blue skies and 31 degrees Celsius (88 degrees Fahrenheit) heat there was little inspiration in the peloton to breakaway until late in the day.\n\n\n\n\n\nFrench duo Mathieu Burgaudeau and Matteo Vercher attacked from 70km and the pair were only reeled in on the edge of finish town Laval after enthusiastic support on this Tour, which is based entirely on French soil but with no home winner yet.\n\n\n\n\n\nThe pair were awarded jointly the day's combativity award for their efforts.\n\n\n\nThe French Groupama-FDJ team is based in this region but their sprinter Paul Penhoet punctured 7km from home and failed to get back into the action in time for the finale.\n\n\n\n\n\nStage nine on Sunday heads south from Chinon to Chateauroux and is another flat affair with the focus on keeping hydrated in the heat and staying in the saddle.\n\n\n\n\n\nFor the latest from SBS News, download our app and subscribe to our newsletter .\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/sbs-talks-to-family-creation-lawyer-sarah-jefford-on-australias-review-inrto-surrogacy-laws/wdhedoh95",
        "title": "SBS talks to family creation lawyer Sarah Jefford on Australia's review into surrogacy laws",
        "publish_date": "Sat, 12 Jul 2025 21:30:00 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/cultured-cuisine-when-your-chef-has-a-phd-in-cell-division/udqwlrkys",
        "title": "Cultured cuisine: when your chef has a PhD in cell division",
        "publish_date": "Sat, 12 Jul 2025 21:00:00 +0000",
        "category": "finance",
        "authors": [],
        "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nIt's the weekday lunch rush and diners at 'Kitchen by Mike' - a popular restaurant in the Sydney CBD are among the first in the country to try a curious new cuisine.\n\n\n\n\n\nAcclaimed chef Mike McEnearney's much-loved sourdough bread is now being served with what's known as 'cultured Japanese quail spread.'\n\n\n\n\n\n\"So the cultured quail is folded through the butter. I would describe it as incredibly strong and mammy flavor with a texture of butter. So if you like strong chickeny quail flavors, it's in the texture of butter on bread., it's delicious, it's almost like pâté.\"\n\n\n\n\n\nSo what makes it so unique?\n\n\n\n\n\nWell, the quail meat in the butter did not come from a farm, rather it was produced in factory in the inner Sydney suburb of Alexandria - about a 20 minute drive from the restaurant.\n\n\n\n\n\n'Cultured meat' is the process of taking a small amount of cells from an animal - in this case, a quail - and growing them in a factory-like setting to eventually produce a type of meat product.\n\n\n\n\n\n\"My first time in 35 years of cooking that I've seen a new category come to market. It's really exciting. It is brand new food.\"\n\n\n\n\n\nAnd the verdict from diners?\n\n\n\n\n\nDiner 1: \"Yeah I'd say it's pretty adventurous, Mike was mentioning it's pretty revolutionary. It's quite new in the industry so I'm glad to have tried it.\"\n\n\n\n\n\nDiner 2: \"Pâté, like a smokey pâté. Really unusual taste but quite nice, I'd definitely have it again. \"\n\n\n\n\n\nDiner 3: \"I really like the innovative nature of it and I think I'd be really happy to see it more on menus.”\n\n\n\n\n\nFrom hatted restaurants to pubs, around a dozen restaurants across Australia have this week begun serving the cultured quail. About a dozen more will have it on their menu by the end of the month.\n\n\n\n\n\nThe product is the brainchild of Australian start-up Vow, which in June became the first company in the country to be given the greenlight to sell cultured meat.\n\n\n\n\n\nIt follows a more than two year approval process by the food safety regulator, F-S-A-N-Z.\n\n\n\n\n\nEllen DInsmoor, Vow's Chief Operating Officer, insists the company is not trying to replace meat.\n\n\n\n\n\n\"So what we make is very unique in that it's not plant-based, we're not trying to recreate beef and other meats we eat today. We're taking different cells from other animals, growing those and then using them to make new food products.\"\n\n\n\n\n\nShe says the quail cells are grown in a bioreactor, which is essentially a large stainless steel tank, similar to what you might see in a brewery.\n\n\n\n\n\n\"We take actual cells from animals and we grow them in what I think of as a nutrient broth, which is essentially recreating the conditions in which cells grow in our body or in an animal's body that has amino acids, salts, sugars. At the end of the day, you can harvest those cells out. Maybe imagine that if you're making cheese and you are taking some of the whey off the top, that's kind of what it looks like when you harvest the cells out. And then we can take those cells as a really beautiful, pure ingredient, really rich form of protein, another nutrient, some craft those into finished food products.\"\n\n\n\n\n\nWhile the product only made its debut in Australia this month, for the past year, it's been available in Singapore - the first country globally to approve the sale of cultured meat.\n\n\n\n\n\nSo why produce food this way? Paul Wood, a Professor in Biotechnology at Monash University explains.\n\n\n\n\n\n\"Well, for some people it's because they don't want to see animals harmed. For others, it's an environmental thing. They believe that this is going to be a more sustainable way of producing food. Some just say it's a new food experience. So there's a range of ways that it's being sort of marketed to people.\"\n\n\n\n\n\nBut he says, until the industry scales at large it remains unclear whether it will be more sustainable than farming.\n\n\n\n\n\n\"It will use less land. It's a factory. It'll probably use less water. But we know already that on an energy basis, it's unlikely to be more sustainable because it's quite an energy intensive process. So you really need to be using totally renewable energy. And even then, if you compared it to growing an animal in a paddock, it's still a hell of a lot more intensive.\"\n\n\n\n\n\nHe says cost is another challenge, and when it comes to nutrition:\n\n\n\n\"It's unlikely, I think, to be better than a piece of meat, a three dimensional with a lot of iron in there, a lot of vitamins, B12, et cetera. So we talk about meat being an energy dense or a nutritionally dense product, you're going to have to add back minerals and vitamins to this product. There's only one single cell type.\"\n\n\n\n\n\nBut others believe the industry has a role to play in addressing future food challenges.\n\n\n\n\n\nBy some estimates, agricultural production will need to increase by around 60 percent by 2050 to meet the demands of the growing population.\n\n\n\n\n\nSam Perkins is the CEO of Cellular Agriculture Australia, a not-for-profit that seeks to advance cellular agriculture, which is the process of using cells to create products.\n\n\n\n\n\n\"We see cellular agriculture and the technologies that sit within it as a way of complimenting existing food supply chains and move towards a more future-proof food system where the technologies offer the potential to reduce greenhouse gas emissions, reduce land use and reduce water use, whilst also building resilience, particularly around things like climate shocks or supply chain disruptions and emerging threats like zoonotic diseases as we've seen recently through avian flu.\"\n\n\n\n\n\nThe technology is currently being harnessed to make everything from coffee to palm oil, leather and chocolate.\n\n\n\n\n\nBut scaling the industry remains a challenge and calls for better investment come as countries take steps to ban sale and consumption of cultured food, Italy, France and some US states among them.\n\n\n\n\n\nConcerns over quality and the threat to farmers are among the issues driving the pushback.\n\n\n\n\n\nThe Italian farm lobby has labelled it ‘Frankenstein meat.'\n\n\n\n\n\nPerkins says misconceptions around the concept of cultured meat are feeding 'unhelpful narratives.'\n\n\n\n\n\n\"One thing we hear a lot is references to things like lab-grown meat. Cell ag products aren't produced in labs, even if the original technology was developed by scientists. They're made in food manufacturing facilities that look far more like breweries than they do a science lab.\"\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/morning-news-bulletin-13-july-2025/yj1es5n3r",
        "title": "Morning News Bulletin 13 July 2025",
        "publish_date": "Sat, 12 Jul 2025 20:55:41 +0000",
        "category": "finance",
        "authors": [],
        "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\nEurope reacts to newly-announced tariffs by the United States\n\nFamilies of the Air India crash victims call for justice as a preliminary investigation is handed down\n\nIga Swiatek wins the women's final at Wimbledon, in an astounding show on centre court\n\nFrom August, European and Mexican imports to the United States will be subject to a 30 per cent tariff.\n\n\n\n\n\nThe news has come via letters from US President Donald Trump, posted to the Truth social and each addressed to Mexican and EU leaders.\n\n\n\n\n\nEuropean Union president Ursula Von der Leyen has returned her own statement - expressing concern with the move and its impact on global trade.\n\n\n\n\n\nShe writes that the EU is open to negotiate in coming weeks, while raising the threat import penalties could be laid on American goods coming into Europe.\n\n\n\n\n\n\"We will take all necessary steps to safeguard EU interests, including the adoption of proportionate countermeasures if required. Meanwhile, we continue to deepen our global partnerships, firmly anchored in the principles of rules-based international trade.\"\n\n\n\n\n\n**\n\n\n\nPro-Palestine protesters have marched in the wake of a contentious plan to combat antisemitism.\n\n\n\n\n\nRallies have been held across the country in response to the report by Australia's Special Envoy to combat Antisemitism, Jillian Segal, which suggests axing support for publicly funded institutions and festivals that promote or fail to effectively deal with hate speech.\n\n\n\n\n\nCriticism of the report largely focuses on Ms Segal's recommendation Australia adopt the International Holocaust Remembrance Alliance's definition of antisemitism, some arguing that it will lead to heavy-handed silencing of free speech and a conflation of antisemitism with criticism of Israel and Zionism.\n\n\n\n\n\nBen Saul – chair of international law at the University of Sydney, and U-N special rapporteur on human rights and counter terrorism – has told SBS News the definition is inappropriate, vague and overbroad.\n\n\n\n\n\n\"The real concern lies with some of the examples given under the IHRA definition, which really conflates legitimate criticism of Israel with antisemitism. So I think this approach is counterproductive because when the definition is so divisive, it's not going to be a unifying force to build consensus in the community on what is antisemitism.\"\n\n\n\n\n\n**\n\n\n\n\n\nChinese Foreign Minister Wang Yi says his country is ready to promote a comprehensive strategic partnership with Australia through a more proactive approach.\n\n\n\n\n\nHe says that includes working with Australia to prepare for the next stage of high-level exchanges, and properly managing their differences.\n\n\n\n\n\nWang has made the remarks during a meeting with Australian Foreign Minister Penny Wong in the Malaysian capital, on the sidelines of the ASEAN Foreign Ministers' Meeting.\n\n\n\n\n\nMinister Wong says Australia is also committed to developing a positive and pragmatic relationship.\n\n\n\n\n\n**\n\n\n\n\n\nThe families of the Air India crash victims are calling for justice, as a preliminary investigation into the events reveals confusion in the cockpit shortly before impact.\n\n\n\n\n\nA 15-page report, issued by India's Aircraft Accident Investigation Bureau on Saturday, has revealed both pilots questioning a fuel switch setting that was turned off, starving the engines shortly after take-off.\n\n\n\n\n\nThe preliminary report does not say how the switch could have flipped to the cut-off position on the June 12 London-bound flight from the Indian city of Ahmedabad.\n\n\n\n\n\nBut father of plane crash victim, Naresh Maheswari, says those responsible must be held accountable.\n\n\n\n\n\n\"We want the investigation to be neutral and the perpetrators to be punished. We have lost what we were destined to lose, but we want no one else to die due to such carelessness.\"\n\n\n\n\n\n**\n\n\n\n\n\nIga Swiatek has become the first Polish player to win a Wimbledon singles title, thrashing American Amanda Anisimova in just 57 minutes.\n\n\n\n\n\nIt's the first time a Wimbledon final has been won 6-0 6-0 in 114 years, the win earning the Polish 24 year old her sixth grand slam title.\n\n\n\n\n\nSwiatek dropped only two games in her semi-final against Belinda Bencic, and was even more ruthless in the final, clinching victory with a backhand winner.\n\n\n\n\n\nHaving never gone beyond the Wimbledon quarter-finals before this year, despite winning four French Open crowns, she says the result has come as a shock.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.theage.com.au/sport/cricket/australia-v-west-indies-live-day-two-of-third-test-in-kingston-jamaica-20250713-p5memg.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Australia v West Indies LIVE: Top-order shambles gives hosts a sniff",
        "publish_date": "Mon, 14 Jul 2025 12:22:08 +1000",
        "category": "sports",
        "authors": [
            "Vince Rugari",
            "Tom Decent"
        ],
        "text": "A week ago, Australian coach Andrew McDonald leapt to the defence of four-Test rookie Sam Konstas following returns of 3, 5, 25 and 0 in the first two matches against the West Indies.\n\n“Four games, eight innings - it’s probably early for anyone to judge really,” McDonald told reporters, while acknowledging the performances hadn’t been spectacular.\n\nMcDonald and fellow selectors will now have 10 Konstas innings – or “data points”, as they like to call them – to assess ahead of Australia’s next Test assignment.\n\nThe only problem is that it’s the biggest of the lot: an Ashes series on home soil.\n\nHow many do they need? Is 10 enough? Or 20?\n\nRead the rest of Tom Decent’s stumps report here.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/cricket/worst-in-41-years-konstas-makes-another-duck-in-latest-nightmare-ahead-of-ashes-20250714-p5meoe.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Worst in 41 years: Konstas makes another duck in latest nightmare ahead of Ashes",
        "publish_date": "Mon, 14 Jul 2025 12:18:10 +1000",
        "category": "sports",
        "authors": [
            "Tom Decent"
        ],
        "text": "Kingston: A week ago, Australian coach Andrew McDonald leapt to the defence of four-Test rookie Sam Konstas following returns of 3, 5, 25 and 0 in the first two matches against the West Indies.\n\n“Four games, eight innings - it’s probably early for anyone to judge really,” McDonald told reporters, while acknowledging the performances hadn’t been spectacular.\n\nMcDonald and fellow selectors will now have 10 Konstas innings – or “data points”, as they like to call them – to assess ahead of Australia’s next Test assignment.\n\nThe only problem is that it’s the biggest of the lot: an Ashes series on home soil.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/business/the-economy/trump-makes-europe-his-next-target-in-his-war-on-the-world-20250714-p5meoy.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Trump makes Europe his next target in his war on the world",
        "publish_date": "Mon, 14 Jul 2025 11:57:21 +1000",
        "category": "finance",
        "authors": [
            "Stephen Bartholomeusz"
        ],
        "text": "It will take years before their commitments to increase their own defence spending might wean them off their reliance on the US for protection from an aggressively expansionist Russia. However, with Trump also announcing at the weekend that he is considering raising the baseline tariff rate to 15 to 20 per cent, they have to take his threat of a 30 per cent tariff – and additional tariffs to match any retaliatory measures they might take – seriously. Trump appears impatient that he hasn’t delivered the “90 deals in 90 days” the administration boasted it would deliver, let alone the 200 deals he once said were virtually done. European Commission President Ursula von der Leyen. EU and US trade officials have been negotiating for months. Credit: Bloomberg He’s also been boosted by the successful passage through Congress of his One Big Beautiful Bill Act and by the buoyancy of US financial markets, which have rebounded from their sell-offs in April, when Trump first unveiled his “reciprocal” tariffs.\n\nIn April, he deferred imposition of the tariffs until July (and subsequently deferred them again until next month) because the bond market was “getting a little queasy.” Now markets have settled, with the sharemarket posting record highs. That may be because investors don’t believe he will follow through with the reciprocal tariffs he has threatened – the “Trump Always Chickens Out” or TACO trade – or because any ill effects from tariffs, most notably increased inflation, have yet to show up in economic data. Loading No one, including Trump himself, it seems, knows what he might post next on his Truth Social, so markets are behaving as if nothing has happened until something actually happens. August 1 – the new deadline for his reciprocal tariffs – could be a wake-up moment for markets. The apparent complacency in markets, in the meantime, is encouraging Trump to be more aggressive and more impatient.\n\nThere is a risk that, rather than heed, as he has until now, the urgings of calmer voices in his cabinet to negotiate deals, he will follow his personal preference and unilaterally present trade partners with “take it or leave it” ultimatums. While the EU still appears to believe that Trump’s latest threat is a negotiating ploy, they have prepared countermeasures in case it isn’t. The EU had drawn up a list of US exports that it could target in response to the baseline tariff and the sectoral tariffs on steel, aluminium and autos, covering about €21 billion ($37 billion) of US exports. Items on that list included chicken, motorcycles and clothing. It has another list, targeting another €72 billion of products, ranging from aircraft to alcohol, with which it could respond to Trump’s reciprocal tariffs. It also has what it calls its “anti-coercion instrument,” or actions that could hit the trade in services, although it is reluctant to deploy that instrument, which it devised in response to a deluge of cheap imports from China.\n\nThe total trade between the US and EU is worth about $US1 trillion ($1.5 trillion), with the EU enjoying a trade surplus in goods of $US235 billion, but a trade deficit in services of about $US75 billion. The EU, in its negotiations with the US, had sought exemptions from Trump’s tariffs for key sectors, such as aircraft and alcohol, in exchange for a promise to buy more US goods, particularly weapons and LNG, that would narrow the US goods trade deficit. Von der Leyen said on Saturday that the EU was ready to continue negotiating but prepared to consider retaliation. Imposing 30 per cent tariffs on EU exports would disrupt essential transatlantic supply chains, harming businesses and consumers on both sides of the Atlantic, she said. The dilemma for the EU is that Trump’s view of its non-tariff policies and trade barriers includes its value-added tax and its regulation of digital activity to protect competition and consumers. No nation state – or, in the EU’s case, collection of 27 nation states – would surrender its sovereignty and allow Trump to dictate its domestic policy settings. Having seen what Trump has done to Brazil, threatening a 50 per cent tariff rate in response to unfair trade barriers (even though the US has a trade surplus with Brazil) and its trial of former president Jair Bolsonaro – an enthusiastic Trump supporter – for allegedly plotting a coup, the EU would be conscious of the risk that Trump’s demands may not be confined to its goods trade.\n\nThe potential for a trade confrontation is, therefore, quite significant. The EU will have to decide whether it should roll over and accede to Trump’s demands, damaging its industries and the sovereignty of its states. Alternatively, it could emulate China and allow the confrontation to escalate to the point where it threatens a trade embargo, which would, as China’s tot-for-tat tariffs did, scare the bejesus out of financial market participants and unnerve the White House. Loading Trump’s indiscriminate threats of trade sanctions against America’s friends and foes alike have ignited a scramble by the EU and others to secure new markets. There is potential for a new trading bloc, spanning Europe, the non-Chinese Asia Pacific and Latin America, to emerge. Trump and much of his hand-picked cabinet are protectionists and isolationists. At the conclusion of his trade wars on everyone, if much of the rest of the world decides to trade freely among themselves, he might get what he wished for.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/property/news/seller-80-auctions-carindale-home-for-2-2-million-before-his-wedding-20250714-p5meph.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Seller, 80, auctions Carindale home for $2.2 million before his wedding",
        "publish_date": "Mon, 14 Jul 2025 11:46:26 +1000",
        "category": "finance",
        "authors": [
            "Sarah Webb"
        ],
        "text": "A five-bedroom Carindale house has resold for $2.2 million just 12 months after its last sale, delivering a $220,000 windfall for its 80-year-old owner and closing the loop on a love story that began with a break-up.\n\nNewly single after the end of his marriage, the vendor bought 64 Oakley Street for $1.975 million last March. But after finding love again he decided it was time to sell, listing the property ahead of his upcoming wedding.\n\nThe house at 64 Oakley Street in Carindale has sold at auction in Brisbane. Credit: Place Bulimba\n\nSet on an 864-square-metre block, the home features a heated inground pool, pool house and media room, while sitting within the coveted Mansfield State School and Mansfield State High catchments.\n\nDescribed as move-in ready but still featuring its original kitchen, the property drew interest from both local and interstate buyers keen to break into the fast-growing Carindale market.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/goodfood/melbourne-eating-out/calle-bakery-s-cult-custard-croissant-wheels-arrive-in-northcote-20250714-p5merj.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Calle Bakery’s cult custard croissant wheels arrive in Northcote",
        "publish_date": "Mon, 14 Jul 2025 11:42:34 +1000",
        "category": "finance",
        "authors": [
            "Tomas Telegramma"
        ],
        "text": "Add articles to your saved list and come back to them anytime.\n\nSave this article for later\n\nRemove items from your saved list to add more.\n\nYou have reached your maximum number of saved items.\n\nThe Carlton North bakeshop has opened a second outpost on High Street.\n\n1 / 9 Calle’s lemon meringue croissant wheel. Paul Jeffers 2 / 9 The Northcote location allows Calle to ramp up its production. Paul Jeffers 3 / 9 A selection of croissants on display at Calle. Paul Jeffers 4 / 9 Fruit and custard croissant danish. Paul Jeffers 5 / 9 Sisters Vivian (left) and Ellena Ly, who own Calle Bakery. Paul Jeffers 6 / 9 More classic pastries, such as escargots, are also in the cabinet. Paul Jeffers 7 / 9 Desserts like banoffee pie and Dubai chocolate inspire many pastries. Paul Jeffers 8 / 9 Danishes filled with fruit are joined by globally trending pastries. Paul Jeffers 9 / 9 The space has just a few seats inside, plus some outdoors. Paul Jeffers Previous Slide Next Slide\n\nBakery$$$$\n\nCalle’s original Carlton North shop has been mobbed by ever-longer queues for its riffs on globally trending pastries since it opened on Rathdowne Street in 2022. Now, it has a second outpost on Northcote’s High Street with room for 20 diners.\n\nHeading up production is co-owner Vivian Ly’s husband, Huey Phung, a pastry chef of 25-plus years. Heading up production is Vivian’s husband, Huey Phung, a pastry chef of 25-plus years. The signature custard-filled croissant wheels – inspired by those that attract crowds to New York bakery Lafayette – have come to Northcote, but are available only Friday to Sunday (as in Carlton North). Two different flavours are on the roster every month.\n\nAlso popular is a croissant version of the internet-famous Dubai chocolate bar, with a filling of creamy pistachio spread and crispy kataifi pastry threads, and a topping of melted dark chocolate. Ooey-gooey cinnamon scrolls are a Northcote exclusive. There are also slabs of focaccia, sourdough loaves, sandwiches and other savoury items, including quiche and gougeres (cheese puffs).",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/soccer/where-would-a-league-teams-fit-in-the-english-pyramid-this-might-be-our-best-chance-to-find-out-20250711-p5me7u.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Where would A-League teams fit in the English pyramid? This might be our best chance to find out",
        "publish_date": "Mon, 14 Jul 2025 11:41:12 +1000",
        "category": "sports",
        "authors": [
            "Vince Rugari"
        ],
        "text": "This is, to the best of this masthead’s knowledge (and that of Australian soccer stats guru Andrew Howe; if he doesn’t know something, it’s not worth knowing), the first time a team that just been promoted from League One - England’s third tier - has toured Australia. Wrexham’s suddenly global appeal is the reason why it is happening; commercially and logistically, it just wouldn’t make sense for any other teams to come out here. Usually, it’s just Premier League clubs who turn up, cash in, have a little run around and sell some jerseys. Twice in recent memory - Leeds United (2019) and Wolverhampton Wanderers (2009) - have promoted teams from the Championship come here ahead of their return campaigns in the Premier League. But no lower. In that respect, there is some genuine intrigue about Wrexham AFC vs Sydney FC, a showdown that nobody would have dreamed of before the Reynolds-McElhenney revolution. The Sky Blues had a bit of a stinker in the A-League last season, somehow missing the top six despite boasting a star-studded squad. But most seasons, they would be considered one of the country’s top teams. So are how much better are Wrexham, who finished second in League One, than the Sky Blues? “It’s difficult,” Sydney FC’s Joe Lolley says.\n\nThere is probably no player better qualified to make a pre-match assessment than Lolley. His career began with Kidderminster Harriers in the Conference (now called the National League), or the fifth tier of English football. But he has also played in the Premier League with Huddersfield Town, in the Championship with them and Nottingham Forest, and, briefly, in League One when he was on loan at Scunthorpe United. That means he has taken the field in four of England’s top five divisions; though he has played cup matches against teams from League Two, the only one he hasn’t played in. He has also played against Wrexham - way back in 2013, three years before the first Deadpool movie came out, when Lolley was with Kidderminster, scoring twice in a 3-1 home win. Few in Australia are better placed to make this assessment than Joe Lolley. Credit: Getty Images Lolley reckons A-League teams compare favourably to those in the Championship and below when it comes to technique; like most Englishmen who come here to play, he was initially surprised by the extent of the local technical skill when he arrived. There are two major differences, he believes. First: physicality.\n\n“Everyone’s a bit of a beast in England when it comes physicality, defensively and off the ball and those sort of things,” he said. Not so much in the A-League. Secondly: squad depth, which is crucial in a gruelling 46-game season. When he was in the Championship, Lolley recalls most teams having about 20-odd players of approximately the same level, competing for starting spots, and the difference between the best and the worst in the division was not huge. The A-League, in contrast, is a lot more “spread out”, and the impact of losing two or three key players can be enormous. There are individuals in Australia who could arguably hold their own in the Premier League, he said, but then some who would probably be better suited to non-league. That’s not being harsh; that’s just the nature of A-League squads, most of which are backfilled by unproven scholarship players and journeymen, and a time when clubs are strapped for cash. But, hypothetically, where would the best teams he’s seen or been part of in Australia wash up in England, on the basis of quality in the starting XI? “Probably the lower end of the Championship,” Lolley says.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/western-australia/wa-news-live-wa-could-soon-get-two-extra-public-holidays-20250713-p5mele.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "WA news LIVE: WA could soon get two extra public holidays",
        "publish_date": "Mon, 14 Jul 2025 11:38:42 +1000",
        "category": "finance",
        "authors": [],
        "text": "West Australians could soon get two extra days off every year with the state government looking to overhaul the public holiday calendar, but businesses are already pushing back against the proposal.\n\nWA currently has 11 public holidays a year, among the lowest in the nation.\n\nThe state government is considering adding two more to bring the state into line with Victoria and the territories.\n\nOne would be officially recognising Easter Saturday as a holiday, the other would be a new day off in September.\n\nOther proposed changes to the calendar include moving WA Day, held in June, away from winter, and aligning existing public holidays with the rest of the country.\n\nWhile unions support the additional days off, the Chamber of Commerce and Industry says it will cost small business.\n\nConsultation on the dates is open for the next four weeks.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/property/news/vendor-who-bought-1-7m-brick-two-bedroom-sydney-house-sells-for-8-15m-20250714-p5mepf.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Vendor who bought $1.7m brick two-bedroom Sydney house sells for $8.15m",
        "publish_date": "Mon, 14 Jul 2025 11:35:26 +1000",
        "category": "finance",
        "authors": [
            "Carmen Forward"
        ],
        "text": "A two-bedroom house in Rhodes sold for $8.15 million at auction on Saturday.\n\nThe red-brick home was the last freestanding house on an apartment-lined stretch of road opposite Rhodes railway station, at 16 Walker Street.\n\nGuided between $6 million and $7 million, the 676.6-square-metre block was put on the market at $8 million before a crowd of 150 people and sold for $8.15 million.\n\nEight registered and five placed bids for the development site with potential as either 14 apartments, a boarding house, or a hotel or fitness centre.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/lifestyle/fashion/fashion-fault-the-wimbledon-rule-ignored-by-princess-catherine-20250714-p5mep9.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Fashion fault: The Wimbledon rule ignored by Princess Catherine",
        "publish_date": "Mon, 14 Jul 2025 11:30:20 +1000",
        "category": "lifestyle",
        "authors": [
            "Damien Woolnough"
        ],
        "text": "A controversial error at the Wimbledon men’s singles final by the usually faultless Princess Catherine could force the hand of fashion umpires.\n\nAt the women’s singles final Catherine’s cream dress from Self-Portrait, accessorised with a tote from Anya Hindmarch (not from the handbag designer’s collection for Woolworths supermarkets) was a flawless example of day dressing.\n\nThe streamlined silhouette was repeated at the men’s final in a cornflower blue dress by Roksanda, where Catherine presented the winner’s trophy to Jannik Sinner, but it was her choice of accessory that challenged tennis club etiquette.\n\nPrincess Catherine in her LK Bennett hat alongside Princess Charlotte at the Wimbledon men’s singles final. Credit: Getty Images\n\nCatherine arrived at Wimbledon clutching a wide-brimmed, ribbon-trimmed hat from LK Bennett. During the final, Catherine wore the hat when the sun hit the royal box, while waving a fan to combat the effects of the London heatwave.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/tennis/why-accuracy-not-power-is-the-missing-piece-in-demon-s-serve-20250708-p5mdja.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "The change de Minaur must make to take it up to tennis’ best",
        "publish_date": "Mon, 14 Jul 2025 11:30:00 +1000",
        "category": "sports",
        "authors": [
            "Marc Mcgowan"
        ],
        "text": "The five-time major quarter-finalist’s percentage of unreturned first serves for the tournament was only 34 per cent (73/212), which ranked equal-98th in the men’s draw. De Minaur tested Novak Djokovic in a high-quality fourth-round contest at Wimbledon. Credit: Getty Images Woodbridge spoke with a still-disappointed de Minaur in the hours after his four-set defeat to Djokovic. De Minaur’s serve was among the topics. “Alex was playing against a guy [Djokovic] who has adjusted his serve throughout his career and made it better – and that’s the example you have to look at,” Woodbridge said. “He’s got a great team of people around him, got all the technology, and now it’s time to go back and keep tweaking the technique.\n\nLoading “He’s got to rotate his shoulders, get his right shoulder back, and get more turn and torque. What he does is take the racquet head out to the right, and that opens him up, and he gets too front-on. “That [results in] lack of control and trajectory. The best players have great shoulder rotation, hold it in there, and then they uncoil.” Respected Australian coach Craig O’Shannessy made the same observation about de Minaur’s front-on service motion, and said fixing that was not about adding more power but instead would add much-needed serving accuracy. ATP Tour serving analysis last year of the top-20 men’s players found that de Minaur was by far the least accurate in that group, based on placement in the service box.\n\nThat continued at Wimbledon this year, where the Australian’s serves went to the body, rather than the corners, about five times more often than Djokovic and Jannik Sinner. O’Shannessy, who previously worked with Djokovic, said that was an accuracy issue for de Minaur and not a deliberate strategy. The key serve numbers for Alex de Minaur at Wimbledon. Credit: Wimbledon website / IBM “Alex is hitting it in the strike zone [too often] … he’s losing so many points because the opponent is ready for that,” O’Shannessy told this masthead. “From a placement perspective, Novak is serving only [about] three per cent at the body, and everything else is an even mix, so it makes it almost impossible to do a game plan against him.\n\n“Alex has to improve his technique. He has to stay sideways longer. The lower body’s got to rotate and stop, and the upper body then receives that energy and throws that into the arm. He’s over-rotating with [both], and then he’s too front-on.” Djokovic boasts remarkable serving accuracy in 2025 and at this Wimbledon. Almost half Djokovic’s serves on the deuce and advantage sides landed wide or down the T, compared to between two and four per cent to the body, according to IBM tracking data. De Minaur, on the other hand, had about 50 per cent down the T on each side at Wimbledon, but went wide on only 28 and 36 per cent of serves, respectively, on the advantage and deuce sides.\n\nLoading He was at 20 and 17 per cent to the body on the advantage and deuce sides, respectively. Interestingly, Carlos Alcaraz’s percentage of serves to the body this event is even higher than de Minaur. However, Woodbridge said de Minaur should not beat himself up about the Djokovic defeat or become too preoccupied with his serving deficiencies. “Alex is a legitimate top-10 player. The hardest part in this game is getting there, and then it’s even harder to stay there – but he’s proven he can do that,” Woodbridge said. “I said to him [post-match], ‘Don’t you dare tell me that you’re not good enough to be in this space. You’re 10 times better a tennis player than I ever was, and a lot of us were, so take your strengths, keep them, and keep working on those small bits that can make you better’.”",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/nrl/heated-clash-of-teammates-shows-how-walsh-has-saved-broncos-season-20250714-p5mep1.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Heated clash of teammates shows how Walsh has saved Broncos’ season",
        "publish_date": "Mon, 14 Jul 2025 11:17:42 +1000",
        "category": "sports",
        "authors": [
            "Nick Wright"
        ],
        "text": "One final roll of the dice before the half-time break ended in frustration for the Broncos on Sunday night, as Reece Walsh’s bullet pass wide for his centre Kotoni Staggs was spilled to the turf.\n\nThe reaction was immediate.\n\nWalsh was seen delivering Staggs a spray, with the latter offering choice words of his own in reply.\n\nHalfback Adam Reynolds admitted Brisbane had left “a few tries” out there in the opening half against Gold Coast Titans, before emerging 26-14 victors.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/property/news/woman-pays-2-25m-at-auction-for-melbourne-home-she-earlier-rejected-20250714-p5mepg.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Woman pays $2.25m at auction for Melbourne beachside home she earlier rejected",
        "publish_date": "Mon, 14 Jul 2025 11:13:54 +1000",
        "category": "finance",
        "authors": [
            "Shona Hendley"
        ],
        "text": "A local woman paid $2.25 million at auction on Saturday for a newly built, beachside family home in Parkdale with water views that she had earlier rejected due to its location on a sometimes busy road.\n\nThe home at 23 Parkers Road was listed with a price range of $1.9 million to $2.05 million and had no predetermined reserve, said Belle Property Mentone auctioneer and sales manager Simon Wendt.\n\n“The vendor didn’t give me a firm reserve before the auction, so when bidding hit $2,110,000, I went inside to ask him for approval to put it on the market, which he gave,” Wendt said.\n\nWhile not having a predetermined reserve isn’t very common, Wendt said the most unusual part of the auction was that the vendor arrived late.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/lifestyle/donald-trump-to-visit-buckingham-palace-20250714-p5mer6.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Donald Trump to visit Buckingham Palace",
        "publish_date": "Mon, 14 Jul 2025 10:48:58 +1000",
        "category": "lifestyle",
        "authors": [],
        "text": "Donald Trump to visit Buckingham Palace\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://uk.news.yahoo.com/woman-war-council-over-huge-112136148.html",
        "title": "Woman at war with council over huge dormer locals brand a \"monstrosity\"",
        "publish_date": "2025-07-13T11:21:36Z",
        "category": "finance",
        "authors": [],
        "text": "Rozia Hussain, 43, who renovated her 125-year-old Worcester home, must remove a large dormer after Worcester City Council deemed it a “monstrosity.” The extension, built without prior approval, was ruled visually intrusive and damaging to the property’s Victorian character and street scene. Neighbours had mixed views—some praised the renovation, while others called the dormer unfair and out of place. Mrs Hussain has three months to demolish or modify the dormer following an enforcement notice, or face legal action. She can appeal the decision by 17 July.",
        "source": "Yahoo"
    },
    {
        "url": "https://uk.news.yahoo.com/geri-halliwell-faces-1-million-091644727.html",
        "title": "Geri Halliwell faces £1 million book company debt after husband Christian is sacked from Red Bull",
        "publish_date": "2025-07-13T09:16:44Z",
        "category": "finance",
        "authors": [
            "Georgia Bell"
        ],
        "text": "Geri Horner has faced a tough year amidst her husband’s scandal and financial difficulties (PA Wire)\n\nGeri Horner is facing yet another setback after it was revealed that her book company has accumulated debts of £1 million.\n\nIt comes just days after her husband Christian Horner, 51, was sacked as boss of Red Bull following allegations of a workplace sexting scandal and a poor first half of the season for the Formula 1 team.\n\nNow Geri may be dealing with financial troubles of her own, as her company Falcon Queen Productions has been plunged into the red.\n\nAccording to The Mirror, last year Geri faced a deficit of £750,000, in comparison to £276,000 the previous year.\n\nThe paper reported that, however, “her main company, Wonderful Productions, earned £2.16m in the 12 months to August last year.”\n\nADVERTISEMENT\n\nWonderful Productions was set up by the star in 1997 at the height of the Spice Girls’ fame and pools earnings from her music career and other brand deals.\n\nHalliwell has been at the helm of Wonderful Productions since 1997, when the Spice Girls shot her to fame (PA Archive/Press Association Images)\n\nHer husband Christian’s departure from Red Bull marks the end of the longest reign in any Formula One team’s principal's role in the sport. Addressing the news, Red Bull said: “Red Bull has released Christian Horner from his operational duties with effect from today, Wednesday 9 July 2025, and has appointed Laurent Mekies as CEO of Red Bull Racing.”\n\nAfter the explosive texting scandal, Geri stood by her husband, who vehemently denied the claims. Amidst the controversy, Horner was told by his wife to make it “all go away”, which he successfully managed for 16 months.\n\nAfter a three-week investigation, the racing boss was cleared of any allegations, including coercive behaviour towards his colleague and internal investigations of wrongdoing.\n\nADVERTISEMENT\n\nOne day after the verdict was reached, screenshots emerged depicting conversations between Horner and a Red Bull employee. The file reportedly contained texts and images leaked to over 200 people in the sport, including owners Liberty Media, team bosses, and the press.\n\nHorner was cleared for a second time after the female employee appealed against the investigation findings, which were upheld.\n\nHorner has been at the centre of a workplace texting scandal which has rocked Formula One (REUTERS)\n\nIt is understood that an independent lawyer interviewed Horner for almost nine hours.\n\nNetflix’s hugely successful Formula One programme, Drive to Survive, depicted Horner’s immediate reaction to the bombshell news of the alleged texts.\n\n“The higher you rise, the sharper the knives,” he said.\n\n“I've reached the top of my game, and I never thought in a million years I'd have a challenge like this in my career,” Horner continued. “It's a crucial time of year, in a job that I do, you're the front face of the organisation.\n\nADVERTISEMENT\n\n“You can either hide away or you can get out there and face it.”\n\nHorner continued to lead Red Bull talent Max Verstappen to win a fourth successive world championship, despite falling short of the constructors’ title to competitors McLaren.\n\nRed Bull superstar Max Verstappen has led the team to four successive world championships (Getty Images)\n\nThat marked the beginning of the end of Red Bull’s dominance, with McLaren now 288 points ahead in the constructors’ standings for the 2025 season.\n\nSince 2005 when Horner joined the team, he successfully led them in two phases to world championships, with drivers Sebastian Vettel and Max Verstappen, wth eight drivers’ championships and six constructors’ championships.\n\nOliver Mintzlaff, CEO Corporate Projects and Investments, made a few comments thanking Christian Horner for his work over the last two decades.\n\nHe said: “We would like to thank Christian Horner for his exceptional work over the last 20 years.\n\nADVERTISEMENT\n\n“With his tireless commitment, experience, expertise, and innovative thinking, he has been instrumental in establishing Red Bull Racing as one of the most successful and attractive teams in Formula One.\n\n“Thank you for everything, Christian, and you will forever remain an important part of our team history.”\n\nAmidst the controversy, Geri asked her husband to “make it all go away” (Getty Images)\n\nHorner will now be replaced as CEO of Red Bull Racing by Laurent Mekies, followed by the promotion of Alan Permane from current Racing Director to Team Principal.\n\nMekies has been working in F1 since 2001. Speaking of his journey, he said: “The last year and a half has been an absolute privilege to lead the team with Peter,”\n\n“It has been an amazing adventure to contribute to the birth of Racing Bulls together with all our talented people. The spirit of the whole team is incredible, and I strongly believe that this is just the beginning.\n\n“Alan is the perfect man to take over now and continue our path. He knows the team inside out and has always been an important pillar of our early successes.”\n\nAlan Permane added: “I feel very honoured to take on the role as Team Principal and would like to thank Oliver and Helmut for the trust they have shown in me.\n\n“I am looking forward to working with Peter to continue the good work that both him and Laurent have done in taking this team forward. This is a new challenge for me, but I know that I can count on the support of everyone within them.”",
        "source": "Yahoo"
    },
    {
        "url": "https://uk.news.yahoo.com/farage-beats-starmer-every-respect-165223903.html",
        "title": "Farage beats Starmer in every respect except one, poll finds",
        "publish_date": "2025-07-13T16:52:23Z",
        "category": "finance",
        "authors": [
            "Genevieve Holl-Allen"
        ],
        "text": "Farage beats Starmer in every respect except one, poll finds\n\nNigel Farage is more in touch with ordinary people and pays greater attention to detail, according to the Ipsos survey - Geoff Pugh for The Telegraph\n\nVoters believe Nigel Farage, the Reform UK leader, is better than Sir Keir Starmer in almost every respect but is less honest than him, according to a poll.\n\nMr Farage is seen as being more in touch with ordinary people, paying greater attention to detail and being a stronger leader than the Prime Minister.\n\nA new survey by Ipsos asked respondents whether they felt certain positive characteristics applied to Sir Keir, Mr Farage or Kemi Badenoch, the Tory leader.\n\nThe Reform leader came out on top in every question, apart from when voters had to say which of the leaders they believed was an “honest person”.\n\nADVERTISEMENT\n\nIt comes as Reform continues to surge in the polls, with Ipsos finding that the party is ahead of Labour and the Conservatives.\n\nReform exceeded expectations at the local elections in May, when it gained over 600 councillors and won the parliamentary seat of Runcorn and Helsby from Labour.\n\nMore than 50 per cent of voters said that Mr Farage had “a lot of personality”, compared to 21 per cent saying the same of the Prime Minister.\n\nThirty seven per cent said they felt Mr Farage was a capable leader, and 41 per cent said they would describe him as a strong leader, compared to 31 per cent and 26 per cent for Sir Keir.\n\nBut a third of respondents said that the Prime Minister was honest, compared to 29 per cent for Mr Farage.\n\nSir Keir, pictured playing football in north London on Sunday, cannot seem to score with voters - Jeremy Selwyn\n\nSir Keir suffered the biggest fall in approval rating after winning an election of any prime minister in the modern era, despite his landslide 174-seat majority.\n\nADVERTISEMENT\n\nDespite the vast number of Labour MPs, ministers have struggled to pass key legislation because of the discontent on the backbenches.\n\nThe largest rebellion of the Prime Minister’s career meant that he was forced to back down on several elements of his welfare reforms, eradicating billions in planned savings.\n\nOther policies that have attracted widespread criticism, include the scrapping of the universal winter fuel payment for pensioners, which Rachel Reeves, the Chancellor, has had to partly reverse.\n\nThe new polling also found that just a quarter of people believe that Ms Reeves will still be Chancellor by the next general election.\n\nThe number of voters who think that Sir Keir understands the problems facing Britain has fallen by 18 per cent since the general election last year.\n\nThe latest poll also found that voters judged Mr Farage to be “good in a crisis” at 27 per cent, compared to 26 per cent for Sir Keir. Mrs Badenoch received just 18 per cent.",
        "source": "Yahoo"
    },
    {
        "url": "https://uk.news.yahoo.com/prince-george-beats-heat-royal-181256420.html",
        "title": "Prince George beats the heat in Royal Box at Wimbledon final",
        "publish_date": "2025-07-13T18:12:56Z",
        "category": "sports",
        "authors": [
            "Joe Hadden"
        ],
        "text": "Prince George beats the heat in Royal Box at Wimbledon final\n\nPrince George was spotted using a folding hand fan to keep cool as temperatures soared during the men’s singles final at Wimbledon.\n\nThe young royal sat in the Royal Box on Centre Court alongside his father, the Prince of Wales, who wore a sharp double-breasted navy suit and polka-dot tie.\n\nGeorge looked smart in a dark jacket, pale blue shirt and striped tie as he watched defending champion Carlos Alcaraz take on Jannik Sinner.\n\nThe Prince of Wales and Prince George in the Royal Box on day 14 of the 2025 Wimbledon Championships at the All England Lawn Tennis and Croquet Club, London (Adam Davy/PA)\n\nWith temperatures reaching 27C in south-west London, George was seen opening and fanning himself with a dark wood-slatted hand fan and sipping bottled water with his father during a break in play.\n\nADVERTISEMENT\n\nHis sister, Princess Charlotte, also used one of the fans to cool herself in the afternoon sun.\n\nThe fans, which featured a traditional folding design with brown wooden ribs and paper leaves, were widely used by Royal Box guests as they tried to stay comfortable in the heat.\n\nThe Wales family arrived ahead of the final and paused to greet 11-year-old Ambrose Caldecott – the young cancer patient chosen to perform the ceremonial coin toss.\n\nKate was heard telling him: “Good luck today, we’ll be cheering you on.”\n\nPrince George meets Wimbledon ball boy Dennis (Andrew Matthews/PA)\n\nThe Princess of Wales wore a royal blue dress, while Charlotte opted for a beige summer dress.\n\nThey were joined in the box by a host of celebrities including Keira Knightley, Andrew Scott, Paul Mescal, Nicole Kidman and Dame Anna Wintour.\n\nMany guests chose lightweight tailoring, sunglasses and handheld fans to deal with the hot weather.\n\nADVERTISEMENT\n\nThe appearance marked another high-profile Wimbledon outing for Prince George, who also attended the men’s final in 2022 and 2023.\n\nThe family looked relaxed as they took in the final match of the fortnight under clear skies.",
        "source": "Yahoo"
    },
    {
        "url": "https://uk.news.yahoo.com/brexit-most-people-france-germany-115414821.html",
        "title": "Brexit: Most people in France, Germany, Italy and Spain want UK to rejoin EU, poll finds – but on new terms",
        "publish_date": "2025-07-13T15:51:53Z",
        "category": "finance",
        "authors": [
            "Kate Devlin"
        ],
        "text": "Brexit: Most people in France, Germany, Italy and Spain want UK to rejoin EU, poll finds – but on new terms\n\nMost people in the four largest countries in the European Union would welcome the UK back into the bloc, a new poll has found – but not on the same terms it had before.\n\nAt the same time most Britons are in favour of rejoining the EU, the YouGov survey of six western European nations found, but only if they can keep the opt-outs the UK previously had, such as remaining outside the Schengen zone and keeping its own currency.\n\nThe results come just days after Sir Keir Starmer welcomed French president Emmanuel Macron to the UK for the first state visit from an EU leader since Brexit.\n\nThe Labour leader has said he wants to fix Britain’s damaged relationship with the European Union for the benefit of “generations to come”.\n\nADVERTISEMENT\n\nNow, 10 years after MPs voted to hold the referendum that led to Britain leaving the EU, the poll found that at least half of people asked in France, Germany Italy and Spain, supported the UK being allowed to rejoin, a range that spanned from 51 per cent support in Italy to 63 per cent in Germany.\n\nKeir Starmer and Emmanuel Macron in London this week (PA Wire)\n\nBut the pollster said the results revealed a “public opinion impasse”.\n\nAsked if Britain should be allowed to return on the same conditions as when it left, support fell.\n\nJust one in five across the four countries, from 19 per cent in Italy and France to 21 per cent in Spain and 22 per cent in Germany, agreed, with more than half, 58 to 62 per cent, saying the UK must be part of all of the EU’s main policy areas.\n\nIn the UK, 54 per cent supported rejoining the EU, but that number fell to 36 per cent if it meant giving up previous opt-outs. If that was the case, 45 per cent said they opposed returning to the EU.\n\nADVERTISEMENT\n\nThe final European country polled, Denmark, one of three member states to hold significant opt-outs itself, was more enthusiastic about allowing UK to keep its previous opt-outs, a stance 43 per cent of people said they backed.\n\nThe official Office for Budget Responsibility estimates that the size of the UK economy will be four per cent smaller over the long term than it would have been without Brexit.\n\nThe Independent also revealed earlier this year that Brexit has created a “mind-blowing” nearly two billion extra pieces of paperwork for businesses – enough to wrap around the world 15 times.",
        "source": "Yahoo"
    },
    {
        "url": "https://uk.news.yahoo.com/cruel-owner-abandons-dying-dog-164718577.html",
        "title": "Cruel owner abandons dying dog",
        "publish_date": "2025-07-13T16:47:18Z",
        "category": "finance",
        "authors": [
            "Lois Mccarthy"
        ],
        "text": "\n\n\n\nA sickly dog abandoned by her owners has died in foster care a day after being found as a stray. Hope Rescue, based in Llanharan, was devastated when the Staffordshire Bull Terrier, who passed away just 24 hours after being placed in a foster home.\n\nKiwi, a frail and elderly dog, arrived at Hope Rescue earlier this week, visibly distressed and in pain from arthritis. After a thorough veterinary check, the rescue team came to the decision to place a \"distressed\" Kiwi into one of their foster home; offering her a chance to rest away from the harsh environment of the kennel.\n\nJust one day after entering foster care, Kiwi passed away. Read the biggest stories in Wales first by signing up to our daily newsletter here\n\nADVERTISEMENT\n\nREAD MORE: People left up to their necks at Welsh beach as tide surges in\n\nREAD MORE: I'd just had a baby and life seemed perfect – then I got the worst possible news\n\nHope Rescue have now shared Kiwi's story on social media, emphasising that the situation is \"not okay\". They said she had been left at the pound deliberately, despite her clear need for medical care.\n\nHope Rescue Head of Operations Sara Rosser issued a statement to the organisation's website. \"Abandoning your poorly, elderly dog in the pound is not okay. Abandoning your dog knowing it was likely ill is even less okay,\" she said.\n\nSara said the incident has left staff and volunteers feeling \"upset\" and \"heartbroken\". She added: \"We would ask the public that if you are struggling for any reason, that you reach out to your nearest rescue centre for advice. Abandoning your dog when they need you most is not the answer.\"\n\nADVERTISEMENT\n\nDespite the devastating loss, the team at Hope Rescue expressed their gratitude to Kiwi's foster carer, who provided her with love and comfort in her final hours.\n\n\"We're so grateful to our foster carer for giving her comfort and love at the end, ensuring that she didn’t pass away in kennels.,\" Sara continued.\n\n\"We're proud of our ethos that no dog gets left behind in the seven local authorities we work with across South Wales. We take every dog, irrespective of age, breed or health.\"",
        "source": "Yahoo"
    },
    {
        "url": "https://uk.news.yahoo.com/torvill-dean-bow-high-skating-091813787.html",
        "title": "Torvill and Dean ‘bow out on a high’ skating to Bolero in final performance",
        "publish_date": "2025-07-13T10:02:04Z",
        "category": "sports",
        "authors": [
            "Hannah Roberts",
            "Pa Entertainment Reporter"
        ],
        "text": "Torvill and Dean ‘bow out on a high’ skating to Bolero in final performance\n\nChristopher Dean has said it was “wonderful” to “bow out on a high” in his final performance with ice dancing partner Jayne Torvill.\n\nThe duo, who wrote their names into British sporting history at the 1984 Winter Games, announced their retirement from skating together in 2024, 40 years on from their Olympic gold success.\n\nYesterday’s final performance of Bolero at @nottinghamarena will forever be in our hearts 💜 #OurLastDance pic.twitter.com/R7e8Cvlroh — Jayne and Chris (@torvillanddean) July 13, 2025\n\nIn April they embarked on the UK leg of their farewell tour, Torvill And Dean: Our Last Dance, which culminated with four performances in their home town of Nottingham.\n\nADVERTISEMENT\n\nFollowing their final performance together, Dean, 66, said: “The performance went well and the audience were amazing and so, for us, to be able to bow out on a high like that was wonderful.”\n\nAsked if it had been emotional, Dean said: “These last four performances here in Nottingham, the early ones were quite emotional and I think I sort of got that out of me, and tonight, it was a high.\n\n“We enjoyed it so much. The skating was good from our point of view, but the audience were phenomenal. They were the best audience ever.”\n\nOlympic gold medal winners Jayne Torvill and Christopher Dean at the very end of their Bolero performance at their last public skate of their Our Last Dance UK tour (Ben Birchall/PA)\n\nTorvill, 67, said: “I think we’ll miss it.\n\n“When you’ve done all these shows like this, and you’re suddenly home, not doing anything, you miss that adrenaline rush and you miss the excitement of being on the ice, whether it’s a practice session or a performance.”\n\nTorvill promised they would be working on other projects but said they will not be skating on the ice together.\n\nADVERTISEMENT\n\nThe duo secured an Olympic gold in 1984 with their ice dance to Ravel’s Bolero at the Zetra Olympic Hall in Sarajevo.\n\nOlympic gold medal winners Jayne Torvill and Christopher Dean ahead of their last public skate (Ben Birchall/PA)\n\nThey also had success at the World, European and British Championships and returned to the Winter Games at Lillehammer in Norway in 1994 where they won bronze.\n\nAfter they bowed out from competitive skating they branched out into touring, coaching and choreographing before becoming the faces of celebrity competition show Dancing On Ice, which ran from 2006 until 2014.\n\nWhen the show was revived in 2018 they became head judges until earlier this year when ITV announced it would be rested.\n\nTheir farewell tour of London, Belfast, Sheffield, Birmingham, Newcastle, Manchester, Liverpool and Glasgow included a team of professional figure skaters, some of whom have featured on Dancing On Ice.",
        "source": "Yahoo"
    },
    {
        "url": "https://uk.news.yahoo.com/veteran-broadcaster-says-first-reaction-084842774.html",
        "title": "Veteran broadcaster says first reaction to Live Aid was ‘real anger’",
        "publish_date": "2025-07-13T08:48:42Z",
        "category": "entertainment",
        "authors": [
            "Hannah Roberts"
        ],
        "text": "Veteran journalist Michael Buerk, who reported on the Ethiopian famine in 1984, revealed his initial reaction to the Live Aid concerts, which raised funds for the crisis, “was real anger”.\n\nThe iconic event, organised by musicians Bob Geldof and Midge Ure, is marking its 40th anniversary this year.\n\nHeld at London’s Wembley Stadium and John F Kennedy Stadium in the US, the concerts raised millions of pounds, but also faced criticism for its portrayal of Africa, with Geldof rejecting the idea that he is a “white saviour” due to his charity work.\n\nBuerk, 79, a veteran broadcaster and former presenter on the BBC’s Ten O’Clock News, now known as BBC News At Ten, was instrumental in bringing the shocking plight of famine-hit Ethiopia to the world in 1984 with his reports.\n\nADVERTISEMENT\n\n“My first reaction (to Live Aid) was real anger that I thought superficial, grandstanding pop singers were riding on the back of these people whom I felt very protective of,” he told Greatest Hits Radio.\n\nMichael Buerk reported on the famine in Ethiopia in the 1980s (PA)\n\n“I didn’t watch it and in fact on the afternoon of Live Aid I was in a black township just to the east of Johannesburg being tear gassed… also of course South Africa was one of the very, very few countries that didn’t show it.”\n\nSpeaking about the famine in Ethiopia, he added: “I’d never seen anything like this, there was a lot of drought and a lot of hunger in South Africa in the 1980s (but) what we hadn’t seen was famine, death at that kind of scale before…\n\n“I was very concerned when I got back to Nairobi about how to tell the story because I was there I was not just seeing it and hearing it but smelling it; and I wondered what the reaction would be for people who would be sitting and watching it in the comfort of their own homes, cup of tea, glass of beer or something and it’s just on in two dimensions in the corner of the living room.”\n\nFreddie Mercury, of the rock-pop band Queen, performing on stage during the Live Aid concert (PA)\n\nAsked how he feels about Live Aid now, he said: “I think it was extraordinary really, I think Geldof, the personality, the intelligence, the focus, the foul-mouthedness; just an extraordinary person. It was a moment in time, wasn’t it?”\n\nADVERTISEMENT\n\nGreatest Hits Radio is recreating the 1985 Live Aid broadcast in its entirety in a 10-hour special, hosted by Simon Mayo, featuring all of the original live performances from the likes of David Bowie, The Who and Sir Paul McCartney.\n\nListen to Live Aid Relived from midday Sunday on Greatest Hits Radio.",
        "source": "Yahoo"
    },
    {
        "url": "https://uk.news.yahoo.com/best-courtside-style-wimbledon-2025-102102551.html",
        "title": "The best style from Wimbledon 2025: from Paul Mescal to the Princess of Wales",
        "publish_date": "2025-07-13T16:07:05Z",
        "category": "sports",
        "authors": [
            "Maddy Mussen",
            "Hayley Spencer"
        ],
        "text": "The best style from Wimbledon 2025: from Paul Mescal to the Princess of Wales\n\nThe Prince and Princess of Wales arrive with Princess Charlotte on day fourteen of the 2025 Wimbledon Championships at the All England Lawn Tennis and Croquet Club (Andrew Matthews/PA) (PA Wire)\n\nWimbledon might not be the Oscars, fashion week or the Met Gala, but it does have its own sartorial prowess. With smart dressing advised and countless celebs spotted in the stands each day, it all makes for a rather stylish affair.\n\nThat’s to say nothing of the players, who are increasingly fashion-aligned themselves. Sport and style have never been such close allies, and tennis is one of the many factions to have benefited from sports’ fashionable facelift.\n\nThe final weekend of the sporting event has seen its most anticipated guest arrive — the Princess of Wales, who has attended two days in a row.\n\nAs a patron of the All England Lawn Tennis Club it’s Kate Middleton’s job to present the trophies to the winners.\n\nThe Princess of Wales meets Temi Johnson (PA Wire)\n\nToday she is joined by her two eldest children, Princess Charlotte and Prince George, as well as Prince William. Ahead of the men’s final event she greeted the men’s doubles winners, Julian Cash and Lloyd Glasspool. She wore a tailored royal blue dress with a corsage on the left shoulder.\n\nADVERTISEMENT\n\nAlso upping the ante on the A-list power of the final day of the event were actor Keira Knightley and her husband James Righton, as well as Paul Mescal, who sat in the Royal Box with his All of Us Strangers co-star Andrew Scott.\n\n(Adam Davy/PA Wire)\n\nOn Saturday, when the Princess presented Iga Swiatek with her trophy, she had chosen a classic ivory look for the occasion by Self-Portrait. The same designer that she wore to the event in 2023.\n\nThe modest, ankle-grazing design featured a structured blazer top with safari detailing, and a plisse skirt flowing out underneath. She accessorised with simple ivory pumps and the Anya Hindmarch Neeson Small Square Tote in white.\n\nThe Princess of Wales (PA) (PA Wire)\n\nAlso in attendance for the penultimate day of the tennis tournament were Cara Delevingne, director Greta Gerwig and actor Luke Evans.\n\nGreta Gerwig and Sir Mo Farah in the Royal Box at Wimbledon 2025 (PA)\n\nWhile day eleven saw guests like Daisy Lowe, Jourdan Dunn and Jenna Coleman contend with the thirty-degree London heat, with some sunburnt Wimbledon attendees giving a new meaning to strawberries and cream.\n\nJourdan Dunn at Wimbledon 2025 (Getty Images for Pimm's)\n\nColeman looked cool and collected in her white t-shirt and silk slip dress ensemble, paired with blue crocodile skin shoes by Russell and Bromley, while Dunn was radiant in a cream maxi dress (Pimms in hand, obviously).\n\nADVERTISEMENT\n\nPaddington and Black Doves actor Ben Whishaw was also looking very prim and proper, somehow surviving the sunshine while wearing a full suit at Centre Court.\n\nBen Whishaw at Wimbledon 2025 (AP)\n\nDay 10 was all about the boys, with actors Hugh Grant and Charlie Hunnam in attendance. Grant looked positively Prime Ministerial in his trademark dark suit, though all political comparisons ceased the moment he donned his massive aviator sunglasses. In fact, it even got a bit secret service.\n\nHugh Grant at Wimbledon 2025 day nine (Getty Images)\n\nHunnam, meanwhile, was on quite the opposite vibe to Grant’s Men in Black cosplay, donning a powder blue suit jacket with a matching shirt, white trousers and a paisley tie. Quite the departure from his Sons of Anarchy alter-ego.\n\nCharlie Hunnam at Wimbledon 2025 day nine (Getty Images for AELTC)\n\nA welcome dose of femininity was brought to the stands by Emily Atack, who wore a pleated pale yellow skirt and a black top with a high-low hemline and gathered shoulders. The Rivals star could be seen enjoying a Pimms outside of Centre Court ahead of taking her seat for the tennis.\n\nEmily Atack at Wimbledon 2025 day nine (Getty Images for Pimm's)\n\nDay nine saw a wealth of famous faces dotted around the stands, from Sir Ian McKellen to Jodie Foster and Sienna Miller, who has naturally topped all the best-dressed lists. The actress donned a puff-sleeved floral mini dress for the occasion, finished with black sunglasses and a dark brown Bottega Veneta handbag. She was joined by her partner Oli Green, who wore a slim-fit navy suit and Ray Bans.\n\nSienna Miller and Oli Green (AP)\n\nAlso present on day nine was England right winger Bukayo Saka, who ditched his football kit for a sand-coloured shirt, cream trousers and suede boat shoes. Saka later linked up with Spanish tennis star (and Wimbledon favourite) Carlos Alcaraz and fellow Arsenal player Jurrien Timber.\n\nADVERTISEMENT\n\nTimber was also doing his bit for the fashionable footballer agenda, wearing a long-sleeved cream Miu Miu polo shirt with black trousers and blue suede boat shoes. Posting on his Instagram, Saka said: “Pleasure to meet you. Good luck with the rest of the tournament.”\n\nBukayo Saka, Carlos Alcaraz and Jurrien Timber at Wimbledon 2025 day eight (Getty Images for AELTC)\n\nOn day eight, the show was stolen by Trinity Rodman, the American soccer player, daughter of Dennis Rodman and girlfriend of US tennis player Ben Shelton. Rodman wore a cerulean silk two-piece with an asymmetric neckline which she accessorised with dainty gold jewellery and a sleek low bun.\n\nTrinity Rodman and Emma Shelton, Ben Shelton’s sister, at Wimbledon 2024 day seven (Getty Images)\n\nElsewhere, Self Esteem’s low-key day seven fit was the complete opposite end of the spectrum: a lesson in London cool girl dressing, comprised of a loose-fitting shirt, structured grey skirt and split-toe Mary Jane trainers.\n\nGuests on day five and six over the weekend were a vision in a pared-back palette of cream and tennis white.\n\nMonica Barbaro and Andrew Garfield at Wimbledon 2025 (GC Images)\n\nAndrew Garfield confirmed his romance with Monica Barbaro as the pair arrived hand-in-hand wearing matching outfits. He wore white tailoring, with a sweater shrugged around his shoulders, while she wore a structured white slip dress. Also in attendance were The Bear’s Ebon Moss-Bachrach and Poppy Delevingne, who wore Ralph Lauren (what else?).\n\nADVERTISEMENT\n\nEarlier in the week, Haringey-born singer Olivia Dean and Manchester United footballer Kobbie Mainoo repped colour of the season, butter yellow. Dean wore an off-shoulder midi dress by Aym Studio, paired with Apollo midi hoop earrings by Daisy London.\n\nOlivia Dean attends Wimbledon 2025 (Getty Images for AELTC)\n\nDay four of Wimbledon was graced with another famous face from the football world, with Newcastle and England star Anthony Gordon looking sharp in the stands, wearing a cream blazer with a powder blue shirt, navy trousers and a navy tie.\n\nAnthony Gordon on Wimbledon 2025 day four (Getty Images for AELTC)\n\nPeriod drama royalty has been present on day four and five. On day four, Downtown Abbey star Jim Carter and his daughter Bessie Carter, who plays Prudence Featherington in Bridgerton, spent some father-daughter time together watching the tennis. India Amarteifio, who plays a young Queen Charlotte in Bridgerton, also made an appearance on day five wearing a plisse polka dot dress.\n\nIndia Amarteifio on Wimbledon 2025 day five (Getty Images for AELTC)\n\nOver in the Royal Box on day three, recent Glastonbury headliner Olivia Rodrigo was enjoying the tennis alongside her boyfriend, the English actor Louis Partridge. The pair were snapped chatting to Tom Daley and sitting side by side with John Cena, in a real melange of celebrity faces.\n\nLouis Partridge, Olivia Rodrigo and Tom Daley at Wimbledon 2025 day three (Mike Egerton/PA Wire)\n\nRodrigo wore a red and white button-down gingham dress with tortoiseshell sunglasses, while Partridge sported a navy blazer, Prada tie and sky blue striped shirt.\n\nNearby were Nick Jonas and Priyanka Chopra. Chopra went full Wimbledon in a crisp white halter neck dress with strappy heeled sandals, while Jonas was equally preppy in his navy blazer, beige suit trousers and contrast colour shirt, brought together by a black tie.\n\nPriyanka Chopra and Nick Jonas attend Wimbledon 2025 day three (Getty Images for AELTC)\n\nLooking radiant was Leslie Mann, who arrived alongside her husband, director Judd Apatow, as well as Dave Grohl and his wife Jordyn Bloom. The actress, who is the mother of Maude and Iris Apatow (the best friend of Olivia Rodrigo), wore a cream blazer with a long lace skirt and white pumps.\n\nLeslie Mann attends Wimbledon 2025 day three (Ben Whitley/PA Wire)\n\nOn day two, the sartorial standout was undoubtedly Aussie actress Cate Blanchett, who arrived wearing a Giorgio Armani metallic suit reminiscent of her legendary Ocean’s Eight suiting. She rubbed shoulders with unlikely bestie (and fellow Australian) Rebel Wilson, with the two spotted making each other laugh in the stands.\n\nRebel Wilson and Cate Blanchett at Wimbledon 2025 day two (Getty Images)\n\nOn day one, Manchester United legend and freshly knighted Sir David Beckham looked dapper in a cream double-breasted suit by Hugo Boss. A waffle knit brown tie and powder blue shirt brought the look together, with aviator sunglasses and a mysterious hand bandage to top it all off. The former England captain later confirmed this was due to a surgical screw needing to be removed from his hand.\n\nBeckham’s appearance came amid a reported ongoing family feud, but the former footballer showed no whiff of concern as he enjoyed watching the tennis alongside former England manager Gareth Southgate.\n\nDavid Beckham at Wimbledon 2025 day one (Getty Images)\n\nBritish actor Eddie Redmayne was also in attendance in cream tailoring, accompanied by his wife Hannah Bagshawe, who wore a crimson button-down polka dot dress cinched at the waist with a double belt. It was an impressive appearance from Redmayne on more than just the fashion front, given that the actor hot-footed it back from Glastonbury Festival in time to make the Monday matches, which is no mean feat.\n\nHannah Bagshawe and Eddie Redmayne on Wimbledon 2025 day one (Getty Images)\n\nThen there was Barbie star Simu Liu and his wife Allison Hsu, who looked chic in their subtle white and grey looks.\n\nAll the best Wimbledon 2025 looks\n\nThe Prince and Princess of Wales at Wimbledon 2025 (PA Wire)\n\n(AP)\n\nCara Delevingne, wearing Ralph Lauren, attends day thirteen of the Wimbledon 2025 (Karwai Tang/Getty Images for Ralph Lauren))\n\nThe Princess of Wales with AELTC chairwoman Debbie Jevans (Jordan Pettitt/PA) (PA Wire)\n\nGreta Gerwig and Sir Mo Farah in the Royal Box (PA)\n\nJourdan Dunn at Wimbledon 2025 day eleven (Getty Images for Pimm's)\n\nJenna Coleman at Wimbledon 2025 day eleven (Getty Images for AELTC)\n\nMunya Chawawa at Wimbledon 2025 day eleven (Getty Images for AELTC)\n\nEllie Goulding at Wimbledon 2025 day eleven (Getty Images)\n\nCharlie Hunnam at Wimbledon 2025 day ten (Getty Images for AELTC)\n\nHugh Grant at Wimbledon 2025 day ten (Getty Images)\n\nSelf Esteem at Wimbledon 2025 day eight (Getty Images for AELTC)\n\nTrinity Rodman and Emma Shelton at Wimbledon 2025 day eight (Getty Images)\n\nPoppy Delevingne wearing Ralph Lauren at Wimbledon 2025 (Getty Images for Ralph Lauren)\n\nMonica Barbaro and Andrew Garfield at Wimbledon 2025 (GC Images)\n\nOlivia Dean at Wimbledon 2025 day five (Getty Images for AELTC)\n\nKobbie Mainoo at Wimbledon 2025 day five (Getty Images)\n\nIndia Amarteifio on Wimbledon 2025 day five (Getty Images for AELTC)\n\n(Getty Images for Emirates)\n\nOlivia Rodrigo with Louis Partridge and Tom Daley at Wimbledon 2025 day three (Mike Egerton/PA Wire)\n\nJohn Cena, Shay Shariatzadeh, Priyanka Chopra and Nick Jonas at Wimbledon 2025 day three (Getty Images for AELTC)\n\nTom Daley at Wimbledon 2025 day three (Ben Whitley/PA Wire)\n\nJannik Sinner at Wimbledon 2025 day two (AFP via Getty Images)\n\nSimu Liu and Allison Hsu at Wimbledon 2025 day one (Getty Images for AELTC)\n\nPrincess Beatrice of York at Wimbledon 2025 day one (Getty Images)\n\nKatie Boulter at Wimbledon 2025 day one (Getty Images)\n\nJason Isaacs at Wimbledon 2025 day one (Getty Images)\n\nGareth Southgate and David Beckham at Wimbledon 2025 day one (AFP via Getty Images)\n\nAngela Scanlon at Wimbledon 2025 day one (Getty Images)\n\nRussell Crowe at Wimbledon 2025 day two (AFP via Getty Images)\n\nCoco Gauff at Wimbledon 2025 day two (Getty Images)",
        "source": "Yahoo"
    },
    {
        "url": "https://uk.news.yahoo.com/lorraine-kelly-signs-major-deal-115952641.html",
        "title": "Lorraine Kelly signs major deal with Channel 4 for big-budget travel series after her morning show hit by ITV cuts",
        "publish_date": "2025-07-13T11:59:52Z",
        "category": "finance",
        "authors": [
            "Shaun Wilson"
        ],
        "text": "Lorraine Kelly signs major deal with Channel 4 for big-budget travel series after her morning show hit by ITV cuts\n\nTV star Lorraine Kelly has signed up with Channel 4 to front a travel programme, just weeks after it was announced her ITV breakfast show faces severe cuts.\n\nLorraine, 65, who has been a stalwart of ITV since 1984, flew to Norway last month for the secret project and is said to \"relish\" broadening her horizons.\n\nHer major deal with Channel 4 follows swinging cuts by ITV to her eponymous show, which was reduced from year-round hour-long episodes to just 30 weeks of 30 minutes.\n\nOther cost-saving measures saw the production role of Head of Lorraine axed by ITV, The Sun on Sunday reports.\n\nA source said: “Channel 4 were delighted to have Lorraine on board. It was exciting for Lorraine to do something different and be on location again.\n\nADVERTISEMENT\n\n“Despite the apparent slight in the ITV daytime shake-up, Lorraine’s loyal fanbase isn’t to be underestimated and they will follow her wherever she goes.\n\n\"She’s survived in this business a long time and she’s a master at rolling with the punches.\"\n\nLorraine already has a strong relationship with Channel 4, and regularly appears as a guest on comedy panel show The Last Leg.\n\nIn an interview with TV chef Tom Kerridge on his podcast Proper Tasty, Lorraine said: “Forty years in TV last year was incredible. I got a Bafta. ‘Here’s a Bafta for being alive’.\n\n“I thought, ‘Hang on a minute, I’m not done yet’.\n\n“I think now I can be a lot cheekier.\n\n“I’ve always been a bit naughty. Not so much in the morning but if I do a wee show on Channel 4 or The Last Leg, or something like that, you can be unleashed. I quite like that.”\n\nADVERTISEMENT\n\nCrew on Lorraine's ITV show are said to have been left feeling \"gutted\" by the cuts to the \"successful rating-busting\" programme, and her two producers now report to This Morning bosses.\n\nThe source added that the shake-up \"casts further doubt\" on the future of her ITV show when her contract expires next year.\n\n\"She’s opening her eyes up to the many options available to her,” they said.",
        "source": "Yahoo"
    },
    {
        "url": "https://uk.news.yahoo.com/nhs-doctors-salary-compare-other-countries-161749035.html",
        "title": "Here's how much NHS doctors get paid compared to other countries",
        "publish_date": "2025-07-11T16:17:49Z",
        "category": "finance",
        "authors": [],
        "text": "The BMA has called another strike amid its pay dispute with the government. But how does UK pay compare to elsewhere?\n\nHealth secretary Wes Streeting is set to meet British Medical Association (BMA) leaders in an effort to avoid planned strike action, it has been reported.\n\nEarlier this week, the union announced resident doctors – formerly known as junior doctors – in England would strike for five consecutive days from 7am on 25 July.\n\nThe BBC reported discussions will take place next week, with the BMA telling the broadcaster industrial action would only be called off if it receives an offer it can put to its members.\n\nThe union has said resident doctors need a pay uplift of 29.2% to reverse “pay erosion” since 2008/09 - and that this is non-negotiable. This figure is based on Retail Prices Index (RPI) inflation, the measure of average changes in the price of goods and services used by most households.\n\nADVERTISEMENT\n\nStreeting is reportedly sympathetic to improving working conditions for doctors, but will not budge on salaries.\n\nSo, amid the row, how much do resident doctors get paid compared to in other countries?\n\nHow much do NHS doctors get paid?\n\nAs of February, there were 77,287 resident doctors (those in the process of training toward a speciality) working for NHS England.\n\nResident doctors are supervised by a more senior doctor, but as they gain experience some may also begin to supervise their more junior colleagues. Essentially, resident doctors have different levels of seniority and pay.\n\nIn terms of basic pay, resident doctors are set to earn between £38,831 and £73,992 a year for a 40-hour week, as recommended by the pay review body in May. The new rates will be a rise of up to 6% on last year.\n\nAnd, with resident doctors able to earn more if they work extra or unsocial hours, the below chart shows average earnings depending on level:\n\nResident doctor earnings in 2024/25. (Full Fact/PA)\n\nHow much do they get paid abroad?\n\nHere are reported resident doctor salary ranges in some of the most popular countries for UK doctors (of all levels of seniority) to move to, as per a survey in a General Medical Council (GMC) report published in April last year.\n\nAustralia (21% of leavers)\n\nAccording to recruitment agency Medrecruit, resident doctors are paid between £29,000 and £49,000.\n\nNew Zealand (10% of leavers)\n\nMedrecruit says house officers, as they are known, earn between £31,000 and £38,000.\n\nCanada (5% of leavers)\n\nThis varies depending on which province the doctor is working in. Salaries range from £27,000 to £59,000, according to Scotiabank.\n\nIreland (4% of leavers)\n\nBetween £38,000 and £61,000, according to recruitment company IMG Connect.\n\nUAE (2% of leavers)\n\nAllocation Assist Middle East says junior doctors can be paid up to £8,000 a month, which would equate to an annual salary of about £96,000.\n\nADVERTISEMENT\n\nAs these salary ranges demonstrate, moving abroad doesn't necessarily equate to higher pay. But pay isn't necessarily the main reason for working in a different country: the GMC found the most common reason for leaving the UK was seeking a better quality of life, followed by feeling undervalued.\n\nPay was the third most-cited factor.\n\nHow can the NHS stop NHS doctors moving abroad?\n\nLast year's GMC report also found 30% of UK-based survey respondents said they were likely to relocate abroad within the following year. Meanwhile, a third - 33% - said they are likely to do so \"at some point\".\n\nYahoo News UK approached the BMA, which called this month's resident doctor walkout, for comment on this trend and what can be done to stop doctors moving abroad. It declined, but said in response to the report last year: “That so many doctors say they are looking to leave for overseas is not surprising... when we consider the immense pressures healthcare staff are under in an overwhelmed service battling huge workforce shortages.\n\nADVERTISEMENT\n\n\"Here, in black and white, we see the main factor driving UK doctors away is pay, and that the majority feel professionally undervalued.\"\n\nHowever, moving abroad for work isn't extraordinary in the medical profession. The GMC report said just under half, 48%, of UK-based doctors surveyed had previously practised medicine abroad. It found these doctors \"were more likely than those who had not previously worked abroad to say they were likely to move abroad in the next 12 months.\n\n\"That such a large proportion of doctors have worked abroad in the past and intend to do so again in the future, suggests that the workforce as a whole could be described as highly mobile.\"\n\nRead more",
        "source": "Yahoo"
    },
    {
        "url": "https://uk.news.yahoo.com/ive-spent-3-days-bed-034000322.html",
        "title": "'I've spent 3 days in bed after submitting mandatory reconsideration to DWP for PIP - it wiped me out'",
        "publish_date": "2025-07-13T03:40:00Z",
        "category": "finance",
        "authors": [
            "Kelly Ashmore"
        ],
        "text": "'I've spent 3 days in bed after submitting mandatory reconsideration to DWP for PIP - it wiped me out'\n\n\n\n\n\nGoing through the Department for Work and Pension's mandatory reconsideration process left one PIP hopeful 'completely wiped out'.\n\nThey claimed that after compiling a 27-page document, which explained why they disagreed with the DWP's decision, they'd spent three days in bed.\n\nHaving added additional supporting evidence there were around 45 pages in total, which made them question whether they were 'wrong to submit so much'.\n\nREAD MORE: Sex offender 'badly let down' by prisons before death\n\nTaking to Reddit, they said: \"I’ve spent the last three days in bed, completely wiped out after finishing my MR and submitting a complaint to the DWP.\n\nADVERTISEMENT\n\n\"It was absolutely exhausting and now I’m wondering did I do it all wrong as I submitted so much?\n\n\"For context, I originally scored 0 points on both elements from a phone assessment.\n\n\"After that, Capita’s clinical investigation awarded me 11 and 10 points after doing another assessment (paper based).\n\n\"But then the DWP case manager rejected it.\"\n\nThey continued: \"So I went full in on the MR. My MR itself was 27 pages.\n\n\"I went point by point, explaining where I agreed/disagreed with the original assessor (with factual evidence).\n\n\"Then I used the DWP’s rejection letter to highlight inaccuracies and contradictions.\n\n\"Now I’m lying here wondering: Did I go overboard? Did I do it wrong? Has anyone else gone this in-depth for their MR?\"\n\nOne response read: \"A 27 page MR is a tad overboard but that doesn’t mean you’ve done the wrong thing.\n\nADVERTISEMENT\n\n\"It’s your MR and you can do it anyway that works for you.\"\n\nA second said: \"It won’t matter. If you don’t get it through MR then all that information can be submitted to the tribunal.\n\n\"The work you have put in now will really help if the tribunal panel interview you. Good luck.\"\n\nThe gov.uk website has some information regarding mandatory reconsideration process and how to ask for it.\n\nAnyone who believes the DWP made a wrong decision in relation to their case can request it.\n\nPeople can also include evidence that has not already been submitted, including bank statements, payslips, reports or care plans from specialists, therapists or nurses, or new medical evidence.",
        "source": "Yahoo"
    },
    {
        "url": "https://uk.news.yahoo.com/modern-racism-become-loud-proud-050000000.html",
        "title": "Modern racism has become loud and proud",
        "publish_date": "2025-07-13T05:00:00Z",
        "category": "finance",
        "authors": [
            "The Observer"
        ],
        "text": "This photo should strike fear into the heart of all Englishmen,” wrote one. “Why are they all foreigners?” asked another. “You are literally teaching children that genocidal replacement is good, so long as it’s white people being replaced,” claimed a third.\n\nAll were responding to a photo that Katharine Birbalsingh had posted on X of a class at her school. The headteacher of Michaela community school, in north-west London, and self-described as “Britain’s strictest headmistress”, Birbalsingh has often faced criticism from the left for her conservative views.\n\nThis time, though, the onslaught was from the far right and hardline racists. The photo was mainly of black and Asian children. For many, this tagged it as a class of “foreigners”. Birbalsingh herself was condemned as an “invader”. There were more than a thousand responses, most of them hostile.\n\n“Racists always existed,” a bewildered Birbalsingh wrote, but “things are much, much worse now”. But what is it that is much worse?\n\nADVERTISEMENT\n\nThere would be little sympathy from the public for the kind of racism Birbalsingh faced. Few people think that to be British is to be white. More than twice as many believe that Britishness is about respecting laws and political institutions rather than ancestry.\n\nWhat has changed is that out-and-out racists have become more confident in proclaiming their bigotry. That confidence rests on the way that ethnic notions of national identity, and laments for white decline, have seeped into the language of mainstream conservatism.\n\n“Mass deportation of Pakistanis from Britain. I don’t care how long you’ve lived here. Out,” tweeted Douglas Carswell, the former Conservative and U kip MP. Carswell may be an outlier when it comes to mainstream conservatism, but the idea that Britain has declined because of demographic change is now almost conventional wisdom in certain circles.\n\nThe idea Britain has declined because of demographic change is now almost conventional wisdom in certain circles\n\n“Is there some minimum number of natives that a capital requires before it ceases to be the capital?” David Goodhart, head of the demography unit at the conservative think tank Policy Exchange, wondered recently, referring to data that white people are becoming a minority in London. Perhaps, he suggested, half-jokingly, Nigel Farage might propose “moving the government to York”. Goodhart acknowledges that “immigration is not responsible for all London’s ills”, yet frames the city’s decline in terms of demographic change. So does Matthew Goodwin, academic turned Reform advocate, for whom “London Is So Over”, brought down by “a toxic cocktail of rapid demographic change, mass immigration, and economic stagnation”.\n\nADVERTISEMENT\n\nOne statistic such critics deploy is that in almost half of social housing in London, the head of the household was born abroad. The implication is that these are foreigners scamming the housing system. “It is morally wrong,” the shadow home secretary, Chris Philp, tweeted, that “48% of London’s social housing is occupied by people who are foreign”. In fact, these are mostly British nationals, although they were born abroad. The insinuation, though, is that not to be white is not to be British.\n\nLondon “has become a foreign country”, Douglas Murray, the Spectator’s associate editor, has written, because in most boroughs “‘white Britons’ are now in a minority”. Britons, the novelist Lionel Shriver suggested, have been forced to “abet incursions by foreigners so massive that the native-born are effectively surrendering their territory”, a process she calls “biologically perverse”.\n\nIf anyone questions such claims, the usual response is: “But you’re not listening to people’s fears”, or “So you want open borders?” There are important and necessary debates about numbers, border controls and public anxieties. But laments over white decline are less about immigration than attempts to turn concerns about immigration into existential fears about identity.\n\nThere is a long history to this. In the debate over the 1905 Aliens Act, Britain’s first immigration control, aimed at barring Jewish refugees fleeing pogroms in eastern Europe, the prime minister, Arthur Balfour, claimed that without the law British “nationality would not be the same”. Half a century later, the Colonial Office worried that “a large coloured community” in Britain “would weaken… the concept of England or Britain to which the people of British stock throughout the Commonwealth are attached”. The existential fears eventually dissipate – who today, except hardline antisemites, would claim that too many Jews would undermine British nationality? – only to be resurrected again a generation later.\n\nMost mainstream conservatives would reject the arguments of Birbalsingh’s racist critics. Yet it is not that great a leap from viewing Britons of colour as foreign to seeing Birbalsingh’s class as full of foreigners. Few, though, are willing or able to make that connection.\n\nADVERTISEMENT\n\nBirbalsingh herself, in a discussion with me on X, denied the link. Mainstream arguments about white identity and decline, she insist ed, were “not unreasonable”. The problem was “leftist dogma”. It is true that the left’s abandonment of class politics in favour of the politics of identity has allowed racists to rebrand racism as white identit y. The contempt displayed by sections of the left for the working class has pushed many into the arms of the radical right. Nevertheless, the denial by conservatives of the way that mainstream white identitarian arguments have helped pave the way for open racism reveals an extraordinary degree of blinkeredness.\n\nThe dogmatic embrace of demographic change and white decline as one-stop explanations for Britain’s social ills not only brings racialised ideas mainstream but also makes it more difficult to address the real roots of our social problems.\n\nPhotograph by Katharine Birbalsingh @Miss_Snuffy/X",
        "source": "Yahoo"
    },
    {
        "url": "https://uk.news.yahoo.com/weather-maps-turn-red-another-140926920.html",
        "title": "Weather maps turn red as another scorching 35C heatwave on the way",
        "publish_date": "2025-07-13T14:09:26Z",
        "category": "finance",
        "authors": [
            "Elizabeta Ranxburgaj",
            "Kelly Ashmore"
        ],
        "text": "Weather maps turn red as another scorching 35C heatwave on the way\n\n\n\n\n\nThe UK could see another scorcher next weekend as temperatures look set to climb to 35C.\n\nThere have been sweltering highs of more than 30C this week during the third heatwave of the year.\n\nThings were expected to cool down by mid-week, but it seems the respite from the warm weather will be brief.\n\nREAD MORE: The DWP rule change Universal Credit claimants may not know about\n\nGFS weather model maps predict more stifling highs are on the cards this month, the Mirror reports.\n\nMaps have turned deep red to indicate the arrival of more sunshine on July 19.\n\nThe data suggests temperatures might hit highs of 32C in the south-east London, while southern-central regions could see 30C.\n\nADVERTISEMENT\n\nOn July 20, it's thought temperatures could reach 35C as maps for this date show almost all of England shaded in dark red.\n\nIt's predicted Birmingham will see temperatures reach 32C, while Norfolk looks set to be hit with the 35C highs.\n\nHeading into July 21 - the final day of the potential heatwave - temperatures were expected to drop slightly, with Birmingham seeing 28C heat.\n\nREAD MORE: Benefits cheat caught out by own Facebook posts says being 'a target' in prison was 'terrifying'\n\nDiscussing the current heatwave, Met Office meteorologist Kathryn Chalk, said: \"It's still going to be very warm on Sunday before turning cooler for many of us on Monday.\n\n\"So we've got this ridge of high pressure extending across the UK, helping to keep things settled, but out towards the west an area of low pressure moving through Sunday night and into Monday.\n\n\"So if you're not a fan of the heat temperatures will be falling away but also bringing some heavy spells of rain, or welcome rainfall, for many of us.\"",
        "source": "Yahoo"
    },
    {
        "url": "https://uk.news.yahoo.com/rayner-employment-law-forcing-stealth-213000148.html",
        "title": "Rayner’s employment law forcing ‘stealth tax’ on workers",
        "publish_date": "2025-07-13T21:30:00Z",
        "category": "finance",
        "authors": [
            "Tony Diver"
        ],
        "text": "Angela Rayner’s employment law reforms will act as a £5 billion “stealth tax” on workers, a report has warned.\n\nThe Deputy Prime Minister is planning a raft of reforms that will make it easier for workers to strike and introduce new “day-one” rights against unfair dismissal and zero-hours contracts.\n\n\n\nBut they will also work to suppress wages, effectively taxing employees by increasing costs for their bosses, according to analysis by the Institute of Economic Affairs (IEA).\n\n\n\nThe think tank said smaller pay rises will equate to a £5 billion “stealth payroll tax”, based on the Government’s own impact assessment of the cost on workers.\n\n\n\nBusiness groups have already raised the alarm over the reforms, which they say will make firms more reluctant to hire workers.\n\n\n\nThe Employment Rights Bill, which returns to the Commons on Monday, contains measures to make it easier for workers to form unions and launch strike action.\n\nAndrew Griffith says the bill is ‘a Trojan horse for union power and state interference’ - Elliott Franks\n\nAndrew Griffith, the shadow business secretary, said they would result in 1970s-style union militancy and hammer struggling businesses.\n\n\n\n“Labour’s love-in with the unions is dragging Britain back to the worst economic mistakes of the 1970s,” he said.\n\n\n\n“The so-called Employment Rights Bill is nothing more than a Trojan horse for union power and state interference.\n\n\n\n“Far from protecting workers, it will price people out of jobs, deterring investment and sending small businesses to the wall.”\n\nADVERTISEMENT\n\nIn June, the Conservatives pledged to scrap the Bill if they return to office, warning the plans would “grind our economy to a halt”.\n\n\n\nThe IEA’s report, by Prof J.R. Shackleton, argues that the plans will “put the public through the wringer” and “extort more pay from the government – which means, of course, the taxpayer”.\n\n\n\nThe Telegraph understands the workers’ rights plan has already been the subject of dispute between Ms Rayner and the Treasury, which is concerned about the impact on business confidence and economic growth.\n\nThe Office for Budget Responsibility, Britain’s independent fiscal watchdog, has said they will have a “probably net negative” impact on a range of economic indicators, including employment, prices, and productivity.\n\n\n\nThe Government’s impact assessment found that the reforms will result in £5 billion higher costs for businesses, which the IEA said would be passed to workers in the form of lower wages.\n\nMs Rayner has argued that the new rules will boost living standards, giving the public an “upgrade to our growth prospects and the reforms our economy so desperately needs”.\n\n‘Billions in hidden costs’\n\nThe professor of economics at the University of Buckingham said: “Politicians love to announce new employment ‘rights’ because they think employers pay the bill – but that’s an illusion.\n\n\n\n“Every mandate, from parental leave to holiday entitlements, acts like a stealth tax that gets passed back to workers through smaller pay rises than they would otherwise receive. The only difference is that no money is raised for the Exchequer,” said Prof Shackleton.\n\n\n\n“The Employment Rights Bill will make this much worse, imposing billions in hidden costs that workers will ultimately bear themselves.\n\n\n\n“The Government is not protecting workers – it is harming them and undermining its own alleged number one priority to boost economic growth.”\n\nADVERTISEMENT\n\nA government spokesman said: “Too many workers are trapped in insecure, low-paid work, with weak protections that are poorly enforced.\n\n“Through our transformative Plan for Change, this government will deliver the biggest upgrade to workers’ rights in a generation, contributing to economic growth, and our measures have strong support from businesses and the public.”",
        "source": "Yahoo"
    },
    {
        "url": "https://uk.news.yahoo.com/coffee-vs-tea-one-really-140054698.html",
        "title": "Coffee vs tea: which one is really better for your health?",
        "publish_date": "2025-07-13T08:31:23Z",
        "category": "lifestyle",
        "authors": [
            "Giulia Crouch"
        ],
        "text": "Coffee vs tea: which one is really better for your health?\n\nCoffee vs tea: which one is really better for your health?\n\nIn the battle of the brews which side are you on? A traditional tea-sipper or an on-the-go espresso-shotter? Whether you prefer a cuppa or a cappuccino it turns out both morning drinks are packed with health benefits. A new study has found that drinking one to three cups of caffeinated coffee a day may help you live longer – as long as you go easy on the sugar and cream.\n\nThe research by Tufts University analysed data from over 46,000 adults and concluded that moderate coffee consumption was linked to a 14–17% lower risk of death from any cause. However, those benefits vanished when drinks were loaded with sweeteners or lots of saturated fat such as cream – a splash of milk is fine. Fang Fang Zhang, senior author of the study, said: “Coffee is among the most-consumed beverages in the world, and with nearly half of American adults reporting drinking at least one cup per day, it's important for us to know what it might mean for health. The health benefits of coffee might be attributable to its bioactive compounds.”\n\nThese compounds can help combat oxidative stress and cellular damage; help reduce chronic inflammation – a root cause of many modern illnesses – and reduce the risk of neurodegenerative diseases like Alzheimer’s and Parkinson’s.\n\nBut it’s not the only caffeinated beverage that comes with health benefits. A cup of tea is not only a balm to all emotional woes – “I’ll stick the kettle on” – but also good for our bodies and brains. Here are all the health benefits of both coffee and tea.\n\nIs tea healthy?\n\nJust like coffee, tea – whether black, green, white, or oolong – is packed full of bioactive compounds. Tea is loaded with polyphenols like catechins (especially in green tea) and theaflavins (in black tea), which act as antioxidants. They help neutralize harmful free radicals, reducing oxidative stress and lowering the risk of chronic diseases such as heart disease and certain cancers. These polyphenols also feed the good bacteria in our gut microbiomes and a healthy gut is linked to overall health.\n\nRegular tea consumption has health benefits (Pexels)\n\nRegular tea consumption has also been linked to improved heart health by reducing LDL (bad) cholesterol, improving blood vessel function, and lowering blood pressure. Nutritionist and researcher Dr Pamela Mason from the Tea Advisory Panel says that, as they both come from plants, tea and coffee are both healthy choices, but tea does stand out for one reason. “There is one major difference with tea and that’s the fact it contains L-theanine, a unique amino acid – and it is only found in tea,” she says. “Studies show that L-theanine - particularly when combined with a small amount of caffeine – reduces stress and focuses the brain, helping concentration.\n\nADVERTISEMENT\n\n“Brain scans show that L-theanine in green and black tea increases alpha-wave activity, which induces relaxation without drowsiness.” pThis means that while a cup of tea will make you feel alert, because of the caffeine, it also brings about a sense of calm which, come bed-time, will also help you sleep.\n\nWhat are the health benefits of coffee?\n\nA regular cup of coffee contains about two to three times more caffeine than black tea which gives you a quicker, more intense energy boost. It also boosts metabolism and increases fat burning. In fact, studies suggest that caffeine can increase resting metabolic rate by about 3–11% depending on the dose, your body weight, and how accustomed you are to caffeine – a tolerance is built over time.\n\nSurprisingly, coffee contains small amounts of dietary fibre – specifically, soluble fibre – which can contribute modestly to our daily intake and supports gut health. Unfiltered coffee such as espresso or Turkish coffee are thought to contain more fibre than filter coffee.\n\nThree cups of coffee a day is the optimum for heart health (Pexels)\n\nCoffee also contains some bioactive compounds that aren’t present in tea such as diterpenes (cafestol and kahweol) and melanoidins. Diterpenes, present mainly in unfiltered coffee like espresso and French press, have anti-inflammatory, anti-cancer, and liver-protective effects. Melanoidins form during roasting and act as powerful antioxidants and prebiotics, supporting gut health and reducing inflammation.\n\nADVERTISEMENT\n\nOne of the most consistent findings in coffee research is the link between moderate coffee drinking and reduced heart disease risk. Three to four cups a day is consistently associated with a lower risk of developing heart disease.\n\nHow much tea and coffee should I drink a day?\n\nGenerally, three to four cups of coffee per day is considered optimal for health benefits for most people. For black tea, because it contains less caffeine, the recommended number is three to five.\n\nWhich is better for our health: tea or coffee?\n\nThe good news is both delicious beverages are also super healthy so choose whichever you prefer. Or, don’t choose! Drink both and benefit from their unique properties.",
        "source": "Yahoo"
    },
    {
        "url": "https://uk.news.yahoo.com/live-magical-island-off-brit-112600658.html",
        "title": "'We live on magical island off Brit coast you have to plan every pint by the tides'",
        "publish_date": "2025-07-13T11:26:00Z",
        "category": "finance",
        "authors": [],
        "text": "St Michael’s Mount, a tidal island off the British coast, is home to just 31 residents who live by the rhythms of tides and weather. The medieval island, featuring a castle and gardens, welcomes up to 300,000 visitors annually. Life here revolves around tide charts, with transport access limited to low tides and good weather. Residents like harbour master Josh Sedgeman and gardener Darren Little cherish the island’s unique community, microclimate, and changing seasons. Despite tourist crowds, the island maintains a close-knit community and historic charm that continues to fascinate visitors and locals alike.",
        "source": "Yahoo"
    }
]