[
  {
    "url": "https://www.9news.com.au/national/nsw-liberal-party-leader-kellie-sloane-appoints-matt-cross-new-shadow-minister-for-men/76db4599-61f0-4d94-b9f9-5f4205cbe4ba",
    "title": "Liberals appoint a shadow minister for men",
    "publish_date": "Tue, 27 Jan 2026 01:30:24 +0000",
    "category": "lifestyle",
    "authors": [
      "Jan"
    ],
    "text": "﻿NSW Liberal leader Kelli Sloane has declared \"masculinity should be celebrated\" as she announced a new position in her team targeting men's health.\n\nDavidson MP Matt Cross, who survived bowel cancer, has been named the state opposition's parliamentary secretary for men's health .\n\nAlthough it is not a full shadow cabinet portfolio, Cross will effectively act as a shadow minister to improve the lives of boys and men through physical and mental health outcomes. ﻿\n\nREAD MORE: ﻿ Remains on Queensland farm belong to man who vanished in 2018\n\nNSW Liberal Leader Kellie Sloane. (Sitthixay Ditthavong)\n\nSloane told 2GB Radio today the matter was close to her heart as a mother to three boys.﻿\n\n\"Before I was in this role as opposition leader, I was shadow health minister and I noticed the huge disparity in health outcomes between men and women, boys and girls,\" she said.\n\n\"Men are three times more likely than women to commit suicide. They will die four years earlier than women from avoidable causes, more likely to have cardiovascular disease, to have avoidable cancers, they don't go to the doctor as much.\n\n\"These are huge problems, and they're statistics that should absolutely stop us in our tracks.\"\n\nSloane ﻿said the conversation around men needed to change so that masculinity was \"celebrated\".\n\n\"We've got to stop saying that men need to be fixed, that they're broken, that they're toxic,\" she said.\n\n\"Let's turn that around and let's say you are supported, you are loved, and your masculinity should be celebrated.\"\n\nThe federal government has its own special envoy for men's health, Dan Repacholi, who was appointed last year, but Sloane said she wanted to \"get serious about it\" at the state level. ﻿\n\nREAD MORE: ﻿ Trump appears to back down as crisis hits breaking point\n\nDavidson MP Matt Cross. (Facebook)\n\nCross said his new position was a \"real honour\" in a video he filmed on his way to meet his oncologist at Royal North Shore Hospital.\n\n\"Talking about men's health is just so important. We need to be able to start a conversation,\" he said.\n\n\"It's okay to be vulnerable﻿. It's about sharing our pains, sharing the need to support one another, and being human.\"\n\nThe NSW Liberals have also announced Jordan Lane as the new shadow parliamentary secretary for home ownership and rental affordability ﻿and Michael Kemp as the new shadow parliamentary secretary for the prevention of regional crime.\n\nThe NSW Liberals have 10 women and 16 men in their new opposition ministry.\n\nNEVER MISS A STORY: Get your breaking news and exclusive stories first by following us across all platforms.",
    "source": "9News",
    "cluster_id": 0
  },
  {
    "url": "https://www.9news.com.au/national/cats-running-wild-in-wa-indoor-only-laws-considered/d7c97e1a-07b2-450d-98cf-b2b205badfcb",
    "title": "Cats are running wild in one state. This unpopular law may be the solution",
    "publish_date": "Mon, 26 Jan 2026 18:46:55 +0000",
    "category": "finance",
    "authors": [
      "Jan"
    ],
    "text": "Pet cats are running wild in Western Australia and council attempts ﻿to control them keep resulting in failure and frustration, new research has found.\n\nCats are roaming the streets unregistered and without microchips﻿.\n\nMany also haven't been desexed, which could contribute the state's stray and feral cat population.\n\nCats are running wild in one state and an unpopular law may be the solution. (Getty)\n\nNow research from The University of Western Australia and Murdoch University has revealed that while the cats themselves may not be the problem, keeping them indoors could be the solution.\n\nA survey of 103 of WA's 139 local government areas (LGAs) found there was poor community awareness of what responsible cat ownership involves.\n\nWA's Cat Act 2011 requires owners desex, microchip and register their pets by the time they're six months old.\n\nCats should also wear an identification in public places.\n\nBut only 14 of the 139 LGAs﻿ reported high registration and microchipping compliance.\n\nJust 17 reported high desexing compliance, and only five reported high levels of responsible pet cat ownership awareness.\n\n﻿As well as putting cats at risk of illness and injury, low rates of responsible cat ownership in WA threatens the welfare and conservation of native wildlife.\n\nBut is permanent cat containment legislation (banning cats from roaming outdoors) the right solution?\n\nAn increasing body of research has shown that keeping cats indoors full-time and limiting outdoor access to enclosed areas or while on a leash is better for the cat's welfare.\n\nIt's also better for the ﻿welfare of other animals domestic cats often prey upon.\n\nBut many owners who allow their cats to roam are staunchly against such measures.\n\nLow rates of responsible cat ownership in WA threatens the welfare and conservation of native wildlife. (Getty Images/iStockphoto)\n\n﻿According to the research, only three LGAs in WA have been successful in introducing permanent cat containment laws to keep cats indoors.\n\nOthers have tried but failed.\n\nDespite this, 80 of the 103 LGAs surveyed said they would introduce permanent cat containment laws if there was a clear pathway to implementation.\n\n\"Many LGAs in WA want to (and many have tried to) implement restrictions to prevent pet cats from roaming, with limited success and considerable frustration,\" the report read.",
    "source": "9News",
    "cluster_id": 1
  },
  {
    "url": "https://www.9news.com.au/national/united-kingdom-eta-rules-for-dual-citizens-british-passport-questions-answered/7ba80087-0d88-43ae-8819-02a26a56afcd",
    "title": "Frantic dual citizens scramble to order new passports amid major change",
    "publish_date": "Mon, 26 Jan 2026 03:16:18 +0000",
    "category": "finance",
    "authors": [
      "Jan"
    ],
    "text": "A﻿ustralian-British dual citizens now have less than one month to prepare for the United Kingdom's new Electronic Travel Authorisation (ETA) scheme.\n\nThe UK will soon strictly enforce its ETA scheme from February 25; a big change which means dual Australian-British or Australian-Irish nationals – who are exempt from needing an ETA – must have a valid UK or Irish passport to travel in and out of Britain or Ireland.\n\nAfter Nine.com.au first reported on the upcoming changes﻿, countless dual citizens living in Australia with expired passports have been left wondering how it will impact their travel plans or if their forthcoming trips have been ruined.\n\nREAD MORE: ﻿ Thousands join Invasion Day rallies around the country\n\nDual British-Australian citizens need a valid UK passport to travel back to Britain from February 25. (Getty)\n\nDo you have a story? Contact reporter April Glover at april.glover@nine.com.au\n\nIt triggered such a huge response from concerned travellers that the Briti﻿sh High Commission in Canberra has stepped in to clear up any confusion.\n\nHere are some of the biggest questions surrounding the ETA scheme, answered.﻿\n\nWho needs to pay for an ETA and who doesn't?﻿\n\nTravellers from 85 countries, including Australia, will need to apply for an ETA to enter England, Scotland, Wales and Northern Ireland as a visitor.\n\nThe ETA costs ﻿£16 (approximately $32) and it lasts for two years, allowing multiple visits for up to six months at a time.\n\nBritish and Irish citizens, however, won't need to apply for an ETA to visit.\n\nThey will instead be required to travel on a valid British or Irish passport.﻿\n\n\"You must use your UK passport or a certificate of entitlement to travel to the UK\", Deputy High Commissioner Dr Brian Jones said in a video shared online.\n\n\"From the 25th of February this year, you may be denied boarding on departure if you don't have this when you travel to the UK.\"\n\nREAD MORE: Hundreds flee homes as Victoria bushfire breaks containment\n\nDr Brian Jones was appointed Deputy British High Commissioner to Australia in July 2025. (Facebook)\n\nWhat is a certificate of entitlement?﻿\n\nA ﻿certificate of entitlement can be used instead of a British passport and is proof of your right to abode in the UK.\n\nImportantly, you cannot get a certificate if you already have a British passport or a valid certificate of entitlement in another foreign passport.\n\nIt will cost £589 (approx. $1163) for anyone applying outside the UK and it can take around three weeks for your application to be approved.﻿\n\nAn HM Passport Office in the Victoria area of central London. (Getty)\n\nI am British and my children were born in Australia. Do they need a British passport too?\n\nBritish citizenship is normally passed down to children who are born outside of the UK to a British parent.﻿\n\nJones said impacted citizens will need to check their child's specific circumstances before travelling after February 25.\n\n\"If they are British, you will need a British passport for them or a certificate of entitlement,\" Jones said.\n\n\"If you believe you could be British, especially if you've got British parents, head to gov.uk to review your eligibility.\n\n\"It is complex, but you may be eligible depending on when you were born, where you were born, and your parents' citizenship at the time of your birth.\"\n\nMy ETA doesn't expire until after February 25. Can I still use it even if I am a British citizen?\n\nJones said British citizens should not travel on an ETA after February 25, even if it was granted before the new rules kick in.\n\n﻿If you need to travel urgently to the UK, however, he said you may be eligible for an emergency travel document.\n\nYou can apply for an ETA on the UK ETA app. (Supplied)\n\nI am arriving in the UK before Feb 25, am I affected?\n\n﻿The short answer is: no.\n\n﻿The UK will not enforce the new ETA scheme until after February 25.\n\nIf you are travelling to the UK before this date, Australian travellers won't need to pay for an ETA﻿ and dual citizens won't need their valid UK passport just yet.\n\nHow long will it take to renew ﻿my passport?\n\nIt depends on whether you have had a Bri﻿tish or Irish passport before.\n\nIt can take between six to 13 weeks receive a passport from Australia.\n\nThis process time can vary and may be longer if you've never had a passport before.﻿\n\nThe HM Passport Office recommends ﻿that people do not book travel or apply for visas until after you have your passport.",
    "source": "9News",
    "cluster_id": 2
  },
  {
    "url": "https://www.9news.com.au/national/australia-day-2026-honours-complete-list-of-recipients/61ccdce8-028f-430a-9967-cb3484fd1b39",
    "title": "'A gift from the Australian people'",
    "publish_date": "Mon, 26 Jan 2026 07:33:34 +0000",
    "category": "sports",
    "authors": [
      "Jan"
    ],
    "text": "Sporting legend Cathy Freeman has been awarded Australia's highest honour, a little more than 25 years after she sent the nation into a frenzy with her Olympic gold medal at Sydney 2000.\n\nOther notable names to be appointed as a companion of the Order of Australia (AC) tonight include former premiers Kristina Keneally, Annastacia Palaszcuk and Steven Marshall, and former federal finance minister Mathias Cormann.\n\nIn all, nearly 1000 Australians were recognised in the﻿ Australia Day 2026 Honours List, including awards in the Order of Australia (General and Military Divisions), meritorious awards, and recognition for distinguished and conspicuous service.\n\nCathy Freeman crossing the finish line and winning gold in the 400 metres at the Sydney 2000 Olympics. (Getty)\n\nIt's just the latest in a glittering list of achievements and awards for Freeman, undoubtedly one of Australia's greatest athletes, responsible for the country's most iconic sporting moment.\n\nShe already counted Australian of the Year, Young Australian of the Year, Sport Australia Hall of Fame Legend status and the Order of Australia Medal alongside her Olympic gold and silver medals and three Commonwealth Games golds in her trophy cabinet.\n\nThe Kuku Yalanji and Birra Gubba woman was recognised for \"eminent service to athletics as an international competitor and ambassador, to positive social impact across the community, to the reconciliation movement in the spirit of unity and inclusion, and as a role model to youth.\"\n\nFreeman told The Sydney Morning Herald she intended to use the honour as a platform to unite Australia.\n\n\"Mum said this is a gift from the Australian people and I wouldn't have looked at it that way, but my mum has incredible wisdom. So I sort of just stopped overthinking it and took it in the spirit it's supposed to be received in,\" she said, adding her mum was \"all about unity\".\n\n\"I just want to be who I am, be authentic. My achievement and my story is always going to touch on things like Aboriginal/Torres Strait Islander perspectives, Olympism, track and field, elite sport, women in sport, the themes are diverse and varied.\"\n\nCathy Freeman celebrates with her gold medal after winning the Women's 400m final at the Sydney 2000 Olympic Games. (Getty)\n\nFreeman described the award as \"quite mind-bending\".\n\n\"I set out to be the best athlete that I could be for myself and then all of a sudden this whole world unfolded right before my very eyes, and it just continues to expand, and it continues to be a wild ride, let me tell ya,\" she said.\n\nPalaszczuk, who won widespread support among Queenslanders but angered many in the rest of the country by limiting the local impact of the COVID-19 pandemic through harsh border restrictions, was praised for her recognition to public health.\n\nShe was also recognised more generally for her time as premier and service to educational equity and multiculturalism.\n\nThen Queensland Premier Annastacia Palaszczuk during a press conference following a national cabinet meeting at Parliament House in Canberra on Wednesday 6 December 2023. (The Sydney Morning Herald)\n\nRob Hirst, the Midnight Oil drummer who died just days ago follow an almost three-year battle with pancreatic cancer , was appointed a member of the order for his service to music.﻿\n\nThe Council of the Order of Australia highlighted former federal finance minister Cormann for his contributions to government reform, multilateral affairs and international economic development.\n\nThe Belgian-born Australian politician became secretary-general of the Organisation for Economic Co-operation and Development (OECD) shortly after leaving the Senate.\n\nFormer NSW leader Kristina Keneally was recognised for her services as premier, as well as her later years as a federal senator.\n\nFormer South Australian premier Steven Marshall was recognised for his service to business, people with disability, governance and board positions.﻿\n\nIn addition to the 680 recipients of awards in the General Division of the Order of Australia (10 AC, 38 AO, 160 AM and 472 OAM), today's Honours list includes:\n\n22 recipients of awards in the Military Division of the Order of Australia.\n\n187 Meritorious awards\n\n60 Distinguished and Conspicuous awards\n\nYou can search the table below for the full list of honourees.﻿\n\nREAD MORE: Police respond to potential sighting of accused triple murderer\n\nGovernor-General Sam Mostyn said the honourees reflected Australia's values for service, community, kindness, curiosity, tenacity, and care.\n\n\"Congratulations to everyone recognised in the Australia Day 2026 Honours List,\" she said.\n\n\"As the list so vividly showcases, so many Australians continue to give the best of themselves across many endeavours, in the interest of others. It is rewarding to see an increase in the number of awards, which reflects more nominations and recognition of the many Australians who inspire the best in all of us.\"",
    "source": "9News",
    "cluster_id": 3
  },
  {
    "url": "https://www.abc.net.au/news/2026-01-27/sleep-routine-screen-time-tips-children-back-to-school/106252794",
    "title": "Has your bedtime routine gone out the window over the school holidays?",
    "publish_date": "Tue, 27 Jan 2026 01:33:55 +0000",
    "category": "lifestyle",
    "authors": [],
    "text": "Before her twins started their first year of school, Brisbane mother Rose Stenhouse implemented what she called a screen time \"detox\".\n\n\"We have found screen time has definitely crept up over the holidays and behaviour has suffered,\" she said.\n\nRose Stenhouse said her children's screen time had crept up over the holidays. (ABC News: Charlie McLean)\n\nLike so many others, Ms Stenhouse has been navigating how best to help her kids transition from holiday mode to healthy screen habits, with a regular sleep routine.\n\nExperts in psychology and sleep say a \"gentle reset\" is key to helping kids adjust to a new routine.\n\nScreen time not 'inherently harmful'\n\nUniversity of Queensland associate professor Asaduzzaman Khan said focusing on what kids are doing on their screens might be more useful than agonising over exact time limits.\n\n\"Passive screen use like mindless scrolling or watching YouTube videos without any mental engagement is more detrimental than active screen use,\" he said.\n\nScreen time isn't inherently harmful, experts say. (ABC News: Luke Stephenson)\n\nBut Mr Khan said screen time isn't \"inherently harmful\".\n\n\"Educational games, creating apps, making videos; these are certainly good active screen uses,\" he said.\n\nLess than an hour of sedentary screen time per day is recommended for children, aged between three and five, under the national guidelines.\n\nIt is recommended children aged between five and 17 have no more than two hours of sedentary screen time per day, although that does not include screen time needed for schoolwork.\n\nMr Khan said one of the best things parents could do was to model the behaviour themselves.\n\n\"You cannot set one rule for parents and one rule for kids. During dinner time if I check my email, it isn't giving a good message to the kids,\" he said.\n\n\" Making a family plan is critical because each family is different and each kid is different. \"\n\nLike with sleep routines, Mr Khan said it's about a \"gentle reset\" rather than a sudden ban on screen use.\n\n\"Some families might need a couple of weeks, but I think without a family plan, then it is difficult to attain any positive outcome on this journey.\"\n\nHow to help kids get into sleeping mode'\n\nDr Chris Watling from the University of Southern Queensland, who focuses on sleep, said introducing changes to routines gradually was a helpful approach.\n\n\"You might want to try and bring their bedtime back between 15 and 30 minutes every day,\" he said.\n\nDr Chris Watling says optimising a child's sleep environment can help them settle back into the school routine. (Supplied)\n\nCreating a calming pre-bedtime routine is essential, Dr Watling said.\n\n\"Avoid phones, tablets and TVs one hour before bed and try to engage in relaxing activities,\" he said.\n\n\"Try to spend a little bit of extra time reading so they can slowly start to calm down and get into that sleeping mode.\"\n\nAvoiding screen time in the hour before bedtime can help the routine, Dr Watling says. (ABC News: Glyn Jones)\n\nDr Watling said keeping the bedroom dark, cool and quiet and dropping down the lights throughout the house about an hour before bed could send the right signal.\n\nParents can also make changes during the day, like making sure kids get outside in the morning.\n\n\"Morning sunlight helps to reset our body clock. It's a really fundamental part of sleep science.\"\n\nBeing a bit stricter and enforcing bedtime habits might be necessary, he said.\n\nAt Brisbane's Sherwood State School, parents of the incoming Prep cohort said they had tried to prepare their children for the next stage in their development.\n\nMatt Kendall says it can be a bit hard to get his two boys to bed on time. (ABC News: Charlie McLean)\n\n\"[We've] been trying to get them to bed early,\" Brisbane father-of-two Matt Kendall said.\n\n\"It's a bit hard with the boys, they just want to keep playing but we're just trying to get to bed early and [establish] a bit of a routine.\"\n\nDr Watling said modelling good sleep habits could help.\n\n\"Let the kids know that when you went back to work you had to stop staying up late or whatever it is that you were doing on the holidays as an adult,\" he said.\n\nFor larger families, discussing bedtime at the dinner table could be a good way to go, he said.\n\nThe impact of poor sleep\n\nPaying attention in school is the biggest issue in children who haven't had enough sleep, Dr Watling said.\n\n\"The research shows us that the ability to maintain attention will drift off. Naturally, that happens anyway, but when we're sleep restricted that drifting off starts to happen a lot earlier and frequently. We've already got an uphill battle against that.\"\n\nEmotional regulation and communicating with fellow students can also be victims of poor sleep.\n\n\"We all know when we've had a bad night's sleep as adults, we might get a little narky with our friends the next day. You can imagine how that can be even more problematic with children.\"",
    "source": "ABC",
    "cluster_id": 4
  },
  {
    "url": "https://www.abc.net.au/news/2026-01-27/levi-sisters-turn-down-nrlw-to-stick-with-rugby/106273314",
    "title": "Levi sisters turn down NRLW to re-sign with Rugby Australia",
    "publish_date": "Tue, 27 Jan 2026 01:16:36 +0000",
    "category": "sports",
    "authors": [],
    "text": "Australian rugby sevens star Maddison Levi admits an NRLW cameo with sister Teagan would have been \"selfish\" after re-signing with Rugby Australia on a two-year deal.\n\nSpurred by a heartbreaking Olympic campaign in Paris, the Levi sisters have given themselves another shot at gold medal glory and will remain with Australia's rugby sevens program until at least the end of 2028.\n\nThe pair were expected to announce a one-off NRLW cameo this year, with various media outlets reporting RA had ticked off negotiations with a rugby league club.\n\nIt is not the first time Maddison, 23, and Teagan, 22, have expressed interest in a cross-code move, with Rugby Australia knocking back a request at the end of 2024.\n\nThe older Levi sister has also played AFLW, featuring in eight games for the Gold Coast Suns in 2021.\n\nMaddison Levi is one of the best rugby sevens players in the world. (Getty Images: Hannah Peters)\n\nMaddison, recognised as perhaps the world's best women's sevens player, said the decision factored in a short turnaround from the international sevens season ending on June 7 to the NRLW opening round from July 2.\n\n\"We'd be coming straight off a season into an NRLW season,\" Maddison said on Tuesday.\n\n\"The toll our body takes under sevens, and to not have a pre-season underneath us and go out and play league, it's probably a bit selfish on our part, not having played before.\n\n\"Teags, being a half or a playmaker, she can't really play-make much if people don't know how she plays.\n\n\"Being well-known sevens athletes, going over there, we want to go over and make our mark.\n\n\"And if we go over under-prepared — not that we can't do that, I'm sure we could go out there and show how we play in sevens — but we wanted to fully be able to transition and show the NRLW how we play.\"\n\nThe Levi sisters are keen to make amends for a disappointing campaign at the Paris Olympics two years ago. (Getty Images: Cameron Spencer)\n\nThe pain of a disastrous Olympic campaign in 2024 still lingers for the sisters, with Australia forced to leave Paris without a medal after two mighty upsets relegated them to a fourth-place finish.\n\nLeft rattled, the lure of an Olympic gold medal and redemption was strong enough for the sisters to turn down a lucrative deal from an NRLW club.\n\n\"Money, it's nice, but it's not the be-all and end-all,\" Maddison said.\n\n\"We both play for the love of the game and ultimately, that's kind of why we turned it down.\n\n\"Paris left us all a bit rattled. We were in the best position to get that Olympic gold medal.\n\n\"You look back and the time in the village is good, and then you think of the games.\n\n\"It's such a conflicting memory, but it's something that's going to drive us to be hungrier come LA.\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\n\"They say you can't win one without losing one — we've lost enough now to have a gold medal in LA.\"\n\nBut the door to a cross-code move is not completely shut, with Australia set to host the 2029 Women's World Cup.\n\n\"A hundred per cent, to be a dual athlete would be such a surreal experience. It's definitely not off the cards,\" Teagan said.\n\n\"I went and played at the (Super Rugby team Queensland) Reds for a little bit, and that was a great experience in itself.\n\n\"Again, the timing didn't really work out with the seasons, but that door's definitely not shut either.\"\n\nAAP",
    "source": "ABC",
    "cluster_id": 5
  },
  {
    "url": "https://www.abc.net.au/news/2026-01-27/nt-mandates-australian-anthem-be-sung-at-school-assemblies/106272914",
    "title": "NT public schools mandated to sing national anthem at assemblies",
    "publish_date": "Tue, 27 Jan 2026 01:12:43 +0000",
    "category": "entertainment",
    "authors": [],
    "text": "The Northern Territory government has mandated public school students to sing the Australian national anthem during assemblies and special events.\n\nUnder the policy introduced today, all 152 of the territory's public schools will be directed to play and sing both verses of the anthem in English during school assemblies and special events.\n\nStudents will also be expected to stand while the anthem is played.\n\nIn a statement, Education Minister Jo Hersey said Territory children had \"been deprived of feeling proud to be Australian\" and the new policy would restore national pride.\n\n\"We are Australian, and in the Northern Territory students will be taught what it means to be an Australian and to be proud of their country,\" she said.\n\nStudents at all 152 of the territory's public schools will be required to stand for and sing the Australian national anthem. (ABC News: Michael Franchi)\n\nThe policy also includes an update to the school curriculum for students to learn about national symbols and what they mean to Australian identity through the civics and citizenship learning area.\n\nSinging and performing the anthem can also be taught as part of arts lessons.\n\nMs Hersey says that while singing the anthem will become mandatory, performing a Welcome to Country will be at the discretion of each school.\n\nAccording to the NT Council of Government School Organisations' (NTCOGSO) website, approximately 43 per cent of NT public school students are Indigenous.\n\nThe mandate will be in place for all government schools in the territory. (Facebook: NT Department of Education)\n\nFederal minister backs policy\n\nFederal Education Minister Jason Clare said the singing of the anthem \"already happens a lot\" in schools across Australia.\n\n\"I never knew the second verse until I became a pollie, but you go to schools across the country, and kids sing the first verse and the second verse,\" he told Channel 7's Sunrise program.\n\n\"There's a great line in the second verse which says 'with courage let us all combine to Advance Australia Fair' … if kids are singing that in the NT and in other parts of the country I reckon that's a good thing.\"\n\nThe policy comes in time for the beginning of the new school year, with public school students starting on Thursday.",
    "source": "ABC",
    "cluster_id": 6
  },
  {
    "url": "https://www.abc.net.au/news/2026-01-27/kanye-west-apologises-antisemitism-wall-street-journal-ad/106272660",
    "title": "Kanye West says he 'lost touch with reality' due to brain injury",
    "publish_date": "Tue, 27 Jan 2026 00:37:37 +0000",
    "category": "entertainment",
    "authors": [],
    "text": "Ye, the rapper and entrepreneur formerly known as Kanye West, has again apologised for antisemitic remarks, this time taking out a full-page ad in the Wall Street Journal.\n\n\"I lost touch with reality,\" Ye wrote in the ad, attributing his behaviour to an undiagnosed brain injury and an untreated bipolar disorder.\n\n\"I regret and am deeply mortified by my actions in that state, and am committed to accountability, treatment and meaningful change.\"\n\nKanye West denied entry to Australia, minister reveals The musician had a valid visa cancelled by officials in Tony Burke's department after he released a song titled Heil Hitler.\n\nYe has made numerous antisemitic public statements over the past few years, including a social media post that appeared to accuse notorious musician Sean \"Diddy\" Combs of being controlled by \"the Jewish people\" and another that appeared to show a swastika symbol inside a Star of David.\n\nIn October 2022, Ye wore a White Lives Matter shirt — a phrase adopted by neo-Nazi and white supremacist groups in response to the Black Lives Matter movement — to a Paris Fashion Week event.\n\nAfter a backlash, he posted to Twitter that he would go \"death con 3 on Jewish people\".\n\nHis tweet was taken down and his Twitter and Instagram accounts were restricted for violating community guidelines.\n\nHe was reinstated eight months later after Elon Musk took over the social media platform and rebranded it as X.\n\nRegrets using swastika imagery\n\nYe wrote that his diagnosis does not excuse his behaviour.\n\n\"I am not a Nazi or an antisemite,\" he said. \"I love Jewish people.\"\n\nYe also voiced regrets for past expressions of admiration for Adolf Hitler and the use of swastika imagery.\n\nLast year, federal Immigration Minister Tony Burke revealed that Ye had been denied a visa to Australia after releasing an antisemitic song.\n\nYe's next album, Bully, is due out on Friday, according to the Spotify website.\n\nA previous album, VULTURES 1, a collaboration with fellow American rapper Ty Dolla $ign, saw two major artists, Ozzy Osborne and Donna Summer, publicly accuse West of copyright infringement.\n\nThe American Anti-Defamation League, which tracks antisemitism, issued a statement describing his apology as overdue and noting his prior antisemitic remarks.\n\n\"Ye's apology to the Jewish people is long overdue and doesn't automatically undo his long history of antisemitism — the antisemitic 'Heil Hitler' song he created, the hundreds of tweets, the swastikas and myriad Holocaust references — and all of the feelings of hurt and betrayal it caused,\" an ADL spokesperson said.\n\n\"The truest apology would be for him to not engage in antisemitic behaviour in the future.\n\n\"We wish him well on the road to recovery.\"\n\nWhen Adidas cut ties with Ye it was left with more than a billion dollars worth of high-end Yeezy sneakers. (AP: Seth Wenig)\n\n'In reality you're losing your grip'\n\nThis is not the first time Ye has apologised for antisemitism, after he issued an apology in Hebrew in December 2023 for \"any unplanned outburst\" and that he regretted any pain he may have caused.\n\nIn October 2022, sportswear brand Adidas cut ties with Ye, who had launched a high-end sneaker brand with the company, called Yeezy.\n\nYe issues apology to Jewish community The rapper Ye, formerly known as Kanye West, has issued an apology in Hebrew to the Jewish community for his past antisemitic remarks, saying he sought forgiveness and regretted any pain that his words had caused.\n\nBalenciaga and Gap also ended their fashion partnerships with Ye, while retailers Foot Locker and TJ Maxx stopped selling the Yeezy brand.\n\nIn the full-page ad, Ye referred to his struggles with his mood disorder over the years.\n\n\"Bipolar disorder comes with its own defence system. Denial,\" he wrote.\n\n\"When you're manic, you don't think you're sick.\n\n\"You think everyone else is overreacting.\n\n\"You feel like you're seeing the world more clearly than ever, when in reality you're losing your grip entirely.\"\n\nHitting rock bottom\n\nYe wrote that 25 years ago he was in a car accident that caused significant brain damage that wasn't properly diagnosed until 2023.\n\nHe added that the medical oversight caused mental health problems that led to his bipolar type-1 diagnosis.\n\nThe songwriter said that being in \"a four-month-long manic episode of psychotic, paranoid and impulsive behaviour\" in early 2025 destroyed his life.\n\nKanye West is being accused of copyright infringement. Here's what you need to know Kanye West's new collaborative album VULTURES 1 arrived on Saturday. And it's already stirring up drama.\n\nYe added that he \"hit rock bottom a few months ago\" and had thoughts of not wanting \"to be here anymore\".\n\nThe Gold Digger rapper also addressed the black community with both appreciation and more apologies, saying it was \"unquestionably, the foundation of who I am\".\n\n\"I am so sorry to have let you down. I love us.\"\n\nPreviously, Ye said he was on the autism spectrum rather than having a bipolar disorder.\n\nHowever, looking through Reddit posts of other \"manic\" people helped him to feel he was \"not alone\" and understand that he had a chronic mood disorder, he said.\n\nReuters/ABC",
    "source": "ABC",
    "cluster_id": 7
  },
  {
    "url": "https://www.abc.net.au/news/2026-01-27/perth-scorchers-dynasty-big-bash-league-greatest-team/106270210",
    "title": "How the Perth Scorchers have torched the competition",
    "publish_date": "Mon, 26 Jan 2026 23:33:50 +0000",
    "category": "sports",
    "authors": [],
    "text": "Despite their titan status, the Perth Scorchers were not favourites to win heading into this season.\n\nFinals forecasts were mostly split between reigning champions the Hobart Hurricanes, and Perth's rival hegemon the Sydney Sixers.\n\nThe Sixers boasted an experienced bowling attack and a star-studded batting line-up — featuring newly signed Babar Azam, the most prolific men's T20 International batter in the world.\n\nPerth, on the other hand, had just lost AJ Tye and Jason Behrendorff to the Melbourne Renegades, and Lance Morris to injury, and was still processing a rare missed finals series.\n\nThe glory days were over for the Scorchers, some said. It was time for someone else to take the crown.\n\nThis weekend, formerly sceptical pundits swallowed their words as Perth added a sixth trophy to its cabinet, extending its record as the most decorated team in the BBL.\n\nThe Perth Scorchers have won six out of 15 completed Big Bash League seasons. (AAP Image: Richard Wainwright)\n\nThe Sixers were left to lick their wounds, board a flight home and, according to a statement released post-game, \"shift focus to reflection\".\n\nThe question undoubtedly up for discussion — for Sydney and other clubs in the league — is how to replicate Perth's success.\n\nSuccession planning tricky for clubs\n\nTitle-winning player groups are easy to mythologise and hard to replace.\n\nFailing to relinquish aging stars at the right time is a common trap in all formats — particularly for clubs that have enjoyed prolonged golden eras.\n\nThe Scorchers claimed their fifth BBL title in 2023. (Getty Images: Cricket Australia/Matt King)\n\nOver the past decade, Perth captain turned coach Adam Voges and high-performance general manager Kade Harvey have delivered a masterclass in succession planning.\n\nThe club has managed to hang onto a core group of players to serve as mentors and cultural torch bearers, like Ashton Turner — now the only skipper in the league to lead his team to three titles.\n\nAt the same time, they have been consistently scouting and folding in young homegrown talent — an investment which paid dividends this season with Cooper Connolly and Mahli Beardman deftly stepping up in an injury hit bowling side.\n\nFor the most part, imports have been treated as supplementary, with culture and team fit valued over records and star factor.\n\nOne win in three games left Scorchers on the brink. Enter Ashton Turner Ashton Turner narrowly misses out on a maiden BBL century as he helps launch Perth to a crucial 71-run win over the Sydney Thunder.\n\nSunday night's man of the match, David Payne, fellow English import Laurie Evans, and Kiwi opener Finn Allen — none of whom were major headline selections — are illustrative of this approach.\n\nAll have proven themselves this season to be team players — willing to fit in wherever, whenever — and come across in interviews as being genuinely bought into the Scorchers as a club.\n\nIt is a strategy the Sixers may look to model moving forward after the much-hyped addition of Azam proved a costly, ultimately unsuccessful experiment.\n\nAfter failing with the bat — and butting heads with Steve Smith — he departed the Sixers the day before they were set to play the Hurricanes in a final on Friday, leaving Sydney to recall veteran opener Daniel Hughes at the last minute.\n\n'The Furnace' bears fruit\n\nAsked about the secret to their success this week, Jhye Richardson pointed to two key factors: their adaptability as a playing group, and the fear-inspiring \"fortress\" that is \"the Furnace\".\n\nThe Furnace, aka Perth Stadium, has been the Scorchers' home ground since 2018, when they relocated from the WACA — a move masterminded by then head of cricket WA, Christina Matthews.\n\nThe Perth Scorchers have captured the imagination of young cricket fans in the west. (ABC News: Lauren Smith)\n\nMatthews, who received significant pushback at the time, said it was the best decision she ever made.\n\n\"There was a lot of angst around moving there, not being a traditional home of cricket,\" she said.\n\n\"People were nervous about what the appetite was to have bigger crowds than what we had at the WACA.\n\n\" I just sat there [Sunday night] so pleased I was able to be part of something that has changed the nature of cricket in WA. \"\n\nA crowd of 55,018 filed into Perth Stadium to watch the Scorchers thump the Sixers. (ABC News: Lauren Smith)\n\nThe final saw the Scorchers draw a record home crowd of more than 55,000 fans, who have earned themselves a reputation for being the most parochial and energetic 12th man in the BBL.\n\nThe move also compelled the club to adapt their playing style — developing a deep, aggressive batting line-up capable of navigating one of Australia's most challenging wickets.\n\nChallenges ahead for teams\n\nThe worst thing about being top of the table is the title is yours to lose.\n\nThe task ahead of the Scorchers is maintaining their hegemony and, for WA Cricket, ensuring that success is shared.\n\nNext year, continuity will be challenged as Voges steps down from managing the state team, though he will remain at the helm of the Scorchers.\n\nJosh Inglis and Cooper Connolly (right) celebrate the winning runs. (AAP Image: Richard Wainwright)\n\nIt will mark the first time that coaching position has been split, meaning collaboration will be required to integrate younger players like Beardman and Connolly into first-class and one-day cricket while balancing their BBL commitments.\n\nHarvey will undoubtedly be crucial in this transition as he remains the list manager for both teams.\n\nTeams will be able to nominate a designated batter and fielder from next season under a new rule to be introduced for BBL|16.\n\nThe change — which will undoubtedly prolong the careers of aging stars — and the push to privatise will also rock the boat.\n\n\"The states will have a really strong role to play in deciding who their partners are,\" Matthews said on privatisation, which she sees as \"inevitable\".\n\nChristina Matthews says the next task is to bring WA's women's league up to the same level. (ABC News: Keane Bourke)\n\n\"The Scorchers and WA Cricket could make that a non-negotiable about how they want to see the team put together, how they manage things.\n\n\"They've won the most titles ... WA should really leverage that.\"\n\nMatthews said another item on the to-do list — bringing WA's women's leagues up to the same level of consistency — would be a true marker of comprehensive success for the state.\n\nWhatever happens, the Scorchers have etched their names deeper into the history books with this win, guaranteeing them titan status for years to come.\n\nThe ABC of SPORT Sports content to make you think... or allow you not to. A newsletter delivered each Saturday.",
    "source": "ABC",
    "cluster_id": 8
  },
  {
    "url": "https://www.abc.net.au/news/2026-01-27/australian-open-2026-live-alex-de-minaur-alcaraz-sabalenka-gauff/106272422",
    "title": "Live: Sabalenka beats the heat to blast into AO semifinals",
    "publish_date": "Mon, 26 Jan 2026 23:33:32 +0000",
    "category": "sports",
    "authors": [
      "Jon Healy",
      "Dean Bilton",
      "Simon Smale"
    ],
    "text": "Near record temperatures are forecast for day 10 of the Australian Open, featuring the start of the singles quarterfinals.\n\nTop seed Aryna Sabalenka powered past American teenager Iva Jović 6-3, 6-0 in another ominious display to become the first woman into the semifinals.\n\nAlex de Minaur faces world number one Carlos Alcaraz on Rod Laver Arena, but in the day session 2025 runner-up Alexander Zverev takes on another rising American in Learner Tien.\n\nFollow all the latest from Melbourne Park in our live blog below.\n\nKey Events Aryna Sabalenka cruises into semifinals in straight sets 14 minutes ago Near-record temperatures on Australian Open day 10 2 hours ago Melbourne Park to become a furnace 2 hours ago Who's playing in the Australian Open quarterfinals today? J By Jon Healy Here is the match schedule for the main draw singles quarterfinals on Rod Laver Arena on day 10 (all times AEDT): Aryna Sabalenka (1) vs Iva Jović (29) from 11:30am\n\nAlexander Zverev (3) vs Learner Tien (25) not before 1:30pm\n\nCoco Gauff (3) vs Elina Svitolina (12) from 7pm\n\nCarlos Alcaraz (1) vs Alex de Minaur (6) Some Sabalenka stats D By Dean Bilton (Getty Images) Just a handful of numbers here from that match which tell the story of Sabalenka's dominance: Aces 7-1\n\nFirst serve win % 83-55\n\nWinners 31-12\n\n\n\nBreak points won 4/9 - 0/5\n\nTotal points won 67-45 Aryna Sabalenka cruises into semifinals in straight sets D By Dean Bilton (Getty Images) Utterly comprehensive. Sabalenka raced to a 3-0 lead in the first set, before Iva Jovic showed admirable fight to make the world number sweat her to a 6-3 win. But in the second set, as the temperature soared, Sabalenka put her foot down. 6-0 accurately reflects the dominance, the power and the confidence of a woman who looks well and truly on track for a third title here at the Australian Open. Jovic certainly caught the attention this fortnight and looks a star of the future. Unfortunately she just happened to run into the biggest star of the present, and found out what the top really looks like. Sabalenka breaks again. 5-0 D By Dean Bilton Iva Jovic's resistance has broken, as a double fault hands Sabalenka another break of serve and offers her the opportunity to serve for this match in quick time. Both women are dreaming of an ice bath and some air con by now, I reckon. Heat scale cracks four as Sabalenka breaks again D By Dean Bilton (Getty Images) She's a class above, the world number one. Jovic sends a stretched backhand long to hand Sabalenka the double break in this second set. In other news, the official Australian Open heat scale has just nudged its way up to level four, which means it is just one away from outside matches being halted and the roof being shut where possible. At this rate, that's not going to be a problem for these two. Sabalenka is closing in on her semifinal. Another breezy hold. 4-0. Sabalenka looking imperious D By Dean Bilton I've been impressed with Jovic's power in this match, and all tournament to be honest. She certainly packs a punch despite not being the physically biggest player on the circuit. But it still pales in comparison to what Sabalenka can produce. She is fighting fire with fire and coming out on top. Another hold sealed with an ace. Jovic fighting but Sabalenka presses on D By Dean Bilton Iva Jovic has certainly got a bit of heart about her. Plenty of others would have wilted under that sort of early Sabalenka pressure, but the teenager did not take a backward step in the first set. She's still a set down though and will need something special to knock off the world number one. I'll tell you what won't help Jovic's cause though. Getting broken in the first game of the second set. A few untimely errors in the face of Sabalenka's powerful groundstrokes coughs up the advantage immediately. 'No pain no gain' S By Simon Smale I, for one, hate it when you can't find a pad to write your motivational quotes on. I can't see any of my colleagues being too happy with me writing it on their face instead, though - which is why I have refrained from writing anything on Dean for ages. He's here to take you through the second set. I'm not sold, still S By Simon Smale Vermont is the U.S. state synonymous with serving apple pie with cheese, but it should specifically be a sharp cheddar. Not the only dessert with cheese, there's also cannoli, knafeh, crostata, vatrushka, topfenstrudel, etc. Must hit that salty/sweet combo, so maybe there is something to the apple pie and cheddar combo! - Kate Sabalenka finally holds to win the first set! S By Simon Smale Wowza, what a battle! The longest game of the match so far at over 10 minutes long but Sabalenka survives it to take a set to love lead. (Getty Images) Sabalenka was put under pressure in that service game - she lost a point on first serve for the first time in the match so far, for one. Jović even managed to force a break point to really put the cat amongst the pigeons. But then those pigeons unloaded the rocket propelled grenade and blasted a monstrous ace to stave off that break point - her second of the game and fourth of the set. Jović still didn't go away, hitting a delightful winner to force deuce and then saw Sabalenka find the net to set up a second break point. Sabalenka saved that too, but Jović still didn't let up, a net cord from Sabalenka allowing Jović to come in and pounce with a winner for a third break point. The teenager's returning has been excellent, really forcing Sabalenka to think twice despite the power of her serve. But that service power was the difference in the end as Sabalenka held on to claim the set after 59 minutes. Jović holds again S By Simon Smale Sabalenka showed her pace and skill and touch by racing to a drop shot and earning a winner that made this hold more nervous for Jović But that was a big hold for the American. Had Sabalenka broken then and had the serve to start the second set, psychologically Jović would have always been behind. Just staying in the fight and keeping on the board is crucial for her heading into the second - not that the first is done yet - Sabalenka to serve for it. I'd expect so S By Simon Smale Are the empty seats on Rod Laver due to the hot weather? Surprising for a quarter final match. - Sinead Because you're absolutely right. It's never a good look for there to be any empty seats on a show court at any stage of a grand slam - let alone a quarterfinal. But the heat has to be taken into account I guess. Sabalenka a game away from the first set S By Simon Smale (Getty Images) It's strong stuff from Sabalenka. She went out to a 40-0 lead there but then dropped a couple of points off the back of a second double fault of the match. But a Jović unforced error puts Sabalenka on the brink of a set to love lead at 5-2. (Getty Images) Jović holds after 9-minute epic S By Simon Smale Wow, well done Iva Jović! She had to stave off two break points from 15-40 down, then another one in among a four-deuce extension to the game. But hold she did - a brave battle over 9 minutes and 23 seconds that will do her the world of confidence. There were flashes in that game of the way she has been able to aggressively control points like she has against all her opponents so far this tournament. But it's just so much harder to sustain against a player like Sabalenka who is just so powerful and loves to dictate things herself. Sabalenka's serve is sensational S By Simon Smale (Getty Images) Sealing a service game with an ace is not a bad way to do it. Sabalenka still hasn't lost a point when she's got her first serve in in this match — she's nine for nine. It's relentless. It's frankly, awesome. A stat just popped up that Sabalenka appears to have taken some speed off her first serve from last year, it's at 165km/h compared to 176km/h last year. But her average is back up at 176km/h today with a fastest of 188km/h. She leads 4-1. Jović gets on the board S By Simon Smale (Getty Images) That was a better, albeit, battling service game from Iva Jović. But the fear is that Sabalenka can still just out-muscle the teenaged American. Jović is getting caught in trying to exchange with the two-time champion from the baseline and is being beaten up as a result. Jović did mix things up on game point, throwing a slice or two in and a drop shot. But Sabalenka is a different beast this year, racing around the court and forcing the missed winner. (Getty Images) From there, Sabalenka struck, her relentlessness such a key factor in her success, to race into a break point chance. Jović fought hard to stave that off, and then got a bit of luck when a would-be winner clipped the net from Sabalenka. A good hold. A deserved hold. Less apple with the cheddar S By Simon Smale Hello Simon, the apple pie and cheese sounds good although I would substitute bacon and tomato for the apple... - Mike I think this suggestion is a good one, Mike. The thing that makes the whole concept a culinary crime is the addition of cheddar cheese to a sweet pasty though. So if you switch out the pasty for, I dunno, a burger bun, I reckon we're laughing. Loading Sabalenka serve at 100 per cent S By Simon Smale (Getty Images) Iva Jović crushed a brilliant winner off Aryna Sabalenka's second serve, stepping a pace inside the baseline and blistering a forehand into the open court. But it's only on the second serve that she's having success at the moment. Sabalenka has got six first serves in play so far and has won every point when she has. Sabalenka gets the early break S By Simon Smale That's impressive stuff from Aryna Sabalenka. (Getty Images) Iva Jović will need to be hitting her first serves if she is to have a chance in this game, but even getting them in didn't help her much in that game as Sabalenka won two of the three points when the first serve was made. A few unforced errors already in Jović's game, including sending the ball long on break point to surrender her serve. Sabalenka on the board first S By Simon Smale Strap yourselves in folks - this one is setting itself up nicely if this first game is anything to go by. Sabalenka came out with the power we expect, an ace to set up game point, an unreturnable serve to win it. But I get the feeling that bludgeoning her way across the court is not going to work as well as she hopes it will against Jović. The 18-year-old Jović hit an absolutely unreal backhand winner to open things up on the Sabalenka serve, two-handed, getting low and punching the ball to the baseline. It was a lovely shot and yes, only one point, but showed that she will not be bowed by the power. Sabalenka has more to her game than just brute force though - Luke Pentony wrote about that at the start of this tournament and it was in evidence in Brisbane as well. It should be a good test though, this. Show more posts",
    "source": "ABC",
    "cluster_id": 9
  },
  {
    "url": "https://www.abc.net.au/news/2026-01-27/cyclone-swell-surfing-broome-gantheaume-point/106271408",
    "title": "Surfers relish rare swell off Broome brought by ex-Tropical Cyclone Luana",
    "publish_date": "Mon, 26 Jan 2026 22:32:12 +0000",
    "category": "sports",
    "authors": [],
    "text": "Dozens of surfers have relished the opportunity of rare waves off Western Australia's far north, with ex-Tropical Cyclone Luana behind the swell.\n\nCars lined the sand on Gantheaume Beach in Broome, as spectators and photographers caught a glimpse of surfers battling stormy weather.\n\nCars lined the beach to get a glimpse of the rare swell. (ABC Kimberley: Ruby Littler)\n\nConditions at the beach are usually flat, calm and glassy, but wind and rain from Luana, which crossed over the weekend as a category two system, stirred up more swell than normal.\n\nLuana is currently a tropical low tracking inland and is expected to bring heavy rain to WA's interior in coming days.\n\n'Definitely a miracle'\n\nBroome resident Jac Coltman said it was great to see everyone out in the water.\n\nJac Coltman says locals have been treated to \"really good waves\". (ABC Kimberley: Dunja Karagic)\n\n\"It seems like everyone gets out when there's been a big storm, since it's the only time it brings in some good swell,\" Mr Coltman said.\n\n\"There's a real big current at the moment … so people are catching a few good ones. There is a bunch of people getting some really good waves.\"\n\nConditions were rough and choppy at Broome's Gantheaume Beach on Monday. (ABC Kimberley: Ruby Littler)\n\nThe prospect of irukandji jellyfish, crocodiles and sharks, all potential hazards of Broome's waters during the wet season, did not deter those keen to catch a wave.\n\n\"I'm more scared of irukandji than crocodiles, but there's a lot of swell so it'll push all them out,\" Mr Coltman said.\n\nKalani Henwood said while conditions could be better, for Broome, it was pretty good.\n\nKalani Henwood was among dozens of surfers catching waves at Gantheaume Beach. (ABC Kimberley: Ruby Littler)\n\n\"Every morning we're waiting, waiting for high tide, checking to see if there's surf … so it's made us all happy and made the town pretty happy too,\" Ms Henwood said.\n\n\" It's definitely a miracle, thank God. Everyone's been waiting for it. \"\n\nShe said this was the first time she was able to get a decent surf after a year living in town.\n\n\"Bit washy, bit windy, bit of a hard paddle out, but it's fun … it's good to see everyone get out and be there together,\" Ms Henwood said.\n\n'Brave souls'\n\nPhotographer Michael Torres, who runs a local surf account on Instagram, said he believed the surfing community was growing in Broome.\n\nMichael Torres runs a surf photography account. (ABC Kimberley: Ruby Littler)\n\n\"A couple of days ago, I counted about 60 out there on the water, so it's definitely grown over the last few years,\" Mr Torres said.\n\n\"Good to see a lot of young people getting out there and a lot of the girls getting out there as well.\"\n\nWhen describing the conditions since the cyclone, Mr Torres said it was definitely rougher than usual.\n\nIrukandji jellyfish are known to be present in the water during Broome's wet season. (ABC Kimberley: Dunja Karagic)\n\n\"Bit messy and windy, but a couple of brave souls out there … a lot of swell, big dumpers and wind,\" he said.\n\n\"There's only a few of us taking photos out here, and it is unique getting the cyclone swell, so just doing my part taking photos for everyone.\"",
    "source": "ABC",
    "cluster_id": 10
  },
  {
    "url": "https://www.abc.net.au/news/2026-01-27/bradman-baggy-green-fetches-record-price-at-auction/106272464",
    "title": "Bradman still setting records as baggy green fetches top price",
    "publish_date": "Mon, 26 Jan 2026 21:45:21 +0000",
    "category": "sports",
    "authors": [],
    "text": "A baggy green cap worn by Sir Donald Bradman in a series against India in 1947-48 has been sold for $460,000 at a Gold Coast auction, fetching the highest price for a cap sported by the great Australian batsman.\n\nBradman had given it to Indian cricketer Sriranga Wasudev Sohoni, whose family preserved it for the past 75 years.\n\nLee Hames, chief operating officer of Lloyds Auctioneers and Valuers, said the family had looked after the cap carefully.\n\nBradman's baggy green to go under the hammer A baggy green worn by Sir Donald Bradman during the 1947-48 series against India has gone to auction.\n\n\"That's over three generations under lock and key,\" he said.\n\n\"If you were a family member you were only allowed to look at it when you were 16 years old for five minutes.\"\n\nIt was sold to an anonymous bidder and will be kept on display at an Australian museum.\n\nThe cap, which has the names \"D.G. Bradman\" and \"S.W. Sohoni\" inscribed on the inside, is in good condition.\n\nAnother cap worn by Bradman was sun-faded and insect-damaged when it fetched $311,000 at auction in 2024.\n\nGreatest batsman in history\n\nWidely regarded as the greatest batsman in history, Bradman played 52 tests with a batting average of 99.94, nearly 40 runs higher than any other player.\n\nThe price paid for the cap, once a 16.5 per cent buyer's premium of $75,900 is added, totals $535,900, beating the previous record holder, a baggy green from the same series — against India in 1947/48 — that was sold in 2024.\n\nThe day a Bodyline bowler found himself pipped by pomegranates Flying fruit pips are less menacing than the cork and leather cricket balls that Harold Larwood hurled at Australian batsmen during the infamous Bodyline series, but a showdown between the English fast bowler and a disgruntled crowd that was allegedly armed with pomegranate seeds is part of the rich story of Ashes acrimony.\n\nThat cap was bought for $479,700, including the buyer's premium, at auction.\n\nBack in Bradman's day, a baggy green cap was awarded for each series they played — a contrast to the present day where only one cap is handed out on Test debut.\n\nSohoni died in 1993, aged 75.\n\nThe 1947/48 series was notable for being India's first as an independent country and Bradman's last on home soil.\n\nBradman made it a memorable one, scoring 715 runs — including his 100th first-class century — as the Australians romped to a 4-0 series win.\n\nAFP/Reuters",
    "source": "ABC",
    "cluster_id": 11
  },
  {
    "url": "https://www.abc.net.au/news/2026-01-27/australia-finalises-winter-olympics-team/106272472",
    "title": "Australia's final Winter Olympians named as first athletes touch down in Italy",
    "publish_date": "Mon, 26 Jan 2026 21:33:35 +0000",
    "category": "sports",
    "authors": [],
    "text": "Three alpine skiers have been officially added to finalise Australia's Winter Olympics team for the Milan-Cortina Games.\n\nPhoebe Heaydon, Madison Hoffman and Harry Laidlaw were added to the 53-strong Australian team, which began to arrive in Italy yesterday.\n\nSydneysiders Hoffman and Heaydon will make their Olympic debuts in the slalom and giant slalom events.\n\nHoffman was selected for the Beijing 2022 Winter Olympics team but was injured just days out from the Games and had to withdraw.\n\nPyeongChang 2018 Olympian Laidlaw will make his return in the giant slalom.\n\nHarry Laidlaw was disqualified after missing a gate in the giant slalom at the 2018 Winter Olympics. (Getty Images: Matthias Hangst)\n\n\"Harry, Phoebe and Madison have each carved their own path through one of the most competitive global winter sports,\" Australian Winter Olympics team chef de mission Alisa Camplin said.\n\n\"Their selection is a testament to years of discipline, resilience and gritty performances. To be amongst the world's best is an outstanding achievement. I can't wait to see them in action.\n\n\"Harry has waited eight long years to get another run at the Games, and Madi has come back from the heartbreak of injury at Beijing 2022 and a double knee reconstruction. These are truly inspiring stories of determination and belief.\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\n\"Watching Phoebe's progression this season, to make her World Cup debut has been fantastic. She's only 20 years old. How great is it to see Australia's next-generation athletes rising to the top?\"\n\nMembers of the aerials, cross-country and bobsleigh teams were the first athletes to arrive at the Australian Institute of Sport's European training centre in Varese, with an Aussie lunch held to coincide with Australia Day.\n\nThey were welcomed by Julianne Cowley, Australia's ambassador to Italy, and local officials.\n\nThe Milan-Cortina Games get underway on February 6 (local time).\n\nThe ABC of SPORT Sports content to make you think... or allow you not to. A newsletter delivered each Saturday.\n\nAAP",
    "source": "ABC",
    "cluster_id": 12
  },
  {
    "url": "https://www.abc.net.au/news/2026-01-27/feed-relief-for-wa-pastoralists-in-drought/106263028",
    "title": "Truckies drive 1,700km to deliver hay amid WA's deepening drought",
    "publish_date": "Mon, 26 Jan 2026 21:32:30 +0000",
    "category": "finance",
    "authors": [],
    "text": "Years of little rainfall across an enormous stretch of Western Australia have given way to what some pastoralists are calling their worst drought in decades.\n\nCattle stations across WA's remote Midwest, Murchison and Gascoyne, an area larger than the state of Victoria, have received barely half their average annual rainfall in recent years.\n\nWhile some are drier than others, it has forced 34 properties to call for help.\n\nThat call was answered in force by WA's agricultural community over the weekend, with seven road trains stacked high with emergency feed arriving in Gascoyne Junction, 945 kilometres north of Perth.\n\nSeven road trains have carried emergency feed to Gascoyne Junction. (ABC News: Alistair Bates)\n\nThe delivery of hundreds of hay bales was a welcome sight for pastoralists like Hamish McTaggart from Bidgemia Station.\n\nMr McTaggart told the ABC his property was experiencing its driest spell in 15 years, and possibly one of the worst since records began in 1875.\n\n\"There is a point where it doesn't matter how good you are as a farmer, the system just breaks down,\" he said.\n\n\"We're at that point at the moment.\"\n\nHamish McTaggart says he is experiencing one of the worst dry periods ever recorded at Bidgemia Station. (ABC News: Alistair Bates)\n\nMr McTaggart said the uncertainty was taking a toll.\n\n\"You don't know when the end will be, so you're always hopeful that rain is just around the corner,\" he said.\n\n\" Not knowing where the end of it is — that's what worries you. \"\n\nMore feed is due to head to the Upper Gascoyne in the coming weeks. (ABC Pilbara: Georgia Hargreaves)\n\nIt is a similar story 150km to the east at Landor Station, where owner Ritchie Brennan told the WA Country Hour he had gone three years without decent rainfall.\n\n\"It's the driest it's ever been since we've owned it,\" he said.\n\nMr Brennan purchased Landor Station 28 years ago.\n\nSome stations in the Upper Gascoyne have not recorded a drop of rain in three years. (ABC Pilbara: Alistair Bates)\n\nAid almost derailed by bushfires\n\nFarmers Across Borders vice president Roley Pearce said the land's poor condition was clear as he made the 1,700km journey north.\n\n\"It's just devastating,\" he said.\n\nRoley Pearce led the Farmers Across Borders convoy. (ABC Pilbara: Alistair Bates)\n\nMore road trains are expected to arrive in the coming weeks.\n\nBushfires raging in WA's South West and Great Southern caused route and personnel changes up until the moment of departure.\n\n\"We've lost a few of the trucks that were coming on the run because the drivers are off fighting fires,\" he said.\n\n\"Otherwise, we would have had another four trucks here today.\"\n\nTruckies and pastoralists swapped stories at the local watering hole. (ABC Pilbara: Alistair Bates)\n\nDespite the challenges, he said the act of compassion was as important as the hay itself.\n\n\"At the end of it, a lot of the station owners have got that thought that somebody else does care about them, that they're not on their own,\" Mr Pearce said.\n\n\" That's what we're up against. \"\n\nCalls for state government support\n\nThis was the latest convoy launched by Farmers Across Borders, with the group establishing a reputation for the long-distance delivery of emergency feed.\n\nLast year, the group rallied 85 trucks to deliver 6,000 bales of hay and straw to drought-stricken pastoralists in South Australia.\n\nThe run was subsidised by the South Australian government, which covered freight costs.\n\nJim Caunt is calling for the state government to pitch in. (ABC Pilbara: Alistair Bates)\n\nUpper Gascoyne Shire President Jim Caunt said he wrote to WA Agriculture Minister Jackie Jarvis to ask if she would consider a similar scheme.\n\nHe is yet to receive a response.\n\n\"You've only got to look around here at just how spirits are lifted … from a half dozen trailers of hay that have arrived,\" he said.\n\n\" We need the support of the state government so that this can continue. \"\n\nFuel for just one road train to and from Gascoyne Junction costs the charity group about $5,000, according to Mr Pearce.\n\nSeveral pastoralists have destocked, with not enough feed to go around. (ABC Pilbara: Georgia Hargreaves)\n\nMs Jarvis declined to be interviewed.\n\nBut in a statement, she commended the organisation for its efforts and recognised some parts of the state had been more impacted due to \"increased climate variability\".\n\n\"I am currently seeking advice from the Department of Primary Industries and Regional Development on this evolving situation,\" she said.\n\n\"There is also a range of supports available through the Australian Government at Drought, disaster and rural support — DAFF.\"",
    "source": "ABC",
    "cluster_id": 13
  },
  {
    "url": "https://www.abc.net.au/news/2026-01-27/houseboat-owners-forced-off-noosa-river-as-crackdown-looms/106267124",
    "title": "Houseboat owners say they are forced out to protect million-dollar views",
    "publish_date": "Mon, 26 Jan 2026 21:01:41 +0000",
    "category": "finance",
    "authors": [],
    "text": "A David and Goliath battle is playing out on the multi-million-dollar shores of the Noosa River, where dozens of houseboat residents say they are being forced out and potentially into financial ruin.\n\nSince New Year's Day, Maritime Safety Queensland (MSQ) has been rolling out the final stage of its Noosa River Management Plan, which restricts boats larger than 5 metres from anchoring in the river for longer than 28 days.\n\nHouseboats on the Noosa River. (ABC News: Tara Cassidy)\n\nFor dozens of people living on the river, it may mean they have until tomorrow to remove their boats or face hefty fines.\n\nThey also risk the potential removal and disposal of their homes and property by authorities.\n\nMore than 20 boats have already been towed, including several that were taken straight to the tip.\n\nSally Hayes says people will be left without somewhere to live. (ABC News: Tara Cassidy)\n\nSally Hayes lives in a houseboat on the river.\n\nShe said many of those affected had nowhere else to go and no way of paying to crane, relocate or store the boats elsewhere.\n\n\"There are people who've lived on this river for 35 years,\" she said.\n\n\"But more recently, with the homelessness crisis really exploding, there's been a lot of people who've moved onto boats simply because they can't afford to live anywhere else.\n\n\"And now what we've got is MSQ, backed by council, forcing these people off.\"\n\n'A lot of homeless in rich little town'\n\nNoosa River resident Bradley McMahon has lived in the area on and off for more than 30 years.\n\nHe said the changes also failed to consider that many of the boats were not equipped to move to other waters.\n\nBradley McMahon and his dog head back to their houseboat home on the Noosa River. (ABC News: Tara Cassidy)\n\n\"They're only built for rivers, lakes and estuaries,\" he said.\n\n\"They seem to forget that we have at the entrance to the river one of the most dangerous bar crossings in the country.\n\n\"So, if they force people to then crane their vessels [out], that's going to force them into financial hardship.\n\n\"This is affecting people's lives. There's already a lot of homeless people in this rich little town.\"\n\nBradley McMahon, Tya Gilleard, Sally Hayes and Rachel Hill are unhappy about the rule change. (ABC News: Tara Cassidy)\n\nMs Hayes said being forced off the river would also cost some residents their jobs.\n\nSafer, more accessible river\n\nThe MSQ said the goal of the changes was \"to make the river safer and more accessible for all waterway users\".\n\nThe changes apply to the river and connecting waterways, creeks, surrounding lakes and the Noosa Everglades.\n\n\"Anyone experiencing genuine hardship should contact Maritime Safety Queensland,\" a spokesperson said.\n\n\" These changes are the result of extensive community consultation taking place since 2021. \"\n\nMaritime Safety Queensland patrols the Noosa River ahead of the new houseboat rules coming into force. (Supplied: Rachel Hills)\n\nDerelict boats an 'eyesore'\n\nThe changes follow complaints from a number of Noosa riverfront property owners who have long argued the boats are an eyesore, and at times left abandoned and derelict.\n\nRachel Hill said she took out a loan to purchase her houseboat and planned to live in it from this year.\n\nRachel Hill says the rule change has upended her housing plans. (ABC News: Tara Cassidy)\n\nBut before ever getting to enjoy her live-aboard life, she was labelled a \"freeloading scumbag\" by a man who told her residents had \"paid millions for our view\".\n\n\"I just replied and kindly said, 'I'm not a freeloading scumbag, I have a loan to pay off, I work full-time, I pay rent, I work in aged care,'\" she said.\n\n\" I'm sure the bloody houseboats were on the river when you bought your million-dollar views. \"\n\nMs Hayes said the anchoring changes still would not solve the \"eyesore\" problem, with many of the worst boats able to remain because they were moored.\n\nMany of the residents being forced out have been on mooring waitlists for years.\n\nThis houseboat is allowed to remain on the Noosa River because it is moored. (ABC News: Tara Cassidy)\n\n\"The boats that are being used, and actually housing people and being looked after, are being pushed off the river,\" she said.\n\n\"A lot of the colour, the fabric of Noosa is going to be gone, the people who make up this beautiful, vibrant community.\"",
    "source": "ABC",
    "cluster_id": 14
  },
  {
    "url": "https://www.smh.com.au/business/companies/gateway-drills-into-wa-yandal-gold-discovery-momentum-20260127-p5nxcb.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Gateway drills into WA Yandal gold discovery momentum",
    "publish_date": "Tue, 27 Jan 2026 13:24:12 +1100",
    "category": "finance",
    "authors": [
      "Rowena Duckworth"
    ],
    "text": "Advertisement\n\nSponsored BusinessCompaniesBulls N' Bears Gateway drills into WA Yandal gold discovery momentum Brought to you by BULLS N’ BEARS Rowena Duckworth January 27, 2026 — 1:24pm Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share A A A\n\nGateway Mining has fired up the drill bit at its flagship Yandal gold project in Western Australia, bringing forward exploration plans to accelerate definition of the emerging Haflinger discovery and line up follow-up reverse circulation (RC) drilling in the coming weeks. The rods off two aircore rigs are now turning, with the first rig focused on infill and step-out drilling around Haflinger, where mineralisation has already been intersected over a strike length of approximately 500 metres. Initial drilling results have highlighted the system’s strength, despite several holes only clipping the targeted structure during first-pass programs. Drilling at Gateway Mining’s Yandal gold project in Western Australia. Standout intercepts from earlier drilling at Haflinger included a hefty 52 metres running at 1.4 grams per tonne (g/t) gold from 64 metres, including a higher-grade interval of 12m at a cool 3.1g/t gold. That campaign also returned 2m at 3.4g/t gold from 148m to bottom of hole, within a broader 6m grading 1.4g/t gold from 144m, and 4m going 2.9g/t gold from 148m within a broader 16m at 1.0g/t gold from 136m.\n\nAdvertisement\n\nGateway says the mineralisation tends to occur within a highly favourable structural setting, where the mafic–intermediate rock contact flexes to the south-east. Notably, drilling remains open to the south, where geological conditions appear to be improving, adding further upside to the discovery. ‘... Drilling remains open to the south, where the geology appears to become more favourable.’ Gateway Mining executive chairman Andrew Bray The first aircore rig is set to complete closer-spaced drilling to the north and south of existing intercepts to delineate the structure ahead of RC drilling. Management believes this next phase of drilling will be key to understanding the true scale of the Haflinger system. Meanwhile, the second aircore rig will systematically test the Mustang shear structure to the south, where Gateway is confident of making discoveries similar to Haflinger. Mustang offers a comparable geological setting, with significant deformation and complexity, supported by historic rotary air blast (RAB) drilling that returned anomalous gold results; however, it failed to penetrate the weathered profile adequately.\n\nAdvertisement\n\nThe company is keen to complete first pass drilling at Mustang as quickly as possible, allowing any discoveries to be rapidly followed up with RC drilling alongside Haflinger. Drilling plans have been ramped up to define the extent of the Haflinger discovery in preparation for follow-up RC drilling. Gateway Mining executive chairman Andrew Bray said: “Mineralisation at Haflinger has been intersected over approximately a 500m strike length to date, with the first two aircore holes clipping the targeted structure prior to blade refusal, and a third hole returning a spectacular result of 52m at 1.4g/t gold, including 12m at 3.1g/t gold. Drilling remains open to the south, where the geology appears to become more favourable.” The Haflinger find emerged from wide-spaced, shallow aircore along the company’s regional-scale Celia Shear structure, tapping into the same fertile structure that hosts the company’s existing 400,400-ounce, high-grade gold resource. RC drilling is scheduled to kick off in a little over six weeks. It will initially focus on the Great Western area, where widespread surface gold anomalism and abundant gold nuggets have been identified over a broad area within a highly favourable geological setting. As soon as the all-important assay results from the broader Mustang–Celia shear corridor aircore program hit the company inbox, drilling will pivot to initial RC programs at Haflinger and to any additional discoveries warranting follow-up.\n\nAdvertisement\n\nThe Yandal project sits strategically just 85 kilometres northeast of Wiluna, spanning a vast 1,780 square kilometres on the eastern flank of the world-class Yandal Greenstone Belt. The belt is one of Australia’s most prolific gold-producing regions and is home to Northern Star Resources’ Jundee mine, which lies within close proximity to Gateway’s tenure. Gateway’s broader Yandal project already hosts a resource of 8.17 million tonnes grading 1.52g/t gold for 400,400 ounces. The resource is centred on the Horse Well Gold Camp and the Dusk ’til Dawn deposit, providing a solid foundation for ongoing exploration success. With gold prices soaring, Gateway is wasting little time in pushing its Yandal gold strategy forward as it hunts for the next significant discovery in one of Western Australia’s most prolific gold belts. Is your ASX-listed company doing something interesting? Contact: mattbirney@bullsnbears.com.au",
    "source": "SMH",
    "cluster_id": 15
  },
  {
    "url": "https://www.smh.com.au/sport/tennis/australian-open-2026-live-updates-demon-in-alcaraz-showdown-us-teen-challenges-sabalenka-gates-open-early-on-sweltering-day-20260126-p5nx3m.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Australian Open 2026 LIVE updates: Demon in Alcaraz showdown; Sabalenka smashes into semis; Players get cooling breaks",
    "publish_date": "Tue, 27 Jan 2026 13:20:34 +1100",
    "category": "sports",
    "authors": [
      "Danny Russell",
      "Scott Spits"
    ],
    "text": "Two years ago, our reporter Angus Dalton experienced just what extreme heat can do to your body in a climate chamber on a 38-degree January day at about 20 per cent relative humidity.\n\nAs you read the lines below, spare a thought for the tennis players battling it out in today’s scorcher.\n\nReporter Angus Dalton spent time in a climate chamber. Credit: Photo: Brook Mitchel; Artwork: Marija Ercegovac\n\n“Back in the chamber, after about 20 minutes, even sitting down doesn’t feel like a break,” Dalton wrote.\n\n“It’s as if my body is working so hard to keep cool that my energy levels aren’t being replenished. The researchers can track the effects on core body temperature (measured by a digestible pill monitor), skin warmth and metabolic rate, as well as how much sweat a subject is losing and where it gathers on their bodies. In my case, we’ve tracked the effort my body has to make to keep cool by one simple measure: my heart rate.\n\nRead the full explainer on heat stress here.",
    "source": "SMH",
    "cluster_id": 16
  },
  {
    "url": "https://www.smh.com.au/world/europe/the-ultimate-labor-insider-stepping-into-london-s-hot-seat-20260127-p5nx6g.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "The ultimate Labor insider stepping into London’s hot seat",
    "publish_date": "Tue, 27 Jan 2026 13:19:12 +1100",
    "category": "finance",
    "authors": [
      "David Crowe"
    ],
    "text": "Advertisement\n\nAnalysis WorldEuropeUK politics The ultimate Labor insider stepping into London’s hot seat David Crowe January 27, 2026 — 1:19pm Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share A A A\n\nLondon: The Australian wine flowed freely in London on Monday night when Jay Weatherill marked his first official day as the nation’s new high commissioner to the United Kingdom.\n\n\n\nThe commission staff threw open the doors to Australia House, their imposing headquarters on The Strand, and welcomed politicians, diplomats, business chiefs and expatriate Australians to celebrate the national day. Former South Australia premier Jay Weatherill is now Australia’s high commissioner to the UK. Alex Ellinghausen Weatherill, a Labor insider and former South Australian premier, was given an effusive welcome. But he arrives in London at a fraught time for Britain and Australia, two countries that talk often about the strength of their relationship, and he could be in for a wild ride. Both countries are caught in an American tornado, as US President Donald Trump upends the old world order, and will count on each other to help deal with the turbulence. Weatherill has to bring the allies even closer together. This sounds easy, judging by the mood on Monday night. Every speech highlighted the rivalry between colonist and colony in a way that few other countries laugh about as much.\n\nAdvertisement\n\nSeema Malhotra, the parliamentary under-secretary for the Foreign Office, quipped that the UK had given Australia cricket and almost lived to regret it. Chris Bryant, the trade minister, said he no longer cared about rugby now that Australia was so good at it. The audience laughed beneath the extravagant marble decorations of the Exhibition Hall of Australia House, famously used as the setting for Gringotts Wizarding Bank in the Harry Potter movies. Spotted in the crowd were a handful of British ministers and Sir Clive Alderton, the private secretary to King Charles III. Australia House in London dressed in green and gold to celebrate Australia Day. Weatherill seems ideally qualified to bridge any divide between the two countries. His mother left an office job in Adelaide at the end of the 1950s for a holiday in Europe. His father, born into poverty in northern England and hoping for a better life elsewhere, met her on the ship that carried them both to Australia in 1960. They fell in love on board to the music of Frank Sinatra, Weatherill told the crowd. More to the point, Weatherill proved to be an adept political leader when holding power in the hung parliament in South Australia after the state election of 2014. He has a talent for conveying calm. (Also in the audience on Monday, incidentally, was Steven Marshall, the state Liberal leader who lost that 2014 election. Marshall defeated Weatherill at the next one, in 2018. They still get along.)\n\nAdvertisement\n\nWeatherill is also trusted by Prime Minister Anthony Albanese and Foreign Minister Penny Wong. (He dated Wong when they were young). Nobody mentioned Trump in the speeches on Monday night, but everybody knows the code words for the era he has unleashed. Bryant talked of a troubled world, while Malhotra spoke about the need for a rules-based order in a world that is fragmented and unstable. Weatherill talked about the strength of British and Australian democracies. “Our collective commitment to unity, respect and pride in our Australian identity matters more than ever in a world that is less certain and more polarised,” he said. “I think this is a really important time for us to reflect on our shared values and our shared history as we all try and make sense together of this uncertain world.” Albanese is so close to UK Prime Minister Keir Starmer that the two leaders can talk directly when they wish, with no need for diplomats to smooth the way.\n\nAdvertisement\n\nWhen Starmer wanted to send a centrist message to the divided Labour faithful at the UK party’s annual conference in Liverpool last year, he arranged a keynote speech for Albanese. The address, controversial in Australia because it was so overtly political, reminded Labour MPs to keep calm, hold the middle ground and stick with their leader. Anthony Albanese and UK Prime Minister Keir Starmer at 10 Downing Street last September. Bloomberg Starmer and his wife, Victoria, had Albanese for dinner at No. 10 Downing Street last September with his partner – now wife – Jodie Haydon. They were joined by Canadian Prime Minister Mark Carney and his wife, Diana. Albanese brought a four-pack of beer, signalling the easy-going unity of the centre-left leaders. The challenges for Weatherill are about what is happening outside, not within, the Australian relationship with Britain. First is the pressure from Trump. It is barely a week since he threatened tariffs of 10 per cent, rising to 25 per cent, on eight NATO allies because they disagreed with him on his takeover plan for Greenland. He retreated, but not before every American ally got the message. The UK and Australia, like other allies, are on notice to expect further threats at any moment.\n\nAdvertisement\n\nRelated Article Updated\n\nTrump diplomacy Trump retreats on Greenland threats as ‘framework for a future deal’ discussed The key task for the UK and Australia, along with other liberal democracies, is to work together and hold their collective nerve the next time Trump goes on the attack. This is the approach that helped the UK and its European allies last week over Greenland. Carney argued for this unity from all middle powers in his address to the World Economic Forum in Davos – the speech that seems to have infuriated Trump. The second challenge is to make AUKUS a reality. As a South Australian, the new high commissioner has skin in the game. His home state needs to see faster progress on setting up the facilities and hiring the workers to construct the country’s next submarine fleet, and this means relying on two British companies: BAE for the vessels and Rolls-Royce for the nuclear power plants. Australia and the UK are equally troubled on AUKUS because neither country has a practical plan B. Australia will be more vulnerable to China without a new fleet, while the UK will be totally exposed to Russia. Both need Trump, and later US presidents, to back the pact. The US support is meaningless, however, if the British and the Australians cannot build the new vessels fast enough. The third challenge is dealing with the turmoil of British politics. Starmer is unpopular with voters, mocked by the media and derided within his own party. His chief opponent, Nigel Farage of Reform UK, appeals to disgruntled voters with a rallying cry borrowed from Trump.\n\nAdvertisement\n\nRelated Article Opinion\n\nUK politics Westminster woes deepen for UK Labour. Sussan Ley should take note George Brandis Former high commissioner to the UK and federal attorney-general Weatherill has to navigate a Labour government in Westminster that is cracking under the pressure from Farage and struggling to set a direction under Starmer. Rivals are parading in the Labour caucus, and the media, in the hope they will replace Starmer when the spill comes – and that means nobody at Australia House can be sure who will stand and who will fall. In a sense, Weatherill will be trying to bring two governments closer together while one of them tears itself apart. Get a note directly from our foreign correspondents on what’s making headlines around the world. Sign up for our weekly What in the World newsletter.",
    "source": "SMH",
    "cluster_id": 17
  },
  {
    "url": "https://www.smh.com.au/national/australia-news-live-ley-s-allies-confident-she-will-remain-party-leader-melbourne-to-swelter-in-worst-heatwave-since-black-saturday-20260127-p5nx6r.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Australia news LIVE: Ley’s allies confident she will remain party leader; Melbourne to swelter in worst heatwave since Black Saturday",
    "publish_date": "Tue, 27 Jan 2026 13:12:20 +1100",
    "category": "sports",
    "authors": [
      "Emily Kaine"
    ],
    "text": "Sepp Blatter, the former FIFA President charged and later twice acquitted of corruption, has backed a proposed fan boycott of matches in the US when the Soccer World Cup gets under way later this year.\n\nThe US is hosting the cup with Mexico and Canada in June and July, but recent conduct by President Donald Trump has led to some urging fans to stay away from the states when it begins.\n\nThe international soccer community’s concerns about the United States stem from Trump’s expansionist posture on Greenland, travel bans and aggressive tactics in dealing with migrants and protesters in American cities, particularly Minneapolis.\n\nBlatter was the latest international soccer figure to call into question the suitability of the United States as a host country.\n\nHe called for the boycott in a post on X that supported Mark Pieth’s comments in an interview last week with the Swiss newspaper Der Bund.\n\nPieth, a Swiss attorney specialising in white-collar crime and an anti-corruption expert, chaired the Independent Governance Committee’s oversight of FIFA reform a decade ago.\n\nBlatter was president of the world’s governing body for soccer from 1998-2015; he resigned amid an investigation into corruption.\n\nIn his interview with Der Bund, Pieth said, “If we consider everything we’ve discussed, there’s only one piece of advice for fans: Stay away from the USA! You’ll see it better on TV anyway. And upon arrival, fans should expect that if they don’t please the officials, they’ll be put straight on the next flight home. If they’re lucky.”\n\nIn his X post, Blatter quoted Pieth and added, “I think Mark Pieth is right to question this World Cup.”\n\nElsewhere, Oke Göttlich, president of the Bundesliga club St. Pauli and a vice president of the German Football Association, said that the time had come to “seriously consider and discuss” a boycott, according to an interview in the Hamburger Morgen Post.\n\nThe tournament has also been criticised for exorbitant ticket prices.\n\nWith AP, Bloomberg",
    "source": "SMH",
    "cluster_id": 18
  },
  {
    "url": "https://www.smh.com.au/culture/live-reviews/melbourne-review-wrap-last-dinner-party-20260116-p5nuk6.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Can love conquer all in this collision of tennis and relationship drama?",
    "publish_date": "Tue, 27 Jan 2026 13:11:37 +1100",
    "category": "sports",
    "authors": [
      "Cameron Woodhead",
      "Giselle Au-Nhien Nguyen",
      "Jessica Nicholas",
      "Sonia Nair",
      "Andrew Fuhrmann",
      "Will Cox"
    ],
    "text": "Advertisement\n\nKey points THEATRE: Tennis and theatre collide in Australian Open at Theatre Works\n\nMUSIC: David Byrne performs at Sidney Myer Music Bowl\n\nTHEATRE: Burgerz at Malthouse Theatre is a remarkable work of performance art\n\nDANCE: This Nutcracker is the ballet equivalent of a fun-size chocolate bar\n\nCIRCUS: Circa offer a new spin on Swan Lake with their highly athletic Duck Pond\n\nTHEATRE\n\nMIDSUMMA | Australian Open ★★★\n\nTheatre Works, until January 31 A tennis match starts at love all, as we know, but off the court, should we love all, or only one person? The contest between monogamy and ENM (ethical non-monogamy) inspires an energetic rally at the start of Angus Cameron’s Australian Open, a queer domestic comedy that serves up aces of absurdity, rapid-fire volleys of wit, and heavy groundstrokes of camp and cringe, even if it does take a while to find its rhythm and play itself into form. Performers Melissa Kahraman, Eddie Orton and Sebastian Li in the show. Sarah Clarke Felix (Sebastian Li) is thinking of marrying his tennis-pro boyfriend of six years Lucas (Eddie Orton), and his bourgie parents Belinda and Peter (Jane Montgomery Griffiths and Alec Gilbert) are slightly appalled that their son and his partner might pursue an open marriage. An embarrassing game of doubles ensues as they banter and bicker and take turns fussing over “World No.3” Lucas – ignoring the fact it’s their son’s birthday – causing Felix to abandon the encounter before the set is out.\n\nAdvertisement\n\nBoth couples are moved to imagine the grass might be greener. Stay-at-home dad Peter begins to wonder if he has repressed his attraction to men. All-conquering career woman Belinda feels the comfortable confines of married life might be preventing her from adventures scaled to her ambition – like, you know, climbing Mount Everest. Alec Gilbert with Eddie Orton in Australian Open. Sarah Clarke They decide on a trial separation to embrace radical self-discovery, while Felix and Lucas flirt with the idea (equally radical to them) of monogamy, tying themselves in knots over whether to tie the knot. Sibling rivalry enters the fray when Felix’s sardonic sister Anabelle – an experimental physicist living in Switzerland, who starts the play atop a referee’s chair – makes a surprise Christmas visit. She wants her parents to divorce; her brother is determined they should stay together. Ludicrous situational comedy unfolds as we get to the pointy end of the family farce, with daddy issues, vomit-inducing proposals and sexual fetish emerging in a satirical collision of the gay and the straight that delivers a kinky subversion of het-suburban mores, and questions received ideas about what’s normal for gay men into the bargain.\n\nAdvertisement\n\nComic theatre design leans heavily into the gay tennis vibe – a cast dressed in athletic whites, the stage resembling a deconstructed play court under (what else?) a constellation of disco balls, and it’s flexible enough to evoke locales as diverse as gay clubs and the snowbound peaks of the Himalayas. Cameron’s social satire can feel a bit dated given cultural trends in the 2020s, from the enshittification of gay dating apps to the mainstreaming of ENM and “situationships”, as well as greater gender diversity and fetish of all kinds across the spectrum of sexual orientation. Sebastian Li as Felix and Alec Gilbert as his father, who begins to question his own sexuality. Sarah Clarke The performances could refine the timing and flow of the comedy, especially in clunky early scenes, and perhaps find a more precise relationship to caricature. Still, the more ridiculous the play becomes, the better the comic acting gets, with plenty of physical and verbal humour and laugh-out-loud outrageousness that should have audiences leaving on a high. Reviewed by Cameron Woodhead\n\nAdvertisement\n\nMUSIC\n\nDavid Byrne ★★★★★\n\nSidney Myer Music Bowl, January 22 At his first Melbourne show since 2018, David Byrne shares a quote from director John Cameron Mitchell: “Love and kindness are the most punk things you can do.” Byrne was unsure of this at first – isn’t punk about anger? But then, on reflection, he agrees: “Love and kindness are indeed a form of resistance.” David Byrne performing at the Sidney Myer Music Bowl with his 12-strong crew of musicians and dancers, all dressed in orange boiler suits. Richard Clifford Byrne’s latest tour, off the back of his 2025 album, Who is the Sky?, combines politics and playfulness. Rising to fame as the esoteric frontman of new-wave legends Talking Heads, Byrne has moved, chameleonic, through ages and stages. He’s always shone as a live performer, using his weirdness as an artistic superpower: Talking Heads’ 1984 concert film, Stop Making Sense, provided a new blueprint for what live music could be; Byrne’s 2018 tour, American Utopia (later turned into a 2020 concert film directed by Spike Lee), injected commentary on Black Lives Matter and low voter turnout.\n\nAdvertisement\n\nIn Melbourne, Byrne projects the image of the decapitated King George V statue to laughter and cheers; on T-Shirt, contemporary slogans flash up on the screen, with “Make America Gay Again” a crowd favourite. 1979’s Life During Wartime is more sobering – images of protests and ICE raids backdrop Byrne and his 12-strong crew of musicians and dancers, all dressed in orange boiler suits. At 73 Byrne is as energetic as ever, and his voice rings out, bell-clear, over the crowd. Clever lighting and design choices heighten the drama – the lights flash off for a beat in This Must Be the Place (Naive Melody), and a flashing rig turns Byrne and his crew into lightning rods themselves. David Byrne performing at the Sidney Myer Music Bowl on Thursday night. Richard Clifford There are inspired arrangements here, breathing new life into old songs: opening number Heaven is gorgeously transformed with string accompaniment, and Psycho Killer – which Byrne has recently started performing live again for the first time in almost 20 years – blooms into a full-band rendition, arranged by the late composer Arthur Russell. There are throwbacks to Stop Making Sense in the arrangements and choreography of Houses in Motion and Slippery People. Byrne’s appeal is timeless, with young and old in attendance – he keeps up, too, covering Paramore’s Hard Times so convincingly you’d be forgiven for mistaking it for a Talking Heads B-side. It’s the classics that endure, though. By the time Once in a Lifetime and Burning Down the House roll around, there’s a sense of pure ecstasy in the air. Love, kindness and a healthy dose of weird – same as it ever was.\n\nReviewed by Giselle Au-Nhien Nguyen\n\n\n\nAdvertisement\n\nMUSIC\n\nJames Muller Quartet ★★★★\n\nThe JazzLab, January 25 James Muller might be one of Australia’s finest jazz musicians, but opportunities to see the guitarist outside his home city of Adelaide are exceptionally rare. Muller did perform at last year’s Melbourne International Jazz Festival (as part of a project led by Linda May Han Oh), but it’s been years since he last appeared here leading a band of his own. Jazz musician James Muller took a while to get back to Melbourne with a band of his own, but the wait was worth it. And it’s been a full decade since he shared the stage with the players he considers his favourite bandmates in the country: trumpeter Mat Jodrell, bassist Sam Anning and Perth drummer Ben Vanderwal. So it’s no surprise that JazzLab was packed to the rafters on Sunday night, as Muller reassembled this Adelaide-Melbourne-Perth dream team to premiere a clutch of new compositions. Opening tune Blake set the scene – taut, theme-skipping and darting across a sea of choppy polyrhythms. Like many of the tunes we heard that night, it was a complex piece that kept the players – and the audience members – on their toes, requiring intense focus and impeccable precision.\n\nAdvertisement\n\nJodrell’s role was especially demanding, his trumpet often mirroring Muller’s unpredictable lines as Anning’s bass and Vanderwal’s drums slithered and skittered beneath them. Yet somehow, the players never sounded tense or tentative. On the contrary, all four beamed with delight, clearly relishing one another’s musical company. Related Article Cinema ‘From its first preview on stage, producers were contacting me to make it a film’ Not every tune was a vigorous workout. Wishing Doll was warm and breezy, the leader’s eloquent guitar chiming in graceful tandem with Jodrell’s flugelhorn. And the night’s solitary ballad – Never Let Me Go – was gorgeously restrained, with delicate filigree from Muller and a wistfully lyrical solo from Anning. The final number saw the energy lift once more, the players grinning broadly as they engaged in virtuosic sparring over an ebullient theme. “See you in another 10 years!” joked Muller as the band left the stage, enveloped by the cheers of the crowd. Let’s hope it’s not that long.\n\nReviewed by Jessica Nicholas\n\nAdvertisement\n\nTHEATRE\n\nBurgerz ★★★★\n\nMalthouse Theatre, until January 31 The burger. It could be filled with anything, though it’s quintessentially beef. It could be a hot dog if it was presented differently, but that’d be something entirely separate. Customisable toppings add an element of experimentation, but the structural confines of what constitutes a burger remain. Travis Alabanza makes a burger from scratch on-stage in Burgerz. Dorothea Tuch Are we still talking about burgers? Yes and no. British theatre maker Travis Alabanza has transformed the very thing that was hurled at them by a transphobic stranger in 2016 into the framework for a show questioning the strictures of gender and race, which they’ve been touring worldwide for the past eight years. To exert some control over the offending instrument, Alabanza has decided to make a burger from scratch – using a makeshift stove on a kitchen island – but they need help, something that was sorely missing when they were hate-crimed as 100 people watched on. But it can’t just be anyone. It has to be a white, cis, straight man (a tall order in a theatre crowd).\n\nAdvertisement\n\nIn a surreal coincidence, the audience member called up on our night is also named Travis. The element of unpredictability in a show that predicates on spontaneous audience interaction, night after night, adds a frisson of danger, of unknowing. Alabanza launches into a litany of seemingly nonchalant yet incredibly pointed questions aimed at Travis. When was the last time he cried? Where does Australia’s racism stem from? Does he feel frightened by other men? Travis Alabanza in a scene from Burgerz Dorothea Tuch This line of inquiry is invasive at times in the way it extracts a public performance of vulnerability, but in the discomfort that ensues, Alabanza is making a trenchant point. Travis consented to audience participation, and he is being assessed on the basis of a narrative that he has crafted himself. Alabanza doesn’t consent to being ogled, denigrated or given a wide berth when they’re in public spaces, and they’re denied their personhood and agency by the broad brushstrokes of bigotry. Like the onion that Travis so expertly slices into rings as he assists Alabanza, there are layers upon layers to this piece of performance art. Part stand-up, part cooking demonstration, part history lesson, part soliloquy, Alabanza switches effortlessly between different modes of storytelling and engagement. They are irreverent and quick-witted, with an uncanny command of the room – peals of laughter give way to pin-drop silence as Alabanza’s shifts the register from playful and slapstick to sombre to enraged. It’s akin to emotional whiplash.\n\nAdvertisement\n\nRelated Article Sydney Festival A stranger attacked Travis. She didn’t get mad - she got herself a hit show The subject of their ire are the boxes – gestured towards literally in the set’s backdrop – that marginalise and suffocate people who don’t fit within society’s white, heteronormative confines. By inviting a foil onstage – who is, in every discernible way, their opposite – Alabanza projects their indignation and rage on to this person, who acts as both a receptacle and, because this is the Malthouse, a corrective to Alabanza’s experience of being assaulted with an airborne burger. In a moving display of solidarity, Travis bins the burger and offers Alabanza an (unreciprocated) hug before finally making his way offstage. Burgerz is strongest when it’s weaving disparate threads into striking commentary on being a trans person, all while pulling the rug out from under us. Culminating in a beautiful demonstration of safeguarding involving a tear-stricken front-row audience member, Alabanza adroitly shows us that the mutual duty we have to keep one another safe is the one thing that binds us all together.\n\nReviewed by Sonia Nair\n\nAdvertisement\n\nDANCE\n\nStorytime Ballet: The Nutcracker ★★★\n\nThe Australian Ballet, Comedy Theatre, until January 25 Is there time for one last holiday outing with the little ones? Why not try David McAllister’s breezy adaptation of The Nutcracker. Running at a mere 50 minutes, it’s the ballet equivalent of a fun-size chocolate bar: small, sweet and gone before you know it. The Nutcracker is a great introduction to ballet for children. Daniel Boud This is ballet done as an interactive panto-style comedy for children as young as three. The kids can dress up in something sparkly, make a bit of noise, enjoy a few magic tricks and, best of all, see some proper dancing. Sean McGrath, as the genial magician-narrator, keeps the kids giggling and cheering. The youngsters wave glowing wands or waggle magic fingers to transform toys into life-sized dolls. Adults, of course, are required to join in – or the spell doesn’t work.\n\nAdvertisement\n\nIn this stripped-back version, some of the mystery and enchantment inevitably goes missing. George Balanchine called The Nutcracker a ballet for children and adults who are children at heart. This version, however, will appeal mostly to the former. These annual Storytime concerts, produced by the Australian Ballet, are essentially a gentle introduction to ballet’s rituals, which carry their own strangeness and spell: when to clap, why nobody speaks and how the story and the dance politely disagree. The Nutcracker has plenty of dancerly moves to keep children entertained. Daniel Boud The inclusivity and theatrical zoom of The Nutcracker suit this format. Yes, there is plenty of dancerly dazzle for aspiring ballerinas, but you also get toy soldiers wrestling with sword-wielding mice in scenes of cheerful mayhem. An ensemble of 12 dancers does the heavy lifting, with that sense of fun that matters most here. Still, there are lovely flourishes from Bronte Mollison, Alexander Mitchell and Claudia Gordon – crisp, bright, unshowy. Mostly, though, it’s an entertaining spectacle. The costumes stick to a traditional look, while the set is kept very simple, albeit softened by dreamy, colourful backdrops.\n\nReviewed by Andrew Fuhrmann\n\nAdvertisement\n\nCIRCUS\n\nDuck Pond ★★★★\n\nCirca, Princess Theatre, until January 25 Letting actual acrobats loose on the most sacred of ballet relics, Swan Lake, feels like the logical endpoint of a long-term trend in which ballet has come to resemble an extreme sport: an exhibition of uncanny flexion and vertiginous airtime. Duck Pond is an acrobatic reimagining of Swan Lake. Daniel Boud Hardworking Brisbane circus company Circa offers nothing like a traditional retelling of the bewitched swan. Instead, this is a blithely impertinent mash-up: Odette as the Ugly Duckling, dreaming herself into a swan. Duck Pond opens at the prince’s birthday party, a full court of gentle gymnasts flipping, tumbling and vaulting into walkovers, then stacking on shoulders. The port de bras is impeccable, if port de bras now means balancing your mate on your head. Highlights include a startling four-high human tower, made all the more impressive in the Princess Theatre’s relative intimacy, and an aerial-silk act with Asha Colless holding a clean split before pitching forward into a core-straining horizontal line.\n\nAdvertisement\n\nThe story barrels along. The Black Swan (Maya Davies) arrives and the Ugly Duckling (Sophie Seccombe) is shamed for her lack of glamour. A troupe of mop-wielding ducks try to console her, but it doesn’t work – like Charlie Curnow, she must become a swan. At the pond, in a sequence of roof-raising throws, the Duckling discovers that she, too, can soar. Jethro Woodward’s sound design is here at its most inventive, with a cool reworking of Tchaikovsky, swapping passion for quirky play. Overall, Duck Pond is a wonderfully polished take on modern circus. Daniel Boud In the final act, Duck Pond takes a holiday turn as the fairytale ending is shoved aside. Instead of a wedding, the road cases are rolled in and the floor is torn up. Everything is stripped: both the stage and the performers. Well, no one’s actually nude, but some of the burlesque-flavoured business does skew older than you might expect for an all-ages show. The merriment ends with crowd-pleasing circus staples: hula-hoops and a Cyr wheel. Overall, it’s a wonderfully polished example of company director Yaron Lifschitz’s take on modern circus: a brisk dramatic premise that lets a youthful ensemble refresh some otherwise familiar routines.\n\nReviewed by Andrew Fuhrmann\n\nAdvertisement\n\nMUSIC\n\nThe Last Dinner Party ★★★★\n\nSidney Myer Music Bowl, January 15 The stage is set with a patchwork of torn, off-white curtains, arches, a hanging bell and plenty of steps and levels for the band to pace and parade. And they do. The Last Dinner Party perform at Sidney Myer Music Bowl on January 15. Richard Clifford Preppy, bacchanalian baroque pop band The Last Dinner Party comprises five women and non-binary folks (and a guy on drums up the back) in velvet and lace, and armed with various audaciously shaped guitars, synths, a baby grand, a mandolin, a sax and enough charisma to carry off these melodramatic and infectious songs. It’s earnest glam rock. They know how to chew the scenery. Their recent second album, From The Pyre, is showcased here – a confident and ornate bunch of songs drawing on early Kate Bush and 1970s rock operatics.\n\nAdvertisement\n\nAfter opener (and highlight) Agnus Dei, we’re lifted through killer harmonies, playfully erudite lyrics and big solos in songs like Count the Ways, The Feminine Urge and I Hold Your Anger. Abigail Morris of The Last Dinner Party. Richard Clifford In just a couple of years, The Last Dinner Party has released two albums and amassed an adoring fan base. They’re twenty-something, they skew female and queer, and they’re all in. They’re dressed up and equipped with tributes – flowers, signs, a homemade pair of angel wings – and the band gives back. Lead singer Abigail Morris even scrawls drawings on a few people in the front row, which they’ll go off and get tattooed. By the end of the set when they whip out their debut single and most enduring hit Nothing Matters and the very fun This Is the Killer Speaking, the crowd is fully locked in, even committing to choreography. Then they wrap it up with a brief reprise of Agnus Dei, like it’s all been one big musical spectacular. If you’re ever sitting down near the front at a show at the music bowl, turn around during a really big number and witness the crowd behind you. Pure joy.\n\nReviewed by Will Cox The Booklist is a weekly newsletter for book lovers from Jason Steger. Get it delivered every Friday.",
    "source": "SMH",
    "cluster_id": 19
  },
  {
    "url": "https://www.smh.com.au/national/marsh-smacks-first-ball-over-the-rope-20260125-p5nwwf.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Marsh smacks first ball over the rope",
    "publish_date": "Tue, 27 Jan 2026 13:07:00 +1100",
    "category": "finance",
    "authors": [],
    "text": "Remove items from your saved list to add more.\n\nYou have reached your maximum number of saved items.\n\nSave this video for later\n\nAdd videos to your saved list and come back to them anytime.\n\nGot it",
    "source": "SMH",
    "cluster_id": 20
  },
  {
    "url": "https://www.smh.com.au/sport/afl/i-am-doing-ok-taylor-adams-on-the-mend-after-alleged-assault-police-probe-continues-20260127-p5nxba.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "‘I am doing OK’: Taylor Adams on the mend after alleged assault, police probe continues",
    "publish_date": "Tue, 27 Jan 2026 12:55:17 +1100",
    "category": "sports",
    "authors": [
      "Peter Ryan"
    ],
    "text": "Veteran Sydney Swans midfielder Taylor Adams has reassured footy fans he is recovering well as police continue to investigate his alleged assault outside a licensed venue in Rose Bay on Saturday night.\n\nAccording to police the 32-year-old former Magpie and Giants midfielder was punched in the face by a man after an argument with two men he did not know.\n\nTaylor Adams has had a rough 12 months on the injury front Credit: AFL Photos via Getty Images\n\nAdams lost consciousness briefly, concerning onlookers in the aftermath.\n\nAdams was released from hospital on Sunday morning and was not on the training track with teammates on Monday as the club monitored his health following the incident.",
    "source": "SMH",
    "cluster_id": 21
  },
  {
    "url": "https://www.smh.com.au/goodfood/sydney-eating-out/a-new-middle-eastern-wine-bar-in-martin-place-is-serving-egyptian-steak-frites-20260127-p5nxas.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "A new Middle Eastern wine bar in Martin Place is serving Egyptian steak frites",
    "publish_date": "Tue, 27 Jan 2026 12:50:48 +1100",
    "category": "finance",
    "authors": [
      "Erina Starkey"
    ],
    "text": "Advertisement\n\nEating outJust open A new Middle Eastern wine bar in Martin Place is serving Egyptian steak frites Former Chef of the Year Paul Farag opens a sibling venue to his two-hatted Aalia, where Middle Eastern bar snacks and wine “curiosities” reign supreme. Erina Starkey January 27, 2026 Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share A A A\n\nSteak frites may be a fixture on Sydney menus, but there’s only one place serving it as a wood-seared rump cap finished with a fenugreek and harissa-spiced “Cafe de Cairo” butter. You can find it in Aalia Wine Room, a new casual extension of two-hatted Middle Eastern restaurant Aalia at Martin Place. The menu was created by former Good Food Guide Chef of the Year Paul Farag, who has taken the North African and Arabic flavours of Aalia and adapted them for a relaxed, wine-bar setting. “Beautiful fishbowl”: The two-level space was inspired by Harry Seidler’s original MLC architecture. Jiwon Kim “With this being a wine bar, we sort of loosened up the rule book a little bit, so we’re going to have some charcuterie, and we’re going to have some cheese,” Farag says.\n\nAdvertisement\n\n“That was something people have always asked for in Aalia, but it never really stayed true to my vision of the restaurant because Middle Eastern cheeses aren’t really eaten at the end of the meal like you would in, say, French dining.” Restaurant reviews, news and the hottest openings served to your inbox. Sign up The charcuterie is served mezze-style and changes regularly, currently featuring a squid and truffle salami, beef pastrami and cured pork neck. The charcuterie plate and kibbeh nayeh. Jiwon Kim The menu also includes familiar bistro staples reimagined through a Middle Eastern lens. There’s a gilda, skewered with bastourma, pickles and a quail egg, and anchovy toasts spread with muhammara – a smoky-sweet red capsicum and walnut dip. A fish shawarma is designed to be eaten by hand, wrapped up in flatbread with a Murray cod wing, pickles, lettuce and toum.\n\nAdvertisement\n\nFarag will also bring back a few fan-favourite dishes such as the hawashi, a pan-fried Egyptian street-food pastry stuffed with minced lamb, nuts and onions, and terrific with beer. The basturma, pickled chilli and quail’s egg gilda. Jiwon Kim “It was something we had on the menu for a while at Aalia, and then, as most chefs do, I got sort of sick of cooking the same thing. But we’re putting it back on, and maybe the sujuk-stuffed artichoke will come back too. We want the menu to be fun and fluid and a lot more special-orientated.” The wine list, created by sommelier Sarah O’Dwyer, features 235 labels, with 31 available by the glass. It’s designed to encourage exploration, and includes a section on “curiosities”, such as an “Albino Pinot” from L.A.S Vino in Margaret River, and an Austrian blend of zweigelt and blaufrankisch grapes. A dedicated “discovery hour” invites guests to blind-select a wine special, which is revealed tableside.\n\nAdvertisement\n\nThe wine list includes “curiosities” like forgotten varietals and unusual blends. Jiwon Kim The design of the venue follows Aalia’s lead. The two-level space is completely glass-fronted, featuring spotted gum timber accents and banquette seating, inspired by Harry Seidler’s original MLC architecture, with seating for 42. “It’s a beautiful fishbowl. If you like people-watching, it’s the perfect spot,” Farag says. “We’re going to roll the dice and see if we can get a licence for outside because we would love to have a little area where you can sit in the sun. One of my favourite things to do on a Saturday or Sunday afternoon is share a bottle of wine outdoors and watch people go by.” Open Tue-Fri noon-late, Sat 5pm-late\n\nAdvertisement",
    "source": "SMH",
    "cluster_id": 22
  },
  {
    "url": "https://www.smh.com.au/sport/tennis/how-players-prepare-for-extreme-heat-20260127-p5nxbx.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "How players prepare for extreme heat",
    "publish_date": "Tue, 27 Jan 2026 12:45:51 +1100",
    "category": "sports",
    "authors": [],
    "text": "How players prepare for extreme heat\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 23
  },
  {
    "url": "https://www.smh.com.au/business/markets/asx-set-to-jump-as-wall-street-climbs-a-climbs-gold-hits-record-20260127-p5nx6k.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Miners surge as ASX rallies; BHP eyes CBA’s crown",
    "publish_date": "Tue, 27 Jan 2026 12:34:10 +1100",
    "category": "finance",
    "authors": [
      "Staff Reporter"
    ],
    "text": "Advertisement\n\nUpdated BusinessMarketsWorld markets Miners surge as ASX rallies; BHP eyes CBA’s crown Staff reporter Updated January 27, 2026 — 12:34pm ,first published January 27, 2026 — 5:16am Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share A A A\n\nThe Australian sharemarket has rallied across the board after US stock indexes advanced overnight, while the price of gold continued to surge higher. The S&P/ASX 200 was up 94.1 points, or 1.1 per cent, in early afternoon trade, with all 11 industry sectors in the green. BHP jumped as it looks to take Commonwealth Bank’s title as the most valuable stock on the bourse. Wall Street has made a positive start to the week. AP The Australian dollar continued to strengthen on the back of more US dollar weakness. The Aussie was trading at US69.18¢ at 12.29pm AEDT. Iron ore miners rose as the price of the key steel-making ingredient strengthened with BHP jumping 2.8 per cent, Fortescue rising 1.5 per cent and Rio Tinto advancing 1.8 per cent. Gold miners are mixed with Northern Star up 0.5 per cent and Evolution 1.1 per cent lower. Silver prices roared higher, boosting South 32 by 2.3 per cent.\n\nAdvertisement\n\nFinancial stocks advanced, with the big four banks all in the green. Commonwealth Bank rose 0.8 per cent, Westpac climbed 0.6 per cent, National Australia Bank advanced 1.3 per cent and ANZ Bank jumped 1.2 per cent. Related Article Opinion\n\nGold Trump’s gold rush: America has the world running scared Stephen Bartholomeusz Senior business columnist Energy stocks advanced with oil prices strengthening. Woodside rose 1.7 per cent, Santos gained 2.9 per cent and Yancoal was 0.7 per cent higher. On Wall Street, the S&P 500 rose 0.5 per cent and won back its losses from last week’s dip. The Dow Jones climbed 313 points, or 0.6 per cent, and the Nasdaq composite added 0.4 per cent. Baker Hughes helped lead the way on Wall Street and rose 4.4 per cent after delivering a stronger profit for the latest quarter than analysts expected. The energy technology company said it’s benefiting from strong momentum in demand for liquefied natural gas, among other things.\n\nAdvertisement\n\nCoreWeave climbed 5.7 per cent after Nvidia said it invested $US2 billion ($2.9 billion) in the stock and will help accelerate the buildout of CoreWeave’s artificial-intelligence factories, which use Nvidia chips, by 2030 to advance AI adoption. Nvidia slipped 0.6 per cent. USA Rare Earth rallied 7.9 per cent after saying the US government agreed to provide $US277 million in federal funding to help the company produce heavy rare earths, minerals and magnets. The Trump administration also agreed to a proposed $US1.3 billion loan, while the company separately raised $US1.5 billion through private investors. Much of the rest of Wall Street was relatively quiet. That included mixed performances for airlines, which had to cancel thousands of flights due to the winter storm that swept much of the United States over the weekend. Delta Air Lines lost 0.7 per cent, and Southwest Airlines added 0.2 per cent. The action was stronger in the gold market, where the metal’s price rallied another 2.1 per cent and briefly topped $US5,100 per ounce for the first time to set another record. Silver surged even more and settled 14 per cent higher. Prices for precious metals have been soaring as investors look for safer places to park their money amid threats of tariffs, still-high inflation, political strife and mountains of debt for governments worldwide.\n\nAdvertisement\n\nThe latest worry to pile atop the swelling list was President Donald Trump’s threat to impose a 100 per cent tariff on goods from Canada if it signs a free trade deal with China. Related Article Opinion\n\nInterest rates Power bills and interest rates: Households could face a double whammy on costs Elizabeth Knight Business columnist The US dollar’s value also continued its recent slide against peers. Last week, it was US tariff threats related to Greenland that drove some global investors away from the dollar. This time, it was the Japanese yen leaping sharply because of expectations that officials in both Japan and the United States may intervene in the market to prop up the Japanese currency’s value. With AP The Market Recap newsletter is a wrap of the day’s trading. Get it each weekday afternoon.\n\nSave You have reached your maximum number of saved items. Remove items from your saved list to add more. Share More: World markets\n\nShares\n\nWall Street",
    "source": "SMH",
    "cluster_id": 24
  },
  {
    "url": "https://www.smh.com.au/national/western-australia/wa-news-live-two-men-rushed-to-hospital-after-near-drowning-at-trigg-beach-20260127-p5nx9h.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "WA news LIVE: WA teacher accused of having student’s baby hit with more sexual abuse charges",
    "publish_date": "Tue, 27 Jan 2026 12:19:12 +1100",
    "category": "finance",
    "authors": [],
    "text": "To breaking news now and the Mandurah school teacher accused of having a baby by her student earlier this month has pleaded guilty to all 11 charges against her.\n\nNaomi Craig, 33, has admitted to sexually penetrating the boy eight times over the course of the persistent sexually offending, which lasted 16 months between 2024 and 2025.\n\nCourt reporter Rebecca Peppiatt was in Mandurah Magistrates Court this morning, and will bring you more details soon.",
    "source": "SMH",
    "cluster_id": 25
  },
  {
    "url": "https://www.smh.com.au/lifestyle/life-and-relationships/the-hunger-for-beach-property-has-spilled-onto-the-dunes-cabanas-are-an-up-yours-to-equity-20260111-p5nt5g.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "The hunger for beach property has spilled onto the dunes. Cabanas are an ‘up yours’ to equity",
    "publish_date": "Tue, 27 Jan 2026 12:16:02 +1100",
    "category": "lifestyle",
    "authors": [
      "Jacinta Parsons"
    ],
    "text": "What is it about sport and beach holidays that end up illuminating the darker sides of humanity? We have seen time and time again the reckoning of our society at the end of a football boot, and now, the humble beach has become the same canary in the coal mine.\n\nThis summer feels as if there has been a point of no return for the humble beach ambler. The hunger for property acquisition in some of these fancy beach environs has spilled over onto the sandy dunes, where once we were equal and lived a utopian dream. Remember the days when the beach was not owned or staked as territory, but a shared egalitarian natural resource? It didn’t matter, once you had hit the sand, if you drove to the beach in your expensive car because your speedos looked the same as my dad’s when applied to both of your fulsome girths. We all had just a bucket and a spade to build what we could with the skillset of those in our family. Good news if your mum was a structural engineer, not so good if she accounted.\n\nCabanas line Safety Beach on the Mornington Peninsula. Joe Armao\n\nBut, to avoid nostalgia tainting a true view of the olden days, there were little flashes where what we see today in our hunger to win the beach, may have been predicted. While on the face of it, a sandcastle is a joyous experience of hands deep inside the wet sand, children collaborating on best use of buckets, it wasn’t really ever that innocent. My grandad was a frustrated construction man, which was of enormous benefit in the sandcastle wars. He likely took it too far when he suggested the enormous holes, dug deep into the sand and complete with stairs, were in fact to catch the joggers who ran before dawn. He brought industrial level equipment and would spend the six hours of our beach day, focussed and effective on building our dream dungeon. Mind you, he wore slacks and a button-up shirt while he worked away, and I never saw him in the actual surf, but he took his role as the leader of our family sandcastle (and dungeon) build, seriously, as a man who loves his family should.\n\nAnd then of course there was beach cricket where the desire for a win found its way onto the innocent sandy turf. I remember the hunger to show my brothers that I too had been playing cricket at lunchtime and knew how to wield the plastic bat with aplomb. And later, as a parent, the hunger to prove to my children that I had skillz, overshadowed what perhaps should have been an enriching time of mother-child connection.",
    "source": "SMH",
    "cluster_id": 26
  },
  {
    "url": "https://www.smh.com.au/sport/rugby-union/kiwi-poaching-raid-confirmed-as-kiss-successor-revealed-20260127-p5nx7f.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Why Kiss successor’s All Blacks ambitions were ‘never really a viable option’",
    "publish_date": "Tue, 27 Jan 2026 12:12:43 +1100",
    "category": "sports",
    "authors": [
      "Nick Wright"
    ],
    "text": "Vern Cotter said he was never in the mix to take the All Blacks coaching reins, having already been deep in discussions to help guide Australian rugby towards a brighter future.\n\nThe New Zealander, now at the helm of Super Rugby powerhouse the Auckland Blues, will succeed Les Kiss at the Queensland Reds from 2027 once the latter takes over the top job at the Wallabies.\n\nCotter brings with him two premierships – with the Blues in 2024 and Clermont Auvergne in the French Top 14 – while he also enjoyed a strong international stint with Scotland.\n\nVern Cotter said he had “verbally given my acceptance to the Reds before the All Black thing came up”. Credit: Mike Hewitt\n\nHe was being discussed as a potential option for the vacant All Blacks job, but the 64-year-old said he had already been enticed to Queensland well before Kiwi coach Scott Robertson’s shock axing.",
    "source": "SMH",
    "cluster_id": 27
  },
  {
    "url": "https://www.smh.com.au/national/from-stiff-to-sought-after-australia-s-healthy-addiction-to-golf-20251103-p5n7ag.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "From stiff to sought-after: Australia’s ‘healthy addiction’ to golf",
    "publish_date": "Tue, 27 Jan 2026 12:04:21 +1100",
    "category": "sports",
    "authors": [
      "Madeleine Heffernan"
    ],
    "text": "Advertisement\n\nNationalAustralian Open From stiff to sought-after: Australia’s ‘healthy addiction’ to golf Madeleine Heffernan January 27, 2026 — 12:04pm Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share A A A\n\nRecreational golf in Australia is booming. Record numbers of people are joining clubs and playing at driving ranges, minigolf facilities and simulators to quench their “healthy addiction”. Golf Australia claims the boom has killed off calls for courses to be converted to housing or parkland, and it says it will fight to protect courses from development “both for the people that play, but also for the environment”. Paige Chrzanowski at Barwon Valley Golf Course. Paige is new to golf. Joe Armao The sport’s popularity has led to higher fees at in-demand courses and waiting lists that exceed five years. Members of private clubs in Melbourne’s sand belt pay around $7000 to $10,000 a year, plus joining fees of about $20,000.\n\nAdvertisement\n\n“Some clubs have waiting lists where they haven’t previously had waiting lists. Some clubs … have increased entrance fees,” said Golf Australia chief executive James Sutherland. Sutherland said golf clubs had never experienced the sort of traffic they were seeing today. Rory McIlroy helped attract record crowds to the Australian Open in Melbourne. Getty Images “Ten or 20 years ago, people thought that it [the game] was stiff, with lots of rules, and difficult. Those things have changed,” he said. Data shows 4.7 per cent of people participated in golf in the year to June 2025, up from 4.4 per cent the previous year, according to the Australian Sports Commission.\n\nAdvertisement\n\nSeparate figures from Golf Australia show 3.8 million Australians played some form of golf in the year to June, with strong growth among women, children and newcomers. More than 477,000 Australians are members of a golf course, up 3.5 per cent year-on-year, Golf Australia said. Clubs membership numbers have increased by a record 24.1 per cent since 2017-18. The figures come as the billionaire Fox family mulls plans for its $100 million purchase of Capital Golf Course in Melbourne’s south-east, formerly owned by Crown casino for exclusive use by its biggest gamblers. Golf lovers say the growth has been led by Baby Boomers seeking gentle exercise, people playing while working remotely, and time-poor women enjoying new, shorter versions of the sport.\n\nAdvertisement\n\nRelated Article Australian Open The putt that sank Cameron Smith – and his Australian Open hopes Golf is also one of the few sports young people can play with their parents or grandparents, said Sutherland. “There are stories around Australia of four generations playing together in the one group,” he said. Sutherland said entrepreneurs had invested in “off-course” golf such as driving ranges, minigolf facilities and simulators to feed the country’s “healthy addiction around golf”. “People want to access the game, and there are lots of less traditional formats now,” he said. Sutherland said increased participation in golf had left clubs and facilities “in better shape financially than they were 10 years ago”, when a KPMG report showed 58 per cent of clubs were exhibiting signs of distress or serious distress.\n\nAdvertisement\n\nWith more people participating in golf, Sutherland said the world had “moved on” from pandemic-era calls for courses to be converted to public parkland or housing. “I think it was a bit of an anomaly in time,” he said. But some courses are still battling dwindling memberships and high maintenance, water, and staff costs, prompting them to merge with larger clubs or to sell to developers. Paige Chrzanowski and her two children Evie (7) and Julian (5) play golf at Barwon Valley Golf Course. Joe Armao In Sydney, NSW Premier Chris Minns has proposed to chop Moore Park’s 18-hole golf course in half to create a 20-hectare park close to Sydney’s CBD. Rossdale Golf Club in suburban Melbourne intends to sell the course for housing and relocate. But the conversion of golf courses to housing has not always gone to plan. The country’s biggest superannuation fund, AustralianSuper, bought Melbourne’s Kingswood Golf Course in 2014, intending to put housing on it, but failed to do so. Kingswood was later sold to a developer.\n\nAdvertisement\n\nMeanwhile, Waverley Golf Club in Melbourne’s outer east merged with the nearby Churchill Park Golf Club in 2016, intending to move to the latter’s Endeavour Hills course and sell its 18-hole facility to developers. But almost 10 years later, the project remains in limbo as the golf club site is within a green wedge. The fairways of Cathedral Lodge Golf Club snake through rolling countryside near Alexandra, north-east of Melbourne. Gary Lisbon The country’s most expensive course, Cathedral Lodge in Victoria’s north-east, which is owned by businessman David Evans and accessible by helicopter, is believed to have hiked its upfront fees to invitation-only members to more than $150,000. Newcomers to the sport include Paige Chrzanowski, 38, who plays four to five holes each week with coach Jay McKenzie at the Geelong Golf Academy. McKenzie also coaches Chrzanowski’s two young children and husband.\n\nAdvertisement\n\nRelated Article David Evans' dream golf course designed by Greg Norman set in country Victoria Chrzanowski said that while she had always thought golf was just for men, she is now “addicted”. “I’ve found my niche,” she said. Chrzanowski said she expected her family to play golf together in the years to come. Daniel Cromie, a former golf professional who now leads Commonwealth Golf Club’s hospitality operations, said the sport was busier than ever.\n\nAdvertisement\n\nRelated Article British Open Pro tip: The Australian golf courses that emulate the rugged British Open “People want places that feel steady and familiar. If we provide warm service, great food and a welcoming culture, the game will continue to grow,” he said. Close to 105,000 golf fans packed into Royal Melbourne golf course in December for the Australian Open. They were there for Queenslander Cam Smith and Rasmus Neergard-Peterson’s one-shot victory. US president Donald Trump recently said he would consider attending the Presidents Cup, to be held at Melbourne’s Kingston Heath Golf Club in 2028. “I actually have been to Australia, and did play one of your great golf courses – have great golf courses there,” he said during a visit from Prime Minister Anthony Albanese. Start the day with a summary of the day’s most important and interesting stories, analysis and insights. Sign up for our Morning Edition newsletter.",
    "source": "SMH",
    "cluster_id": 28
  },
  {
    "url": "https://www.smh.com.au/business/workplace/employee-sacked-for-failing-to-return-to-office-despite-contract-allowing-wfh-20260126-p5nx1b.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Employee sacked for failing to return to office, despite contract allowing WFH",
    "publish_date": "Tue, 27 Jan 2026 11:59:22 +1100",
    "category": "finance",
    "authors": [
      "Millie Muroi"
    ],
    "text": "Advertisement\n\nBusinessWorkplaceUnfair dismissal Employee sacked for failing to return to office, despite contract allowing WFH Millie Muroi January 27, 2026 — 11:59am Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share A A A\n\nA Melbourne man who refused to comply with a company’s return-to-office policy has failed to have his dismissal overturned despite signing a contract that allowed him to work from home. Last week, the Fair Work Commission ruled that print software company PaperCut’s decision to sack an employee who failed to follow its hybrid workplace policy was not harsh, unjust or unreasonable. The employer told the commission that the worker had not given any personal reason why he should not attend the office. The Fair Work Commission found PaperCut’s decision to sack an employee was both lawful and reasonable. Michele Mossop This contrasts with the case of a Westpac worker, who last year successfully challenged the bank’s office attendance policy after formally requesting flexible working arrangements under a section of the law for workers with various life or carer circumstances. As businesses increasingly transition from remote work to requiring a minimum office attendance, the commission has been dealing with cases that require it to decide whether employees who want to work remotely are entitled to do so.\n\nAdvertisement\n\nProduct engineer Richard Johnson, who started working at PaperCut in April 2022, signed an employment contract at the time which required him to “comply with such reasonable and lawful directions and all policies, rules and regulations from time to time provided by PaperCut”, but also permitted him to work from his personal residence “in line with relevant PaperCut policy”. That contract also stated he “may be required to work at other locations from time to time” and did not specify a primary place of work. When Johnson began working with the firm, PaperCut policy allowed employees to work from home and its offices “as possible and appropriate as a hybrid workplace”. The Fair Work Commission’s ruling noted that on February 25, 2022, the Victorian government removed its strong recommendation for employees to work from home, encouraging a return to the office as the country emerged from the pandemic. In August 2022, PaperCut sought to amend Johnson’s contract to clarify that his place of employment included the PaperCut office as well as his personal residence, saying the initial contract was incorrect.\n\nAdvertisement\n\nJohnson did not agree with this change, maintaining that his contract allowed him to work remotely, but attended the PaperCut office “on an intermittent basis and as required,” according to the judgment. Related Article AI Computer says no: AI vetting rejects job hunters in record time After staff consultation and some hybrid work trials, PaperCut developed and put in place a “return to hybrid work” policy and model, which was formally introduced in August 2023 with the aim of getting employees to achieve three days of in-office attendance a week by January 2025. In December 2024, PaperCut told Johnson his work location was being changed from his personal residence to the PaperCut office on January 1, 2025, and that he would have to comply with the change. While Johnson sought legal advice and said PaperCut’s demand was a breach of his contract, the company said it was confident its requirement was not a breach of his contract and was “both lawful and reasonable”.\n\nAdvertisement\n\nPaperCut warned that failure to comply with “may result in disciplinary action”, noting his contract did not specify his primary work location and required him to work in line with company policy and at locations other than his personal residence from time to time. On May 20, 2025, Johnson was issued a final warning letter spelling out that he would face disciplinary action “up to and including the termination of his employment” if he did not meet the three-day-in-office requirement. On June 19, Johnson was dismissed for failing to comply with PaperCut’s hybrid work policy. “Following his dismissal, Mr Johnson has not been able to find alternative employment despite attempting to do so,” the judgment read. Johnson argued his sacking was “disproportionate and harsh” when there were no other issues with his employment and that the company could have pursued more proportionate options, such as a court declaration of contractual rights, given there was a chance his interpretation, supported by external legal advice, was correct. Johnson also said he was told he would not be forced to sign the suggested change to his contract, that other employees continued to work remotely, and that his contract allowed him to work remotely.\n\nAdvertisement\n\nRelated Article AI Job hunters warned against ‘machine gun’ applications as AI takes off However, he accepted that he did not comply with the company’s directions and that he was dismissed because of this non-compliance. PaperCut argued Johnson was given “ample time and opportunity” to understand and comply with the direction and was warned “in clear and explicit terms” that a failure to comply would result in termination of his employment. The company also noted Johnson did not request a flexible work arrangement or identify any personal reason why he could not comply with its office attendance policy. Commissioner Scott Connolly said PaperCut’s direction was lawful because it “involved no illegality” and was within the scope of Johnson’s contract, which did not give him an unconditional right to work from home.\n\nAdvertisement\n\nConnolly also said PaperCut’s request was not unreasonable because of the steps it took to transition to, and explain, its new working arrangements. He also said PaperCut made it “explicitly clear” to Johnson what would happen if he failed to follow their direction. Sydney University professor emerita Joellen Riley said relying on the terms of an employment contract is rarely of much benefit, and that each decision is highly dependent on the specific facts of the case. “Most employment contracts have clauses in them that allow the employer a high level of flexibility in changing terms of your role, location and other aspects of your work,” she said. For people wanting to challenge an employer’s direction to return to the office, they should first look at requesting flexible work arrangements, Riley said. However, she noted this right is only available to people who meet certain requirements, such as caring for elderly parents or children, having a disability, or being aged over 55, and that there is no guarantee the request will be granted. “It’s not just for someone who thinks they’d like to work from home because it’s easier to go out at lunchtime and practice their golf swing,” she said. The Market Recap newsletter is a wrap of the day’s trading. Get it each weekday afternoon.\n\nSave You have reached your maximum number of saved items. Remove items from your saved list to add more. Share License this article More: Unfair dismissal Millie Muroi is the economics writer at The Sydney Morning Herald and The Age. She was formerly an economics correspondent based in Canberra’s Press Gallery and the banking writer based in Sydney. or email. Connect via X",
    "source": "SMH",
    "cluster_id": 29
  },
  {
    "url": "https://www.smh.com.au/business/markets/what-if-trump-doesn-t-chicken-out-next-time-20260127-p5nx87.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "What if Trump doesn’t chicken out next time?",
    "publish_date": "Tue, 27 Jan 2026 11:58:24 +1100",
    "category": "finance",
    "authors": [
      "Stephen Bartholomeusz"
    ],
    "text": "Advertisement\n\nBusinessMarketsTrump's White House Opinion What if Trump doesn’t chicken out next time? Stephen Bartholomeusz Senior business columnist January 27, 2026 — 11:58am\n\nJanuary 27, 2026 — 11:58am Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share A A A\n\nInvestors think they have Donald Trump worked out. He’s a classic bully who will always back down when confronted by a strong opponent, whether that opponent is a geopolitical counterpart or the markets themselves. That’s the premise behind the market’s faith in the “TACO” (Trump will Always Chicken Out) trade. Donald Trump has proven to be bluff and bluster so far, but markets are getting too complacent. AP For much of Trump’s second term, that has been how events have played out, most spectacularly last year when the US share and bond markets melted down in response to Trump’s April 2 “Liberation Day” tariffs. Trump immediately paused those Draconian tariffs for 90 days and subsequently diluted the severity of what he had planned. China, faced with exceptionally punitive tariffs, responded with similarly punishing tariffs of its own. Trump backed off and now largely avoids references to America’s trading relationship with China.\n\nAdvertisement\n\nLike any bully, Trump has turned his attention to apparently softer targets. Related Article Opinion\n\nGold Trump’s gold rush: America has the world running scared Stephen Bartholomeusz Senior business columnist He’s threatened the BRICS economies with tariffs because they have talked about creating an alternate currency to the US dollar; he’s threatened Canada for declining to become the 51st state; he threatened potential customers for Venezuelan oil; Brazil for jailing its former president; Canada (again) for airing an advertisement showing Ronald Reagan’s critiques of tariffs; European nations for standing up against his threat to forcibly acquire Greenland, possibly via an invasion; France for President Emmanuel Macron’s refusal to join his “Board of Peace”; and Canada (yet again) for doing a minor trade deal with China. None of those threats materialised. There’s more bluff and bluster than follow-through. The Greenland episode, however, is interesting and instructive because, as was the case with the Liberation Day tariffs backdown, it took a sharp response from the markets for Trump to abandon his threats.\n\nAdvertisement\n\nSome credit should also go to the Europeans, who threatened to retaliate if Trump went ahead with his announcement of an extra 10 per cent tariff on Europe’s exports to the US, rising to 25 per cent, unless they dropped their opposition to his plan to annex Greenland. Apart from dusting off their plans to impose tariffs on $US93 billion ($135 billion) of their exports, the European Union also started talking seriously about using their trade “bazooka” or the “Anti-Coercion Instrument” that would enable a raft of responses, including restrictions on the activities of US tech companies and banks within the EU. Trump has kept investors on edge. AP The European threats might have had some impact on Trump’s backdown, but it is the markets that seem to have the most influence over Trump on issues of real import. Last week, as it appeared the temperature around Trump’s ambitions for Greenland was reaching boiling point, the US sharemarket fell more than 2 per cent, bond yields spiked and the value of US dollar dropped sharply.\n\nAdvertisement\n\nWhile not as dramatic as the response to the April 2 tariffs, it was a warning shot across Trump’s bows. Related Article Opinion\n\nTrump's White House Appeasing Trump won’t work. Could Europe deploy its ‘bazooka’ over Greenland? Stephen Bartholomeusz Senior business columnist After a meeting with the NATO Secretary-General Mark Rutte – who had no authority to speak for Denmark or Greenland – Trump announced (despite previously saying anything other than ownership of Greenland would be unacceptable) he had achieved a “framework” agreement with Rutte and would take his EU tariffs off the table. The meeting, Rutte has said, did not include any discussion of ownership of Greenland. Perhaps Rutte reminded Trump that, under a 1951 agreement with Denmark, the US has always had rights to establish military bases in the territory. Having created chaos and fear, Trump chickened out again. Whatever the framework might be – and Denmark and Greenlanders will have the final say in what it might look like – it doesn’t appear to include US ownership of the icy island.\n\nAdvertisement\n\nThe problem for investors is that the TACO trade is now embedded in market psychology. Their experience of Trump in this term tells investors that he will huff and puff in social media posts and threaten (usually with tariffs), but will either do nothing to follow through or, at the first whiff of a market response, fold. Related Article Trump's America A particular brand of carnage has taken hold here in America The relatively mild response to the prospect of the US invading and seizing the territory of an ally and NATO partner – blowing up NATO in the process – produced only a relatively mild response in markets because investors were betting that the TACO trade would play out, as it did. If enough investors think Trump will always chicken out when there is any level of pushback from those he has targeted, however, there won’t be a sufficiently strong market response to persuade him to walk back his threats. At some point, if the markets remain sanguine, he’ll press ahead and something seismic – a financial crisis, perhaps – might occur. It’s not as though Trump hasn’t done some of the things he has threatened since re-taking the White House.\n\nAdvertisement\n\nApart from the brutal and increasingly controversial purge of undocumented immigrants (and some US citizens) that is continuing, the assaults on domestic institutions, the health and educational establishments and science (and the bulldozing of the East Wing of the White House to make room for Trump’s glitzy ballroom), Trump has imposed the highest level of tariffs since the Great Depression. They may not be as extreme as those announced on April 2, but at more than 7 times their pre-Trump 2.0 levels, they are very high and are having, and will increasingly have, a deleterious impact on American households’ costs. Trump keeps finding new targets for his tariffs, so their average rate of about 17 to 18 per cent (about 10 percentage points less than what was announced on April 2) might yet rise. That says the markets shouldn’t take it as a given that Trump will always chicken out. If investors don’t react adversely to the worst of his plans, he might well pursue them to a conclusion.\n\nAdvertisement\n\nSharemarket investors are particularly important because Trump has always seen that market as a barometer of his success. US consumption has held up, despite the tariffs and, along with the massive investments in artificial intelligence, helped buoy the economy because the wealthier households – those exposed to the market – have increased their spending. The problem for investors is that the TACO trade is now embedded in market psychology. There are, of course, other reasons for investors, particularly non-US investors, to protest Trump’s policies by selling their shares and bonds. The continuing explosion in US debt since Trump regained office, the social upheaval, the degradation of US capabilities, the weaknesses in an economy largely being held up by the massive investment in artificial intelligence and the disdain and hostility the administration has shown to its former closest allies and trading partners are reason enough.\n\nAdvertisement\n\nRelated Article Opinion\n\nInvesting Team TACO cashes in as Trump folds again Elizabeth Knight Business columnist The fear of debasement of the US dollar and their debts as a strategy for dealing with America’s deficits and debt has already seen a significant depreciation of the dollar, a flight to gold and longer-term bond yields that have remained stubbornly high even as short-term rates have been pushed down by the Federal Reserve Board’s rate cuts are indicators of either a loss of confidence in America’s future, an aversion to being a part of it, or both. That underlying structural shift in demand for US securities could amplify the impact of an investor revolt in response to one of Trump’s more destructive demands. Unless investors accept that, for the TACO trade to work, they need to escalate their response to each and every instance, however, the trade itself will fizzle out and Trump will be unconstrained. It isn’t predestined that Trump will always chicken out. The Market Recap newsletter is a wrap of the day’s trading. Get it each weekday afternoon.",
    "source": "SMH",
    "cluster_id": 30
  },
  {
    "url": "https://www.smh.com.au/sport/tennis/tiley-cahill-exchange-during-heat-delay-20260127-p5nxax.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Tiley, Cahill exchange during heat delay",
    "publish_date": "Tue, 27 Jan 2026 11:56:37 +1100",
    "category": "finance",
    "authors": [],
    "text": "Tiley, Cahill exchange during heat delay\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 31
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/bradman-scores-again-as-baggy-green-fetches-record-price/ks45yznju",
    "title": "Bradman scores again as Baggy Green fetches record price",
    "publish_date": "Tue, 27 Jan 2026 01:52:16 +0000",
    "category": "sports",
    "authors": [],
    "text": "Listen to Australian and world news and follow trending topics with SBS News Podcasts.\n\nTRANSCRIPT\n\nREPORTER: \"So this is the chest?\"\n\nFAMILY MEMBER: \"Yeah, this is the treasure chest... Okay, drum roll.\"\n\nREPORTER: \"Wow. Wow.\"\n\nFor the past 75 years, three generations of the family of former Indian test cricketer Sriranga [[Sree-rung-gah]] Sohini has held on to a very important item in a glass cabinet.\n\nFAMILY: \"So all his stuff is here. And if you can come a little closer you can smell that old smell.”\n\nWhat the family kept was a baggy green cap, which Don Bradman gave to their grandfather during India's first tour of Australia after the country gained independence in 1947.\n\nLee Hames from Lloyds Auctions says Bradman offered the cap as a show of sportsmanship during the Brisbane leg of the tour, when their bowler mistakenly thought he had gotten the Australian legend out.\n\n“He (the bowler) turned to the umpire and they said that's not out, and so he turned out to be the first Indian cricketer not to get Sir Donald Bradman out. They went back and reviewed the footage obviously and they reckoned it was plumb. In true Sir Donald Bradman nature we're told he went into the changing rooms that night, obviously knew that it was important that India weren't too discouraged. He put his arm around the young Indian bowler and put the baggy green on his head. So he used that as inspiration for the Indian cricket team.”\n\nLee Hames has just concluded an online auction of the cap - selling it for $460,000 dollars to an Australian collector who has chosen to remain anonymous.\n\nThe cap will remain in Australia and at some stage, be placed on public display in a prominent Australian museum.\n\nMr Hames says that's the highest price ever paid for a baggy green worn by the Don.\n\nIt's the holy grail when it comes to cricket sporting memorabilia... This one is a very important baggy green. It is the baggy green that Sir Don Bradman was wearing when he achieved his 100th century. It was the baggy green that he wore in his last Test on home soil - and it's been away for 75 years.”\n\nIt's not the first iconic Australian baggy green to go under the hammer.\n\nThe record price for such a cap belongs to Shane Warne, who sold his for just over a million dollars in 2020 to raise money for the Australian Red Cross, money that NSW Red Cross director Poppy Brown said in 2020 was life changing.\n\n“When we have talked to people who are in the evacuation centres and are really struggling, they are so amazed by the support from the community.”\n\nYet, while the money from the Shane Warne and Don Bradman sales are respectable figures - they're still not the most expensive pieces of memorabilia in history.\n\nNew Jersey-based auctioneer Alex McNicoll says a jersey worn by the late great player Diego Maradona in his first ever World Cup match against Belgium in 1982, featuring his signature on the front in black ink, went for $12.4 million [[AUD]].\n\n“As far as a public auction, there's never been a piece like this. And it's hard to say there will be again. This piece really does belong in a museum just because of its significance for soccer history and Maradona's history.”\n\nAnother piece of Diego Maradona history was the football used in the 1986 World Cup quarter final between Argentina and England.\n\nThat point became known as the Hand of God goal because of accusations that Maradona had batted the ball into the net with his fist.\n\n“Maradona, he handled the ball, didn't he? Didn't he?”\n\nThe legend himself confirmed this some time later, saying it was symbolic revenge for Argentina's defeat by the United Kingdom in the 1982 Falklands War.\n\nThe football itself was sold several years ago by Graham Budd Auctions for a healthy sum.\n\nAUCTIONEER: \"It's the hand of god football from the Argentina versus England quarter final... That's two million, thank you very much.”\n\nMeanwhile, in basketball, the sneakers that Michael Jordan wore in game two of the 1998 NBA finals went up for grabs three years ago - becoming the most expensive sneakers ever sold at auction.\n\nSotheby's Head of Streetwear and Modern Collectables, Braham Wachter, says someone bought them as a single lot for 2.2 million dollars.\n\n“And, you know, he won that game. He scored 37 points. They're in remarkable condition with beautiful, big silver signatures. And, you know, they are game worn by him. And so, it's really kind of a spectacular specimen.”\n\nDespite that incredible sum of money, it still fell short of Michael Jordan's jersey from the 1998 NBA basketball finals game one which sold for $15 million dollars last year.\n\nYet even that sale was eclipsed by the auction of a jersey worn by the famous baseball player Babe Ruth during the 1932 World Series - which went for more than $24 million in 2024.\n\nBack home, Lee Hames says expectations were always high for this Sir Don Bradman baggy green, and he is glad it will remain in Australia for cricket fans to appreciate.\n\nHe says people pay good sums of money for such items not just because of the potential for an increase in value, but to feel connected to the history of the sports they love.\n\n“There's nothing more important to Australians in sporting terms than cricket, and there's no-one more important than the Don.”\n\n1947 Newscaster: \"But the crowd needn't worry. Don makes it in a single and the whole ground goes wild.\"",
    "source": "SBS",
    "cluster_id": 11
  },
  {
    "url": "https://www.sbs.com.au/news/article/how-over-330-million-was-taken-from-australians-in-a-year-and-the-tactics-behind-it/atu595hkx",
    "title": "How over $330 million was taken from Australians in a year — and the tactics behind it",
    "publish_date": "Tue, 27 Jan 2026 00:54:16 +0000",
    "category": "finance",
    "authors": [],
    "text": "Australians lost $334,831,647.50 to scams last year, with investment scams responsible for the biggest losses.\n\nThe Australian Competition and Consumer Commission’s (ACCC) Scamwatch has released its December figures, showing the full impact of scams in 2025.\n\nAlmost 200,700 scams complaints were reported, many incurring financial losses.\n\nIn 2024, Scamwatch recorded more than $318.7 million in reported losses, with 249,448 scam complaints.\n\nSo how did scammers approach their victims? And did they have a targeted demographic?\n\nHow did scammers make contact?\n\nEmail was reported as the most popular form of contact for scammers, with more than 84,800 email scams reported.\n\nAround 43,000 scams came from other online methods, including social media, mobile or online forums, reporting an overall $158.5 million loss.\n\nNearly 38,000 phone call scams were reported.\n\nWhat scams resulted in the biggest financial losses?\n\nInvestment scams were the most damaging, bringing losses of $172 million, with 6,785 reports.\n\nPhishing, where people are tricked online into revealing sensitive information such as passwords and credit cards numbers came next with losses of $31 million, from 65,000 scams.\n\nAround 3,400 romance scams were reported, with victims losing a combined $28.6 million.\n\nThe median amount lost to investment scams was $7,661.42; to phishing, $2,000; and to romance scams, $1,400.\n\nOther scams to watch out for\n\nEmployment, false billing, threats, shopping scams, ID theft, IT support and rebates (where people are told they are due a rebate from an organisation such as the government or a bank) are among other types of scams employed.\n\nThese brought an almost $90 million loss in 2025.\n\nREAD MORE The tactics being used in romance scams to target Australians\n\nThe victims\n\nOverall, men fell victim to more scams and lost more money than women, according to Scamwatch.\n\nMen lost $113.9 million to investment scams, while women lost $57.9 million.\n\nPeople over the age of 65 were the biggest scam victims, having reported an $88.8 million overall loss.\n\nPeople aged 55 to 64 years followed, recording a median loss of $445.71.\n\nWhat to know about avoiding scams\n\nScamwatch urges people to always stop and check before you act, as scammers utilise time sensitivity as a way to deceive their victims, pressuring them to act quickly.\n\nThe watchdog also notes that criminals take advantage of new technology, which includes artificial intelligence (AI).\n\nThe Australian Securities and Investments Commission (ASIC) has recently warned in its issues outlook that the increasing use of agentic AI — accomplishing goals of a business with limited supervision — could amplify harm for consumers.\n\nIt can be beneficial for businesses and lead to a productivity boom, but for consumers it can exploit behavioural biases and amplify the threat of scams.\n\nOutgoing ASIC chair Joe Longo told the Australian Associated Press: \"The whole question of literacy around technology is related to financial literacy, because we're seeing a convergence.\"\n\nHe said: \"So many financial products are promoted through a range of these technologies or platforms. So I do worry that, as a community, we're not investing enough in our level of understanding around these issues.\"\n\nFor the latest from SBS News, download our app and subscribe to our newsletter.",
    "source": "SBS",
    "cluster_id": 32
  },
  {
    "url": "https://www.sbs.com.au/news/article/medications-heat-related-illness/ihnfqxfzu",
    "title": "The common medications that can become 'quite dangerous' on hot days",
    "publish_date": "Mon, 26 Jan 2026 19:10:43 +0000",
    "category": "lifestyle",
    "authors": [],
    "text": "As temperatures increase across Australia, so too can your risk of developing a heat-related illness.\n\nAlong with factors such as age, overall health and the conditions you live and work in, experts warn that the medication you take could make you more vulnerable to heat stress, heat exhaustion, and heat stroke.\n\nHere's what to know.\n\nHow medications can make it harder to keep cool\n\nDr Kim Loo, deputy chair of the Royal Australian College of General Practitioners NSW and ACT, said our bodies use several mechanisms to maintain a core temperature of around 37C.\n\nBut some prescription and over-the-counter medications can interfere with these processes.\n\n\"You have different drugs that can alter the way people sweat … then you have medication that alters the ability of the patient to thermoregulate,\" she told SBS News.\n\nDehydration is another side effect, which can increase the risk of heat-related illness.\n\nREAD MORE The secret to a cooler home could already be sitting in your living room\n\nMedications used to manage mental health conditions, ADHD, heart disease, blood pressure, diabetes, migraines, allergies, and constipation are among those that can alter how effectively your body responds to heat.\n\nConsultant pharmacist Deborah Hawthorne said many heart and diabetes drugs, in particular, can be \"quite dangerous\" if you're dehydrated.\n\n\"These medicines can actually cause something called acute kidney injury … so we actually get a lot of people going into hospital for doing the right thing — continuing to take their medicines, but forgetting the need for water,\" she told SBS News.\n\nHawthorne said certain medications, such as those used to treat acne, can also increase your sensitivity to sunlight, making it especially important to practice sun safety when taking them.\n\nLoo said anyone taking regular medication, or giving it to their children, should speak to their GP or pharmacist about whether it could make them more susceptible to heat-related illness and what precautions they need to take on hot days to reduce their risk.\n\n\"The complexity of how medications impact the human body will be dependent on the individual patient,\" she said.\n\nAll prescription medicines, and some over-the-counter medicines, have Consumer Medicine Information (CMI) listing possible side effects. Check this information and talk to your GP to understand what it means for you.\n\nWhere to store your medications\n\nIt's also important to ensure your medication is stored correctly, as its active ingredients can break down when exposed to extreme temperatures, Hawthorne said.\n\n\"You don't always see the tablet degrade,\" she said.\n\n\"Sometimes you can be taking medicines and think, 'Oh yeah, integrity looks good. The coating's on there. It should be fine.' But actually, the medicine inside is no longer as effective.\"\n\nHawthorne said keeping your medication in your glove box at any time of year is an absolute no-no, as the temperature inside cars is often significantly higher than outside.\n\n\"Most tablets need to be kept below 30C, or sometimes even below 25C, in a cool, dry place — so in a nice, cool cupboard that's not west-facing,\" she said.\n\nREAD MORE How heatwaves can wreak havoc on your mental health\n\nSome medications, including insulin, weight-loss injections, and liquid antibiotics, need to be kept in the fridge.\n\nAnyone concerned that their medication has degraded due to incorrect storage should ask their local pharmacy for a replacement, Hawthorne said.\n\n\"They're very happy to do that,\" she said.\n\nIf you want to make sure you're storing and managing your medication correctly, Hawthorne said to organise a free Home Medicines Review through your GP.\n\nSigns of heat-related illness\n\nKnowing the signs of heat-related illnesses and when to seek medical attention can be life-saving.\n\nLoo said symptoms of heat stress can include tiredness, dizziness, weakness, muscle cramps, irritability, and general discomfort.\n\n\"Those are all the signs that you need to rest and have a drink because those are signs of dehydration,\" she said.\n\nIf you don't move to a cool, shaded area and rehydrate yourself, it can turn into heat exhaustion, Loo said.\n\n\"You can get [core body] temperatures up to 38C, sometimes you can reduce the amount of sweating because you have less fluids, and you can get nausea, vomiting, headaches and fainting,\" she said.\n\nStaying hydrated can reduce your risk of heat-related illness. Source: AAP / Con Chronis\n\nLoo warned that if heat exhaustion is left untreated, it can lead to heatstroke — a life-threatening condition that requires urgent medical attention.\n\n\"With heat stroke, the core body temperature goes up to 40.5C … it's a medical emergency,\" she said.\n\n\"They can be very confused, have reduced alertness, their skin is red and hot, and they don't sweat because they don't have enough fluids left to sweat.\"\n\nDisclaimer: This article is for general information only and should not be relied on as a substitute for professional medical advice. Readers are advised to consult a qualified health professional for guidance specific to their situation.\n\nFor the latest from SBS News, download our app and subscribe to our newsletter.",
    "source": "SBS",
    "cluster_id": 33
  },
  {
    "url": "https://www.sbs.com.au/news/video/thousands-join-march-for-australia-protests-around-the-country/m3w1hoc6h",
    "title": "Thousands join 'March for Australia' protests around the country",
    "publish_date": "Mon, 26 Jan 2026 09:16:42 +0000",
    "category": "finance",
    "authors": [],
    "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
    "source": "SBS",
    "cluster_id": 34
  },
  {
    "url": "https://www.sbs.com.au/news/video/everyday-australians-honoured-with-a-medal-of-the-order-of-australia/513uzwi7c",
    "title": "Everyday Australians honoured with a Medal of the Order of Australia",
    "publish_date": "Mon, 26 Jan 2026 09:14:02 +0000",
    "category": "finance",
    "authors": [],
    "text": "Everyday Australians honoured with a Medal of the Order of Australia\n\nPublished 26 January 2026, 8:29 am\n\nNearly 1,000 people have been celebrated for their lifetime of dedication and service in their respective fields. Among them, the quiet achievers giving back to their communities to foster a sense of belonging and acceptance, recognised after being nominated by friends and colleagues.",
    "source": "SBS",
    "cluster_id": 35
  },
  {
    "url": "https://www.sbs.com.au/news/video/outstanding-australians-honoured-at-the-2026-australian-of-the-year-awards/vnhbry4u0",
    "title": "Outstanding Australians honoured at the 2026 Australian of the Year awards",
    "publish_date": "Mon, 26 Jan 2026 09:06:20 +0000",
    "category": "sports",
    "authors": [],
    "text": "Outstanding Australians honoured at the 2026 Australian of the Year awards\n\nPublished 26 January 2026, 8:30 am\n\nAn astronaut, an ultra-marathon runner, a dementia researcher and an Indigenous construction leader have been recognised for their achievements at the Australian of the Year awards. From 33 impressive finalists, four took out the titles at a ceremony held in Canberra.",
    "source": "SBS",
    "cluster_id": 35
  },
  {
    "url": "https://www.sbs.com.au/news/article/gold-price-breaks-fresh-record-as-silver-price-surges/5uxyfb8sk",
    "title": "Gold breaks $7k in fresh record as silver surges, with further gains tipped",
    "publish_date": "Mon, 26 Jan 2026 04:53:42 +0000",
    "category": "finance",
    "authors": [],
    "text": "Gold surged to above US$5,000 ($7,233) an ounce on Monday, following silver's rise above US$100 ($144) an ounce for the first time last Friday.\n\nThe record-breaking price of gold extends a historic rally as investors piled into the safe-haven asset amid rising geopolitical uncertainties.\n\nIn 2025, the price of gold soared 64 per cent, supported by sustained safe-haven demand, the easing of US monetary policy, and record inflows into exchange-traded funds.\n\nChina also extended its gold-buying spree for a 14th month in December, which also contributed to gold's price rise.\n\n\"[The latest catalyst] is effectively this crisis of confidence in the US administration and US assets, that was set off by some of the erratic decision-making from the Trump administration last week,\" Kyle Rodda, senior market analyst at Capital.com, said.\n\n\"This Trump administration has caused a permanent rupture in the way things are done, and so now everyone's kind of running to gold as the only alternative.\"\n\nLISTEN TO Global markets slide on Trump's Europe tariff concerns SBS News 10:47 English\n\nOver the past week, Donald Trump has announced swift policy changes, including abruptly stepping back on plans to seize Greenland, threatening to impose a 100 per cent tariff on Canada over its trade deal with China, and a 200 per cent tariff on French wines to pressure France to join the US president's Board of Peace initiative.\n\nSilver also hit a record of US$108.60 ($157.10) per ounce last Friday, building on its 147 per cent rise last year. This was driven by strong investment demand and a persistent supply shortage in the market.\n\nMore gains on the way\n\nMetals Focus director Philip Newman predicted the price of gold will continue to grow in the wake of the fresh record.\n\n\"Our current forecast suggests that prices will peak at around US$5,500 ($7,952) later this year,\" Newman said.\n\n\"Periodic pullbacks are likely as investors take profits, but we expect each correction to be short-lived and met with strong buying interest.\"\n\nREAD MORE Australian families could be sitting on a goldmine, but many are torn about selling\n\nRoss Norman, an independent analysis, predicts gold could reach a high of US$6,400 ($9,257) an ounce this year, with an average of US$5,375 ($7,774).\n\nMeanwhile, the Japanese yen rose and the US dollar slipped early on Monday, with investors cautious ahead of this week's US Federal Reserve meeting.\n\nA weaker US dollar makes greenback-priced gold more affordable for holders of other currencies.\n\n— With reporting by the Reuters news agency.\n\nFor the latest from SBS News, download our app and subscribe to our newsletter.",
    "source": "SBS",
    "cluster_id": 36
  },
  {
    "url": "https://www.theage.com.au/business/companies/gateway-drills-into-wa-yandal-gold-discovery-momentum-20260127-p5nxcb.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Gateway drills into WA Yandal gold discovery momentum",
    "publish_date": "Tue, 27 Jan 2026 13:24:12 +1100",
    "category": "finance",
    "authors": [
      "Rowena Duckworth"
    ],
    "text": "Advertisement\n\nSponsored BusinessCompaniesBulls N' Bears Gateway drills into WA Yandal gold discovery momentum Brought to you by BULLS N’ BEARS Rowena Duckworth January 27, 2026 — 1:24pm Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share A A A\n\nGateway Mining has fired up the drill bit at its flagship Yandal gold project in Western Australia, bringing forward exploration plans to accelerate definition of the emerging Haflinger discovery and line up follow-up reverse circulation (RC) drilling in the coming weeks. The rods off two aircore rigs are now turning, with the first rig focused on infill and step-out drilling around Haflinger, where mineralisation has already been intersected over a strike length of approximately 500 metres. Initial drilling results have highlighted the system’s strength, despite several holes only clipping the targeted structure during first-pass programs. Drilling at Gateway Mining’s Yandal gold project in Western Australia. Standout intercepts from earlier drilling at Haflinger included a hefty 52 metres running at 1.4 grams per tonne (g/t) gold from 64 metres, including a higher-grade interval of 12m at a cool 3.1g/t gold. That campaign also returned 2m at 3.4g/t gold from 148m to bottom of hole, within a broader 6m grading 1.4g/t gold from 144m, and 4m going 2.9g/t gold from 148m within a broader 16m at 1.0g/t gold from 136m.\n\nAdvertisement\n\nGateway says the mineralisation tends to occur within a highly favourable structural setting, where the mafic–intermediate rock contact flexes to the south-east. Notably, drilling remains open to the south, where geological conditions appear to be improving, adding further upside to the discovery. ‘... Drilling remains open to the south, where the geology appears to become more favourable.’ Gateway Mining executive chairman Andrew Bray The first aircore rig is set to complete closer-spaced drilling to the north and south of existing intercepts to delineate the structure ahead of RC drilling. Management believes this next phase of drilling will be key to understanding the true scale of the Haflinger system. Meanwhile, the second aircore rig will systematically test the Mustang shear structure to the south, where Gateway is confident of making discoveries similar to Haflinger. Mustang offers a comparable geological setting, with significant deformation and complexity, supported by historic rotary air blast (RAB) drilling that returned anomalous gold results; however, it failed to penetrate the weathered profile adequately.\n\nAdvertisement\n\nThe company is keen to complete first pass drilling at Mustang as quickly as possible, allowing any discoveries to be rapidly followed up with RC drilling alongside Haflinger. Drilling plans have been ramped up to define the extent of the Haflinger discovery in preparation for follow-up RC drilling. Gateway Mining executive chairman Andrew Bray said: “Mineralisation at Haflinger has been intersected over approximately a 500m strike length to date, with the first two aircore holes clipping the targeted structure prior to blade refusal, and a third hole returning a spectacular result of 52m at 1.4g/t gold, including 12m at 3.1g/t gold. Drilling remains open to the south, where the geology appears to become more favourable.” The Haflinger find emerged from wide-spaced, shallow aircore along the company’s regional-scale Celia Shear structure, tapping into the same fertile structure that hosts the company’s existing 400,400-ounce, high-grade gold resource. RC drilling is scheduled to kick off in a little over six weeks. It will initially focus on the Great Western area, where widespread surface gold anomalism and abundant gold nuggets have been identified over a broad area within a highly favourable geological setting. As soon as the all-important assay results from the broader Mustang–Celia shear corridor aircore program hit the company inbox, drilling will pivot to initial RC programs at Haflinger and to any additional discoveries warranting follow-up.\n\nAdvertisement\n\nThe Yandal project sits strategically just 85 kilometres northeast of Wiluna, spanning a vast 1,780 square kilometres on the eastern flank of the world-class Yandal Greenstone Belt. The belt is one of Australia’s most prolific gold-producing regions and is home to Northern Star Resources’ Jundee mine, which lies within close proximity to Gateway’s tenure. Gateway’s broader Yandal project already hosts a resource of 8.17 million tonnes grading 1.52g/t gold for 400,400 ounces. The resource is centred on the Horse Well Gold Camp and the Dusk ’til Dawn deposit, providing a solid foundation for ongoing exploration success. With gold prices soaring, Gateway is wasting little time in pushing its Yandal gold strategy forward as it hunts for the next significant discovery in one of Western Australia’s most prolific gold belts. Is your ASX-listed company doing something interesting? Contact: mattbirney@bullsnbears.com.au",
    "source": "TheAge",
    "cluster_id": 15
  },
  {
    "url": "https://www.theage.com.au/sport/tennis/australian-open-2026-live-updates-demon-in-alcaraz-showdown-us-teen-challenges-sabalenka-gates-open-early-on-sweltering-day-20260126-p5nx3m.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Australian Open 2026 LIVE updates: Demon in Alcaraz showdown; Sabalenka smashes into semis; Players get cooling breaks",
    "publish_date": "Tue, 27 Jan 2026 13:20:34 +1100",
    "category": "sports",
    "authors": [
      "Danny Russell",
      "Scott Spits"
    ],
    "text": "Two years ago, our reporter Angus Dalton experienced just what extreme heat can do to your body in a climate chamber on a 38-degree January day at about 20 per cent relative humidity.\n\nAs you read the lines below, spare a thought for the tennis players battling it out in today’s scorcher.\n\nReporter Angus Dalton spent time in a climate chamber. Credit: Photo: Brook Mitchel; Artwork: Marija Ercegovac\n\n“Back in the chamber, after about 20 minutes, even sitting down doesn’t feel like a break,” Dalton wrote.\n\n“It’s as if my body is working so hard to keep cool that my energy levels aren’t being replenished. The researchers can track the effects on core body temperature (measured by a digestible pill monitor), skin warmth and metabolic rate, as well as how much sweat a subject is losing and where it gathers on their bodies. In my case, we’ve tracked the effort my body has to make to keep cool by one simple measure: my heart rate.\n\nRead the full explainer on heat stress here.",
    "source": "TheAge",
    "cluster_id": 16
  },
  {
    "url": "https://www.theage.com.au/world/europe/the-ultimate-labor-insider-stepping-into-london-s-hot-seat-20260127-p5nx6g.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "The ultimate Labor insider stepping into London’s hot seat",
    "publish_date": "Tue, 27 Jan 2026 13:19:12 +1100",
    "category": "finance",
    "authors": [
      "David Crowe"
    ],
    "text": "Advertisement\n\nAnalysis WorldEuropeUK politics The ultimate Labor insider stepping into London’s hot seat David Crowe January 27, 2026 — 1:19pm Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share A A A\n\nLondon: The Australian wine flowed freely in London on Monday night when Jay Weatherill marked his first official day as the nation’s new high commissioner to the United Kingdom.\n\n\n\nThe commission staff threw open the doors to Australia House, their imposing headquarters on The Strand, and welcomed politicians, diplomats, business chiefs and expatriate Australians to celebrate the national day. Former South Australia premier Jay Weatherill is now Australia’s high commissioner to the UK. Alex Ellinghausen Weatherill, a Labor insider and former South Australian premier, was given an effusive welcome. But he arrives in London at a fraught time for Britain and Australia, two countries that talk often about the strength of their relationship, and he could be in for a wild ride. Both countries are caught in an American tornado, as US President Donald Trump upends the old world order, and will count on each other to help deal with the turbulence. Weatherill has to bring the allies even closer together. This sounds easy, judging by the mood on Monday night. Every speech highlighted the rivalry between colonist and colony in a way that few other countries laugh about as much.\n\nAdvertisement\n\nSeema Malhotra, the parliamentary under-secretary for the Foreign Office, quipped that the UK had given Australia cricket and almost lived to regret it. Chris Bryant, the trade minister, said he no longer cared about rugby now that Australia was so good at it. The audience laughed beneath the extravagant marble decorations of the Exhibition Hall of Australia House, famously used as the setting for Gringotts Wizarding Bank in the Harry Potter movies. Spotted in the crowd were a handful of British ministers and Sir Clive Alderton, the private secretary to King Charles III. Australia House in London dressed in green and gold to celebrate Australia Day. Weatherill seems ideally qualified to bridge any divide between the two countries. His mother left an office job in Adelaide at the end of the 1950s for a holiday in Europe. His father, born into poverty in northern England and hoping for a better life elsewhere, met her on the ship that carried them both to Australia in 1960. They fell in love on board to the music of Frank Sinatra, Weatherill told the crowd. More to the point, Weatherill proved to be an adept political leader when holding power in the hung parliament in South Australia after the state election of 2014. He has a talent for conveying calm. (Also in the audience on Monday, incidentally, was Steven Marshall, the state Liberal leader who lost that 2014 election. Marshall defeated Weatherill at the next one, in 2018. They still get along.)\n\nAdvertisement\n\nWeatherill is also trusted by Prime Minister Anthony Albanese and Foreign Minister Penny Wong. (He dated Wong when they were young). Nobody mentioned Trump in the speeches on Monday night, but everybody knows the code words for the era he has unleashed. Bryant talked of a troubled world, while Malhotra spoke about the need for a rules-based order in a world that is fragmented and unstable. Weatherill talked about the strength of British and Australian democracies. “Our collective commitment to unity, respect and pride in our Australian identity matters more than ever in a world that is less certain and more polarised,” he said. “I think this is a really important time for us to reflect on our shared values and our shared history as we all try and make sense together of this uncertain world.” Albanese is so close to UK Prime Minister Keir Starmer that the two leaders can talk directly when they wish, with no need for diplomats to smooth the way.\n\nAdvertisement\n\nWhen Starmer wanted to send a centrist message to the divided Labour faithful at the UK party’s annual conference in Liverpool last year, he arranged a keynote speech for Albanese. The address, controversial in Australia because it was so overtly political, reminded Labour MPs to keep calm, hold the middle ground and stick with their leader. Anthony Albanese and UK Prime Minister Keir Starmer at 10 Downing Street last September. Bloomberg Starmer and his wife, Victoria, had Albanese for dinner at No. 10 Downing Street last September with his partner – now wife – Jodie Haydon. They were joined by Canadian Prime Minister Mark Carney and his wife, Diana. Albanese brought a four-pack of beer, signalling the easy-going unity of the centre-left leaders. The challenges for Weatherill are about what is happening outside, not within, the Australian relationship with Britain. First is the pressure from Trump. It is barely a week since he threatened tariffs of 10 per cent, rising to 25 per cent, on eight NATO allies because they disagreed with him on his takeover plan for Greenland. He retreated, but not before every American ally got the message. The UK and Australia, like other allies, are on notice to expect further threats at any moment.\n\nAdvertisement\n\nRelated Article Updated\n\nTrump diplomacy Trump retreats on Greenland threats as ‘framework for a future deal’ discussed The key task for the UK and Australia, along with other liberal democracies, is to work together and hold their collective nerve the next time Trump goes on the attack. This is the approach that helped the UK and its European allies last week over Greenland. Carney argued for this unity from all middle powers in his address to the World Economic Forum in Davos – the speech that seems to have infuriated Trump. The second challenge is to make AUKUS a reality. As a South Australian, the new high commissioner has skin in the game. His home state needs to see faster progress on setting up the facilities and hiring the workers to construct the country’s next submarine fleet, and this means relying on two British companies: BAE for the vessels and Rolls-Royce for the nuclear power plants. Australia and the UK are equally troubled on AUKUS because neither country has a practical plan B. Australia will be more vulnerable to China without a new fleet, while the UK will be totally exposed to Russia. Both need Trump, and later US presidents, to back the pact. The US support is meaningless, however, if the British and the Australians cannot build the new vessels fast enough. The third challenge is dealing with the turmoil of British politics. Starmer is unpopular with voters, mocked by the media and derided within his own party. His chief opponent, Nigel Farage of Reform UK, appeals to disgruntled voters with a rallying cry borrowed from Trump.\n\nAdvertisement\n\nRelated Article Opinion\n\nUK politics Westminster woes deepen for UK Labour. Sussan Ley should take note George Brandis Former high commissioner to the UK and federal attorney-general Weatherill has to navigate a Labour government in Westminster that is cracking under the pressure from Farage and struggling to set a direction under Starmer. Rivals are parading in the Labour caucus, and the media, in the hope they will replace Starmer when the spill comes – and that means nobody at Australia House can be sure who will stand and who will fall. In a sense, Weatherill will be trying to bring two governments closer together while one of them tears itself apart. Get a note directly from our foreign correspondents on what’s making headlines around the world. Sign up for our weekly What in the World newsletter.",
    "source": "TheAge",
    "cluster_id": 17
  },
  {
    "url": "https://www.theage.com.au/national/australia-news-live-ley-s-allies-confident-she-will-remain-party-leader-melbourne-to-swelter-in-worst-heatwave-since-black-saturday-20260127-p5nx6r.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Australia news LIVE: Ley’s allies confident she will remain party leader; Melbourne to swelter in worst heatwave since Black Saturday",
    "publish_date": "Tue, 27 Jan 2026 13:12:20 +1100",
    "category": "sports",
    "authors": [
      "Emily Kaine"
    ],
    "text": "Sepp Blatter, the former FIFA President charged and later twice acquitted of corruption, has backed a proposed fan boycott of matches in the US when the Soccer World Cup gets under way later this year.\n\nThe US is hosting the cup with Mexico and Canada in June and July, but recent conduct by President Donald Trump has led to some urging fans to stay away from the states when it begins.\n\nThe international soccer community’s concerns about the United States stem from Trump’s expansionist posture on Greenland, travel bans and aggressive tactics in dealing with migrants and protesters in American cities, particularly Minneapolis.\n\nBlatter was the latest international soccer figure to call into question the suitability of the United States as a host country.\n\nHe called for the boycott in a post on X that supported Mark Pieth’s comments in an interview last week with the Swiss newspaper Der Bund.\n\nPieth, a Swiss attorney specialising in white-collar crime and an anti-corruption expert, chaired the Independent Governance Committee’s oversight of FIFA reform a decade ago.\n\nBlatter was president of the world’s governing body for soccer from 1998-2015; he resigned amid an investigation into corruption.\n\nIn his interview with Der Bund, Pieth said, “If we consider everything we’ve discussed, there’s only one piece of advice for fans: Stay away from the USA! You’ll see it better on TV anyway. And upon arrival, fans should expect that if they don’t please the officials, they’ll be put straight on the next flight home. If they’re lucky.”\n\nIn his X post, Blatter quoted Pieth and added, “I think Mark Pieth is right to question this World Cup.”\n\nElsewhere, Oke Göttlich, president of the Bundesliga club St. Pauli and a vice president of the German Football Association, said that the time had come to “seriously consider and discuss” a boycott, according to an interview in the Hamburger Morgen Post.\n\nThe tournament has also been criticised for exorbitant ticket prices.\n\nWith AP, Bloomberg",
    "source": "TheAge",
    "cluster_id": 18
  },
  {
    "url": "https://www.theage.com.au/culture/live-reviews/melbourne-review-wrap-last-dinner-party-20260116-p5nuk6.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Can love conquer all in this collision of tennis and relationship drama?",
    "publish_date": "Tue, 27 Jan 2026 13:11:37 +1100",
    "category": "sports",
    "authors": [
      "Cameron Woodhead",
      "Giselle Au-Nhien Nguyen",
      "Jessica Nicholas",
      "Sonia Nair",
      "Andrew Fuhrmann",
      "Will Cox"
    ],
    "text": "Advertisement\n\nKey points THEATRE: Tennis and theatre collide in Australian Open at Theatre Works\n\nMUSIC: David Byrne performs at Sidney Myer Music Bowl\n\nTHEATRE: Burgerz at Malthouse Theatre is a remarkable work of performance art\n\nDANCE: This Nutcracker is the ballet equivalent of a fun-size chocolate bar\n\nCIRCUS: Circa offer a new spin on Swan Lake with their highly athletic Duck Pond\n\nTHEATRE\n\nMIDSUMMA | Australian Open ★★★\n\nTheatre Works, until January 31 A tennis match starts at love all, as we know, but off the court, should we love all, or only one person? The contest between monogamy and ENM (ethical non-monogamy) inspires an energetic rally at the start of Angus Cameron’s Australian Open, a queer domestic comedy that serves up aces of absurdity, rapid-fire volleys of wit, and heavy groundstrokes of camp and cringe, even if it does take a while to find its rhythm and play itself into form. Performers Melissa Kahraman, Eddie Orton and Sebastian Li in the show. Sarah Clarke Felix (Sebastian Li) is thinking of marrying his tennis-pro boyfriend of six years Lucas (Eddie Orton), and his bourgie parents Belinda and Peter (Jane Montgomery Griffiths and Alec Gilbert) are slightly appalled that their son and his partner might pursue an open marriage. An embarrassing game of doubles ensues as they banter and bicker and take turns fussing over “World No.3” Lucas – ignoring the fact it’s their son’s birthday – causing Felix to abandon the encounter before the set is out.\n\nAdvertisement\n\nBoth couples are moved to imagine the grass might be greener. Stay-at-home dad Peter begins to wonder if he has repressed his attraction to men. All-conquering career woman Belinda feels the comfortable confines of married life might be preventing her from adventures scaled to her ambition – like, you know, climbing Mount Everest. Alec Gilbert with Eddie Orton in Australian Open. Sarah Clarke They decide on a trial separation to embrace radical self-discovery, while Felix and Lucas flirt with the idea (equally radical to them) of monogamy, tying themselves in knots over whether to tie the knot. Sibling rivalry enters the fray when Felix’s sardonic sister Anabelle – an experimental physicist living in Switzerland, who starts the play atop a referee’s chair – makes a surprise Christmas visit. She wants her parents to divorce; her brother is determined they should stay together. Ludicrous situational comedy unfolds as we get to the pointy end of the family farce, with daddy issues, vomit-inducing proposals and sexual fetish emerging in a satirical collision of the gay and the straight that delivers a kinky subversion of het-suburban mores, and questions received ideas about what’s normal for gay men into the bargain.\n\nAdvertisement\n\nComic theatre design leans heavily into the gay tennis vibe – a cast dressed in athletic whites, the stage resembling a deconstructed play court under (what else?) a constellation of disco balls, and it’s flexible enough to evoke locales as diverse as gay clubs and the snowbound peaks of the Himalayas. Cameron’s social satire can feel a bit dated given cultural trends in the 2020s, from the enshittification of gay dating apps to the mainstreaming of ENM and “situationships”, as well as greater gender diversity and fetish of all kinds across the spectrum of sexual orientation. Sebastian Li as Felix and Alec Gilbert as his father, who begins to question his own sexuality. Sarah Clarke The performances could refine the timing and flow of the comedy, especially in clunky early scenes, and perhaps find a more precise relationship to caricature. Still, the more ridiculous the play becomes, the better the comic acting gets, with plenty of physical and verbal humour and laugh-out-loud outrageousness that should have audiences leaving on a high. Reviewed by Cameron Woodhead\n\nAdvertisement\n\nMUSIC\n\nDavid Byrne ★★★★★\n\nSidney Myer Music Bowl, January 22 At his first Melbourne show since 2018, David Byrne shares a quote from director John Cameron Mitchell: “Love and kindness are the most punk things you can do.” Byrne was unsure of this at first – isn’t punk about anger? But then, on reflection, he agrees: “Love and kindness are indeed a form of resistance.” David Byrne performing at the Sidney Myer Music Bowl with his 12-strong crew of musicians and dancers, all dressed in orange boiler suits. Richard Clifford Byrne’s latest tour, off the back of his 2025 album, Who is the Sky?, combines politics and playfulness. Rising to fame as the esoteric frontman of new-wave legends Talking Heads, Byrne has moved, chameleonic, through ages and stages. He’s always shone as a live performer, using his weirdness as an artistic superpower: Talking Heads’ 1984 concert film, Stop Making Sense, provided a new blueprint for what live music could be; Byrne’s 2018 tour, American Utopia (later turned into a 2020 concert film directed by Spike Lee), injected commentary on Black Lives Matter and low voter turnout.\n\nAdvertisement\n\nIn Melbourne, Byrne projects the image of the decapitated King George V statue to laughter and cheers; on T-Shirt, contemporary slogans flash up on the screen, with “Make America Gay Again” a crowd favourite. 1979’s Life During Wartime is more sobering – images of protests and ICE raids backdrop Byrne and his 12-strong crew of musicians and dancers, all dressed in orange boiler suits. At 73 Byrne is as energetic as ever, and his voice rings out, bell-clear, over the crowd. Clever lighting and design choices heighten the drama – the lights flash off for a beat in This Must Be the Place (Naive Melody), and a flashing rig turns Byrne and his crew into lightning rods themselves. David Byrne performing at the Sidney Myer Music Bowl on Thursday night. Richard Clifford There are inspired arrangements here, breathing new life into old songs: opening number Heaven is gorgeously transformed with string accompaniment, and Psycho Killer – which Byrne has recently started performing live again for the first time in almost 20 years – blooms into a full-band rendition, arranged by the late composer Arthur Russell. There are throwbacks to Stop Making Sense in the arrangements and choreography of Houses in Motion and Slippery People. Byrne’s appeal is timeless, with young and old in attendance – he keeps up, too, covering Paramore’s Hard Times so convincingly you’d be forgiven for mistaking it for a Talking Heads B-side. It’s the classics that endure, though. By the time Once in a Lifetime and Burning Down the House roll around, there’s a sense of pure ecstasy in the air. Love, kindness and a healthy dose of weird – same as it ever was.\n\nReviewed by Giselle Au-Nhien Nguyen\n\n\n\nAdvertisement\n\nMUSIC\n\nJames Muller Quartet ★★★★\n\nThe JazzLab, January 25 James Muller might be one of Australia’s finest jazz musicians, but opportunities to see the guitarist outside his home city of Adelaide are exceptionally rare. Muller did perform at last year’s Melbourne International Jazz Festival (as part of a project led by Linda May Han Oh), but it’s been years since he last appeared here leading a band of his own. Jazz musician James Muller took a while to get back to Melbourne with a band of his own, but the wait was worth it. And it’s been a full decade since he shared the stage with the players he considers his favourite bandmates in the country: trumpeter Mat Jodrell, bassist Sam Anning and Perth drummer Ben Vanderwal. So it’s no surprise that JazzLab was packed to the rafters on Sunday night, as Muller reassembled this Adelaide-Melbourne-Perth dream team to premiere a clutch of new compositions. Opening tune Blake set the scene – taut, theme-skipping and darting across a sea of choppy polyrhythms. Like many of the tunes we heard that night, it was a complex piece that kept the players – and the audience members – on their toes, requiring intense focus and impeccable precision.\n\nAdvertisement\n\nJodrell’s role was especially demanding, his trumpet often mirroring Muller’s unpredictable lines as Anning’s bass and Vanderwal’s drums slithered and skittered beneath them. Yet somehow, the players never sounded tense or tentative. On the contrary, all four beamed with delight, clearly relishing one another’s musical company. Related Article Cinema ‘From its first preview on stage, producers were contacting me to make it a film’ Not every tune was a vigorous workout. Wishing Doll was warm and breezy, the leader’s eloquent guitar chiming in graceful tandem with Jodrell’s flugelhorn. And the night’s solitary ballad – Never Let Me Go – was gorgeously restrained, with delicate filigree from Muller and a wistfully lyrical solo from Anning. The final number saw the energy lift once more, the players grinning broadly as they engaged in virtuosic sparring over an ebullient theme. “See you in another 10 years!” joked Muller as the band left the stage, enveloped by the cheers of the crowd. Let’s hope it’s not that long.\n\nReviewed by Jessica Nicholas\n\nAdvertisement\n\nTHEATRE\n\nBurgerz ★★★★\n\nMalthouse Theatre, until January 31 The burger. It could be filled with anything, though it’s quintessentially beef. It could be a hot dog if it was presented differently, but that’d be something entirely separate. Customisable toppings add an element of experimentation, but the structural confines of what constitutes a burger remain. Travis Alabanza makes a burger from scratch on-stage in Burgerz. Dorothea Tuch Are we still talking about burgers? Yes and no. British theatre maker Travis Alabanza has transformed the very thing that was hurled at them by a transphobic stranger in 2016 into the framework for a show questioning the strictures of gender and race, which they’ve been touring worldwide for the past eight years. To exert some control over the offending instrument, Alabanza has decided to make a burger from scratch – using a makeshift stove on a kitchen island – but they need help, something that was sorely missing when they were hate-crimed as 100 people watched on. But it can’t just be anyone. It has to be a white, cis, straight man (a tall order in a theatre crowd).\n\nAdvertisement\n\nIn a surreal coincidence, the audience member called up on our night is also named Travis. The element of unpredictability in a show that predicates on spontaneous audience interaction, night after night, adds a frisson of danger, of unknowing. Alabanza launches into a litany of seemingly nonchalant yet incredibly pointed questions aimed at Travis. When was the last time he cried? Where does Australia’s racism stem from? Does he feel frightened by other men? Travis Alabanza in a scene from Burgerz Dorothea Tuch This line of inquiry is invasive at times in the way it extracts a public performance of vulnerability, but in the discomfort that ensues, Alabanza is making a trenchant point. Travis consented to audience participation, and he is being assessed on the basis of a narrative that he has crafted himself. Alabanza doesn’t consent to being ogled, denigrated or given a wide berth when they’re in public spaces, and they’re denied their personhood and agency by the broad brushstrokes of bigotry. Like the onion that Travis so expertly slices into rings as he assists Alabanza, there are layers upon layers to this piece of performance art. Part stand-up, part cooking demonstration, part history lesson, part soliloquy, Alabanza switches effortlessly between different modes of storytelling and engagement. They are irreverent and quick-witted, with an uncanny command of the room – peals of laughter give way to pin-drop silence as Alabanza’s shifts the register from playful and slapstick to sombre to enraged. It’s akin to emotional whiplash.\n\nAdvertisement\n\nRelated Article Sydney Festival A stranger attacked Travis. She didn’t get mad - she got herself a hit show The subject of their ire are the boxes – gestured towards literally in the set’s backdrop – that marginalise and suffocate people who don’t fit within society’s white, heteronormative confines. By inviting a foil onstage – who is, in every discernible way, their opposite – Alabanza projects their indignation and rage on to this person, who acts as both a receptacle and, because this is the Malthouse, a corrective to Alabanza’s experience of being assaulted with an airborne burger. In a moving display of solidarity, Travis bins the burger and offers Alabanza an (unreciprocated) hug before finally making his way offstage. Burgerz is strongest when it’s weaving disparate threads into striking commentary on being a trans person, all while pulling the rug out from under us. Culminating in a beautiful demonstration of safeguarding involving a tear-stricken front-row audience member, Alabanza adroitly shows us that the mutual duty we have to keep one another safe is the one thing that binds us all together.\n\nReviewed by Sonia Nair\n\nAdvertisement\n\nDANCE\n\nStorytime Ballet: The Nutcracker ★★★\n\nThe Australian Ballet, Comedy Theatre, until January 25 Is there time for one last holiday outing with the little ones? Why not try David McAllister’s breezy adaptation of The Nutcracker. Running at a mere 50 minutes, it’s the ballet equivalent of a fun-size chocolate bar: small, sweet and gone before you know it. The Nutcracker is a great introduction to ballet for children. Daniel Boud This is ballet done as an interactive panto-style comedy for children as young as three. The kids can dress up in something sparkly, make a bit of noise, enjoy a few magic tricks and, best of all, see some proper dancing. Sean McGrath, as the genial magician-narrator, keeps the kids giggling and cheering. The youngsters wave glowing wands or waggle magic fingers to transform toys into life-sized dolls. Adults, of course, are required to join in – or the spell doesn’t work.\n\nAdvertisement\n\nIn this stripped-back version, some of the mystery and enchantment inevitably goes missing. George Balanchine called The Nutcracker a ballet for children and adults who are children at heart. This version, however, will appeal mostly to the former. These annual Storytime concerts, produced by the Australian Ballet, are essentially a gentle introduction to ballet’s rituals, which carry their own strangeness and spell: when to clap, why nobody speaks and how the story and the dance politely disagree. The Nutcracker has plenty of dancerly moves to keep children entertained. Daniel Boud The inclusivity and theatrical zoom of The Nutcracker suit this format. Yes, there is plenty of dancerly dazzle for aspiring ballerinas, but you also get toy soldiers wrestling with sword-wielding mice in scenes of cheerful mayhem. An ensemble of 12 dancers does the heavy lifting, with that sense of fun that matters most here. Still, there are lovely flourishes from Bronte Mollison, Alexander Mitchell and Claudia Gordon – crisp, bright, unshowy. Mostly, though, it’s an entertaining spectacle. The costumes stick to a traditional look, while the set is kept very simple, albeit softened by dreamy, colourful backdrops.\n\nReviewed by Andrew Fuhrmann\n\nAdvertisement\n\nCIRCUS\n\nDuck Pond ★★★★\n\nCirca, Princess Theatre, until January 25 Letting actual acrobats loose on the most sacred of ballet relics, Swan Lake, feels like the logical endpoint of a long-term trend in which ballet has come to resemble an extreme sport: an exhibition of uncanny flexion and vertiginous airtime. Duck Pond is an acrobatic reimagining of Swan Lake. Daniel Boud Hardworking Brisbane circus company Circa offers nothing like a traditional retelling of the bewitched swan. Instead, this is a blithely impertinent mash-up: Odette as the Ugly Duckling, dreaming herself into a swan. Duck Pond opens at the prince’s birthday party, a full court of gentle gymnasts flipping, tumbling and vaulting into walkovers, then stacking on shoulders. The port de bras is impeccable, if port de bras now means balancing your mate on your head. Highlights include a startling four-high human tower, made all the more impressive in the Princess Theatre’s relative intimacy, and an aerial-silk act with Asha Colless holding a clean split before pitching forward into a core-straining horizontal line.\n\nAdvertisement\n\nThe story barrels along. The Black Swan (Maya Davies) arrives and the Ugly Duckling (Sophie Seccombe) is shamed for her lack of glamour. A troupe of mop-wielding ducks try to console her, but it doesn’t work – like Charlie Curnow, she must become a swan. At the pond, in a sequence of roof-raising throws, the Duckling discovers that she, too, can soar. Jethro Woodward’s sound design is here at its most inventive, with a cool reworking of Tchaikovsky, swapping passion for quirky play. Overall, Duck Pond is a wonderfully polished take on modern circus. Daniel Boud In the final act, Duck Pond takes a holiday turn as the fairytale ending is shoved aside. Instead of a wedding, the road cases are rolled in and the floor is torn up. Everything is stripped: both the stage and the performers. Well, no one’s actually nude, but some of the burlesque-flavoured business does skew older than you might expect for an all-ages show. The merriment ends with crowd-pleasing circus staples: hula-hoops and a Cyr wheel. Overall, it’s a wonderfully polished example of company director Yaron Lifschitz’s take on modern circus: a brisk dramatic premise that lets a youthful ensemble refresh some otherwise familiar routines.\n\nReviewed by Andrew Fuhrmann\n\nAdvertisement\n\nMUSIC\n\nThe Last Dinner Party ★★★★\n\nSidney Myer Music Bowl, January 15 The stage is set with a patchwork of torn, off-white curtains, arches, a hanging bell and plenty of steps and levels for the band to pace and parade. And they do. The Last Dinner Party perform at Sidney Myer Music Bowl on January 15. Richard Clifford Preppy, bacchanalian baroque pop band The Last Dinner Party comprises five women and non-binary folks (and a guy on drums up the back) in velvet and lace, and armed with various audaciously shaped guitars, synths, a baby grand, a mandolin, a sax and enough charisma to carry off these melodramatic and infectious songs. It’s earnest glam rock. They know how to chew the scenery. Their recent second album, From The Pyre, is showcased here – a confident and ornate bunch of songs drawing on early Kate Bush and 1970s rock operatics.\n\nAdvertisement\n\nAfter opener (and highlight) Agnus Dei, we’re lifted through killer harmonies, playfully erudite lyrics and big solos in songs like Count the Ways, The Feminine Urge and I Hold Your Anger. Abigail Morris of The Last Dinner Party. Richard Clifford In just a couple of years, The Last Dinner Party has released two albums and amassed an adoring fan base. They’re twenty-something, they skew female and queer, and they’re all in. They’re dressed up and equipped with tributes – flowers, signs, a homemade pair of angel wings – and the band gives back. Lead singer Abigail Morris even scrawls drawings on a few people in the front row, which they’ll go off and get tattooed. By the end of the set when they whip out their debut single and most enduring hit Nothing Matters and the very fun This Is the Killer Speaking, the crowd is fully locked in, even committing to choreography. Then they wrap it up with a brief reprise of Agnus Dei, like it’s all been one big musical spectacular. If you’re ever sitting down near the front at a show at the music bowl, turn around during a really big number and witness the crowd behind you. Pure joy.\n\nReviewed by Will Cox The Booklist is a weekly newsletter for book lovers from Jason Steger. Get it delivered every Friday.",
    "source": "TheAge",
    "cluster_id": 19
  },
  {
    "url": "https://www.theage.com.au/national/marsh-smacks-first-ball-over-the-rope-20260125-p5nwwf.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Marsh smacks first ball over the rope",
    "publish_date": "Tue, 27 Jan 2026 13:07:00 +1100",
    "category": "finance",
    "authors": [],
    "text": "Remove items from your saved list to add more.\n\nYou have reached your maximum number of saved items.\n\nSave this video for later\n\nAdd videos to your saved list and come back to them anytime.\n\nGot it",
    "source": "TheAge",
    "cluster_id": 20
  },
  {
    "url": "https://www.theage.com.au/sport/afl/i-am-doing-ok-taylor-adams-on-the-mend-after-alleged-assault-police-probe-continues-20260127-p5nxba.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "‘I am doing OK’: Taylor Adams on the mend after alleged assault, police probe continues",
    "publish_date": "Tue, 27 Jan 2026 12:55:17 +1100",
    "category": "sports",
    "authors": [
      "Peter Ryan"
    ],
    "text": "Veteran Sydney Swans midfielder Taylor Adams has reassured footy fans he is recovering well as police continue to investigate his alleged assault outside a licensed venue in Rose Bay on Saturday night.\n\nAccording to police the 32-year-old former Magpie and Giants midfielder was punched in the face by a man after an argument with two men he did not know.\n\nTaylor Adams has had a rough 12 months on the injury front Credit: AFL Photos via Getty Images\n\nAdams lost consciousness briefly, concerning onlookers in the aftermath.\n\nAdams was released from hospital on Sunday morning and was not on the training track with teammates on Monday as the club monitored his health following the incident.",
    "source": "TheAge",
    "cluster_id": 21
  },
  {
    "url": "https://www.theage.com.au/goodfood/sydney-eating-out/a-new-middle-eastern-wine-bar-in-martin-place-is-serving-egyptian-steak-frites-20260127-p5nxas.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "A new Middle Eastern wine bar in Martin Place is serving Egyptian steak frites",
    "publish_date": "Tue, 27 Jan 2026 12:50:48 +1100",
    "category": "finance",
    "authors": [
      "Erina Starkey"
    ],
    "text": "Advertisement\n\nEating outJust open A new Middle Eastern wine bar in Martin Place is serving Egyptian steak frites Former Chef of the Year Paul Farag opens a sibling venue to his two-hatted Aalia, where Middle Eastern bar snacks and wine “curiosities” reign supreme. Erina Starkey January 27, 2026 Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share A A A\n\nSteak frites may be a fixture on Sydney menus, but there’s only one place serving it as a wood-seared rump cap finished with a fenugreek and harissa-spiced “Cafe de Cairo” butter. You can find it in Aalia Wine Room, a new casual extension of two-hatted Middle Eastern restaurant Aalia at Martin Place. The menu was created by former Good Food Guide Chef of the Year Paul Farag, who has taken the North African and Arabic flavours of Aalia and adapted them for a relaxed, wine-bar setting. “Beautiful fishbowl”: The two-level space was inspired by Harry Seidler’s original MLC architecture. Jiwon Kim “With this being a wine bar, we sort of loosened up the rule book a little bit, so we’re going to have some charcuterie, and we’re going to have some cheese,” Farag says.\n\nAdvertisement\n\n“That was something people have always asked for in Aalia, but it never really stayed true to my vision of the restaurant because Middle Eastern cheeses aren’t really eaten at the end of the meal like you would in, say, French dining.” Restaurant reviews, news and the hottest openings served to your inbox. Sign up The charcuterie is served mezze-style and changes regularly, currently featuring a squid and truffle salami, beef pastrami and cured pork neck. The charcuterie plate and kibbeh nayeh. Jiwon Kim The menu also includes familiar bistro staples reimagined through a Middle Eastern lens. There’s a gilda, skewered with bastourma, pickles and a quail egg, and anchovy toasts spread with muhammara – a smoky-sweet red capsicum and walnut dip. A fish shawarma is designed to be eaten by hand, wrapped up in flatbread with a Murray cod wing, pickles, lettuce and toum.\n\nAdvertisement\n\nFarag will also bring back a few fan-favourite dishes such as the hawashi, a pan-fried Egyptian street-food pastry stuffed with minced lamb, nuts and onions, and terrific with beer. The basturma, pickled chilli and quail’s egg gilda. Jiwon Kim “It was something we had on the menu for a while at Aalia, and then, as most chefs do, I got sort of sick of cooking the same thing. But we’re putting it back on, and maybe the sujuk-stuffed artichoke will come back too. We want the menu to be fun and fluid and a lot more special-orientated.” The wine list, created by sommelier Sarah O’Dwyer, features 235 labels, with 31 available by the glass. It’s designed to encourage exploration, and includes a section on “curiosities”, such as an “Albino Pinot” from L.A.S Vino in Margaret River, and an Austrian blend of zweigelt and blaufrankisch grapes. A dedicated “discovery hour” invites guests to blind-select a wine special, which is revealed tableside.\n\nAdvertisement\n\nThe wine list includes “curiosities” like forgotten varietals and unusual blends. Jiwon Kim The design of the venue follows Aalia’s lead. The two-level space is completely glass-fronted, featuring spotted gum timber accents and banquette seating, inspired by Harry Seidler’s original MLC architecture, with seating for 42. “It’s a beautiful fishbowl. If you like people-watching, it’s the perfect spot,” Farag says. “We’re going to roll the dice and see if we can get a licence for outside because we would love to have a little area where you can sit in the sun. One of my favourite things to do on a Saturday or Sunday afternoon is share a bottle of wine outdoors and watch people go by.” Open Tue-Fri noon-late, Sat 5pm-late\n\nAdvertisement",
    "source": "TheAge",
    "cluster_id": 22
  },
  {
    "url": "https://www.theage.com.au/sport/tennis/how-players-prepare-for-extreme-heat-20260127-p5nxbx.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "How players prepare for extreme heat",
    "publish_date": "Tue, 27 Jan 2026 12:45:51 +1100",
    "category": "sports",
    "authors": [],
    "text": "How players prepare for extreme heat\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 23
  },
  {
    "url": "https://www.theage.com.au/business/markets/asx-set-to-jump-as-wall-street-climbs-a-climbs-gold-hits-record-20260127-p5nx6k.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Miners surge as ASX rallies; BHP eyes CBA’s crown",
    "publish_date": "Tue, 27 Jan 2026 12:34:10 +1100",
    "category": "finance",
    "authors": [
      "Staff Reporter"
    ],
    "text": "Advertisement\n\nUpdated BusinessMarketsWorld markets Miners surge as ASX rallies; BHP eyes CBA’s crown Staff reporter Updated January 27, 2026 — 12:34pm ,first published January 27, 2026 — 5:16am Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share A A A\n\nThe Australian sharemarket has rallied across the board after US stock indexes advanced overnight, while the price of gold continued to surge higher. The S&P/ASX 200 was up 94.1 points, or 1.1 per cent, in early afternoon trade, with all 11 industry sectors in the green. BHP jumped as it looks to take Commonwealth Bank’s title as the most valuable stock on the bourse. Wall Street has made a positive start to the week. AP The Australian dollar continued to strengthen on the back of more US dollar weakness. The Aussie was trading at US69.18¢ at 12.29pm AEDT. Iron ore miners rose as the price of the key steel-making ingredient strengthened with BHP jumping 2.8 per cent, Fortescue rising 1.5 per cent and Rio Tinto advancing 1.8 per cent. Gold miners are mixed with Northern Star up 0.5 per cent and Evolution 1.1 per cent lower. Silver prices roared higher, boosting South 32 by 2.3 per cent.\n\nAdvertisement\n\nFinancial stocks advanced, with the big four banks all in the green. Commonwealth Bank rose 0.8 per cent, Westpac climbed 0.6 per cent, National Australia Bank advanced 1.3 per cent and ANZ Bank jumped 1.2 per cent. Related Article Opinion\n\nGold Trump’s gold rush: America has the world running scared Stephen Bartholomeusz Senior business columnist Energy stocks advanced with oil prices strengthening. Woodside rose 1.7 per cent, Santos gained 2.9 per cent and Yancoal was 0.7 per cent higher. On Wall Street, the S&P 500 rose 0.5 per cent and won back its losses from last week’s dip. The Dow Jones climbed 313 points, or 0.6 per cent, and the Nasdaq composite added 0.4 per cent. Baker Hughes helped lead the way on Wall Street and rose 4.4 per cent after delivering a stronger profit for the latest quarter than analysts expected. The energy technology company said it’s benefiting from strong momentum in demand for liquefied natural gas, among other things.\n\nAdvertisement\n\nCoreWeave climbed 5.7 per cent after Nvidia said it invested $US2 billion ($2.9 billion) in the stock and will help accelerate the buildout of CoreWeave’s artificial-intelligence factories, which use Nvidia chips, by 2030 to advance AI adoption. Nvidia slipped 0.6 per cent. USA Rare Earth rallied 7.9 per cent after saying the US government agreed to provide $US277 million in federal funding to help the company produce heavy rare earths, minerals and magnets. The Trump administration also agreed to a proposed $US1.3 billion loan, while the company separately raised $US1.5 billion through private investors. Much of the rest of Wall Street was relatively quiet. That included mixed performances for airlines, which had to cancel thousands of flights due to the winter storm that swept much of the United States over the weekend. Delta Air Lines lost 0.7 per cent, and Southwest Airlines added 0.2 per cent. The action was stronger in the gold market, where the metal’s price rallied another 2.1 per cent and briefly topped $US5,100 per ounce for the first time to set another record. Silver surged even more and settled 14 per cent higher. Prices for precious metals have been soaring as investors look for safer places to park their money amid threats of tariffs, still-high inflation, political strife and mountains of debt for governments worldwide.\n\nAdvertisement\n\nThe latest worry to pile atop the swelling list was President Donald Trump’s threat to impose a 100 per cent tariff on goods from Canada if it signs a free trade deal with China. Related Article Opinion\n\nInterest rates Power bills and interest rates: Households could face a double whammy on costs Elizabeth Knight Business columnist The US dollar’s value also continued its recent slide against peers. Last week, it was US tariff threats related to Greenland that drove some global investors away from the dollar. This time, it was the Japanese yen leaping sharply because of expectations that officials in both Japan and the United States may intervene in the market to prop up the Japanese currency’s value. With AP The Market Recap newsletter is a wrap of the day’s trading. Get it each weekday afternoon.\n\nSave You have reached your maximum number of saved items. Remove items from your saved list to add more. Share More: World markets\n\nShares\n\nWall Street",
    "source": "TheAge",
    "cluster_id": 24
  },
  {
    "url": "https://www.theage.com.au/national/western-australia/wa-news-live-two-men-rushed-to-hospital-after-near-drowning-at-trigg-beach-20260127-p5nx9h.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "WA news LIVE: WA teacher accused of having student’s baby hit with more sexual abuse charges",
    "publish_date": "Tue, 27 Jan 2026 12:19:12 +1100",
    "category": "finance",
    "authors": [],
    "text": "To breaking news now and the Mandurah school teacher accused of having a baby by her student earlier this month has pleaded guilty to all 11 charges against her.\n\nNaomi Craig, 33, has admitted to sexually penetrating the boy eight times over the course of the persistent sexually offending, which lasted 16 months between 2024 and 2025.\n\nCourt reporter Rebecca Peppiatt was in Mandurah Magistrates Court this morning, and will bring you more details soon.",
    "source": "TheAge",
    "cluster_id": 25
  },
  {
    "url": "https://www.theage.com.au/lifestyle/life-and-relationships/the-hunger-for-beach-property-has-spilled-onto-the-dunes-cabanas-are-an-up-yours-to-equity-20260111-p5nt5g.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "The hunger for beach property has spilled onto the dunes. Cabanas are an ‘up yours’ to equity",
    "publish_date": "Tue, 27 Jan 2026 12:16:02 +1100",
    "category": "lifestyle",
    "authors": [
      "Jacinta Parsons"
    ],
    "text": "What is it about sport and beach holidays that end up illuminating the darker sides of humanity? We have seen time and time again the reckoning of our society at the end of a football boot, and now, the humble beach has become the same canary in the coal mine.\n\nThis summer feels as if there has been a point of no return for the humble beach ambler. The hunger for property acquisition in some of these fancy beach environs has spilled over onto the sandy dunes, where once we were equal and lived a utopian dream. Remember the days when the beach was not owned or staked as territory, but a shared egalitarian natural resource? It didn’t matter, once you had hit the sand, if you drove to the beach in your expensive car because your speedos looked the same as my dad’s when applied to both of your fulsome girths. We all had just a bucket and a spade to build what we could with the skillset of those in our family. Good news if your mum was a structural engineer, not so good if she accounted.\n\nCabanas line Safety Beach on the Mornington Peninsula. Joe Armao\n\nBut, to avoid nostalgia tainting a true view of the olden days, there were little flashes where what we see today in our hunger to win the beach, may have been predicted. While on the face of it, a sandcastle is a joyous experience of hands deep inside the wet sand, children collaborating on best use of buckets, it wasn’t really ever that innocent. My grandad was a frustrated construction man, which was of enormous benefit in the sandcastle wars. He likely took it too far when he suggested the enormous holes, dug deep into the sand and complete with stairs, were in fact to catch the joggers who ran before dawn. He brought industrial level equipment and would spend the six hours of our beach day, focussed and effective on building our dream dungeon. Mind you, he wore slacks and a button-up shirt while he worked away, and I never saw him in the actual surf, but he took his role as the leader of our family sandcastle (and dungeon) build, seriously, as a man who loves his family should.\n\nAnd then of course there was beach cricket where the desire for a win found its way onto the innocent sandy turf. I remember the hunger to show my brothers that I too had been playing cricket at lunchtime and knew how to wield the plastic bat with aplomb. And later, as a parent, the hunger to prove to my children that I had skillz, overshadowed what perhaps should have been an enriching time of mother-child connection.",
    "source": "TheAge",
    "cluster_id": 26
  },
  {
    "url": "https://www.theage.com.au/sport/rugby-union/kiwi-poaching-raid-confirmed-as-kiss-successor-revealed-20260127-p5nx7f.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Why Kiss successor’s All Blacks ambitions were ‘never really a viable option’",
    "publish_date": "Tue, 27 Jan 2026 12:12:43 +1100",
    "category": "sports",
    "authors": [
      "Nick Wright"
    ],
    "text": "Vern Cotter said he was never in the mix to take the All Blacks coaching reins, having already been deep in discussions to help guide Australian rugby towards a brighter future.\n\nThe New Zealander, now at the helm of Super Rugby powerhouse the Auckland Blues, will succeed Les Kiss at the Queensland Reds from 2027 once the latter takes over the top job at the Wallabies.\n\nCotter brings with him two premierships – with the Blues in 2024 and Clermont Auvergne in the French Top 14 – while he also enjoyed a strong international stint with Scotland.\n\nVern Cotter said he had “verbally given my acceptance to the Reds before the All Black thing came up”. Credit: Mike Hewitt\n\nHe was being discussed as a potential option for the vacant All Blacks job, but the 64-year-old said he had already been enticed to Queensland well before Kiwi coach Scott Robertson’s shock axing.",
    "source": "TheAge",
    "cluster_id": 27
  },
  {
    "url": "https://www.theage.com.au/national/from-stiff-to-sought-after-australia-s-healthy-addiction-to-golf-20251103-p5n7ag.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "From stiff to sought-after: Australia’s ‘healthy addiction’ to golf",
    "publish_date": "Tue, 27 Jan 2026 12:04:21 +1100",
    "category": "sports",
    "authors": [
      "Madeleine Heffernan"
    ],
    "text": "Advertisement\n\nNationalAustralian Open From stiff to sought-after: Australia’s ‘healthy addiction’ to golf Madeleine Heffernan January 27, 2026 — 12:04pm Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share A A A\n\nRecreational golf in Australia is booming. Record numbers of people are joining clubs and playing at driving ranges, minigolf facilities and simulators to quench their “healthy addiction”. Golf Australia claims the boom has killed off calls for courses to be converted to housing or parkland, and it says it will fight to protect courses from development “both for the people that play, but also for the environment”. Paige Chrzanowski at Barwon Valley Golf Course. Paige is new to golf. Joe Armao The sport’s popularity has led to higher fees at in-demand courses and waiting lists that exceed five years. Members of private clubs in Melbourne’s sand belt pay around $7000 to $10,000 a year, plus joining fees of about $20,000.\n\nAdvertisement\n\n“Some clubs have waiting lists where they haven’t previously had waiting lists. Some clubs … have increased entrance fees,” said Golf Australia chief executive James Sutherland. Sutherland said golf clubs had never experienced the sort of traffic they were seeing today. Rory McIlroy helped attract record crowds to the Australian Open in Melbourne. Getty Images “Ten or 20 years ago, people thought that it [the game] was stiff, with lots of rules, and difficult. Those things have changed,” he said. Data shows 4.7 per cent of people participated in golf in the year to June 2025, up from 4.4 per cent the previous year, according to the Australian Sports Commission.\n\nAdvertisement\n\nSeparate figures from Golf Australia show 3.8 million Australians played some form of golf in the year to June, with strong growth among women, children and newcomers. More than 477,000 Australians are members of a golf course, up 3.5 per cent year-on-year, Golf Australia said. Clubs membership numbers have increased by a record 24.1 per cent since 2017-18. The figures come as the billionaire Fox family mulls plans for its $100 million purchase of Capital Golf Course in Melbourne’s south-east, formerly owned by Crown casino for exclusive use by its biggest gamblers. Golf lovers say the growth has been led by Baby Boomers seeking gentle exercise, people playing while working remotely, and time-poor women enjoying new, shorter versions of the sport.\n\nAdvertisement\n\nRelated Article Australian Open The putt that sank Cameron Smith – and his Australian Open hopes Golf is also one of the few sports young people can play with their parents or grandparents, said Sutherland. “There are stories around Australia of four generations playing together in the one group,” he said. Sutherland said entrepreneurs had invested in “off-course” golf such as driving ranges, minigolf facilities and simulators to feed the country’s “healthy addiction around golf”. “People want to access the game, and there are lots of less traditional formats now,” he said. Sutherland said increased participation in golf had left clubs and facilities “in better shape financially than they were 10 years ago”, when a KPMG report showed 58 per cent of clubs were exhibiting signs of distress or serious distress.\n\nAdvertisement\n\nWith more people participating in golf, Sutherland said the world had “moved on” from pandemic-era calls for courses to be converted to public parkland or housing. “I think it was a bit of an anomaly in time,” he said. But some courses are still battling dwindling memberships and high maintenance, water, and staff costs, prompting them to merge with larger clubs or to sell to developers. Paige Chrzanowski and her two children Evie (7) and Julian (5) play golf at Barwon Valley Golf Course. Joe Armao In Sydney, NSW Premier Chris Minns has proposed to chop Moore Park’s 18-hole golf course in half to create a 20-hectare park close to Sydney’s CBD. Rossdale Golf Club in suburban Melbourne intends to sell the course for housing and relocate. But the conversion of golf courses to housing has not always gone to plan. The country’s biggest superannuation fund, AustralianSuper, bought Melbourne’s Kingswood Golf Course in 2014, intending to put housing on it, but failed to do so. Kingswood was later sold to a developer.\n\nAdvertisement\n\nMeanwhile, Waverley Golf Club in Melbourne’s outer east merged with the nearby Churchill Park Golf Club in 2016, intending to move to the latter’s Endeavour Hills course and sell its 18-hole facility to developers. But almost 10 years later, the project remains in limbo as the golf club site is within a green wedge. The fairways of Cathedral Lodge Golf Club snake through rolling countryside near Alexandra, north-east of Melbourne. Gary Lisbon The country’s most expensive course, Cathedral Lodge in Victoria’s north-east, which is owned by businessman David Evans and accessible by helicopter, is believed to have hiked its upfront fees to invitation-only members to more than $150,000. Newcomers to the sport include Paige Chrzanowski, 38, who plays four to five holes each week with coach Jay McKenzie at the Geelong Golf Academy. McKenzie also coaches Chrzanowski’s two young children and husband.\n\nAdvertisement\n\nRelated Article David Evans' dream golf course designed by Greg Norman set in country Victoria Chrzanowski said that while she had always thought golf was just for men, she is now “addicted”. “I’ve found my niche,” she said. Chrzanowski said she expected her family to play golf together in the years to come. Daniel Cromie, a former golf professional who now leads Commonwealth Golf Club’s hospitality operations, said the sport was busier than ever.\n\nAdvertisement\n\nRelated Article British Open Pro tip: The Australian golf courses that emulate the rugged British Open “People want places that feel steady and familiar. If we provide warm service, great food and a welcoming culture, the game will continue to grow,” he said. Close to 105,000 golf fans packed into Royal Melbourne golf course in December for the Australian Open. They were there for Queenslander Cam Smith and Rasmus Neergard-Peterson’s one-shot victory. US president Donald Trump recently said he would consider attending the Presidents Cup, to be held at Melbourne’s Kingston Heath Golf Club in 2028. “I actually have been to Australia, and did play one of your great golf courses – have great golf courses there,” he said during a visit from Prime Minister Anthony Albanese. Start the day with a summary of the day’s most important and interesting stories, analysis and insights. Sign up for our Morning Edition newsletter.",
    "source": "TheAge",
    "cluster_id": 28
  },
  {
    "url": "https://www.theage.com.au/business/workplace/employee-sacked-for-failing-to-return-to-office-despite-contract-allowing-wfh-20260126-p5nx1b.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Employee sacked for failing to return to office, despite contract allowing WFH",
    "publish_date": "Tue, 27 Jan 2026 11:59:22 +1100",
    "category": "finance",
    "authors": [
      "Millie Muroi"
    ],
    "text": "Advertisement\n\nBusinessWorkplaceUnfair dismissal Employee sacked for failing to return to office, despite contract allowing WFH Millie Muroi January 27, 2026 — 11:59am Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share A A A\n\nA Melbourne man who refused to comply with a company’s return-to-office policy has failed to have his dismissal overturned despite signing a contract that allowed him to work from home. Last week, the Fair Work Commission ruled that print software company PaperCut’s decision to sack an employee who failed to follow its hybrid workplace policy was not harsh, unjust or unreasonable. The employer told the commission that the worker had not given any personal reason why he should not attend the office. The Fair Work Commission found PaperCut’s decision to sack an employee was both lawful and reasonable. Michele Mossop This contrasts with the case of a Westpac worker, who last year successfully challenged the bank’s office attendance policy after formally requesting flexible working arrangements under a section of the law for workers with various life or carer circumstances. As businesses increasingly transition from remote work to requiring a minimum office attendance, the commission has been dealing with cases that require it to decide whether employees who want to work remotely are entitled to do so.\n\nAdvertisement\n\nProduct engineer Richard Johnson, who started working at PaperCut in April 2022, signed an employment contract at the time which required him to “comply with such reasonable and lawful directions and all policies, rules and regulations from time to time provided by PaperCut”, but also permitted him to work from his personal residence “in line with relevant PaperCut policy”. That contract also stated he “may be required to work at other locations from time to time” and did not specify a primary place of work. When Johnson began working with the firm, PaperCut policy allowed employees to work from home and its offices “as possible and appropriate as a hybrid workplace”. The Fair Work Commission’s ruling noted that on February 25, 2022, the Victorian government removed its strong recommendation for employees to work from home, encouraging a return to the office as the country emerged from the pandemic. In August 2022, PaperCut sought to amend Johnson’s contract to clarify that his place of employment included the PaperCut office as well as his personal residence, saying the initial contract was incorrect.\n\nAdvertisement\n\nJohnson did not agree with this change, maintaining that his contract allowed him to work remotely, but attended the PaperCut office “on an intermittent basis and as required,” according to the judgment. Related Article AI Computer says no: AI vetting rejects job hunters in record time After staff consultation and some hybrid work trials, PaperCut developed and put in place a “return to hybrid work” policy and model, which was formally introduced in August 2023 with the aim of getting employees to achieve three days of in-office attendance a week by January 2025. In December 2024, PaperCut told Johnson his work location was being changed from his personal residence to the PaperCut office on January 1, 2025, and that he would have to comply with the change. While Johnson sought legal advice and said PaperCut’s demand was a breach of his contract, the company said it was confident its requirement was not a breach of his contract and was “both lawful and reasonable”.\n\nAdvertisement\n\nPaperCut warned that failure to comply with “may result in disciplinary action”, noting his contract did not specify his primary work location and required him to work in line with company policy and at locations other than his personal residence from time to time. On May 20, 2025, Johnson was issued a final warning letter spelling out that he would face disciplinary action “up to and including the termination of his employment” if he did not meet the three-day-in-office requirement. On June 19, Johnson was dismissed for failing to comply with PaperCut’s hybrid work policy. “Following his dismissal, Mr Johnson has not been able to find alternative employment despite attempting to do so,” the judgment read. Johnson argued his sacking was “disproportionate and harsh” when there were no other issues with his employment and that the company could have pursued more proportionate options, such as a court declaration of contractual rights, given there was a chance his interpretation, supported by external legal advice, was correct. Johnson also said he was told he would not be forced to sign the suggested change to his contract, that other employees continued to work remotely, and that his contract allowed him to work remotely.\n\nAdvertisement\n\nRelated Article AI Job hunters warned against ‘machine gun’ applications as AI takes off However, he accepted that he did not comply with the company’s directions and that he was dismissed because of this non-compliance. PaperCut argued Johnson was given “ample time and opportunity” to understand and comply with the direction and was warned “in clear and explicit terms” that a failure to comply would result in termination of his employment. The company also noted Johnson did not request a flexible work arrangement or identify any personal reason why he could not comply with its office attendance policy. Commissioner Scott Connolly said PaperCut’s direction was lawful because it “involved no illegality” and was within the scope of Johnson’s contract, which did not give him an unconditional right to work from home.\n\nAdvertisement\n\nConnolly also said PaperCut’s request was not unreasonable because of the steps it took to transition to, and explain, its new working arrangements. He also said PaperCut made it “explicitly clear” to Johnson what would happen if he failed to follow their direction. Sydney University professor emerita Joellen Riley said relying on the terms of an employment contract is rarely of much benefit, and that each decision is highly dependent on the specific facts of the case. “Most employment contracts have clauses in them that allow the employer a high level of flexibility in changing terms of your role, location and other aspects of your work,” she said. For people wanting to challenge an employer’s direction to return to the office, they should first look at requesting flexible work arrangements, Riley said. However, she noted this right is only available to people who meet certain requirements, such as caring for elderly parents or children, having a disability, or being aged over 55, and that there is no guarantee the request will be granted. “It’s not just for someone who thinks they’d like to work from home because it’s easier to go out at lunchtime and practice their golf swing,” she said. The Market Recap newsletter is a wrap of the day’s trading. Get it each weekday afternoon.\n\nSave You have reached your maximum number of saved items. Remove items from your saved list to add more. Share License this article More: Unfair dismissal Millie Muroi is the economics writer at The Sydney Morning Herald and The Age. She was formerly an economics correspondent based in Canberra’s Press Gallery and the banking writer based in Sydney. or email. Connect via X",
    "source": "TheAge",
    "cluster_id": 29
  },
  {
    "url": "https://www.theage.com.au/business/markets/what-if-trump-doesn-t-chicken-out-next-time-20260127-p5nx87.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "What if Trump doesn’t chicken out next time?",
    "publish_date": "Tue, 27 Jan 2026 11:58:24 +1100",
    "category": "finance",
    "authors": [
      "Stephen Bartholomeusz"
    ],
    "text": "Advertisement\n\nBusinessMarketsTrump's White House Opinion What if Trump doesn’t chicken out next time? Stephen Bartholomeusz Senior business columnist January 27, 2026 — 11:58am\n\nJanuary 27, 2026 — 11:58am Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share A A A\n\nInvestors think they have Donald Trump worked out. He’s a classic bully who will always back down when confronted by a strong opponent, whether that opponent is a geopolitical counterpart or the markets themselves. That’s the premise behind the market’s faith in the “TACO” (Trump will Always Chicken Out) trade. Donald Trump has proven to be bluff and bluster so far, but markets are getting too complacent. AP For much of Trump’s second term, that has been how events have played out, most spectacularly last year when the US share and bond markets melted down in response to Trump’s April 2 “Liberation Day” tariffs. Trump immediately paused those Draconian tariffs for 90 days and subsequently diluted the severity of what he had planned. China, faced with exceptionally punitive tariffs, responded with similarly punishing tariffs of its own. Trump backed off and now largely avoids references to America’s trading relationship with China.\n\nAdvertisement\n\nLike any bully, Trump has turned his attention to apparently softer targets. Related Article Opinion\n\nGold Trump’s gold rush: America has the world running scared Stephen Bartholomeusz Senior business columnist He’s threatened the BRICS economies with tariffs because they have talked about creating an alternate currency to the US dollar; he’s threatened Canada for declining to become the 51st state; he threatened potential customers for Venezuelan oil; Brazil for jailing its former president; Canada (again) for airing an advertisement showing Ronald Reagan’s critiques of tariffs; European nations for standing up against his threat to forcibly acquire Greenland, possibly via an invasion; France for President Emmanuel Macron’s refusal to join his “Board of Peace”; and Canada (yet again) for doing a minor trade deal with China. None of those threats materialised. There’s more bluff and bluster than follow-through. The Greenland episode, however, is interesting and instructive because, as was the case with the Liberation Day tariffs backdown, it took a sharp response from the markets for Trump to abandon his threats.\n\nAdvertisement\n\nSome credit should also go to the Europeans, who threatened to retaliate if Trump went ahead with his announcement of an extra 10 per cent tariff on Europe’s exports to the US, rising to 25 per cent, unless they dropped their opposition to his plan to annex Greenland. Apart from dusting off their plans to impose tariffs on $US93 billion ($135 billion) of their exports, the European Union also started talking seriously about using their trade “bazooka” or the “Anti-Coercion Instrument” that would enable a raft of responses, including restrictions on the activities of US tech companies and banks within the EU. Trump has kept investors on edge. AP The European threats might have had some impact on Trump’s backdown, but it is the markets that seem to have the most influence over Trump on issues of real import. Last week, as it appeared the temperature around Trump’s ambitions for Greenland was reaching boiling point, the US sharemarket fell more than 2 per cent, bond yields spiked and the value of US dollar dropped sharply.\n\nAdvertisement\n\nWhile not as dramatic as the response to the April 2 tariffs, it was a warning shot across Trump’s bows. Related Article Opinion\n\nTrump's White House Appeasing Trump won’t work. Could Europe deploy its ‘bazooka’ over Greenland? Stephen Bartholomeusz Senior business columnist After a meeting with the NATO Secretary-General Mark Rutte – who had no authority to speak for Denmark or Greenland – Trump announced (despite previously saying anything other than ownership of Greenland would be unacceptable) he had achieved a “framework” agreement with Rutte and would take his EU tariffs off the table. The meeting, Rutte has said, did not include any discussion of ownership of Greenland. Perhaps Rutte reminded Trump that, under a 1951 agreement with Denmark, the US has always had rights to establish military bases in the territory. Having created chaos and fear, Trump chickened out again. Whatever the framework might be – and Denmark and Greenlanders will have the final say in what it might look like – it doesn’t appear to include US ownership of the icy island.\n\nAdvertisement\n\nThe problem for investors is that the TACO trade is now embedded in market psychology. Their experience of Trump in this term tells investors that he will huff and puff in social media posts and threaten (usually with tariffs), but will either do nothing to follow through or, at the first whiff of a market response, fold. Related Article Trump's America A particular brand of carnage has taken hold here in America The relatively mild response to the prospect of the US invading and seizing the territory of an ally and NATO partner – blowing up NATO in the process – produced only a relatively mild response in markets because investors were betting that the TACO trade would play out, as it did. If enough investors think Trump will always chicken out when there is any level of pushback from those he has targeted, however, there won’t be a sufficiently strong market response to persuade him to walk back his threats. At some point, if the markets remain sanguine, he’ll press ahead and something seismic – a financial crisis, perhaps – might occur. It’s not as though Trump hasn’t done some of the things he has threatened since re-taking the White House.\n\nAdvertisement\n\nApart from the brutal and increasingly controversial purge of undocumented immigrants (and some US citizens) that is continuing, the assaults on domestic institutions, the health and educational establishments and science (and the bulldozing of the East Wing of the White House to make room for Trump’s glitzy ballroom), Trump has imposed the highest level of tariffs since the Great Depression. They may not be as extreme as those announced on April 2, but at more than 7 times their pre-Trump 2.0 levels, they are very high and are having, and will increasingly have, a deleterious impact on American households’ costs. Trump keeps finding new targets for his tariffs, so their average rate of about 17 to 18 per cent (about 10 percentage points less than what was announced on April 2) might yet rise. That says the markets shouldn’t take it as a given that Trump will always chicken out. If investors don’t react adversely to the worst of his plans, he might well pursue them to a conclusion.\n\nAdvertisement\n\nSharemarket investors are particularly important because Trump has always seen that market as a barometer of his success. US consumption has held up, despite the tariffs and, along with the massive investments in artificial intelligence, helped buoy the economy because the wealthier households – those exposed to the market – have increased their spending. The problem for investors is that the TACO trade is now embedded in market psychology. There are, of course, other reasons for investors, particularly non-US investors, to protest Trump’s policies by selling their shares and bonds. The continuing explosion in US debt since Trump regained office, the social upheaval, the degradation of US capabilities, the weaknesses in an economy largely being held up by the massive investment in artificial intelligence and the disdain and hostility the administration has shown to its former closest allies and trading partners are reason enough.\n\nAdvertisement\n\nRelated Article Opinion\n\nInvesting Team TACO cashes in as Trump folds again Elizabeth Knight Business columnist The fear of debasement of the US dollar and their debts as a strategy for dealing with America’s deficits and debt has already seen a significant depreciation of the dollar, a flight to gold and longer-term bond yields that have remained stubbornly high even as short-term rates have been pushed down by the Federal Reserve Board’s rate cuts are indicators of either a loss of confidence in America’s future, an aversion to being a part of it, or both. That underlying structural shift in demand for US securities could amplify the impact of an investor revolt in response to one of Trump’s more destructive demands. Unless investors accept that, for the TACO trade to work, they need to escalate their response to each and every instance, however, the trade itself will fizzle out and Trump will be unconstrained. It isn’t predestined that Trump will always chicken out. The Market Recap newsletter is a wrap of the day’s trading. Get it each weekday afternoon.",
    "source": "TheAge",
    "cluster_id": 30
  },
  {
    "url": "https://www.theage.com.au/sport/tennis/tiley-cahill-exchange-during-heat-delay-20260127-p5nxax.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Tiley, Cahill exchange during heat delay",
    "publish_date": "Tue, 27 Jan 2026 11:56:37 +1100",
    "category": "finance",
    "authors": [],
    "text": "Tiley, Cahill exchange during heat delay\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 31
  },
  {
    "url": "https://au.news.yahoo.com/heatwave-tests-energy-grid-power-021133000.html",
    "title": "Heatwave tests energy grid as power demand skyrockets",
    "publish_date": "2026-01-27T02:11:33Z",
    "category": "finance",
    "authors": [],
    "text": "Electricity demand has jumped as people rush to keep homes and businesses cool, though heatwave states have been assured there's enough supply to ward off widespread outages.\n\nSouth Australian Premier Peter Malinauskas said demand on the network was \"extraordinary\" but still off the peaks seen in other times.\n\n\"So for as long as that trajectory continues, there's no suggestion of any risk at this stage,\" he told ABC Radio.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nAdelaide sweltered through its hottest night on record on Monday and the heatwave impacting South Australia and other southeastern states is continuing into Tuesday.\n\nThe extreme heat is continuing, with Melbourne tipped to record its hottest day since 2009. (Michael Currie/AAP PHOTOS)\n\nEvenings are among the toughest times for energy networks as solar generation starts to wind down just as people return home and switch on their air conditioning units.\n\nDuring these periods of spiking demand, the market seeks generation and supply from more expensive sources than solar, sending wholesale prices higher.\n\nTony Wood, energy analyst from the Grattan Institute think tank, said South Australia's overnight spot prices peaking at $20,300 per megawatt hour were \"pretty well the maximum\".\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\n\"That just tells you that things were very, very, very bad indeed in terms of supply and demand,\" he told ABC Radio.\n\n\"What that's basically saying is, we need everything to just be online or in some cases, they even need some industrial customers who can reduce their demand.\"\n\nFortunately, all major coal power stations and gas generators have been up and running, keeping at bay any major supply issues, including blackouts.\n\n\"I'm not saying that we're going to lose power, but this is as tough as I've ever seen it,\" Mr Wood said.\n\nVictorians are also experiencing the extreme heat, with Melbourne set to swelter through its hottest day since the devastating Black Saturday bushfires in 2009.\n\nVictorians have been assured there are enough reserves to meet their electricity needs on Tuesday. (Michael Currie/AAP PHOTOS)\n\nThe state's energy minister, Lily D'Ambrosio, said Victoria had \"quite healthy\" electricity supplies.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\n\"Despite the fact that today we're looking at new records being broken, the market operator is very confident that we have more than sufficient reserves in place to meet our electricity needs today,\" she told reporters on Tuesday.\n\nYet with multiple fires burning across the state, the energy minister warned local outages could be caused by damage to electrical hardware and infrastructure.\n\nMr Wood said surging spot electricity prices would have minimal impact on annual household power costs.\n\nWholesale prices make up just 30-40 per cent of bills and prices tend to average out over the year to around $100 a megawatt hour, or less.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\n\"These prices won't last forever, they're more of an issue for the market and generating supply to respond to the demand we're seeing, and the weather patterns we're seeing,\" he said.\n\nMr Wood said the pressures on the electricity system during extremely hot weather underscored the need to build transmission to better connect different parts of the network, and the need to \"aggressively\" roll out renewables.",
    "source": "Yahoo",
    "cluster_id": 37
  }
]