[
    {
        "url": "https://www.9news.com.au/national/common-painkillers-ibuprofen-paracetamol-linked-to-antibiotic-resistance/f1c775b6-65ab-4501-b74e-124afb1f715a",
        "title": "Common painkillers linked to one of the world's biggest health threats",
        "publish_date": "Tue, 26 Aug 2025 01:02:34 +0000",
        "category": "lifestyle",
        "authors": [
            "Aug"
        ],
        "text": "A common household staple has been linked to one of the ﻿world's biggest health threats: antibiotic resistance.\n\nThe World Health Organisation (WHO) reported that bacterial resistance was directly responsible for 1.27 million global deaths in 2019 and called it a significant global threat to public health.\n\nNow ﻿research from ﻿the University of South Australia has revealed common painkillers such as ﻿﻿ibuprofen and paracetamol have been fuelling antibiotic resistance.\n\nREAD MORE: Dangerous inmate only cell contact for mushroom killer\n\nCommon painkillers like ﻿﻿ibuprofen and paracetamol have been fuelling antibiotic resistance. (Getty)\n\nThe first-of-its-kind study found the two drugs drove resistance when used ﻿individually and could even amplify it when used together.\n\nIn one instance, researchers discovered that using ﻿ibuprofen and paracetamol alongside the broad-spectrum antibiotic ciprofloxacin to treat Escherichia coli (E. coli) led to significantly increased bacterial mutations.\n\nThat made ﻿the E. coli highly resistant to the antibiotic.\n\n\"Worryingly, the bacteria were not only resistant to the antibiotic ciprofloxacin, but increased resistance was also observed to multiple other antibiotics from different classes,\" lead researcher Associate Professor Rietie Venter said.\n\n\"We also uncovered the genetic mechanisms behind this resistance, with ibuprofen and paracetamol both activating the bacteria's defences to expel antibiotics and render them less effective.\"\n\nREAD MORE: Australia Post suspends deliveries to the US after Trump tariffs\n\nWhere Australia ranks in countries with the greatest health freedoms View Gallery\n\nResearchers also assessed the effects of several other medications﻿ on antibiotic resistance, including metformin ﻿and pseudoephedrine.\n\nThe results made it clear that ﻿\"antibiotic resistance isn't just about antibiotics anymore\".\n\n\"Antibiotics have long been vital in treating infectious diseases, but their widespread overuse and misuse have driven a global rise in antibiotic-resistant bacteria,\" Venter ﻿said.\n\nThe study suggested further studies into the impacts of other drugs on ﻿antibiotic effectiveness were required in order to better understand and tackle the issue.\n\nVenter said \"antibiotic resistance isn't just about antibiotics anymore\". (Getty)\n\nThis was increasingly important﻿ for ﻿vulnerable groups, such as people in aged care homes where many residents took multiple medications daily.\n\n\"This doesn't mean we should stop using these medications, but we do need to be more mindful about how they interact with antibiotics – and that includes looking beyond just two-drug combinations.\"",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/finance/fortescue-profits-plunge-41-per-cent/52326b90-7636-4c5f-9180-37dc8092e423",
        "title": "Profits at Andrew Forrest's mining giant Fortescue slide by 41 per cent",
        "publish_date": "Tue, 26 Aug 2025 00:44:26 +0000",
        "category": "finance",
        "authors": [
            "Aug"
        ],
        "text": "A﻿ustralian mining giant Fortescue today announced a 41 per cent drop in its annual profit after a year of falling iron ore prices.\n\nThe mining and green energy company run by Australian billionaire Andrew Forrest recorded a net profit after tax of $US3.37 billion ($5.2 billion), compared with $US5.68 billion a year ago.\n\nThe figure came in slightly below market forecasts.﻿\n\nREAD MORE: Australia Post suspends deliveries to the US after Trump tariffs\n\nAndrew Forrest, executive chairman and founder of Fortescue. (The Sydney Morning Herald)\n\nShareholders will get a 60-cent final dividend next month, bringing the complete year total to $1.10 per share.\n\nShaky global iron ore prices, and falling demand from China's factories and construction sector were behind the profit dip.\n\nExecutive chairman Forrest﻿, an advocate for green hydrogen as a clean energy source, today acknowledged transforming his company into a major producer of the energy-rich fuel was challenging.\n\n\"No new industry or transformational shift has ever been linear or easy,\" Forrest said in a statement to the ASX today.\n\n\"We haven't always got it right, but we learn every day from advances and setbacks.\"﻿\n\nIn July, Fortescue announced it was cutting 700 jobs across its global operations amid reports it was scaling back its goals to be a major hydrogen producer.\n\nFalling demand for iron ore in Chinese factories has impacted global prices of the commodity. (AP)\n\nBut﻿ the company insisted its green energy and zero emissions pushes will continue.\n\n\"Fortescue remains resolute in its commitment to be the world's leading green technology, energy and metals company with a laser focus on achieving Real Zero by 2030,\" it said in a statement.\n\nFortescue ﻿was founded in Western Australia in 2003 and exports more than 190 million tonnes of iron ore each year.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/world/trumps-initial-warning-to-south-koreas-lee-turns-into-warm-welcome-after-flattery/aadcdb80-0772-4f85-a31f-d93e1cd2ef3f",
        "title": "President said just the right thing to get on Trump's good side",
        "publish_date": "Tue, 26 Aug 2025 00:53:06 +0000",
        "category": "finance",
        "authors": [
            "Aug"
        ],
        "text": "President Donald Trump took to social media before meeting with South Korean President Lee Jae Myung to threaten not to do business with Seoul because of a “Purge or Revolution” that he claimed was taking place in the country.\n\nBut any prospect of a hostile Oval Office meeting evaporated after Lee heaped praise onto the US president — lauding the decor, beseeching Trump to continue to help with Korean peace efforts and even suggesting a Trump Tower in North Korea.\n\n“We've known each other and gotten along very well,” Trump said, before adding: “It's a great honour to be with you and congratulations on your election. That was a big one, and we're with you 100 per cent.”\n\nThe Oval Office has been decked out with gold decor in Donald Trump's second term. (AP)\n\nThe cordial display showed how world leaders are taking notes from previous meetings between Trump and heads of state, who've largely chosen the route of praise and adulation rather than confrontation as they seek favourable trade terms and continued military aid from Washington.\n\nIt was one of the first big foreign policy tests for Lee, who took over a country in a state of political turmoil since its former leader, Yoon Suk Yeol, was ousted from office after imposing martial law .\n\nLee, elected in June, began by praising one of Trump's pet projects: presidential interior design.\n\n“I heard that you recently redecorated the Oval Office, and I would like to say that it looks very bright and beautiful,” Lee said through an interpreter. “It has the dignity of America, and it symbolises the new future and prosperity of America.”\n\nHe noted that the Dow Jones index has reached record highs (although Lee made sure to add the caveat that “it went down a bit”) and asked Trump, who has been on a mission to receive the Nobel Peace Prize, to reunify the two Koreas and even perhaps see the construction of a Trump Tower in North Korea accompanied by a round of golf.\n\n\n\nLee also agreed with Trump's assertion that North Korean leader Kim Jong Un would not have continued to enhance his nuclear capabilities the last few years had Trump remained in office.\n\nNoting a “renaissance” that is taking place, Lee said, “I believe you are the only leader who has made such accomplishments.”\n\nWhat happened in South Korea\n\nThe tone was a far cry from Trump's confrontational social media post earlier on Monday.\n\nHe later elaborated that he was referring to raids on churches and on a US military base by the new South Korean government, which they “probably shouldn't have done.\"\n\n“I heard bad things,” Trump told reporters in the Oval Office on Monday morning. “I don't know if it's true or not. I'll be finding out.”\n\nTrump did not identify specific raids. But earlier this month, South Korean police raided a church led by a conservative activist pastor who authorities allege is connected to a riot by Yoon’s supporters at a Seoul court in January, after it issued an arrest warrant for him.\n\nA special prosecutor’s team that is investigating corruption allegations against Yoon’s arrested wife, former first lady Kim Keon Hee, also raided the facilities of the Unification Church over allegations that one of its officials gave her luxury goods.\n\nSouth Korean President Lee Jae Myung meets with Donald Trump in the Oval Office. (AP)\n\nMeanwhile, Osan Air Base, which is jointly operated by the United States and South Korea, was also the target of a raid last month by investigators looking into how Yoon’s activation of martial law transpired. South Korean investigators stressed the search was limited to areas controlled by Seoul and did not involve US military operations.\n\nAsked about his assertions by a reporter in front of Lee, Trump declined to confront the South Korean president and instead said the two will discuss it later.\n\n“It didn't sound to me like South Korea,” Trump said.\n\nLee explained that the special prosecutor was tapped by the country's National Assembly to investigate the actions of Yoon, who Lee said staged a “self-coup.”\n\nAt that point, Trump interjected, “Is his name Deranged Jack Smith, by any chance?” He was referring to the special prosecutor who led two criminal cases against Trump before the Republican president was reelected to a second term.\n\nYoon, who was elected to a five-year term in 2022, was considered more ideologically aligned with Trump and had even taken up golfing again after the U.S. president was reelected last November to try to forge a bond with him.\n\nLee led the South Korean parliament's efforts to overturn Yoon's martial law decree while impeaching him. The nation's Constitutional Court formally dismissed Yoon in April.\n\nThe new president\n\nElected in June, Lee was a former child laborer with an arm deformity who rose his way through South Korea’s political ranks to lead the liberal Democratic Party and win the presidency after multiple attempts.\n\nAt a subsequent remarks in Washington on Monday night, Lee suggested that Trump's post had been “threatening” and said it had him worried he might face a “Zelenksyy moment\" — similar to when Ukrainian President Volodymyr Zelenskyy was hounded out of the Oval Office by Trump and Vice President JD Vance following a contentious meeting in February.\n\nBut Lee also said the South Korean-US relationship was strong enough that he was confident Trump wouldn't work to undermine it. Instead, he said the pair had “very good conversations” that went “beyond my expectations\" and took longer than originally scheduled.\n\n“Everybody gave me the advice to have patience,” Lee said of his meeting with Trump.\n\nHe said he also told Trump that South Korea would increase its defence spending, even as it works to ease tensions between his country and North Korea.\n\nSouth Korean troops march during a celebration to mark the 75th anniversary of Armed Forces Day. (AP)\n\n“We will increase our defence budget, which will be used to transform the Korean military into a smart military that will prevail in future,” Lee said.\n\nLee said he and Trump also discussed modernising their countries' trade relations, which follows a July deal that has Seoul investing hundreds of billions of dollars in the U.S. That agreement set tariffs on South Korean goods at 15 per cent after Trump threatened rates as high as 25 per cent.\n\nSeoul has one of the largest trade surpluses among Washington’s NATO and Indo-Pacific allies, and countries where the US holds a trade deficit has drawn particular ire from Trump, who wants to eliminate such trade imbalances.\n\nTrump also said Monday that he’d like to scrap the US lease with South Korea that covers Osan Air Base and instead get ownership of the land.\n\nREAD MORE: Australia Post suspends deliveries to the US after Trump tariffs",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/world/genetically-modified-pig-lung-functions-days-inside-human-body-after-transplant/d0f9ca46-0785-402f-915c-0ea94c53339c",
        "title": "Major pig-to-human organ transplant milestone marks world first",
        "publish_date": "Tue, 26 Aug 2025 00:37:00 +0000",
        "category": "lifestyle",
        "authors": [
            "Aug"
        ],
        "text": "A genetically modified pig lung has functioned in a human recipient for nine days in a major world first.\n\nResearch published in Nature Medicine may﻿ represent the first documented instance of cross-species lung transplants, the authors said.\n\nIn previous, similar studies, organs such as kidneys, livers, and hearts from gene-edited pigs have been feasibly transplanted into humans.\n\nREAD MORE: Dangerous inmate only cell contact for mushroom killer\n\nA lung from a gene-edited pig has been transplanted into a human. (Getty Images/iStockphoto)\n\nHowever, lung transplantation brought new challenges due to the complexity of the organ.\n\n﻿The research team, from China's National Clinical Research Centre for Respiratory Disease, transplanted the left lung of a gene-edited pig into a 39-year-old human recipient.\n\nThe recipient had previously been declared brain dead in four clinical assessments.﻿\n\nREAD MORE: Australia Post suspends deliveries to the US after Trump tariffs\n\nThe pig had undergone gene editing to remove the antigens that could otherwise activate the human immune system and prompt a rejection.\n\nThe study authors found the lung was accepted, and maintained \"viability and functionality\" for nine days.\n\nHowever, the researchers did observe signs of lung damage at 24 hours after the transplant, and signs of antibody-mediated rejection of the organ on day three and day six.\n\nKidnapped woman emerges after 18 years View Gallery\n\nThey terminated the experiment on day nine.\n\n\"The findings represent a first step for pig-to-human lung transplantation,\" the authors said in a release.\n\n\"However, improvements are needed to optimise both the genetic modifications made in the donor pig and the immunosuppressive drugs needed to avoid immune-mediated rejection of the lung and to maintain long-term function.\"",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/apprenticeship-crisis-high-paying-unskilled-jobs-lure-tradies-away/c5596c6b-120e-44df-a210-d6c1f37c5a41",
        "title": "New plan to help stop tradies being lured away from apprenticeships",
        "publish_date": "Mon, 25 Aug 2025 08:56:53 +0000",
        "category": "finance",
        "authors": [
            "Aug"
        ],
        "text": "The federal government hopes a new cash payment program will help apprentices finish their qualifications rather than being lured away by high-paid unskilled jobs.\n\nThe initiative comes after an increase ﻿in young tradies leaving their apprenticeships for higher-paying jobs, crushing efforts to boost the national construction workforce amidst the current skill shortage and housing crisis.\n\n\"We need 40 trades to build a home, and we know every single trade is in shortage,\" Master Builders Australia chief executive Denita Wawn said.\n\nThe initiative comes after an increase ﻿in young tradies leaving their apprenticeships for higher-paying jobs. (9News)\n\nLast year, 24,335 young Australians completed a construction apprenticeship, but, 30,470 withdrew or abandoned their apprenticeship before finishing.\n\nThe government's new program hopes to curb this trend, offering ﻿$10,000 in payments, delivered in $2000 installments on top of wages for apprentices.\n\nAustralia is gripped by a twin crisis: a skills shortage that's making it harder to fix the housing shortage. (AP)\n\nSince July, 1291 construction apprentices have been approved for the program, with carpenters, electricians, and plumbers making up most of the approvals, and Victoria leading the way.\n\n\"These incentives are just part of the ways in which we'll encourage more people to start apprenticeships and be supported to finish them,\" Minister for Skills and Training, Andrew Giles said.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/nab-customers-selfie-to-confirm-identity-banking-app/5d5e9718-089b-41d3-88f0-51fa566ea5aa",
        "title": "One of Australia's biggest banks will soon ask customers for a selfie",
        "publish_date": "Mon, 25 Aug 2025 07:34:36 +0000",
        "category": "finance",
        "authors": [
            "Aug"
        ],
        "text": "Exclusive: O﻿ne of Australia's biggest banks will soon be asking all new customers to take a selfie to confirm their identity.\n\nN﻿ational Australia Bank (NAB) will start using selfies to help combat the spread of identity theft from next month.\n\nThe bank said the new feature will be a breakthrough in the fight against cybercriminals.\n\nNAB will start asking new customers to verify their identity with a selfie. (9News)\n\nNAB said new customers will verify their identity using their biometric data, also known as full facial recognition.\n\nIt's designed to stop stolen licences and passports being used to open dummy bank accounts, which is a fast-moving problem in the world of scams.\n\n\"Over 255,000 Australians a year have their identity stolen or compromised,\" Head of NAB group investigations Chris Sheehan told 9News Finance Editor Chris Kohler.\n\n﻿\"Now that number, I suspect, is on the low side.\n\n\"We're confident we're going to make a real difference.\"﻿\n\nREAD MORE: A warmer and wetter spring in store for much of Australia\n\nThe bank said its their latest move to target scammers who steal identities. (Getty)\n\nIndustry analysts support the move, but say with more data actually comes more exposure.\n\n\"What we need to worry about is where is this information being held,\" technology expert Trevor Long said.\n\n﻿\"This is the last thing we want, our names, our details and photos of ourselves being hacked.\"\n\nNAB said there are no plans to make existing customers verify in this way and that anyone concerned should visit a branch in person to open a new account.\n\nThe move comes as the ACCC reports scam losses are increasing, with $175 million lost in just the first half of this year alone.﻿",
        "source": "9News"
    },
    {
        "url": "https://www.abc.net.au/news/2025-08-26/brownlow-medal-gambling-charges-police/105697888",
        "title": "Four men charged over alleged AFL Brownlow Medal betting scheme",
        "publish_date": "Tue, 26 Aug 2025 01:39:18 +0000",
        "category": "sports",
        "authors": [],
        "text": "Four men have been charged with a range of offences linked to alleged suspicious gambling on the AFL's Brownlow Medal awards in 2021 and 2022.\n\nIt comes as part of a protracted investigation by Victoria Police's Sporting Integrity Intelligence Unit, with the initial arrests of four men occurring in 2022.\n\nIt is not clear whether the four men arrested in 2022 are any of the same men charged this week.\n\nThe 2021 Brownlow Medal was won by Port Adelaide's Ollie Wines, while the 2022 award was won by Carlton's Patrick Cripps.\n\nA 34-year-old Glenroy man, a 32-year-old Doreen man, a 31-year-old Hadfield man and a 35-year-old Reservoir man have been charged over the allegations.\n\nAt the time of the arrests, police alleged a person with knowledge of the voting tally of certain AFL matches distributed the information to a group of people.\n\nIn the case of the Reservoir man, police allege he used corrupt conduct information for betting purposes on 34 occasions and faces 53 separate charges connected to wagering on the 2021 and 2022 Brownlow Medal awards.\n\nThe maximum penalty for the offences is 10 years in jail.\n\nAFL chief executive Andrew Dillon, then-general manager of football operations, said at the time of the 2022 arrests that there was no \"information to suggest that the outcome of the Brownlow Medal was impacted\", as the allegations related to the leaking of results after matches.\n\nThe AFL said in 2022 that there was no evidence the outcome of either the 2021 or 2022 awards were affected by the alleged betting. (AAP: Joe Castro)\n\nThe four men are scheduled to appear at Melbourne Magistrates' Court on September 11.\n\nIn a statement, the AFL acknowledged the charges laid by Victoria Police in connection with the 2021 and 2022 awards.\n\n\"As the matter is before the courts, the AFL is not in a position to provide any further comments,\" an AFL spokesperson said.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-08-26/titans-needs-identity-to-connect-with-gold-coast-fans/105697220",
        "title": "Gold Coast Titans need new 'identity' to win fans, says incoming coach",
        "publish_date": "Tue, 26 Aug 2025 01:08:19 +0000",
        "category": "sports",
        "authors": [],
        "text": "The Gold Coast Titans' incoming head coach says the embattled NRL club needs to build a distinctive identity as it looks to recover from a dismal season.\n\nJosh Hannay will replace Des Hasler next season — a year before Hasler's contract was due to end and three months after Titans' owner Rebecca Frizelle said: \"We want him here until the end of 2026.\"\n\nIt also comes just two years after Justin Holbrook was sacked as head coach.\n\nHannay said he recognised the \"enormous challenge\" in front of him.\n\n\"The best teams in this competition have a clearly identifiable style of play — it's there for everybody to see when they take the field,\" Hannay said.\n\n\" I want to develop an identity for the club that resonates with the people of the Gold Coast and all the fans that support the Titans. \"\n\nHannay has been the Cronulla Sharks' assistant coach, under Craig Fitzgibbon, since 2021.\n\nHe has also worked as assistant to Billy Slater's Queensland Origin side, winning three of the past four titles.\n\nNo 'rose-coloured glasses'\n\nThe Titans sit at the bottom of the NRL ladder, losing their past four games and winning just five this season.\n\nHannay, like his predecessor, will seek to reverse what has been an ongoing struggle for the Titans to perform at finals level.\n\nThey finished 14th in 2024 and in 2023, a long way from 2010's preliminary final.\n\nHannay said he was not coming to the role with \"rose-coloured glasses on\".\n\nTitans coach Des Hasler coached Manly Sea Eagles to their 2013 grand final win. (AAP: Dave Hunt)\n\n\"There's an opportunity there to do something that's just not been achieved before by the club, which is A: go to a grand final and B: win a competition,\" he said.\n\n\" Where the club sits currently, that naturally looks a long way away. \"\n\nHannay said the Titans should look to the Maroons to build a distinctive style of play.\n\n\"[Queensland] have been synonymous for the way they play, the grit they play with — very identifiable traits,\" Hannay said.\n\n\"That's something that started in 1980, and it's still there today.\"\n\nRecruitment decisions\n\nFormer Penrith player Scott Sattler will return to the club as its new director of football — the second time he has held the senior administrative role.\n\n\"We have to put a team together, not only on the field but off the field, that knows what success looks like,\" Sattler said.\n\n\" In rugby league, there's one currency that we talk in and that is winning — a lot of the time, fans won't accept anything less. \"\n\nBut he said some previous recruitment decisions had been \"astute\" while others \"have probably left the club in a hole, especially from a salary-cap point of view\".\n\nThe Titans lost to the Panthers here in round 22, earlier in August. (Getty Images: Chris Hyde)\n\n\"[This] doesn't give you the ability to go to market and negotiate with certain players,\" Sattler said.\n\n\"But also it's about the people that are around the club and whether they've been involved in the modern game.\"\n\nHannay said the Titans had a \"rich nursery\" of young players.\n\n\"There's a lot of untapped talent underneath that no-one's yet seen.\"\n\nHannay will begin his three-year contract with the Titans after he ends the 2025 season with the Sharks.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-08-26/outback-grazier-completes-32km-us-ocean-swim-catalina-channel/105694010",
        "title": "Grazier who trained in town pool completes third huge open water swim",
        "publish_date": "Tue, 26 Aug 2025 01:02:52 +0000",
        "category": "sports",
        "authors": [],
        "text": "A Los Angeles beach is about as big a change in scenery from far west New South Wales as you can get.\n\nIt was here on the Southern Californian coastline that outback grazier Brendan Cullen completed his latest sporting feat — swimming the 32.3-kilometre Catalina Channel from Santa Cantaline Island to the US mainland.\n\n\"It was bloody good to get it done,\" Mr Cullen said.\n\nThe majority of the more than 13-hour swim was completed in the dark to avoid the channel's blustery afternoon winds, in conditions the 52-year-old described as \"magnificent\", with little wind and water temperatures of around 22 degrees Celsius.\n\n\"One of the things that I'll never forget was the bioluminescence in the water, \" he told ABC Broken Hill.\n\nA victorious Brendan Cullen celebrates from the beach in LA. (Supplied: Brendan Cullen)\n\n\"Every time your hand hit the water, it would just flash like a rainbow. It was unbelievable.\n\n\"And every now and again you could see the bottom of the ocean just flicker, and it was like the stars underneath.\"\n\nBecoming a Triple Crown threat\n\nIn the lead-up to the swim, Mr Cullen, who runs Kars Station, more than 1,000 kilometres west of Sydney, had been training at Menindee Lakes and Broken Hill pool.\n\nAlthough noticeably devoid of waves, both were sufficient for preparing Mr Cullen for swimming the English Channel twice before taking on the Catalina Channel, in his bid to conquer the Triple Crown of Open Water Swimming.\n\nThe grazier first completed the 33-kilometre English Channel solo in 2022, before taking it on again a year later as part of a relay.\n\nBrendan Cullen (right) and a friend wade out of the Menindee Lake's Lake Speculation after a chilly early-morning swim. (ABC Broken Hill: Bill Ormonde)\n\nAlthough the US and English channels were of a similar length, Mr Cullen said his English Channel swims were far more challenging than the Catalina Channel due to the water temperature, with the UK swim taking him four hours longer.\n\nEven at night, the US waters were significantly warmer than the freezing stretch of water between England and France.\n\nMentor and mate's 'sacrifice'\n\nMr Cullen had entered the water at Santa Cantaline Island with his friend, coach and mentor Mike Gregory, but his tandem partner made the selfless decision to opt out of the swim when it became obvious the more experienced swimmer was outpacing the grazier.\n\n\"He was getting in front of me and then dropping behind me and he was cooling down, and he wasn't quite sure whether he was going to be able to maintain that,\" Mr Cullen said.\n\n\"So, he opted to get out and basically sacrificed his swim for mine.\n\n\"Which is a hell of a thing to do.\"\n\nLeft to swim solo, Mr Cullen was supported by his wife, Jacinta, and two daughters, Emma and Charli, who accompanied him in a boat.\n\nBrendan Cullen with Mike Gregory (left), his wife Jacinta and daughters Emma and Charli. (Supplied: Brendan Cullen)\n\nMr Gregory joined Mr Cullen's family in the boat to cheer him on.\n\nPushing through discomfort and fatigue as the swim went on, Mr Cullen was jubilant when he made it to shore in LA.\n\n\"My shoulders took a bit of a belting,\" he said.\n\n\" Probably the last three hours my shoulder packed it in, so I had to change up my swimming stroke. \"\n\nBut he was determined not to quit, and recalled thinking: \"There's no way in hell I'm getting out.\"\n\nNot just about swimming\n\nMr Cullen has been a champion for mental health awareness — he has battled his own illness in the past and is an advocate across western NSW.\n\nSo the grazier thought it would be good to raise awareness and money for not-for-profit Find Ya Feet, which runs workshops in schools and sporting clubs about vulnerability.\n\n\"School's a tough place to be, especially if you don't want to be there … and [so I] figured it would be an awesome thing to do to raise a few bucks,\" Mr Cullen said.\n\nFind Ya Feet's founder and chief executive, Tom Herschell, said it was Mr Cullen who first reached out because he wanted to help.\n\n\"Anyone who swims out in the Menindee Lakes in the middle of winter when it's as cold as a mother-in-law's kiss has got plenty of front, which I bloody love,\" Mr Herschell said.\n\n\"[He's] just a beautiful man with a beautiful heart and has a vision, and he's a doer.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-08-26/musk-xai-sues-chatgpt-and-apple-over-competition-threat/105697582",
        "title": "Musk's AI startup xAI sues Apple and ChatGPT maker",
        "publish_date": "Tue, 26 Aug 2025 00:56:56 +0000",
        "category": "finance",
        "authors": [],
        "text": "Billionaire Elon Musk's artificial intelligence startup xAI has sued Apple and ChatGPT maker OpenAI, accusing them of illegally conspiring to thwart competition for artificial intelligence.\n\nApple and OpenAI have \"locked up markets to maintain their monopolies and prevent innovators like X and xAI from competing,\" the lawsuit filed in a US federal court on Monday, local time, said.\n\nApple has partnered with OpenAI to integrate ChatGPT into its operating system for iPhones, iPads, and Macs.\n\n\"If not for its exclusive deal with OpenAI, Apple would have no reason to refrain from more prominently featuring the X app and the Grok app in its App Store,\" the lawsuit said.\n\nIn the lawsuit, xAI says it is seeking billions of dollars in alleged damages.\n\nGoogle to target Aussie kids under 13 with its AI chatbot Gemini Photo shows Gemini AI logo is seen on a phone, held over a laptop Google will launch its Gemini AI chatbot for Australian children under 13 within months, the ABC can reveal.\n\n\"This latest filing is consistent with Mr. Musk's ongoing pattern of harassment,\" an OpenAI spokesperson said in a statement.\n\nApple did not immediately respond to a request for comment.\n\nLater on Monday, Mr Musk posted on his social media platform, X, echoing the allegations in the lawsuit: \"A million reviews with 4.9 average for @Grok and still Apple refuses to mention Grok on any lists.\"\n\nMr Musk had threatened to sue the California-based Apple earlier this month, writing on X that Apple's behaviour \"makes it impossible for any AI company besides OpenAI to reach #1 in the App Store\".\n\nOpenAI's ChatGPT became the fastest-growing consumer application. (Reuters: SOPA Images/SI/Rafael Henrique)\n\nOpenAI's ChatGPT became the fastest-growing consumer application in history in the months following its launch in late 2022.\n\nMr Musk's xAI acquired X in March for $US33 billion ($51 billion) to enhance its chatbot training capabilities.\n\nMr Musk has also integrated the Grok chatbot into vehicles made by his electric automobile company, Tesla.\n\nxAI was launched less than two years ago and competes with Microsoft-backed OpenAI as well as with Chinese startup DeepSeek.\n\nAntitrust legal experts who are not involved in the lawsuit have said Apple's dominant position in the smartphone market could bolster xAI's claims that the company is illegally tying its iPhone sales with OpenAI's ChatGPT.\n\nOn its first birthday, here's what ChatGPT has taught us about artificial intelligence Photo shows A yellow robot sits at a table in front of a birthday cake with a cluster of lit candles in the middle Love it or hate it, OpenAI's ChatGPT has been around for a year and artificial intelligence is becoming more integrated into everyday life.\n\nBut they said Apple could counter that its partnership with OpenAI was a business decision in a competitive environment, and that it had no obligation to help its rivals gain market share.\n\nMore broadly, the lawsuit could give courts in the United States their first opportunity to assess whether there is a defined market for AI and what it encompasses, a threshold issue in antitrust litigation.\n\n\"It's a canary in the coal mine in terms of how courts will treat AI, and treat antitrust and AI,\" said Christine Bartholomew, a professor at the University at Buffalo School of Law.\n\nMr Musk is separately suing OpenAI and its CEO, Sam Altman, in federal court in California to stop its conversion from a nonprofit to a for-profit business. Mr Musk co-founded OpenAI with Mr Altman in 2015 as a nonprofit.\n\nApple's App Store practices have been the focus of multiple lawsuits.\n\nIn one ongoing case by Fortnite video game maker Epic Games, a judge ordered Apple to allow greater competition for app payment options.\n\nReuters",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-08-26/prostate-cancer-daughters-plea-for-men-to-get-a-check/105681024",
        "title": "Daughter's plea after young, fit dad loses prostate cancer battle",
        "publish_date": "Tue, 26 Aug 2025 00:13:23 +0000",
        "category": "lifestyle",
        "authors": [],
        "text": "Steven Jones was a fit and healthy 52-year-old when he was given an unexpected cancer diagnosis.\n\nThe footy-mad, car-loving Melbourne father of four was diagnosed with aggressive stage-four prostate cancer after a routine check-up with his doctor.\n\n\"It was really hard. Your dad is the strongest person in your life and they're always the one helping you and the one that you turn to,\" daughter Madeline Jones said.\n\n\"Then suddenly that flips and you're looking after them and you're caring for them.\"\n\nMadeline Jones was by her dad's side through the highs and lows of his six-year ordeal. (Supplied: Madeline Jones)\n\nDuring his final months, Ms Jones moved from her home in Emerald in central Queensland to care for her dad with her three older brothers in Victoria.\n\nThe cancer eventually spread to his bones and then brain and Mr Jones's battle against the dreaded disease ended in July, surrounded by his family.\n\nHe was 58.\n\nSteven Jones loved the Sydney Swans AFL club and motorsport Formula 1. (Supplied: Madeline Jones)\n\nMs Jones said the six-year ordeal was an emotionally distressing time for her family.\n\nShe now wants to challenge the myth that prostate cancer is an \"old man's disease\" and highlight its growing national impact as Australia's most commonly diagnosed cancer for males.\n\n\"Dad was only in his 50s, he wasn't an elderly man,\" she said.\n\n\"It was heartbreaking but he was surrounded by love and care until the end.\"\n\nThe Jones family (from left): Anthony, Madeline, Steven, Andrew and Matthew. (Supplied: Madeline Jones)\n\nFamily's journey\n\nMore than 26,000 Australian men are diagnosed with prostate cancer each year and nearly 4,000 will die from the disease.\n\nOne in five men are likely to be diagnosed in their lifetime while those with a family history have a higher chance of developing prostate cancer.\n\nMr Jones had no family history.\n\nFrom the moment a friend urged Mr Jones to get a PSA (Prostate-Specific Antigen) test, to his final days in palliative care, Ms Jones said his humour and kindness never left him.\n\nA PSA test is a blood test used primarily to screen for prostate cancer.\n\nMadeline Jones says prostate cancer is not an old person's disease after her dad's diagnosis at 52. (Supplied: Madeline Jones)\n\n\"The hardest part was watching what he had to go through and the changes in his body throughout the different treatments,\" she said.\n\n\"He didn't recognise himself anymore and I guess he just wanted life to go back to normal, so it was quite tough.\"\n\nRaising awareness and hope\n\nSeptember is Prostate Cancer Awareness Month, a timely reminder to have important conversations about men's health.\n\nMs Jones said she was determined to raise awareness in honour of her dad to prevent other families from facing the heartbreak they had endured.\n\n\"I really didn't know anything about prostate cancer before Dad got diagnosed so I was learning about it as he was,\" she said.\n\n\"Your partners, dads, uncles, any men in your life, encourage them to get tested.\"\n\nAccording to Prostate Cancer Foundation of Australia (PCFA), regional men in Australia have a 24 per cent higher risk of death compared to their urban counterparts due to geographic location and lack of access to health care.\n\nAnne Savage says men with a family history have a higher chance of developing prostate cancer. (Supplied: Prostate Cancer Foundation of Australia)\n\nPCFA chief executive Anne Savage said the impacts of the cost of living were also preventing check-ups.\n\n\"In a recent survey on men's health in Australia, a very high number of respondents had opted out of essential health care because they were worried about the cost implications,\" Ms Savage said.\n\n\" We need to make sure that that health care is affordable for all Australians and accessible particularly for men who live in regional areas. \"\n\nMs Savage said there were new draft guidelines in Australia for the early detection of prostate cancer.\n\n\"One of the really important changes that we are promoting right now is for interested men to get a baseline PSA test at the age of 40,\" she said.\n\n\"That helps us to monitor their PSA over the life course and to take action as quickly as we can if the PSA becomes elevated.\"\n\nMadeline Jones is raising awareness during the Prostate Cancer Foundation of Australia's Long Run in September. (Supplied: Madeline Jones)\n\nSince her dad's diagnosis, Ms Jones has raised nearly $100,000 for the PCFA's Long Run campaign held in September.\n\nThere will be extra meaning when she laces up her running shoes this year, with the 33-year-old aiming to raise another $52,000, to reflect her dad's age when he was diagnosed.\n\n\"My mission is to make sure other people and other families don't have to go through what my dad went through, what my brothers went through and the rest of my family have gone through,\" Ms Jones said.\n\n\"Dad's gone and he's not here but I still feel his presence and I know that he'll be watching me and proud of me.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-08-26/jade-benham-nationals-mp-vanialla-slice-tattoo-politician/105692992",
        "title": "Nationals MP takes vanilla slice support to new level with tattoo",
        "publish_date": "Mon, 25 Aug 2025 23:37:19 +0000",
        "category": "finance",
        "authors": [],
        "text": "A Victorian politician has had the image of a vanilla slice permanently tattooed onto her hip.\n\nNationals Member for Mildura Jade Benham vowed to get the tattoo during a vanilla slice eating contest in Merbein, in Victoria's north-west.\n\nShe quipped that maybe she should get a tattoo as penance after failing to come first, and within the next few hours, she did just that.\n\n\"I immediately thought that I need to have some sort of a filter between my brain and my mouth at times, and that was one of those times,\" Ms Benham said.\n\n\"It was great, I don't regret it at all.\"\n\nIt is not the National Party politician's first tattoo, as she has several of her children's drawings inked on her.\n\nThis is, however, her first sweet treat tattoo, and she was very deliberate about its placement.\n\n\"On my hip, because vanilla slice — a moment on the lips, a lifetime on the hips,\" Ms Benham said.\n\nShe said the act had perhaps shocked some of her colleagues within the Victorian National Party, who were \"far too sophisticated\" to do such a thing themselves.\n\nThe vanilla slice tattoo on the left hip of Jade Benham. (Supplied: Jade Benham)\n\nWalsh a clean-skin\n\nPeter Walsh, representing the neighbouring electorate of Murray Plains, said he had never considered getting a tattoo in support of a local business or event during his political career.\n\n\"I'm not a tattoo person, so good luck to Jade on doing what she's doing to promote things, which she has done in the past,\" Mr Walsh said.\n\n\"I haven't got a tattoo and I'm not the muscly young person you need to be to have a tattoo.\n\n\"It's never been a consideration in my whole life.\"\n\nOther Nationals politicians, including Member for Lowan Emma Kealy, Victorian Nationals leader Danny O'Brien and Federal Member for Mallee Anne Webster were asked if they would ever consider getting a tattoo, what it would be, and where they would get it.\n\nNone responded to the questions.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/health/2025-08-26/dietary-guidelines-environmental-health-nutrition-balanced-diet/105670278",
        "title": "New dietary guidelines are expected in 2026. Here's what they might contain",
        "publish_date": "Mon, 25 Aug 2025 23:00:00 +0000",
        "category": "lifestyle",
        "authors": [],
        "text": "For many Australians, our first contact with official dietary guidelines was the food pyramid, which had fruit, veggies, and carbs as its base, and fats and sugar at the very top.\n\nOver the decades, the various blocks that made up the food pyramid shifted slightly. It recently got a makeover and is now the \"healthy eating plate\".\n\nLoading...\n\nBut the plate is based on guidelines published back in 2013, which are due for an update. They're currently under revision to take into account the latest nutrition research, and are expected to be published next year.\n\nWhile we don't know what the new guidelines will say, we can look overseas to see what the latest dietary guidelines of other countries include.\n\nAnd one issue pops up time and again: the health of the environment.\n\nSustainability in newer dietary guidelines\n\nOver the past five years or so, new dietary recommendations from elsewhere around the world haven't just addressed human health — they've incorporated the health of the planet too.\n\nProduction of certain food groups, such as red meat, have a relatively higher environmental impact — on carbon emissions, land use and biodiversity loss — than others.\n\nIn 2019, a group of researchers, called the EAT-Lancet Commission, published the planetary health diet. It's designed to be adapted for different countries and cultures, and is a \"plant-forward\" diet, where most foods are whole grains, fruit, vegetables, nuts and legumes.\n\nHow to get the fibre you need Photo shows Smiling girl with glasses eating apple and looking at laptop. People share a lot of their lives on social media. This can even include digestion details, with content about \"staying regular\", bloating and fibre far from off-limits.\n\nWhile red meat is not off the table, the planetary health diet suggests people eat no more than 98 grams of red meat each week.\n\n\"That's about a third of what the current Australian Guide to Healthy Eating recommends,\" Jessica Danaher, a RMIT University dietitian and nutrition scientist, says.\n\nThe Danish dietary guidelines, published in 2020, also emphasise climate-friendly, plant-rich eating. They suggest people eat less meat, and choose fish and legumes instead.\n\nOther sets of dietary guidelines also explicitly incorporate environmental sustainability, but not all. Norway's guidelines, while being similar to the Danish guidelines, don't mention the environment at all (but do suggest people \"eat with pleasure and make time to sit down and eat\").\n\nSo will we see a focus on planetary health in the next iteration of the Australian Dietary Guidelines?\n\nDr Danaher suspects so: \"[We may be] shifting towards looking at health from a more holistic perspective as opposed to just looking at the clinical perspective or nutritional adequacy.\"\n\nWhat are the current Australian dietary guidelines?\n\nYou may be wondering what our current recommendations even are.\n\nThey include recommendations about breastfeeding and food safety, but mostly focus on people eating a variety of nutritious foods.\n\nThe visual representation of our guidelines is called the Australian guide to healthy eating plate, and it's divvied up into five food groups.\n\nThe five food groups include vegetables, fruit, grain, protein and dairy. (Getty Images: fcafotodigital)\n\nWhat is a 'serve'? Vegetables: half a cup cooked green or orange vegetables, 1 cup raw salad vegetables, or 1 medium tomato\n\nFruit: 1 medium apple, two small plums, or 1 cup canned fruit (no added sugar)\n\nGrain (cereal) food: 1 slice of bread, half a cup cooked rice, pasta or noodles, or quarter of a cup muesli\n\nProtein: 65 grams cooked lean red meat, 2 large eggs, or 1 cup cooked or canned legumes\n\nDairy: 1 cup fresh milk or calcium-enriched plant-based milk, 2 slices of cheese, or three quarters of a cup yoghurt\n\nRecommended daily minimum serves of these five food groups vary with age and sex Source: Eat For Health\n\nIt comprises around a third of grain-based foods, a third veggies and legumes, and the rest split roughly between fruit, lean protein, and dairy and dairy-alternatives.\n\n\"Discretionary foods\" such as chips, chocolate, cream and soft drinks are recommended to be eaten \"sometimes and in small amounts\".\n\nDespite being portrayed as a single meal, the healthy eating plate is not designed to show you what you should be eating every meal, Dr Danaher says.\n\n\" It's not so much about ticking that off every single day, but more of what it looks like, say, over the space of a few days or a week. \"\n\nFor instance, the guidelines recommend no more than two serves of \"discretionary foods\" every day.\n\n\"One quarter of a pie at the footy is a serve of discretionary foods, so my whole pie is doubling the daily recommendations,\" Dr Danaher says.\n\n\"But I'm not going to eat half my pie and chuck it in the bin and go, 'Oh, I've met my pie limit for today'.\n\n\"I'll have that whole pie, but I'm not eating a pie every single day.\"\n\nHow many people meet the current Australian dietary guidelines?\n\nThe fruit and vegetable sections recommend people aged nine years or older eat two serves of fruit and at least five serves of vegetables every day.\n\nAccording to the Australian Bureau of Statistics, only 4.2 per cent of Australian adults met the recommended targets for both fruit and vegetables in 2022.\n\nThat may seem incredibly low, but the Australian dietary guidelines are just that — guidelines, Dr Danaher says.\n\nAussie to eat more junk by 2030, study finds Photo shows A close of a woman's mouth as she eats a donut with pink frosting, sprinkles and a rainbow-coloured lolly on it. The CSIRO says the average Australian's diet is likely to get worse within five years, hurting our health and the taxpayers' purse. So what is standing in the way of better eating?\n\n\"It's called the Australian guide to healthy eating, not the Australian rule book to healthy eating.\n\n\"It's to give us a sense of proportion, variety and moderation for a nutritional balanced approach … it gives us something to aim towards.\n\n\"Realistically, with real-world, everyday eating, people have things like travel and social events, appetite, your time, what you're able to eat between work commitments, cost, availability and even stress playing a big role.\"\n\nFor more on dietary guidelines, check out the full episode of Lab Notes.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-08-26/madison-keys-out-in-us-open-first-round-petra-kvitova-farewell/105697226",
        "title": "Aus Open champion 'paralysed' by nerves in loss, as veterans bid teary farewell",
        "publish_date": "Mon, 25 Aug 2025 22:30:02 +0000",
        "category": "sports",
        "authors": [],
        "text": "Australian Open champion and hometown hope Madison Keys has let a big lead slip to go down in the first round of the the US Open, losing 6-7(10/12), 7-6 (7/3), 7-5 to unheralded Mexican Renata Zarazúa.\n\nKeys could tell she was not hitting the ball well or feeling very much at all like the confident player who claimed her first grand slam title at the Australian Open in January.\n\nAfter 89 unforced errors, including 14 double faults, the sixth-seeded Keys was gone from Flushing Meadows to her 82nd-ranked opponent, despite having led by a set and 3-0.\n\n\"For the first time in a while … my nerves really got the better of me, and it kind of became a little bit paralysing,\" said Keys, the runner-up in New York to good friend Sloane Stephens in 2017 and a semifinalist in 2018 and 2023.\n\nVictorious Kasatkina hopes only way is up after hectic year Photo shows Daria Kasatkina hits a forehand at the US Open. Daria Kasatkina eases into the second round of the US Open in straight sets, as she hopes to end a busy year on a high.\n\n\"I felt like I was just slow. I wasn't seeing things the way that I wanted to, which I feel like resulted in a lot of bad decisions and lazy footwork.\n\n\"For whatever reason, today I just couldn't separate myself from … feeling like winning matters just way too much.\"\n\nShe made so many mistakes off the spin-laden shots coming her way that Zarazúa needed to produce just eight winners to earn the biggest victory of her career.\n\nDespite playing in the cavernous Arthur Ashe Stadium for the first time, having only had a chance to hit there once a couple of days prior, and boasting a 0-6 record against opponents ranked in the top 10, Zarazúa was unwavering.\n\n\"I'm a little bit small in height, so coming in here, it was like, 'Oh my God, this is huge,'\" Zarazúa said about the largest stadium in tennis, which holds nearly 24,000 spectators.\n\nWhen the match ended with Keys missing a forehand after 3 hours and 10 minutes, Zarazúa smiled as widely as possible, held her racquet atop her head, then placed a hand over her face.\n\nShe is the only Mexican left in the singles draw after Ignacio Buse was beaten by Ben Shelton in straight sets to kick off day one.\n\n\"Coming into the match I was almost crying because I was really nervous but I think the crowd made it so chill for me,\" Zarazúa said.\n\n\"I could hear some Mexican [fans] cheering, so that was very nice.\"\n\nThe emotions were also flowing elsewhere on day two, as two-time Wimbledon winner Petra Kvitova and 2022 US Open semifinalist Caroline Garcia bid farewell with opening-round losses.\n\nPetra Kvitova returned to tennis after a terrifying home invasion in 2017. (Getty Images: Al Bello)\n\nKvitova, whose reached the quarterfinals in New York in 2015 and 2017, went down to France's Diane Parry 6-1, 6-0 in just 52 minutes, tearfully embracing coach and husband Jiří Vaněk before waving goodbye to Flushing Meadows.\n\nStream now on ABC iview Photo shows 5 women looking concerned in front of a beach with Family Next Door and iview logo. The enigmatic Isabelle arrives in the quiet seaside cul-de-sac of Pleasant Court — and suspicions quickly rise. Stream all episodes now on ABC iview.\n\nKvitova won Wimbledon in 2011 and 2014 and reached number two in the world, and she came back to the sport after being injured by a knife-wielding home invader in 2016.\n\nAfter surgery to repair lacerations to her left hand, which she played with, she reached the Australian Open final in 2019 and a semifinal at the French Open in 2020.\n\nThe 35-year-old won 31 singles titles in her career, including 12 after the attack.\n\nFrenchwoman Garcia was also overcome by emotion after her 6-4, 4-6, 6-3 loss to Russian Kamilla Rakhimova, but said she had no regrets about her decision.\n\n\"It means a lot, all the support. It's very special,\" the 31-year-old told the American crowd.\n\n\"Tennis brought me so much, some great emotions, some tough ones and it shaped me to who the person I am today.\n\n\"I grew a lot, especially in the last [few] years. I'm very at peace with my decision to say goodbye to tennis.\"\n\nThe ABC of SPORT Sports content to make you think... or allow you not to. A newsletter delivered each Saturday.\n\nAP/ABC",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-08-26/government-documents-say-murujuga-pilbara-rock-art-at-risk/105693432",
        "title": "Environment department warned of rock art 'desecration'",
        "publish_date": "Mon, 25 Aug 2025 21:59:41 +0000",
        "category": "finance",
        "authors": [],
        "text": "The federal environment minister was urged by his own department to intervene to protect areas of ancient rock art deemed at risk of \"desecration\" by industrial emissions, Federal Court documents have revealed.\n\nThe draft departmental advice was in response to an application lodged by Murujuga traditional custodian Raelene Cooper in 2022 under the Aboriginal and Torres Straight Islander Heritage Protection (ATSIHP) Act.\n\nIt centred on fears that industrial projects on the Burrup Peninsula were accelerating the degradation of ancient Indigenous rock art in the Murujuga Cultural Landscape in Western Australia's Pilbara.\n\nThe area was granted world heritage listing by UNESCO in July.\n\nAfter more than three years without a response, Ms Cooper brought the matter to the Federal Court, which on Monday found the minister's department had taken an \"unreasonable\" length of time to respond.\n\nMurujuga's listing includes requirements for monitoring of the impact industry has on the petroglyphs. (ABC News: Chris Lewis)\n\nWatt's office draft recommends approval\n\nThe draft advice, tendered as an affidavit to the Federal Court and later released to the ABC, stated the minister could be \"satisfied that the specified area is a significant Aboriginal area\" for the purposes of section 10 of the ATSIHP Act, and that the area was \"under threat of injury and desecration\".\n\nMurujuga is home to more than one million petroglyphs. (ABC News: Chris Lewis)\n\nSection 10 allows the minister to make a declaration to preserve significant cultural heritage areas and halt works that could cause \"injury or desecration\".\n\nAlthough the affidavit recommended the declaration, it was only for part of the area.\n\n\"The reporter concluded that the information provided supports a finding that part of the specified area is under threat of injury or desecration and recommends that you make a declaration over part of the specified area,\" the affidavit stated.\n\nThe draft advice is not binding, and it is up to the minister whether or not to accept it.\n\nIn a statement, spokesperson from Murray Watt's office said it was not a final decision but a \"consultation step\".\n\n\"A draft decision doesn't stop current industry from operating and it doesn't mean future industry will be banned,\" the statement said.\n\n\"We are asking all interested parties to participate in the consultation process in order to achieve the best outcome, to protect the important cultural heritage and jobs of this region.\"\n\nThree-year delay 'unreasonable'\n\nAfter reserving a decision last week, Justice Angus Stewart delivered his judgement on Monday, finding the delay in resolving the matter \"unreasonable\".\n\nMurujuga's cultural landscape was added to UNESCO's World Heritage List in July. (ABC News: Chris Lewis)\n\n\"The delay in this case is unreasonable in the legal sense and it has not been adequately explained,\" he said.\n\nBut he stopped short of forcing the ministerial response Ms Cooper's lawyers had been seeking.\n\n\"It is likely there will be a decision very shortly, probably within the next few weeks,\" Justice Stewart said.\n\n\"For that reason, I accept there is little utility in making an order for the minister to make a declaration by that date.\"\n\nRaelene Cooper fears that the outcome of her section 10 application will come too late. (ABC Pilbara: Kelsey Reid)\n\nSpeaking after the judgement, Ms Cooper said she was delighted with the ruling but feared it had come too late.\n\nShe said the construction of fertiliser company Perdaman's urea plant in the years since launching the section 10 had damaged significant sacred sites.\n\n\"There were three particular rock engravings … they now sit under this Perdaman site,\" she said.\n\n\"[Murujuga] is an environmental disaster now, there's been so much destruction at this sacred and universal site.\"\n\nA government spokesperson said Mr Watt is committed to making a decision \"as promptly as possible without compromising the objects of the ATSIHP Act\".",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-08-26/asx-markets-business-live-news-august-26/105696438",
        "title": "Live: Stocks slip as Coles reveals falling profit",
        "publish_date": "Mon, 25 Aug 2025 21:51:00 +0000",
        "category": "finance",
        "authors": [
            "Stephanie Chalmers",
            "Business Correspondent David Taylor",
            "David Taylor",
            "Nassim Khadem",
            "Emily Stewart"
        ],
        "text": "Corporate watchdog ASIC is suing Equity Trustees Superannuation — which have $88 billion in funds under management and about 800,000 members — for its alleged role in the loss of $160 million of retirement savings in collapsed investment scheme Shield Master Fund.\n\nShield, a property-focused retail fund, collapsed last year leaving 5800 investors at risk of losing about $500 million in retirement savings.\n\nASIC has commenced civil Federal Court proceedings alleging Equity Trustees, a subsidiary of EQT Holdings Limited, a company listed on the Australian Stock Exchange.\n\nASIC alleges Equity Trustees failed \"to exercise the same degree of care, skill and diligence as a prudent superannuation trustee would, to act in the best financial interests of its members (and) to do all things necessary to ensure the financial services covered by its Australian financial services licence were provided efficiently, honestly and fairly\".\n\nEquity Trustees oversaw the investment of around $160 million of retirement savings into Shield over 2023 and 2024.\n\nASIC Deputy Chair Sarah Court said ASIC was taking action against Equity Trustees as part of its ongoing work to protect members' superannuation savings.\n\n\"Instead of acting as an effective gatekeeper for its members' retirement savings, ASIC alleges Equity Trustees allowed thousands of members invest to in Shield which had no track record,\" she said.\n\n\"Those members ultimately saw their super balances eroded.\"\n\nASIC is seeking declarations and civil penalties from the Court.\n\nASIC is also still investigating Keystone Asset Management, which is the the responsible entity for Shield, and that went into liquidation.\n\nASIC also has on ongoing investigation into Equity Trustees in relation to the onboarding and ongoing monitoring of the First Guardian Master Fund, which has impacted thousands of more investors and left their retirement savings at risk.\n\nFor more on the collapse of the Shield and First Guardian funds, listen to this podcast:",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-08-26/daria-kasatkina-victorious-walton-hon-gets-maiden-us-open-win/105697102",
        "title": "Kasatkina coasts as Aussies get maiden US Open wins",
        "publish_date": "Mon, 25 Aug 2025 21:31:43 +0000",
        "category": "sports",
        "authors": [],
        "text": "Daria Kasatkina has led the Australian charge through the first round of the US Open on day two, eager to end a year of upheaval on a high note.\n\nThe Russian-born world number 18 took down Romanian Elena-Gabriela Ruse 7-5, 6-1 in an hour and 18 minutes to advance to the second round in New York.\n\nKasatkina dropped her first two service games against her 68th-ranked opponent and was broken once more in the first set before finding her groove and closing it out.\n\nAustralian fan booted out of US Open match Photo shows Umpire James Keothavong speaks to an Australian fan in the stands at the US Open. A fan is sent out of Australian Jordan Thompson's first-round victory at the US Open, much to the delight of other members of the crowd.\n\nThe second frame was more of a procession, jumping out to a 3-0 lead and jogging through the finish line after winning her second match point.\n\n\"I'm so happy because the first match of a slam is always a tough challenge,\" she said.\n\nIt has been an eventful year for Kasatkina.\n\nIn March she changed allegiances from Russia, where the \"international LGBT movement\" was ruled an \"extremist organisation\", to Australia, where she got engaged to partner Natalia Zabiiako in June.\n\nLoading Instagram content\n\nKasatkina cut a relieved figure on court after her win, replying \"Oi, Oi, Oi\" to Australian fans' \"Aussie, Aussie, Aussie\" call, saying she was still trying figure out how to juggle everything going on while staying focused on the court.\n\n\"I have to be honest, I could do better,\" she said.\n\n\"We're tennis players but we also have stuff going on outside the tennis court. There's always something going on in your life.\n\nUS Open villain rages at umpire in first-round defeat Photo shows Daniil Medvedev breaks his racquet after losing A chorus of boos and jeers has rained down on the men's 13th seed, Daniil Medvedev, at the US Open after his opponent was granted a first serve on match point.\n\n\"Most of the time if you bring it on court then you have to fight those things in your head. I've had a lot of changes in the past year, which was not easy to manage.\n\n\"I hope it's going to be a bit calmer. Now I'm quite settled and really happy about it, all my focus will go on the work and the important things.\n\n\"Sometimes there are moments when you think you are on the bottom, but the way from the bottom is only up, so this is what I'm really looking forward to.\"\n\nKasatkina next faces Russian Kamilla Rakhimova, who ended the career of France's Caroline Garcia with a first-round win, in her seventh trip to the second round at Flushing Meadows, while a couple of her new compatriots made it for the first time.\n\nAdam Walton shocked 22nd-seeded Frenchman Ugo Humbert. (Getty Images: Al Bello)\n\nAdam Walton scored an upset 6-4, 7-6(7/4), 5-7, 6-1 win over 22nd seed Ugo Humbert for his maiden victory in the main draw in New York.\n\nThe 85th-ranked Walton next faces Hong Kong's Coleman Wong as he tries to make it into the third round of a slam for the first time.\n\nQualifier Priscilla Hon also broke her US Open duck as she took down France's Leolia Jeanjean 6-3, 7-5 in 93 minutes, for her first win at a grand slam since the 2020 Australian Open.\n\nPriscilla Hon had not won a match in the main draw of a slam since 2020. (Getty Images: Maddie Meyer)\n\nThe match was a tense affair, especially in the second set, when Hon fought off a set point at 4-5 on her own serve before rattling off three straight games to serve it out at her earliest convenience.\n\nThere was no such luck for Aleksandar Vukic, who was also shooting for his first win at Flushing Meadows.\n\nHe spent almost four hours on Court 11 against American Jenson Brooksby, who eventually came out on top 6-3, 6-7(4/7), 6-4, 3-6, 6-4.\n\nFellow Australian James Duckworth was also up against a local hope, with Tristan Boyer winning 6-3, 7-5, 6-4 in just over two hours, while Talia Gibson's US Open debut ended in straight sets, 6-, 6-2 against 28th seed Magdalena Frech.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-08-26/federal-politics-live-aug-26-prime-minister-albanese-penny-wong/105695890",
        "title": "Live: PM, Wong expected to make significant foreign affairs announcement",
        "publish_date": "Mon, 25 Aug 2025 21:26:33 +0000",
        "category": "finance",
        "authors": [
            "Joshua Boscaini",
            "Patricia Karvelas",
            "Evelyn Manfield",
            "Courtney Gould",
            "Stephen Dziedzic",
            "Emilia Terzon"
        ],
        "text": "Do you have a question for the PM? Make sure you send them through to us!\n\nAnthony Albanese will be joining us for an interview at 5:15pm (AEST) today for an interview to answer your questions.\n\nWe want to see your questions, so send them through via the comments section above.\n\nPassionate about the NDIS? Foreign affairs? Energy policy? Either way, let us know!\n\nCatch the interview here, on Instagram, TikTok or later on the ABC News Channel, radio and online.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-08-26/australia-post-commercial-shipping-suspension-us-tariffs/105696336",
        "title": "Australia Post halts most parcel postage to US immediately",
        "publish_date": "Mon, 25 Aug 2025 21:22:16 +0000",
        "category": "finance",
        "authors": [],
        "text": "Australia Post has immediately suspended most postage to the United States, with only the delivery of letters, documents and gifts worth less than $150 continuing.\n\nThe postal service has taken the extraordinary step to halt many forms of postage to the US, as a Trump administration tariff on low-value parcels is due to come into effect within days.\n\nAustralian businesses selling to American customers will be blocked from shipping to the US via Australia Post from today.\n\nThe government-owned postal service joins other global carriers in taking this step, ahead of new levies beginning on Friday, August 29.\n\nIt will continue shipping letters and documents to the US, along with packages that are declared as gifts and are worth less than $US100 ($153).\n\n\"We are disappointed we have had to take this action,\" Australia Post executive Gary Starr said in a statement.\n\n\"However, due to the complex and rapidly evolving situation, a temporary partial suspension has been necessary to allow us to develop and implement a workable solution for our customers.\"\n\nThe halt will largely impact businesses that ship goods to retail customers in the US, including those using Business Contract and MyPost Business.\n\n\"This decision has been made to ensure compliance with the new US Customs and Border Protection (CBP) requirements.\n\n\"Specifically, the requirement for duties and taxes to be prepaid on all shipments prior to their arrival in the US,\" Australia Post said in an email to business customers.\n\nThe suspension also impacts shipping to Puerto Rico.\n\nAre you being impacted by Australia Post's decision? Do you know more about this story? Email our journalist confidentially on terzon.emilia@abc.net.au or em.terzon@proton.me\n\nUS shipping halt until 'further notice'\n\nAustralia Post's decision is effective immediately, from August 26, and is until \"further notice\".\n\n\"Australia Post continues to work with US and Australian authorities and international postal partners to resume postal service to the US as a priority,\" Mr Starr said.\n\nE-commerce business have described confusion and chaos when trying to navigate the tariff changes. (ABC News: Michael Lloyd)\n\nAustralia Post's suspension of most shipments to the US follows the Trump administration axing the \"de minimis\" exemption.\n\nUntil now, parcels of goods worth less than $US800 ($1,230) were not taxed when they arrived in the US — an exemption relied upon by many Australian retailers to send items to the US duty-free.\n\nAustralia Post halts transit shipping to US as global carriers face 'chaos' Photo shows Close up shot of a Aus Post express post package A Trump administration tariff deadline is creating \"chaos\" for postal networks and retailers globally.\n\nThe tax exemption is due to end on August 29 for imports from all countries globally, with low-value parcels to be slugged with tariffs or flat fees.\n\nThe decision — formalised in an executive order on July 30 — has caught many postal operators globally off guard.\n\nChina's de minimis exemption already ended earlier this year, impacting massive online retailers like Shein and Temu.\n\nGuidelines out of Washington DC state parcels will now either be levied with the tariffs associated with their \"country of origin\", or flat fees of more than $US80.\n\nOnline retailers pre-empted Australia Post's decision\n\nAustralia Post already halted transit shipping to the US last week, impacting countries that used Australia as a bypass to get parcels to the United States.\n\nIts latest decision comes after growing stress and confusion from Australian retailers ahead of the August 29 deadline.\n\nAmid the uncertainty, some had already pre-empted problems and halted sales to US customers in recent weeks.\n\nAustrade accused of abandoning Aussie businesses caught in China–US trade war Photo shows A woman and man inspect a black t-shirt on a mannequin Australian fashion brands that are stocked in the US are wearing the burden of the higher tariffs on Chinese made goods. And as uncertainty continues, some brands are walking away from the lucrative market.\n\n\"The hardest part for my business is trying to find information,\" Victorian-based online retailer Emma Jean Jansen told ABC News.\n\nThe quilter and pattern maker, who uses Australia Post to ship to the US, received the postal services email to business customers this morning.\n\n\"I'm not surprised. Until a solution is finalised and properly implemented, they didn’t really have a choice,\" she said.\n\nMs Jansen had already made the call to stop taking orders from America earlier this month.\n\n\"It was a big call to suspend shipping to the US, my largest customer base, but I had no choice,\" she said.\n\n\"Until I have clear information on how the tariffs will be collected, I couldn't risk my customers getting charged a $US80 processing fee on a $50 order.\n\n\"I'm hoping Australia Post will have some answers for us very soon.\"\n\nLoading Instagram content\n\nABC News understands Australia Post is grappling with how to apply the looming charges, and how the money will be collected and delivered to relevant US authorities.\n\nThe postal carrier says it is working with a third-party platform, Zonos, and will notify its impacted business customers when a solution is found.\n\n\"Australia Post is focused on providing a reliable and competitive postal service for customers sending parcels internationally,\" Mr Starr said in the statement.\n\n\"Guidance from [US Customs and Border Protection] has only recently been issued.\n\n\"And, like more than 190 other postal providers, we've been working at pace to find a solution.\"\n\nPostal services in countries including Norway, South Korea and Italy have also suspended many forms of shipping to the US.\n\n\"Letters without goods will not be affected,\" PostNord's announcement said last week.\n\n\"Customers and partners will be kept updated and informed.\"\n\nPostal carriers have been updating businesses on tariff developments. (ABC News: Stephanie Chalmers)\n\nSome private carriers that ship goods from Australia to the US have decided to continue parcel postage despite the de minimis exemption ending.\n\nRob Hango-Zada, the chief executive of postal tech platform Shippit, told ABC News \"integrated commercial carriers\" Shippit uses \"were prepared for this change and are continuing to ship to the US as normal\".",
        "source": "ABC"
    },
    {
        "url": "https://www.smh.com.au/business/companies/coles-posts-healthy-profits-as-measures-against-shoplifters-pay-off-20250826-p5mpt5.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Coles posts healthy profits as measures against shoplifters pay off",
        "publish_date": "Tue, 26 Aug 2025 11:59:16 +1000",
        "category": "finance",
        "authors": [
            "Jessica Yun"
        ],
        "text": "Coles has reduced the amounts of groceries lost to shoplifters, but staff are continuing to face threatening situations as retailers around the country grapple with an industry-wide issue of theft and organised crime.\n\nChief executive Leah Weckert said stock loss volumes had fallen back down to 2015 levels after the company rolled out theft prevention measures such as camera monitoring (“skip scan”), automated security gates (“smart gates”), and “bottom of trolley” technology in hundreds of stores.\n\nColes has reduced theft at a time when other retailers are grappling with an industry-wide crisis. Credit: Eamon Gallagher\n\n“During that period, as we have improved on loss, the market has not,” said Weckert.\n\n“Despite the investments that we’ve made in safety initiatives for our team, we are continuing to see increases in threatening situations in store. And it is definitely the case that in Victoria, retail crime is escalating more than what we are seeing in other states.”",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/nrl/someone-has-come-over-the-top-bulldogs-considering-crichton-options-20250826-p5mpw6.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘Someone has come over the top’: Bulldogs considering Crichton options",
        "publish_date": "Tue, 26 Aug 2025 11:58:36 +1000",
        "category": "sports",
        "authors": [
            "Adrian Proszenko"
        ],
        "text": "Stephen Crichton won’t have to front the judiciary until next week if Canterbury contest his grade-one contrary conduct charge.\n\nThe Bulldogs are required to enter a plea by 2pm on Tuesday after the match review committee was asked to take another look at the face massage Crichton gave Storm star Ryan Papenhuyzen on Friday night.\n\nStephen Crichton has been fined for this incident involving Ryan Papenhuyzen. Credit: NRL\n\nAfter initially escaping with only a concerning acts notice, the committee slapped the Bulldogs skipper with a grade-one charge, which would result in a $1000 penalty with an early guilty plea.\n\nThe Bulldogs have shown a willingness to take matters to the judiciary even when a game suspension isn’t at stake, but are unlikely to run the gauntlet with Crichton.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/politics/victoria/more-than-170-people-with-allegations-against-them-have-working-with-children-clearance-20250826-p5mpun.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "More than 170 people with allegations against them have working-with-children clearance",
        "publish_date": "Tue, 26 Aug 2025 11:55:59 +1000",
        "category": "finance",
        "authors": [
            "Rachel Eddie"
        ],
        "text": "More than 170 Victorians with child safety allegations against them can currently work with children, but they would have their clearance immediately suspended under new legislation being rushed through the state parliament.\n\nThe Victorian government introduced its first reforms to parliament on Tuesday after accepting all 22 recommendations of a rapid review into the childcare crisis.\n\nPremier Jacinta Allan and Attorney-General Sonya Kilkenny respond to the childcare rapid review last week. Credit: Simon Schluter\n\nThe bill would give Victorian authorities the power to immediately suspend working with children checks in more circumstances. Currently, most people are given 28 days to prove their suitability to continue working with children.\n\nAttorney-General Sonya Kilkenny said the clearances of 173 people were currently being re-assessed.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/afl/howe-return-an-enormous-risk-rioli-calls-time-as-port-offloads-five-20250826-p5mpub.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Howe return an ‘enormous risk’; Rioli calls time as Port offloads five",
        "publish_date": "Tue, 26 Aug 2025 11:53:03 +1000",
        "category": "sports",
        "authors": [
            "Danny Russell"
        ],
        "text": "Larkins said it would be a high-risk play to select a veteran who had torn his groin muscle twice within seven weeks.\n\nThe Magpies have tentatively set a preliminary final weekend return for the 35-year-old Howe, who tore his adductor muscle early in the final-round clash against Melbourne, the same injury he suffered in round 18.\n\n“We know he can contribute when he is at his best, but the deconditioning ... the risk-benefit ratio you are looking at is, ‘what happens if he breaks down in the first eight minutes, or the first five minutes, and you are down a player?’.” Larkin told SEN.\n\nLoading\n\n“And the age group works against him. We hate to discriminate against older players, but it is true with soft tissue, whether it’s a hammy, whether it’s the groin or the calf.\n\n“So I reckon it is an enormous risk. I mean, they would know, but this second injury to Jeremy Howe to his right adductor, the groin muscles, was a higher grade and normally, you would be missing four or six [weeks].\n\n“You are just not going to have the time frame to come back. The risk is very high. You just don’t want to be down one of your better players in the first quarter.”",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/politics/federal/trump-demands-countries-back-down-on-tech-regulation-or-face-big-new-tariffs-20250826-p5mpvc.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Trump demands countries back down on tech regulation or face big new tariffs",
        "publish_date": "Tue, 26 Aug 2025 11:39:46 +1000",
        "category": "finance",
        "authors": [
            "Shane Wright"
        ],
        "text": "The Albanese government’s plans to get international tech companies to pay for using Australian news are in danger after President Donald Trump announced he would hit any country that imposed digital taxes or regulations on American businesses with “substantial tariffs”.\n\nTrump, who earlier this year stared down Canadian plans to impose a digital levy on tech firms operating in that country, this morning used social media to reveal he would not only inflict high tariffs on countries that hurt American businesses but also restrict access to technology and computer chips.\n\nUS President Donald Trump has threatened to hit countries that tax American tech giants with big tariffs. Credit: AP\n\nThe federal government has promised to create a News Media Bargaining Incentive to reinforce the News Bargaining Code under which firms such as Meta, Google and Facebook paid Australian publishers including companies such as Nine and News Corporation for use of their content.\n\nMeta has refused to renew deals struck under the Morrison-era bargaining code, and the government unveiled the new incentive to substantially replace it.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/is-australia-s-autism-spike-linked-to-the-ndis-the-evidence-is-in-20250826-p5mpu2.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Is Australia’s autism spike linked to the NDIS? The evidence is in",
        "publish_date": "Tue, 26 Aug 2025 11:33:50 +1000",
        "category": "lifestyle",
        "authors": [
            "Robert Breunig"
        ],
        "text": "Autism rates have been rising around the world, with a sharp increase in prevalence in the last decade. Australia has been no exception.\n\nIndeed, autism diagnoses have risen much faster in Australia than in any other country. In particular, autism diagnoses among children have grown much faster in Australia than in other countries with similar economies and health systems.\n\nAutism diagnoses have risen much faster in Australia than in any other country. Credit: Artwork: Marija Ercegovac\n\nIs this increase in autism diagnosis related to the National Disability Insurance Scheme? The evidence strongly suggests that the answer to that question is yes. We will return to that evidence.\n\nMany things are happening in Australia and in the world that impact autism diagnoses. Diagnostic criteria are changing. Diagnostic substitution is taking place – people are being diagnosed with autism when they would have been diagnosed with something else in the past. There is increasing awareness of autism. There may be genetic and environmental factors which are increasing the prevalence of autism. And, finally, the availability of government support may incentivise people to seek autism diagnoses.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/afl/the-demons-said-good-bye-to-goodwin-should-they-do-the-same-to-petracca-and-oliver-20250826-p5mpt6.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "The Demons said good bye to Goodwin. Should they do the same to Petracca and Oliver?",
        "publish_date": "Tue, 26 Aug 2025 11:33:48 +1000",
        "category": "sports",
        "authors": [
            "Andrew Wu",
            "Jon Pierik",
            "Marc Mcgowan",
            "Scott Spits"
        ],
        "text": "Midfielders Christian Petracca and Clayton Oliver are stars for Melbourne and both have long-term contracts, but that no longer means their respective futures at the club are guaranteed. Credit: Getty Images\n\nSee what went well in 2025, who could be on the move, and something to look forward to in 2026. We’ll publish a new team here every day, so make sure you come back to check them out.\n\nWelcome to our “see you in Bali” wrap, for the teams that are into exit meetings and end-of-season trip plans after falling short of the final eight.\n\nWhat went well: Kysaiah Pickett graduated from a star goalsneak to a game-breaking midfielder/forward who now rivals skipper Max Gawn as the club’s best player. Despite their troubles, the Demons secured Pickett’s prized signature in a huge coup, keeping him in the red and the blue until the end of 2034 on a lucrative contract.\n\nGawn was again a colossus, talking through action on the field and becoming their spokesperson for almost every crisis off it.\n\nKysaiah Pickett and Max Gawn were the shining lights for Melbourne in 2025. Credit: Getty Images\n\nRebounding defender Jake Bowey has taken the next step to become a driver of the team while Harvey Langford, the No.6 pick in last year’s draft, is the Demons’ next A-grade midfielder after making a seamless transition to senior football.\n\nVeteran forward Jake Melksham, with 33 goals from 18 games, earned himself another contract, which was confirmed by the Demons just days after their season ended.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/australia-news-live-at-least-20-killed-in-twin-gaza-strikes-10-million-telco-clampdown-looming-20250826-p5mprx.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Australia news LIVE: Australia Post temporarily suspends US deliveries; at least 20 killed in twin Gaza strikes",
        "publish_date": "Tue, 26 Aug 2025 11:33:31 +1000",
        "category": "finance",
        "authors": [
            "Daniel Lo Surdo"
        ],
        "text": "Coles has reduced the volume of groceries lost to shoplifting but staff are continuing to face threatening situations as retailers around the country grapple with an industry-wide issue of theft and organised crime.\n\nChief executive Leah Weckert said that stock-loss volumes had fallen back down to 2015 levels after rolling out theft-prevention measures such as camera monitoring (“skip scan”), automated security gates (“smart gates”) and “bottom of trolley” technology in hundreds of stores.\n\nColes chief executive Leah Weckert. Credit: Arsineh Houspian\n\n“During that period, as we have improved on loss, the market has not,” said Weckert.\n\n“Despite the investments that we’ve made in safety initiatives for our team, we are continuing to see increases in threatening situations in store. And it is definitely the case that in Victoria, retail crime is escalating more than what we are seeing in other states.”\n\nRetailers are increasingly coming forward to call out the worsening issue as punching a hole in sales and putting the safety of front-line staff at risk.\n\nDan Murphy’s and BWS has implemented body-worn cameras and augmented technology to help train staff, while Rebel Sport’s margins have been dented by the persistent thievery.\n\nLiquor merchants Dan Murphy’s and BWS say they are grappling with organised theft. Credit: Louie Douvis\n\nColes Group sales rose 3.6 per cent to $44.35 billion, with underlying net profit rising 3.1 per cent to nearly $1.2 billion. Its grocery business grew sales by 4.3 per cent to nearly $40 billion as Coles focused on fewer, deeper promotions and locked in everyday low prices on a broad range of products during the year.\n\nWeckert said a focus on quality, value for money, availability and customer experience improved customer-experience metrics, resulting in bigger basket sizes and numbers of transactions. Investors also celebrated the result, sending Coles’ share price 8.1 per cent higher.\n\nAs interest rates fall, the supermarket chief is watching to see how cost-conscious customers will respond, with behaviours like cutting back on treats, cross-shopping and using loyalty points currently still “in play”.\n\n“I think we’re seeing those green shoots around sentiment. The question is going to be: when do we start to see some of the behaviour change and catch up with that? The timing on that is a bit unclear on this,” Weckert told reporters on Tuesday morning.\n\n“As we head into the summer months and we head into Christmas, that will be something we’ll keep a strong eye on because I think that will be the pull for customers to start to return to some of their behaviours around going out a bit more and catching up with friends at the park or at a restaurant.”",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/afl/four-men-charged-after-brownlow-medal-betting-probe-20250826-p5mpuf.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Four men charged after Brownlow Medal betting probe",
        "publish_date": "Tue, 26 Aug 2025 11:31:30 +1000",
        "category": "sports",
        "authors": [
            "Jon Pierik"
        ],
        "text": "Police have charged four men, including a former AFL umpire, with various offences as part of the sports integrity investigation into irregular betting on the 2021 and 2022 Brownlow Medal counts.\n\nIn November 2022, former AFL umpire Michael Pell was arrested after allegedly leaking Brownlow Medal votes from specific matches of the 2022 season in one of the most serious integrity scandals to hit the league. The investigation then widened into the 2021 season, when Pell was an emergency umpire.\n\nField umpire Michael Pell was one of four men arrested in a police investigation into suspicious Brownlow betting. Credit: The Age\n\nThe field umpire was one of four men arrested over suspicious Brownlow betting that was flagged to the AFL by one of its betting partners. This led to an investigation in which multiple agencies discovered irregularities in betting on who would poll the maximum three votes in some games.\n\nIn a statement released on Tuesday, a 35-year-old Reservoir man was charged with 53 offences in relation to wagering on the 2021 and 2022 Brownlow Medal counts, including undertaking a course of conduct to use corrupt conduct information for betting purposes, undertaking a course of conduct to obtain financial advantage by deception, use of corrupt conduct information for betting purposes, communicate information and use of corrupt conduct information for betting purposes.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/culture/dance/your-failures-are-just-as-important-as-your-successes-20250721-p5mgog.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘Your failures are just as important as your successes’",
        "publish_date": "Tue, 26 Aug 2025 11:30:00 +1000",
        "category": "entertainment",
        "authors": [
            "Cassidy Knowlton"
        ],
        "text": "When Rings first reached out two years ago, Sibosado said he was busy, but that he’d come back to her in a few months. She’s very glad he did. “He said, ‘Let’s have a chat. I’m not sure what this would be like, but how about you come up to Lombadina and see my Country, and we’ll go from there’. So I went to Lombadina and met his elders and the leaders in this community. And we talked about who I was, what I wanted to do, Bangarra – you know, not everyone has seen or knows Bangarra, when you live in a community.” Cured trout at Yarra Botanica Credit: Chris Hopkins Bangarra has a cultural and creative cycle to ensure that at every stage of a work’s development, the company is working with community and has consent and permission from the people whose stories they are telling. Having secured permission from the elders in Sibosado’s community, Rings returned to Lombadina in February of this year with lighting designer Damien Cooper, set designer Charles Davis and composer Brendon Boney. They woke with the sun and spent their days learning from the land. “It’s being guided through that Country and given that insight. And really changing your observation from your city eyes to having bush eyes, which takes a couple of days. And not listening, not seeing and listening with the head, but it has to come from an internal feeling that’s a different experience altogether.”\n\nShe says the entire process in Lombadina took about a week. Was there pressure to deliver in that short time, I asked her? “Absolutely!” Bangarra Dance Theatre’s production Illume. Credit: Daniel Boud But she’s been preparing for this kind of creative endeavour her entire life. “I knew what I wanted to be when I was five years old,” she says. “Dance is my first language. I was a dreamer, an imaginer, and would be found in the backyard creating my own world, creating these theatrical productions.” The first professional production she ever saw was Cats at Sydney’s Theatre Royal as a year 11 HSC dance student. “It was transformative and confirmed that that’s the direction that I wanted to go,” she says. “It was fascinating for me that you could take people on a journey just through the movements of the body, through this language of movement.”\n\nWhen she arrived at NAISDA at the age of 17, she initially wanted to do ballet. “But I found out pretty quickly that that ship has sailed,” she says. That was disappointment number one, the first of several key setbacks that made her the dancer and artist she is. She refocused her attention from ballet to modern dance and forged a connection to her Indigenous heritage through the medium. “What I saw at NAISDA was that you could express your identity, or your challenges, or the complications of being a First Nations young person trying to find themselves and balancing lots of different issues.” Frances Rings’ latest work is a collaboration with a visual storyteller, the first in Bangarra’s history. Credit: Chris Hopkins Rings found NAISDA transformative not just culturally and artistically, but also politically. “We turned up in 1988, the year at the Bicentenary ... Carole Johnson [NAISDA and Bangarra founder] came in with the other leaders of NAISDA at the time said, ‘There’s a big march going on, we’re cancelling classes. We’re all heading to Redfern. We’re marching to Hyde Park’.” Stephen Page worked with NAISDA students on a Bangarra production while Rings was at the school, and she desperately wanted to be cast in it. She wasn’t. Disappointment number two.\n\n“I was devastated,” she admits. “And I thought, I’m just going to use this disappointment as a motivation to just keep working and set some new goals.” Baked scallop at Yarra Botanica Credit: Chris Hopkins When she graduated she auditioned for Bangarra to join the company and was put on a traineeship. “Stephen was very strict, and it was, ‘you’re a trainee, so you should just watch, take in what these senior artists and cultural leaders are going to teach you’. “As a graduate, you’re feeling on top, and then you drop to the bottom again. It was extremely humbling to be in that kind of environment where you have to listen, you have to observe, you have to wait, you’ve got to be patient.” Rings was patient – to a point. But she really wanted to get out on stage. Her big break came in Melbourne, where the company was performing at the Arts Centre. But it also came with disappointment number three.\n\n“I was understudying some of the roles from Praying Mantis Dreaming, Stephen’s first full-length work, and one of the dancers got injured. It was a matinee, and Stephen said, ‘You’re on. This is it’. And he said, ‘Do you know it?’ I said, ‘Yeah, I think so’. We had no videos back then, so I was learning it backstage. It was a big learning experience – you’ve got to be ready to go when he says go.” Terrified backstage, Rings threw up a few times, and then it was showtime. “I went on stage, forgot all the choreography, made up my own choreography. When I came off-stage, I was just beside myself. I thought, ‘oh my God, Sis, you don’t have a job any more’.” But Page was impressed that she’d covered so well. “He let me have it, like, what was that? So I got a big dressing down. But [he also said], ‘well, you got on and you kept going and you covered it. So you’re lucky that you still have a job’.” She never did that again, always making sure she truly knew every part in the show. “It was learning by falling over and getting back up again. And I felt like I did that my whole life.”\n\nNow that she’s the artistic director of the company, she makes sure she pays plenty of attention to the understudies. “When I’m holding rehearsals and I see the dancers, and I always watch on the side who’s understudying, who’s covering, and I’ve got my list in front of me. I know who’s supposed to be doing which role, and if I see that they’re not, I could pull them to the side and say something, but it’s a lesson a dancer needs to learn on their own journey.” Loading Mentorship is a hugely important part of what she does with Bangarra, and Rings says she wants her up-and-coming dancers to learn the lessons she did – though perhaps not to invent their own choreography on stage. “They’d be like, ‘well, you did it!’” she laughs. Her dancers all know the story, and yes, they all think it’s hilarious.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/nsw/the-fix-for-this-contaminated-sydney-park-was-called-cheap-and-shoddy-it-went-ahead-anyway-20250813-p5mmk9.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "The fix for this contaminated Sydney park was called cheap and shoddy. It went ahead anyway",
        "publish_date": "Tue, 26 Aug 2025 11:30:00 +1000",
        "category": "finance",
        "authors": [
            "Daniel Lo Surdo"
        ],
        "text": "The parkland promised to locals at a heavily polluted Sydney interchange hangs in the balance, with its interim management plan failing to win the support of the state’s senior chemicals and radiation adviser.\n\nThe last of 50 passive gas vents was installed at the St Peters Interchange last year, in a bid to avoid the build-up of contaminated gas while a long-term fix for the area that was formerly a landfill but now earmarked as public parkland is finalised.\n\nParkland promised to locals at the St Peters Interchange has been closed for several years, with no opening date in sight. Credit: Sam Mooy\n\nChris Burton, the senior technical adviser at the Environment Protection Authority, refused to endorse the site auditor’s call to install the vents, remarking that it was a “slightly poorer, albeit cheaper outcome” that, while viable, would not deal with the source of contaminated gas and potentially deepen pollution issues in years to come.\n\n“They propose to install passive vent stacks on these service pits rather than deal with the source of the gas,” Burton wrote to EPA colleagues in correspondence obtained by the Herald.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/politics/federal/auspost-suspends-business-parcel-shipments-to-us-in-tariff-fallout-20250826-p5mpso.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘Utterly insane month’: Australia Post suspends business parcel shipments to US in tariff fallout",
        "publish_date": "Tue, 26 Aug 2025 11:26:42 +1000",
        "category": "finance",
        "authors": [
            "Nick Newling",
            "David Swan"
        ],
        "text": "Australia Post has suspended shipping most parcels to the United States days before President Donald Trump’s latest round of tariff changes hit low-value items that had been exempt.\n\nTrump signed an executive order last month imposing tariffs on goods worth less than $US800 ($1230), beginning on August 29.\n\nAustralia Post on Tuesday suspended service on business parcels to the US until further notice, as the executive order means senders will need to pre-pay the tariffs before their parcels arrive in the US. This has caused havoc for global postal services that do not have their own technology to collect the money and send it to the US government.\n\n“We are disappointed we have had to take this action, however, due to the complex and rapidly evolving situation, a temporary partial suspension has been necessary to allow us to develop and implement a workable solution for our customers,” Australia Post executive general manager Gary Starr said in a statement.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/afl/crows-pies-face-huge-selection-calls-the-players-from-each-afl-finals-team-in-a-race-to-be-ready-20250825-p5mppo.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Huge Hawks boost: The players from each AFL finals team in a race to be ready",
        "publish_date": "Tue, 26 Aug 2025 11:25:25 +1000",
        "category": "sports",
        "authors": [
            "Peter Ryan"
        ],
        "text": "Positive scan results have put Hawthorn’s Josh Weddle in the frame to play finals as he recovers from a back injury that has kept him out since round 16.\n\nThe running defender has been in modified training and could play with the Box Hill Hawks in this week’s VFL qualifying final against Southport to prove his fitness for the elimination final.\n\nJosh Weddle is awaiting scan results to determine whether he will play finals Credit: AFL Photos\n\nHarry Morrison will have recovered from a quad injury to be available for selection and Mitch Lewis is expected to recover from the corkie that saw him subbed out of the final round match against the Brisbane Lions.\n\nRachele touch and go for qualifying final",
        "source": "SMH"
    },
    {
        "url": "https://www.sbs.com.au/news/article/australia-post-to-suspend-parcel-sending-to-the-united-states-amid-trumps-tariffs/iijxycuf9",
        "title": "Australia Post suspends parcel sending to US amid Trump tariffs. Here's what to know",
        "publish_date": "Mon, 25 Aug 2025 22:38:12 +0000",
        "category": "finance",
        "authors": [],
        "text": "Australia Post will temporarily suspend the postal sending of parcels to the United States and Puerto Rico.\n\n\n\n\n\nThe change is set to affect Australian retailers shipping to the US and those sending gifts valued at over $150.\n\n\n\nWhat parcels will be affected?\n\nFrom 26 August 2025, postal goods sent to the US and Puerto Rico will not be accepted by Australia Post. Not all Australia Post parcels will be affected.\n\n\n\n\n\nThe change will primarily affect Australian businesses that are selling to American customers, or Australians sending over expensive presents to loved ones across the ocean.\n\n\n\nLISTEN TO Australia spared tariff hike as Donald Trump raises rates for 92 nations SBS News 06:51 English\n\nThe temporary suspension will impact businesses shipping goods to retail customers in the US, including those using MyPost Business and Business Contract.\n\n\n\n\n\nThis will affect many Australian e-commerce retailers, with some needing to make the decision overnight to halt serving customers in the region.\n\n\n\n\n\nOrdinary letters and documents, as well as gifts valued under US$100 ($153), are unaffected by the change.\n\n\n\n\n\nThat means that if you're planning on sending a loved one an Aussie care package with Vegemite and Tim Tams, you'll want to make sure that it's valued under $153.\n\n\n\nWhy is Australia Post suspending parcels to the US?\n\nThe action being taken is in response to the US government's imposition of customs and import tariff rules for parcels sent to the US, Australia Post said in a statement on Tuesday.\n\n\n\n\n\nThe Trump administration is set to change customs rules for parcels. Until now, low-value packages heading to the US were subject to the \"De Minimis\" exemption — which allows parcels and goods valued below US$800 (about $1,200) to enter the country duty-free.\n\n\n\nAs of 29 August, that rule will be suspended, with parcels subject to the tariff imposed on that country.\n\n\n\n\n\nAustralian goods are subject to the baseline 10 per cent tariff.\n\n\n\n\n\nAustralia Post's temporary partial suspension also includes parcels to Puerto Rico, as it is a US customs territory and has also been impacted by tariff changes.\n\n\n\nWhat other countries have done the same?\n\nAustralia Post says its action is in line with other postal operators globally.\n\n\n\n\n\nPostal services across Europe have already suspended most parcel shipments to the US, including France's La Poste, Germany's Deutsche Post, Spain's Correos, Poste Italiane and the Belgian, Swedish and Danish postal services.\n\n\n\n\n\nAustria's Österreichische Post and the United Kingdom's Royal Mail are expected to stop sending parcels to the US by the end of August.\n\n\n\nIn the meantime, Australia Post is working with Zonos, an authorised US Customs and Border Protection third-party provider, on a solution for business customers.\n\n\n\n\n\nGary Starr, Australia Post's executive general manager of parcels, post and e-commerce services, said: \"We are disappointed we have had to take this action; however, due to the complex and rapidly evolving situation, a temporary partial suspension has been necessary to allow us to develop and implement a workable solution for our customers.\"\n\n\n\n\n\n\"Australia Post continues to work with US and Australian authorities and international postal partners to resume postal service to the US as a priority,\" he said.\n\n\n\nWhat's the reaction been?\n\nIt's believed Australian businesses will still be able to send parcels to the US through more expensive commercial models like DHL and FedEx.\n\n\n\n\n\nBut this might not be viable for many Australian businesses, who have announced they'll be suspending shipping to the US and Puerto Rico immediately.\n\n\n\n\n\nStephen Just, a bespoke fountain pen maker from Brisbane, said he has had to suspend sales to the US \"effective immediately\".\n\n\n\n\n\n\"It's still unclear at this stage what exactly is going to happen and if Australia Post can come up with a solution to this anytime soon. So I have no choice but to suspend sales until more information becomes available,\" he wrote on his business's Instagram page.\n\n\n\n\n\n\"My only other option currently for international shipping is DHL, the shipping cost starts at $55 AUD or $65 ... for some addresses into the US it can be as much as $120 AUD.\"\n\n\n\nNatural Fibre Arts, a hand-dyed yarn business based in Perth, was forced to expedite orders before the changes took place. Now, they've needed to pause new orders from the US.\n\n\n\n\n\nBoth businesses said if they continue shipping to the US, the tariff would need to be paid to the US Customs and Border Protection before the product enters the country.\n\n\n\n\n\nAustralian book small business, Beyond The Pages, said it was \"doing everything to minimise the impact, including declaring the lowest possible parcel values\".\n\n\n\n\n\nBut for now, it's a state of limbo for many Australian businesses.\n\n\n\n\n\n— With additional reporting by Australian Associated Press\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/israel-regrets-strikes-on-a-gaza-hospital-that-leave-20-dead-morning-news-bulletin-26-august-2025/4f0v9y8yz",
        "title": "Israel regrets strikes on a Gaza hospital that leave 20 dead | Morning News Bulletin 26 August 2025",
        "publish_date": "Mon, 25 Aug 2025 21:03:06 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/thousands-of-australian-children-are-homeless-without-an-adult-supporting-them/m70gux0eg",
        "title": "Thousands of Australian children are homeless, without an adult supporting them",
        "publish_date": "Mon, 25 Aug 2025 19:40:05 +0000",
        "category": "finance",
        "authors": [],
        "text": "Key Points Of the 78,092 children to access specialist homelessness services in 2023-24, 13,301 of them were unaccompanied.\n\nStatistics on unaccompanied homeless children in Australia have not previously been isolated and reported.\n\nAdvocates want a national action plan focusing on identifying children at risk of exiting the home.\n\nNew figures released on Tuesday show that almost one in five people who sought support from a specialist homelessness service (SHS) in Australia were unaccompanied children.\n\n\n\n\n\nThe data from the Australian Institute of Health and Wellbeing (AIHW) showed more than 13,300 (17 per cent) of the clients of such services in the 2023-24 fiscal year were children between 12 and 17 years of age.\n\n\n\n\n\nThe head of an organisation that operates two shelters for children aged 12-15 years in Tasmania told SBS News her staff had seen children as young as 10 coming to ask for help.\n\n\n\n\n\nHome Base chief executive officer Di Underwood told SBS News the issue of child homelessness needed to be addressed at the root causes and that this was not a shortage of housing .\n\n\n\n\n\n\"When we're talking about a 12-year-old needing a place to stay, the actual bricks and mortar is the last thing that we need to be worried about,\" she said.\n\n\n\nChildren experiencing homelessness are often escaping dangerous situations but as an unaccompanied child, they can be at further risk of dangerous situations. Source: Getty / TkKurikawa University of Tasmania, communities and social justice associate professor, Catherine Robinson told SBS News she was hopeful the release of this data would prompt action as child homelessness in Australia had been \"invisibilised\" until now.\n\n\n\n\n\nThe data that has been released had not been broken down this way previously.\n\n\n\n\n\n\"AIHW has traditionally only reported and referred to ‘young people’ as being unaccompanied, and have reported on ‘children's homelessness’ and included that as part of children who might be homeless with their parents,\" she said.\n\n\n\n\n\n\"So this is a really significant moment in which one of our lead national institutions is finally properly recognising that children are experiencing homelessness without a parent or guardian.\n\n\n\n\n\n\"It's the first time that they've done a standalone report and used that language of 'unaccompanied homeless children,' and that they've isolated the records around that cohort,\" Robinson said.\n\n\n\nAssociate professor in communities and social justice at the University of Tasmania Catherine Robinson has welcomed the release of this data from the Australian Institute of Health and Wellbeing. Source: Supplied / Richard J Ho, Minch Media She said this had influenced people's perception of homelessness in Australia.\n\n\n\n\n\n\"They think about young people, and they might assume, well, they might be over 18, they might have access to independent income, they can apply for a rental.\n\n\n\n\n\n\"What's been happening is we've had this situation where all of this discussion of youth homelessness has actually 'invisibilised,' for want of a better word, the specific issue of children's homelessness, and it's let governments and community off the hook,\" Robinson said.\n\n\n\nFactors influencing and the trauma of child homelessness\n\nUnderwood said for Home Base staff \"the biggest issue by far that we see is family breakdown and family domestic and sexual violence is the reason young people turn up\".\n\n\n\n\n\nThat is also what the AIHW data has shown, with 42 per cent of unaccompanied children identifying interpersonal relationships as the main reason for seeking assistance.\n\n\n\n\n\n\"These young people are homeless because their homes, where their parents are, are not safe places,\" she said.\n\n\n\n\n\nUnderwood described how experiencing homelessness as a child could cause further trauma.\n\n\n\n\n\nShe said once a child experienced unaccompanied homelessness, they were exposed to other young people and situations “that they probably shouldn’t be\".\n\n\n\nHome Base chief executive officer Di Underwood says staff within the Tasmanian-based service dealt with unaccompanied children who were experiencing homelessness, as young as 10 years old. Source: Supplied Robinson said there was a shortage of crisis care available for children to access, and \"if our governments don't want to provide safe accommodation for our children, there are other people in the community who do provide that accommodation, and they're not the kind of people that we'd want children to be staying with.\"\n\n\n\n\n\n\"That could include violent peers and exploitative partners, it's very common for girls, you might have a 14-year-old staying with their 19 or even 24-year-old boyfriend and they're completely dependent on that young man for their accommodation, so lots of girls report absolutely horrific intimate partner violence because they're entirely trapped,\" she said.\n\n\n\n\"Then you have criminal networks who might offer kids a place to crash in exchange for helping them move drugs, something I definitely see in my research.\"\n\n\n\n\n\nRobinson said there was a \"fundamental misunderstanding\" of the role government child protection departments play with homeless children.\n\n\n\n\n\n\"It's a highly residualised and specialist service; it is not universally available, you have to meet particular evidenced and legally prosecuted grounds to be removed [from a home] and provided with alternative care in the out-of-home care sector,\" she said.\n\n\n\n\n\n\"We want to see that that process is extremely rigorous, I'm not suggesting it shouldn't be, but that tells you that there's a particular threshold and definition of which children will be offered out-of-home care, homelessness in itself does not ensure a child meets the threshold for a child protection response,\" Robinson said.\n\n\n\nStatistics only show part of the problem\n\nShe said the number of unaccompanied children experiencing homelessness was likely far higher than the 13,301 accounted for in the AIHW statistics, as it only showed the number of children who presented to services.\n\n\n\n\n\n\"If those relevant services don't exist in many states and territories, then clearly you're not getting the number of children in Australia who are experiencing this,\" Robinson said.\n\n\n\n\n\nRobinson said only Tasmania and New South Wales \"provide significant shelter accommodation in the specialised homeless service system for homeless children\".\n\n\n\n\n\nTherefore, whilst she said the data provided \"a great indicator, it's not a representation of the reality of this issue\".\n\n\n\nAddressing child homelessness\n\nRobison said, “what we need is a very distinct conversation about what unaccompanied child homelessness is, and what drives it, as distinct from adult homelessness.\"\n\n\n\n\n\nShe said while housing stock would be playing a role in overall homelessness, \"when we talk about unaccompanied child homelessness, we are talking about very different main drivers of that homelessness, which is really around family conflict, relationship breakdown, abuse, neglect and violence.\"\n\n\n\n\n\n\"In terms of thinking about what does a good response look like? It's not about housing affordability, it's about family support, addressing family poverty.\"\n\n\n\n\n\nRobinson said early intervention mechanisms, particularly in schools and health services were required for the early identification of families and children individually who might be struggling and \"on a pathway to having to exit home early because those family relationships are broken down\".\n\n\n\nREAD MORE The 'damaging' hidden crisis affecting thousands of Australian children\n\nHomelessness Australia wants to see a national action plan on child homelessness.\n\n\n\n\n\nThe organisation's chief executive Kate Colvin said systems that identified children at risk need to be established.\n\n\n\n\n\n\"Put in place the protections so they don't become homeless, but also deliver rapid responses to children if they do become homeless, so that they immediately have a safe environment and the support they need to find a pathway into a safe home and with the care that they need,\" she said.\n\n\n\n\n\nThe government is currently developing a housing and homelessness plan, which had been expected to be released by now.\n\n\n\n\n\n\"It's not clear that they'll identify child homelessness as a separate issue and with a separate response within that overall plan,\" Colvin said.\n\n\n\n\n\n\"What we're calling for is within that plan that children who are homeless be separately identified and separate systems put in place to respond to them, because the responses are really different.\"\n\n\n\n\n\nShe said while homelessness in terms of adults was about having physical housing stock and providing the support for individuals to be able to manage a tenancy \"when we're talking about children who are homeless, particularly young children, it's about providing a pathway for them into an environment where they're getting the care they need, you can't set a 13 year old up in a tenancy.\"\n\n\n\nPoor outcomes for children experiencing homelessness\n\nOf the unaccompanied children who sought support, just 19 per cent were able to escape homelessness during the period they were accessing such services.\n\n\n\n\n\nAlso part of the AIHW data release were statistics that showed children who received support from an SHS accounted for one in 13 deaths among Australian children from 2012-13 to 2022-23.\n\n\n\n\n\nColvin said this highighted the \"shocking risks\" that children face when they are homeless.\n\n\n\nHomelessness Australia chief executive Kate Colvin wants to see a national action plan on child homelessness created to address the issue affecting thousands of Australian children every year. Source: Supplied \"Before they've come to a homeless service, generally, they've had really traumatic experiences, then they come into homelessness, and often have further traumatic experiences of not getting the help they need around violence and exploitation.\n\n\n\n\n\n\"Devastating mental health outcomes are a consequence of that, we can see that in the deaths report where we've lost 520 children in 10 years, that's about one a week, and the leading cause of death is suicide,\" she said.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/video/health-experts-call-for-tighter-controls-on-weight-loss-injections/iru1aj0eq",
        "title": "Health experts call for tighter controls on weight loss injections",
        "publish_date": "Mon, 25 Aug 2025 10:14:04 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/video/labor-fast-tracks-first-home-buyer-scheme-amid-coalition-criticism/ju0r81az1",
        "title": "Labor fast tracks First Home Buyer Scheme amid Coalition criticism",
        "publish_date": "Mon, 25 Aug 2025 10:06:28 +0000",
        "category": "finance",
        "authors": [],
        "text": "Labor fast tracks First Home Buyer Scheme amid Coalition criticism\n\nPublished 25 August 2025, 8:07 am\n\nLabor is fast-tracking its 5 per cent deposit for first home buyers three months early, in a move that briefly crashed the Housing Australia website. The Coalition has criticised the generosity of the scheme, while fighting an internal battle over climate policy.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/video/perth-students-bring-terracotta-warriors-to-life-in-unique-chinese-immersion-program/1zj8oesjo",
        "title": "Perth students bring Terracotta Warriors to life in unique Chinese immersion program",
        "publish_date": "Mon, 25 Aug 2025 09:52:01 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/video/solar-cars-race-across-australias-outback-in-world-challenge/6is6j8m1g",
        "title": "Solar cars race across Australia's outback in world challenge",
        "publish_date": "Mon, 25 Aug 2025 09:26:35 +0000",
        "category": "finance",
        "authors": [],
        "text": "Solar cars race across Australia's outback in world challenge\n\nPublished 25 August 2025, 5:38 am\n\nA fleet of high-tech solar cars has headed off from Darwin for a journey across the Australian outback. It's part of this year's world solar car challenge, with more than a dozen countries taking part. Participants say it's not just a race, but a test of innovative technology that could make its way into industry.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/julian-fell-for-a-scam-now-hes-helping-others-to-avoid-being-tricked/6iwt03xpi",
        "title": "Julian fell for a scam - now he's helping others to avoid being tricked",
        "publish_date": "Mon, 25 Aug 2025 08:45:24 +0000",
        "category": "finance",
        "authors": [],
        "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts .\n\n\n\n\n\nTRANSCRIPT:\n\n\n\n\n\nAs a graphic designer, Julian always believed he was digitally savvy enough to avoid scams - until he was tricked.\n\n\n\n\n\n\"I've been going through a period of bad mental health. During that time, I've gotten behind in filing taxes. When the call came, it says the A-T-O is going to prosecute you for not filing tax returns. And that there had to be money today to show good faith.\"\n\n\n\n\n\nJulian says his scammer was a master of psychological manipulation - using his shame to lure him buying gift cards to show his good faith.\n\n\n\n\n\nThey also kept Julian talking to them over the phone, to ensure he completed the payment without thinking about it.\n\n\n\n\n\nHe found out it was a scam when it was too late.\n\n\n\n\n\n\"It took five minutes for me to call the A-T-O and confirm what the scammers say is false.\"\n\n\n\n\n\nNow, Julian has joined the Australian Competition and Consumer Commission - or the A-Triple-C - to alert fellow Australians of scam threats.\n\n\n\n\n\n\"If you are in a heightened emotional state in the financial situation like that, give yourself five minutes, to stop, check and protect yourself.\"\n\n\n\n\n\nJulian's message comes as the national consumer watchdog has released a new report on Australians reporting scams.\n\n\n\n\n\nIt shows that while the number of reports of scams are down compared to last year, there was a 40.5 per cent increase of reports that involve financial losses.\n\n\n\n\n\nAnd the number is higher among two demographic groups, according to A-triple-C Deputy Chair Catriona Lowe.\n\n\n\n\n\n\"For culturally and linguistically diverse Australians, that number was 44 per cent increase in reports involving losses, and for First Nations Australians it's 55.3 per cent.\"\n\n\n\n\n\nMs Lowe says online shopping is the most common type of scam, and they are getting more sophisticated.\n\n\n\n\n\n\"Gone are the days we could look for the obvious spelling errors or the very, very basic website, we are seeing highly sophisticated spoof websites, very good fake advertisements and some pretty convincing impersonations.\"\n\n\n\n\n\nPhishing, which refers to scammers deceive a person into giving their personal information, is another type of the most common scams, and it's caused $19.5 million in financial losses so far.\n\n\n\n\n\nProfessor Jeannie Patterson specialises in consumer laws and A-I at Melbourne Law School.\n\n\n\n\n\nShe says artificial intelligence is becoming the power behind scams, including technologies such as deepfakes.\n\n\n\n\n\n\"The scams are also getting better at pushing our buttons, making us anxious or emotional in some ways. When people's emotion is heightened, their judgment, their learning and all resources they have been exposed to earlier go out of the window.\"\n\n\n\n\n\nSimon Birmingham is the chief executive of the Australian Banking Association.\n\n\n\n\n\nHe says banks have been investing in A-I tools to identify and disrupt scams.\n\n\n\n\n\nBut he also says it's important that consumers remain alert in the wake of evolving technology and new tricks.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/ai-voice-clones-and-deepfake-videos-scams-rising-us-rate-cut-talks/cr22ka9im",
        "title": "AI voice clones and deepfake videos scams rising & US rate cut talks",
        "publish_date": "Mon, 25 Aug 2025 08:18:30 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/government-announces-early-start-to-deposit-scheme-as-it-builds-case-for-new-parliament-housing-policy/t4hsu9fts",
        "title": "Government announces early start to deposit scheme as it builds case for housing policy in new Parliament",
        "publish_date": "Mon, 25 Aug 2025 06:10:27 +0000",
        "category": "finance",
        "authors": [],
        "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts .\n\n\n\n\n\nTRANSCRIPT:\n\n\n\n\n\nParliament has returned to Canberra, and Prime Minister Anthony Albanese has already indicated that housing is among the issues set to dominate the fortnight.\n\n\n\n\n\n\"We're absolutely determined to do everything we can to fast track home ownership, fast track improved number of rentals, fast track social ownership of homes as well. We want to make a difference as we target our 1.2 million homes objective with our $43 billion dollar home for Australia plan.\"\n\n\n\n\n\nThe Prime Minister says that the government will fast-track the expansion of an initiative aimed at making the property market more accessible: the First Home Buyer Guarantee.\n\n\n\n\n\nThe Guarantee allows first-home buyers to buy a property with a smaller 5 per cent deposit, compared to the usual 20 per cent.\n\n\n\n\n\nUnder the scheme, a first home buyer looking to purchase a property at the national median price of $844,000 will only need a $42,200 deposit.\n\n\n\n\n\nThe government then acts as guarantor, contributing the remaining 15 per cent and allowing buyers to avoid taking out costly lender's mortgage insurance.\n\n\n\n\n\nHousing minister Clare O'Neil says it's about making the property market more equitable.\n\n\n\n\n\n\"This policy is going to have a hugely meaningful impact for the people who choose to use it. What we know is that it is incredibly challenging for this younger generation to get into home ownership. We are seeing young people having to save 8 or 9 years to build a deposit. With the 5 per cent deposit program that our government is expanding, we see that timeline brought back to two or three years.\"\n\n\n\n\n\nPreviously, the scheme had an annual cap on the number of people accessing it, as well as income caps on eligible participants and price caps on eligible properties.\n\n\n\n\n\nBut starting October 1st, there will be no income limit, no uptake limit, and an increased price cap on properties to better align with the national average.\n\n\n\n\n\nAn estimated 70,000 people are expected to use the expanded scheme in its first year of access, 20,000 more than the current yearly cap.\n\n\n\n\n\nThe Opposition has already criticised the scheme.\n\n\n\n\n\nNationals Senator Barnaby Joyce has told Seven's Sunrise that it will drive up property prices.\n\n\n\n\n\n\"The Housing Australia Future Fund has been, I mean huge promises, disastrous delivery, is of course just put out the price of houses people are going to be able to borrow more money so they're going to go to the auction and say 'hey guess what? We can - we can bid for more because we've got access to more money,' The price of houses just goes up. You've got to deal with the other issues and the Labor Party are not.\"\n\n\n\n\n\nOpposition housing spokesperson Andrew Bragg meanwhile is critical of the scheme being open to all first-home buyers without any income testing.\n\n\n\n\n\n\"So I think it is perverse and bizarre that children of billionaires will now have access to a government insurance scheme. Effectively, a welfare system is now going to be opened up to the children of billionaires. So it was once a targeted scheme, and now it's a universal scheme without any means testing, so that I think that is quite bizarre.\"\n\n\n\n\n\nThe Housing Industry Association says the move is welcome and an important step in opening the doors to more people entering the market.\n\n\n\n\n\nThe Property Council of Australia has also welcomed the scheme's expansion but says it should be regularly reviewed to ensure key markets don't overheat.\n\n\n\n\n\nAnd Master Builders Australia chief executive Denita Dawn says while more access is a good thing, it must be coupled with more supply.\n\n\n\n\n\n\"We now ask the focus of the government to be on people. We simply do not have enough people to build at the moment, that's our next big issue. What are we doing around migration to make things easier for migrants to have their skills recognised in this country, it takes too long, it's too expensive. We don't have tradies as the number one skilled priority, even though they would meet the 130,000 or more threshold that needs to be changed. What are we also doing around encouraging more people into trades that should now be the next focus of the government when it comes to housing issues.\"\n\n\n\n\n\nThe scheme's earlier start date follows the government announcing a pause on upcoming changes to the National Construction Code [[NCC]] to allow for quicker approvals to new housing projects.\n\n\n\n\n\nFollowing the economic roundtable in Canberra last week, regulatory barriers described by some as burdensome were singled out as a key barrier to efficient home building.\n\n\n\n\n\nThe N-C-C will now be put on hold until 2029 - though the freeze excludes essential safety and quality changes and maintains residential standards adopted in 2022, including seven-star energy efficiency.\n\n\n\n\n\nAndrew Bragg says the government needs more coherence in its housing policy.\n\n\n\n\n\n\"Well, if you're confused about the government's housing agenda, then that makes a lot of Australians, because the government says that they want to cut red tape, but then they announced today they want to become the nation's largest mortgage insurer in addition to being a massive property developer. So either you want to cut red tape and make it easy for builders and traders and developers, or you want to have a big government solution to everything, which is what we've seen today with this expansion of the home guaranteed scheme.\"\n\n\n\n\n\nOpposition leader Sussan Ley also hit out at the Prime Minister, saying the government has adopted policies she says were initially proposed by the coalition.\n\n\n\n\n\nThe PM hit right back.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/australians-are-reporting-fewer-scams-but-losing-more/dl26g4ebn",
        "title": "'New weapon of choice': Australians are reporting fewer scams — but losing more",
        "publish_date": "Mon, 25 Aug 2025 02:21:32 +0000",
        "category": "finance",
        "authors": [],
        "text": "Australians are reporting fewer scams in 2025, but are losing more money as a result of them.\n\n\n\n\n\nWhile the total number of scams reported to the National Anti-Scam Centre's Scamwatch service in the first half of this year dropped by 24 per cent, reports involving financial losses have increased significantly, according to the Australian Competition and Consumer Commission (ACCC).\n\n\n\n\n\nIt comes as Australians are urged to remain alert to \"emerging\" scam threats powered by artificial intelligence — from voice cloning to deepfake videos.\n\n\n\nTotal reports drop, but financial losses rise\n\nAustralians reported 108,305 scams and $174.8 million in financial losses to Scamwatch in the first half of this year, the ACCC revealed on Monday, with fake websites, online ads and contact through social media being scammers' preferred methods.\n\n\n\n\n\nThe total number of reports is a 24 per cent drop compared to the same period last year.\n\n\n\n\n\nHowever, the almost $175 million reported lost represents a 26 per cent increase.\n\n\n\nThere has also been a 40.5 per cent increase in reports involving losses, which is higher among those who speak English as a second language (44 per cent), along with First Nations Australians (55.3 per cent).\n\n\n\n\n\nOn Monday, the ACCC said the losses in 2025 still represent a 39 per cent decrease compared to the same period in 2023. Financial losses to scams peaked in 2022 and early 2023, it said.\n\n\n\nLosses to phishing, shopping scams in 2025\n\nLosses so far to phishing scams this year totalled $19.5 million. Phishing refers to attempts by scammers to deceive a person into giving their personal information, such as bank account details or passwords.\n\n\n\n\n\nThese losses were driven in part by a rise in cryptocurrency impersonation scams.\n\n\n\n\n\n\"Technology is helping scammers reach more people than ever before, and we see scams becoming more sophisticated and harder for people to detect,\" ACCC deputy chair Catriona Lowe said.\n\n\n\n\n\n\"Scams don't discriminate and can affect anyone, which is why open conversations with loved ones and greater awareness are so important.\n\n\n\n\n\n\"Government, business and individuals all have a role to play in building a scam-aware community and reaching every group, including those who may face extra barriers to understanding or reporting scams.\"\n\n\n\nREAD MORE The scams more Australians are falling for\n\nScamwatch also received more than 6,300 reports of financial loss to shopping scams in the first half of the year. That type of scam had more reports of financial loss than any other.\n\n\n\n\n\nShopping scams can involve scammers \"creating convincing online shopping platforms, advertising fraudulent products and luring consumers with deals that appear too good to pass up\".\n\n\n\n\n\n\"Scammers are increasingly targeting people on websites and social media, knowing we’re all spending more time and money online,\" Lowe said.\n\n\n\n\n\n\"Taking just a few moments to verify a seller or offer can be the difference between a good deal and a devastating financial loss.\"\n\n\n\nAI-powered scams to look out for\n\nBanks are urging Australians to remain alert to \"emerging\" scam threats, which are powered by AI.\n\n\n\n\n\nAustralian Banking Association (ABA) chief executive Simon Birmingham said AI, a \"powerful tool\" for banks and law enforcement to combat scams, has also become the \"new weapon of choice for scammers\".\n\n\n\n\n\n\"Unfortunately, we live in a world where advances in AI‑generated video and audio make it possible for criminals to impersonate celebrities, your friends, family members or even your bank,\" he said.\n\n\n\n\n\n\"From fake investment ads by celebrities to voice clones asking for help, AI scams are becoming more targeted, sophisticated and emotionally manipulative.\"\n\n\n\nThe ABA is warning Australians to be on the lookout for scams using voice cloning, deepfake videos or AI-generated phishing scams.\n\n\n\n\n\n\"Banks will continue to fight back by using AI to detect and shut down scams so as to protect people's money, however customer vigilance is still the best form of defence,\" Birmingham said.\n\n\n\n\n\nNew data from ANZ showed a 15 per cent drop in customer losses to scams between last October and June.\n\n\n\n\n\nThe bank said on Monday that although scams were getting more sophisticated, there was greater customer engagement with security features and more awareness.\n\n\n\n\n\n\"Our customers are becoming increasingly aware of how to protect themselves,\" said Shaq Johnson, ANZ's head of Australia and New Zealand customer protection.\n\n\n\nANZ said it stopped $100 million worth of scams in the nine months to June and urged customers to \"continue building their awareness through available education opportunities\".\n\n\n\n\n\nEarlier in August, the Commonwealth Bank said it was getting the upper hand on scammers, citing a 76 per cent fall in customer losses to fraud since a peak in early 2023.\n\n\n\n\n\nThe bank said it spent almost $1 billion in 2024 to 2025 on preventing scams, including the rollout of \"two new defensive assets\" to help protect customers.\n\n\n\n\n\nOverall, the ACCC's Lowe said while it's distressing to see so many people affected by scams, it's encouraging to know that Australians \"are speaking up, seeking help and sharing what they know\".\n\n\n\n\n\n\"This information helps us continue to disrupt scam networks.\"\n\n\n\n\n\n— With additional reporting by the Australian Associated Press.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/prime-minister-condemns-climate-wars-ahead-of-policy-debate-midday-news-bulletin-25-august-2025/el7hrs4d2",
        "title": "Prime Minister condemns \"climate wars\" ahead of policy debate | Midday News Bulletin 25 August 2025",
        "publish_date": "Mon, 25 Aug 2025 01:52:51 +0000",
        "category": "finance",
        "authors": [],
        "text": "Key Points Coalition debate future of net zero emissions target as Prime Minister weighs in\n\nTreasurer defends tax provisions that he says incentivise building superannuation\n\nAustralian tennis player Jordan Thompson heads to second round of the US Open\n\nListen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nA coalition split over net zero will play out in parliament as crossbench MPs push for stronger climate action.\n\n\n\n\n\nNationals MP Barnaby Joyce has revived his bill to scrap emissions targets, which Labor has allowed to be debated today.\n\n\n\n\n\nThe bill is certain to fail but is expected to expose divisions between Nationals who want the target repealed and moderate Liberals who say it must remain to show credibility on climate change.\n\n\n\n\n\nPrime Minister Anthony Albanese is accusing the opposition of reigniting what he calls the climate wars.\n\n\n\n\n\n\"It is defying what we see happening around us and defying the science. If you get rid of net zero, you are saying climate change is not real and you do not need to do anything about it. ... Now our opponents are having a debate, and they have one on the weekend at the LNP conference, we had the leader of the opposition come along and be repudiated by more than 90 per cent of members at that LNP conference.\"\n\n\n\n\n\nData released by Climate Change Minister Chris Bowen found Australia is tracking well to meet its 2030 target to reduce greenhouse gas emissions by 43 per cent from 2005 levels.\n\n\n\n---\n\n\n\n\n\nRetirees should continue to receive concessional tax treatment on their superannuation, Treasurer Jim Chalmers says, despite growing pressure for broader tax reform.\n\n\n\n\n\nSpeaking after a three-day productivity roundtable in Canberra, Dr Chalmers says fairness for younger generations must be part of future tax discussions.\n\n\n\n\n\nWhile feedback from the summit would shape upcoming budgets, he's told the ABC there are no plans to change tax concessions for retirees’ super balances.\n\n\n\n\n\n“They still deserve concessional treatment to encourage people to be in superannuation, and that’s not something we are proposing to change. ... We acknowledge that there are issues in superannuation and tax, and that's why two and a half years ago, I proposed what is a pretty modest change, but a meaningful change which makes the system a bit more sustainable, but still maintains an element of concessionality when it comes to tax treatment and super.”\n\n\n\n---\n\n\n\n\n\nThe Albanese government is set to bring forward the expansion of a scheme allowing first home buyers to put down a deposit of as little as five per cent.\n\n\n\n\n\nWhile previous iterations of the initiative had a yearly cap on participants, the scheme will now be open to all home buyers.\n\n\n\n\n\nOriginally slated for implementation in January 2026, the expanded scheme will begin rolling out from October.\n\n\n\n\n\nUnder the scheme, a first home buyer looking to purchase a property at the national median price of $844,000 would only need a $42,200 deposit.\n\n\n\n\n\nHousing minister Clare O'Neil says it is clear young people need greater access to the property market.\n\n\n\n\n\n\"This policy is going to have a hugely meaningful impact for the people who choose to use it. What we know is that it is incredibly challenging for this younger generation to get into home ownership. We are seeing young people having to save 8 or 9 years to build a deposit. With the 5 per cent deposit program that our government is expanding, we see that timeline brought back to two or three years.\"\n\n\n\n---\n\n\n\n\n\nIran’s Supreme Leader has declared the standoff with the United States unsolvable, insisting Tehran will never submit to US demands over its nuclear program.\n\n\n\n\n\nAyatollah Ali Khamenei’s remarks follow the suspension of nuclear talks with Washington after US and Israeli strikes on Iranian nuclear sites during a 12-day war in June.\n\n\n\n\n\nAlthough Iran and European powers agreed last week to resume discussions aimed at reviving full negotiations, France, Britain, and Germany have warned they could trigger further UN sanctions if Iran refuses to re-engage.\n\n\n\n\n\nWestern governments maintain Iran is seeking to develop nuclear weapons, a claim Iran rejects, saying it only wants nuclear energy.\n\n\n\n\n\nAyatollah Khamenei accuses the US of disrespecting Iranian sovereignty.\n\n\n\n\n\n“This issue of negotiation with America is unsolvable. The President of the U-S wants Iran to obey America’s orders. The Iranian nation is deeply offended by such a great insult and will stand up, with all its strength, to those who hold such misguided expectations.”\n\n\n\n---\n\n\n\n\n\nJordan Thompson is the first Australian into the U-S Open second round after a 6-2 / 6-4 / 1-6 / 6-3 win over France’s Corentin Moutet in New York.\n\n\n\n\n\nAfter dropping the third set and venting his frustration, Thompson regrouped and sealed victory with a backhand smash and a net finish.\n\n\n\n\n\nHe next faces French left-hander Adrian Mannarino.\n\n\n\n\n\nCompatriot Rinky Hijikata exited earlier, losing 6-2 / 6-1 / 6-2 to Italy’s 32nd seed Luciano Darderi.\n\n\n\n\n\nMeanwhile, former tournament winner, Britain's Emma Raducanu has won her first US Open match in four years, with a straight sets defeat of Japanese qualifier Ena Shibahara.\n\n\n\n\n\nRaducanu says she overcame nerves and was pleased with her performance.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/first-home-buyers-score-early-access-to-deposit-scheme/vpryr80bt",
        "title": "What is the government's 5 per cent home deposit scheme, and what's changing from October?",
        "publish_date": "Sun, 24 Aug 2025 20:51:14 +0000",
        "category": "finance",
        "authors": [],
        "text": "All first home buyers in Australia will be able to get on the property ladder with a lower deposit sooner, as a federal scheme kicks in earlier than scheduled.\n\n\n\n\n\nThe government's expansion of the First Homebuyer Guarantee will allow all first-home buyers to put down a deposit of 5 per cent, and will start rolling out from 1 October, three months earlier than its original start time of January 2026.\n\n\n\n\n\nThe earlier start date for the scheme would reduce hurdles to entering the property market, Prime Minister Anthony Albanese said.\n\n\n\n\n\n\"We want to help young people and first home buyers achieve the dream of home ownership sooner,\" he said in a statement.\n\n\n\n\n\n\"Bringing the start date of our 5 per cent deposit scheme will do just that, getting more Australians into their home quicker, while saving money along the way.\"\n\n\n\nWhat is the first home buyer scheme?\n\nThe scheme allows first-home buyers to buy a property with a smaller 5 per cent deposit, compared to the usual 20 per cent.\n\n\n\n\n\nThe government acts as guarantor and contributes the remaining 15 per cent of a deposit, allowing buyers to avoid taking out costly lenders' mortgage insurance.\n\n\n\nWhat changes are coming to the scheme?\n\nWhile the scheme isn't new, it will be expanded from 1 October to all first-home buyers — after previous versions had a yearly cap on the number of participants.\n\n\n\n\n\nSimilarly, there will no longer be income limits for participants' eligibility for the scheme.\n\n\n\n\n\nPrice caps for eligible homes in the scheme in almost all jurisdictions will also be raised from October.\n\n\n\nHousing Minister Clare O'Neil said the scheme would make access to home ownership fairer. Source: AAP / Mick Tsikas In Sydney, the cap will increase from $900,000 to $1.5 million, in Brisbane it will increase from $700,000 to $1 million, and in Melbourne it will increase from $800,000 to $950,000.\n\n\n\n\n\nIt's estimated 70,000 people are expected to use the home guarantee scheme in its first year of expanded access, 20,000 more than the current yearly cap.\n\n\n\n\n\nHousing Minister Clare O'Neil said the scheme would make access to home ownership more equitable by \"levelling the playing field\", particularly for younger people entering the property market.\n\n\n\n\n\n\"It's just not right that an entire generation of young Australians have been locked out of the housing market, saving for decades while paying off someone else's mortgage.\"\n\n\n\nProperty prices will 'certainly rise'\n\nAMP chief economist Shane Oliver told SBS News the scheme would likely be popular, as home buyers spend on average around 11 years saving for a 20 per cent deposit.\n\n\n\n\n\n\"It does give a leg up to first-time buyers over existing home buyers and investors,\" he said.\n\n\n\n\n\n\"The scheme will be pretty popular and you're going to find a lot of buyers trying to get in through this avenue, bringing forward demand and it could lead to competition in the property market, which has the effect of pushing prices up.\"\n\n\n\n\n\nHe said property prices will certainly rise, saddling first home buyers with larger mortgages and ultimately debt.\n\n\n\n\n\n\"You can get a 5 per cent deposit in just a few years. But you will have 95 per cent of your debt to pay off, that's a very high level of debt.\"\n\n\n\n\n\nHowever, for some people it may be better financially to buy a property sooner, as the market could move against you while you save a 20 per cent deposit.\n\n\n\nThe Reserve Bank of Australia's interest rate cuts have also resulted in spikes in property prices, meaning homes across the country could increase in value even more.\n\n\n\n\n\n\"If you've got falling interest rates and the startup of this expanded scheme, it could supercharge the boost to property markets that otherwise would not have occurred,\" Oliver said.\n\n\n\n\n\n\"So it's great news for existing home owners, but I don't really think it's good news for new home buyers.\"\n\n\n\nWhat other reaction has there been?\n\nThe Housing Industry Association (HIA), the country's peak national industry association for the residential construction and development industry, welcomed the expansion.\n\n\n\n\n\nHIA managing director Jocelyn Martin said: \"This promises to open doors for more people and is an important boost for aspirational home buyers in Australia.\"\n\n\n\n\n\n\"This will make homeownership more accessible to those who may have previously been locked out of the market.\"\n\n\n\n\n\nThe Property Council of Australia said bringing forward the scheme would help more first-home buyers bridge the deposit gap and enter the market.\n\n\n\nBut CEO Mike Zorbas said on Monday the scheme design would need to be carefully reviewed on a regular basis from mid-2026 \"to ensure key housing markets do not overheat\".\n\n\n\n\n\nEverybody's Home, a national campaign aimed at addressing Australia's housing crisis, partially through increased social housing, said the scheme was \"good for some\" but was \"not a solution to the housing affordability crisis for all\".\n\n\n\n\n\n\"The real solution to Australia's housing crisis is to bring down the cost of housing for everybody through measures including tax reform and more social housing,\" spokesperson Maiy Azize said.\n\n\n\n\n\n\"Too many Australians are locked out of home ownership because they are stuck in a rental market that makes it extremely difficult to save.\n\n\n\n\n\n\"To tackle the housing crisis, the federal government must make major investments in social housing; these are low-cost rentals that are guaranteed to remain affordable. Australia already faces a social housing shortfall of 640,000 homes, and that gap is only widening.\"\n\n\n\n\n\nOpposition housing spokesperson Andrew Bragg was critical of the scheme being open to all first-home buyers without any income testing.\n\n\n\n\n\n\"This is an uncapped scheme which is available to billionaires, or the children of billionaires, if they want to use a government program,\" he told ABC radio on Monday morning, warning of taxpayers \"underwriting mortgage insurance schemes for extremely wealthy people\".\n\n\n\nWhat other changes are coming to housing?\n\nThe scheme's earlier start date comes as upcoming changes to the national construction code were paused to allow for homes to be built quickly.\n\n\n\n\n\nThe code will be put on hold until 2029, with the exception of safety standards, which have been touted as reducing complexity for workers in the construction industry.\n\n\n\n\n\nThe pause follows the federal government's productivity roundtable, which also led to the fast-tracking of environmental approvals for more than 26,000 homes.\n\n\n\n\n\n— With additional reporting by the Australian Associated Press\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/thailand-cannabis-government-policy-reversal-shut-down/zhxue87ag",
        "title": "'They couldn't bear it': The city where cannabis shops are disappearing post-high",
        "publish_date": "Sun, 24 Aug 2025 19:33:10 +0000",
        "category": "finance",
        "authors": [],
        "text": "For three years, downtown Bangkok has had a green glow.\n\n\n\n\n\nNeon cannabis leaves light up practically every corner; an inescapable marker of what quickly ballooned into a billion-dollar industry.\n\n\n\n\n\nMore than 18,000 recreational marijuana shops sprang up, seemingly out of nowhere, when Thailand became the first Asian nation to decriminalise cannabis in 2022.\n\n\n\n\n\nTheir glory days may have been short-lived.\n\n\n\n\n\nLast month, the government introduced new regulations restricting cannabis to medicinal use only, banning dispensaries from selling the drug to anyone without a prescription.\n\n\n\nSuradeth Wattanasoontornkul runs a small cannabis dispensary outside Bangkok's city centre. He says he's lost almost all his business. Source: SBS News It's now flagging more rules to come; planning to cut shop numbers back almost 90 per cent to 2,000 and require each one to have a doctor on site.\n\n\n\n\n\n\"The customers are gone,\" cannabis shop owner Suradeth Wattanasoontornkul says. \"They are scared. Everyone's business is going down.\"\n\n\n\n\n\n\"The shop opposite us just closed. They probably couldn't bear it anymore.\"\n\n\n\n\n\nSo far, there's no real evidence Thai authorities have started enforcing the new regulations, but Suradeth says the fear they will has scared most of his customers away.\n\n\n\n\n\nHe used to sell more than $7,000 worth of cannabis every month. Last month, it dropped to less than $500.\n\n\n\n\n\n\"We paid 5,000 baht ($240) to the government for a licence, but once we get that licence, they release new regulations and tell us the one we have is useless,\" Suradeth says.\n\n\n\n\n\n\"Sure, you can hire a doctor, but the cost is very high, and not every doctor wants to work in a cannabis shop.\"\n\n\n\nThe governmental feud fuelling recriminalisation\n\nThailand's health minister says the reforms are about improving public safety and addressing rising cannabis addiction, but analysts say they are also wound up in Thailand's latest political crisis.\n\n\n\n\n\nIn June, former Cambodian leader Hun Sen leaked the audio from a controversial phone call with Thai Prime Minister Paetongtarn Shinawatra , during which she appeared to make disparaging remarks about her own military's handling of the recent border crisis.\n\n\n\n\n\nHer political allies in the Bhumjaithai Party, which was the main driving force behind cannabis decriminalisation, withdrew from the coalition in outrage.\n\n\n\n\n\nWithin a week, Shinawatra's Pheu Thai Party had moved to recriminalise the drug .\n\n\n\n\n\nThe reversal on cannabis \"has a lot to do with coalition dynamics and coalition politics,\" political analyst Thitinan Pongsudhirak from Chulalongkorn University in Bangkok, says.\n\n\n\n\n\n\"The cannabis policy in Thailand is synonymous with the Bhumjaithai Party. It wanted to broaden its political base by decriminalising cannabis. So, suddenly, you had these cannabis shops mushrooming around Thailand, especially in Bangkok,\" he says.\n\n\n\nThe Thai government has flagged plans to cut cannabis shop numbers back almost 90 per cent to 2,000 and require each one to have a doctor on site. Source: SBS News The industry experienced near-instant economic success; its value was already estimated above $1 billion, with the Thai Chamber of Commerce predicting that number could rise to $1.8 billion by the end of this year.\n\n\n\n\n\nAnalysts believe tourists were behind much of the enthusiasm.\n\n\n\n\n\n\"I think there was a public backlash against it,\" Pongsudhirak says.\n\n\n\n\n\n\"The constituencies in favour of cannabis were limited; some vendors, proprietors, tourists, the hospitality industry. But the public sentiments at large are very sceptical. The Thais, being a predominantly Buddhist country, still frowned upon vices like this.\"\n\n\n\n\n\nThailand's public health minister Somsak Thepsuthin says he eventually wants to relist cannabis as a category five narcotic, which would result in tougher penalties for recreational use and possession, including jail time.\n\n\n\n\n\n\"We want to tell tourists they are welcome to enjoy Thailand's culture and nature, but Thailand should not be seen as a destination for recreational cannabis use,\" Thepsuthin recently said. \"It affects children, causes nuisance from unwanted odours.\"\n\n\n\nAn industry moving underground\n\nWith the new restrictions widely unenforced and more regulations on the way, the industry has settled into a grey zone for now.\n\n\n\n\n\nThose trying to keep their businesses open say there is little clarity and a lot of confusion.\n\n\n\nKitty Chopaka says cannabis dispensary owners are reporting a rise in tourists selling the drug to other tourists, suggesting the billion-dollar business is now moving underground. Source: SBS News \"The health department is coming out with one set of information, the provinces are coming out with another set of information, when a lot of things are actually still on the drawing board,\" Kitty Chopaka from advocacy group Writing Thailand's Cannabis Future says.\n\n\n\n\n\n\"The shops in the provinces where the health officers happen to be strict, they are now either shut down, or are being told 'We suggest you shut down until the rules are more concrete, but if you don't shut down we will come and do a little inspection where we're then probably able to suspend your licence'.\"\n\n\n\n\n\nChopaka has been speaking with a network of dispensary owners almost daily as they try to navigate the changes.\n\n\n\n\n\nThey have consistently been reporting a drop in sales since the prescription rules came into effect, but they do not believe that correlates with a drop in usage. Many believe tourists are now buying the drug from other tourists instead of the dispensaries.\n\n\n\n\n\nSome of the 18,000 registered shops have begun shutting down, while others are holding out to see if they might be one of the few that get to stay in business.\n\n\n\n\n\n\"A lot of the small businesses are going to get removed, the small farms, the ones where the husband is the grower, the wife is the trimmer, then maybe the mother-in-law is the seller at the shop. Those guys are not going to exist anymore,\" Chopaka says.\n\n\n\n\n\n\"I would say one small business is about ten lives you're dealing with. You've got the owner, the farms, the people who work in the shop, all of the production side of things. Each of them will have a family. And you times it by 18,000 — that's a lot of people.\"\n\n\n\n\n\nShe says: \"That's the sad part.\"\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.theage.com.au/sport/tennis/emotional-kvitova-retires-after-us-open-loss-20250826-p5mpwt.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Emotional Kvitova retires after US Open loss",
        "publish_date": "Tue, 26 Aug 2025 12:02:50 +1000",
        "category": "sports",
        "authors": [],
        "text": "Emotional Kvitova retires after US Open loss\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/business/companies/coles-posts-healthy-profits-as-measures-against-shoplifters-pay-off-20250826-p5mpt5.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Coles posts healthy profits as measures against shoplifters pay off",
        "publish_date": "Tue, 26 Aug 2025 11:59:16 +1000",
        "category": "finance",
        "authors": [
            "Jessica Yun"
        ],
        "text": "Coles has reduced the amounts of groceries lost to shoplifters, but staff are continuing to face threatening situations as retailers around the country grapple with an industry-wide issue of theft and organised crime.\n\nChief executive Leah Weckert said stock loss volumes had fallen back down to 2015 levels after the company rolled out theft prevention measures such as camera monitoring (“skip scan”), automated security gates (“smart gates”), and “bottom of trolley” technology in hundreds of stores.\n\nColes has reduced theft at a time when other retailers are grappling with an industry-wide crisis. Credit: Eamon Gallagher\n\n“During that period, as we have improved on loss, the market has not,” said Weckert.\n\n“Despite the investments that we’ve made in safety initiatives for our team, we are continuing to see increases in threatening situations in store. And it is definitely the case that in Victoria, retail crime is escalating more than what we are seeing in other states.”",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/nrl/someone-has-come-over-the-top-bulldogs-considering-crichton-options-20250826-p5mpw6.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘Someone has come over the top’: Bulldogs considering Crichton options",
        "publish_date": "Tue, 26 Aug 2025 11:58:36 +1000",
        "category": "sports",
        "authors": [
            "Adrian Proszenko"
        ],
        "text": "Stephen Crichton won’t have to front the judiciary until next week if Canterbury contest his grade-one contrary conduct charge.\n\nThe Bulldogs are required to enter a plea by 2pm on Tuesday after the match review committee was asked to take another look at the face massage Crichton gave Storm star Ryan Papenhuyzen on Friday night.\n\nStephen Crichton has been fined for this incident involving Ryan Papenhuyzen. Credit: NRL\n\nAfter initially escaping with only a concerning acts notice, the committee slapped the Bulldogs skipper with a grade-one charge, which would result in a $1000 penalty with an early guilty plea.\n\nThe Bulldogs have shown a willingness to take matters to the judiciary even when a game suspension isn’t at stake, but are unlikely to run the gauntlet with Crichton.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/politics/victoria/more-than-170-people-with-allegations-against-them-have-working-with-children-clearance-20250826-p5mpun.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "More than 170 people with allegations against them have working-with-children clearance",
        "publish_date": "Tue, 26 Aug 2025 11:55:59 +1000",
        "category": "finance",
        "authors": [
            "Rachel Eddie"
        ],
        "text": "More than 170 Victorians with child safety allegations against them can currently work with children, but they would have their clearance immediately suspended under new legislation being rushed through the state parliament.\n\nThe Victorian government introduced its first reforms to parliament on Tuesday after accepting all 22 recommendations of a rapid review into the childcare crisis.\n\nPremier Jacinta Allan and Attorney-General Sonya Kilkenny respond to the childcare rapid review last week. Credit: Simon Schluter\n\nThe bill would give Victorian authorities the power to immediately suspend working with children checks in more circumstances. Currently, most people are given 28 days to prove their suitability to continue working with children.\n\nAttorney-General Sonya Kilkenny said the clearances of 173 people were currently being re-assessed.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/afl/howe-return-an-enormous-risk-rioli-calls-time-as-port-offloads-five-20250826-p5mpub.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Howe return an ‘enormous risk’; Rioli calls time as Port offloads five",
        "publish_date": "Tue, 26 Aug 2025 11:53:03 +1000",
        "category": "sports",
        "authors": [
            "Danny Russell"
        ],
        "text": "Larkins said it would be a high-risk play to select a veteran who had torn his groin muscle twice within seven weeks.\n\nThe Magpies have tentatively set a preliminary final weekend return for the 35-year-old Howe, who tore his adductor muscle early in the final-round clash against Melbourne, the same injury he suffered in round 18.\n\n“We know he can contribute when he is at his best, but the deconditioning ... the risk-benefit ratio you are looking at is, ‘what happens if he breaks down in the first eight minutes, or the first five minutes, and you are down a player?’.” Larkin told SEN.\n\nLoading\n\n“And the age group works against him. We hate to discriminate against older players, but it is true with soft tissue, whether it’s a hammy, whether it’s the groin or the calf.\n\n“So I reckon it is an enormous risk. I mean, they would know, but this second injury to Jeremy Howe to his right adductor, the groin muscles, was a higher grade and normally, you would be missing four or six [weeks].\n\n“You are just not going to have the time frame to come back. The risk is very high. You just don’t want to be down one of your better players in the first quarter.”",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/politics/federal/trump-demands-countries-back-down-on-tech-regulation-or-face-big-new-tariffs-20250826-p5mpvc.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Trump demands countries back down on tech regulation or face big new tariffs",
        "publish_date": "Tue, 26 Aug 2025 11:39:46 +1000",
        "category": "finance",
        "authors": [
            "Shane Wright"
        ],
        "text": "The Albanese government’s plans to get international tech companies to pay for using Australian news are in danger after President Donald Trump announced he would hit any country that imposed digital taxes or regulations on American businesses with “substantial tariffs”.\n\nTrump, who earlier this year stared down Canadian plans to impose a digital levy on tech firms operating in that country, this morning used social media to reveal he would not only inflict high tariffs on countries that hurt American businesses but also restrict access to technology and computer chips.\n\nUS President Donald Trump has threatened to hit countries that tax American tech giants with big tariffs. Credit: AP\n\nThe federal government has promised to create a News Media Bargaining Incentive to reinforce the News Bargaining Code under which firms such as Meta, Google and Facebook paid Australian publishers including companies such as Nine and News Corporation for use of their content.\n\nMeta has refused to renew deals struck under the Morrison-era bargaining code, and the government unveiled the new incentive to substantially replace it.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/is-australia-s-autism-spike-linked-to-the-ndis-the-evidence-is-in-20250826-p5mpu2.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Is Australia’s autism spike linked to the NDIS? The evidence is in",
        "publish_date": "Tue, 26 Aug 2025 11:33:50 +1000",
        "category": "lifestyle",
        "authors": [
            "Robert Breunig"
        ],
        "text": "Autism rates have been rising around the world, with a sharp increase in prevalence in the last decade. Australia has been no exception.\n\nIndeed, autism diagnoses have risen much faster in Australia than in any other country. In particular, autism diagnoses among children have grown much faster in Australia than in other countries with similar economies and health systems.\n\nAutism diagnoses have risen much faster in Australia than in any other country. Credit: Artwork: Marija Ercegovac\n\nIs this increase in autism diagnosis related to the National Disability Insurance Scheme? The evidence strongly suggests that the answer to that question is yes. We will return to that evidence.\n\nMany things are happening in Australia and in the world that impact autism diagnoses. Diagnostic criteria are changing. Diagnostic substitution is taking place – people are being diagnosed with autism when they would have been diagnosed with something else in the past. There is increasing awareness of autism. There may be genetic and environmental factors which are increasing the prevalence of autism. And, finally, the availability of government support may incentivise people to seek autism diagnoses.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/afl/the-demons-said-good-bye-to-goodwin-should-they-do-the-same-to-petracca-and-oliver-20250826-p5mpt6.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "The Demons said good bye to Goodwin. Should they do the same to Petracca and Oliver?",
        "publish_date": "Tue, 26 Aug 2025 11:33:48 +1000",
        "category": "sports",
        "authors": [
            "Andrew Wu",
            "Jon Pierik",
            "Marc Mcgowan",
            "Scott Spits"
        ],
        "text": "Midfielders Christian Petracca and Clayton Oliver are stars for Melbourne and both have long-term contracts, but that no longer means their respective futures at the club are guaranteed. Credit: Getty Images\n\nSee what went well in 2025, who could be on the move, and something to look forward to in 2026. We’ll publish a new team here every day, so make sure you come back to check them out.\n\nWelcome to our “see you in Bali” wrap, for the teams that are into exit meetings and end-of-season trip plans after falling short of the final eight.\n\nWhat went well: Kysaiah Pickett graduated from a star goalsneak to a game-breaking midfielder/forward who now rivals skipper Max Gawn as the club’s best player. Despite their troubles, the Demons secured Pickett’s prized signature in a huge coup, keeping him in the red and the blue until the end of 2034 on a lucrative contract.\n\nGawn was again a colossus, talking through action on the field and becoming their spokesperson for almost every crisis off it.\n\nKysaiah Pickett and Max Gawn were the shining lights for Melbourne in 2025. Credit: Getty Images\n\nRebounding defender Jake Bowey has taken the next step to become a driver of the team while Harvey Langford, the No.6 pick in last year’s draft, is the Demons’ next A-grade midfielder after making a seamless transition to senior football.\n\nVeteran forward Jake Melksham, with 33 goals from 18 games, earned himself another contract, which was confirmed by the Demons just days after their season ended.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/australia-news-live-at-least-20-killed-in-twin-gaza-strikes-10-million-telco-clampdown-looming-20250826-p5mprx.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Australia news LIVE: Australia Post temporarily suspends US deliveries; at least 20 killed in twin Gaza strikes",
        "publish_date": "Tue, 26 Aug 2025 11:33:31 +1000",
        "category": "finance",
        "authors": [
            "Daniel Lo Surdo"
        ],
        "text": "Coles has reduced the volume of groceries lost to shoplifting but staff are continuing to face threatening situations as retailers around the country grapple with an industry-wide issue of theft and organised crime.\n\nChief executive Leah Weckert said that stock-loss volumes had fallen back down to 2015 levels after rolling out theft-prevention measures such as camera monitoring (“skip scan”), automated security gates (“smart gates”) and “bottom of trolley” technology in hundreds of stores.\n\nColes chief executive Leah Weckert. Credit: Arsineh Houspian\n\n“During that period, as we have improved on loss, the market has not,” said Weckert.\n\n“Despite the investments that we’ve made in safety initiatives for our team, we are continuing to see increases in threatening situations in store. And it is definitely the case that in Victoria, retail crime is escalating more than what we are seeing in other states.”\n\nRetailers are increasingly coming forward to call out the worsening issue as punching a hole in sales and putting the safety of front-line staff at risk.\n\nDan Murphy’s and BWS has implemented body-worn cameras and augmented technology to help train staff, while Rebel Sport’s margins have been dented by the persistent thievery.\n\nLiquor merchants Dan Murphy’s and BWS say they are grappling with organised theft. Credit: Louie Douvis\n\nColes Group sales rose 3.6 per cent to $44.35 billion, with underlying net profit rising 3.1 per cent to nearly $1.2 billion. Its grocery business grew sales by 4.3 per cent to nearly $40 billion as Coles focused on fewer, deeper promotions and locked in everyday low prices on a broad range of products during the year.\n\nWeckert said a focus on quality, value for money, availability and customer experience improved customer-experience metrics, resulting in bigger basket sizes and numbers of transactions. Investors also celebrated the result, sending Coles’ share price 8.1 per cent higher.\n\nAs interest rates fall, the supermarket chief is watching to see how cost-conscious customers will respond, with behaviours like cutting back on treats, cross-shopping and using loyalty points currently still “in play”.\n\n“I think we’re seeing those green shoots around sentiment. The question is going to be: when do we start to see some of the behaviour change and catch up with that? The timing on that is a bit unclear on this,” Weckert told reporters on Tuesday morning.\n\n“As we head into the summer months and we head into Christmas, that will be something we’ll keep a strong eye on because I think that will be the pull for customers to start to return to some of their behaviours around going out a bit more and catching up with friends at the park or at a restaurant.”",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/afl/four-men-charged-after-brownlow-medal-betting-probe-20250826-p5mpuf.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Four men charged after Brownlow Medal betting probe",
        "publish_date": "Tue, 26 Aug 2025 11:31:30 +1000",
        "category": "sports",
        "authors": [
            "Jon Pierik"
        ],
        "text": "Police have charged four men, including a former AFL umpire, with various offences as part of the sports integrity investigation into irregular betting on the 2021 and 2022 Brownlow Medal counts.\n\nIn November 2022, former AFL umpire Michael Pell was arrested after allegedly leaking Brownlow Medal votes from specific matches of the 2022 season in one of the most serious integrity scandals to hit the league. The investigation then widened into the 2021 season, when Pell was an emergency umpire.\n\nField umpire Michael Pell was one of four men arrested in a police investigation into suspicious Brownlow betting. Credit: The Age\n\nThe field umpire was one of four men arrested over suspicious Brownlow betting that was flagged to the AFL by one of its betting partners. This led to an investigation in which multiple agencies discovered irregularities in betting on who would poll the maximum three votes in some games.\n\nIn a statement released on Tuesday, a 35-year-old Reservoir man was charged with 53 offences in relation to wagering on the 2021 and 2022 Brownlow Medal counts, including undertaking a course of conduct to use corrupt conduct information for betting purposes, undertaking a course of conduct to obtain financial advantage by deception, use of corrupt conduct information for betting purposes, communicate information and use of corrupt conduct information for betting purposes.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/culture/dance/your-failures-are-just-as-important-as-your-successes-20250721-p5mgog.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘Your failures are just as important as your successes’",
        "publish_date": "Tue, 26 Aug 2025 11:30:00 +1000",
        "category": "entertainment",
        "authors": [
            "Cassidy Knowlton"
        ],
        "text": "When Rings first reached out two years ago, Sibosado said he was busy, but that he’d come back to her in a few months. She’s very glad he did. “He said, ‘Let’s have a chat. I’m not sure what this would be like, but how about you come up to Lombadina and see my Country, and we’ll go from there’. So I went to Lombadina and met his elders and the leaders in this community. And we talked about who I was, what I wanted to do, Bangarra – you know, not everyone has seen or knows Bangarra, when you live in a community.” Cured trout at Yarra Botanica Credit: Chris Hopkins Bangarra has a cultural and creative cycle to ensure that at every stage of a work’s development, the company is working with community and has consent and permission from the people whose stories they are telling. Having secured permission from the elders in Sibosado’s community, Rings returned to Lombadina in February of this year with lighting designer Damien Cooper, set designer Charles Davis and composer Brendon Boney. They woke with the sun and spent their days learning from the land. “It’s being guided through that Country and given that insight. And really changing your observation from your city eyes to having bush eyes, which takes a couple of days. And not listening, not seeing and listening with the head, but it has to come from an internal feeling that’s a different experience altogether.”\n\nShe says the entire process in Lombadina took about a week. Was there pressure to deliver in that short time, I asked her? “Absolutely!” Bangarra Dance Theatre’s production Illume. Credit: Daniel Boud But she’s been preparing for this kind of creative endeavour her entire life. “I knew what I wanted to be when I was five years old,” she says. “Dance is my first language. I was a dreamer, an imaginer, and would be found in the backyard creating my own world, creating these theatrical productions.” The first professional production she ever saw was Cats at Sydney’s Theatre Royal as a year 11 HSC dance student. “It was transformative and confirmed that that’s the direction that I wanted to go,” she says. “It was fascinating for me that you could take people on a journey just through the movements of the body, through this language of movement.”\n\nWhen she arrived at NAISDA at the age of 17, she initially wanted to do ballet. “But I found out pretty quickly that that ship has sailed,” she says. That was disappointment number one, the first of several key setbacks that made her the dancer and artist she is. She refocused her attention from ballet to modern dance and forged a connection to her Indigenous heritage through the medium. “What I saw at NAISDA was that you could express your identity, or your challenges, or the complications of being a First Nations young person trying to find themselves and balancing lots of different issues.” Frances Rings’ latest work is a collaboration with a visual storyteller, the first in Bangarra’s history. Credit: Chris Hopkins Rings found NAISDA transformative not just culturally and artistically, but also politically. “We turned up in 1988, the year at the Bicentenary ... Carole Johnson [NAISDA and Bangarra founder] came in with the other leaders of NAISDA at the time said, ‘There’s a big march going on, we’re cancelling classes. We’re all heading to Redfern. We’re marching to Hyde Park’.” Stephen Page worked with NAISDA students on a Bangarra production while Rings was at the school, and she desperately wanted to be cast in it. She wasn’t. Disappointment number two.\n\n“I was devastated,” she admits. “And I thought, I’m just going to use this disappointment as a motivation to just keep working and set some new goals.” Baked scallop at Yarra Botanica Credit: Chris Hopkins When she graduated she auditioned for Bangarra to join the company and was put on a traineeship. “Stephen was very strict, and it was, ‘you’re a trainee, so you should just watch, take in what these senior artists and cultural leaders are going to teach you’. “As a graduate, you’re feeling on top, and then you drop to the bottom again. It was extremely humbling to be in that kind of environment where you have to listen, you have to observe, you have to wait, you’ve got to be patient.” Rings was patient – to a point. But she really wanted to get out on stage. Her big break came in Melbourne, where the company was performing at the Arts Centre. But it also came with disappointment number three.\n\n“I was understudying some of the roles from Praying Mantis Dreaming, Stephen’s first full-length work, and one of the dancers got injured. It was a matinee, and Stephen said, ‘You’re on. This is it’. And he said, ‘Do you know it?’ I said, ‘Yeah, I think so’. We had no videos back then, so I was learning it backstage. It was a big learning experience – you’ve got to be ready to go when he says go.” Terrified backstage, Rings threw up a few times, and then it was showtime. “I went on stage, forgot all the choreography, made up my own choreography. When I came off-stage, I was just beside myself. I thought, ‘oh my God, Sis, you don’t have a job any more’.” But Page was impressed that she’d covered so well. “He let me have it, like, what was that? So I got a big dressing down. But [he also said], ‘well, you got on and you kept going and you covered it. So you’re lucky that you still have a job’.” She never did that again, always making sure she truly knew every part in the show. “It was learning by falling over and getting back up again. And I felt like I did that my whole life.”\n\nNow that she’s the artistic director of the company, she makes sure she pays plenty of attention to the understudies. “When I’m holding rehearsals and I see the dancers, and I always watch on the side who’s understudying, who’s covering, and I’ve got my list in front of me. I know who’s supposed to be doing which role, and if I see that they’re not, I could pull them to the side and say something, but it’s a lesson a dancer needs to learn on their own journey.” Loading Mentorship is a hugely important part of what she does with Bangarra, and Rings says she wants her up-and-coming dancers to learn the lessons she did – though perhaps not to invent their own choreography on stage. “They’d be like, ‘well, you did it!’” she laughs. Her dancers all know the story, and yes, they all think it’s hilarious.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/nsw/the-fix-for-this-contaminated-sydney-park-was-called-cheap-and-shoddy-it-went-ahead-anyway-20250813-p5mmk9.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "The fix for this contaminated Sydney park was called cheap and shoddy. It went ahead anyway",
        "publish_date": "Tue, 26 Aug 2025 11:30:00 +1000",
        "category": "finance",
        "authors": [
            "Daniel Lo Surdo"
        ],
        "text": "The parkland promised to locals at a heavily polluted Sydney interchange hangs in the balance, with its interim management plan failing to win the support of the state’s senior chemicals and radiation adviser.\n\nThe last of 50 passive gas vents was installed at the St Peters Interchange last year, in a bid to avoid the build-up of contaminated gas while a long-term fix for the area that was formerly a landfill but now earmarked as public parkland is finalised.\n\nParkland promised to locals at the St Peters Interchange has been closed for several years, with no opening date in sight. Credit: Sam Mooy\n\nChris Burton, the senior technical adviser at the Environment Protection Authority, refused to endorse the site auditor’s call to install the vents, remarking that it was a “slightly poorer, albeit cheaper outcome” that, while viable, would not deal with the source of contaminated gas and potentially deepen pollution issues in years to come.\n\n“They propose to install passive vent stacks on these service pits rather than deal with the source of the gas,” Burton wrote to EPA colleagues in correspondence obtained by the Herald.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/politics/federal/auspost-suspends-business-parcel-shipments-to-us-in-tariff-fallout-20250826-p5mpso.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘Utterly insane month’: Australia Post suspends business parcel shipments to US in tariff fallout",
        "publish_date": "Tue, 26 Aug 2025 11:26:42 +1000",
        "category": "finance",
        "authors": [
            "Nick Newling",
            "David Swan"
        ],
        "text": "Australia Post has suspended shipping most parcels to the United States days before President Donald Trump’s latest round of tariff changes hit low-value items that had been exempt.\n\nTrump signed an executive order last month imposing tariffs on goods worth less than $US800 ($1230), beginning on August 29.\n\nAustralia Post on Tuesday suspended service on business parcels to the US until further notice, as the executive order means senders will need to pre-pay the tariffs before their parcels arrive in the US. This has caused havoc for global postal services that do not have their own technology to collect the money and send it to the US government.\n\n“We are disappointed we have had to take this action, however, due to the complex and rapidly evolving situation, a temporary partial suspension has been necessary to allow us to develop and implement a workable solution for our customers,” Australia Post executive general manager Gary Starr said in a statement.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/afl/crows-pies-face-huge-selection-calls-the-players-from-each-afl-finals-team-in-a-race-to-be-ready-20250825-p5mppo.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Huge Hawks boost: The players from each AFL finals team in a race to be ready",
        "publish_date": "Tue, 26 Aug 2025 11:25:25 +1000",
        "category": "sports",
        "authors": [
            "Peter Ryan"
        ],
        "text": "Positive scan results have put Hawthorn’s Josh Weddle in the frame to play finals as he recovers from a back injury that has kept him out since round 16.\n\nThe running defender has been in modified training and could play with the Box Hill Hawks in this week’s VFL qualifying final against Southport to prove his fitness for the elimination final.\n\nJosh Weddle is awaiting scan results to determine whether he will play finals Credit: AFL Photos\n\nHarry Morrison will have recovered from a quad injury to be available for selection and Mitch Lewis is expected to recover from the corkie that saw him subbed out of the final round match against the Brisbane Lions.\n\nRachele touch and go for qualifying final",
        "source": "TheAge"
    },
    {
        "url": "https://au.news.yahoo.com/auspost-halting-key-services-today-220114335.html",
        "title": "AusPost suspends post to US in huge move",
        "publish_date": "2025-08-26T01:13:49Z",
        "category": "finance",
        "authors": [
            "Blair Jackson"
        ],
        "text": "AusPost suspends post to US in huge move\n\nAustralia Post is suspending several services to the US in response to the Trump administration’s tariffs.\n\nThe government-owned agency announced the huge shift on Tuesday morning, saying many other countries’ state-owned carriers have done the same.\n\n“As a result of recently announced changes to import tariffs for postal items sent to the US and Puerto Rico, Australia Post will temporarily partially suspend postal services to the United States and Puerto Rico, effective 26 August, 2025 until further notice,” the notice says.\n\n“This response is in line with action taken by numerous postal operators internationally.”\n\nADVERTISEMENT\n\nAustralia Post parcel and post executive Gary Starr said US Customs and Border Protection had only just alerted postal agencies to the change.\n\n“Australia Post is focused on providing a reliable and competitive postal service for customers sending parcels internationally.\n\n“Guidance from CBP has only recently been issued and, like more than 190 other postal providers, we’ve been working at pace to find a solution,” Mr Starr said.\n\nAustralia Post has partially suspended services to the US “until further notice”.\n\n“We are disappointed we have had to take this action, however, due to the complex and rapidly evolving situation, a temporary partial suspension has been necessary to allow us to develop and implement a workable solution for our customers.\n\n“Australia Post continues to work with US and Australian authorities and international postal partners to resume postal service to the US as a priority.”\n\nADVERTISEMENT\n\nThe national postal services of New Zealand, Belgium, Britain, Denmark, France and India have made the same service suspensions.\n\nThe US government is requiring prepayment of tariffs prior to an item’s arrival, and has scrapped the tariff exemption on inbound goods under $US800 ($A1230).\n\nAccording to data from US Customs and Border Patrol, 1.36 billion packages were sent to the US in 2024 under this exemption.\n\nThe White House says scrapping the $US800 tariff-free threshold would curb the supply of illicit drugs. Picture: NewsWire / Jim Watson / POOL / AFP\n\nAn Australian government spokesperson said: “The United States’ decision to remove exemptions from tariffs and duties for low value imports is disappointing and will only drive up costs for American families and small businesses.\n\n“The Albanese government will work with Australia Post to limit disruption for affected customers while they make adjustments to comply with new requirements.\n\n“We continue to advocate for the removal of all tariffs on Australian exports, in line with our free trade agreement.”\n\nADVERTISEMENT\n\nThe parcel suspension applies to Business Contract, MyPost Business and retail customers.\n\nGifts under $US100 ($A154), letters and documents are unaffected by the change.\n\n“Australia Post is working with Zonos, an authorised US Customs and Border Protection (CBP) third-party provider, to offer a solution that will, once launched, allow services to resume for Business Contract and My Post Business customers,” the notice reads.\n\n“These customers will receive communications from Australia Post on what they need to do next to be ready for when this solution goes live.”\n\nThe Australia Post alert was issued on Tuesday and is effective immediately.\n\nThe change, effective immediately, affects business customers. Picture: NewsWire / Gaye Gerard\n\n“Postal goods sent to the US and Puerto Rico lodged on or after 26 August 2025 will not be accepted by Australia Post until further notice.”\n\nOpposition small business spokesman, Tim Wilson, said Australia Post’s suspension was “very concerning”.\n\nADVERTISEMENT\n\n“A lot of small businesses depend on Australia Post to ship small goods internationally,” he told Sky News.\n\n“Small businesses are going to be the ones most impacted by this decision.”\n\nMr Wilson put the onus on the government and diplomatic corps to try and find a solution.\n\n“We need government to engage. I suspect (US ambassador) Kevin Rudd is going to be off to the White House or Congress pretty quick smart, because we need to make sure this relationship is sorted.”\n\n“The last time the Albanese government said they had a relationship with another country sorted, it was Israel, and we’ve seen where that’s gone.”\n\nOn July 31, President Donald Trump issued an executive order confirming Australian goods into the US would be subject to a 10 per cent tariff.\n\nThis 10 per cent levy is under Trump’s “reciprocal tariffs” umbrella, despite Australia and the US having a free-trade agreement.\n\nThe 10 per cent duty is separate to the industry-specific, 50 per cent Trump administration tariffs on Australian steel, aluminium and copper imports - these levies remain.\n\nAnnounced on July 30, President Trump’s executive order says ending the under-$US800 “de minimis” exemption would shield the US public from drugs.\n\n“ … closing the catastrophic loophole used to, among other things, evade tariffs and funnel deadly synthetic opioids as well as other unsafe or below-market products,” a White House statement reads.\n\n“The de minimis exemption has been abused, with shippers sending illicit fentanyl and other synthetic opioids, precursors, and paraphernalia into the United States in reliance on the lower security measures applied to de minimis shipments, killing Americans.”\n\nThe President’s One Big Beautiful Bill Act repealed the legal basis of the de minimis exemption.",
        "source": "Yahoo"
    },
    {
        "url": "https://au.news.yahoo.com/why-cashless-gaming-trial-failed-010321295.html",
        "title": "Why cashless gaming trial ‘failed’",
        "publish_date": "2025-08-26T01:03:21Z",
        "category": "finance",
        "authors": [
            "Nathan Schmidt"
        ],
        "text": "A trial of cashless gaming machines in one state failed because ‘punters don’t governments in general’. Picture: NCA Newswire / Gaye Gerard\n\nA 12-month trial of cashless gaming machines in NSW failed because of a lack of trust from patrons in “governments in general”, a budget estimates hearing has been told.\n\nOnly 14 patrons out of the 243 who signed up were deemed “genuine active users” as part of the state trial, slammed by Premier Chris Minns as largely “ineffective”.\n\nGaming Minister David Harris told estimates on Tuesday uptake of machines was low because “fundamentally, the punters don’t trust governments in general”.\n\n“What the Premier refers to - and is correct - is that the uptake from the public was low, and it was low for a whole range of reasons,” Mr Harris said.\n\nADVERTISEMENT\n\n“They don’t trust the people having possession of their personal details, and that’s what makes this complex.\n\nPremier Chris Minns said the 12-month cashless gaming trial was largely “ineffective”. Picture: NCA Newswire / Gaye Gerard\n\n“So, whatever system we put in place, we have to address those issues, and that was really valuable information from the trial.\n\n“But, the Premier is right there in terms of uptake. It showed that this is a difficult question.”\n\nThe state government is yet to respond to the independent Panel on Gaming Reform’s road map published at the end of last year.\n\nThe report urged for an account-based gaming system to be launched in 2027 and mandatory by 2028.\n\nThe mandatory system was necessary to ensure “anti-money laundering and harm minimisation is achieved”, the report stated.\n\nAddressing the report, Mr Harris said there were a “myriad of issues” and that the government was talking to industry while developing its pathway.\n\nADVERTISEMENT\n\n“It’s really important that (the) government gets it correct, that we pull the right levers at the right time,” Mr Harris said.\n\n“We have to look at how technology can help us deal with money laundering and criminal activities in venues.\n\n“And, we also have to be very understanding of the economic issues, particularly in regional NSW and even patterns of regulation.\n\n“So this is incredibly complex. We don’t want to get it wrong.”\n\nAsked if he could give an indication of the government’s direction, Mr Harris said it would be “a final decision for cabinet to make”.\n\nGaming Minister David Harris would not commit to the roadmap being rolled out before the next state election. Picture: Christian Gilles / NewsWire\n\nHe would not commit to the roadmap being rolled out before the next state election.\n\nMr Harris said the state government was still committed to the cashless gaming trial, but that it was not an election commitment to introduce it permanently.\n\nADVERTISEMENT\n\n“We’re looking at the best system that can be implemented in NSW,” he said.\n\nMr Harris described it as a “trial of technology” to examine what the implications would be of a “real-world” rollout.\n\nHe said close to 2500 machines - more than the original 500 - were implemented at more venues than initially intended as part of the trial.\n\nThe report found negative perception of the term “cashless gaming”, and recommended a shift to “account-based gaming”.\n\nMr Harris touted a range of policies implemented by the state government amid continued pressure to implement gaming reform.\n\nHe said 43 per cent of gaming machines had been reduced to a cash limit of $500, down from $5000, since July 2023. The measure was a recommendation of the report.\n\nMr Harris said the government was also examining the potential use of facial recognition as an anti-money laundering measure.",
        "source": "Yahoo"
    }
]