[
    {
        "url": "https://www.9news.com.au/national/warana-sudden-death-man-found-dead-in-home-on-sunshine-coast-police-queensland-news/048d117f-4779-4255-91e3-47eff15384dc",
        "title": "Man, 57, found stabbed to death in Sunshine Coast front yard",
        "publish_date": "Tue, 15 Jul 2025 01:56:58 +0000",
        "category": "sports",
        "authors": [
            "Jul"
        ],
        "text": ": Stay across all the latest in breaking news, sport, politics and the weather via our news app and get notifications sent straight to your smartphone. Available on the",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/gold-coast-wounding-upper-coomera-man-allegedly-attacked-by-intruders-queensland-crime-news/3b9710e5-aced-412d-8dac-6823c33234ce",
        "title": "Man seriously assaulted during Gold Coast home invasion",
        "publish_date": "Tue, 15 Jul 2025 02:00:17 +0000",
        "category": "sports",
        "authors": [
            "Jul"
        ],
        "text": ": Stay across all the latest in breaking news, sport, politics and the weather via our news app and get notifications sent straight to your smartphone. Available on the",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/anthony-albanese-xi-jinping-meeting-beijing-china-port-of-darwin-ownership/8b08fe35-f9c4-4635-8117-ffea3f271f2d",
        "title": "Showdown over Aussie port looms ahead of Albanese, Xi meeting",
        "publish_date": "Mon, 14 Jul 2025 22:20:50 +0000",
        "category": "finance",
        "authors": [
            "Jul"
        ],
        "text": "Prime Minister Anthony Albanese has dismissed concerns that his government's bid to end Chinese ownership of the Port of Darwin could bring blowback from Beijing, as he prepares for a face-to-face meeting with China President Xi Jinping today.\n\nAlbanese will meet the Chinese leader as part of his week-long official visit to the country, during which he has focused largely on tourism and trade and touted his success at re-establishing stable relationships.\n\nBut the prime minister's election commitment to overturn the 99-year lease of the Port of Darwin to Chinese firm Landbridge, which has already sparked consternation in China, could become a sore point, along with other issues such as Australia's stance on Taiwan and Chinese live-fire exercises off the Australian coast.\n\nPrime Minister Anthony Albanese and his fiancée Jodie Haydon arrive in Beijing. (Dominic Lorrimer)\n\nAlbanese yesterday said he did not expect any blowback from the issue.﻿\n\n\"We had a very clear position that we want the port to go into Australian ownership,\" he said.\n\n\"We've been clear about it, we've been orderly about it, and we will go through that process.\"\n\nInternational affairs expert Professor James Curran﻿ also said the idea China might resort to economic coercion on key Australian exports, including iron ore, was \"laughable\".\n\nREAD MORE: Trump drops the hammer on Putin with incredible threat ﻿\n\nThe Port of Darwin is on a 99-year lease to a Chinese company. (9News)\n\n\"I really don't think the Chinese will take that step. We know what China's economic coercion looks like in this country. Unfortunately, it did backfire on China,\" he told Today .\n\n\"They hit us on on six key export industries under the Morrison government. Now all of those are off at the moment.\n\n\"I would have thought that the Chinese do not want to get back into that kind of punitive trade behaviour at this particular time.\"\n\nCurran queried the government's motivation over the issue, saying two previous reviews had concluded there was no serious strategic concern over the Land﻿bridge lease.\n\n\"The sensitivity is twofold. It's about Australia keeping critical infrastructure in Australian hands,\" he said.\n\n\"But I think it's also more about how close this port is to the US Marines that are rotating through Darwin each year.﻿\"",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/reserve-bank-of-australia-wants-to-remove-card-surcharges/6e7688de-6866-4470-b716-d886c0cc229a",
        "title": "Australians could save $1.2b a year under proposed new reform",
        "publish_date": "Tue, 15 Jul 2025 02:04:54 +0000",
        "category": "finance",
        "authors": [
            "Jul"
        ],
        "text": "A﻿ustralians could save $1.2 billion a year on their shopping under a new proposal from the Reserve Bank .\n\nThe RBA today issued a recommendation to ﻿end surcharging on Eftpos, Mastercard, and Visa cards.\n\n\"Consumers currently pay around $1.2 billion in card surcharges each year,\" the bank said in a release.\n\nREAD MORE: Trump drops the hammer on Putin with incredible threat\n\nThe RBA proposes to end surcharges on card payments. (Getty)\n\n\"Surcharging is no longer achieving its intended purpose of steering consumers to make more efficient payment choices: avoiding surcharges has become harder as cash usage has declined, businesses are increasingly charging the same surcharge rate across debit and credit and there are significant challenges with enforcing the current surcharging rules.\n\n\"Removing surcharging would make card payments simpler, more transparent and help to increase competition in the card payments system.\"\n\nHowever, the Australian Restaurant and Cafe Association has been quick to savage the proposal, with chief executive Wes Lambert saying it would mean higher prices for customers.\n\n\"No matter how low merchant fees go based on the RBA's intention to save businesses $1.2 billion, with no surcharging, businesses who previously paid net $0 in merchant fees, will now be faced with the bill,\" Lambert said.\n\n\"The so-called 'savings' to consumers is a mirage.\n\n\"If this ban goes ahead, small businesses will have no choice but to raise prices across the board just to survive.\"﻿\n\nThe surcharge halt was one of several proposals laid out in a consultation paper as part of the RBA's review of merchant card payment costs and surcharging.﻿\n\nREAD MORE: PM brushes off concerns of Chinese retaliation as port showdown looms\n\nThe bank will finalise its proposed reforms after a feedback period. (AFR)\n\nAnother was to require card networks and large acquirers to publish the fees they charge.\n\n\"Improving transparency and competition will help all players better understand the fees they are charged and make it easier for businesses to shop around for a better deal,\" the release said.\n\nThe RBA also called for a lower cap on interchange fees paid by businesses, which could save another $1.2 billion a year.\n\nREAD MORE: Rescued backpacker reveals why she abandoned car\n\n\"Around 90 per cent of Australian businesses are estimated to be better off under the proposed policies,\" the release said.\n\n\"The proposed reductions to interchange caps would benefit small businesses the most, as they tend to pay fees closer to the existing caps. Introducing caps on foreign interchange fees would help to lower fees for all businesses accepting international cards.\"\n\nA feedback window on the proposals is open until August 26 this year, before the reforms are finalised.\n\nView the full consultation paper online here .﻿",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/world/teslas-autopilot-system-is-in-the-spotlight-at-a-miami-trial-over-a-student-killed-while-stargazing/5bc33630-8fcf-48ea-8ca2-94a20e3ad8a9",
        "title": "Tesla denies responsibility after stargazer struck by car on 'autopilot'",
        "publish_date": "Mon, 14 Jul 2025 23:35:13 +0000",
        "category": "finance",
        "authors": [
            "Jul"
        ],
        "text": "A rare trial against Elon Musk 's car company has begun in Miami where a jury will decide if it is partly to blame for the death of a stargazing university student after a runaway Tesla sent her flying 23 metres through the air and severely injured her boyfriend.\n\nLawyers for the plaintiff argue that Tesla's driver-assistance feature called Autopilot should have warned the driver and braked when his Model S sedan blew through flashing red lights, a stop sign and a T-intersection at nearly 110 kilometres an hour in the April 2019 crash.\n\nTesla lays the blame solely on the driver, who was reaching for a dropped cell phone.\n\nTesla has denied responsibility for the fatal crash. (Florida Highway Patrol)\n\n\"The evidence clearly shows that this crash had nothing to do with Tesla's Autopilot technology,\" Tesla said in a statement. \"Instead, like so many unfortunate accidents since cellphones were invented, this was caused by a distracted driver.\"\n\nThe driver, George McGee, was sued separately by the plaintiffs. That case was settled.\n\nA judgement against Tesla could be especially damaging as the company works to convince the public its self-driving technology is safe during a planned rollout of hundreds of thousands of Tesla robotaxis on US roads by the end of next year.\n\nA jury trial is rare for the company, which often settles lawsuits, and this one is rarer yet because a judge recently ruled that the family of the stricken Naibel Benavides Leon can argue for punitive damages.\n\nThe judge, Beth Bloom of the US District Court for the Southern District of Florida, issued a partial summary judgement last month, throwing out charges of defective manufacturing and negligent misrepresentation against Tesla.\n\nBut she also ruled plaintiffs could argue other claims that would make the company liable and ask for punitive damages, which could prove costly.\n\nNaibel Benavides Leon was killed when she was struck by a Tesla. (Supplied)\n\n\"A reasonable jury could find that Tesla acted in reckless disregard of human life for the sake of developing their product and maximising profit,\" Bloom said in a filing.\n\nThe 2021 lawsuit alleges the driver relied on Autopilot to reduce speed or come to a stop when it detected objects in its way, including a parked Chevrolet Tahoe that Benavides and her boyfriend, Dillon Angulo, had gotten out of near Key West, Florida, to look up at the sky.\n\nThe Tesla rammed the Tahoe at highway speeds, causing it to rotate and slam into Benavides, tossing her into a wooded area and killing her.\n\nIn legal documents, Tesla denied nearly all of the lawsuit's allegations and said it expects that consumers will follow warnings in the vehicle and instructions in the owners' manual, as well as comply with driving laws.\n\nTesla warns owners in manuals that its cars cannot drive themselves and they need to be ready to intervene at all times.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/baby-boomers-fastest-growing-demographic-investing-in-cryptocurrency-at-risk-of-scams-personal-finance-news/d689a031-c777-4d74-8550-69d7501a07eb",
        "title": "Baby Boomers now fastest growing group of crypto investors, vulnerable to scams",
        "publish_date": "Mon, 14 Jul 2025 19:40:43 +0000",
        "category": "finance",
        "authors": [
            "Jul"
        ],
        "text": "B﻿aby Boomers are now the fastest growing demographic investing in cryptocurrency but should be mindful of \"cryptoscams\", an expert has warned.\n\nAccording to the latest Independent Reserve Cryptocurrency Index , the number of seniors investing in digital currencies has quadrupled since 2019.\n\nBut as a demographic known to be targeted by scammers, Baby Boomer ﻿investors need to \"do their homework\", founder of Digital Wealth Group Sydel Sierra said.\n\nREAD MORE: One Aussie state looks to add two new public holidays\n\nThe number of seniors investing in cryptocurrency has quadrupled since 2019. (REUTERS / Dado Ruvic)\n\n\"Baby Boomers aren't the largest group of investors but they are the fastest growing,\" Sierra said.\n\n\"A lot of them have only just hit retirement, and that has been the catalyst for a lot of them to reassess where their money is invested.\n\n\"Five years ago, they were probably still working.\"﻿\n\nAlmost a third (31 per cent) of Australian adults own cryptocurrency, the index shows.﻿\n\n﻿The largest group of cryptocurrency investors is 25- to 34-year-olds, at 52.9 per cent.\n\nOver-65s represent just 8.2 per cent, but that number has risen from 2 per cent in the last five years.\n\n\"My advice to seniors is do your homework, and if you're feeling overwhelmed, don't give up, just seek some help from a trusted source, be that a relative, such as an adult child who might've introduced you to crypto, or a professional consultant,\" Sierra said.\n\nAccording to a University of Queensland study, more than $170 million was lost by Australians to cryptoscams in 2023 alone.\n\nMore than a third of those studied ﻿admitted to being \"influenced\" by content online and more than 60 per cent said their first exposure to cryptocurrency was on social media.\n\n\"There's nothing wrong with reading about crypto on Facebook or Instagram but it's important people don't see a single tweet or TikTok video and decide to 'bet the farm' on a random coin,\" Sierra said.\n\n\"You can always 'play it safe' when you first start trading and invest a modest amount in the more reputable coins like Bitcoin, which has still doubled in value in the past 12 months - at least until you feel confident.\n\n\"I would never advise a first timer, whether they're a senior or anyone else, to dabble in high-risk meme coins.\n\n\"My number one recommendation is always maintain custody of your (crypto) keys and wallet - anyone who says they'll manage your money for you, is a huge red flag.\"﻿\n\nThe information provided on this website is general in nature only and does not constitute personal financial advice. The information has been prepared without taking into account your personal objectives, financial situation or needs. Before acting on any information on this website you should consider the appropriateness of the information having regard to your objectives, financial situation and needs.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/donald-trump-tariffs-treasurer-jim-chalmers-response/2eb0ca9c-15c8-4382-9178-470c687fc6f1",
        "title": "Government is 'continuing efforts to engage' with Trump",
        "publish_date": "Mon, 14 Jul 2025 03:11:41 +0000",
        "category": "finance",
        "authors": [
            "Jul"
        ],
        "text": "T﻿he treasurer said the government is attempting to \"engage\" with US officials during the prime minister's visit to China in the wake of fresh tariffs imposed on Mexico and the European Union.\n\nJim Chalmers however could not confirm if any progress has been made in landing a meeting between between Anthony Albanese and Donald Trump to discuss the impact of incoming tariffs or strike a deal.\n\nHe said work was being done behind the scenes in Australia's interest as the global tariff situation rapidly evolves\n\nJim Chalmers could not confirm if any progreess has been made in landing a meeting between between Anthony Albanese and Trump. (AP)\n\n\"There's been no change to our baseline tariffs when it comes to the US, but I think it's clear that every week brings new developments, new uncertainties, and over the weekend we saw more of that,\" Chalmers told media today.\n\n\"We work our way through the consequences for us of these sorts of announcements which come from time to time.\n\n\"When it comes to engaging with the US, we're engaging at a number of levels.\"\n\nChalmers said the PM has had three conversations with Trump.\n\nHowever the government has not been successful so far in confirming a face-to-face meeting six months into the president's second administration.\n\nREAD MORE: One Aussie state looks to add two new public holidays\n\nAlbanese had anticipated talks with the president during ﻿the G7 summit however Trump made a swift departure before any meeting could take place.\n\nThe PM has declined to reveal if or when a rescheduled meeting will occur.\n\nChalmer said the PM has had three conversations with Trump. (AAP)\n\nChalmers made mention of Foreign Minister Penny Wong's ﻿recent visit with US secretary of state Marco Rubio and said he has been speaking with his US counterpart Scott Bessent.\n\n\"We're engaging at a whole range of levels with our American counterparts, but also in China, the G20, really wherever we can,\" he added.\n\nAlbanese has faced backlash as he visits China to meet with President Xi Jinping before a sit-down with Trump.\n\nLiberal MP Aaron Violi criticised the PM for ﻿a lack of focus on Australia's ties with the US.\n\n\"It's such an important area. We need to strengthen that relationship, and that's where a face to face meeting with President Trump is so important,\" Violi said on Today .\n\n\"And it's that the prime minister hasn't achieved that yet, and he needs to get there as soon as he can.\"\n\nVioli accused the PM of \"doing terribly\" as he juggles alliances with two superpowers.\n\n\"[It's] his fourth meeting with Xi Jinping. And how many has he had with Donald Trump?\" Violi added.\n\n\"He's yet to secure a face to face meeting with the US president. And the US president has every right to question Australia's alliance this morning,\"\n\nPrime Minister Anthony Albanese during a press conference at the Trip.com Group HQ in Shanghai, China. (Dominic Lorrimer)\n\nTrump imposed a 10 per cent baseline tariff on most imported goods from April 5.\n\nThe president yesterday announced 30 per cent tariffs﻿ against Mexico and the EU beginning August 1.\n\nThey are part of an announcement blitz by Trump of new tariffs aimed at allies and foes, which formed the bedrock of his 2024 presidential campaign.\n\nTrump in April imposed reciprocal tariffs on dozens of countries, before pausing them for 90 days to negotiate individual deals.\n\nThese tariffs are also now due to take effect on August 1.",
        "source": "9News"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-15/boland-best-bowler-in-100-years-hat-trick-skittles-west-indies/105532846",
        "title": "Boland has best average in 100 years after hat-trick skittles West Indies",
        "publish_date": "Tue, 15 Jul 2025 01:43:10 +0000",
        "category": "sports",
        "authors": [],
        "text": "Scott Boland could lay claim to being Australia's unluckiest ever cricketer after adding a Test hat-trick to a magical late-career surge since his famous 2021 Boxing Day debut.\n\nStatistically the best Test bowler in more than 100 years, Boland became just the 10th Australian man to take a hat-trick.\n\nHis haul on Monday (Tuesday AEST) in Jamaica came on a record-breaking day for the tourists, who bowled West Indies out for just 27 to wrap up a 176-run win and 3-0 sweep of the Frank Worrell Trophy.\n\nMitchell Starc was the chief destroyer with 6-9 up front, but Boland again vindicated the selectors' call to go with four quicks and leave out a fit Nathan Lyon for the first time in 12 years.\n\nTest hat-tricks by Australians Fred Spofforth vs England, Melbourne 1878-79\n\nHugh Trumble vs England, Melbourne 1901-02\n\nHugh Trumble vs England, Melbourne 1903-04\n\nJimmy Matthews vs South Africa, Manchester 1912 (1st innings)\n\nJimmy Matthews vs South Africa, Manchester 1912 (2nd innings)\n\nLindsay Kline vs South Africa, Cape Town 1957-58\n\nBetty WIlson vs England, Melbourne 1958\n\nMerv Hughes vs West Indies, Perth 1988-89\n\nDamien Fleming vs Pakistan, Rawalpindi 1994-95\n\nShane Warne vs England, Melbourne 1994-95\n\nGlenn McGrath vs West Indies, Perth 2000-01\n\nPeter Siddle vs England, Brisbane 2010-11\n\nRene Farrell vs England, Sydney 2011\n\nScott Boland v West Indies, Kingston 2025\n\n\n\nBoland's inclusion also allowed him to join Glenn McGrath as the only paceman to play for Australia after his 36th birthday in the last 60 years.\n\nIn Australia's 39 Tests since his 2021 debut, Boland has played just 14 of them for a hat-trick, 6-7 on debut in 2021 and 10-wicket match haul in Sydney last summer.\n\nAll of it prompting Starc to label the seamer \"one of the unluckiest men to ever wear the baggy green\".\n\n\"He's such a fantastic bowler. He's always preparing to play and when he's had his opportunities, he's on the money,\" Starc said.\n\n\"[Boland is] a world-class bowler, we saw that again this week. Every chance he gets to pull on that baggy green, he plays his role so well.\n\n\"He's taking wickets and things happen so quickly for Scotty. To get a hat-trick was awesome to see.\n\n\"He downplayed that as well like it was just any other wicket. But I'm sure we'll enjoy a cold drink to celebrate that.\"\n\nWhen Boland's next Test will come remains unclear.\n\nSelectors have repeatedly shown that Starc, Josh Hazlewood and Pat Cummins maintain top billing in Australia's squad, with Boland only picked ahead of any of them once.\n\nThe final three Tests of this summer's Ashes will be played over a 23-day window, potentially opening the door for the Victorian to come in if one of the big three are rested.\n\nOtherwise he could be forced to wait again, despite having the seventh-best bowling average in Test history with 16.53, and the best of any bowler in the past 100 years.\n\nBoland has been close to hat-tricks before, but nailed his execution in Kingston when he took the top of Jomel Warrican's off stump.\n\nHe had previously discarded Justin Greaves and Shamar Joseph, edging the former off before having Joseph trapped LBW on review.\n\n\"Today was three classic Scotty Boland wickets,\" Cummins said.\n\n\"Three right at the stumps or not far away. Really happy for him.\n\n\"He has spent a lot of time running the drinks in the past year or two when the other guys are fit, but he is always quality when he comes in.\"\n\nAAP",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-15/west-indies-abysmal-against-australia-in-test-sweep/105525960",
        "title": "Abysmal, unfair, angry and upset: Aussies leave West Indies cricket in tatters",
        "publish_date": "Tue, 15 Jul 2025 01:31:04 +0000",
        "category": "sports",
        "authors": [],
        "text": "West Indies cricket has been shell-shocked by an unprecedented capitulation to end the Test series against Australia in a 3-0 loss on home soil.\n\nIn a trio of contests dominated by the bowlers from day one, the hosts were skittled for just 27 runs on day three in Kingston, barely 10 per cent of the way to a 204-run victory target that now seems fanciful.\n\nAfter reducing Australia to 6-99 under lights on day two, fast bowler Shamar Joseph backed his team to chase anything under 200. He and Alzarri Joseph did their best, taking 4-22 in the first hour of play to bowl the Aussies out for just 121, but Alzarri was batting again before the end of the session as the West Indies batters were blown away by Mitchell Starc's record five-wicket haul.\n\n\"Abysmal comes to mind,\" 2016 T20 World Cup hero Carlos Brathwaite said with his former team 6-22 at tea after just 10 overs.\n\n\"Unfair comes to mind; the fast bowlers have to bowl and bat as well. This is a tough one to summarise.\"\n\nIt was a painful thud back down to earth for the former Caribbean powerhouse, whose bowling efforts on night two were equated to the glory years of Marshall, Holding, Garner, Ambrose and Walsh.\n\nStarc and Boland power Australia to massive win Photo shows Mitchell Starc smiles with captain Pat Cummins after winning the third Test against West Indies. Scott Boland takes a first hat-trick as Mitchell Starc's record-breaking six-wicket haul sends Australia sprinting towards victory in the third Test in Jamaica.\n\nBut even more recently, the famous victory at the Gabba in January last year felt like a lifetime ago in the wash-up of the Sabina Park smash-up.\n\nOn that day in Brisbane, Carl Hooper shed tears of joy in the ABC Sport commentary box as a 24-year-old Shamar Joseph bowled the team to a glorious win.\n\nSixteen months later, the 102-Test veteran was calling for heads to roll after a year of questionable changes and a day of \"schoolboy\" errors.\n\nHooper said opener Mikyle Louis (7 and 4) did not know where his off stump was and debutant Kevlon Anderson (3 and 0) looked like a walking wicket from the moment he reached the middle.\n\n\"They didn't even fire a shot,\" he told ABC Sport.\n\n\"At least do something. You didn't even see adjustments being made. You see, one after the other, guys being hit on the pad or bowled.\n\n\"What are they doing [in the sheds]? Are they talking about it? This is basic schoolboy stuff. I can't tell you how disappointed I am to see how meekly we folded.\"\n\nIn January, the West Indies travelled to Pakistan and drew the series there, but since then the team has been overhauled, with Justin Greaves and Jomel Warrican the only players from the second Test in Multan to also play in Kingston.\n\nOpener Mikyle Louis was recalled in place of former captain Kraigg Brathwaite but fared no better. (AP: Ricardo Mazalan)\n\nKraigg Brathwaite was replaced as captain by Roston Chase and ultimately dropped for this third game, while Test coach Andre Coley was supplanted by Daren Sammy.\n\nThe pair were given their posts — Coley leading the Test team, Sammy in charge of T20s and ODIs — in May 2023, but a \"strategic reshaping\" not 18 months later saw Sammy take over across all formats.\n\n\"Cricket West Indies, I really think a few heads should roll for this because they've made some decisions and this is the result of those decisions,\" Hooper said.\n\nQuick hits from the third West Indies Test Photo shows Mitchell Starc, Cameron Green and Sam Konstas Starc's stunning spell helps Australia forget about a horror start to day three, although Konstas's fielding briefly halts the party. Here are the quick hits from the third and final Test in Jamaica.\n\n\"They've made some wholesale changes, massive changes, that I think wasn't needed. … To make wholesale changes and then get results like this, Cricket West Indies have got to hold up their hands and be held accountable.\"\n\nThe former captain said he was \"angry and upset\" as he watched the team crumble. He called for the return of Coley and the likes of Kavem Hodge and Alick Athanaze in an admission from the administration that it got it wrong.\n\n\"What we've done for the last two or three years in trying to build something has just sort of gone up in flames today,\" he told News Breakfast.\n\nWhile 27 all out was obviously a catastrophic series finale, the batting throughout the series was woeful, with the hosts only passing 200 in one of six innings and failing to reach 150 four times.\n\n\"It's heartbreaking to be in a position like that where we think we could have won the game and then come out and have that poor batting display, but it's something that's been occurring for the whole series,\" captain Chase said.\n\nBrandon King's 75 in the first innings of the second Test marked the only time a West Indian batter passed 50 across the three Tests, with that one knock accounting for more than half of his 129 runs for the series.\n\nKing led his team in scoring and was the only local batter to average more than 20 (21.50) for the series, but was still out-scored by four Australians despite the tourists' batting also leaving much to be desired.\n\nThe lack of West Indians among the batting leaders is made more stark in contrast to Shamar Joseph's 22 wickets putting him seven clear of player of the series Starc in second place, while Alzarri Joseph and Jayden Seales had 13 each, comparing favourably with Josh Hazlewood's 14 and eclipsing Pat Cummins's eight.\n\n\"It's quite easy to assess: the bowlers kept us in the series all series long and the batting never really showed up,\" Chase said.\n\n\"We need to take a deep look at ourselves as batters and see where we can improve and put 300-run totals on the board.\"\n\nThe West Indies have not won a Test series on home soil in three years and face arguably the toughest challenge in cricket next, travelling to India for a two-Test tour, in October.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-15/lena-dunham-too-much-girls-creator-returns-meg-stalter-rom-com/105523190",
        "title": "Lena Dunham is back with a new series. Here's why she's so divisive",
        "publish_date": "Tue, 15 Jul 2025 00:32:54 +0000",
        "category": "entertainment",
        "authors": [],
        "text": "A year or so ago, I was hanging out with two friends when one of them started raving about this obscure series she'd just stumbled on — Girls.\n\n\"And did you know one of them actually wrote the show?\" said Gen Z friend continued. \"Maybe it was Hannah?\"\n\nI wordlessly locked eyes with my other friend, a fellow millennial, as we came to the shocking realisation that a key piece of our history had already been forgotten.\n\nThe unflinching early 2010s comedy-drama, which Lena Dunham wrote, directed and starred in, followed four 20-something white women as they struggled to form meaningful relationships while trying and failing to make it in New York City.\n\nHannah (Dunham), Marnie (Allison Williams), Jessa (Jemima Kirke) and Shoshanna (Zosia Mamet) were each distinct but ultimately of the same ilk: privileged, mediocre, cringeworthy and incapable of seeing themselves accurately.\n\nOver six seasons, Girls attracted rave reviews and intense scrutiny, but my friend's oblivious TV recommendation made one thing clear: this new generation didn't view Girls with the same lens we were forced to look through.\n\nIn the first episode of Girls, Hannah (left, played by Dunham) tells her parents she may be the voice of her generation, before downgrading it to \"a voice of a generation\". (Supplied: IMDb)\n\nThey didn't see Dunham's rise and fall from grace in real time.\n\nThey could simply watch her most famous creation today and see it, completely separated from the artist, as a genius satirical representative of millennial narcissism and post-2008 recession malaise.\n\nTo mark Dunham's return to scripted TV with her new show Too Much, we look back at how she, for better or worse, became the voice of a generation.\n\nThe critical acclaim\n\nGirls premiered in April 2012 to rave reviews heralding Dunham as a wunderkind.\n\nJessica Ford, a senior lecturer in media at the University of Adelaide who has written extensively on the show and Dunham, says it was \"a watershed moment in American television\".\n\n\"A lot of people responded to seeing a version of millennial, urban life on screen that wasn't aspirational like Sex and the City,\" she says.\n\n\"I think the appeal was that it was mundane and lowkey in its approach, and deeply ironic; it was both portraying these characters and critiquing them.\"\n\nGirls launched many a career beyond Dunham's, including that of Adam Driver (right), who played Hannah's on-again-off-again boyfriend Adam. (Supplied: IMDb)\n\nImelda Whelehan, professor emeritus at the University of Western Australia who specialises in popular culture and feminism and co-edited a 2017 collection of essays about Girls, agrees.\n\n\"There were interesting vignettes of good and bad relationships, and how they don't stay the same,\" she says.\n\n\" [Girls] also picked up on issues common to feminists for a long time around the 'ideal' feminine body, the way women are perceived, and it broke through conventions around depictions of women. \"\n\nThe backlash\n\nDespite rave reviews and soaring ratings, Dunham and her TV show were loathed as much as they were loved in the 2010s.\n\nFrom its first season, Girls fielded criticism over its lack of racial diversity — which its creative team defended.\n\nDr Ford thinks this critique was valid, \"considering this was a show set in New York\".\n\nBut, she quips: \"The idea we want Lena Dunham to write Black people should have been refuted with that whole 'Donald Glover [as a Republican]' storyline, which proved she's not the right person to write those stories.\"\n\nAnd Professor Whelehan says there were plenty of people who felt \"confronted by the way Dunham performed Hannah [and what some saw as] her 'random acts of nudity'\".\n\n\"People were also vexed by the portrayals of sex and the idea that all the characters were unlikeable and obsessively focused on themselves, even though it was very knowingly doing that,\" she adds.\n\nBut perhaps the series' biggest sticking point was its creator.\n\nDunham has since described her initial one-and-a-half page pitch for Girls as \"pretentious and horrifying\". (Supplied: IMDb)\n\nDunham, who had pitched Girls as a semi-autobiographical series aged just 23, was conflated with her obnoxious character Hannah from the moment the series started airing.\n\n\"For so long, people were, like, 'You are Hannah. Hannah is you.' They had no sense that there was any level of satire in it,\" Dunham told The New Yorker last year.\n\nDr Ford says this is something we've long been trained to do as audiences: \"I Love Lucy is the proto example — we've been doing this for 70-odd years.\"\n\nBut she thinks it was particularly fervent when it came to Dunham: a young woman telling a version of her own niche story. She was increasingly perceived as over-hyped, over-privileged, and the spokesperson for women no-one asked for as a result of her show's generic name.\n\nIt became more of a problem as Dunham started attracting bad press.\n\nProfessor Whelehan says women who write stories like Dunham \"are seen often as spewing out their lives, but that's not what's happening, and that undermines [their] work\". (Supplied: IMDb)\n\nAn incident with her sister, recounted in Dunham's 2014 memoir Not That Kind of Girl, was interpreted as child abuse. Dunham rejected this. Then, in 2017, she accused a woman of lying about being raped.\n\nProfessor Whelehan and Dr Ford say the conflation of Hannah and an increasingly tactless Dunham meant the satire of Girls was lost.\n\n\"It was taken at face value instead of as an experimentation of thinking through the limitations and the problems with being a white woman in that era,\" Dr Ford says.\n\nBoth experts think misogyny had something to do with this — though neither of them excuse the things Dunham has said or done.\n\nThe resurgence\n\nAround the time that Gen Z friend of mine started watching Girls for the first time, a whole bunch of other people were consuming it too.\n\nA spokesperson for HBO told The New York Times Girls' viewership doubled between November 2022 and January 2023 compared with the previous three months.\n\nNew audiences see Marnie's (pictured) infamous cover of Kanye West's 'Stronger' in a different light to Girls' original viewers. (Supplied: IMDb)\n\nLoading Instagram content\n\nRecap podcasts started cropping up, from Girls Room to Girls Rewatch, and the discourse shifted online.\n\nGirls was no longer a love-hate watch, but a series to unironically enjoy. Hannah and Marnie weren't cringeworthy beyond belief, but deserving of adoration.\n\nDr Ford thinks the Girls resurgence has a lot to do with the fact we've managed to get some distance; today's viewers see it as an absurd time capsule that never needed to be everything or speak for everyone.\n\n\"I'm guessing people watching it now would be in their late teens [and above], thinking about what their own lives might look like post-recession, amid continuing world conflict, and [thinking] they have been sold short of their dreams too,\" Professor Whelehan adds.\n\nToo Much\n\nA lot has changed for Dunham since Girls wrapped in 2017.\n\nLong-term romantic and creative partnerships have ended, and she's swapped New York for London, where she married her husband, Luis Felber, in 2021.\n\nShe's spoken of how her body was treated as an \"object of scorn\" after she bared it on Girls, and opened up about her experience with chronic illness.\n\nBut while she's continued making film and TV, she's veered away from the personal.\n\nUntil now.\n\nDunham's new Netflix series Too Much, co-created with Felber, marks her return to the semi-autobiographical genre.\n\nSince Girls, Dunham (pictured right with Luis Felber) has dabbled in TV, producing/directing HBO series Industry and Genera+ion, and returned to her film roots with an indie flick and two comedies. (Supplied: Netflix)\n\nThis time it's a rom-com loosely based on her and Felber's love story, and follows Jessica Salmon (played by Hacks breakout Meg Stalter), a 30-something New Yorker with a similar foot-in-mouth tendency to Hannah.\n\nJess runs away to London with her hairless dog Astrid after being dumped by her insufferable boyfriend (Michael Zegen) and feeling unfulfilled at work.\n\nShe imagines her new life will look like the \"British\" Jones Diaries. But she can only afford an ex-council flat with no soundproofing, and her one romantic prospect is a failing musician with substance use issues named Felix (Will Sharpe).\n\nMeg Stalter (pictured) excels as Jessica, who shares a similarly transfixing and confusing personality to her Hacks character. But the actor is allowed to delve deeper here. (Supplied: Netflix)\n\nJess and Felix almost immediately enter into an extremely co-dependent relationship despite the red flags and the fact there's a lot they seem to dislike about one another.\n\nWhen asked about the decision not to star in the series, Dunham told The New Yorker last year: \"I think sometimes when people associate you so recently with another character, they're not able to see [you as a new one].\"\n\nShe also decided she wasn't up for having her body \"dissected\" again.\n\nDespite the rom-com billing and grating plastic Netflix look, Too Much reveals itself to be just as much of a satire as Girls well before the requisite third-act break-up. (Supplied: Netflix)\n\nDunham appears in the show as Jessica's dramatic older sister Nora, who is largely unable to get out of bed following her own recent break-up with husband Jameson (Girls star Andrew Rannells). It's a wink to her own oeuvre — and it's not the only one.\n\nBut while it marks a return to her roots, Dunham's new show feels lacking, in many ways, of the realism and lo-fi grit of her HBO debut. It goes too heavy on the Netflix look. And Too Much struggles to depict believable people of colour despite all the backlash Dunham faced over this with Girls.\n\nIn the same way that Dunham nodded to the shows that inspired Girls in her TV debut, she references her own work in Too Much. (Supplied: Netflix)\n\nEven so, it has moments of brilliance, in the dialogue-driven exploration of the millennial experience, and in its sex scenes, which are just as unflinching and raw as Girls'.\n\nIf Girls was about how deeply uncomfortable it is to be a mediocre woman in your twenties, Too Much is about how that trend continues into your 30s, and how you try to make it work and be with the people you've chosen while sorting through your baggage — good idea or not.\n\nThis ultimately does not make for a very romantic or funny watch.\n\nBut, after 13 years of considering and reconsidering Dunham and her creations, at least it's immediately clear that was the intention.\n\nToo Much is streaming now on Netflix.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-15/la-olympics-breaks-tradition-scheduling-athletics-in-first-week/105532478",
        "title": "LA Olympics breaks tradition by scheduling athletics in first week",
        "publish_date": "Tue, 15 Jul 2025 00:04:50 +0000",
        "category": "sports",
        "authors": [],
        "text": "Organisers of the Los Angeles 2028 Olympics have released the first look at the Olympic competition schedule, highlighting a historic reshuffling of key events and the most ambitious sports line-up in Games history.\n\nThe announcement on Monday local time came as the city marked three years to go until the Opening Ceremony and celebrated a major legacy milestone: more than 1 million enrolments in the PlayLA youth sports program.\n\nFor the first time in three decades, the Summer Olympics will return to the United States, with Los Angeles hosting for the third time after 1932 and 1984. The 2028 Games are set to feature 844 ticketed events designed to maximise both domestic and international viewership.\n\nOrganisers revealed that the Opening Ceremony would take place on July 14, 2028 (July 15, 1pm AEST), split between the LA Memorial Coliseum and SoFi Stadium in Inglewood. The Closing Ceremony is scheduled for July 30 at the Coliseum.\n\nIn a notable departure from tradition, the LA28 schedule swaps the usual order of athletics and swimming competitions. Track and field events will open the Games in the first week, with swimming moving to the second week, culminating in its finale on the penultimate day at the LA Olympic Stadium in Inglewood.\n\nSwimming is traditionally Australia's strongest sport at the Olympics, which tends to give the team a solid start on the medal table.\n\nThe first Olympic champion of LA28 will be crowned at Venice Beach in the triathlon event, while the men's marathon will close out athletics on the final weekend.\n\nDay 15 of the Games is expected to be the busiest for medal events, with 16 team sport finals and 19 individual sport finals taking place.\n\n\"The Olympic competition schedule has been meticulously developed to ensure the world's best athletes can compete in LA,\" LA28 CEO Reynold Hoover said in a statement.\n\n\"We are energised by today's milestones and remain focused on the work ahead as the Road to 2028 continues.\"\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\nOrganisers said the schedule would continue to be refined, with a more detailed breakdown to be released this year.\n\n\"When the world comes here for these Games, we will highlight every neighbourhood as we host a Games for all and work to ensure it leaves a monumental legacy,\" LA Mayor Karen Bass said.\n\nMeanwhile, Hoover joined city officials on Monday at an event at the Coliseum to celebrate PlayLA surpassing 1 million program enrolments.\n\nThe initiative, backed by up to $US160 million ($244.6 million) in investment from LA28, the city's Recreation and Parks Department, and the IOC, provides affordable and inclusive sports programming for children aged 3-17 across more than 40 Olympic and adaptive sports.\n\nReuters/ABC",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-15/millthorpe-footpath-battle-council-and-grand-western-lodge/105501808",
        "title": "Council and business owner's $60,000 battle over footpath",
        "publish_date": "Mon, 14 Jul 2025 23:57:52 +0000",
        "category": "finance",
        "authors": [],
        "text": "The owner of a historic building and a New South Wales council are in a bitter dispute over a footpath, which has already cost ratepayers tens of thousands of dollars, and there is no end in sight.\n\nRetired investment banker Ian Gillings has threatened legal action against Blayney Shire Council in the state's Central West over its plan to fix a dilapidated footpath outside his business in Millthorpe, near Orange.\n\nMr Gillings purchased the run-down 1901 Grand Western Lodge on Victoria Street at the beginning of the COVID-19 pandemic and spent more than two years renovating the federation-era property into accommodation for miners.\n\nBut he is not happy with the state of a bitumen pavement footpath that straddles the state heritage-listed building's wrap-around balcony.\n\nBoth sides agree the damaged footpath outside the Grand Western Lodge is in dire need of replacing. (ABC Central West: Xanthe Gregory)\n\nMr Gillings has likened the footpath to a poorly maintained country road, filled with potholes and water damage.\n\n\"The footpath is in dangerous and is in bad repair,\" he said.\n\nFootpath standstill\n\nAs part of its broader Millthorpe Village Masterplan, the council plans to fix the footpath with asphalt, which Mr Gillings opposes.\n\nHe alleges the material would worsen water damage in the building, by allowing water to penetrate the cellar, and is not aesthetically appropriate for the heritage.\n\n\"I don't want my building to fall apart,\" he said.\n\n\" It's the right thing, I've spent all of this money on going 100 per cent heritage reparations and this part stands out as being totally inappropriate. \"\n\nInstead, he wants to replace it with bluestone, a more porous and durable product that matches the kerbs and guttering in the heritage conservation area.\n\nIan Gillings wants to install bluestone pavers to protect the building from water damage. (ABC Central West: Xanthe Gregory)\n\nMr Gillings has even offered to foot the entire estimated $80,000 bill and sign a 99-year guarantee to cover maintenance and costs associated with it.\n\n\"It doesn't work like that from our risk perspective nor our insurance and liability,\" Blayney Shire Council's general manager Mark Dicker said.\n\n\"We need to have a fit-for-purpose product not a Rolls Royce product, particularly when heritage advice doesn't agree with it.\"\n\nThe 70-year-old footpath is the cause of the dispute. (ABC Central West: Xanthe Gregory)\n\nCouncil's heritage advisor and Heritage NSW have given the green light to its existing plans to replace the asphalt path with like-for-like, in line with rest of the village.\n\nIts independent engineering advice found the proposed renewal works would not change the conditions that have resulted in rising damp in the lodge.\n\nBut a report by Calare Civil, hired by Mr Gillings, found the bluestone pavers would be the \"best practice approach\".\n\n\"The permeable pavers along with their dark colouring will promote escape of soil moisture through evaporation as opposed to directing water up the building walls,\" the report said.\n\nParties defiant\n\nWhen council said no to Mr Gillings's offer, he commenced legal proceedings in the NSW Land and Environment Court in April.\n\nThey have since been discontinued after the council agreed to temporarily pause the planned upgrade.\n\nIt means the footpath will remain in its poor state for now.\n\n\"It is the most incomprehensible thing ever,\" Mr Gillings said.\n\n\"I have no idea why they'd want to waste money in court rather than just say, 'Fine, we'll take your money.'\"\n\nThe Millthorpe township was established in the 1860s and is a designated heritage conservation area. (ABC Central West: Xanthe Gregory)\n\nThe council estimated the legal proceedings could cost up to $150,000 and that money remains set aside if they recommence.\n\n\"Noone wins going to court; that's a last resort from us,\" Mr Dicker said.\n\n\"This has quite frankly wasted over $30,000 of money plus numerous hours of staff time.\"\n\nMr Gillings also said it had so far cost him $30,000 in legal fees.\n\nThe historic Grand Western Lodge sits in the heart of Millthorpe, about 25 kilometres south-east of Orange. (ABC Central West: Xanthe Gregory)\n\nMr Gillings said the footpath stoush was the latest hurdle he had faced since purchasing the building, which had a tainted reputation.\n\nThe lodge gained the unfavourable title \"house of horrors\" after stories about its previous owner's treatment of discharged psychiatric patients who lived in the hotel-turned-private boarding house emerged in the early 2000s.\n\nA class action resulted in a payout of more than $4 million to approximately 50 claimants.\n\nIn spite of its history, Mr Gillings saw a business opportunity in re-opening the lodge and has no plans of backing down in the stoush with the council.\n\n\"I'll take it to its bitter end,\" he said.\n\n\"The moment they give me notice that they're doing it [fixing the path with asphalt] they'll be in the Land and Environment Court.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-15/dr-ann-secret-lives-of-animals-quiz/105470390",
        "title": "Is a pangolin a mammal or reptile? Take our secretive animals quiz to find out",
        "publish_date": "Mon, 14 Jul 2025 23:57:38 +0000",
        "category": "entertainment",
        "authors": [],
        "text": "The ABC's beloved nature nerd, Ann Jones, is on a mission to uncover the secret lives of some of the world’s most elusive animals.\n\nSo, how much do you know about sea snakes? Or pangolins? Or bull sharks?\n\nTest yourself – or learn a thing or two – about these, and other, intriguing creatures.\n\nLoading\n\nStream the new season of Dr Ann's Secret Lives free on ABC iview or watch Tuesdays at 8:30pm on ABC TV.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-15/new-marion-bay-boat-ramp-safety-complaints-yorke-peninsula-sa/105528838",
        "title": "Fishers and Sea Rescue refuse to use new $3.8m boat ramp",
        "publish_date": "Mon, 14 Jul 2025 23:16:51 +0000",
        "category": "finance",
        "authors": [],
        "text": "The Sea Rescue Squadron responsible for one of South Australia's most popular fishing spots is boycotting a new $3.8 million boat ramp, labelling it \"dangerous\" to sailors and vessels.\n\nEdithburgh Sea Rescue Squadron commander Brian Klingberg is among waterway users who have urged Yorke Peninsula Council to improve the safety of the new boat ramp at Marion Bay.\n\nWhile the council defended its consultation process, on Friday it agreed to reopen the old ramp as an temporary solution.\n\nIt came after councillors voted last Wednesday to remove the new ramp's wave attenuation wall, which was supposed to reduce water movement, a change that will result in wider entry ways.\n\nThe council will also look to raise the height of the central walkway between the two ramps which, according to a report presented at the meeting, \"appears to be blocking the natural flow of sand and seaweed … leading to a build-up\".\n\nThe report also said $303,000 was left in the budget, but a quote was still being sought for further works.\n\nIt remains unclear how much more money will be spent to improve the new design.\n\nWork was completed on the new Marion Bay boat ramp in April. (Supplied: Recfish SA)\n\nDamaged boats\n\nConstruction on the new ramp finished in April, two years after the state government chipped in $3.04 million of the total cost.\n\nHowever, Recreational Fishing SA executive officer Asher Dezsery said he was aware of at least six fishers who damaged their vessels within a fortnight of opening.\n\nAccording to a council report \"the outer piles restrict boat manoeuvrability within the ramp\". (Supplied: Yorke Peninsula Council)\n\nMr Dezsery said the biggest problem was posed by the pylons on either side of the walkway, which formed part of the \"wave attenuation wall\", but created a collision hazard in rough weather.\n\nThe project includes two ramps either side of a walkway, one measuring four metres wide and the other six metres wide.\n\n\"You don't have any movement or forgiveness as such, because you've got those poles and the pontoon itself,\" he said.\n\n\"When you've got a really big boat, and some of these boats are worth $500,000 or $600,000, you've got nowhere to go.\n\n\" It's a very challenging ramp to use … any strange swell or wind direction, and you're definitely in trouble. \"\n\nHe added that RecFish SA was not approached for its opinion about the final design.\n\nMr Klingberg, a Sea Rescue member of more than 20 years, described it as a \"crushing hazard\".\n\n\"Not being an engineer, I think what they should have done is involve the locals down there,\" he said.\n\n\"There are plenty of people who have used those facilities for 30, 40 years, and they're the ones who should have been consulted.\n\n\"We didn't know anything about the design until it was all there.\"\n\nCouncil identified seaweed build-up on the ramp as a key issue. (Supplied: Yorke Peninsula Council)\n\nCouncil defends consultation\n\nA Yorke Peninsula Council spokesperson said between August and September 2022, \"more than 200 individuals who had previously corresponded with council about the ramp were contacted directly\".\n\n\"A media release was also issued via the council's website and promoted through Facebook, reaching more than 27,000 people and resulting in over 650 visits to the project webpage,\" the spokesperson said.\n\n\"Council received 39 formal submissions. Of these, 56 per cent supported the concept design, 26 per cent opposed it, and 18 per cent provided neutral or mixed feedback.\n\n\" Submissions addressed a broad range of topics including safety, usability, environmental impact, and overall layout. This feedback was carefully considered in finalising the design. \"\n\nAccording to the council's website, two years' worth of coastal modelling data was also obtained before construction commenced.\n\nSand build-up has also been identified as a problem. (Supplied: Yorke Peninsula Council)\n\n'Time will tell'\n\nMarion Bay Rentals owner Brett Davies was pleased the old ramp had reopened, given the algae bloom was already hurting business.\n\n\"We've had a number of guests that have been coming down for 10 years, and I've had three of them state that they won't come back because of the ramp,\" Mr Davies said.\n\n\"I've had quite a few phone calls where guests are asking me if the boat ramp is safe to launch and my answer is, 'If you're launching by yourself, it's going to be a challenge'.\n\n\"We're 60 per cent down [in bookings] from the same period last year, and I'm not saying that's all because of the ramp, but going forward, I think time will tell, and I think it will have a huge impact if people think they're going to damage their boats.\"\n\nThe ABC also contacted SA Police asking if water rescue officers had voiced safety concerns, but a spokesperson declined to comment.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-15/rba-credit-debit-merchant-surcharge-payment-cost-review/105530340",
        "title": "RBA wants to end card surcharges and save users $1.2b a year",
        "publish_date": "Mon, 14 Jul 2025 23:12:06 +0000",
        "category": "finance",
        "authors": [],
        "text": "The Reserve Bank wants to end debit and credit card surcharges in Australia in a move it says would save consumers $1.2 billion each year.\n\nUnder the central bank's proposal, the EFTPOS, Visa and Mastercard networks would be allowed to ban surcharges — something the RBA currently prohibits.\n\nAn RBA review found the current system was outdated and no longer achieving its aim of steering consumers towards more efficient payment methods as cash usage declined.\n\n\"Our goal is a more competitive, efficient and safe payments system for everyone,\" RBA governor Michele Bullock said.\n\nThe changes would fall under the central bank's existing powers and not need the government to pass legislation.\n\nHowever, the RBA noted the government could ban surcharges in the future if they managed to linger.\n\nSmall business operators, including cafe and shop owners, have previously expressed concern about a surcharge ban, worried they would end up footing the bill and need to raise prices more broadly to cover payment costs.\n\nThe review noted that the downsides to a debit and credit surcharge ban included \"greater costs for merchants to absorb, or pass on through higher consumer prices\" than the other options it considered.\n\nSubmissions argued that it would put pressure on merchants' profitability and would particularly affect industries with lower margins, such as hospitality.\n\nBusinesses, particularly in low-margin industries, have raised concerns they will foot the bill if they can't pass payment costs on to customers. (Unsplash: Nathan Dumlao)\n\nSmall businesses would benefit from fee cap\n\nHowever, the RBA also wants to lower a cap on interchange fees paid by businesses, which would save them $1.2 billion a year and leave 90 per cent better off.\n\nThe review said the measure would be expected to lower costs for businesses and therefore reduce the impact on margins, and the flow on to prices.\n\nThe interchange fees are charged by payment service providers — for example, the major banks, Square, Tyro — to merchants, including online sellers.\n\n\"The proposed reductions to interchange caps would benefit small businesses the most as they tend to pay fees closer to the existing caps,\" the RBA said, noting larger operators already tended to use scale to negotiate lower fees.\n\nForeign interchange fees will also be capped to reduce costs for business accepting international cards.\n\nMerchants often have signs at checkouts disclosing card surcharges. (Supplied)\n\nLate last year, the government proposed banning surcharges on debit cards from January 2026, subject to the RBA review.\n\nThe RBA said the industry feedback was that it was simpler to just remove surcharges on both debit and credit cards to avoid confusion and implementation issues.\n\nThere are 8 million so-called combination cards in circulation in Australia that require the user to select whether to use it as a debit or a credit card.\n\nCard networks and payment providers would publish fees\n\nThe RBA has also proposed increasing transparency around fees by requiring card networks and payment providers to publish their wholesale fees.\n\n\"Transparency from these providers will help businesses find the best deals and encourage competition,\" Ms Bullock said.\n\nSubmissions to the review highlighted the increasing complexity of fees, which providers would also need to work with industry to simplify.\n\nTap-and-go and digital wallet users are among those who face surcharges. (Unsplash: Jonas Leupe)\n\nThere will be six weeks of consultation following this release, with a final paper wrapping up the review expected by the end of this year.\n\nAmerican Express does not fall under the RBA's remit due to its structure so will not be covered by the proposed changes, but the RBA says it could choose to ban surcharging also.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-15/mina-part-of-increased-female-participation-in-motorsport/105521150",
        "title": "More girls are go-karting and have peers 'spinning off the track'",
        "publish_date": "Mon, 14 Jul 2025 22:55:05 +0000",
        "category": "sports",
        "authors": [],
        "text": "Mina Langham, 10, discovered a natural talent for racing after she tried go-karting for the first time last September.\n\nIn just under a year, she has already clocked more than 100 races, going from complete novice to now beating seasoned racers.\n\nShe hits the track at an average of three times per week and, after getting her own kart in April, has already \"done well over 500 kilometres in it\", according to her dad, Kim.\n\n\"She's not stopped the last month … She makes a new personal best every day,\" he said.\n\nMina Langham drives an average of three races a week. (Supplied)\n\nShe is part of the uptick in female participation within go-karting and motorsports in recent years, driven by the ripple effects of documentary series Drive to Survive and an increased interest in Formula 1.\n\nWomen and girls now represent more than 15 per cent of all motorsport licence holders in Australia and are one of the fastest-growing groups in motorsport, according to Motorsport Australia. For go-karting, they make up 20 per cent of racers at all levels nationally.\n\nF1 Academy driver Joanne Ciconte blazing a trail for Australian girls Photo shows Joanne Ciconte with the visor on her helmet lifted, looking into the distance Joanne Ciconte spends a significant portion of her life on planes, travelling around the world in pursuit of speed.\n\nNadine Armstrong, the Motorsport Australia general manager of corporate affairs, said while motorsports might be in the theatres currently thanks to Hollywood, the sport was not having a \"moment\". Rather, she said, the sport's growing popularity was part of a movement that had been bubbling away for some time now.\n\n\"It still is obvious that females are under-represented in motorsport. Like many industries, we're not unique in that regard,\" she said.\n\n\"But I think there's a lot of things that are contributing to the fact that and it is a sport where females can participate on an equal playing field.\"\n\n\"Once you get behind the wheel, it doesn't really matter whether you're a female or a male.\n\n\"If you're behind the wheel of the same car or the same kart, it really comes down to driver ability.\n\n\"So it's always one of those things that once you put your helmet on, gender does not matter.\"\n\nArmstrong said female participation in the sport was growing, from an increase in licence holders and competitors to an uptick in women in official roles at the grand prix. Applications from women to be officials at the grand prix went up by 20 per cent between 2024 and 2025, she said.\n\nSince its inception in 2018, Motorsport Australia's Girls on Track program has seen 3,500 girls and women between the ages of eight and 22 go through the program.\n\nAiva only has a learners licence, but is inspiring young girls to go fast Photo shows A young female racing driver leaning on her car, holding her helmet, looking in the distance As one of the two inaugural Aussies on the grid in the all-female racing category, Aiva Anagnostiadis wants to be an example for other young girls who dream of driving fast.\n\nAt the go-karting level, PowerPlay, the venue where Langham races, saw more than 660 women and girls race last week and 2,500 in June across all four of its venues.\n\nLangham and her father recently found out about the F1 Academy, an all-female racing series established by Formula 1 to develop young female drivers and prepare them for higher levels of motorsport, including Formula 1. It is something they now are following closely.\n\nTwo Australian women are competing this season: 16-year-old Joanne Ciconte and 17-year-old Aiva Anagnostiadis.\n\n\"My biggest goal is probably to be a part of the Girls Academy … I really hope I can join that when I'm older,\" Langham said.\n\nMina Langham discovered she had a natural talent for racing. (Supplied.)\n\nHer father said she was almost ready for competitive racing. Last Friday on the track, he said, the other kids struggled to keep up with her.\n\n\"She just has the ability to pick the right lines and apexes. And the other kids were just getting frustrated and they were getting rattled,\" he said.\n\n\"They kept turning around and seeing where she was and, at the end of the day, they were spinning off the track.\"\n\nTayla Dicker, head of customer experiences at PowerPlay, said watching Mina Langham reminded her why she fell in love with racing. (Supplied)\n\nPrevious state and national-level go-karter Tayla Dicker now mentors Langham at PowerPlay.\n\nShe said it had been rewarding to see more girls like Langham give go-karting a go — and find their talent for it.\n\n\"The first time I saw Mina race, I could tell straight away she had a talent for racing,\" Dicker said.\n\n\"She reminded me of why I fell in love with racing in the first place.\n\n\"It's been incredible to watch her confidence grow, race with her and even watch her beat people on the track that are more than three times her age.\"\n\nLangham added: \"It's a lot of fun and I feel like it's something I'd never get bored of, and I hope I never get bored of it because it's really fun and really exciting\".\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-15/west-indies-australia-third-test-quick-hits-day-3-starc-green/105525958",
        "title": "Five quick hits: Fielding fumbles cost Starc more history in wild win",
        "publish_date": "Mon, 14 Jul 2025 22:47:54 +0000",
        "category": "sports",
        "authors": [],
        "text": "Mitchell Starc's stunning spell has helped Australia forget about a horror start to day three, although Sam Konstas's fielding briefly halted the party.\n\nHere are the quick hits from a wild conclusion to the third and final Test in Jamaica.\n\n1.Carey concussed\n\nAlex Carey copped a brutal bouncer to the helmet first up from Alzarri Joseph under lights on day two.\n\nHe was clearly rattled, but shook it off, although he only faced two more balls before charging the rapid seamer and nicking off.\n\nBefore play on day three, it was revealed Carey had failed a concussion test overnight. Luckily for Australia, limited-overs wicketkeeper Josh Inglis was in the squad and ready to take the gloves for the final innings.\n\nIt was Inglis's second stint as an injury replacement in the series, after stepping in for Steve Smith in the first Test due to a dislocated finger.\n\n2. Green's short stay\n\nCameron Green shouldered arms to the first ball of the day and had his stumps rocked. (AP: Ricardo Mazalan)\n\nAfter making it through a brutal night session with wickets tumbling all around him, Cameron Green had earned a session of easier batting in the sunshine on day three.\n\nGreen needed just three runs to become the second-highest run-scorer for the series and eight for his second half-century in as many Tests.\n\nIt was all set up for a match- and potentially career-defining innings as he tried to forge his way as a Test number three.\n\nInstead, the big West Australian confidently shouldered arms to the first delivery of the day from Shamar Joseph, only to see the ball seam back sharply and collect his off stump.\n\n3. Starc's scarcely believable first over\n\nEven for a man so renowned for his ability to strike early in an innings, it was something truly remarkable.\n\nPlaying his 100th Test and running in on 396 Test wickets, Mitchell Starc found his range straight away on day three, producing one that jagged away enough to catch John Campbell's edge and claim the second first-ball dismissal of the day.\n\nJust four balls later, Starc had his second, when debutant Kevlon Anderson left one that swung back at him viciously and thudded into his front pad. He inexplicably sent it upstairs, but there was no way it would be overturned.\n\nBrandon King came and went even faster than Anderson, driving at his first ball, which flew straight through the gate and into his stumps.\n\nThe West Indies' innings, only six balls old, was in tatters and Starc had produced a scarcely believable opening stanza.\n\nOn a hat-trick and with 399 career wickets to his name, Starc had just become only the second bowler to take three wickets in the opening over of an innings after India's Irfan Pathan.\n\n4. The fastest five-wicket haul in Test history\n\nMitchell Starc's three-wicket opening over set him on a path to history. (AP: Ricardo Mazalan)\n\nSince the first Test in 1877, there have been more than 2,000 matches played but never before has a bowler taken a five-wicket haul faster than Starc on day three.\n\nHis fourth wicket of the day — taken before he had even conceded a run — came when Mikyle Louis was caught plumb in front to another pitched-up, dramatic in-swinger.\n\nIt was the 400th wicket of his career and Starc held the pink ball aloft to mark his entrance into the most salubrious of bowling clubs in his 100th Test.\n\nUnbelievably, just two balls later, Starc had made history once more.\n\nOnce again, a West Indian pad was almost blown off by yet another Starc thunderbolt. Shai Hope sent the decision upstairs but nothing was saving him from becoming Starc's record-breaking victim.\n\nCompleted in just 15 deliveries, Starc had delivered the fastest five-wicket haul in Test match history, bettering the previous best of 19.\n\n5. Konstas costs us in the field\n\nOn day two, Sam Konstas made his biggest contribution to the third Test in the field with an excellent run-out of Justin Greaves.\n\nOn day three he fumbled just about everything that came his way and cost his team a slice of history.\n\nHe dropped two catchable balls at slip that could have handed Starc his sixth wicket, before some sloppy ground fielding allowed a costly single.\n\nWest Indies looked set to surpass the lowest-ever Test score of 26 when they reached that mark just six wickets down in the 13th over, but Scott Boland's hat-trick left Australia needing one wicket to consign the Caribbean team to a tie for that ignominy.\n\nStarc steamed in for the 15th over and found the outside edge of Alzarri Joseph again, with the ball rolling out to Konstas at gully.\n\nHe crabbed over to it, but the ball snuck under his fingertips and allowed a run. The Australians were clearly aware of it, as third slip Cameron Green threw his hands onto his head in dismay.\n\nWhile it doesn't really matter in the grand scheme of things, it was an unfortunate note for the 19-year-old to end his tour on.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-15/aussie-duo-miss-podium-cruel-tour-de-france-finish-healy-yellow/105532136",
        "title": "Aussie duo miss podium in cruel Tour de France finish as Ireland's Healy takes yellow",
        "publish_date": "Mon, 14 Jul 2025 22:29:13 +0000",
        "category": "sports",
        "authors": [],
        "text": "Australians Ben O'Connor and Michael Storer have narrowly missed out on a podium finish at the Tour de France after riding in a punishing breakaway in the mountains of the Massif Central.\n\nO'Connor (Jayco AlUla) finished fourth and Storer (Tudor Pro) fifth, so close but so far, after the Aussie duo were unable to match the pace on the last climb of the 165.3 kilometre 10th stage.\n\nBriton Simon Yates (Visma Lease-A-Bike) won the first mountain stage of this year's Tour while third-placed Irish rider Ben Healy (EF Education-EasyPost) took the yellow jersey, 31 seconds behind him.\n\nIn between was Dutchman Thymen Arensman (INEOS Grenadiers), nine seconds behind Yates.\n\nO'Connor, who had led several attacks as a 28-strong breakaway was gradually whittled down to five, did not have the legs after those efforts and came in 18 seconds behind Healy, with Storer 34 seconds further behind.\n\nStorer has never been on the podium in the Tour de France, while O'Connor has won one stage, in 2021, when he was fourth overall.\n\nThe peloton was more than two-and-a-half minutes behind the quintet, which is how Healy earned yellow.\n\nThe Irishman, who claimed his first stage victory on Thursday, took the overall lead, 29 seconds ahead of Tadej Pogačar (UAE Emirates-XRG), after driving the breakaway single handedly in the closing 20km as he sacrificed the possibility of another stage win to become leader.\n\nAs Pogačar approached the finish, Healy smiled while watching the Slovenian on the giant screen.\n\nWith Pogačar visibly backing off, the EF Education-EasyPost rider crossed the line to become the first Irishman to lead the Tour since Stephen Roche won the race in 1987.\n\nThe last time an Irish rider won the Tour de France was Stephen Roche in 1987. (Getty Images: NUTAN/Gamma-Rapho)\n\nHealy had looked one of the strongest riders in the breakaway on the 165.3km hilly route from Ennezat, but Yates timed his move to perfection, attacking solo on the final climb to seal a tactical victory.\n\nRemco Evenepoel (Soudal-QuickStep) is third in GC standings, 1:29 behind, and Jonas Vingegaard (Visma Lease-A-Bike) 1:46 behind in fourth. O'Connor's efforts moved him up to 18th, 11:50 behind Healy. He is the leading Australian.\n\nThe brutal stage from Ennezat to Le Mont-Dore Puy de Sancy had 4,400m of elevation gain across seven category-two climbs and a category-three ascent, with the usual Monday rest day delayed as 14 July is Bastille Day, a national day of celebration in France that marks the 1789 revolution.\n\nThe break formed after about 10km and solidified after 20km, with Harry Sweeney (EF Education-EasyPost) and Lucas Plapp (Jayco AlUla) making a quartet of Australians involved.\n\nSweeney and O'Connor tried to lead an attack with 128km left but were caught, O'Connor went again with 102km, being caught by nine others to form a 10-man breakaway.\n\nSweeney and Storer later joined them as the group grew to 18 but the former was dropped with 55km left.\n\nThree more attacks by O'Connor reduced the frontrunners to seven with 29km to go and it was down to five when Yates attacked.\n\nInitially the West Australian went with him, but Yates, who won the Giro D'Italia a few weeks ago, was too strong.\n\n\"I was not really expecting any opportunities here,\" said the Englishman.\n\n\"We came here fully focused on Jonas [Vingegaard] and the GC, but the stage played out in a way that I could be there for the win.\"\n\nHealy became the first Irishman to wear yellow since Stephen Roche in 1987.\n\n\"It was insanely tough. It was a battle against myself really,\" said Healy, who paid tribute to teammate Sweeny's help.\n\n\"It's a fairytale.\n\n\"I gambled a bit. I had the stage win in the bank and how often do you get the opportunity to put yourself into yellow? I felt I had to really go for it.\"\n\nAfter Tuesday's rest, and Wednesday's flat stage around Toulouse, the peloton will head into the Pyrenees, where the GC battle will heat up.\n\nWires",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-15/trump-says-he-has-real-club-world-cup-trophy/105532186",
        "title": "Trump says he has real Club World Cup trophy and Chelsea given replica",
        "publish_date": "Mon, 14 Jul 2025 22:09:25 +0000",
        "category": "sports",
        "authors": [],
        "text": "US President Donald Trump says Chelsea was awarded a replica Club World Cup trophy after their victory over PSG, and the real trophy was left to the White House \"forever\".\n\nSpeaking to DAZN — the broadcaster which has just acquired the rights to the AFL and NRL — Mr Trump said the trophy was left to him when FIFA president Gianni Infantino visited in March.\n\n\"They said, 'Could you hold this trophy for a little while?' We put it in the Oval Office,\" Mr Trump said.\n\n\"And then I said, 'When are you going to pick up the trophy?' He says, 'We're never going to pick it up. You can have it forever in the Oval Office. We're making a new one.'\n\nDonald Trump and Gianni Infantino with the trophy in the White House in March. (Getty Images: Chris Kleponis/CNP/Bloomberg)\n\n\"And they actually made a new one. So that was quite exciting … it's in the Oval right now.\"\n\nIn a press conference during Infantino's visit in March, Mr Trump said he had \"never seen anything like\" the gold trophy, before saying that it would be staying at the White House.\n\n\"If you like it Mr President, it can stay here, just on the 13th of July you should take it with me to the stadium to give it to the winners, they can take a picture with it, then we can bring it back here,\" Infantino appeared to joke.\n\nMr Trump nodded before saying \"let's leave it here\" and \"we'll leave it here, we'll have it in the White House quite a bit\".\n\nInfantino also appeared to give Mr Trump a winner's medal during the presentation after the final, which the president put in his pocket before the trophy celebrations.\n\nThe presentation made for awkward scenes, as Chelsea players appeared bemused by the president's presence amongst the celebrating team.\n\nCole Palmer, who was awarded the Golden Ball as the top player of the tournament, looked the most confused out of the team as Mr Trump remained on stage.\n\nCole Palmer (behind Mr Trump's right shoulder) was particularly bemused by the situation, with teammates appearing to ask each other whether the President was going to leave the stage. (Getty Images: VCG)\n\n\"I knew he was going to be here, but I didn't know he was going to be on the stand when we lifted the trophy, so I was a bit confused,\" Palmer said after the match.\n\nThe Englishman starred in the game and said he felt Chelsea had been doubted before the tournament.\n\n\"It's a great feeling. Even better because obviously everyone doubted us before the game,\" Palmer said.\n\n\"The gaffer put a great game plan out and obviously he knew where the space was going to be.\"\n\nThe ABC of SPORT Sports content to make you think... or allow you not to. A newsletter delivered each Saturday.\n\nAP/ABC",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-15/musicians-playing-period-instruments-from-history/105522808",
        "title": "The recorders from our childhood have a history in centuries-old instrument",
        "publish_date": "Mon, 14 Jul 2025 22:00:00 +0000",
        "category": "entertainment",
        "authors": [],
        "text": "People often say that classical music is a centuries-old tradition. But scratch under the surface, and you'll quickly discover that classical music has been around since before Bach and Mozart were alive, and has continued to evolve.\n\nInstruments like violins and clarinets have changed more than you might think. Others from earlier times such as crumhorns, cornetti and shawms disappeared from most stages for centuries.\n\nIn one corner of the music world, a group of musicians known as period instrumentalists are dedicated to making music with historical research. Comprising players, academics and instrument-makers, they unearth manuscripts written centuries ago, learn to play using older techniques, even reproducing instruments from paintings and copies of museum pieces.\n\nBaroque violinist Madeleine Easton says entering this world is like \"getting in a TARDIS, going back in time and discovering all this different music, different instruments and different tunings.\"\n\nMany Australian musicians who are drawn into period instruments have pursued their studies in Europe, where archives and old instruments are more readily available.\n\nSome have founded groups of like-minded musicians to champion the music they love for Australian audiences.\n\nHow music changes through the ages\n\nWhen she discovered baroque violin during her university studies, Easton had to unlearn everything she thought she knew, from the way she was holding her instrument to using a baroque bow.\n\nSimilarly, historical clarinettist Nicola Boud says hearing Mozart's music played by a wind ensemble specialising in the music of his era was a revelation.\n\nLoading Instagram content\n\n\"It makes perfect sense to play the music of Mozart on the instrument that he knew,\" Boud says.\n\nThe clarinet during Mozart's time was a simpler instrument with fewer keys and constructed from a lighter type of wood than its modern counterpart.\n\n\"They're made mostly of boxwood, the same decorative hedges you see in gardens and plant nurseries,\" Boud explains. To play them, \"you use something called cross-fingerings.\"\n\nConcert venues were much smaller and instruments were softer in the 18th and early 19th-centuries. This means contemporary audiences at historical performances also have to listen differently.\n\n\"Audience ears often have to come towards the ensemble instead of the ensemble throwing out the sound,\" Boud says.\n\nEaston says even though the violin's body remains the same since its conception in the late 15th-century, virtually every other part of the instrument has been modified.\n\n\"The neck, the fingerboard, the bridge and the tailpiece have evolved over the years,\" she says.\n\nEaston specialises in playing music written during the baroque period between 1600 to 1750. So playing baroque violin as opposed to a modern instrument gives Easton a better understanding of the sound world of those times.\n\nBaroque violinist Madeleine Easton founded a group dedicated to playing the music of J.S. Bach. (Bach Akademie Australia: David Hooley)\n\nBoud says notes on the classical clarinet have more character, which is why it's her instrument of choice to play Mozart.\n\nMany period instrumentalists are aware these slight differences might sound nit-picky to casual listeners so they try to balance their passion for historical accuracy with a sense of humour.\n\nBut ultimately they want to highlight how adding an understanding of history can enrich audiences' experience of music.\n\nWhat it's like playing museum pieces\n\nPursuing his research of historical wind instruments took musician Matthew Manchester to libraries and museums across Europe.\n\n\"I spent an afternoon playing a pair of cornetti that were commissioned for James II's visit to Oxford in 1605,\" Manchester shares.\n\nLoading...\n\nManchester has also played other museum pieces, including natural trumpets from the late 17th century.\n\n\"[it's] like a long single pipe that loops back over itself before ending with a bell,\" Manchester describes.\n\nTo understand how these old instruments work, Manchester pored over archives of musical manuscripts, as well as letters and other documents written by musicians.\n\n\" The music makes sense because the music was written for those instruments. \"\n\nInterest in medieval, renaissance and baroque music rose in the latter half of the 20th-century, with makers reconstructing surviving instruments. They even recreated instruments from paintings.\n\nManchester owns copies of bagpipes historically found in Germany, Belgium and England. These places aren't known for bagpipe traditions, but the bagpipers were featured in paintings and documents across Western Europe.\n\n\"Bagpipes don't keep particularly well because they were literally made from guts of animals, so they tend to wear out,\" Manchester says. \"But there's a whole repertoire of amazing dance music that survives.\"\n\nThere were trials and errors with modern reproductions.\n\n\"Modern makers used to 'fix' what they thought were problems when they were making copies,\" Manchester says. \"But actually, those problems turned out to be the things that give those instruments their characters.\"\n\nSometimes, instruments from the past can even make a comeback.\n\n\"The plastic recorders we all played as kids are copies of a really great baroque recorder,\" Manchester says.\n\nBuilding communities of like-minded musicians\n\nThere are several ensembles in Australia dedicated to specific periods in musical history or championing works by particular composers.\n\nEaston is the Artistic Director of the Bach Akademie Australia, an ensemble which almost exclusively perform the music of Johann Sebastian Bach.\n\n\"There are more than 300 dedicated Bach ensembles around the globe, more than any other composer,\" Easton says.\n\nIt takes a certain kind of player to play Bach's music the way Easton envisions, which \"requires you to be a little bit Buddhist.\"\n\n\"You need to have someone who is super nerdy, but who also has the capacity to play straight from their heart to the audience,\" Easton says.\n\nWhat are golden age string instruments and why are they so special? Photo shows Satu Vänska stares into the distance while holding her Stradivarius violin sideways. These priceless instruments are most coveted by string players. We delve into their mysteries and why being on stages are better for them than the vaults.\n\nManchester regularly performs with historically-informed ensembles and choirs in Australia and the UK.\n\nHe says although we can never recreate exactly how music in the past sounded, the sharing of research and knowledge has its own rewards, including rediscovering music which hasn't been heard for centuries.\n\n\"There's hundreds of years of western music before the romantic revolution got into the groove with the [classical] cannon,\" Manchester says.\n\nBoud, who is currently touring Australia, regularly performs with European ensembles specialising in the classical and romantic periods of music history. She has made the Netherlands her home.\n\n\"I went on to study with the historical clarinettist from the Mozart concert I attended all those years ago,\" Boud says.\n\n\"[After he retired], I took up his position teaching in The Hague.\"\n\nNicola Boud is touring Australia with Musica Viva in July. Hear her Melbourne concert on ABC Classic later in 2025.\n\nGet the latest classical music stories direct to your inbox",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-15/torres-strait-climate-case/105517784",
        "title": "'Saving my people': Four-year landmark climate battle to be decided today",
        "publish_date": "Mon, 14 Jul 2025 21:57:25 +0000",
        "category": "finance",
        "authors": [],
        "text": "Torres Strait Islanders are awaiting the ruling in a landmark climate case today — one that, if successful, could have a significant impact on the future of their islands and culture.\n\nGuda Maluyligal traditional owners Uncle Paul Kabai and Uncle Pabai Pabai — from the islands of Saibai and Boigu — have travelled almost 900 kilometres from their ancestral homes to the Federal Court in Cairns to hear the outcome.\n\nClinging to hope and culture on a sinking island Photo shows Two sitting figures are seen in silhouette against the ocean and last light of the setting sun. Torres Strait Islanders on the front line of climate change are fighting a landmark lawsuit to save their vanishing ancestral homes. But is it too late?\n\nFor the past four years, they have led the case on behalf of all Torres Strait Islander peoples, arguing the Commonwealth has neglected its duty of care to take proper steps to protect their communities from the impacts of rising seas and climate change.\n\nToday, Federal Court Justice Michael Wigney will hand down his judgement.\n\nA landmark case\n\nThe first of its kind in Australia, the landmark litigation has been financed through the NGO the Grata Fund, and modelled on a successful case from the Netherlands.\n\nIn 2023, the federal court visited the islands of Boigu and Saibai, about 6 kilometres from the shores of Papua New Guinea, and Badu.\n\nResidents of Boigu gathered in the island's community hall for on-country hearings. (Supplied: Ruby Mitchell)\n\nEvidence of coastal erosion, destruction of ancestral graves and soil salinity that prevents crops from growing was presented to the court.\n\nIt also heard of extreme weather events, including storms that cause intense flooding and inundate the islands that lie at just 1.6 meters above sea level.\n\nWater inundation has caused headstones at the Saibai Cemetery to topple. (ABC News: Baz Ruddick)\n\nThe uncles also travelled more than 3,000 kilometres to attend Federal Court hearings in Melbourne in November 2023.\n\nUncle Paul addressed the media outside Melbourne Federal court in 2023. (Image: ABC News)\n\nThe court heard that sea levels in the Torres Strait were rising at double the rate of the rest of the world and that inaction on climate change may cause irreversible impacts for First Nations people in the Torres Strait.\n\nAustralia is the world's 11th highest per capita emitter of greenhouse gases, according to the CSIRO, contributing just over 1 per cent of global emissions. It's also among the largest fossil fuel exporters in the world.\n\nClimate scientist Malte Meinshausen, an expert in carbon budgets, told the court there were three \"accepted methodologies\" for determining each country's fair share of global emissions.\n\nBased on these, he said Australia needed to make deeper emissions cuts than its current 2030 targets if it wanted to be consistent with the global aim of limiting warming to 1.5 degrees.\n\nThe court heard breaching this 1.5 degree limit would cause irreversible damage to small and low-lying islands, including those in the Torres Strait.\n\nThe low-lying island of Saibai is mostly swamp and estuaries. (ABC News: Baz Ruddick)\n\nThe Commonwealth has acknowledged the Torres Strait Islands are vulnerable to the effects of climate change, but it argues Australia can't prevent or mitigate these effects on its own.\n\nIt also said the question of its emissions target is for the parliament to decide, not the courts.\n\n\"There is no consensus as to how GHG [greenhouse gas] emissions should be divided and in any case the question is one of policy and not climate science,\" it argued.\n\nA king tide breaches a sea wall on Saibai Island in January 2009. (file photo: ABC News)\n\nThe plaintiffs seek an order requiring the government to take action to prevent further harm to their communities, including by making deeper emissions cuts and implementing adaptation measures.\n\nIf successful, the legal challenge could set an international precedent for how governments are held accountable for climate change impacts on vulnerable communities.\n\nCultural loss\n\nAt the heart of the case was the deep connection between Torres Strait Islanders and their land and what would be lost if the low-lying islands were claimed by the sea.\n\nThe plantiffs' legal team argued the Guda Maluyligal people risked losing their culture if rising sea levels, caused by climate change, forced them to leave their homes.\n\nUncle Pabai fears they will become \"climate refugees\".\n\n\"The role I'm playing now is important in saving my people. For the next generation to come, I don't like to see Boigu under the water,\" he said.\n\nThe elders want to ensure their homelands and culture will be preserved for the next generations. (ABC News: Baz Ruddick)\n\nThe case heard testimony from a number of elders and community members documenting sacred sites and cultural practices that have been handed down thousands of years, all at risk of being lost.\n\nKnowledge regarding the changing of the environment over time, including seasons shifting and animal migration times changing was part of the evidence.\n\nWhatever the outcome of the case, islanders vow they will continue to fight to protect their homelands.\n\n\"We're not going to stop. If we stop, Saibai will be underwater,\" said Uncle Paul.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-15/federal-politics-live-blog-july-15/105532168",
        "title": "Live: Paterson says government 'delusional' about new homes target",
        "publish_date": "Mon, 14 Jul 2025 21:53:39 +0000",
        "category": "finance",
        "authors": [
            "Courtney Gould",
            "Bethanie Alderson",
            "Samuel Yang",
            "Tom Crowley",
            "Holly Tregenza",
            "Stephen Dziedzic In Beijing"
        ],
        "text": "Business Council of Australia chief Bran Black says the stabilisation in the diplomatic relationship between Canberra and Beijing has \"set the tone\" for engagement.\n\nBran has led a delegation of business leaders who joined the prime minister's visit to China. The BCA will tonight co-host the Australia-China CEO round table, marking the first time it's being held in Beijing since 2016.\n\n\"It's so important to have those strong engagements at the leader level, because what that does is set the tone for the engagements that we're able to have at a business-to-business level as well,\" he said. \"Now, those business-to-business engagements in turn … send a bit of a signal to Australian businesses and to Chinese businesses that further engagement is welcome and further engagement should be encouraged.\"\n\nWhile Bran said business leaders were \"pleased to have the opportunity to engage\", it was important they still had an eye on diversifying into the UAE, India and other parts of South-East Asia.\n\n\"We should be encouraging our chiefs to diversify for the greatest possible extent. that's not just a risk mitigation, but that's good business,\" he told reporters in Beijing.\n\nHe named agri-business, professional and financial services, higher education and green metals as areas of opportunity.",
        "source": "ABC"
    },
    {
        "url": "https://www.smh.com.au/money/investing/i-m-scared-i-ll-lose-money-if-i-invest-how-do-i-face-my-fear-20250715-p5mf2h.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "I’m scared I’ll lose money if I invest. How do I face my fear?",
        "publish_date": "Tue, 15 Jul 2025 12:11:07 +1000",
        "category": "finance",
        "authors": [
            "Paridhi Jain"
        ],
        "text": "I’ve been looking into investing in ETFs. My big hesitation is fear. I don’t want to lose money. I’ve heard a lot of horror stories, and the news headlines since COVID haven’t been very encouraging, with some kind of recession or economic crisis always around the corner. I keep thinking I should wait until things are more stable, but it’s been some years now, so I guess that’s not going to happen. How do I pull the trigger?\n\nYou’re right. Waiting for things to stabilise isn’t a good idea. That’s like waiting for the waves in the ocean to smooth over before you jump in. It’s against the very nature of the economy and markets. You’ve got to jump in. But how?\n\nInvesting is a bit like having a healthy diet: it isn’t about one specific food, it’s about the balance of what you eat overall. Credit: Simon Letch\n\nSure, there is an element of courage required. But there are things you can be doing to manage and mitigate risk as well, which will help you feel safer to make the jump.\n\nHere are some questions you can ask yourself that will help you de-risk investing.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/goodfood/melbourne-eating-out/an-ex-kafeneion-staffer-heads-up-this-greek-wine-bar-with-a-meze-heavy-menu-in-fitzroy-north-20250715-p5mf2k.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "An ex-Kafeneion staffer heads up this Greek wine bar with a meze-heavy menu in Fitzroy North",
        "publish_date": "Tue, 15 Jul 2025 12:05:44 +1000",
        "category": "finance",
        "authors": [
            "Tomas Telegramma"
        ],
        "text": "Add articles to your saved list and come back to them anytime.\n\nRemove items from your saved list to add more.\n\nYou have reached your maximum number of saved items.\n\nMuses Wine Bar has opened in the former Pinotta space.\n\n1 / 5 Meze plates include taramosalata dip, green chilli kingfish and tirokafteri. Supplied 2 / 5 Dishes include lightly fried calamari with lemon-thyme aioli. Supplied 3 / 5 Fried feta with sesame seeds, and a drizzle of Cretan honey. Supplied 4 / 5 Espresso martini. Supplied 5 / 5 Dips at Muses Wine Bar. Supplied Previous Slide Next Slide\n\nGreek$$$$\n\nGreek restaurant Kafeneion’s former venue manager Yianni Malindretos has struck out on his own, opening wine bar Muses where beloved bistro previously Pinotta stood. It’s a hard act to follow, but Malindretos hopes to fill the void with a laidback venue that locals can use as they please, from spontaneous drinks (raki-spiked cocktail, anyone?) to feasts influenced by his Cretan heritage.\n\nThe meze-heavy menu includes taramasalata, spanakopita, soutzoukakia (baked meatballs), and sesame seed-crusted slabs of feta, served molten with Cretan honey. Youvarlakia avgolemono is a lemony Greek meatball soup. A baklava-tiramisu hybrid – the best parts of both desserts in a nest of kataifi pastry – is “what 90 per cent of diners want to try, even if they’re full,” Malindretos says.\n\nWant to visit this venue? Save it in the Good Food app.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/rugby-union/will-farrell-pick-farrell-for-tests-20250715-p5mf0l.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Will Farrell pick Farrell for Tests?",
        "publish_date": "Tue, 15 Jul 2025 12:01:06 +1000",
        "category": "finance",
        "authors": [],
        "text": "Will Farrell pick Farrell for Tests?\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/rugby-union/is-donaldson-ready-for-wallabies-hot-seat-20250715-p5mf0i.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Is Donaldson ready for Wallabies hot seat?",
        "publish_date": "Tue, 15 Jul 2025 11:59:16 +1000",
        "category": "sports",
        "authors": [],
        "text": "Is Donaldson ready for Wallabies hot seat?\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/business/companies/elon-musk-looks-to-raid-his-empire-for-billions-20250715-p5mezn.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Elon Musk looks to raid his empire for billions",
        "publish_date": "Tue, 15 Jul 2025 11:58:17 +1000",
        "category": "finance",
        "authors": [
            "Stephen Bartholomeusz"
        ],
        "text": "His shareholders, however, want him to devote himself to Tesla, rather than his other ventures (xAI, SpaceX, The Boring Company etc) or politics, where he recently announced plans to launch the America Party to challenge Republicans and Democrats. Now they may be asked to approve a multibillion dollar investment in an AI business that Musk has previously said is developing AI that is quite different to Tesla’s. Tesla has a number of its own issues to deal with. Credit: Bloomberg The companies do have existing links. xAI buys batteries – more than $US200 million of them so far – from Tesla. Its “Grok” chatbox may also be deployed within Tesla’s autos. It’s not, however, the synergies driving Musk’s interest in tapping Tesla’s cash reserves. It’s xAI’s insatiable appetite for cash.\n\nThe AI vehicle is haemorrhaging cash at a rate of more than $US1 billion a month. According to Bloomberg, it expects to burn $US13 billion this year. It has been reported that, in presentations to potential debt and equity providers, it has said it expects to generate about $US500 million of revenue this year (Open Ai’s ChatGPT is forecast to generate nearly $US13 billion) and $US2 billion next year. It doesn’t expect to be profitable until 2027, or become cashflow positive before 2029. Tesla shareholders do tend to invest in Musk the individual as much, if not more, than they do in Tesla’s EV-manufacturing future, so would probably be expected to ratify an investment, or series of investments, in xAI. That means, to continue funding its development, it has to raise a lot of equity and debt. Its rivals – Open AI, Google, Facebook, Anthrophic (backed by Amazon and Google), Google and Meta are all spending vast amounts of cash on their AI models but all of them have access to vast resources. Musk’s xAI has raised a lot of money since launching in March last year, when it attracted $US6 billion at a valuation of only $US18 billion.\n\nIt raised another $US6 billion in December, at a valuation that had jumped to about $US50 billion, and another $US10 billion of equity and debt in March, when xAI merged with Musk’s X social media platform. In that deal, xAI was valued at $US80 billion and the merged entity’s equity base at $US113 billion. Now it’s reported to be looking to attract more debt and equity – another $US5 billion of equity and a similar amount of debt. Loading SpaceX has apparently committed $US2 billion, Saudi Arabia’s sovereign wealth fund, which has an indirect interest in a $US800 million stake in xAI, may contribute and, now, Tesla shareholders will be asked to allow Tesla to inject some of its cash. The valuation range being used for the raising: a whopping $US170 billion to $US200 billion! Not bad for a company valued at less than $US20 billion not that much more than a year ago.\n\nWith about half that cash, if it is raised, expected to be chewed up within three months, it is almost inevitable that xAI’s backers will be asked for further contributions before the end of this year, presumably at an even higher valuation. There is some industrial logic to closer ties, if not a merger (which Musk has ruled out, emphatically) between xAI and its X social media platform and Tesla. Tesla user data and X’s user base could provide cheap or free access to vast amounts of the data needed to train AI models and create a feedback loop that could help the development of Tesla’s own operations, particularly its robots, while Grok could provide an AI interface for Tesla drivers and robotaxi passengers. xAi is bleeding cash at an alarming rate. Credit: Bloomberg While Grok has had its teething problems, partly because of Musk’s determination that it shouldn’t be “woke” – it recently praised Hitler while sharing antisemitic posts on X and said a Holocaust-like response to hatred against whites could be effective – Musk has claimed that it performs better than its rivals.\n\nIt is conceivable that, while the Tesla investment case for supporting xAI’s fund-raising might be less than compelling, with only modest synergies, the argument for a stake simply as a potentially lucrative, albeit risky, investment might appeal to some Tesla shareholders. Loading Tesla shareholders do tend to invest in Musk the individual as much, if not more, than they do in Tesla’s EV-manufacturing future, so would probably be expected to ratify an investment, or series of investments, in xAI. The fact that he has had to tap SpaceX, which is also planning to raise new capital – at a valuation of around $US400 billion – and may access Tesla’s cash, suggests that xAI hasn’t found it easy to attract funds from unaligned investors. Musk has had to turn to his private network and the one listed entity that he, through the force of his personality and record as an entrepreneur rather than his 13 per cent shareholding, effectively controls.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/rugby-union/how-to-unlock-generational-suaalii-20250715-p5mf0k.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "How to unlock 'generational' Suaalii",
        "publish_date": "Tue, 15 Jul 2025 11:57:14 +1000",
        "category": "finance",
        "authors": [],
        "text": "How to unlock 'generational' Suaalii\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/business/companies/airlines-begin-checking-fuel-switches-after-air-india-crash-report-20250715-p5mez5.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Airlines begin checking fuel switches after Air India crash report",
        "publish_date": "Tue, 15 Jul 2025 11:55:42 +1000",
        "category": "finance",
        "authors": [
            "Chris Zappone"
        ],
        "text": "Conjecture about the pilot’s mental health has been criticised by an Indian pilot’s union, the Indian Pilots Guild, which said: “The crew of Al171 deserves a thorough, fact-driven investigation.” The crash of Gatwick-bound Air India flight 171, which occurred seconds after take-off from Ahmedabad, India, on June 12, killed all but one of the 242 passengers and crew. It also killed 19 people on the ground. The safety of the fuel switches has come under scrutiny with the release of the Aircraft Accident Investigation Bureau (AAIB) report on Friday. The bureau said the US Federal Aviation Administration issued an airworthiness bulletin in 2018 “regarding the potential disengagement of the fuel control switch locking feature”. But “the airworthiness concern was not considered an unsafe condition that would warrant [an] airworthiness directive by the FAA”.\n\nLoading The throttle control module of the Air India 787 Dreamliner was replaced on the plane in 2019 and 2023, the AAIB notes. “However, the reason for the replacement was not linked to the fuel control switch. There has been no defect reported pertaining to the fuel control switch since 2023”, the AAIB reported. The Civil Aviation Safety Authority has been contacted for comment. An Australian source with direct knowledge of aviation maintenance including fuel control switches said it was possible a “faulty locking feature of the fuel cut off switches” could be to blame.\n\nIn this case, the problem would result from a switch design that “had a history of wearing out where the two-action positive lock function is lost allowing the switches to be easily and inadvertently [flipped] back to the CUT-OFF to then shut its engine down”. A worn-out fuel control could be switched off either by the brushing of the hand or vibration by the plane, said the source with decades of domestic and international aviation engineering experience, although both would have to be switched. If the switches were the issue, the manufacturers and airlines had a duty to seek information on their performance for future air directives too, said the source. Honeywell, the maker of the switches, said: “We do not comment on rumour or speculation. Any questions on the incident should be directed to the appropriate investigating agencies.” Boeing has been contacted for comment.\n\nUnder the International Civil Aviation Organisation rules, the nation where the accident or incident happened has responsibility for conducting the investigation. To date, the Boeing Dreamliner has had a strong safety record. However, given the safety and production problems linked to the two Boeing 737s Max planes that crashed in 2018 and 2019, the findings of the Air India crash investigation are being closely watched. Dr Geoffrey Dell, head of aviation safety for the AMDA Foundation, said the accident could be the result of an issue with the switches. “Anything is possible. The question is how probable is it.” The problem with the content of the Aircraft Accident Investigation Bureau preliminary report was there was no data included. It was, Dell said, “interpretation information”. Without any other facts, it’s difficult to “draw reasonable or even partial conclusions”, he said.\n\nDell, who is an aviation crash investigator, said it would be unlikely to be a problem with the switches alone because they aren’t designed to be moved accidentally. A pilot would have to adjust them both by accident. Loading The AAIB report states that after the aircraft achieved the maximum recorded airspeed of 180 knots “and immediately thereafter, the Engine 1 and Engine 2 fuel cutoff switches transitioned from RUN to CUT-OFF position one after another with a time gap of 01 sec.” They were found in the on position after the crash. Swinburne University school of engineering department of aviation’s Salim Hijazeen said: “While the switch design and past FAA advisories carry weight, they are unlikely to be the sole cause of the incident.\n\n“What appears more plausible is a convergence of factors – including human performance limitations under high stress, a potential aircraft system issue which required pilot input, and breakdowns in procedural discipline.” In most flight deck operations, especially those involving engine shutdown, “a cross-check and verbal confirmation between pilots is required before any critical input is made,” said Hijazeen. A crane retrieves part of the fuselage of the Air India Boeing 787 in Ahmedabad, India. Credit: Getty Images “The report indicates that the pilot monitoring may not have been aware that the shutdown had occurred, pointing to a significant lapse in crew resource management and situational awareness.” A high workload and pressure may have exacerbated this during the initial take-off roll, he said, “a phase of flight that we still do not fully understand in terms of cockpit dynamics and decision-making”.\n\nDell, the investigator, said that saying pilot error was the cause of the crash is “like saying the accident was caused by gravity. It’s true but not very bloody helpful.” Loading A better question, Dell said, is: “How did the system allow an error to cause a catastrophic loss? “Obviously, there’s a design problem with the mechanics and the human systems built around it.” The Lifeline number for crisis support is 13 11 14.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/business/consumer-affairs/rba-wants-to-ban-credit-and-debit-surcharges-20250715-p5mezv.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘Mirage’: RBA claim that card surcharge ban would save Australians $1.2b provokes industry ire",
        "publish_date": "Tue, 15 Jul 2025 11:52:41 +1000",
        "category": "finance",
        "authors": [
            "Elias Visontay",
            "Shane Wright"
        ],
        "text": "The measures are predicted to save businesses about $1.2 billion per year in fees, with the RBA estimating 90 per cent of businesses will be better off under the proposal. Additionally, the RBA proposal would force credit card networks such as Visa and Mastercard to publish the fees they charge, which in turn will allow the payment service providers such as Square and banks providing payment terminals to compare the deal they are getting. The transparency, according to the RBA, will drive competition and reduce the price payment providers charge businesses for using their services. Reserve Bank of Australia governor Michele Bullock says it is time for an overhaul of the system. Credit: Dominic Lorrimer Card issuers would lose about $900 million a year in revenue under the proposal, the RBA has estimated, but the cap on interchange fees would still be above the processing cost. This could force issuers to increase credit card fees or cut back on reward schemes such as airline points for spending, the RBA warned. “Some issuers may choose to increase cardholder fees or reduce benefits such as rewards points, particularly on credit cards, to boost their profitability in response to reductions in interchange settings. Issuer revenue may also increase if more consumers choose to use credit cards or substitute away from cash use as a result of surcharges being removed,” the RBA said.\n\nPending the outcome of the consultation period, the RBA has powers to implement its proposal by July 2026. However, the RBA lacks enforcement powers, meaning a true legal ban forcing players to follow the bans and transparency rules would need to be legislated by the government. The business community has long argued that banning surcharges would force many merchants to increase the prices of their goods. Loading In its review paper, the RBA played down the extent of any inflationary impact of its proposal, predicting an aggregate increase to consumer prices of about 0.1 per cent, as only around 10 per cent of merchants currently impose payment surcharges. “In any case, this would only be a very small one-off impact on measured inflation; consumers are already paying these costs via payment surcharges (which are not included in the Consumer Price Index) and if these costs are instead fully passed on through higher prices, the final amount paid by the consumer in practice would be similar,” the RBA said.\n\nUnder the proposal, businesses will continue to be able to offer discounts from advertised prices for customers paying cash if and when the card surcharge ban comes into effect. Reserve Bank governor Michele Bullock said “the payments landscape is always evolving, and it’s critically important that we keep pace to ensure it remains safe, competitive and efficient”. Bullock said that key challenges in the payments system today include “difficulties in avoiding card surcharges, as fewer Australians are using cash to pay for things”; “the high cost of accepting card payments, especially for small businesses”; and “difficulties for businesses in comparing or switching payment providers to find better deals”. Loading “Greater transparency can help here. We think the time has come to address some of these high costs and inefficiencies in the system,” Bullock said.\n\nThe Independent Payments Forum Australia blasted the Reserve Bank’s proposal, warning it will “fail to adequately reduce the billions of dollars in fees unfairly levied on Australian small businesses and their customers” and could lead to job losses. The payments forum said small businesses are, on average, paying 300 to 400 per cent more in card fees than the deals big businesses strike with payment service providers. “The proposed regulatory options fail small businesses and the local communities they serve. Rather, they benefit big business, big banks and big offshore companies,” forum co-founder Bradford Kelly said. “This cost is ultimately borne by consumers.” “Without fundamental reform and more legislative intervention, these unfair and inflated fees will continue to decimate small business profit margins, increase prices, reduce productivity and possibly lead to closures,” Kelly said. Treasurer Jim Chalmers said the government took the Reserve Bank’s views seriously and would consider its recommendations along with broader industry feedback. “The declining use of cash and the rise of electronic payments means that more Australians are getting slugged by surcharges, even when they use their own money,” he said.\n\nTreasurer Jim Chalmers says the government will consider the recommendations along with broader industry feedback. Credit: Alex Ellinghausen “The RBA’s preliminary view is that surcharging should be removed on debit, prepaid and credit cards, but this should be complemented with measures that reduce costs for the vast majority of small businesses,” Chalmers said. “The RBA expects to be able to implement these changes under its own powers, subject to the outcomes of its consultation.” Payment service provider Square said the proposals would drive fairness, simplicity and competition. “A ban on surcharges is the most practical and balanced outcome. It avoids entrenching the power of the big banks, helps level the playing field for all providers, and ensures competition and choice for businesses,” Square Australia’s executive director Marco Lamantia said. Adrian Lovney, chief payments and schemes officer at Australian Payments Plus, operator of eftpos, welcomed the proposal but warned it would mean businesses had to absorb costs previously covered by surcharges. “The proposed changes will simplify the payment experience for customers and bring consistency across the industry. But it also means merchants will need to absorb these costs, making efficient payment routing and competitive and transparent pricing more important than ever,” Lovney said.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/cricket/series-won-3-0-but-there-were-flops-and-stars-in-the-australian-team-20250715-p5mf13.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Series won 3-0, but there were flops and stars in the Australian team",
        "publish_date": "Tue, 15 Jul 2025 11:49:47 +1000",
        "category": "sports",
        "authors": [
            "Tom Decent"
        ],
        "text": "Made 127 runs from 31.75 from two Tests after missing the first due to a finger injury. His 71 in Grenada was Australia’s top score for the series, which says a lot. His transition back into the team was seamless. Looked great in the first innings in Kingston before a loose shot outside off stump saw him removed for an innings-high 48. Bodes well for the Ashes, even though he didn’t make a massive score. Travis Head goes on the attack in the Third Test. Credit: AP Travis Head: 8.5 The Australian No.5 was the team’s most consistent batsman, recording scores of 59, 61, 29, 39, 20 and 16 to finish the tourists’ highest-run-scorer of the series with 224 runs at 37.33. His two knocks in the first Test in Barbados were crucial in the context of the match. Adds such an important dimension to the Australian order at No.5. Also picked up a wicket in Grenada. Beau Webster: 7.5\n\nThe Tasmanian averaged more with bat (25) than ball (16.2) in a productive series. Would have loved to convert a couple of fifties into centuries but continued to show he truly belongs at Test level. Australia have found themselves a beauty in Webster, whose seamers came in handy on spicy Caribbean pitches. Looking ahead to the Ashes, Webster has put forward a strong case to remain in the XI but team balance will be a factor. Alex Carey: 8 Australia’s wicketkeeper finished second on his side’s runs list with 187 at 31.16. Back-to-back half centuries in Barbados and Grenada were exactly what Australia needed after the top order floundered. Dropped three catches across the series behind the stumps and was subbed out of the final day of the series due to a concussion the night before. Is such a dependable figure in this Australian side. Australia players pose with the trophy after day three of their third Test cricket match against West Indies at Sabina Park in Kingston, Jamaica, Credit: AP Pat Cummins: 8\n\nJust a standard series for Cummins - eight wickets at 18.12. Rarely has a bad Test and chalked up another overseas Test series win as skipper after triumphs in Pakistan, New Zealand and Sri Lanka. Was part of the bold call to leave Nathan Lyon out of the final Test in Kingston and given the Test ended halfway through day three, it was justified based on conditions. Scored 37 more runs in the series than Konstas. Mitchell Starc: 9 Named player of the series after taking 15 wickets at 14.8 and making 46 runs. His 100th Test could not have gone better, with sensational figures of 6-9 and a triple wicket maiden to start a spectacular West Indian collapse in a big Australian win. Brought up 400 Test wickets, becoming just the fourth Aussie to do so since Shane Warne, Glenn McGrath and Nathan Lyon. A brilliant series and looks primed for more Ashes glory. Nathan Lyon: 8 Took nine wickets at 18.12 across two Test before being dropped for the Kingston fixture based on conditions. Snared two wickets in two balls in Barbados to ensure Australia didn’t have to come back for day four. Handed song duties over to Alex Carey on this tour. Whilst disappointing, took his omission from the third Test with grace and was as happy as anyone when Australia rolled the West Indies for 27.\n\nJosh Hazlewood: 9 A great series for the big quick, taking 14 wickets at 14.42, which was the best average by any bowler with more than eight wickets. Now has 26 wickets at 11.84 from five Tests in the West Indies. Loading Josh Inglis: 2 Missed out in his only Test when Smith was injured, making scores of five and 12. Took the gloves on the final day of the tour when Carey was concussed and took a catch with his first delivery behind the stumps in Tests.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/goodfood/melbourne-eating-out/an-all-you-can-eat-korean-barbecue-spot-with-a-sushi-bar-and-an-instant-noodle-station-20250715-p5mf24.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "An all-you-can-eat Korean barbecue spot with a sushi bar and an instant noodle station",
        "publish_date": "Tue, 15 Jul 2025 11:35:45 +1000",
        "category": "finance",
        "authors": [
            "Tomas Telegramma"
        ],
        "text": "Add articles to your saved list and come back to them anytime.\n\nSave this article for later\n\nRemove items from your saved list to add more.\n\nYou have reached your maximum number of saved items.\n\nGrill your own meat at BBQ King in Glen Waverley.\n\n1 / 2 Grill your own all-you-can-eat Korean barbecue at BBQ King. Wayne Taylor 2 / 2 Make your own barbecue. Wayne Taylor Previous Slide Next Slide\n\nKorean$$$$\n\nGrill your own wagyu beef, gochujang-marinated pork belly and heaps more at this all-you-can-eat Korean-barbecue spot. Also find a sushi bar, ready-made hot foods including fried chicken and japchae, and an instant-noodle station. NB: there’s a $15 fee for excessive food waste.\n\nHow much does it cost? 44.90 for weekday lunch; $49.90 for weekday dinner; $49.90 on weekends with a 10 per cent surcharge. 90-minute limit.\n\nWant to visit this venue? Save it in the Good Food app.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/cricket/csi-jamaica-the-forensics-of-the-fastest-five-wicket-haul-in-test-history-20250715-p5meym.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "CSI Jamaica: The forensics of the fastest five-wicket haul in Test history",
        "publish_date": "Tue, 15 Jul 2025 11:31:15 +1000",
        "category": "sports",
        "authors": [
            "Dan Walsh"
        ],
        "text": "By reasonable estimates, Mitchell Starc has left roughly $10 million in IPL dollars on the table over the years, prioritising his Test career over the eye-watering deals of the T20 game.\n\nIn his 100th Test, taking his 400th wicket and obliterating a West Indian batting line-up in Kingston, Jamaica, Starc laughed last, and loudest.\n\nAnd emerged with a series of records and numbers just as staggering as those seven-figure short-form contracts.\n\nWith all the forensics you could ever imagine for a 15-ball spell, this is how Starc took the fastest five-wicket haul in Test history.",
        "source": "SMH"
    },
    {
        "url": "https://www.sbs.com.au/news/article/scrapping-card-surcharge-fees-would-save-australian-consumers-1-2-billion-reserve-bank-says/n6clkayps",
        "title": "RBA wants to scrap surcharge fees, says consumers would save $1.2 billion",
        "publish_date": "Tue, 15 Jul 2025 00:14:36 +0000",
        "category": "finance",
        "authors": [],
        "text": "Australia's central bank wants to remove surcharge fees on both debit and credit cards in a move it expects would save consumers more than $1 billion each year.\n\n\n\n\n\nThe Reserve Bank of Australia's (RBA) review of merchant card payment costs recommends the fees be scrapped on EFTPOS, Mastercard and Visa card transactions as they don't help consumers make more efficient payment choices.\n\n\n\n\n\nLowering the cap on interchange fees paid by businesses — another recommendation of the review — as well would save Australians $1.2 billion.\n\n\n\n\n\nAn interchange fee is paid by a business to a customer's card issuer when a transaction occurs.\n\n\n\n\n\nThe bank's proposals go further than what the federal government has previously suggested .\n\n\n\nREAD MORE Being hit with card surcharges everywhere you go? These are the rules around them\n\nTreasurer Jim Chalmers had said the government was prepared to ban fees on debit card transactions from the start of 2026, but the RBA has included credit cards.\n\n\n\n\n\nConsumers are estimated to pay $1.2 billion in surcharges on payments each year, the equivalent of $60 per card-using adult.\n\n\n\n\n\nScrapping surcharges would also mean consumers don't need to switch between payment methods to try and avoid a fee, the report stated.\n\n\n\n\n\nRBA governor Michele Bullock said both consumers and businesses benefited from the proposal as fewer Australians make cash payments.\n\n\n\n\n\nCustomers would avoid paying surcharges, while businesses would no longer be forced to face high costs of accepting card payments.\n\n\n\n\"We think the time has come to address some of these high costs and inefficiencies in the system,\" Bullock said.\n\n\n\n\n\n\"The payments landscape is always evolving, and it's critically important that we keep pace to ensure it remains safe, competitive and efficient.\"\n\n\n\n\n\nThe RBA proposed removing its own prohibition on \"no-surcharge\" rules to achieve the scrapping of the fees.\n\n\n\n\n\nThe bank expected the card networks would then follow by implementing \"no-surcharge\" rules based on historical experience and arrangements in other jurisdictions.\n\n\n\n\n\nIf that did not occur, the RBA would recommend the federal government legislate to ban surcharge fees.\n\n\n\n\n\nLowering the cap on interchange fees by businesses is predicted to benefit small businesses the most, because they often pay higher fees.\n\n\n\n\n\nThe central bank found small businesses would be $185 million better off under the changes, with 90 per cent of them benefiting.\n\n\n\n\n\nBetter transparency achieved by forcing card networks and large acquirers to publish their charging fees has also been recommended, in a bid for better competition between the networks.\n\n\n\n\n\nBullock predicted the proposals would spark much discussion, particularly among businesses that do surcharge, prompting a six-week consultation period on their plan.\n\n\n\n\n\nAny changes won't kick in until July 2026.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/early-action-urged-on-diabetes-one-of-australias-most-common-killers/laf6ft9kk",
        "title": "Early action urged on diabetes, one of Australia's most common killers",
        "publish_date": "Mon, 14 Jul 2025 22:32:58 +0000",
        "category": "lifestyle",
        "authors": [],
        "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts .\n\n\n\n\n\nTRANSCRIPT:\n\n\n\n\n\n\"Nobody chooses diabetes. Absolutely nobody. There are different types of diabetes: type one diabetes, which is an auto-immune condition and there is no known cure at this time; type two diabetes, which is when the body starts to become resistant to producing insulin. And that comes from a very complex set of circumstances including genetics, family history, environment and lifestyle.\"\n\n\n\n\n\nThat's Diabetes Australia's Group C-E-O, Justine Cain, talking about the often stigmatised disease: diabetes.\n\n\n\n\n\nShe says it can come in different forms and be due to a number of factors outside of diet and lifestyle.\n\n\n\n\n\nAnd she's joining with health experts who are calling for new public health efforts to boost prevention of one of Australia's most common chronic conditions and top killers.\n\n\n\n\n\nMs Cain says there are hundreds of thousands of Australians living with undiagnosed diabetes that could have severe health consequences if left untreated.\n\n\n\n\n\n\"We know that there's about another 500,000 Australians living with silent, undiagnosed diabetes. Many people don't understand the complications that can come with diabetes and they're serious and they're costly. So it's the leading cause of blindness in working age Australians, the leading cause of kidney failure and dialysis in Australia. It increases the risk of heart disease and stroke by up to four times. It's a major cause of limb amputations and it also has a significant impact on individuals mental health.\"\n\n\n\n\n\nThe Australian Bureau of Statistics found that in 2022, diabetes was the seventh most common cause of death in Australia.\n\n\n\n\n\nBetween 2000 and 2021, the number of people living with diabetes in Australia increased almost threefold, from 460,000 to 1.3 million.\n\n\n\n\n\nThe Royal Australian College of General Practitioners wants Australians of all backgrounds to head to the doctor to get an understanding of whether they may have diabetes or could be at risk of developing it further down the line.\n\n\n\n\n\nR-A-C-G-P President Dr Michael Wright says the quicker someone takes the step to get tested and catch the diseases early on, the more likely they are to go on to lead a long life.\n\n\n\n\n\n\"No matter where you live in Australia, there is access to treatment to diagnose diabetes and to treat it if you need to. The most important thing is not to put off getting tested or diagnosed because if you do get it treated, you can have a long and healthy life and we can avoid complications. But the important bit is getting that diagnosis to start with.\"\n\n\n\n\n\nDr Wright says there are proven ways to lower your chances of developing type-2 diabetes through changes in lifestyle and diet.\n\n\n\n\n\n\"We know that if you can maintain a healthy weight, keep up regular physical activity, change unhealthy to more healthy food choices, and if you keep your blood pressure, your cholesterol under control and avoid smoking, we know all of those things help for preventing and reducing your risk of diabetes.\"\n\n\n\n\n\nNew research from the George Institute for Global Health has suggested a couple of key public policy options to discourage the excessive consumption of foods high in added salt and sugar and encourage eating fresh fruits and vegetables, whole grains, nuts and seeds.\n\n\n\n\n\nThe researchers analysed grocery purchasing patterns from 10,000 Australian households over five years and found that food choices were heavily impacted by price.\n\n\n\n\n\nLead author and research associate Tazman Davies says meaningful changes to diets can be achieved by taxing things like sugary drinks and subsidising healthy food.\n\n\n\n\n\n\"So the World Health Organisation strongly recommends that countries consider taxes on sugary drinks. We know that over 100 countries have implemented taxes on sugary drinks, and there's very strong evidence that these taxes can lower people's sugar consumption. So I think if we're getting serious about tackling type two diabetes, I think attacks sugary drinks is a no-brainer. It's never the case that one policy is a silver bullet. We really need a suite of policies to best shift people's diets. And I think subsidies are also needed.\"\n\n\n\n\n\nWhile diabetes can and does impact all Australians regardless of demographics, First Nations communities can be some of the most severely impacted.\n\n\n\n\n\nAccording to the Australian Institute of Health and Wellbeing [[A-I-H-W]], Aboriginal and Torres Strait Islander Australians are three times more likely to develop type 2 diabetes than non-Indigenous Australians and four times as likely to die from it.\n\n\n\n\n\nThe Albanese government implemented a program last month to reduce prices for 30 basic items across 76 remote community stores, bringing them in line with prices in cities.\n\n\n\n\n\nTazman Davies is recommending an expansion of the scheme, and says subsidy policies like this, which make healthy diets more accessible, are likely to meaningfully boost health outcomes.\n\n\n\n\n\n\"I think the obvious place to start is with vulnerable communities. We know in remote areas, that's where the pricing disparities can really be the most acute and fresh fruits and vegetables and whatnot can be double the price. So I think the government has made a good first move subsidising fruits and vegetables via the Outback Stores initiative. These subsidies should produce large gains in fruit and vegetable purchasing.\"\n\n\n\n\n\nIn the meantime, Justine Cain has advised people to go and get checked out - the earlier the better.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/one-third-of-australias-young-workers-report-wage-theft/a1hwxfdak",
        "title": "'It's rife': One third of Australia's young workers report wage theft",
        "publish_date": "Mon, 14 Jul 2025 21:13:14 +0000",
        "category": "finance",
        "authors": [],
        "text": "Cafe worker Mia McDowall was initially shocked to discover she'd been underpaid by thousands of dollars, but soon learnt it's an experience all too common in the hospitality industry.\n\n\n\n\n\nThe 22-year-old has worked for multiple employers who either didn't pay her correctly, forced her to work through legally mandated breaks or didn't pass on deducted superannuation to her fund.\n\n\n\n\n\n\"Wage theft is absolutely rife, for sure,\" McDowall told the Australian Associated Press.\n\n\n\n\n\n\"I know more people my age who have spent any significant amount of time in hospitality that have had wages lost than haven't.\"\n\n\n\n\n\nMcDowall is among more than one in three young workers who report being ripped off, according to the University of Melbourne research released on Tuesday.\n\n\n\nTwo-thirds were forced to pay for work-related items such as uniforms or protective equipment, almost one-third were not paid compulsory super and more than one-third were banned from taking entitled breaks, according to the research.\n\n\n\n\n\nOne in five said they had been paid off the books, almost 10 per cent were paid in food or products and 8 per cent said they never received a pay slip.\n\n\n\n\n\nProfessor John Howe, the study lead, said: \"The extent of all the different ways that people are being denied their entitlements or employers are breaking the law shocked me.\"\n\n\n\n\n\n\"The majority of employers are doing the right thing, but there's obviously a significant proportion of employers cutting corners with their young workers wherever they can.\"\n\n\n\nAbout one-third reported being paid as little as $15 an hour, well below the national minimum wage of $24.95 per hour, but Howe worries the true scale of underpayments could be greater.\n\n\n\n\n\n\"It could be a lot higher, because a lot of workers weren't sure if they were being underpaid,\" he said.\n\n\n\n\n\n\"Vulnerable workers are worried about raising complaints or asking questions about their entitlements because they don't want to jeopardise their job.\"\n\n\n\n\n\nResearchers expected to find exploitation among hospitality workers but also identified workers being ripped off in utilities industries such as gas and water, agriculture, forestry and even unionised workforces, including mining.\n\n\n\n\n\nSome 2,814 workers younger than 30 took part in the survey conducted by the Melbourne Law School as part of its Fair Day's Work project.\n\n\n\n\n\nOnly one in three reported seeking help from a union or body such as the Fair Work Ombudsman, with Howe recalling many expressed helplessness over their situation.\n\n\n\nNow a women's organiser for Trades Hall, McDowall believes her experiences fighting for her minimum entitlements were vital in gaining the skills she needs in her new career.\n\n\n\n\n\nShe encouraged anyone to stick up for themselves, pointing to the Fair Work wage calculator and Young Workers Centre as great places to start.\n\n\n\n\n\n\"It's so important that we are teaching young people how to determine what their pay should be and how to teach people how to have those conversations.\"\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/tour-de-france-australian-duo-miss-podium-in-cruel-stage-10-finish/cnxpkepvv",
        "title": "Tour de France: Australian duo miss podium in stage 10 finish",
        "publish_date": "Mon, 14 Jul 2025 20:04:41 +0000",
        "category": "sports",
        "authors": [],
        "text": "Ben O'Connor and Michael Storer have narrowly missed out on a podium finish at the Tour de France after riding in a breakaway in the mountains of the Massif Central.\n\n\n\n\n\nO'Connor (Jayco AlUla) finished fourth and Storer (Tudor Pro) fifth, so close but so far, after the Aussie duo were unable to match the pace on the last climb of the 165.3km 10th stage.\n\n\n\n\n\nBriton Simon Yates (Visma Lease-A-Bike) won the first mountain stage of this year's Tour while third-placed Irish rider Ben Healy (EF Education-EasyPost) took the yellow jersey, 31 seconds behind him.\n\n\n\n\n\nIn between was Dutchman Thymen Arensman (INEOS Grenadiers), nine seconds behind Yates.\n\n\n\n\n\nO'Connor, who had led several attacks as a 28-strong breakaway was gradually whittled down to five, did not have the legs after those efforts and came in 18 seconds behind Healy with Storer 34 seconds further behind.\n\n\n\nStorer has never been on the podium in the Tour de France, while O'Connor has won one stage, in 2021, when he was fourth overall.\n\n\n\n\n\nThe peloton was more than two-and-a-half minutes behind the quintet, which is how Healy earned yellow. The Irishman, who claimed his first stage victory on Thursday, took the overall lead, 29 seconds ahead of Tadej Pogačar (UAE Emirates-XRG), after driving the breakaway single-handedly in the closing 20km as he sacrificed the possibility of another stage win to become leader.\n\n\n\n\n\nRemco Evenepoel (Soudal-QuickStep) is third in the general classification (GC) standings, 1:29 behind, and Jonas Vingegaard (Visma Lease-A-Bike) is 1:46 behind in fourth. O'Connor's efforts moved him up to 18th, 11.50 behind Healy. He is the leading Australian.\n\n\n\n\n\nThe stage from Ennezat to Le Mont-Dore Puy de Sancy had 4,400m of elevation gain across seven category-two climbs and a category-three ascent, with the usual Monday rest day delayed as 14 July is Bastille Day, a national day of celebration in France that marks the 1789 revolution.\n\n\n\nNew Tour de France overall leader Ben Healy celebrates on the podium after the tenth stage. Source: SIPA USA / David Pintens The break formed after around 10km and solidified after 20km, with Harry Sweeny (EF Education-EasyPost) and Lucas Plapp (Jayco AlUla) making a quartet of Australians involved.\n\n\n\n\n\nSweeny and O'Connor tried to lead an attack with 128km left but were caught. O'Connor went again with 102km, being caught by nine others to form a ten-man breakaway. Sweeny and Storer later joined them as the group grew to 18, but the former was dropped with 55km left.\n\n\n\nStream free On Demand Tour de France 2025 series • cycling series • cycling\n\nThree more attacks by O'Connor reduced the frontrunners to seven with 29km and it was down to five when Yates attacked. Initially, the West Australian went with him, but Yates, who won the Giro d'Italia a few weeks ago, was too strong.\n\n\n\n\n\n\"I was not really expecting any opportunities here,\" said the Englishman. \"We came here fully focused on Jonas [Vingegaard] and the GC, but the stage played out in a way that I could be there for the win.\"\n\n\n\n\n\n\"It was insanely tough, it was a battle against myself really,\" said Healy, who became the first Irishman to wear yellow since Stephen Roche in 1987.\n\n\n\n\n\nHealy, who paid tribute to teammate Sweeny's help, said: \"I gambled a bit. I had the stage win in the bank and how often do you get the opportunity to put yourself into yellow? I felt I had to really go for it.\"\n\n\n\n\n\nFor the latest from SBS News, download our app and subscribe to our newsletter .\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/sugar-alternatives-are-on-the-rise-they-might-not-be-so-sweet-for-the-environment/9gv3a9u1c",
        "title": "Sugar alternatives are on the rise. They might not be so sweet for the environment",
        "publish_date": "Mon, 14 Jul 2025 19:36:52 +0000",
        "category": "finance",
        "authors": [],
        "text": "Artificial sweeteners are popular in Australia, with more than one tonne of them consumed daily across the country and food manufacturers increasingly pivoting to sugar-free soft drinks and confectionery.\n\n\n\n\n\nBut a new study suggests that the environment might be paying the price for the rise of popular sugar substitutes, with the alternatives building up in waterways around the world.\n\n\n\n\n\nThe research, published in the Journal of Hazardous Materials, was led by University of Technology Sydney's Dr Xuan Li.\n\n\n\n\n\nResearchers examined the type and prevalence of artificial sweeteners in wastewater treatment plants across 24 countries, as well as changes in concentration and how effectively they were removed.\n\n\n\n\n\nIt found widely used sugar substitutes are not decomposing, and are turning into 'forever chemicals' that are comparable to polyfluoroalkyl substances (PFAS) in their potential harm to animals and the environment.\n\n\n\nLISTEN TO Not so sweet: explaining the impact of sugar substitutes on the environment SBS News 14/07/2025 04:29 English\n\nPFAS are a group of man-made chemicals commonly used in water-resistant and non-stick items. They have been identified in a growing body of research as a toxin and carcinogen with proven negative impacts on the environment and human health.\n\n\n\nWhy do sweeteners cause a problem?\n\nUnlike natural sugars, artificial sweeteners are designed to resist digestion and not be fully absorbed by the human body. For the same reason, they don’t break down as easily in waterways or on the land, and can enter wastewater systems that aren't equipped to deal with them through standard treatment processes.\n\n\n\n\n\n\"Whatever we are eating will eventually discharge into wastewater and become concentrated in wastewater treatment plants,\" Li said.\n\n\n\n\n\n\"Our treatment plants are not easily able to degrade them as well. So they will be directly discharged into the environment. And this will gradually lead to the accumulation in the environment and eventually effect all the water creatures.\"\n\n\n\nArtificial sweeteners are not fully absorbed by the human body. Source: Getty / Juanmonino/iStockphoto Li said that some fish may die early as a result, and that represented a potentially big problem in the ecosystem.\n\n\n\n\n\n\"The bottom line is anything changing the fish will eventually impact the upper food chain and impact other creatures. We have found algae can be impacted, and they all of a sudden bloom, and all of a sudden die, because of the build-up of artificial sweeteners.\"\n\n\n\nWere all sweeteners equally harmful?\n\nNo. One product scored worst when it came to its ability to decompose (or lack thereof) — sucralose, which is marketed as Splenda in supermarkets around the world. Acesulfame, also known as Ace K, was also harder to remove and was released into the wider environment.\n\n\n\n\n\nTwo other sweeteners, saccharin and cyclamate, were comparatively easy to remove from water, the study found. These four substitutes were found to be the most prevalent artificial sweeteners.\n\n\n\n\n\nOther artificial sweeteners found in wastewater included neotame, stevia and neo hesperidin dihydrochalcone (NHDC).\n\n\n\nWhat could the potential impact be?\n\nLi says its impossible to know how long it will take for the build-up of these microtoxins to have a detrimental impact on humans — and to know how severe that impact could be.\n\n\n\n\n\nShe said that while there has been much focus on PFAS in recent years, artificial sweeteners have a similar \"accumulation pathway\" in our environment and in drinking water, affecting organisms.\n\n\n\nLi said more research needs to happen to determine the impact of sweeteners on our planet, ecosystem and personal health. The study calls for ongoing monitoring, tighter regulations and improved treatment technologies to reduce the potential environmental risks artificial sweeteners pose.\n\n\n\n\n\nIn the meantime, Li said we each have a choice.\n\n\n\n\n\n\"As consumers ourselves, we can think twice when we are trying to purchase a product,\" Li said.\n\n\n\n\n\n\"I know artificial sweeteners can sound very tempting if you're trying to control your blood sugar level, your body weight. But the question is, do we really understand them well enough? If not, maybe the conventional sugary stuff will be a better solution.\"\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/video/treasurer-jim-chalmers-plays-down-leaked-advice-to-raise-taxes-and-cut-spending/9w7rpo2xm",
        "title": "Treasurer Jim Chalmers plays down leaked advice to raise taxes and cut spending",
        "publish_date": "Mon, 14 Jul 2025 10:37:33 +0000",
        "category": "finance",
        "authors": [],
        "text": "Treasurer Jim Chalmers plays down leaked advice to raise taxes and cut spending\n\nPublished 14 July 2025, 9:10 am\n\nLeaked documents show Treasury advised the government to raise taxes and cut spending after the election. It's prompted concerns the sustainability of the budget, and that an ambitious plan to build 1.2 million homes in five years could fail.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/video/blood-donation-centres-introduce-gender-neutral-eligibility/v4uadlcgj",
        "title": "Blood donation centres introduce gender neutral eligibility",
        "publish_date": "Mon, 14 Jul 2025 10:33:40 +0000",
        "category": "lifestyle",
        "authors": [],
        "text": "Blood donation centres introduce gender neutral eligibility\n\nPublished 14 July 2025, 9:09 am\n\nMany gay and bisexual men have long been excluded from donating plasma because of rules developed during the HIV crisis in the 1980s. Those restrictions have been lifted as blood donor centres across the country introduce gender neutral eligibility.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/video/meningococcal-peak-season-begins-experts-warn/gpbujt3zh",
        "title": "Meningococcal peak season begins, experts warn",
        "publish_date": "Mon, 14 Jul 2025 10:30:13 +0000",
        "category": "lifestyle",
        "authors": [],
        "text": "Meningococcal peak season begins, experts warn\n\nPublished 14 July 2025, 9:09 am\n\nExperts are warning young adults and parents of young children to be aware of early symptoms of meningococcal disease, as Australia enters its peak season. The bacterial infection can accelerate rapidly, in many cases causing death or leading to life-changing complications.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/video/australias-largest-military-exercise-talisman-sabre-underway-in-queensland/n9o8cv9tu",
        "title": "Australia’s largest military exercise Talisman Sabre underway in Queensland",
        "publish_date": "Mon, 14 Jul 2025 09:44:08 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/iron-ore-nears-us-100/a7urm9fhb",
        "title": "Iron ore nears US$100",
        "publish_date": "Mon, 14 Jul 2025 07:49:46 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/questions-on-sexuality-and-gender-to-be-part-of-census-trial/waearl3gh",
        "title": "Questions on sexuality and gender to be part of Census trial",
        "publish_date": "Mon, 14 Jul 2025 06:32:21 +0000",
        "category": "finance",
        "authors": [],
        "text": "The first Census questions on sexual orientation and gender will be sent out to thousands of households as part of a practice version of the 2026 nationwide survey.\n\n\n\n\n\nMore than 60,000 homes have been chosen by the Australian Bureau of Statistics to take part in a trial run in August in order to make sure the real event runs without incident.\n\n\n\n\n\nThe test will include questions set to be in the 2026 Census, including the first set of questions in a national Census about sexual orientation and gender for people over 16.\n\n\n\n\n\nQuestions about sexuality were set to be scrapped from the questionnaire, but the federal government backtracked on the decision in 2024 following criticism from LGBTIQ+ groups.\n\n\n\n\n\nHomes in Melbourne and Perth, as well as locations in regional Queensland, NSW and Western Australia, have been chosen for the voluntary test run.\n\n\n\nCensus general manager Jenny Telford said the trial run would be critical to ensuring the nationwide questionnaire would be successful.\n\n\n\n\n\n\"We are testing our collection processes and IT systems to ensure our processes work well and that the form captures the right information, in the right way,\" she said.\n\n\n\n\n\n\"By taking part, you're helping us to improve the next Census for everyone and ensure it produces high-quality statistics.\"\n\n\n\nREAD MORE The questions that will change in Australia's 2026 Census\n\nTesting will also be carried out to allow people to carry out the Census through myGov.\n\n\n\n\n\nThe 2016 Census was beset by technical issues after the website hosting the questionnaire crashed on the night of the survey.\n\n\n\n\n\nThe Census test is to be carried out on 5 August.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/evening-news-bulletin-14-july-2025/e4jzh15vv",
        "title": "Evening News Bulletin 14 July 2025",
        "publish_date": "Mon, 14 Jul 2025 06:12:18 +0000",
        "category": "finance",
        "authors": [],
        "text": "\n\n\n\nListen to Australian and world news, and follow trending topics with SBS News Podcasts .\n\n\n\n\n\nTRANSCRIPT:\n\n\n\n\n\nAnthony Albanese insists he's unafraid to raise difficult subjects with China on his trip there.\n\nSussan Ley says core conservative values will guide the Opposition's new policy platform\n\nChelsea's Cole Palmer with a superstar display in the Club World Cup final\n\n\n\n\n\nPrime Minister Anthony Albanese says he won't be afraid to advocate for detained Australian writer Yang Henjun whilst in China.\n\n\n\n\n\nMr Yang has been detained in China since 2019, and has been sentenced to death, with a two-year reprieve, after an opaque trial on espionage charges.\n\n\n\n\n\nMr Albanese will meet Chinese President Xi Jinping tomorrow\n\n\n\n\n\nHe says his record for advocating for Australians detained overseas in second to none.\n\n\n\n\n\n\" Whether it be here in China, Indonesia, Vietnam, Myanmar, the United States, and the United Kingdom... we have been successful advocating for Australians. And we will always do that.\"\n\n\n\n\n\nBusinessman Andrew Forrest says the debate about Australia's security relationship with China isn't stopping those trying to further Australia's business relationship with China.\n\n\n\n\n\nThe non-executive chairman of mining company Fortescue Metals is amongst the business leaders accompanying Prime Minister Anthony Albanese on his present trip to China.\n\n\n\n\n\nHe says they've met with Chinese steelmakers, raising concerns about dumping.\n\n\n\n\n\nMr Forrest says businesses won't be distracted by big issues like Chinese military forces performing several controversial actions towards Australian personnel, or Australia being in the middle of tensions between the US and China on issues like Taiwan.\n\n\n\n\n\n\"Security becomes a distraction. But for us, we are head down, tail up, stressing that bilateral relationship in the best interests of Australian employment, and every Australian.\"\n\n\n\n\n\nSussan Ley is promising the federal opposition's policy platform will be rebuilt on the traditionally-espoused values of Australia's conservative parties.\n\n\n\n\n\nContinuing her visit to Western Australia, the Opposition Leader says she's listening to community concerns after the Liberal Party's poor showing in May's federal election.\n\n\n\n\n\n\"We will listen. We will stand by our values. So, as we develop policy, it will be through the prism of those values- lower, simpler, fairer taxes, and less regulation.\"\n\n\n\n\n\nMs Ley is flagging energy prices and red tape in the building industry as two areas the opposition wants to focus on.\n\n\n\n\n\nBut when, further pressed on the matter, she has declined to name any specific regulations in Western Australia that are holding up development.\n\n\n\n\n\nThe Defence Force says its current military exercises are showing off the nation's improved long-range defence capabilities.\n\n\n\n\n\nMore than 30,000 personnel from 19 nations, including the United States, are participating in the war-fighting exercises in New South Wales and Queensland, which include live-fire drills, air combat, and maritime operations.\n\n\n\n\n\nIt's the first one of these exercises since Australia received the High Mobility Artillery Rocket System, known as HIMARS.\n\n\n\n\n\nArmy Brigadier Nick Wilson says HIMARS vastly expands what Australian forces are capable of.\n\n\n\n\n\n\"It gives us both a land and maritime strike capability at increased long range, We've gone from an army, most recently, with an indirect fire flange of 20-plus kilometres, to one in excess of 400 kilometres.\"\n\n\n\n\n\nNew questions about sexuality and gender will be part of a trial run of the national census involving more than 60,000 homes ahead of the main event.\n\n\n\n\n\nThe first census questions on sexual orientation and gender will be sent to around 60,000 households chosen by the Australian Bureau of Statistics, part of a practice version of the census to try and make sure the actual census, which will be held on the next year, goes off without a hitch.\n\n\n\n\n\nNext year's census will be first to include questions about sexual orientation and gender for people aged 16 and over.\n\n\n\n\n\nQuestions about sexuality were set to be scrapped from the questionnaire, but the federal government backtracked on the decision in 2024 following criticism from LGBTQI groups.\n\n\n\n\n\nIn football, Chelsea coach Enzo Maresca says midfielder Cole Palmer continues to build his legacy at the club with his star turn in the Club World Cup final.\n\n\n\n\n\nPalmer scored Chelsea's first two goals, and set up their third, in their three-nil win over Paris Saint Germain in the final in the United States.\n\n\n\n\n\nMaresca says Palmer is a player who's at his in the most important matches.\n\n\n\n\n\n\"Yeah, these are the games where we expect Cole to appear, because they are big games, big moments, and, once again, he's shown how good he is.\"\n\n\n\n\n\nPSG coach Luis Enrique has apologised for his role in a scuffle at the final whistle.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/chris-hopes-his-liquid-gold-is-a-step-forward-for-equality/jxkytiifg",
        "title": "After decades of being banned, Chris hopes his 'liquid gold' is 'a step forward for equality'",
        "publish_date": "Mon, 14 Jul 2025 05:53:37 +0000",
        "category": "lifestyle",
        "authors": [],
        "text": "Chris Steel hasn't sat in a donor lounge chair for decades.\n\n\n\n\n\nHe compared his last phone call from Red Cross Australia asking him to donate, \"effectively having to come out again\".\n\n\n\n\n\n\"I had to say, look, I know I can't donate. I'm gay. I'm sorry,\" he told SBS News.\n\n\n\n\n\n\"And you know, it is one of those things that you don't want to have to necessarily confront. It's a difficult conversation to have.\"\n\n\n\n\n\nSteel, who is the ACT treasurer, has been advocating for blood donation services to include donations from gay and bisexual men for years.\n\n\n\n\n\nHe says he is now happy to see the source of angst removed for many.\n\n\n\nFrom Monday, most gay and bisexual men, those using pre-exposure prophylaxis (PrEP) and transgender women will be able to donate plasma nationwide, even if they'd had sex with men in the previous three months, as long as they meet all other eligibility criteria.\n\n\n\n\n\nLifeblood Australia estimates the change affects 600,000 Australians and anticipates an extra 24,000 donors or 95,000 extra plasma donations as a result.\n\n\n\nBan rooted in HIV transmission fears\n\nSkye McGregor, an epidemiologist whose work focuses on surveillance and prevention of sexually transmissible infections and blood-borne viruses at the Kirby Institute at the University of NSW, said the ban stems from the 1980s.\n\n\n\n\n\nShe said fears over transmitting HIV through blood transfusions prompted an urgent health response from Australia and many other countries around the world.\n\n\n\n\n\n\"Australia introduced an indefinite deferral for men who have sex with men, and this because they're the population who've historically been most impacted by HIV,\" she told SBS News.\n\n\n\n\n\n\"There was a three-month or more delay between someone acquiring HIV and a test being able to detect it.\n\n\n\n\n\n\"And so as HIV testing improved over time, the deferral for men who have sex with men decreased from indefinite to 12 months … then in 2021 this was reduced to three months.\"\n\n\n\nFirst-time donor Johannes felt frustrated that he was unable to donate for years. Source: SBS News / Rania Yallop Steel is excited to witness the Therapeutic Goods Administration (TGA) provide a safe pathway for donating the liquid gold and hopes to encourage thousands to donate.\n\n\n\n\n\n\"Gay men are just as altruistic as anyone else,\" Steel said.\n\n\n\n\n\n\"They want to help others, and they've been prevented from doing so; that changes today, and it's really great to see this step forward for equality.\"\n\n\n\nThe service is also working on changes to eligibility for blood and platelet donations after the TGA approved a submission to remove gender-based sexual activity rules.\n\n\n\n\n\nUnder those changes, all donors will be asked the same questions about their sexual activity, regardless of their gender or sexuality.\n\n\n\n\n\nAll donors with new or multiple partners will be prohibited from proceeding if they've had anal sex in the last three months.\n\n\n\nRolling up their sleeves a 'step towards equity'\n\nSince hearing about the rules update, 26-year-old Canberran Ben, who did not give his last name, has been recruiting friends to roll up their sleeves.\n\n\n\n\n\nBen arrived before 9am to be one of the first donors at the launch event on Monday. He said he found the previous guidelines \"a little bit unfair\".\n\n\n\n\n\n\"It's a step towards equity and I think it's a reasonable sacrifice to make,\" he told SBS News.\n\n\n\nFollowing the rule change, Ben (right) has already enlisted six of his friends to donate plasma. Source: SBS News / Rania Yallop Ben was accompanied by Johannes, who works in a Canberra hospital and was motivated to add to the plasma supply after seeing the impact on recipients first-hand.\n\n\n\n\n\n\"I'm at the giving side of blood products, and I know how life-saving it can be to have them, whether that's plasma or red blood cells,\" Johannes said.\n\n\n\n'Felt braver': Life-changing plasma\n\nHayley Teasdale cannot put into words the impact of two small vials of plasma.\n\n\n\n\n\nFor years, a rare primary immune deficiency left her unwell, bedridden and frequently visiting the hospital.\n\n\n\nHayley Teasdale uses two vials of plasma a week, the equivalent of 100 plasma donations, to boost her immunocompromised body. Source: SBS News / Rania Yallop Now, the equivalent of 100 plasma donations a year, has meant she can live a full and active lifestyle and keep up with her three-year-old daughter.\n\n\n\n\n\nTeasdale received her first dose of plasma at the age of 24 and described it as \"life-changing\".\n\n\n\n\n\n\"I felt braver to go out in public spaces.\n\n\n\n\n\n\"I could deal with getting sick now, because I had the support of someone else's immune system, essentially, and that was very powerful.\"\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/liquid-gold-donations-to-flow-after-lifebloods-new-sexual-activity-rules-take-effect/q0xgfujda",
        "title": "'Liquid gold' donations to flow after Lifeblood's new sexual activity rules take effect",
        "publish_date": "Mon, 14 Jul 2025 05:52:02 +0000",
        "category": "lifestyle",
        "authors": [],
        "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts .\n\n\n\n\n\nTRANSCRIPT:\n\n\n\n\n\nThe last time Chris Steel donated blood was decades ago.\n\n\n\n\n\nWhen the Red Cross later called, asking him for another donation, he says it was like coming out all over again.\n\n\n\n\n\n\"I had to say, look, I know I can't donate. I'm gay. I'm sorry. And you know, it is one of those things that you don't want to have to necessarily confront it's a difficult conversation to have.\"\n\n\n\n\n\nThe A-C-T's Treasurer has been pushing for blood and plasma donation rules to be changed since entering politics.\n\n\n\n\n\nToday, he's one of 625,000 Australians now eligible to donate plasma as sexual activity restrictions blocking most gay and bisexual men from giving the liquid part of blood are lifted.\n\n\n\n\n\n\"After the marriage equality non binding plebiscite result and the changes to marriage equality laws, people were looking at other forms of discrimination that existed in society, and this was one that I think a lot of people came up against and recognised, but it wasn't one that could be changed overnight.\"\n\n\n\n\n\nLifeblood estimates the new 'plasma pathway' will lead to an additional 95,000 plasma donations a year.\n\n\n\n\n\nIt marks the end of restrictions that began in the 1980s, as Dr Skye McGregor from the Kirby Institute explains.\n\n\n\n\n\n\"HIV transmission through blood transfusions prompted an urgent public health response. And so Australia, like many countries around the world, introduced an indefinite deferral for men who have sex with men, and this because they're the population who've historically been most impacted by HIV in Australia, and at this time, there was no HIV testing.\"\n\n\n\n\n\nAs HIV testing advanced, the total ban was lifted and replaced with a suspension period.\n\n\n\n\n\n\"The deferral for men who have sex with men decreased from indefinite to 12 months in 2000. And then in 2021 this was reduced to three months since last sexual activity, however, really didn't take into account that there was lower risk groups.\"\n\n\n\n\n\nFrom 14 JULY, potential plasma donors will only be asked one sexual-activity related question, with people who have had sex with someone who have been found to have HIV, hepatitis B or C, or HTLV in the last three months unable to donate.\n\n\n\n\n\nAnd while men and transgender women donating blood will still be asked if they have recently had sex with men, there's a plan for that to end, with a gender neutral screening question to be introduced next year.\n\n\n\n\n\nOnce implemented, all donors will be asked the same questions, with most people in monogamous sexual relationships able to donate.\n\n\n\n\n\nInstead, anyone who has recently had anal sex with new or multiple partners will be unable to donate, regardless of gender.\n\n\n\n\n\nDr McGregor says that reflects the potential risks.\n\n\n\n\n\n\"Unprotected anal sex carries a higher risk of HIV transmission compared to other sexual activities, and this is particularly if it's a receptive anal intercourse, and this is because there's a risk of tears and abrasion in the anal passage, and it makes it easier for HIV to enter the bloodstream.\"\n\n\n\n\n\nFor people like Hayley Teasdale, it's also a big day.\n\n\n\n\n\n\"It's pretty hard to put into words just how important these donations are for my life. Before I received the plasma products, I was incredibly unwell, spending a lot of time in bed in hospital, always recovering from some kind of illness, and I'm able to live a full and active life. I have a job that I love, a family that I get to spend so much time with a beautiful, three year old daughter who keeps me very busy that without this plasma, I would not be able to keep up with it's honestly just given me a whole life I never thought was possible for a while there.\"\n\n\n\n\n\nThe 33 year old relies on 100 plasma donations a year for her medication to treat a rare immune deficiency.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/this-is-why-water-utilities-want-you-to-water-your-plants-with-milk/4t2usuonc",
        "title": "The every day substance Australians are being asked not to pour down drains",
        "publish_date": "Mon, 14 Jul 2025 05:03:24 +0000",
        "category": "finance",
        "authors": [],
        "text": "Key Points Utilities urge people not to tip fats, oils or grease down drains - Sydney Water is making clear that includes milk.\n\nThe fat in milk is a contributing factor to problematic fatbergs that block drains and cost millions to deal with.\n\nThere is an average of about 1300 'chokes' in Sydney's sewage system each month due to contaminants.\n\nThe short shelf life of milk means many Australians have came across milk past its prime and chosen to dispose of it rather than drink it.\n\n\n\n\n\nBut those who have tipped it down the kitchen sink drain are doing it wrong, according to Sydney Water.\n\n\n\n\n\nAustralian residents — not just those in Sydney — are being urged not to pour milk down the drain because of the potential damage it can cause.\n\n\n\nMilk is part of the 'FOG' problem in drains\n\nThe key concern are the fats contained in milk.\n\n\n\nSydney Water's principal manager environment, Ben Armstrong spoke to SBS News about a new campaign that will focus on fats, oils and grease contaminants that should not go into drains. Source: Supplied \"It's all foods or liquids that have fats in that we are keen for people not to put down the drain,\" Sydney Water's principal manager environment, Ben Armstrong, told SBS News.\n\n\n\n\n\n\"It adds to the buildup of fat and what we call 'fatbergs' in the system, and can create a lot of problems.\"\n\n\n\nFatbergs are large accumulations of items that are not designed to be flushed down toilets.\n\n\n\n\n\nCombined with fats, oils and greases — or 'FOGS' — they clump together and can cause blockages in drains. They can weigh in the tonnes and are difficult to pull apart and dislodge.\n\n\n\n\n\nArmstrong said recent Sydney Water survey results showed that 69 per cent of Sydneysiders thought it was okay to tip old milk down the drain.\n\n\n\n\n\n\"That's quite a high percentage, so we're quite keen to raise awareness that the only things we want you to put down the sink is really water, soap and detergent,\" he said.\n\n\n\n\n\n\"It's been something that I guess people don't really realise and they've been doing it for quite a while.\"\n\n\n\nWhile disposing of a small amount of milk down the drain might seem harmless, fats in milk contribute to blockages that have cost millions of dollars to deal with in Sydney in the past nine months alone. Source: Getty / Caner CIFTCI Sydney Water suggests people add water to old milk and pour it on plants.\n\n\n\n\n\nArmstrong said only the three 'P's — pee, poo and paper — should be flushed down toilets, and only water, soap or detergent should go down sinks.\n\n\n\nThe fatberg that stopped a concert\n\nArmstrong said Sydney Water spent $12 million in the nine months to July dealing with 11,805 \"chokes\" in the wastewater system.\n\n\n\n\n\nHe said the total cost of such blockages would likely be about double that if related costs in terms of the clean-up and repairs of cracked and broken wastewater infrastructure were also taken into account.\n\n\n\n\n\nIn February, a blockage caused by a fatberg forced the last-minute cancellation of the concert of Canadian rock singer Bryan Adams, who had been set to play at Perth Arena.\n\n\n\n\n\nFollowing the cancellation, the Water Corporation said the concert had not gone ahead \"due to the risk of sewage backing up within the venue toilets, posing a potential public health risk\".\n\n\n\nThe cumulative effect\n\nPouring a bit of milk down a kitchen drain might seem harmless, but the interconnected nature of drainage systems means it's not.\n\n\n\nProfessor Stuart Khan, head of the School of Civil Engineering at the University of Sydney, said the two main water drainage systems in cities are storm water and sewage drains, with sewage drains dealing with the wastewater from all parts of the household, including kitchens and bathrooms.\n\n\n\n\n\n\"The sewage takes all of the indoors water, so everything that we flush down toilets that comes from the kitchen sink, the bathtub, the showers, they all connect within the household, within the property and then that water then is directed into a municipal sewer, which is the larger pipes that run ... often under the backyards or under the street out the front, and take the water to a sewage treatment plant,\" Khan told SBS News.\n\n\n\n\n\n\"It's a cumulative effect, so it's not so much what a single person does, it's the impact of everybody in a city. Sydney has 5.5 million people — if we're all discharging fats, including the fats in milk down drains, then yes, that can lead to part of the problem further downstream where they all come together and you have the sewage of hundreds of thousands of people accumulating.\"\n\n\n\n\n\nMany Australians would have poured spoiled milk down the sink without a second thought in the past, but the fats in milk are combining with other pollutants in our waste water to form blockages. Source: Getty / Robin Gentry Khan said the issue was not specific to Australia .\n\n\n\n\n\n\"All of the big cities around the world are dealing with this problem,\" he said.\n\n\n\n\n\n\"It does have a huge impact on maintenance needs, therefore it has a big impact on the water utility costs, and they all flow back to customer bills.\n\n\n\n\n\n\"So it's in all of our interests to try to minimise the need for maintenance, to try to minimise sewage spills and overflows which blockages can cause.\"\n\n\n\nGreater public awareness\n\nWhile utilities may not have specifically articulated milk in the past as one of the things not to be put down drains, Khan said it was a good way to get the message across to the general public.\n\n\n\n\n\n\"One of the advantages of talking specifically about milk, is that it has the reaction that I think it's caused here, which is to go, 'oh, right, so that contains fats, what else might contain fats?', so thinking about some of the less obvious sources of fat going down the drain,\" he said.\n\n\n\n\n\n\"I think it is a way of sort of broadening our perspectives on what is okay and what's not okay to flush down the toilet or down the kitchen sink.\"\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.theage.com.au/money/investing/i-m-scared-i-ll-lose-money-if-i-invest-how-do-i-face-my-fear-20250715-p5mf2h.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "I’m scared I’ll lose money if I invest. How do I face my fear?",
        "publish_date": "Tue, 15 Jul 2025 12:11:07 +1000",
        "category": "finance",
        "authors": [
            "Paridhi Jain"
        ],
        "text": "I’ve been looking into investing in ETFs. My big hesitation is fear. I don’t want to lose money. I’ve heard a lot of horror stories, and the news headlines since COVID haven’t been very encouraging, with some kind of recession or economic crisis always around the corner. I keep thinking I should wait until things are more stable, but it’s been some years now, so I guess that’s not going to happen. How do I pull the trigger?\n\nYou’re right. Waiting for things to stabilise isn’t a good idea. That’s like waiting for the waves in the ocean to smooth over before you jump in. It’s against the very nature of the economy and markets. You’ve got to jump in. But how?\n\nInvesting is a bit like having a healthy diet: it isn’t about one specific food, it’s about the balance of what you eat overall. Credit: Simon Letch\n\nSure, there is an element of courage required. But there are things you can be doing to manage and mitigate risk as well, which will help you feel safer to make the jump.\n\nHere are some questions you can ask yourself that will help you de-risk investing.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/goodfood/melbourne-eating-out/an-ex-kafeneion-staffer-heads-up-this-greek-wine-bar-with-a-meze-heavy-menu-in-fitzroy-north-20250715-p5mf2k.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "An ex-Kafeneion staffer heads up this Greek wine bar with a meze-heavy menu in Fitzroy North",
        "publish_date": "Tue, 15 Jul 2025 12:05:44 +1000",
        "category": "finance",
        "authors": [
            "Tomas Telegramma"
        ],
        "text": "Add articles to your saved list and come back to them anytime.\n\nRemove items from your saved list to add more.\n\nYou have reached your maximum number of saved items.\n\nMuses Wine Bar has opened in the former Pinotta space.\n\n1 / 5 Meze plates include taramosalata dip, green chilli kingfish and tirokafteri. Supplied 2 / 5 Dishes include lightly fried calamari with lemon-thyme aioli. Supplied 3 / 5 Fried feta with sesame seeds, and a drizzle of Cretan honey. Supplied 4 / 5 Espresso martini. Supplied 5 / 5 Dips at Muses Wine Bar. Supplied Previous Slide Next Slide\n\nGreek$$$$\n\nGreek restaurant Kafeneion’s former venue manager Yianni Malindretos has struck out on his own, opening wine bar Muses where beloved bistro previously Pinotta stood. It’s a hard act to follow, but Malindretos hopes to fill the void with a laidback venue that locals can use as they please, from spontaneous drinks (raki-spiked cocktail, anyone?) to feasts influenced by his Cretan heritage.\n\nThe meze-heavy menu includes taramasalata, spanakopita, soutzoukakia (baked meatballs), and sesame seed-crusted slabs of feta, served molten with Cretan honey. Youvarlakia avgolemono is a lemony Greek meatball soup. A baklava-tiramisu hybrid – the best parts of both desserts in a nest of kataifi pastry – is “what 90 per cent of diners want to try, even if they’re full,” Malindretos says.\n\nWant to visit this venue? Save it in the Good Food app.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/rugby-union/will-farrell-pick-farrell-for-tests-20250715-p5mf0l.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Will Farrell pick Farrell for Tests?",
        "publish_date": "Tue, 15 Jul 2025 12:01:06 +1000",
        "category": "finance",
        "authors": [],
        "text": "Will Farrell pick Farrell for Tests?\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/rugby-union/is-donaldson-ready-for-wallabies-hot-seat-20250715-p5mf0i.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Is Donaldson ready for Wallabies hot seat?",
        "publish_date": "Tue, 15 Jul 2025 11:59:16 +1000",
        "category": "sports",
        "authors": [],
        "text": "Is Donaldson ready for Wallabies hot seat?\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/business/companies/elon-musk-looks-to-raid-his-empire-for-billions-20250715-p5mezn.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Elon Musk looks to raid his empire for billions",
        "publish_date": "Tue, 15 Jul 2025 11:58:17 +1000",
        "category": "finance",
        "authors": [
            "Stephen Bartholomeusz"
        ],
        "text": "His shareholders, however, want him to devote himself to Tesla, rather than his other ventures (xAI, SpaceX, The Boring Company etc) or politics, where he recently announced plans to launch the America Party to challenge Republicans and Democrats. Now they may be asked to approve a multibillion dollar investment in an AI business that Musk has previously said is developing AI that is quite different to Tesla’s. Tesla has a number of its own issues to deal with. Credit: Bloomberg The companies do have existing links. xAI buys batteries – more than $US200 million of them so far – from Tesla. Its “Grok” chatbox may also be deployed within Tesla’s autos. It’s not, however, the synergies driving Musk’s interest in tapping Tesla’s cash reserves. It’s xAI’s insatiable appetite for cash.\n\nThe AI vehicle is haemorrhaging cash at a rate of more than $US1 billion a month. According to Bloomberg, it expects to burn $US13 billion this year. It has been reported that, in presentations to potential debt and equity providers, it has said it expects to generate about $US500 million of revenue this year (Open Ai’s ChatGPT is forecast to generate nearly $US13 billion) and $US2 billion next year. It doesn’t expect to be profitable until 2027, or become cashflow positive before 2029. Tesla shareholders do tend to invest in Musk the individual as much, if not more, than they do in Tesla’s EV-manufacturing future, so would probably be expected to ratify an investment, or series of investments, in xAI. That means, to continue funding its development, it has to raise a lot of equity and debt. Its rivals – Open AI, Google, Facebook, Anthrophic (backed by Amazon and Google), Google and Meta are all spending vast amounts of cash on their AI models but all of them have access to vast resources. Musk’s xAI has raised a lot of money since launching in March last year, when it attracted $US6 billion at a valuation of only $US18 billion.\n\nIt raised another $US6 billion in December, at a valuation that had jumped to about $US50 billion, and another $US10 billion of equity and debt in March, when xAI merged with Musk’s X social media platform. In that deal, xAI was valued at $US80 billion and the merged entity’s equity base at $US113 billion. Now it’s reported to be looking to attract more debt and equity – another $US5 billion of equity and a similar amount of debt. Loading SpaceX has apparently committed $US2 billion, Saudi Arabia’s sovereign wealth fund, which has an indirect interest in a $US800 million stake in xAI, may contribute and, now, Tesla shareholders will be asked to allow Tesla to inject some of its cash. The valuation range being used for the raising: a whopping $US170 billion to $US200 billion! Not bad for a company valued at less than $US20 billion not that much more than a year ago.\n\nWith about half that cash, if it is raised, expected to be chewed up within three months, it is almost inevitable that xAI’s backers will be asked for further contributions before the end of this year, presumably at an even higher valuation. There is some industrial logic to closer ties, if not a merger (which Musk has ruled out, emphatically) between xAI and its X social media platform and Tesla. Tesla user data and X’s user base could provide cheap or free access to vast amounts of the data needed to train AI models and create a feedback loop that could help the development of Tesla’s own operations, particularly its robots, while Grok could provide an AI interface for Tesla drivers and robotaxi passengers. xAi is bleeding cash at an alarming rate. Credit: Bloomberg While Grok has had its teething problems, partly because of Musk’s determination that it shouldn’t be “woke” – it recently praised Hitler while sharing antisemitic posts on X and said a Holocaust-like response to hatred against whites could be effective – Musk has claimed that it performs better than its rivals.\n\nIt is conceivable that, while the Tesla investment case for supporting xAI’s fund-raising might be less than compelling, with only modest synergies, the argument for a stake simply as a potentially lucrative, albeit risky, investment might appeal to some Tesla shareholders. Loading Tesla shareholders do tend to invest in Musk the individual as much, if not more, than they do in Tesla’s EV-manufacturing future, so would probably be expected to ratify an investment, or series of investments, in xAI. The fact that he has had to tap SpaceX, which is also planning to raise new capital – at a valuation of around $US400 billion – and may access Tesla’s cash, suggests that xAI hasn’t found it easy to attract funds from unaligned investors. Musk has had to turn to his private network and the one listed entity that he, through the force of his personality and record as an entrepreneur rather than his 13 per cent shareholding, effectively controls.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/rugby-union/how-to-unlock-generational-suaalii-20250715-p5mf0k.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "How to unlock 'generational' Suaalii",
        "publish_date": "Tue, 15 Jul 2025 11:57:14 +1000",
        "category": "finance",
        "authors": [],
        "text": "How to unlock 'generational' Suaalii\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/business/companies/airlines-begin-checking-fuel-switches-after-air-india-crash-report-20250715-p5mez5.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Airlines begin checking fuel switches after Air India crash report",
        "publish_date": "Tue, 15 Jul 2025 11:55:42 +1000",
        "category": "finance",
        "authors": [
            "Chris Zappone"
        ],
        "text": "Conjecture about the pilot’s mental health has been criticised by an Indian pilot’s union, the Indian Pilots Guild, which said: “The crew of Al171 deserves a thorough, fact-driven investigation.” The crash of Gatwick-bound Air India flight 171, which occurred seconds after take-off from Ahmedabad, India, on June 12, killed all but one of the 242 passengers and crew. It also killed 19 people on the ground. The safety of the fuel switches has come under scrutiny with the release of the Aircraft Accident Investigation Bureau (AAIB) report on Friday. The bureau said the US Federal Aviation Administration issued an airworthiness bulletin in 2018 “regarding the potential disengagement of the fuel control switch locking feature”. But “the airworthiness concern was not considered an unsafe condition that would warrant [an] airworthiness directive by the FAA”.\n\nLoading The throttle control module of the Air India 787 Dreamliner was replaced on the plane in 2019 and 2023, the AAIB notes. “However, the reason for the replacement was not linked to the fuel control switch. There has been no defect reported pertaining to the fuel control switch since 2023”, the AAIB reported. The Civil Aviation Safety Authority has been contacted for comment. An Australian source with direct knowledge of aviation maintenance including fuel control switches said it was possible a “faulty locking feature of the fuel cut off switches” could be to blame.\n\nIn this case, the problem would result from a switch design that “had a history of wearing out where the two-action positive lock function is lost allowing the switches to be easily and inadvertently [flipped] back to the CUT-OFF to then shut its engine down”. A worn-out fuel control could be switched off either by the brushing of the hand or vibration by the plane, said the source with decades of domestic and international aviation engineering experience, although both would have to be switched. If the switches were the issue, the manufacturers and airlines had a duty to seek information on their performance for future air directives too, said the source. Honeywell, the maker of the switches, said: “We do not comment on rumour or speculation. Any questions on the incident should be directed to the appropriate investigating agencies.” Boeing has been contacted for comment.\n\nUnder the International Civil Aviation Organisation rules, the nation where the accident or incident happened has responsibility for conducting the investigation. To date, the Boeing Dreamliner has had a strong safety record. However, given the safety and production problems linked to the two Boeing 737s Max planes that crashed in 2018 and 2019, the findings of the Air India crash investigation are being closely watched. Dr Geoffrey Dell, head of aviation safety for the AMDA Foundation, said the accident could be the result of an issue with the switches. “Anything is possible. The question is how probable is it.” The problem with the content of the Aircraft Accident Investigation Bureau preliminary report was there was no data included. It was, Dell said, “interpretation information”. Without any other facts, it’s difficult to “draw reasonable or even partial conclusions”, he said.\n\nDell, who is an aviation crash investigator, said it would be unlikely to be a problem with the switches alone because they aren’t designed to be moved accidentally. A pilot would have to adjust them both by accident. Loading The AAIB report states that after the aircraft achieved the maximum recorded airspeed of 180 knots “and immediately thereafter, the Engine 1 and Engine 2 fuel cutoff switches transitioned from RUN to CUT-OFF position one after another with a time gap of 01 sec.” They were found in the on position after the crash. Swinburne University school of engineering department of aviation’s Salim Hijazeen said: “While the switch design and past FAA advisories carry weight, they are unlikely to be the sole cause of the incident.\n\n“What appears more plausible is a convergence of factors – including human performance limitations under high stress, a potential aircraft system issue which required pilot input, and breakdowns in procedural discipline.” In most flight deck operations, especially those involving engine shutdown, “a cross-check and verbal confirmation between pilots is required before any critical input is made,” said Hijazeen. A crane retrieves part of the fuselage of the Air India Boeing 787 in Ahmedabad, India. Credit: Getty Images “The report indicates that the pilot monitoring may not have been aware that the shutdown had occurred, pointing to a significant lapse in crew resource management and situational awareness.” A high workload and pressure may have exacerbated this during the initial take-off roll, he said, “a phase of flight that we still do not fully understand in terms of cockpit dynamics and decision-making”.\n\nDell, the investigator, said that saying pilot error was the cause of the crash is “like saying the accident was caused by gravity. It’s true but not very bloody helpful.” Loading A better question, Dell said, is: “How did the system allow an error to cause a catastrophic loss? “Obviously, there’s a design problem with the mechanics and the human systems built around it.” The Lifeline number for crisis support is 13 11 14.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/business/consumer-affairs/rba-wants-to-ban-credit-and-debit-surcharges-20250715-p5mezv.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘Mirage’: RBA claim that card surcharge ban would save Australians $1.2b provokes industry ire",
        "publish_date": "Tue, 15 Jul 2025 11:52:41 +1000",
        "category": "finance",
        "authors": [
            "Elias Visontay",
            "Shane Wright"
        ],
        "text": "The measures are predicted to save businesses about $1.2 billion per year in fees, with the RBA estimating 90 per cent of businesses will be better off under the proposal. Additionally, the RBA proposal would force credit card networks such as Visa and Mastercard to publish the fees they charge, which in turn will allow the payment service providers such as Square and banks providing payment terminals to compare the deal they are getting. The transparency, according to the RBA, will drive competition and reduce the price payment providers charge businesses for using their services. Reserve Bank of Australia governor Michele Bullock says it is time for an overhaul of the system. Credit: Dominic Lorrimer Card issuers would lose about $900 million a year in revenue under the proposal, the RBA has estimated, but the cap on interchange fees would still be above the processing cost. This could force issuers to increase credit card fees or cut back on reward schemes such as airline points for spending, the RBA warned. “Some issuers may choose to increase cardholder fees or reduce benefits such as rewards points, particularly on credit cards, to boost their profitability in response to reductions in interchange settings. Issuer revenue may also increase if more consumers choose to use credit cards or substitute away from cash use as a result of surcharges being removed,” the RBA said.\n\nPending the outcome of the consultation period, the RBA has powers to implement its proposal by July 2026. However, the RBA lacks enforcement powers, meaning a true legal ban forcing players to follow the bans and transparency rules would need to be legislated by the government. The business community has long argued that banning surcharges would force many merchants to increase the prices of their goods. Loading In its review paper, the RBA played down the extent of any inflationary impact of its proposal, predicting an aggregate increase to consumer prices of about 0.1 per cent, as only around 10 per cent of merchants currently impose payment surcharges. “In any case, this would only be a very small one-off impact on measured inflation; consumers are already paying these costs via payment surcharges (which are not included in the Consumer Price Index) and if these costs are instead fully passed on through higher prices, the final amount paid by the consumer in practice would be similar,” the RBA said.\n\nUnder the proposal, businesses will continue to be able to offer discounts from advertised prices for customers paying cash if and when the card surcharge ban comes into effect. Reserve Bank governor Michele Bullock said “the payments landscape is always evolving, and it’s critically important that we keep pace to ensure it remains safe, competitive and efficient”. Bullock said that key challenges in the payments system today include “difficulties in avoiding card surcharges, as fewer Australians are using cash to pay for things”; “the high cost of accepting card payments, especially for small businesses”; and “difficulties for businesses in comparing or switching payment providers to find better deals”. Loading “Greater transparency can help here. We think the time has come to address some of these high costs and inefficiencies in the system,” Bullock said.\n\nThe Independent Payments Forum Australia blasted the Reserve Bank’s proposal, warning it will “fail to adequately reduce the billions of dollars in fees unfairly levied on Australian small businesses and their customers” and could lead to job losses. The payments forum said small businesses are, on average, paying 300 to 400 per cent more in card fees than the deals big businesses strike with payment service providers. “The proposed regulatory options fail small businesses and the local communities they serve. Rather, they benefit big business, big banks and big offshore companies,” forum co-founder Bradford Kelly said. “This cost is ultimately borne by consumers.” “Without fundamental reform and more legislative intervention, these unfair and inflated fees will continue to decimate small business profit margins, increase prices, reduce productivity and possibly lead to closures,” Kelly said. Treasurer Jim Chalmers said the government took the Reserve Bank’s views seriously and would consider its recommendations along with broader industry feedback. “The declining use of cash and the rise of electronic payments means that more Australians are getting slugged by surcharges, even when they use their own money,” he said.\n\nTreasurer Jim Chalmers says the government will consider the recommendations along with broader industry feedback. Credit: Alex Ellinghausen “The RBA’s preliminary view is that surcharging should be removed on debit, prepaid and credit cards, but this should be complemented with measures that reduce costs for the vast majority of small businesses,” Chalmers said. “The RBA expects to be able to implement these changes under its own powers, subject to the outcomes of its consultation.” Payment service provider Square said the proposals would drive fairness, simplicity and competition. “A ban on surcharges is the most practical and balanced outcome. It avoids entrenching the power of the big banks, helps level the playing field for all providers, and ensures competition and choice for businesses,” Square Australia’s executive director Marco Lamantia said. Adrian Lovney, chief payments and schemes officer at Australian Payments Plus, operator of eftpos, welcomed the proposal but warned it would mean businesses had to absorb costs previously covered by surcharges. “The proposed changes will simplify the payment experience for customers and bring consistency across the industry. But it also means merchants will need to absorb these costs, making efficient payment routing and competitive and transparent pricing more important than ever,” Lovney said.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/cricket/series-won-3-0-but-there-were-flops-and-stars-in-the-australian-team-20250715-p5mf13.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Series won 3-0, but there were flops and stars in the Australian team",
        "publish_date": "Tue, 15 Jul 2025 11:49:47 +1000",
        "category": "sports",
        "authors": [
            "Tom Decent"
        ],
        "text": "Made 127 runs from 31.75 from two Tests after missing the first due to a finger injury. His 71 in Grenada was Australia’s top score for the series, which says a lot. His transition back into the team was seamless. Looked great in the first innings in Kingston before a loose shot outside off stump saw him removed for an innings-high 48. Bodes well for the Ashes, even though he didn’t make a massive score. Travis Head goes on the attack in the Third Test. Credit: AP Travis Head: 8.5 The Australian No.5 was the team’s most consistent batsman, recording scores of 59, 61, 29, 39, 20 and 16 to finish the tourists’ highest-run-scorer of the series with 224 runs at 37.33. His two knocks in the first Test in Barbados were crucial in the context of the match. Adds such an important dimension to the Australian order at No.5. Also picked up a wicket in Grenada. Beau Webster: 7.5\n\nThe Tasmanian averaged more with bat (25) than ball (16.2) in a productive series. Would have loved to convert a couple of fifties into centuries but continued to show he truly belongs at Test level. Australia have found themselves a beauty in Webster, whose seamers came in handy on spicy Caribbean pitches. Looking ahead to the Ashes, Webster has put forward a strong case to remain in the XI but team balance will be a factor. Alex Carey: 8 Australia’s wicketkeeper finished second on his side’s runs list with 187 at 31.16. Back-to-back half centuries in Barbados and Grenada were exactly what Australia needed after the top order floundered. Dropped three catches across the series behind the stumps and was subbed out of the final day of the series due to a concussion the night before. Is such a dependable figure in this Australian side. Australia players pose with the trophy after day three of their third Test cricket match against West Indies at Sabina Park in Kingston, Jamaica, Credit: AP Pat Cummins: 8\n\nJust a standard series for Cummins - eight wickets at 18.12. Rarely has a bad Test and chalked up another overseas Test series win as skipper after triumphs in Pakistan, New Zealand and Sri Lanka. Was part of the bold call to leave Nathan Lyon out of the final Test in Kingston and given the Test ended halfway through day three, it was justified based on conditions. Scored 37 more runs in the series than Konstas. Mitchell Starc: 9 Named player of the series after taking 15 wickets at 14.8 and making 46 runs. His 100th Test could not have gone better, with sensational figures of 6-9 and a triple wicket maiden to start a spectacular West Indian collapse in a big Australian win. Brought up 400 Test wickets, becoming just the fourth Aussie to do so since Shane Warne, Glenn McGrath and Nathan Lyon. A brilliant series and looks primed for more Ashes glory. Nathan Lyon: 8 Took nine wickets at 18.12 across two Test before being dropped for the Kingston fixture based on conditions. Snared two wickets in two balls in Barbados to ensure Australia didn’t have to come back for day four. Handed song duties over to Alex Carey on this tour. Whilst disappointing, took his omission from the third Test with grace and was as happy as anyone when Australia rolled the West Indies for 27.\n\nJosh Hazlewood: 9 A great series for the big quick, taking 14 wickets at 14.42, which was the best average by any bowler with more than eight wickets. Now has 26 wickets at 11.84 from five Tests in the West Indies. Loading Josh Inglis: 2 Missed out in his only Test when Smith was injured, making scores of five and 12. Took the gloves on the final day of the tour when Carey was concussed and took a catch with his first delivery behind the stumps in Tests.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/goodfood/melbourne-eating-out/an-all-you-can-eat-korean-barbecue-spot-with-a-sushi-bar-and-an-instant-noodle-station-20250715-p5mf24.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "An all-you-can-eat Korean barbecue spot with a sushi bar and an instant noodle station",
        "publish_date": "Tue, 15 Jul 2025 11:35:45 +1000",
        "category": "finance",
        "authors": [
            "Tomas Telegramma"
        ],
        "text": "Add articles to your saved list and come back to them anytime.\n\nSave this article for later\n\nRemove items from your saved list to add more.\n\nYou have reached your maximum number of saved items.\n\nGrill your own meat at BBQ King in Glen Waverley.\n\n1 / 2 Grill your own all-you-can-eat Korean barbecue at BBQ King. Wayne Taylor 2 / 2 Make your own barbecue. Wayne Taylor Previous Slide Next Slide\n\nKorean$$$$\n\nGrill your own wagyu beef, gochujang-marinated pork belly and heaps more at this all-you-can-eat Korean-barbecue spot. Also find a sushi bar, ready-made hot foods including fried chicken and japchae, and an instant-noodle station. NB: there’s a $15 fee for excessive food waste.\n\nHow much does it cost? 44.90 for weekday lunch; $49.90 for weekday dinner; $49.90 on weekends with a 10 per cent surcharge. 90-minute limit.\n\nWant to visit this venue? Save it in the Good Food app.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/cricket/csi-jamaica-the-forensics-of-the-fastest-five-wicket-haul-in-test-history-20250715-p5meym.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "CSI Jamaica: The forensics of the fastest five-wicket haul in Test history",
        "publish_date": "Tue, 15 Jul 2025 11:31:15 +1000",
        "category": "sports",
        "authors": [
            "Dan Walsh"
        ],
        "text": "By reasonable estimates, Mitchell Starc has left roughly $10 million in IPL dollars on the table over the years, prioritising his Test career over the eye-watering deals of the T20 game.\n\nIn his 100th Test, taking his 400th wicket and obliterating a West Indian batting line-up in Kingston, Jamaica, Starc laughed last, and loudest.\n\nAnd emerged with a series of records and numbers just as staggering as those seven-figure short-form contracts.\n\nWith all the forensics you could ever imagine for a 15-ball spell, this is how Starc took the fastest five-wicket haul in Test history.",
        "source": "TheAge"
    }
]