[
    {
        "url": "https://www.9news.com.au/world/donald-trump-greenland-takeover-threat-china-russia/9815c98e-11de-4c64-a9d3-681e2df422b6",
        "title": "'Whether they like it or not': Donald Trump's threat to Greenland",
        "publish_date": "Fri, 09 Jan 2026 23:18:37 +0000",
        "category": "finance",
        "authors": [
            "Jan"
        ],
        "text": "\"We are going to do something on Greenland whether they like it or not. Because if we don't do it, Russia or China will take over Greenland, and we're not going to have Russia or China as a neighbour,\" Trump told reporters at the White House while meeting with oil company executives.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/driver-charged-following-dangerous-motorway-stunt/f20f59e5-81f9-4c38-a584-4c6f1eb39e13",
        "title": "Woman charged following dangerous motorway stunt",
        "publish_date": "Fri, 09 Jan 2026 22:26:48 +0000",
        "category": "sports",
        "authors": [
            "Jan"
        ],
        "text": ": Stay across all the latest in breaking news, sport, politics and the weather via our news app and get notifications sent straight to your smartphone. Available on the",
        "source": "9News"
    },
    {
        "url": "https://www.abc.net.au/news/2026-01-10/fa-cup-wrexham-beats-nottingham-forest-on-penalties/106216130",
        "title": "Hollywood-backed Wrexham knocks Premier League side out of FA Cup",
        "publish_date": "Sat, 10 Jan 2026 00:15:45 +0000",
        "category": "sports",
        "authors": [],
        "text": "Second-tier Wrexham — co-owned by Hollywood A-listers Ryan Reynolds and Rob McElhenney — has defeated Nottingham Forest on penalties to reach the fourth round of the FA Cup.\n\nIt is the first time Wrexham has beaten a Premier League side in the FA Cup since 1999.\n\nReynolds was among the 10,063 spectators attending the match at Wrexham's home ground, Stok Cae Ras, with goalkeeper Arthur Okonkwo proving the hero for the hosts.\n\nOkonkwo saved Forest's fifth penalty by Omari Hutchinson to ensure the win.\n\nThe match finished 3-3 after regular and extra time, before Wrexham won 4-3 on penalties.\n\n\"It was amazing to win the game in the end. We just have to enjoy the moment,\" Okonkwo told TNT Sports.\n\nWrexham's Liberato Cacace and Oliver Rathbone scored in quick succession in the first half, and the home side later looked headed for victory with a 3-1 lead in a breathless second term.\n\nForest's Callum Hudson-Odoi struck in the 76th and 89th minutes to level scores, but Wrexham prevailed in the shootout after extra time ended without a goal.\n\nRyan Reynolds was on hand to watch Wrexham defeat Forest. (Getty Images: Carl Recine)\n\n\"The lads rallied themselves, and there were a lot of tired legs on both teams,\" Wrexham manager Phil Parkinson said.\n\n\"Credit to both sides for putting on such a good game after such a busy Christmas schedule.\"\n\nForest manager Sean Dyche gave a scathing review of his starters.\n\nWrexham one step closer to ‘impossible dream’ Wrexham, and celebrity owners Ryan Reynolds and Rob McElhenney are a step closer to achieving the goal of reaching the top-flight Premier League.\n\n\"The first half was completely unacceptable,\" Dyche said.\n\n\"I let the players know this. Certain individuals certainly know. They will have to look in the mirror.\"\n\nWexham's win was another memorable chapter in the rise of the Welsh club, which was bought in 2020 by Reynolds and McElhenney.\n\nThey have overseen Wrexham's rapid ascent from non-league football to the second tier in three seasons.\n\nThe club sits ninth in the Championship and the victory over Forest was its fifth in a row in all competitions.\n\nReuters",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2026-01-10/erin-tassell-first-woman-in-fire-management-role/106214424",
        "title": "Former helicopter firefighter breaks down gender barriers in WA",
        "publish_date": "Sat, 10 Jan 2026 00:07:42 +0000",
        "category": "finance",
        "authors": [],
        "text": "The first time Erin Tassell got into a helicopter as a child, she felt no fear.\n\nThat feeling continued into adulthood, as she hung out of choppers, longlining above bushfires in Canada's Banff National Park.\n\nShe said growing up in a \"forestry family\", there was no shortage of exposure to the industry.\n\nEmergency response work has been Ms Tassell's calling from an early age. (ABC News: Pip Waller)\n\n\"I was going to university and looking for summer work, so I took a job as a seasonal firefighter,\" Ms Tassell said.\n\n\"I think I knew pretty early on that's what I wanted to do, and that's the career I wanted to pursue.\"\n\nMs Tassell as a child in a helicopter. (Supplied: Erin Tassell)\n\nMs Tassell is the first female duty officer at the Department of Biodiversity and Attractions (DBCA).\n\nThe role, traditionally held by men, is responsible for leading Western Australia's bushfire management and emergency incident response, leading the charge with bushfires, whale rescues and other major incidents.\n\nOne extreme to the other\n\nOriginally from Prince George in the Canadian province of British Colombia, Ms Tassell worked as a helicopter-based firefighter before relocating to Australia in 2019.\n\nIt wasn't long before she was living in the Kimberley in WA's north.\n\nMs Tassell has been working in the industry for two decades. (Supplied: Department of Biodiversity, Conservation and Attraction)\n\n\"It was certainly two extremes. I moved from the winter in Canada, where it was very, very cold, to the wet season in the northern parts of Western Australia, where it was very, very hot.\"\n\nThe volunteers risking their lives to keep us safe Volunteer firefighters put their lives on the line for their community, Here's why.\n\nThe DBCA manages around 34 million hectares of land and water, in national and marine parks, state forest and other land.\n\nWorking for the DBCA as a fire aviation manager, Ms Tassell's role was to manage the suppression of bushfires in WA, in conjunction with the Department of Fire and Emergency Services.\n\nIn her new role as state duty officer, which she started in late 2025, she said she managed prescribed burning, bushfire suppression, and other emergencies that arose.\n\nMs Tassell's work oversees a vast expanse of land. (ABC News: Pip Waller)\n\n\"The types of jobs we review are prescribed burns; there could be a call about a potential bushfire that's going on or other types of emergencies like a lost hiker,\" Ms Tassell said.\n\n\" I enjoy the mental challenge that comes with it. It certainly tests a lot of the skills that I have and it's also bringing a lot of skills to my repertoire as well. \"\n\n'Take the leap'\n\nWhile historically, leadership roles in fire and emergency management have been male-dominated, Ms Tassell said there had been growth in the past two decades.\n\n\"It's exciting [to be in the role], and I think it's one of those things where the hope is that I'm the first, but certainly there are more to come,\" she said.\n\nThe experienced firefighter looks forward to the \"mental challenges\" of the new role. (Supplied: Department of Biodiversity, Conservation and Attraction)\n\n\"We need to continue to promote diversity in this space.\n\n\"Take the giant leap of faith. It's a great career with lots of opportunity and support to work in land and fire management.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2026-01-10/wall-blocking-views-on-strahan-waterfront-ridiculed/106209782",
        "title": "A Tasmanian council built a wall. It hasn't gone down well",
        "publish_date": "Fri, 09 Jan 2026 21:16:09 +0000",
        "category": "finance",
        "authors": [],
        "text": "Human history is littered with the remains of big walls.\n\nChina has one. It is quite famous. Germany had one, but they tore it down.\n\nPink Floyd sang about one, and people liked that a lot.\n\nNow Tasmania's West Coast Council has erected its own entry, but locals are not thrilled.\n\nThe wall has prompted criticism and confusion from locals. (Facebook: Jason Hart)\n\nAt least 30 metres long and 3 metres tall, residents say it blocks views of Macquarie Harbour, affects traffic and creates safety issues on the wharf.\n\nIts purpose, they say, is unclear, despite a public meeting held by the council in Strahan on Thursday night.\n\nStrahan locals are worried the wall blocks views of the picturesque waterfront. (Supplied: Strahan Village)\n\nCalls to tear down 'Berlin Wall'\n\nThe wall runs parallel to the Strahan Esplanade and is part of the council's long-held plans to redevelop the waterfront precinct, which has been under construction for the past year.\n\nAlthough the redevelopment was widely supported, residents say they either did not expect a wall at all, or expected it to be much smaller.\n\nA petition calling for more information about the wall was signed by many in the community. (Facebook: Jason Hart)\n\nMore than 300 people have signed a petition calling on the council to address their concerns, prompting Thursday's public meeting.\n\nA member of the public has also parked a trailer with a large outdoor video screen on it, displaying humorous messages about the issue directed at the council.\n\nAn electronic billboard about \"The Very Hungry Wall\" was set up to protest the project. (Supplied: Scott Newett)\n\nProfessional cray fisher Jason Hart said he believed the wall's construction was causing safety issues at the port, which was used by commercial fishing boats and tourism vessels.\n\nHe said the construction had removed one of the vehicle entrances to the wharf, meaning trucks and tourists alike gathered in the same area.\n\n\"It's just a danger the way they've done it,\" he said.\n\n\" It's weird. A total waste of money. A near Berlin Wall, that's what it is. \"\n\nCray fisher Jason Hart says the wall is a \"waste of money\". (Supplied)\n\nHope for progress after meeting\n\nResident Jo-Ann Kerr was at Thursday night's meeting but left still unsure why the wall had been built and what the council was going to do about it.\n\n\"I think the council agreed the wall needs to come down or be substantially renovated to make it a little bit more appealing,\" she said.\n\nStrahan resident Jo-Ann Kerr says the council did appear to agree that change was needed. (Supplied)\n\n\"We're a little bit confused as to the reasons from council as to why it's there.\"\n\nScott Newett also attended the meeting and said he had never seen the community so united in opposition.\n\nHe said the council appeared receptive to their concerns.\n\n\"It was just a total majority of people that were on the same page that they don't like the wall, and they couldn't see the purpose of the wall,\" Mr Newett said.\n\n\" When you have an iconic view that visitors come down to see, you do have to question how we got here. \"\n\nRedevelopment planned since 2015\n\nThe redevelopment of the wharf has been in the works for more than a decade and attracted more than $3.3 million in state and federal funding.\n\nOn its website, the council said it would \"create a modern, accessible public space that celebrates the existing area, making it a vibrant place for locals and visitors to connect\".\n\nIt also said the project would create a new outdoor public space along the waterfront, renew the visitor centre, and relocate some public amenities and car parking.\n\nConstruction updates refer to a \"shelter wall\". (Supplied: West Coast Council)\n\nConstruction updates on the website refer to a \"shelter wall\", which also appears in a photo of the construction site highlighting progress on a large concrete wall.\n\nMr Newett said that the description made no sense, as the wall provided no shelter from the prevailing weather direction.\n\nA 2015 document about the waterfront area discussing existing issues at the wharf refers to a wall, but only as a metaphor for how cruise boats block views when in port.\n\nCouncil agrees to 'look at options'\n\nThe West Coast Council was asked what the purpose of the wall was, how it intended to respond to the community concerns, and whether the wall would potentially be removed or altered.\n\nMayor Shane Pitt says a report will be presented to the next council meeting. (ABC News: Sandy Powell)\n\nIn a statement, Mayor Shane Pitt on Friday said it had been built \"on the advice of experts, including engineers and architects\".\n\n\"The council has now agreed to look at options including potentially reducing its height if it assessed that the wall is required for retainment purposes,\" he said.\n\n\"A report will be presented to council's meeting on 27th January.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2026-01-10/alpha-hpa-gladstone-high-purity-alumina-ai/106213676",
        "title": "The Queensland town taking heat out of the global AI industry",
        "publish_date": "Fri, 09 Jan 2026 21:10:09 +0000",
        "category": "finance",
        "authors": [],
        "text": "Gladstone is one of Queensland's industrial hubs, but now it is also playing a key role in the global AI industry as it pumps out a critical mineral needed to cool high-performance chips used by some of the world's biggest tech companies.\n\nHigh performance chips inside data centres power AI and are used by the likes of the likes of NVIDA, Intel and Amazon.\n\nBut with high computing power comes increased heat that threatens to stall further growth.\n\nTo cool them, large modern data centres need powerful air conditioning systems as well as lots of water. Some large centres require up to 19 million litres per day of water, equivalent to the amount used by a town populated by 10,000 to 50,000 people.\n\nAlpha HPA's processing plant aims to be at the cutting edge of the Ai revolution. (Supplied: Alpha HPA)\n\nHigh-purity alumina produced by rapidly expanding Gladstone-based company Alpha HPA is used in modern chips, also known as semiconductors, to help conduct heat away from critical components.\n\nAlpha HPA employs about 130 people and is building the world’s biggest production facility to refine high purity alumina, using chemicals from Orica and alumina feedstock from Rio Tinto.\n\nIt plans to almost double that workforce over the next year.\n\nWhat is high purity alumina?\n\nThe white substance, which has the consistency of icing sugar, plays a critical role in drawing heat away from the chips that are powering AI, which is projected by UN Trade and Development to be multi-trillion dollar sector by the 2030s.\n\nThe competitive geopolitical battle for critical minerals like HPA has supercharged Alpha HPA's expansion, allowing it to attract millions of dollars in federal and state government funding and financing support.\n\nAlpha HPA's high purity alumina pictured with a semiconductor. (Supplied: Alpha HPA)\n\nAlpha HPA managing director Rob Williamson said HPA was poised to replace silica as a thermal management material in advanced chips, which he said could unlock a huge potential market.\n\n\"It's like an engine in your car, if it runs too hot, performance drops and components fail,\" he said.\n\n\"Computer chips are no different. There is an optimal operating temperature and once you exceed it, performance is impacted.”\n\nQUT professor of technology management and strategy Robert Perrons said even several years ago, modern computer chips were generating more heat output per square unit of area than a steam iron.\n\nHundreds of millions of dollars announced in loans for critical minerals projects Critical minerals projects in Queensland and South Australia will receive hundreds of millions of dollars in federal government loans as part of the government's plan for a \"future made in Australia\".\n\n\"They've continued to get worse,\" Professor Perrons said.\n\n\"The number of calculations that we're asking these chips to perform is just getting astronomical. As a consequence, a lot of heat is generated.\n\n\"How to manage that excess heat has become an extremely important one in chip design. That’s where HPA comes into play because it is great at being an insulator and has much higher thermal conductivity.\"\n\nPhineas Glover is head of APAC ESG and Sustainability at UBS, an investment bank which evaluates sectors and industries.\n\nHe said the growth of AI was pushing data centres and chips to their \"physical limits\".\n\n\"Heat is becoming a major constraint on computing performance,\" he said.\n\n\"We also will need to invest in advanced cooling equipment. But none of this is going to tackle the thermal bottleneck on its own.\"\n\nMr Glover said thermal inefficiency can lead to higher energy expenditure, greater cooling load and growing operational risk.\n\nAlpha HPA managing director Rob Williamson says computer chips do not operate as well when their optimal temperature is exceeded. (Supplied; Alpha HPA)\n\nHe said the success of the technology would be a \"positive development for Australia.\"\n\n\" The country already plays an important role in supplying materials for the energy transition and Al. \"\n\n\"HPA represents a move downstream into high-specification, value-added materials that directly enable advanced technologies.”\n\nUBS analyst Phineas Glover says the success of high purity alumina could be a positive development for Australia. (Supplied: UBS Securities)\n\nLast year, Alpha HPA received $30 million from the Queensland Government's critical minerals and battery technology fund, provided through the Queensland Investment Corporation (QIC).\n\nThat followed a $400 million financing package from the Federal Government's Export Finance Australia and the Northern Australia Infrastructure Facility.\n\nThe company has already commenced commercial sales to semi-conductor manufacturers in Asia and the US, with letters of intent to provide up to 4000 metric tonnes of HPA per annum.\n\nThe company started as a nickel miner in New South Wales after developing a process to extract HPA from ore but relocated to Gladstone in 2021 so it could access chemicals from Orica and feedstock from Rio Tinto to operate its proprietary technology.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2026-01-10/behind-the-scenes-wildlife-carer-need-for-more-volunteers/106197866",
        "title": "'Terrible job to cuddle baby wombats': Behind the scenes as a wildlife carer",
        "publish_date": "Fri, 09 Jan 2026 21:06:11 +0000",
        "category": "finance",
        "authors": [],
        "text": "Wombat poo is famously cube-shaped, but over the past few days Lindy Butcher has discovered it can come in all shapes.\n\nThe two six-month old joeys she's caring for have had bouts of explosive diarrhoea, after coming into her care when their mothers were hit by cars.\n\nThey've been in perfect health for the past few months, but Ms Butcher puts the change in excrement down to the hot weather.\n\n\"Even with the air-con on they don't cope well with the heat,\" she said.\n\nBut it's far from the most challenging aspect of the role she's had to grapple with in the past 30 years as a wildlife carer.\n\n\"It's quite a possibility that they will die, so there's the worry that goes with it,\" she said.\n\n\"It can be soul crushing when you have losses.\n\n\"It can be the loss of an animal that you've only had for an hour, or it can be an animal that you've cared for for three months or for a year, and that can be really hard.\"\n\nLindy Butcher with six-month-old Digby the wombat. (ABC News: Lish Fejer)\n\n'Terrible job having to cuddle baby wombats'\n\nAt about six months old, the joeys would normally be very dependent on their mother, but Ms Butcher said, for now, they were very dependent on her.\n\n\"It's a terrible job having to cuddle baby wombats to make them feel happy. Honestly, a dreadful job,\" she joked.\n\nMs Butcher said the joeys needed to feel safe and, just like any other babies, wanted to go everywhere with their caregiver.\n\n\"I mean it's no hardship though to have a baby wombat with you when you go out to a friend's place for dinner. Nobody complains,\" she said.\n\nPerks aside, Ms Butler said the real reason she began volunteering was to keep Australia's unique wildlife wild.\n\n\"Our volunteers are doing it so that people who live here in Canberra, who love having birds in their garden, echidnas wandering through, waking up to birdsong in the morning, can continue to be amazed by our wildlife and the government can continue to be seen as a government that values the role our wildlife plays socially, environmentally, economically,\" she said.\n\nWildlife carer Sharon releases Cindy the wombat back into the wild. (Supplied)\n\nReptiles 'easier than possums'\n\nMark Jenkins became a volunteer after finishing full-time work.\n\n\"I always knew I wanted to get into working with animals — something completely different from a public service desk job,\" he said.\n\nWhile he'd always been intrigued by reptiles, he had no knowledge or experience in handling them. But, after some initial training, he started with rescues and transport work before gradually moving into hands-on animal care.\n\n\"I found reptiles, to be frank, easier than some of our more challenging animals like possums and birds,\" he said.\n\nMr Jenkins is now the reptile coordinator and treasurer with ACT Wildlife.\n\nHe's currently caring for a turtle who was hit by a car.\n\nThe animal is recovering with Mr Jenkins after a local vet stabilised the bridge of its shell with metal rods and mended the cracks with dental epoxy.\n\n\"It's a great job they've done,\" he said, adding that the female turtle had even been able to lay her eggs.\n\n\"So I'm set up to be a turtle dad again.\"\n\nMr Jenkins said even if Canberrans didn't want to become carers themselves, they should be aware of the environment they live, work and play in and understand the wildlife that's around them.\n\n\"So many of our reptiles come in who have been attacked by people's dogs, cats, garden implements and lawn mowers, as well as car accidents,\" he said.\n\n\"It's not as though we're bringing in animals that would be injured, in the way they are, from the wild. They're injured usually because of human activity.\n\n\"Humans have an obligation, I think, to be aware of that and to do what they can to help with their environment.\"\n\nVet Rachael Grigson and reptile carer Mark Jenkin examine a blue tongue lizard's injury. (ABC News: Lish Fejer)\n\nPeak rescue season\n\nACT Wildlife operates from an unassuming demountable building at Jerrabomberra Wetlands.\n\nThere are enclosures for animals awaiting care, a part-time wildlife vet surgery and a 24/7 call centre helpline that handles about 14,000 calls per year from concerned, and often distressed members of the public wanting to know how to help injured wildlife.\n\nIf an animal needs to come into care or requires treatment, there is a network of volunteer carers, with skills to deal with specific species, that are called on to help.\n\nSummer is peak season for the organisation, with heat and holidays driving up both call volumes and the number of animal casualties.\n\nThough Ms Butcher said demand for ACT Wildlife's services was increasing year-round, as Canberra's population grows and more homes are built.\n\n\"We are pushing them out of their habitats and environments,\" she said.\n\n\"Where are the animals going to go and who's going to provide homes and food for those animals?\n\n\"Those animals have a role to play in the environment, so we need volunteers to grow with that at the same time.\"\n\nACT Wildlife staff with rescued peewee magpie lark. (ABC News: Lish Fejer)\n\nCaring for the carers\n\nPart-time wildlife veterinarian Rachael Grigson has a small clinic at the back on the ACT Wildlife office from where she administers care not only to the wildlife but also the carers.\n\n\"These carers are phenomenal — the work they do, the time they put, the patience,\" she said.\n\n\"I think the thing that people don't realise, and I didn't realise until I started working more with ACT Wildlife, is how much it's run by carers and volunteers that aren't getting paid and are just doing it 24/7.\"\n\nDr Grigson said when people called expecting instant responses, they often did not understand that volunteers were responding between their other life commitments.\n\nShe said looking after the dedicated carers was also a crucial part of looking after the wildlife.\n\n\"I think looking after carers is the most important thing, so we still have carers,\" she said.\n\nMore volunteers needed\n\nWildlife ACT operates out of an unassuming office as it seeks more volunteers to care for animals in need. (ABC News: Mark Moore)\n\nThere are about 40-50 active volunteer carers with ACT Wildlife along with a generous and supportive membership base, but more are always needed.\n\nMs Butcher said that there was a volunteer role to suit every stage of life, with training, mentoring and a community giving carers the skills and support they need.\n\nBut she added that the current cohort of volunteers were not getting any younger.\n\n\"We need to recruit young people who can see that they can fit this into their lives with their families,\" she said.\n\n\"I think for any anybody who volunteers anywhere you find a space for it in your life, and you build your life around that role.\n\n\"People say 'Oh, when I retire, I will.' Don't wait until you retire. You don't have to, we need you now.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2026-01-10/brisbane-international-aryna-sabalenka-defeats-madison-keys/106215886",
        "title": "Sabalenka defeats Keys in Australian Open final re-match",
        "publish_date": "Fri, 09 Jan 2026 20:47:50 +0000",
        "category": "sports",
        "authors": [],
        "text": "Aryna Sabalenka says she is no longer thinking about last year's Australian Open final loss to Madison Keys after defeating the US star at the Brisbane International.\n\nWorld number one Sabalenka found redemption with a 6-3, 6-3 triumph over Keys in their quarterfinal at Pat Rafter Arena on Friday.\n\nSabalenka will meet Karolína Muchová in the semifinals to continue her title defence in Brisbane, after the Czech had earlier defeated third seed Elena Rybakina.\n\nA four-time major singles winner, Sabalenka dominated Keys with her first serve and made just three unforced errors to take the opening set.\n\nA determined Keys recovered from match point down on her serve in the second set, but Sabalenka would not be denied and won in one hour and 29 minutes.\n\nABC Sport will have live coverage of the Australian Open from January 18.\n\nSabalenka has now claimed two straight-sets victories over world number seven Keys since losing last year's Australian Open final in three sets.\n\nThe 27-year-old steamrolled her American rival with a 6-0, 6-1 semifinal win at Indian Wells last year.\n\n\"I know that I lost in Australia against her and that's the big motivation, of course, to go out and to get the win,\" Sabalenka said.\n\n\"But I never stay in the past and never remember things from the previous meeting.\n\n\"I know that I have to be focused from the beginning until the end with her because she's an incredible fighter, and she can come back any time.\n\n\"When I won the match, of course, I was super happy, but I didn't really have the throwback to the Australian Open last year, to be honest.\"\n\nKarolína Muchová ended Elena Rybakina's run in Brisbane. (Getty Images: Bradley Kanaris)\n\nMuchová was the first to reach the semifinals in the women's draw after pulling off a 6-2, 2-6, 6-4 quarterfinal win over world number five Rybakina.\n\nElsewhere, Jessica Pegula beat Liudmila Samsonova 6-3, 7-6 (7/3) and will play in-form Marta Kostyuk in the semifinals.\n\nKostyuk backed up Thursday's straight-sets win over world number three Amanda Anisimova by upsetting teenage star Mirra Andreeva 7-6 (9/7), 6-3.\n\nIn the first of the men's quarterfinals, Aleksandar Kovacevic claimed a 7-6 (7/3), 4-6, 6-3 win over Giovanni Mpetshi Perricard.\n\nThe American will next face compatriot Brandon Nakashima, who beat Raphaël Collignon 6-3, 6-3.\n\nAlex Michelsen made it three Americans into the final four of the men's draw, beating compatriot Sebastian Korda 6-3, 7-6 (9/7).\n\nHe will play top seed Daniil Medvedev, who overcame impressive Polish lucky loser Kamil Majchrzak 6-7 (7/4), 6-3, 6-2 in the late Friday night match on Pat Rafter Arena.\n\nAAP",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2026-01-10/talf-alc-art-gallery-off-strzelecki-track-in-outback-sa/106215944",
        "title": "Talc Alf's eccentric gallery a memorable stop in outback SA",
        "publish_date": "Fri, 09 Jan 2026 20:44:34 +0000",
        "category": "finance",
        "authors": [],
        "text": "Amid the light brown sand and sparse scrub of outback South Australia, up springs Talc Alf's workshop, crafted using salvaged materials and emblazoned with the words \"Reppublic [sic] University of Common Sense\".\n\nAlf sits at his workbench, picks up his tools and sets to work on a chunk of white stone.\n\nHis material of choice? The soft, powdery talc that he has been sourcing around Australia since a stint working with geologists in Bunbury — it is what has given him the nickname he has come to be known by both near and afar.\n\nArmed with a suite of tools, Talc Alf sits down to carve his next piece. (ABC News: Isabella Carbone)\n\nAs Talc Alf takes to the stone with a rasp, clouds of white powder swirl into the hot air, coating everything in its path in a pale cast.\n\nA few steps from his workbench and he is illuminated by the unforgiving outback sun that shines on his outdoor gallery.\n\nOnce the works are finished, they are placed on shelves for visitors to peruse. (ABC News: Isabella Carbone)\n\nThe carved talc sits outside on wood and rusty metal shelves exposed to the elements, with the very fringes of the Gammon Ranges peaking up on the horizon.\n\nTalc Alf's home, gallery and workshop is located just off the Strzelecki Track near Lyndhurst, about 570 kilometres north of Adelaide, and has become a popular stop for tourists on the outback loop.\n\nAlf's gallery is on the outskirts of Lyndhurst. (ABC News)\n\nIt was a long and windy road to Lyndhurst, though.\n\nAlf's family immigrated to Australia from Holland when he was just eight years old.\n\nHis parents and four siblings hopped off the boat in Fremantle to make a new home in Australia, settling on a farm in Margaret River.\n\nAs an adult, he worked odd jobs across Western Australia, Queensland and the Northern Territory, before settling near Lyndhurst in South Australia in 1974.\n\nWhether it was cleaning water troughs on sheep stations or driving backhoes, Talc Alf has given it a spin. (ABC News: Isabella Carbone)\n\nAlong the way, he picked up a geology book that marked different talc deposits around the country.\n\nAlf read an article on First Nations communities in Canada carving soapstone or talc, and was inspired to pick up the tools.\n\n\"I thought, maybe I'll do the same thing myself,\" he said.\n\n\"I was not too keen to stay on the farm for the rest of my life, so I just thought I'd make a living at this carving business.\"\n\nTalc Alf credits a geology book for his knowledge of talc deposits around the country. (ABC News: Isabella Carbone)\n\nIt all starts with smoothing the super soft talc with sandpaper and a rasp, before picking a design.\n\n\"You draw the picture on. It's like doing a painting and then you get the hammer and chisel out and chip it out.\"\n\nThe supple mineral can be shaved down to a smooth surface. (ABC News: Isabella Carbone)\n\nHis talc creations often depict Australiana scenes from fiction, history and anecdotes from folks he has stumbled across in his travels through Australia.\n\n\"I'll get up every day and I [think] I gotta work out something there, and I if I read a good book about it, I'll get a bit of inspiration here or something like that,\" he said.\n\nHis works are often inspired by stories he stumbles across in books and country pubs. (ABC News: Isabella Carbone)\n\nTalc Alf's gallery has now become an attraction for tourists and most days a bus of visitors will pull of the Strzelecki Track connecting Innamincka and Lyndhurst to see what the fuss is all about.\n\n\"They're fascinated … and some of them would come back after a few years.\n\n\"They said, 'We still got your carving sitting on the mantelpiece, been there for the last 20 years' or something and some bring their kids with them.\"\n\nAn empty chair lets visitors know Talc Alf is not in. (ABC News: Isabella Carbone)\n\nWhile his white angular pieces are a focal point of the gallery, Talc Alf has also created his own interpretation of the Latin alphabet.\n\nIt started when he was teaching his daughter to read. He took her onto the light brown sand on their Lyndhurst property.\n\nWith a stick in hand, he drew a vertical line on the sandy ground before adding a circle at the top, describing what he was doing.\n\n\"You started with the letter P, you draw a stroke for the body and you put your head on top of it and put a little smile on and arms and legs — you got P for people,\" he said.\n\n\"That should be taught at schools. It's easy to do.\"\n\nAn ever-present cloud of white talc powder coats Talc Alf's hands. (ABC News: Isabella Carbone)\n\nFrom there, Alf came up with visual explanations and an origin story for each letter in the alphabet and like a philosopher, he will happily wax lyrical about this interpretation.\n\n\"Every letter's a story and it didn't come from England, it came from all over the world, people bought in their ideas,\" he said.\n\nDespite being in his 80s, Alf has no plans to put down the tools or close up shop anytime soon.\n\nHis eccentric gallery remains a memorable stop in South Australia's outback.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2026-01-10/united-cup-australia-loses-to-poland-in-quarterfinals/106215862",
        "title": "Aussies exit United Cup and Poland advances to semis",
        "publish_date": "Fri, 09 Jan 2026 20:38:49 +0000",
        "category": "sports",
        "authors": [],
        "text": "Australia captain Lleyton Hewitt has not offered excuses following the host nation's loss to Poland in the United Cup quarterfinals.\n\nAfter Poland's six-time major champion Iga Świątek thrashed Maya Joint 6-1, 6-1 in the opening singles rubber at Sydney's Ken Rosewall Arena, Alex de Minaur levelled the tie for Australia with a pulsating 6-4, 4-6, 6-4 victory over Hubert Hurkacz.\n\nBut Poland rebounded to win the deciding mixed doubles rubber, with Katarzyna Kawa and Jan Zieliński defeating Storm Hunter and John-Patrick Smith 6-4, 6-0.\n\nPoland will face the United States in the semifinals.\n\nABC Sport will have live coverage of the Australian Open from January 18.\n\nHewitt did not regret resting de Minaur from the mixed doubles, as he wanted to manage the workload of the world number six ahead of the Australian Open, which begins on January 18.\n\n\"Alex was feeling a few tweaks the last few days and he's been doing a lot of training in the off-season to get ready for five-set matches,\" Hewitt said.\n\n\"We decided that the best thing for him, for his body moving forward, was not to put his hand up to play mixed tonight.\n\nJoint gets Barty's backing ahead of Aus Open seeding Teenage star Maya Joint will be the first home women's seed at the Australian Open since former world number one Ash Barty broke a 44-year title drought in 2022.\n\n\"It is tough though, as well to make a decision so quickly, and also if you are that second match to turn around straight away and switch on.\n\n\"And you just don't want to risk injury as well and especially the amount of moving that he had to do tonight against a bloody quality player.\"\n\nDe Minaur delivered for his country in the singles with a tenacious performance against former Wimbledon semifinalist Hurkacz.\n\nHe was forced to dig deep to win the match, having fended off 10 of Hurkacz's 11 break-point chances in an epic encounter stretching two hours and 20 minutes.\n\n\"That's what it took,\" he said.\n\n\"I just had to fight him off from the first point to the last, a huge mental effort.\"\n\nFormer world number one Iga Świątek only conceded two games against Maya Joint. (Getty Images: Brendon Thorne)\n\nŚwiątek had earlier overcome a mysterious meltdown to crush Joint in just 58 minutes to give Poland a 1-0 lead.\n\nBut the former world number one's victory was anything but straightforward.\n\nThe 24-year-old burst into tears at the opening changeover, despite breaking the Australian teenager in the third game for a 2-1 lead, only to return to the court and play on.\n\nŚwiątek gave her courtside teammates a thumbs-up after gaining a double break for a 4-1 lead and barely lost a point in winning six games on the spin to seize the first set.\n\nShe won the second set in equally convincing fashion.\n\nPoland will meet the US in their semifinal on Saturday evening.\n\nBelgium and Switzerland will contest the first semifinal earlier in the day.\n\nAAP",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2026-01-10/parkes-elvis-festival-toki-toyokazu-singing/106209036",
        "title": "English is Toki's second language, but he sings in a classic Elvis drawl",
        "publish_date": "Fri, 09 Jan 2026 20:35:08 +0000",
        "category": "entertainment",
        "authors": [],
        "text": "While English is not Toki Toyokazu's first language, it has not stopped him from stepping into Elvis Presley's iconic blue suede shoes.\n\nHailing from Aomori, Japan, the tribute artist has travelled around the world performing hits from the \"King of Rock and Roll\".\n\nMr Toyokazu is part of a growing international presence at the Parkes Elvis Festival.\n\n\"Singing his songs, [it] makes me friends with people all over the world — no-one is loved as much as he is,\" he said.\n\nLoading...\n\n\"I love it here; it has given me a lot of love.\"\n\nThe Parkes Elvis Festival attracts about 25,000 visitors to the town of about 10,000 people.\n\nThe festival is held annually in the second week of January to coincide with Elvis's birthday.\n\nElvis in Spanish\n\nEnglish is not the first language of busker Rita Marquez either, who grew up in Colombia hearing Elvis's songs in Spanish.\n\nMs Marquez has travelled to the festival for the first time with friends from her home in Gladstone, Queensland.\n\nRita Marquez says the translated version of Blue Suede Shoes became very popular in South America when she was growing up. (ABC News: Lani Oataway)\n\nShe said Elvis's appeal transcends cultures.\n\n\"Elvis is a spirit; the legend that he left is for everybody — for young people, women and men,\" she said.\n\n\" It's a legacy that we receive and share. \"\n\nShe said Elvis's tunes translated literally into her native tongue, which made them easy to sing in both languages.\n\nUp to 28,000 people are expected to attend the Parkes Elvis Festival. (ABC News: Lani Oataway)\n\nA female Elvis\n\nSydney's Maria Phillips started singing from the age of three because of Elvis.\n\nThe \"Platinum Elvis\" tribute artist remembers watching his movies on repeat at her grandmother's house as a child.\n\n\"I stood in front of the TV and did Elvis,\" she said.\n\nMaria Phillips is a tribute artist at this year's Parkes Elvis Festival. (ABC News: Lani Oataway)\n\nThat moment sparked a trajectory that brought Ms Phillips to the Parkes Elvis Festival as one of a few female musicians embodying The King.\n\n\"I think I've sung an Elvis song every day of my life since I was three,\" she said.\n\nMs Phillips sings in the same key as Elvis, but said she does not attempt to replicate his voice.\n\n\"I think as a woman, if you can bring your perspective … and channel it yourself in your way, why not?\n\n\"I hope [Elvis] would be looking down on us grateful that he's not limiting himself to half the population,\" she said.\n\nThe 2026 event celebrates 70 years since the release of Elvis's \"Love Me Tender\" movie. (ABC News: Lani Oataway)\n\nErica Gahan and her two sisters \"all love Elvis\" after being introduced to his music by their parents.\n\nAttending the festival for the first time, they are part of a growing number of women who participate in the busking competition.\n\nErica Gahan busking at the Parkes Elvis Festival in 2026. (ABC News: Lani Oataway)\n\n\"Usually we only perform for our parents in the lounge room, so it is really special,\" Ms Gahan said.\n\n\"It's really nice to be part of that [Elvis] community, it makes us feel less eccentric.\"\n\nWhile Ms Gahan did not see herself on the main stage anytime soon, she was \"really proud\" of women like Maria Phillips.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2026-01-10/nsw-ses-embraces-spontaneous-volunteering-from-mud-armies/106148252",
        "title": "NSW SES to allow people to volunteer for a day when disaster strikes",
        "publish_date": "Fri, 09 Jan 2026 20:10:33 +0000",
        "category": "finance",
        "authors": [],
        "text": "The New South Wales State Emergency Service (SES) has moved to embrace \"volunteers for a day\" to boost its ability to tackle an increasing number of natural disasters.\n\nThe spontaneously formed, community-led \"mud army\" has become synonymous with flood and storm recovery efforts since its inception during the 2011 Brisbane floods.\n\nNow the NSW SES has moved to harness the people power of mud armies differently.\n\nDuring the record-breaking flooding that hit the NSW Mid North Coast in May last year, the SES partnered with the MidCoast Community Flood Response (MCCFR) mud army to respond to the disaster together.\n\nThe May 2025 floods in the Manning Valley broke records. (ABC News)\n\nIn a first-of-its-kind operation, the SES provided training, personal protective gear and insurance to more than 1,200 people wanting to volunteer for short periods.\n\n\"We've seen these types of spontaneous mobilisation of the community during major disasters,\" NSW SES executive Andrew McCullough said.\n\n\" But what separated this event was that partnership with the SES to make the response so much more efficient and effective. \"\n\nMore than 1,200 volunteers joined the MidCoast Community Flood Response mud army during the May 2025 floods. (ABC Mid North Coast: Claire Simmonds)\n\nThe mud army helpers were led by trained SES volunteers to clean out mud and debris from flooded homes.\n\nA group of seven friends gathered to form the MCCFR, creating social media accounts to call for volunteers and support.\n\nSophie Curtis said she felt compelled to do more for her community and joined SES Forster-Pacific Palms after the May 2025 floods. (ABC Mid North Coast: Claire Simmonds)\n\nOrganiser Sophie Curtis managed the operations of the mud army until the SES partnership began.\n\n\"It was truly incredible seeing them really come together; they gave us so much spirit,\" she said.\n\nJapanese social welfare organisations run volunteer centres to support citizens mobilising at disaster sites. (ABC News: Fletcher Yeung)\n\nTsunami-inspired\n\nSetting up community volunteer hubs was a Japanese idea that the SES adopted after Mr McCullough toured world disaster sites on a Churchill Fellowship in 2024.\n\n\"The coordination in Japan, using social welfare councils to bring people together to coordinate teams and to send people out safely to do jobs, is what we've brought back to SES,\" he said.\n\nAndrew McCullough's tour of disaster sites helped develop NSW SES spontaneous volunteering plans. (ABC Illawarra: Sarah Moss)\n\nMr McCullough flew to the country to learn about the response to the Fukushima nuclear power plant disaster in 2011.\n\nHe also visited areas affected by earthquakes, such as Türkiye and Christchurch, parts of Chile devastated by wildfires, and New York to study the city's response to the 9/11 terror attack.\n\nMr McCullough said communities stepped in to lead responses to these disasters — usually through social media — when a government could not provide the level of assistance needed.\n\n\"People can connect online and start these volunteering groups, we've seen this overseas, and this is what happened in Taree where the Mid Coast Community group connected together via social media.\"\n\nMike Wassing says the the onboarding process has been streamlined to enable volunteers to join units faster. (ABC Illawarra: Sarah Moss)\n\nVolunteer boom\n\nNSW SES commissioner Mike Wassing said many of the Mid North Coast's mud army members were among the \"extraordinary\" 500 people who applied to become permanent members of the SES in the aftermath of the floods.\n\n\"We do normally see a bit of a spike in interest in terms of new members coming into the organisation post a disaster, which is tremendous,\" he said.\n\n\"We know from research that local members who are involved in the operations during the response — but also in the earlier parts of recovery — recover quicker, better, and there are fewer mental health [problems],\" he said.\n\nFor the past decade, researchers have urged disaster response agencies to harness people who come forward in times of disasters.\n\nDisaster capacity researcher Blythe McLennan says volunteering rates are not declining, but there is a shift to less formalised volunteering. (ABC Melbourne: Billy Draper)\n\nAustralian Institute for Disaster Resilience manager Blythe McLennan said volunteering rates were not declining.\n\n\"I'd say one of the key trends we're seeing is a shift away from longer-term, high-commitment volunteering towards shorter, more episodic volunteering and more flexible ways of volunteering,\" she said.\n\n\"What I love about the example in Taree is how it's brought together the strengths of the SES and the community mobilisation to create a more effective response for communities, so it's a surge capability for the SES.\"\n\nMCCFR volunteers march into Wingham after the record-breaking Manning Valley floods. (ABC Mid North Coast: Claire Simmonds)\n\nMr McCullough believes partnering with community groups and offering spontaneous volunteering hubs will be a focus for future disasters.\n\n\"We see New South Wales as a state of six million people where almost everyone could be a disaster volunteer in the future,\" he said.\n\nBrodie Mayer and Sophie Curtis founded a disaster response group and have now joined the SES. (ABC Mid North Coast: Claire Simmonds)\n\nMs Curtis and her partner Brodie Mayer's experience with the SES during the Mid-North Coast flood response prompted them to sign up as full-time members at the Forster-Pacific Palms SES unit.\n\n\"I just felt as though that I had more skills to offer and I wanted to formally be involved, not just when there's a crisis,\" Ms Curtis said.\n\n\" There's pretty much not a week that goes by without our unit responding to calls for help in the community, so we love it. \"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2026-01-10/barmy-army-australia-cricket-england-ashes-tourism/106214260",
        "title": "Barmy Army turns Ashes defeat into Australian tourism win",
        "publish_date": "Fri, 09 Jan 2026 20:00:20 +0000",
        "category": "sports",
        "authors": [],
        "text": "It may have been a disappointing Ashes tour for the England cricket team but it wasn't the case for the travelling English supporters, led by the Barmy Army.\n\nIt would be easy to imagine after watching their side lose the Ashes in 11 days, many of them would have packed up and headed home.\n\nYou would have thought wrong.\n\nWith over 35,000 British visitors making their way to Australia for the series, they have not only provided a boost to the atmosphere at the grounds, but to the local economy.\n\nThis has been the biggest tour for the Barmy Army in Australia since they first started. (Getty Images: Cameron Spencer)\n\nThe Barmy Army was founded by two friends for the 1994/95 Ashes in Australia, originally designed as an informal supporter group celebrating the English team.\n\nIt has grown to become one of the largest and most recognisable fan groups in all of global sport.\n\nAnd it is a business that employs staff to deliver different touring packages, and sell merchandise.\n\n\"We have had over 3,000 clients come over here to enjoy the cricket, some have come for seven weeks and some have come for the last week … they've loved all the major cities,\" Barmy Army staff member Neil said.\n\nGary from Cornwall has been part of the travelling supporter base, and says it's been well worth it to join the tour.\n\n\"It's my first time with the Barmy Army, it's a cracking experience. You certainly learn to drink and sing with them,\" he said.\n\nDespite Australia's on-field dominance, visitors continued their travels and made their presence felt across a range of businesses, from hotels and restaurants to retail and entertainment.\n\nEnglish supporters during the A-League game between Perth Glory and Melbourne City at Melbourne Rectangular Stadium. (AAP Image: Joel Carrett)\n\nTim Harcourt, the chief economist at the University of Technology Sydney’s Centre for Sport, said many parts of the country enjoyed the benefits.\n\n\"Many of them take camper vans and travel around Australia so I think it really helps not just the cities where the Tests are but also regional Australia,\" he said.\n\n\"If you are going to go to the Test like a lot of them are, then that means there's more of a chance to help local businesses which have nothing to do with cricket whatsoever. I think the pubs are doing especially well.\"\n\nCricket Australia had estimated losses of up to $30 million from the two-day Perth and Melbourne Tests, but it provided a unique opportunity for Australia's economy.\n\n\"The cricket fans are spending so much money, obviously they are on holiday and adoring the cricket. I think Australia is one of our favourite destinations to come to as well,\" Barmy Army merchandising staff member Beccy said.\n\n\"Regardless of what is going on in the cricket, everybody is singing, chanting and also creating new songs as we go.”\n\nThe Boxing Day Test also helped local codes, with a contingent of the Barmy Army making their voices heard at two A-League Men fixtures and stealing the show with their trademark chants.\n\nBetween September 2024 -2025, UK travellers contributed $2 billion to the Australian economy. (Getty Images: Cameron Spencer)\n\nIt was a massive year of sport throughout Australia in 2025, and it was enjoyed and appreciated by British travellers.\n\nThe British and Irish Lions tour saw a 72 per cent increase in UK visitors in July, and there are estimates that cricket fans have injected hundreds of millions of dollars into the Australian economy over the summer.\n\nIt may not have gone the way the Brits would have liked with the Ashes, but there is no doubt Australia will see them again when the next major sporting event rolls around.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2026-01-10/state-of-disaster-declared-bushfires-victoria/106215462",
        "title": "Live: Trio missing in Victorian fires found safe, as heatwave intensifies across NSW",
        "publish_date": "Fri, 09 Jan 2026 19:54:26 +0000",
        "category": "finance",
        "authors": [
            "Sarah Spina-Matthews",
            "Melissa Brown",
            "Claudia Williams",
            "Yiying Li",
            "Hanan Dervisevic",
            "Millie Roberts",
            "Michael Black",
            "Anna Mcguinness",
            "Coco Veldkamp",
            "Samantha Jonscher"
        ],
        "text": "Victoria's Emergency Management Commissioner Tim Wiebusch says at least 130 structures have been destroyed in bushfires across Victoria, but says that's a conservative figure and may rise.\n\nHe describes them as structures rather than homes.\n\nHe says the most have been in the Ravenswood and Harcourt fires, where at least 50 structures have been destroyed.\n\nHe says people should not return to areas that have been burnt until authorities say so.\n\n\"We don't want tourists, we don't want visitors, we want people to stay safe.\"\n\nWiebusch says assessments continue for the Longwood fire but 30 structures have been confirmed lost.\n\nHe says cropping land, a significant number of livestock and vineyards are also gone.\n\nMeanwhile, a grassfire at Natimuk in Victoria's west has destroyed at least 20 structures and resulted in significant livestock losses.\n\nWiebusch says 10 structures are gone to a fire at Yarroweyah near Cobram.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2026-01-10/china-ban-south-korean-pop-culture-could-lift-amid-warmer-ties/106205780",
        "title": "The Korean Wave may splash back into China amid thawing ties",
        "publish_date": "Fri, 09 Jan 2026 19:45:25 +0000",
        "category": "finance",
        "authors": [],
        "text": "Relations are warming between Beijing and Seoul under South Korea's left-leaning president, Lee Jae Myung.\n\nA high-profile trip to Beijing last weekend was the second meeting between Mr Lee and Chinese President Xi Jinping in less than three months.\n\nThe pair took smiley selfies together on a Chinese Xiaomi smartphone gifted to Mr Lee at their last meeting.\n\nThe summit raised hopes in South Korea that improved ties would lead to the lifting of wide-ranging restrictions on the country's pop culture in China.\n\nSouth Korean singer PSY and Rose, a member of K-pop group Blackpink, performing in Incheon last year. (AP: Ahn Young-joon)\n\nBeijing imposed the de facto ban in 2016 after the US announced it would deploy a Terminal High Altitude Area Defence (THAAD) anti-missile system to South Korea. The THAAD is aimed at defending the country from China's ally North Korea.\n\nSince then, South Korean artists have been barred from lucrative tours in China.\n\nChinese authorities imposed limits on the screening of South Korean films and of its celebrities appearing in advertisements or other broadcasts.\n\nThe relationship between the East Asian neighbours further deteriorated under right-wing president Yoon Suk Yeol, who now faces a raft of criminal charges after he briefly imposed martial law in 2024.\n\nYet over the weekend, the governments of Mr Lee and Mr Xi signed US$44 million ($65.8 million) worth of trade deals and dozens of memorandums of understandings.\n\nOn Chinese social media platform Weibo, one user asked: \"Does this mean the Korean Wave can come back into China?\"\n\nHallyu as successful soft diplomacy\n\nThe Korean Wave, or hallyu, refers to the stratospheric rise in global popularity of Korean popular culture since the 1990s — promoted by an explicit soft power strategy from Seoul.\n\nThe 'quirkiness and subtle darkness' of Korean books captivate Australians While K-lit might seem a world apart from its glitzy juggernaut cousin K-pop, its growing number of Australian fans say it is a thoughtful way to engage with Korean culture.\n\nIts success is undeniable.\n\nSquid Game is Netflix's most-streamed non-English language series of all time.\n\nThe Korean film Parasite became the first foreign-language film to win Best Picture at the Oscars in 2020.\n\nKorean girl group Blackpink are the most-streamed female band on Spotify.\n\n\"Its role in reshaping global perceptions of South Korea has been immense,\" said Sarah Keith, a media lecturer and expert on K-pop at Macquarie University.\n\nSarah Keith says China overturning the Korean culture ban would be a huge win for President Lee Jae Myung. (Supplied)\n\n\"K-pop and K-drama are both powerful instruments of soft power, and may make Chinese consumers more likely to prefer Korean products,\" Dr Keith said.\n\n\" K-pop idols are strong promoters for many types of Korean goods, whether fashion, beauty, food, or tourism. \"\n\nThe Beijing office of the Korea Creative Content Agency, a government body associated with South Korea's cultural ministry, reported last year that \"in China, no Korean dramas have aired since March 2023\".\n\n\"Since early 2024, even the airing of Chinese remakes of Korean dramas has been implicitly restricted,\" it said.\n\nStill, Chinese consumers are able to access Korean dramas, film and music online by using a VPN.\n\nNetflix says Squid Game is the most viewed non-English series in its history. (Supplied: Youngkyu Park/Netflix)\n\nThe 2025 Overseas Hallyu Survey found the average Chinese person surveyed was spending more than 15 hours a month consuming Korean cultural products — around three times longer than respondents in Japan.\n\nThe survey, conducted annually by the Korean Foundation for International Cultural Exchange, found about a quarter of Chinese respondents had seen a Korean film in the past month.\n\nBan to be 'resolved gradually', says Lee\n\nAfter the weekend's leaders' summit in Beijing, Korean officials said China maintained no such ban exists.\n\n\"China maintains that it does not recognise the policy as formally existing,\" Korean national security advisor Wi Sung-lac told reporters, as quoted by The Korea Times.\n\n\"In today's dialogue, there were comments questioning whether it was even necessary to debate its existence,\" he said.\n\n\"That makes it difficult to characterise the situation as entering a clear lifting phase.\"\n\nInstead, the two countries agreed to less politically contested cultural exchanges, including in sport.\n\nSouth Korea's skincare innovation attracts shoppers and Australian brands Once considered niche, K-beauty products are now everywhere — from luxury department stores to local pharmacies and even supermarkets.\n\nPresident Lee was quoted by Korean media as saying the issue would be \"resolved gradually, step by step\".\n\nAccording to Mr Lee, his Chinese counterpart, Mr Xi, likened the situation to the process of ice melting or ripe fruit falling from a tree.\n\nAnd there have already been signs of thawing.\n\nDespite a number of K-pop concerts being cancelled in China last year, the Korean hip hop group Homies managed to play a concert in the Chinese city of Wuhan in April.\n\nAfter a bilateral summit in November, Kim Young-bae from South Korea's ruling Democratic Party said Mr Xi \"responded positively\" to the idea of a major K-pop performance taking place in Beijing.\n\nKorean rap group Homies played their first-ever show in China in April 2025. (Supplied)\n\nState media reported the top destination on the Chinese travel booking site Qunar at the beginning of 2026 was Seoul.\n\nMacquarie University's Dr Keith said a full lift of the Hallyu ban would be a major domestic political victory for Mr Lee.\n\nIt would boost economic confidence in South Korea, especially in sectors particularly reliant on China such as the semiconductor industry, she said.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2026-01-10/grok-ai-undressing-australia-women-children/106213644",
        "title": "Elon Musk limits X's AI image generator over non-consensual sexual imagery",
        "publish_date": "Fri, 09 Jan 2026 18:56:12 +0000",
        "category": "finance",
        "authors": [],
        "text": "Australian users of Elon Musk's X platform are speaking out about non-consensual sexual images of themselves being generated by its artificial intelligence bot Grok at the request of other users.\n\nGrok is a large language model AI bot that has been promoted by X as having fewer safeguards than its competitors.\n\nIn recent days, the bot and X have come under fire, after users started prompting Grok to digitally undress users on X — mostly women — without their consent.\n\nLoading...\n\nOne Australian victim, who goes by Ele online, says she was targeted after she posted on the platform that she did not consent.\n\nThe ABC has decided not to identify Ele or to share the images created of her, to protect her privacy.\n\n\"As soon as I explicitly said that I did not consent and I was not with it, it somehow enraged a bunch of men, who … decided to generate said images,\" Ele told triple j hack.\n\n\"There was one … who generated an image of me in a burqa.\n\n\" There was another who … turned my shirt into a bikini, then to a micro bikini, then to dental floss, and then — to get around Grok's safety features — asked it to cover me in doughnut glaze, which it did. \"\n\nA grok prompt used against Australian erotic model Ele. (Source: X)\n\nEle is a content creator who posts non-nude sexual content on X and on paid subscription sites.\n\nWhen she spoke out about the AI-generated fake images on X, some other users told her she should not complain because of the type of photos she had already posted on the site.\n\n\"I think it's the exact same as telling a woman she shouldn't drink if she doesn't want to be sexually assaulted,\" Ele told hack.\n\n\"Like, yes, this is a risk that is involved with doing a certain type of work, but it shouldn't happen.\n\n\"And I think the men saying that are definitely trying to cover and hide from accountability.\"\n\nEle posted on X after Grok created fake images of her without her consent. (Supplied.)\n\nEle is not alone in being targeted by users on X.\n\nAmerican analytics firm Copyleaks estimated Grok generated roughly one non-consensual sexual image every minute in the 48 hours to December 31.\n\nA separate analysis of Grok requests and posts by European non-profit AI Forensics suggested more than half the images created by Grok contained people in \"minimal attire\", and that 81 per cent of the images were of women.\n\nThe group says it analysed 20,000 Grok-generated images and 50,000 user requests, and found that 2 per cent of the posts appeared to depict people under the age of 18.\n\nIn Australia, the ABC has seen Grok-generated undressed images of at least four Australian politicians.\n\nAI abuse 'no surprise'\n\nDr Joel Scalan, who is a senior lecturer at the Child Sexual Abuse Material Deterrence Centre at the University of Tasmania, says AI companies appear to be bypassing safeguards in the pursuit of profits.\n\nDr Joel Scanlan says AI companies are abandoning safeguards to try and attract more users. (ABC News: Scott Ross)\n\nHe said the issues being raised by X users about Grok were not surprising.\n\n\"We have a culture in tech companies of 'move fast and break things,'\" Dr Scanlan told triple j hack.\n\n\"That's the label they came up with 20 years ago, and it's still very much the case.\n\n\"In the context of AI … anything that they can get into the press to get their platform out there is seen as a bit of a positive.\n\n\" It's profit over protection … [Elon Musk] sees it as being, 'hey, it's free speech, let's just use the tools in any way that we can', however, that doesn't mean there's no societal impact. \"\n\nMusk continues to promote AI tool\n\nX owner Elon Musk addressed concerns about illegal content on the platform in a post earlier this week.\n\nIn the post, he wrote that anyone who used Grok to create illegal content would be punished.\n\nBut since Musk's post, the bot has continued to respond to prompts requesting it to undress women, and in some cases, children.\n\nThe ABC contacted xAI about Grok to ask whether more safeguards would be put in place to protect users, and received what appeared to be an auto-reply: \"Legacy Media Lies.\"\n\nOn Friday, the AI bot began denying user requests for altered images.\n\nIt posted that the image generator had been limited to paying subscribers due to concerns about non-consensual sexual imagery.\n\nGovernments from France and India to the UK have condemned the use of Grok to \"undress\" women without their consent, with UK Prime Minister Keir Starmer calling it a \"disgrace\" and the country's independent communications regulator saying it had made contact with X and xAI about the issue.\n\nIn Australia, a spokesperson for the eSafety Commissioner said eSafety had \"received reporting relating to the use of Grok to generate sexualised images of adults and children\".\n\nThe spokesperson said while some reports were still being assessed, reports of child exploitation material did not \"meet the classification for threshold for class 1 material\" and so no takedown notices had been issued.\n\n\"eSafety remains concerned about the increasing use of generative AI to sexualise or exploit people, particularly where children are involved,\" the spokesperson said.\n\nCan generative AI ever be safe?\n\nFor Australian X users like Ele, the non-consensual images are a sign that X needs to do more to protect its users.\n\nEle says she would like X to give account holders the option to opt out of having their images manipulated by AI.\n\n\"There should be a very strict feature to allow people to opt out … I do not believe if a person is detected by the AI, that the AI should be able to do anything with that,\" she told hack.\n\n\"The platforms should make sure it is not possible unless the person turns on that feature.\"\n\nAt the University of Tasmania, Dr Scanlan said that while it would be technically challenging for companies to offer an opt-out solution, there were other mitigating steps they could take.\n\n\"Large language models are great at understanding the intent of people and what they're asking.",
        "source": "ABC"
    },
    {
        "url": "https://www.smh.com.au/national/victoria/victoria-bushfires-live-concerns-over-out-of-control-blazes-at-longwood-walwa-and-harcourt-after-nervous-night-for-firefighters-dozens-of-homes-destroyed-20260109-p5nsz8.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Victoria Bushfires LIVE: 36 fires rage as State of Disaster declared; Family missing and homes razed",
        "publish_date": "Sat, 10 Jan 2026 13:04:26 +1100",
        "category": "finance",
        "authors": [
            "Ashleigh Mcmillan",
            "Isabel Mcmillan"
        ],
        "text": "A wind change likely to sweep across the Longwood fire ground in Victoria’s north-east today concerns Mansfield mayor Steve Rabie.\n\nFire authorities are continuing to monitor the Longwood blaze, with fears the popular holiday spot of Bonnie Doon could enter the firing line if Saturday’s strong winds alter the bushfire’s direction.\n\nPeople are seen gathered at the Mansfield relief centre on Saturday. Credit: Luis Ascui\n\nRabie’s been at the Mansfield relief centre at the local recreation centre this morning, and is trying to reassure his community ahead of an expectedly smoky day ahead.\n\n“The wind will turn around to the west, and we will be impacted by smoke,” Rabie said.\n\n“People will get very nervous and worried, and that’s where our messaging has to come out. We understand you’re going to get smoke, it will get hazy and it might get uncomfortable.\n\n“Get inside. Turn your air conditioner on if you have to, and wear a mask if you have to.”\n\n“We’ve been practicing those plans, and now the plans have come to fruition. And it’s working extremely well.”",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/victoria/melbourne-nightclub-irked-as-council-workers-captured-removing-10-bottles-from-bins-20251231-p5nqxm.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Melbourne nightclub irked as council workers captured removing 10¢ bottles from bins",
        "publish_date": "Sat, 10 Jan 2026 13:00:00 +1100",
        "category": "finance",
        "authors": [
            "Lachlan Abbott"
        ],
        "text": "Council workers have irked a Melbourne nightclub by removing bottles and cans eligible for 10¢ refunds from their bins.\n\nCCTV footage captured last year shows two men in high-vis vests collecting items from skips in Geddes Lane – behind King Street nightclub Inflation – and stashing them in a City of Melbourne truck.\n\nInflation owner Martha Tsamis said the popularity of Victoria’s container deposit scheme meant people often went through the venue’s recycling for empty drinks containers, which her business set aside to claim refunds for.\n\n“We take time with staff to separate the bottles from rubbish, only to find that council workers are stealing from us, while being paid by the council and using a council vehicle,” she said.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/culture/books/best-selling-australian-author-trent-dalton-withdraws-from-adelaide-writers-week-20260110-p5nt12.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Best-selling Australian author Trent Dalton withdraws from Adelaide Writers’ Week",
        "publish_date": "Sat, 10 Jan 2026 12:59:51 +1100",
        "category": "finance",
        "authors": [
            "Kerrie O'Brien"
        ],
        "text": "One of Australia’s best-selling authors has joined dozens of writers in withdrawing from Adelaide Writers’ Week following the Adelaide Festival board’s decision to remove Palestinian-Australian writer Dr Randa Abdel-Fattah from the line-up.\n\nTrent Dalton, the author of novels including the 2018 smash hit Boy Swallows Universe, confirmed to this masthead on Saturday that he would not take part in the literary festival, but did not offer further comment.\n\nBoy Swallows Universe author Trent Dalton. Credit: Jamila Toderas\n\nThe Adelaide Festival board said on Thursday that, while it was not suggesting “in any way” that Abdel-Fattah or her writing had any connection with the deadly terrorist attack at Bondi in December, given her past statements “it would not be culturally sensitive to continue to program her at this unprecedented time so soon after Bondi”.\n\nWhen asked on Saturday if the writers’ week would go ahead, and how many authors had now pulled out, an Adelaide Festival spokeswoman declined to comment. Dalton’s publisher was also contacted for comment.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/soccer/wrexham-fairytale-continues-after-shock-fa-cup-win-20260110-p5nt13.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Wrexham fairytale continues after shock FA Cup win",
        "publish_date": "Sat, 10 Jan 2026 11:37:31 +1100",
        "category": "sports",
        "authors": [],
        "text": "Wrexham fairytale continues after shock FA Cup win\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/queensland/heritage-listed-woolloongabba-hotel-goes-up-in-flames-for-third-time-20260110-p5nt0d.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Heritage-listed Woolloongabba hotel goes up in flames for third time",
        "publish_date": "Sat, 10 Jan 2026 10:55:55 +1100",
        "category": "finance",
        "authors": [
            "Dominique Tassell"
        ],
        "text": "The Broadway Hotel in Woolloongabba went up in flames for a third time on Friday night, months after a development application was lodged to incorporate the derelict building into a 34-storey tower.\n\nThe 136-year-old hotel on Logan Road was reported alight about 11.40pm, with fire spreading from the ground floor up.\n\nFootage taken by local Sarah Moran shows the fire burning in the front of the building at ground level, as firefighters worked to put it out.\n\nFive fire crews attended the blaze, which was extinguished by 12.30am.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/queensland/broadway-hotel-in-woolloongabba-endures-third-fire-20260110-p5nt0s.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Broadway Hotel in Woolloongabba endures third fire",
        "publish_date": "Sat, 10 Jan 2026 10:30:12 +1100",
        "category": "finance",
        "authors": [],
        "text": "Broadway Hotel in Woolloongabba endures third fire\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/victoria/the-year-that-changed-me-20251219-p5np2c.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "The year that changed me",
        "publish_date": "Sat, 10 Jan 2026 10:09:16 +1100",
        "category": "lifestyle",
        "authors": [],
        "text": "The year that changed me\n\nThe truckie’s plan in case the pills weren’t sufficient was that I had to stay awake to prod him in the ribs if he started nodding off. He wouldn’t share his amphetamines.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/cricket/starc-head-and-carey-were-outstanding-but-they-weren-t-why-australia-hammered-england-20260109-p5nsuh.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Starc, Head and Carey were outstanding, but they weren’t why Australia hammered England",
        "publish_date": "Sat, 10 Jan 2026 09:30:00 +1100",
        "category": "sports",
        "authors": [
            "Malcolm Knox"
        ],
        "text": "The problem with my Best Combined XI from the 2025-26 Ashes is that it only has VI players in it.\n\nTravis Head opens the batting, and then we have Steve Smith as captain coming in at No.4. Alex Carey keeps wicket and bats six. The fast bowlers are Mitchell Starc, Scott Boland and Michael Neser. That’s almost a good indoor cricket team.\n\nI hesitate to add more. There is too great a risk of choosing batsmen who accumulated runs but had minimal impact on the result (Joe Root, Harry Brook, Zak Crawley, Jacob Bethell). And if we include the next-best bowler (Ben Stokes or Josh Tongue, take your pick), we end up with the truly horrifying and morally unconscionable outcome of having more Englishmen than Australians in that hypothetical XI. Which would make me about as competent a selector as England’s.\n\nThe top-heavy nature of the contributions has been held out as proof that this was a low-quality Ashes series. I don’t agree that it was.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/cricket/brendon-mccullum-s-latest-absurd-claim-should-spell-the-end-of-his-tenure-20260110-p5nt08.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Brendon McCullum’s latest absurd claim should spell the end of his tenure",
        "publish_date": "Sat, 10 Jan 2026 09:30:00 +1100",
        "category": "sports",
        "authors": [
            "Oliver Brown"
        ],
        "text": "An alarming sign of Brendon McCullum’s attitude to coaching England came on the Adelaide outfield, where, with Australian players uncorking the champagne behind him and the urn surrendered in record-equalling time, he made his soaring pitch to keep his job. “It’s a pretty good gig, it’s good fun,” he shrugged. “You travel the world with the lads and try to play some exciting cricket and achieve some things.”\n\nHe sounded as if he were describing life on board a cruise ship, where the pursuit of sporting glory was just some trifling distraction from the boys-on-tour vibe. And in return, he expected to keep a minimum £500,000-a-year ($1 million) salary, with zero accountability.\n\n‘It’s a pretty good gig’: Brendon McCullum in Adelaide after England’s defeat left them 3-0 down in the Ashes. Credit: Getty Images\n\nAny serious organisation would be disabusing him of this delusion today. But the message from the England and Wales Cricket Board is that it is still on board with Baz, that Baz is capable of cultural evolution, that there will simply be a few quiet, behind-the-scenes tweaks before the grand unveiling of Bazball 2.0. Until the past 24 hours, this position might just have been tenable.\n\nNot now, though. Not after the exposure of a culture so dismally amateurish that Harry Brook, the white-ball captain, felt at liberty on the night before a one-day international against New Zealand to go to a nightclub, with that bone-headed decision leading to him being punched by a bouncer.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/queensland/mother-and-two-young-girls-injured-in-sunshine-coast-crash-identified-20260109-p5nsyw.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Medical episode theory in horror crash that put two girls in hospital",
        "publish_date": "Sat, 10 Jan 2026 09:09:03 +1100",
        "category": "finance",
        "authors": [
            "Dominique Tassell"
        ],
        "text": "A truck driver who crashed into four cars may have suffered a medical episode, emergency services said.\n\nOne of the cars, with a mother and two young girls inside, was pinned to a construction site after being rear-ended.\n\nThe girls – Ineza, 3, and one-year-old Itahe – were travelling with their mother, identified as Denyse, when a truck crashed into their vehicle about 11.45am on Thursday on Banya Avenue in Banya, south-west of Caloundra.\n\nThe three-year-old suffered critical head and chest injuries and was flown by helicopter to Queensland Children’s Hospital.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/lifestyle/princess-of-wales-marks-her-44th-birthday-20260110-p5nt05.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Princess of Wales marks her 44th birthday",
        "publish_date": "Sat, 10 Jan 2026 08:15:24 +1100",
        "category": "lifestyle",
        "authors": [],
        "text": "Princess of Wales marks her 44th birthday\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/north-queensland-community-told-to-prepare-for-destructive-weather-20260110-p5nt03.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "North Queensland community told to prepare for destructive weather",
        "publish_date": "Sat, 10 Jan 2026 07:53:28 +1100",
        "category": "finance",
        "authors": [],
        "text": "North Queensland community told to prepare for destructive weather\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/state-of-disaster-declared-in-parts-of-victoria-20260110-p5nt00.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "State of disaster declared in parts of Victoria",
        "publish_date": "Sat, 10 Jan 2026 07:24:58 +1100",
        "category": "finance",
        "authors": [],
        "text": "State of disaster declared in parts of Victoria\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/nsw/my-best-beach-20251229-p5nqk2.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "My best beach",
        "publish_date": "Sat, 10 Jan 2026 06:25:09 +1100",
        "category": "finance",
        "authors": [],
        "text": "Opinion\n\nThe scene of unimaginable terror on December 14, Bondi is Australia’s most iconic beach. NSW Minister for Water Rose Jackson, born and bred in the eastern suburbs, reflects on why Bondi will endure as the dynamic beating heart of our city.",
        "source": "SMH"
    },
    {
        "url": "https://www.sbs.com.au/news/article/heatwaves-sydney-vulnerability-disadvantage-urban-heat-island/jqibb44oo",
        "title": "'We need to adapt': Heatwaves are dividing cities and 'amplifying' vulnerability",
        "publish_date": "Fri, 9 Jan 2026 19:33:59 +0000",
        "category": "finance",
        "authors": [],
        "text": "Parts of the country have been sweltering through a heatwave that's set to continue in Sydney this weekend, with temperatures of around 42C expected on Saturday.\n\n\n\n\n\nBut urban heat is not distributed equally. In some parts of Sydney — particularly the western suburbs, where temperatures during heatwaves can be several degrees higher than in the east — the forecast for Saturday is even warmer.\n\n\n\n\n\nThe impacts of heat inequality are exacerbated during a heatwave. So why do some suburbs experience that heat more acutely, and can anything be done about it?\n\n\n\nWhy is it hotter in some suburbs than others?\n\nWhile western Sydney is frequently cited as an example of geographical heat inequality, similar dynamics can be observed in other parts of the country, such as Melbourne and Adelaide, with inland suburbs experiencing heatwaves more intensely than their coastal counterparts.\n\n\n\nRiccardo Paolini is an associate professor at UNSW's School of Built Environment. He said a combination of factors leads to some parts of a city being more vulnerable to heat than others.\n\n\n\n\n\nIn Sydney's case, he said the primary factor driving higher temperatures in the west compared to the coast during heatwaves was advection, hot air flowing from inland areas, blocking cooling sea breezes from reaching western suburbs.\n\n\n\n\n\n\"During a heat wave, this hot front penetrates farther and farther, up to the inner west, and therefore you have a greater prevalence of the heat wave over the western suburbs,\" he told SBS News.\n\n\n\n\n\nThis is compounded by the 'urban heat island' effect, in which urban areas are significantly warmer than rural areas due to the high density of hard surfaces, like buildings and roads that retain more heat than greener spaces.\n\n\n\n\n\nThese include pavements made of asphalt and concrete and dark roofing on houses and other buildings, combined with insufficient vegetation, green space and shade, particularly around homes.\n\n\n\n\n\n\"These very, very dark surfaces heat the air like the bottom of a pot heats the water when you're cooking pasta,\" Paolini said.\n\n\n\nWhy does it matter?\n\nThis increased vulnerability can have varied and significant effects on the individual and broader society, and can overlap with populations that experience socio-economic disadvantage, such as western Sydney.\n\n\n\n\n\nOllie Jay is a professor of heat and health at the University of Sydney.\n\n\n\n\n\nHe told SBS News that while there are areas that get hotter temperatures, often amplified by the built environment, it's also important to consider populations with higher vulnerability.\n\n\n\n\n\n\"So you've got people there that are more vulnerable to that level of heat stress,\" he said.\n\n\n\n\n\n\"People who are older, people who have a chronic disease, often people who don't have access to air conditioning, or all three of those things put together.\"\n\n\n\nLISTEN TO Nearly seven million Australians at risk from urban fires, new report warns SBS News 04:39 English\n\nAccording to advocacy group Sweltering Cities, renters and low-income households are more likely to live in homes that don't provide good natural insulation or cooling, nor have access to cooling options such as air conditioning.\n\n\n\n\n\n\"A lot of people who are most vulnerable to the heat actually don't have access to air conditioning,\" Jay said.\n\n\n\n\n\nPaolini said there was a correlation between high outdoor temperatures and physical activity, and that at a certain threshold, people simply stay at home or other indoor spaces that are cool.\n\n\n\n\n\n\"There's the effects of spending more money for electricity, bills for those who have air conditioning,\" he said.\n\n\n\n\n\n\"There's the sleep divide between coastal areas and inland areas, where people living in western suburbs have poorer sleep quality because of extreme heat during this period.\n\n\n\n\n\n\"It's getting worse over time.\"\n\n\n\n\n\nOne of the ways heat inequality is most acutely felt is when it comes to health.\n\n\n\n\n\n\"If we just think about the hospital cases [during a heatwave], both mortality and morbidity, then what we really see is that all of those numbers are massively amplified in people who are elderly … and people who have chronic diseases such as heart disease, kidney disease,\" Jay said.\n\n\n\nREAD MORE The reality virtually no Aussie can escape when a heatwave hits\n\nJay pointed out that beyond heat-related deaths, there were many other negative impacts below the surface when it came to negative health outcomes.\n\n\n\n\n\n\"You've got these other things that are happening inside the body when you get hot. It's not just your high body temperature. It's the fact that your heart has to work a lot harder to keep cool when you're exposed to the heat,\" he said.\n\n\n\n\n\n\"If you've got heart disease, that makes you much more susceptible to a heart attack. If you've got kidney disease, you're at much greater risk of kidney failure if you have dehydration. It's really quite complex and deep, broad impacts on human health and wellbeing across the lifespan.\"\n\n\n\n\n\nAs it stands, urban heat equality is set to intensify as the effects of climate change become more severe — with ocean temperatures continually rising and even less cooling sea breezes.\n\n\n\n\n\nPaolini said Australian heatwaves are starting to more closely resemble those in Europe, which have excess heat-related mortality during extended heatwaves.\n\n\n\n\n\n\"So they don't have [temperatures of] 48C, as in Penrith, but they have eight days in a row when the night temperature doesn't drop below 28C or 30C, or even 32C in some cities. If you don't have air conditioning, this means that you cannot sleep, and then people who already have pre-existing medical conditions are exposed,\" he said.\n\n\n\n\n\n\"It's looking to a not-so-nice future for us, because urbanisation is increasing, density is increasing. With poor planning, that's where we are headed.\"\n\n\n\nWhat can be done?\n\nIn Sydney’s west, there's been a growing push to plant more trees and increase tree canopy coverage to combat the urban heat island effect and reduce the impact of heatwaves.\n\n\n\n\n\nPaolini said that while councils have focused on increasing the targets for tree canopy coverage, \"in reality it's decreasing, because a lot of new developments, these urban sprawl developments, they chop off every tree and then they put out a few broomsticks without any room for the roots to grow\".\n\n\n\n\n\n\"After 10 years, the tree is still a broomstick,\" Paolini said. \"This means that the tree is not casting shadow over the street, and this means that the asphalt is absorbing a lot of solar radiation that then is dissipated by convection, so warming up there ... People want bigger houses, and this is eating up the space for the tree roots. That's a reality.\"\n\n\n\n\n\nMore broadly, Paolini pointed to projects like the Greater Sydney Heat Smart City Plan — led by council and contributed to by several research groups — aiming to mitigate extreme heat impacts across the region.\n\n\n\n\n\nHowever, he said a lot of governance structures are fragmented, despite the problem being regional.\n\n\n\n\n\n\"So even if you put all your best landscaping and all the best urban planning in one council area, it will improve the situation, but it's like operating the air conditioning with the windows open.\"\n\n\n\nPaolini said positive steps included a decrease in dark roofing as, since 2022, the National Construction Code included provisions for a minimum level of solar reflectance for new houses built. There's also a maximum solar absorptance — the amount of solar heat a roof takes in — of 64 per cent for new housing.\n\n\n\n\n\n\"It's a good start. The problem is, what do we do with what has already been built over the previous 50 years?\"\n\n\n\n\n\nJay said it was vital that steps be taken to mitigate the \"steady march\" of climate change, such as decarbonising the economy and committing to the end of mass fossil fuel use.\n\n\n\n\n\n\"There's warming that's baked into the climate system that we're going to feel the effects for the next 30 years, at least, even if we were to stop using fossil fuels today,\" he said.\n\n\n\n\n\n\"So we've got to think about how we adapt.\n\n\n\n\n\n“We can think about the way that buildings are built, making sure there's better glazing, there's fans installed, that you haven't got direct sunlight coming in. Better exterior blinds, better insulation in walls and roofs. These are the types of adaptations that reduce the amount of heat that gets into the indoor environment from the hot weather outside.”\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/is-a-300bn-mega-mining-merger-back-on-the-cards/1gadc4s1i",
        "title": "Is a $300bn mega mining merger back on the cards?",
        "publish_date": "Fri, 9 Jan 2026 06:27:00 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/usman-khawaja-told-me-his-dream-19-years-ago-hes-changed-australian-cricket-forever/d26mk6r8q",
        "title": "Usman Khawaja told me his 'dream' 19 years ago. He's changed Australian cricket forever",
        "publish_date": "Fri, 9 Jan 2026 03:48:27 +0000",
        "category": "sports",
        "authors": [],
        "text": "The fifth and final Ashes Test in Sydney brought the curtain down on Usman Khawaja's international career, at the same place it started.\n\n\n\n\n\nCricket has defined his life up to this point. Playing for Australia was a lifelong goal, he told this SBS reporter in 2007 when he was just 18.\n\n\n\n\n\nHe told me all he ever wanted was to represent Australia at cricket.\n\n\n\n\n\n\"Definitely, that's the dream I've had since I was a child, that'd be the best thing in the world to make my life complete.\"\n\n\n\n\n\nLess than four years later, at the fifth and final Ashes Test in Sydney in January 2011 he would receive his baggy green cap, a rite of passage for all players who debut for the Australian Test team.\n\n\n\nUsman Khawaja speaking to SBS in 2007, when he was a teenager. Source: SBS News Khawaja is one of the few sports personalities prepared to use his profile to air his opinions on important issues. At his retirement press conference, he spoke out against the racism he'd experienced as a youngster.\n\n\n\n\n\n\"I'm a proud Muslim, coloured boy from Pakistan who was told he would never play for the Australian cricket team. Look at me now,\" he said.\n\n\n\nThe first Muslim player to wear a baggy green cap expanded on his personal struggles.\n\n\n\n\n\nKhawaja pointed to racial barriers within the game, being the victim of stereotyping, which he also blamed on some in the media, too. He felt bitter about criticism for playing golf in the lead-up to November's first Ashes Test in Perth.\n\n\n\n\n\nHe developed back spasms which hindered him in the match and forced him to miss the second test in Brisbane altogether.\n\n\n\n\n\n\"'He's selfish, he doesn't train hard enough, he didn't train the day before the game', 'he's lazy'. These are the same stereotypes — racial stereotypes — I've grown up with my whole life,\" Khawaja said.\n\n\n\n\n\nHe said a white player in the same position would have been treated differently.\n\n\n\nREAD MORE Why Usman Khawaja's influence went far beyond the cricket pitch\n\nNot everyone thought his farewell conference was the right time to air his grievances. The first Indigenous cricketer to play for Australia, Jason Gillespie, felt Khawaja had gone too far and described some of his comments as a \"temper tantrum\".\n\n\n\n\n\nCricket Australia (CA) has, for many years, been working to make the sport more inclusive and accessible to players from multicultural backgrounds. But it's a long and sometimes difficult road as Khawaja's comments highlight.\n\n\n\n\n\nPatrick Skene is the co-founder of Cultural Pulse, an organisation that facilitates engagement with multicultural and linguistically diverse Australians.\n\n\n\n\n\nIt worked with CA in establishing its 'Sport for All Program' in 2015. Skene said CA has done a lot of work since then to ensure higher proportions of Australia's migrant communities embrace the game at all levels.\n\n\n\n\"CA has executed a dedicated South Asian engagement strategy, including a community ambassador program, South Asian program managers and South Asian representation in marketing … Cricket Australia should be acknowledged for its work in the space,\" Skene said.\n\n\n\n\n\nAs Khawaja exits international cricket, the next generation of multicultural players is already knocking on the door.\n\n\n\n\n\nThis month's Under-19 World Cup squad includes Nitesh Samuel and Aryan Sharma, who have Sri Lankan and Indian backgrounds, respectively. Along with Alana King's starring role with Australia's women's team, they could indicate the multicultural future of cricket is bright.\n\n\n\nAustralia's Alana King celebrates the wicket of New Zealand's Brooke Halliday during the ICC Women's Cricket World Cup cricket match between New Zealand and Australia in 2025. Source: AAP / Rafiq Maqbool/AP Last year's Australian Under-17 championships featured 33 players of South Asian heritage — 23 per cent of the total number of players in the state squads.\n\n\n\n\n\nSkene believes that's a clear sign the next Usman Khawaja or Alana King won't be too far away.\n\n\n\n\n\n\"We are evolving from outliers to significant numbers of South Asian heritage players in the elite talent funnel and the weight of numbers will produce a new generation to follow in Usman's footsteps,\" he said.\n\n\n\n\n\nKhawaja started his own foundation in 2018 to help youth from migrant communities achieve their potential. He has also called for Islamophobia to be condemned, and met with the prime minister last year to campaign for support for Gazans.\n\n\n\nBabar Azam donates a team jersey to Usman Khawaja for the Usman Khawaja Foundation during a media opportunity at The Gabba in 2024. Source: Getty / Albert Perez Khawaja wore shoes during matches with handwritten messages such as \"All lives are equal\" and \"Freedom is a human right\". He also wore a dove symbol on his bat and a black armband in solidarity with the Palestinian people, called for sanctions on Israel, and supported the recognition of Palestinian statehood.\n\n\n\n\n\nIt has been suggested in cricket circles that Khawaja might one day consider moving into politics. After his final test innings, he walked off the Sydney Cricket Ground to a hero's reception and sank to his knees to kiss the turf where his test career started and ended.\n\n\n\n\n\n\"For one last time to be thankful for what I've been given,\" he said.\n\n\n\nUsman Khawaja kissed the turf after he was dismissed playing his last match during day five of the fifth test in the 2025/26 Ashes series at Sydney Cricket Ground. Source: Getty / Robert Cianflone The 39-year-old will, in the immediate future, spend more time with his growing family and perhaps play a little more golf. The curtain falling on his playing career has seen him become a little more philosophical than the 18-year-old who once only cared about playing for Australia.\n\n\n\n\n\n\"A lot of times in life, we worry about what we want — we always want more. It's all about what else do we have, what else do we want?\"\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/egregiously-racist-writers-pull-out-of-adelaide-festival-over-dropped-palestinian-author/5pq8ui8zq",
        "title": "Writers pull out of Adelaide festival as dropped Palestinian author claims 'racist' treatment",
        "publish_date": "Thu, 8 Jan 2026 23:39:48 +0000",
        "category": "finance",
        "authors": [],
        "text": "Adelaide Writers' Week has removed prominent Palestinian Australian author and academic Randa Abdel-Fattah from its line-up, citing national grief following the Bondi tragedy — a decision that has prompted a wave of withdrawals from prominent writers in protest.\n\n\n\n\n\nOn Thursday, the Adelaide Festival board confirmed it had informed Abdel-Fattah that she would no longer appear at the event.\n\n\n\n\n\nAbdel-Fattah was the only author of Palestinian descent scheduled for Writers' Week.\n\n\n\n\n\nIn a statement the board said: \"Whilst we do not suggest in any way that Dr Randa Abdel-Fattah’s or her writings have any connection with the tragedy at Bondi, given her past statements we have formed the view that it would not be culturally sensitive to continue to program her at this unprecedented time so soon after Bondi.\"\n\n\n\n\n\nSpeaking to Australian Associated Press, Abdel-Fattah criticised the festival's leadership, saying: \"In the end, the Adelaide Writers' Festival will be left with panellists who demonise a Palestinian out of one side of their mouths while waxing lyrical about freedom of speech from the other.\"\n\n\n\nREAD MORE Albanese announces Bondi terror royal commission as Ley says he was 'forced' into it\n\nThe activist condemned her cancellation and called the board \"egregiously racist\" and said it had attempted to strip her of her humanity.\n\n\n\n\n\n\"The board's reasoning suggests that my mere presence is ''culturally insensitive'; that I, a Palestinian who had nothing to do with the Bondi atrocity, am somehow a trigger for those in mourning and that I should therefore be persona non grata in cultural circles because my very presence as a Palestinian is threatening and 'unsafe',\" Abdel-Fattah said.\n\n\n\n\n\nThe decision sparked immediate backlash, with several writers and academics withdrawing from the festival in solidarity.\n\n\n\n\n\nThe festival said it was anticipating its decision would cause \"discomfort\".\n\n\n\n\n\n\"Consideration of the appropriate response to such a tragedy is a human exercise that we understand is subjective in nature. We also understand others will undoubtedly form different judgments. These judgments may likely even change as the landscape and context evolves.\"\n\n\n\nThose who have pulled out include former Greek finance minister Yanis Varoufakis, Stella Prize winner Evelyn Araluen, former political prisoner and foreign correspondent Peter Greste, and two-time Miles Franklin winner Michelle de Kretser.\n\n\n\n\n\nAraluen, one of the writers who dropped out, said: \"Erasing Palestinians from public life in Australia won't prevent antisemitism. Removing Palestinians from writers festivals won't prevent antisemitism.\"\n\n\n\n\n\nFollowing the axing, the Australia Palestine Advocacy Network (APAN) released a statement, rejecting the board's claim that it removed Abdel-Fattah due to \"cultural sensitivity\".\n\n\n\n\n\nAPAN president Nasser Mashni said: \"What we are seeing is not caution — it is discrimination ... Apparently, it's culturally insensitive to be Palestinian at this time.\"\n\n\n\n\n\nGreens senator Sarah Hanson-Young criticised the decision to remove Abdel-Fattah.\n\n\n\n\n\n\"South Australia has a proud history of our arts festivals and supporting artist freedom of expression. This craven decision will leave our state and our reputation as the festival state in tatters,\" she said in a statement.\n\n\n\n\n\nThe Australia Institute has also withdrawn its support and sponsorship from this year's events.\n\n\n\n\n\nIn 2025, at the Bendigo Writers Festival, more than 50 writers and moderators boycotted the event over concerns its code of conduct would suppress discussion of Israel's actions in Gaza.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.theage.com.au/national/victoria/victoria-bushfires-live-concerns-over-out-of-control-blazes-at-longwood-walwa-and-harcourt-after-nervous-night-for-firefighters-dozens-of-homes-destroyed-20260109-p5nsz8.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Victoria Bushfires LIVE: 36 fires rage as State of Disaster declared; Family missing and homes razed",
        "publish_date": "Sat, 10 Jan 2026 13:04:26 +1100",
        "category": "finance",
        "authors": [
            "Ashleigh Mcmillan",
            "Isabel Mcmillan"
        ],
        "text": "A wind change likely to sweep across the Longwood fire ground in Victoria’s north-east today concerns Mansfield mayor Steve Rabie.\n\nFire authorities are continuing to monitor the Longwood blaze, with fears the popular holiday spot of Bonnie Doon could enter the firing line if Saturday’s strong winds alter the bushfire’s direction.\n\nPeople are seen gathered at the Mansfield relief centre on Saturday. Luis Ascui\n\nRabie’s been at the Mansfield relief centre at the local recreation centre this morning, and is trying to reassure his community ahead of an expectedly smoky day ahead.\n\n“The wind will turn around to the west, and we will be impacted by smoke,” Rabie said.\n\n“People will get very nervous and worried, and that’s where our messaging has to come out. We understand you’re going to get smoke, it will get hazy and it might get uncomfortable.\n\n“Get inside. Turn your air conditioner on if you have to, and wear a mask if you have to.”\n\n“We’ve been practicing those plans, and now the plans have come to fruition. And it’s working extremely well.”",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/victoria/melbourne-nightclub-irked-as-council-workers-captured-removing-10-bottles-from-bins-20251231-p5nqxm.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Melbourne nightclub irked as council workers captured removing 10¢ bottles from bins",
        "publish_date": "Sat, 10 Jan 2026 13:00:00 +1100",
        "category": "finance",
        "authors": [
            "Lachlan Abbott"
        ],
        "text": "Advertisement\n\nNationalVictoriaRecycling Melbourne nightclub irked as council workers captured removing 10¢ bottles from bins Lachlan Abbott January 10, 2026 — 1:00pm Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share\n\nCouncil workers have irked a Melbourne nightclub by removing bottles and cans eligible for 10¢ refunds from their bins. CCTV footage captured last year shows two men in high-vis vests collecting items from skips in Geddes Lane – behind King Street nightclub Inflation – and stashing them in a City of Melbourne truck. Inflation owner Martha Tsamis said the popularity of Victoria’s container deposit scheme meant people often went through the venue’s recycling for empty drinks containers, which her business set aside to claim refunds for. “We take time with staff to separate the bottles from rubbish, only to find that council workers are stealing from us, while being paid by the council and using a council vehicle,” she said.\n\nAdvertisement\n\n“It’s hard enough working in the hospitality industry at the moment, but this is just disgraceful.” The City of Melbourne confirmed the workers captured on video were supposed to remove illegally dumped waste only, not private bins that Inflation paid another contractor to collect and recycle for a small refund. Padlocked skips for refundable bottles and cans in a Melbourne CBD laneway. Lachlan Abbott “Any allegation of misconduct by staff or contractors is taken seriously – and will be investigated,” a council spokesman said. Bin fossicking for refundable bottles and cans – in addition to picking up containers off the street – has provided some Victorians with a small but valuable income boost since the container deposit scheme launched in 2023.\n\nAdvertisement\n\nSayo Leahy, a prolific can collector, told this masthead in February that rifling through residential bins in Melbourne’s north had given her a lifeline as she struggled to maintain employment due to mental health struggles. Related Article City life ‘I wouldn’t be alive without this rubbish’: The rapidly growing scheme that has Victorians cashing in She also separated refundable containers from non-recyclables that often contaminated residential bins. “At the end of the day, if you’re going through a bin you are probably struggling,” Leahy said when asked about the practice on Saturday. “And you’ve got to remember that.” Tsamis said she had no issue with other instances of bin fossicking. She was instead concerned about unauthorised council employees combing through her commercial skips, which were already sorted and slated for another operator to pick up and refund.\n\nAdvertisement\n\nThose who manage Victoria’s container deposit scheme also do not support bin fossicking without permission. “The rules around bin fossicking vary between [local government areas], and it is not a practice we encourage,” said Marianne Doyle, the interim chief executive of VicReturn. Loading “In some LGAs, removing recyclables that have been placed out for collection may attract fines.” Doyle encouraged individual collectors to speak with local businesses and work together to recycle.\n\nAdvertisement\n\n“Many CDS [container deposit scheme] collectors have arrangements in place with venues, clubs or businesses to collect their eligible containers to return them for the 10¢ refund,” she said. “Securing bins is a practical option for organisations wanting to prevent eligible drink containers being taken without permission.” Doyle said the container deposit scheme was working with councils, including the City of Melbourne, to install new container baskets on the outside of bins. “These are designed to give people a safe and appropriate way to leave empty eligible containers for others to collect, without the need to fossick through public bins,” she said. Start the day with a summary of the day’s most important and interesting stories, analysis and insights. Sign up for our Morning Edition newsletter.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/soccer/wrexham-fairytale-continues-after-shock-fa-cup-win-20260110-p5nt13.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Wrexham fairytale continues after shock FA Cup win",
        "publish_date": "Sat, 10 Jan 2026 11:37:31 +1100",
        "category": "sports",
        "authors": [],
        "text": "Wrexham fairytale continues after shock FA Cup win\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/queensland/broadway-hotel-in-woolloongabba-endures-third-fire-20260110-p5nt0s.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Broadway Hotel in Woolloongabba endures third fire",
        "publish_date": "Sat, 10 Jan 2026 10:30:12 +1100",
        "category": "finance",
        "authors": [],
        "text": "Broadway Hotel in Woolloongabba endures third fire\n\nThe Broadway Hotel in Woolloongabba went in flames for a third time just before midnight on January 9, 2026.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/victoria/the-year-that-changed-me-20251219-p5np2c.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "The year that changed me",
        "publish_date": "Sat, 10 Jan 2026 10:09:16 +1100",
        "category": "lifestyle",
        "authors": [],
        "text": "The year that changed me\n\nThe truckie’s plan in case the pills weren’t sufficient was that I had to stay awake to prod him in the ribs if he started nodding off. He wouldn’t share his amphetamines.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/cricket/starc-head-and-carey-were-outstanding-but-they-weren-t-why-australia-hammered-england-20260109-p5nsuh.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Starc, Head and Carey were outstanding, but they weren’t why Australia hammered England",
        "publish_date": "Sat, 10 Jan 2026 09:30:00 +1100",
        "category": "sports",
        "authors": [
            "Malcolm Knox"
        ],
        "text": "The problem with my Best Combined XI from the 2025-26 Ashes is that it only has VI players in it.\n\nTravis Head opens the batting, and then we have Steve Smith as captain coming in at No.4. Alex Carey keeps wicket and bats six. The fast bowlers are Mitchell Starc, Scott Boland and Michael Neser. That’s almost a good indoor cricket team.\n\nI hesitate to add more. There is too great a risk of choosing batsmen who accumulated runs but had minimal impact on the result (Joe Root, Harry Brook, Zak Crawley, Jacob Bethell). And if we include the next-best bowler (Ben Stokes or Josh Tongue, take your pick), we end up with the truly horrifying and morally unconscionable outcome of having more Englishmen than Australians in that hypothetical XI. Which would make me about as competent a selector as England’s.\n\nThe top-heavy nature of the contributions has been held out as proof that this was a low-quality Ashes series. I don’t agree that it was.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/cricket/brendon-mccullum-s-latest-absurd-claim-should-spell-the-end-of-his-tenure-20260110-p5nt08.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Brendon McCullum’s latest absurd claim should spell the end of his tenure",
        "publish_date": "Sat, 10 Jan 2026 09:30:00 +1100",
        "category": "sports",
        "authors": [
            "Oliver Brown"
        ],
        "text": "An alarming sign of Brendon McCullum’s attitude to coaching England came on the Adelaide outfield, where, with Australian players uncorking the champagne behind him and the urn surrendered in record-equalling time, he made his soaring pitch to keep his job. “It’s a pretty good gig, it’s good fun,” he shrugged. “You travel the world with the lads and try to play some exciting cricket and achieve some things.”\n\nHe sounded as if he were describing life on board a cruise ship, where the pursuit of sporting glory was just some trifling distraction from the boys-on-tour vibe. And in return, he expected to keep a minimum £500,000-a-year ($1 million) salary, with zero accountability.\n\n‘It’s a pretty good gig’: Brendon McCullum in Adelaide after England’s defeat left them 3-0 down in the Ashes. Credit: Getty Images\n\nAny serious organisation would be disabusing him of this delusion today. But the message from the England and Wales Cricket Board is that it is still on board with Baz, that Baz is capable of cultural evolution, that there will simply be a few quiet, behind-the-scenes tweaks before the grand unveiling of Bazball 2.0. Until the past 24 hours, this position might just have been tenable.\n\nNot now, though. Not after the exposure of a culture so dismally amateurish that Harry Brook, the white-ball captain, felt at liberty on the night before a one-day international against New Zealand to go to a nightclub, with that bone-headed decision leading to him being punched by a bouncer.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/world/ice-agent-who-shot-minnesota-womans-video-released-20260110-p5nt0e.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "ICE agent who shot Minnesota woman's video released",
        "publish_date": "Sat, 10 Jan 2026 09:23:06 +1100",
        "category": "finance",
        "authors": [],
        "text": "Remove items from your saved list to add more.\n\nYou have reached your maximum number of saved items.\n\nSave this video for later\n\nAdd videos to your saved list and come back to them anytime.\n\nGot it",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/queensland/mother-and-two-young-girls-injured-in-sunshine-coast-crash-identified-20260109-p5nsyw.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Medical episode theory in horror crash that put two girls in hospital",
        "publish_date": "Sat, 10 Jan 2026 09:09:03 +1100",
        "category": "finance",
        "authors": [
            "Dominique Tassell"
        ],
        "text": "Advertisement\n\nNationalQueenslandSunshine Coast Medical episode theory in horror crash that put two girls in hospital Dominique Tassell Updated January 10, 2026 — 9:09am ,first published January 9, 2026 — 8:54pm Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share\n\nA truck driver who crashed into four cars may have suffered a medical episode, emergency services said. One of the cars, with a mother and two young girls inside, was pinned to a construction site after being rear-ended. The girls – Ineza, 3, and one-year-old Itahe – were travelling with their mother, identified as Denyse, when a truck crashed into their vehicle about 11.45am on Thursday on Banya Avenue in Banya, south-west of Caloundra. Loading The three-year-old suffered critical head and chest injuries and was flown by helicopter to Queensland Children’s Hospital.\n\nAdvertisement\n\nHer younger sister was taken in a critical condition to Sunshine Coast University Hospital before also being flown to Queensland Children’s Hospital. The girls were unconscious when they were removed from the car, Queensland Ambulance Services spokesman Nick Haug said. Denyse, who is in her 30s, was taken to Sunshine Coast University Hospital in a stable condition with head and chest injuries but was discharged on Friday. Her daughters were still fighting for their lives in hospital on Friday. “The last update I had was no change from last night,” Acting Inspector Matthew Robertson said.\n\nAdvertisement\n\n“They were in a critical condition in hospital, were being seen by the doctors, and have had no change.” New CCTV shows the moment the truck, which was travelling at speed, crashed into the first of four cars before continuing down the road. The crash scene at the intersection of Banya Avenue and Bruny Street on Thursday. Nine It then crashed into three more vehicles stopped at an intersection, the young family’s car among them. Paramedics assessed seven people in total, including the truck driver, with the remaining four taken to Sunshine Coast University Hospital.\n\nAdvertisement\n\nA man in another car hit by the truck told Nine News he and some tradespeople from the construction site pulled the two girls from the car. “The people who witnessed that accident immediately jumped in to assist, and assist all the people involved in it. Nobody shied away from getting in, helping, providing assistance,” Robertson said. Haug said the truck’s driver could not immediately recall the incident, and Robertson confirmed officers were investigating the possibility they had experienced a medical episode. He said police would look at factors such as the visibility of the traffic lights, as well as the road and weather conditions. He also confirmed no stolen vehicles were involved. “It was just people going about their normal business.”\n\nAdvertisement\n\nThe acting inspector said it was a reminder to motorists and members of the community to be situationally aware on the roads and to pay attention to road-safety messaging. “Take heed to the dangers of being on the road and around the road. And take care so we can prevent any further injuries on our road in 2026,” Robertson said. Police have urged anyone with information to come forward. Start the day with a summary of the day’s most important and interesting stories, analysis and insights. Sign up for our Morning Edition newsletter.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/lifestyle/princess-of-wales-marks-her-44th-birthday-20260110-p5nt05.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Princess of Wales marks her 44th birthday",
        "publish_date": "Sat, 10 Jan 2026 08:15:24 +1100",
        "category": "lifestyle",
        "authors": [],
        "text": "Princess of Wales marks her 44th birthday\n\nThe Princess of Wales has marked her 44th birthday with a deeply personal message on social media, reflecting on the comfort of nature throughout her cancer treatment.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/north-queensland-community-told-to-prepare-for-destructive-weather-20260110-p5nt03.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "North Queensland community told to prepare for destructive weather",
        "publish_date": "Sat, 10 Jan 2026 07:53:28 +1100",
        "category": "finance",
        "authors": [],
        "text": "Remove items from your saved list to add more.\n\nYou have reached your maximum number of saved items.\n\nSave this video for later\n\nAdd videos to your saved list and come back to them anytime.\n\nGot it",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/state-of-disaster-declared-in-parts-of-victoria-20260110-p5nt00.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "State of disaster declared in parts of Victoria",
        "publish_date": "Sat, 10 Jan 2026 07:24:58 +1100",
        "category": "finance",
        "authors": [],
        "text": "Remove items from your saved list to add more.\n\nYou have reached your maximum number of saved items.\n\nSave this video for later\n\nAdd videos to your saved list and come back to them anytime.\n\nGot it",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/manhunt-for-missing-alleged-perth-gunman-enters-third-day-20260110-p5nt01.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Manhunt for missing alleged Perth gunman enters third day",
        "publish_date": "Sat, 10 Jan 2026 07:24:48 +1100",
        "category": "finance",
        "authors": [],
        "text": "Remove items from your saved list to add more.\n\nYou have reached your maximum number of saved items.\n\nSave this video for later\n\nAdd videos to your saved list and come back to them anytime.\n\nGot it",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/nsw/my-best-beach-20251229-p5nqk2.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "My best beach",
        "publish_date": "Sat, 10 Jan 2026 06:25:09 +1100",
        "category": "finance",
        "authors": [],
        "text": "Opinion\n\nThe scene of unimaginable terror on December 14, Bondi is Australia’s most iconic beach. NSW Minister for Water Rose Jackson, born and bred in the eastern suburbs, reflects on why Bondi will endure as the dynamic beating heart of our city.",
        "source": "TheAge"
    }
]