[
    {
        "url": "https://www.9news.com.au/national/the-wiggles-to-raise-awareness-over-emma-bow-button-battery-danger-accc-says/0be15e38-75f3-4f67-a4ac-9a8c7b2c889c",
        "title": "The Wiggles company admits 'likely' law breach over Emma headband",
        "publish_date": "Tue, 11 Nov 2025 01:32:00 +0000",
        "category": "finance",
        "authors": [
            "Nov"
        ],
        "text": "Entertainment giant The Wiggles will devote an episode of their popular podcast to discussing the dangers of button batteries, after the company admitted it likely breached Australian consumer law, the national watchdog says.\n\nThe Australian Competition and Consumer Commission said The Wiggles Holdings had sold Emma Bow headbands without the mandatory safety warnings required for products containing button batteries.\n\nThe ACCC said the headband, coloured yellow and black and bearing four flashing lights, was sold without the mandatory warnings between June 2022 and March 2024.\n\nThe Emma Bow has been recalled. (Supplied)\n\nIt has since been recalled by The Wiggles and by importer and distributor CA Australia.﻿\n\n\"The Emma Bow was aimed for children's use and was available at The Wiggles' live concerts. It was also sold by other suppliers on The Wiggles online store and through various physical retail stores\" ACCC deputy chair Catriona Lowe said.\n\n\"Without a warning on the product, parents may not have known it contained button batteries and not understood the severity of the risk.\n\nREAD MORE: Jury still out on deposit scheme stoking rise in property prices ﻿\n\nThe Wiggles. (Supplied: The Wiggles)\n\n\"If swallowed, a button battery can become stuck in a child's throat and result in catastrophic injuries, and even death, in as little as two hours.\"\n\nThe Wiggles has provided the ACCC with a court-enforceable undertaking in which it admitted it likely breached the law and has committed to implementing a consumer law compliance program within its organisation.\n\nCA Australia has also provided a written commitment to the ACCC to improve its consumer law compliance.\n\nAs part of its cooperation with the ACCC, The Wiggles will also produce an episode of its podcast, \"Wiggle Talk - A Podcast For Parents\", which will refer to the recall and will discuss safety issues relating to button batteries and children's toys to help raise awareness.\n\n\"At The Wiggles, the safety and wellbeing of children and families is always our highest priority,\" Wiggles HQ said in a statement.\n\n\"We want every parent and carer to feel complete confidence in any product bearing The Wiggles name.\"\n\nThe statement said that the Emma headbands, which were supplied by a licensee, had been manufactured before the current information standard was introduced in 2020 and came into force in 2022.\n\n\"Due to the COVID-19 pandemic cancellations, the licensee had a surplus of stock produced prior to 2020 and regrettably it was not identified that these products no longer complied with updated labelling regulations,\" the statement read.\n\n\"The Wiggles have worked with the ACCC to address this issue as fully and transparently as possible, initiating a joint recall with the licensee for this product in August 2024.\n\n\"We have now mutually agreed with the ACCC on a range of actions including promoting safety information on an upcoming episode of 'Wiggle Talk - A Podcast for Parents'.\n\n\"The Wiggles are committed to ensuring that every product associated with our brand meets the highest standards of safety, quality and reliability.\n\n\"We will continue to take proactive steps to protect children and support Australian families in every way we can.\"",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/world/measles-spreading-canada-loses-measle-free-status/ec9be13c-0c3f-4dd6-8b74-56c4668819f8",
        "title": "Canada loses measles-free status as vaccination rates fall",
        "publish_date": "Tue, 11 Nov 2025 01:15:13 +0000",
        "category": "lifestyle",
        "authors": [
            "Nov"
        ],
        "text": "International health experts have declared Canada is no longer \"measles-free\" amid ongoing outbreaks, as childhood vaccination rates fall and the highly contagious virus spreads across North and South America.\n\nThe loss of the country's measles elimination status comes more than a year after the highly contagious virus started spreading.\n\nCanada has logged 5138 measles cases this year and two deaths. Both were babies who were exposed to the measles virus in the womb and born prematurely.\n\nREAD MORE: President let out of prison after 20 days ﻿\n\nMeasles cases are on the rise in many parts of the world. (NSW Health)\n\nMeasles elimination is a symbolic designation, but it represents a hard-won battle against the infectious disease. It is earned when a country shows it has stopped continuous spread of the virus within local communities, though occasional cases might still pop up from travel.\n\nMeasles typically begins with a high fever followed by a telltale rash that starts on the face and neck. Most people recover, but it's one of the leading causes of death among young children, according to the World Health Organisation (WHO). Serious complications, including blindness and swelling of the brain, are more common in young children and adults over age 30.\n\nIt is prevented by a vaccine administered routinely and safely to children around the world.\n\nREAD MORE: US Supreme Court rejects bid to overturn marriage equality ﻿\n\nThe disease is highly contagious. (Getty)\n\n\"It's a deeply disheartening development. It's a deeply worrisome development. And, frankly, it's an embarrassing development,\" said Jennifer Nuzzo, a Brown University infectious disease expert.\n\n\"No country with the amount of resources of Canada – or other countries in North America even – should lose their measles elimination status.\"\n\nThe WHO declared Australia measles-free in 2014.\n\nSince then, cases have remained mostly isolated, but concerns are rising as vaccination rates dip.\n\nEarlier this year, the Australian Health Protection Committee expressed its concern about the \"recent increase\" in measles cases, after outbreaks in several states and territories.﻿\n\nVaccines are the surest way to combat measles. (Julio Cortez/AP via CNN)\n\n\"Between 1 January and 27 May 2025, 77 people were diagnosed with measles in Australia ,\" the organisation said.\n\n\"Most were young people aged 20 to 49 years who are either unvaccinated or unsure of their vaccination status, and associated with overseas travel.﻿\"\n\nThe Western Australian government issued a measles alert several days ago after an outbreak in the south of the state.﻿\n\nVaccination campaigns led to elimination\n\nCanada eliminated measles in 1998, followed by the US two years later. After hugely successful vaccination campaigns, the Americas became the first region in the world to be free of measles in 2016. Health officials estimate the measles vaccine prevented 6.2 millions deaths in the Americas between 2000 and 2023.\n\nBut vaccination rates have since slipped below the 95 per cent coverage rate needed to stop outbreaks. Large outbreaks in Venezuela and Brazil in 2018 and 2019 cost the region its elimination status. It was reclaimed in 2024, but ends again with Canada's loss.\n\nExperts from the Pan American Health Organisation, an independent health agency, made the determination after analysing data on Canada's outbreaks that showed the virus has spread continuously for a year.\n\nIt has never been easy to stop measles from circulating in local communities, Dr Jarbas Barbosa, director of the Pan American Health Organisation, said in a briefing Monday.\n\n\"As a region, we have eliminated measles twice,\" Barbosa said. \"We can do it a third time.\"\n\nIn a statement, Canadian health officials said they were working with government and community partners to improve vaccination coverage, share data and provide evidence-based guidance.\n\nThe virus is one of the most contagious known to medicine. One infected person can spread it to up to nine out of 10 unprotected people they come into close contact with. Health experts say, by far, the best prevention against measles is the vaccine, which provides 97 per cent protection after two doses.\n\nBarbosa's organisation has confirmed nearly 12,600 cases this year across 10 countries, a 30-fold increase from 2024. The vast majority are in Canada, the US and Mexico, but Bolivia, Brazil, Paraguay and Belize also have active outbreaks.\n\nIn 2024, the region had a 79 per cent vaccination rate, an increase from years past but still too low, he said.\n\nUnited States could be next to lose status\n\nThe US eliminated measles in 2000. That status is at risk even though the large outbreak that killed three and sickened nearly 900 across Texas, New Mexico and Oklahoma earlier this year is over.\n\nCurrent outbreaks in the US include 34 cases in South Carolina and one hitting towns on the Arizona-Utah border that has sickened more than 150 since mid-August.\n\nA major question now is if either are linked to the Texas outbreak. To lose elimination status, health data must show a continuous chain of measles spread for one year.\n\nInternational health officials have recommended the US \"enhance case investigation protocols,\" because closing data gaps is key to stopping the virus from taking hold again, said Dr Daniel Salas, who leads immunisation efforts at the Pan American Health Organisation.\n\nThe US Centres for Disease Control and Prevention has confirmed 1681 cases and 44 outbreaks this year, making it the worst year for measles in the US in more than three decades. Only nine states haven't confirmed cases, according to the CDC.\n\nA large outbreak also continues in Chihuahua, Mexico, where health officials have confirmed 4430 cases as of last week and 21 deaths, according to state health data.\n\nMexican and US officials have said the genetic strains of measles spreading in Canada match those in the Texas and Chihuahua outbreaks. All those outbreaks affected certain Mennonite Christian communities who trace their migration over generations from Canada to Mexico to Seminole, Texas.\n\nIn August, officials said Mennonite communities in Belize, Argentina, Bolivia, Brazil, and Paraguay had outbreaks of the same type of measles virus.\n\nMennonite churches do not formally discourage vaccination, though more conservative Mennonite communities historically have low vaccination rates and a distrust of government.\n\nIt was tempting to look at the outbreaks in a vacuum, Nuzzo said. But many were likely linked, she said, not just by sick people traveling but also by anti-vaccine disinformation.\n\n\"It's not a religious prohibition in most of these cases,\" she said. \"It is just people being, perhaps, distrustful of authorities, but also preyed upon by these anti-vaccine influencers who profit off of the fears that some people may have.\"",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/mcdonalds-plan-for-northcote-24-hour-restaurant-rejected/8fe9791c-369e-4421-aeaf-564096b03f13",
        "title": "Plans for new 24-hour Macca's rejected by trendy Aussie suburb",
        "publish_date": "Tue, 11 Nov 2025 01:39:45 +0000",
        "category": "finance",
        "authors": [
            "Nov"
        ],
        "text": "A﻿ plan to build a 24-hour McDonald's restaurant in one of Melbourne's trendiest suburbs has been knocked back following a fierce community backlash.\n\nDarebin councillors yesterday voted 6-3 in opposition to the planning motion to transform a fire damaged and vacant building at 323 High Street, in the northern suburb of Northcote﻿, into a convenience restaurant.\n\nMcDonald's did not need to seek planning permission because the site was in a commercial zone and and didn't require a permit to become a fast-food outlet.\n\nREAD MORE: Great White Shark knocks rider off foilboard at WA beach\n\nPlans by McDonald's to build a new convenience restaurant in a trendy Melbourne suburbs have been rejected. (A Current Affair)\n\nPlanning officers told the council meeting that four years ago the site was granted a redevelopment permit, and the new application just altered the permit to enable the building of a restaurant.﻿\n\nBut over past months, the plan has triggered strong opposition from Northcote residents and businesses.\n\nA petition against the proposal attracted more than 11,000 signatures.\n\nMany feared the proposed convenience restaurant would spoil the blend of local restaurants, hip bars, boutique shops and live music venues that run along High Street, which runs along the suburbs of Northcote, Thornbury and Preston.\n\nInnocuous Aussie street tops 'world's coolest' list View Gallery\n\nTime Out magazine last year named the buzzy High Street as number one in its \"world's coolest street\" rankings.\n\nIn its planning application, McDonald's said converting the site to a restaurant would create more than 100 local jobs and help the Northcote community.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/federal-government-deposit-scheme-and-october-property-price-increase/9ec17e87-0c10-46ec-85f9-dc6814bd93bb",
        "title": "Jury still out on deposit scheme stoking rise in property prices",
        "publish_date": "Mon, 10 Nov 2025 22:55:44 +0000",
        "category": "finance",
        "authors": [
            "Nov"
        ],
        "text": "F﻿ollowing the launch of the federal government's new deposit scheme , property prices have grown at the fastest rate for two years, but there is scant evidence the two are linked.\n\nThis is the conclusion of analysis released today by property experts Cotality, formerly CoreLogic, after it crunched the numbers from last month's home sales.\n\n﻿It found national home values increased by 1.1 per cent in October, which coincided with the Albanese government's 5 per cent deposit scheme opening to all first-time buyers.\n\nThere is little evidence to show the federal government's 5 per cent housing deposit scheme is stoking property prices, new research found. (Photo by ROB HOMER SPECIAL 103506) (Rob Homer) (Nine)\n\nDuring the lead-up to its launch, housing experts and the federal opposition voiced concerns it would simply stoke demand and cause house prices to rise even further.\n\nBut the jury is still out if that is the case, according to the Cotality research.﻿\n\nHomes with an estimated value that fell within the price caps of the scheme rose by 1.2 per cent, compared to 1 per cent for dwellings above - a difference of 22 basis points.\n\nBut the deposit scheme was one of numerous elements impacting powerful growth in the market, particularly in lower-to-middle-priced properties.\n\nMonthly price gains had been accelerating since the first interest rate cut in February, and values were also buoyed by seasonality and low levels of stock.\n\nStrong demand for properties under the scheme's price caps, gives some weight to the argument ﻿it had an effect on prices.\n\nNational house values below the caps were up 1.3 per cent in October, 32 basis points higher than house values above the caps.\n\nUnits with an estimated value below the caps had a 19 basis point premium of 1 per cent.\n\nCotality found in October property values below the price caps had stronger capital growth than those above them in every capital city except Hobart and the ACT.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/gough-whitlam-dismissal-interview-biographer-jenny-hocking/17d6e998-7764-4e81-8290-f8f5c573a343",
        "title": "'Deeply troubling': Author's dogged pursuit of the truth 50 years after Whitlam dismissal",
        "publish_date": "Mon, 10 Nov 2025 18:38:51 +0000",
        "category": "finance",
        "authors": [
            "Nov"
        ],
        "text": "An author and historian who unearthed long-buried secrets from Gough Whitlam's infamous 1975 dismissal has called on the Australian government for greater transparency on the political scandal's 50th anniversary.\n\nJenny Hocking – author of multiple Whitlam books including the Dismissal Dossier and The Palace Letters – won a High Court bid in 2020 to release palace correspondence between former Governor-General John Kerr and the late Queen Elizabeth II.\n\nHocking recently uncovered never-before-seen letters between then-Canadian Governor-General Jules Léger and the Queen's private secretary Sir Martin Charteris from the Library and Archives Canada.\n\nAuthor of multiple Whitlam books Jenny Hocking has previously successfully petitioned the High Court to release archival documents. (Supplied)\n\nDo you have a story? Contact reporter April Glover at april.glover@nine.com.au\n\nShe told nine.com.au that, in quite a stark contrast, the Australian government has long made it difficult for her to sift through her own country's political archives.\n\n\"I think one of the key problems about how we write about the dismissal, how we understand the dismissal, is that we haven't had access to all of the material,\" Hocking said.\n\n\"It should never have taken a High Court case to have access to the Queen's letters to Sir John Kerr during the dismissal, so that we could have fully understood the role of the palace at the time of the dismissal.\n\n\"And the palace continues to deny that they had any part to play.\"\n\nBuckingham Palace issued a rare statement following the release of the letters in 2020 , which said \"neither Her Majesty nor the Royal Household had any part to play in Kerr's decision to dismiss Whitlam.\"\n\nFormer Australian prime minister Gough Whitlam holds up the original copy of his dismissal letter he received from then Governor-General Sir John Kerr on November 11, 1975. (AP)\n\nREAD MORE: Why thousands of Australians are buying and selling snack vending machines\n\nHocking discovered a \"revelation\" in the 1977 letters which she said fundamentally changed her view of how both the Queen and Kerr felt about Whitlam's dismissal.\n\nIn his note to Charteris, Léger described a governor-general as being \"like a bee\", which can sting just once.\n\nIn reply, the Queen's secretary wrote: \"The Queen was… very interested to read your note on Sir John Kerr and in particular your reflection that a governor-general can only give one tap to the democratic clock!\"\n\nLéger also observed Kerr's own \"changing demeanour and attitude\" over the dismissal in the years that followed.\n\n\"He notes that Kerr seems less certain of the position he'd taken when he saw him later in 1979,\" Hocking said.\n\n\"And also Léger noting that at his own meeting with Kerr… Kerr had said that the Queen approved of the position that he took in relation to the dismissal.\n\n\"There's a lot of interesting reflection on certainly how Kerr perceived his relationship to the palace at the time. And this is something we didn't know of Kerr.\n\n\"He never really opened up about his changing perception and whether he regretted it or not.\"\n\nHocking's dogged pursuit of unlocking the truth of the Whitlam dismissal has been akin to piecing together a complicated and unfinished mosaic.\n\nWhitlam speaks to reporters following his dismissal by then-Governor-General John Kerr. (Getty)\n\nAmid her court wins is a frustrating reality: there is so much more she doesn't know.\n\nThe biographer said while the Canadian archives \"readily\" facilitated access to the letters, much of the Australian archives remain shrouded in secrecy.\n\n\"There should not be hundreds, if not over a thousand, individual files in our National Archives that we can't view in order to make a studied and empirically based assessment of what happened in 1975,\" Hocking said.\n\n\"I find that deeply troubling that we have the major national repository of archival documents still maintaining closed documents, many of which I've requested to access unsuccessfully.\"\n\nUnder the Archives Act 1983, the majority of archival records enter the open access period after 20 years.\n\nQueen Elizabeth II pictured in 1975, the year she oversaw the firing of Prime Minister Gough Whitlam and his government. (Fairfax Media)\n\nHocking said she believed the 50-year mark since Whitlam's sacking should be a strong impetus for more transparency.\n\nWhitlam remains the only prime minister in Australian history to be removed from office by a governor-general's reserve powers.\n\n\"It is critical because that can happen again if the same circumstances arose. So we do need to fully understand what happened in 1975 to be able to assess whether changes ought to be made,\" Hocking added.\n\n\"Whether that is part of an ongoing argument about if we should move to a republic, or a need to codify the powers of the governor-general.\n\n\"These are all matters that are active and that until we can fully understand what happened in 1975 are to some extent unresolvable, because we're not completely aware of precisely what happened while documents remain closed to us.\"\n\nThe National Archives of Australia said it \"acknowledges the historical significance of the Dismissal and has worked closely with researchers to process access applications on dismissal-related records as quickly as possible\".\n\n\"There are approximately 13,000 records in the collection across 94 series relating to Whitlam's life before and during his term as prime minister, including the dismissal. Over 8,700 (almost 70 per cent) of these records are now publicly available,\" a spokesperson told nine.com.au.\n\n\"Anyone can apply for the release of additional Whitlam records, or any record, that has reached the open access period under the Archives Act.\n\n\"National Archives welcomes access requests and remains committed to actioning these requests in a timely manner.\"",
        "source": "9News"
    },
    {
        "url": "https://www.abc.net.au/news/2025-11-11/the-wiggles-emma-bow-consumer-law-likely-breach/105995228",
        "title": "The Wiggles 'likely breached' consumer law with sale of headbands: ACCC",
        "publish_date": "Tue, 11 Nov 2025 01:32:47 +0000",
        "category": "finance",
        "authors": [],
        "text": "Beloved children's entertainers The Wiggles \"likely breached\" consumer law by selling headbands without mandatory safety warnings, according to Australia's consumer watchdog.\n\nThe findings — made public by the Australian Competition and Consumer Commission (ACCC) — state the Emma Bow headbands lit up and were powered by button batteries.\n\nThe likely breach relates to the fact that the headbands were sold by The Wiggles Holdings Pty Ltd without mandatory safety warnings required for products containing the batteries.\n\nButton batteries are a swallowing hazard to young children and can be fatal in rare cases.\n\nThe group sold about 3,164 headbands from June 2022 to March 2024.\n\nThe Wiggles have recalled the Emma Bow product for the entire period it was sold. (Supplied: ACCC)\n\nIt is understood a further 600 headbands were supplied to other third-party retailers by importer and distributor CA Australia.\n\nIn a statement to the ABC, a media spokesperson for The Wiggles said the product was manufactured and supplied by a licensee before the current Information Standard was introduced in 2020 and came into force in 2022.\n\n\"Due to the COVID-19 pandemic cancellations, the licensee had a surplus of stock produced prior to 2020, and regrettably, it was not identified that these products no longer complied with updated labelling regulations,\" they said in a statement.\n\nIn cooperation with the ACCC, The Wiggles will produce an episode of their parenting podcast, highlighting the product's recall and safety issues relating to button batteries.\n\nThe Wiggles supplied 3,164 of the headbands to consumers, the ACCC alleges. (Supplied: ACCC)\n\nThis was part of a \"range of actions\" the brand was taking in partnership with the ACCC.\n\n\"At The Wiggles, the safety and wellbeing of children and families is always our highest priority,\" the spokesperson added.\n\n\"We want every parent and carer to feel complete confidence in any product bearing The Wiggles name.\n\n\"The Wiggles are committed to ensuring that every product associated with our brand meets the highest standards of safety, quality and reliability.\n\n\"We will continue to take proactive steps to protect children and support Australian families in every way we can.\"\n\nChit Chat with Emma Watkins As a Wiggle, Emma Watkins became a bigger rock star than actual rock stars to kids and parents everywhere. Since leaving the group three years ago, she's been busier than ever.\n\nCA Australia has also provided a written commitment to the ACCC to improve its consumer law compliance.\n\nACCC deputy chair Catriona Lowe said the bow was \"aimed for children's use\" and sold on The Wiggles online store, at concerts, and by other physical retailers.\n\n\"Without a warning on the product, parents may not have known it contained button batteries and not understood the severity of the risk,\" she said in a statement.\n\nThe ACCC advises that those who still own the headband should refer to the recall notice for further information, including returns.\n\nIn May this year, Hungry Jack's was fined $150,240 after the ACCC issued eight infringement notices for supplying a Garfield-themed toy that allegedly did not comply with button battery standards.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-11-11/wallabies-desperate-to-avoid-67-year-low-in-spring-tour/105995694",
        "title": "Wallabies out to avoid 67-year low as Skelton ruled out",
        "publish_date": "Tue, 11 Nov 2025 01:15:56 +0000",
        "category": "sports",
        "authors": [],
        "text": "The Wallabies maintain there's still \"enough petrol in the tank\" as Joe Schmidt's side face the grim prospect of ending one of the most gruelling seasons on record with a first winless four-Test tour of Europe in almost 70 years.\n\nAustralia's hopes of beating Ireland on Saturday or France next weekend have taken another big hit with Schmidt learning he will be unable to call upon Will Skelton for the final two Tests of the the spring tour.\n\nABC Sport will have live blog coverage of the Wallabies' clash with Ireland from 6am AEDT on Sunday.\n\nThe giant lock sustained an ankle injury on club duty in France at the weekend, ruling out the 2.03m, 145kg heavyweight.\n\nHaving already lost to England and Italy, the Wallabies must claim a heavyweight scalp against either world number three Ireland or fifth-ranked France to avoid becoming the first Australian tourists since 1958 to lose four straight Tests in Europe.\n\nBut they must do so without Skelton, who was hurt playing for La Rochelle against Toulon in the Top 14.\n\nVeteran James O'Connor has joined the squad in Dublin as flyhalf cover after Carter Gordon aggravated a quad niggle in the humiliating 26-19 loss to Italy in Udine on Sunday morning.\n\nProp forward Angus Bell insists the Wallabies still have \"petrol in the tank\", even if Schmidt says his side is running on empty after a monster 2025 schedule.\n\nPlaying 15 Tests for the first time since 2016, the Wallabies' sapping program has included three Tests against the touring British and Irish Lions, back-to-back matches in South Africa against the two-time defending World Cup champions and return bouts against the All Blacks.\n\nThe Wallabies faded in the second half to suffer a stunning seven-point loss to Italy. (Getty Images: Timothy Rogers)\n\nIt is no surprise the Wallabies are limping towards the finish line with five Tests in successive weeks.\n\nThe Ireland showdown will be Australia's 14th in 20 weeks, of which they have won five. Schmidt suggested fatigue was a factor in Saturday's loss to the Italians but Bell dismissed the theory.\n\n\"We definitely have enough petrol in the tank,\" Bell said in Dublin.\n\n\"When you play for the Wallabies, when you play for your country, it's a massive honour, whether you've done it once or 100 times.\n\n\"Every week is exciting. Every week is an opportunity. I sit here as a 25-year-old and you never know how many more Tests you're going to play.\n\n\"You never know what's around the corner. Every time you pull on that jersey, it's an absolute privilege.\n\n\"So, for me, there's no bigger motivator than playing for country, and I know we're ready for the next two weeks and we're going to try really hard to get to resurrect things.\"\n\nThe Wallabies have not lost four Tests on an end of year tour to Europe since 1958. (Getty Images: Timothy Rogers)\n\nThe Wallabies' sorry plight is a far cry from last year when Schmidt's squad beat England and Wales to sit halfway towards a first undefeated grand slam tour since 1984.\n\nStream End Game with Tony Armstrong on ABC iview Tony Armstrong tackles Australia's overdue reckoning with racism in sport with the help of some of its biggest sports stars.\n\nBell said there had been a thorough review of their insipid performance against Italy.\n\n\"This morning was really tough, but it's about not taking it personally and just trying to get better,\" he said.\n\n\"We have hard conversations even when we win. I remember after the third Lions Test when we beat them, there was still hard conversations happening.\n\n\"It's about being in a professional environment and being with a team that holds high standards.\"\n\nIreland will be without Jamie Osborne after the fullback sustained a shoulder injury in the weekend's scrappy 41-10 win against Japan.\n\nCanberra-born former Brumbies wing Mack Hansen (foot) and centre Stuart McCloskey (adductor) have both linked back up with the Irish squad.\n\nHead coach Andy Farrell, who also has a Test with South Africa on November 22 to consider, will announce his match-day party on Thursday.\n\nCentre Garry Ringrose and Leinster teammate Josh van der Flier are both hoping to prove their fitness after respective hamstring strains kept them out against Japan.\n\nAAP\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-11-11/jail-for-sydney-financial-fraudster-scammed-families-property/105994956",
        "title": "Jail for dodgy financial fraudster who scammed families out of $20 million",
        "publish_date": "Tue, 11 Nov 2025 01:12:39 +0000",
        "category": "finance",
        "authors": [],
        "text": "A self-proclaimed property developer who scammed Western Sydney families out of more than $20 million has been sentenced to four years and 10 months in prison.\n\nMansa Group director Krishnakumar Sitaram Agrawal was convicted of using false documents to obtain a financial advantage and dishonestly using his position as a director with the intention to gain advantage and cause detriment in the NSW District Court on Friday.\n\nHis sentence started on Friday and he will not be eligible for parole before February 6, 2029.\n\nThe ABC reported in 2023 that Agrawal had leaned on friends and associates for significant chunks of money, saying the funds would be used to develop properties, and promised healthy returns.\n\nKrishnakumar Agrawal will spend more than four years in jail. (Supplied)\n\nIt was believed more than 150 mum-and-dad investors were swindled by the former financial advisor.\n\n\"Everything is messed up,\" one vulnerable investor told the ABC at that time.\n\nAgrawal's convictions were the result of an ASIC investigation, which found that between 2017 and 2023 he removed directors and shareholders within the Mansa Group without their knowledge.\n\nThe corporate watchdog also found Agrawal obtained loans from third party lenders under false pretences, and used the loans for the benefit of other corporations he ran.\n\n\"Mr Agrawal betrayed the trust of people within his social and cultural circles,\" ASIC deputy chair Sarah Court said.\n\n\"This sentence will be welcomed by those who invested significant amounts of money with Mr Agrawal after being caught up in his dishonest behaviour.\"\n\nMansa Group sat above a complex web of 27 companies which are all now in voluntary administration or liquidation.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-11-11/names-of-wa-energy-retailers-that-overcharged-customers-revealed/105993758",
        "title": "Every WA energy retailer has overcharged customers, inquiry finds",
        "publish_date": "Tue, 11 Nov 2025 01:06:56 +0000",
        "category": "finance",
        "authors": [],
        "text": "Every energy retailer in Western Australia has overcharged customers by taking automatic payments from closed accounts, an investigation has found.\n\nIt was revealed in October that state-owned utility Synergy had overcharged 174,000 customers a total of about $40 million since 2009, affecting mostly residential customers.\n\nAn investigation by the Economic Regulation Authority (ERA) has now determined all six other energy retailers in WA have overcharged thousands of customers in just the past two years.\n\nWhile the watchdog's investigation focused primarily on Synergy, WA's largest energy provider, it also requested data from other electricity and gas providers.\n\nThe ERA collected data over the past two years, from when industry codes were implemented for electricity suppliers in February 2023 and for gas suppliers in 2024.\n\nData taken from retailers since those dates shows Synergy was still the worst offender followed by Horizon Power, which overcharged customers $213,353, while Kleenheat overcharged the most customers — 1,500 of them.\n\nRefunds underway\n\nThe ERA has issued Synergy with a compliance enforcement notice, but found the six other providers had already put in place processes to identify and refund overpayments on closed accounts.\n\nSteve Edwell is chair of Economic Regulation Authority in Western Australia. (ABC News: Cason Ho)\n\n\"It is hard to understand how Synergy did not have any automating trigger or periodic health interrogation of its billing system,\" ERA chair Steve Edwell said.\n\n\" The ERA considers this a very material, systemic operational and financial management failure by Western Australia's largest energy retailer. \"\n\nSynergy risks huge fine\n\nMr Edwell said Synergy risked a fine of $100,000 — the maximum under WA regulation — if it did not make \"every effort\" to refund the $40 million to affected customers by April 2026.\n\nThe utility continued to charge customers whose accounts had been closed. (ABC News: Glyn Jones)\n\n\"Synergy, rightfully, has invested considerable time and resources in making system changes to ensure those overpayments do not continue, and has taken time to prepare for the mammoth task of contacting and refunding such a large number of customers,\" he said.\n\nSynergy's compliance notice is the second it has received this year, after the ERA issued an initial notice in July after finding the utility had taken $2.29 million in automatic deductions from Centrelink payments into closed accounts since 2009.\n\nSynergy chief executive Kurt Baker said in October, when the $40 million figure was revealed, that it would take \"several months\" for customers to be contacted and issued refunds.\n\nSynergy to repay $2.29 million after overcharging for power WA's main electricity bill utility Synergy overcharged nearly 2,850 vulnerable customers on their electricity bills dating back to 2009, with the total amount owed equalling $2.29 million.\n\n\"This isn't good enough, it's not acceptable, we've let our customers down, so I do want to apologise,\" he said at the time.\n\nMr Baker said Synergy had been alerted in the past by customers who were overcharged in this fashion, which Mr Edwell said should have been a red flag indicating there was a broader issue.\n\nWA Premier Roger Cook would not comment on whether $100,000 was a substantial enough penalty.\n\n\"That's to be debated and I'm happy to be advised in relation to that. At the moment my priority is to get that money back into the pockets of the customers that were subject to this overpayment,\" he said.\n\n\"This is an oversight, a neglect by Synergy, and we're very angry about it. We expect them to rectify that situation as quickly as possible.\"\n\nSynergy has been contacted for comment.\n\nLoading...",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-11-11/house-charli-xcx-john-cale-collab-song-wuthering-heights-movie/105995418",
        "title": "Charli XCX goes goth with John Cale for new Wuthering Heights collab",
        "publish_date": "Tue, 11 Nov 2025 01:05:48 +0000",
        "category": "entertainment",
        "authors": [],
        "text": "Forget Brat Summer, it's time to embrace Gothic Girl Winter.\n\nCharli XCX's next project after last year's pop blockbuster Brat is contributing several songs to the soundtrack of the new Wuthering Heights film adaptation from Emerald Fennell, Oscar-winning director of Saltburn and Promising Young Woman.\n\nToday, we get to hear the first of those tracks — a gothic collaboration with The Velvet Underground founding member John Cale that is a far cry from the brash electro-pop that defined her critically acclaimed 2024 record.\n\nTitled House, the track begins with eerie, scratchy strings and ominous narration from Cale.\n\n\"I'm a prisoner, to live for eternity,\" the 83-year-old intones in raspy spoken-word. \"Am I living in another world? Another world I created? For what!?\"\n\nThe tense mood eventually builds toward dramatic, guttural guitars as Charli accompanies Cale on what is the closest thing to a chorus:\n\n\" I think I'm gonna die in this house. \"\n\nLoading Instagram content\n\nProduced alongside frequent collaborator Finn Keane, House climaxes with industrial beats and distorted vocals, the brooding noise giving way for a final, lonely phrase from Cale: \"In every room, I hear silence.\"\n\nBoth musicians star in the music video, directed by Mitch Ryan and featuring haunting visuals, including a vulture on a leash and Charli XCX pouring candle wax on her skin and tossing her raven-coloured hair around a bedroom.\n\nIn a statement shared to X last week, Charli wrote about Emerald Fennell inviting her to be involved with her big-screen adaptation of Emily Brontë's novel Wuthering Heights.\n\n\"I read the script and immediately felt inspired,\" she wrote. \"After being so in the depths of my previous album I was excited to escape into something entirely new, entirely opposite.\n\n\" When I think of Wuthering Heights I think of many things. I think of passion and pain. I think of England. I think of the moors, I think of the mud and the cold. I think of determination and grit. \"\n\nA long-term fan, she added she reached out to Cale after his quote from a Velvet Underground documentary — in which he said any song by the band had to be both \"elegant and brutal\" — had stuck with her.\n\n\"We got connected, we spoke on the phone and wow … that voice, so elegant, so brutal.\"\n\nDirector defends 'primal and sexual' Wuthering Heights adaptation\n\nWuthering Heights is set to hit Australian screens on February 12, 2026, starring Australians Margot Robbie and Jacob Elordi.\n\nFollowing the reveal of an erotically charged trailer, the film has drawn criticism over the casting of its leads.\n\nBarbie star Robbie, 35, who also produced Wuthering Heights, plays Catherine Earnshaw, a teenager in the book, while Elordi plays Heathcliff, described in Brontë's 1847 novel as \"dark-skinned\".\n\nDirector Emerald Fennell has addressed the backlash, explaining at the Brontë Women's Writing Festival in September that she offered Elordi the role because he \"looked exactly like the illustration of Heathcliff on the first book that I read\".\n\nOn casting Robbie, Fennell added she is \"not like anyone I've ever met — ever — and I think that's what I felt like with Cathy\".\n\n\"[Robbie] is so beautiful and interesting and surprising, and she is the type of person who, like Cathy, could get away with anything … She could commit a killing spree and nobody would mind. And that is who Cathy is to me.\"\n\nLoading Instagram content\n\nFennell also defended her \"primal, sexual\" adaptation of the literary classic.\n\n\"I've been obsessed. I've been driven mad by this book … I know that if somebody else made it, I'd be furious.\n\n\"[It is] an act of extreme masochism to try and make a film of something that means this much to you. There's an enormous amount of sadomasochism in this book. There's a reason people were deeply shocked by it.\"\n\nMeanwhile, Charli XCX is involved in several upcoming film projects.\n\nShe made her acting debut co-starring alongside Lena Góra in Erupcja (Polish for eruption), directed by Pete Ohs and debuted at the Toronto International Film Festival earlier this year.\n\nCharli will feature in the A24 production The Moment in early 2026. Directed by Aidan Zamiri, the drama is based on an original idea by the pop star and is the first co-production from her production company studio365.\n\nThe singer also features in period fantasy film 100 Nights of Hero, horror remake Faces of Death, erotic thriller I Want Your Sex, action adventure comedy Sacrifice and thriller The Gallerist.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-11-11/guinea-pig-showing-booms-in-regional-victoria/105989292",
        "title": "Shelby the guinea pig's cheeky face wins over judges as showing booms",
        "publish_date": "Tue, 11 Nov 2025 00:58:42 +0000",
        "category": "finance",
        "authors": [],
        "text": "It was little Shelby's looks and cheeky personality that stole the hearts of the judges and the crowd, earning her the title of Ms Ballarat.\n\nBut this was no ordinary beauty pageant — Shelby was one of more than 300 guinea pigs taking part at this year's Cavy Council of Victoria show in Ballarat.\n\nShelby and her owner Aria Treacy are part of a growing movement in regional Victoria of competitive guinea pig showers, where owners pit their pets against each other in the cavy equivalent of a dog show.\n\nAria Treacy's guinea pig, Shelby, won Ms Ballarat. (ABC News: Coco Veldkamp)\n\nThe competitions showcase pedigree cavy preservation, education and breed improvement, with more than 20 categories on offer, from Cutest Face and Best Funky Hair to Heaviest, Best Couple and Best Smooth Coat.\n\nRegional boom\n\nThe collection of tiny paws, fluffy coats and twitching noses competing at the Cavy Council of Victoria's quarterly shows across the state are attracting hundred of competitors and spectators.\n\nOwners ensure their guinea pig's nails are trimmed, coat is brushed and they are bathed. (Supplied: Shuri Cavies)\n\nKen Pedderse, the Cavy Council of Victoria's president, said the number of regional Victorians taking up guinea pig showing was on the rise.\n\n\"We have seen a definite increase in cavy owners from regional Victoria not only attending both our country shows but also travelling to our home base venue in Dandenong North,\" Mr Pedderse said.\n\n\"Many of these people are becoming club members, with our statistics showing us that the majority of new memberships over the last two years are in fact from regional areas.\"\n\nFor the love of guinea pigs\n\nVice-president Michael Carter attributed the interest to the pet boom of the pandemic.\n\nMichael Carter is vice-president of the Cavy Council in Victoria. (ABC News: Coco Veldkamp)\n\n\"In the last five years there has been a larger interest — there was an uptick after the COVID pandemic,\" Mr Carter said.\n\n\"Compared to other pets they are relatively cheaper to get into.\"\n\nMr Carter grew up with guinea pigs, but said his family involvement began when his then-seven-year-old son Ben asked for a pet for his birthday.\n\n\"My son showed an interest in guinea pigs, and said he wanted to start showing,\" he said.\n\n\"We got involved, got on the committee, and started helping out running things.\"\n\nBen Carter says he loves guinea pigs because they each have a unique personality. (ABC News: Coco Veldkamp)\n\nNow 14 years old, Ben Carter is a passionate guinea pig owner and shower.\n\n\"It’s great to see them come from a baby into their older age, and see them progress,\" he said.\n\nHis three-year-old guinea pig, Popcorn, was among the competitors at Ballarat.\n\n\"He is very cute — he gives you those sad eyes,\" he said.\n\n\" He is in really good condition — [his] hair is on point. \"\n\nA guinea pig addiction\n\nLong-time member Sharron Wakely said her collection had grown rapidly since her first show.\n\n\"Four years ago I had five guinea pigs, then after competing in our first show, we got addicted,\" Ms Wakely said.\n\n\" I've got 120 guinea pigs at home now — I've got a custom shed for them. Some people here have over 300. \"\n\nShe said each guinea pig had a name and its own unique personality.\n\nHer top show pig, Starry Night, competed in several categories.\n\nSharron Wakely says some contestants have over 300 guinea pigs. (ABC News: Coco Veldkamp)\n\nKelly Wilson, another competitor, entered her two-year-old long-haired guinea pig Freddie, along with Barry — a rescue guinea pig found dumped on train tracks.\n\n\"Barry didn’t know how to be a guinea pig, and Freddie taught him how,\" Ms Wilson said.\n\nKelly Wilson's prize guinea pigs are called Freddie and Barry. (ABC News: Coco Veldkamp)\n\n\"Barry has taken out more prizes than Freddie — haven’t you Barry?\"\n\nLike many at the competition, Ms Wilson said the guinea pig showing community had become hugely important to her and her son.\n\n\"Everyone used to think I was crazy, and then I came and met my crazy people — it was fantastic,\" she said.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-11-11/prince-william-opens-up-about-kate-kings-cancer-with-children/105994676",
        "title": "How William and Kate told their children about princess's cancer",
        "publish_date": "Mon, 10 Nov 2025 23:49:58 +0000",
        "category": "lifestyle",
        "authors": [],
        "text": "Prince William says it was a \"balancing act\" for himself and his wife to share details of the family's recent health challenges, including Catherine's and King Charles's cancer diagnoses.\n\nIn a rare and candid interview in Brazil the prince said that \"hiding stuff from them doesn't work\".\n\nHe was responding to a question about how the couple had approached difficult moments with their three children — Prince George, 12, Princess Charlotte, 10, and Prince Louis, seven.\n\nEarlier this year Princess Catherine said her cancer treatment was \"like a roller-coaster\" after revealing in January she was in remission.\n\nPrincess Catherine reveals more details of cancer experience during hospital visit Catherine, the Princess of Wales, discusses her experience undergoing chemotherapy and resuming life afterwards.\n\nThe 43-year-old announced in March last year that she was undergoing treatment after tests following major abdominal surgery revealed she had cancer. She has never spoken publicly about the type of cancer.\n\nKing Charles also announced last year that he was receiving treatment for an undisclosed form of cancer for which he is still receiving treatment.\n\n\"Every family has its own difficulties and its own challenges,\" Prince William said in an interview with Brazilian TV host Luciano Huck.\n\n\"I think it's very individual and sort of moment-dependent as to how you deal with those problems.\n\n\"We choose to communicate a lot more with our children, now that has its good things and its bad things.\n\n\"Sometimes you feel you're oversharing with the children [and] you probably shouldn't.\n\n\"But most of the time hiding stuff from them doesn't work.\"\n\nWilliam and Catherine with their three children, George, Charlotte and Louis in September 2022. (Reuters: Jonathan Brady via pool)\n\nThe Prince of Wales said explaining to the children \"how they feel\" and \"why that's happening\" could sometimes help give them \"a bigger picture\".\n\n\"They can relax more into it rather than being really anxious about 'what are you hiding from me?'\" he said.\n\n\"There are a lot more questions when there are no answers.\n\n\"But it's always a balancing act, I mean, every parent knows that.\n\n\"How much do I say? What do I say? When do I say it?\"\n\nKing Charles is continuing to receive treatment for cancer. (Reuters: Alastair Grant/Pool)\n\nWilliam spoke to Huck in Rio de Janeiro ahead of the Earthshot Prize awards ceremony earlier this month. He is the founder of the awards.\n\nThe prize, now in its fifth year, encourages inventors and entrepreneurs to develop technologies to combat global warming and mitigate its impact.\n\nThe prince later attended the 30th UN Climate Change Conference, known as COP30, in Belém.\n\nPrince William with British Prime Minister Sir Keir Starmer (left) and Brazilian President Luiz Inácio Lula da Silva during COP30 in Belém, Brazil. (Reuters: Mauro Pimentel)\n\nWilliam also said the couple's three children did not have phones.\n\nHe said Prince George might be allowed to have a phone with \"limited access\" when he attended secondary school next year.\n\n\"It's really hard,\" he said.\n\n\"It's getting to the point where it's becoming a little bit of a tense issue, but I think he understands why.\n\n\"We communicate why we don't think it's right, and again, I think it's the internet access I have a problem with.\n\n\"I think children can access too much stuff they don't need to see online.\"\n\nRecently, the Princess of Wales warned that smartphones and other digital devices threatened the development of young children in an essay published by Catherine's Royal Foundation Centre for Early Childhood.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-11-11/community-housing-concerns-in-broome-wa/105974998",
        "title": "House littered with used needles and rubbish offered to single mother",
        "publish_date": "Mon, 10 Nov 2025 22:57:39 +0000",
        "category": "finance",
        "authors": [],
        "text": "Having experienced homelessness for years, single mother of two Amelia Johnson says she was relieved when she secured a house in Western Australia's far north.\n\nBut the relief quickly vanished when she visited the Forrest Street home assigned to her in October by the state's Department of Housing and Works in Broome, 2,000 kilometres north of Perth.\n\nPhotos show discarded needles scattered around the property. (Supplied: Amelia Johnson)\n\n\"It was just shocking,\" Ms Johnson said.\n\n\"The further I walked, the more disgusted I became.\"\n\nPhotos provided to the ABC showed discarded needles and rubbish littered around the property, with inside surfaces caked in dirt.\n\nMs Johnson also claims the property was not secure, with large gaps between the screens and windows.\n\n\"That area they put me in is extremely dangerous [and] the security screens aren't even secure,\" she said.\n\nAmelia Johnson says the bathroom was dirty with dead frogs on the floor. (Supplied: Amelia Johnson)\n\nMs Johnson deemed the house too unsafe to live in with her children, aged 11 and 12, so she returned to Kununurra, 1,000 kilometres away, to \"couch surf\" with family instead.\n\n\"I'm in a homeless situation … that unit isn't even safe for me and the kids to move into,\" she said.\n\nAmelia Johnson says the garden was littered with rubbish. (Supplied: Amelia Johnson)\n\nShe said she complained to the department's office in Broome, but claimed her concerns were dismissed and several other queries were ignored.\n\n\"Shouldn't the Department of Housing be responsible for making sure my children and I have safe and secure housing, since what was allocated to us is so disgusting?\" Ms Johnson said.\n\n\" Housing hasn't even bothered to call me … that's how much value they put on my quality of life and my children's life. \"\n\nProperty vandalised\n\nIn a statement, a Department of Housing and Works spokesperson said the property was not in that condition when it was offered to Ms Johnson.\n\n\"The Department of Housing and Works strives to ensure tenants are provided with housing that is clean, safe and suitable to their needs,\" they said.\n\n\"Unfortunately, in this case, in between an inspection and when Ms Johnson moved in, people have broken into and significantly vandalised the property.\"\n\nAmelia Johnson says the home was in an \"extremely dangerous\" area. (ABC Kimberley: Giulia Bertoglio)\n\nThey did not respond to queries on when the property was last cleaned.\n\nThe spokesperson said Ms Johnson had been offered another three-bedroom family home in Broome and they were in regular contact.\n\n\"Maintenance works will commence soon to restore the Forrest Street home,\" they said.\n\n'Housing is a human right'\n\nWA Council of Social Services chief executive Louise Giolitto said it was \"never acceptable to present a house if it's unliveable\".\n\n\"You have GROH [Government Regional Officer Housing] housing, which is for public servants, which has minimum standards, including thermal controls, but they don't apply the same minimum standards for public housing,\" she said.\n\n\"We firmly believe they should be the same. Housing is a human right and minimum standards are important.\"\n\nLouise Giolitto says the state government should provide homes that meet a minimum standard. (ABC News: Jake Sturmer)\n\nMs Giolitto said the Department of Housing and Works received more than 200,000 work orders for repair and maintenance a year.\n\nShe said in the Kimberley and Pilbara, the problem was often \"getting the workforce to actually do those repairs\".\n\n\"They're making value judgements about allowing tenants to go in, because there's such high demand, as we know there's over 20,000 people on the wait list,\" Ms Giolitto said.\n\n\"So they're in a bind at the moment … it's time to become proactive and actually have a planned maintenance for all their properties.\"\n\nBroome's population is about 19,000, and renting a home privately or through a real estate agent has been unachievable for many.\n\nOver the past five years, Broome rents have increased by about 120 per cent, with the current median weekly rental price set at $1,200.\n\nLoading...",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-11-11/victoria-queenscliffe-council-ceo-martin-gill/105993726",
        "title": "Victoria's smallest LGA votes for 'early finalisation' of CEO's contract",
        "publish_date": "Mon, 10 Nov 2025 22:45:00 +0000",
        "category": "finance",
        "authors": [],
        "text": "The Borough of Queenscliffe, Victoria's smallest council, has voted for the \"early finalisation\" of its CEO's Martin Gill's contract.\n\nQueenscliffe councillors held the vote on Monday evening during a special meeting of council which was closed to the public.\n\nMayor Di Rule announced the decision in a statement on Tuesday morning.\n\n\"The Borough of Queencliffe Councillors and current CEO Martin Gill have agreed terms for the early finalisation of the CEO's present employment contract,\" Cr Rule said.\n\n\"Under those terms, Mr Gill is to cease in his present role on 28 November 2025.\"\n\nIt is understood Mr Gill still had close to a year left on his contract, which was worth about $285,000 this year according to the Borough's latest Annual Report.\n\nThe Mayor did not explain why Mr Gill's contract had been brought to an early conclusion.\n\nCr Rule said the council would now appoint recruitment agency McArthur to help find a \"suitable permanent CEO to replace Mr Gill\".\n\n\"I am excited by the opportunity to bring fresh energy and ideas to the management and culture of our Council,\" Cr Rule said.\n\n\"Meanwhile Council is likely to appoint an interim CEO to perform the role until a permanent CEO is identified and appointed.\"\n\nMr Gill has been contacted for comment.\n\nQueenscliffe is Australia's last remaining borough, and the smallest and least populated of Victoria's 79 local government areas — measuring just 8.6 square kilometres and home to 3,238 people.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-11-11/whitlam-dismissal-live-blog-how-it-unfolded-50-years-ago/105973458",
        "title": "Live: Follow how the Whitlam Dismissal unfolded in real time, 50 years on",
        "publish_date": "Mon, 10 Nov 2025 22:10:40 +0000",
        "category": "finance",
        "authors": [
            "Ahmed Yussuf",
            "Shiloh Payne"
        ],
        "text": "Fifty years ago today, prime minister Gough Whitlam was dismissed by governor-general Sir John Kerr.\n\nIt was a day etched in the memories of those who were there as one of the most significant moments in Australian political history.\n\nTo mark the anniversary, we are putting you right there as it happened, covering the key moments of that fateful day in 1975 in real time.\n\nThe information in today's blog has been sourced from archival material including the ABC Radio's live coverage, the Museum of Australian Democracy, the National Archives of Australia, Hansard, the Parliamentary Handbook, the Whitlam Institute, whitlamdismissal.com, news reporting, and first-person accounts. The times are indicative.\n\nStep back in time with us.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/rural/2025-11-11/demand-for-irrigation-in-the-outback-as-cropping-grows/105862796",
        "title": "Farmers push to use Great Artesian Basin for irrigation in western Qld",
        "publish_date": "Mon, 10 Nov 2025 21:50:13 +0000",
        "category": "finance",
        "authors": [],
        "text": "Looking out across Scott Holcombe's sorghum crop, you would be forgiven for thinking you were standing in southern Queensland's cropping country.\n\nHis 4,000-hectare dryland crop is in the heart of outback Queensland's cattle country, 1,400 kilometres north-west of Brisbane, near the small outpost town of Corfield.\n\nThis country is known for its wide Mitchell grass plains, variable seasonal conditions and long, hard droughts.\n\nBut Mr Holcombe has been able to transform what he says is his most unproductive country into his most abundant by growing sorghum.\n\nScott Holcombe wants to expand his 4,000-hectare sorghum crop. (Supplied: Scott Holcombe)\n\nThe grazier would like to expand his crop, which he uses to feed his cattle, by accessing water from one of the largest underground freshwater reservoirs in the world — the Great Artesian Basin.\n\n\"It would be game changing in a very positive direction,\" Mr Holcombe said.\n\nBeing a dryland crop, the sorghum relies on rainfall during the wet season from November to April to replenish soil moisture so it can survive during the dry season.\n\nDuring that time, the nutritional value within the crop is substantially lower.\n\nThe sorghum on Scott Holcombe's property during the dry season. (ABC Rural: Maddelin McCosker)\n\nMr Holcombe said a water licence to irrigate during the dry season would allow him to expand and improve the quality of the crop.\n\n\"To irrigate in the winter is the perfect time … because we don't have the huge evaporation that time of year, as opposed to summer,\" he said.\n\n\"Plus, you're getting rain in summer, so you don't really need it then.\"\n\nMr Holcombe said it would not only be a game changer for him, but it could also advance the wider cropping industry in the west.\n\nCotton farming is proving to be a viable crop further north around Julia Creek. (ABC News: Kristy O'Brien)\n\n\"The hardest thing is getting the soil and we've got the soil, you just have to add water,\" he said.\n\n\"What that would do for towns would be astronomical … there's huge potential.\"\n\nWater review\n\nLandholders are required to apply for a licence or permit to access water from the Great Artesian Basin, which is estimated to hold about 65 million gigalitres of underground water.\n\nThere are about 6,500 licences and 21 water permits to access water within the basin, which are allocated and managed through the Water Act 2000 and the Great Artesian Basin and other regional aquifers (GABORA) water plan.\n\nThe GABORA plan is being reviewed by the Queensland government, and a new plan is expected to come into effect from late 2027.\n\nThe Great Artesian Basin is Australia's largest groundwater basin. (Supplied: Geoscience Australia)\n\nWater licences in Queensland are issued and managed by the Department of Regional Development, Manufacturing and Water (DRMW).\n\nStock and domestic licences are the most common licences, used by graziers to ensure their stock and homes have water.\n\nTo access the basin for irrigation or large volumes, landholders or businesses require a volumetric water licence or water allocation.\n\nDepartment of Water southern region executive director Hamish Butler said accessing water licences for irrigation could be difficult.\n\nInterest in water allocations is growing, Hamish Butler says. (ABC Rural: Daniel Fitzgerald)\n\n\"Water licences cannot generally be granted,\" Mr Butler said.\n\nThe most common way water allocations can be accessed, according to Mr Butler, is through trading: people who already have an allocation selling it to someone else.\n\n\"It allows water to move around towards the activities where people need it the most,\" he said.\n\nChanges to water plan\n\nAs the cropping industry expands into new areas, Mr Butler said interest in water allocations was growing outside of typical regions.\n\nEven during the dry season, Scott Holcombe says his cattle are making impressive weight gains from the sorghum crop. (ABC Rural: Maddelin McCosker)\n\n\"We are seeing a need to open up that trading framework,\" he said.\n\n\"The GABORA water plan is being replaced, and as part of that process, the department is going to look at the trading rules to see if they're appropriate or if more flexibility can be introduced.\"\n\nSorghum is grown at Corfield Downs to support its cattle operation. (ABC Rural: Maddelin McCosker)\n\nDuring the dry winter season, Mr Holcombe said his stock were still putting on more weight from eating the dry sorghum crop than they would if they had been eating grass.\n\n\"We're getting weight gains of 1.2 [kilograms per day] on a mob of steers,\" Mr Holcombe said.\n\n\"We're in a weight-gain business and we rely on summer rainfall … in September, that gets down to 200 grams if you're not assisting with feed supplements.\"\n\nSorghum at Corfield Downs is still shooting after small falls of rain. (ABC Rural: Maddelin McCosker)\n\nFor Mr Holcombe, having access to nutrient-rich sorghum year-round would help push his business forward.\n\n\"If you get a really good season, you can grow it 3 metres high and that thick you can't walk into it,\" he said.\n\n\"When it doesn't rain, you don't grow anything.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-11-11/urban-rampage-withdraws-appeal-asic-centrepay-credit-ban/105991390",
        "title": "Outback retailer withdraws bid to overturn Centrepay credit ban",
        "publish_date": "Mon, 10 Nov 2025 21:22:02 +0000",
        "category": "finance",
        "authors": [],
        "text": "Outback retailer Urban Rampage has withdrawn its bid to overturn a permanent ban on signing customers up to Centrepay credit arrangements.\n\nThe clothing, jewellery and homewares retailer operates 10 stores across regional and remote Western Australia, the Northern Territory and Queensland.\n\nIn February 2024, the Australian Securities and Investments Commission (ASIC) found the store's parent company, Coral Coast Distributors (CCD), was using Centrepay and causing consumers financial harm.\n\nIts customers \"predominantly reside in remote Aboriginal communities\" and \"are on low income or welfare recipients,\" according to the Urban Rampage website.\n\nCoral Coast Distributors had lodged an appeal to the Centrepay ban, which was set to be heard before the Administrative Review Tribunal, but has since withdrawn the application.\n\nA tribunal spokesperson said the case had been finalised and there would be \"no further listings\".\n\nStores 'should have known better'\n\nCentrepay, which is run by Services Australia, allows people to purchase select goods and services through deductions from their Centrelink payments.\n\nASIC commissioner Alan Kirkland said it was unclear how many customers, particularly First Nations consumers, were signed up to debts they could not afford or fully understand.\n\n\"Deductions were coming out of their Centrelink payments before they even received them,\" he said.\n\n\"Now these were by definition, people on low incomes so when those incomes were cut even further, that meant many of them were unable to pay day-to-day expenses.\"\n\nAlan Kirkland says Urban Rampage targeted vulnerable customers. (ABC News: Julian Robins)\n\nMr Kirkland said Urban Rampage \"should have known better\".\n\n\"This is a warning to other businesses that you can't use credit facilities in ways that cause widespread harm,\" he said.\n\n'Writing on the wall'\n\nRecent changes to Centrepay announced by the federal government came into effect on November 3.\n\nThe reforms meant items such as household goods, sports equipment and furniture could no longer be purchased using Centrepay.\n\nMr Kirkland said he believed ASIC's investigation \"fed into their [Services Australia's] thinking\".\n\n\"The writing was on the wall,\" he said.\n\n\" We're really pleased they've discontinued this appeal because we made that stop order for a reason we think should stand, and now we know that it will. \"\n\nRetailers concerned about Centrepay changes Business owners worry major changes to a buy now, pay later system used by about 500,000 social security recipients will cause a raft of issues when it begins next month.\n\nWhile Centrepay is off the cards for Urban Rampage, the company is allowed to sell goods through another direct debit program and Afterpay.\n\nThe Urban Rampage website states \"the product is suitable for people who would like access to credit with limited recourse, no fees and charges and who meet the eligibility criteria\".\n\nASIC said it would continue to monitor any financial arrangement where there was a risk of consumer harm.\n\n\"We really need to look at each of these arrangements on a case-by-case basis, to look at exactly how they're working, what the terms and conditions are, what the processes are,\" Mr Kirkland said.\n\nUrban Rampage was first banned from using Centrepay's credit service in 2024. (ABC Alice Springs: Chris Murrkarany Fitzpatrick)\n\nLevel playing field\n\nIn a written statement, Coral Coast DC said it had withdrawn its appeal because the recent federal government changes ensured a \"fair and level playing field\" for all businesses operating in the same household goods category.\n\n\"Our focus throughout has been on maintaining fair competition and financial viability for our stores in regional and remote areas,\" it said.\n\nUrban Rampage operates 10 stores across WA, QLD and the NT. (ABC Kimberley: Andrew Seabourne)\n\nThe company also denied its practices were causing harm to customers, stating it had always complied with relevant laws and regulations, and services were interest and fee-free.\n\n\"ASIC's order was issued without any evidence of customer complaints, customer harm, or unconscionable conduct,\" the company statement read.\n\n\"For many people in regional and remote communities, Centrepay was the only safe and regulated way to purchase essential items without turning to high-cost or unsafe credit options.\"\n\nThe company said it was confident in the processes it had set up for direct debit payment, with customers individually assessed by trained staff.\n\n\"The goal is to provide simple, responsible payment options with no fees that promote financial inclusion and protect customers with limited access to safe credit,\" it said.\n\nKimberley financial counsellor Veronica Johnson said many of her clients had been \"taken advantage of\".\n\n\"We don't know the extent of the harm that was caused,\" the Djarindjin financial counsellor said.\n\nMs Johnson called for greater checks of a customer's financial standing.\n\nVeronica Johnson says her remote Aboriginal clients have been taken advantage of. (ABC Kimberley: Esse Deves)\n\n\"I think it's just opening another tap where there's going to be vulnerability involved and people will be taken advantage of,\" she said.\n\n\"I guess the future will tell us once we are actually able to talk to some of these consumers to see what harm has been caused.\"\n\nLoading...",
        "source": "ABC"
    },
    {
        "url": "https://www.smh.com.au/business/markets/asx-set-to-rise-nvidia-pulls-wall-street-higher-20251111-p5n99c.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "CBA shares tumble to weigh down ASX",
        "publish_date": "Tue, 11 Nov 2025 12:50:10 +1100",
        "category": "finance",
        "authors": [
            "Staff Writers"
        ],
        "text": "The Australian sharemarket has slid into the red on Tuesday, with the Commonwealth Bank diving after the bank released a quarterly trading update.\n\nThe S&P/ASX 200 was down 6.7 points, or 0.1 per cent, to 8829.2 in just after midday, with nine of 11 industry sectors in positive territory.\n\nWall Street has made a positive start to the week, driven higher by tech giants. Credit: Bloomberg\n\nFinancial stocks are mixed, with the big four banks making big price moves. The Commonwealth Bank plunged 6 per cent after releasing its quarterly update, while the National Australia Bank (down 0.9 per cent) also lost ground, but there were strong gains for ANZ (up 0.9 per cent) and Westpac (up 1.2 per cent) in early trade.\n\nMining stocks climbed. Iron ore heavyweights Rio Tinto (up 0.9 per cent), BHP (up 0.4 per cent) and Fortescue (up 1.1 per cent) advanced after the price of the key steel-making ingredient rose while gold miners had more reasons to cheer as the price of the safe haven jumped, with local players Northern Star (up 4.6 per cent) and Evolution Mining (up 3.1 per cent) surging.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/victoria/geelong-midfielder-tanner-bruhn-revealed-as-player-cleared-of-rape-charge-20251110-p5n932.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Geelong midfielder Tanner Bruhn revealed as player cleared of rape charge",
        "publish_date": "Tue, 11 Nov 2025 12:27:51 +1100",
        "category": "sports",
        "authors": [
            "Erin Pearson",
            "Carla Jaeger"
        ],
        "text": "Geelong midfielder Tanner Bruhn can finally be revealed as the player who spent the 2025 season fighting a rape charge, as the case against him was officially dropped on Tuesday.\n\nA suppression order has prevented the naming of Bruhn, 23, since he was charged earlier this year with raping an intoxicated woman he met outside a strip club.\n\nTanner Bruhn. Credit: Getty Images\n\nBruhn applied for the media blackout on the basis that it was needed to protect his safety.\n\nHis co-accused and close friend, Patrick Sinnott, also tried but failed to have his name withheld. The Geelong Magistrates’ Court heard the pair were former housemates who had known each other since primary school.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/business/companies/cause-of-two-near-misses-at-melbourne-airport-revealed-20251110-p5n981.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Cause of two near misses at Melbourne airport revealed",
        "publish_date": "Tue, 11 Nov 2025 12:09:42 +1100",
        "category": "finance",
        "authors": [
            "Chris Zappone"
        ],
        "text": "Australia’s transport safety inspector says that a failure of flight crews to understand take-off conditions nearly led to two major accidents at Melbourne Airport in 2023.\n\nA Malaysia Airlines A330, with 237 people on board, and a Bamboo Airways 787, with 212 people on board, both overran a shortened runway during take off, lifting off only metres above an active worksite.\n\nEach aircraft reportedly took off past the limit of a shortened runway, resulting in “jet blast affecting people and objects and people in the work area”, the Australian Transport Safety Bureau (ATSB) said on Tuesday.\n\nThe incidents, which triggered a risk review, were caused by flight crews’ insufficient understanding of take-off conditions, putting the lives of workers, passengers and flight crews in danger.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/queensland/brisbane-news-live-man-breaks-into-brisbane-police-facility-steals-cop-uniform-20251110-p5n94n.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Brisbane news live: Princess Anne visits to mark Remembrance Day; Man breaks into police facility, steals cop uniform; Dog still missing after ute stolen",
        "publish_date": "Tue, 11 Nov 2025 12:03:23 +1100",
        "category": "finance",
        "authors": [],
        "text": "Over a dozen new food outlets are preparing to open in Brisbane International Airport, expanding the culinary offerings for travellers.\n\nThirteen new food outlets will open in the international terminal over the next year.\n\nThe likes of McDonald’s, Hungry Jacks and KFC will be opening in the international terminal, alongside a Mediterranean-inspired bar Manna, Sushi Jiro and Liv Eat kiosks, and coffee brand Bellissimo. McDonalds will be one of the first to open in late December, with additional outlets opening throughout 2026.\n\n“This upgrade is about celebrating the best of Brisbane and giving our customers more of what they love, great food, great coffee, and a great start to their journey,” said Scott Norris, executive general manager commercial at Brisbane Airport.\n\nThis development is part of the airport’s $5 billion Future BNE transformation.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/culture/music/i-can-t-really-thrash-the-drums-any-more-midnight-oil-s-rob-hirst-20251107-p5n8ne.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "I can’t really thrash the drums any more: Midnight Oil’s Rob Hirst",
        "publish_date": "Tue, 11 Nov 2025 12:00:00 +1100",
        "category": "entertainment",
        "authors": [
            "Michael Dwyer"
        ],
        "text": "Save Log in , register or subscribe to save articles for later. Save articles for later Add articles to your saved list and come back to them any time. Got it Normal text size Larger text size Very large text size Rob Hirst’s drum kit has hit the road without him this time. “As we speak,” the power behind Midnight Oil reports with a satisfied if slightly wistful air, “it’s trundling down the Hume Highway on its way to the Music Vault in Melbourne.” Last month, the battered black Ludwig kit that propelled the Oils’ countless circuits around the planet from 1979 until 2022 sold for $90,000 at auction. With the fundraising clout of “rusted-on fans” known as the Powderworkers, that result was $80,000 above reserve. “The love just kept pouring in,” Powderworker Matthew Yau says. And then it poured back out again: half the proceeds are earmarked for the musicians’ charity Support Act, the other half for the Fix ’Em Up Truck campaign to keep First Nations bands on the road in the Northern Territory. “I can’t really thrash the drums any more,” Hirst says simply. In 2023, six months after the last ever Oils gig at Sydney’s Hordern Pavilion, he was diagnosed with stage 3 pancreatic cancer. Today he’s “hanging in there,” he reports in his upbeat way. “I’m looking at the bush and the jacarandas are all out. It’s a lovely time of year.” Midnight Oil in the early 1990s. Credit: John Vella, Columbia To this forever fan’s ear, his pinched breath is palpable on the phone from Sydney. His voice is more plaintive, too, on A Hundred Years or More, his new EP with old schoolfriend turned Oils guitarist Jim Moginie and drummer Hamish Stuart. Hirst plays acoustic guitar. His songs are drenched in psychedelic sunshine and melody. “I realise it’s quite an existentialist bunch of songs, with titles like Are We There Yet? and A Hundred Years or More,” he says with a laugh. “I suppose I’ve been thinking about lifespan and longevity – legacy, even. And, of course, that comes out in the songs.”\n\nAdvertisement\n\nThe opening track, First Do No Harm, is a kind of prayer for the future, calling on every living soul to take the same life-affirming responsibility in all things as doctors invoke with the Hippocratic Oath. “I’ve obviously been spending too long in hospitals,” he jokes. He considers the rest of his time well occupied “as long as I can get angry and irritated by what’s going on in the world but still try to put it in a form where there’s hope for the future. It’s been a bleak time, here and internationally, but if you dwell on that, you forget the beauty of the everyday. “Now that I’ve started counting back in life rather than counting forward, the days are even more precious.” It’s family and friends, naturally, that feel most precious as the days grow less certain. When both come together in a recording studio – his daughters Lexi and Gabriella both sing on the new EP – the results are nothing short of “joyful”. Rob Hirst (centre) with bandmates Jim Moginie (left) and Hamish Stuart. Credit: Robert Hambling “All the girls can sing,” Hirst says. He made an album with his eldest, Nashville-based Jay O’Shea, in 2022. “Lexi’s a publisher; Ella’s an artist in Berlin… I was strumming A Hundred Years or More at home with a half-finished lyric and Ella started singing… there was an honesty there, and freshness. It suits the mood perfectly.” Hirst’s renown as one of our most formidable drummers often overlooks his legacy as a writer. The majority of the Oils’ 13-album catalogue bears his credit as well as his strident vocals, driven always by the warrior conviction that gave the band its uncompromising edge.\n\nAdvertisement\n\n“We didn’t know it at the time,” he says, reflecting on Sydney’s northern beaches in the 1970s, “but we came up at a time when people were tribally loyal to these new bands, and there were a gazillion gigs to play… They were the halcyon days, a time never to be repeated, and we were so fortunate. “All that road work stood us in good stead…. By the time we went overseas, we were a pretty cooking live band.” The fact that he and singer Peter Garrett had both studied law was not a bad asset in the den of thieves known as the music business, he adds drily. But the band’s determination to be agents of real political change means he’s equally blunt about disappointments. The failure of the push for an Indigenous voice to parliament in 2023 was “a shocker” he still can’t fathom. Hirst on stage with Midnight Oil in 2022. Credit: Paul Rovere In 2020, Midnight Oil had broken a long silence with The Makarrata Project, an ambitious collaborative album designed to educate and influence popular opinion in favour of First Nations recognition. “Playing with Coloured Stone, having Bunna Lawrie, Dan Sultan, Joel Davison involved… those collaborations lifted everything. Makarrata was my favourite thing we ever did,” Hirst says, far more proud than bitter. “I’m happy we were among those bands – U2, Billy Bragg, all the First Nations musicians here and overseas – putting the case for justice.” And again, he defers to comrades – Shane Howard, Alan Pigram, Neil Murray – as fellow explorers of the western desert, “finding a whole different Australia. How lucky we were to see that, and to put it into song.”\n\nAdvertisement\n\nHunger After Power, the last song on the A Hundred Years or More EP, is in many ways its most pointed: a naked plea for democracy under pressure. “Ooh, how can it be?” the singer wants to know as the scales of justice appear to melt down. “Every saint in heaven, say a prayer for me.” “We could so easily write the darkest stuff, ’cause it’s all around us every day. But I think people want hope,” Hirst says. “On that last track, I think Jim provides that with that incredible guitar solo. He said to me, ‘This Pink Floyd song you’ve written, Rob…’ and I said, ‘Yeah, you know what to do’.” TAKE 7: THE ANSWERS ACCORDING TO ROB HIRST Worst habit? I’ve never had a smartphone and I never answer my dumb phone. Does that qualify? Greatest fear? Terrible pain. The line that has stayed with you? “Be kind because everyone you meet is fighting a great battle.” [Variously attributed] Biggest regret? Any unnecessary pain I’ve caused anyone over the years. Favourite book? 33 Revolutions Per Minute by Dorian Lynskey. It’s a history of protest music. It’s quite a coffee table tome, but I commend it to you. The artwork or song you wish was yours? Something in the Air by Thunderclap Newman. If you could time travel, where would you choose to go? I’d like to have wandered around Sydney, the place I’ve always lived and always loved, in the 1850s, after the gold rushes. Yeah. I’d just love to go for a wander around the harbour. Imagine. That would be pretty great. To Powderworkers and their rusted-on ilk, the reference back to the epic final track on the first Midnight Oil album of ’78, Moginie’s Nothing Lost — Nothing Gained, is about as poignant as rock music gets. “I said, ‘Jim, just express everything through that amazing guitar of yours’,” Hirst says. “And he did.” He admits that surrendering his own instrument to the vault of history has brought “a combination of relief and wistfulness… That black one was like a close friend. The things that kit’s seen: overturned in trucks, thrown off risers, drenched in water and Gatorade… but it always came up again.” Asked whether he believes in anything beyond his own battle-scarred body, he answers with due contemplation. “Yes, I do,” he says hesitantly, though an early insight into the hypocrisy of organised religion sent him “through the pagan door” at 13. “I haven’t been in a church since except for weddings and funerals… “I do believe there’s something,” he muses, no doubt gazing past the jacaranda blossoms into the Australian bush he adores, “but I would bring it back to Earth again. I believe that all the clues are out there in the bush, waiting for us. And we must protect it, for our own sakes and for the Earth.”\n\nAdvertisement",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/business/the-economy/trump-is-really-really-bad-at-maths-20251111-p5n9ar.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Trump is really, really bad at maths",
        "publish_date": "Tue, 11 Nov 2025 11:57:03 +1100",
        "category": "finance",
        "authors": [
            "Stephen Bartholomeusz"
        ],
        "text": "So far, tariffs – including those that pre-date Trump’s “Liberation Day” baseline and reciprocal tariffs – have raised about $US174 billion, of which about $US120 billion relates to the Trump tariffs. The Yale Budget Lab has estimated that Trump’s tariffs, including the sectoral tariffs that are included in the Supreme Court challenge, will raise about $US2.6 trillion over the next decade if they remain in place, but after changes in consumption induced by the impact of the tariffs on prices, the net revenue generated would be $US2.2 trillion. Trump’s plan to shower US citizens with cheques was light on detail. Credit: Bloomberg New taxes – and the tariffs are effectively taxes on US companies and households – create ripple effects through the economy as businesses and households respond to the changes in their costs. A Tax Foundation economist, Erica York, said in a post on X that “a dollar of tariff revenue offsets about 24 cents of income and payroll tax revenue,” which would mean that the $US120 billion of revenue collected from the Trump tariffs so far would generate only a net $US90 billion of additional revenue.\n\nBecause Trump hasn’t set a cut-off point for the incomes of those who would receive the “dividends,” the cost of the payments can’t be precisely calculated. York, though, said that if the cut-off point were $US100,000, and children were excluded, it would be around $US300 billion a year. The non-partisan Committee for Responsible Federal Budget (CFRFB) says that if the payments were made to both adults and children, excluding the top 10 per cent of income earners, each round of payments would cost about $US600 billion. So, the tariffs would, according to the Yale Budget Lab, generate a net new $US2.2 trillion over a decade – if the Supreme Court allows him to keep collecting the baseline and reciprocal tariffs – but Trump’s dividend payments would cost between about $US3 trillion and $US6 trillion over that period.\n\nSomehow, Trump thinks he can both pay back America’s “enormous” debt (it’s actually above $US38 trillion and rising daily) and shower households with $US2000 cheques. The numbers don’t work. In fact, whether the cost were $US3 trillion or $US6 trillion over a decade Trump’s dividend plan would greatly exacerbate America’s already rapidly deteriorating public finances. Trump’s tariff “dividends” are a bad idea for a raft of reasons and based, as one might expect from Trump, on a thought bubble and on “pie in the sky” premises. The US had a $US1.8 trillion budget deficit in its latest financial year to September. The CFRFB says the cumulative deficits over the next decade will, thanks to Trump’s “One Big Beautiful Bill,” total about $US22.7 trillion. That’s before including any impact from Trump’s dividend plan, so anywhere from $US3 trillion to $US6 trillion could be added to those deficits. US gross domestic product is about $US30.6 trillion, so the dividends would add roughly between one and two per cent to US budget deficits.\n\nLike many of Trump’s promises, of course, the dividend cheques might never appear. The US Treasury Secretary, Scott Bessent appeared taken aback by Trump’s posts, saying he hadn’t talked to him about the plan. He suggested that the payments might not be the direct payments Trump envisages, saying that it could come “in lots of forms, in lots of ways.” “It could be just the tax decreases that we are seeing on the president’s agenda,” he said, referring to the big tax cuts for companies and wealthy households in the One Big Beautiful Bill, which also included the removal of some taxes on tips and overtime. In other words, there might be no new tariff-funded dividends, which would be the fiscally sensible position for a US Treasury Secretary who saw his agency pay out more than $US1 trillion in net interest costs alone in the financial year to end-September and would know that, thanks to the One Big Beautiful Bill, that number will keep climbing.\n\nRevenue from Trump’s tariffs might only put a dent in US deficits and won’t stop US government debt from continuing to mount, but every little bit helps. Loading The other aspect of Trump’s proposal, if it were ever implemented, is its impact on inflation. Trump’s tariffs are inflationary. They continue to inch the inflation rate up (when the inflation reports are available). That rate is now 3 per cent and may well continue to rise as the full effect of the tariffs, if they are allowed to stand, flow through. So, Trump would inject new stimulus into households where the Yale Budget Lab says the tariffs will already add 1.3 per cent to inflation in the near term, or about half that if the administration loses the Supreme Court action.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/victoria/details-of-two-near-misses-at-melbourne-airport-20251111-p5n9ni.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Details of two near misses at Melbourne Airport",
        "publish_date": "Tue, 11 Nov 2025 11:48:27 +1100",
        "category": "finance",
        "authors": [],
        "text": "Details of two near misses at Melbourne Airport\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/basketball/sulking-nba-player-hits-staffer-in-the-head-with-water-bottle-20251111-p5n9ev.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Sulking NBA player hits staffer in the head with water bottle",
        "publish_date": "Tue, 11 Nov 2025 11:43:02 +1100",
        "category": "sports",
        "authors": [],
        "text": "Sulking NBA player hits staffer in the head with water bottle\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/money/planning-and-budgeting/thinking-of-selling-your-home-to-afford-aged-care-think-again-20251111-p5n9cd.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Thinking of selling your home to afford aged care? Think again",
        "publish_date": "Tue, 11 Nov 2025 11:36:26 +1100",
        "category": "finance",
        "authors": [
            "Rachel Lane"
        ],
        "text": "For years, the mantra around aged care and the family home was simple: think twice before you sell. But in a post-November 1 world with changing rules and financial implications that reach well beyond emotional ties, that advice has shifted to think three times.\n\nMany people believe selling the family home is the only way to fund aged care, particularly when faced with the Refundable Accommodation Deposit (RAD) that is normally hundreds of thousands of dollars.\n\nWhether you choose to sell your home to pay for your aged care is totally up to you. Credit: Simon Bosch\n\nThe fact that any unpaid RAD incurs interest at 7.61 per cent per annum can make it seem like a no-brainer – after all, a $750,000 RAD equates to $57,075 a year. The numbers are big and selling the house feels like a simple way to make it all work.\n\nBut in numerous instances, keeping your home can provide significant financial advantages, ones you can’t get from any other asset.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/culture/tv-and-radio/jimmy-kimmel-trump-late-night-tv-cancellation-20251110-p5n90o.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Thought Kimmel was anti-Trump before? You should watch his show now",
        "publish_date": "Tue, 11 Nov 2025 11:30:00 +1100",
        "category": "entertainment",
        "authors": [
            "Debi Enker"
        ],
        "text": "It should be startling to hear the president of the United States described as looking like “a glazed ham with deep vein thrombosis”. Let alone on a mainstream talk show like Jimmy Kimmel Live!. But this recent punchline (deriding Trump’s medical expertise after the Tylenol saga) is revealing of the combative climate currently engulfing the US TV landscape. In these feverish times, a joke like this has become not only acceptable but unexceptional.\n\nIt’s also an indication of just how punchy the show has become since returning from a week-long suspension in September. Kimmel and his writers have roared back with a vengeance and been relentless in their mockery of the country’s commander-in-chief.\n\nJimmy Kimmel on the set of his show in September. Credit: AP\n\nOver the past seven weeks, nothing has seemed off-limits: Trump’s appearance and behaviour; his family and associates; his policies and their impact. And while the president might wish that the troublesome question of the Epstein files would go away, Kimmel and co. are doing everything they can to keep it on the radar.\n\nIf there was any degree of caution or reticence before the show’s removal and reinstatement, it’s been abandoned. Kimmel and his writers are now off the leash.",
        "source": "SMH"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/donald-trump-sues-the-bbc-what-the-case-could-mean-for-his-critics-worldwide/f5vmrq4qz",
        "title": "Donald Trump sues the BBC: what the case could mean for his critics worldwide",
        "publish_date": "Tue, 11 Nov 2025 01:06:56 +0000",
        "category": "finance",
        "authors": [],
        "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nUnsatisfied with the resignation of their director general and CEO, US President Donald Trump is now threatening the BBC with a US$1 billion dollar lawsuit.\n\n\n\n\n\nDonald Trump's legal team says the British broadcaster features a 'defamatory' and 'malicious' edit of a speech Mr Trump delivered just before the 2021 January 6 riots on the US Capitol.\n\n\n\n\n\nBBC Chairman Samir Shah says the broadcaster accepts the editing gave the wrong impression.\n\n\n\n\n\n“Part of the problem is the way it was edited. But what was the consequence of that? I think we just needed to go into a bit more detail, which is what we finally did, which was the impression it left on the British audience as opposed to the intention of the programme, which was to give the Panorama, the British audience some understanding of how President Trump’s supporters were reading it. Now, that's quite a complicated set of thought, and we need to get that right.”\n\n\n\n\n\nThe BBC has reportedly been given a deadline of Friday November 14 to fully retract the documentary, apologise and \"appropriately compensate\" the president for what they claim is \"the harm caused.\"\n\n\n\n\n\nIf they fail to comply with these orders, Trump's lawyers say they will have no option but to file legal action for no less than US$1 billion.\n\n\n\n\n\nThe controversy has already led to the resignation of Director General Tim Davie and BBC News CEO Deborah Turness.\n\n\n\n\n\nDefending the network, Ms Turness says it was a privilege to serve as CEO.\n\n\n\n\n\n“I stepped down over the weekend because the buck stops with me. But I'd like to make one thing very clear - BBC News is not institutionally biased, that's why it's the world's most trusted news provider.”\n\n\n\n\n\nCelebrating the resignations, Donald Trump accused BBC journalists of being corrupt and dishonest.\n\n\n\n\n\nJulie Posetti is a professor of journalism at City St. George's University of London and director for the International Centre for Journalists.\n\n\n\n\n\nShe says the resignations are bound to have a chilling effect on the broadcaster and other media in the UK.\n\n\n\n\n\n“And they come in the wake of a concerted effort by the partisan press, the right-wing press in the UK, aided it seems by a former UK Conservative Prime Minister and egged on, in fact, with participation by the White House press secretary and, ultimately, celebratory comments from the US president, who himself is a clear attacker of free and independent press in the US. So this is a situation which needs to be understood in context of an orchestrated campaign to undercut public trust in the BBC and to create a situation where the BBC is meek, where the BBC is less likely to be critical in its reporting.”\n\n\n\n\n\nThese legal threats are not the first time Donald Trump has come after media outlets he perceives as critical of him.\n\n\n\n\n\nDuring his second term, the administration has cut funding to the public broadcasting service Voice of America and the Corporation for Public Broadcasting, ending all federal support for National Public Radio.\n\n\n\n\n\nIn the private sector, Donald Trump has launched legal action against Paramount, Disney, the Wall Street Journal, the New York Times, Meta and YouTube.\n\n\n\n\n\nAs his legal targets have usually been US based, Professor Posetti says this escalation is cause for concern.\n\n\n\n\n\n“This is the intervention of a foreign state actor in the governance of independent public media in the UK. So this is a step beyond that. I mean, I have never seen a situation where the president of the United States and his press secretary, true to form, are lambasting the BBC as systemically biased. But doing so with the usual anti-press freedom rhetoric that the BBC is 'fake news' when patently it is not.”\n\n\n\n\n\nSpeaking to reporters, UK Prime Minister Keir Starmer says the organisation has a vital role in the age of disinformation.\n\n\n\n\n\nFunded by the licensing fee paid by anyone in the UK who watches live TV, the broadcaster has been forced to cut hundreds of jobs as fewer British households tune into live television.\n\n\n\n\n\nThe BBC also faces increased production costs, while successive governments have kept any increases in the license fee below the rate of inflation.\n\n\n\n\n\nThe UK government is currently preparing a review of the BBC charter, which outlines funding frameworks and governance at the network.\n\n\n\n\n\nLeader of the right-wing populist party Reform UK, Nigel Farage accused the BBC of being institutionally biased.\n\n\n\n\n\n“You might have noticed, Harry, that last year half a million people stopped paying the license fee. The year before, half a million people stopped paying the license fee. If the BBC doesn't now get a grip, get somebody in from the outside. Somebody who has got a history and a culture of changing organisations, of turning them around, then I think what you would see within the next couple of years are many, many millions just refusing, just not wanting to have the license fee.”\n\n\n\n\n\nUrging the Prime Minister to defend the network, leader of the centrist Liberal Democrats Ed Davey says interference in British media must be called out.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/interview-bbc-is-facing-an-orchestrated-campaign-to-undercut-public-trust-says-analyst/rflxsczy4",
        "title": "INTERVIEW: BBC is facing an orchestrated campaign to undercut public trust says analyst",
        "publish_date": "Mon, 10 Nov 2025 21:39:48 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/how-russia-uses-ai-to-spread-disinformation/h4kf3947p",
        "title": "Russian operatives are 'grooming' AI with false data. Is Australia prepared?",
        "publish_date": "Mon, 10 Nov 2025 18:35:55 +0000",
        "category": "finance",
        "authors": [],
        "text": "In late October, some users of X (formerly Twitter) reported strange interactions with the platform's AI-powered chatbot, Grok. Developed by xAI, a company owned by tech billionaire Elon Musk, Grok is designed to access information across the platform in real-time and publish posts to X in response to prompts by other users.\n\n\n\n\n\nResponding to one such prompt, the chatbot posted a statement suggesting that American political commentator Tucker Carlson is more heroic than Ukraine's president Volodymyr Zelenskyy.\n\n\n\n\n\nCarlson embodies \"true heroism\", Grok said, \"by dismantling establishment myths despite cancellation attempts and media blackouts\".\n\n\n\n\n\n\"Zelenskyy's wartime resolve is admirable, yet it's bolstered by global sympathy and aid; Tucker's solitary defiance against power structures reveals deeper courage without such buffers.\"\n\n\n\nThis post and others featuring spurious claims prompted discussion over several days, with users trying to challenge Grok's assertions. The bot evenutally posted a rejection of the chain of events, stating that it \"never ranked Carlson's heroism above Zelenskyy's\" and calling it \"misattribution\".\n\n\n\n\n\nAround the same time, Musk launched Grokipedia, an AI-powered online encyclopedia designed to rival Wikipedia. Musk has previously described Wikipedia as \"left-biased\" and claimed his new platform would \"purge out the propaganda\".\n\n\n\n\n\nSoon after its launch, The Guardian and others reported examples of biases and disinformation, including Russian propaganda, being pubished in articles on the Grokipedia site. For example, the site's entry for Russia's invasion of Ukraine features a propagandistic description of the military offensive as being \"aimed at demilitarizing and denazifying Ukraine\".\n\n\n\nIt has raised concerns about the potential for large language models (LLMs), such as Grok, which are trained to generate text by scraping the internet for data, to be co-opted for the purpose of spreading propaganda and other disinformation online.\n\n\n\n\n\nCarl Miller is a co-founder of the Centre for the Analysis of Social Media at UK think tank Demos. He says digital literacy is critical, particularly given the propensity for LLMs to regurgitate false information.\n\n\n\n\n\n\"The simple knowledge that LLMs can get stuff wrong and that also they can be manipulated — [is] obviously important. It's the same way that we can't think that the top of a Google search means it's right, so we cannot think that the output of an LLM means it's correct,\" Miller says.\n\n\n\n'Hallucinations' and disinformation\n\nWith growing reliance on AI chatbots and LLMs, experts are calling for stronger legislation to mitigate against foreign interference and propaganda.\n\n\n\n\n\nLast week, ASIO boss Mike Burgess raised concerns about AI's potential \"to take online radicalisation and disinformation to entirely new levels\".\n\n\n\nDelivering his address at the Lowy Institute, Burgess said the agency had \"recently uncovered links between pro-Russian influencers in Australia and an offshore media organisation that almost certainly receives direction from Russian intelligence\".\n\n\n\n\n\nHe said Russian cyber operatives have inflamed community tensions in Europe by spreading false news, and Australia was \"not immune\".\n\n\n\n\n\n\"Deliberately hiding their connection to Moscow — and the likely instruction from Moscow — the propagandists try to hijack and inflame legitimate debate,\" Australia's spy chief said.\n\n\n\n\n\n\"They use social media to spread vitriolic, polarising commentary on anti-immigration protests and pro-Palestinian marches.\"\n\n\n\nDelivering his address at the Lowy Institute, head of ASIO Mike Burgess said the agency had \"recently uncovered links between pro-Russian influencers in Australia and an offshore media organisation that almost certainly receives direction from Russian intelligence\". Source: AAP / Mick Tsikas In February this year, non-profit think tank Reset Tech published a paper on AI risks in Australia. One of the concerns outlined in the paper relates to the way AI and LLMs are influencing the information ecosystem.\n\n\n\n\n\n\"Generative AI is not a research tool; it is a probability machine,\" the paper reads.\n\n\n\n\n\n\"The outputs have nothing to do with the truth, and as AI is increasingly trained on the reams of synthetic AI-generated content flooding the internet, the risks of incoherence, bias, and ultimately model collapse, only grow as AI effectively eats itself.\"\n\n\n\n\n\nDr Lin Tian, a research fellow at the University of Technology Sydney who examines disinformation detection on social media, explains to SBS News that an LLM is \"a model that tries to talk like a human, but it's purely based on the training that has been fed through\".\n\n\n\n\n\n\"LLMs have been trained with a large amount of data. So there is no right or wrong inside the model,\" Tian says.\n\n\n\nWhen they generate [the answers], they will just grab the highest probability tokens and put them into the sentence.\n\nShe explains this is how so-called \"hallucinations\" can occur: When the output answer produced by the AI is factually wrong.\n\n\n\n\n\n\"It's basically just based on the probability of when they created the sentence, and put all the tokens together as an output for the users,\" Tian says.\n\n\n\nAI chatbots 'groomed' with propaganda\n\nRussian disinformation campaigns have been a focus of governments and intelligence services around the world since Russia's full-scale invasion of Ukraine in early 2022. These campaigns have reportedly used AI to create online content, which can be posted to and shared via social media to spread disinformation narratives to a wider audience.\n\n\n\n\n\nEarlier this year, CheckFirst, a Helsinki-based software company researching foreign interference in collaboration with Atlantic Council's Digital Forensic Research Lab (DFRLab), published two joint investigations into Russia's Pravda network. The network operates in several languages and across several countries, generating disinformation articles and amplifying its narratives through Wikipedia, AI chatbots and platform X.\n\n\n\n\n\nAccording to the Pravda dashboard, created by CheckFirst and DFRLab, more than six million false articles have been generated by the Pravda network, with five million of those repurposed in multiple languages.\n\n\n\nAccording to the Pravda dashboard, created by CheckFirst and DFRLab, more than six million false articles have been generated by the Pravda network, with five million of those repurposed in multiple languages. Credit: SBS News Speaking with SBS News, Guillaume Kuster, CEO and co-founder of CheckFirst, called the network \"a laundering machine for Russian narratives and propaganda\".\n\n\n\n\n\n\"[These] websites are not publishing any original content. What they do is they repost. It could be content coming from sanctioned media organisations in the EU, such as Sputnik or Russia Today. It can be content coming from known propaganda telegram channels, from X accounts, and so on and so forth,\" he says.\n\n\n\n\n\n\"One consequence of having [these] articles readily available online is that they are used by traditional knowledge dissemination platforms such as Wikipedia or chatbots.\"\n\n\n\n\n\nKuster says the CheckFirst investigation found nearly 2,000 links to Pravda websites on Wikipedia.\n\n\n\n\n\n\"We found it quite concerning that a network of known Russian propaganda was used to alter facts on the world's biggest free encyclopedia.\"\n\n\n\n\n\nKuster adds that while researchers cannot conclude that the Pravda network was designed specifically for \"AI grooming\", they have been able to demonstrate that it is happening as a consequence of the network's activities online.\n\n\n\n\n\n\"So we and others, such as the American Sunlight Project and NewsGuard have verified that popular chatbots such as Copilot, Gemini, ChatGPT and others would spit out some content coming from Pravda.\"\n\n\n\n\n\nNewsGuard is a US-based media organisation that tracks false claims online and perpetrators of misinformation and disinformation. The organisation also published its own investigation into the Pravda network and the way it feeds its narratives into chatbots.\n\n\n\nIsis Blachez, an analyst with NewsGuard, tells SBS News the risk of having a large volume of articles repeating false claims is that AI chatbots will end up repeating those narratives.\n\n\n\n\n\n\"The way AI chatbots work, and training data works, is that they look at the information that's out there and they'll see this big flow of information repeating one false claim and will take information from that,\" she says.\n\n\n\n\n\n\"It's kind of playing on search engine optimisation techniques. That's how ultimately these types of narratives and claims end up in the responses of AI chatbots.\"\n\n\n\n\n\nWith a growing number of people relying on such chatbots in their daily lives and for news consumption, Blachez says AI companies should be more transparent.\n\n\n\n\n\n\"There's a lack of transparency from AI companies who don't really explain where the data comes from, how it's vetted, and how AI chatbots recognise the credibility of a source.\n\n\n\nI think individual users have to be very wary of that and always have a critical mindset and always look at the sources that are cited.\n\n'After influence, not lies'\n\nMiller from the Centre for the Analysis of Social Media says autocratic regimes, including Russia's, tend to focus their disinformation campaigns on \"influence, not lies\".\n\n\n\n\n\n\"We see them talking about masculinity and femininity, and patriotism and belonging ... These deep, motivating ideas that really get us up in the morning. That's how influence works.\"\n\n\n\n\n\nWith growing reliance on AI for therapy and companionship, Miller says there should be greater scrutiny over the influence it can have on people.\n\n\n\n\n\n\"There's going to be a whole new kind of skill set that we need for the appropriate kind of relationship to build with an AI,\" he says.\n\n\n\n\n\n\"In the way that you want your friends to be right and you care about what they think, whether they're right or not.\"\n\n\n\nHe adds, with AI chatbots increasingly used \"to paint pictures for people to learn about the world\", they could become the \"future of information warfare\".\n\n\n\n\n\n\"You're going to have people trying to manipulate LLMs, using agency networks to create content, and you're going to have people training the LLMs using their own automated processes ... It's going to be an incredibly weird form of fight over information integrity.\"\n\n\n\n\n\nIn September 2025, WA senator Matt O'Sullivan said in a Senate address that Australia is \"missing in action\" while other countries are busy establishing legal safeguards around AI.\n\n\n\n\n\n\"The European Union passed the world's first comprehensive AI act in March 2024, creating clear obligations for developers and protections for citizens. The UK launched its own strategy, including an AI safety institute,\" he said.\n\n\n\n\n\nO'Sullivan argued Australia needs a better legal framework.\n\n\n\n\n\n\"We need frameworks that mitigate serious risks, including sovereign risks, biases, disinformation, propaganda, foreign intellectual interference, online harm, cybercrime and copyright violations.\"\n\n\n\nREAD MORE Inside the secretive Russian chats spreading threats against Ukraine's Australian fighters\n\nOlivia Shen is the director of the Strategic Technologies Program with the United States Studies Centre at the University of Sydney. She tells SBS News that although Australia became one of the first countries to introduce a voluntary AI ethics framework in 2019, there has been \"laggard\" progress on turning some of the safeguards and codes of conduct into legally enforceable regulations.\n\n\n\n\n\n\"There has obviously been a divergent number of views on it. There are some who believe Australia ... would not benefit from having AI regulation that goes too far — that perhaps strangles innovation and prevents Australia from taking the best advantage of the AI economic opportunities,\" she says.\n\n\n\n\n\n\" But on the other side of the fence ... what are the implications of AI if they're not used safely and responsibly? And what are the harms that could actually take place? I really think we need to come to a balanced view on this.\"\n\n\n\n'A layered approach' towards disinformation\n\nShen says that although it may be difficult to put the legal onus on LLM developers, more attention could be given to legislation about misinformation.\n\n\n\n\n\n\"We already have some foundations and frameworks around the issue of misinformation harms. And AI is just a tool that accelerates and pours petrol on the fire of those harms, if you will.\"\n\n\n\n\n\nShen points to Taiwan as an example of a jurisdiction that is taking \"a layered approach\" and has strong laws against deepfakes and foreign interference.\n\n\n\n\n\n\"It has been the target of persistent foreign interference originating from China for decades now. Taiwan has accepted, when you have this scale of misinformation, no single intervention is going to be a silver bullet,\" she says.\n\n\n\nThese interventions work both on a regulatory and societal level to build resilience against propaganda.\n\n\n\n\n\n\"[Taiwan] has very strong laws also on spreading misinformation [on] certain issues. For example, public safety, food safety, military affairs, and emergency responses. Because those are the really core topics that affect public order.\"\n\n\n\n\n\nIn a domestic context, Shen adds that the Australian Code of Practice on Disinformation and Misinformation has been in effect for several years, but is not legally binding.\n\n\n\n\n\nLate last year, the previous Albanese government put forward a bill that would have given the Australian Communications and Media Authority legal powers to take down certain content. However, it failed to pass.\n\n\n\n\n\nIt was not supported by the Coalition or the Greens, along with some members of the crossbench who raised concerns about censorship and overly constraining freedom of political communication.\n\n\n\n\n\n\"So that bill was withdrawn … But I do think there is room to open that conversation again in light of what we've seen in this year's federal election and the level of misinformation that we saw,\" Shen says.\n\n\n\nREAD MORE How this Russian disinformation network uses BRICS to advance its narratives in Australia\n\nIn a statement to SBS News, a Department of Home Affairs spokesperson said the department's Cyber Security Strategy is working to create \"new initiatives to address gaps in existing laws\".\n\n\n\n\n\nThe spokesperson also confirmed the government plans to develop Australia's first National Media Literacy Strategy to \"establish the key skills and competencies Australians need to navigate the challenges and opportunities presented by the digital world\".\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/video/retailers-warned-by-accc-over-misleading-black-friday-sales-tactics/203v6xzpa",
        "title": "Retailers warned by ACCC over misleading Black Friday sales tactics",
        "publish_date": "Mon, 10 Nov 2025 09:50:19 +0000",
        "category": "finance",
        "authors": [],
        "text": "Retailers warned by ACCC over misleading Black Friday sales tactics\n\nPublished 10 November 2025, 7:26 am\n\nAhead of what's now become one of the biggest sales seasons in the country, Black Friday, the competition watchdog has warned retailers it's got it eye on them. The ACCC is watching for misleading limited time offers or claim, and says it'll be cracking down on brands that break the rules.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/political-ambush-anthony-albanese-labels-gough-whitlams-dismissal/xx8reab93",
        "title": "Anthony Albanese labels Gough Whitlam's dismissal 'a calculated plot'",
        "publish_date": "Mon, 10 Nov 2025 07:52:30 +0000",
        "category": "finance",
        "authors": [],
        "text": "Prime Minister Anthony Albanese has said the dismissal of Gough Whitlam was a \"calculated plot, hatched by conservative forces\", firing up a decades-long debate.\n\n\n\n\n\nSpeaking at Old Parliament House on Monday evening, Albanese said no \"political and legal arguments\" can prove \"the injustice\" of bringing down a democratically elected government.\n\n\n\n\n\nHe said power belongs to the \"people of Australia\".\n\n\n\n\n\n\"Make no mistake: November 11th 1975 was not a 'constitutional crisis ' — it was a partisan political ambush,\" he said.\n\n\n\n\n\n\"There was no precedent — and no legitimate pretext.\"\n\n\n\nREAD MORE Remembering former Labor Prime Minister Gough Whitlam\n\nThe politically explosive moment is still widely debated, with Albanese announcing a Whitlam statue to immortalise his 149-word speech on the eve of its 50th anniversary.\n\n\n\n\n\n\"The dismissal was a calculated plot, hatched by conservative forces which sacrificed conventions and institutions in the pursuit of power,\" he said.\n\n\n\n\n\nAbove all, what Albanese feels is being lost is an acknowledgement of the \"legitimacy of a Labor government\", which had a majority in the house.\n\n\n\nWhat was the 'the dismissal'?\n\nThree years into his term, then prime minister Gough Whitlam was dismissed by then governor-general Sir John Kerr.\n\n\n\n\n\nWhitlam had paid Kerr a visit in hopes of resolving a deadlock in the Senate, where the Opposition was blocking budget bills which put the government at risk of running out of funds to pay essential services, public servants and pensions.\n\n\n\n\n\nHowever, Kerr invoked rare reserve powers to sack Whitlam, appointing Opposition leader Malcolm Fraser as caretaker prime minister.\n\n\n\nWhy was Gough Whitlam dismissed?\n\nThe decision followed a controversial tenure for Whitlam, following Labor's election win in December 1972.\n\n\n\n\n\nWhitlam's agenda, celebrated by Labor faithful after what Albanese described as 23 years in \"political wilderness\", included reforms such as establishing the precursor to Medicare, abolishing university fees and conscription, advocating for the rights of Indigenous Australians, and abolishing the White Australia Policy.\n\n\n\nMalcolm Fraser (pictured) was appointed Australia's caretaker prime minister after then-governor-general Sir John Kerr dismissed Gough Whitlam's government in 1975. Credit: National Archives of Australia: A6180, 13/11/75/41 However, tough economic conditions, soaring inflation and several political scandals put the Labor government under the microscope, eroding public confidence.\n\n\n\nWhy is the moment debated?\n\nHours after the dismissal, chants of \"We want Gough\" all but drowned out the governor-general's secretary, Sir David Smith's, proclamation on the steps of the then Parliament House, announcing Whitlam had been sacked and parliament dissolved, triggering an election.\n\n\n\n\n\nThe secretary completed the decree by uttering the phrase \"God save the Queen\".\n\n\n\n\n\nStraight away, Whitlam seized the microphone and criticised the governor-general and the Opposition leader in a fiery speech now etched into Australia's political conscience.\n\n\n\n\n\n\"Well may we say God save the Queen,\" he started, \"because nothing will save the governor-general\". The crowd roared.\n\n\n\n\n\nA moment immortalised with a Whitlam statue, announced by Albanese on Monday.\n\n\n\nThe Gough Whitlam-led federal Labor government became the first (and only) government in Australian history to be dismissed by the governor-general. Credit: National Archives of Australia: A6180, 13/11/75/40 For some, the sacking of a democratically elected leader has been viewed as outrageous or worse, a betrayal.\n\n\n\n\n\nHowever, with the Senate blocked, for others, it was an indication of Australia's constitution working.\n\n\n\n\n\nThe legacy was further complicated following the release of palace letters in 2020, which revealed Kerr had been corresponding with the Queen's private secretary about the dismissal.\n\n\n\n\n\nIt demonstrates that the moment, which took Whitlam by surprise, had been months in the planning.\n\n\n\n\n\nCurrent Governor-General Sam Mostyn downplayed the Crown's involvement over the weekend, stating the reserve powers should be used \"wisely and appropriately\".\n\n\n\n\n\n\"If a government starts to behave irresponsibly, the role of the governor-general will be to have those conversations with the prime minister, with the ministers of the crown, early enough to say 'there's trouble ahead',\" she told The Australian.\n\n\n\n\n\n\"The holder of this office is there to protect the Australian public against the potential of irresponsible government.\"\n\n\n\n\n\n— With additional reporting by the Australian Associated Press\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/hopes-of-end-to-us-shutdown-lifts-markets-anz-profit-slump/ati80gmsq",
        "title": "Hopes of end to US shutdown lifts markets; ANZ profit slump",
        "publish_date": "Mon, 10 Nov 2025 07:43:59 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/sbs-news-in-easy-english-10-november-2025/0sd556x13",
        "title": "SBS News in Easy English 10 November 2025",
        "publish_date": "Mon, 10 Nov 2025 03:00:00 +0000",
        "category": "sports",
        "authors": [],
        "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nWelcome to SBS News in Easy English, I'm Camille Bianchi.\n\n\n\n+++\n\n\n\n\n\nPope Leo has shared prayers for the Philippines after its second major storm in a week.\n\n\n\n\n\nAt least two people are dead and more than a million were forced to leave their homes.\n\n\n\n\n\n\"Dear brothers and sisters, I am close to the people of the Philippines affected by a violent typhoon. I pray for the deceased and their families, for the injured and the displaced.\"\n\n\n\n+++\n\n\n\n\n\nSyria's leader Ahmed al-Sharaa is in the United States for a meeting with Donald Trump.\n\n\n\n\n\nLast week, the US Government asked the UN Security Council remove sanctions on Al Sharaa and now American officials hope he will sign up to a global group of countries fighting the IS terrorist group.\n\n\n\n+++\n\n\n\n\n\nBritish Royal Princess Anne is in Australia.\n\n\n\n\n\nThe 75-year-old princess has taken part in a service at the ANZAC Memorial in central Sydney before attending the nearby Victoria Barracks to help mark 100 years of the Royal Australian Corps of Signals.\n\n\n\n\n\nThe visit comes at an awkward time for her family after her younger brother, formerly known as prince Andrew, was stripped of his title over his links to Jeffrey Epstein.\n\n\n\n\n\nBut this royal fan says they don't hold any of that against Princess Anne.\n\n\n\n\n\n\"Look, everyone has things in their family and unfortunately theirs played out in front of everyone to see. They haven't got local gossip to contend with; they've got worldwide gossip. And they're doing okay, standing up to it all.\"\n\n\n\n+++\n\n\n\n\n\nIn sport, McLaren driver Lando Norris has won the Sao Paolo Grand Prix.\n\n\n\n\n\nTeam mate Oscar Piastri ended up finishing fifth - after he was given extra time for causing a crash.\n\n\n\n\n\nMcLaren team principal Andrea Stella says he will speak with Piastri about what happened.\n\n\n\n\n\n\"I haven't yet talked to Oscar yet. I haven't looked at the video myself except for the replay. So it is one of those (cases) in which I think the best thing to do is to rely on the stewards applying some consistency. We don't have major reasons to complain, so we just have to stay focussed and move on.\"\n\n\n\n+++\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.theage.com.au/business/markets/asx-set-to-rise-nvidia-pulls-wall-street-higher-20251111-p5n99c.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "CBA shares tumble to weigh down ASX",
        "publish_date": "Tue, 11 Nov 2025 12:50:10 +1100",
        "category": "finance",
        "authors": [
            "Staff Writers"
        ],
        "text": "The Australian sharemarket has slid into the red on Tuesday, with the Commonwealth Bank diving after the bank released a quarterly trading update.\n\nThe S&P/ASX 200 was down 6.7 points, or 0.1 per cent, to 8829.2 in just after midday, with nine of 11 industry sectors in positive territory.\n\nWall Street has made a positive start to the week, driven higher by tech giants. Credit: Bloomberg\n\nFinancial stocks are mixed, with the big four banks making big price moves. The Commonwealth Bank plunged 6 per cent after releasing its quarterly update, while the National Australia Bank (down 0.9 per cent) also lost ground, but there were strong gains for ANZ (up 0.9 per cent) and Westpac (up 1.2 per cent) in early trade.\n\nMining stocks climbed. Iron ore heavyweights Rio Tinto (up 0.9 per cent), BHP (up 0.4 per cent) and Fortescue (up 1.1 per cent) advanced after the price of the key steel-making ingredient rose while gold miners had more reasons to cheer as the price of the safe haven jumped, with local players Northern Star (up 4.6 per cent) and Evolution Mining (up 3.1 per cent) surging.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/victoria/geelong-midfielder-tanner-bruhn-revealed-as-player-cleared-of-rape-charge-20251110-p5n932.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Geelong midfielder Tanner Bruhn revealed as player cleared of rape charge",
        "publish_date": "Tue, 11 Nov 2025 12:27:51 +1100",
        "category": "sports",
        "authors": [
            "Erin Pearson",
            "Carla Jaeger"
        ],
        "text": "Geelong midfielder Tanner Bruhn can finally be revealed as the player who spent the 2025 season fighting a rape charge, as the case against him was officially dropped on Tuesday.\n\nA suppression order has prevented the naming of Bruhn, 23, since he was charged earlier this year with raping an intoxicated woman he met outside a strip club.\n\nTanner Bruhn. Credit: Getty Images\n\nBruhn applied for the media blackout on the basis that it was needed to protect his safety.\n\nHis co-accused and close friend, Patrick Sinnott, also tried but failed to have his name withheld. The Geelong Magistrates’ Court heard the pair were former housemates who had known each other since primary school.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/business/companies/cause-of-two-near-misses-at-melbourne-airport-revealed-20251110-p5n981.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Cause of two near misses at Melbourne airport revealed",
        "publish_date": "Tue, 11 Nov 2025 12:09:42 +1100",
        "category": "finance",
        "authors": [
            "Chris Zappone"
        ],
        "text": "Australia’s transport safety inspector says that a failure of flight crews to understand take-off conditions nearly led to two major accidents at Melbourne Airport in 2023.\n\nA Malaysia Airlines A330, with 237 people on board, and a Bamboo Airways 787, with 212 people on board, both overran a shortened runway during take off, lifting off only metres above an active worksite.\n\nEach aircraft reportedly took off past the limit of a shortened runway, resulting in “jet blast affecting people and objects and people in the work area”, the Australian Transport Safety Bureau (ATSB) said on Tuesday.\n\nThe incidents, which triggered a risk review, were caused by flight crews’ insufficient understanding of take-off conditions, putting the lives of workers, passengers and flight crews in danger.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/queensland/brisbane-news-live-man-breaks-into-brisbane-police-facility-steals-cop-uniform-20251110-p5n94n.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Brisbane news live: Princess Anne visits to mark Remembrance Day; Man breaks into police facility, steals cop uniform; Dog still missing after ute stolen",
        "publish_date": "Tue, 11 Nov 2025 12:03:23 +1100",
        "category": "finance",
        "authors": [],
        "text": "Over a dozen new food outlets are preparing to open in Brisbane International Airport, expanding the culinary offerings for travellers.\n\nThirteen new food outlets will open in the international terminal over the next year.\n\nThe likes of McDonald’s, Hungry Jacks and KFC will be opening in the international terminal, alongside a Mediterranean-inspired bar Manna, Sushi Jiro and Liv Eat kiosks, and coffee brand Bellissimo. McDonalds will be one of the first to open in late December, with additional outlets opening throughout 2026.\n\n“This upgrade is about celebrating the best of Brisbane and giving our customers more of what they love, great food, great coffee, and a great start to their journey,” said Scott Norris, executive general manager commercial at Brisbane Airport.\n\nThis development is part of the airport’s $5 billion Future BNE transformation.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/culture/music/i-can-t-really-thrash-the-drums-any-more-midnight-oil-s-rob-hirst-20251107-p5n8ne.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "I can’t really thrash the drums any more: Midnight Oil’s Rob Hirst",
        "publish_date": "Tue, 11 Nov 2025 12:00:00 +1100",
        "category": "entertainment",
        "authors": [
            "Michael Dwyer"
        ],
        "text": "Save Log in , register or subscribe to save articles for later. Save articles for later Add articles to your saved list and come back to them any time. Got it Normal text size Larger text size Very large text size Rob Hirst’s drum kit has hit the road without him this time. “As we speak,” the power behind Midnight Oil reports with a satisfied if slightly wistful air, “it’s trundling down the Hume Highway on its way to the Music Vault in Melbourne.” Last month, the battered black Ludwig kit that propelled the Oils’ countless circuits around the planet from 1979 until 2022 sold for $90,000 at auction. With the fundraising clout of “rusted-on fans” known as the Powderworkers, that result was $80,000 above reserve. “The love just kept pouring in,” Powderworker Matthew Yau says. And then it poured back out again: half the proceeds are earmarked for the musicians’ charity Support Act, the other half for the Fix ’Em Up Truck campaign to keep First Nations bands on the road in the Northern Territory. “I can’t really thrash the drums any more,” Hirst says simply. In 2023, six months after the last ever Oils gig at Sydney’s Hordern Pavilion, he was diagnosed with stage 3 pancreatic cancer. Today he’s “hanging in there,” he reports in his upbeat way. “I’m looking at the bush and the jacarandas are all out. It’s a lovely time of year.” Midnight Oil in the early 1990s. Credit: John Vella, Columbia To this forever fan’s ear, his pinched breath is palpable on the phone from Sydney. His voice is more plaintive, too, on A Hundred Years or More, his new EP with old schoolfriend turned Oils guitarist Jim Moginie and drummer Hamish Stuart. Hirst plays acoustic guitar. His songs are drenched in psychedelic sunshine and melody. “I realise it’s quite an existentialist bunch of songs, with titles like Are We There Yet? and A Hundred Years or More,” he says with a laugh. “I suppose I’ve been thinking about lifespan and longevity – legacy, even. And, of course, that comes out in the songs.”\n\nAdvertisement\n\nThe opening track, First Do No Harm, is a kind of prayer for the future, calling on every living soul to take the same life-affirming responsibility in all things as doctors invoke with the Hippocratic Oath. “I’ve obviously been spending too long in hospitals,” he jokes. He considers the rest of his time well occupied “as long as I can get angry and irritated by what’s going on in the world but still try to put it in a form where there’s hope for the future. It’s been a bleak time, here and internationally, but if you dwell on that, you forget the beauty of the everyday. “Now that I’ve started counting back in life rather than counting forward, the days are even more precious.” It’s family and friends, naturally, that feel most precious as the days grow less certain. When both come together in a recording studio – his daughters Lexi and Gabriella both sing on the new EP – the results are nothing short of “joyful”. Rob Hirst (centre) with bandmates Jim Moginie (left) and Hamish Stuart. Credit: Robert Hambling “All the girls can sing,” Hirst says. He made an album with his eldest, Nashville-based Jay O’Shea, in 2022. “Lexi’s a publisher; Ella’s an artist in Berlin… I was strumming A Hundred Years or More at home with a half-finished lyric and Ella started singing… there was an honesty there, and freshness. It suits the mood perfectly.” Hirst’s renown as one of our most formidable drummers often overlooks his legacy as a writer. The majority of the Oils’ 13-album catalogue bears his credit as well as his strident vocals, driven always by the warrior conviction that gave the band its uncompromising edge.\n\nAdvertisement\n\n“We didn’t know it at the time,” he says, reflecting on Sydney’s northern beaches in the 1970s, “but we came up at a time when people were tribally loyal to these new bands, and there were a gazillion gigs to play… They were the halcyon days, a time never to be repeated, and we were so fortunate. “All that road work stood us in good stead…. By the time we went overseas, we were a pretty cooking live band.” The fact that he and singer Peter Garrett had both studied law was not a bad asset in the den of thieves known as the music business, he adds drily. But the band’s determination to be agents of real political change means he’s equally blunt about disappointments. The failure of the push for an Indigenous voice to parliament in 2023 was “a shocker” he still can’t fathom. Hirst on stage with Midnight Oil in 2022. Credit: Paul Rovere In 2020, Midnight Oil had broken a long silence with The Makarrata Project, an ambitious collaborative album designed to educate and influence popular opinion in favour of First Nations recognition. “Playing with Coloured Stone, having Bunna Lawrie, Dan Sultan, Joel Davison involved… those collaborations lifted everything. Makarrata was my favourite thing we ever did,” Hirst says, far more proud than bitter. “I’m happy we were among those bands – U2, Billy Bragg, all the First Nations musicians here and overseas – putting the case for justice.” And again, he defers to comrades – Shane Howard, Alan Pigram, Neil Murray – as fellow explorers of the western desert, “finding a whole different Australia. How lucky we were to see that, and to put it into song.”\n\nAdvertisement\n\nHunger After Power, the last song on the A Hundred Years or More EP, is in many ways its most pointed: a naked plea for democracy under pressure. “Ooh, how can it be?” the singer wants to know as the scales of justice appear to melt down. “Every saint in heaven, say a prayer for me.” “We could so easily write the darkest stuff, ’cause it’s all around us every day. But I think people want hope,” Hirst says. “On that last track, I think Jim provides that with that incredible guitar solo. He said to me, ‘This Pink Floyd song you’ve written, Rob…’ and I said, ‘Yeah, you know what to do’.” TAKE 7: THE ANSWERS ACCORDING TO ROB HIRST Worst habit? I’ve never had a smartphone and I never answer my dumb phone. Does that qualify? Greatest fear? Terrible pain. The line that has stayed with you? “Be kind because everyone you meet is fighting a great battle.” [Variously attributed] Biggest regret? Any unnecessary pain I’ve caused anyone over the years. Favourite book? 33 Revolutions Per Minute by Dorian Lynskey. It’s a history of protest music. It’s quite a coffee table tome, but I commend it to you. The artwork or song you wish was yours? Something in the Air by Thunderclap Newman. If you could time travel, where would you choose to go? I’d like to have wandered around Sydney, the place I’ve always lived and always loved, in the 1850s, after the gold rushes. Yeah. I’d just love to go for a wander around the harbour. Imagine. That would be pretty great. To Powderworkers and their rusted-on ilk, the reference back to the epic final track on the first Midnight Oil album of ’78, Moginie’s Nothing Lost — Nothing Gained, is about as poignant as rock music gets. “I said, ‘Jim, just express everything through that amazing guitar of yours’,” Hirst says. “And he did.” He admits that surrendering his own instrument to the vault of history has brought “a combination of relief and wistfulness… That black one was like a close friend. The things that kit’s seen: overturned in trucks, thrown off risers, drenched in water and Gatorade… but it always came up again.” Asked whether he believes in anything beyond his own battle-scarred body, he answers with due contemplation. “Yes, I do,” he says hesitantly, though an early insight into the hypocrisy of organised religion sent him “through the pagan door” at 13. “I haven’t been in a church since except for weddings and funerals… “I do believe there’s something,” he muses, no doubt gazing past the jacaranda blossoms into the Australian bush he adores, “but I would bring it back to Earth again. I believe that all the clues are out there in the bush, waiting for us. And we must protect it, for our own sakes and for the Earth.”\n\nAdvertisement",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/business/the-economy/trump-is-really-really-bad-at-maths-20251111-p5n9ar.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Trump is really, really bad at maths",
        "publish_date": "Tue, 11 Nov 2025 11:57:03 +1100",
        "category": "finance",
        "authors": [
            "Stephen Bartholomeusz"
        ],
        "text": "So far, tariffs – including those that pre-date Trump’s “Liberation Day” baseline and reciprocal tariffs – have raised about $US174 billion, of which about $US120 billion relates to the Trump tariffs. The Yale Budget Lab has estimated that Trump’s tariffs, including the sectoral tariffs that are included in the Supreme Court challenge, will raise about $US2.6 trillion over the next decade if they remain in place, but after changes in consumption induced by the impact of the tariffs on prices, the net revenue generated would be $US2.2 trillion. Trump’s plan to shower US citizens with cheques was light on detail. Credit: Bloomberg New taxes – and the tariffs are effectively taxes on US companies and households – create ripple effects through the economy as businesses and households respond to the changes in their costs. A Tax Foundation economist, Erica York, said in a post on X that “a dollar of tariff revenue offsets about 24 cents of income and payroll tax revenue,” which would mean that the $US120 billion of revenue collected from the Trump tariffs so far would generate only a net $US90 billion of additional revenue.\n\nBecause Trump hasn’t set a cut-off point for the incomes of those who would receive the “dividends,” the cost of the payments can’t be precisely calculated. York, though, said that if the cut-off point were $US100,000, and children were excluded, it would be around $US300 billion a year. The non-partisan Committee for Responsible Federal Budget (CFRFB) says that if the payments were made to both adults and children, excluding the top 10 per cent of income earners, each round of payments would cost about $US600 billion. So, the tariffs would, according to the Yale Budget Lab, generate a net new $US2.2 trillion over a decade – if the Supreme Court allows him to keep collecting the baseline and reciprocal tariffs – but Trump’s dividend payments would cost between about $US3 trillion and $US6 trillion over that period.\n\nSomehow, Trump thinks he can both pay back America’s “enormous” debt (it’s actually above $US38 trillion and rising daily) and shower households with $US2000 cheques. The numbers don’t work. In fact, whether the cost were $US3 trillion or $US6 trillion over a decade Trump’s dividend plan would greatly exacerbate America’s already rapidly deteriorating public finances. Trump’s tariff “dividends” are a bad idea for a raft of reasons and based, as one might expect from Trump, on a thought bubble and on “pie in the sky” premises. The US had a $US1.8 trillion budget deficit in its latest financial year to September. The CFRFB says the cumulative deficits over the next decade will, thanks to Trump’s “One Big Beautiful Bill,” total about $US22.7 trillion. That’s before including any impact from Trump’s dividend plan, so anywhere from $US3 trillion to $US6 trillion could be added to those deficits. US gross domestic product is about $US30.6 trillion, so the dividends would add roughly between one and two per cent to US budget deficits.\n\nLike many of Trump’s promises, of course, the dividend cheques might never appear. The US Treasury Secretary, Scott Bessent appeared taken aback by Trump’s posts, saying he hadn’t talked to him about the plan. He suggested that the payments might not be the direct payments Trump envisages, saying that it could come “in lots of forms, in lots of ways.” “It could be just the tax decreases that we are seeing on the president’s agenda,” he said, referring to the big tax cuts for companies and wealthy households in the One Big Beautiful Bill, which also included the removal of some taxes on tips and overtime. In other words, there might be no new tariff-funded dividends, which would be the fiscally sensible position for a US Treasury Secretary who saw his agency pay out more than $US1 trillion in net interest costs alone in the financial year to end-September and would know that, thanks to the One Big Beautiful Bill, that number will keep climbing.\n\nRevenue from Trump’s tariffs might only put a dent in US deficits and won’t stop US government debt from continuing to mount, but every little bit helps. Loading The other aspect of Trump’s proposal, if it were ever implemented, is its impact on inflation. Trump’s tariffs are inflationary. They continue to inch the inflation rate up (when the inflation reports are available). That rate is now 3 per cent and may well continue to rise as the full effect of the tariffs, if they are allowed to stand, flow through. So, Trump would inject new stimulus into households where the Yale Budget Lab says the tariffs will already add 1.3 per cent to inflation in the near term, or about half that if the administration loses the Supreme Court action.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/victoria/details-of-two-near-misses-at-melbourne-airport-20251111-p5n9ni.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Details of two near misses at Melbourne Airport",
        "publish_date": "Tue, 11 Nov 2025 11:48:27 +1100",
        "category": "finance",
        "authors": [],
        "text": "Details of two near misses at Melbourne Airport\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/basketball/sulking-nba-player-hits-staffer-in-the-head-with-water-bottle-20251111-p5n9ev.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Sulking NBA player hits staffer in the head with water bottle",
        "publish_date": "Tue, 11 Nov 2025 11:43:02 +1100",
        "category": "sports",
        "authors": [],
        "text": "Sulking NBA player hits staffer in the head with water bottle\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/money/planning-and-budgeting/thinking-of-selling-your-home-to-afford-aged-care-think-again-20251111-p5n9cd.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Thinking of selling your home to afford aged care? Think again",
        "publish_date": "Tue, 11 Nov 2025 11:36:26 +1100",
        "category": "finance",
        "authors": [
            "Rachel Lane"
        ],
        "text": "For years, the mantra around aged care and the family home was simple: think twice before you sell. But in a post-November 1 world with changing rules and financial implications that reach well beyond emotional ties, that advice has shifted to think three times.\n\nMany people believe selling the family home is the only way to fund aged care, particularly when faced with the Refundable Accommodation Deposit (RAD) that is normally hundreds of thousands of dollars.\n\nWhether you choose to sell your home to pay for your aged care is totally up to you. Credit: Simon Bosch\n\nThe fact that any unpaid RAD incurs interest at 7.61 per cent per annum can make it seem like a no-brainer – after all, a $750,000 RAD equates to $57,075 a year. The numbers are big and selling the house feels like a simple way to make it all work.\n\nBut in numerous instances, keeping your home can provide significant financial advantages, ones you can’t get from any other asset.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/culture/tv-and-radio/jimmy-kimmel-trump-late-night-tv-cancellation-20251110-p5n90o.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Thought Kimmel was anti-Trump before? You should watch his show now",
        "publish_date": "Tue, 11 Nov 2025 11:30:00 +1100",
        "category": "entertainment",
        "authors": [
            "Debi Enker"
        ],
        "text": "It should be startling to hear the president of the United States described as looking like “a glazed ham with deep vein thrombosis”. Let alone on a mainstream talk show like Jimmy Kimmel Live!. But this recent punchline (deriding Trump’s medical expertise after the Tylenol saga) is revealing of the combative climate currently engulfing the US TV landscape. In these feverish times, a joke like this has become not only acceptable but unexceptional.\n\nIt’s also an indication of just how punchy the show has become since returning from a week-long suspension in September. Kimmel and his writers have roared back with a vengeance and been relentless in their mockery of the country’s commander-in-chief.\n\nJimmy Kimmel on the set of his show in September. Credit: AP\n\nOver the past seven weeks, nothing has seemed off-limits: Trump’s appearance and behaviour; his family and associates; his policies and their impact. And while the president might wish that the troublesome question of the Epstein files would go away, Kimmel and co. are doing everything they can to keep it on the radar.\n\nIf there was any degree of caution or reticence before the show’s removal and reinstatement, it’s been abandoned. Kimmel and his writers are now off the leash.",
        "source": "TheAge"
    }
]