[
    {
        "url": "https://www.9news.com.au/national/nz-to-syd-flight-technical-issue/1b5cb01c-003c-4c85-9afa-39af70e8b992",
        "title": "Flight from New Zealand to Sydney suffers technical issue in the air",
        "publish_date": "Fri, 24 Oct 2025 01:37:07 +0000",
        "category": "finance",
        "authors": [
            "Oct"
        ],
        "text": "A﻿n Air New Zealand flight has landed safely in Sydney after suffering a technical issue while in the air.\n\nPassengers were notified of the issues ﻿after the Air New Zealand plane reportedly suffered hydraulic and steering issues while flying over the Tasman Sea.\n\n\"NZ221 from Christchurch to Sydney reported a technical issue while in flight,\" Air New Zealand Chief Safety and Risk Officer Nathan McGraw said in a statement.\n\nThe Air New Zealand plane reportedly suffered hydraulic and steering complications. (Nine)\n\n\"Emergency services met the aircraft on arrival as a precaution.\n\n\"The aircraft landed safely, and our engineering team will now carry out inspections to ensure the aircraft is safe to return to service.\"\n\nThe plane arrived in Sydney at around 9am and was met by emergency vehicles﻿ on the tarmac.\n\nMore to come.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/mums-vaccine-plea-after-fit-athletic-daughter-almost-dies-from-meningococcal-b/475f67ce-49c7-4c78-81d2-3bb3f771a608",
        "title": "Mum's vaccine plea after fit, athletic daughter almost dies from meningococcal B",
        "publish_date": "Thu, 23 Oct 2025 18:44:34 +0000",
        "category": "sports",
        "authors": [
            "Oct"
        ],
        "text": "A Queensland mum who says her daughter is lucky to be alive has joined growing calls for the meningococcal B vaccine to be made available to all children and teens in Australia.\n\nPamela Appleton's daughter, Kristy, was 17 when she fell suddenly and gravely ill in August last year.\n\nKristy, an extraordinarily fit athlete, had just returned from competing in the waterskiing world championship in Canada, where she was crowned overall world champion and placed second in the jump division.\n\nKristy Appleton fell sick with meningococcal B on the day she returned home from competing on the world stage in waterskiing. (Supplied)\n\n\"The day we arrived back home in Brisbane, that's when our world was rocked by meningococcal B,\" Appleton said.\n\nThe family was trying to beat jetlag by staying awake, but Kristy was tired and Appleton said she was alarmed to hear her daughter moaning in the afternoon.\n\n\"I ran downstairs. Kristy couldn't move, and her neck was really sore, so I rang triple zero,\" Appleton said.\n\nKristy was taken to a local public hospital, where blood tests showed she had COVID-19.\n\nAppleton said that despite her protests, Kristy was discharged from the hospital early the next morning, with doctors believing it was just COVID-19 to blame for her illness.\n\nBack home, Kristy was still extremely sick and complaining of a sore head, neck and sensitivity to light.\n\nShe then began vomiting.\n\nBoth thoroughly exhausted, Appleton and her daughter tried to rest.\n\n\"We woke up at 1am in the morning with Kristy delusional and screaming. I went in and turned the light on, and she just screamed, 'Turn the light off',\" Appleton said.\n\n\"So I grabbed a mask, and I masked her, and then I rang the ambulance.\n\n\"They turned up immediately under sirens, and I said, 'There is something seriously wrong.'\"\n\nAt her mother's request, Kristy was taken to a local private hospital, where, suspecting she had bacterial meningitis, the doctors sprang into action.\n\n\"The doctor said, 'I don't want to alarm you, but if I don't treat this now, we're going to lose her',\" Appleton said.\n\nIf Kristy Appleton was born a year later, she would have received a free vaccine for meningococcal B at school. (Supplied)\n\nKristy was put on IV antibiotics and given a lumbar puncture, which showed she had meningococcal B.\n\nAfter receiving the right treatment, Kristy turned a corner and recovered, even managing to go home from hospital a week later.\n\nMore than a year on, Kristy still suffers from some fatigue, but has made a remarkable recovery.\n\nBack to competing in waterskiiing, the Year 12 student was crowned world jump champion in August.\n\n\"I just want no-one else to go through what I went through,\" Kristy told 9news.com.au .\n\n\"It's not nice, it's really cruel.\n\nAppleton said she had no idea there was a meningococcal B strain when Kristy got sick.\n\nKristy Appleton, pictured in hospital during her illness. (Supplied)\n\nKristy Appleton is back competing in waterskiing and this year took out the world jump title. (Supplied)\n\nLast year, the Queensland government rolled out a free meningococcal B for young people under 20, with teens in Year 10 receiving the free shot at school alongside a federally funded vaccine for strains A, C, W and Y.\n\nHowever, Kristy was a year too late to receive the free vaccine for the B strain.\n\n\"Kristy was in Year 10, in 2023, so she missed out,\" Appleton said, adding she was horrified to learn that her daughter and other kids the same age were unknowingly going around unvaccinated.\n\nIn addition to Queensland, South Australia and the Northern Territory are the only other states and territories choosing to fund their own meningococcal B vaccination programs to make up the shortfall in the National Immunisation Program.\n\nVictoria, NSW, the ACT and Tasmania are yet to do so.\n\nAppleton and Kristy are sharing her story following the tragic news of the death of 16-year-old Melbourne schoolboy Levi Syer .\n\nLevi died last month, within 24 hours of contracting meningococcal B.\n\nLevi died less than 24 hours after falling ill. Tests showed he had a meningoccal B infection. (Supplied: Norliah Syer-Peterson)\n\nLevi's devastated mother Norliah Syer-Peterson told 9news.com.au she was determined to spread the message that vaccines were needed for all Australian children and teenagers.\n\nA Change.org petition calling on the federal government to make the meningococcal B vaccine free for all Australians, started by one of Levi's school friends, has so far attracted almost 19,000 signatures.\n\nAppleton said she was heartbroken to hear of Levi's death.\n\n\"I just don't understand why it's not part of the vaccination program for all Australians, to me, it's just ludicrous,\" she said.\n\n\"Why are they playing Russian roulette with children's lives?\"\n\nIn response to Levi's death, the Royal Australian College of GPs in Victoria (RACGP) said the Victorian government needed to act.\n\n\"If we don't boost vaccination rates, more lives will be at risk, including young people like Levi with their whole life ahead of them,\" RACGP Victoria chair Dr Anita Muñoz said.\n\n\"By providing the meningococcal B vaccine free of charge for at-risk groups we can save lives across Victoria.\n\n\"Meningococcal B is a devastating disease, it kills 5–10 per cent of patients and leaves 10–20 per cent of those who survive with brain damage, hearing loss or a learning disability.\"\n\nA Department of Health spokesperson told 9news.com.au the inclusion of any vaccine on the federal program was contingent on a positive recommendation from the Pharmaceutical Benefits Advisory Committee (PBAC), based on an assessment of clinical and cost-effectiveness.\n\n\"To date, the PBAC has not received an application from pharmaceutical companies seeking expanded eligibility for meningococcal B vaccine,\" the spokesperson said.\n\nThere have been 13 cases of meningococcal B in Victoria so far this year.\n\nA spokesperson for Victoria's Health Department said: \"The Chief Health Officer monitors the prevalence of meningococcal cases in Victoria, which informs their independent health advice on vaccination settings.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/finance/gold-prices-drop-after-australians-line-up-for-hours-to-buy/7daad3f5-7cd7-4585-9d46-34c5267c6709",
        "title": "Aussies queued for hours to buy gold. Now the price has plummeted",
        "publish_date": "Thu, 23 Oct 2025 07:34:55 +0000",
        "category": "finance",
        "authors": [
            "Oct"
        ],
        "text": "In recent weeks, and particularly this Monday and Tuesday, people have been lining up for hours in the Sydney CBD with one goal in mind: buying some gold .\n\nNow, the price has dropped – and sharply.\n\nYesterday, Australia woke up to the news that the precious metal had suffered its worst single-day fall since 2013, down a whopping 5.7 per cent in one go.\n\nREAD MORE: Mercury soars to blistering levels as hot air mass suffocates parts of Queensland ﻿\n\nPeople have been queueing outside the ABC Bullion store at Sydney's Martin Place for much of this week. (Louise Kennerley/SMH)\n\nThe trend continued today, down a further 0.6 per cent overnight.\n\nThat's a far cry from the astronomical rise in the price of gold this year , which hit a record high of around $US4380 per ounce, or about $6755 for 31 grams, this week, a more than 55 per cent increase since the start of 2025.\n\nThe rise has been particularly evident this month – in the space of just 11 days in October, the price surged by some $US400.\n\nBut in just a couple of days, it's slid back to roughly $US4080.\n\nSo what's going on?\n\nMuch of gold's rise has been attributed to its status as a safe-haven asset.\n\nWith all the geopolitical and economic turmoil this year – Donald Trump's tariffs, wars in Ukraine and the Middle East, persistent global inflation, and the US government shutdown to name but a few examples – investors have flocked to the precious metal.\n\nIf there was any tendency to then put the initial plunge down to a potential easing in global tensions, the further drop last night – when the gold price eased again even as Russia made a very public display of its intercontinental missile capabilities – would have dispelled that.\n\nInstead, it may just be a case of the rise reaching its natural peak.\n\nInvestors have flocked to gold this year amid the global and economic turmoil. (Dylan Coker/SMH)\n\n\"There's a classic market adage that goes something like 'when financial news moves from the business pages to the front page, the top is near',\" NAB head of FX Strategy Ray Attrill said yesterday.\n\n\"Wednesday's correction in the gold (and silver) price might be best seen in this context.\n\n\"Given the parabolic nature of the run up since September and the knowledge that much of the latest buying spree has been from retail or other private sector investors via ETFs ($US26 billion worth in September alone), a dash for the profits window was inevitable at some point soon, temporary or otherwise.\"\n\nWestpac senior economist Pat Bustamante said there are \"fears the astronomical rally has been overdone\".\n\n\"Investors appear to be taking profits given concerns the recent astronomical rally left gold and silver overvalued,\" he wrote.\n\nThe price of gold also fell – albeit temporarily – following a quick surge in the wake of Donald Trump's \"liberation day\" tariffs. (AP Photo/Evan Vucci)\n\nGold has gone through some temporary – and at times quite sharp – dips throughout the year, including shedding more than $US100 in a day and around $US300 in the space of a month once the initial panic from Trump's \"liberation day\" tariffs wore off.\n\nIt's also still on track for one of its best-ever single-year performances.\n\n\"Gold is still up 57 per cent year to date, far outpacing Bitcoin (up 17 per cent) or any of the major global stock indices,\" Attrill said.\n\nThat might not be any great relief to the queues of people who picked some up on Monday, though.\n\nDOWNLOAD THE 9NEWS APP : Stay across all the latest in breaking news, sport, politics and the weather via our news app and get notifications sent straight to your smartphone. Available on the Apple App Store and Google Play .",
        "source": "9News"
    },
    {
        "url": "https://www.abc.net.au/news/2025-10-24/mount-gibson-koolan-island-collapse-closure/105930000",
        "title": "Mount Gibson axes 450 jobs at Koolan Island WA mine site",
        "publish_date": "Fri, 24 Oct 2025 01:25:06 +0000",
        "category": "finance",
        "authors": [],
        "text": "A significant resources employer in Western Australia's north has announced 450 redundancies, with a remote mine site closing due to safety concerns.\n\nMount Gibson Iron will wind down operations at its Koolan Island mine after a \"significant\" rockfall on the eastern footwall of the site's main pit last week.\n\nThe island, which is in the Buccaneer Archipelago off the northern Kimberley coast, told the ASX on Friday morning of its decision to close.\n\nPrior to the incident, production at Koolan Island had been scheduled to conclude about September 2026.\n\nIn a statement, Mount Gibson said an \"intensive assessment\" had determined remediating the rockfall-affected area and safely resuming mining was not viable.\n\nAbout 75 employees will remain on site to continue processing ore and accelerate rehabilitation works, while about 250 staff and 200 contractor roles will be made redundant.\n\nKoolan Island mine has been closed West Australia's far north. (ABC Kimberley: Erin Parke)\n\nSafety priority\n\nMount Gibson Iron chief executive Peter Kerr said the decision was made with safety as the company's highest priority.\n\n\"It is extremely disappointing for the company and its people that we must prematurely ramp down operations at Koolan Island, however the physical safety of our personnel is our prime consideration,\" he said.\n\n\"We will now be working closely with our site team, the Dambimangari traditional owners and other relevant stakeholders to responsibly manage the transition and preserve a strong legacy in the region.\"\n\nThe company said all employee entitlements would be paid in full and support services provided to affected personnel.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-10-24/australia-team-pursuit-silver-uci-track-world-championships/105929270",
        "title": "Hoffman steps up with sensational keirin silver",
        "publish_date": "Fri, 24 Oct 2025 00:41:32 +0000",
        "category": "sports",
        "authors": [],
        "text": "Leigh Hoffman has claimed a spectacular silver medal in the men's keirin at the 20025 UCI Track Cycling World Championships in Santiago.\n\nHoffman finished second behind Dutch legend Harrie Lavreysen, who claimed his 18th overall world title and underlined his status as the greatest track sprinter of all time.\n\nStepping into the void created by Olympic silver medallist Matthew Richardson's shock defection to Great Britain after the Paris Games, the 25-year-old from Whyalla performed superbly to prove there is still plenty of class in the Australian sprint program.\n\nIt is Hoffman's first individual medal at a world championships. He was part of the team that won the team sprint gold in 2022, silver in the 2023 and 2024 editions, and bronze earlier in this competition.\n\nThe Australian drew the fourth position in the train, behind 2024 silver medallist Mikhail Takovlev and Lavreysen, latching onto Jeffrey Hoogland as the derny swung off.\n\nLavreysen, who won the event in Paris and has three world titles in the event to boot, wound up very early, launching a stinging attack from two-and-a-half laps out, with Hoffman in hot pursuit.\n\nHarrie Lavreysen is inarguably the greatest track sprinter of all time. (Reuters: Pilar Olivares)\n\nThe Dutch maestro was never likely to be caught, claiming yet another rainbow jersey to add to his extensive collection.\n\nBut Australian champion Hoffman showed his incredible power to hold on relatively comfortably to second place, with two-time world silver medallist Hoogland in third.\n\nAlthough Ellesse Andrews claimed gold in the women's keirin in 2023, no Australian man has won the keirin title since Shane Perkins in 2011, with Richardson's silver medal in 2023 the best result since then.\n\nOne of the favourites for gold, Richardson stunningly failed to get out of the quarter finals in one of the major upsets of the championships so far.\n\nOliver Bleddyn, Blake Agnoletto, Conor Leahy, and James Moriarty claimed world silver to go alongside their Olympic gold. (Reuters: Agustin Marcarian)\n\nPursuit silver for Olympic champions\n\nEarlier, Australia's mens' team pursuit squad also won a silver medal, the nations' first medal of any colour in the event since 2019..\n\nThe reigning world record holders and Olympic champions were up against two-time defending world champions Denmark in the gold medal race, but were never in the hunt.\n\nStream End Game with Tony Armstrong on ABC iview Tony Armstrong will tackle Australia's overdue reckoning with racism in sport, with the help of some of its biggest sports stars.\n\nThe Aussie team, consisting of Olympic gold medal winners Oliver Bleddyn and Conor Leahy — both resplendent on custom gold bikes — with Blake Agnoletto and James Moriarty, were behind from the off against the well-drilled Danes, who completed the 4,000m race in 3:43.915, an average speed of 64.31km/h.\n\nThe Aussie quartet finished over three seconds behind in the final.\n\nIt was Denmark's fourth victory in the event in the past six championships, while this was Australia's first medal in the discipline since winning gold in 2019.\n\nNew Zealand finished in third, repeating their result from 2023 in Glasgow.\n\nIn the women's event, Australia finished seventh, with Italy just holding off Germany for gold, Great Britain winning the bronze.\n\nIn a chaotic women's elimination race, Ireland's Lara Gillespie claimed gold in a race that needed to be re-started three times due to heavy crashes, the first of which involved Australian Alyssa Polites.\n\nAlyssa Polites crashed hard, taking down Valeriya Valgonen. (Reuters: Agustin Marcarian)\n\nPolites lost control of her front wheel in the pack and cannoned into Valeriya Valgonen, who crashed heavily on the pine to prompt a lengthy delay and repair job on the velodrome.\n\nGillespie, who has spent time training in Australia in recent years, winning the elimination and scratch races at the 2024 Australian Track Nationals in Brisbane, avoided all the chaos to edge past Katie Archibald of Great Britain in the final phase of the race.\n\n\"It's really, really special, I'm so proud to do it for my country … I'm so proud of our small little team here. We're small but mighty,\" Gillespie said.\n\n\"I think it took focus and composure,\" the Irishwoman added on dealing with the delays.\n\n\"I kept control of my breath and I kept believing.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-10-24/generative-ai-newsroom-journalism-acm-media-journalists/105860896",
        "title": "Regional newsroom staff say AI rollout leading to potential errors",
        "publish_date": "Fri, 24 Oct 2025 00:41:01 +0000",
        "category": "finance",
        "authors": [],
        "text": "Tim could not believe the headline when he read it.\n\nEven more so because it was his own work.\n\nThe former Australian Community Media (ACM) journalist, whose name has been changed to protect his employment prospects, said an internal generative artificial intelligence (AI) model had produced the headline for his news article, which was going to be published in the next day's printed newspaper.\n\nThe headline, according to Tim, was legally problematic.\n\n\"It had generated something false from the story,\" he said.\n\n\" With my knowledge about the story, I knew that could have potentially defamed someone who could have been wrongly identified from what was generated. \"\n\nHe caught the error just in time, but wondered what might have happened had he not spotted it.\n\n\"It made me feel frustrated and a little bit anxious because I wondered what else could have been possibly published in print that had gone unchecked.\"\n\nACM publishes newspapers around Australia. (ABC Riverina: Gary-Jon Lysaght)\n\nACM reporter Terri, whose name has been changed because she feared speaking out would jeopardise her job, said she was given legal advice about a news story from the AI model.\n\nShe said the advice was troubling.\n\nThe legal guidance, she said, had \"logic and thinking\" but greatly overstated the legal risks the story might pose.\n\n\"It was not right,\" she said.\n\n\"The AI returned a lot of information saying that the story posed a defamation risk [and] going through what it returned, I don't think it was correct.\"\n\nTerri said she did not follow the artificial intelligence's legal advice but said it set a worrying precedent.\n\n\"It's sort of analogous to Googling your symptoms instead of going to a doctor,\" Terri said.\n\n\"There's a reason why you have paid professionals who have to do a lot of schooling to get the qualifications to make those calls.\"\n\nGenerative AI 'experiments and testing'\n\nIn a leaked email to staff on October 3, seen by the ABC, ACM management said \"AI experiments and testing\" were happening in its newsrooms in three ways, including story editing and coaching, headline writing, and to help come up with story ideas.\n\nBut the ABC understands the rollout of the technology is also being used to analyse a news story's legal risk.\n\nIt is understood the generative AI model being used is Google's Gemini, and has been adapted for the news company so ACM data on the platform will not be shared with Google.\n\nACM runs mastheads across large swathes of east coast Australia. (ABC News: Lucas Forbes)\n\nMedia, Entertainment and Arts Alliance (MEAA) director Cassie Derrick said union members within ACM claimed, at some newspapers, there had been a directive given to use Gemini for \"all aspects of reporting\".\n\n\"In those instances, Gemini is making things up, misattributing some pretty important facts like charges in court, and generally looking to replace journalists and the ethical practice of those journalists with a more unethical software,\" she claimed.\n\nMs Derrick said a member was instructed to write an article based on court proceedings, through ACM's generative AI model.\n\n\"Gemini has attributed charges to the wrong person,\" she said.\n\n\"That journalist caught it, by doing the fact checking, but had they not, it obviously would have been a disaster.\n\n\"Not only for the journalist, but also for the person who had been wrongly accused.\"\n\nFears of job losses\n\nACM employee, Sam, whose name has also been changed to protect his identity, feared the technology could be used as a justification for job cuts.\n\n\"Some people will lose jobs and the ones who are left behind will be left picking up the pieces,\" he said.\n\n\"AI won't completely fill the hole that's been left behind by the people who have left.\"\n\nSome ACM reporters told the ABC they refused to use the technology.\n\nACM cut 35 jobs last year, blaming Facebook's parent company, Meta, for withdrawing funds for regional journalism it had previously provided as a result of the News Media Bargaining Code.\n\nSam said the ACM workforce was stretched.\n\n\"In our newsroom, because we're using AI pretty lightly, I don't think that's really had an impact on our journalism, yet,\" he said.\n\n\"There is that fear [that] if we were to become increasingly reliant on it [AI], are we going to be churning out stuff that has mistakes?\"\n\nThe ABC understands AI testing for headlines has occurred for more than 12 months. (ABC News: Sharon Gordon)\n\nAI 'not a replacement for journalists'\n\nThe ABC has found no evidence that any factual errors or legally problematic information, made by AI technology, have been published in print or online by ACM.\n\nIn a statement responding to questions from the ABC, an ACM spokesperson said the assertions around how generative AI was used in its newsrooms were \"flawed\".\n\n\"We do not use Gemini to write stories or rely on it for legal advice,\" the spokesperson said.\n\n\"Humans make the decisions on every word we publish. ACM is cautiously, carefully and openly exploring tools that can help us to better serve our communities.\n\n\"AI is not a replacement for journalists, editors or lawyers. Integrity and accuracy are not negotiable.\n\n\"We will keep listening to our teams, providing information and training, and driving responsible innovation that supports our journalism.\"\n\nAI use 'widespread' in journalism\n\nRMIT University AI and media expert TJ Thomson said the technology was increasingly being used in newsrooms for \"all sorts of things\".\n\n\"I wouldn't say that these issues or these fears are unique to ACM outlets, I think they're very widespread,\" Dr Thomson said.\n\n\"From behind-the-scenes uses to more public-facing uses, it is becoming more and more prevalent.\"\n\nBut he said that seeking legal advice from AI could be particularly fraught, given its geographic bias.\n\n\"These models that they're turning to have been trained primarily with information scraped from the World Wide Web, a lot of it from North America, which is a very different legal context,\" he said.\n\n\" It's a tricky balance that editors and journalists are having to strike with this technology. \"\n\nTJ Thomson says NewsCorp has introduced an internal AI model, called NewsGPT. (Supplied: Anthony Wheate)\n\nThe ABC has introduced an internal generative AI, called ABC Assist, which helps journalists search for ABC archival information, summarise old ABC content and draft interview questions, among other things.\n\n\"In the news division, all uses of AI tools in the production of audience-facing content must be referred to an editorial manager,\" the ABC's editorial guidance note states.\n\nThe New York Times has also recently updated information on its website about how its journalists use AI to analyse data and test headlines.\n\n\"We don't use AI to write articles, and journalists are ultimately responsible for everything that we publish,\" the New York Times said on its website.\n\nIn Australia, News Corp has been hiring AI engineers to join an editorial team.\n\nGoogle declined to comment.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-10-24/kangaroo-nawaqanitawase-to-earn-wallabies-recall-2027-says-kiss/105929654",
        "title": "Kangaroo Nawaqanitawase will earn Wallabies recall in 2027, says Les Kiss",
        "publish_date": "Fri, 24 Oct 2025 00:34:50 +0000",
        "category": "sports",
        "authors": [],
        "text": "Incoming Wallabies coach Les Kiss says dual international Mark Nawaqanitawase will have to earn his spot back in the side when he returns to rugby union in 2027.\n\nKiss has no doubt the 25-year-old will add an extra dimension to Australian rugby after his final year of NRL with the Sydney Roosters in 2026.\n\nNawaqanitawase will make his Kangaroos debut against England at Wembley on Sunday (AEDT) and is tipped to sign with European rugby in 2027 as he gears up for a World Cup year.\n\nThe star back topped the NRL try-scoring charts with 24 tries in 23 games in 2025.\n\nKiss, the Queensland Reds coach, did not rule the franchise out of making a play for the Roosters star, but he will be in charge of the Wallabies by the time 2027 rolls around.\n\n\"I think there's a little bit of water to go under the bridge before we get to those discussions. One thing's certain, he's earned his way to that Kangaroo jersey,\" Kiss said.\n\n\"We know he loves the game of rugby, so all options are open.\"\n\nKiss said playing rugby in Europe would not dent Nawaqanitawase's chances of adding to his 11 Tests.\n\n\"I think that boundary's moved a little bit,\" Kiss said.\n\nNawaqanitawase becomes dual international Ex-Wallabies winger Mark Nawaqanitawase and Reece Walsh are among four players named to make their debuts for Australia in the opening Ashes rugby league Test against England.\n\n\"It took him time to get the skill set going in rugby league, but I have no doubt he'll come back and add something for sure.\n\n\"Every year, every player grows a bit, and the wisdom he'll get from what he has learned from the rugby league game will be fantastic.\n\n\"We've got wingers currently in the Wallaby set-up and the Super Rugby teams, but he brings that sense of instructiveness into the game. He's not afraid to roam around the park and make moments his own and create opportunities for people.\n\n\"It's not that different to what we've got at the moment with Filipo (Daugunu) and Max Jorgensen, and those are boys doing similar. He's going to have to earn his way.\"\n\nFormer Wallabies coach Robbie Deans is director of rugby at Japanese club Wild Knights, who will play the Reds at Ballymore on Saturday afternoon.\n\nDeans said Kiss would have a challenge selecting a team if players such as Nawaqanitawase played off-shore.\n\n\"There's now a queue there. There are lots of good wingers in Australia. How Les handles those decisions will be interesting,\" Deans said.\n\n\"It's getting harder and that's what you want. You want blokes to want to be nearby so they're being seen, because unless you've got a point of difference, if you're somewhere else, it's very hard.\n\n\"Nawaqanitawase has obviously enjoyed the experience he's had, and what he's about to have will be good for him as an individual. He'll bring that back with him, and he's already performed well at an international level, so that's great for rugby.\"\n\nLoading...\n\nNawaqanitawase spoke recently about the wonderful opportunities offered by rugby to see the world and open horizons. That is a key factor that Deans likes about his return to the union game.\n\n\"For me, more importantly, it's the messaging,\" he said.\n\n\"Both he and Joseph [Suaalii], the way they talk about rugby's point of difference I think is a very important message. You want to see the world and play in a game that's the ultimate team game.\n\n\"That's a great message for the next generation.\"\n\nAAP/ABC",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-10-24/derby-fuels-service-station-food-allegations/105729068",
        "title": "Former staff accuse WA petrol station of serious hygiene breaches",
        "publish_date": "Fri, 24 Oct 2025 00:18:25 +0000",
        "category": "finance",
        "authors": [],
        "text": "An outback service station has been forced to make changes to its health and safety practices after two former employees accused it of operating in \"disgusting\" conditions.\n\nSteve Pates has worked in kitchens all around Australia, but says what he witnessed at a service station in Western Australia's far north earlier this year was beyond anything he had ever seen.\n\n\"I have worked in … sheep stations, cattle stations; this is so far beyond disgusting,\" Mr Pates said.\n\n\"It's horrendous … I've never seen a kitchen in that state in all my working career, ever.\"\n\nMr Pates was employed as a cook with independently owned Derby Fuels, operating under licence to Shell, in the Kimberley town of Derby, 2,300 kilometres north of Perth.\n\nDuring his stint working at Derby Fuels for just under a month, he raised concerns about it allegedly operating in unsafe and unhygienic conditions — something the business denies.\n\nTwo former cooks raised concerns about the cleanliness of the premises. (Supplied)\n\n'Horrendous' condition\n\nFrench backpacker Kalifa Diagne had previously worked in a Michelin-starred restaurant in France before travelling to Australia and working as a cook with Derby Fuels for around six weeks mid this year.\n\nWhile the cook knew it would be worlds away from his time working in France, he said the kitchen \"looked like a bin\".\n\n\"It was really bad [and] really dirty,\" Mr Diagne said.\n\nKalifa Diagne says the kitchen at Derby Fuels was unhygienic. (Supplied)\n\nMr Pates and Mr Diagne also questioned whether some food was safe to consume.\n\n\"Anything that's left over at the end of the day is put away in a plastic container, reheated first thing in the morning and put back out,\" Mr Pates said.\n\n\"This food stays in the bain-marie sometimes all day.\"\n\nIn a statement, Derby Fuels said it \"strongly rejects\" claims that food was unsafe to consume.\n\nInitial inspection finds 'serious non-compliance'\n\nThe Shire of Derby-West Kimberley conducted a health inspection of the premises on August 13.\n\nA copy of the inspection report, seen by the ABC, stated \"serious non-compliance\" with the cleanliness of the premises and food contact surfaces.\n\nIt showed Derby Fuels did not comply with temperature control when displaying food and adequately storing food to protect it from contamination.\n\nAt the time of the inspection, a shire spokesperson told the ABC it was working with the company to \"fulfil their responsibilities under the current food safety legislation\".\n\nClaims of being fired after raising concerns\n\nThirteen days after the inspection, Mr Diagne alleges he was unfairly dismissed via email for raising concerns.\n\n\"Having reviewed business requirements, we are not able to offer you any further work on a casual basis due to no further availability of shifts,\" it read.\n\n\"You must vacate the accommodation provided by lunchtime on August 29, 2025.\"\n\nThe following day, Mr Diagne wrote emails to the shire, the Fair Work Commission and Food Standards outlining his concerns.\n\nIn a statement, Derby Fuels said, \"no employee has ever been dismissed from Derby Fuels for raising legitimate food safety concerns\".\n\nDerby Fuels says food safety and hygiene is its top priority. (ABC Kimberley: Andrew Seabourne)\n\nFollow-up inspections\n\nIn a statement, the Shire of Derby-West Kimberley said it \"conducted further site visits to ensure compliance\".\n\n\"The premises has since been assessed and found to be compliant with all applicable health regulatory requirements,\" it said.\n\nIn a statement, Shell Derby Fuels management said the hygiene concerns were an \"isolated incident\" but did not respond to questions about how long the premises were in an unhygienic condition.\n\n\"Derby Fuels has documented food safety procedures in place, and all staff are expected to comply with them,\" it said.\n\n\"Derby Fuels has an established cleaning schedule, and the kitchen undergoes extensive deep cleaning regularly.\"\n\nThe business said it continued to work closely with the shire \"to ensure continuous improvement\".",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-10-24/boy-swallows-100-magnets-new-zealand/105929338",
        "title": "Teenager has surgery after swallowing 100 magnets",
        "publish_date": "Fri, 24 Oct 2025 00:17:00 +0000",
        "category": "finance",
        "authors": [],
        "text": "A 13-year-old boy has undergone major surgery in New Zealand after eating 80-100 small magnets purchased on Temu.\n\nNeodymium magnets have been banned since 2014 but are still available through online marketplaces.\n\nSurgeons at Tauranga Hospital on the North Island had to remove part of the boy's bowel after he ate up to 100 of the small magnets, according to a case study in the New Zealand Medical Journal.\n\nThe authors said it was \"alarming\" how difficult it was to enforce the long-standing ban when easily-accessible online marketplaces existed.\n\nThe Pasifika Medical Association Group said it highlighted the dangers of online marketplaces in the paediatric population.\n\n\"While product safety laws exist in New Zealand that prohibit the sale of high-powered magnets, there is significant challenge in enforcing these laws on products sold on online marketplaces,\" it said.\n\n\"This is especially concerning for our tamariki [children] as these platforms are easily accessible,\" a spokesperson said.\n\nUniversity of Auckland Professor Alex Sims said small, high-powered magnets were being advertised as toys but they could be life threatening.\n\n\"Small high-power magnets have been marketed and sold as fun toys for adults and children when they are sold in sets as they can be used to make different shapes and also be used as fidget toys,\" she said.\n\n\" Unfortunately, they often come as brightly coloured small balls, making them attractive for children to swallow. \"\n\nProfessor Sims said enforcing the ban on these small magnets was difficult when they were cheap and easy to get through online marketplaces.\n\n\"Parents should not be allowing their children to purchase items unsupervised on any online marketplaces,\" she said.\n\n\"All purchases must be done or at least overseen by parents.\"\n\nTemu responds\n\nIn a statement Temu said it had launched an internal review after becoming aware of the case from media inquiries.\n\n\"We are sorry to learn about the reported incident and wish the boy a full and speedy recovery,\" a spokesperson said.\n\n\"We take product safety very seriously and continuously monitor our platform to ensure sellers are complying with the safety regulations of the markets they are doing business in.\"\n\nThe platform had contacted the author of the New Zealand Medical Journal article to obtain more details about the case.\n\n\"At this stage we have not been able to confirm whether the magnets involved were purchased through Temu or identify the specific product listing,\" Temu said.\n\n\"Nonetheless, our teams are reviewing relevant listings to ensure full compliance with local safety requirements.\n\n\"Any products found to be noncompliant will be removed and we will take firm action against any sellers found to have breached our platform rules or local regulations.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-10-24/cranky-crow-divebombs-noosa-visitors-prompting-warning/105918290",
        "title": "Cranky crow forces tourists to duck for cover at holiday hotspot",
        "publish_date": "Thu, 23 Oct 2025 23:48:10 +0000",
        "category": "finance",
        "authors": [],
        "text": "As tourists traverse Noosa's famed shopping strip, they are blissfully unaware they are being watched.\n\nA seriously cranky crow is on patrol along Hastings Street, flitting from rooftops to treetops as it fiercely guards its territory at Queensland's holiday hotspot.\n\nThe crow on patrol along Hastings Street. (ABC Sunshine Coast: Jessica Ross)\n\n\"It is aggressive and pretty scary — it just chases you,\" Linda Harvey said.\n\nMs Harvey, who has lived in Noosa for 23 years, endured her first aerial attack last spring.\n\n\"It's swooped up from behind me, hit my head a couple of times with its claws, gave me a massive headache,\" she said.\n\n\" I didn't have any blood or anything, but it's a really hard thump on the head and it did it a couple of times. \"\n\nShe figured it was a once-off until it struck again this year.\n\n\"I go there regularly because I take my dog to the woods ... it kept swooping me to the point where an outdoor cafe area, I had to hide under their canopy,\" Ms Harvey said.\n\n\"A couple of the waiters came out and had a water bottle and sprayed it until it flew away.\"\n\nMs Harvey, with her dog Hugo, near the spot where she was attacked. (ABC Sunshine Coast: Jessica Ross)\n\nJulie Perrie has also fallen foul of the feathered foe while walking her dog through the area.\n\n\"It was actually swooping my head and then people were yelling, 'Quick, it's coming again,'\" Ms Perrie said.\n\n\"By the time I got in the car I had to sit and actually compose myself.\n\n\" Have you ever seen the movie The Birds by Alfred Hitchcock? It was like that. \"\n\nIn Alfred Hitchcock's acclaimed 1963 thriller The Birds, crows and ravens attack people. (Supplied.)\n\nCrow attacks 'unusual'\n\nMichelle Duggan works at a hat shop along Hastings Street.\n\nShe said the swooping was a daily occurrence and the crow appeared to target people with dogs.\n\n\"Even dogs that are in a car, I've seen it actually fly down to a car and try and have a go there,\" Ms Duggan said.\n\n\" It's pretty strange and people are quite frightened by him too. \"\n\nHastings Street workers Yuliia Ipatenko (left) and Michelle Duggan have been warning visitors about the crow. (ABC Sunshine Coast: Jessica Ross)\n\nChristina Zdenek, from conservation charity BirdLife Australia, said the bird most likely had a bad experience with a dog.\n\nDr Zdenek said the crow was being a 'good parent'. (Supplied: BirdLife Australia)\n\n\"Perhaps chasing after the bird, maybe injuring it and it's really remembered that particular event and it's reacting accordingly,\" Dr Zdenek said.\n\n\"The usual swooping offenders are indeed the masked lapwings [plovers] and the magpie so it is a little bit more unusual for it to be a crow but not completely unheard of.\n\n\"They're very likely to be protecting their nest so either eggs or young inside the nest at that very vulnerable time.\"\n\nA magpie swooping a young cyclist. (ABC Open contributor Dee Hartin)\n\nShe said it was possible the crow was copying from other birds.\n\n\"Being highly intelligent I would not put it past them to learn a behaviour from even another species but there's really no way to directly test that,\" she said.\n\nNoosa Council has now installed temporary warning signs.\n\nA council spokesperson said native birds are protected and it is illegal to harm or interfere with their nests and eggs.\n\nNoosa Council has erected temporary signs to warn visitors. (ABC Sunshine Coast: Jessica Ross)\n\nVisitors have been encouraged to take an alternative route if possible, walk quickly through the area and wear a hat and sunglasses to protect themselves.\n\n\"Give them space and recognise and have some empathy that the animal is probably trying to just be a really good parent and protect its young,\" Dr Zdenek said.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-10-24/nba-betting-scandal-lebron-james-injury-status-used/105929340",
        "title": "Injury status of NBA's biggest stars allegedly used in betting scandal",
        "publish_date": "Thu, 23 Oct 2025 23:46:29 +0000",
        "category": "sports",
        "authors": [],
        "text": "NBA guard Terry Rozier was averaging nearly 21 points per game for the Charlotte Hornets as the 2022-23 season neared an end.\n\nBut during a game against the New Orleans Pelicans, he scored only five and played for less than 10 minutes before claiming he was hurt.\n\nThe injury? It was fake and the fix was in as part of a scheme to help sports bettors, according to a federal grand jury indictment unsealed on Thursday in New York.\n\nThat episode is at the heart of a stunning scandal that is rocking the NBA.\n\nRozier, a pal and others have been charged with conspiracy to commit wire fraud and money laundering.\n\nProp bets and how feds say they were used\n\nThose placing prop bets do not wager on the outcome of a game — rather, they put money on individual player statistics, such as whether a player finishes over or under a certain total of points, rebounds or assists.\n\nThe indictment reveals how the widely popular bets can be exploited with inside information from locker rooms.\n\nInside the 'mind-boggling' NBA rigging and poker fraud cases The allegations involve NBA luminaries, multiple New York mafia families, millions in cash and even an x-ray poker table that could read cards face down.\n\nBefore the Hornets-Pelicans game, Rozier told a longtime friend that he was \"going to prematurely remove himself from the game in the first quarter due to a supposed injury and not return,\" the indictment states.\n\nThat meant bettors who knew Rozier was staying on the bench could easily wager that his point total would be less than his typical average. On the flip side, gamblers who took the \"over\" with no inside information were out of the money when they bet that he would score more than 21 points.\n\nRozier's friend, Deniro \"Niro\" Laster, shared the information with others, who placed more than $US250,000 in prop bets — and it paid off, according to the indictment.\n\nLaster collected tens of thousands of dollars from people who cashed in on the inside information and then drove to Rozier's home in Charlotte, North Carolina, where they \"counted the money\" a week later, the indictment says.\n\nJames, Lillard caught up despite no wrongdoing\n\nThe indictment also has descriptions of several unnamed NBA players whose availability for certain games was the source of betting activity.\n\nTheir identities are clear based on a review of injury reports for games mentioned in the indictment.\n\nThose players are not accused of wrongdoing, and there is no indication that they would have even known what was being said about their game status. They include LeBron James, Anthony Davis and Damian Lillard.\n\nDamon Jones has been charged over the scandal. (AP: Morry Gash)\n\nDamon Jones, who was an unofficial assistant coach for the Los Angeles Lakers in 2022-23, was also charged. He is accused of sharing non-public information about the status of players in two Lakers games in 2023 and 2024.\n\nIn the 2023 game, Jones is accused of texting others that a certain player who was not on the injury report still would miss the game with a lower body injury.\n\nJames, who had earlier been listed as questionable, did not play because of ankle issues.\n\n\"Get a big bet on Milwaukee tonight before the information is out!\" Jones said in a text, according to the indictment.\n\nRozier's attorney, Jim Trusty, said Rozier was \"not a gambler\" and looked \"forward to winning this fight\".\n\nIt was not immediately known if Laster or Jones had lawyers who could comment on the allegations.\n\nThe ABC of SPORT Sports content to make you think... or allow you not to. A newsletter delivered each Saturday.\n\nAP",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-10-24/first-nations-cultural-women-tourism-growing-demand-australia/105894586",
        "title": "Indigenous women lead increasingly popular cultural tourism trend",
        "publish_date": "Thu, 23 Oct 2025 23:31:21 +0000",
        "category": "finance",
        "authors": [],
        "text": "Tour guide Iteka Urkala Sanderson Bromley walks a path that has been worn by the footsteps of her ancestors for thousands of years when she shows people her country.\n\nThe Adnyamathanha (Flinders Ranges), Narungga (Yorke Peninsula) and Yarluyandi (Simpson Desert) woman said sharing her culture was an empowering responsibility based on truth-telling.\n\n\"They [my ancestors] would have been doing the same as me — they're taking the young people and they're saying 'look at this, look at that' and I'm doing it now and it's such a privilege,\" Ms Sanderson Bromley said.\n\nIteka Urkala Sanderson Bromley leads a cultural tour in Adelaide. (Supplied: Bookabee Australia)\n\nThe First Nations woman has worked as a tour guide for her family's business, Bookabee Australia, since she was just 16.\n\nBookabee has operated in South Australia for 21 years.\n\nThere is a growing number of women entering the cultural tourism field.\n\nMs Sanderson Bromley met with emerging and experienced guides at the inaugural meeting of a new women's tourism association in Port Lincoln.\n\nFirst Nations Women In Tourism Australia was an idea from Barngarla woman Emmalene Richards after she experienced a gap in support for Indigenous women in tourism, leadership and business in regional and remote areas.\n\nShe teamed up with Wirangu woman Daina Walker, who had experience in tourism management, to help establish the not-for-profit body.\n\nDaina Walker shares her tourism industry knowledge. (Supplied: Daina Walker)\n\nThey said their mission was to make a positive impact on the lives of First Nations women by providing the skills and knowledge needed to not only enter the tourism industry, but empower them to go on and be leaders.\n\n\"It's been about elevating, empowering and celebrating First Nations women in tourism,\" Ms Richards said.\n\n\"We've got people not just in the tourism industry but other industries, education and training, and that's what we wanted, to get people together so we could create this network of information and collaborate with people in the industry and even outside the industry,\" Ms Walker said.\n\nCultural tourism grows\n\nCultural tourism is a growing industry with the potential for jobs in regional areas.\n\nThere were a record 3 million overnight trips that involved First Nations activities in Australia in 2023/24, according to the Australian Trade and Investment Commission Tourism Research Australia survey published in October 2024.\n\nThe most popular First Nations activity for domestic travellers was visiting an Aboriginal site or community, with 881,000 overnight trips in 2023/24.\n\nInternational travellers favoured experiencing an Aboriginal art/craft or cultural display, involving 813,000 overnight trips.\n\nRehanna Coulthard shares cultural knowledge in the Flinders Ranges. (Supplied: Rehanna Coulthard)\n\nAdnyamathanha woman Rehanna Coulthard has combined on-country tours and art in the Flinders Ranges, drawing on stories from her female ancestors.\n\n\"For the Adnyamathanha people, we've grown up in a very matriarchal system, although the men do the teaching, the women are very special,\" Ms Coulthard said.\n\n\"I've got stories handed down to me from my great-grandmothers.\"\n\nEmmalene Richards takes visitors to the Poonindie Native Training Mission. (ABC Eyre Peninsula: Amelia Costigan)\n\nTruth-telling deep pain\n\nMs Coulthard's tours visit culturally-significant art sites and delve into the impacts of the Stolen Generations.\n\nShe said combining country with truth-telling was a powerful lesson.\n\n\"You've got this beauty and land and you've got the beauty of sitting in a creek and listening to the embers of the fire and the birds, but you've also got this sadness and this deep pain of what has happened,\" Ms Coulthard said.\n\nRehanna Coulthard hosts on-country cultural tours in the Flinders Ranges. (Supplied: Rehanna Coulthard)\n\n\"I think it's very important for us to be truth-telling but also sharing that rich culture so people can actually respect it and acknowledge that, 'Yes, it happened.'\"\n\nMs Richards has also shared her family's Stolen Generations experiences in her tourism, focusing on the rich connection of First Nations' language and deep responsibility for the land.\n\nBut it has not all been for tourists.\n\nMs Sanderson Bromley has worked with young people in schools.\n\nShe said she saw the benefits of reconnecting with culture.\n\n\"I can see how some people don't have that connection but they're really, really seeking it and really desperately trying to find something to grasp onto,\" she said.\n\nIteka Urkala Sanderson Bromley on her country in the Flinders Ranges. (Supplied: Bookabee Tours)\n\n\"I can see how much it means to them particularly for the on-country tours, you see such a change in these kids.\n\n\"Seeing all these things that these kids are facing and how desperately they're looking for some connection to culture and then to be able to help them with that, it's a privilege.\"\n\nThe women have also shared insights into knowledge of the seasons and bush medicines used by previous generations.\n\nSusie Betts tells the creation story of the Seven Sisters as part of her cultural tours. (Supplied: Waldya Spirit Immersions)\n\nPort Lincoln Wirangu artist Susie Betts has also shared her people's Yugarila or Seven Sisters, Pleiades star constellation, songline and how it connected with other First Nations people across the world.\n\nMs Betts won a Churchill Scholarship in 2018 to travel to the United States and South America to research cultural stories involving Yugarila, the Seven Sisters.\n\nShe found similar Seven Sisters creation stories in Dakota and Arizona in the United States of America and in Peru and developed Cosmic Cultural Star Immersion Talks as an extension of her overseas research.\n\nSusie Betts takes her creation story into classrooms. (Supplied: Susie Betts)\n\nMs Betts has also included archeoastronomy in her tours, which combined archaeology, anthropology and astronomy to gain insights into life in ancient civilisations.\n\nAbout 20 women in tourism and education attended the inaugural meeting of First Nations Women In Tourism Australia held in Port Lincoln in September.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-10-24/world-rowing-canoeing-hits-back-at-brisbane-olympic-venue-claims/105929140",
        "title": "Rowing body pours cold water on 'green light' claim for Olympic events",
        "publish_date": "Thu, 23 Oct 2025 23:26:28 +0000",
        "category": "sports",
        "authors": [],
        "text": "The heads of the world's top rowing and canoeing bodies have poured cold water on claims a \"green light\" has been given for Olympic and Paralympic paddling events to be held on central Queensland's Fitzroy River as part of the 2032 Games.\n\nThe river in Rockhampton was a controversial choice of venue when it was announced in March, with Premier David Crisafulli declaring Brisbane 2032 would be \"a Queensland Games for all of Queensland\".\n\nEarlier this week it was confirmed the river had passed initial testing by the Games Independent Infrastructure and Coordination Authority (GIICA).\n\n\"Effectively now we have a green light for rowing in 2032,\" Rockhampton Senator Matt Canavan said earlier this week.\n\nMatt Canavan says rowing events will happen on the Fitzroy River. (ABC News)\n\nThe state's feasibility study of the Fitzroy River includes evaluating river flow, water levels and initial field of play suitability in accordance with International Federation and Games standards.\n\nOlympic venues are in the planning and approvals phase across Queensland before funding is approved for design.\n\nBut in a signed joint statement supplied to the ABC on Friday, World Rowing president Jean-Christophe Rolland and International Canoe Federation (ICF) president Thomas Konietzko said the groups were not ready to give the go-ahead for the Fitzroy.\n\nInstead, the bodies said they were committed to ensuring \"fair and safe competition\".\n\nSchool rowers training on the Fitzroy River. (Supplied: Rockhampton Grammar School)\n\n\"World Rowing and the International Canoe Federation have been made aware of recent statements regarding the Fitzroy River in Rockhampton and its suitability as the proposed venue for Classic Rowing and Canoeing at the Brisbane 2032 Olympic and Paralympic Games,\" the statement read.\n\n\"At this stage, World Rowing and ICF have not yet received any information related to the technical studies and feasibility assessments currently in progress.\n\n\"World Rowing and ICF continue to respect and adhere to the evaluation process that was jointly agreed upon by all relevant parties.\n\n\"We remain fully committed to ensuring that any venue selected for Olympic and Paralympic Classic Rowing and Canoeing meets the technical standards required for fair and safe competition.\"\n\nDavid Crisafulli has been emphatic in his support for Olympic rowing on the Fitzroy River. (ABC Capricornia: Aaron Kelly)\n\nDuring a visit to Rockhampton this week Mr Crisafulli said the Fitzroy River would host those events in 2032 regardless of what international rowing bodies determined as to its suitability.\n\n\"Rowing is going to happen in Rockhampton — it's a promise I made to people and that's what we're delivering,\" he said.\n\nWorld Rowing and the ICF are conducting their own technical assessments of the river.\n\nA deadline for test results is yet to be announced.\n\nThere are 2,481 days until the opening ceremony of the 2032 Olympics in Brisbane.\n\nThe Games are set to run from July 23 to August 8.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-10-24/young-stroke-survivor-calls-greater-awareness/105920754",
        "title": "Elena was a fit and healthy 20-year-old — then she had a stroke",
        "publish_date": "Thu, 23 Oct 2025 23:01:03 +0000",
        "category": "lifestyle",
        "authors": [],
        "text": "Shortly after her 20th birthday, Elena Lampropoulos was on her phone in her bedroom in south-west Sydney — and when she got up, she collapsed.\n\nShe put it down to clumsiness, but when she looked at her right arm, it was lifeless.\n\n\"I looked at my right leg and I couldn't move it. I remember just screaming, like a scream I've never heard come out of my mouth,\" Ms Lampropoulos said.\n\n\"Obviously, it was from fear and [being] completely terrified.\"\n\nThe right side of Ms Lampropoulos's body was paralysed.\n\nToo young for a stroke?\n\nDespite her terror, Ms Lampropoulos's mind went back to an ad she saw as a child and quickly recognised the symptoms of a stroke.\n\nShe was able to call an ambulance, but was frustrated by the emergency dispatcher's response.\n\nDuring her childhood in Canada, Elena Lampropoulos saw an ad that helped her recognise her stroke symptoms. (ABC Radio Sydney: Isabella Michie)\n\n\"She goes, 'You're 20 and you think you're having a stroke?' and then she scoffed at me,\" Ms Lampropoulos claimed.\n\n\"There was a bit of a back and forth, and because I was becoming frustrated with the lack of proper communication, I started screaming and crying, and she just totally dismissed it.\"\n\nHer frustration continued when the paramedics arrived.\n\nMs Lampropoulos felt they did not take her seriously either.\n\n\"One of the paramedics smirked at me and goes, 'Oh, did someone have a little fall?'\" she said.\n\nBefore her emergency surgery, Elena Lampropoulos was disoriented and thought she was in Japan. (Supplied: Elena Lampropoulos)\n\nShe was then taken to St George Hospital, where she received emergency care.\n\nStroke Foundation Australia CEO Lisa Murphy said there was a common misconception that strokes only occurred in older Australians, despite one in four sufferers being under 65.\n\n\"Traditionally, when you think of a stroke, you think of your grandfather or your grandmother having a stroke. So that's an image that you've got in your head,\" she said.\n\n\"They think, 'I'm young, I'm healthy, why am I going to have a stroke?'\"\n\nLisa Murphy says the symptoms of a stroke include facial drooping, arm weakness and slurred speech. (ABC News)\n\nScans at the hospital revealed Ms Lampropoulos suffered an arteriovenous malformation (AVM) rupture, a tangled mesh of blood vessels in the brain that is formed before birth.\n\nShe was rushed into emergency surgery. If she had not been, she would have died within hours.\n\nMs Lampropoulos's neurosurgeon, Mark Davies, said younger patients deteriorated more rapidly than older sufferers as they had less space in their cranial cavities.\n\n\"Inside your head when you're young, your brain fills the whole space and sort of squishes up on the inside of your skull, so you can tolerate things like blood clots or swelling less,\" Professor Davies said.\n\n\"Whereas in an older person, there's often a lot of room for things to move around and people don't tend to deteriorate [as quickly].\"\n\nLosing her 20s\n\nAfter her stroke in 2015, Ms Lampropoulos suffered weakness in the right side of her body, also known as hemiparesis, and had to re-learn how to move.\n\nDuring her recovery, Elena Lampropoulos felt isolated from her 20-year-old peers. (Supplied: Elena Lampropoulos)\n\nShe spent roughly two months in the hospital, where she was the youngest in the neurological ward — the second youngest patient was 65.\n\n\"I was 20 and I was alone. I had no one to relate to,\" she said.\n\nIt was only this year, 10 years after her stroke, that Ms Lampropoulos regained movement in her right foot.\n\nIn addition to her physical rehab, Ms Lampropoulos saw a psychologist to help manage the impact of her condition on her mental health.\n\n\"I was a mess because again, being 20, you're stuck in a hospital and you see on Instagram everyone's having a great time,\" she said.\n\n\"And you're sitting there after eight hours of rehab … just going, 'What is my life?'\"\n\nDuring her rehab, Ms Lampropoulos felt exhausted and frustrated.\n\nIn the years that followed, she became \"severely depressed\" and developed obsessive-compulsive disorder.\n\n\"I felt like giving up … I was angry about the whole situation,\" she said.\n\nElena Lampropoulos hopes sharing her story will make other young survivors feel less alone. (ABC Radio Sydney: Isabella Michie)\n\nMs Lampropoulos became reliant on her family for most things — a stark contrast to the independent 20-year-old she was prior to the stroke.\n\n\"You lose your identity from that,\" she said.\n\nHer doctors advised her to postpone her studies and work, and her only focus for the next five years was her rehab.\n\nDr Murphy said being mentally well was key to recovery after a stroke but was often more difficult for younger sufferers.\n\n\"Because they're at the height of their life and suddenly you have this massive life change,\" she said.\n\nThe Stroke Foundation's Young Stroke website and the Young Stroke Service (YSS), available in Victoria and South Australia, are the only resources targeted at young survivors.\n\nHowever, neither of these services were available at the time of Ms Lampropoulos's stroke, and funding for the YSS is due to run out at the end of 2026, according to the Stroke Foundation.\n\nMore awareness targeting young people needed\n\nOver the past two years, Ms Lampropoulos has made progress with her mental health and has grown to accept her physical condition.\n\nShe has now regained full mobility of her right arm, with some weakness as well, as full movement of her right leg, but has weakness in her ankle and foot.\n\n\"You just get over it … I've gone this far and worked really hard to get to where I am — I can't allow myself to feel like a failure,\" she said.\n\nLast year, Ms Lampropoulos began offering stroke recovery coaching to provide a sense of community to younger sufferers and raise awareness that strokes could happen at any age.\n\n\"Yes, this happened to me, but it doesn't mean it can't happen to you,\" she said.\n\nEarlier this year, 27-year-old Australian model Lucy Markoiv died due to an AVM, the same condition Ms Lampropoulos suffered from.\n\nWhile some people may present symptoms of an unruptured AVM, such as recurring migraines or seizures, Ms Lampropoulos did not.\n\nElena Lampropoulos has taken a break from her stroke recovery coaching to focus on her studies. (ABC Radio Sydney: Isabella Michie)\n\nShe said more education and stroke awareness targeted at young people in Australia was needed.\n\n\"The only reason I knew I was having a stroke was because of a commercial I saw when I was eight or nine [in Canada],\" she said.\n\nDr Murphy said strokes often happened without warning signs, but simple health checks, such as monitoring your blood pressure or cholesterol levels, could help.\n\n\"What we encourage people to do, even if they are young and they think they're invincible, is to go and get a health check with a GP,\" she said.\n\nNSW Ambulance spokesperson told ABC Radio Sydney it prioritised safe and respectful care for all patients.\n\n\"NSW Ambulance's provision of stroke care aligns with evidence-based, best-practice guidelines.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-10-24/cricket-smriti-mandhana-india-vs-new-zealand-world-cup-wrap/105928974",
        "title": "Indian openers register 37-year first to qualify for World Cup semifinal",
        "publish_date": "Thu, 23 Oct 2025 23:00:19 +0000",
        "category": "sports",
        "authors": [],
        "text": "India has at last booked a semifinal spot at their home Women's World Cup and a blockbuster last-four rematch against champions Australia could be on the cards.\n\nSuperb centuries from openers Smriti Mandhana and Pratika Rawal provided the base for their rain-affected 53-run win on DLS over New Zealand in Navi Mumbai, finally nailing the co-host's place in the knockout matches after three successive defeats.\n\nIndia will now finish fourth in the group table and will have to meet the league winners in the semis.\n\nThe winners of Saturday's clash between unbeaten Australia and South Africa at Indore look sure to top the group and thus book a knockout clash with the hosts in Guwahati next Wednesday.\n\nAlyssa Healy's side, which defeated India by three wickets in a thrilling group match in Visakhapatnam, will expect to complete its group program with a sixth-straight win and set up another blockbuster between the two pre-tournament favourites.\n\nBut India did put up a bit of a statement win as Mandhana and her batting apprentice Rawal, who put on 155 against Australia, surpassed even that against the battered Kiwis.\n\nRawal hit 122 – her maiden World Cup hundred – off 134 balls while Mandhana amassed 109 off 95 deliveries.\n\nThe duo put on 212 in 32.2 overs at the DY Patil Stadium.\n\nJemimah Rodrigues then built on their excellence with an unbeaten 76 off 55 balls as India racked up 3-340 in 49 overs, the 2025 edition's highest score, before rain interruptions reduced the game to a 44-over affair.\n\nNew Zealand captain Sophie Devine managed just six before being bowled by Renuka Singh in the run chase. (Getty Images: Alex Davidson)\n\nNew Zealand, chasing a revised total of 325, never looked likely to pull off the win that would have resurrected their hopes, despite Brooke Halliday's impressive 81.\n\nSo the White Ferns are out, after three defeats and two rain-hit no-results in six matches, leaving captain Sophie Devine to lament: \"We are incredibly disappointed and gutted … bloody frustrating tournament.\"\n\nBut not for the Indians, for whom nothing but victory in their home tournament will do.\n\n\"It is a big relief,\" Mandhana said.\n\nShe was named player-of-the-match for her third World Cup hundred and her 14th overall in women's ODIs, putting her second in the all-time list behind Meg Lanning's 15 for Australia.\n\nStream End Game with Tony Armstrong on ABC iview Tony Armstrong will tackle Australia's overdue reckoning with racism in sport, with the help of some of its biggest sports stars.\n\n\"The last three games were really tough — we played good cricket, but we did not win,\" Mandhana said.\n\n\"Pratika deserves this award as much as I do, and I am a little surprised. She is a good anchor and allows me to play my natural game.\"\n\nPut in to bat, theirs was only the third instance of a double-century opening stand in women's World Cups, and a first since 1988.\n\nMandhana got to 50 off 49 balls and made India's first century of the tournament off 88, while Rawal got to her second ODI ton off 122 balls. Rodrigues, promoted to number three, then responded with a 38-ball half-century.\n\nRain proved a frustration, with India's innings halted at 49 overs before a further delay caused another lost two hours.\n\nWhen play finally resumed, India's medium pacers Kranti Gaud (2-48) and Renuka Singh (2-25) proved key.\n\nGeorgia Plimmer (30) and Amelia Kerr (45) tried to speed up, but Singh bowled Plimmer in the 10th over and Devine (six) in the 12th, to leave New Zealand 3-59 and effectively out of the hunt despite some late heroics from Halliday and Isabella Gaze (65 not out), who put on 72 off 64 balls.\n\nAAP",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-10-24/a-league-mental-health-concerns-revealed-in-new-report/105927872",
        "title": "'Hell of a lot of stress': A-League mental health concerns revealed",
        "publish_date": "Thu, 23 Oct 2025 22:00:35 +0000",
        "category": "sports",
        "authors": [],
        "text": "A-League footballers are struggling with their mental health, substance abuse and job security, according to a report from Professional Footballers Australia (PFA).\n\nThe report shows 66 per cent of female players and 43 per cent of male players reported \"sport-psychological distress\".\n\nThat distress is something former Socceroos goalkeeper Andrew Redmayne knows only too well.\n\nThe hero of Australia's 2022 World Cup qualification campaign found himself out of contract at the end of the last A-League season after 192 games with Sydney FC.\n\nAndrew Redmayne, pictured here with Sydney FC, lifts the A-League trophy in 2020. (Getty Images: Mark Metcalfe)\n\n\"It's hard,\" he told ABC Sport.\n\n\"I mean, I was coming off contract and I didn't have much kind of going for me at the time, with a wife and two kids, you kind of do need a pay-cheque.\n\n\"We're not on exorbitant salaries playing football here in Australia and the cost of living isn't getting cheaper.\n\n\" There's a hell of a lot of stress that gets placed on you. \"\n\nRedmayne finally got a contract with his original club, Central Coast, and rewarded the side by saving a penalty in the Mariners' 3-2 round-one win over Newcastle.\n\nBut his experiences back up some of the revelations in the PFA's Player Development Program Insights and Impacts Report, taken from a survey of A-League players at the end of the 2024-'25 season.\n\nThe Player Development Program (PDP) was established by PFA to support players with their career, wellbeing and retirement.\n\nTameka Yallop says Australian football organisations need to be mindful of developing \"great people\". (AAP: Dan Himbrechts)\n\n\"Australian football needs to ensure it is not only developing great players but also great people,\" PFA co-president Tameka Yallop said.\n\n\"The PDP plays a critical role in ensuring we have world-class support during times of need and expertise to help us prepare for life after football,\" she said.\n\nAs part of the survey the PFA conducted a mental health survey of all A-League players, which showed high levels of poor mental health, substance abuse and disordered eating.\n\nPFA chief executive Beau Busch said \"sport-psychological distress\" could describe anything from performance anxiety to generalised anxiety disorders and depression.\n\n\"There are a number of clubs we believe are falling short of ensuring the players have a safe workplace, but also, critically, a workplace where they can thrive,\" he said.\n\nStream End Game with Tony Armstrong on ABC iview Tony Armstrong will tackle Australia's overdue reckoning with racism in sport, with the help of some of its biggest sports stars.\n\nThirty-four per cent of female players and 31 per cent of male players surveyed reported alcohol misuse.\n\nMr Busch said the numbers were \"pretty consistent with the general population\".\n\n\"But also, what's overlaid on these young people is that they're coming into an environment that is hugely demanding to them … so we know that they're facing a range of challenges,\" he said.\n\n\"What we've seen in our research is that a player that gets injured is far more likely to engage in gambling or alcohol misuse.\n\n\" The industry needs to respond better at supporting players when they are injured. \"\n\nSome Western United players found themselves out of a job after the club's participation in the upcoming season was put on hold. (AAP: Rob Prezioso)\n\n'Phenomenal' stress for little pay\n\nMr Busch said the perilous financial state of many A-League clubs meant players coming off contracts were more likely to face periods of unemployment.\n\nThat was the case for some Western United players who found themselves out of a job when the club's participation in this season was put on hold.\n\n\"We're seeing greater churn start to come back up when there's increasing financial strain amongst the league, so therefore players are likely to come off contract more often, have gaps between employment,\" Mr Busch said.\n\n\"We know that's placing strain on them and when that wellbeing sort of strain comes, they can be more prone to engage in some of these risk-taking behaviours that can then develop into addiction.\"\n\nRedmayne, 36, said the stresses were \"quite phenomenal\", particularly on younger players trying to make their way in a cut-throat industry.\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\n\"When you're a younger player, when you haven't got that position cemented down or contract cemented down, or if you still have aspirations to play overseas and you need certain KPIs to kind of further yourself it's a big stress,\" he said.\n\n\"It's your livelihood and a lot of times these kids who are kind of on the brink of things – kind of 22, 23, 24 – [they're] probably slightly over the minimum wage.\"\n\nA-League clubs must give players access to a sports psychologist or a wellbeing manager who is responsible for delivering confidential psychological support services.\n\nThe survey found that less than half of A-League Women players were either very or extremely confident about the direction and control they had over their careers.\n\nFifty-nine per cent said they were not at all confident or were slightly confident.\n\nThe survey found that less than half of A-League Women players are very or extremely confident about where their careers are heading. (Getty Images: Paul Kane)\n\nThe A-League Women's competition is largely semi-professional and carries a minimum wage of $26,000 per year.\n\nMr Busch estimated that a maximum of 30 per cent of A-League women players would be fully professional, which would include some Matildas players.\n\n\"The vast majority are really very close to that minimum wage figure,\" he said.\n\n\"They're having to juggle a range of commitments to pay the bills.\n\n\"And we're seeing that take a significant toll on these players and we're seeing the A-League women actually becoming younger and younger, because players as they get older, they're simply getting worn down by having to juggle all these competing demands.\"\n\nDo you have a story idea about women in sport? Email us abcsport5050@your.abc.net.au\n\nMr Busch said that related to what he called the \"unsustainable\" rates of pay in the league and a lack of confidence and direction in women's football in Australia.\n\n\"Right now … when we go around and we talk to players … my own sense of it is that we haven't progressed quickly enough,\" he said.\n\n\"We're seeing leagues around the world make really important progress swiftly — we're seeing that domestically with AFLW and others and we haven't kept pace.\n\n\"So I think people are largely quite disappointed by that.\"\n\nThe survey also revealed that 41 per cent of women and 32 per cent of men in the A-League competitions had disordered eating habits.\n\nHistorically there was a focus on skin-fold tests, particularly for men, which Mr Busch described as \"almost shaming\".\n\n\"We know that some of those legacy practices are having a significant impact on our players and also, importantly, on our female players, which has been the case for a significant period of time,\" he said.\n\n\"That's thankfully starting to change, but it's not changing quick enough … we need to have more impact on that and speed up that process.\"\n\nThe Australian Professional Leagues organisation, which runs the A-League competitions, declined to comment.",
        "source": "ABC"
    },
    {
        "url": "https://www.smh.com.au/national/australia-news-live-us-looks-to-set-up-naval-base-in-australia-to-advance-aukus-vance-criticises-israeli-parliament-s-vote-to-annex-west-bank-king-charles-and-pope-leo-pray-together-in-500-year-first-20251024-p5n4xd.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Australia news LIVE: US looks to set up naval base in Australia to advance AUKUS; Vance criticises Israeli parliament’s vote to annex West Bank",
        "publish_date": "Fri, 24 Oct 2025 12:52:53 +1100",
        "category": "finance",
        "authors": [
            "Emily Kaine"
        ],
        "text": "Nationals leader David Littleproud has said this morning that “renewables are losing their social licence” and labelled net zero as overly ambitious as tensions within the Coalition over the policy reach a fever pitch.\n\n“Net zero has become about trying to achieve the impossible rather than doing what’s sensible,” Littleproud said at a press conference today.\n\nNationals leader David Littleproud Credit: Dominic Lorrimer\n\nThe National Party leader also criticised the government’s all-renewables approach and said that additional wind turbines built under this approach were “going across prime agricultural land” and “taking away [your] food security, pushing up [your] food prices”.\n\n“Renewables are losing their social licence… There is a better way than the way the Albanese government is undertaking on this reckless race to an all-renewables approach. There’s no country of the industrial scale the size of Australia that is going on renewables.”\n\nThe Coalition remains divided on its net zero policy.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/the-friendlyjordies-video-that-sparked-the-text-exchange-20251024-p5n52s.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "The FriendlyJordies video that sparked the text exchange",
        "publish_date": "Fri, 24 Oct 2025 12:42:54 +1100",
        "category": "finance",
        "authors": [],
        "text": "The FriendlyJordies video that sparked the text exchange\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/queensland/expressions-of-interest-to-buy-toowong-private-hospital-close-20251024-p5n524.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Expressions of interest to buy Toowong Private Hospital close",
        "publish_date": "Fri, 24 Oct 2025 12:42:37 +1100",
        "category": "finance",
        "authors": [
            "Courtney Kruk"
        ],
        "text": "Expressions of interest to buy Toowong Private Hospital have officially closed, four months after the 58-bed private psychiatric facility shut its doors.\n\nA spokesperson for commercial and residential real estate agency Colliers said there had been a mix of interested buyers in the lucrative 5835-square-metre site, including from private developers and healthcare representatives.\n\nThey said a potential sale was in the works.\n\nToowong Private Hospital is on a sizeable block, four kilometres from Brisbane’s CBD. Credit: Courtney Kruk\n\nToowong Private Hospital was opened in May 1976 by Noel Austin Kratzmann and provided crucial in-patient and out-patient psychiatric care to Queenslanders for more than four decades.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/flight-from-new-zealand-to-sydney-suffers-technical-issues-mid-flight-20251024-p5n52r.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Flight from New Zealand to Sydney suffers technical issues mid-flight",
        "publish_date": "Fri, 24 Oct 2025 12:37:47 +1100",
        "category": "finance",
        "authors": [],
        "text": "Flight from New Zealand to Sydney suffers technical issues mid-flight\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/culture/tv-and-radio/want-to-know-what-s-going-to-be-big-in-tv-in-2026-look-for-these-13-shows-20251023-p5n4ni.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Want to know what’s going to be big in TV in 2026? Look for these 13 shows",
        "publish_date": "Fri, 24 Oct 2025 12:31:36 +1100",
        "category": "finance",
        "authors": [
            "Michael Idato"
        ],
        "text": "Save Log in , register or subscribe to save articles for later. Save articles for later Add articles to your saved list and come back to them any time. Got it Normal text size Larger text size Very large text size Wanna know what’s going to be big on TV in 2026? Finding the answer, sometimes, is just a matter of where you look. Despite the uncertainty of the global television business, more than 10,000 buyers and sellers of TV still converge every year for the world’s biggest content market. Sales are brisk. Risks are high. But all transactions are final. Mipcom, or as it is fully titled, Marché International des Programmes de Communication, is the world’s biggest television trade show. Staged annually in Cannes, France, it is equal parts Sydney Royal Easter Show and Melbourne International Film Festival. It is where the people who make TV shows come to sell them, and it is where the people who buy TV shows come to go shopping. Boston Blue star Donnie Wahlberg poses on the red carpet at Mipcom. Credit: S. d'Halloy / Image&Co for Mipcom The market is useful for detecting deeper trends in the business. This year, for example, YouTube set up shop in Cannes, heralding what many saw as a closer alignment between the online creator economy and traditional television content. “It feels like a tipping point for the industry,” Mipcom Cannes director Lucy Smith said. Loading But the engine turning the wheels is still on-foot deal-making, with more than 10,000 delegates in attendance, some 3340 of whom were dedicated program buyers, all scouring the Palais des Festivals in Cannes hoping to find the next big thing before their competitors. The market hosted 350 exhibitors – studios, channels or production companies – from 107 countries. And while the market does not lean on glamour, it is not without celebrity touches. Among the stars hawking their wares this year were Donnie Walhberg and Sonequa Martin-Green from Boston Blue, British actors Shaun Evans and Jodie Whittaker, Succession star Matthew Macfadyen, Norman Reedus from The Walking Dead, and the cast of Midsomer Murders, including Neil Dudgeon and Annette Badland.\n\nAdvertisement\n\nSo what’s going to make noise in 2026? The answer is a broad church of traditional police dramas and comedy/dramas, which range from a sizzling romance in the ice hockey world, to a pastiche of police and food on an exotic island on the coast of Italy. Boston Blue, which will premiere before the end of the year, was the headline grabber, along with 12 more shows that turned up the volume in Cannes. Donnie Wahlberg and Sonequa Martin-Green in Boston Blue. Boston Blue (CBS Studios) The spin-off to the long-running police drama, Blue Bloods, shifts NYPD Detective Danny Reagan (Donnie Wahlberg) to Boston, and a new partnership with Detective Lena Silver (Sonequa Martin-Green) who, like Reagan, comes from an established law enforcement family. Boston Blue landed loud at the market, with its two leads turning heads everywhere they went. In a global market defined by hesitancy, a safe bet is an easy sell. Keke Palmer and Jack Whitehall in The ’Burbs. The ′Burbs (NBC Universal) Based on the much-beloved 1989 cult film about life in a suburban cul-de-sac, this is an eight-episode mystery comedy about a young couple who move into the husband’s childhood home and realise there is more going on in the ’burbs than meets the eye. Written by Celeste Hughey with Seth MacFarlane, and produced by Brian Grazer, it stars Keke Palmer, Jack Whitehall, Julia Duffy and Paula Pell.\n\nAdvertisement\n\nJodie Whittaker and Suranne Jones in Frauds. Frauds (ITV Studios) A new British crime thriller about two former professional partners Bert (Suranne Jones) and Sam (Jodie Whittaker). With a decade in prison behind her, Bert is on the outside and decides to re-team with Sam for one last big heist. Whittaker, a former Doctor Who, gives the series its headline star, and the concept, created by Jones and Anne-Marie O’Connor, gives off major Widows vibes. It’s directed by Giulia Gandini. Simu Liu in The Copenhagen Test. Credit: NBC Universal The Copenhagen Test (NBC Universal) James Wan and Thomas Brandon’s espionage thriller series is set five minutes in the future as first-generation-American intelligence analyst Alexander Hale (Simu Liu) learns his brain has been hacked, allowing the hackers access to everything he sees and hears. Time is ticking for him to flush out the perpetrators. Melissa Barrera, Sinclair Daniel and Brian d’Arcy James also star. Rebecca Gibney and Harry McNaughton (front) in Happiness. Credit: DCD Rights\n\nAdvertisement\n\nHappiness (DCD Rights) A musical comedy series from New Zealand, Happiness is the story of a big-name Broadway director (Harry McNaughton) who returns home and must contend with the fact that despite two decades of ascendancy in New York, he’s back living in his childhood bedroom and helping his mum, Gaye, (Rebecca Gibney) run the local community musical theatre society, Pizazz, which is populated by an enthusiastic, if not talented, crew. The show premieres on HBO Max on November 4. Warren Brown, Beau Gadsdon and Phyllis Logan star in A Taste for Murder. A Taste for Murder (ITV Studios) A sort of cross between high crimes and food porn, this is a British crime drama about a grieving London detective (Warren Brown) who moves with his daughter to the Italian island of Capri. The recipe – inevitably – is murder, and Joe Mottram (Brown) becomes enmeshed in the investigation. The series leans on its astonishing setting, filmed in Italy and Croatia. Hudson Williams and Connor Storrie in Heated Rivalry. Credit: Sphere Abacus\n\nAdvertisement\n\nHeated Rivalry (Sphere Abacus) Two of the ice hockey league’s biggest stars, Shane Hollander (Hudson Williams) and Ilya Rozanov (Connor Storrie), are professional rivals whose fierce competitiveness turns into a magnetic attraction that neither can avoid. A one-night fling turns into a clandestine relationship that is constantly challenged by their rising profiles and the homophobia embedded in professional sport. Matthew Macfadyen, Sian Clifford and O-T Fagbenle promote The Miniature Wife at Mipcom Cannes. Credit: Getty Images Loading The Miniature Wife (Sony Pictures) The marital woes of Lindy (Elizabeth Banks) and Les (Matthew Macfadyen) are laid bare when a technological accident induces the ultimate relationship imbalance: Les remains human-sized, while Lindy is shrunk. A “high-concept marital dramedy”, this gives Honey, I Shrunk the Kids vibes, but comes with a much more solid pedigree. The series also stars Sian Clifford and O-T Fagbenle.\n\nAdvertisement",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/afl/meat-loafs-friend-defends-infamous-gf-show-20220122-p59qc8.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Meat Loaf's friend defends infamous GF show",
        "publish_date": "Fri, 24 Oct 2025 12:18:49 +1100",
        "category": "finance",
        "authors": [],
        "text": "Meat Loaf's friend defends infamous GF show\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/rugby-union/c-mon-just-move-something-the-scary-moment-wallabies-star-feared-he-d-been-paralysed-20251023-p5n4rf.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘C’mon, just move something’: The scary moment Wallabies star feared he’d been paralysed",
        "publish_date": "Fri, 24 Oct 2025 11:59:07 +1100",
        "category": "sports",
        "authors": [
            "Iain Payten"
        ],
        "text": "Save Log in , register or subscribe to save articles for later. Save articles for later Add articles to your saved list and come back to them any time. Got it Normal text size Larger text size Very large text size Noah Lolesio coughs quietly mid-sentence to compose himself. It’s been almost four months, and while Lolesio’s physical scars have healed, he is still working on the emotional ones. “It’s still pretty scary,” he says. “Thinking about that situation.” The “situation” unfolded on a sunny afternoon in Newcastle in early July, where the Wallabies were in the middle of a torrid Test match against Fiji. The fixture was designed to be a cobweb-removing match ahead of the British and Irish Lions series but, unsurprisingly against the spirited Fijians, it was proving tough going. With the prime ministers of both Australia and Fiji sitting among a sold-out crowd, the Wallabies led 15-14 as the game clock neared 60 minutes. The rusty Wallabies felt like they were one try away from clicking, and when captain Harry Wilson spun in a tackle and passed to Lolesio, the click looked on. The five-eighth sprinted towards the try line. “I copped a good offload from Wilso, and had a little line break,” Lolesio recounts. “But then one of the Fijian players tackled me. I sort of twisted onto my back, and I whiplashed the ground pretty heavily with my head.”\n\nAdvertisement\n\nThe ball came loose and Fjii counter-attacked, and with the noisy Fijian fans going crazy, all eyes were on the visitors as they went all the way down the field to score. All eyes, except those of worried staff and family who had their eyes still trained on Lolesio. The 25-year-old had not moved. “When I made the impact to the ground, it was pretty scary because I couldn’t feel anything in my body for probably five to 10 minutes,” he says. “I was trying to move my feet and my toes for first five or 10 minutes, and I was stressing a bit. I was, ‘Oh frick’.” Noah Lolesio makes the break against Fiji, before his injury. Credit: AP Pictures and footage show Lolesio lying stationary on his right side, with his right foot stuck up on top of his left. Medical staff raced onto the field and stabilised his neck. “I was sort of just talking to myself: ‘Come on, just move something’. And I was praying a bit in my mind, too, just hoping everything will be all right,” Lolesio says. ” Within that 10 minutes, then I could slowly start moving my toes. I was like, ‘Oh, thank the Lord’. “Probably people don’t realise how bad it was. But yeah, it was pretty scary.”\n\nAdvertisement\n\nLolesio was taken to an emergency ward, and fears he had suffered a fractured spine were soon allayed. The loss of feeling would turn out to have been caused by a bulging disc that had been troubling Lolesio for a year, and for which he was due to get a cortisone injection the following week. And despite most assuming it was, the injury also wasn’t related to the similarly scary scenes when Lolesio was stretchered off and hospitalised in Perth two months earlier while playing for the Brumbies, also with concerns of a serious neck injury. That ended up being a mid-back strain. Lolesio leaves the field on a medicab in Newcastle. Credit: AP “What the surgeon told me is that I’ve just copped a massive whack to my spinal cord, and it stirred it up big time,” Lolesio says. “The injury itself was pretty tough. But what potentially could have happened from that incident … Yeah, it could have been a lot worse. “The surgeon at Newcastle said, ‘You’re very, very lucky it didn’t turn out differently’. He said I could have ended up in a wheelchair. That’s when it really hit home. It was like, ‘Far out’.” A few days later, Lolesio underwent surgery in Brisbane to remove a disc in his spine, and, with a handful of metal and screws, fuse together the C5 and C6 vertebrae. “It’s a pretty standard surgery,” Lolesio says. “The surgeon did a great job and the rehab’s pretty simple. You just got to let it heal and do its thing.”\n\nAdvertisement\n\nIt was not a career-ending injury, but the surgery ruled Lolesio out of the Lions series and the rest of the Wallabies’ winter campaign. Given he had played almost every Test in the No.10 shirt under Joe Schmidt, that would prove a problem for the Wallabies, who have since cycled through three different five-eighth replacements. And while it was disappointing for Lolesio to miss the Lions series, too, the doctors’ sobering words in Newcastle put things into perspective. “My first instinct was I was just more worried about my health than anything,” Lolesio said. “Rugby I’ve been thinking about a bit more recently, but initially it was more just, man, I’m just so happy I’m able to walk, and be with my family, and just do day-to-day stuff. “After getting a solid run in the Wallabies last year, I felt I was getting really comfortable in my form in the gold jersey. And then the injury happened.\n\nAdvertisement\n\n“So yeah, it was tough to watch the boys play and do well – but at the same time, for me, I’m just happy I’m healthy and able to eventually play again.” Noah Lolesio was the Wallabies’ first-choice five-eighth throughout 2024. Credit: Getty Images Lolesio rehabbed on the Gold Coast and last week booked his ticket to Japan, where he is set to take up a contract with a yet-to-be-officially-named club. It is believed to be Toyota Industries Shuttles Aichi. Lolesio signed the deal last year, electing to broaden his horizons after six years at the Brumbies. “I head over to Japan mid-November and I am really looking forward to it,” he says. Given the seriousness of his injury in Newcastle, and lack of news about his Japan move, many have left Lolesio out of the conversation when it comes to the problematic five-eighth spot for the 2027 World Cup.\n\nAdvertisement",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/healthcare/marissa-would-eat-just-three-things-her-eating-disorder-has-left-her-with-permanent-damage-20251023-p5n4nt.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Marissa would eat just three things. Her eating disorder has left her with permanent damage",
        "publish_date": "Fri, 24 Oct 2025 11:51:52 +1100",
        "category": "lifestyle",
        "authors": [
            "Henrietta Cook"
        ],
        "text": "Rudolph also has young patients who have developed vision impairment due to the condition. Some patients just eat the same three foods every day. “It might seem like an innocuous illness, but it has a profound impact on the entire family,” she says. “Parents may spend hours and hours trying to cook and feed them meals and sometimes these children become so anxious and medically unwell that they disengage from social contact and don’t attend school regularly.” Rudolph says malnutrition can lead to cognitive impairment and anxiety. “It affects all aspects of health – physical, psychological and cognitive.” Rudolph believes that growing awareness of ARFID and increasing incidence is leading to a rise in diagnoses. The eating disorder often coexists with autism, ADHD, anxiety and depression – conditions that are also increasingly diagnosed.\n\nUnlike other eating disorders, people with ARFID don’t restrict their food intake to lose weight or due to body image concerns. They often avoid foods because they don’t like their texture, colour, smell or taste. Some fear food and are worried they will choke or vomit. Jane Rowan, director of Eating Disorders Families Australia, is also a mother to a daughter who experienced an eating disorder. Credit: Dan Peled Over the past two years, Eating Disorders Families Australia has experienced a significant rise in the number of families and carers seeking support for ARFID. It now runs two support groups for families impacted by the eating disorder every month. Many of these families have spent years trying to get a diagnosis. “Families’ concerns are frequently dismissed due to the lack of knowledge around ARFID by medical professionals and the wider community,” says the organisation’s executive director Jane Rowan. Butterfly Foundation head of communications and engagement Melissa Wilson says it can be difficult to work out whether someone has ARFID or is just a fussy eater, particularly in children.\n\n“ARFID will usually manifest in an extreme aversion to or lack of interest in food and is a cause for concern when it affects their ability to meet their energy and nutritional needs, often resulting in weight loss, malnutrition or an inability to maintain growth and development,” she says. Wilson says while many people with ARFID may be underweight due to food restriction, some people maintain a typical or higher weight. She says there is limited research into how to prevent ARFID. While fussy eating normally improves during childhood and adolescence without treatment, people with ARFID require treatment to recover. In Coury’s case, this treatment involved frequent appointments with a psychologist and what’s known as exposure therapy.\n\nOne session revolved around apples, and Coury exposed her senses to apple juice, apple puree, dried apple and freshly cut apple. “We would do a different food every week,” she explains. “First I would look at it, then I might pick it up in my hands, smell it and if I feel courageous, I might lick the food. If I’m really feeling up for it, I might have a mouthful.” Her homework was repeating the sessions at home. Marissa Coury hopes that increased awareness of ARFID will lead to more children receiving early intervention. Credit: Dylan Coker Coury, who lives in Sydney’s southern suburbs and works in health promotion marketing, has lived with ARFID since she was three.\n\nAs a child, her parents tried to get her to eat the same meals as the rest of the family at dinner, but she refused. “They cooked me a separate meal every night,” she recalls. “My mum made this dish where she basically grated vegetables so small that you couldn’t really feel them. I ate that with minced meat and rice.” When she turned 18 and stopped eating her mother’s cooking, her health began to really suffer. “It started with unbearable pain in my feet and it got to the point where I couldn’t walk,” she says. “Then I was reading a book and realised everything was really blurry.”\n\nLoading She was eventually diagnosed with peripheral, optic and auditory neuropathy. This means she has pain in her feet and hands, blind spots in her vision and struggles to hear properly. Coury now eats a more varied diet with some meat, legumes and vegetables. “There are still some foods I don’t think I’m ever going to be able to eat,” she says. “I’m OK with that, because I’m just focusing on getting my nutrients.” She hopes that increasing awareness of the condition leads to more people receiving treatment earlier. “There’s so much hope for kids today because early intervention is key. By the time they’re my age, they may not have ARFID. They may be at a point where they eat a healthy, balanced diet.”\n\nLaura Hart, an associate professor at the University of Melbourne’s School of Population and Global Health, is leading a project to design Australia’s first robust screening tool for eating disorders in children aged 5 to 12. The project is looking to recruit 600 children and their parents to validate the new tool, which will flag potential eating disorders. She says existing screening tools for children were devised before ARFID was recognised and used clunky, impenetrable language. Hart says parents often experience significant anxiety when their child struggles with eating. “This is an illness that needs specialist support,” she says. “It is not the parents’ fault.”\n\nShannon McGlinchey’s son was an adventurous eater until he choked on a piece of paper when he was 18 months old. In a matter of days he went from feasting on an array of dishes including poached salmon, berries and Greek yoghurt to only eating a handful of foods. Loading He stopped eating solid food entirely for six months following the deaths of a relative and friend, a series of stomach bugs and tonsilitis. During this period, he only drank strawberry Up and Go liquid breakfasts and took supplements. He was eventually diagnosed with ARFID. The now six-year-old has since added two-minute noodles, Chicken Crimpy Shapes, strawberry doughnuts and chocolate chip cookies to his diet. The other day he ate a banana and a sausage. “That was a big win,” says McGlinchey, who lives in Melbourne’s south-east.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/culture/live-reviews/soaring-first-nations-meditation-completes-triple-bill-greater-than-sum-of-its-parts-20251023-p5n4qu.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "With spring racing in full swing, this barmy Aussie musical is exactly what we need",
        "publish_date": "Fri, 24 Oct 2025 11:49:17 +1100",
        "category": "entertainment",
        "authors": [
            "John Shand",
            "Joyce Morgan"
        ],
        "text": "Steve Kramer has created a thing of beauty. Phar Lap is everything you’d expect from the Hayes – irreverent, funny, slightly chaotic – but the elegant story-telling, lovable characters and electric performances take it to the next level. No long faces here. JAZZ\n\nHIROMI featuring PUBLIQUARTET\n\nCity Recital Hall, October 24, festival until November 2\n\nReviewed by SHAMIM RAZAVI\n\n★★★★ This year’s Sydney International Women’s Jazz Festival promises not only to thrill crowds but also to educate them on the expanding boundaries of the genre, if its opening night’s pairing of Hiromi’s jazz piano with the classical chops of New York’s PUBLIQuartet is anything to go by. Hiromi plays in both senses of the word – her virtuosic ability is never in question but she engages with her instrument not with reverence but as an extension of her restless, playful character. From her opening solo, with its nimble echoes of Blue Rondo à la Turk, to her rolling, repeating cadenzas – often standing up and reaching into the piano to pluck or buzz the strings – Hiromi takes technical accomplishment and literally jazzes it up. Jazz pianist Hiromi in action. Credit: Shane Rozario\n\nThat use of the piano’s full capabilities beyond the keyboard, paired with the audible sighs and inhalations that punctuate her phrasing, recalls Keith Jarrett’s total-body immersion in the music, though Hiromi’s version feels more exuberant than his solemnity. The collaboration with PUBLIQuartet builds on that same physical energy: their classical discipline tempers her improvisational daring, each shaping the other in real time. The night’s centrepiece was Hiromi’s COVID-composition Silver Lining Suite, whose four movements follow our collective journey from Isolation to, or perhaps through, Fortitude. It is a work that depends on, and allows, the Quartet to really shine. Jannina Norpoth’s chopping, deliberately niggling violin and Hamilton Berry’s mournful cello lines evoke the seemingly endless stasis we all endured, while Hiromi’s piano captures those flashes of unexpected joy among our sadness. Written in lockdown, it finds added meaning when performed in this sold-out, rafters-packed hall. It was followed by a breezier, but no less clever, reading of Blackbird. Picking up on the Beatles’ acknowledgement that their song was inspired by Bach’s Bourrée in E minor, Hiromi seamlessly spliced in lines of Jesu, Joy of Man’s Desiring, the combination epitomising the night’s jazz-classical conversation with humour and grace. Hiromi solo can stray into weightlessness; with PUBLIQuartet beside her, she finds just enough gravity to turn exuberance into substance.\n\nMUSIC\n\nSAMARA JOY\n\nRichard Bonynge Concert Hall, October 23\n\nReviewed by JOHN SHAND\n\n★★★★ Samara Joy came out and told us that although she was recovering from a cold, she’d rather sing a few notes for us than none. Compromised she was, in range, volume and breath control. She avoided introducing songs or band members, and only performed for 45 minutes rather than the scheduled 90. This, perhaps, was the peril of long-haul flights when your instrument is your voice. Samara Joy. Credit: AB+DM The American’s misfortune makes the concert tricky to review. From what I’d heard on record and YouTube, Joy is a candidate for being the most complete jazz singer since Sarah Vaughan. But if we couldn’t experience the full glory of her tone and range, we could still relish her phrasing, notably on the bittersweet A Beautiful Friendship, which also gave hints of her ingenuity and astuteness in embellishing a melody. On this basis, she’d be frightening when fully well. A testament to her status is that she brought a septet all the way to Australia: four horns, piano, bass and drums. It was fascinating, though, to hear this take on jazz the night after the Bill Frisell Trio. Where the latter was all about collective creativity while still having effortless precision, Joy’s band put a premium on being well-drilled.\n\nThat is not intended as a criticism, as to play such challenging and inventive arrangements (which I believe come from within the band, but with Joy unable to tell us, I can’t be sure) so consummately demands exemplary musicianship. Curiously, many of the new wave of exceptional jazz singers draw heavily on pre-1960s jazz (as Wynton Marsalis has prescribed for decades), rather than revitalising the idiom, which is what their idols did. As good as trumpeter Jason Charos, tenor saxophonist Kendric McCallister and alto saxophonist David Mason were, trombonist Donavan Austin stood out, starting his solo on A Beautiful Friendship with a soft, marshmallow-sweet sound, and using it to play with a 1930s mellifluousness. Bassist Paul Sikivie, drummer Evan Sherman and especially the pianist Connor Rohrer, meanwhile, made for a propulsive engine room. Given Joy’s constraints, I actually derived more pleasure from the opening set by local singer Kristin Berardi and bassist Sam Anning. With Berardi now based in Switzerland, they hadn’t played together for some time, and, presumably at short notice, found themselves obliged to perform for an hour rather than 30 minutes to flesh out the event. It’s a brave format for both parties, with no chord instrument or drummer providing sonic shelter, and yet I’ve never heard either sound better – and Berardi’s as good a singer and Anning as good a bassist as Australia’s produced. The songs they played, whether originals or standards, were actually enhanced by being stripped down in this fashion. The pair improvised and interacted with unbounded flair, good humour and – the sacred element missing from too much jazz – passion. Samara Joy also plays the City Recital Hall on October 24.\n\nDANCE\n\nSYDNEY DANCE COMPANY: CONTINUUM\n\nRoslyn Packer Theatre, October 22, until November 1\n\nReviewed by CHANTAL NGUYEN\n\n★★★★½ A strong triple bill is greater than the sum of its parts. Sydney Dance Company’s Continuum hits that high note, featuring an exciting line-up of heavyweights: Stephen Page, William Barton, Rafael Bonachela, and the up-and-coming Tra Mi Dinh. Their artistic voices are distinct in style, but the gorgeous commonality is that each is artistically mature and can evoke a sophisticated, satisfying artistic vision. First off the ranks is a dance by the home team: artistic director Rafael Bonachela’s Spell. It’s structured into five chapters, “each a vivid ‘spell’ that creates dance alchemy”, Bonachela explains. A scene from the dance work Spell, showing as part of the Sydney Dance Company show Continuum. Credit: Daniel Boud While the through-line between each segment is not always clear, the spinning athleticism of Bonachela’s aesthetic and SDC’s god-like dancers never disappoint.\n\nA highlight is the last ‘spell’, a duet for a male and female dancer, performed in a towering cone of red light and mist (Damien Cooper’s lighting and Kelsey Lee’s set). Visually striking, it also packs a searing emotional punch. A scene from Somewhere between ten and fourteen. Credit: Daniel Boud Next comes Tra Mi Dinh’s Somewhere between ten and fourteen, an exploration of the period between day and night, with the dancers dressed in a spectrum of dreamy, saturated blue shades (Aleisa Jelbart’s costumes). First seen in SDC’s 2023 New Breed season, Dinh has reworked this rendition for a larger ensemble. The result is intelligent and polished, with the choreography transitioning seamlessly between a robust, pulsing energy danced in sneakers and smooth, spinning sequences danced barefoot. A scene from the dance work Unungkati Yantatja – one with the other, a multidisciplinary collaboration between choreographer Stephen Page and leading yidaki (or didgeridoo) player William Barton. Credit: Daniel Boud\n\nThe evening peaks with a soaring First Nations meditation on the spirit of creation breath: Unungkati Yantatja – one with the other, a multidisciplinary collaboration between choreographer Stephen Page and leading yidaki (or didgeridoo) player William Barton, who composed the music and performs centre stage along with the classical new music artists of the Omega Ensemble. Loading Barton’s musicality and mere stage presence is nothing short of magnetic. A towering figure in a feathery cloak (Jennifer Irwin’s magnificent costuming), his didgeridoo playing speaks with the command of an ancient, evocative voice talking from the edge of the human world. And when singing, he seems to be calling the very dancing into being. The combination – on just one stage – of Barton’s presence, Page’s masterful choreographic instincts, and the artistic excellence of the SDC dancers and Omega Ensemble is almost an embarrassment of riches. THEATRE\n\nFly Girl\n\nEnsemble Theatre, October 22, until November 22\n\nReviewed by HARRIET CUNNINGHAM\n\n★★★★½ Two air hostesses, dressed in orange slacks and matching hats, unroll a line of tape across the stage of the Ensemble Theatre. It’s the line that marks the limits of where a woman can go in 1970s Australia.\n\nFly Girl is the story of Deborah Lawrie, the first woman in Australia to become a commercial airline pilot. It’s a sprawling tale, part memoir, part courtroom drama, about the pitched battle between a talented 25-year-old pilot who happens to be a woman, and the rusted-on prejudice of pioneering businessman Sir Reg Ansett. Genevieve Hegney and Catherine Moore in Fly Girl. Credit: Prudence Upton In 1976 Lawrie, who has her first flying lesson at 15 and has 1600 flying hours under her belt, applies to join the pilot training program at Ansett. Despite impressing selectors at two interviews and passing the psychological test with flying colours, Lawrie is rejected. In 1978 she takes her case to the newly established Victorian Equal Opportunity Board and becomes the complainant in the Australia’s first sex discrimination in employment case. Spoiler alert: she wins. But not without an ugly fight. Playwrights Genevieve Hegney and Catherine Moore bring this epic tale to the Ensemble stage with humour, joy and just the right amount of bite. The action moves fast, in short scenes, cutting cinematically between Lawrie’s home and family, the control tower, the flying school, the courtroom and the economy cabin of a domestic flight. An airport flicker board suspended above the stage keeps track of where and when we are.\n\nGenevieve Hegney, Alex Kirwan, Cleo Meinck and Emma Palmer in Fly Girl at the Ensemble Theatre. Credit: Prudence Upton Everything else – including over 50 characters – is up to the cast of five, directed with ingenuity by Janine Watson, aided by a stirring soundtrack (Daniel Herten) and a treasure trove of 1970s costumes (Grace Deacon). Sex is delightfully irrelevant: Alex Kirwan doubles as Lawrie’s father, then Lawrie’s husband, but also dons a red wig and orange slacks to become Helen, the tearful 27-year-old Ansett hostie on her last flight before she ages out of the job. Meanwhile, and with delicious irony, Genevieve Hegney switches between a strutting Reg Ansett, a pregnant and therefore unemployed solicitor, and TV reporter Pamela Graham. Catherine Moore juggles hats, moustaches and lunch trays with aplomb and Emma Palmer is richly comedic as barrister John Dwyer. Through this all, newcomer Cleo Meinck creates a touching portrayal of the young Lawrie, passionate about flying and buffeted by prejudice. Fly Girl is a commission from Ensemble Theatre artistic director Mark Kilmurry who, after the success of How to Plot a Hit in Two Days, continues to tap the rich vein of nostalgia for iconic cultural moments.\n\nThe script leans into the gloriously unselfconscious sexism of 1970s Australia, where women become “old boilers” after 21 and menstruation is a mental illness. But period observations aren’t just for laughs: the production builds in power across the second act, and as Lawrie’s fight plays out in court, we see the ripples of change coming for traditional female roles. THEATRE\n\nSHIRLEY VALENTINE\n\nTheatre Royal, October 22, until October 26\n\n★★★\n\nShirley Valentine is in a rut. She’s not so much climbing the walls as talking to them. Her claustrophobic kitchen with its florid wallpaper can barely contain the big personality that is Natalie Bassingthwaighte’s Shirley Valentine, a woman straining to break free. Natalie Bassingthwaighte as Shirley Valentine. Credit: Brett Boardman\n\nWithin her cramped confines, and lubricated by a glass or three of riesling, the middle-aged Liverpool housewife overshares and wisecracks about her life, marriage, kids and clitoris. What happened to the adventurous Shirley Valentine she used to be before she became Mrs Joe Bradshaw? Will she have the guts to go to Greece for a holiday with the friend who has bought her a ticket? The answers are probably best known to audiences through the popular 1989 film adaptation with Pauline Collins. Bassingthwaighte is a firecracker of a Shirley in this one-woman touring show. She’s funny, capricious and insightful as she navigates her character’s transformation and the shifts from humour to pathos and back again. I saw the first London season of Willy Russell’s play in 1988. It was thrilling to see a story rooted in my home city that put the hopes and dreams of a mature working-class woman centre stage. She felt like our mothers, aunts, neighbours. Shirley’s candour and wit felt as innovative then as Phoebe Waller-Bridge’s Fleabag (which started life as a play) did more recently.\n\nWhat strikes me seeing the play again after so long is how, beneath the laughs – and there are many – are shards of a darker tale of coercive control than I recall. Loading It’s this aspect that director Lee Lewis has teased out in her thoughtful production. We see Shirley’s jocular demeanour turn twitchy and anxious as she hears Joe arriving home. Her line about being beaten and battered is delivered with sufficient ambiguity to leave you questioning whether she’s not merely talking metaphorically. And when Shirley says she knows she’ll pay for running away to Greece when she returns, the sense of menace is inescapable. It’s clear that Shirley’s flagging confidence didn’t begin – or end – with marriage to her controlling husband, who expects his egg and chips on a plate the moment he walks through the door. There was the headmistress who predicted Shirley would never go far. There’s the grown-up daughter who returns home expecting Shirley to again tend her every need.\n\nThe odds have long been stacked against Shirley. The polymath Russell (he’s also a musician, painter and former hairdresser) threads lively tales of other women in Shirley’s life, including of her neighbour Gillian, one of several minor character Bassingthwaighte convincingly creates. The Liverpool accent wobbles, and at more than two hours the pieces sags in the run-up to interval. The shorter second half is set in Greece, in which Simone Romaniuk’s set uses the entire stage, and is sunnier in tone and appearance. Nearly four decades on, a stay-at-home housewife is a less common figure than she once was, and jetting off to Greece a lot less daring. Nonetheless, it’s impossible not to cheer as this spirited Shirley discovers the world beyond her walls.\n\nMUSIC\n\nBILL FRISELL TRIO\n\nCity Recital Hall, October 22\n\nReviewed by JOHN SHAND\n\n★★★★½ There are nights in the Blue Mountains when you gaze at the night sky with all the wonder of a child’s eyes. Hearing the Bill Frisell Trio is like that. A deep sense of mystery pervades the music, with notes from Frisell’s guitar flaring, glittering and then fading, to be replaced by fresh improbabilities. Jazz guitarist Bill Frisell (centre) with the other members of his trio, drummer Rudy Royston (right) and bassist Thomas Morgan (left). Credit: Matthew Septimus Rudy Royston’s drumming is no less mysterious. Few people have played the instrument with a musicality so complete that he could solo with brushes on a slow ballad, and have at least as much of substance and relevance to say as Frisell or that master of understatement, bassist Thomas Morgan.\n\nMany others, from Pharoah Sanders all the way to Arvo Part, have made mysterious music, but few, aside from the late trumpeter Lester Bowie, combined that quality with such goofy playfulness. There were times during this concert when it was like watching three children utterly absorbed in the same sandpit. This is among the great jazz bands in its combination of personalities, sounds, ideas and interaction. They second-guess and surprise each other in equal measure, while often playing with candlelit intimacy, as if we’re eavesdropping on conversations that are no less private for being musical. There’s astonishing detail in the crafting of sounds and precision in the blending of them. Whereas last time they were here, in 2019, they played songs from the screen-music-oriented When You Wish upon a Star (which tended to be rowdier and larger than life), here, concentrating on material from the Valentine album, they were closer to the art of the miniaturist, and the exceptional sound mixing allowed you to catch the infinite subtleties emanating from all three instruments. They opened with flurries of arrhythmic notes, that, like random filings suddenly being attracted to a magnet, solidified into a blues: Frisell’s Thelonious Monk-influenced title track from Valentine. His playing was typically idiosyncratic in its sweet and sour harmonies, while Royston had the drums and cymbals singing, and Morgan growled and prowled around the lurching, swinging groove with the minimum of notes. The compositions segued into one another, whether blurring where one stopped and another started, or with bold leaps of contrast. The commonality was seemingly infinite options, from the gentleness and naivety of a nursery rhyme, to howling guitar against a jolting backbeat. Always the music was in flux – ranging all the way to Johnny Mercer’s I’m an Old Cowhand (from the Rio Grande), which they played with contagious fun. But, as with Burt Bacharach’s What the World Needs Now Is Love, there was no hint of satire; rather a celebration of these songs’ innate beauty, which somehow came into sharper focus without the distraction of lyrics.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/lifestyle/health-and-wellness/breast-implants-are-getting-smaller-it-s-not-a-win-for-body-acceptance-20251024-p5n4yj.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Breast implants are getting smaller. It’s not a win for body acceptance",
        "publish_date": "Fri, 24 Oct 2025 11:45:00 +1100",
        "category": "lifestyle",
        "authors": [
            "Amber Ferguson",
            "Samantha Chery"
        ],
        "text": "Those who have had explants often frame it as a broader shift away from the “boob job era” of the 1990s and 2000s, reclaiming their autonomy from a cultural moment that idolised hyper-augmented bodies. Alka Menon, an assistant professor of sociology at Yale University, describes how social media has accelerated these beauty cycles and makes trends turn faster. “What took decades to shift from Marilyn Monroe to Kate Moss now happens in a few years. The algorithm determines what version of beauty you’re exposed to,” Menon says. “Cosmetic surgery moves on a trend model. Minimalism is the name of the game now.” In the 1990s, Garth Fisher was one of the notable plastic surgeons performing breast augmentations for Playboy models. At the time, Pamela Anderson, Carmen Electra and Anna Nicole Smith graced its pages with cleavage that would be described as anything but minimalist. Playboy “had such a tremendous and profound impact on culture and how girls wanted to have their breasts look”, Fisher says. Now, after 30 years in the business and more than 23,000 breast surgeries, Fisher has noticed fewer of his clients seeking “Playboy playmate” or “Penthouse pet”-sized implants. Loading “It’s really no surprise to me that for a time, breast implants were hugely popular, but they’ve lost their appeal,” says Victoria Pitts-Taylor, chair of Feminist, Gender and Sexuality Studies at Wesleyan University. “They’ve become over-present, passé and they’re not compatible with wellness and detoxifying lifestyles people are moving toward.”\n\nTim Neavin, the Beverly Hills plastic surgeon who performed Milano’s breast implant removal, says that over the past five years, he’s seen more and more women decide to downsize or remove their implants. Some ask to remove their implants after experiencing fatigue, headaches, rashes, joint pain or brain fog – symptoms associated with what’s been called “breast implant illness”. For others, it’s simply a change in taste, with women feeling like the implants “don’t belong on their body any more”, he says. Many opt for a fat transfer, which involves moving fat from other parts of the body, like the hips or abs, and injecting it into the breast area. Beverly Hills surgeon Cat Begovic has seen a huge increase in women specifically asking for the fat transfer procedure over implants which will give only a subtle increase in volume to the chest and at most will increase one’s breast by one cup size. “It’s something that I do all the time. I think probably in the last month, I’ve done probably four fat transfers to the breast, and they were all very fit, lean patients. They were extraordinarily happy just because they wanted to still be in the same bra size but just be a little more filled,” Begovic says. She adds that implants are “not a lifetime device. Especially if we’re talking about silicone implants. It’s definitely recommended to do a replacement somewhere around 10 years, just because statistically, the rupture rate at 10 years is around 16 to 18 per cent”. Patients come to Boston-based plastic surgeon Sean Doherty with pictures of actor Kate Hudson more than anyone else. “I feel like women in their 40s really always admired her breasts, and people like that ‘yoga breast’ look and want that natural enhancement,” Doherty says. On the opposite side, he says his younger patients usually bring in pictures of influencer Alix Earle, who has been open about her saline implants.\n\nLoading Despite more advanced techniques, bigger implants still tend to come with a slightly greater risk for complications, says Reza Nassab, a plastic surgeon in England. Meanwhile, the “ballerina boob job” and Motiva Preservé – a minimally invasive breast augmentation that requires only light sedation – have become trendier. Nassab says some of his swimwear model patients came to his office to downsize their implants as they set their sights on more high-end fashion opportunities. Pitts-Taylor says individual motivations like rejecting objectification can coexist with larger cultural shifts that still reinforce beauty norms. “Even as women like Pamela Anderson or Alyssa Milano resist objectification, they’re still asked to account for their choices. Pamela goes without make-up and has to address it. Milano removes implants and discusses it publicly,” she says. “I think that speaks to the continued pressure on women’s bodies, the commodification and commercialisation of appearance that isn’t lessening simply because the aesthetic is turning more ‘natural’.”\n\nThere’s pressure to have a more prominent chest or to have a slimmer physique, but there’s also pressure on women to explain how society’s noise can inform their very personal medical decisions. Celebrities such as Kylie Jenner (seen at the 2025 Met Gala) have been open with fans about the details of their breast augmentations. Credit: Getty Images Nowadays, celebrities are less coy about their surgeries. Take, for instance, when TikToker Rachel Leary pleaded with Kylie Jenner to share her breast surgery details: “To me, you have got what I am looking for to have done in terms of a boob job,” Leary says in the video posted in June. “It’s the most perfect, natural-looking boob job ever.” Jenner replied: “445 cc, moderate profile, half under the muscle!!!!! silicone!!! garth fisher!!! hope this helps lol.” By August, Leary was shaking hands with Fisher, whose “incredible skillage” led to Leary walking away with her own “masterpieces”.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/culture/art-and-design/from-demon-hunters-to-pennywise-and-wednesday-addams-here-are-the-costumes-everyone-will-be-wearing-this-halloween-20251020-p5n3qm.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "From demon hunters to Pennywise and Wednesday Addams, here are the costumes everyone will be wearing this Halloween",
        "publish_date": "Fri, 24 Oct 2025 11:30:00 +1100",
        "category": "finance",
        "authors": [
            "Nell Geraets"
        ],
        "text": "Save Log in , register or subscribe to save articles for later. Save articles for later Add articles to your saved list and come back to them any time. Got it Normal text size Larger text size Very large text size The spooky season has taken hold in Australia. Despite once being considered an “American holiday”, Halloween will be celebrated by one in five Australian adults this year, according to the Australian Retailers Association. And an estimated $500 million will be shelled out on Halloween costumes, decorations and confectionaries across the country – 11 per cent more than last year. About 43 per cent of that budget will be spent on costumes, from skeletons to sexy nurses. But as popular as the classics are, an increasing number of Australians are opting for costumes that say something about themselves, whether that’s their favourite show or a meme they can’t stop quoting. “For many, it’s not just about dressing up. It’s about creating a moment, a memory or a character that feels cinematic,” says Alicia Slater, co-owner of Little Shop of Horrors Costumery in Mornington, south-east of Melbourne. Some classics never die: Louise Mack, co-owner of Little Shop of Horrors Costumery, will lean into the spookiness as The Exorcism’s Regan this year. Credit: Alex Coppel Slater says Wednesday Addams has been a popular choice following the recent second season of the TV series Wednesday, and Pennywise costumes have already sold out ahead of the It prequel series Welcome to Derry. The popular Melbourne run of The Beetlejuice Musical has also inspired an influx in Lydia Deetz and Beetlejuice requests. It’s similar in Sydney, where Netflix sensation K-Pop Demon Hunters dominates costume wish-lists. Sydney Party Decorations manager Neo Cui says they’ve sold out of Demon Hunters costumes multiple times, and are now restocking weekly. “Halloween has evolved into one of the biggest annual carnival-style celebrations,” Cui says. “It’s become about self-expression ... not just about being scary,” Cui says.\n\nAdvertisement\n\nThe fear-factor hasn’t vanished, though. Belinda Marsh, director of Sydney’s Fancy That Costumes and Balloons, says spooky costumes will always be a staple, including Ghostface, Freddy Krueger and The Exorcism’s Regan. “Any costume can be turned into a scary Halloween costume. Add some special FX make-up, and you’ve zombified whatever it was ... One of my favourites was a young boy last year who went as a ‘Boo-nana’ – our giant banana costume plus scary make-up,” Marsh says. Jessica Robinson from Fancy That Costumes and Balloons knows that K-Pop Demon Hunters will be all over Halloween this year, so she’s jumping on the pop-cultural bandwagon. Credit: James Brickwood Her store has also sold many Donald Trump MAGA hats this year. Though Trump-related costumes slowed after he reclaimed the US presidency, Marsh says mocking the MAGA phenomenon now could make it “a little less heavy” for some. Bald caps have also become a bestseller thanks to Pitbull’s recent Australian tour. Beyond this, Marsh says major productions such as Wicked and The Bad Guys, and sentimental favourite The Rocky Horror Picture Show, which had its 50th anniversary this year, have been popular choices. So, if you’re keen to stand out this Halloween, here are some tips. Astronaut Katy Perry\n\nAdvertisement\n\nRemember when Katy Perry, along with five other women, went on an 11-minute space flight? It was all anyone could complain about in April. Jeff Bezos’ all-female Blue Origin voyage was hit-and-miss when it came to what it would do for feminism, but that doesn’t mean it can’t make for a brilliant ’stume. Just look at that form-fitting blue spacesuit. Katy Perry went to space. Yes, that is something that actually happened this year. Credit: Instagram (@katyperry) The Coldplay jumbotron It has presumably been a surreal year for Andy Byron, the former chief executive of tech company Astronomer, who resigned from his post after being caught cosying up to someone who was not his wife on the jumbotron at a Coldplay concert in July. But one person’s nightmare was the world’s pop-culture catnip. For months, this random CEO’s love life was a regular dinner-table discussion, so why not bring it back for Halloween by dressing up as the very jumbotron screen that brought the story to light? Peekaboo, we see you. Credit: TikTok/@instaagrace\n\nAdvertisement\n\nA labubu If you haven’t seen a labubu yet, you’re probably living under a rock. Every second person appears to have one of these little monstrosities clipped to their bags, the demonic, toothy smiles taunting whoever is walking behind it. These are the talk of the town among Gen Z, who feverishly try to snatch up the rare versions before they sell out (they’re almost always sold out) and sniff out the fakes or “lafufus”. What fresh hell are they? They’re labubus, of course – Gen Zs new favourite obsession. Credit: Getty Images Chuck on a onesie, paint an ungodly smile on your face, and you’re set. Chicken jockey A lethal zombie baby riding a chicken. Yes, that is where popular culture is at right now.\n\nAdvertisement\n\nLoading Much to the chagrin of cinema staff, the chicken jockey – a popular meme among Minecraft fans – in A Minecraft Movie invited insane reactions from crowds, including screaming, throwing popcorn and toilet paper, dancing and jumping on friends’ shoulders. One person even brought an actual live chicken. You can either buy or create your own chicken jockey suit (to be worn alone or with someone else), or dress your dog up as a chicken with a little plush zombie on its back. The Summer I Turned Pretty love triangle Seventy million viewers tuned in to watch the final season of this Amazon Prime romance flick within its first 70 days of streaming. There were watching parties around the world, and friendships were lost over debates around who Belly should choose. So yeah, you could say it was a big deal. When it comes to dressing up as the show for Halloween, I don’t mean dress up as Belly or Jeremiah. That’s boring. I mean dress up as the literal love triangle. Slap a triangle on a white shirt with the printed-out faces of Belly, Jeremiah and Conrad at the end of each point, and call it a day.\n\nAdvertisement",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/nsw/northern-beaches-hospital-is-in-public-hands-here-s-what-happens-next-20251022-p5n4e7.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Northern Beaches Hospital is in public hands. Here’s what happens next",
        "publish_date": "Fri, 24 Oct 2025 11:30:00 +1100",
        "category": "finance",
        "authors": [
            "Angus Thomson"
        ],
        "text": "Save Log in , register or subscribe to save articles for later. Save articles for later Add articles to your saved list and come back to them any time. Got it Normal text size Larger text size Very large text size Late on Tuesday, after Premier Chris Minns went on morning radio to announce the end of the private ownership model at Northern Beaches Hospital, an email landed in the inboxes of more than 19,000 Healthscope staff across Australia. It was from chief executive Tino La Spina, thanking them for their work amid “external noise and impending change”. He defended the hospital’s performance under Healthscope, and took a parting swipe at the Minns government. “For any partnership to work it must have goodwill on both sides,” he wrote. “Sadly, the political will does not exist and it is in this context we are returning the hospital.” The deal may be done in principle, but there are still many questions about how the hospital will operate under public control. Here, we break down just a few. The news Healthscope, which went into receivership in May with $1.6 billion in debt, will receive $190 million from NSW taxpayers to exit its contract to operate the hospital until 2038. The 494-bed hospital will be integrated into the state’s public health system under the direct control of the Northern Sydney Local Health District, which oversees other major public healthcare services, including the Royal North Shore Hospital.\n\nAdvertisement\n\nAll doctors, nurses, and support staff will be offered jobs by NSW Health to continue working at the hospital. Why did the NSW government take control? Locals have campaigned against the private ownership model since it was first unveiled in 2013. Several high-profile incidents in the hospital’s first year, including one in which a cancer patient had the wrong side of his colon removed, did little to inspire the community’s confidence. Labor campaigned against the public-private partnership in opposition but remained committed to the contract in government, even when Healthscope’s finances worsened and the company offered to hand back the hospital 14 years earlier than planned. The Massa family’s campaign following the death of their two-year-old son Joe, and Healthscope’s worsening financial outlook, ultimately forced the Minns government to act. What it means for patients\n\nAdvertisement\n\nAll 494 beds at the hospital will be fully integrated into the public system, something multiple inquiries and audits found to have been complicated by the public-private partnership. The hospital will also benefit from the nurse-to-patient ratios rolling out at all public hospitals in the state. What it means for more than 130,000 northern beaches residents with private health insurance is less clear. About 180 beds were reserved for private patients under the previous model, and the hospital performs about 20,000 private elective surgeries every year. Some doctors argue the public-private model allows the hospital to provide public patients with treatments that wouldn’t be possible otherwise. The hospital’s angiography and around-the-clock heart attack services, for example, could become unviable without the high volume of elective angiography funded privately, the hospital’s director of cardiac services told a parliamentary inquiry last week. By the numbers Taxpayers will pay $190 million to take over the hospital. Minns said on Tuesday the original contract included a potential exit payment to Healthscope “ north of $800 million ”.\n\nto take over the hospital. Minns said on Tuesday the original contract included a potential exit payment to Healthscope “ ”. The hospital has capacity for 494 beds . About 180 beds are currently reserved for private patients.\n\n. About are currently reserved for private patients. There were 132,491 people with private health insurance on the northern beaches in 2022, according to the Australian Bureau of Statistics. Industry group Private Health Australia estimates as many as 79 per cent of the northern beaches population is covered by health insurance. What they said\n\nAdvertisement\n\nWhat’s next The formal transition of the hospital will begin next month, La Spina said in his email to staff. The government expects to take full control by mid-2026. Binding legal and commercial terms still need to be finalised, and the government said it still retains the option to terminate the contract through legislation introduced to parliament this year. Minns did not say how the hospital would actually operate under the new arrangement, but the government will consult doctors and other staff to determine future clinical services and an operating model, “including the role of private services in the hospital footprint”. Loading Tuesday’s announcement blindsided many doctors treating both public and private patients at the hospital. At a meeting of more than 60 medical staff on Thursday night, many said they were already making plans to leave, while others resolved to publicly campaign against the decision, three doctors unauthorised to speak publicly said. “It’s fair to say that there was a lot of anger and disappointment in the meeting … we think this is a very poor decision that has been driven by politics and ideology,” one doctor said. The unions representing nurses, midwives, and salaried doctors all welcomed the hospital’s public takeover, and said they would work with the government to address long-standing understaffing, overwork and exhaustion issues.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/goodfood/recipes/quick-tasty-zero-mess-20-simple-ways-to-make-pasta-magic-in-under-30-minutes-20251014-p5n2hn.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Quick, tasty, zero mess: 20 simple ways to make pasta magic in under 30 minutes",
        "publish_date": "Fri, 24 Oct 2025 11:29:18 +1100",
        "category": "sports",
        "authors": [],
        "text": "Recipe collection\n\nQuick, tasty, zero mess: 20 simple ways to make pasta magic in under 30 minutes\n\nThe winning formula for World Pasta Day? Keep it fast, keep it flavourful, and keep the cleanup minimal with these essential recipes.",
        "source": "SMH"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/new-us-eu-sanctions-aim-to-pressure-russia-towards-ceasefire/3h335j2xk",
        "title": "New US, EU sanctions aim to pressure Russia towards ceasefire",
        "publish_date": "Fri, 24 Oct 2025 01:49:20 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/aukus-and-an-awkward-moment-what-it-was-like-in-the-room-for-albaneses-dream-run-with-trump/gno6pc4re",
        "title": "AUKUS and an awkward moment: What it was like in the room for Albanese's 'dream run' with Trump",
        "publish_date": "Thu, 23 Oct 2025 20:00:00 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/wfh-rights-the-rbas-take-on-critical-minerals/q25npmocn",
        "title": "WFH rights & the RBA's take on critical minerals",
        "publish_date": "Thu, 23 Oct 2025 19:50:36 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/new-sanctions-on-russia-from-the-us-and-eu-over-ukraine-morning-news-bulletin-24-october-2025/z3z1u2n0e",
        "title": "New sanctions on Russia from the US and EU over Ukraine | Morning News Bulletin 24 October 2025",
        "publish_date": "Thu, 23 Oct 2025 19:19:49 +0000",
        "category": "sports",
        "authors": [],
        "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nIn this bulletin;\n\n\n\nRussia says it will never bow to pressure from the US following sanctions;\n\nTwo Optus chief executives to leave the telco next year;\n\nAnd in cycling, Australia wins two medals in the World Track cycling championships in Chile.\n\nUnited States President Donald Trump has imposed Ukraine-related sanctions on Russia for the first time in his second term, a day after cancelling a meeting with Russian president Vladimir Putin.\n\n\n\n\n\nRussia's major oil companies have had sanctions imposed, and the US Treasury department says it's prepared to take further action.\n\n\n\n\n\nEuropean leaders have agreed on a new raft of sanctions against Russia targeting its shadow fleet of oil tankers and banning its imports of liquefied natural gas.\n\n\n\n\n\nEuropean Union Foreign Policy Chief Kaja Kallas says the EU is pleased to receive signals from the US about support for Ukraine.\n\n\n\n\n\n\"Russia is responsible for the damages caused in Ukraine and has to pay for those damages and the frozen assets we have and the reparations loan on the basis of that for Ukraine to defend itself. It sends three very important signals. One is to Ukraine, that we are supporting them to defend themselves. The other one is to Russia, that they can't outlast us. And the third one to America, to show that we are taking very important steps ourselves.\"\n\n\n\n\n\n—\n\n\n\n\n\nUnited States Vice President JD Vance has criticised a symbolic vote in Israel's parliament about annexing the occupied West Bank, saying it goes against Trump administration policies.\n\n\n\n\n\nThe Knesset narrowly passed a preliminary vote in support of annexing parts of the West Bank, pushed by its hard-liners — some of whom were upset over the ceasefire and the security sacrifices it required of Israel.\n\n\n\n\n\nA statement from Prime Minister Benjamin Netanyahu's office says the vote is a deliberate political provocation by the opposition to sow discord.\n\n\n\n\n\nAs he was leaving Israel, Vice President Vance described it as insulting.\n\n\n\n\n\n\"I mean, look, if it was a political stunt, it was a very stupid political stunt. And I personally take some insult to it. The West Bank is not going to be annexed by Israel. The policy of the Trump administration is that the West Bank will not be annexed by Israel. That will continue to be our policy. And if people want to take symbolic votes, they can do that. But we certainly weren't happy about it.\"\n\n\n\n\n\n—\n\n\n\n\n\nThe head of a humanitarian organisation in Sudan has condemned the killing of one of her aid workers and called on the warring parties to respect international law.\n\n\n\n\n\nThe civil war in Sudan has been raging for two and a half years now and has generated the largest humanitarian crisis on the planet.\n\n\n\n\n\nReena Ghelani, CEO of humanitarian group Plan International, says it's incredibly risky working to deliver aid to active war zones.\n\n\n\n\n\n\"We had a colleague of ours killed in North Darfur. We've had offices that have been looted and hit by military action, El Fasher was one. Luckily we got our colleagues out just before. So, it's highly risky and — in fact —150 aid workers plus have lost their lives in the Sudan war. We actually need all the warring soldiers and armies protect aid workers and let them pass through safely.\"\n\n\n\n\n\n—\n\n\n\n\n\nTwo chief officers at Optus have resigned following the two Triple-Zero outages in recent months, one linked to four deaths.\n\n\n\n\n\nThe company's Chief Financial Officer and board director Michael Venter and Chief Information Officer Mark Potter are to leave Optus in March.\n\n\n\n\n\nOptus chief executive Stephen Rue says the announced departures follow long-term and open discussions.\n\n\n\n\n\nIn September, a firewall update caused an outage which prevented over 600 calls from connecting to emergency services in South Australia, the Northern Territory, Western Australia and some parts of New South Wales.\n\n\n\n\n\n—\n\n\n\n\n\nEnvironment Minister Murray Watt has defended the government's proposed environment laws after concerns raised by the Coalition and the Greens.\n\n\n\n\n\nThe government's long-awaited rewrite of the Environment Protection and Biodiversity Conservation Act has been criticised by the Greens as going too soft on polluters, and by the Opposition as too hard on industry groups .\n\n\n\n\n\nMinister Murray Watt has rejected calls from environment groups and the Greens for a so-called \"climate trigger,\" which could block projects that generate significant environmental harm.\n\n\n\n\n\nHe's told Sky News the laws will include much heavier penalties on polluters.\n\n\n\n\n\n\"One of those options is to strip a company of 10 per cent of its profits if it's a particularly egregious breach of environmental law or its conditions. Of course, not every breach would end up being that kind of money but that's a very high amount of money, potentially up to $825 million, that's the maximum there. But of course, more minor breaches would result in smaller fines. But this is a way of making sure that we are protecting the environment and sending that clear message.\"\n\n\n\n\n\n—\n\n\n\n\n\nAnd to sport now,\n\n\n\n\n\nAustralia has won two medals at the world track cycling championships in Chile.\n\n\n\n\n\nAfter winning the round-one match race against the United Kingdom on day one, the men's team will next face Denmark to fight for the gold medal.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/hyper-real-video-trend-sora-2/sisz7q1jy",
        "title": "'TikTok on steroids': What happened when our reporter tried a hyper-real video trend",
        "publish_date": "Thu, 23 Oct 2025 18:44:12 +0000",
        "category": "finance",
        "authors": [],
        "text": "A clip of American actor Will Smith eating spaghetti has become an unofficial benchmark for the capability of generative AI models.\n\n\n\n\n\nTwo years ago the spaghetti barely rendered and Smith's face was frighteningly distorted.\n\n\n\n\n\nBut by July this year, a new video of the AI-generated dish was so realistic that Smith himself called it \"Absolutely perfect and photo real.\"\n\n\n\n\n\nA recent wave of videos from Open AI’s new Sora 2 application inundated social media with highly realistic videos of celebrities, dead people and copyrighted characters.\n\n\n\nWill Smith eating spaghetti has become an unofficial benchmark for how AI generated video apps perform. Credit: LinkedIn Experts are concerned the technology could be used for scamming, deepfake imagery and political disinformation, and there is debate over whether Australia is too far behind in regulating new AI platforms.\n\n\n\n\n\nAre AI videos getting too realistic? And what are the risks for Australians?\n\n\n\n'A little scary'\n\nSora 2 is not currently available in Australia.\n\n\n\n\n\nBut I asked a friend in the United States, Raychel Ruiz, to try a few test videos.\n\n\n\n\n\nThe app scanned Raychel’s face and got her to say a few words.\n\n\n\nRaychel Ruiz used Sora 2 to make a lifelike version of herself as an SBS presenter. Source: Supplied She gave it a prompt to make an SBS News-style video about Sora 2 and it delivered a lifelike report with this quote: \"OpenAI has unveiled Sora 2, its next-generation video model. It turns a written prompt into realistic footage. The system can generate up to 2 minute clips in full HD or higher.\"\n\n\n\n\n\nRuiz said the end result was a little uncomfortable.\n\n\n\n\n\n\"It is interesting to see that it can create all that from just a sentence, but I don't love it. It's a little scary, I think.\"\n\n\n\n\n\nI then asked her to make a video using a photo of 'SBS News reporter Shivé Prema', but the app wouldn't allow it.\n\n\n\n\n\nSora 2 now only lets users make videos of themselves, some historical figures or public figures who have given their consent, in response to people making AI-generated videos of celebrities and copyrighted characters.\n\n\n\nSora 2's conception of SBS News reporter Shivé Prema in a news studio. The app imagined him as a woman. Source: Supplied But, prompting the app to scrape the internet for my digital footprint worked to some extent, creating two different versions of me.\n\n\n\n\n\nHumorously, it swapped my gender and added an extra letter to the trademarked SBS News logo, suggesting some safeguards are in place, but raising other questions.\n\n\n\n\n\nGoogle's Veo 3.1 app doesn't have the same requirements — it created an AI version of me from a picture and a written prompt (the same prompt given to Sora 2).\n\n\n\n\n\nIt animated the image, adding facial expressions and hand gestures, along with dialogue describing its competitor Sora 2.\n\n\n\nThe real Shivé Prema compared to the AI Shivé Prema, as generated by Google's Veo 3.1application. Source: SBS News\n\nConcerns about the truth\n\nToby Walsh, chief scientist at UNSW.ai, told SBS News there's a risk that this kind of content distorts people's relationship with the truth.\n\n\n\n\n\nHe suggests people could watch so much AI content that they stop believing people who are telling the truth.\n\n\n\n\n\n\"We're going to be entertained to death, and there's gonna be lots of fun memes circulating, but I'm not really sure it's that valuable for us,\" he said.\n\n\n\n\n\n\"It's going to consume a huge amount of energy, and I'm actually very worried that it's going to be used for a lot of mischief, that people are going to make fake videos, and maybe we're going to believe them, and we're gonna perhaps then stop believing many of the videos we believe, even the things that are real.\"\n\n\n\nWalsh is not entirely negative about AI-generated content though, pointing out it's a positive that Sora uses a watermark on its videos, which is a requirement in the European Union.\n\n\n\n\n\nSimilarly, he said Australia is better than some others at regulating AI.\n\n\n\n\n\n\"Technology is advancing very rapidly, and it's very hard for regulation, but we, we're actually, you know, we, we're compared to some other countries, we're actually in a reasonably good space,\" he said.\n\n\n\n\n\n\"We have, for example, the eSafety Commissioner, we are the first country in the world to have an eSafety commissioner and I think they're doing a good job of starting to address some of the harms.\"\n\n\n\nAustralia does not have AI-specific legislation but the technology is regulated through other laws. The government is currently developing a framework for AI.\n\n\n\n\n\nThere are concerns about the social media feed in the Sora 2 app, which some say has been designed to be addictive.\n\n\n\n\n\n\"It's like TikTok on steroids, which you can generate AI content... I think they want to create a whole social media platform which will obviously will be a lot bigger than what we have already\" according to Seyedali Mirjalili, a professor of AI at Torrens University.\n\n\n\nMirjalli said it's concerning how quickly the new platform works, where previously it would be a painstaking, hours-long process to make a deepfake edit.\n\n\n\n\n\n\"You can now upload a video of someone just half a minute, as short as a half a minute, and then, you know, impersonate them and add them to different contexts and create different content around them.\"\n\n\n\n\n\nHe said regulation is \"both lagging and lacking at the moment,\" pointing to the fact that without rules here around watermarks, it's become almost impossible to tell what's real and what's not, and getting even harder.\n\n\n\n\n\n\"The problem is that this is Sora 2. Imagine what Sora 20 would look like.\"\n\n\n\n\n\n— With reporting by Madeleine Wedesweiler.\n\n\n\n\n\nSBS does not use AI to enhance or generate its content. More information about SBS' AI guiding principles for the use of AI is available here .\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/the-australians-dying-young-at-the-edge-of-the-system/ibp1l37zu",
        "title": "Dead before 50: The Australians dying young at the edge of the system",
        "publish_date": "Thu, 23 Oct 2025 18:38:37 +0000",
        "category": "finance",
        "authors": [],
        "text": "This story contains references to suicide.\n\n\n\n\n\nMore Australians are dying while facing homelessness — and they're dying younger, often in their 30s to early 50s, according to new data.\n\n\n\n\n\nSome 14,000 people accessing specialist homelessness services (SHS) — agencies that provide services to respond to or prevent homelessness — died in the decade to 2023, according to an Australian Institute of Health and Welfare (AIHW) analysis. The annual death toll rose from 914 to 1,459 over the same period — nearly a 60 per cent increase.\n\n\n\n\n\nAlmost half (45 per cent) of those deaths were in people aged 35-54, while about one in eight (1,700 in total) were people aged 25-34 and one in 77 (180 total) were children under 14.\n\n\n\n\n\nThe median age of death in Australia is 82, according to the Australian Bureau of Statistics. But the AIHW found, among those accessing homelessness services, the median age at death was 55 — 27 years younger.\n\n\n\n\n\nThe disparity was even greater for people sleeping rough. Their median age at death was 47, similar to those experiencing other forms of homelessness.\n\n\n\n\n\nKate Colvin, the chief executive officer of Homelessness Australia, told SBS News many of these deaths are avoidable.\n\n\n\n\n\nShe described the prevalence of death by suicide or overdosing as \"devastatingly common\" among those experiencing homelessness and for rough sleepers.\n\n\n\nREAD MORE Thousands of Australian children are homeless, without an adult supporting them\n\nColvin said a key factor exacerbating these avoidable deaths is a lack of affordable social housing.\n\n\n\n\n\nWhile the federal government has committed to building 1.2 million homes by 2029 to achieve the National Housing Accord target, homeless people, and in particular youth, are struggling to access stable housing.\n\n\n\n\n\nSHS supported around 280,000 people in 2023–24, with almost half of unaccompanied young people aged 15-24 seeking help still experiencing homelessness when their support ended. Unaccompanied refers to a person not living with a parent or guardian (if under 18) or living along (aged 18-24).\n\n\n\n\n\nSocial housing dwellings made up only 4.1 per cent of all households in 2024, a decrease from 4.8 per cent in 2011, according to AIHW data released this month.\n\n\n\nTrauma compounded by homelessness\n\nColvin said that people seeking help from an SHS have often experienced some kind of trauma.\n\n\n\n\n\n\"A lot of people coming to homeless services are fleeing domestic and family violence. For children, it's abuse and neglect in the home and other forms of violence as well,\" she said.\n\n\n\n\n\n\"They then come to homeless services and often just cannot get access to the housing that they need to move on with their life.\"\n\n\n\n\n\nA lack of stable housing has two effects, she said, \"eroding hope\" and \"trapping\" people in homelessness.\n\n\n\nShe said this creates further risks for people already experiencing mental health challenges and dangerous environments.\n\n\n\n\n\n\"It's very common for people, particularly if they're rough sleeping, to be subject to violence on the street. But also, when people are couch surfing or in rooming houses, they can experience violence,\" she said.\n\n\n\n\n\n\"That's where we see the suicides and overdoses as a direct consequence of those experiences.\"\n\n\n\n\n\nAccidental poisoning — which includes deaths from a drug overdose — was the top underlying cause of death among people who accessed SHS in their last year of life.\n\n\n\n\n\nAccidental poisoning deaths relate to exposure to a substance in an amount that unintentionally causes harm. The most common accidental poisoning was caused by the consumption of the drug gamma-hydroxybutyrate or GHB.\n\n\n\n\n\nDeaths by suicide, followed by coronary heart disease, were the other main causes of death for the study period of 2013 to 2023.\n\n\n\nSource: SBS News Liver diseases, cancers and other illnesses were also common causes of death.\n\n\n\n\n\nColvin explained that a lack of housing services also undermines a person's ability to seek medical help for a chronic condition or illness.\n\n\n\n\n\n\"These are often deaths and illnesses that are more likely to occur if they experience disadvantage across a number of areas of their life,\" she said.\n\n\n\n\n\n\"Particularly coronary heart disease, if you experience a lot of stress, you are not in a position to eat well and exercise. And then we know that heart conditions can be a consequence of all of those experiences.\"\n\n\n\nSource: SBS News Among males, the most common underlying cause of death was consistently accidental poisoning, 15 to 22 per cent, followed by suicide, 11 to 16 per cent and coronary heart disease, 7.4 to 10 per cent.\n\n\n\n\n\nAmong females, accidental poisoning caused 11 to 17 per cent of deaths, and suicide 8.8 to 16 per cent. These were consistently the two most common underlying causes of death, with rankings changing between years.\n\n\n\n\n\nThese top two causes were followed by a mix of other causes, including coronary heart disease, liver disease and lung cancer.\n\n\n\nMore men died in proximity to homelessness, data suggests\n\nAround 8,700 males and around 5,300 females accessed SHS support in their last year of life over the study period, according to the AIHW.\n\n\n\n\n\nApproximately two-thirds of SHS clients are female, with around 2 in 5 females experiencing homelessness at the start of support. While fewer SHS clients are males, around half are experiencing homelessness at the start of support.\n\n\n\nClinical psychologist Dr Helen Stallman who is also the director of the suicide prevention group Care Collaborate Connect, said that suicide prevention programs are often too focused on \"being a saviour\" after a suicide attempt, rather than addressing basic needs first.\n\n\n\n\n\n\"Everybody needs housing and everybody needs to be able to afford the basic things like food and things like that. And everybody needs to be around safe social environments,\" she said.\n\n\n\n\n\n\"Governments really haven't stepped up and solved that problem so that every Australian has housing.\"\n\n\n\n\n\nShe said that other stressors, like the cost of living, can also create mental health challenges.\n\n\n\n\n\n\"All those things make life more stressful as well. And if you're not functioning it kind of just has this flow on effect,\" she said.\n\n\n\nHome ownership declining\n\nColvin said that homelessness services are struggling to keep up with demand.\n\n\n\n\n\nThere's only a limited number of workers and they can only see so many people a day,\" she said.\n\n\n\n\n\n\"Homeless services are so under the pump, responding to people who have already come through the door, that they're very frequently having to close the door to actually just respond to people.\"\n\n\n\n\n\nAs homelessness continues to rise in Australia, the housing crisis has deepened, Colvin said, putting further pressure on services.\n\n\n\n\n\nAIHW data shows that 1.3 million low-income households were experiencing housing stress in 2024–25, spending more than 30 per cent of their disposable income on housing.\n\n\n\n\n\nAdults and families struggling with these costs could be on the brink of homelessness.\n\n\n\nSource: SBS News AIHW spokesperson Louise Gates said home ownership rates were falling, with fewer young people owning their own home, largely because of the increased cost of housing.\n\n\n\n\n\nHome ownership rates declined from 50 per cent to 36 per cent among people aged 25 to 29 and from 64 per cent to 50 per cent for those aged 30 to 34, between 1971 and 2021, according to the AIHW.\n\n\n\nThe number of social housing dwellings increased by 45,200 between June 2006 and June 2024.\n\n\n\n\n\nHowever, social housing dwellings made up only 4.1 per cent of all households in 2024, a decrease from 4.8 per cent in 2011.\n\n\n\nWhat change is needed?\n\nColvin said there is an opportunity to address deaths among people experiencing homelessness.\n\n\n\n\n\n\"The upcoming NDIS negotiations between the states and territories around foundational supports for people with psychosocial disability are an opportunity to deliver life-saving change,\" she said.\n\n\n\n\n\n\"The most critical change needed is the creation of housing integrated with mental health care and support so people can escape homelessness and recover their health and wellbeing.\"\n\n\n\n\n\nStallman said that providing mental health support needs to be inclusive of those experiencing homelessness.\n\n\n\n\n\n\"If people aren't reaching out and keeping connected with people, they feel really alone and that reduces their ability to get that support when they do need help coping with the tough stuff,\" she said.\n\n\n\n\n\nSupport for people experiencing homelessness can be found at homelessnessaustralia.org.au\n\n\n\n\n\nReaders seeking crisis support can ring Lifeline on 13 11 14 or text 0477 13 11 14, the Suicide Call Back Service on 1300 659 467 and Kids Helpline on 1800 55 1800 (for young people aged up to 25). More information and support with mental health is available at beyondblue.org.au and on 1300 22 4636.\n\n\n\n\n\nEmbrace Multicultural Mental Health supports people from culturally and linguistically diverse backgrounds.\n\n\n\n\n\nReaders struggling with their use of alcohol and other substances can contact the National Alcohol and Other Drug Hotline on 1800 250 015 for free and confidential support 24 hours a day, 7 days a week.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/indonesia-vows-to-stay-active-in-global-sport-despite-ioc-backlash-over-israel-ban/0h5kj9dw4",
        "title": "Indonesia vows to stay ‘active’ in global sport despite IOC backlash over Israel ban",
        "publish_date": "Thu, 23 Oct 2025 09:17:03 +0000",
        "category": "sports",
        "authors": [],
        "text": "Indonesia says it will continue to play an “active role” in international sport after the International Olympic Committee (IOC) urged federations not to host events there following the country’s decision to bar Israeli gymnasts.\n\n\n\n\n\nIndonesia last week said it would not grant visas to Israeli athletes due to compete at the World Artistic Gymnastics Championships, citing Israel’s military offensive in Gaza.\n\n\n\n\n\nThe move was condemned by the IOC, which said it had ended dialogue with the world’s most populous Muslim-majority nation about hosting future Olympic events.\n\n\n\n\n\nThe committee also urged “all international federations not to host any international sports events or meetings in Indonesia” until the country provided guarantees of access for all competitors.\n\n\n\n\n\nIn a show of defiance, sports and youth minister Erick Thohir on Thursday said Jakarta was aware its stance “carries consequences” but would continue to engage internationally.\n\n\n\nREAD MORE Australia to send ADF liaison officer to join US-led Gaza peace taskforce\n\n\"Indonesia will continue to play an active role in various sports events at the Southeast Asian, Asian and global levels, so that Indonesian sports can serve as an ambassador and a reflection of the nation's strength in the eyes of the world,\" he said on X.\n\n\n\n\n\nThohir said Indonesia adhered to the principle of maintaining “security, public order and public interest” when hosting international events.\n\n\n\n\n\n\"On that basis, Indonesia has taken steps to avoid the arrival of the Israeli delegation at the Gymnastics World Championships,\" he said.\n\n\n\n\n\nIndonesia's National Olympic Committee declined to comment on the IOC statement, saying discussions were ongoing.\n\n\n\n\n\nIsrael's gymnastics federation appealed against the ban to the Court of Arbitration for Sport (CAS), but it was rejected.\n\n\n\nREAD MORE FIFA ditches Indonesia as U20 World Cup host over Israel controversy\n\nIn July 2023, Indonesia pulled out of hosting the World Beach Games following controversy over Israel's participation.\n\n\n\n\n\nIn March that year, Indonesia lost the hosting rights to the FIFA Under-20 World Cup after two governors objected to Israel's participation.\n\n\n\n\n\nBoth of those occurred before the war between Israel and Hamas broke out in Gaza.\n\n\n\n\n\nIndonesia has no formal diplomatic ties with Israel, and has strongly criticised Israel over the war, even after this month's ceasefire took effect.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/video/wa-introduces-nations-toughest-gambling-machine-rules-at-crown-perth/np7fpiuqp",
        "title": "WA introduces nation’s toughest gambling machine rules at Crown Perth",
        "publish_date": "Thu, 23 Oct 2025 09:00:00 +0000",
        "category": "finance",
        "authors": [],
        "text": "WA introduces nation’s toughest gambling machine rules at Crown Perth\n\nPublished 23 October 2025, 8:31 am\n\nStates and territories across Australia are under increasing pressure to introduce gambling reform. The Western Australian government says it's now leading the way. The changes mean every player at Crown Perth will soon face strict time and spending limits before they can start playing. SBS WA Correspondent Christopher Tan explains.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/video/western-sydney-airport-one-step-closer-to-getting-off-the-ground/u72fge4ls",
        "title": "Western Sydney Airport one step closer to getting off the ground",
        "publish_date": "Thu, 23 Oct 2025 08:56:30 +0000",
        "category": "finance",
        "authors": [],
        "text": "Western Sydney Airport one step closer to getting off the ground\n\nPublished 23 October 2025, 8:31 am\n\nIt's about 50 years since debate began over a second airport in Sydney. Now, Western Sydney International Airport has reached another milestone. New testing is set to bring the terminal to life for both international and domestic passengers. Over the coming months flight paths, runways, and other operations will be put through their paces, ensuring they're fit for purpose.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/optus-executives-depart-after-scrutiny-over-triple-zero-disaster/qc0erop8g",
        "title": "Optus executives step down as triple-zero disaster fallout continues",
        "publish_date": "Thu, 23 Oct 2025 06:49:10 +0000",
        "category": "finance",
        "authors": [],
        "text": "Two senior executives from Optus have stepped down as the embattled telco faces ongoing scrutiny over a major triple-zero outage.\n\n\n\n\n\nIn a statement on Thursday, Optus announced the \"planned retirement\" of chief financial officer (CFO) Michael Venter, who will also step down as board director.\n\n\n\n\n\nAndy Giles Knopp was named as the incoming CFO from April 2026.\n\n\n\n\n\nChief information officer Mark Potter will also leave the company in March 2026, with John McInerney having been named his replacement from November this year.\n\n\n\n\n\nThe statement announcing the departures didn’t suggest they were related to a recent Optus triple-zero outage, which has been linked to three deaths.\n\n\n\n\n\nThe outage, which occurred after a routine firewall upgrade on 18 September, prevented more than 600 triple-zero calls from connecting in South Australia, the Northern Territory, Western Australia and some parts of NSW.\n\n\n\nThe calls failed to redirect to another functioning network in the area, despite a legal requirement for the telco to facilitate this.\n\n\n\n\n\nIn response to the incident, the government has fast-tracked new legislation that will mandate telecommunications companies to provide real-time updates on any outages to emergency services, the communications watchdog Australian Communications and Media Authority, and the government.\n\n\n\n\n\nThe Singaporean-owned telco sent emails notifying the federal communications department of the outage to the wrong email address, leaving authorities in the dark for more than a day.\n\n\n\nOptus has commissioned an independent review into the incident, and it is also under scrutiny from ACMA.\n\n\n\n\n\nOptus CEO Stephen Rue thanked both men for their service.\n\n\n\n\n\n“Michael has decided to retire from executive life to pursue a portfolio career, and I wish to thank him for his significant contribution to Optus over the past four years,\" he said.\n\n\n\n\n\n“Following long-term and open discussions, Mark has decided that early next year is the right time to leave Optus after four productive years and having laid strong technology foundations for Optus’ transformation plans.\n\n\n\n\n\n\"I wish him all the best with his next chapter.\"\n\n\n\n\n\n— With additional reporting by Australian Associated Press\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/albo-trump-and-the-elephant-in-the-room-gaza-ceasefire-fractures-a-very-french-heist/ty0lr0tgl",
        "title": "Albo, Trump and the elephant in the room, Gaza ceasefire fractures & a very French heist",
        "publish_date": "Thu, 23 Oct 2025 06:08:04 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/greens-raise-alarm-over-new-environment-laws-evening-news-bulletin-23-october-2025/kmqc2kki2",
        "title": "Greens raise alarm over new environment laws | Evening News Bulletin 23 October 2025",
        "publish_date": "Thu, 23 Oct 2025 05:11:23 +0000",
        "category": "finance",
        "authors": [],
        "text": "Key Points Greens concerned new environment laws to protect “business over nature”\n\nSussan Ley promises to take income tax cut policy to next election\n\nLiverpool bids to host 2030 Artistic Gymnastics World Championships\n\nListen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nThe Greens have raised concerns about the Federal government's new proposed climate laws, after the environment minister scrapped a key mechanism that could block new coal and gas projects.\n\n\n\n\n\nMinister Murray Watt has decided to reject calls from environmental groups and the Greens for a so-called \"climate trigger\", which could deny projects that generate significant environmental harm.\n\n\n\n\n\nThe proposed laws will still require heavy polluting projects to disclose their emissions, and how they intend to mitigate them, as part of the assessment process.\n\n\n\n\n\nThe Albanese government looks to be facing several roadblocks in passing their long-awaited rewrite of the Environment Protection and Biodiversity Conservation Act, with both the Greens and Nationals expressing major reservations.\n\n\n\n\n\nGreens Senator Sarah Hanson-Young tells Sky News the government is more concerned with appeasing big business than protecting the environment.\n\n\n\n\n\n\"The problem I've got with this whole process is these laws have business and industry's fingerprints all over it. The minister is saying he wants to develop for business and industry. How about doing your job as the environment minister for the environment? There's plenty of ministers looking after them, the environment minister should be standing up for nature.\"\n\n\n\n---\n\n\n\n\n\nThe Federal Opposition is promising a personal income tax cut as one of the policies it will take to the next election - a move it says will give households more money to put toward a home deposit or service a mortgage.\n\n\n\n\n\nOpposition leader Sussan Ley announced the plan at the site of a new housing development.\n\n\n\n\n\n\"And that means that young people - and indeed everyone - will have more money in their pocket to spend on buying a home, paying a mortgage, getting out of the rental trap. And we know, too, that the reward belong with you - not with a government with the level of runaway spending that we're seeing today.\"\n\n\n\n\n\nThe Coalition is also calling for quicker and more efficient approvals to cut extensive delays in construction projects.\n\n\n\n\n\nA shortfall in the supply of homes, particularly in capital cities, has been identified as a key driver of soaring house prices across the country.\n\n\n\n---\n\n\n\n\n\nOpposition MP Andrew Hastie has urged former Nationals leader, Barnaby Joyce, not to leave the Coalition for One Nation.\n\n\n\n\n\nMr Joyce recently announced he will not re-contest his New South Wales seat of New England at the next federal election, citing an irreparably damaged relationship with the Nationals.\n\n\n\n\n\nRumours have since circled that he could join Pauline Hanson's One Nation party.\n\n\n\n\n\nMr Hastie, who recently stepped away from the frontbench over disagreements with Opposition leader Sussan Ley, says the speculation around Barnaby Joyce has only hurt the Coalition's efforts to present a united front after a bruising election result in May.\n\n\n\n\n\n\"First things first, I'm not switching. I wouldn't be elected if it wasn't for the Liberal Party, so I'm very grateful for the opportunity the party has given me over the last ten years. As for Barnaby, I don't know what's in Barnaby's mind, but I hope he stays within the coalition because I think he does have a lot of experience. So I'm keen for Barnaby to stay with us. And all this speculation about One Nation obviously is unhelpful to our cause right now as we're trying to rebuild post-election.\"\n\n\n\n---\n\n\n\n\n\nPrime Minister Mark Carney has set a goal for Canada to double its non-United States exports in the next decade, saying American tariffs are causing a chill in investment.\n\n\n\n\n\nUS President Donald Trump has been threatening Canada's economy and sovereignty with tariffs, also suggesting Canada become the US's 51st state.\"\n\n\n\n\n\nMore than 75 per cent of Canada's current exports go to the U-S, with $4.1 billion worth of goods and services crossing the border daily.\n\n\n\n\n\nMr Carney, who will release his government's budget on the 4th of November, says the Trump administration has forced Canada to turn to India, China and other major trade partners to increase economic security.\n\n\n\n\n\n\"This decades long process of an ever closer economic relationship with the United States is now over. As a consequence, many of our former strengths as a country, strengths based on close ties to America, have become our vulnerabilities. The jobs of workers in our industries most affected by the U-S tariffs, in autos, in steel and lumber, are under threat. And our businesses are holding back investments restrained by the pole of uncertainty that's hanging over all of us.\"\n\n\n\n---\n\n\n\n\n\nIn sport, British Gymnastics has confirmed Liverpool will bid to host the 2030 Artistic Gymnastics World Championships, after successfully staging the event in 2022, confirmed.\n\n\n\n\n\nBritain has become a heavyweight in the sport, winning at least two medals at each of the last four Olympic Games.\n\n\n\n\n\nBritish Gymnastics says playing host to the 2030 games would help build participation in the sport.\n\n\n\n\n\nThe organisation referenced the success of the Women's Rugby World Cup and football Euros, saying they're examples of the momentum hosting these events can have on the nation at large.\n\n\n\n\n\nThe bid, which is supported by U-K Sport, centres on Liverpool's proposed venue for the event - an 11,000-seat riverside arena.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/westpac-wfh-ruling-a-clear-message-to-both-employers-and-employees/55q3aa49d",
        "title": "'Employers on notice': Landmark ruling could be turning point in WFH debate",
        "publish_date": "Thu, 23 Oct 2025 04:33:10 +0000",
        "category": "finance",
        "authors": [],
        "text": "The ruling granting a Westpac employee the right to work from home five days a week \"sends a clear message\" to all Australian employers dealing with such requests, experts say.\n\n\n\n\n\nIn a decision handed down on Monday, the Fair Work Commission (FWC) found the bank had not provided a \"reasonable business case\" to refuse part-time employee Karlene Chandler's request.\n\n\n\n\n\nChandler, who several years ago moved to a regional town roughly 70km from the nearest Westpac corporate office, argued she needed flexibility to care for and handle school pick-ups and drop-offs for her two six-year-old children.\n\n\n\n\n\nShe works five days a week, usually from 8am to 2pm, while her children's school hours are between 7.40am and 2.25pm.\n\n\n\n\n\nAn acting senior manager had previously given her approval to work two days a week from a Westpac branch closer to her home, but that decision was reversed when the regular holder of that position returned from leave.\n\n\n\n\n\nChandler, who has been working for Westpac since 2002, took the matter to the FWC in early 2025, seeking to either return to her previous arrangement or be allowed to work entirely from home.\n\n\n\nREAD MORE The male breadwinner is gone. Why working from home is necessary for modern families\n\nAmong other arguments, Westpac said it would be unfair to grant Chandler flexibility based on her personal choices, such as the location of their home or the school her children attended.\n\n\n\n\n\nIt also said Chandler's partner was capable of playing a larger role in the care of the children and that the family was in a financial position to pay for child care.\n\n\n\n\n\nAccording to the FWC ruling, the returning senior manager sent her an email informing her that \"working from home is no substitution for child care\".\n\n\n\n'Reasonable business grounds'\n\nChandler's case rested on provisions in the Fair Work Act that give someone employed continuously for over 12 months the right to request flexible arrangements in circumstances such as pregnancy, disability and parenting.\n\n\n\n\n\nUnder the act, an employer is required to try to reach an agreement to accommodate the request, and it must demonstrate \"reasonable business grounds\" for refusing.\n\n\n\n\n\nThese include an overbearing financial cost, a significant loss in productivity or efficiency, and a lack of capacity to accommodate the request.\n\n\n\nLISTEN TO INTERVIEW: The truth about working from home - and should we work on Friday afternoons? SBS News 05:15 English\n\nAmong other things, Westpac argued that its teams collaborated much more effectively if there was a certain level of office attendance and face-to-face interaction, but these were not found to constitute reasonable business grounds.\n\n\n\n\n\nFWC deputy president Thomas Roberts ruled that there was \"no question that Ms Chandler's work can be performed completely remotely\".\n\n\n\n\n\n\"She has been working remotely for a number of years and doing so very successfully,\" wrote Thomas, who in his ruling noted that Chandler had been allowed to work from home full-time both before and after taking maternity leave in 2019.\n\n\n\n'All employers on notice'\n\nThe national secretary of the Finance Sector Union, which represented Chandler in the case, said the decision \"is significant and paves the way for workers who have caring responsibilities just like Ms Chandler to secure work from home rights\".\n\n\n\n\n\n\"This decision puts all employers on notice that they will need to have genuine business reasons to refuse a flexible working arrangement request,\" Julia Angrisano said in a statement provided to SBS News.\n\n\n\n\n\nGiuseppe Carabetta is an associate professor of workplace and business law at the University of Technology Sydney. He struck a similar note, saying the case emphasised the particular onus that was on employers.\n\n\n\n\n\n\"This ruling — along with similar previous ones on the issue — sends a clear message: employers can't rely solely on a company policy when rejecting flexible work requests,\" Carabetta told SBS News.\n\n\n\n\n\n\"The commission's decisions in this area so far show that it expects a genuine, individualised assessment that weighs the employee's role, personal circumstances, and the broader impact of flexibility.\"\n\n\n\nJessica Dawson-Field, an employment special counsel at Maurice Blackburn, said the ruling was significant for rebutting \"the assumption that there has to be face-to-face engagement in the workplace\".\n\n\n\n\n\n\"There are some jobs that can be done remotely without any detriment on the work, the customers, colleagues. And I think in this case, the Fair Work Commission found that this was one of those roles.\"\n\n\n\n\n\nDawson-Field said one of the main takeaways for employers was to \"really engage with the process\" when an employee asks for flexible work arrangements.\n\n\n\n\n\n\"There's a number of requirements that Westpac didn't comply with. For example, for providing a response in 21 days as required under the Fair Work Act, and they didn't really provide any clear reasons as to why the request was refused.\"\n\n\n\n\n\n\"There was also no real evidence about the reduction in productivity or efficiency or any sort of decline in customer service that could be relied on to really justify the refusal of the application to work from home.\"\n\n\n\nLISTEN TO Is your job burning you out? Experts say better boundaries and workplace connections can help SBS News 05:16 English\n\nAsked if the case would make employers more wary of offering temporary work from home arrangements out of fear they could be used to lock in remote work permanently, she said:\n\n\n\n\n\n\"Every case turns on its own facts ... It's not necessarily a requirement that the employee has previously worked from home to really justify a work-from-home request.\"\n\n\n\nMore key takeaways\n\nCarabetta said previous cases had shown that, in responding to an employee's flexible work request, employers must:\n\n\n\n\n\n- Ensure systems and processes are in place regarding the technical requirements of their obligations\n\n\n\n- Provide detailed and specific business grounds for refusals (not generalised loss of productivity and efficiency arguments) and substantiate such claims\n\n\n\n- Explain the detriment likely caused to the particular employee if working from home (e.g. lost opportunity to improve performance via guidance or isolation for an employee if working fully from home as a carer)\n\n\n\n\n\nCarabetta added that the case had some important takeaways for employees making work-from-home requests, saying they:\n\n\n\n\n\n- Must be clear on the change they are seeking (including for what period)\n\n\n\n- Offer reasons for the change, and explain how the proposed changes relate to the employee's particular circumstance — that is, they need to establish a clear 'nexus' between the two. Otherwise, we have seen the commission come down on employees, or at least come up with a more balanced option in the circumstances.\n\n\n\nIn statements made after the FWC decision, Westpac said it would \"consider the ruling\".\n\n\n\n\n\n\"Westpac’s workplace policy is designed to help our people deliver the best outcomes for customers, no matter where they work. It ensures meaningful collaboration within teams while providing flexibility to work from home,\" a spokesperson said.\n\n\n\n\n\nSBS News sought comment from Westpac but did not receive a response before this article was published.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.theage.com.au/national/australia-news-live-us-looks-to-set-up-naval-base-in-australia-to-advance-aukus-vance-criticises-israeli-parliament-s-vote-to-annex-west-bank-king-charles-and-pope-leo-pray-together-in-500-year-first-20251024-p5n4xd.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Australia news LIVE: US looks to set up naval base in Australia to advance AUKUS; Vance criticises Israeli parliament’s vote to annex West Bank",
        "publish_date": "Fri, 24 Oct 2025 12:52:53 +1100",
        "category": "finance",
        "authors": [
            "Emily Kaine"
        ],
        "text": "Nationals leader David Littleproud has said this morning that “renewables are losing their social licence” and labelled net zero as overly ambitious as tensions within the Coalition over the policy reach a fever pitch.\n\n“Net zero has become about trying to achieve the impossible rather than doing what’s sensible,” Littleproud said at a press conference today.\n\nNationals leader David Littleproud Credit: Dominic Lorrimer\n\nThe National Party leader also criticised the government’s all-renewables approach and said that additional wind turbines built under this approach were “going across prime agricultural land” and “taking away [your] food security, pushing up [your] food prices”.\n\n“Renewables are losing their social licence… There is a better way than the way the Albanese government is undertaking on this reckless race to an all-renewables approach. There’s no country of the industrial scale the size of Australia that is going on renewables.”\n\nThe Coalition remains divided on its net zero policy.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/the-friendlyjordies-video-that-sparked-the-text-exchange-20251024-p5n52s.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "The FriendlyJordies video that sparked the text exchange",
        "publish_date": "Fri, 24 Oct 2025 12:42:54 +1100",
        "category": "finance",
        "authors": [],
        "text": "The FriendlyJordies video that sparked the text exchange\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/queensland/expressions-of-interest-to-buy-toowong-private-hospital-close-20251024-p5n524.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Expressions of interest to buy Toowong Private Hospital close",
        "publish_date": "Fri, 24 Oct 2025 12:42:37 +1100",
        "category": "finance",
        "authors": [
            "Courtney Kruk"
        ],
        "text": "Expressions of interest to buy Toowong Private Hospital have officially closed, four months after the 58-bed private psychiatric facility shut its doors.\n\nA spokesperson for commercial and residential real estate agency Colliers said there had been a mix of interested buyers in the lucrative 5835-square-metre site, including from private developers and healthcare representatives.\n\nThey said a potential sale was in the works.\n\nToowong Private Hospital is on a sizeable block, four kilometres from Brisbane’s CBD. Credit: Courtney Kruk\n\nToowong Private Hospital was opened in May 1976 by Noel Austin Kratzmann and provided crucial in-patient and out-patient psychiatric care to Queenslanders for more than four decades.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/flight-from-new-zealand-to-sydney-suffers-technical-issues-mid-flight-20251024-p5n52r.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Flight from New Zealand to Sydney suffers technical issues mid-flight",
        "publish_date": "Fri, 24 Oct 2025 12:37:47 +1100",
        "category": "finance",
        "authors": [],
        "text": "Flight from New Zealand to Sydney suffers technical issues mid-flight\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/culture/tv-and-radio/want-to-know-what-s-going-to-be-big-in-tv-in-2026-look-for-these-13-shows-20251023-p5n4ni.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Want to know what’s going to be big in TV in 2026? Look for these 13 shows",
        "publish_date": "Fri, 24 Oct 2025 12:31:36 +1100",
        "category": "finance",
        "authors": [
            "Michael Idato"
        ],
        "text": "Save Log in , register or subscribe to save articles for later. Save articles for later Add articles to your saved list and come back to them any time. Got it Normal text size Larger text size Very large text size Wanna know what’s going to be big on TV in 2026? Finding the answer, sometimes, is just a matter of where you look. Despite the uncertainty of the global television business, more than 10,000 buyers and sellers of TV still converge every year for the world’s biggest content market. Sales are brisk. Risks are high. But all transactions are final. Mipcom, or as it is fully titled, Marché International des Programmes de Communication, is the world’s biggest television trade show. Staged annually in Cannes, France, it is equal parts Sydney Royal Easter Show and Melbourne International Film Festival. It is where the people who make TV shows come to sell them, and it is where the people who buy TV shows come to go shopping. Boston Blue star Donnie Wahlberg poses on the red carpet at Mipcom. Credit: S. d'Halloy / Image&Co for Mipcom The market is useful for detecting deeper trends in the business. This year, for example, YouTube set up shop in Cannes, heralding what many saw as a closer alignment between the online creator economy and traditional television content. “It feels like a tipping point for the industry,” Mipcom Cannes director Lucy Smith said. Loading But the engine turning the wheels is still on-foot deal-making, with more than 10,000 delegates in attendance, some 3340 of whom were dedicated program buyers, all scouring the Palais des Festivals in Cannes hoping to find the next big thing before their competitors. The market hosted 350 exhibitors – studios, channels or production companies – from 107 countries. And while the market does not lean on glamour, it is not without celebrity touches. Among the stars hawking their wares this year were Donnie Walhberg and Sonequa Martin-Green from Boston Blue, British actors Shaun Evans and Jodie Whittaker, Succession star Matthew Macfadyen, Norman Reedus from The Walking Dead, and the cast of Midsomer Murders, including Neil Dudgeon and Annette Badland.\n\nAdvertisement\n\nSo what’s going to make noise in 2026? The answer is a broad church of traditional police dramas and comedy/dramas, which range from a sizzling romance in the ice hockey world, to a pastiche of police and food on an exotic island on the coast of Italy. Boston Blue, which will premiere before the end of the year, was the headline grabber, along with 12 more shows that turned up the volume in Cannes. Donnie Wahlberg and Sonequa Martin-Green in Boston Blue. Boston Blue (CBS Studios) The spin-off to the long-running police drama, Blue Bloods, shifts NYPD Detective Danny Reagan (Donnie Wahlberg) to Boston, and a new partnership with Detective Lena Silver (Sonequa Martin-Green) who, like Reagan, comes from an established law enforcement family. Boston Blue landed loud at the market, with its two leads turning heads everywhere they went. In a global market defined by hesitancy, a safe bet is an easy sell. Keke Palmer and Jack Whitehall in The ’Burbs. The ′Burbs (NBC Universal) Based on the much-beloved 1989 cult film about life in a suburban cul-de-sac, this is an eight-episode mystery comedy about a young couple who move into the husband’s childhood home and realise there is more going on in the ’burbs than meets the eye. Written by Celeste Hughey with Seth MacFarlane, and produced by Brian Grazer, it stars Keke Palmer, Jack Whitehall, Julia Duffy and Paula Pell.\n\nAdvertisement\n\nJodie Whittaker and Suranne Jones in Frauds. Frauds (ITV Studios) A new British crime thriller about two former professional partners Bert (Suranne Jones) and Sam (Jodie Whittaker). With a decade in prison behind her, Bert is on the outside and decides to re-team with Sam for one last big heist. Whittaker, a former Doctor Who, gives the series its headline star, and the concept, created by Jones and Anne-Marie O’Connor, gives off major Widows vibes. It’s directed by Giulia Gandini. Simu Liu in The Copenhagen Test. Credit: NBC Universal The Copenhagen Test (NBC Universal) James Wan and Thomas Brandon’s espionage thriller series is set five minutes in the future as first-generation-American intelligence analyst Alexander Hale (Simu Liu) learns his brain has been hacked, allowing the hackers access to everything he sees and hears. Time is ticking for him to flush out the perpetrators. Melissa Barrera, Sinclair Daniel and Brian d’Arcy James also star. Rebecca Gibney and Harry McNaughton (front) in Happiness. Credit: DCD Rights\n\nAdvertisement\n\nHappiness (DCD Rights) A musical comedy series from New Zealand, Happiness is the story of a big-name Broadway director (Harry McNaughton) who returns home and must contend with the fact that despite two decades of ascendancy in New York, he’s back living in his childhood bedroom and helping his mum, Gaye, (Rebecca Gibney) run the local community musical theatre society, Pizazz, which is populated by an enthusiastic, if not talented, crew. The show premieres on HBO Max on November 4. Warren Brown, Beau Gadsdon and Phyllis Logan star in A Taste for Murder. A Taste for Murder (ITV Studios) A sort of cross between high crimes and food porn, this is a British crime drama about a grieving London detective (Warren Brown) who moves with his daughter to the Italian island of Capri. The recipe – inevitably – is murder, and Joe Mottram (Brown) becomes enmeshed in the investigation. The series leans on its astonishing setting, filmed in Italy and Croatia. Hudson Williams and Connor Storrie in Heated Rivalry. Credit: Sphere Abacus\n\nAdvertisement\n\nHeated Rivalry (Sphere Abacus) Two of the ice hockey league’s biggest stars, Shane Hollander (Hudson Williams) and Ilya Rozanov (Connor Storrie), are professional rivals whose fierce competitiveness turns into a magnetic attraction that neither can avoid. A one-night fling turns into a clandestine relationship that is constantly challenged by their rising profiles and the homophobia embedded in professional sport. Matthew Macfadyen, Sian Clifford and O-T Fagbenle promote The Miniature Wife at Mipcom Cannes. Credit: Getty Images Loading The Miniature Wife (Sony Pictures) The marital woes of Lindy (Elizabeth Banks) and Les (Matthew Macfadyen) are laid bare when a technological accident induces the ultimate relationship imbalance: Les remains human-sized, while Lindy is shrunk. A “high-concept marital dramedy”, this gives Honey, I Shrunk the Kids vibes, but comes with a much more solid pedigree. The series also stars Sian Clifford and O-T Fagbenle.\n\nAdvertisement",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/afl/meat-loafs-friend-defends-infamous-gf-show-20220122-p59qc8.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Meat Loaf's friend defends infamous GF show",
        "publish_date": "Fri, 24 Oct 2025 12:18:49 +1100",
        "category": "finance",
        "authors": [],
        "text": "Meat Loaf's friend defends infamous GF show\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/rugby-union/c-mon-just-move-something-the-scary-moment-wallabies-star-feared-he-d-been-paralysed-20251023-p5n4rf.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘C’mon, just move something’: The scary moment Wallabies star feared he’d been paralysed",
        "publish_date": "Fri, 24 Oct 2025 11:59:07 +1100",
        "category": "sports",
        "authors": [
            "Iain Payten"
        ],
        "text": "Save Log in , register or subscribe to save articles for later. Save articles for later Add articles to your saved list and come back to them any time. Got it Normal text size Larger text size Very large text size Noah Lolesio coughs quietly mid-sentence to compose himself. It’s been almost four months, and while Lolesio’s physical scars have healed, he is still working on the emotional ones. “It’s still pretty scary,” he says. “Thinking about that situation.” The “situation” unfolded on a sunny afternoon in Newcastle in early July, where the Wallabies were in the middle of a torrid Test match against Fiji. The fixture was designed to be a cobweb-removing match ahead of the British and Irish Lions series but, unsurprisingly against the spirited Fijians, it was proving tough going. With the prime ministers of both Australia and Fiji sitting among a sold-out crowd, the Wallabies led 15-14 as the game clock neared 60 minutes. The rusty Wallabies felt like they were one try away from clicking, and when captain Harry Wilson spun in a tackle and passed to Lolesio, the click looked on. The five-eighth sprinted towards the try line. “I copped a good offload from Wilso, and had a little line break,” Lolesio recounts. “But then one of the Fijian players tackled me. I sort of twisted onto my back, and I whiplashed the ground pretty heavily with my head.”\n\nAdvertisement\n\nThe ball came loose and Fjii counter-attacked, and with the noisy Fijian fans going crazy, all eyes were on the visitors as they went all the way down the field to score. All eyes, except those of worried staff and family who had their eyes still trained on Lolesio. The 25-year-old had not moved. “When I made the impact to the ground, it was pretty scary because I couldn’t feel anything in my body for probably five to 10 minutes,” he says. “I was trying to move my feet and my toes for first five or 10 minutes, and I was stressing a bit. I was, ‘Oh frick’.” Noah Lolesio makes the break against Fiji, before his injury. Credit: AP Pictures and footage show Lolesio lying stationary on his right side, with his right foot stuck up on top of his left. Medical staff raced onto the field and stabilised his neck. “I was sort of just talking to myself: ‘Come on, just move something’. And I was praying a bit in my mind, too, just hoping everything will be all right,” Lolesio says. ” Within that 10 minutes, then I could slowly start moving my toes. I was like, ‘Oh, thank the Lord’. “Probably people don’t realise how bad it was. But yeah, it was pretty scary.”\n\nAdvertisement\n\nLolesio was taken to an emergency ward, and fears he had suffered a fractured spine were soon allayed. The loss of feeling would turn out to have been caused by a bulging disc that had been troubling Lolesio for a year, and for which he was due to get a cortisone injection the following week. And despite most assuming it was, the injury also wasn’t related to the similarly scary scenes when Lolesio was stretchered off and hospitalised in Perth two months earlier while playing for the Brumbies, also with concerns of a serious neck injury. That ended up being a mid-back strain. Lolesio leaves the field on a medicab in Newcastle. Credit: AP “What the surgeon told me is that I’ve just copped a massive whack to my spinal cord, and it stirred it up big time,” Lolesio says. “The injury itself was pretty tough. But what potentially could have happened from that incident … Yeah, it could have been a lot worse. “The surgeon at Newcastle said, ‘You’re very, very lucky it didn’t turn out differently’. He said I could have ended up in a wheelchair. That’s when it really hit home. It was like, ‘Far out’.” A few days later, Lolesio underwent surgery in Brisbane to remove a disc in his spine, and, with a handful of metal and screws, fuse together the C5 and C6 vertebrae. “It’s a pretty standard surgery,” Lolesio says. “The surgeon did a great job and the rehab’s pretty simple. You just got to let it heal and do its thing.”\n\nAdvertisement\n\nIt was not a career-ending injury, but the surgery ruled Lolesio out of the Lions series and the rest of the Wallabies’ winter campaign. Given he had played almost every Test in the No.10 shirt under Joe Schmidt, that would prove a problem for the Wallabies, who have since cycled through three different five-eighth replacements. And while it was disappointing for Lolesio to miss the Lions series, too, the doctors’ sobering words in Newcastle put things into perspective. “My first instinct was I was just more worried about my health than anything,” Lolesio said. “Rugby I’ve been thinking about a bit more recently, but initially it was more just, man, I’m just so happy I’m able to walk, and be with my family, and just do day-to-day stuff. “After getting a solid run in the Wallabies last year, I felt I was getting really comfortable in my form in the gold jersey. And then the injury happened.\n\nAdvertisement\n\n“So yeah, it was tough to watch the boys play and do well – but at the same time, for me, I’m just happy I’m healthy and able to eventually play again.” Noah Lolesio was the Wallabies’ first-choice five-eighth throughout 2024. Credit: Getty Images Lolesio rehabbed on the Gold Coast and last week booked his ticket to Japan, where he is set to take up a contract with a yet-to-be-officially-named club. It is believed to be Toyota Industries Shuttles Aichi. Lolesio signed the deal last year, electing to broaden his horizons after six years at the Brumbies. “I head over to Japan mid-November and I am really looking forward to it,” he says. Given the seriousness of his injury in Newcastle, and lack of news about his Japan move, many have left Lolesio out of the conversation when it comes to the problematic five-eighth spot for the 2027 World Cup.\n\nAdvertisement",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/healthcare/marissa-would-eat-just-three-things-her-eating-disorder-has-left-her-with-permanent-damage-20251023-p5n4nt.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Marissa would eat just three things. Her eating disorder has left her with permanent damage",
        "publish_date": "Fri, 24 Oct 2025 11:51:52 +1100",
        "category": "lifestyle",
        "authors": [
            "Henrietta Cook"
        ],
        "text": "Rudolph also has young patients who have developed vision impairment due to the condition. Some patients just eat the same three foods every day. “It might seem like an innocuous illness, but it has a profound impact on the entire family,” she says. “Parents may spend hours and hours trying to cook and feed them meals and sometimes these children become so anxious and medically unwell that they disengage from social contact and don’t attend school regularly.” Rudolph says malnutrition can lead to cognitive impairment and anxiety. “It affects all aspects of health – physical, psychological and cognitive.” Rudolph believes that growing awareness of ARFID and increasing incidence is leading to a rise in diagnoses. The eating disorder often coexists with autism, ADHD, anxiety and depression – conditions that are also increasingly diagnosed.\n\nUnlike other eating disorders, people with ARFID don’t restrict their food intake to lose weight or due to body image concerns. They often avoid foods because they don’t like their texture, colour, smell or taste. Some fear food and are worried they will choke or vomit. Jane Rowan, director of Eating Disorders Families Australia, is also a mother to a daughter who experienced an eating disorder. Credit: Dan Peled Over the past two years, Eating Disorders Families Australia has experienced a significant rise in the number of families and carers seeking support for ARFID. It now runs two support groups for families impacted by the eating disorder every month. Many of these families have spent years trying to get a diagnosis. “Families’ concerns are frequently dismissed due to the lack of knowledge around ARFID by medical professionals and the wider community,” says the organisation’s executive director Jane Rowan. Butterfly Foundation head of communications and engagement Melissa Wilson says it can be difficult to work out whether someone has ARFID or is just a fussy eater, particularly in children.\n\n“ARFID will usually manifest in an extreme aversion to or lack of interest in food and is a cause for concern when it affects their ability to meet their energy and nutritional needs, often resulting in weight loss, malnutrition or an inability to maintain growth and development,” she says. Wilson says while many people with ARFID may be underweight due to food restriction, some people maintain a typical or higher weight. She says there is limited research into how to prevent ARFID. While fussy eating normally improves during childhood and adolescence without treatment, people with ARFID require treatment to recover. In Coury’s case, this treatment involved frequent appointments with a psychologist and what’s known as exposure therapy.\n\nOne session revolved around apples, and Coury exposed her senses to apple juice, apple puree, dried apple and freshly cut apple. “We would do a different food every week,” she explains. “First I would look at it, then I might pick it up in my hands, smell it and if I feel courageous, I might lick the food. If I’m really feeling up for it, I might have a mouthful.” Her homework was repeating the sessions at home. Marissa Coury hopes that increased awareness of ARFID will lead to more children receiving early intervention. Credit: Dylan Coker Coury, who lives in Sydney’s southern suburbs and works in health promotion marketing, has lived with ARFID since she was three.\n\nAs a child, her parents tried to get her to eat the same meals as the rest of the family at dinner, but she refused. “They cooked me a separate meal every night,” she recalls. “My mum made this dish where she basically grated vegetables so small that you couldn’t really feel them. I ate that with minced meat and rice.” When she turned 18 and stopped eating her mother’s cooking, her health began to really suffer. “It started with unbearable pain in my feet and it got to the point where I couldn’t walk,” she says. “Then I was reading a book and realised everything was really blurry.”\n\nLoading She was eventually diagnosed with peripheral, optic and auditory neuropathy. This means she has pain in her feet and hands, blind spots in her vision and struggles to hear properly. Coury now eats a more varied diet with some meat, legumes and vegetables. “There are still some foods I don’t think I’m ever going to be able to eat,” she says. “I’m OK with that, because I’m just focusing on getting my nutrients.” She hopes that increasing awareness of the condition leads to more people receiving treatment earlier. “There’s so much hope for kids today because early intervention is key. By the time they’re my age, they may not have ARFID. They may be at a point where they eat a healthy, balanced diet.”\n\nLaura Hart, an associate professor at the University of Melbourne’s School of Population and Global Health, is leading a project to design Australia’s first robust screening tool for eating disorders in children aged 5 to 12. The project is looking to recruit 600 children and their parents to validate the new tool, which will flag potential eating disorders. She says existing screening tools for children were devised before ARFID was recognised and used clunky, impenetrable language. Hart says parents often experience significant anxiety when their child struggles with eating. “This is an illness that needs specialist support,” she says. “It is not the parents’ fault.”\n\nShannon McGlinchey’s son was an adventurous eater until he choked on a piece of paper when he was 18 months old. In a matter of days he went from feasting on an array of dishes including poached salmon, berries and Greek yoghurt to only eating a handful of foods. Loading He stopped eating solid food entirely for six months following the deaths of a relative and friend, a series of stomach bugs and tonsilitis. During this period, he only drank strawberry Up and Go liquid breakfasts and took supplements. He was eventually diagnosed with ARFID. The now six-year-old has since added two-minute noodles, Chicken Crimpy Shapes, strawberry doughnuts and chocolate chip cookies to his diet. The other day he ate a banana and a sausage. “That was a big win,” says McGlinchey, who lives in Melbourne’s south-east.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/culture/live-reviews/soaring-first-nations-meditation-completes-triple-bill-greater-than-sum-of-its-parts-20251023-p5n4qu.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "With spring racing in full swing, this barmy Aussie musical is exactly what we need",
        "publish_date": "Fri, 24 Oct 2025 11:49:17 +1100",
        "category": "entertainment",
        "authors": [
            "John Shand",
            "Joyce Morgan"
        ],
        "text": "Steve Kramer has created a thing of beauty. Phar Lap is everything you’d expect from the Hayes – irreverent, funny, slightly chaotic – but the elegant story-telling, lovable characters and electric performances take it to the next level. No long faces here. JAZZ\n\nHIROMI featuring PUBLIQUARTET\n\nCity Recital Hall, October 24, festival until November 2\n\nReviewed by SHAMIM RAZAVI\n\n★★★★ This year’s Sydney International Women’s Jazz Festival promises not only to thrill crowds but also to educate them on the expanding boundaries of the genre, if its opening night’s pairing of Hiromi’s jazz piano with the classical chops of New York’s PUBLIQuartet is anything to go by. Hiromi plays in both senses of the word – her virtuosic ability is never in question but she engages with her instrument not with reverence but as an extension of her restless, playful character. From her opening solo, with its nimble echoes of Blue Rondo à la Turk, to her rolling, repeating cadenzas – often standing up and reaching into the piano to pluck or buzz the strings – Hiromi takes technical accomplishment and literally jazzes it up. Jazz pianist Hiromi in action. Credit: Shane Rozario\n\nThat use of the piano’s full capabilities beyond the keyboard, paired with the audible sighs and inhalations that punctuate her phrasing, recalls Keith Jarrett’s total-body immersion in the music, though Hiromi’s version feels more exuberant than his solemnity. The collaboration with PUBLIQuartet builds on that same physical energy: their classical discipline tempers her improvisational daring, each shaping the other in real time. The night’s centrepiece was Hiromi’s COVID-composition Silver Lining Suite, whose four movements follow our collective journey from Isolation to, or perhaps through, Fortitude. It is a work that depends on, and allows, the Quartet to really shine. Jannina Norpoth’s chopping, deliberately niggling violin and Hamilton Berry’s mournful cello lines evoke the seemingly endless stasis we all endured, while Hiromi’s piano captures those flashes of unexpected joy among our sadness. Written in lockdown, it finds added meaning when performed in this sold-out, rafters-packed hall. It was followed by a breezier, but no less clever, reading of Blackbird. Picking up on the Beatles’ acknowledgement that their song was inspired by Bach’s Bourrée in E minor, Hiromi seamlessly spliced in lines of Jesu, Joy of Man’s Desiring, the combination epitomising the night’s jazz-classical conversation with humour and grace. Hiromi solo can stray into weightlessness; with PUBLIQuartet beside her, she finds just enough gravity to turn exuberance into substance.\n\nMUSIC\n\nSAMARA JOY\n\nRichard Bonynge Concert Hall, October 23\n\nReviewed by JOHN SHAND\n\n★★★★ Samara Joy came out and told us that although she was recovering from a cold, she’d rather sing a few notes for us than none. Compromised she was, in range, volume and breath control. She avoided introducing songs or band members, and only performed for 45 minutes rather than the scheduled 90. This, perhaps, was the peril of long-haul flights when your instrument is your voice. Samara Joy. Credit: AB+DM The American’s misfortune makes the concert tricky to review. From what I’d heard on record and YouTube, Joy is a candidate for being the most complete jazz singer since Sarah Vaughan. But if we couldn’t experience the full glory of her tone and range, we could still relish her phrasing, notably on the bittersweet A Beautiful Friendship, which also gave hints of her ingenuity and astuteness in embellishing a melody. On this basis, she’d be frightening when fully well. A testament to her status is that she brought a septet all the way to Australia: four horns, piano, bass and drums. It was fascinating, though, to hear this take on jazz the night after the Bill Frisell Trio. Where the latter was all about collective creativity while still having effortless precision, Joy’s band put a premium on being well-drilled.\n\nThat is not intended as a criticism, as to play such challenging and inventive arrangements (which I believe come from within the band, but with Joy unable to tell us, I can’t be sure) so consummately demands exemplary musicianship. Curiously, many of the new wave of exceptional jazz singers draw heavily on pre-1960s jazz (as Wynton Marsalis has prescribed for decades), rather than revitalising the idiom, which is what their idols did. As good as trumpeter Jason Charos, tenor saxophonist Kendric McCallister and alto saxophonist David Mason were, trombonist Donavan Austin stood out, starting his solo on A Beautiful Friendship with a soft, marshmallow-sweet sound, and using it to play with a 1930s mellifluousness. Bassist Paul Sikivie, drummer Evan Sherman and especially the pianist Connor Rohrer, meanwhile, made for a propulsive engine room. Given Joy’s constraints, I actually derived more pleasure from the opening set by local singer Kristin Berardi and bassist Sam Anning. With Berardi now based in Switzerland, they hadn’t played together for some time, and, presumably at short notice, found themselves obliged to perform for an hour rather than 30 minutes to flesh out the event. It’s a brave format for both parties, with no chord instrument or drummer providing sonic shelter, and yet I’ve never heard either sound better – and Berardi’s as good a singer and Anning as good a bassist as Australia’s produced. The songs they played, whether originals or standards, were actually enhanced by being stripped down in this fashion. The pair improvised and interacted with unbounded flair, good humour and – the sacred element missing from too much jazz – passion. Samara Joy also plays the City Recital Hall on October 24.\n\nDANCE\n\nSYDNEY DANCE COMPANY: CONTINUUM\n\nRoslyn Packer Theatre, October 22, until November 1\n\nReviewed by CHANTAL NGUYEN\n\n★★★★½ A strong triple bill is greater than the sum of its parts. Sydney Dance Company’s Continuum hits that high note, featuring an exciting line-up of heavyweights: Stephen Page, William Barton, Rafael Bonachela, and the up-and-coming Tra Mi Dinh. Their artistic voices are distinct in style, but the gorgeous commonality is that each is artistically mature and can evoke a sophisticated, satisfying artistic vision. First off the ranks is a dance by the home team: artistic director Rafael Bonachela’s Spell. It’s structured into five chapters, “each a vivid ‘spell’ that creates dance alchemy”, Bonachela explains. A scene from the dance work Spell, showing as part of the Sydney Dance Company show Continuum. Credit: Daniel Boud While the through-line between each segment is not always clear, the spinning athleticism of Bonachela’s aesthetic and SDC’s god-like dancers never disappoint.\n\nA highlight is the last ‘spell’, a duet for a male and female dancer, performed in a towering cone of red light and mist (Damien Cooper’s lighting and Kelsey Lee’s set). Visually striking, it also packs a searing emotional punch. A scene from Somewhere between ten and fourteen. Credit: Daniel Boud Next comes Tra Mi Dinh’s Somewhere between ten and fourteen, an exploration of the period between day and night, with the dancers dressed in a spectrum of dreamy, saturated blue shades (Aleisa Jelbart’s costumes). First seen in SDC’s 2023 New Breed season, Dinh has reworked this rendition for a larger ensemble. The result is intelligent and polished, with the choreography transitioning seamlessly between a robust, pulsing energy danced in sneakers and smooth, spinning sequences danced barefoot. A scene from the dance work Unungkati Yantatja – one with the other, a multidisciplinary collaboration between choreographer Stephen Page and leading yidaki (or didgeridoo) player William Barton. Credit: Daniel Boud\n\nThe evening peaks with a soaring First Nations meditation on the spirit of creation breath: Unungkati Yantatja – one with the other, a multidisciplinary collaboration between choreographer Stephen Page and leading yidaki (or didgeridoo) player William Barton, who composed the music and performs centre stage along with the classical new music artists of the Omega Ensemble. Loading Barton’s musicality and mere stage presence is nothing short of magnetic. A towering figure in a feathery cloak (Jennifer Irwin’s magnificent costuming), his didgeridoo playing speaks with the command of an ancient, evocative voice talking from the edge of the human world. And when singing, he seems to be calling the very dancing into being. The combination – on just one stage – of Barton’s presence, Page’s masterful choreographic instincts, and the artistic excellence of the SDC dancers and Omega Ensemble is almost an embarrassment of riches. THEATRE\n\nFly Girl\n\nEnsemble Theatre, October 22, until November 22\n\nReviewed by HARRIET CUNNINGHAM\n\n★★★★½ Two air hostesses, dressed in orange slacks and matching hats, unroll a line of tape across the stage of the Ensemble Theatre. It’s the line that marks the limits of where a woman can go in 1970s Australia.\n\nFly Girl is the story of Deborah Lawrie, the first woman in Australia to become a commercial airline pilot. It’s a sprawling tale, part memoir, part courtroom drama, about the pitched battle between a talented 25-year-old pilot who happens to be a woman, and the rusted-on prejudice of pioneering businessman Sir Reg Ansett. Genevieve Hegney and Catherine Moore in Fly Girl. Credit: Prudence Upton In 1976 Lawrie, who has her first flying lesson at 15 and has 1600 flying hours under her belt, applies to join the pilot training program at Ansett. Despite impressing selectors at two interviews and passing the psychological test with flying colours, Lawrie is rejected. In 1978 she takes her case to the newly established Victorian Equal Opportunity Board and becomes the complainant in the Australia’s first sex discrimination in employment case. Spoiler alert: she wins. But not without an ugly fight. Playwrights Genevieve Hegney and Catherine Moore bring this epic tale to the Ensemble stage with humour, joy and just the right amount of bite. The action moves fast, in short scenes, cutting cinematically between Lawrie’s home and family, the control tower, the flying school, the courtroom and the economy cabin of a domestic flight. An airport flicker board suspended above the stage keeps track of where and when we are.\n\nGenevieve Hegney, Alex Kirwan, Cleo Meinck and Emma Palmer in Fly Girl at the Ensemble Theatre. Credit: Prudence Upton Everything else – including over 50 characters – is up to the cast of five, directed with ingenuity by Janine Watson, aided by a stirring soundtrack (Daniel Herten) and a treasure trove of 1970s costumes (Grace Deacon). Sex is delightfully irrelevant: Alex Kirwan doubles as Lawrie’s father, then Lawrie’s husband, but also dons a red wig and orange slacks to become Helen, the tearful 27-year-old Ansett hostie on her last flight before she ages out of the job. Meanwhile, and with delicious irony, Genevieve Hegney switches between a strutting Reg Ansett, a pregnant and therefore unemployed solicitor, and TV reporter Pamela Graham. Catherine Moore juggles hats, moustaches and lunch trays with aplomb and Emma Palmer is richly comedic as barrister John Dwyer. Through this all, newcomer Cleo Meinck creates a touching portrayal of the young Lawrie, passionate about flying and buffeted by prejudice. Fly Girl is a commission from Ensemble Theatre artistic director Mark Kilmurry who, after the success of How to Plot a Hit in Two Days, continues to tap the rich vein of nostalgia for iconic cultural moments.\n\nThe script leans into the gloriously unselfconscious sexism of 1970s Australia, where women become “old boilers” after 21 and menstruation is a mental illness. But period observations aren’t just for laughs: the production builds in power across the second act, and as Lawrie’s fight plays out in court, we see the ripples of change coming for traditional female roles. THEATRE\n\nSHIRLEY VALENTINE\n\nTheatre Royal, October 22, until October 26\n\n★★★\n\nShirley Valentine is in a rut. She’s not so much climbing the walls as talking to them. Her claustrophobic kitchen with its florid wallpaper can barely contain the big personality that is Natalie Bassingthwaighte’s Shirley Valentine, a woman straining to break free. Natalie Bassingthwaighte as Shirley Valentine. Credit: Brett Boardman\n\nWithin her cramped confines, and lubricated by a glass or three of riesling, the middle-aged Liverpool housewife overshares and wisecracks about her life, marriage, kids and clitoris. What happened to the adventurous Shirley Valentine she used to be before she became Mrs Joe Bradshaw? Will she have the guts to go to Greece for a holiday with the friend who has bought her a ticket? The answers are probably best known to audiences through the popular 1989 film adaptation with Pauline Collins. Bassingthwaighte is a firecracker of a Shirley in this one-woman touring show. She’s funny, capricious and insightful as she navigates her character’s transformation and the shifts from humour to pathos and back again. I saw the first London season of Willy Russell’s play in 1988. It was thrilling to see a story rooted in my home city that put the hopes and dreams of a mature working-class woman centre stage. She felt like our mothers, aunts, neighbours. Shirley’s candour and wit felt as innovative then as Phoebe Waller-Bridge’s Fleabag (which started life as a play) did more recently.\n\nWhat strikes me seeing the play again after so long is how, beneath the laughs – and there are many – are shards of a darker tale of coercive control than I recall. Loading It’s this aspect that director Lee Lewis has teased out in her thoughtful production. We see Shirley’s jocular demeanour turn twitchy and anxious as she hears Joe arriving home. Her line about being beaten and battered is delivered with sufficient ambiguity to leave you questioning whether she’s not merely talking metaphorically. And when Shirley says she knows she’ll pay for running away to Greece when she returns, the sense of menace is inescapable. It’s clear that Shirley’s flagging confidence didn’t begin – or end – with marriage to her controlling husband, who expects his egg and chips on a plate the moment he walks through the door. There was the headmistress who predicted Shirley would never go far. There’s the grown-up daughter who returns home expecting Shirley to again tend her every need.\n\nThe odds have long been stacked against Shirley. The polymath Russell (he’s also a musician, painter and former hairdresser) threads lively tales of other women in Shirley’s life, including of her neighbour Gillian, one of several minor character Bassingthwaighte convincingly creates. The Liverpool accent wobbles, and at more than two hours the pieces sags in the run-up to interval. The shorter second half is set in Greece, in which Simone Romaniuk’s set uses the entire stage, and is sunnier in tone and appearance. Nearly four decades on, a stay-at-home housewife is a less common figure than she once was, and jetting off to Greece a lot less daring. Nonetheless, it’s impossible not to cheer as this spirited Shirley discovers the world beyond her walls.\n\nMUSIC\n\nBILL FRISELL TRIO\n\nCity Recital Hall, October 22\n\nReviewed by JOHN SHAND\n\n★★★★½ There are nights in the Blue Mountains when you gaze at the night sky with all the wonder of a child’s eyes. Hearing the Bill Frisell Trio is like that. A deep sense of mystery pervades the music, with notes from Frisell’s guitar flaring, glittering and then fading, to be replaced by fresh improbabilities. Jazz guitarist Bill Frisell (centre) with the other members of his trio, drummer Rudy Royston (right) and bassist Thomas Morgan (left). Credit: Matthew Septimus Rudy Royston’s drumming is no less mysterious. Few people have played the instrument with a musicality so complete that he could solo with brushes on a slow ballad, and have at least as much of substance and relevance to say as Frisell or that master of understatement, bassist Thomas Morgan.\n\nMany others, from Pharoah Sanders all the way to Arvo Part, have made mysterious music, but few, aside from the late trumpeter Lester Bowie, combined that quality with such goofy playfulness. There were times during this concert when it was like watching three children utterly absorbed in the same sandpit. This is among the great jazz bands in its combination of personalities, sounds, ideas and interaction. They second-guess and surprise each other in equal measure, while often playing with candlelit intimacy, as if we’re eavesdropping on conversations that are no less private for being musical. There’s astonishing detail in the crafting of sounds and precision in the blending of them. Whereas last time they were here, in 2019, they played songs from the screen-music-oriented When You Wish upon a Star (which tended to be rowdier and larger than life), here, concentrating on material from the Valentine album, they were closer to the art of the miniaturist, and the exceptional sound mixing allowed you to catch the infinite subtleties emanating from all three instruments. They opened with flurries of arrhythmic notes, that, like random filings suddenly being attracted to a magnet, solidified into a blues: Frisell’s Thelonious Monk-influenced title track from Valentine. His playing was typically idiosyncratic in its sweet and sour harmonies, while Royston had the drums and cymbals singing, and Morgan growled and prowled around the lurching, swinging groove with the minimum of notes. The compositions segued into one another, whether blurring where one stopped and another started, or with bold leaps of contrast. The commonality was seemingly infinite options, from the gentleness and naivety of a nursery rhyme, to howling guitar against a jolting backbeat. Always the music was in flux – ranging all the way to Johnny Mercer’s I’m an Old Cowhand (from the Rio Grande), which they played with contagious fun. But, as with Burt Bacharach’s What the World Needs Now Is Love, there was no hint of satire; rather a celebration of these songs’ innate beauty, which somehow came into sharper focus without the distraction of lyrics.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/lifestyle/health-and-wellness/breast-implants-are-getting-smaller-it-s-not-a-win-for-body-acceptance-20251024-p5n4yj.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Breast implants are getting smaller. It’s not a win for body acceptance",
        "publish_date": "Fri, 24 Oct 2025 11:45:00 +1100",
        "category": "lifestyle",
        "authors": [
            "Amber Ferguson",
            "Samantha Chery"
        ],
        "text": "Those who have had explants often frame it as a broader shift away from the “boob job era” of the 1990s and 2000s, reclaiming their autonomy from a cultural moment that idolised hyper-augmented bodies. Alka Menon, an assistant professor of sociology at Yale University, describes how social media has accelerated these beauty cycles and makes trends turn faster. “What took decades to shift from Marilyn Monroe to Kate Moss now happens in a few years. The algorithm determines what version of beauty you’re exposed to,” Menon says. “Cosmetic surgery moves on a trend model. Minimalism is the name of the game now.” In the 1990s, Garth Fisher was one of the notable plastic surgeons performing breast augmentations for Playboy models. At the time, Pamela Anderson, Carmen Electra and Anna Nicole Smith graced its pages with cleavage that would be described as anything but minimalist. Playboy “had such a tremendous and profound impact on culture and how girls wanted to have their breasts look”, Fisher says. Now, after 30 years in the business and more than 23,000 breast surgeries, Fisher has noticed fewer of his clients seeking “Playboy playmate” or “Penthouse pet”-sized implants. Loading “It’s really no surprise to me that for a time, breast implants were hugely popular, but they’ve lost their appeal,” says Victoria Pitts-Taylor, chair of Feminist, Gender and Sexuality Studies at Wesleyan University. “They’ve become over-present, passé and they’re not compatible with wellness and detoxifying lifestyles people are moving toward.”\n\nTim Neavin, the Beverly Hills plastic surgeon who performed Milano’s breast implant removal, says that over the past five years, he’s seen more and more women decide to downsize or remove their implants. Some ask to remove their implants after experiencing fatigue, headaches, rashes, joint pain or brain fog – symptoms associated with what’s been called “breast implant illness”. For others, it’s simply a change in taste, with women feeling like the implants “don’t belong on their body any more”, he says. Many opt for a fat transfer, which involves moving fat from other parts of the body, like the hips or abs, and injecting it into the breast area. Beverly Hills surgeon Cat Begovic has seen a huge increase in women specifically asking for the fat transfer procedure over implants which will give only a subtle increase in volume to the chest and at most will increase one’s breast by one cup size. “It’s something that I do all the time. I think probably in the last month, I’ve done probably four fat transfers to the breast, and they were all very fit, lean patients. They were extraordinarily happy just because they wanted to still be in the same bra size but just be a little more filled,” Begovic says. She adds that implants are “not a lifetime device. Especially if we’re talking about silicone implants. It’s definitely recommended to do a replacement somewhere around 10 years, just because statistically, the rupture rate at 10 years is around 16 to 18 per cent”. Patients come to Boston-based plastic surgeon Sean Doherty with pictures of actor Kate Hudson more than anyone else. “I feel like women in their 40s really always admired her breasts, and people like that ‘yoga breast’ look and want that natural enhancement,” Doherty says. On the opposite side, he says his younger patients usually bring in pictures of influencer Alix Earle, who has been open about her saline implants.\n\nLoading Despite more advanced techniques, bigger implants still tend to come with a slightly greater risk for complications, says Reza Nassab, a plastic surgeon in England. Meanwhile, the “ballerina boob job” and Motiva Preservé – a minimally invasive breast augmentation that requires only light sedation – have become trendier. Nassab says some of his swimwear model patients came to his office to downsize their implants as they set their sights on more high-end fashion opportunities. Pitts-Taylor says individual motivations like rejecting objectification can coexist with larger cultural shifts that still reinforce beauty norms. “Even as women like Pamela Anderson or Alyssa Milano resist objectification, they’re still asked to account for their choices. Pamela goes without make-up and has to address it. Milano removes implants and discusses it publicly,” she says. “I think that speaks to the continued pressure on women’s bodies, the commodification and commercialisation of appearance that isn’t lessening simply because the aesthetic is turning more ‘natural’.”\n\nThere’s pressure to have a more prominent chest or to have a slimmer physique, but there’s also pressure on women to explain how society’s noise can inform their very personal medical decisions. Celebrities such as Kylie Jenner (seen at the 2025 Met Gala) have been open with fans about the details of their breast augmentations. Credit: Getty Images Nowadays, celebrities are less coy about their surgeries. Take, for instance, when TikToker Rachel Leary pleaded with Kylie Jenner to share her breast surgery details: “To me, you have got what I am looking for to have done in terms of a boob job,” Leary says in the video posted in June. “It’s the most perfect, natural-looking boob job ever.” Jenner replied: “445 cc, moderate profile, half under the muscle!!!!! silicone!!! garth fisher!!! hope this helps lol.” By August, Leary was shaking hands with Fisher, whose “incredible skillage” led to Leary walking away with her own “masterpieces”.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/culture/art-and-design/from-demon-hunters-to-pennywise-and-wednesday-addams-here-are-the-costumes-everyone-will-be-wearing-this-halloween-20251020-p5n3qm.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "From demon hunters to Pennywise and Wednesday Addams, here are the costumes everyone will be wearing this Halloween",
        "publish_date": "Fri, 24 Oct 2025 11:30:00 +1100",
        "category": "finance",
        "authors": [
            "Nell Geraets"
        ],
        "text": "Save Log in , register or subscribe to save articles for later. Save articles for later Add articles to your saved list and come back to them any time. Got it Normal text size Larger text size Very large text size The spooky season has taken hold in Australia. Despite once being considered an “American holiday”, Halloween will be celebrated by one in five Australian adults this year, according to the Australian Retailers Association. And an estimated $500 million will be shelled out on Halloween costumes, decorations and confectionaries across the country – 11 per cent more than last year. About 43 per cent of that budget will be spent on costumes, from skeletons to sexy nurses. But as popular as the classics are, an increasing number of Australians are opting for costumes that say something about themselves, whether that’s their favourite show or a meme they can’t stop quoting. “For many, it’s not just about dressing up. It’s about creating a moment, a memory or a character that feels cinematic,” says Alicia Slater, co-owner of Little Shop of Horrors Costumery in Mornington, south-east of Melbourne. Some classics never die: Louise Mack, co-owner of Little Shop of Horrors Costumery, will lean into the spookiness as The Exorcism’s Regan this year. Credit: Alex Coppel Slater says Wednesday Addams has been a popular choice following the recent second season of the TV series Wednesday, and Pennywise costumes have already sold out ahead of the It prequel series Welcome to Derry. The popular Melbourne run of The Beetlejuice Musical has also inspired an influx in Lydia Deetz and Beetlejuice requests. It’s similar in Sydney, where Netflix sensation K-Pop Demon Hunters dominates costume wish-lists. Sydney Party Decorations manager Neo Cui says they’ve sold out of Demon Hunters costumes multiple times, and are now restocking weekly. “Halloween has evolved into one of the biggest annual carnival-style celebrations,” Cui says. “It’s become about self-expression ... not just about being scary,” Cui says.\n\nAdvertisement\n\nThe fear-factor hasn’t vanished, though. Belinda Marsh, director of Sydney’s Fancy That Costumes and Balloons, says spooky costumes will always be a staple, including Ghostface, Freddy Krueger and The Exorcism’s Regan. “Any costume can be turned into a scary Halloween costume. Add some special FX make-up, and you’ve zombified whatever it was ... One of my favourites was a young boy last year who went as a ‘Boo-nana’ – our giant banana costume plus scary make-up,” Marsh says. Jessica Robinson from Fancy That Costumes and Balloons knows that K-Pop Demon Hunters will be all over Halloween this year, so she’s jumping on the pop-cultural bandwagon. Credit: James Brickwood Her store has also sold many Donald Trump MAGA hats this year. Though Trump-related costumes slowed after he reclaimed the US presidency, Marsh says mocking the MAGA phenomenon now could make it “a little less heavy” for some. Bald caps have also become a bestseller thanks to Pitbull’s recent Australian tour. Beyond this, Marsh says major productions such as Wicked and The Bad Guys, and sentimental favourite The Rocky Horror Picture Show, which had its 50th anniversary this year, have been popular choices. So, if you’re keen to stand out this Halloween, here are some tips. Astronaut Katy Perry\n\nAdvertisement\n\nRemember when Katy Perry, along with five other women, went on an 11-minute space flight? It was all anyone could complain about in April. Jeff Bezos’ all-female Blue Origin voyage was hit-and-miss when it came to what it would do for feminism, but that doesn’t mean it can’t make for a brilliant ’stume. Just look at that form-fitting blue spacesuit. Katy Perry went to space. Yes, that is something that actually happened this year. Credit: Instagram (@katyperry) The Coldplay jumbotron It has presumably been a surreal year for Andy Byron, the former chief executive of tech company Astronomer, who resigned from his post after being caught cosying up to someone who was not his wife on the jumbotron at a Coldplay concert in July. But one person’s nightmare was the world’s pop-culture catnip. For months, this random CEO’s love life was a regular dinner-table discussion, so why not bring it back for Halloween by dressing up as the very jumbotron screen that brought the story to light? Peekaboo, we see you. Credit: TikTok/@instaagrace\n\nAdvertisement\n\nA labubu If you haven’t seen a labubu yet, you’re probably living under a rock. Every second person appears to have one of these little monstrosities clipped to their bags, the demonic, toothy smiles taunting whoever is walking behind it. These are the talk of the town among Gen Z, who feverishly try to snatch up the rare versions before they sell out (they’re almost always sold out) and sniff out the fakes or “lafufus”. What fresh hell are they? They’re labubus, of course – Gen Zs new favourite obsession. Credit: Getty Images Chuck on a onesie, paint an ungodly smile on your face, and you’re set. Chicken jockey A lethal zombie baby riding a chicken. Yes, that is where popular culture is at right now.\n\nAdvertisement\n\nLoading Much to the chagrin of cinema staff, the chicken jockey – a popular meme among Minecraft fans – in A Minecraft Movie invited insane reactions from crowds, including screaming, throwing popcorn and toilet paper, dancing and jumping on friends’ shoulders. One person even brought an actual live chicken. You can either buy or create your own chicken jockey suit (to be worn alone or with someone else), or dress your dog up as a chicken with a little plush zombie on its back. The Summer I Turned Pretty love triangle Seventy million viewers tuned in to watch the final season of this Amazon Prime romance flick within its first 70 days of streaming. There were watching parties around the world, and friendships were lost over debates around who Belly should choose. So yeah, you could say it was a big deal. When it comes to dressing up as the show for Halloween, I don’t mean dress up as Belly or Jeremiah. That’s boring. I mean dress up as the literal love triangle. Slap a triangle on a white shirt with the printed-out faces of Belly, Jeremiah and Conrad at the end of each point, and call it a day.\n\nAdvertisement",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/nsw/northern-beaches-hospital-is-in-public-hands-here-s-what-happens-next-20251022-p5n4e7.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Northern Beaches Hospital is in public hands. Here’s what happens next",
        "publish_date": "Fri, 24 Oct 2025 11:30:00 +1100",
        "category": "finance",
        "authors": [
            "Angus Thomson"
        ],
        "text": "Save Log in , register or subscribe to save articles for later. Save articles for later Add articles to your saved list and come back to them any time. Got it Normal text size Larger text size Very large text size Late on Tuesday, after Premier Chris Minns went on morning radio to announce the end of the private ownership model at Northern Beaches Hospital, an email landed in the inboxes of more than 19,000 Healthscope staff across Australia. It was from chief executive Tino La Spina, thanking them for their work amid “external noise and impending change”. He defended the hospital’s performance under Healthscope, and took a parting swipe at the Minns government. “For any partnership to work it must have goodwill on both sides,” he wrote. “Sadly, the political will does not exist and it is in this context we are returning the hospital.” The deal may be done in principle, but there are still many questions about how the hospital will operate under public control. Here, we break down just a few. The news Healthscope, which went into receivership in May with $1.6 billion in debt, will receive $190 million from NSW taxpayers to exit its contract to operate the hospital until 2038. The 494-bed hospital will be integrated into the state’s public health system under the direct control of the Northern Sydney Local Health District, which oversees other major public healthcare services, including the Royal North Shore Hospital.\n\nAdvertisement\n\nAll doctors, nurses, and support staff will be offered jobs by NSW Health to continue working at the hospital. Why did the NSW government take control? Locals have campaigned against the private ownership model since it was first unveiled in 2013. Several high-profile incidents in the hospital’s first year, including one in which a cancer patient had the wrong side of his colon removed, did little to inspire the community’s confidence. Labor campaigned against the public-private partnership in opposition but remained committed to the contract in government, even when Healthscope’s finances worsened and the company offered to hand back the hospital 14 years earlier than planned. The Massa family’s campaign following the death of their two-year-old son Joe, and Healthscope’s worsening financial outlook, ultimately forced the Minns government to act. What it means for patients\n\nAdvertisement\n\nAll 494 beds at the hospital will be fully integrated into the public system, something multiple inquiries and audits found to have been complicated by the public-private partnership. The hospital will also benefit from the nurse-to-patient ratios rolling out at all public hospitals in the state. What it means for more than 130,000 northern beaches residents with private health insurance is less clear. About 180 beds were reserved for private patients under the previous model, and the hospital performs about 20,000 private elective surgeries every year. Some doctors argue the public-private model allows the hospital to provide public patients with treatments that wouldn’t be possible otherwise. The hospital’s angiography and around-the-clock heart attack services, for example, could become unviable without the high volume of elective angiography funded privately, the hospital’s director of cardiac services told a parliamentary inquiry last week. By the numbers Taxpayers will pay $190 million to take over the hospital. Minns said on Tuesday the original contract included a potential exit payment to Healthscope “ north of $800 million ”.\n\nto take over the hospital. Minns said on Tuesday the original contract included a potential exit payment to Healthscope “ ”. The hospital has capacity for 494 beds . About 180 beds are currently reserved for private patients.\n\n. About are currently reserved for private patients. There were 132,491 people with private health insurance on the northern beaches in 2022, according to the Australian Bureau of Statistics. Industry group Private Health Australia estimates as many as 79 per cent of the northern beaches population is covered by health insurance. What they said\n\nAdvertisement\n\nWhat’s next The formal transition of the hospital will begin next month, La Spina said in his email to staff. The government expects to take full control by mid-2026. Binding legal and commercial terms still need to be finalised, and the government said it still retains the option to terminate the contract through legislation introduced to parliament this year. Minns did not say how the hospital would actually operate under the new arrangement, but the government will consult doctors and other staff to determine future clinical services and an operating model, “including the role of private services in the hospital footprint”. Loading Tuesday’s announcement blindsided many doctors treating both public and private patients at the hospital. At a meeting of more than 60 medical staff on Thursday night, many said they were already making plans to leave, while others resolved to publicly campaign against the decision, three doctors unauthorised to speak publicly said. “It’s fair to say that there was a lot of anger and disappointment in the meeting … we think this is a very poor decision that has been driven by politics and ideology,” one doctor said. The unions representing nurses, midwives, and salaried doctors all welcomed the hospital’s public takeover, and said they would work with the government to address long-standing understaffing, overwork and exhaustion issues.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/goodfood/recipes/quick-tasty-zero-mess-20-simple-ways-to-make-pasta-magic-in-under-30-minutes-20251014-p5n2hn.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Quick, tasty, zero mess: 20 simple ways to make pasta magic in under 30 minutes",
        "publish_date": "Fri, 24 Oct 2025 11:29:18 +1100",
        "category": "sports",
        "authors": [],
        "text": "Recipe collection\n\nQuick, tasty, zero mess: 20 simple ways to make pasta magic in under 30 minutes\n\nThe winning formula for World Pasta Day? Keep it fast, keep it flavourful, and keep the cleanup minimal with these essential recipes.",
        "source": "TheAge"
    },
    {
        "url": "https://au.news.yahoo.com/aussies-distressed-after-company-accidentally-transforms-20km-of-rural-canal-into-death-trap-014027225.html",
        "title": "Aussies 'distressed' after company accidentally transforms 20km of rural canal into 'death trap'",
        "publish_date": "2025-10-24T01:40:27Z",
        "category": "finance",
        "authors": [],
        "text": "One of Australia’s largest private irrigation companies has “unintentionally” transformed kilometres of a supply channel into a “death trap” for native animals. The problem occurred after Murrumbidgee Irrigation engineers upgraded the watercourse by lining its rough concrete walls with black plastic, which is slippery when wet, and impossible for animals to grip onto.\n\nAccording to locals, the drownings have been centred along a 20km section of canal that runs through farmland in Griffith, a NSW Riverina city commonly referred to as the foodbowl of Australia. One picture supplied to Yahoo News shows the bodies of seven kangaroos floating in one spot, but locals say the problem has been ongoing for years and they've lost count of the dead.\n\nResponding to questions from Yahoo News, the company has agreed this week to address the problem, but for many residents, a solution can’t come quickly enough. “It’s been pretty awful,” local school bus driver Anita Tovo told Yahoo News.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nDespite not having any wildlife training, fishing struggling animals out of the water has largely fallen on her shoulders. She frequently spots kangaroos drowning during her regular route beside a stretch of the Lakeview Branch Canal, and they’re sometimes noticed by the kids riding with her.\n\n“I don’t think I’ve ever gone down the road, morning or afternoon, and not seen a drowned kangaroo, all through the summer season,” she told Yahoo News.\n\nEarlier this month, she photographed the bodies of seven kangaroos, floating dead in the water.\n\nOn October 13, a Griffith school bus driver saw seven kangaroos dead in the canal. Source: Supplied\n\nThe Lakeview Branch Canal can be seen running through the centre of this satellite image. Source: Google Earth\n\nOn a separate occasion last year, a small kangaroo managed to scramble out of the water. A picture taken by Anita shows the animal staring back at the camera through thick foliage following its escape. But because the channel is protected by a high fence with few openings, it fell in again and drowned three days later.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\n“It was floating in the water. I was just so frustrated, I wished I’d just got bolt cutters and mutilated the fence,” she said.\n\nRescue volunteer struggles to respond to channel incidents\n\nNSW’s largest wildlife rescue service, WIRES, has a small presence in the sprawling Griffith area. The closest rescue volunteer to the channel, Amanda McCloy, works as a busy nurse over 50km away.\n\n“By the time someone finds a kangaroo during the day at first light, it's probably been in there for hours, and by the time I'd get out there, it's too late, they're drowned,” she told Yahoo.\n\nShe describes the situation created by the plastic lining as \"shocking\". Only on one occasion has she been able to fish a young kangaroo out of thick silt at the bottom of a canal when the water was low.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\n“There’s no point having plastic in there, keeping the water clean, if animals are dying in there, and animals are rotting in there,” she said.\n\nThis kangaroo managed to scramble out of the canal but died days later after falling in again. Source: Supplied\n\nThis is the only kangaroo that WIRES volunteer Amanda McCloy has been able to rescue from the channel. Source: WIRES\n\nIrrigation company responds to community concern\n\nAfter being contacted by Yahoo News, Murrumbidgee Irrigation asserted there are strategic exit points in the fence, and that camera monitoring and regular inspections help the company “respond quickly to any incidents”.\n\nBut it also acknowledged the “distressing reports of animals becoming trapped” in its channels from the community.\n\n“We understand that these incidents are upsetting and empathise with those who have witnessed or been affected by them. It is concerning whenever any animal is injured, regardless of the circumstances,” it said in an email.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nIt confirmed 113 kilometres of supply channels had been lined to both improve water delivery and reduce seepage. “While these upgrades are essential for ensuring efficient and sustainable water use, we acknowledge that they can unintentionally impact local wildlife,” it said.\n\nAnita Tovo said kangaroos can be seen drowned throughout the summer. On Tuesday, she spoke to Yahoo News and took this image of one dead in the canal. Source: Supplied\n\nMurrumbidgee Irrigation makes commitment after canal drownings\n\nResponding to Yahoo News about the issue, Murrumbidgee Irrigation committed to improving its infrastructure to improve wildlife safety. It also agreed to work with WIRES head office to combat the problem.\n\nWIRES CEO Leanne Taylor said the drowning deaths have been “distressing” for both members of the public and its volunteers.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\n“WIRES welcomes an immediate collaboration with Murrumbidgee Irrigation and other Emergency Services agencies to assist with the rescuing and release of native wildlife trapped in this stretch of channel,” she said.\n\n“Further proactive measures by Murrumbidgee Irrigation is greatly appreciated to help prevent the suffering being caused to these poor animals.”\n\nLove Australia's weird and wonderful environment? 🐊🦘😳 Get our new newsletter showcasing the week’s best stories.",
        "source": "Yahoo"
    },
    {
        "url": "https://au.news.yahoo.com/concerning-claim-rebel-lawsuit-013148620.html",
        "title": "‘Concerning’ claim in Rebel’s lawsuit",
        "publish_date": "2025-10-24T01:36:44Z",
        "category": "finance",
        "authors": [],
        "text": "Rebel Wilson’s honesty has been thrown into question in court after an actor who starred in her troubled film The Deb launched a lawsuit against the Aussie star.\n\nActor Charlotte MacInnes’ defamation case in the NSW registry of the Federal Court concerns social media posts made by Ms Wilson.\n\nThe posts are said to imply that Ms MacInnes lied when denying she made a complaint about one of the film’s producers, Amanda Ghost, allegedly sexually harassing her or engaging in other unacceptable behaviour that made her feel uncomfortable, documents released by the court and seen by NewsWire claim.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nThe posts also allegedly imply that Ms MacInnes “changed her story” about the alleged complaint in return for a lead role in another of Ms Ghost’s productions and a record deal.\n\nThe documents claim the imputations are “false and seriously defamatory”, harming Ms MacInnes’ reputation at a critical point in her career.\n\nMs MacInnes’ lawyer Sue Chrysanthou SC on Friday argued in the NSW Federal Court that Ms Wilson should not need additional time to file a statement to the court if she was “telling the truth”.\n\n“People telling the truth don’t need to see documents in order to make a statement,” Ms Chrysanthou told the court.\n\nRebel Wilson is facing legal action over a series of social media posts. Picture: NewsWire / Christian Gilles\n\nCharlotte MacInnes starred in Ms Wilson’s troubled film The Deb. Picture: Supplied.\n\n“We don’t understand why … she would be assisted by text messages to help her remember what happened.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\n“That’s concerning to us.”\n\nShe argued that Ms Wilson must be “very familiar with what she thinks happened”, claiming the Aussie actor had repeatedly aired the allegations in public.\n\n“We’re highly concerned about this notion that (Ms Wilson) would need to see documents in advance,” Ms Chrysanthou said.\n\n“I don’t think there’s any need for delay when it comes to the exchange of evidence.”\n\nRenee Enbom KC, acting for Ms Wilson, rejected the claim.\n\n“People who are giving evidence about events that occurred three years ago often need to be assisted by documents,” Ms Enbom said.\n\nMs Wilson’s lawyer denied claims that the star continued to ‘attack’ Ms MacInnes after court proceedings were launched. Picture: Araya Doheny/Getty Images.\n\nThere was further dispute about when Ms Wilson should be required to file all of her evidence in the case.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nMs Enbom pushed for an extra two months or so from the proposed date in December, telling the court it was not enough time to pull together evidence from about 10 witnesses.\n\n“That is an unbelievable delay in a defamation case,” Ms Chrysanthou hit back.\n\n“Ms Wilson is not busier than … any other litigant in this court.”\n\nNatalie Abbott, Rebel Wilson, Charlotte MacInnes and Stevie Jean at a party to celebrate the launch of The Deb. Picture: Dave Benett/Getty Images for Warner Music\n\nShe claimed her client, also an actor, had been “unapologetically defamed”, and Ms Wilson was “clearly not too busy” to keep making claims against Ms MacInnes.\n\nMs Chrysanthou claimed Ms Wilson had continued to “attack” Ms MacInnes despite the court proceedings; however, Ms Enbom said there was no evidence of this.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\n“I don’t accept that my client is continuing to attack Ms MacInnes publicly … there’s no evidence of that,” Ms Enbom said.\n\nJustice Elizabeth Raper ultimately ordered Ms Wilson to file her statement by December 10 and the rest of her evidence by February next year before a directions hearing scheduled for February 27.\n\nMs Enbom said Ms Wilson’s affidavit would be “extensive”.\n\n“Her evidence is not simple and straightforward, it goes back to 2022 … and it deals with numerous issues, not just the sexual harassment.” Ms Enbom said.\n\nShe indicated the trial would likely span up to four weeks, prompting Justice Raper to ask “Really?”\n\nLawyers for Ms MacInnes sent a concerns notice to Ms Wilson in August and launched proceedings on September 22 after Ms Wilson allegedly failed to respond within 28 days.",
        "source": "Yahoo"
    },
    {
        "url": "https://au.news.yahoo.com/plane-makes-emergency-landing-sydney-004008750.html",
        "title": "Plane makes emergency landing in Sydney",
        "publish_date": "2025-10-24T01:21:33Z",
        "category": "finance",
        "authors": [],
        "text": "An international flight from New Zealand has been forced to make an emergency landing at Sydney Airport after a reported mid-air hydraulic failure.\n\nFlight NZ221, departing from Christchurch to Sydney, reported a technical issue mid-air and was forced to make the landing before 9am Friday as a precaution, Air New Zealand chief safety and risk officer Nathan McGraw said in a statement.\n\n“The aircraft landed safely, and our engineering team will now carry out inspections to ensure the aircraft is safe to return to service,” Mr McGraw confirmed.\n\nFlight NZ221, departing from Christchurch to Sydney, reported a technical issue mid-air. Picture: Supplied\n\nIt is understood a hydraulic issue on-board was the reason for the emergency landing in Sydney. Picture: Supplied\n\nPassengers were informed mid-flight about the emergency landing via an in-cabin announcement.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nEmergency services, including Sydney Airport’s Fire and Rescue crews and ground support vehicles, attended the aircraft as it touched down.\n\nIt is understood the plane remained stationary on the tarmac for two hours as engineers assessed the hydraulic issue, before the plane was towed to the gate and passengers allowed to disembark.\n\nThe aircraft landed safely after being forced to make the emergency manoeuvre. Picture: Supplied\n\nOne passenger on board told The Daily Mail the landing was still “smooth” and everyone was calm on board.\n\nAnother said it was confusing at first as no-one knew what was going on.\n\n“When we landed, we had to wait on the plane for about an hour,” the passenger told the outlet.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\n“There were fire trucks and flashing lights everywhere, which was a bit of an experience. It felt a little unsettling, but everyone stayed patient.\n\n“I just wanted to stand up and move around, but it was fine overall.”\n\nMore to come.",
        "source": "Yahoo"
    }
]