[
    {
        "url": "https://www.9news.com.au/national/anthony-heraghty-super-retail-rebel-bcf-supercheap-auto/d35af5ef-29dd-4f7c-8290-9cedd70b7595",
        "title": "Rebel, BCF, Supercheap Auto boss sacked over company relationship",
        "publish_date": "Tue, 16 Sep 2025 00:00:13 +0000",
        "category": "finance",
        "authors": [
            "Sep"
        ],
        "text": "Super Retail Group CEO and group managing director Anthony Heraghty has been sacked with immediate effect following new information about an alleged romantic relationship he had in the workplace.\n\nThe board of Super Retail - which boasts in its portfolio some of Australia's most recognisable brands such as Rebel Sport, BCF and Supercheap Auto - informed shareholders this morning that Heraghty's employment had been terminated.\n\nIn the notice to shareholders, the board said it had received \"new information\" regarding the nature of Heraghty's relationship with the group's former chief human resources officer Jane Kelly.\n\nREAD MORE: Two earthquakes shake regional NSW overnight\n\nAnthony Heraghty has been sacked as the CEO of Super Retail, which has Rebel Sport, BCF and Supercheap Auto among its brands. (Ben Searcy)\n\n﻿\"In light of this new information, the Board has concluded Mr Heraghty's prior disclosures were not satisfactory,\" the statement reads.\n\n\"The Board will carefully consider the implications this may have for the company and any related matters.\"\n\nHerag﻿hty's ties to the company, which include unvested incentives and vested but unexercised rights, have been lapsed by the board.\n\nREAD MORE: ﻿ Another Trump ordered strike on alleged Venezuelan drug boat kills three\n\nSuper Retail CEO Anthony Heraghty on results day in Sydney on August 22, 2024. (Dominic Lorrimer)\n\nSuper Retail's current chief financial officer David Burns has been appointed as the interim CEO while a search begins for Heraghty's replacement.\n\nSuper Retail has a market capitalisation of $3.9 billion, and posted a net profit of $232 million in financial year 2025.﻿\n\nMore to come.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/asic-chair-admits-he-banks-with-anz/7ce5f9f9-faee-417f-a0f2-ce257c3cac3a",
        "title": "ASIC chief makes startling admission on live TV as he slams ANZ misconduct",
        "publish_date": "Tue, 16 Sep 2025 00:17:27 +0000",
        "category": "finance",
        "authors": [
            "Sep"
        ],
        "text": "D﻿uring a live interview discussing ANZ bank's \"widespread misconduct\", the head of the Australian Securities Investments Commission made a stunning admission.\n\nJoe Longo was speaking with the ABC last night over the corporate watchdog's decision to seek fines against the major bank of $240 million for its alleged misconduct which affected 65,000 customers over a period of years.\n\nHe was discussing the ASIC action on the broadcaster's 7.30 show when Host Sarah Ferguson asked him if he would bank with ANZ.\n\nREAD MORE: Aussie staples under threat of being wiped out in just decades\n\nASIC chair Joe Longo admitted on live television he banks with ANZ. (ABC)\n\n﻿\"Actually, I do bank with ANZ,\" replied Longo.\n\nFerguson pressed him about switching banks.\n\n\"Well, that's not appropriate for me this evening to talk about my personal banking arrangements,\" said Longo.\n\nFerguson pointed out he'd made the admission, and went on to ask if he felt ANZ had failed him.\n\nLongo said he felt \"very let down as a regulator\".﻿\n\nASIC deputy chair Sarah Court told Today this morning some of the most vulnerable Australians were impacted by ANZ's misconduct.\n\nShe says in asking the federal court to fine the big four bank $240 million, the regulator was sending a message to the entire banking industry.\n\n\"The reason you have high penalties, if the court imposes them, is to send a real deterrent message to ANZ, but also to any other banks that are thinking about engaging in this kind of misconduct.\"",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/centrelink-payments-changes-2025-new-rates-september-20-everything-to-know-explained/7ad1411a-7f1e-4e0d-b1dd-c1dd45803dd6",
        "title": "Millions of Aussies to get a cash boost this Friday as Centrelink payments jump",
        "publish_date": "Tue, 16 Sep 2025 01:32:56 +0000",
        "category": "finance",
        "authors": [
            "Sep"
        ],
        "text": "Millions of Australians will get a cash boost this week as Centrelink payments increase under indexation changes, offering relief in the cost-of-living crisis.﻿\n\nThese changes are made every year in March and September and are designed to ensure that payments keep up with inflation.﻿\n\nHere's everything you need to know about the Centrelink payment changes.﻿\n\nREAD MORE: Aussie staples under threat of being wiped out in just decades\n\nA number of Centrelink payments will increase this week, offering relief to many struggling in the cost of living crisis.﻿ (Dylan Coker / The Sydney Morning Herald)\n\nWhich Centrelink payments are getting the increase?\n\nA number of payments will increase this week, including the age pension, carer payment, and disability support pension.\n\nFederal rent assistance, youth allowance and JobSeeker payments will also jump to keep up with inflation.\n\nThe income limits for some payments will also increase, ﻿meaning more Aussies may be eligible to receive them.\n\nWhen do the new Centrelink payment rates start?\n\nThe changes will come into effect on Friday, September 20.﻿\n\nRecipients will ﻿see the first increased payment in their bank account from that date onwards.\n\nREAD MORE: Father and son face fate over car chase murder\n\nWant a pay rise? These jobs experienced the fastest salary growth this year View Gallery\n\nHow much are payments increasing in September 2025?\n\nThe dollar amount each payment will increase by varies.\n\nThe age pension will jump by $29.70 for singles, increasing the total fortnightly payment from $1149.00 to $1178.70 $29.70.\n\nFor couples it will increase by $22.40﻿ each, resulting in a total fornightly payment of $888.50 per person.\n\nSingle parents will receive a $16.20 boost and partnered parents will get an extra $11.40.\n\nThat will bring total fortnightly payments to ﻿$1039.70 and $734.40 respectively.\n\nRental assistance will go up by just $3.40 for singles and $3.20 for couples, with fortnightly payments to sit at $215.40 and $203.﻿\n\nRental assistance for families will increase by up to $4.48.\n\n﻿JobSeeker payments will jump by $12.50 for singles over 22 with no children, bringing the fortnightly total up from $781.10 to $793.60.\n\nCouples will receive an extra ﻿$11.40 each.\n\nYouth allowance will increase by $16.20, jumping from $1011.50 per fortnight to $1027.70.﻿\n\nSome payments will increase by just a few dollars per fortnight. (Getty)\n\nDo you need to do anything to get the new rate?\n\nNo. These rate changes will automatically be applied to any payments made after Friday, September 20.﻿\n\nWhy are Centrelink payments indexed twice a year?\n\nCentrelink payments are indexed twice a year to ensure payments keep up with inflation and the rising cost of living.\n\nThese changes are based on a number of factors, including the consumer price index, weekly wage changes, and the pensioner and beneficiary living cost index.﻿\n\nThe next change will be in March 2026.﻿",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/first-guardian-superannuation-collapse-queensland-man-phil-loses-hundreds-of-thousands-forced-to-reverse-retirement/170a3c03-4e70-4584-8f37-04df79d27f3c",
        "title": "Phil was forced to reverse his retirement after losing $240,000",
        "publish_date": "Mon, 15 Sep 2025 19:34:17 +0000",
        "category": "finance",
        "authors": [
            "Sep"
        ],
        "text": "Exclusive: A former mining worker has been forced to reverse his retirement and become a truck driver after losing his entire nest egg in a devastating superannuation collapse.\n\nPhil Mazitelli, 61, was about to live the good life travelling Australia in a caravan.\n\nA cold-call two years ago which convinced him to swap his super has ruined those plans.\n\nPhil Mazitelli says $240,000 of his superannuation has been frozen. (Supplied)\n\nMazitelli had just finished a 30-year career in mining in Queensland's north and finally wanted to enjoy the fruits of his back-breaking labour.\n\n\"I turned 60, wanted to retire and spend a bit of money on myself,\" Mazitelli told 9news.com.au .\n\n\"In 2023 I was online and I saw this advertisement which said 'you can improve your super', I filled out a form and before I knew it I got a call.\"\n\nDo you have a story? Contact reporter April Glover at april.glover@nine.com.au\n\nMazitelli was told he'd be able to secure his retirement with better returns, so he transferred his money to Australian Practical Super, known as AusPrac.\n\nHe heard nothing more and assumed everything was OK.\n\nAfter a year, it was time for Mazitelli to hang up his boots and retire.\n\nHe had a healthy nest egg of just over $240,000 to enjoy in his twilight years.\n\nWhen he went to pull it out, the nightmare began.\n\nHe couldn't access a single cent.\n\n\"Then I saw that First Guardian had gone into liquidation and my money had been frozen,\" Mazitelli said.\n\nLike many Australians stung by First Guardian's collapse, Mazitelli said he'd never heard of this fund.\n\nThe former mining worker said he wanted to retire at 60 but had to pause his plans. (Supplied)\n\nAround 6000 people who are missing some or all of their superannuation after the collapse of First Guardian Master Trust, which went into liquidation and is under investigation by corporate regulator ASIC.\n\nASIC began investigating First Guardian's responsible entity Falcon Capital and First Guardian.\n\nAusPrac, also known as Australian Practical Superannuation, is operated by parent company Sequoia Financial Group.\n\nDiversa is the trustee for AusPrac.\n\nIn a statement to impacted members, Diversa said it understands AusPrac members who invested in a First Guardian Master Fund may be experiencing \"stress, anxiety and feelings of uncertainty in response to significant financial losses\".\n\n9news.com.au has contacted Sequoia for comment but is yet to receive a reply.\n\nNine.com.au is not suggesting any wrongdoing by AusPrac.﻿\n\nThe long and complicated process of trying to win back even a fraction of Mazitelli's nest egg has been going on for 12 months.\n\nRetirement is now out of the question and he has been forced to return to work as a truck driver.\n\nHe's looking at another 10 years of work at the very least.﻿\n\nThe emotional burden of losing his financial freedom has taken a toll too.\n\nMazitelli is now among 12,000 Australians waiting for answers. (Supplied)\n\n\"If I make it to 70… that's probably how long I'll be working,\" he said.\n\n\"My life has now changed because I wanted to get away and do stuff, I can't anymore. It's had a huge impact.\n\n\"At my age I shouldn't cry but I do, I am angry a lot… now it's just each day wondering and hoping for a resolution.\"\n\nMazitelli has joined a Facebook group of 1300-strong people who have also lost their superannuation.\n\nAround 12,000 Australians are missing a combined total of $1.2 billion after the collapse of First Guardian and Shield Master Trust.\n\nMembers of the group are supporting and counselling each other as the ASIC investigation takes place.\n\nVictims of both collapses are demanding government action – and fast.\n\n\"The government needs to intervene now… to safeguard and watch every superannuation fund so that this doesn't happen to anyone else,\" Mazitelli said.\n\n\"We are all just normal and hardworking Australians who did nothing wrong.\"\n\nHundreds of victims have lodged complaints with The Australian Financial Complaints Authority (AFCA).\n\nMazitelli has contacted his local member Andrew Wilcox, the MP for Dawson in north Queensland, who said he will advocate on his behalf.\n\nA Change.org petition has also been started to ask the government to establish a victims' trust.﻿\n\nASIC's full statement\n\nASIC has an ongoing investigation in relation to First Guardian Master Fund and Falcon Capital.\n\nFollowing concerns raised by ASIC, the Federal Court appointed liquidators to Falcon Capital and ordered the wind-up of First Guardian and its related funds in April.\n\nThe court also restrained David Anderson, a director of Falcon, from dealing with his assets and appointed a receiver to his personal property.\n\nASIC's investigation suggests that potential consumers were called and referred to personal financial advice providers who advised consumers to roll their superannuation assets into a retail choice superannuation fund, and then to invest part or all of their superannuation into First Guardian.\n\nWhile ASIC's investigation is ongoing, the Federal Court has made interim travel restraint orders against Falcon Capital director David Anderson on ASIC's application. The Court also made interim orders freezing the assets of another Falcon director, Simon Selimaj and restraining his travel.\n\nThose orders are in place until 27 February 2026. We understand the circumstances surrounding First Guardian are distressing for those affected and it is one of ASIC's priorities to investigate what has happened and to preserve as much of investors' funds as possible while our investigation is continuing.\n\nSo far, ASIC has had more than 40 court appearances on matters related to First Guardian and Shield. We have taken a range of enforcement action with respect to these matters including:\n\nstop orders to prevent ongoing consumer harm,\n\ncommencing court proceedings to preserve assets and restrict travel of persons of interest,\n\nappoint receivers and liquidators with the aim of securing investor funds\n\nexecuting numerous search warrants with the assistance of the Australian Federal Police.\n\ncancelled licences and banned certain financial advisers.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/australia-climate-change-risk-assessment-property-impact/6278ac2c-1e4a-4a60-867b-66e761984ebf",
        "title": "Aussies staring down the barrel of $770 billion property catastrophe",
        "publish_date": "Mon, 15 Sep 2025 02:57:08 +0000",
        "category": "finance",
        "authors": [
            "Sep"
        ],
        "text": "H﻿undreds of billions of dollars will be wiped from the value of Australian properties in the coming decades due to the impact of climate change.\n\nThe federal government released the nation's first climate risk assessment this morning , which not only laid bare the risk millions of Australians will face due to worsening natural disasters, rising sea levels and increasing temperatures, but also the impact on the economy.\n\nUnder the worst-case, high-emissions scenario in which global temperatures rise by 3 per cent﻿, the risk assessment found $571 billion in value would be wiped from the property market in the next five years alone.\n\nHundreds of billions of dollars in value will be wiped from Australia's property market due to climate change. (Wolter Peeters/SMH)\n\nThat hit would increase to $611 billion by 2050, and ﻿$770 billion by the end of the century, the risk assessment found.\n\nAustralians have a huge proportion of their wealth tied up in property, with it accounting for about two-thirds of all household assets.\n\nThe combined worth of all the country's property is currently sitting at $11.5 trillion.\n\nThe risk assessment also painted a bleak picture for the affordability and availability of insurance for homeowners wanting to safeguard their holdings.\n\nIncreasing and worsening natural disasters will also make insurance more expensive and less available. (Getty)\n\n\"Climate change is expected to drive escalating economic costs across all communities,\" the report states.\n\n\"Sea level rise will intensify coastal flooding and erosion, exacerbate flood and tropical cyclone impacts, and increase the severity and frequency of extreme events.\n\n\"These changes will notably increase insurance costs, leading to more underinsured or uninsured properties.﻿\"\n\nClimate Change Minister Chris Bowen said the report showed the need for Australia to act against the danger posed by the warming planet.\n\n\"We are not working on reducing emissions for fun, the path to net zero is important, we are doing it because the impacts of our country are real,\" he said.\n\nClimate Change Minister Chris Bowen said the report showed the need to reduce emissions. (Alex Ellinghausen)\n\n\"Importantly, the worst impacts are still avoidable.\n\n\"We are living climate change now; it's no longer a forecast, projection, or prediction, it is a lived reality... but it's not too late to avoid the worst of the impacts.\n\n\"As the report makes clear, the difference in terms of impact between 1.5 and 2 degrees, let alone three, is very real for Australia.\n\n\"So our efforts on mitigation must and will continue.\"\n\nFollowing the report, the government is exp﻿ected to hand down its emissions reduction target for 2035 later this week.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/world/the-studio-and-seth-rogen-have-recordsetting-emmys-as-noah-wyle-and-the-pitt-get-top-drama-wins/d72a4e21-c183-45eb-a49c-78e308c6328f",
        "title": "The winning shows and stars that dominated Emmys 2025",
        "publish_date": "Mon, 15 Sep 2025 06:25:41 +0000",
        "category": "entertainment",
        "authors": [
            "Sep"
        ],
        "text": "Seth Rogen and The Studio turned the Emmys into a wrap party, winning best comedy series on Sunday (Monday AEST) and breaking a comedy record for victories in a season with 13, while Noah Wyle and The Pitt took the top drama prize.\n\nThe evening also brought meaningful wins for Jean Smart, Stephen Colbert and 15-year-old Owen Cooper, whose Netflix series Adolescence dominated the limited series categories.\n\n“I’m legitimately embarrassed by how happy this makes me,” The Studio co-creator Seth Rogen said with his signature giggle, surrounded by cast and crew from the Apple TV+ movie-business romp after it won best comedy at the Peacock Theatre in a show hosted by Nate Bargatze and aired on CBS.\n\nSeth Rogen poses in the press room with his Emmys. (Invision for the Television Acad)\n\nRogen personally won four, including best actor.\n\nThe Pitt from HBO Max completed a sentimental journey with its win for best drama series.\n\nThe character-driven medical drama won over viewers and gained emotional momentum during a season whose drama prizes once seemed destined to go to Severance .\n\nWyle won best actor in a drama for playing a worn-down, grizzled supervising doctor, getting his first Emmy after five nominations with no victories in the 1990s for playing a scrubbed young cub doctor on ER .\n\n“What a dream this has been,” Wyle said.\n\n“Oh my goodness.”\n\nKatherine LaNasa, whose nurse is perhaps the show's most beloved character, was a surprise winner of best supporting actress in a drama, over three women of The White Lotus on a night when every acting Emmy but one went to a first-time victor.\n\nThe team from Adolescence, winners of the award for outstanding limited or anthology series. (Richard Shotwell/Invision/AP)\n\nThe first-timers included Britt Lower, who won best actress in a drama, and Tramell Tillman, who won best supporting actor, in the night's two biggest moments for Severance , the Apple TV+ Orwellian workplace satire.\n\nAlong with its creative arts wins, it ended up with eight for its acclaimed second season.\n\nLower’s win was a surprise in a category where Kathy Bates was considered a heavy favourite, for Matlock .\n\nCristin Milioti won best actress in a limited series for The Penguin .\n\nJean Smart bucked the rookie trend, winning her fourth Emmy for best actress in a comedy for “Hacks” and her seventh Emmy overall.\n\nAt 73, she extended her record for the oldest winner in the category.\n\nPhilip Barantini, from left, Owen Cooper, Stephen Graham, Erin Doherty, Jack Thorne, and Christine Tremarco accept the award for outstanding limited or anthology series for Adolescence. (Chris Pizzello/Invision/AP)\n\n‘Adolescence’ triumphs\n\nThe six wins for Netflix’s acclaimed Adolescence , the story of a 13-year-old in Britain accused of a killing, included best limited series, best actor and best writing for its co-creator Stephen Graham, and best supporting actor for Cooper, who became the youngest Emmy winner in over 40 years.\n\nCooper said in his acceptance that he was “nothing three years ago\".\n\n“It’s just so surreal,” Cooper said.\n\n“Honestly, when I started these drama classes a couple years back, I didn’t expect to be even in the United States, never mind here.\"\n\nBest supporting actress went to Erin Doherty, who played a therapist opposite Cooper in a riveting episode that like all four Adolescence episodes was filmed in a single shot.\n\nOwen Cooper, winner of the award for outstanding supporting actor in a limited or anthology series or movie for Adolescence. (Richard Shotwell/Invision/AP)\n\nA blockbuster night for ‘The Studio’\n\nThe Studio came into the evening having won nine Emmys already during last weekend's Creative Arts ceremony.\n\nOn Sunday night, it added four more, which all went to Rogen.\n\nAlong with the comedy series award, he won best directing with The Studio co-creator and longtime collaborator Evan Goldberg, and best writing with Goldberg and others.\n\nThe show brought blockbuster buzz, and the Emmys ate it up from the start, whether because of Hollywood's love for stories about itself (with A-list guest stars) or the television industry's love for stories that mock the self-importance of movie people.\n\nBackstage, Rogen clumsily tried to hold up all four Emmys at once.\n\nAsked whether the night will be fodder for season two, he said no.\n\n“This is like far too good a thing to have happen on our show,” he said.\n\n“Our show is generally based on stress and disappointment and right now, we’re all very happy.\"\n\nEvan Goldberg, from left, Frida Perez, and Seth Rogen embrace after winning the award for outstanding writing for a comedy series for The Studio. (Chris Pizzello/Invision/AP)\n\nA night of surprise winners\n\nSmart's castmate and constant scene partner Hannah Einbinder, who had also been nominated for all four seasons but unlike Smart had never won, took best supporting actress in a comedy.\n\nShe said she had become committed to a bit where “it was cooler to lose\".\n\n“But this is cool too!” she shouted, then ended her speech by cursing the US Immigration and Customs Enforcement agency and saying “Free Palestine!”\n\nPolitical sentiments from the stage were otherwise rare.\n\nIn perhaps the biggest upset in a night full of them, Jeff Hiller won best supporting actor in a comedy for Somebody Somewhere , over Ike Barinholtz of The Studio and others.\n\nREAD MORE: ﻿ Airlines suspend workers for posts about shooting of Charlie Kirk\n\nHannah Einbinder accepts the award for outstanding supporting actress in a comedy series for Hacks. (Chris Pizzello/Invision/AP)\n\nColbert gets a rousing send-off\n\nColbert may have been the night's most popular winner, taking best talk series for The Late Show With Stephen Colbert for the first time.\n\nHe got huge ovations both when he took the stage to present the first award and when he won.\n\nThe win may have been something of protest vote and tribute to its host, weeks after its cancellation by the network.\n\nJimmy Kimmel, who was among his competitors, campaigned for Colbert to win.\n\n“Sometimes you only truly know how much you love something when you get a sense that you might be losing it,” Colbert said in his acceptance.\n\nMany perceived the end of the show as punishment of Colbert and placation of President Donald Trump after Colbert was harshly critical of a legal settlement between the president and Paramount, which needed administration approval for a sale to Skydance Media.\n\nREAD MORE: ﻿ Teacher killed as sea biscuit ride turned to tragedy\n\nStephen Colbert and his team from \"The Late Show with Stephen Colbert\" accept the award for outstanding talk series. (Chris Pizzello/Invision/AP)\n\nExecutives called the decision strictly financial.\n\nHe showed no bitterness to CBS, thanking the network, which telecast the Emmys and aired a commercial celebrating his win, for letting him be part of the late-night tradition.\n\nBargatze delivered his opening monologue only after the first award was handed out.\n\nThe show opened with a sketch where Saturday Night Live stars Mikey Day, Bowen Yang and James Austin Johnson joined Bargatze, who played television inventor Philo T. Farnsworth opining on what the future of TV will be like.\n\nBargatze-as-Farnsworth mentions that there will be a Black Entertainment Television. When asked if there will be a network for white people, he replied, “Why, CBS of course.”",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/beauty-trend-recession-indicators-nails-hair-bb-claws/5e78ce91-b130-4155-b13b-85bd61dd7bdb",
        "title": "Are beauty trends recession indicators? Possibly, but Aussies are still spending billions on them",
        "publish_date": "Mon, 15 Sep 2025 02:26:09 +0000",
        "category": "finance",
        "authors": [
            "Sep"
        ],
        "text": "They are the beauty trends that take popular clinic treatments and make them accessible - and cheap - for all.\n\nBut are beauty trends like short manicures, \"bronde\" hair, and press-on nails actually recession indicators?\n\nTikTok and Instagram users are claiming the shift towards affordable, low-maintenance trends like short nails, press-ons, and darker hair are signs the economy is set for a dramatic downturn.\n\nHigh-maintenance hair colours like platinum blonde have been replaced by more affordable, low-maintenance shades of 'bronde'. (Getty)\n\nBut ﻿﻿Australians spent $6 ﻿billion on cosmetics and toiletries in 2024-2025, according to an IBISWorld report, up almost 4 per cent from the previous year.\n\nMore than $3 billion of that was spent on ﻿makeup and skincare products.\n\nAussies are also expected to spend more than $12 billion on ﻿hairdressing and beauty services in 2025-2026.\n\n\"While some people might be looking for cheaper beauty alternatives to save money, the 'recession indicator' claim creates a misleading sense that people are scrimping in this particular area,\" senior lecturer in Cultural Studies at University of Melbourne Hannah McCann told 9news.com.au.\n\n\"Beauty as an industry is remarkably resilient to times of economic crisis.\"\n\nBrittany Bedford owns and runs BB Claws, a boutique nail salon in Sydney's South. (Supplied)\n\nSydney nail artist Brittany Bedford is banking on that.\n\nShe owns and operates BB Claws, a boutique nail salon in Sydney's south, and has clients booking months in advance as she heads into the busiest season of the year.\n\nWhile some have taken to spacing out their appointments or picking cheaper nail designs to save money lately, few have been willing to give up their gel manicures altogether despite the rising costs.﻿\n\n\"We have noticed a quieter period during the winter months,\" Britt told 9news.com.au.\n\n\"But once the social season picks up, we see more clients seeking out their regular beauty services again.﻿\"\n\nAnd that trend is likely to continue, even if the economy gets worse.﻿\n\nWhen you can't afford a holiday because airfares alone cost thousands, a $100 manicure doesn't seem so bad. (Instagram/@bb.claws)\n\nMcCann pointed to the \"lipstick index\", a popular (but unproven) theory that sales for \"affordable luxury\" items like lipstick spike when consumers think a recession is imminent.\n\n\"You give up a holiday before you give up lipstick,\" she said.\n\nBehavioural and applied economist and senior lecturer at RMIT Meg Elkins told 9news.com.au that improving one's appearance might be a go-to when strained finances are putting a dent in the mental health of millions.\n\n﻿\"When we feel bad, we want to look good,\" Elkins said.\n\n\"And if you're having to cut back on so many other elements in your life, tiny bits of luxury actually elevate the way you feel about yourself.\"\n\nMcCann agreed, adding that these purchases can help Aussies feel more in control of their bodies and identities \"when the world feels like it is out of control\".\n\nBB Claws clients have been spacing out appointments to save money - but they're not giving up their manicures altogether. (Supplied)\n\nBedford said her clients have been understanding of recent price increases at BB Claws as overheads increase for small businesses like hers.\n\n﻿\"A lot of our clients are in their 20s and 30s, so can relate on how hard it is to get ahead these days.\"",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/sti-data-released-syphilis-rates-on-the-rise-hiv-down/e1b8a78d-108e-4b86-bb3f-d685de31dd46",
        "title": "These STIs have doubled in infections in Australia - with deadly results",
        "publish_date": "Mon, 15 Sep 2025 02:06:16 +0000",
        "category": "lifestyle",
        "authors": [
            "Sep"
        ],
        "text": "Cases of syphilis and gonorrhoea have doubled in Australia in the past decade, according to the latest data.\n\nThe information, released by the Kirby Institute of the University of NSW, revealed that in 2024, there 5866 diagnoses of syphilis ﻿around the country, and 44,210 of gonorrhoea.\n\nCongenital syphilis, a condition that sees a pregnant mother pass the disease on to their infant, has also more than doubled since 2015, causing 34 infant deaths through the decade.\n\nSyphilis cases have doubled in Australia in the past 10 years. (Getty)\n\nAnd chlamydia remains the most prevalent STI﻿, with 101,742 diagnoses last year, though the rate remains steady.\n\nHIV diagnoses, on the other hand, have fallen by ﻿27 per cent in the past year, though mostly in Australia-born residents.\n\nOther numbers showed there were significant gaps in sexual health in Australia.\n\nPeople are urged to use prevention during sex. (Getty Images/iStockphoto)\n\nOne recent analysis from the Australian Survey of Health and Relationships found only 16 per cent of Australians aged 16 to 49 had ever been tested for an STI, and only 50 per cent had ever discussed sexual health with their doctors.\n\n\"These data, on a backdrop of rising STIs, are concerning,\" Kirby Institute epidemiologist Dr Skye McGregor said.\n\n\"Chlamydia, gonorrhoea and syphilis are easily treated and cured with antibiotics. Early testing, diagnosis and treatment prevents serious outcomes.\n\n\"HIV, while not curable, is highly treatable, and diagnosis and starting effective treatment early prevents poor health outcomes and interrupts onward transmission.\n\n\"These data are a reminder that regular sexual health testing, including syphilis and HIV, is crucial.\"\n\nOnly 50 per cent of Australians discuss sexual health with their care provider. (Getty)\n\nSTI rates remain higher in Indigenous Australians, with ﻿chlamydia diagnosed at more than twice the rate, gonorrhoea almost four times higher, and syphilis more than five times higher, than in non-Indigenous people.\n\n\"These gaps are even starker in regional and remote areas,\" Robert Monaghan, a Bundjalung-Gumaynggir man and manager of the Yandamanjang First Nations Health Research Program at the Kirby Institute, said.\n\n\"What's needed now is real investment in culturally safe, community-driven health promotion, testing and treatment.\n\n\"Declaring syphilis a Communicable Disease Incident of National Significance is an important step.\n\n\"Sustainable change depends on culturally safe, community-led action.\"\n\nMen are also overrepresented in STI numbers, accounting for eight out of 10 syphilis diagnoses, and seven out of 10 gonorrhoea diagnoses.\n\nBut syphilis infections are increasing faster for women, quadrupling across the decade.﻿\n\n\"It's important that everyone who is sexually active discusses sexual health with their partners, practices safe sex, has regular STI testing, and talks to their health care provider about their sexual health,\" McGregor said.",
        "source": "9News"
    },
    {
        "url": "https://www.abc.net.au/news/2025-09-16/centrelink-pension-carer-payment-disability-support/105777756",
        "title": "Pension rates to increase over the weekend",
        "publish_date": "Tue, 16 Sep 2025 01:46:06 +0000",
        "category": "finance",
        "authors": [],
        "text": "Australians receiving the aged pension could end up with slightly more money in their pockets when Centrelink payments increase from Saturday.\n\nMore than 5 million people will see an increase in their bank account because of the increases, the Department of Social Services says.\n\nBut not every payment is increasing.\n\nAnd increases to deeming rates could reduce how much some part-rate pensioners receive.\n\nHere's what you need to know.\n\nWhich payments are increasing?\n\nAge Pension\n\nCarer Payment\n\nDisability Support Pension\n\nCommonwealth Rent Assistance\n\nJobSeeker\n\nABSTUDY (aged 22 and over)\n\nParenting Payment\n\nWhy are these payments increasing?\n\nTo keep up with the inflation rate.\n\nThe federal government regularly indexes social security payments so the value of benefits like a pension stays the same as the cost-of-living increases.\n\nHow much more will I get?\n\nThat depends on what payments you're currently receiving.\n\nFor example, the Aged Pension, Carer Payment and Disability Support Pension will increase by $29.70 per fortnight for singles.\n\nAnd it'll go up by $44. 80 for couples combined.\n\nYou can check exactly how much your payments will go up by via the detailed table published on the Department of Social Services website.\n\nWhen will the increases kick in?\n\nIndexation will be applied on Saturday.\n\nThe changes will be applied automatically, so recipients won't have to do anything to ensure they receive the increases, Services Australia's website says.\n\nThe payments are being increased to keep up with inflation. (Getty/Matt King)\n\nWhy aren't other payments increasing?\n\nIt's not their turn yet.\n\n\"Different payment rates and thresholds are indexed on different dates throughout the year,\" a Services Australia payment guide says.\n\nEach quarter, a certain number of payments — but not all of them — are indexed.\n\nFor example, pension payments were last indexed back in March.\n\nWhereas Youth Allowance was indexed in January.\n\nWhat are the changes to deeming rates?\n\nDeeming rates will increase from Saturday.\n\nThe lower deeming rate: Increase from 0.25 to 0.75 per cent\n\nIncrease from 0.25 to 0.75 per cent The upper deeming rate: Increase from 2.25 to 2.75 per cent\n\n\"We'll automatically apply the new deeming rates if you have deemed income,\" Services Australia's website says.\n\nWhat is deeming?\n\nIt's part of the income test for Centrelink payments, including the age pension.\n\nDeeming is a set of rules the government uses to work out how much income people earn from their financial assets — things like shares, superannuation, and bank accounts.\n\nIt assumes people receive a set income from the interest on those investments, whether they actually get that much or not.\n\nBut here's the kicker: if your investment return is higher than the deemed rate, the government doesn't count that extra money as part of your income.\n\nThat means anything you earn above that rate isn't counted in the income test for the age pension.\n\nAnd this means the lower the deeming rate, the more people can earn from their investments without it affecting their pension payments.\n\nThe increase to deeming rates could impact payments for some part-pensioners. (ABC Rural: Selina Green)\n\nThe Coalition government cut deeming rates back in 2020 to help retirees in the pandemic, with both parties pledging to freeze those rates leading up to the election in 2022.\n\nIt meant there was a bigger gap between the amount the government assumed some pensioners earned on their savings and what they actually earned, University of Sydney's Professor of Finance Susan Thorp wrote in a piece for The Conversation.\n\nLabor continued that freeze in the 2024 budget, but now that's coming to an end.\n\nWhy is the deeming rate increasing?\n\nIt's part of a staged return to what the rates were before the COVID pandemic.\n\nHere's how it was explained in a media release from Social Services Ministers Tanya Plibersek and Ged Kearney:\n\n\"Deeming rates were frozen at artificially low levels as an emergency COVID-19 measure and the Albanese government extended the freeze to help shield age pensioners and other income support recipients while the economy recovered. \"Social security recipients impacted by deeming saved around $1.8 billion as a result. \"As Australians begin to feel the positive impacts of inflation easing, the government will now gradually return deeming rates to pre-pandemic settings — that is, to reflect rates of return that pensioners and other payment recipients can reasonably access on their investments.\"\n\nHow could the deeming increase impact retirees?\n\nIt could reduce some pensioners' payments, Professor Thorp wrote for the Conversation.\n\nIn terms of how things could change after Saturday, she gave the example of a single, home-owning age pensioner.\n\n\"The savings and investments that a single pensioner can hold and still get the full pension under the income means test will be lower, because the rules will treat them as earning more income,\" Professor Thorp wrote.\n\n\"In addition, the reductions in the pension as financial assets rise will be a bit larger.\n\n\"For every $10,000 in savings and investments above $210,000, the pension will be lowered by $7, since those extra savings will be deemed to earn more than under the pre-announcement rules.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-09-16/sydney-olympics-reg-mombassa-inflatable-art-reappears-in-nsw/105735020",
        "title": "Sydney Olympics inflatable fish resurfaces, now pride of small town",
        "publish_date": "Tue, 16 Sep 2025 01:31:43 +0000",
        "category": "entertainment",
        "authors": [],
        "text": "An inflatable art piece that made a grand entrance at the Sydney Olympics in 2000 and then vanished has now reappeared in an art exhibition in rural NSW.\n\nTwo-time Archibald finalist and creator of iconic surf brand Mambo, Reg Mombassa's skeleton fish motif was part of the parade during the closing ceremony of the Sydney Olympics but for the next 23 years, the whereabouts of the inflatable were unknown.\n\nThat is, until artist and director of Coonabarabran's Space Art Gallery Allison Reynolds made a rare discovery at an online auction two years ago.\n\nThe inflatable fish is hard to miss when passing through Coonabarabran. (ABC Western Plains: Lily Plass )\n\nMs Reynolds had an inkling who the artist behind the fish with its supersized tongue and distinctive lips was and obtained the art piece for $250 — including shipping.\n\nShe said the fish was alongside big sale signs, inflatable stick figures and other advertising devices.\n\n\"Whereas this is quite obviously a piece of art,\" Ms Reynolds said.\n\nMillions witnessed the closing ceremony of the Sydney Olympics where the skeletal fish motif was on display. (Supplied)\n\nAfter contacting Reg Mombassa's studio, Ms Reynolds confirmed that the fish was indeed the work of the artist.\n\nHe designed 12 six-metre inflatables, two 20-metre helium-filled dirigibles, three stages and 16 inflatable crowd balls for the Sydney Olympics.\n\nFrom the arena to the country\n\nMs Reynolds thought the skeleton fish motif would make a nice addition to her art gallery.\n\n\"I thought it was going to look amazing above the roof line because we have the old shop frontage with a corrugated iron verandah poking out,\" Ms Reynolds said.\n\n\"I had visitors come through the other day, on the way to Townsville and they said they had to drop in to [see] Reg Mombassa art piece and what was going on.\"\n\nThe exhibition includes other mentions of the skeleton fish motif, dating back to 1990.\n\nAllison Reynolds says she opened the Space Art Gallery in 2017. (ABC Western Plains: Lily Plass )\n\nChris O'Doherty, whose artistic name is Reg Mombassa, believes after the Olympics, the inflatables were either sold off or stored in the Powerhouse, while others were used for festivals and events.\n\n\"I was just pleased that someone was using one of the inflatables from the Olympics,\" Mombassa said.\n\n\" I hope that people that come from the town or elsewhere find it amusing and have a good time basically. \"\n\nChris O'Doherty is better known as Reg Mombassa, and his style is popularised through Mambo Graphics. (ABC News: Eloise Fuss)\n\nThe sculpture has been weather-resistant so far, but to make the art piece more stable, Ms Reynolds had it filled with expanding foam.\n\n\"This is thick vinyl because obviously during the Olympics, you don't want it blowing away,\" Ms Reynolds said.\n\nArtwork brings visitors\n\nThe fish has caught the eye of many locals in town.\n\n\"I thought it was quite amazing and unique. It was lovely that we could get something so different here,\" local Sue Forbes said.\n\nSue Forbes says she recognised the art as Reg Mombassa's once someone pointed it out. (ABC Western Plains: Lily Plass)\n\n\"I've been away for a few days and then came back. And there it was. It's just a lovely expression of imagination. Just exciting, frivolous, life-asserting,\" local Laura Hartley said.\n\nLaura Hartley, who settled in Coonabarabran from Scotland in the 1970s, created her own fish-themed art through weaving for the exhibition.\n\nLaura Hartley says she is inspired by Indigenous fish traps. (ABC Western Plains: Lily Plass )\n\n\"I understand the fascination of the ways things are constructed in the natural world,\" Ms Hartley said.\n\n\" Fish have got life of their own. They invite people, I hope, to get people engaged with plant material. \"\n\nBones are a red thread through Mombassa's work.\n\n\"I do the bones of people, of cars, of trucks, of guns. I do the bone structure of variety [of] things that don't actually have bone structure,\" he said.\n\n\" Bones are structurally and graphically interesting. They have that indication of a living creature that's died. So, there's always that kind of aging paranormal aspect of a bone or a skeleton. \"\n\nMs Reynold's hope for the fish is that it does not go back to a box.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-09-16/newsreader-rob-broughs-family-battle/105775464",
        "title": "Family comes first for newsreader Rob Brough after months off-air",
        "publish_date": "Tue, 16 Sep 2025 00:44:38 +0000",
        "category": "finance",
        "authors": [],
        "text": "Rob Brough has been a familiar and beloved figure in regional Queensland for more than three decades.\n\nBut the nightly 7News presenter, and his signature wink, have been noticeably absent from television screens for many months.\n\nThe 70-year-old has opened up to ABC Sunshine Coast about the personal family battle that has forced him to step away from his career to put family first.\n\nBrough said it was an \"instant choice\" to leave work last year when his daughter's cancer diagnosis worsened.\n\nRob Brough he has stepped away from news reading to support his daughter and her family. (Supplied: Rob Brough)\n\n\"About four years ago our daughter Jess was diagnosed with breast cancer,\" he said.\n\n\"That was pretty confronting.\n\n\" But she's a hell of a kid. My goodness, she's such a fighter. She's such a beautiful girl. \"\n\nThe former Family Feud presenter and father-of-three said the family was rocked again when Jess then developed a secondary cancer in her brain.\n\n\"We got to a tough stage where things weren't working and not a lot of options were available,\" he said.\n\n\"It was just an easy choice for me to leave work and spend as much time as I could around her and her family.\"\n\nRob Brough with his daughter Jess Willmott on a family holiday before her diagnosis. (Supplied: Rob Brough)\n\nDays spent caring for grandchildren\n\nBrough said his days were now largely spent helping care for Jess' three children on the Sunshine Coast, who he delivers to and from school each day.\n\n\"Family is everything and we live together. That's a beautiful thing because bringing up your children and then being a part of your grandchildren's upbringing is as good as it gets,\" he said.\n\n\"If you're chasing the meaning of life, for me that's what it is.\n\nJess Willmott with her three children (left to right) Indigo, Milla and Madden Willmott. (Supplied: Jess Willmott)\n\nThe family has already experienced its fair share of heartache after the sudden death of Brough's three-year-old son Sam some 30 years ago.\n\nIt prompted Brough to embark on a 1,200-kilometre ride in Sam's honour in 2014 to raise money for the Children's Health Foundation and the Humpty Dumpty Foundation.\n\n\"What I learnt from losing Sam was that you never know what people are going through and we must be careful not to be too judgemental,\" Brough said when launching the ride.\n\nRob Brough's son Sam died suddenly on the night of his third birthday. (Supplied: Rob Brough)\n\n\"I can remember walking through the shops at Christmas the year we lost Sammy and watching people buying toys for their children and wanting to scream that I'd lost my little mate.\n\n\"I guess we pass people every day and we have no idea what's going on in their lives.\"\n\nLove of footy creates family memories\n\nOutside of his family, rugby league is Brough's second greatest love.\n\nRob Brough says the family created happy memories while he coached his granddaughter's rugby league team this year. (Supplied: Kawana Dolphins)\n\nHe held back tears as he described having Jess work alongside him this year as he coached his granddaughter's under-11s Kawana Dolphins girls team.\n\n\"Jess was helping me out managing that team, but things got tough and she had to pull out of that role,\" he said.\n\n\" But that was lovely, we had some moments there together where we're all at the game and my granddaughter was playing. \"\n\n\"Broughy\", as he's affectionately known, coached the Maroochydore Swans open women's team to a grand final win at the weekend.\n\nHis youngest son Tyson Brough is also a successful National Rugby League referee.\n\nBrough's Maroochydore Swans open women's rugby league team won the Sunshine Coast grand final at the weekend. (Supplied: Nicola Anne Photography)\n\n\"I've never been away from rugby league,\" Brough said.\n\n\"When I finished playing I was commentating when I was working on radio, then on television with the ABC and [channel] Nine and doing State of Origin, and then coaching football for 25 years.\n\n\"It's been a massive part of our life.\"\n\n'Telling stories that mattered'\n\nBrough said he was grateful to the people who reached out to him during his absence from news reading.\n\n\"I've never seen television as being anything more than what it is — a job that I've enjoyed doing,\" he said.\n\n\"You appreciate that you've spent a big chunk of your life talking to people, and they've embraced you to a degree. They've turned the TV on and watched what you've been doing.\n\n\"I've just been very, very lucky to have had such an enjoyable career in broadcasting, and to those people who've asked and genuinely been interested in what's unfolded, thank you.\"\n\nFormer weather presenter Rosanna Natoli worked alongside Rob Brough for almost three decades. (Supplied: Rosanna Natoli)\n\nBrough's long-time former colleague and now Sunshine Coast Mayor Rosanna Natoli said he was sorely missed by Queensland communities.\n\n\"I think he just has a presence, and he loved being the stable anchor. That's what he was, he was telling people stories that mattered,\" Cr Natoli said.\n\n\"In your community you're not just talking or saying the news about it, you're living it, and he was really that personified.\n\n\"He was also a bit of a rogue, a bit of a joker or prankster at times.\n\n\"And of course everyone knew the wink. People would look forward to that wink at the end of the bulletin.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-09-16/the-advice-around-sending-a-sick-kid-to-child-care/105734762",
        "title": "Is it ever OK to send a sick kid to child care?",
        "publish_date": "Tue, 16 Sep 2025 00:05:46 +0000",
        "category": "lifestyle",
        "authors": [],
        "text": "Work demands and a lack of village mean keeping a child at home from care every time they have a sniffle can be a dilemma for many parents.\n\nAnd with sickness so easily spread in childcare settings, it's a decision caregivers are regularly faced with — especially in the first year or two.\n\n\"Parents have my sympathy on that, there are a lot of demands on time and it can be really hard to judge what is best to do, both for child in the context of all the other dynamics, and commitments a family has,\" says Cathryn Hester, Queensland chair at Royal Australian College of General Practitioners.\n\nShe says sometimes it seems like kids experience several illnesses \"all at once or in quick succession\".\n\nUpper respiratory tract infections, along with vomiting and diarrhoea bugs, are what Dr Hester sees most commonly in her young patients.\n\n\"There are just a lot of kids running around, and they don't have the best hand hygiene or sneeze-covering practices. Also, they have a developing immune system,\" Dr Hester says.\n\nSo, what can help you determine if your child is fit for child care?\n\nWhen a sick child can't attend child care\n\nWhen determining exclusion periods for a child, Australian childcare centres follow guidelines from the National Health and Medical Research Council (NHMRC), explains Nesha Hutchinson, vice president at the Australia Childcare Alliance.\n\nThe mental load of parenting while sick Photo shows Mother sleeping on a couch with her baby on her While Lauren's husband can retreat to the bedroom when sickness strikes, mum life doesn't stop for her.\n\nIn most cases, time away from child care will be based on symptoms.\n\n\"Although some infections can be spread before the person becomes sick, people are usually most infectious when they have symptoms,\" a NHMRC spokesperson says.\n\nFor example, for diarrhoea or vomiting, it's recommended a child is excluded from care \"until there has not been any diarrhoea or vomiting for at least 24 hours\".\n\n\"If the diarrhoea or vomiting are confirmed to be due to norovirus, exclude until there has not been any diarrhoea or vomiting for at least 48 hours.\"\n\nRespiratory symptoms such as cough, runny or blocked nose, and sore throat, are to be assessed based on severity and what other symptoms they're combined with.\n\nThe full guide and fact sheets are available on the NHMRC website.\n\nSign up to the ABC Lifestyle newsletter Get a mid-week boost and receive easy recipes, wellbeing ideas, and home and garden tips in your inbox every Wednesday. You’ll also receive a monthly newsletter of our best recipes.\n\nThe NHMRC spokesperson says people should also refer to their relevant state or territory health authority, as some exclusion requirements may vary.\n\nIn addition to the guidelines, centres have the option to adopt director discretion, says Ms Hutchinson.\n\n\"For example, at a centre I worked at we had a child who was immunocompromised, going through cancer treatment, and we explained to families up front that our exclusion guidelines were going to be much stricter.\"\n\nIs my child well enough to attend child care?\n\nTo determine whether their child should be excluded, a parent should check whether the symptoms or diagnosed sickness have an exclusion period listed in the childcare service's policy, the NHMRC spokesperson says.\n\n\"Parents should also inform the service of their child's symptoms when reporting their absence.\"\n\nKids who have fevers, rashes, vomiting and diarrhoea, are weak, or not eating and drinking as much should \"never be sent to day care\", says Dr Hester.\n\n\" That child needs to stay home and have a medical assessment. \"\n\nShe says while children often \"bounce back really well\" from viral infections, they can also get \"very sick very rapidly\" and are best cared for at home.\n\nUnwell children are best cared for at home. (Pexels)\n\nIf parents have any doubts, Dr Hester says they should consult with their family GP.\n\n\"They know you and your family history — they also know what viruses and illnesses are circulating in the community.\"\n\nShe says parents can book a consult via TeleHealth if they are finding it hard to physically get into a clinic.\n\n\"They can help give advice about whether they should be staying home or if it's something they can soldier on with.\"\n\nAdd to your watchlist Photo shows Mystery Road Origin ABC iview with young detective Jay Swan in the bush. The critically acclaimed Mystery Road: Origin returns as Detective Jay Swan (Mark Coles Smith) and Mary (Tuuli Narkle) uncover dark secrets in a haunted timber town, where the past threatens to tear them apart.\n\nMs Hutchinson says she understands it can be tempting for parents to send their child and just \"see how they go\", but the impact can be far-reaching.\n\n\"Dosing them up [with pain relief] just masks the symptoms, and they've just infected however many other children and therefore other families will struggle too.\n\n\"And the child is miserable … they want to be home with a primary carer and just to get rest and that one-on-one attention, which you can't get in a childcare setting.\"\n\nMyths about illness and child care\n\nParents are given plenty of anecdotal advice when their kids are sick, and some of it can be misleading, says Dr Hester.\n\nFor example, if the mucus coming from their nose is clear, they are fine to attend child care. If it's green or yellow, they are not.\n\n\"As a doctor I am not even remotely interested in the colour of snot,\" Dr Hester says.\n\n\"Some kids can have perfectly clear snot and be very unwell, or even starting to develop serious conditions like whooping cough.\"\n\nMs Hutchinson says she also hears parents talking about children becoming sick from running around in cold air.\n\n\"That's not the case.\"\n\nShe says it's important parents remember childhood educators are not medical health professionals.\n\n\"They do not have the ability to determine if your child is sick or not, all they can do is respond to the symptoms in front of them and respond according to the guidelines.\"\n\nDr Hester says the best thing parents can do is try to prevent illness in the first place by making sure children are up to date with their vaccinations.\n\n\"With flu especially — I am seeing so many little kids with Influenza A at the moment, which can be largely prevented with vaccinations.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-09-16/lisa-reihana-ngununggula-exhibition-voyager-indigenous-maori/105760474",
        "title": "Lisa Reihana's exhibition, Voyager, recasts history through an Indigenous lens",
        "publish_date": "Tue, 16 Sep 2025 00:02:51 +0000",
        "category": "entertainment",
        "authors": [],
        "text": "When Lisa Reihana walks through Voyager, her newly opened exhibition at Ngununggula, she doesn't see her works even as they literally unfurl and move across the walls.\n\nTo the highly acclaimed Aotearoa artist, these time-intensive, technically complex, visually mesmerising works that span video, installation, sculpture, photography and costume design, are just artefacts.\n\n\"These are the flotsam and jetsam that come out of the conversations and the people that I meet,\" she says, half-jokingly, of the work at the Southern Highlands Regional Gallery.\n\n\"A lot of these video works take a lot of time and energy and require so many communities of people and cast and crew. Walking through the galleries is like walking through space and time.\"\n\nLisa Reihana is an artist of Ngā Puhi, Ngāti Hine, Ngai Tūteauru and Ngāi Tūpoto descent, who has been making contemporary art since the 1990s. (Supplied: Jacquie Manning)\n\nThis new survey of works made since 2018 continues Reihana's interest in storytelling and revisioning colonial histories, addressing the ongoing impacts of colonisation on representation, identity and our understandings of community and place.\n\nRecasting history for new perspectives\n\nIn these latest works, Reihana casts Maōri ancestor Tangi'ia, Earth Mother Papatūānuku, models from the studio of the late New Zealand sculptor William Trethewy, and several 19th century Chinese goldminers at work in Otago.\n\nArguably one of the more well-known characters is Captain James Cook, whose death is just one of the myriad stories presented in her sprawling tableaux In Pursuit of Venus [Infected].\n\nThis large-scale, live-action, eight-minute film is a sly, visually gorgeous, celebratory reclamation of the stories implied and untold in Frenchman Joseph Dufour's colonial, nineteenth century, panoramic wallpaper, Les Sauvages de la Mer Pacifique (The Native Peoples of the Pacific Ocean).\n\nLisa Reihana uses works like Taking Over to recast the position of women in historical stories. (Image courtesy of the artist and Gallery Sally Dan-Cuthbert, Sydney, Australia.)\n\nIn Reihana's version, problematic Enlightenment-era imagery is exchanged for scenes of cultural practice, dance, community gatherings and cross-cultural exchange, with Māori, Pasifika and First Nations Australian people thriving and accounted for.\n\nThe work, which is represented in Voyager by a large photograph, was a major highlight of the 2017 Venice Biennale.\n\nFor Reihana, who is of Ngāpuhi, Ngāti Hine, Ngāhi Tū descent, its popular and critical reception has led to numerous international commissions and exhibitions.\n\nBut it hasn't been without its challenges.\n\n\"It's fantastic to make a really great work but it's also a rod on your back, because everyone has a touchstone [now] and they want more of that and I don't want to repeat things,\" she says.\n\n\" They have to have a reason to be created again. I've only got one life and I need to keep moving. \"\n\nBut for Reihana, the technical skills required to make these virtuosic works are the easy part.\n\n\"The relationships are the hardest bit but they're also the best bit,\" she says.\n\nNavigating relationships\n\nReihana says telling cultural stories can be fraught, which is why collaboration and giving time to projects is central to her practice.\n\nThere's also a lot of joy and, occasionally, a bit of matchmaking.\n\n\"Sometimes I've cast people because I want them to meet each other, because I think they would get on and then go off and do something else themselves,\" she says.\n\nLisa Reihana: New artwork reanimates the story of Captain Cook Photo shows A wall projection of painted Tahitian landscape featuring filmed figures in 18th C dress re-enacting scenes from first contact. Maori artist Lisa Reihana spent 10 years creating her panoramic digital video In Pursuit of Venus [Infected].\n\nIn IHI (2020), she cast New Zealand choreographers Nancy Wijohn and Taane Mete in her retelling of the Māori creation story, bringing them back to dance together for the first time in 20 years.\n\n\"I knew they were great friends and to have that sense of care and love displayed between these different stories was something that I wanted to explore,\" she says.\n\nOther times, it's all about research and locations. GOLD_LEAD_WOOD_COAL (2024) was first made for Hong Kong's Tai Kwun Contemporary and, in wanting to create a work that connected Hong Kong and China with Aotearoa, Reihana took the story of the British cargo ship SS Ventnor as her point of departure.\n\nShipwrecked off the coast of New Zealand's North Island in 1902, it was repatriating the remains of 500 Chinese goldminers to Guangdong when it hit the coast and sank.\n\nReihana expands the story to focus on the rituals and care of the local Māori community, who collected and buried these washed-up boxes of bones.\n\n\"I wanted to look at that care, how humans care for each other; the Chinese miners looking out for each other in the face of a lot of racism and the care that Māori had for these Chinese bones when they found them on the shores,\" she says.\n\nAcross three expansive walls at the gallery, interior scenes, moody landscapes, calligraphic writings and rich fabric textures cross-fade and overlap, connecting Otago's rugged goldfields to opium dens, to the northern Aotearoa shores and Māori locals, to the female victims of the Opium Wars held in the prison that once sat on the site of the Tai Kwun arts precinct.\n\nA work about belonging\n\nIn making work specifically for Ngununggula, Reihana hoped to collaborate with local First Nations cultural custodians and community members.\n\nReihana's newest exhibition spans all four gallery spaces at Ngununggula, (Image courtesy of the artist and Gallery Sally Dan-Cuthbert, Sydney, Australia)\n\nHowever, pandemic-complicated timelines and logistics made that tricky.\n\nInstead, she drew on conversations with the daughter of late local elder Aunty Velma Mulcahy, who gifted Ngununggula its name, which means \"belonging\" in the local Gundungurra language.\n\n\n\n\n\nLisa Reihana's Belong shimmers across the front facade of the gallery. (Artwork courtesy of Lisa Reihana and Gallery Sally Dan-Cuthbert, Sydney. Photography by Mim Stirling.) \"I was thinking about that naming and how she talked about it as being a safe place for creativity and for people coming together and for community,\" Reihana says.\n\nReihana's Belong (2025), which adorns the entire front facade of the building, is a dazzling pink, orange and black wall of shimmering pixel-like discs that murmur and shimmer in the wind.\n\nThe zigzag design draws from the patterns found at the top of woven kākahu, or Māori cloaks.\n\nReihana knows first-hand the importance of belonging — of crossing thresholds — and of being welcomed somewhere.\n\nMāramatanga is the first work to greet you once you've passed through Belong and entered the galleries.\n\nIt was commissioned by Reihana's alma mater, Auckland University, and was another collaboration, this time with students from the university's dance program, which didn't exist when Reihana was a student.\n\n\"As a young urban woman looking to learn about my culture, because it was so stamped out, it was very hard even to learn language,\" she says.\n\n\"You couldn't find it in our English education system. It was a real milestone moment when the university finally capitulated and decided to build a marae, or meeting house, for all the Māori students, and for the wider university.\"\n\nThe University of Auckland built a marae, or meeting house, for all the Māori students, and for the wider university. (Supplied: University of Auckland)\n\nOn finding your place\n\nThat experience, as well as the opportunity to meet the master artisans who carved its interiors, rich with depictions of Māori ancestors and navigators, continues to be formative for Reihana.\n\nGiant octopus heads for Hobart Photo shows Inflatable octopus artwork in marina. When Lisa Reihana constructed an enormous octopus based on a Māori creation story, she never intended it to leave its home in New Zealand.\n\n\"We talk about the meeting house as being your Tūrangawaewae, your place to stand. And wherever you stand [with the carvings behind you], you've got the protection of your people behind your back,\" she says.\n\nFor Māramatanga, Reihana invited the students and several older friends to take inspiration from the figures in the marae, as well as their own ancestors, and to reflect on what they might look like for themselves within a contemporary choreographic video piece.\n\nOne of the dancers, Yin-Chi Lee, spoke of her experiences as being part of the Chinese diaspora and feeling landless; a constant guest in other countries. Using green screens, Reihana suspends her in the open sky.\n\n\"She feels landless and unbound. So it's about taking these ideas and trying to translate them in a way that still is poetic but that gives somebody a place to be.\"\n\nOther vignettes capture dancers-as-ancestors against hypnotic, kaleidoscopic backgrounds of ocean, forest and mangroves.\n\nReihana's work breathes new life into historical narratives. (Image courtesy of the artist and Gallery Sally Dan-Cuthbert, Sydney, Australia)\n\nThese mesmerising visuals define all of Reihana's work, whether she's retelling Māori ancestral stories or re-writing colonial histories.\n\nTheir uplifting beauty is another strategy — an invitation for viewers to lose themselves in the stories and perhaps re-emerge with a new perspective or appreciation.\n\n\"I'm bringing something of my world — and other people's worlds — and I'm re-showing them in this space and it's a real gift [to be able to do that],\" she says.\n\n\"I think the politics today is just so weird and so scary. So I think having all these different cultures and people together says a lot.\"\n\nLisa Reihana: Voyager is at Ngununggula, Bowral, until November 9.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-09-16/vantara-wildlife-facility-cleared-of-wrongdoing-by-indian-probe/105777330",
        "title": "'World's biggest' wild animal rescue centre cleared of wrongdoing",
        "publish_date": "Tue, 16 Sep 2025 00:00:35 +0000",
        "category": "finance",
        "authors": [],
        "text": "A sprawling private animal facility run by the son of Asia's richest man has been cleared of any wrongdoing following an investigation ordered by India's Supreme Court amid allegations of wildlife violations.\n\nVantara, which bills itself as the \"world's biggest wild animal rescue centre\", is run by Anant Ambani, son of Mukesh Ambani, the billionaire head of the multinational conglomerate Reliance Industries.\n\nThe site in the western state of Gujarat is home to hundreds of elephants, as well as 50 bears, 160 tigers, 200 lions, 250 leopards and 900 crocodiles, among other animals, according to India's Central Zoo Authority.\n\nThe court last month ordered a panel led by retired judges to investigate alleged unlawful acquisition of animals — particularly elephants — as well as other violations of wildlife regulations and money laundering.\n\nThe facility lies in the Indian state of Gujarat, Narendra Modi's home. (Courtesy: Twitter @narendramodi)\n\nWildlife activists had criticised the facility, saying it is housing endangered species on baking flatlands next to a giant oil refinery complex without any plan to return them to the wild.\n\nThe court said it issued the order after petitions based on media reports and complaints by wildlife organisations.\n\nBut the probe unveiled in the court on Monday said it had found the \"allegations rest wholly on conjecture and surmises on secondary reporting, and activist commentary\".\n\n\"The complaints are, therefore, devoid of merit,\" according to the panel's report.\n\nIn March, the German newspaper Suddeutsche Zeitung reported that Vantara imported roughly 39,000 animals in 2024, including from the Democratic Republic of Congo, the United Arab Emirates and Venezuela.\n\nWhy conservationists are afraid to criticise India's largest zoo Photo shows A graphicised image shows a number of endangered and exotic animals like chimpanzees and tigers in a collage. Several Indian news websites quietly took down stories about the criticisms levelled against the zoo.\n\nDozens of the facility's elephants were transported there in specially adapted trucks thousands of kilometres across India, according to the centre.\n\nThe probe report said \"each of the imports has undergone multi-layered and multi-jurisdictional verification\".\n\nThe court said it had \"no hesitation in accepting the conclusion so drawn in the report\".\n\n\"We are more than satisfied that the facilities at Vantara in certain respects exceeds the prescribed standards,\" the court said in its order.\n\nVantara said it welcomed the committee's findings.\n\n\"The validation of the truth … is not just a relief for everyone at Vantara but also a blessing, because it allows our work to speak for itself,\" it said in a statement.\n\nAFP/ABC",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-09-16/shire-of-coolgardie-show-cause-notice-response/105774072",
        "title": "WA shire accused of 'gross mismanagement' makes final plea for future",
        "publish_date": "Mon, 15 Sep 2025 23:59:19 +0000",
        "category": "finance",
        "authors": [],
        "text": "As the local government elections loom, a debt-laden shire in Western Australia's Goldfields has submitted its final plea to avoid suspension following serious financial mismanagement concerns.\n\nLocal Government Minister Hannah Beazley gave the Shire of Coolgardie a show cause notice on August 26, allowing the council three weeks to prove it should not be stood down.\n\nThe shire responded to the notice yesterday and said it had answered \"all questions and statements raised by the minister\".\n\nThe minister is yet to make a decision on the future of the council.\n\nHow did Coolgardie get here?\n\nIn June, WA's Auditor General's office provided an audit of the Shire of Coolgardie's 2023-24 annual financial report to Ms Beazley.\n\nIt found a host of financial and managerial mismanagement incidents, including the use of restricted funds to cover shortfalls, and the improper employment of a man working remotely from a Caribbean island.\n\nCouncil documents showed on June 30, the shire carried a debt of $27.5 million, while owing creditors $2.8 million, with just $2.9 million cash in the bank.\n\nHannah Beazley has described the Shire of Coolgardie as a \"financial mess\". (ABC Perth: Courtney Withers)\n\nIn response, Ms Beazley rose in state parliament and slammed the shire for \"gross mismanagement\".\n\nBefore the show cause notice, the minister proposed a \"boundary adjustment\" with its much larger neighbour the City of Kalgoorlie-Boulder and requested a joint submission on the proposals by both local governments.\n\nOpposition to boundary adjustment\n\nThe proposal prompted immediate backlash from ratepayers in both councils, with dozens of ratepayers writing to the minister.\n\nCoolgardie ratepayer Jan McLeod holding a placard at protests outside the Shire of Coolgardie offices in April. (ABC Goldfields: Katrina Tap)\n\nCoolgardie residents raised concerns over a loss of identity and key services, while Kalgoorlie-Boulder residents opposed taking on Coolgardie's debt.\n\nIn July, the Shire of Coolgardie submitted its individual position paper formally opposing the proposal.\n\nIts financial recovery plan outlined its path to be debt-free by 2035.\n\nThe shire also put its controversial Bluebush Accommodation Village up for sale by public tender, which as of March was valued between $16.4 to $19.4 million.\n\nCity of Kalgoorlie-Boulder's position unclear\n\nThe City of Kalgoorlie-Boulder has kept its position on the boundary adjustment confidential.\n\nHowever, at a public meeting earlier this month, Mayor Glenn Wilson said the city had been unable to take a formal position due to a lack of cooperation from the Shire of Coolgardie.\n\nGlenn Wilson attended an ad hoc meeting between ratepayers of both councils earlier this month. (ABC Goldfields: Katrina Tap)\n\n\"Despite repeated efforts to collaborate with the Shire of Coolgardie, they've formally declined to participate and [have] withheld information necessary for this shared assessment,\" he said.\n\nMr Wilson said the city was opposed to any arrangement that would affect its ratepayers.\n\nCoolgardie meets deadline\n\nIt was after Minister Beazley received submissions on her boundary adjustment proposal that she provided a show cause notice to the Shire of Coolgardie.\n\nIn a statement, she said the notice came after \"careful consideration of the information presented\".\n\n\"My decision is based on the council's role in the extremely serious nature of the financial issues faced by the shire,\" she said.\n\n\"My main priority is to ensure that stable, effective governance is provided.\n\n\"I will consider the shire's response and all the information provided to me before making any decision.\"\n\nThe Shire of Coolgardie said in a statement it was hopeful its response would remove any confusion surrounding the questions raised by the minister.\n\nMalcolm Cullen is up for re-election next month. (ABC Goldfields: Macey Turner)\n\nThe minister has not provided a timeline to the shire on when she would make her assessment.\n\nTwo of the four Coolgardie councillors whose terms are ending are seeking re-election at next month's local government elections, including Shire President Malcolm Cullen.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-09-16/cathy-freeman-ian-thorpe-stadium-australia-hall-of-fame/105777908",
        "title": "Nikki Webster and Sydney Olympics heroes mark 25 year since Games",
        "publish_date": "Mon, 15 Sep 2025 23:49:16 +0000",
        "category": "sports",
        "authors": [],
        "text": "Twenty-five years since Sydney welcomed the world, sporting heroes who captured the imagination of the country returned to the same venue that propelled them into superstardom.\n\nAt Stadium Australia on Monday night, an elite group of 10 sportspeople marked the anniversary of the Sydney Olympics with a special honour: being inducted into the venue's hall of fame.\n\nCathy Freeman and Ian Thorpe, who became national sporting legends at Sydney 2000. (Supplied: Venues NSW)\n\nAmong them were Sydney 2000 gold medal-winning runner Cathy Freeman and swimming legend Ian Thorpe, whose medal haul inspired generations to come.\n\nAll, except for Thorpe, have a special connection to the stadium that has been the home for some of the nation's most iconic sporting moments.\n\nGolden group of Olympians, Paralympians, Wallabies and a Socceroo\n\nSporting heroes Mark Schwarzer, Brad Fittler, Cathy Freeman, Ian Thorpe, John Aloisi, Louise Savauge, Andrew Johns and Tim Sullivan who were inducted into Stadium Australia hall of fame. (Supplied: Venues NSW)\n\nBeyond Olympians, footballers Mark Schwarzer and Mark Aloisi joined rugby league's Brad Fittler, Andrew Johns, Wallaby John Eales along with Paralympians Tim Sullivan and Louise Sauvage as inductees.\n\nThere was even room among the cohort for English rugby star Jonny Wilkinson, who broke Wallabies supporters' hearts at Stadium Australia in 2003 with a late field goal to win the 2003 world cup.\n\nRolling back the years in a call back to the opening ceremony, singer Nikki Webster reprised her performance of Under Southern Skies with daughter Skylah and son Malachai.\n\nNikki Webster with her children Sydney's Olympic stadium in Homebush. (Supplied: Venues NSW)\n\nFor 400-metre champion Freeman, who recently had a stand named after her, seeing her name among the champions beside her on Monday night was \"deeply personal and humbling\".\n\n\"Every time I step back into this stadium, I'm reminded of that unforgettable night on September 25, 2000, when a sold-out crowd lifted me through the 400 metre final,\" Ms Freeman said.\n\n\"To think that 25 years have passed since the Sydney games feels surreal, yet the memories remain as vivid as ever.\"\n\nLike Freeman, Sauvage had the honour of lighting the cauldron at the Paralympics before storming home for gold in the 1,500 and 5,000-metre finals.\n\nParalympic heroes Tim Sullivan and Louise Sauvage. (Supplied: Venues NSW)\n\nThe stars stood among 400 guests at Olympic Stadium to mark the occasion last night, with music from Sydney 2000 opening ceremony conductor George Ellis and a 25-piece orchestra.\n\n\"Louise, like Cathy, lit the flame at the Paralympics and then won gold under extreme pressure and with the whole nation cheering her on,\" NSW Premier Chris Minns said.\n\nThe group were selected by a panel of journalists, broadcasters and administrators who will add to the initial list of 10 with more inductees in 2027, 2029 and 2031.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-09-16/rex-passenger-issues-albany-perth-wheelchair-user-/105774708",
        "title": "Wheelchair user left to fend for herself during six-hour Rex flight delay",
        "publish_date": "Mon, 15 Sep 2025 23:02:24 +0000",
        "category": "finance",
        "authors": [],
        "text": "Embattled regional carrier Rex Airlines has apologised to a passenger left stranded at Perth Airport for more than six hours without help or a wheelchair.\n\nAlbany woman Debby Butler had been in Perth to celebrate her son's wedding.\n\nBut Ms Butler says she was effectively left to fend for herself by Rex after the airline delayed her flight home from midday to 6pm on Sunday.\n\nMs Butler requires the use of a wheelchair to get around due to a hip issue, for which she is awaiting surgery.\n\nShe was forced to wait unattended without access to food, water or a bathroom during the six-hour wait, eventually having to ask other passengers for help.\n\nAndy Wood and Debby Butler are frustrated by another surgery cancellation. (ABC Great Southern: Andrew Chounding)\n\nCare left to other passengers\n\nHer partner Andy Wood said a wheelchair was provided to Ms Butler to move her through security to the departure lounge, but taken away soon after.\n\nMr Wood said he was thankful other passengers were willing to help Ms Butler during the six-hour wait.\n\n\"They took the airline wheelchair from Deb that they put her on, so she was stuck in a chair and couldn't go anywhere,\" Mr Wood said.\n\n\" She got one coffee in six hours. \"\n\nRex's poor service record has sparked significant criticism in Albany and Esperance. (ABC Great Southern)\n\nMs Butler's hip injury means the 420-kilometre journey by car is too painful, with Mr Wood normally dropping her at the airport for the flight, driving her wheelchair to Perth and collecting her once the flight lands.\n\nMr Wood said when his partner needed to use the bathroom, neither Rex or Perth Airport staff offered her any help.\n\n\"She got another customer, another airline customer who was waiting … to put her into [another passenger's] wheelchair that was an airline one and take her to the toilet,\" Mr Wood said.\n\nAirline apologises\n\nA Rex spokesperson told the ABC the airline had spoken with Ms Butler and apologised for her experience.\n\nThe beleaguered airline entered voluntary administration in July last year after a failed bid to take on major airlines on mainline routes.\n\nThe following month, the federal government made a series of aviation-related accessibility pledges after decades of complaints and allegations of discrimination from people with disability.\n\nA Perth Airport spokesperson said the responsibility to book a wheelchair and accommodation fell to individual passengers and their chosen airline.\n\nThey said the airport did not have access to booking information for individual passengers.\n\nThe airport said the federal government was reviewing the requirements placed on airlines to assist passengers who were impacted by flight delays or disruptions.\n\nDebby Wood says it was left to other passengers to assist his partner. File photo. (ABC News: Cason Ho)\n\nCalls for government intervention\n\nRex services regulated routes in Western Australia, contracted by the state government to provide flights from Albany, Esperance, Monkey Mia and Carnarvon to Perth.\n\nThe incident came less than a week after Albany MLA Scott Leary called for the WA government to take concrete action to police the airline's poor performance.\n\nMr Leary said flight cancellations and delays were among the most common issues raised by his constituents, but the impact was being felt across the state.\n\nScott Leary says he lodged a grievance motion in parliament a week earlier. (ABC Great Southern: Andrew Chounding)\n\n\"When flights are cancelled at the last minute or services become unreliable, it has direct and devastating consequences for health, care access, tourism, commerce and daily life for regional West Australians,\" he said.\n\n\" What we expect is reliability, and right now, Rex is simply not delivering it. \"\n\nRita Saffioti says she expects issues with Rex to improve as it moves through administration. (ABC News: Keane Bourke)\n\nMr Leary said a letter he sent to Transport Minister Rita Saffioti on July 21, raising community concerns, had gone unanswered.\n\nMs Saffioti said she expected issues with Rex to improve as it moved through the administrative processes.\n\n\"Unfortunately, Rex Airlines has faced some major financial challenges and is currently in administration, making long-term planning more difficult,\" she said.\n\n\"We expect that the administration process will address any unresolved financial issues.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-09-16/the-hidden-costs-of-injuries-costing-afl-clubs-millions/105777624",
        "title": "The hidden impact of injuries costing AFL clubs millions",
        "publish_date": "Mon, 15 Sep 2025 22:31:37 +0000",
        "category": "sports",
        "authors": [],
        "text": "Player injuries are costing AFL clubs millions of dollars, as experts say club medical and performance departments are being put under strain when hit with a plethora of injuries across a season.\n\nNew research has highlighted the financial impact of injuries in the AFL, with one club losing $13 millions over six seasons, nearly 17 per cent of its total player salaries.\n\nLed by the University of Canberra's Research Institute for Sport and Exercise, the study analysed one professional AFL club over six seasons and found injury-related absences accounted for around 20 per cent of all possible matches lost, with hamstring injuries alone costing $2 million over that period.\n\nThe study suggests the AFL's soft cap — despite recent increases — still limits the investment in injury prevention and medical staffing, restricting clubs' ability to fully implement injury prevention strategies, ultimately driving up costly injury-related losses.\n\nNic Martin of the Bombers was one of 16 senior players who finished the year on the injury list at Essendon. (Getty Images: Josh Chadwick)\n\nThis year Essendon was hit by a highly publicised injury crisis and was forced to roll out a record-breaking 15 debutants with more than 30 per cent of the senior list unavailable at times.\n\nSixteen senior players ended the season on the injury list, which included some unlucky injuries such as Harry Jones's ankle dislocation as well as repeat soft tissues injuries likeJordan Ridley's hamstring strain and four ACLs.\n\nFor numerous weeks throughout the season, Essendon coach Brad Scott spoke about reviewing the club's medical program, investigating how it prepares its players and allocating extra resources to the under-fire strength and conditioning program.\n\nAs Bombers battle injury bug, these silent factors lead to athletes getting hurt Photo shows Zach Merrett leads Essendon players onto the ground Essendon has been hit with an injury toll that has rarely been seen in professional sports. ABC Sport spoke to a physiotherapist to help gain an understanding of the various factors that result in professional athletes getting hurt.\n\nThe club announced in July that high performance boss Sean Murphy would finish up when his contract expired at the end of the season replaced by Dr Mathew Inness from West Coast.\n\nNick Kane, who finished working at Essendon in February after 10 years, five of which he served as lead physiotherapist, said when senior players get injured the loads then increase on other and particularly younger players, who might not be ready for such demands.\n\n\"The other side of the coin is potentially most clubs are staffed to handle a range of anywhere from five to seven injuries at a time, but anything above that starts becoming very difficult to really manage every one of those players to the detail and effectiveness that they need,\" said Kane, who has founded an organisation aimed at better education for physios and rehab specialists.\n\n\"So then you're talking about the physios and the rehab staff and high performance stuff being overloaded with eight, 10, 12 people in rehab … it can lead to a sort of tipping point, where it becomes a really big impact on the team's output and performance.\"\n\nNick Kane finished working at Essendon in February after 10 years, five of which he served as lead physiotherapist. (Supplied: Nick Kane.)\n\nKane said Essendon staff and physios would have been feeling immense pressure.\n\n\"They'd be doing their very best work. And they are very good staff, because I know them and very good at what they do,\" Kane said.\n\n\"But ultimately, same with any role, when you [get] completely swept under and in this case the demand of what's needed is probably greater than what you have from a staffing number to be able to deliver that, it gets to a tipping point where it boils over a little bit.\n\n\"So for them, it would have been quite a difficult process throughout the year to keep it going. I think they've done a really good job with the resources they've got.\"\n\nEssendon star details toll of brutal injury Photo shows GettyImages-2206309175 Essendon ruck Sam Draper detailed the emotional toll of his season-ending Achilles rupture, which he said felt very unfair given his career-best form this year.\n\nMatt Turnbull, author in the study and former head of performance at North Melbourne, says indirect costs like salaries probably well exceed direct costs, such as healthcare, scans, seeing external doctors and surgeries.\n\n\"What we're looking at there is the cost of productivity loss or the cost of absenteeism — and so in the context of sport, it's the cost of a player missing a match due to injury and illness,\" Turnbull said.\n\nThe most costly injuries in the study were hamstrings, biceps, femoral strains, concussions and soleus (calf) strains.\n\n\"What it does is it helps us determine where to target our resources,\" Turnbull said.\n\n\"[And] what we do know about injuries now is that once there's an index injury in a season, meaning the first injury someone sustains, their risk of subsequent injury is much higher than even a recurrence.\n\n\"So that is, their risk of injuring their calf while they're returning from a hamstring injury is quite high. So putting more emphasis on preventing injuries in the preseason is really important.\"\n\nExperts say indirect costs of player unavailability can be higher than direct costs of injuries to clubs. (Getty: Russell Freeman/AFL Photos)\n\nKane said, ultimately, the increase of injuries to a club means the less likely they are to have on-field success.\n\n\"Likewise, when it comes to the individual level for athletes, every injury they experience throughout the year, the chance of them reaching optimal performance decreases,\" Kane said.\n\n\"So ultimately, when we talk around injury [and] injury prevention, what we're talking around is ultimately player availability and the impact that has on the team's success, which can be really significant.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-09-16/federal-politics-live-sept-16/105776142",
        "title": "Live: Government releases guidelines for social media platforms ahead of teen ban",
        "publish_date": "Mon, 15 Sep 2025 22:20:40 +0000",
        "category": "finance",
        "authors": [
            "Dana Morse",
            "Courtney Gould",
            "Tom Crowley"
        ],
        "text": "There's more pressure on Opposition Leader Sussan Ley following Liberal frontbencher Andrew Hastie saying he's prepared to quit or be dropped from shadow cabinet over the party's emissions policy.\n\nThe move has been welcomed by Nationals senator Matt Canavan, who has told ABC Radio National Breakfast that the \"hype around net zero is not matching the reality\".\n\n\"I have been saying for a long time net zero is not working for Australians. I think Andrew, like many Australians, are waking up to the fact the hype around net zero is not matching the reality,\" he says.\n\nCanavan says voters were promised new jobs in new industries like hydrogen but they have \"fallen over\".\n\n\" We're instead running our system to meet an international global goal, which almost no-one else in the world is taking seriously.\"\n\nThe Coalition is currently re-assessing its energy and emissions policy. A review, led by shadow minister Dan Tehan, is underway and could take up nine months to complete.\n\nCanavan, who sits on the backbench, says he would never ask Hastie to quit the frontbench over net zero but noted the federal party should adopt the stance of state branches and abandon net zero.\n\nAsked if there is a future for the Coalition under Sussan Ley if it adopts net zero, Canavan says it wouldn't be a \"good future\".",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-09-16/tia-clair-toomey-on-motherhood-and-becoming-the-crossfit-goat/105774312",
        "title": "Motherhood changed Tia-Clair Toomey's perspective, but not her drive",
        "publish_date": "Mon, 15 Sep 2025 21:50:32 +0000",
        "category": "sports",
        "authors": [],
        "text": "Tia-Clair Toomey-Orr stumbled almost accidentally into CrossFit 12 years ago, putting her on a journey that led to the Australian mother being crowned \"Fittest Woman on Earth\" for a record eighth time.\n\n\"Words can't describe it,\" Toomey-Orr said.\n\n\"It never gets old, even after all these years.\"\n\nIt started in 2013 when she briefly stepped away from competitive sport to focus on her university studies.\n\nPartner Shane Orr encouraged her to take up the high-intensity workout to compliment her running.\n\n\"It started as a hobby, something I thought I could do for the next 12 months,\" Toomey-Orr said.\n\nWithin a month, she competed in her first CrossFit Open and qualified for the 2015 CrossFit Games, where she finished runner-up in her debut year.\n\nFollowing another second-placed finish in 2016, Toomey-Orr broke through for her maiden CrossFit Games championship the next year.\n\nShe went on to win six consecutive titles between 2017 to 2022.\n\nBut she took a break from competing in 2023 to give birth to her daughter, Willow.\n\nLoading Instagram content\n\nToomey-Orr returned a year later to win a seventh title and last month sealed an unprecedented eighth crown at the 2025 CrossFit Games in New York.\n\nWhat's even more remarkable is that it's her second championship since becoming a mum.\n\n\"It's not something I anticipated going into this journey,\" she said.\n\n\"It's pretty wild and pure joy.\"\n\nOne of the toughest challenges for the world's fittest woman Photo shows Tia-Clair Toomey leaving the water during the crossfit games Tia-Clair Toomey's pregnancy was the only thing that briefly gave someone else a chance to win the CrossFit Games, until she returned to reclaim her crown.\n\nCrossFit Games director Dave Castro says Toomey-Orr's achievement is unparalleled.\n\n\"Everything about it is unprecedented. Tia is unprecedented,\" he said.\n\n\"Her legacy, if she ever gets around to retiring, will be the way her dominance changed an entire sport forever.\"\n\nMixed in with her CrossFit journey, Toomey-Orr won weightlifting gold at the 2018 Commonwealth Games, competed at the Rio Olympics and even qualified in the two-woman bobsleigh for the 2022 Winter Games. But she was ultimately not selected because her world ranking was not high enough.\n\nThe Toomey-Orr partnership harboured Winter Olympics dreams, but she was not picked for the 2022 bobsleigh team. (Supplied: Tia-Clair Toomey)\n\nShe also set a world record in the Women's Doubles division at the 2025 HYROX event in Houston — an indoor fitness competition that's billed as \"The World Series of Fitness Racing\".\n\nToomey-Orr credits husband and coach Shane Orr as a massive part of her achievements.\n\nHer eight CrossFit Games titles have been under his guidance.\n\n\"He's been beside me every step of the way,\" she said.\n\nThey met as teenagers and Orr put aside his own aspirations as a CrossFit athlete to dedicate himself to coaching.\n\nTheir unmatched record in the sport is the most successful partnership in CrossFit history.\n\nLoading Instagram content\n\nBut their proudest achievement is daughter Willow, whose arrival heralded a major change in priorities.\n\n\"My life was all about the world championships and dedicating a lot of my time and energy to our craft,\" Toomey-Orr said.\n\n\"I definitely think I found a challenge of juggling that parent-athlete balance and sometimes that gets put aside to be Willow's mum, and that's OK, I've just got to be aware of that.\"\n\nTwo-year-old Willow is now a regular on the sporting scene and even stole the show at the 2025 CrossFit Games.\n\n\"I looked up at the jumbotron and there is she on my dad's shoulders cheering for me,\" Toomey-Orr said.\n\n\"It brought a tear to my eye. It's something I will remember forever.\"\n\nLoading Instagram content\n\nToomey-Orr said she hoped her achievements could encourage parents to keep chasing their career ambitions.\n\n\"At the end of the day, I could just simply stay at home and be with Willow and be a mum, but I'm still really enjoying the journey that we're on,\" she said.\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\n\"If she can come along with us and spend every single day with us, as long as it's good for her and it's a healthy environment, that's all that really matters.\"\n\nToomey-Orr has not ruled out going for a record-extending ninth CrossFit crown, but that would be an almighty commitment, due to her own ambitious mindset.\n\n\"There are a lot of people trying to convince me,\" she said.\n\n\"The thing is, if I go for nine I've got to go for 10.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-09-16/asx-markets-business-live-news-september-16-2025/105776832",
        "title": "Live: Wall Street waits on the Fed's interest rate decision",
        "publish_date": "Mon, 15 Sep 2025 21:37:14 +0000",
        "category": "finance",
        "authors": [
            "Gareth Hutchens",
            "Daniel Ziffer"
        ],
        "text": "New research by Macquarie Business School, Huaqiao Business School and Xiamen University School of Management reveals how narcissistic chief executive officers (CEOs) – leaders who thrive on admiration and a sense of superiority – quietly undermine their companies by alienating middle managers.\n\nLook, you know it. But it's great to have the research to back it up.\n\nThe study, published in the Journal of Business Research, shows narcissistic leadership \"erodes middle managers’ sense of belonging and connection to their organisation. In practice, that means fewer new ideas, less willingness to challenge strategy and a greater risk of groupthink.\"\n\nCo-author of the study, Dr Miles Yang, Senior Lecturer in Strategy at Macquarie Business School:\n\n“When middle managers feel dismissed or undervalued by the top, they withdraw rather than risk confrontation. “The irony is that these are the very people who usually spot risks first and push for innovation.”\n\n‘Divergent strategic behaviour’ — a great name for challenging ideas\n\nThe researchers ran scenario-based experiments that tested how different CEO behaviours shaped managers’ willingness to engage in what’s known as ‘divergent strategic behaviour’ — putting forward ideas that challenge the status quo.\n\nParticipants were presented with short scenarios describing either a high-narcissism CEO (boastful, dismissive, taking all the credit) or a low-narcissism CEO (inclusive, appreciative, encouraging ideas).\n\nThose exposed to the narcissistic leader were far less likely to feel connected to their organisation or to suggest new strategies.\n\nHere's co-author Associate Professor Yue Wang, Associate Professor in International Business at Macquarie Business School.\n\n“Narcissistic CEOs are often easy to recognise once you’ve worked with them — they monopolise the spotlight, claim sole credit and show little interest in other viewpoints,” says “But during hiring, they can come across as charming and visionary, which makes it harder for boards to see the warning signs.”\n\nHere's what the reasearchers say is the 'takeaway' from the study\n\nCharisma and bold vision may grab headlines, but they’re no substitute for inclusive leadership. The new study shows narcissism at the top weakens the very people organisations rely on to adapt and innovate.\n\nFor boards, the message is clear: beware of leaders who demand admiration but dismiss those beneath them. For companies, the health of middle management could prove the difference between resilience and crisis.",
        "source": "ABC"
    },
    {
        "url": "https://www.smh.com.au/national/western-australia/wa-news-live-constable-wins-sandover-medal-20250915-p5mv8y.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "WA news LIVE: Constable wins Sandover Medal",
        "publish_date": "Tue, 16 Sep 2025 11:51:09 +1000",
        "category": "finance",
        "authors": [],
        "text": "Parent support provider, Ngala, is now taking bookings for its free residential parenting services which will allow struggling families to stay up to three nights at a centre to receive mental health support and sleep advice.\n\nThe service was announced by WA Premier Roger Cook this morning, who said the state government was investing $39.5 million into the Kensington centre.\n\nThe Kensington centre will allow more parents to stay overnight to get help with their newborn. Credit: iStock\n\n“We’ve all been there, we all remember it, as a dad of two kids, growing up we all remember those difficult early months and years of a child’s life and the parenting that goes with it,” he said.\n\n“We know babies are gorgeous … but jeez, with two hours sleep and the struggles that come with it, they can really test our mental health and well-being, and it’s important that young parents have got access to health care and the services they need so they can protect their mental health during these difficult months and years.”\n\nNgala, from mid-October, will be able to accommodate up to 14 families for overnight stays, and 20 families for day-stays each week, meaning up to 1,734 families can be supported on-site each year.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/australia-news-live-coalition-frontbench-splits-over-net-zero-trump-cracks-down-on-ngos-left-wing-activists-following-kirk-assassination-20250916-p5mvbi.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Australia news LIVE: Coalition frontbench splits over net zero; Trump cracks down on NGOs, left-wing activists following Kirk assassination",
        "publish_date": "Tue, 16 Sep 2025 11:45:05 +1000",
        "category": "finance",
        "authors": [
            "Emily Kaine"
        ],
        "text": "US President Donald Trump has said the future of TikTok depends on China’s actions, as the two countries’ negotiators prepare for a second day of trade talks in Spain.\n\nThe future of the short video app is a key agenda item in the latest round of discussions, which could pave the way for a face-to-face meeting between Trump and Chinese President Xi Jinping next month.\n\nTrump is expected to extend the Wednesday deadline for TikTok’s sale, making it the fourth reprieve given to China’s ByteDance since a US law passed during the Biden administration gave it until January 19, 2025, to divest or shut down the app.\n\nDonald Trump speaks to reporters before boarding Air Force One in New Jersey on Sunday (Monday AEST). Credit: AP\n\n“I may or may not, we’re negotiating TikTok right now,” Trump told reporters on Sunday, when asked about the app’s future. “We may let it die, or we may, I don’t know, it depends, up to China. It doesn’t matter too much. I’d like to do it for the kids.”\n\nRead the full story by Lisa Visentin here.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/business/companies/super-retail-boss-anthony-heraghty-sacked-over-misleading-the-board-20250916-p5mvc9.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Super Retail boss Anthony Heraghty sacked over misleading the board",
        "publish_date": "Tue, 16 Sep 2025 11:43:40 +1000",
        "category": "finance",
        "authors": [
            "Jessica Yun",
            "Colin Kruger"
        ],
        "text": "Anthony Heraghty, the chief executive of Super Retail Group, has been sacked for misleading the company about an alleged relationship that has plunged the ASX business into a multimillion-dollar legal battle with its former top lawyers.\n\nIn a statement to the ASX, the company said Heraghty had been terminated with immediate effect for misleading the company about the nature of his relationship with the company’s former head of human resources. Super Retail’s board of directors have also chosen to slash Heraghty’s bonuses that include unvested incentives and vested but unexercised rights.\n\nSuper Retail Group chief executive Anthony Heraghty has been terminated, a year and a half after two former top lawyers brought a legal battle alleging bullying and an undisclosed relationship. Credit: Dan Peled\n\n“The board made this decision after receiving new information from Mr Heraghty regarding his relationship with the company’s former Chief Human Resources Officer,” stated the company that operates Rebel Sport, BCF, and Supercheap Auto.\n\n“In light of this new information, the Board has concluded Mr Heraghty’s prior disclosures were not satisfactory.”",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/nsw/the-sydney-homes-being-knocked-down-and-the-people-keen-to-immortalise-them-20250818-p5mnp1.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "The Sydney homes being knocked down, and the people keen to immortalise them",
        "publish_date": "Tue, 16 Sep 2025 11:30:00 +1000",
        "category": "finance",
        "authors": [
            "Julie Power",
            "Nigel Gladstone"
        ],
        "text": "Save Log in , register or subscribe to save articles for later. Save articles for later Add articles to your saved list and come back to them any time. Got it Normal text size Larger text size Very large text size Former radio journalist Jason Smith documents Sydney homes slated for destruction to make way for townhouses, apartments or larger homes on his popular Instagram account, 1000housedrawings. Bulldozing character-filled federation, art deco and mid-century homes to make way for big boxy houses or uninspiring townhouses that don’t add amenity, density or quality of housing infuriates him. “I’ll document all the ones I can. I’ll save them in my own way with pencil and pen,” said Smith, an architectural artist, of the homes he draws. Smith says he is neither a NIMBY nor a YIMBY, but a QIMBY – a proponent of quality in my backyard and not just development for its own sake. He would like to see more initiatives to adapt existing housing, partly because of the embedded carbon, but also to preserve well-built homes with decorative details that are likely to be replaced by uninspiring townhouses and units. Jason Smith has been drawing and photographing houses slated for demolition to document Sydney’s architectural history. Credit: Janie Barrett Single house demolitions across Sydney’s inner and middle-ring areas, including Kensington, Denistone, Arncliffe, North Sydney, Padstow and Camperdown, mostly ended in newer and bigger homes being built on the same site, new Australian Bureau of Statistics data shows. Despite a rebuild rate of 2.1 new homes for each house demolished across the state, more than 80 per cent of knockdowns in 40 well-located or affluent Sydney suburbs – close to transport and amenities – were replaced by enlarged or upgraded houses. Across NSW, 77,279 dwellings were approved to be flattened and rebuilt into housing over the five years to June 2025.\n\nAdvertisement\n\nThe anticipated destruction of more homes as part of the NSW government’s multi-faceted plans to increase supply and density has historians, architects and others pushing to document these soon-to-be-bulldozed buildings and streetscapes before they disappear. Dr Jennifer Preston, chair of the Australian Institute of Architects heritage committee in NSW, said with the “significant changes” the planned transport-oriented development proposals would bring to the city, “perhaps we should again look at formally documenting the sites and streetscapes of buildings planned for demolition”. The ABS noted in its August report: “Most knock-down rebuilds are not adding to overall housing stock, but instead are used as a means of significantly upgrading an existing detached dwelling.” Smith is inspired by the artist Joseph Fowles, whose book of drawings, Sydney in 184,8 was designed to depict the city as it truly was, rather than as the English imagined it. The Herald interviewed Smith on the footpath outside two charming century-old full-brick bungalows in Wahroonga, which he drew for his Instagram account. They were “off to the tip” to make way for “uninspiring townhouses”.\n\nAdvertisement\n\nSmith says he is not anti-development. “We have to have development. I’m not silly or stupid enough to think that we’re going to save every single house,” Smith said. It is an impossible task to record every home being demolished, nor does anyone think it is warranted. An average of 16,753 dwellings got demolition approval and were rebuilt each year from 2019-20 to 2024-25. Despite the government’s push for increased density, 58 per cent of knockdown rebuilds nationwide were replaced by another detached single dwelling. In NSW, that figure was 54.8 per cent. In the late 19th century, the City of Sydney’s City Surveyor took advantage of the camera, then a new technology, to document homes threatened with demolition. This resulted in the Demolition Books, containing 5000 photographs and glass plate negatives – not all the homes were knocked down, some were only threatened. City historian Laila Ellmoos said from 1879 the council had the power to demolish any ruinous building by issuing the owner a condemnation notice to compel either a repair or demolition.\n\nAdvertisement\n\nHistorian Laila Ellmoos looks at one of the glass plate negatives uncovered by the City of Sydney archives team. Credit: Kate Geraghty Photos documenting this process are now a rich record of the city’s social history. “A hundred years later, you can say, thanks for that. Now I can see how Sydneysiders lived 100 years ago,” Ellmoos said. “What you see in those photographs [of Sydney] is poverty. It’s not a wealthy city at that time, people are really struggling.” The photos showed children in bare feet and women picking through abandoned sites for building materials. “Then you can see all the building materials, which were recycled.” Smith said the great value of the demolition books was that they document what was lost. “Sydney has always had a short-sighted love affair with demolition; only for the next generation to despair at what is gone. We can look up with envy at the Queen Victoria Building today – three times slated for demolition.”\n\nAdvertisement",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/breastfeeding-mother-kicked-out-of-virgin-lounge-for-pumping-milk-20250916-p5mvf0.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Breastfeeding mother kicked out of Virgin lounge for pumping milk",
        "publish_date": "Tue, 16 Sep 2025 11:15:01 +1000",
        "category": "finance",
        "authors": [],
        "text": "Breastfeeding mother kicked out of Virgin lounge for pumping milk\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/queensland/queensland-kids-to-get-nasal-spray-flu-vaccine-20250916-p5mvep.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Queensland kids to get nasal spray flu vaccine",
        "publish_date": "Tue, 16 Sep 2025 11:13:41 +1000",
        "category": "lifestyle",
        "authors": [
            "Rosanna Ryan"
        ],
        "text": "A flu vaccine taken as a nasal spray will be rolled out to Queensland children next year in a bid to lift toddler and preschooler vaccination rates.\n\nThe Queensland government said the product, called FluMist, had been used extensively overseas, including in the UK.\n\nHealth Minister Tim Nicholls said on Tuesday it would mean parents could avoid the anxiety of a needle injection for their children, as research showed more than a quarter of kids experienced intensive needle phobia.\n\nHealth authorities are urging more young people to get the flu vaccine. Credit: Paul Jeffers\n\nChief Health Officer Dr Catherine McDougall said providing an option for children who were needle-averse could increase uptake of the flu vaccine, with the current vaccination rate for kids under five at less than 20 per cent.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/lifestyle/health-and-wellness/could-smell-training-help-your-brain-why-this-sense-is-key-to-ageing-well-20250914-p5muwe.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Could ‘smell training’ help your brain? Why this sense is key to ageing well",
        "publish_date": "Tue, 16 Sep 2025 11:07:55 +1000",
        "category": "lifestyle",
        "authors": [
            "Miranda Levy"
        ],
        "text": "These are the areas involved in learning and emotion: the olfactory or piriform cortex, which identifies smells; the amygdala, which is involved in generating emotions; and the hippocampus, which stores and organises memories. If the hippocampus thinks the smell is important or connected with a particularly emotional moment, it can “file” the information and store it indefinitely. Smith began his academic career in philosophy, studying the area of mind and perception. After a stint as a wine columnist, he founded the Centre for the Study of the Senses at the University of London’s School of Advanced Study in 2011, alongside eminent neuroscientists such as the late Professor Colin Blakemore. Their brief was to study multisensory perception. The idea is that our senses don’t just exist in isolation, but that they inform one another. “We don’t just hear or see – everything is interconnected,” says Smith. “The most multisensory experience is tasting, and most of tasting is due to smell. It’s the combination of the two that creates flavour.” It wasn’t until the pandemic that the rest of the world sat up and started to take notice. “Mainstream science didn’t pay much attention until COVID,” says Smith. “But when anosmia emerged as one of the symptoms, online searches spiked.” In the past few years, more evidence has appeared to suggest that anosmia is a symptom of serious illness or injury.\n\nLoss of smell was a common and distinct symptom of COVID with up to 60 per cent of sufferers experiencing it. Credit: iStock “You can lose your sense of smell after a head injury, when nerves to the brain are severed,” says Smith. “Sinusitis, or a virus, can also cause anosmia. If there is no discernible cause, we call it ‘idiopathic’ anosmia. Research has shown that a gradual loss of smell can be a two-year advance warning of conditions such as dementia or Parkinson’s. It may even give clues as far as 12 years in advance.” Researchers have been working on this area for a while. In a 2014 study held in Leipzig, Germany, 7000 participants were given tests on their sensitivity to different smells, their capacity to distinguish between them, and their mental abilities. Those who had the keenest sense of smell also did better on the cognitive tests. Conversely, the weaker their “nose”, the worse they scored in verbal fluency, memorisation and attention span. A 2021 study at San Diego State University in California found that people’s performance on odour sensitivity tests appeared to predict who would go on to develop mild cognitive impairment and who would develop Alzheimer’s disease. These tests were seen to be a better predictor of the condition’s progression than the mental state examination used by GPs and neurologists. Scientists are also finding links between olfactory dysfunction and depression. A 2022 study by the Dresden University of Technology in Germany found a correlation between patients’ olfactory ability and symptoms of depressive illness: when their olfactory function improved, so did their mood.\n\nBrain scans seem to agree: olfactory dysfunction is accompanied by loss of grey matter, and a shrinking of the hippocampus. Such changes may explain both the cognitive decline and the rising depression in people with dementia: “Smell loss interferes with the affective and emotion control systems,” says Professor Thomas Hummel of Dresden University, one of the leading experts in this area. Loading Hence, scientists believe olfactory testing could become more useful in early screening for cognitive impairment. “As the new dementia drugs rely on early intervention, this could be important,” says Smith. If we know that losing your sense of smell is a sign of serious illnesses such as Alzheimer’s disease, can we reverse the equation and train our senses to slow down or even ward off dementia? For now, to claim this would be a stretch, though those working in the field are optimistic that it may one day be shown to be the case. There is more consensus around the theory that realising that paying attention to your sense of smell – “training it,” as it were – can add to a person’s enjoyment of life, and perhaps enhance their cognitive skills.\n\nSmith is convinced of this, pointing to a number of studies showing that smell training can keep you cognitively more active. “One study followed people in their 70s, some who did Sudoku, and others who did daily smell training for three months,” he says. “The ones who did Sudoku just got better at Sudoku. But the ones who did smell training had better recall.” It’s important to point out that these studies are correlative – as in, no “cause and effect” between smell and a sharper brain has been proved. But Smith feels this does not detract from the validity of their outcomes. “It’s a case of use it or lose it,” he says. “Unlike your hearing and vision, your sense of smell is underused. This is also in contrast to other animals. Therefore we have spare capacity. There was even a study published in 2016 in the Frontiers of Neuroscience suggesting that perfumers and wine experts have more grey matter than people in other occupations.” As scientists debate the potential of using smell in a clinical setting, Smith remains a flag-bearer for the use of aromas to boost your wellbeing and stimulate your brain. “Smell is bound up with memory, emotion and arousal,” he says. “If you lose arousal, your emotions are flattened and the world becomes dull and grey.” Can you train your smell for a smarter brain? What is smell training?\n\nIn 2009, Dresden University’s Hummel ran a study to investigate whether repeated short-term exposure to odours over a period of three months would have any effect on the olfactory ability of a group of anosmia sufferers. One group of volunteers was given four essential oils – and told to sniff each one every day, morning and evening, for 10 seconds at a time over a period of 12 weeks. The other was not. Loading At the end of 12 weeks, researchers found that 30 per cent of the patients who had sniffed the oils had had an improvement in olfactory function, compared with the group who didn’t participate. “Smell training definitely won’t harm and it might help,” says Smith. What were the essential oils in the trial?",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/lifestyle/prince-harry-opens-up-in-new-interview-after-king-charles-reunion-20250916-p5mvex.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Prince Harry opens up in new interview after King Charles reunion",
        "publish_date": "Tue, 16 Sep 2025 11:00:23 +1000",
        "category": "lifestyle",
        "authors": [],
        "text": "Prince Harry opens up in new interview after King Charles reunion\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/rugby-union/williams-tips-angry-all-blacks-response-20250916-p5mveu.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Williams tips angry All Blacks response",
        "publish_date": "Tue, 16 Sep 2025 10:52:59 +1000",
        "category": "finance",
        "authors": [],
        "text": "Williams tips angry All Blacks response\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/afl/the-stars-adelaide-should-target-ahead-of-clayton-oliver-20250916-p5mvev.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "The stars Adelaide should target ahead of Clayton Oliver",
        "publish_date": "Tue, 16 Sep 2025 10:52:45 +1000",
        "category": "finance",
        "authors": [],
        "text": "The stars Adelaide should target ahead of Clayton Oliver\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/western-australia/reclusive-wa-mining-billionaire-lists-west-perth-penthouse-for-sale-20250916-p5mvdq.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Reclusive WA mining billionaire lists West Perth penthouse for sale",
        "publish_date": "Tue, 16 Sep 2025 10:52:41 +1000",
        "category": "finance",
        "authors": [
            "Heather Mcneill"
        ],
        "text": "Reclusive mining billionaire Angela Bennett has listed her $15 million West Perth penthouse for sale, offering a rare insight into her private life.\n\nThe 80-year-old is the daughter of Peter Wright, who along with Lang Hancock pioneered the discovery of valuable iron ore deposits in Western Australia’s Pilbara region.\n\nAngela Bennett’s West Perth penthouse has been listed for sale. Credit: Morgan & Hayes - Rossmoyne\n\nThe heiress and businesswoman earlier this year sold her family’s stake in Rio Tinto’s giant Rhodes Ridge iron ore project to a Japanese conglomerate, sending her wealth soaring from $5 billion to $8.41 billion, according to the Australian Financial Review’s 2025 Rich List.\n\nASIC records also reveal she has ended her role as a company director, leaving her sons Todd and Paul in control of the family businesses. The move has prompted speculation she has retired.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/business/markets/asx-as-wall-street-climbs-tesla-surges-after-musk-buys-us1b-in-shares-20250916-p5mvb3.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "ASX rises as miners advance; Super Retail falls after sacking CEO",
        "publish_date": "Tue, 16 Sep 2025 10:44:54 +1000",
        "category": "finance",
        "authors": [
            "Staff Reporters"
        ],
        "text": "The Australian sharemarket opened slightly higher on Thursday, led by the mining heavyweights, after Wall Street set more records overnight.\n\nThe S&P/ASX 200 was 28.3 points, or 0.3 per cent, up at 8881.30 as of 10.39am AEST, with six of the 11 industry sectors trading in the green. The Australian dollar was flat at US66.67¢. The ASX dipped by 0.2 per cent on Monday.\n\nMining stocks paced the morning gains, with the iron ore giants BHP, Fortescue Metals and Rio Tinto up 1.2 per cent, 1.8 per cent and 1.6 per cent, respectively. Gold miners also gained again, with the rise of spot gold up 1 per cent overnight. Northern Star Resources added 1.2 per cent and Evolution Mining rose 1.1 per cent.\n\nWall Street has made a positive start to the week. Credit: AP\n\nSuper Retail Group, which owns the Rebel Sport, Supercheap Auto, BCF and Macpac chains, fell 2.2 per cent after announcing it sacked its chief executive, Anthony Heraghty, for misleading the board about an alleged affair that has plunged the company in the middle of a messy multimillion-dollar legal battle brought by two whistleblowers.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/cricket/ponting-targeted-with-abuse-after-fake-handshake-quote-spreads-on-social-media-20250916-p5mvdy.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Ponting targeted with abuse after fake handshake quote spreads on social media",
        "publish_date": "Tue, 16 Sep 2025 10:42:22 +1000",
        "category": "sports",
        "authors": [
            "Daniel Brettig"
        ],
        "text": "Ricky Ponting has been subjected to abuse after a wave of social media posts falsely claimed he criticised India’s refusal to shake hands with their Pakistani opponents after their Asia Cup Twenty20 game.\n\nIn the first match between India and Pakistan since the brief conflict in April that followed a terror attack in Kashmir, India’s captain Suryakumar Yadav and his team declined to shake hands with the Pakistan team either at the coin toss or after the game, which took place Monday morning (AEST).\n\nA quote falsely attributed to Ricky Ponting spread after being posted on social media. Credit: Getty Images\n\nThis led to a fake social media post attributing comments to Ponting that criticised India as “the big loser” on the night because of those actions. Ponting is the coach of the Punjab Kings IPL franchise.\n\nAs has become common, the fake comment was then picked up and churned across social media and news websites, and continued to be prominently shared well into Tuesday.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/money/tax/the-ato-always-wins-why-the-tax-office-is-eyeing-your-gambling-habits-20250916-p5mvdn.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "The ATO always wins: Why the tax office is eyeing your gambling habits",
        "publish_date": "Tue, 16 Sep 2025 10:39:00 +1000",
        "category": "finance",
        "authors": [
            "Julia Hartman"
        ],
        "text": "A recent win by the Australian Taxation Office (ATO) at the Administrative Review Tribunal has come as a timely reminder to any gamblers to keep records of any regular winnings, with the ATO setting its sights on betting income and other “side hustle” earnings.\n\nIt’s one of many wins the tax office has had at the tribunal in cases of taxing unexplained deposits as income. In one case, Ti Ke Tran (or Lucky Eddie, as he is known by at the Crown and Star casinos) did not lodge a tax return for several years, claiming he was living off his poker and sports betting winnings.\n\nAs Kenny Rogers once said: never count your money while you’re sitting at the table, there’ll be time enough for counting when the ATO comes. Credit: Dominic Lorrimer\n\nThe trouble was Tran could not prove that the deposits into his bank account came from gambling. As noted in his defence of the case, he was not in business, so why would he keep records?\n\nUnfortunately, this scenario was not a question of gambling being a business. Instead, it is simply that, unless taxpayers can prove where the deposits came from, the ATO will treat them as taxable income.",
        "source": "SMH"
    },
    {
        "url": "https://www.sbs.com.au/news/article/when-gout-gout-is-running-at-the-world-athletics-championships-and-how-to-watch/wxcgdxhi1",
        "title": "When Gout Gout is running at the World Athletics Championships — and how to watch",
        "publish_date": "Tue, 16 Sep 2025 01:02:50 +0000",
        "category": "sports",
        "authors": [],
        "text": "The 2025 World Athletics Championships are in full swing in Tokyo, Japan, with a full slate of Australians to watch: from distance runner Jess Hull to discus star Matt Denny.\n\n\n\n\n\nAustralia has already claimed its first medal of the championships, with pole vaulter Kurtis Marschall taking home bronze .\n\n\n\n\n\nOne Australian who'll have plenty of eyes on them at this year's championships is wunderkind Gout Gout, the 17-year-old Queensland sprinting sensation.\n\n\n\n\n\nHe'll be making his senior international debut in Tokyo this week — the youngest ever athlete to compete in his event at the World Championships.\n\n\n\n\n\nHere's everything you need to know.\n\n\n\nWhen is Gout Gout competing and in what event?\n\nGout Gout will be running in just one event at the World Championships: the men's 200 metres. He did not enter to qualify for the 100m, and is not a part of the Australian 4x100m relay team.\n\n\n\nThe 200m heats will take place at 9.15pm AEST on Wednesday. The semi-final will be at 10.02pm AEST on Thursday.\n\n\n\n\n\nAnd should Gout Gout make it all the way to the final, you're in for a late night: that will take place at 11.06pm AEST on Friday.\n\n\n\nHow can I watch Gout Gout run?\n\nLike every session from the World Athletics Championships this year, you'll be able to catch Gout Gout's event via SBS Viceland, where it will be broadcast live and free.\n\n\n\n\n\nThe World Athletics Championships 2025 Hub , via SBS On Demand, will also feature full replays, mini recaps and Aussie Focus clips for each session. Here's the full schedule for SBS' broadcast of the World Athletics Championships.\n\n\n\nWho is Gout Gout up against?\n\nGout Gout will have some strong competition this week.\n\n\n\n\n\nThe favourite is Noah Lyles from the United States, and for good reason: he's won all three of the last world championship titles in the event.\n\n\n\n\n\nLyles is one of 13 entrants in the men's 200m who have achieved a time of under 20 seconds sometime this year.\n\n\n\n\n\nGout, who holds the Oceanian record for the 200m , is sitting just outside of that barrier at 20.02 seconds.\n\n\n\nGout Gout won the men's 200m at the Ostrava Golden Spike athletics meet in the Czech Republic earlier this year, becoming the new Oceanian record holder with a time of 20.02 seconds. Source: AAP / AP / Petr David Josek US athletes Kenneth Bednarek and T'Mars McCallum, Jamaica's Bryan Levell and Botswana's Letsile Tebogo will also be ones to watch.\n\n\n\nWhat would Gout Gout making the final mean?\n\nGout Gout qualifying for the 200m final would be an immense achievement: only three Australian men have achieved such a feat, and none have done so since 2005.\n\n\n\nAs the youngest athlete to ever compete in the 200m at the championships, he'd also be the youngest finalist in the event's history. That distinction is currently held by Japan's Abdul Hakim Sani Brown, who claimed it in 2017 at the age of 18 years and 157 days.\n\n\n\nWhat has Gout Gout said?\n\nDuring a pre-race media event on Monday, Gout Gout shared how he was feeling ahead of the heats.\n\n\n\n\n\nHe said a new personal best, regardless of where he ended up in the rankings, would he a huge success in his eyes.\n\n\n\n\"It's about mentally telling myself that I deserve to be here, that I'm the same as everyone else,\" he said.\n\n\n\n\n\n\"Obviously, my first experience at this level so I'm trying not to put too much pressure on myself.\n\n\n\n\n\n\"But also putting on enough pressure so I can go out there and run very fast and have fun with it.\"\n\n\n\n\n\nEvery session from the nine-day event will be broadcast live and free across SBS VICELAND, including the World Athletics Championships 2025 Hub via SBS On Demand, which will also feature full replays, mini recaps and Aussie Focus clips for every session.\n\n\n\n\n\nMorning sessions will run from 8am to 1.30pm AEST on September 13–15 and 20–21, while evening sessions will be from 8pm to 11.30pm AEST each night of the championships.\n\n\n\n\n\nHere's the full schedule for SBS's broadcast of the World Athletics Championships.\n\n\n\n\n\n— With additional reporting by the Australian Associated Press.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/kurtis-marschall-takes-pole-vault-bronze-for-australia-at-world-athletics-championships-2025/04sycae6g",
        "title": "Kurtis Marschall takes pole vault bronze for Australia at World Athletics Championships 2025",
        "publish_date": "Mon, 15 Sep 2025 21:47:15 +0000",
        "category": "sports",
        "authors": [],
        "text": "Kurtis Marschall was thrilled to win bronze for Australia, thrilled to watch on as super Swede Mondo Duplantis broke his own world record and thrilled to be part of one of the greatest pole vault competitions ever.\n\n\n\n\n\nThere was a lot to take in.\n\n\n\n\n\nDuplantis already had a third successive world championships title in his keeping after powering over at 6.15m in Tokyo on Monday night .\n\n\n\n\n\nEver the showman, he then had the bar raised to 6.30m and cleared it at the third and final attempt to the delight of a capacity crowd that had stayed on to watch after all other events had finished.\n\n\n\n\n\nNo-one was happier than his close friend Marschall, who had earlier equalled his personal best of 5.95m, which was good enough to pocket Australia's first medal of the championships.\n\n\n\nThe 28-year-old then had three unsuccessful cracks at 6m, a barrier only three Australians have ever cleared — former world champions Steve Hooker and Dmitri Markov and Marschall's coach Paul Burgess.\n\n\n\n\n\nBut Duplantis is at another level altogether.\n\n\n\n\n\nThe 25-year-old now has three world titles to go with his 2020 and 2024 Olympic golds and 14 world records.\n\n\n\n\n\n\"It's outrageous,\" Marschall said.\n\n\n\n\n\n\"We all knew Mondo was going to do at the third attempt, it's like it was guaranteed pretty much.\n\n\n\n\n\n\"Just icing on the cake, miracle stuff, fairytale stuff and to be a part of that is so cool.\"\n\n\n\nWinning a second successive world championships bronze medal was pretty cool too, even if came with the caveat that he was 35cm shy of Duplantis.\n\n\n\n\n\n\"It's tough knowing that I just got pumped tonight, but I jumped the best I ever have against some of the best guys in the world on the biggest stage I've ever jumped on, other than the Olympics,\" Marschall said.\n\n\n\n\n\n\"It's a tough pill to swallow but just to be a part of this generation of pole vaulters is so sick and I wouldn't change it for the world.\"\n\n\n\n\n\nThere were still plenty of positives for Marschall, who produced the best series of jumps of his career.\n\n\n\n\n\n\"I'm super happy with how I performed,\" he said.\n\n\n\nREAD MORE Torrie Lewis breaks her own Australian 100m record at World Athletics Championships 2025\n\n\"Going clean through 5.90m, I've never done that before and that's what you've got to do at a championships.\n\n\n\n\n\n\"To put myself in the mix the whole way, keep the pressure on, keep the foot to the floor, pedal to the metal, that's the way you've got to go about it.\"\n\n\n\n\n\nNo one has got closer to the virtually-untouchable Duplantis in 2025 than Greek Emmanouil Karalis and that was again the case.\n\n\n\n\n\nKaralis took home the silver with 6m, but like Marschall — and everyone else — he was nowhere near the gold medallist.\n\n\n\n\n\nElsewhere in the National Stadium, Australian Liam Adcock came up just short in his bid to qualify for the men's long jump final.\n\n\n\n\n\nAdcock, the 2025 world indoor bronze medallist, was sitting just inside the top 12 qualifiers after his final-round effort of 7.94m, but a couple of other jumpers went past him and he finished in 14th spot overall.\n\n\n\n\n\nCountryman Chris Mitrevski (7.83m) also failed to advance, with 2019 world champ Tajay Gayle from Jamaica (8.28m) leading the qualifiers into Wednesday's final.\n\n\n\n\n\nThe best performance of the night from an Oceania athlete came from New Zealander Geordie Beamish, who was a shock winner of the men's steeplechase in eight minutes 33.88 seconds.\n\n\n\n\n\nWith Australian two-time world champ and London Olympics gold medallist Sally Pearson watching from the stands, there was also a boilover in the women's 100m hurdles.\n\n\n\n\n\nDitaji Kambundji won in a Swiss record of 12.24 seconds ahead of world record holder Tobi Amusan from Nigeria and American Grace Stark.\n\n\n\n\n\nCanadian Camryn Rogers won a second successive women's hammer throw world title with a best throw of 80.51m.\n\n\n\n\n\nWatch every session of the 2025 World Athletics Championships live and free across SBS VICELAND, including the World Athletics Championships 2025 Hub via SBS On Demand.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/us-china-reach-framework-deal-on-tiktok-ownership-ahead-of-trumps-call-with-xi/xvlyuelm9",
        "title": "US, China reach 'framework' deal on TikTok ownership ahead of Trump's call with Xi",
        "publish_date": "Mon, 15 Sep 2025 20:53:00 +0000",
        "category": "finance",
        "authors": [],
        "text": "Key Points Trump and Xi are set to confirm details of the deal on Saturday AEST.\n\nUS treasury secretary says national security remains priority for the US.\n\nChina called US security fears \"unilateral bullying\" as tariff disputes continue.\n\nUS and Chinese officials said they have reached a framework agreement to switch short-video app TikTok to US-controlled ownership that will be confirmed in a call between US President Donald Trump and Chinese President Xi Jinping.\n\n\n\n\n\nThe potential deal on the popular social media app, which counts 170 million US users, was a rare breakthrough in the months-long talks between the world's No. 1 and No. 2 economies that have sought to defuse a wide-ranging trade war that has unnerved global markets.\n\n\n\n\n\nAfter a meeting with Chinese negotiators in Madrid, US treasury secretary Scott Bessent said a 17 September deadline that could have disrupted the app in the US encouraged Chinese negotiators to reach a potential deal.\n\n\n\nWhat do we know about the TikTok deal?\n\nBessent said that deadline could be extended by 90 days to allow the deal to be finalised, but declined to discuss specifics of the deal.\n\n\n\n\n\nHe said when commercial terms of the deal are revealed, it will preserve cultural aspects of TikTok that Chinese negotiators care about.\n\n\n\n\n\n\"They're interested in Chinese characteristics of the app, which they think are soft power. We don't care about Chinese characteristics. We care about national security,\" Bessent told reporters at the conclusion of two days of talks in Madrid.\n\n\n\nIt is the second time this year that the two sides have said they were nearing a TikTok deal. The earlier announcement in March ultimately did not pan out.\n\n\n\n\n\nAny agreement could require approval by the Republican-controlled Congress, which passed a law in 2024 requiring divestiture due to fears that TikTok's US user data could be accessed by the Chinese government, allowing Beijing to spy on Americans or conduct influence operations through the app.\n\n\n\n\n\nBut the Trump administration has repeatedly declined to force a shutdown, which could anger the app's millions of users and disrupt political communications. Trump has credited the app with helping him win re-election last year, and his personal account has 15 million followers. The White House launched an official TikTok account last month.\n\n\n\nUS treasury secretary Scott Bessent (centre) said that US and China have reached an agreement that respects US interests and security, but is also fair to the Chinese side. Source: AAP / J.J. Guillen \"A deal was also reached on a “certain” company that young people in our Country very much wanted to save. They will be very happy! I will be speaking to President Xi on Friday. The relationship remains a very strong one!!!\" Trump wrote on his Truth Social platform.\n\n\n\n\n\nBessent did not say whether parent company ByteDance would transfer control of the app's underlying technology to the unnamed US buyer. Wang Jingtao, an official at the Chinese cyberspace regulator, said the deal could licence intellectual property rights, including algorithms.\n\n\n\n\n\nAside from TikTok, the US has cited national security concerns to block shipments of semiconductors and other advanced technology to China, and ban Chinese products that Washington has concluded could be used to spy on Americans or gather intelligence.\n\n\n\nREAD MORE What to know about Australia's new social media ban\n\nChina's top trade negotiator, Li Chenggang, told reporters that those concerns amounted to \"unilateral bullying\".\n\n\n\n\n\n\"The United States cannot on the one hand ask China to take care of its concerns, and on the other hand continue to suppress Chinese companies,\" Li said.\n\n\n\n\n\nLi said the two sides had reached a \"basic framework consensus\" on resolving TikTok-related issues — a slight variation from the language used by the US side.\n\n\n\n\n\nThe US-China meeting at the Spanish foreign ministry's Palacio de Santa Cruz was the fourth round of talks in four months to address strained trade ties as well as TikTok’s divestiture deadline.\n\n\n\n\n\nDelegations led by Bessent and Chinese vice premier He Lifeng have met in European cities since May to try to resolve a trade war that has seen tit-for-tat tariff hikes and a halt in the flow of rare earths to the United States.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/how-much-money-do-you-need-to-be-happy/4wiladly5",
        "title": "How much money do you really need to be happy? Here's what the research says",
        "publish_date": "Mon, 15 Sep 2025 19:33:15 +0000",
        "category": "finance",
        "authors": [],
        "text": "Over the next decade, Elon Musk could become the world's first trillionaire. The Tesla board recently proposed a $1.5 trillion compensation plan if Musk can meet a series of ambitious growth targets.\n\n\n\n\n\nAustralia's corporate pay packets aren't quite on that scale. Yet even here, last week it was reported that departing Virgin chief executive Jayne Hrdlicka will collect nearly $50 million in shares and other cash benefits on her way out the door.\n\n\n\n\n\nResearch from the United States suggests people think the average CEO earns ten times more than the average worker — and would prefer it was closer to only five times more.\n\n\n\n\n\nIn fact, the real gap in the US over the past decade has been estimated to mean CEOs earn a staggering 265 to 300 times more than average US workers.\n\n\n\nAustralians think CEOs earn seven times more than the average worker and would prefer if it was only three times more.\n\n\n\n\n\nBut the real gap here is also much higher. A long-running study found CEOs of the top 100 Australian companies earned 55 times more last financial year than average workers.\n\n\n\nSo, how much money is enough?\n\nPeople have asked this question for thousands of years. The ancient Greek philosopher Aristotle explained the idea of eudaimonia, or a roadmap of \"living well\", saying it \"belongs more to those who have cultivated their character and mind to the uttermost, and kept acquisition of external goods within moderate limits, than it does to those who have managed to acquire more external goods than they can possibly use, and are lacking goods of the soul.\"\n\n\n\n\n\nAristotle's philosophy doesn't call on us to shun money or wealth entirely, but argues it shouldn’t become life's sole focus.\n\n\n\n\n\nResearch over recent decades has come to different conclusions on how much money is needed to achieve peak well-being.\n\n\n\nA US study in 2010 suggested well-being maxes out around US$75,000. This figure naturally needs to be increased today to account for inflation — which, if those research findings are still true today, would be closer to AU$167,000 in today's dollars. You'd also need to take into account the cost of living in your area.\n\n\n\n\n\nOther findings suggest well-being may continually increase with growing wealth, but the increase in well-being from $1 million to $10 million is likely less than when someone moves from poverty to middle class.\n\n\n\n\n\nA 2022 experiment studied 200 people from Brazil, Indonesia, Kenya, Australia, Canada, the United States and the United Kingdom who were randomly given US$10,000 (A$15,000 at today's exchange rate).\n\n\n\n\n\nIt found people in lower-income countries \"exhibited happiness gains three times larger than those in higher-income countries\", including Australia. But that cash still provided detectable benefits for people with household incomes up to $184,000 today.\n\n\n\n\n\nRemarkably, the people in that experiment gave away more than two-thirds of that money to family, friends, strangers and charities.\n\n\n\nValuing time and relationships\n\nDecades of international research have consistently shown that materialistic goals — acquiring wealth and possessions for reasons associated with image and status — undermine wellbeing.\n\n\n\n\n\nThis is because materialistic striving is often borne out of low self-esteem or tending to compare oneself negatively to others, and there is always someone else to compare yourself against.\n\n\n\n\n\nPeople can get stuck on the \"hedonic treadmill\", where they get used to their new level of wealth and the luxuries it provides and then need more to feel happy.\n\n\n\n\n\nIt's also because the work needed to acquire that wealth can mean less time focusing on hobbies and with loved ones.\n\n\n\n\n\nHarvard research tracking two generations of men and their children over their lives, going back to 1938, shows deep, meaningful relationships with others are key to mental and physical well-being.\n\n\n\n\n\nAmerican psychologist Abraham Maslow developed a \"hierarchy\" of people’s \"needs\" in 1943. This suggested \"self-actualisation\" — reaching your pinnacle of personal growth — starts by having enough money to cover the basics of food, shelter, and access to the opportunities needed to grow as a person.\n\n\n\n\n\nIn line with this, research has shown that \"time affluence\" (maximising free time by paying people to do things you don't want to) and \"experiential buying\" (for example, meals out with loved ones, going on holidays) can support well-being by helping people develop new skills, build relationships, and create lifelong memories.\n\n\n\nIt's in most of our interests to close the wealth gap\n\nRecent data shows that economic inequality in Australia is increasing. This is particularly affecting young Australians, as housing becomes less affordable.\n\n\n\n\n\nAt a broader social level, research from the UK indicates that as inequality increases, social outcomes get worse. These include increased crime, drug and alcohol abuse, obesity as people struggle to afford nutritious food, and reductions in social trust.\n\n\n\n\n\nWhat percentage of wealth do you think is owned by the richest 20 per cent of Australians? And in your ideal Australia, how much wealth should the richest 20 per cent own?\n\n\n\n\n\nThe most recent Bureau of Statistics data we have, from 2019-20, showed the richest 20 per cent of Australians owned around 62 per cent of our wealth.\n\n\n\n\n\nAs inequality gets worse, evidence suggests it will lead to social problems that threaten to undermine the well-being of the whole community.\n\n\n\n\n\nThe irony is those who pursue extreme wealth and benefit most from this inequality will not necessarily be happier or more fulfilled because of it.\n\n\n\n\n\nBrad Elphinstone does not work for, consult, own shares in or receive funding from any company or organisation that would benefit from this article, and has disclosed no relevant affiliations beyond their academic appointment.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/video/sexually-transmitted-diseases-on-the-rise-in-australia/0zpqb1z03",
        "title": "Sexually transmitted diseases on the rise in Australia",
        "publish_date": "Mon, 15 Sep 2025 10:37:34 +0000",
        "category": "lifestyle",
        "authors": [],
        "text": "Sexually transmitted diseases on the rise in Australia\n\nPublished 15 September 2025, 10:07 am\n\nThe latest snapshot of sexually transmitted infections in Australia shows some alarming trends over the past 10 years. The report from the University of New South Wales' Kirby Institute suggests testing and accessibility issues are contributing to a rise in cases.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/video/sydney-marks-25-years-since-the-best-ever-olympic-games/wwwpudxwa",
        "title": "Sydney marks 25 years since the 'best ever' Olympic Games",
        "publish_date": "Mon, 15 Sep 2025 10:23:17 +0000",
        "category": "sports",
        "authors": [],
        "text": "Sydney marks 25 years since the 'best ever' Olympic Games\n\nPublished 15 September 2025, 9:13 am\n\nA quarter of a century ago the Sydney Olympic Games opening ceremony was about to begin. The Games were ultimately given the title as the best ever, just one of the many legacies it left behind.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/video/anz-hit-with-record-penalty-of-240-million-for-misconduct/az8vir0av",
        "title": "ANZ hit with record penalty of $240 million for misconduct",
        "publish_date": "Mon, 15 Sep 2025 10:13:35 +0000",
        "category": "finance",
        "authors": [],
        "text": "ANZ hit with record penalty of $240 million for misconduct\n\nPublished 15 September 2025, 9:12 am\n\nA week after slashing thousands of jobs, ANZ has been ordered to pay a record fine. ASIC has accused the bank of engaging in widespread misconduct, from allegedly mishandling a $14 billion bond sale for the federal government to a series of failings impacting almost 65,000 customers. ANZ has agreed to pay $240 million in penalties, the largest financial hit a single company has faced by the regulator.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/experts-warn-rates-double-for-some-sexually-transmitted-infections/bgyvsfinv",
        "title": "Experts warn rates double for some sexually transmitted infections",
        "publish_date": "Mon, 15 Sep 2025 08:49:43 +0000",
        "category": "lifestyle",
        "authors": [],
        "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nExperts say syphilis and gonorrhoea are easily treatable and preventable.\n\n\n\n\n\nBut in Australia, infection rates have roughly doubled over the past decade.\n\n\n\n\n\nThis message from Dr Skye McGregor, an epidemiologist at the Kirby Institute.\n\n\n\n\n\n\"A prevention approach really is around having discussions around sexual health with your partner, regular testing, timely treatment ... Condom use of course is also important, it can prevent a significant proportion of STIs.\"\n\n\n\n\n\nLast year, there were nearly 6,000 diagnoses of syphilis, according to a new report from the University of New South Wales' Kirby Institute.\n\n\n\n\n\nWhile most cases are still in men, infections in women have quadrupled over the past decade.\n\n\n\n\n\nThere were also more than 44,000 diagnoses of gonorrhoea last year.\n\n\n\n\n\nAnd chlamydia remains the country's most diagnosed S-I, with nearly 102,000 cases in 2024 – around half of which were among people aged 20 to 29 years.\n\n\n\n\n\n\"While we haven't seen much change in the numbers, what we'd like to see is that starting to come down.\n\n\n\n\n\nCases of HIV have actually dropped over the past decade with more than 750 cases recorded last year – 62 per cent attributable to sex between men.\n\n\n\n\n\nDoctors say preventative medications have helped, but there still needs to be vigilance for other STIs.\n\n\n\n\n\nWhat has experts really alarmed, though, is the rate of congenital syphilis.\n\n\n\n\n\nDr McGregor says it has resulted in 34 infant deaths, recorded over the past decade.\n\n\n\n\n\n\"In pregnancy untreated syphilis can lead to miscarriage, still birth, congenital syphilis – which can result in life long disability – and death of infants, so it's a serious and entirely preventable outcome.\"\n\n\n\n\n\nMore of than half of those deaths were among First Nations people.\n\n\n\n\n\nRates of gonorrhoea, syphilis and chlamydia were also 2 to 5 times higher among the group.\n\n\n\n\n\nRobert Monaghan, the Kirby Institute's inaugural Manager of First Nations Health Research, says those figures are deeply alarming.\n\n\n\n\n\n\"I think a lot of that is about access – access to services – and timely diagnosis and treatment. That is one of the biggest problems we see, especially more so in our remote Aboriginal communities. It's about choice as well. In most Aboriginal communities, especially remote, you only have one choice – which is mostly the Aboriginal Community Controlled Health Service – which do a marvellous job but they're under capacity.\"\n\n\n\n\n\nThe snapshot offered by the report suggests only 16 per cent of people aged 16 to 49 have been tested for an STI.\n\n\n\n\n\nThere are efforts towards improving rates and stigma, including self-testing kits and STI tele-health appointments.\n\n\n\n\n\nBut Dr McGregor says more needs to be done.\n\n\n\n\n\n\"We do know that it points to persistent inequities in testing and prevention and healthcare. And certainly that's where we need to focus our efforts to understand who's missing out on testing. If we look, for example, at the congenital syphilis data, we know for mothers who have had infants with congenital syphilis, the majority of those didn't receive testing early in their pregnancy. So, we need to work with the communities most impacted to understand what are the programs contribute to reduction in all of these infections.\"\n\n\n\n\n\nThat approach, Robert Monaghan says, is also intended to breakdown stigma and shame.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/anz-cops-240m-fine-for-widespread-misconduct/bmgq0k3yc",
        "title": "ANZ cops $240m fine for widespread misconduct",
        "publish_date": "Mon, 15 Sep 2025 08:18:18 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/adolescence-star-owen-cooper-youngest-male-actor-emmy-award/bs6xak09v",
        "title": "Adolescence star Owen Cooper becomes youngest male actor to win an Emmy",
        "publish_date": "Mon, 15 Sep 2025 05:07:06 +0000",
        "category": "entertainment",
        "authors": [],
        "text": "The teenage star of Adolescence has made history by becoming the youngest male actor to win an Emmy for his role in the hit Netflix drama.\n\n\n\n\n\nOwen Cooper, 15, took home best supporting actor in a limited series for playing a 13-year-old English schoolboy accused of killing a female classmate.\n\n\n\n\n\n\"Honestly, when I started these drama classes a couple years back, I didn't expect to be even in the United States, never mind here,\" he said in his acceptance speech.\n\n\n\n\n\n\"But I think tonight proves that if you listen and you focus and you step out of your comfort zone, you can achieve anything.\"\n\n\n\nREAD MORE Five reasons everybody is talking about Adolescence\n\nThe breakout star also thanked the cast and crew, as well as his parents.\n\n\n\n\n\nThe four-part series recorded 140 million views in its first three months on Netflix, and drew rave reviews.\n\n\n\n\n\nThe show also sparked widespread debate about the toxic and misogynistic influences young boys are exposed to on the internet.\n\n\n\n\n\nPrime Minister Anthony Albanese suggested it be shown in schools for educational purposes.\n\n\n\n\n\nThe show picked up five other awards, including outstanding directing for a limited or anthology series or movie for director Philip Barantini.\n\n\n\n\n\nWriters Jack Thorne and Stephen Graham won for outstanding writing in the same category.\n\n\n\n\n\n\"We never expected our little program to have such a big impact,\" said Graham, who also starred in the series.\n\n\n\n\n\nErin Doherty won best supporting actress for playing a clinical psychologist who interviews Cooper's character during an intense, single-shot interview.\n\n\n\n\n\nIn 1984, then 14-year-old Roxane Zal became the youngest winner of an Emmy Award when she won best supporting actress for her role in the TV movie Something About Amelia.\n\n\n\n\n\nThe Emmy Awards recognise excellence in television.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/sbs-news-in-easy-english-15th-september-2025/sbnl9okv6",
        "title": "SBS News in Easy English 15th September 2025",
        "publish_date": "Mon, 15 Sep 2025 05:02:08 +0000",
        "category": "sports",
        "authors": [],
        "text": "Listen to Australian and world news and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nWelcome to SBS News in Easy English, I'm Camille Bianchi.\n\n\n\n+++\n\n\n\n\n\nThe Federal Defence Minister says Australia is not spending $12 billion on submarines and ships, because the United States wants the country spend more on defence.\n\n\n\n\n\nUS President Donald Trump has previously asked Australia to increase defence spending.\n\n\n\n\n\nThe new spending announcement comes as the US makes decisions on the AUKUS defence deal with Australia.\n\n\n\n\n\nBut Defence Minister Richard Marles says Australia will make its own decisions.\n\n\n\n\n\n\"Now you can come up with a GDP number, and it depends on how you calculate it. I mean, based on the NATO calculations, for example, before yesterday's announcement, our spending of GDP was at 2.8 per cent. We will be focused on what kind of defence force we need, and we will go and resource it. The Prime Minister has been very clear about that.\"\n\n\n\n+++\n\n\n\n\n\nAustralia and Papua New Guinea will sign an agreement today, to allow the countries to take soldiers from each other.\n\n\n\n\n\nThe agreement also means Papua New Guineans can become Australian citizens by working in the Australian Defence Force.\n\n\n\n\n\nMr Albanese says the security agreement is very important.\n\n\n\n\n\n\"Papua New Guinea is a great democracy and a great friend, and the significance we place in the relationship between Australia and PNG is exemplified by the fact that you will have the Prime Minister, the Deputy Prime Minister, other ministers there as well.\"\n\n\n\n+++\n\n\n\n\n\nWestern Australia looks set to get two new public holidays, starting from 2028, under changes proposed by the state Labor Government over the weekend.\n\n\n\n\n\nPremier Roger Cook says the new holidays will fall on Easter Saturday, and Show Day, the first Monday of the September or October school holidays.\n\n\n\n+++\n\n\n\n\n\nMatildas superstar Sam Kerr has come back from almost two years away from soccer, to score her 100th goal for the English club,Chelsea.\n\n\n\n\n\nIt was an amazing return to the field, with Kerr scoring three goals.\n\n\n\n\n\n\"Oh, my God, it's massive. When I signed for Chelsea, I never, ever thought I would score a hundred goals, and to do it for such a massive club like Chelsea - and a club that I love so dearly - it's an amazing achievement and something I'm really proud of. I mean, I don't really reflect too much on my goals, but to score a hundred for Chelsea is something that I'll keep with me forever.\"\n\n\n\n+++\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/urgent-calls-for-the-federal-government-to-adopt-the-special-envoy-to-combat-islamophobias-recommendations/y9k9vtir1",
        "title": "Urgent calls for the federal government to adopt recommendations to combat Islamophobia",
        "publish_date": "Mon, 15 Sep 2025 04:37:57 +0000",
        "category": "finance",
        "authors": [],
        "text": "\n\n\n\nListen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\n\n\nThe Islamophobia Register Australia has called for the federal government to adopt the recommendations by an Islamophobia envoy and repair relations with the Muslim community in the country.\n\n\n\n\n\nThis, as Australia's first Special Envoy to Combat Islamophobia, Aftab Malik, handed down his report on addressing Islamophobia in Australia last week [[Friday]].\n\n\n\n\n\nThe co-executive director of the Islamophobia Register Australia, Sharara Attai welcomes the report.\n\n\n\n\n\nMs Attai tells SBS News there is a 'fractured relationship' between the Muslim community in Australia and the federal government.\n\n\n\n\n\nShe says the communities do not necessarily believe that the federal government has given their concerns the consideration they deserve.\n\n\n\n\n\n\"I think that there's widespread mistrust. I think it will take a lot to amend that relationship. I don't think the handing down of this report in itself is going to amend that relationship, a lot more needs to be done, and Islamophobia needs to be treated with a level of urgency that we have not seen yet.\"\n\n\n\n\n\nThe register has recorded a 530 per cent increase in incidents since the Hamas attacks on Israel on October 7, 2023.\n\n\n\n\n\nMr Malik’s report - which was commissioned by the government - includes a national plan with 54 recommendations.\n\n\n\n\n\nThe recommendations include to grant Islamophobia the \"same rights, protections, and legal recourse\" as other forms of discrimination; a review of counter-terrorism laws; and the establishment of a commission of inquiry into anti-Palestinian and anti-Arab racism.\n\n\n\n\n\nHe says discrimination against Muslim groups in Australia has been persistent, but that number of incidents has risen sharply since October 2023.\n\n\n\n\n\nMr Malik says global events can fuel Islamophobia within the country.\n\n\n\n\n\n\"The Islamophobia Register has recorded a 150 per cent of increase in verified in-person Islamophobic incidents by November 2024. Online, these incidents skyrocketed to 250 per cent, compared to any other period before that. Despite these reports, Islamophobia remains under-reported, with far more intensity than what these troubling numbers tell us.\"\n\n\n\n\n\nThe Islamophobia Register Australia's Queensland-based executive director, Nora Amath, says Muslims feel targeted and afraid against the backdrop of recent anti-migrant rallies.\n\n\n\n\n\nIn a statement, the Federation of Ethnic Communities’ Councils of Australia says they are gravely concerned by the escalation of Islamophobic violence and threats in recent days.\n\n\n\n\n\nLeading refugee resettlement and multicultural services provider, SSI echoes similar sentiment - condemning Islamophobia incidents in the country.\n\n\n\n\n\nThe report outlines a sharp increase in incidents involving prejudice and threats since 2023 - with one in three Australians expressing negative views about Muslims.\n\n\n\n\n\nThe report also found that Muslim women and girls accounted for three-quarters of all Islamophobia victims, three-fifths of physical assaults and every target of reported spitting incidents.\n\n\n\n\n\nFederal Multicultural Affairs Minister Anne Aly describes the release of the report as a historic moment.\n\n\n\n\n\nMs Aly says Muslim communities in Australia should not be living in fear.\n\n\n\n\n\n\"What Aftab has done with this report is to give voice, to give voice to Muslim across Australia who have longed endured discrimination, racism and at times, some pretty abhorrent acts of just outright hatred. And often without a form a recourse to pursue on that.\"\n\n\n\n\n\nSpeaking to the ABC on Sunday Deputy Prime Minister Richard Marles says it will take time for his party to go through the recommendations.\n\n\n\n\n\nHe was questioned if he supports Mr Malik's recommendation on penalising parliamentarians over their racist remarks.\n\n\n\n\n\nMr Malik suggested introducing clear contingencies for responses to parliamentarians who engage in hate speech or behaviour, including imposing temporary suspension from the party room or various party-granted roles.\n\n\n\n\n\nMr Marles doesn't directly respond on whether he supports the suggestion, but says racism is not allowed in parliament.\n\n\n\n\n\n\"Well look, we are gonna go through the process of responding to this report, you know, it's a very significant report, 54 recommendations, so we are gonna give the respect that it deserves and take the time to go through it, but let me be clear, the parliament should not be a place for people to be making racist statements.\"\n\n\n\n\n\nMuslim communities in the country say concrete steps to stamp out hate are needed.\n\n\n\n\n\nKhaled Alamedine, who's the General Director of the Lebanese Islamic Society told SBS Arabic that after the October 7 attacks, they noticed \"the discourse began to portray the Palestinian cause as a fabricated religious issue, reduced solely to Islam\".\n\n\n\n\n\nArabic translated to English \"We affirm that Palestine is not the cause of one religion; rather, it is a national and humanitarian issue that encompasses all components of the Palestinian people, including Muslims, Christians, and others. Palestine does not belong to one group over another, and it is not acceptable to impose a specific religious narrative.\"\n\n\n\n\n\nLebanese Muslim Association secretary Gamel Kheir was among those consulted by the Envoy for the report.\n\n\n\n\n\nMr Kheir told SBS Arabic he's keen for the government to accept and implement the document's 54 recommendations - including Australia's counter-terrorism approach.\n\n\n\n\n\n\"We've been very, very strong in our advocating for the fact that the whole concept of definition of terrorism has been unfairly pegged towards the Muslim community selectively only. We've been very much advocating the government and support by the envoy, in the fact that the definition of terrorism needs to be way better defined and less focus on the person's religion, and more focus on the act itself.\"\n\n\n\n\n\nHe says the government has an obligation now to honour the recommendations and take them seriously.\n\n\n\n\n\nIn a joint press conference last week [[Friday]] with Mr Malik, Prime Minister Anthony Albanese dismissed claims that anti-Muslim hate had not been given the same attention as hate directed at other communities.\n\n\n\n\n\n\"We have strengthened Commonwealth hate crimes to criminalise threats of violence, force or property damage that targets individuals or groups based upon race, religion or nationality. That applies across the board. We have been consistent.\"\n\n\n\n\n\nAustralian National Imams Council senior advisor Bilal Rauf says the report strengthens the case for religious protections, which the council has lobbied for.\n\n\n\n\n\nHowever, the Australian Muslim Advocacy Network has been more critical.\n\n\n\n\n\nThe network doesn't share the government's rationale for establishing the Islamophobia and antisemitism envoy roles, but welcomes the recommendations.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.theage.com.au/culture/live-reviews/out-of-a-feast-of-good-theatre-right-now-this-one-is-the-must-see-20250912-p5muig.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Out of a feast of good theatre right now this one is the must-see",
        "publish_date": "Tue, 16 Sep 2025 11:53:22 +1000",
        "category": "entertainment",
        "authors": [
            "John Shand",
            "Joyce Morgan"
        ],
        "text": "This includes the unexpected return of the boys’ mother, played by Vanessa Downing, who probably didn’t have to work too hard to be in a state of shock after what had happened to Maiden, and who completed a stellar cast fulfilling Shepard’s manic vision: a snapshot of an America that can tear itself apart. MUSICAL THEATRE\n\nBRIGHT STAR\n\nHayes Theatre, September 11\n\nUntil October 5\n\nReviewed by JOHN SHAND\n\n★★★★ Don’t necessarily judge a musical by its soundtrack. The original Broadway cast recording of Bright Star suggested I was in for a long night. The music and lyrics, by Steve Martin and Edie Brickell, are in a bluegrass/country vein, evoking the setting in North Carolina’s Blue Ridge Mountains. The songs sounded samey, the singing ordinary, and perhaps there was a good reason why nobody had penned a bluegrass musical before. But that didn’t allow for Steve Martin’s book, with its sharply drawn characters, wit and poignancy – as well as unabashed melodrama – melodrama having kept country ballads simmering since folks first donned cowboy boots. Bright Star is Sport for Jove’s first musical. Credit: Robert Catto\n\nIt also didn’t allow for the Broadway album’s singing being completely outgunned in a production devised, improbably, by leading Shakespeare company, Sport for Jove. Why, I’d wondered, would Sport for Jove lower the bar to hick musical theatre? Now I understand. Although this is the company’s first musical, music has long been key to its Shakespeare productions, and Bright Star burnishes rather than clouds its reputation. Directors Miranda Middleton and Damien Ryan and musical director Alec Steedman have assembled a 16-person ensemble, almost all of whom act, sing, dance and play. It seemed only three band members didn’t have a character to play, and only one cast member didn’t play an instrument. That was Hannah McInerney in the pivotal role of Alice Murphy. She has two especially potent songs, Please Don’t Take Him and At Long Last, and they would test the ability of any female singer not to become shrill while squeezing out the show’s emotional marrow. McInerney was superlative – and also acted her socks off as a literary magazine editor whose newborn babe was ripped from her arms 23 years before. The show zigzags between 1946 and 1923 with an abruptness that initially teases, but we get our heads around it, and learn to trust Martin’s storytelling and invest in his detailed characters. In an ensemble of co-leads, the expert actors included Cameron Bajraktarevic-Hayward, Kaya Byrne, Jack Green, Sean van Doornum, Katrina Retallick and Rupert Reid. Special mentions must go to Deirdre Khoo, who maximises the minor role of Lucy most entertainingly, and Genevieve Goldman (Margo), who has an ideal voice for the material, and who, upon learning that her love interest, Billy, is being published by Alice’s magazine, performs a little dance of exquisite ecstasy.\n\nThe lively choreography by Shannon Burns dovetails with the whip-crack directing, including such joy as a door held up to be knocked on, which, upon being opened, magically becomes a dining table. Designer Isabel Hudson cunningly implied the prevailing rusticity while accommodating 16 performers on the tight stage. Yes, the melodrama undid certain moments, and the redemptive storyline was predictable, yet all was animated by the music’s high energy under Steedman’s direction and Victoria Falconer’s onstage supervision. MUSICAL THEATRE\n\nHERE YOU COME AGAIN\n\nTheatre Royal, September 13\n\nUntil October 18\n\nReviewed by JOYCE MORGAN\n\n★★★ The towering blonde wigs, the eyelashes, the rhinestones. And that’s just the drag queens in the front stalls.\n\nThis fanfest was always going to draw Dolly Parton’s most flamboyant admirers. It’s more tribute show than fully fledged musical, so don’t look for insights into Dolly or even much about the life of the fiercely talented singer/songwriter, Tennessee-born musician. Tricia Paoluccio delivers an impeccable, sparkly Dolly. Credit: Cameron Grant Fortunately, the star of this show delivers an impeccable, sparkly Dolly. Tricia Paoluccio captures Dolly’s clear, bright voice, southern drawl and warm-hearted spirit. Whether acting lines or singing from the extensive Parton songbook, Paoluccio channels her idol. Threaded through this jukebox musical is a slender story about Dolly-tragic Kevin.\n\nSet amid the COVID pandemic, the 40-year-old has moved into his parents’ attic. Kevin’s career is on the skids, and his boyfriend has dumped him. Surrounded by stockpiled toilet rolls (remember that pandemic phenomenon?), Kevin is hoofing into the booze and Cheezels. “What would Dolly do?” he wonders. And, hey presto, she materialises – a vision in a pink frock and rhinestones. This is Dolly as fairy godmother. She’s come to set Kevin’s world to rights, help him restore his confidence and impart some homespun wisdom. What follows is a string of Parton numbers, her big hits – Here You Come Again, Jolene, Islands in the Stream, I Will Always Love You – and some lesser-known. These were well delivered, if not well integrated into the story. Taking a musical icon and spinning a tale around that figure can work brilliantly, as Titanique showed with its conceit that Celine Dion was on the doomed ship. But to succeed, the writing needs to be sharp and the story fleshed out.\n\nHere, the sections between the music sagged, especially in the first half as Kevin wallowed endlessly in his misery. As Kevin whined and Dolly retorted with more homespun wisdom than a crate of Hallmark greetings cards, by interval the repetition was deflating. The stronger second half kicked off with Nine to Five, which literally raised the tempo. Dolly’s trademark wit was also more evident, as she poked fun at country and western songs replete with dead dogs and tragic romances. The Queen of Country, now on the cusp of 80, gave her blessing to this musical, first staged in the US in 2022. Co-created by Paoluccio, Gabriel Barre (who also directs) and Bruce Vilanch, it’s been lightly adapted for an Australian audience by Fiona Harris and Mike McLeish, with Kevin’s attic set in Bendigo. Dash Kruck was an overwrought Kevin but dialled back the shrillness later in the show. Vocally, he was well-paired with Paoluccio. The seven-piece band under Andrew Worboys’ musical direction was tight as they moved around and above Paul Wills’ attic set. Several of the musicians also played minor roles.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/money/investing/i-m-in-my-30s-with-a-spare-100-000-should-i-buy-an-investment-property-20250916-p5mveq.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "I’m in my 30s with a spare $100,000. Should I buy an investment property?",
        "publish_date": "Tue, 16 Sep 2025 11:52:38 +1000",
        "category": "finance",
        "authors": [
            "Paridhi Jain"
        ],
        "text": "I’m in my 30s with a stable income, and have about $100,000 to invest. I already have a home and enough cash in my offset to match my outstanding mortgage amount, so this is on top of what I have in my offset. I have some ETFs already, but I’m thinking maybe I could get an investment property. I know a buyer’s agent, who has recommended a property. I’m hoping it’ll appreciate in a few years, and then I can sell it and reinvest the money into ETFs later. Which is the best option?\n\nWhat makes an investment the “best” investment? Is it the one that will give you the highest, fastest return, with the lowest risk (this is tongue in cheek: be wary of anyone promising all three of those things, because lowest risk won’t typically produce big, fast returns, and vice versa)?\n\nThere’s no easy answer when comparing ETFs to property, but the latter certainly involves more ingredients. Credit: Simon Letch\n\nWhat if there is no such thing as the “best” investment? What if there are simply some investments that are better suited for you, personally, than others? Then, the goal isn’t to find the biggest or fastest return – it’s to find investments that are a good fit for your personal goals.\n\nHow do you do that? Here are some factors to consider.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/western-australia/wa-news-live-constable-wins-sandover-medal-20250915-p5mv8y.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "WA news LIVE: Constable wins Sandover Medal",
        "publish_date": "Tue, 16 Sep 2025 11:51:09 +1000",
        "category": "finance",
        "authors": [],
        "text": "Parent support provider, Ngala, is now taking bookings for its free residential parenting services which will allow struggling families to stay up to three nights at a centre to receive mental health support and sleep advice.\n\nThe service was announced by WA Premier Roger Cook this morning, who said the state government was investing $39.5 million into the Kensington centre.\n\nThe Kensington centre will allow more parents to stay overnight to get help with their newborn. Credit: iStock\n\n“We’ve all been there, we all remember it, as a dad of two kids, growing up we all remember those difficult early months and years of a child’s life and the parenting that goes with it,” he said.\n\n“We know babies are gorgeous … but jeez, with two hours sleep and the struggles that come with it, they can really test our mental health and well-being, and it’s important that young parents have got access to health care and the services they need so they can protect their mental health during these difficult months and years.”\n\nNgala, from mid-October, will be able to accommodate up to 14 families for overnight stays, and 20 families for day-stays each week, meaning up to 1,734 families can be supported on-site each year.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/australia-news-live-coalition-frontbench-splits-over-net-zero-trump-cracks-down-on-ngos-left-wing-activists-following-kirk-assassination-20250916-p5mvbi.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Australia news LIVE: Coalition frontbench splits over net zero; Trump cracks down on NGOs, left-wing activists following Kirk assassination",
        "publish_date": "Tue, 16 Sep 2025 11:45:05 +1000",
        "category": "finance",
        "authors": [
            "Emily Kaine"
        ],
        "text": "US President Donald Trump has said the future of TikTok depends on China’s actions, as the two countries’ negotiators prepare for a second day of trade talks in Spain.\n\nThe future of the short video app is a key agenda item in the latest round of discussions, which could pave the way for a face-to-face meeting between Trump and Chinese President Xi Jinping next month.\n\nTrump is expected to extend the Wednesday deadline for TikTok’s sale, making it the fourth reprieve given to China’s ByteDance since a US law passed during the Biden administration gave it until January 19, 2025, to divest or shut down the app.\n\nDonald Trump speaks to reporters before boarding Air Force One in New Jersey on Sunday (Monday AEST). Credit: AP\n\n“I may or may not, we’re negotiating TikTok right now,” Trump told reporters on Sunday, when asked about the app’s future. “We may let it die, or we may, I don’t know, it depends, up to China. It doesn’t matter too much. I’d like to do it for the kids.”\n\nRead the full story by Lisa Visentin here.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/business/companies/super-retail-boss-anthony-heraghty-sacked-over-misleading-the-board-20250916-p5mvc9.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Super Retail boss Anthony Heraghty sacked over misleading the board",
        "publish_date": "Tue, 16 Sep 2025 11:43:40 +1000",
        "category": "finance",
        "authors": [
            "Jessica Yun",
            "Colin Kruger"
        ],
        "text": "Anthony Heraghty, the chief executive of Super Retail Group, has been sacked for misleading the company about an alleged relationship that has plunged the ASX business into a multimillion-dollar legal battle with its former top lawyers.\n\nIn a statement to the ASX, the company said Heraghty had been terminated with immediate effect for misleading the company about the nature of his relationship with the company’s former head of human resources. Super Retail’s board of directors have also chosen to slash Heraghty’s bonuses that include unvested incentives and vested but unexercised rights.\n\nSuper Retail Group chief executive Anthony Heraghty has been terminated, a year and a half after two former top lawyers brought a legal battle alleging bullying and an undisclosed relationship. Credit: Dan Peled\n\n“The board made this decision after receiving new information from Mr Heraghty regarding his relationship with the company’s former Chief Human Resources Officer,” stated the company that operates Rebel Sport, BCF, and Supercheap Auto.\n\n“In light of this new information, the Board has concluded Mr Heraghty’s prior disclosures were not satisfactory.”",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/nsw/the-sydney-homes-being-knocked-down-and-the-people-keen-to-immortalise-them-20250818-p5mnp1.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "The Sydney homes being knocked down, and the people keen to immortalise them",
        "publish_date": "Tue, 16 Sep 2025 11:30:00 +1000",
        "category": "finance",
        "authors": [
            "Julie Power",
            "Nigel Gladstone"
        ],
        "text": "Save Log in , register or subscribe to save articles for later. Save articles for later Add articles to your saved list and come back to them any time. Got it Normal text size Larger text size Very large text size Former radio journalist Jason Smith documents Sydney homes slated for destruction to make way for townhouses, apartments or larger homes on his popular Instagram account, 1000housedrawings. Bulldozing character-filled federation, art deco and mid-century homes to make way for big boxy houses or uninspiring townhouses that don’t add amenity, density or quality of housing infuriates him. “I’ll document all the ones I can. I’ll save them in my own way with pencil and pen,” said Smith, an architectural artist, of the homes he draws. Smith says he is neither a NIMBY nor a YIMBY, but a QIMBY – a proponent of quality in my backyard and not just development for its own sake. He would like to see more initiatives to adapt existing housing, partly because of the embedded carbon, but also to preserve well-built homes with decorative details that are likely to be replaced by uninspiring townhouses and units. Jason Smith has been drawing and photographing houses slated for demolition to document Sydney’s architectural history. Credit: Janie Barrett Single house demolitions across Sydney’s inner and middle-ring areas, including Kensington, Denistone, Arncliffe, North Sydney, Padstow and Camperdown, mostly ended in newer and bigger homes being built on the same site, new Australian Bureau of Statistics data shows. Despite a rebuild rate of 2.1 new homes for each house demolished across the state, more than 80 per cent of knockdowns in 40 well-located or affluent Sydney suburbs – close to transport and amenities – were replaced by enlarged or upgraded houses. Across NSW, 77,279 dwellings were approved to be flattened and rebuilt into housing over the five years to June 2025.\n\nAdvertisement\n\nThe anticipated destruction of more homes as part of the NSW government’s multi-faceted plans to increase supply and density has historians, architects and others pushing to document these soon-to-be-bulldozed buildings and streetscapes before they disappear. Dr Jennifer Preston, chair of the Australian Institute of Architects heritage committee in NSW, said with the “significant changes” the planned transport-oriented development proposals would bring to the city, “perhaps we should again look at formally documenting the sites and streetscapes of buildings planned for demolition”. The ABS noted in its August report: “Most knock-down rebuilds are not adding to overall housing stock, but instead are used as a means of significantly upgrading an existing detached dwelling.” Smith is inspired by the artist Joseph Fowles, whose book of drawings, Sydney in 184,8 was designed to depict the city as it truly was, rather than as the English imagined it. The Herald interviewed Smith on the footpath outside two charming century-old full-brick bungalows in Wahroonga, which he drew for his Instagram account. They were “off to the tip” to make way for “uninspiring townhouses”.\n\nAdvertisement\n\nSmith says he is not anti-development. “We have to have development. I’m not silly or stupid enough to think that we’re going to save every single house,” Smith said. It is an impossible task to record every home being demolished, nor does anyone think it is warranted. An average of 16,753 dwellings got demolition approval and were rebuilt each year from 2019-20 to 2024-25. Despite the government’s push for increased density, 58 per cent of knockdown rebuilds nationwide were replaced by another detached single dwelling. In NSW, that figure was 54.8 per cent. In the late 19th century, the City of Sydney’s City Surveyor took advantage of the camera, then a new technology, to document homes threatened with demolition. This resulted in the Demolition Books, containing 5000 photographs and glass plate negatives – not all the homes were knocked down, some were only threatened. City historian Laila Ellmoos said from 1879 the council had the power to demolish any ruinous building by issuing the owner a condemnation notice to compel either a repair or demolition.\n\nAdvertisement\n\nHistorian Laila Ellmoos looks at one of the glass plate negatives uncovered by the City of Sydney archives team. Credit: Kate Geraghty Photos documenting this process are now a rich record of the city’s social history. “A hundred years later, you can say, thanks for that. Now I can see how Sydneysiders lived 100 years ago,” Ellmoos said. “What you see in those photographs [of Sydney] is poverty. It’s not a wealthy city at that time, people are really struggling.” The photos showed children in bare feet and women picking through abandoned sites for building materials. “Then you can see all the building materials, which were recycled.” Smith said the great value of the demolition books was that they document what was lost. “Sydney has always had a short-sighted love affair with demolition; only for the next generation to despair at what is gone. We can look up with envy at the Queen Victoria Building today – three times slated for demolition.”\n\nAdvertisement",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/breastfeeding-mother-kicked-out-of-virgin-lounge-for-pumping-milk-20250916-p5mvf0.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Breastfeeding mother kicked out of Virgin lounge for pumping milk",
        "publish_date": "Tue, 16 Sep 2025 11:15:01 +1000",
        "category": "finance",
        "authors": [],
        "text": "Breastfeeding mother kicked out of Virgin lounge for pumping milk\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/queensland/queensland-kids-to-get-nasal-spray-flu-vaccine-20250916-p5mvep.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Queensland kids to get nasal spray flu vaccine",
        "publish_date": "Tue, 16 Sep 2025 11:13:41 +1000",
        "category": "lifestyle",
        "authors": [
            "Rosanna Ryan"
        ],
        "text": "A flu vaccine taken as a nasal spray will be rolled out to Queensland children next year in a bid to lift toddler and preschooler vaccination rates.\n\nThe Queensland government said the product, called FluMist, had been used extensively overseas, including in the UK.\n\nHealth Minister Tim Nicholls said on Tuesday it would mean parents could avoid the anxiety of a needle injection for their children, as research showed more than a quarter of kids experienced intensive needle phobia.\n\nHealth authorities are urging more young people to get the flu vaccine. Credit: Paul Jeffers\n\nChief Health Officer Dr Catherine McDougall said providing an option for children who were needle-averse could increase uptake of the flu vaccine, with the current vaccination rate for kids under five at less than 20 per cent.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/lifestyle/health-and-wellness/could-smell-training-help-your-brain-why-this-sense-is-key-to-ageing-well-20250914-p5muwe.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Could ‘smell training’ help your brain? Why this sense is key to ageing well",
        "publish_date": "Tue, 16 Sep 2025 11:07:55 +1000",
        "category": "lifestyle",
        "authors": [
            "Miranda Levy"
        ],
        "text": "These are the areas involved in learning and emotion: the olfactory or piriform cortex, which identifies smells; the amygdala, which is involved in generating emotions; and the hippocampus, which stores and organises memories. If the hippocampus thinks the smell is important or connected with a particularly emotional moment, it can “file” the information and store it indefinitely. Smith began his academic career in philosophy, studying the area of mind and perception. After a stint as a wine columnist, he founded the Centre for the Study of the Senses at the University of London’s School of Advanced Study in 2011, alongside eminent neuroscientists such as the late Professor Colin Blakemore. Their brief was to study multisensory perception. The idea is that our senses don’t just exist in isolation, but that they inform one another. “We don’t just hear or see – everything is interconnected,” says Smith. “The most multisensory experience is tasting, and most of tasting is due to smell. It’s the combination of the two that creates flavour.” It wasn’t until the pandemic that the rest of the world sat up and started to take notice. “Mainstream science didn’t pay much attention until COVID,” says Smith. “But when anosmia emerged as one of the symptoms, online searches spiked.” In the past few years, more evidence has appeared to suggest that anosmia is a symptom of serious illness or injury.\n\nLoss of smell was a common and distinct symptom of COVID with up to 60 per cent of sufferers experiencing it. Credit: iStock “You can lose your sense of smell after a head injury, when nerves to the brain are severed,” says Smith. “Sinusitis, or a virus, can also cause anosmia. If there is no discernible cause, we call it ‘idiopathic’ anosmia. Research has shown that a gradual loss of smell can be a two-year advance warning of conditions such as dementia or Parkinson’s. It may even give clues as far as 12 years in advance.” Researchers have been working on this area for a while. In a 2014 study held in Leipzig, Germany, 7000 participants were given tests on their sensitivity to different smells, their capacity to distinguish between them, and their mental abilities. Those who had the keenest sense of smell also did better on the cognitive tests. Conversely, the weaker their “nose”, the worse they scored in verbal fluency, memorisation and attention span. A 2021 study at San Diego State University in California found that people’s performance on odour sensitivity tests appeared to predict who would go on to develop mild cognitive impairment and who would develop Alzheimer’s disease. These tests were seen to be a better predictor of the condition’s progression than the mental state examination used by GPs and neurologists. Scientists are also finding links between olfactory dysfunction and depression. A 2022 study by the Dresden University of Technology in Germany found a correlation between patients’ olfactory ability and symptoms of depressive illness: when their olfactory function improved, so did their mood.\n\nBrain scans seem to agree: olfactory dysfunction is accompanied by loss of grey matter, and a shrinking of the hippocampus. Such changes may explain both the cognitive decline and the rising depression in people with dementia: “Smell loss interferes with the affective and emotion control systems,” says Professor Thomas Hummel of Dresden University, one of the leading experts in this area. Loading Hence, scientists believe olfactory testing could become more useful in early screening for cognitive impairment. “As the new dementia drugs rely on early intervention, this could be important,” says Smith. If we know that losing your sense of smell is a sign of serious illnesses such as Alzheimer’s disease, can we reverse the equation and train our senses to slow down or even ward off dementia? For now, to claim this would be a stretch, though those working in the field are optimistic that it may one day be shown to be the case. There is more consensus around the theory that realising that paying attention to your sense of smell – “training it,” as it were – can add to a person’s enjoyment of life, and perhaps enhance their cognitive skills.\n\nSmith is convinced of this, pointing to a number of studies showing that smell training can keep you cognitively more active. “One study followed people in their 70s, some who did Sudoku, and others who did daily smell training for three months,” he says. “The ones who did Sudoku just got better at Sudoku. But the ones who did smell training had better recall.” It’s important to point out that these studies are correlative – as in, no “cause and effect” between smell and a sharper brain has been proved. But Smith feels this does not detract from the validity of their outcomes. “It’s a case of use it or lose it,” he says. “Unlike your hearing and vision, your sense of smell is underused. This is also in contrast to other animals. Therefore we have spare capacity. There was even a study published in 2016 in the Frontiers of Neuroscience suggesting that perfumers and wine experts have more grey matter than people in other occupations.” As scientists debate the potential of using smell in a clinical setting, Smith remains a flag-bearer for the use of aromas to boost your wellbeing and stimulate your brain. “Smell is bound up with memory, emotion and arousal,” he says. “If you lose arousal, your emotions are flattened and the world becomes dull and grey.” Can you train your smell for a smarter brain? What is smell training?\n\nIn 2009, Dresden University’s Hummel ran a study to investigate whether repeated short-term exposure to odours over a period of three months would have any effect on the olfactory ability of a group of anosmia sufferers. One group of volunteers was given four essential oils – and told to sniff each one every day, morning and evening, for 10 seconds at a time over a period of 12 weeks. The other was not. Loading At the end of 12 weeks, researchers found that 30 per cent of the patients who had sniffed the oils had had an improvement in olfactory function, compared with the group who didn’t participate. “Smell training definitely won’t harm and it might help,” says Smith. What were the essential oils in the trial?",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/lifestyle/prince-harry-opens-up-in-new-interview-after-king-charles-reunion-20250916-p5mvex.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Prince Harry opens up in new interview after King Charles reunion",
        "publish_date": "Tue, 16 Sep 2025 11:00:23 +1000",
        "category": "lifestyle",
        "authors": [],
        "text": "Prince Harry opens up in new interview after King Charles reunion\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/rugby-union/williams-tips-angry-all-blacks-response-20250916-p5mveu.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Williams tips angry All Blacks response",
        "publish_date": "Tue, 16 Sep 2025 10:52:59 +1000",
        "category": "finance",
        "authors": [],
        "text": "Williams tips angry All Blacks response\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/afl/the-stars-adelaide-should-target-ahead-of-clayton-oliver-20250916-p5mvev.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "The stars Adelaide should target ahead of Clayton Oliver",
        "publish_date": "Tue, 16 Sep 2025 10:52:45 +1000",
        "category": "finance",
        "authors": [],
        "text": "The stars Adelaide should target ahead of Clayton Oliver\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/western-australia/reclusive-wa-mining-billionaire-lists-west-perth-penthouse-for-sale-20250916-p5mvdq.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Reclusive WA mining billionaire lists West Perth penthouse for sale",
        "publish_date": "Tue, 16 Sep 2025 10:52:41 +1000",
        "category": "finance",
        "authors": [
            "Heather Mcneill"
        ],
        "text": "Reclusive mining billionaire Angela Bennett has listed her $15 million West Perth penthouse for sale, offering a rare insight into her private life.\n\nThe 80-year-old is the daughter of Peter Wright, who along with Lang Hancock pioneered the discovery of valuable iron ore deposits in Western Australia’s Pilbara region.\n\nAngela Bennett’s West Perth penthouse has been listed for sale. Credit: Morgan & Hayes - Rossmoyne\n\nThe heiress and businesswoman earlier this year sold her family’s stake in Rio Tinto’s giant Rhodes Ridge iron ore project to a Japanese conglomerate, sending her wealth soaring from $5 billion to $8.41 billion, according to the Australian Financial Review’s 2025 Rich List.\n\nASIC records also reveal she has ended her role as a company director, leaving her sons Todd and Paul in control of the family businesses. The move has prompted speculation she has retired.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/business/markets/asx-as-wall-street-climbs-tesla-surges-after-musk-buys-us1b-in-shares-20250916-p5mvb3.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "ASX rises as miners advance; Super Retail falls after sacking CEO",
        "publish_date": "Tue, 16 Sep 2025 10:44:54 +1000",
        "category": "finance",
        "authors": [
            "Staff Reporters"
        ],
        "text": "The Australian sharemarket opened slightly higher on Thursday, led by the mining heavyweights, after Wall Street set more records overnight.\n\nThe S&P/ASX 200 was 28.3 points, or 0.3 per cent, up at 8881.30 as of 10.39am AEST, with six of the 11 industry sectors trading in the green. The Australian dollar was flat at US66.67¢. The ASX dipped by 0.2 per cent on Monday.\n\nMining stocks paced the morning gains, with the iron ore giants BHP, Fortescue Metals and Rio Tinto up 1.2 per cent, 1.8 per cent and 1.6 per cent, respectively. Gold miners also gained again, with the rise of spot gold up 1 per cent overnight. Northern Star Resources added 1.2 per cent and Evolution Mining rose 1.1 per cent.\n\nWall Street has made a positive start to the week. Credit: AP\n\nSuper Retail Group, which owns the Rebel Sport, Supercheap Auto, BCF and Macpac chains, fell 2.2 per cent after announcing it sacked its chief executive, Anthony Heraghty, for misleading the board about an alleged affair that has plunged the company in the middle of a messy multimillion-dollar legal battle brought by two whistleblowers.",
        "source": "TheAge"
    }
]