[
  {
    "url": "https://www.9news.com.au/national/seven-in-10-aussies-admit-to-faking-sick-days--costing-73-billion-a-year/ed7fc184-14fa-4504-9111-159f7148ea0c",
    "title": "Seven out of ten Aussies admit to calling in sick when they're actually fine - that's 24.6 million days off",
    "publish_date": "Sun, 08 Jun 2025 23:25:05 +0000",
    "category": "finance",
    "authors": [
      "Jun"
    ],
    "text": "Seven out of ten Aussies admit to calling in sick when they're actually fine.\n\nThis habit is costing businesses a whopping $7.3 billion each year because of lost work and adds up to 24.6 million days off.\n\nEven if you don't count mental health days, 68 per cent of Australians still say they've faked being sick.\n\nSeven in 10 Australians say they have called in sick to work when they are not ill. (iStock)\n\nThese numbers come from a new survey by comparison website iSelect .\n\nThey asked 1000 Australians why they pretend to be sick.\n\nThe top reason people fake sick days is lack of sleep.\n\nOne-third of those surveyed said they took a day off for this reason last year.\n\nNext up is wanting to relax and recharge, at 27 per cent, followed by needing a mental health day at 23.1 per cent.\n\nThe survey also found some differences between men and women.\n\nWomen were more likely to take a mental health day (26.6 per cent of women versus 19.5 per cent of men).\n\nThey were also more likely to take time off to care for family, like children (20.1 per cent versus 16.3 per cent of men).\n\nYounger Aussies more likely to 'chuck a sickie'\n\nThe study suggests that people fake sick days less often as they get older.\n\nYounger generations, especially those aged 18-24, are most likely to miss work because they're tired (44.1 per cent).",
    "source": "9News",
    "cluster_id": 0
  },
  {
    "url": "https://www.9news.com.au/world/a-runaway-pet-zebra-has-been-captured-in-tennessee/c4980327-db98-437d-b193-ce63fe0583bf",
    "title": "Pet zebra plucked to safety after escaping its home in strange new place",
    "publish_date": "Sun, 08 Jun 2025 22:00:56 +0000",
    "category": "finance",
    "authors": [
      "Jun"
    ],
    "text": "A runaway pet zebra that was on the loose for more than a week and became an internet sensation in the process has been found.\n\nEd the Zebra was captured safely after being located in a pasture near a subdivision in the Christiana community in central Tennessee, the Rutherford County Sheriff’s Office confirmed. The sheriff’s office said aviation crews captured the zebra.\n\n“Ed was airlifted and flown by helicopter back to a waiting animal trailer,” the sheriff's office said in a statement.\n\nREAD MORE: Hundreds of National Guard troops arrive on streets of Los Angeles ﻿\n\nThe zebra was put in a sling and plucked to safety after escaping its new home. (AP)\n\nVideo posted by the sheriff's office showed Ed wrapped in a net with his head sticking out as he was carried by the helicopter to the trailer.\n\nEd arrived in Christiana on May 30, the sheriff's office said. His owner reported him missing the next day.\n\nThe zebra was spotted and filmed running along Interstate 24, forcing deputies to shut the roadway. But Ed escaped into a wooded area.\n\nHelicopter footage of the zebra running loose in Tennessee. (Supplied)\n\nThere were several sightings posted to social media. Ed was filmed trotting through a neighbourhood.\n\nThe zebra quickly became the subject of internet memes. One fake posting showed Ed dining at a Waffle House, a southern staple. Others had him visiting other Tennessee cities or panhandling on the side of the road.",
    "source": "9News",
    "cluster_id": 1
  },
  {
    "url": "https://www.9news.com.au/national/mount-hotham-snow-ses-launches-rescue-after-more-than-20-trapped-in-deep-snow/e2b0926e-5106-4d22-bc7b-d0c4d9485094",
    "title": "Rescues after more than 20 trapped in deep snow on Mount Hotham",
    "publish_date": "Sun, 08 Jun 2025 12:53:36 +0000",
    "category": "finance",
    "authors": [
      "Jun"
    ],
    "text": "The\n\nState Emergency Service\n\nsaid more than 20 people became stuck near Hotham Heights, following more than 50 centimetres of\n\nsnowfall\n\nin the area over the weekend.",
    "source": "9News",
    "cluster_id": 2
  },
  {
    "url": "https://www.9news.com.au/national/jimmy-barnes-national-tour-kicks-off-adelaide-australian-rocker-reveals-word-not-in-his-vocabulary-exclusive/61979af3-12a5-4199-9260-2eb35125b25c",
    "title": "Jimmy Barnes reveals the word that's not in his vocabulary",
    "publish_date": "Sat, 07 Jun 2025 09:00:03 +0000",
    "category": "entertainment",
    "authors": [
      "Jun"
    ],
    "text": "From a humble start to famous rocker, Jimmy Barnes has never been one to slow down.\n\nThe Australian icon will hit stage in Adelaide tonight to kick off a solo national tour in celebration of his 21st studio album Defiant .\n\n\"The name says it all, I've been defiant since I was a young man,\" he told 9News.\n\nThe Australian icon will hit stage in Adelaide tonight to kick off a solo national tour. (9News)\n\nBorn in Scotland and raised in Adelaide's northern suburbs, Barnes left his job with SA Railways at the age of 16 to form iconic Aussie rock band Cold Chisel.\n\nNow with millions of adoring fans around the globe, he has released 10 new songs still true to the working class man the world was introduced to half a century ago.\n\nMuch of his new solo album was written quietly in hospital as the rockstar battled various health complications over the past few years\n\n\"I was trying to write lyrics on my phone and a few melodies and ideas I had,\" he said.\n\n\"When I was singing in my phone, a couple of the nurses thought I was in pain.\n\n\"They wanted to come and calm me down. I was like 'it's ok, it's just the way I sing'.\"\n\nJimmy Barnes has millions of adoring fans around the globe. (Getty)\n\nBarnes has shown that you can't hold the iconic rocker down for long.\n\nThe singer embarked on Cold Chisel's triumphant 50 year anniversary tour last year, with a special final show in front of tens of thousands at the Adelaide 500.\n\nNow, he is back on home soil to shred the stage again.\n\n\"I just think it is really fitting,\" he said.\n\n\"After all that turmoil and health problems to come back and reset and to do it where I started is an incredible thing.\"\n\nBarnes is set to perform ﻿sold-out shows in Adelaide, Sydney and Canberra.\n\nFans can still secure tickets in Perth, Melbourne and Brisbane but the shows are selling fast.\n\n\n\nDespite a busy schedule, Barnes said retirement was not in his vocabulary as long as he had a voice.\n\n\"As long as I can sing, as long as there is an audience who wants to hear me sing and what I'm doing is relevant, I'm happy to do it,\" he said.",
    "source": "9News",
    "cluster_id": 3
  },
  {
    "url": "https://www.abc.net.au/news/2025-06-09/indigenous-employment-rules-exempted-commonwealth-contracts/105392890",
    "title": "Indigenous employment rules dropped from two-thirds of Commonwealth contracts",
    "publish_date": "Mon, 09 Jun 2025 01:49:05 +0000",
    "category": "finance",
    "authors": [],
    "text": "Indigenous employment rules have been dropped in two-thirds of Commonwealth contracts, meaning $70 billion worth of contracts did not have to hire a minimum number of Indigenous people or use Indigenous businesses.\n\nThe Audit Office found departments had exempted two-thirds of recorded contracts since 2016, or about 1,475 contracts, from requirements for at least 3 per cent of the workforce to be Indigenous, or that amount of components sourced from Indigenous-owned businesses.\n\nAuditors said the exemptions were given \"often for reasons that [were] unclear\".\n\nBut even among the contracts that were subject to Indigenous participation rules, just a fifth were actually assessed for compliance — with more than a quarter found to be non-compliant.\n\nCommonwealth contracts are subject to Indigenous participation rules if they exceed $7.5 million in value and more than half of that value is spent in a nominated industry in Australia — such as in construction, healthcare, industrial cleaning or wildlife management.\n\nConstruction is one of a number of sectors where Commonwealth contractors must comply with Indigenous participation rules, unless exempted. (AAP: Jono Searle)\n\nAuditors said contract exemptions were rising, and while some were legitimate exemptions, others were given with little explanation.\n\n\"The inappropriate use of exemptions impedes achievement of the Indigenous Procurement Policy’s objectives,\" auditors said.\n\n\"Systems have been set up to allow potentially invalid exemptions.\"\n\nExemptions for non-compliance, missing assessments, outdated guidance\n\nOf those contracts that were exempted from Indigenous participation rules, a third listed their reason for exemption under the category \"other\".\n\nAuditors were told by the responsible agency, the National Indigenous Australians Agency, that contracts were sometimes exempted simply because they were \"in practice non-compliant\" with the rules.\n\nFor example, between July 2016 and September last year $35 billion worth of Defence Department contracts were exempted — with more than half of those contracts listed as \"other\" as the reason for exemption.\n\nIndigenous businesses pump $16b into economy but barriers still in place Photo shows Wiradjuri woman Tara Croker who launched startup Yaala Sparkling smiles at the camera while sitting indoors The Indigenous business sector is experiencing significant growth but challenges remain around access to capital, a lack of culturally safe support and entrenched racism.\n\nBut even among the 870 contracts where Indigenous participation rules were applied, the NIAA only assessed compliance of a fifth of those. Of those assessed, 28 per cent, or 45 contracts, were found not to have complied.\n\nThe agency had also not updated its guidance to contractors on navigating Indigenous participation rules since July 2020, despite reporting requirements changing in that time.\n\n\"A commitment to publish guidance tailored for Indigenous businesses was not met,\" the auditors found.\n\nIn a response to auditors, the National Indigenous Australians Agency said prior to the introduction of minimum requirements a decade ago, Indigenous businesses secured limited business from the Commonwealth, and the policy had \"significantly\" increased the rate of purchasing from Indigenous businesses.\n\nThe agency agreed to review its use of the \"other\" category for allowing exemptions, but argued it was the responsibility of Commonwealth departments to ensure each met their own obligations.",
    "source": "ABC",
    "cluster_id": 4
  },
  {
    "url": "https://www.abc.net.au/news/2025-06-09/nations-league-final-fan-dies-during-spain-and-portugal-game/105393678",
    "title": "Police investigate after fan dies during Nations League final in Munich",
    "publish_date": "Mon, 09 Jun 2025 01:41:57 +0000",
    "category": "sports",
    "authors": [],
    "text": "A soccer fan died during the Nations League final between Spain and Portugal on Monday morning (AEST) after falling from an overhead level onto a media area below.\n\nA UEFA official, speaking on condition of anonymity because they were not authorised to give details, confirmed a person sustained fatal injuries from a fall.\n\nThe incident occurred during the first period of extra time at the Munich stadium, when tension was high between rival players, and fans were becoming more animated. Medical personnel, stewards and police cordoned off the area, with police investigating the incident.\n\nPortugal went on to win the game on penalties.\n\nSpain coach Luis de la Fuente addressed the incident at the start of his post-game news conference.\n\n\"Before we begin with the questions, I would like to express my condolences because a fan died in the stands today,\" de la Fuente said.\n\n\"My condolences to the family.\"\n\nRonaldo basks in adulation after victory\n\nOn the field, it was another trophy for Cristiano Ronaldo, as the Portugal star shed tears after helping his team win the Nations League.\n\nRonaldo scored to help Portugal draw level with Spain 2-2 in the final, then watched as his teammates won the penalty shootout 5-3.\n\n\"I have many titles with my clubs, but nothing is better than winning for Portugal,\" Ronaldo said.\n\n\"These are tears. It's mission accomplished and so much joy.\"\n\nThe 40-year-old Ronaldo had been the first to run out onto the field for the pre-game warm-up, sparking a huge roar from the Portugal supporters, including many wearing jerseys emblazoned with his name.\n\nHis appearance prompted many supporters to pull out their phones to record the superstar while they could still see him in action. Ronaldo conceded Saturday that he won't be able to play forever.\n\nThat was three days after he helped Portugal to its first win over Germany for 25 years, scoring the winner for a 2-1 victory in the Nations League semifinals.\n\nIn the final, he was driving the team again, though it was initially a frustrating game as Spain's hard-working defenders limited his chances.\n\nNuno Mendes fired Portugal level after Martin Zubimendi opened the scoring for Spain. Then Mikel Oyarzabal put Spain ahead 2-1 at the break.\n\nBut Ronaldo was in the right place at the right time to fire home the equaliser from Mendes' deflected cross in the 61st, setting off joyous scenes among his faithful fans. It was Ronaldo's 138th goal for Portugal. Nobody has ever scored more for their country.\n\nRonaldo kept trying in what was his record-extending 221st appearance for the country, but eventually had to go off exhausted in the 88th to standing ovations from fans and a hug from coach Roberto Martínez.\n\nRonaldo said he was carrying an injury into the game.\n\n\"I had already felt it during the warm-up, I had been feeling it for some time, but for the national team, if I had to break my leg, I would have broken it,\" Ronaldo said.\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\n\"It's for a trophy, I had to play and I gave it my all.\"\n\nRonaldo's future is uncertain as his contract with Saudi club Al-Nassr only runs to the end of June. He posted \"this chapter is over\" on social media after the club's last Saudi Pro League game of the season.\n\nOn Saturday he said he had all but decided not to go to the Club World Cup despite \"quite a few\" offers from participating clubs to play there.\n\nWhatever club Ronaldo plays for, he will keep striving for Portugal.\n\n\"I have lived in many countries, I have played for many clubs, but when it's about Portugal, it is always a special feeling,\" he said.\n\nThe ABC of SPORT Sports content to make you think... or allow you not to. A newsletter delivered each Saturday.\n\nAP",
    "source": "ABC",
    "cluster_id": 5
  },
  {
    "url": "https://www.abc.net.au/news/2025-06-09/power-outages-plague-bremer-bay/105376280",
    "title": "'Buy a generator', power provider tells WA hotel angry at blackouts",
    "publish_date": "Mon, 09 Jun 2025 00:28:50 +0000",
    "category": "finance",
    "authors": [],
    "text": "A regional business owner says she has been advised to purchase a diesel generator by Western Australia's state-run power provider if she wants a guaranteed electricity supply to her hotel.\n\nBremer Bay, 500 kilometres south of Perth, has a population of about 571, rising steeply on weekends and holiday periods as tourists flock to the pristine coastline.\n\nBusinesses and residents said power supply to the town, which sits at the edge of the state's largest energy network, the South West Interconnected System (SWIS), has not kept pace with the growing population.\n\nOver the Easter and Anzac Day holiday period, residents were hit with half a dozen power outages over 10 days.\n\nTourist numbers are placing strain on Bremer Bay's energy infrastructure. (ABC Great Southern: Andrew Chounding)\n\nFor 22 years Melissa Joy has owned the Bremer Bay Resort, a pub, restaurant and motel that can serve up to 450 guests at any one time.\n\n\"Over the years, there have been lots of power issues, but in recent months we've noticed it growing increasingly worse, which is quite alarming,\" she said.\n\n\"We have outages quite regularly and quite often, anywhere from a 10-second outage to one hour or even more on a regular basis.\n\n\"It seems to be worse when we have high numbers coming to town.\"\n\nMelissa Joy says the outages are more common during holiday periods. (ABC Great Southern: Andrew Chounding)\n\nOutages cause major losses\n\nWestern Power blamed the outages on severe weather and \"atypical\" demand.\n\nBut with tourism increasingly critical to the town's economy, Ms Joy said outages during peak periods were not acceptable.\n\n\"We had to close for an entire night in December. That's our peak time. So that's $30,000 that you're not going to make,\" she said.\n\n\"It has a huge impact, it's highly disruptive and really quite unacceptable.\"\n\nBremer Bay businesses are turning to diesel generators to cope with blackouts. (ABC Great Southern: Andrew Chounding)\n\nWhen the issue was raised with Western Power, Ms Joy said she was advised to purchase a generator for the business at her own cost.\n\n\"The electricity bills to run this business are over $65,000 a year,\" she said.\n\n\" It'll be $30,000 to get a small-sized generator, which isn't going to power everything on site. \"\n\nWestern Power did not respond to claims that it had advised businesses in the region to purchase diesel generators.\n\nBremer Bay is a tourist hotspot on the edge of the South West Interconnected System power grid. (ABC Great Southern: Andrew Chounding)\n\nIn a statement, the power utility said it understood the frustrations that unplanned power outages caused residents, and acknowledged the community was prone to more blackouts.\n\nIt said \"some back-up power supply\" was in place to support the community, but faults that occurred within the Bremer town site could limit its utility.\n\nThe situation highlights the complexity WA's legislated power monopoly leaves some regional customers facing.\n\nWestern Power, a statutory corporation, is responsible for the construction and maintenance of the SWIS.\n\nBut Synergy is responsible for the generation and sales of power to customers connected to the network.\n\nBusiness owners said the backup wind-diesel power station, owned and operated by Synergy, was inadequate to service Bremer Bay and nearby settlements.\n\n'Worst year we've had'\n\nBremer Bay General Store manager Danielle Formica said the business had spent $30,000 on a new generator to keep the shop running.\n\nDanielle Formica says the general store upgraded its generator to manage blackouts. (ABC Great Southern: Andrew Chounding)\n\n\"It's probably the worst year we've had over the years; there were three occasions over the course of four days where we had to run solely on cash,\" she said.\n\n\"The locals are a population of about 300–400, but the majority [of people in town during peak season] are 15 to 20,000-plus tourists.\n\n\"We're not just going to give an IOU, so we lost thousands here at the store.\"\n\nA Synergy spokesperson said it did not manage the Bremer Bay power supply network, but its wind-diesel plant had the capacity to provide 40 per cent of Bremer Bay's energy requirements.\n\nSynergy runs a wind-diesel power plant that can provide 40 per cent of the town's energy needs. (ABC Great Southern: Andrew Chounding)\n\nIt also said four Synergy-owned back-up diesel generators were available to Western Power when managing network outages in the region.\n\nHowever, the patchwork of backup energy infrastructure has infuriated residents who are also being forced to find backup options to power essential appliances.\n\nPaul Taylor bought a house at Bremer Bay with the aim of retiring on the south coast.\n\nResidents in the town are also complaining about the frequency of power outages. (ABC Great Southern: Andrew Chounding)\n\nBut the 66-year-old, diagnosed with neuropathy of the diaphragm, requires a CPAP machine to help him sleep.\n\n\"Lying down and going to sleep at night-time is an issue as far as power failure is a concern,\" Mr Taylor said.\n\n\"My diaphragm doesn't work, and when I lie down to go to sleep, my diaphragm falls against my lungs, and it makes it very difficult for me to breathe, so my doctors have put me on a CPAP machine so I can sleep at night.\n\n\"I'm looking at options, having to buy a generator or a CPAP machine that has its own battery system if there is a power failure, but these things are like $10,000, so it's not a good option.\"\n\nWestern Power said it was exploring solutions to improve reliability.",
    "source": "ABC",
    "cluster_id": 6
  },
  {
    "url": "https://www.abc.net.au/news/2025-06-09/tennis-french-open-final-jannik-sinner-rues-missed-shot/105393296",
    "title": "'This one hurts': Sinner rues missed opportunity from French Open epic",
    "publish_date": "Mon, 09 Jun 2025 00:25:22 +0000",
    "category": "sports",
    "authors": [],
    "text": "After a flawless fortnight in Paris, Jannik Sinner was on the brink of capturing his first French Open title after a dominant run on the clay courts of Roland-Garros.\n\nFacing defending champion Carlos Alcaraz, the top-ranked Italian was firmly in control.\n\nSinner's deep groundstrokes, excellent service, heavy top spin, and subtle variations had worn down the Spaniard, who found himself 5-3 down and trailing 0-40 in the fourth set, and facing three match points.\n\nAt that moment, it felt like the best of all possible worlds for the 23-year-old Sinner.\n\nBut then the momentum swung. Alcaraz fought back, and saved the first match point when Sinner sent a forehand long. On the second, Sinner missed a return. The third ended with Alcaraz winning a short baseline exchange.\n\nSinner had just let his chance slip away.\n\nFrom there, Alcaraz produced one of the greatest comebacks in Roland-Garros history to win the longest final ever played on the Parisian dirt — 5 hours and 29 minutes.\n\n\"It's an amazing trophy, so I won't sleep tonight very well, but it's OK,\" Sinner said during the trophy ceremony.\n\nThere is hardly anything between the two best players in tennis at the moment, who have now combined to win the past six Grand Slam titles and appear poised to build one of the sport's most compelling rivalries in the years ahead.\n\nThe duel delivered a match of rare intensity, filled with punishing baseline rallies, exquisite drop shots, and brilliant passing shots — thrilling a packed Court Philippe-Chatrier.\n\nReflecting on the match in his post-final press conference, Sinner tried to draw positives from a devastating loss.\n\n\"Obviously, this one hurts,\" he said.\n\n\"There's not so much to say right now. But again, I'm happy with how we're trying to improve every day and put myself in these kinds of positions. It was a very high-level match, that's for sure.\n\n\"I'm happy to be part of it. But yeah, the final result hurts.\"\n\nIt was a particularly tough ending for Sinner, who had not dropped a set on his way to the final, including a dominant semifinal win over three-time French Open champion Novak Djokovic.\n\nBefore facing Alcaraz, Sinner had never lost a Grand Slam final, winning his first three. A victory would have made him just the fifth man in the Open Era to win three consecutive major titles.\n\n\"I'm pretty sure you are going to be a champion, not once but many, many times,\" Alcaraz told him during the trophy ceremony.\n\n\"It is a privilege to share the court with you in every tournament, making history with you.\"\n\nSinner, who will remain world number one, said he will lean on his family and loved ones to recover from the loss.\n\n\"Now it's my time to take something from the close people I have,\" he said.\n\n\"As I've always said, before my career started, I never would've imagined finding myself in this position. It wasn't even a dream because it felt so far away — I wasn't even thinking about it.\n\n\"Now I find myself here, playing the longest final in the history of Roland-Garros. It hurts, yes, but on the other hand, you can't go on crying.\"\n\nThe ABC of SPORT Sports content to make you think... or allow you not to. A newsletter delivered each Saturday.\n\nAP",
    "source": "ABC",
    "cluster_id": 7
  },
  {
    "url": "https://www.abc.net.au/news/2025-06-09/creative-writing-becomes-therapeutic-outlet-for-happy-ending/105384608",
    "title": "How creative writing can aid healing process to create happy ending",
    "publish_date": "Mon, 09 Jun 2025 00:20:43 +0000",
    "category": "finance",
    "authors": [],
    "text": "Renee Hayes was leading an \"ordinary\" suburban life when a back injury up-ended her plans, rendering her bed-bound.\n\n\"I was an active 30-year-old who went from having a busy life to being stuck in bed for [six] months,\" she said.\n\nShe had been working in a dental surgery in the Atherton Tablelands when one morning she woke in excruciating pain after a disc burst in her back.\n\nShe tried countless options to manage the constant, chronic pain, but was ultimately unable to move or work, and the sudden changes in her life made it difficult to cope.\n\n\"Anyone who has been in chronic pain knows it is incessant and it's very hard to escape from,\" she said.\n\nHayes has published three novels. (ABC Far North: Amanda Cranston)\n\nHayes eventually found an escape in the written word.\n\n\" I started writing a fantasy story and my main character was living in a beautiful forest and I could mentally escape there. \"\n\nInitially, without a laptop, Hayes hand-wrote the first draft of her self-published fantasy trilogy, the Rim Walker series, while flat on her back.\n\n\"After being stagnant for so long trying to heal, it felt like a gift and that I hadn't wasted that time,\" she said, reflecting on how writing gave her a fresh start.\n\nNow a published author of three novels, Hayes credits the creative writing process as a therapeutic outlet that allowed her to find joy again, despite the pain.\n\n\"It helped me through an incredibly tough time mentally and physically and I no longer felt like I'd lost anything or life was punishing me.\"\n\nWriting helps avoid internalising trauma\n\nCreative writing expert Edwina Shaw isn't surprised.\n\nThe writer, educator and tutor in the University of Queensland's creative writing department said the therapeutic benefits of writing went far beyond the stereotypical journalling exercise.\n\nEdwina Shaw teaches creative writing to students and helps them create their own happy endings. (Supplied: Edwina Shaw)\n\n\"It's about using the craft of writing to create something beautiful from the pain, trauma or loss someone has suffered,\" she said.\n\nShe said research had shown that the process of handwriting was very calming on the body and a subduer of our stress systems, while creativity was \"a natural calmer of the vagus nerve\".\n\nShe said writing could help to avoid internalising powerful emotions such as anger, which was associated with experiences of grief or trauma.\n\nMs Shaw says there are many therapeutic benefits of writing. (Supplied: Edwina Shaw)\n\n\"We need to separate ourselves from what's happening in our lives and reframe the way we think about it,\" she said.\n\n\"Creative writing can help us do that, whether writing a poem, a song, a novel or even writing comedy.\"\n\nHealing through songwriting\n\nThat was singer-songwriter Greta Stanley's experience when she lost her home and contents in the December 2023 flood that ripped through Far North Queensland.\n\n\"Songwriting was a big part of my healing process, 100 per cent,\" Stanley said.\n\nGreta Stanley says songwriting has been incredibly healing for her. (Supplied: Greta Stanley)\n\nAt the time, she felt lost, anxious and completely overwhelmed, was trying to manage a debilitating autoimmune disease and write her third album.\n\nStanley said she tried meditation, reiki healing, a therapist and even a visit to a psychic to help her manage her mental health and chronic pain, but songwriting was the most cathartic outlet.\n\n\"When you're feeling really lost and down and you pour it into words and share it, then people connect and resonate with it, it's a pretty incredible feeling as a musician,\" she said.\n\nStanley, 27, said using the lyrics as a tool to express herself on the album about navigating mental health gave her hope.\n\n\"The album has definitely been my way of putting all the noise and stuff going on in my head, into something that makes sense for me.\"\n\nStanley lost her home to floods and was battling an autoimmune disease when she started writing her third album. (Supplied: Greta Stanley)\n\nWriting your own happily ever after\n\nBut creative writing expert Ms Shaw said the writing did not have to be an autobiographical piece to be effective, and acknowledged that for some, that would be too confronting.\n\n\"You don't have to write about your trauma, you can give your experiences and your emotional burden to a fictional character,\" she said.\n\n\"Sometimes life is too close or too hard to write about it as yourself, so you can invent a character … and give your experience to someone else … change the ending.\"\n\nCanberra-based widow Emma Grey took that approach in her novel after the death of her husband Jeff.\n\nAfter her husband died, Emma Grey wrote a fiction novel about a widow finding love again. (Supplied: Emma Grey)\n\n\"I desperately wanted to know that this fictional character was going to be OK and by extension, that I was going to be OK,\" she said.\n\n\"I found incredible comfort in writing about grief and it was a very cathartic process for me.\"\n\nShe said using writing to navigate the trauma of losing her husband allowed her to manage the myriad of feelings that would creep up, often without warning, and channel them into something \"useful\".\n\nGrey has gone on to become a bestselling author. (Supplied: Emma Grey)\n\nThe Last Love Note, her novel written while grieving, sold more than 100,000 copies in the United States alone, becoming a beacon of hope for many who had lost loved ones, Grey said.\n\n\"I have since been inundated with messages from around the world from readers sharing their stories of loss and how my novel helped them through tough times,\" she said.",
    "source": "ABC",
    "cluster_id": 8
  },
  {
    "url": "https://www.abc.net.au/news/2025-06-09/queensland-social-housing-review-vacant-rooms/105393084",
    "title": "Queensland to review social housing after finding couple making $200k",
    "publish_date": "Mon, 09 Jun 2025 00:04:58 +0000",
    "category": "finance",
    "authors": [],
    "text": "Social housing recipients in Queensland earning more than they should will soon be evicted from their homes to make way for new tenants.\n\nThe state government claims there are some recipients earning well above the income limit that determines who is eligible for social housing.\n\nThis includes a couple in Brisbane taking home more than $200,000 a year while paying less than $200 a week to live in their social housing unit.\n\nThe government says another family in Townsville is paying less than $190 per week in rent despite earning an annual income of more than $160,000.\n\nThere are more than 50,000 people on Queensland's social housing register. (Adrian Greeman/Construction Photography/Avalon/Getty Images)\n\nFrom July 1, the government will launch annual rent reviews to determine if social housing recipients are still within the income limit.\n\n'Long overdue changes'\n\nIn Queensland, the income limit for a single person with no children is $609 per week, while for a couple it is set at $755.\n\nTenants pay 25 per cent of their income.\n\nThose who are found to earn more than the limit will be charged at market rental rates, before they are evicted and transitioned to other housing options.\n\nTenants who are within the housing limit but not paying 25 per cent of their income will have their rent increased, but the increase will be capped at $15 per week.\n\nHousing Minister Sam O'Connor says changes to social housing are necessary. (ABC Gold Coast: Dominic Cansdale)\n\nHousing Minister Sam O'Connor said the government wants to make social housing available for vulnerable people and families.\n\n\"We're empowering our housing officers to do what they do best — support the Queenslanders who most need a roof over their heads,\" he said.\n\n\"These are long overdue changes to fix the system so it's better targeted to help the people who need housing most.\"\n\nIncentivising tenants to downsize\n\nIn a bid to free up properties that are underoccupied, the government will also introduce a scheme to incentivise tenants to downsize to smaller social homes.\n\nThe government hopes this will allow more families to move into social housing.\n\nThe incentives will include rent free periods, as well covering the costs of removalists.\n\nThe government estimates thousands of bedrooms in the state's social housing stock are vacant.\n\nAt the end of the March quarter, more than 52,000 people were on Queensland’s social housing register – which is about 2,000 more than the previous quarter.\n\nFormer Labor housing minister Meaghan Scanlon ordered a review of the income limits that apply to social housing residents in August 2023. (ABC News: Chris Gillette)\n\nGovernment rules out changes to income limits\n\nWhen it was in power, the former Labor government commissioned a review of the social housing income caps, which had remained unchanged since 2006.\n\nQueensland's cap of $609 per week for singles is lower than the ACT's limit of $887, South Australia's cap of $868, and the Northern Territory's limit of $1,088 in urban areas.\n\nNoosa affordable housing project scrapped Photo shows An artists sketch One of Queensland's most expensive neighbourhoods has blocked an \"inappropriate\" affordable housing project intended to ease a shortage of homes.\n\nThe state's income cap of $999 per week for a couple with two children — which equates to $52,000 per year — is also lower than South Australia's cap of $1,737.\n\nIt means, for example, a couple with two kids earning $55,000 per year is ineligible for social housing in Queensland, but would be in South Australia.\n\nAt a press conference on Tuesday, Mr O'Connor said changing the income caps was not on the government's agenda.\n\n\"The eligibility is what it is,\" he said.\n\n\" That hasn't been touched by any government of any colour for many, many years. \"\n\nMr O'Connor said all of those currently on the social housing register met the eligibility requirements.",
    "source": "ABC",
    "cluster_id": 9
  },
  {
    "url": "https://www.abc.net.au/news/2025-06-09/maroons-origin-ii-squad-daly-cherry-evans-dropped/105393126",
    "title": "Skipper dropped as Maroons coach makes shock Origin II calls",
    "publish_date": "Sun, 08 Jun 2025 23:36:11 +0000",
    "category": "sports",
    "authors": [],
    "text": "Ricky Stuart has suggested Queensland has broken its pick-and-stick culture by dropping captain Daly Cherry-Evans for State of Origin II to play Tom Dearden at number seven.\n\nMaroons coach Billy Slater on Monday confirmed his 20-man squad for the must-win clash, with Cherry-Evans missing from the side.\n\nSecond-rower Beau Fermor has also been dropped, with Kurt Capewell returning to the side and Kurt Mann the new number 14, with Dearden at halfback.\n\nEzra Mam has also been named as a reserve as part of an extended squad, just three NRL games after his comeback from a drug-driving ban.\n\nEzra Mam has been included in the Origin II squad, having played just three games since his ban from the NRL. (Getty Images: Bradley Kanaris)\n\nThe Brisbane five-eighth will undergo scans on Monday morning in order to be cleared to join camp, after suffering a knock to his knee on Saturday night.\n\nCanberra forward Corey Horsburgh and Melbourne centre Jack Howarth are expected to be the other reserves, after Queensland was beaten 18-6 in the series opener.\n\nBut it is the dropping of Cherry-Evans that has created shockwaves, with the halfback the first Maroons captain dropped mid-series in almost 30 years.\n\nSpeaking before the 36-year-old's non-selection was confirmed on Sunday, former Blues halfback and coach Stuart had a subtle dig at those north of the border.\n\n\"Queensland have got this culture of they pick and stick,\" the current Canberra coach said.\n\n\"They've got this culture that they talk about in regards to, you know, hanging tough in tough times.\n\n\"So I think that Cherry-Evans will keep his position unless they're going to break their culture.\n\n\"[Otherwise] they're going to break their attitude in regards to what they've been promoting for so many years.\"\n\nThe Maroons have long preached about a pick-and-stick culture, which was evident through their dynasty between 2006 and 2017.\n\nStuart coached NSW in two of those seasons, falling to series losses in 2011 and 2012.\n\nBlues players were also surprised when told of Cherry-Evans's omission on Sunday afternoon.\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\n\"It's their call,\" second-rower Liam Martin said.\n\n\"Obviously they were disappointed with the first game. That's Billy's call, it's what they think is right for the team. But we've just got to respond to that now.\"\n\nDearden has started in the halves four times previously for Queensland, after first partnering Cherry-Evans in the Maroons' 2022 series-decider success.\n\nThe 24-year-old played five-eighth for Australia in last year's Pacific Cup win, and has had an impressive start to 2025 with North Queensland.\n\nDearden has scored four tries for the Cowboys, set up 11 and created 16 line breaks, bettering Cherry-Evans's numbers at Manly in all categories.\n\nSlater defends Mam selection\n\nMeanwhile, Slater defended picking Mam just three games after his return from a drug-driving ban, adamant the Brisbane star will add something to Queensland's squad.\n\nMam is expected to be rolled out as 18th man for next Wednesday's must-win clash.\n\nThe Brisbane five-eighth copped a nine-match ban for crashing a car while driving unlicensed and with drugs in his system last October.\n\nThree occupants of the Uber he collided with were injured, including a woman and her young daughter.\n\nEzra Mam determined to become a 'positive role model' after car crash Photo shows Ezra Mam looks on during a training session Ezra Mam is focused on being someone future generations can look up to after surviving the prospect of his contract being torn up by the Broncos as a result of his car crash.\n\nMam was fined $120,000 by the NRL and subsequently attended a rehabilitation facility and worked on a job site before returning to pre-season training in January.\n\nSlater said he had not had a chance to sense how remorseful Mam was, having only spoken to the 22-year-old on Sunday night to inform him of his selection.\n\n\"He's the right person for that position right now,\" Slater said.\n\n\"I am sure people will have their speculation around all the people selected. That is OK, everyone is entitled to their opinion.\n\n\"He has been doing a great job since he returned. We feel the squad will benefit from him being here.\"\n\nMam has played three NRL games since his return to the playing arena and was booed repeatedly by the Brookvale Oval crowd in the recent 34-6 loss to Manly.\n\nBut Slater said there was no question over whether the star had done enough to prove his worth to the Maroons squad.\n\n\"Have you watched the couple of games back? He has been pretty good, I don't think he has skipped a beat,\" Slater said.\n\n\"By all reports he has been doing a lot of training through the first half of the year while he was sitting out.\n\n\"He has been in this position before and been part of this squad before. I am sure he will take his opportunity if presented.\"\n\nQUEENSLAND SQUAD FOR STATE OF ORIGIN II: Kalyn Ponga, Xavier Coates, Robert Toia, Hamiso Tabuai-Fidow, Valentine Holmes, Cameron Munster, Tom Dearden, Tino Fa'asuamaleaui, Harry Grant, Moeaki Fotuaika, Reuben Cotter, Jeremiah Nanai, Pat Carrigan, Kurt Mann, Lindsay Collins, Kurt Capewell, Trent Loiero, Ezra Mam, Jack Howarth, Corey Horsburgh.\n\nThe ABC of SPORT Sports content to make you think... or allow you not to. A newsletter delivered each Saturday.\n\nAAP",
    "source": "ABC",
    "cluster_id": 10
  },
  {
    "url": "https://www.abc.net.au/news/2025-06-09/enrico-taglietti-shaped-canberras-architecture/105387078",
    "title": "Architect Taglietti transforms Canberra from the 'invisible city' to 'dream city'",
    "publish_date": "Sun, 08 Jun 2025 22:15:18 +0000",
    "category": "entertainment",
    "authors": [],
    "text": "Architect Enrico Taglietti had a lasting impact on Canberra, designing many well-known buildings that stand to this day.\n\nFor those familiar with his work, those buildings represent a golden era of design and hope for the future for the fledgling capital.\n\nTaglietti first arrived in Australia in 1955, making Canberra his home in the early '60s.\n\nWithin the Taglietti household architecture was not just a job, but also poetry and art.\n\nTaglietti's proposal for a visitor centre on Canberra's Red Hill in 1962. (Supplied: Canberra Museum and Gallery )\n\nOften it was the subject of conversation around the dinner table with his wife Franca and their two daughters Tanja and Tabitha.\n\nNow a new exhibition, Taglietti: Life in Design, at the Canberra Museum and Gallery offers insight into the mind of one of Australia's most accomplished architects, almost 100 years after his birth.\n\n'The air we breathed'\n\nIn one of the rooms of the exhibition is a table Taglietti made.\n\nThis table was used by the Taglietti family as a place to come together and talk about design. It was later used in Taglietti's home office. (ABC News: Luke Stephenson)\n\nThe piece of furniture is surrounded by Taglietti's colourful sketches, ideas for a cafe in the city airport, a pitch for a visitor centre at Red Hill, and thoughts about what the outskirts of the capital could look like.\n\nThe table has stains on it, a burn mark here, a scratch there. For his daughter Tanja Taglietti the table symbolises the ethos of her family home in Griffith.\n\nTanja Taglietti helped put together the exhibition. (ABC News: Luke Stephenson)\n\n\"Nothing was static in our household, everything changed,\" Ms Taglietti said.\n\n\" My sister and I were often encouraged to make our own changes to the house and that was acceptable because, you know, you could change it again. Nothing is permanent. \"\n\nThere are images around the exhibition of Tanja and her sister Tabitha visiting the construction site for what would become the Cinema Center located on Bunda Street.\n\nEnrico Taglietti walks with his daughters and their friend through the construction site of the Cinema Center in 1965. (Supplied: Ted Richards, Taglietti Archive)\n\n\"It was the air we breathed, it was a normality,\" Ms Taglietti said.\n\nEnrico and Franca's partnership played a pivotal role in Taglietti's creations.\n\nWhen Tabitha and Tanja came along, they too got a say.\n\n\"Mum was, we all were, made to feel that our voice counted … even in his buildings we were made to feel that we were important in that design.\"\n\nA model of Taglietti's Cinema Center design on show in the exhibition. (ABC News: Luke Stephenson)\n\n'The invisible city'\n\nTaglietti spent his youth in Ethiopia with his parents, before returning to Milan and attending the Milian Polytechnic University.\n\nHe and Franca decided to make Canberra their home in the early '60s.\n\nFranca was a visionary in her own right and was often involved in design discussions. (Supplied: Canberra Museum and Gallery)\n\nThe open space and clear air of the capital reminded Taglietti of his youth.\n\n\"He has responded beautifully to the context to what he found when he came here, which he called the 'invisible city', the 'dream City',\" exhibition co-curator Dr Silvia Micheli said.\n\n\" It was a city that was growing very fast and it was waiting for an architect to give a special answer. \"\n\nExhibition co-curator Silvia Micheli says Taglietti called Canberra the \"dream city\". (ABC News: Luke Stephenson)\n\nThat answer came in the form of the Italian Embassy in 1967, Dickson Library in 1968, the Flynn Primary School in 1972 and Giralang Primary School in 1974, among other designs.\n\nFor those living in Canberra at the time, Taglietti captured the way of life.\n\nSenior curator Virgina Rigney grew up in the city and said Taglietti's designs showed his commitment to listening.\n\n\"I think watching, looking, absorbing, not dictating — I think that's a really critical part of his architectural approach and that's why we've called the exhibition Life in Design because it's responding to the life of people,\" she said.\n\nSenior curator Virginia Rigney says Taglietti's designs have had a lasting impact on her. (ABC News: Luke Stephenson)\n\n\"It was really important for children like me in Canberra who grew up here, who experienced schools and community centres, the cinema, the library … these kinds of places actually spoke to how we wanted to live.\"\n\nWhich meant when it came to designing homes, he often had to ask some tricky questions.\n\n\"He would sit down carefully with people and [ask], 'So how do you want to live?',\" Ms Rigney said.\n\n\"He even asked a couple: 'Do you love your wife?', and you know, they were a bit shocked. And he said, 'Well, it's because I need to know if you need space from one another in your house.\n\nTaglietti's work featured in a Women's Weekly magazine. (Supplied: Canberra Museum and Gallery)\n\n\"He wasn't assuming people needed a living room and a kitchen. But actually, how they wanted to live.\"\n\nThe changing fabric of 'the dream city'\n\nChange was a central element of Taglietti's artistic approach.\n\nWhen the Flynn Primary School was closed in 2006, Taglietti rallied with the community to see the building put to use.\n\nTaglietti designed the Australian War Memorial Annex in Mitchell in 1977. (Supplied: Taglietti Family Archive)\n\n\"He was excited that they had managed to come up with a different use for that school, which is a community hub as well as a childcare centre. So ... very much things should change if they need to,\" Ms Taglietti said.\n\nCanberra has evolved since Taglietti first cast his eyes on the capital, but his focus on community lives on in his designs.\n\nTaglietti designed the Dickson Library in 1968. (ABC News: Matt Roberts)\n\nThe curators hope that the exhibition will allow visitors to see Canberra in Taglietti's vision.\n\n\"Canberra is often diminished within the national conversation as a place just where politics happens,\" Dr Micheli said.\n\n\"But actually, it's a living community. They [Enrico and Franca] could have chosen anywhere in the world to be and they chose here.\"\n\nA model showing one of Taglietti's designs on show at the Canberra Museum and Gallery. (ABC News: Luke Stephenson)\n\nFor Tanja Taglietti, the exhibition brings together family memories and has transformed the gallery space into a semblance of her childhood.\n\n\"It's magical. It's tranquil. It reflects the handmade, the human touch, I think,\" she said.\n\n\" I could live in this space. \"\n\nThe exhibition is open until February 22, 2026.",
    "source": "ABC",
    "cluster_id": 11
  },
  {
    "url": "https://www.abc.net.au/news/2025-06-09/impulse-dinosaur-purchase-becomes-milang-mascot/105369906",
    "title": "How an impulse purchase gone wrong became town's unofficial mascot",
    "publish_date": "Sun, 08 Jun 2025 21:27:21 +0000",
    "category": "finance",
    "authors": [],
    "text": "When asked why she bought a dinosaur for her front paddock, Brittany Vogelsang usually replies: \"Why not? It's a rare opportunity to be able to say I own a dinosaur\".\n\nMilano, the saltasaurus, is now an eye-catching sight for people passing her property as they come down Nine Mile Road into the small historic lakeside town of Milang.\n\nMs Vogelsang, who has lived in the town for 25 years, is hoping that Milano's presence will attract a few more day trippers to the town of 800, located just over an hour south-east of Adelaide.\n\nMs Vogelsang says she wants Milano to make people smile. (ABC South East SA: Caroline Horn)\n\nOnce a thriving paddle-steamer town on the banks of Lake Alexandrina, Milang attracted national attention when former prime minister Kevin Rudd visited during the Millennium Drought, and the area is again experiencing dry times.\n\nHowever, Ms Vogelsang hopes Milano will bring a smile to residents and visitors as they drive past, toot their horns or stop to take a selfie.\n\nThe unofficial town mascot ended up there, next to the neighbour's bemused miniature ponies, by pure chance after an impulsive purchase by one of Ms Vogelsang's friends went a bit wrong.\n\n\"He swears he was sober,\" she said.\n\nHer friend had paid $1,500 for Milano during an online auction, intending him to become an eccentric garden ornament on his property in Deniliquin in country New South Wales.\n\nMs Vogelsang's daughter Emma says the decision to buy Milano was \"the best ever\". (ABC South East SA: Caroline Horn)\n\nUnfortunately, for Ms Vogelsang's friend, the reality of relocating an 8-metre long, 3m-high animatronic saltasaurus dinosaur from the auction house to rural NSW within two days of purchase proved too difficult and too costly.\n\n\"He threw his hands in the air and said, 'I give up,'\" Ms Vogelsang said.\n\n\"When he said, 'Do you want to buy him?' I said, 'Absolutely'.\"\n\nMs Vogelsang paid $200 for Milano and said once the decision had been made, things steamrolled from there.\n\nWith a borrowed car trailer and the head detached for the journey, Milano made his way down the South Eastern Freeway and through the nearest large town of Strathalbyn.\n\nMilang was once a working, busy port for paddle-steamers but is now a small farming and tourism hub. (ABC South East SA: Caroline Horn)\n\n\"It was like, 'I'll just stick him in my front yard and that way everyone who can come by gets to enjoy him as well',\" Ms Vogelsang said.\n\nThe community, after many doing double takes on an initial drive past, has embraced the dinosaur with requests rolling in for him to be dressed up for Christmas, Halloween and football finals.\n\nMs Vogelsang's co-worker at the town bakery, Kerri Woodgate, said Milano had already attracted visitors from surrounding towns in the three weeks since he arrived.\n\n\"It's been really, really positive for the town,\" she said.\n\n\"Kids love it.\"\n\nMs Vogelsang's daughter Emma agreed.\n\n\"Best idea ever,\" she said.",
    "source": "ABC",
    "cluster_id": 12
  },
  {
    "url": "https://www.abc.net.au/news/2025-06-09/woman-unable-to-undergo-ivf-in-wa-became-reproductive-refugee/105378634",
    "title": "Woman left a 'reproductive refugee' after being denied her choice",
    "publish_date": "Sun, 08 Jun 2025 21:09:35 +0000",
    "category": "lifestyle",
    "authors": [],
    "text": "As a professional woman in her 30s who was not yet sure if she wanted to have children, Jane* decided to freeze her eggs to give her future self the choice.\n\nFour years later, she decided the time was right.\n\nBut when Jane went back to the fertility clinic, she was told she could not use her frozen eggs for in-vitro fertilisation (IVF), the most common type of assisted reproductive technology.\n\nWhy? Because she was a single woman who did not have reproductive health problems. And because she lived in Western Australia.\n\nWA's IVF limits for single women\n\nWhile every state and territory in Australia has its own laws concerning IVF, WA is the only one that still rules out an unpartnered woman from accessing the procedure unless a doctor deems her to have reproductive problems (along with other restrictions against same-sex couples).\n\n\"To my shock and surprise … I was not eligible to access my own eggs and use them for the final stages of IVF and that's because I was not classified as 'sub-fertile',\" Jane told the ABC's Life Matters program.\n\nAs a single woman in WA who did not have reproductive health problems, Jane was denied her IVF choice. (ABC News: Briana Shepherd)\n\n\"I think part of the hurt, disappointment and frustration is that it's the 21st century.\n\n\"In other parts of Australia women who are not partnered are able to access IVF, and yet in WA, because I chose to do it unpartnered, I was pretty much being discriminated against.\"\n\nWA laws allow IVF for women who can't conceive due to medical reasons but explicitly exclude age as a valid reason.\n\nLoading...\n\n\"The only option within WA that was offered to me was to undergo several rounds of intra-uterine insemination … which would still cost thousands of dollars per round and has a relatively low success rate,\" Jane said.\n\nIntra-uterine insemination is when sperm are inserted directly into the uterus, so in that scenario Jane — who was now in her late 30's — would not be using her frozen eggs which were four years younger — equating to healthier and likely more fertile.\n\nJane was forced to consider an alternative path to parenthood due to WA's laws. (ABC News: Briana Shepherd)\n\nShe was told the success rate of that procedure at her age at the time was 10 to 15 per cent per round, compared to an estimated success rate with IVF of 40 per cent.\n\nForced to travel interstate\n\nJane searched for other options and found one — sending her eggs, and herself, to another state to undergo IVF.\n\n\"That in itself was a challenge because the clinic in WA indicated they would only transfer my eggs to another fertility clinic interstate that was part of the same chain of clinics, so I was limited in my choice,' she said.\n\nJane says being forced to go interstate made \"a challenging situation even more difficult\". (ABC News: Briana Shepherd)\n\nShe was lucky and found a clinic, and a fertility specialist, willing to assist her on the east coast.\n\nBut the experience of travelling to an unfamiliar place without her support network to undergo the procedure made her feel like a \"reproductive refugee\".\n\n\"When you're going through something as life-changing as IVF, it makes a challenging situation even more difficult,\" she said.\n\n\" I found myself sitting in that room waiting for the fertility specialist to transfer the embryo into my body, and I was on my own. \"\n\nIt was also expensive.\n\nDealing with IVF debt when you're childless Photo shows couple hugging and looking out window Any debt linked to fertility treatment can be a painful reminder for childless people that life didn't go as they planned. And it's often not just financial debt they are left with, either.\n\n\"I would estimate the costs of the egg freezing plus having to go interstate to undergo IVF would be in excess of $20,000,\" Jane said.\n\n\"And there was no guarantee it would work.\"\n\nTold to keep it 'very quiet'\n\nJane said what made the whole process \"rather harrowing\" was that the clinic in WA told her to keep the transfer of her eggs interstate, and the procedure, \"very quiet\".\n\nStephen Page, one of the nation's leading fertility lawyers and secretary of the Fertility Society of Australia, said nothing Jane or the clinic did was illegal.\n\n\"Number one, Jane is the owner. Number two, under the constitution you have freedom of interstate trade, commerce and intercourse,\" he said.\n\n\"And number three, in Western Australia there are restrictions about moving donor eggs, donor sperm and donor embryos, you need permission of the Reproductive Technology Council — but these eggs, her eggs, were not donor eggs, so she had full freedom to move them,\" he said.\n\nSurrogacy lawyer Stephen Page has long called for WA's legislation to be updated. (ABC News: Rhiannon Shine)\n\n\"But the Western Australian legislation is quite clear, that if you act outside your licensing conditions then the clinic can lose its WA licence [and] the clinician can commit an offence.\"\n\nMr Page, along with many other experts and individuals, has long been calling for the legislation in WA to be updated — and while the state government said it had done much work on this, no changes have yet been made.\n\nLegislation left languishing\n\nIn January 2018, the then newly-elected Labor government announced an independent review of WA's assisted reproductive technology (ART) and surrogacy legislation.\n\nThe report, by associate professor Sonia Allan, found the laws discriminatory on the grounds of sex and relationship status, leading to the government to introduce the Human Reproductive Technology and Surrogacy Legislation Amendment Bill 2018.\n\nProposed changes to WA's assisted reproductive technology laws have stalled. (Supplied: Adobe)\n\nWA Premier Roger Cook was health minister in 2019 when the bill failed to pass the upper house after Liberal MP Nick Goiran gave one of the longest filibuster speeches in the state parliament's history, succeeding in delaying a vote on the laws.\n\nThe bill then languished in parliament as attention turned to voluntary euthanasia before the COVID pandemic came along and up-ended most plans.\n\nThe WA government admits the current laws have prevented people from creating a family and forced others to go interstate. (ABC News: Luke Bowden)\n\nIn 2021, WA Labor won a historic victory, giving the party total control of both houses — yet even in those four years nothing was done.\n\nAnd despite Labor's strong result in the March 2025 election, the upper house now includes five crossbench MPs who could wield some influence, and Mr Goiran is also still in the chamber.\n\nBut the government insists the legislation is important.\n\nThe struggle of IVF when you're neurodivergent Photo shows Liz Bancroft in a hospital bed with her partner Perth woman Liz Bancroft found IVF difficult for many of the reasons you'd expect. But a diagnosis after becoming a mother shed further light on why she found infertility treatment so tough.\n\n\"Reviews have highlighted that the current laws have prevented people from fulfilling their desires to create a family and also resulted in Western Australians having to travel interstate and overseas to access ART services,\" a government spokesperson responded to questions from the ABC.\n\nThey insist new legislation is in development.\n\n\"The bill will support more WA families and individuals to be able to access IVF and surrogacy to start or expand their families in line with other Australian jurisdictions.\"\n\nWhen asked at a media conference in the hours after this story was published, Premier Roger Cook said it was his \"intention\" to introduce the legislation to parliament this year.\n\nPremier Roger Cook was asked about the state's IVF laws at a Monday press conference. (ABC News: Keane Bourke)\n\n\"It's complex legislation, we're working on it at the moment. We are looking to introduce it as soon as we can,\" he said.\n\nJane's hope for future daughter\n\nJane's journey with IVF has been successful. She is now 30 weeks pregnant and due to have a girl.\n\nJane is eagerly awaiting the arrival of her daughter. (ABC News: Briana Shepherd)\n\n\"It's really important to me that she grows up and she has bodily autonomy and reproductive freedom,\" Jane said, overcome by emotion when talking about her daughter's future.\n\n\"Access to assisted reproduction should be open to solo parents by choice, gay singles and couples, widows, women who have survived domestic violence and still want to have kids but outside a partnership.\n\n\"I urge the WA government to really make updating these laws a priority.\n\n\" People can't afford to wait years, even months, that could be the difference between them becoming parents or not. \"\n\n*We have changed Jane's name to protect her identity, at her request.",
    "source": "ABC",
    "cluster_id": 13
  },
  {
    "url": "https://www.abc.net.au/news/2025-06-09/snakes-spiders-issues-confronting-flood-residents-returning/105379498",
    "title": "Flooded-out family discovers more than 30 snakes upon return",
    "publish_date": "Sun, 08 Jun 2025 21:03:28 +0000",
    "category": "finance",
    "authors": [],
    "text": "Mud and mould are not the only issues facing those returning to their homes after major flooding on the New South Wales Mid North Coast.\n\nClybucca resident Julie Botfield was evacuated by boat with two of her children and their dogs during the height of the flooding in late May.\n\nShe said she was shocked by what she discovered at the rural property when she returned to inspect it a week and a half later.\n\n\"The snakes and spiders were an issue in me getting back in there,\" Ms Botfield said.\n\n\"There were 30 snakes down in the shed alone … I wasn't expecting that many.\n\n\" It was really scary, my heart was racing the entire time, and it made the clean up so much harder as I didn't want to be bitten by a snake. \"\n\nJulie Botfield and her daughter Tamia are glad to be back on dry ground. (ABC Mid North Coast: Emma Siossian)\n\nMs Botfield, a single mother, was assisted by Brenden Kendall, who lives near Kempsey and helps people needing snakes relocated.\n\n\"I saw a few baby snakes up and down the driveway just walking up to the property, some were still hiding in the shed,\" Mr Kendall said.\n\nBrenden Kendall says he removed 30 snakes from Ms Botfield's property. (Supplied: Brenden Kendall)\n\n\"Once we got up to the shed, we ended up with a total of 30 snakes caught.\n\n\" There was a mixture of red-bellied black snakes, brown snakes … a whole mix of different ones … I've never seen that many like that. \"\n\nMs Botfield, who rents the property, said she also had it treated for pests as the walls were covered in spiders.\n\n\"My house is a cream colour and when we evacuated it was brown on all sides, with the spiders covering the walls,\" she said.\n\n\"I had a pest man come [after the flood] … he said it was the worst property he has ever treated.\"\n\nSpiders covered the walls of Ms Botfield's home at Clybucca as the floodwater rose. (Supplied: Julie Botfield)\n\nNSW Reconstruction Authority Recovery coordinator Dave Owens said it was not uncommon for animals to take refuge in uninhabited properties after floods.\n\n\"The animals are looking for somewhere safe and obviously residents are vacated,\" he said.\n\n\"So, when people go back in, it's not just the floodwater and mud on the ground, it's snakes, it's spiders, it's other creatures, so you need to be careful.\"\n\nA fox finds refuge on top of a tractor at Clybucca during the May floods. (Supplied: Kurt Latham)\n\nDealing with mould\n\nMs Botfield said the time it took before she was able to return and access the property meant that mould had also spread.\n\n\"The house was sitting in the water for quite some time, so now the mould has gone through the house, so it's just a big clean-up effort,\" she said.\n\n\"The storms and rain keep coming.\"\n\nMs Botfield and two of her children evacuated their home on a friend's boat during the floods. (Supplied: Julie Botfield)\n\nMr Owens said mould was a significant issue after a flood, and airing out impacted homes as soon as possible was vital.\n\n\"Open all doors and windows to let in fresh air and sunlight … reduce humidity by limiting humidifiers, indoor plants and unflued gas heaters,\" Mr Owens said.\n\n\"To clean mould off surfaces, use detergent or diluted vinegar, four parts vinegar to one part water.\n\n\"For stubborn mould, you can use a diluted bleach solution but never mix vinegar and bleach.\"\n\nMs Botfield's shed after the floods. (Supplied: Julie Botfield)\n\nA household cleaning expert has also recommended oil of cloves for cleaning mould.\n\nNorth Coast Public Health Unit's environmental health officer David Basso said mould spores could cause health problems for people who were sensitive or allergic to them.\n\n\"If you are cleaning mould, wear protective clothing, rubber gloves and a mask, and ensure that you are trying to get as much ventilation as possible through your home,\" he said.\n\n\"The health effects from mould exposure can be a runny or blocked nose, irritation of the eyes and skin and difficulty breathing, particularly [in] people with asthma.\"\n\nHe said removing mould would be more challenging during winter.\n\n\"When we have adverse weather, it's difficult to maintain that proper airflow through your home,\" he said.\n\nResidents yet to go home\n\nMr Owens said about 700 residential properties across the region were still deemed uninhabitable and the focus was on getting displaced families back home.\n\n\"It could be as simple as they've had water over the floor, and we need to get a sparkie [electrician] in to check it's safe and then they can move back in,\" he said.\n\nDealing with mould after a flood Photo shows Mould stained window As floodwaters recede in parts of North Queensland, many people face the challenge of removing mould from their homes.\n\n\"We have about 150 households in emergency accommodation.\n\n\"A lot of people have gone to family and friends, couch surfing is a term that's been used.\"\n\nMs Botfield is currently staying with family and said she was prepared for a long road ahead.\n\n\"I've had Disaster Relief Australia out to help and they have been great … they even found another two snakes,\" she said.\n\n\"I want to show my kids we are strong and resilient, we've got this.\"",
    "source": "ABC",
    "cluster_id": 14
  },
  {
    "url": "https://www.abc.net.au/news/2025-06-09/coffee-prices-increase-further-supply-issues-trump-tariffs/105335840",
    "title": "Coffee prices up to $12 needed to make industry viable, supplier says",
    "publish_date": "Sun, 08 Jun 2025 20:34:13 +0000",
    "category": "finance",
    "authors": [],
    "text": "The cost of your daily flat white is set to increase further as the coffee market grapples with a perfect blend of falling supply, surging demand and stubborn inflation.\n\nBut there is more at stake than a morning caffeine buzz.\n\nThere are 27,000 cafes and coffee shops in Australia, employing 139,000 people and representing a $14 billion market, according to a January 2025 IBISWorld report.\n\nIn 2024, international brand Lavazza warned that its costs jumped by $1.3 billion, while disasters stripped coffee bean crops worldwide.\n\nCombine that with the rising costs of rent, energy and wages, and there are predictions a barista-brewed coffee will rise to $10, well above the current $5.50 average.\n\nBut 2025 brought another slew of challenges for coffee roasters, with one large-scale supplier warning that cafes must \"bite the bullet\" and up their prices.\n\n'A really wild ride'\n\nRachel-May Follan runs Whyld Coffee, a small-scale roaster on the Gold Coast which supplies 11 cafes with specialty beans imported from South America and Africa.\n\nShe described the past 12 months as \"a really wild ride\", especially after US President Donald Trump's tariffs announcement \"ignited panic buying\" among some roasters.\n\nRachel-May Follan says a lot of work goes into the daily coffee. (ABC Gold Coast: Dominic Cansdale)\n\n\"It's kind of like toilet paper in COVID-19,\" Ms Follan said.\n\n\"It doesn't necessarily need to be that way, but it is.\"\n\nIn 2024, Ms Follan paid about $4 a kilogram for organic green coffee beans, which have jumped to $14 a kilogram.\n\n\"You don't realise how much work goes into that daily coffee,\" she said.\n\nPablo & Rusty's Coffee Roasters 2024 research shows the breakdown of costs for a small takeaway flat white. (ABC News: Lindsay Dunbar)\n\n\"Thousands of hands have gone into back-breaking work for it. These are hand-picked cherries from a tree that are then pulped, that are then dried in the sun for 30 days, rotated by hand.\"\n\nHowever, Ms Follan said the coffee itself only accounted for about 13 per cent of the cost per cup.\n\nHer cafe makes about a gross $1 profit off each cup sold — and that is before deducting the cost of rent, wages, packaging and milk.\n\n\"The outcome should look like cafes increasing their prices, we're talking 50 cents, but that depends on [the type of] coffee,\" she said.\n\nHome-brewed prices increasing\n\nCoffee lovers who choose to brew at home are also seeing prices skyrocket.\n\nA closer look at supermarket specials Photo shows Smiths chips, Cadbury favourites and Chobani yogurt against a chart that moves up and down. The ABC analysed the online prices of nearly 44,000 products at Coles and Woolworths, revealing a sales technique used on thousands of items.\n\nThe supermarket price of coffee has risen sharply over the past six months.\n\nAustralia's two major supermarket chains, Coles and Woolworths, both said external pressures were driving record-high coffee prices.\n\n\"We are doing what we can to help customers find value when they shop with us,\" a Coles spokesperson said in a statement.\n\nA Woolworths spokesperson said retail price hikes were directly linked to supplier and manufacturer increases.\n\n\"The industry is managing higher commodity prices of green coffee beans, and we are working with our suppliers to ensure we have a range of products in these categories to suit all budgets,\" they said.\n\nBusiness costs booming\n\nOne of the country's largest specialty roasters, Essential Coffee, sells about 180 tonnes of coffee a year to customers in Australia, New Zealand and Singapore, retailing at about $35 to $55 per kilogram.\n\nChief executive Todd Hiscock said his business's labour costs had increased 9 per cent, rent 29 per cent and insurance 6 per cent over the past two years.\n\nOn top of that, the wholesale cost of coffee has increased by 119 per cent since November 2023.\n\nTodd Hiscock says there have been disruptions to global coffee supply. (ABC Gold Coast: Dominic Cansdale)\n\n\"[The] Chinese have very much converted from tea to coffee,\" he said.\n\n\"They're buying up unprecedented levels of coffee supplies, often they're taking a whole Brazilian stock load in ways that's never been seen before.\"\n\nMr Hiscock said on top of increasing global demand, \"climate-driven weather events\" had disrupted supply.\n\n\"You're seeing crops just get wiped out by massive frosts and storms and cyclone events, bushfires too,\" he said.\n\n\"Also the removal of crops with more urbanisation.\"\n\nThe growing popularity of alternative milks, which can cost up to double cow's milk, also adds to price pressures.\n\nPlant-based milk costs 20 to 100 per cent more than cow's milk. (ABC Gold Coast: Dominic Cansdale)\n\n\"For a barista quality one as a wholesaler, we're paying as much as $4, even more than $4 a litre,\" Mr Hiscock said.\n\nHe said Australia's median coffee prices needed to increase to between $8 to $12 per cup, similar to what North Americans paid, or risk losing the supply of coffee to bigger, more lucrative markets.\n\n\"We've got to come to the party and pay in a competitive global market,\" he said.\n\n\"It's hard because people are very sensitive to their beloved coffee and when you move the price up, you find not just a lot of negative reaction, you find some very terse expletives.\"\n\nCafes about more than coffee\n\nMs Follan said predictions of $10 flat whites may be pre-emptive but not impossible.\n\nThe rising cost of coffee beans is driving cafes to increase prices. (ABC Gold Coast: Dominic Cansdale)\n\n\"We're not saying that it needs to reach, crazy, crazy numbers,\" she said.\n\n\"I do think it should be around the $6 to $7.\"\n\nBut she said a \"cafe is a lot more than just a cup of coffee\".\n\n\"You could be going in because you like the playlist or you like the ambience, it's an experience as well,\" she said.",
    "source": "ABC",
    "cluster_id": 15
  },
  {
    "url": "https://www.abc.net.au/news/rural/2025-06-09/victoria-in-drought-differences-farmer-mental-health-dairy-sheep/105379394",
    "title": "Victoria is in the grip of drought, but what's different about this one?",
    "publish_date": "Sun, 08 Jun 2025 20:21:19 +0000",
    "category": "finance",
    "authors": [],
    "text": "The record-breaking drought crippling South Australia, Victoria and parts of New South Wales and Tasmania feels different to those farmers have endured before.\n\nFor many farming families, the slow creep of failed seasons, sold-out hay and rising costs continues to cascade into a deeper crisis day by day.\n\nIt will stay that way until there's decent rain and the ground is warm enough to grow feed — which could take weeks, if not months.\n\nThe Victorian Country Hour has been touring the state's drought-affected regions and it's clear to me that Australian farmers are changing the way they deal with extreme pressure.\n\nAngus Verley and Warwick Long at Elise Kealy's farm in Charam in western Victoria. (Supplied: Angela Kealy)\n\nMental health top of mind\n\nTim Healy is a tough-looking stock agent with an eye for a good animal.\n\nSpeaking from a bone-dry corner of the south-west of the state, his voice broke as he stressed the importance of mental health.\n\n\"We should be asking people, 'Are they OK?'\" he said.\n\n\" The mental strain and the mental pressure they're going through is horrendous. \"\n\nTim Healy says talking about mental health during the drought is important. (ABC Rural: Jane McNaughton)\n\nEverywhere we travelled in regional Victoria, mental health was mentioned as a top priority.\n\nA dairy farmer told me that almost every vet, salesperson, farm consultant or friend who came to his farm was asking how he was going and if he was OK.\n\nThis feels like a change. He thinks so, too.\n\nMick and Jane Fitzgibbon started the Let's Talk Foundation after the loss of 16 people in their community to suicide, including their son Sam.\n\n\"Seventy-five per cent of farmers do not reach out,\" Ms Fitzgibbon said.\n\nSo what can they do to share the load?\n\n\"Just ringing up and chatting to your neighbour or go and visit your neighbour, and learn the skills about looking after your health,\" Mr Fitzgibbon said.\n\nFarmers see the Aurora Australis during a gathering to support each other. (Supplied: Let's Talk Australia)\n\nLater that night, 25 farmers did just that, coming together on a south-west Victorian farm to support each other.\n\nThere is more to do, but mental health is a bigger part of dealing with this drought than I have ever seen before.\n\nModern farmers doing things better\n\nFor more than a century, drought coverage in Australia was filled with images of dead and dying farm animals on cracked, dry paddocks.\n\nThis time, the barren paddocks are there but the animals are better fed.\n\nThere's no feed growing, but farmers are ensuring their animals are fed. (ABC Rural: Warwick Long)\n\nModern farmers know what their livestock need.\n\nThey use feed tests to work out energy and protein levels and they travel long distances to get the supplies they need.\n\n\"I feel blessed to be in this situation we're in with so much more knowledge,\" Edenhope farmer Wayne Caldow said.\n\nHe remembered his first drought.\n\n\"We never had the knowledge of what a sheep required, especially a twin-lambing ewe,\" he said.\n\nWayne Caldow says he has more knowledge of how to deal with drought now. (ABC Rural: Warwick Long)\n\nNaringal dairy farmer Renata Cumming lived in northern Victoria during the Millennium Drought.\n\n\"What I saw with dairy farms up there [was] the ones that bounced back were the ones that carried stock through and didn't cull drastically,\" she said.\n\nFarming is a constant quest for improvement and, while previous generations did the best they could, it is clear knowledge and technology are helping inform better decision-making.\n\nBut knowledge comes at a price and keeping animals alive has become costly for those farming through the drought.\n\nRenata Cumming and Matt Grant use hay and cotton feed for their cows. (ABC Rural: Jane McNaughton)\n\nPrepared for climate change\n\nSouth-west Victoria has some of the most expensive farmland in Australia, in part because it has reliable rainfall and can adapt to climate change.\n\nRenata Cumming says she will keep learning how to best farm in drought. (ABC Rural: Jane McNaughton)\n\nDairy farmer Matt Grant said he felt prepared for this drought — the worst in recent memory.\n\nHe stockpiled 18 months of hay and 12 months of grain to get by.\n\n\"Early on we recognised we needed to be organised to get through,\" he said.\n\nThat supply is almost exhausted, forcing him to buy alternative options such as cotton and almond feed.\n\nFarmers are trucking in feed for their animals. (ABC Rural: Jane McNaughton)\n\nMany of the farmers in this area thought they were better prepared for climate change, but they're learning they might not have done enough.\n\nSo, like generations before them, they'll need to keep learning and improving.\n\nIf you look hard enough, you will find examples contrary to what I have seen on my trip.\n\nBut what is clear is that the farmers I have met during this terrible drought are adapting to the challenges they're facing.",
    "source": "ABC",
    "cluster_id": 16
  },
  {
    "url": "https://www.abc.net.au/news/2025-06-09/sa-researchers-expand-newborn-heel-prick-test/105377072",
    "title": "Up to 1,000 families to take part in newborn heel-prick screening research",
    "publish_date": "Sun, 08 Jun 2025 20:05:56 +0000",
    "category": "lifestyle",
    "authors": [],
    "text": "When Max was three days old, he was diagnosed with a rare and life-changing condition called phenylketonuria, commonly known as PKU, through a newborn blood screening test.\n\nThe condition is one of more than 30 which can currently be detected in newborns through heel-prick blood samples to help identify and treat serious health conditions early.\n\nNow, researchers in South Australia are working to expand the screening program to detect more than 600 genetic conditions.\n\nResearchers are currently looking to expand the testing to look for more than 600 conditions. (ABC News: Olivia Mason)\n\nPKU is an inherited blood disorder which can affect how the body processes protein and can eventually lead to serious health problems if left untreated.\n\n\"[It's] actually the condition that started the whole newborn screening program in the 1960s,\" explained South Australian researcher Professor Karin Kassahn.\n\n\"It's one of the metabolic conditions where the body can't process protein, phenylalanine in particular [which is] a certain amino acid, in the way it usually would … so by picking this up at birth, then the diet can be modified.\"\n\nThe newborn screening program sees a few drops of blood from a heel-prick collected onto a screening card (fake blood pictured for illustrative purposes). (ABC News: Olivia Mason)\n\nThe heel-prick test method was developed by American microbiologist, Dr Robert Guthrie, whose niece was diagnosed with PKU at 13 months — too late to prevent early brain damage.\n\n\"He was really frustrated that these children would develop intellectual disability and other complications, when we know it's due to this accumulation of these metabolites and he wanted to do something about this,\" Professor Kassahn said.\n\nSince 1960, the program has been rolled out across much of the world as a routine test for newborns — and expanded to be able to accurately and quickly detect more than 30 conditions.\n\nMax's parents say he should be able to live a relatively normal life despite his rare condition. (ABC News: Olivia Mason)\n\nMax's diagnosis\n\nTwins, Max and Blake, underwent the screening as newborns.\n\nTheir parents, Hannah and Robert Macbeth, had no idea PKU existed when Max was first diagnosed.\n\n\"We'd never heard of it,\" Ms Macbeth said.\n\n\"We kind of cried about it until it kind of realistically hit us and we went, 'You know what, we can manage this. We've caught it early'.\"\n\nMr Macbeth said he was worried his son would have to follow a restricted diet for life.\n\n\"We're quite a barbecuing family so we love our meats and that sort of thing and entertaining,\" he said.\n\n\" But after it sunk in and as time went on it's been quite easy to manage … he can still have a little bit of steak here and there. \"\n\nThanks to early detection and intervention, Max's protein levels are closely monitored with weekly at-home prick tests, and he uses a medication to help lower his blood phenylalanine levels.\n\n\"We're very lucky,\" Ms Macbeth said.\n\nThe twins' mum says she is glad the boys have each other and hopes they will be able to get through challenges \"together\". (Supplied: Hannah Macbeth)\n\n\"We could have been in all sorts of dramas for him because it can be pretty serious if left undiagnosed.\"\n\nUntreated, PKU can lead to irreversible brain damage and intellectual disability, neurological conditions such as seizures and tremors, and problems with behaviour, emotions, development and health.\n\nBut for now, things are looking positive.\n\n\"He'll live a relatively normal life, he might just be a bit different with food at school and stuff,\" Ms Macbeth said.\n\n\"It's just managing it and it's quite easy at the moment … he's a happy little soul,\" Mr Macbeth added.\n\nThe couple said they thought expanding the testing program would be \"brilliant\".\n\n\"If we can do testing that picks up these things when they're little and there are things we can put in place to help reduce [the risk of] something happening in the long run or causing a bigger issue, then we would be mad not to do it,\" Ms Macbeth said.\n\nStudy successful so far\n\nProfessor Kassahn is the principal investigator on the NewbornsInSA study which is combining genomics and metabolomics in a bid to detect more treatable conditions, earlier.\n\nProfessor Karin Kassahn is the lead researcher for NewbornsInSA and SA Pathology's Head of Technology Advancement Unit. (ABC News: Olivia Mason)\n\n\"Many of the conditions we screen for are rare, so individually people will probably not have heard of many of them — cystic fibrosis and PKU are probably the more familiar ones, but collectively they actually constitute quite a significant health burden,\" she said.\n\n\"They are the primary cause of childhood admissions to hospital and also ongoing health problems.\n\n\"Early detection allows early intervention and treatment, and just as the current program has really saved thousands of lives, we're hoping by expanding on that program … we can make a difference to the health outcomes for these babies.\"\n\nThe researchers are looking for conditions including immune deficiencies, conditions of metabolic dysregulation, congenital deafness, and neurological conditions.\n\n\"These things can be life-changing,\" she said.\n\nProfessor Kassahn said the study collaboration between SA Pathology, the Women's and Children's Hospital and the University of Adelaide was \"well underway\" with 250 families already enrolled, out of their target of 1,000.\n\nThe team has issued five \"high chance\" reports so far, helping families manage rare conditions which might otherwise not have been detected until much later. (ABC News: Olivia Mason)\n\nThe team has already made some significant findings — with early intervention now in place for those families to help treat or manage their rare diagnoses.\n\n\"We've issued five of what we call a 'high chance report' and those would have otherwise been undetected,\" she explained.\n\n\"Those families are being managed through the clinical teams at the Women's and Children's Hospital.\"\n\nShe said eligible families are still able to take part in the study with enrolment via the NewbornsInSA website.",
    "source": "ABC",
    "cluster_id": 17
  },
  {
    "url": "https://www.smh.com.au/business/the-economy/trump-v-musk-is-the-final-battle-before-a-catastrophe-20250609-p5m5tw.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Trump v Musk is the final battle before a catastrophe",
    "publish_date": "Mon, 09 Jun 2025 12:12:00 +1000",
    "category": "finance",
    "authors": [
      "Jeremy Warner"
    ],
    "text": "In any case, against total federal spending last year of nearly $US7 trillion, it is but a drop in the ocean, and only goes to show how difficult it is to find serious savings in government administration, even when given a free hand with the headcount. The rampant corruption and incompetence that Musk’s Department of Government Efficiency expected to find in the Washington and wider government machine has turned out to be largely an illusion, and many of the cuts he has managed to make seem to have done more harm than good. This is not to argue that it’s not worth trying, or that you cannot make public services more efficient. But it takes time, substantial upfront investment, and the savings are generally not as big as anticipated. Slowly but surely – and at varying speeds – major economies around the world are going bust. Credit: Bloomberg To nobody’s great surprise, it transpires that the skills needed to run a successful business do not transfer easily to the public sector, where the disciplines of the bottom line, the profit motive and competitive markets don’t exist.\n\nLoading The shame of it is that the Musk who built Tesla and SpaceX into two of the world’s most successful companies over a period of nearly two decades has been almost entirely absent while at DOGE these past four or five months. Instead, we have seen a reckless, chainsaw-wielding – and if the American press is to be believed, drug-fuelled – Musk who, like his one-time boss Donald Trump, seems to regard government more as performative art than public service. We can all point to myriad examples of public sector waste, of unfathomable spending decisions and stultifying, jobsworth bureaucracy, but the imagined savings from addressing these things nearly always turn out to be a mirage. In Britain, Nigel Farage’s Reform UK claims there is £7 billion to be saved by scrapping public sector spending on diversity, equity and inclusion (DEI) programs. Sadly, no such saving exists.\n\nRecent government figures showed just £27 million ($56 million) was spent by the civil service on DEI measures during 2022-23. This might well be £27m too much, but it is not going to solve Britain’s debt crisis. The two big cash-burners in advanced economies’ state spending are public sector salaries and welfare, and both desperately need to be addressed if Western democracies are ever to extract themselves from now mountainous debt. Musk has comprehensively failed on the first of these missions, and not surprisingly so. The sort of productivity-improving automation and digitalisation we see widely applied in the private sector to stay competitive is a marathon, not a sprint, and it requires precision in planning and execution. None of these characteristics was on display from the tech bros sent in to tackle the bloated size of the American state. Their approach was one of slash and burn rather than the slow, methodical re-engineering of government needed to achieve sustainable savings and productivity improvement.\n\nWhat’s more, Trump shows little or no appetite for meaningful entitlement reform. OK, some attempt is being made to trim spiralling Medicaid spending, but it’s half-hearted and is really only there as a gesture to appease fiscal hawks among House Republicans. Nobody can tell you exactly when the storm will break, but Musk’s failure brings the final reckoning that much closer. The bottom line is that Trump is as much a creature of fantasy economics as any. He wants both low taxes and high spending, and expects economic growth to make up the difference. It’s the same delusion as Liz Truss, only very much more dangerous in its seeming rejection of fiscal orthodoxies.\n\nUnlike Britain, America is the beating heart of the global financial system, and if US debt markets go belly-up they’ll take everyone else down with them. Back here in Britain, Rachel Reeves, the Chancellor, shows similarly little sign of getting to grips with the leviathan of public spending as she puts the finishing touches to next Wednesday’s spending review. Public sector salary costs are rising, not falling, and while ministers talk the talk on welfare reform, their approach to the issue is no more convincing than that of Trump. It’s just a little tinkering around the edges. Simply getting working-age benefits back to their pre-pandemic level would save £49 billion a year – more than enough to avoid tax rises and fund the desired increase in defence spending to 3 per cent of GDP, Jeremy Hunt, Reeves’ Conservative predecessor as chancellor, points out. Spending on disability benefits alone has surged from £37 billion just before the pandemic to £56 billion now, much more than in any comparable economy, with the bulk of the growth coming from mental health conditions.\n\nLoading Yet Reeves used up almost all her political capital axing the winter fuel allowance to all but the poorest pensioners, a course of action that saves only £1.5 billion a year. This has left her with virtually no space for more serious entitlement reform. In both the US and Britain, cutting state spending back to size is simply not happening on the scale needed to stem the rising tide of debt. Attempts by Musk to draw a line in the sand have ended in acrimony and recrimination. Nobody can tell you exactly when the storm will break, but Musk’s failure brings the final reckoning that much closer. Telegraph, London",
    "source": "SMH",
    "cluster_id": 18
  },
  {
    "url": "https://www.smh.com.au/lifestyle/health-and-wellness/how-working-long-hours-may-be-changing-your-brain-20250514-p5lz6t.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "How working long hours may be changing your brain",
    "publish_date": "Mon, 09 Jun 2025 12:00:00 +1000",
    "category": "lifestyle",
    "authors": [
      "Michael Searles"
    ],
    "text": "Working for 52 hours or more a week changes the structure of the brain, research suggests.\n\nScientists have found that specific regions of the brain are altered in “overworked” people who regularly pull long working weeks.\n\nThe biggest impact is seen in parts of the brain responsible for problem-solving and memory, as well as emotional regulation.\n\nA new study suggests that consistently working a longer week affects critical thinking and emotional responses. Credit: Getty\n\nWhile the impact of “burnout” and overwork on people’s behaviour and mental health is widely recognised, researchers wanted to find out whether there were underlying neurological causes at play.",
    "source": "SMH",
    "cluster_id": 19
  },
  {
    "url": "https://www.smh.com.au/property/news/multi-generational-family-buys-1-55m-frankston-home-in-fast-paced-auction-20250608-p5m5s5.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Multi-generational family buys $1.55m Frankston home in fast-paced auction",
    "publish_date": "Mon, 09 Jun 2025 12:00:00 +1000",
    "category": "finance",
    "authors": [
      "Shona Hendley"
    ],
    "text": "A multi-generational family outbid two others at auction to buy a double-storey cottage for $1.553 million in Frankston on Saturday.\n\nThe property at 71 Heatherhill Road had a price range of $1.275 million to $1.4 million and a reserve price of $1.3 million.\n\nDespite the long weekend, rainy weather and cold temperatures, 50 people watched as three registered bidders battled it out in what listing agent Emma Sauvage from Barry Plant Frankston described as a “fast-paced auction with a great atmosphere”.\n\n“I was pencilling the bids and it was hard to keep up,” she said.",
    "source": "SMH",
    "cluster_id": 20
  },
  {
    "url": "https://www.smh.com.au/property/news/first-home-buyer-secures-4-23-million-strathfield-home-with-dad-s-help-20250609-p5m5uj.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "First home buyer secures $4.23 million Strathfield home with dad’s help",
    "publish_date": "Mon, 09 Jun 2025 12:00:00 +1000",
    "category": "finance",
    "authors": [
      "Carmen Forward"
    ],
    "text": "A first home buyer bid up to $4.1 million on a modern five-bedroom house in Strathfield at auction on Saturday.\n\nThe buyer bowed out at this point and returned the card to the agent, but then his father grabbed the card and continued to bid until the home at 15 Amaroo Avenue was secured for an additional $135,000 for $4,235,000.\n\nTwo out of four registered bidders competed before a small crowd of 40 for the family home on the fringe of Strathfield.\n\nBidding opened at its guide of $3.7 million, the next bid was a superstitious $3,988,800, which took it $88,800 above its $3.9 million reserve.",
    "source": "SMH",
    "cluster_id": 21
  },
  {
    "url": "https://www.smh.com.au/world/chaos-in-los-angeles-as-troops-fire-tear-gas-and-rubber-bullets-20250609-p5m5yn.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Chaos in Los Angeles as troops fire tear gas and rubber bullets",
    "publish_date": "Mon, 09 Jun 2025 11:53:21 +1000",
    "category": "finance",
    "authors": [],
    "text": "Chaos in Los Angeles as troops fire tear gas and rubber bullets\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 22
  },
  {
    "url": "https://www.smh.com.au/property/news/buyers-aren-t-mucking-around-cottage-sets-price-record-at-lightning-fast-auction-20250609-p5m5y5.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "‘Buyers aren’t mucking around’: Cottage sets price record at lightning-fast auction",
    "publish_date": "Mon, 09 Jun 2025 11:51:04 +1000",
    "category": "finance",
    "authors": [
      "Sarah Webb"
    ],
    "text": "A pint-sized postwar home in Greenslopes has set a price record after seven young buyers vied in a lightning-fast auction hailed as one of the fiercest since the pandemic.\n\nThe cottage, at 94 Dunellan Street, sold for $1.39 million after just four minutes of bidding, which is the highest price ever paid for a three-bedroom home on a 405-square-metre block in the suburb.\n\nA young couple, upgrading from their first home, outmuscled a first home buyer to nab the keys, with plans to knock down the cottage and build a new house.\n\nTen registered bidders fronted up early on Saturday, following a whirlwind 17-day campaign that drew 79 groups, said selling agent Ben Smith, of Place Estate Agents.",
    "source": "SMH",
    "cluster_id": 23
  },
  {
    "url": "https://www.smh.com.au/world/gaza-activist-yacht-boarded-by-the-israeli-navy-20250609-p5m5yg.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Gaza activist yacht boarded by the Israeli Navy",
    "publish_date": "Mon, 09 Jun 2025 11:31:53 +1000",
    "category": "finance",
    "authors": [],
    "text": "Gaza activist yacht boarded by the Israeli Navy\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 24
  },
  {
    "url": "https://www.smh.com.au/sport/usyk-delivers-massive-blows-20240519-p5jer8.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Usyk delivers massive blows",
    "publish_date": "Mon, 09 Jun 2025 11:25:41 +1000",
    "category": "finance",
    "authors": [],
    "text": "Usyk delivers massive blows\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 25
  },
  {
    "url": "https://www.smh.com.au/sport/motorsport/are-you-serious-young-gun-fumes-over-late-race-crash-20250609-p5m5xt.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "'Are you serious!?': Young gun fumes over late-race crash",
    "publish_date": "Mon, 09 Jun 2025 11:01:14 +1000",
    "category": "finance",
    "authors": [],
    "text": "'Are you serious!?': Young gun fumes over late-race crash\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 26
  },
  {
    "url": "https://www.smh.com.au/lifestyle/30-kmart-helmet-awarded-a-five-star-safety-rating-20250609-p5m5xr.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "$30 Kmart helmet awarded a five-star safety rating",
    "publish_date": "Mon, 09 Jun 2025 10:51:10 +1000",
    "category": "lifestyle",
    "authors": [],
    "text": "$30 Kmart helmet awarded a five-star safety rating\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 27
  },
  {
    "url": "https://www.smh.com.au/sport/nrl/daly-cherry-evans-dumped-bolters-emerge-for-maroons-in-origin-ii-20250609-p5m5wa.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "‘He took the news with great character’: Slater explains Cherry-Evans bombshell",
    "publish_date": "Mon, 09 Jun 2025 10:47:21 +1000",
    "category": "sports",
    "authors": [
      "Nick Wright"
    ],
    "text": "Daly Cherry-Evans’ illustrious State of Origin career appears to be over, after Queensland Maroons coach Billy Slater dropped the axe on his incumbent captain.\n\nThe 36-year-old Cherry-Evans, who has overseen three series triumphs and managed 26 caps for his state, has been replaced by Cowboys co-captain Tom Dearden in the No.7 jumper.\n\nCalls have grown since Queensland suffered an 18-6 game one defeat for Cherry-Evans to vacate the jersey, with his side scoring just once in their past two matches – courtesy of a Blues error.\n\n“You won’t hear a negative word from me about Daly Cherry-Evans,” Slater said. “What he’s given this jersey and what he’s done for this footy team, that will be with all Queenslanders and with Daly for the rest of his life.",
    "source": "SMH",
    "cluster_id": 28
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/from-musicians-to-disability-advocates-the-australians-recognised-in-the-kings-honours-list/z25kd2u94",
    "title": "From musicians to disability advocates: the Australians recognised in the King's Honours List",
    "publish_date": "Sun, 8 Jun 2025 21:00:00 +0000",
    "category": "entertainment",
    "authors": [],
    "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts .\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\n(Sounds of Indian carnatic music)\n\n\n\n\n\nBack to the music you heard a little earlier.\n\n\n\n\n\nThat's carnatic music, which might not be so well known in Australia but has a long history in Southern India.\n\n\n\n\n\nIt's a classical style that dates back hundreds of years and is different to the style of music heard in North India.\n\n\n\n\n\nTwo brothers in Melbourne have been doing their bit to keep the tradition alive in Australia and they've both been recognised on this year's honours list for their efforts.\n\n\n\n\n\n\"From childhood, we have done everything together, not just the music, but studies and same subjects in school and in university. So we now was also another passion that both of us had. So we continued learning and practicing together and performing together for all these years.\"\n\n\n\n\n\nThat's Gopinath Iyer.\n\n\n\n\n\nHe and his twin brother Ramnath Iyer are orginally from Chenai in India and now call Melbourne home.\n\n\n\n\n\nThe twins each play a traditional plucked string instrument from Southern India known as the Saraswati Veena.\n\n\n\n\n\nIn a world where classical music, art and literature compete for attention with 30 second social media videos, the brothers say they feel privileged to receive so much support from people in Australia.\n\n\n\n\n\nRamnath Iyer explains.\n\n\n\n\n\n\"The Indian community in Australia, especially the South Indian community and the Tamal community from Sri Lanka, there's a real connection with the carnatic music because most of them have heard, or they grew up listening to that music and they continue the tradition even here. So the children who are born here also listen to that music. So there is a spiritual connection as well as you identify yourself and your roots with the music.\"\n\n\n\n\n\nMillie Ingram has seen a lot of change in her 84 years.\n\n\n\n\n\n\"The changes are happening and I'm so proud of all the young Aboriginal people that are coming up. Years ago you saw very few people, our mob, anywhere in jobs. We had to fight to have back in the 1960s and 70s for them to recogniSe, to start Aboriginal opportunities. And so a lot of young people took advantage of that and didn't come easy. We had to fight for it. A lot of people, a lot of Aboriginal people were fighting for those opportunities.\"\n\n\n\n\n\nThe Wiradjuri Elder also known as Aunty Millie has been recognised as a Member of the Order of Australia (AM) in the General Division for her significant service to the Indigenous community of New South Wales.\n\n\n\n\n\nOriginally from Cowra, Aunty Millie grew up on Erambie Mission before moving to Redfern during the 1950s to find work.\n\n\n\n\n\nAlong with her family, she set up the first Aboriginal Community Controlled early childhood centre and later the Wyanga Aboriginal Aged Care program.\n\n\n\n\n\nThen there was a 13 year stint at the Department of Aboriginal Affairs advocating for empowerment and change in areas such as education and land rights.\n\n\n\n\n\nShe says she's grateful to receive the honour this year.\n\n\n\n\n\n\"Last year I was recognised as Elder of the Year for Naidoc and that's by my Aboriginal peers, so that was exciting too. So I'll like accept the award because people are happy to give me an award. I'm happy to take it and I'll take it in good grace.\"\n\n\n\n\n\nProfessor Christine Bigby has received the Officer of the Order of Australia (AO) in the General Division for her work improving the lives of people with disability.\n\n\n\n\n\nShe is the Director of the Living with Disability Research Centre at La Trobe University in Melbourne.\n\n\n\n\n\nProfessor Bigby has a long history of working in partnership with disability support and advocacy organisations to better the lives of people with intellectual disabilities.\n\n\n\n\n\nSince starting in the sector in the early 80s she says a lot has changed.\n\n\n\n\n\n\"The biggest change has been that we've now, in Australia, we've closed all the large institutions that used to house people with intellectual disabilities, and there's many more now, community services for people. People moved out of institutions into small group homes. We built small group homes. And obviously since 2013, there's been the National Disability Insurance Scheme that has opened up more options for people with intellectual disabilities to live in more individualised settings or to make group homes smaller and to support their social inclusion more broadly. So there's been much more investment and attention to people with disabilities over the last 10, 12 years.\"\n\n\n\n\n\nShe says one of the biggest challenges facing people with an intellectual disability is a shortage of skilled workers to assist people to live their best lives.\n\n\n\n\n\n\"So I think we need to introduce some really clear standards for what we expect of disability support workers who are working with people with intellectual disabilities, and we need to introduce some mandatory training and qualifications for this group of people. There are no standard qualifications for support workers. There's no mandatory training at all, and many people come in off the street from other sorts of work and really are ill-equipped to do that work and organisations don't have the capacity to train to a high standard.\n\n\n\n\n\n\"If we're serious about supporting social inclusion and engagement of people with intellectual disabilities, then they need really skilled support to do that. And in places like the Netherlands, people do have three year training in social pedagogy to support people with intellectual disabilities to be included in society. It's a really complex skill set of tasks for people.\"\n\n\n\n\n\nThere are 378 male and 202 female recipients in this years Honours list.\n\n\n\n\n\nThe youngest recipient is 19 years old and the eldest living recipient is 101 years old.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 29
  },
  {
    "url": "https://www.sbs.com.au/news/article/the-inside-story-of-sbs-australias-most-diverse-broadcaster/sfmfz3wnw",
    "title": "SBS turns 50: The inside story of Australia's most diverse broadcaster",
    "publish_date": "Sun, 8 Jun 2025 19:49:46 +0000",
    "category": "sports",
    "authors": [],
    "text": "It all started in the year 1975. Two radio stations, then known as 2EA in Sydney and 3EA in Melbourne, went to air for the first time.\n\n\n\n\n\nBroadcasting began in seven languages on 2EA and eight languages on 3EA, with the first ever broadcast in Greek.\n\n\n\n\n\n\"SBS has been a constant companion of multiculturalism in Australia,\" SBS Managing Director James Taylor said.\n\n\n\n\n\n\"It was born of an idea of the Whitlam government and implemented by the Fraser government in 1975, and at the time Fraser spoke of multiculturalism being not an act of passivity, but an act of active engagement.\n\n\n\n\n\n\"I think SBS ... actively embraces the idea of multiculturalism, helps all Australians — whether you're members of the oldest continuous culture on Earth or some of the newest Australians — really feel part of this extraordinary story of difference and collegiality and compassion for one another.”\n\n\n\nSBS began in 1975 as two ethnic radio stations: 2EA in Sydney and 3EA in Melbourne. Source: SBS News Domenico Gentile has been a journalist with the Italian program since 1977.\n\n\n\n\n\n\"We had 15 minutes for news, and then the other 30 minutes were designed to inform the community,\" Gentile recalls.\n\n\n\n\n\n\"We were lucky because all of the prime ministers had been our guests, the ministers for immigration were regularly our guests, the premiers, the Ethnic Affairs Commission and so on.\"\n\n\n\nDomenico Gentile from SBS Italian Credit: SBS. Gentile sums up the impact of SBS in one word: \"Immense\".\n\n\n\n\n\n\"We brought together ethnic communities because we didn't create a division with them, but we united them because that was what we had to do — cohesion,\" he said.\n\n\n\n\n\n\"We had to make sure that the experiment that was started on 9 June 1975 was going to be successful because we needed this radio station, this broadcasting station.\"\n\n\n\nDomenico Gentile collecting sound effects for a special program produced in collaboration with Italian broadcaster, RAI. Credit: Supplied. Bringing audiences a slice of home, SBS has long been the champion of football.\n\n\n\n\n\n\"If you would've gone on air without mentioning football, you would've had a riot outside the station,\" Gentile said.\n\n\n\n\n\n\"I can guarantee you that football has been our lucky charm.\"\n\n\n\nJohnny Warren and Les Murray were iconic figures in Australian football and on SBS. Source: SBS News\n\n'A sense of belonging'\n\nJoe Axiaq started with the Maltese program in the late 1980s.\n\n\n\n\n\n\"To switch on the radio and all of a sudden you hear your language, and you hear your music, oh, that was out of this world,\" he said.\n\n\n\n\n\n\"The [Maltese] community had been here for a while ... from the late 1970s until now, the number of people that actually arrived in Australia were not huge numbers. They arrived in the 1950s and 1960s after World War Two.\n\n\n\n\n\n\"You had this community which was established here in Australia, and all of a sudden they realised, 'I'm not the only Maltese in Australia', there are hundreds, there are thousands .... they started going to these events and they started meeting each other, so [SBS Radio] was a big influence on the Maltese community.\"\n\n\n\nJoe Axiaq from SBS Maltese arrived in Australia in the late 1970s. Credit: SBS. He says this connection to the community and between community members formed a strong attachment to the program for many.\n\n\n\n\n\n\"There is this sense of belonging. This is 'our' radio station, this is 'our' program.\"\n\n\n\nJoe Axiaq broadcasting on Melbourne's 3EA. Credit: SBS.\n\nThe introduction of television\n\nSBS television launched in 1980. Today, SBS is a multi-platform media organisation with a free-to-air service spanning six channels: SBS, NITV, SBS Viceland, SBS Food, SBS World Movies and SBS World Watch — as well as its digital offerings on SBS On Demand.\n\n\n\n\"We are Australia's most trusted news service. This is a really important foundation for public broadcasting,\" Taylor said.\n\n\n\n\n\n\"We've got a really strong focus on being impartial, on sharing a pluralistic set of views with audiences — not telling them what to think, but giving them information so that they can make their own informed choices.\n\n\n\n\n\n\"We are the podcaster of the year, three years in a row.”\n\n\n\nLISTEN TO 50 years of SBS: More than simply sexy movies and soccer SBS News 01/06/2025 16:18 Play\n\nSBS has been telling First Nations stories all along — whether on radio or television, in news and current affairs.\n\n\n\n\n\nNITV joined SBS in 2012, with its first broadcast from Uluru.\n\n\n\n\n\n\"Indigenous stories, it’s just so important that we tell them, and this for the first time opened the door to be able to bring broader Australia along the journey with us,\" said Natalie Ahmat, NITV Presenter and SBS's Head of Indigenous News and Current Affairs.\n\n\n\n\n\n\"Particularly multicultural and new Australians are hungry for these stories and really want to learn more about the First Peoples of the country that they've come to call home.\"\n\n\n\nNITV presenter Natalie Ahmat at the Garma Festival. 50 years on, SBS Audio broadcasts in more than 60 languages, chosen on a needs-basis, informed by the census.\n\n\n\n\n\nOne of the new additions, SBS Malay, was created in 2023.\n\n\n\n\n\n\"In the past 10 years, there has been an influx of younger semi-skilled and non-skilled Malaysian migrants coming to Australia to seek a better life,\" SBS Malay's Zaini Ahmad said.\n\n\n\n\n\n\"They get exploited and they have very little or no English and they really need SBS Malay to navigate their way through their new homeland.\"\n\n\n\nZaini Ahmad from SBS Malay. Credit: SBS In 2025, SBS holds a unique place in the Australian media landscape.\n\n\n\n\n\n\"Next year, in the middle of the year, we get to bring the world's largest sporting event to Australians, again, which is the FIFA Men's World Cup — over 100 matches exclusively on SBS through SBS television and On Demand,\" Taylor said.\n\n\n\n\n\n\"And over the next year, we're working on a business case to government to create a production presence and talent incubator in Western Sydney.\n\n\n\n\n\n\"It's a really great opportunity for us to move to the next stage of this project to deliver a production presence, to allow us to make thousands of hours more content and to engage with young content creators in this incredibly vibrant part of Australia.\"\n\n\n\n\n\nAs Australia’s most diverse broadcaster, SBS aims to inspire all Australians to explore, respect and celebrate our diverse world and in doing so, promote an inclusive and cohesive society.\n\n\n\n\n\nThere are exciting plans to bring even more distinct SBS content and storytelling to your screens and devices, at home or on the go.\n\n\n\n\n\nYour stories have shaped SBS for half a century. Together, we're just getting started. Join us as we celebrate 50 years of belonging on our SBS50 portal and SBS50 content hub .\n\n\n\n",
    "source": "SBS",
    "cluster_id": 30
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/coming-together-without-division-healing-and-reconciliation-after-the-myall-creek-massacre/etcissqro",
    "title": "'Coming together without division': Healing and reconciliation after the Myall Creek Massacre",
    "publish_date": "Sun, 8 Jun 2025 06:56:40 +0000",
    "category": "finance",
    "authors": [],
    "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
    "source": "SBS",
    "cluster_id": 31
  },
  {
    "url": "https://www.sbs.com.au/news/article/what-trouble-in-australias-dairy-industry-could-mean-for-milk-prices/h1j5ly7ju",
    "title": "Australian dairy is in 'a world of pain' — and you might feel it at the checkout",
    "publish_date": "Sun, 8 Jun 2025 01:16:21 +0000",
    "category": "finance",
    "authors": [],
    "text": "Australian dairy farmers have faced increasingly difficult conditions in recent years, and it could mean mounting prices for consumers.\n\n\n\n\n\nConsumer groups have warned prices for milk products are expected to rise in the near future due to product shortages.\n\n\n\n\n\nBut dairy farmers say it might not be enough to save the struggling industry.\n\n\n\nWhy is Australia's dairy industry facing challenges?\n\nAustralian dairy is a $13 billion industry spanning farming, manufacturing and exports, with a farmgate value of $4 billion alone, according to the industry's peak body Dairy Australia.\n\n\n\n\n\nMany dairy farms are in Australia south and south-east. After a hot, dry summer, NSW has faced heavy rain and floods, while Victoria, Tasmania and South Australia have been experiencing drought.\n\n\n\n\n\nIn May, brothers Kevin and Doug Schlenert had their dairy production facilities and 70 per cent of their herd destroyed in floods on the NSW mid-north coast.\n\n\n\nThe brothers said they didn't know whether they would be able to recover.\n\n\n\n\n\n\"I've got no dairy now to keep going. I don't know which way to turn at the current moment,\" Kevin said, speaking with SBS News in the aftermath of the floods.\n\n\n\n\n\n\"I don't know if I can bounce back from this. I really don't know.\"\n\n\n\nAccording to Dairy Australia's 2025 mid-year Situation and Outlook report, wet weather in the north and dry conditions in the south, in addition to tightened farm margins, have weighed on milk production across several dairying regions\n\n\n\n\n\nThe report found a decline in farmer confidence in the future, with only half of respondents in the National Dairy Farmer Survey expressing positive views about the industry's future, compared to two-thirds the previous year.\n\n\n\n\n\nDairy Australia said less than two-thirds of businesses are expecting to make an operating profit, and more than half are anticipating profits will be lower than the previous five-year average.\n\n\n\nBen Bennett, president of the non-profit Australian Dairy Farmers, is concerned about the industry's future. Source: Supplied / Australian Dairy Farmers Ben Bennett, a dairy farmer in south-west Victoria and president of Australian Dairy Farmers, which represents dairy farmers across Australia, said he is extremely concerned about the future of the dairy industry.\n\n\n\n\n\nHe said the combination of rising operating costs and weather challenges has put many farmers in an impossible situation.\n\n\n\n\n\n\"We're in, quite frankly, a world of pain,\" he said.\n\n\n\n\n\n\"And it's going to get a lot worse too as we enter winter.\"\n\n\n\nREAD MORE Meet the Australian farmers Donald Trump has a beef with\n\nBennett said Australian dairy production has decreased by 25 per cent over the past two decades, while dairy imports from overseas have increased.\n\n\n\n\n\nHe believes Australian dairy production will continue to suffer without government assistance and environmental policies designed to support farmers.\n\n\n\n\n\n\"It would be better for a lot of policies to adhere and listen to local people in that area to maximise environmental opportunity and betterment as opposed to ... people who are somewhat removed from that kind of on-the-ground position,\" he said.\n\n\n\n\n\nDairy companies recently announced their farmgate milk prices for the new financial year — that is, the price paid to farmers per kilogram of milk solids in the raw milk, which is later processed into products.\n\n\n\n\n\nPrices range between $8.60 to $9.20 a kilo, up slightly on last year, but a number of industry groups said farmers were hoping for more.\n\n\n\nAre dairy prices increasing in Australia?\n\nYou may have noticed dairy products are becoming more expensive.\n\n\n\n\n\nMichael Harvey, senior analyst at Rabobank, which focuses on agribusiness, said there was inflation \"across the dairy aisle\" in 2023 and 2024.\n\n\n\n\n\n\"What consumers would realise is they're paying a lot more for their dairy products from the supermarket than they were two years ago ... milk, butter, cheese, yoghurt, anything you can track,\" he said.\n\n\n\n\n\n\"We are at the tail end of a significant price spike for dairy products at a retail level.\"\n\n\n\n\n\nAt the peak of the cycle, Harvey said prices increased by 25 per cent for milk and cheese.\n\n\n\nREAD MORE Are supermarkets being unfairly targeted for price gouging?\n\nDairy Australia's report said despite an increase in milk prices, high operating costs will continue to limit profitability for farmers, especially if weather conditions don't improve.\n\n\n\n\n\nHarvey said while consumers might be hit with some price increases in the coming months, he does not expect them to be as steep as those recorded in recent years.\n\n\n\n\n\n\"That was very unique — it was record-high commodity pricing, it was record-high farm debt pricing, and that's what underpinned the need for companies to pass through high costs to consumers.\n\n\n\n\n\n\"It can be a little bit complex, but ultimately it's about the global price of milk that will ultimately set the direction of pricing for dairy products and farm gate milk price.\"\n\n\n\nIn the aftermath of the NSW floods, Eric Danzi, CEO of EastAusmilk, an industry body representing dairy farmers on the Australian eastern seaboard, warned the destruction could have an impact on supermarket shelves.\n\n\n\n\n\n\"There's certainly going to be a real shortage of milk and products — how that plays through to consumers I don't know,\" he told Sydney radio station 2GB recently.\n\n\n\n\n\n\"Between the massive floods in NSW now, previous [ex-tropical] Cyclone Alfred, and the drought in Victoria and South Australia, you're going to have a massive reduction in milk production across Australia.\"\n\n\n\n\n\nHarvey said while the current conditions are devastating for farmers, he does not expect them to lead to significant price increases in the short term.\n\n\n\n\n\n\"It’s not what’s going to drive the farmgate price higher or commodity prices higher, it’s more global fundamentals that matter,\" he said.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 32
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/interview-stolen-generations-survivor-tony-hansen-on-what-it-means-to-finally-have-a-redress-scheme-in-wa/yqj38i4ns",
    "title": "INTERVIEW: Stolen Generations survivor Tony Hansen on what it means to finally have a redress scheme in WA",
    "publish_date": "Sat, 7 Jun 2025 22:30:00 +0000",
    "category": "finance",
    "authors": [],
    "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nA proud Wilman and Noongar man, Tony Hansen was removed from his family when he was just three years old, and placed at Marribank Baptist Mission, almost 300 kilometres south of Perth.\n\n\n\n\n\nHe says it means a lot to him to see a state redress scheme announced for survivors of the forcible child removal policies that began in the early 1900s and lasted into the 1970s.\n\n\n\n\n\nIt comes 28 years after the landmark Bringing Them Home report called for such a measure.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 33
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/50-years-of-sbs-the-milestone-moments-as-told-by-the-journalists-and-presenters/z8uaq9m50",
    "title": "50 years of SBS - the milestone moments as told by the journalists and presenters",
    "publish_date": "Sat, 7 Jun 2025 21:30:00 +0000",
    "category": "sports",
    "authors": [],
    "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nProduced in collaboration with SBS Italian, Maltese and Malay.\n\n\n\n\n\nFormer immigration minister Al Grassby tasked Radio Ethnic Australia with the mission to explain Medibank, the first version of Medicare, to migrants in different languages.\n\n\n\n\n\nAs Australia’s most diverse broadcaster, the Special Broadcasting Service aims to inspire all Australians to explore, respect and celebrate our diverse world and in doing so, promote an inclusive and cohesive society.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\n(Sound of shows on 2EA and 3EA)\n\n\n\n\n\nIt's the year 1975 and two radio stations, then known as 2EA in Sydney and 3EA in Melbourne, went to air for the first time.\n\n\n\n\n\nDomenico Gentile has been a journalist with the Italian programme since 1977.\n\n\n\n\n\n\"All of the prime ministers had been our guests, the ministers for immigrations, where regularly our guests, the premiers, the Ethnic Affairs Commission and so on.\"\n\n\n\n\n\nHe sums up the impact of SBS in one word.\n\n\n\n\n\n\"Immense. Immense. Because we brought together ethnic communities because we didn't create a division with them, but we united them because that was what we had to do. Cohesion.\"\n\n\n\n\n\nJoe Axiaq started with the Maltese program in the late 1980s.\n\n\n\n\n\n\"To switch on the radio and all of a sudden you hear your language, and you hear your music, oh that was out of this world.\"\n\n\n\n\n\nBringing audiences a slice of home, SBS has also long been the champion of football.\n\n\n\n\n\nGentile explains:\n\n\n\n\n\n\"If you would've gone on air without mentioning football, you would've had a riot outside the station. I can guarantee you that. Football has been our lucky charm.\"\n\n\n\n\n\nSBS television launched in 1980. Today, SBS is a multi-platform media organisation with a free-to-air service spanning six channels - as well as its digital offering on SBS On Demand.\n\n\n\n\n\nThis is SBS Managing Director, James Taylor.\n\n\n\n\n\n\"We are Australia's most trusted news service. This is a really important foundation for public broadcasting. We are the podcaster of the year, three years in a row.\"\n\n\n\n\n\nSBS has been telling First Nations stories all along - whether on radio or television in news and current affairs.\n\n\n\n\n\nNITV joined SBS in 2012 - it's first broadcast from Uluru.\n\n\n\n\n\nThis is NITV Presenter and SBS's head of Indigenous News and Current Affairs, Natalie Ahmat.\n\n\n\n\n\n\"Indigenous stories are just so important that we tell them. And this for the first time opened the door to be able to bring broader Australia along the journey with us, particularly multicultural and new Australians who are hungry for these stories and really want to learn more about the First Peoples of the country that they've come to call home.\"\n\n\n\n\n\n50 years on, SBS Audio broadcasts in more than 60 languages, chosen on a needs-basis, which is informed by the census.\n\n\n\n\n\nOne of the new additions, SBS Malay, was introduced in 2023. This is SBS Malay's Zaini Ahmad.\n\n\n\n\n\n\"In the past ten years, there has been an influx of younger semi-skilled and non-skilled Malaysian migrants. They really need SBS Malay to navigate their way through their new homeland.\"\n\n\n\n\n\nIn 2025, SBS holds a unique place in the Australian media landscape.\n\n\n\n\n\nThis is Axiaq again.\n\n\n\n\n\n\"There is this sense of belonging. This is sort of our radio station. This is our program.\"\n\n\n\n\n\nAnd looking to the future, James Taylor indicates a few exciting plans on the horizon.\n\n\n\n\n\n\"Next year, middle of the year, we get to bring the world's largest sporting event to Australians, again, which is the FIFA Men's World Cup. And over the next year we're working on a business case to government to create a production presence and talent incubator in Western Sydney.\"\n\n\n\n",
    "source": "SBS",
    "cluster_id": 30
  },
  {
    "url": "https://www.theage.com.au/business/the-economy/trump-v-musk-is-the-final-battle-before-a-catastrophe-20250609-p5m5tw.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Trump v Musk is the final battle before a catastrophe",
    "publish_date": "Mon, 09 Jun 2025 12:12:00 +1000",
    "category": "finance",
    "authors": [
      "Jeremy Warner"
    ],
    "text": "In any case, against total federal spending last year of nearly $US7 trillion, it is but a drop in the ocean, and only goes to show how difficult it is to find serious savings in government administration, even when given a free hand with the headcount. The rampant corruption and incompetence that Musk’s Department of Government Efficiency expected to find in the Washington and wider government machine has turned out to be largely an illusion, and many of the cuts he has managed to make seem to have done more harm than good. This is not to argue that it’s not worth trying, or that you cannot make public services more efficient. But it takes time, substantial upfront investment, and the savings are generally not as big as anticipated. Slowly but surely – and at varying speeds – major economies around the world are going bust. Credit: Bloomberg To nobody’s great surprise, it transpires that the skills needed to run a successful business do not transfer easily to the public sector, where the disciplines of the bottom line, the profit motive and competitive markets don’t exist.\n\nLoading The shame of it is that the Musk who built Tesla and SpaceX into two of the world’s most successful companies over a period of nearly two decades has been almost entirely absent while at DOGE these past four or five months. Instead, we have seen a reckless, chainsaw-wielding – and if the American press is to be believed, drug-fuelled – Musk who, like his one-time boss Donald Trump, seems to regard government more as performative art than public service. We can all point to myriad examples of public sector waste, of unfathomable spending decisions and stultifying, jobsworth bureaucracy, but the imagined savings from addressing these things nearly always turn out to be a mirage. In Britain, Nigel Farage’s Reform UK claims there is £7 billion to be saved by scrapping public sector spending on diversity, equity and inclusion (DEI) programs. Sadly, no such saving exists.\n\nRecent government figures showed just £27 million ($56 million) was spent by the civil service on DEI measures during 2022-23. This might well be £27m too much, but it is not going to solve Britain’s debt crisis. The two big cash-burners in advanced economies’ state spending are public sector salaries and welfare, and both desperately need to be addressed if Western democracies are ever to extract themselves from now mountainous debt. Musk has comprehensively failed on the first of these missions, and not surprisingly so. The sort of productivity-improving automation and digitalisation we see widely applied in the private sector to stay competitive is a marathon, not a sprint, and it requires precision in planning and execution. None of these characteristics was on display from the tech bros sent in to tackle the bloated size of the American state. Their approach was one of slash and burn rather than the slow, methodical re-engineering of government needed to achieve sustainable savings and productivity improvement.\n\nWhat’s more, Trump shows little or no appetite for meaningful entitlement reform. OK, some attempt is being made to trim spiralling Medicaid spending, but it’s half-hearted and is really only there as a gesture to appease fiscal hawks among House Republicans. Nobody can tell you exactly when the storm will break, but Musk’s failure brings the final reckoning that much closer. The bottom line is that Trump is as much a creature of fantasy economics as any. He wants both low taxes and high spending, and expects economic growth to make up the difference. It’s the same delusion as Liz Truss, only very much more dangerous in its seeming rejection of fiscal orthodoxies.\n\nUnlike Britain, America is the beating heart of the global financial system, and if US debt markets go belly-up they’ll take everyone else down with them. Back here in Britain, Rachel Reeves, the Chancellor, shows similarly little sign of getting to grips with the leviathan of public spending as she puts the finishing touches to next Wednesday’s spending review. Public sector salary costs are rising, not falling, and while ministers talk the talk on welfare reform, their approach to the issue is no more convincing than that of Trump. It’s just a little tinkering around the edges. Simply getting working-age benefits back to their pre-pandemic level would save £49 billion a year – more than enough to avoid tax rises and fund the desired increase in defence spending to 3 per cent of GDP, Jeremy Hunt, Reeves’ Conservative predecessor as chancellor, points out. Spending on disability benefits alone has surged from £37 billion just before the pandemic to £56 billion now, much more than in any comparable economy, with the bulk of the growth coming from mental health conditions.\n\nLoading Yet Reeves used up almost all her political capital axing the winter fuel allowance to all but the poorest pensioners, a course of action that saves only £1.5 billion a year. This has left her with virtually no space for more serious entitlement reform. In both the US and Britain, cutting state spending back to size is simply not happening on the scale needed to stem the rising tide of debt. Attempts by Musk to draw a line in the sand have ended in acrimony and recrimination. Nobody can tell you exactly when the storm will break, but Musk’s failure brings the final reckoning that much closer. Telegraph, London",
    "source": "TheAge",
    "cluster_id": 18
  },
  {
    "url": "https://www.theage.com.au/lifestyle/health-and-wellness/how-working-long-hours-may-be-changing-your-brain-20250514-p5lz6t.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "How working long hours may be changing your brain",
    "publish_date": "Mon, 09 Jun 2025 12:00:00 +1000",
    "category": "lifestyle",
    "authors": [
      "Michael Searles"
    ],
    "text": "Working for 52 hours or more a week changes the structure of the brain, research suggests.\n\nScientists have found that specific regions of the brain are altered in “overworked” people who regularly pull long working weeks.\n\nThe biggest impact is seen in parts of the brain responsible for problem-solving and memory, as well as emotional regulation.\n\nA new study suggests that consistently working a longer week affects critical thinking and emotional responses. Credit: Getty\n\nWhile the impact of “burnout” and overwork on people’s behaviour and mental health is widely recognised, researchers wanted to find out whether there were underlying neurological causes at play.",
    "source": "TheAge",
    "cluster_id": 19
  },
  {
    "url": "https://www.theage.com.au/property/news/multi-generational-family-buys-1-55m-frankston-home-in-fast-paced-auction-20250608-p5m5s5.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Multi-generational family buys $1.55m Frankston home in fast-paced auction",
    "publish_date": "Mon, 09 Jun 2025 12:00:00 +1000",
    "category": "finance",
    "authors": [
      "Shona Hendley"
    ],
    "text": "A multi-generational family outbid two others at auction to buy a double-storey cottage for $1.553 million in Frankston on Saturday.\n\nThe property at 71 Heatherhill Road had a price range of $1.275 million to $1.4 million and a reserve price of $1.3 million.\n\nDespite the long weekend, rainy weather and cold temperatures, 50 people watched as three registered bidders battled it out in what listing agent Emma Sauvage from Barry Plant Frankston described as a “fast-paced auction with a great atmosphere”.\n\n“I was pencilling the bids and it was hard to keep up,” she said.",
    "source": "TheAge",
    "cluster_id": 20
  },
  {
    "url": "https://www.theage.com.au/property/news/first-home-buyer-secures-4-23-million-strathfield-home-with-dad-s-help-20250609-p5m5uj.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "First home buyer secures $4.23 million Strathfield home with dad’s help",
    "publish_date": "Mon, 09 Jun 2025 12:00:00 +1000",
    "category": "finance",
    "authors": [
      "Carmen Forward"
    ],
    "text": "A first home buyer bid up to $4.1 million on a modern five-bedroom house in Strathfield at auction on Saturday.\n\nThe buyer bowed out at this point and returned the card to the agent, but then his father grabbed the card and continued to bid until the home at 15 Amaroo Avenue was secured for an additional $135,000 for $4,235,000.\n\nTwo out of four registered bidders competed before a small crowd of 40 for the family home on the fringe of Strathfield.\n\nBidding opened at its guide of $3.7 million, the next bid was a superstitious $3,988,800, which took it $88,800 above its $3.9 million reserve.",
    "source": "TheAge",
    "cluster_id": 21
  },
  {
    "url": "https://www.theage.com.au/world/chaos-in-los-angeles-as-troops-fire-tear-gas-and-rubber-bullets-20250609-p5m5yn.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Chaos in Los Angeles as troops fire tear gas and rubber bullets",
    "publish_date": "Mon, 09 Jun 2025 11:53:21 +1000",
    "category": "finance",
    "authors": [],
    "text": "Chaos in Los Angeles as troops fire tear gas and rubber bullets\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 22
  },
  {
    "url": "https://www.theage.com.au/property/news/buyers-aren-t-mucking-around-cottage-sets-price-record-at-lightning-fast-auction-20250609-p5m5y5.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "‘Buyers aren’t mucking around’: Cottage sets price record at lightning-fast auction",
    "publish_date": "Mon, 09 Jun 2025 11:51:04 +1000",
    "category": "finance",
    "authors": [
      "Sarah Webb"
    ],
    "text": "A pint-sized postwar home in Greenslopes has set a price record after seven young buyers vied in a lightning-fast auction hailed as one of the fiercest since the pandemic.\n\nThe cottage, at 94 Dunellan Street, sold for $1.39 million after just four minutes of bidding, which is the highest price ever paid for a three-bedroom home on a 405-square-metre block in the suburb.\n\nA young couple, upgrading from their first home, outmuscled a first home buyer to nab the keys, with plans to knock down the cottage and build a new house.\n\nTen registered bidders fronted up early on Saturday, following a whirlwind 17-day campaign that drew 79 groups, said selling agent Ben Smith, of Place Estate Agents.",
    "source": "TheAge",
    "cluster_id": 23
  },
  {
    "url": "https://www.theage.com.au/world/gaza-activist-yacht-boarded-by-the-israeli-navy-20250609-p5m5yg.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Gaza activist yacht boarded by the Israeli Navy",
    "publish_date": "Mon, 09 Jun 2025 11:31:53 +1000",
    "category": "finance",
    "authors": [],
    "text": "Gaza activist yacht boarded by the Israeli Navy\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 24
  },
  {
    "url": "https://www.theage.com.au/sport/usyk-delivers-massive-blows-20240519-p5jer8.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Usyk delivers massive blows",
    "publish_date": "Mon, 09 Jun 2025 11:25:41 +1000",
    "category": "finance",
    "authors": [],
    "text": "Usyk delivers massive blows\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 25
  },
  {
    "url": "https://www.theage.com.au/sport/motorsport/are-you-serious-young-gun-fumes-over-late-race-crash-20250609-p5m5xt.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "'Are you serious!?': Young gun fumes over late-race crash",
    "publish_date": "Mon, 09 Jun 2025 11:01:14 +1000",
    "category": "finance",
    "authors": [],
    "text": "'Are you serious!?': Young gun fumes over late-race crash\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 26
  },
  {
    "url": "https://www.theage.com.au/lifestyle/30-kmart-helmet-awarded-a-five-star-safety-rating-20250609-p5m5xr.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "$30 Kmart helmet awarded a five-star safety rating",
    "publish_date": "Mon, 09 Jun 2025 10:51:10 +1000",
    "category": "lifestyle",
    "authors": [],
    "text": "$30 Kmart helmet awarded a five-star safety rating\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 27
  },
  {
    "url": "https://www.theage.com.au/sport/nrl/daly-cherry-evans-dumped-bolters-emerge-for-maroons-in-origin-ii-20250609-p5m5wa.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "‘He took the news with great character’: Slater explains Cherry-Evans bombshell",
    "publish_date": "Mon, 09 Jun 2025 10:47:21 +1000",
    "category": "sports",
    "authors": [
      "Nick Wright"
    ],
    "text": "Daly Cherry-Evans’ illustrious State of Origin career appears to be over, after Queensland Maroons coach Billy Slater dropped the axe on his incumbent captain.\n\nThe 36-year-old Cherry-Evans, who has overseen three series triumphs and managed 26 caps for his state, has been replaced by Cowboys co-captain Tom Dearden in the No.7 jumper.\n\nCalls have grown since Queensland suffered an 18-6 game one defeat for Cherry-Evans to vacate the jersey, with his side scoring just once in their past two matches – courtesy of a Blues error.\n\n“You won’t hear a negative word from me about Daly Cherry-Evans,” Slater said. “What he’s given this jersey and what he’s done for this footy team, that will be with all Queenslanders and with Daly for the rest of his life.",
    "source": "TheAge",
    "cluster_id": 28
  },
  {
    "url": "https://au.news.yahoo.com/caravan-owners-fight-to-save-their-homes-after-heartless-council-decision-055804607.html",
    "title": "Caravan owners fight to save their homes after 'heartless' council decision",
    "publish_date": "2025-06-08T05:58:04Z",
    "category": "finance",
    "authors": [],
    "text": "Some residents have been visiting the park since they were children and are devastated at the thought of being pushed out.\n\nFive generations of the Hackett family have holidayed at Wooli, and are devastated by council’s decision. Source: Clarence Valley Holiday Parks/Supplied\n\nFive generations of one family are grieving the end of a dearly-held tradition that has been in the family for decades. In just over three weeks, they will be expected to empty their caravans at Wooli Holiday Park and sign them over to the council, who will demolish them to make way for more tourist accommodation.\n\nJodie Hackett and her family are one of 136 holiday van owners across four parks in the NSW Northern Rivers region who were served a termination notice back in March. Clarence Valley Council informed the residents of Brooms Head, Iluka, Minnie Water and Wooli Holidays Parks that they had 110 days to vacate their site as their long-term agreements were being scrapped.\n\nAccording to council, demand from tourists has increased “significantly” in recent years, which prompted the move to end the agreements with the long term holders.\n\nThat deadline – June 30 – is fast approaching, with residents now taking legal action against the termination.\n\nADVERTISEMENT\n\nCurrently, each owner pays council $98 a week to have their van on the site. The cost of the vans themselves vary greatly, but can be upwards of $50,000. Residents have been told if they can’t take their homes with them, they can be signed over to council who will demolish them – but there will be no financial compensation.\n\nSome residents have been staying at the park for decades, and are distressed at the thought of losing their homes. Source: Tony Everingham\n\nFor Jodie, the park holds a deep significance. Her husband's grandparents were the first to purchase a caravan at Wooli, which sparked a long-held tradition that they still enjoy to this day with their own grandchildren.\n\n\"It has just been such a massive part of our lives. It unites all the generations together in the one meeting place,\" she told Yahoo News.\n\nLike other residents at the park, Jodie is seeking clarity from council, who she says have remained tight-lipped about any future plans.\n\nADVERTISEMENT\n\n\"In order to change the use of Crown land under native title, it must be done with the consultation of the Indigenous tribes of that area. They have failed to do that. There was no consultation with the Indigenous people of the Clarence Valley whatsoever. So that's the first law they broke. Second one is, before you can change the usage of Crown land, you must have a plan of management in place. They have none. Zero.\"\n\nShe added that having a plan and communication from council would make the decision \"easier to swallow\".\n\n'Increase in tourists' claim questioned\n\nJodie said that while she can only speak for Wooli, she finds it hard to believe the decision has been made to accommodate an influx of tourists.\n\n\"The vans at the parks are empty most of the time,\" she said. \"If it wasn't for the regulars that come there, there would be nobody in the park. Apart from the Christmas season and maybe one weekend through the year across Easter, that's it. The rest of the year, those towns, especially Wooli, are empty.\"\n\nADVERTISEMENT\n\nShe fears removing the regulars from the park will have a flow-on effect across the town, as the residents help to support the bowling club, local cafes and restaurants and the pub.\n\nFull-time residents will be 'thrown out on the streets'\n\nAlongside those who use the vans for holidays, a number of full-time residents are worried they’ll have nowhere else to go when their agreements expire.\n\nAs casual occupiers, residents are only allowed to use the site for 180 days per year, which means for the other six months they are vacant and cannot be used by anyone else.\n\nBut some owners have made full-time homes in their caravans, adding on permanent, council-approved fixtures like annexes, walls and roofs. It’s a common belief in the community that council are aware of the residents staying beyond their 180-day limit, but have “turned a blind eye” in the past.\n\nADVERTISEMENT\n\n“Now, all of a sudden, they’re getting thrown out on the streets,” Tony Everingham, another holiday site owner, told Yahoo News.\n\nClarence Valley Council cited an increase in tourists as one of the reasons for the decision, but residents say the park sits empty for most of the year. Source: Clarence Coast Holiday Parks\n\nTony has been holidaying at the caravan park for more than four decades, and it’s since become a central fixture for family get-togethers for his kids and grandchildren.\n\nHe’s formed The Clarence Valley Semi Permanent Van Group to unite owners from all four parks who want to fight council’s “heartless” decision.\n\nHe told Yahoo that residents are distressed from council’s “complete disregard for the people involved”.\n\n“We've had a lot of people suffering a lot of stress and a lot of mental anguish over the whole situation,” Tony said. “I’m concerned about the mental health and wellbeing of a lot of these people. They’re at their wits end.”\n\nPark residents have lodged close to 100 applications to NCAT (NSW Civil and Administrative Tribunal) as they’ve been left with “no other choice”, Tony said.\n\nWhile the deadline looms little more than three weeks away, he’s hoping the legal battle will buy more time for his community. In the meantime, they’re “in limbo”.\n\nWhat Tony and the other van owners are asking for:\n\nThat termination notices be withdrawn\n\nThat existing agreements remain in place until plans of management are implemented\n\nTo be involved in consultation with any compliance issues (like adhering to the 180 days per year rule)\n\nMore time for residents to plan their next move\n\nIf the fight is lost, Tony, Jodie and other caravan owners will have no choice but to sign their homes over to council to be demolished. Source: Clarence Coast Holiday Homes\n\nIf their appeal fails, Tony said he will have no choice but to dump his van, the site of four generations worth of memories. Like many older vans in the park, it can’t be towed or relocated due to age and modifications – many of which were required by council.\n\nHe said the “happy” community who come together every year at Christmas and New Years will be “taken away”.\n\n“And most of these people will never come back. I think it’ll be too distressing for them ever to return… I think it’ll just tear them apart and they’ll just want to try and walk away and somehow get over this experience.”\n\nAt a council meeting on Thursday, Deputy Mayor Greg Clancy fought for the residents, saying the time frame was simply unfair.\n\n“There’s been decades of non-compliance which has been overlooked, and suddenly it has to all be complying by the end of June. This is not a good decision,” he said.\n\nYahoo News has contacted Clarence Valley Council for comment.\n\nDo you have a story tip? Email: newsroomau@yahoonews.com.\n\nYou can also follow us on Facebook, Instagram, TikTok, Twitter and YouTube.",
    "source": "Yahoo",
    "cluster_id": 34
  },
  {
    "url": "https://au.news.yahoo.com/important-purpose-behind-markings-all-over-australian-footpaths-i-had-no-idea-042407402.html",
    "title": "Important purpose behind markings all over Australian footpaths: 'I had no idea'",
    "publish_date": "2025-06-08T04:24:07Z",
    "category": "finance",
    "authors": [],
    "text": "They're widely used in Australia, and help one section of the population in a very big way. But how many of us realise?\n\nBraille trails, seen here in Brisbane, are also known as tactile ground surface indicators (TGSIs), and they serve a very important purpose. Source: Wikimedia Commons\n\nWhether it's on city streets, in shopping precincts or train stations, millions around the country walk beside them every day. But how many of us actually know what the trails of bumps and bars on the ground are really for?\n\nThe City of Brisbane Council issued an important reminder recently, prompting many residents to reveal they had no idea. The council explained that, like in many densely populated cities, the raised markings used on the pavers of areas like Queen Street Mall are part of a braille trail, there to assist people with impaired vision to move about safely.\n\nAlso known as tactile ground surface indicators (TGSIs), these markings are the long, raised strips or dot patterns installed in public areas that often span many metres through busy thoroughfares.\n\nThe City of Brisbane Council is reminding people not to obstruct these markings, as they help people with impaired vision to get around safely. Source: City of Brisbane\n\nHow do braille trails, or TGSIs, help vision-impaired people?\n\nThey're designed to be felt underfoot or with a cane and are typically located in high-traffic or hazard-prone areas. For many, they act as an essential substitute for visual information, allowing for greater independence, confidence, and safety when navigating public spaces.\n\nADVERTISEMENT\n\n\"Don't stand, walk or place items of braille trails,\" the City said online. \"Keep them clear to help others.\"\n\nMany responding after seeing the post admitted that they didn't realise the markings' important purpose. \"I had no idea what these were. I honestly thought it was flooring design or something. What a great idea,\" one woman said.\n\n\"I doubt most people know the purpose of these. Good post,\" echoed a second. \"I never knew — now that I know, I will be conscious not to be in the way,\" wrote a third local.\n\nIn Australia, TGSIs began to be more widely implemented from the late 1990s, following the introduction of the Disability Discrimination Act 1992.\n\nNational standards were later developed to guide their use, with tactile indicators now required in most new public infrastructure and major upgrades. Their presence has since become a quiet but critical part of inclusive urban design — often unnoticed by many, but life-changing for those who rely on them.\n\nDo you have a story tip? Email: newsroomau@yahoonews.com.\n\nYou can also follow us on Facebook, Instagram, TikTok, Twitter and YouTube.",
    "source": "Yahoo",
    "cluster_id": 35
  }
]