[
    {
        "url": "https://www.9news.com.au/national/sydney-shark-sightings-manly-beach-closed/d6691d26-8c86-437e-969d-289d38a8cdc8",
        "title": "Popular Sydney beach closed over second shark sighting",
        "publish_date": "Mon, 26 Jan 2026 02:00:01 +0000",
        "category": "sports",
        "authors": [
            "Jan"
        ],
        "text": "Australia Day\n\nbeachgoers have been ordered out of the water at a popular location on\n\nSydney\n\n's Northern Beaches after a shark was spotted for the second time today.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/world/gold-price-record-high-5000-usd-per-ounce/682121f7-21e9-4fcd-b09a-514b11cd7323",
        "title": "The price of gold just hit a new record high amid global tensions",
        "publish_date": "Mon, 26 Jan 2026 01:05:42 +0000",
        "category": "finance",
        "authors": [
            "Jan"
        ],
        "text": "The price of gold has hit a new record high, ﻿surging past $7200 per ounce.\n\nIts value grew by more than 60 per cent in 2025 and a single ounce is now worth ﻿about $US5024 ($7271).\n\nExperts predict that figure will continue to climb in 2026 due to the uncertain geopolitical climate, especially in the United States.\n\nGold has broken the $US5000 barrier and is predicted to break the $6000 barrier later this year. (Getty Images/iStockphoto)\n\n\"Our current forecast suggests that prices will peak at around $US5500 ($7960) later this year,\" Philip Newman, director at Metals Focus, told Reuters.\n\nIndependent analyst Ross Norman told the outlet gold prices are forecast to surge as high as $US6400 ($9263) per ounce this year.\n\nHe also predicted an average price of ﻿$US5375 ($7779) for the rest of the year.\n\nThe price of gold is surging because it's a safe-haven asset.\n\nThat means it retains or increases in value during periods of market turbulence, which can be caused by geopolitical uncertainty.\n\nUncertainty caused by, for example, ﻿tensions between the US and NATO over US Trump's Greenland plans, ongoing conflict between Ukraine and Russia despite US-brokered peace talks, and Trump's many tariffs and regular threats to impose more.\n\nAll of this has sent investors flocking to gold, which won't lose its value if tariffs or conflict tanks a specific market or currency.\n\nREAD MORE: Ferry carrying hundreds capsizes in the Philippines ﻿\n\n﻿Some everyday Australians have followed suit.\n\nAussies queued for hours to get in on the gold rush late last year, lining up outside mints and bullion stores to buy the precious metal.\n\nOthers cashed in by selling old gold jewellery , which tends to have a higher gold content than new pieces, for quick cash.\n\n﻿But small businesses like Juju Gems Jewellery in Sydney's south have struggled as the price of gold keeps climbing.\n\nLarna Cooper and Julie Modica are struggling to keep up with surging gold prices. (Instagram/@jujugems.jewellery)\n\nWhen the price of gold broke the $US4000 ($6071) barrier ﻿for the first time﻿ in October 2025, owners ﻿Larna Cooper and Julie Modica had to raise prices or risk going under.\n\n\"Every week we're checking and the gold price has jumped, and it's just adding a lot of extra work to us and making it really hard for us,\" Cooper told 9news.com.au at the time.﻿",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/world/philippine-ferry-sinks-with-hundreds-on-board/ad88f45e-3116-4b68-b8d8-180edb47af1c",
        "title": "Ferry carrying hundreds capsizes in the Philippines",
        "publish_date": "Mon, 26 Jan 2026 00:14:40 +0000",
        "category": "finance",
        "authors": [
            "Jan"
        ],
        "text": "A ferry with more than 350 people on board sank in the southern\n\nPhilippines\n\nafter midnight and rescuers have saved at least 215 passengers and retrieved seven bodies, officials said today.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/australia-day-2026-honours-complete-list-of-recipients/61ccdce8-028f-430a-9967-cb3484fd1b39",
        "title": "'A gift from the Australian people'",
        "publish_date": "Sun, 25 Jan 2026 11:00:00 +0000",
        "category": "sports",
        "authors": [
            "Jan"
        ],
        "text": "Sporting legend Cathy Freeman has been awarded Australia's highest honour, a little more than 25 years after she sent the nation into a frenzy with her Olympic gold medal at Sydney 2000.\n\nOther notable names to be appointed as a companion of the Order of Australia (AC) tonight include former premiers Kristina Keneally, Annastacia Palaszcuk and Steven Marshall, and former federal finance minister Mathias Cormann.\n\nIn all, nearly 1000 Australians were recognised in the﻿ Australia Day 2026 Honours List, including awards in the Order of Australia (General and Military Divisions), meritorious awards, and recognition for distinguished and conspicuous service.\n\nCathy Freeman crossing the finish line and winning gold in the 400 metres at the Sydney 2000 Olympics. (Getty)\n\nIt's just the latest in a glittering list of achievements and awards for Freeman, undoubtedly one of Australia's greatest athletes, responsible for the country's most iconic sporting moment.\n\nShe already counted Australian of the Year, Young Australian of the Year, Sport Australia Hall of Fame Legend status and the Order of Australia Medal alongside her Olympic gold and silver medals and three Commonwealth Games golds in her trophy cabinet.\n\nThe Kuku Yalanji and Birra Gubba woman was recognised for \"eminent service to athletics as an international competitor and ambassador, to positive social impact across the community, to the reconciliation movement in the spirit of unity and inclusion, and as a role model to youth.\"\n\nFreeman told The Sydney Morning Herald she intended to use the honour as a platform to unite Australia.\n\n\"Mum said this is a gift from the Australian people and I wouldn't have looked at it that way, but my mum has incredible wisdom. So I sort of just stopped overthinking it and took it in the spirit it's supposed to be received in,\" she said, adding her mum was \"all about unity\".\n\n\"I just want to be who I am, be authentic. My achievement and my story is always going to touch on things like Aboriginal/Torres Strait Islander perspectives, Olympism, track and field, elite sport, women in sport, the themes are diverse and varied.\"\n\nCathy Freeman celebrates with her gold medal after winning the Women's 400m final at the Sydney 2000 Olympic Games. (Getty)\n\nFreeman described the award as \"quite mind-bending\".\n\n\"I set out to be the best athlete that I could be for myself and then all of a sudden this whole world unfolded right before my very eyes, and it just continues to expand, and it continues to be a wild ride, let me tell ya,\" she said.\n\nPalaszczuk, who won widespread support among Queenslanders but angered many in the rest of the country by limiting the local impact of the COVID-19 pandemic through harsh border restrictions, was praised for her recognition to public health.\n\nShe was also recognised more generally for her time as premier and service to educational equity and multiculturalism.\n\nThen Queensland Premier Annastacia Palaszczuk during a press conference following a national cabinet meeting at Parliament House in Canberra on Wednesday 6 December 2023. (The Sydney Morning Herald)\n\nRob Hirst, the Midnight Oil drummer who died just days ago follow an almost three-year battle with pancreatic cancer , was appointed a member of the order for his service to music.﻿\n\nThe Council of the Order of Australia highlighted former federal finance minister Cormann for his contributions to government reform, multilateral affairs and international economic development.\n\nThe Belgian-born Australian politician became secretary-general of the Organisation for Economic Co-operation and Development (OECD) shortly after leaving the Senate.\n\nFormer NSW leader Kristina Keneally was recognised for her services as premier, as well as her later years as a federal senator.\n\nFormer South Australian premier Steven Marshall was recognised for his service to business, people with disability, governance and board positions.﻿\n\nIn addition to the 680 recipients of awards in the General Division of the Order of Australia (10 AC, 38 AO, 160 AM and 472 OAM), today's Honours list includes:\n\n22 recipients of awards in the Military Division of the Order of Australia.\n\n187 Meritorious awards\n\n60 Distinguished and Conspicuous awards\n\nYou can search the table below for the full list of honourees.﻿\n\nREAD MORE: Police respond to potential sighting of accused triple murderer\n\nGovernor-General Sam Mostyn said the honourees reflected Australia's values for service, community, kindness, curiosity, tenacity, and care.\n\n\"Congratulations to everyone recognised in the Australia Day 2026 Honours List,\" she said.\n\n\"As the list so vividly showcases, so many Australians continue to give the best of themselves across many endeavours, in the interest of others. It is rewarding to see an increase in the number of awards, which reflects more nominations and recognition of the many Australians who inspire the best in all of us.\"",
        "source": "9News"
    },
    {
        "url": "https://www.abc.net.au/news/2026-01-26/australia-day-celebrations-across-country-community-events/106268794",
        "title": "How communities across the country are marking Australia Day",
        "publish_date": "Mon, 26 Jan 2026 02:22:51 +0000",
        "category": "sports",
        "authors": [],
        "text": "Australia Day festivities have officially begun, with events taking place across the country — from a fun run in the north, to traditional dance and smoking rituals across a number of capital cities and ceremonies welcoming the country's newest citizens.\n\nToday — January 26 — represents the date of British settlement in Australia, marking when the First Fleet arrived at Sydney Cove in 1788.\n\nFirst Nations protests on January 26 have a long legacy Every year, January 26 is marked by protests and events organised by Indigenous groups across Australia. It's a legacy that dates back 88 years.\n\nHere's how people across the country are marking Australia Day this year.\n\nACT\n\nThe National Citizenship and Flag Raising Ceremony opened Australia Day commemorations in Canberra this morning, to the tune of Land Down Under, played by the Royal Military College Duntroon band.\n\nPrime Minister Anthony Albanese, Governor-General Sam Mostyn and National Australia Day Council chair John Foreman AM were among those in attendance on the shore of Lake Burley Griffin.\n\nThe Australian Federation Guard greeted Mr Albanese with a general salute, while Ms Mostyn received a vice-regal salute before inspecting the guard.\n\nGovernor-General Sam Mostyn inspects Australia's Federation Guard at the Canberra ceremony. (AAP: Mick Tsikas)\n\nAunty Roslyn Brown, a Ngunnawal elder, performed the Welcome to Country, followed by the Australian National University Chamber Singers who sang the national anthem.\n\nTwo Australian flags, two Aboriginal flags and two Torres Strait Islander flags were carried into position by 36 volunteers, including Australian of the Year alumni and their families and First Nations representatives from communities across the country.\n\nThe Royal Australian Navy's 808 Squadron made a fly-past in an MH-60R Seahawk, with a giant flag dangling below, followed by Royal Australian Air Force flyovers from a CA Wirraway and an E-7A Wedgetail.\n\nMuggera Dancers from the New South Wales Northern Rivers region then performed a cleansing ritual and spirit dance, calling on all ancestors to come together as one for the ceremony.\n\nThe prime minister also presented 23 new Canberrans — hailing from India, New Zealand, Turkiye, the United States of America, Nigeria, Malaysia, Nepal and the United Kingdom — with their citizenship certificates this morning.\n\nPrime Minister Anthony Albanese standing alongside Canberra's new citizens and the most recent Australians of the Year. (AAP: Mick Tsikas)\n\n\"At the very heart of the pledge that you make today to our laws, to our values and to our people, is the respect for our common humanity that defines Australia,\" Mr Albanese said.\n\n\"Love, not hate. Hope, not fear. Optimism, not negativity. And, indeed, unity, not division.\n\n\"That is the Australia … that you are pledging to be a part of, and to make yourselves part of the Australian story. Welcome home.\"\n\nNSW\n\nHundreds gathered beneath the iconic Sydney Harbour Bridge in the early hours of this morning, meeting at Barangaroo Reserve for the annual WugulOra Morning Ceremony.\n\nFor 23 years, WugulOra — which means One Mob — has celebrated continuous culture on the traditional lands of the Gadigal people, of the Eora Nation, combining optimism for a shared future with tradition and sacred ritual.\n\nDoonooch Dancers, from Yuin Nation/Nowra, performed a traditional dance for the Sydney crowd. (ABC News: Max Tillman)\n\nThe continuous culture of Australia's first people was celebrated on Gadigal land this morning. (ABC News: Adam Griffiths)\n\nThe event began with a performance from the Doonooch Dancers, from the Yuin Nation on the NSW South Coast, where First Nations artists and performers celebrated traditional dance and storytelling throughout the morning.\n\nThe ceremony included a performance of the Australian national anthem, sung in two languages — English and Eora, which is spoken by traditional custodians of the land where the ceremony took place.\n\nA huge crowd gathered at Barangaroo Reserve for the annual WugulOra Morning Ceremony this morning. (ABC News: Max Tillman)\n\nNT\n\nIt was an early and wet start for some in Darwin, with Australia Day celebrations kicking off in the drizzling rain around sunrise.\n\nHundreds of locals dressed up and gathered at the Darwin Convention Centre, where they warmed up with Zumba dancing before taking on Oz Run, a 2.5km and 5km fun run through the city.\n\nRain wasn't enough to stop the Australia Day fun run in Darwin. (ABC News: Pete Garnish)\n\nThe event wasn't just for the Top End's fitness fanatics, with locals of all ages — some pushing prams and accompanied by their children — joining the fun.\n\nWet season rain wasn't enough to dampen the festivities, with locals invited to enjoy live entertainment at the Darwin Waterfront through the morning.\n\nMatching outfits were a great way for participants to keep track of their friends and family in the Australia Day crowds. (ABC News: Pete Garnish)\n\nHundreds of locals dressed up and gathered at the Darwin Convention Centre for this year's Oz Run. (ABC News: Pete Garnish)\n\nQueensland\n\nThunderstorms failed to stop hundreds of people turning out to mark Australia Day in the garrison city of Townsville, in Queensland's north.\n\nPremier David Crisafulli praised locals for attending the flag-raising ceremony despite drenching rain, alongside members of the defence force.\n\nJezzine Barracks troops and the Queensland premier attended Townsville's official flag-raising ceremony this morning. (ABC News: Emily Anderson)\n\n\"There you are, standing in the rain to acknowledge [Australia Day],\" he said\n\n\" It's weather like this that defines who we are as a nation and a state … boy, oh boy, have we copped it in recent times. \"\n\nInger Van Essen and her family, who moved to Townsville from Sweden just a few weeks ago, were among those present, marking their first Australia Day as locals.\n\nThe Van Essen family recently moved to Townsville from Sweden, and today marked their first Australia Day as Queenslanders. (ABC News: Emily Anderson)\n\n\"We wanted to join the feeling, and see what it's all about,\" she said.\n\n\"We really enjoyed it — it's raining, but it's nice and there's a lot to see, and our sons like to see all the military stuff.\"\n\nDespite today's wet weather, hundreds of Queenslanders showed up to mark the occasion in Townsville. (ABC News: Emily Anderson)\n\nMackay has also been hit with wild weather in recent times, with the local bowling club hosting a fundraiser for flood victims today.\n\nMeanwhile, further south in Brisbane, locals are sizzling through the city's hottest Australia Day in almost three decades.\n\nIn the city's CBD, new Queenslanders will be honoured at the Australia Day citizenship ceremony at South Bank.\n\nSA\n\nEncouraging reflection, connection and respect, Adelaide's Mourning in the Morning was held at Elder Park on Kaurna country earlier today.\n\nThe First Nations-led ceremony recognises Aboriginal and Torres Strait Islander peoples, their culture and stories.\n\nMourning in the Morning celebrates Indigenous culture with speakers, musicians and dancers. (ABC News: Angelique Donnellan)\n\nWelcoming both Indigenous and non-Indigenous South Australians to the banks of Adelaide's River Torrens/Karrawirra Parri this morning, the event centred on truth-telling, reflection and cultural continuity.\n\nOrganisers estimated up to 3,000 people were present, including Uncle Major \"Moogy\" Sumner — a Ngarrindjeri elder and member of SA's Voice to Parliament body — who performed a Welcome to Country, which was followed by a traditional smoking ceremony.\n\nUncle Major \"Moogy\" Sumner performed a Welcome to Country on the banks of Adelaide's River Torrens/Karrawirra Parri this morning. (ABC News: Angelique Donnellan)\n\nA traditional smoking ceremony blessed the space on Monday morning. (ABC News: Angelique Donnellan)\n\nAs the day goes on, Adelaideans are set to experience the hottest Australia Day of all the capital cities today, with temperatures expected to reach a maximum of 45 degrees.\n\nVictoria\n\nA crowd of political, multicultural and religious leaders converged at Government House, just south of the Melbourne CBD, this morning ahead of an official flag-raising ceremony.\n\nIn her speech, Margaret Gardner spoke about recent times of division and conflict and advocated for unity. (ABC News)\n\nVictorian Governor Margaret Gardner gave a speech about \"times that try our souls\", referencing the recent Bondi Beach terror attack, climate change concerns and global conflicts that she said had spilled into \"discrimination and hatred on our shores\".\n\n\"It will be our lost opportunity if we allow these times to divide us,\" she told the crowd.\n\nAmong those in attendance was Thanh-Kham Tran-Dang OAM, who fled Vietnam in 1979 and became a founding member of the Australian Vietnamese Women's Association.\n\nThanh-Kham Tran-Dang OAM fled Vietnam in 1979 to come to Australia and says it is the \"land for opportunity\". (ABC News)\n\n\"I am very proud to be here on Australia Day with the governor,\" she said.\n\n\" We had connections with Holland — the Netherlands, we had connections with the USA, but we chose Australia because we believed that Australia is the land for opportunity. \"\n\nA number of Australia Day events are also taking place across regional Australia, including in Torquay on Victoria's Surf Coast, where a large crowd gathered from 5:30am for the fourth annual Pilk Purriyn truth-telling event.\n\nThe Wadawurrung Traditional Owners Corporation says thousands came together as First Nations People shared ceremony, truth, reflections and song. (Supplied: Wadawurrung Traditional Owners Aboriginal Corporation)\n\nThousands came together as First Nations locals shared ceremonies, truth, reflections and music, according to the Wadawurrung Traditional Owners Corporation.\n\nAunty Colleen Howell, the daughter of a Stolen Generation survivor, shared her story through song, and the event concluded with the crowd dancing to Yothu Yindi's hit track Treaty, to symbolise the historic treaty signed in Victoria's parliament last year.\n\nA large crowd gathered for the truth-telling event In Tourquay. (Supplied: Wadawarrung Traditional Owners Aboriginal Corporation)\n\nThe Wadawurrung Traditional Owners Corporation co-chief executive Bek Devlin described the event as \"powerful and deeply moving\".\n\n\"The huge number of people who make a conscious effort to rise early on a public holiday and join us for this event shows there is genuine support, and indeed a deep yearning for reconciliation in this country — that you can still be proud and love your country, while holding great sorrow for the way our nation came to be,\" she said.\n\n\"We step into the future with hope and purpose, working towards a more inclusive and equitable future for all Australians.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2026-01-26/snow-sleet-and-freezing-rain-cause-havoc-across-united-states/106268992",
        "title": "Wild winter storm leaves hundreds of thousands of Americans without power",
        "publish_date": "Mon, 26 Jan 2026 01:48:54 +0000",
        "category": "finance",
        "authors": [],
        "text": "A massive winter storm in North America has brought sleet, freezing rain and snow to much of the US, with subzero temperatures disrupting air and road traffic.\n\nTree branches and powerlines snapped under the weight of ice, and hundreds of thousands of homes and businesses in south-east America were left without electricity.\n\nThe ice and snowfall were expected to continue into Monday followed by very low temperatures that could cause \"dangerous travel and infrastructure impacts\" for days, according to the National Weather Service.\n\nHeavy snow has been falling in the Ohio Valley, including in Cincinnati. (AP: Joshua A Bickel)\n\nHeavy snow was falling from the Ohio Valley to the country's north-east, while \"catastrophic ice accumulation\" threatened from the Lower Mississippi Valley to the Mid-Atlantic and south-east.\n\n\"It is a unique storm in the sense that it is so widespread,\" weather service meteorologist Allison Santorelli said.\n\n\"It was affecting areas all the way from New Mexico, Texas, all the way into New England, so we're talking like a 2,000-mile (3,200km) spread.\"\n\nFreezing rain is supercooled rain that falls as liquid but freezes upon impact.\n\nNashville, Tennessee, is one of the many areas in the US affected by wild winter weather. (AP: Holly Meyer)\n\nEmergency declarations\n\nUS President Donald Trump had approved emergency declarations for at least a dozen states by Saturday.\n\nThe Federal Emergency Management Agency pre-positioned rescue teams and commodities in numerous states, Homeland Security Secretary Kristi Noem said.\n\nIn New York state, communities near the Canadian border saw record-breaking subzero temperatures, with Watertown registering minus 37 degrees Celsius and Copenhagen minus 45C, Governor Kathy Hochul said.\n\nThere have been heavy winter storms in Toronto, Canada. (Reuters: Wa Lone)\n\nCoping with the storm\n\nIn Corinth, Mississippi, construction equipment maker Caterpillar told employees at its re-manufacturing site to stay home on Monday and Tuesday.\n\n\"The sound of the trees snapping, exploding and falling through the night have been unnerving to say the least,\" resident Kathy Ragan wrote on Facebook.\n\nIn Clarksdale, Mississippi, Sanford Johnson said enough snow and sleet fell that few motorists ventured out.\n\n\"I had to break it to my youngest daughter that the play date she scheduled likely won't happen today. We have no plans on driving,\" Mr Johnson said.\n\nUS snowstorm triggers flight cancellations A monster snowstorm is moving across the US, cancelling thousands of flights, knocking out power and snarling major roadways with ice.\n\nIn Nashville, Tennessee, Jami Joe, 41, feared her electricity might not last as ice-heavy limbs from oak and pecan trees continued to crash around her house.\n\n\"It's only a matter of time if a limb strikes a powerline,\" she said.\n\nBecause of icy roads, Josh Martin figured he and his wife, Misti, were \"locked in\" for a while at their home on a steep hill in Columbia, Tennessee.\n\n\"Getting in and out of the neighbourhood is not an option,\" he said.\n\n\"I can get down because gravity will take me, but I could not get back up.\"\n\nTimes Square, New York, during a winter storm. (AP: Heather Khalifa)\n\nOn Manhattan's Upper East Side, January Cotrel enjoyed the fresh snow on a block that was always closed during snowstorms for residents to sled, throw snowballs and make snowmen.\n\n\"I pray for two feet (61cm) every time we get a snowstorm. I want as much as we can get,\" she said.\n\n\"Let the city just shut down for a day and it's beautiful, and then we can get back to life.\"\n\nLights out and flights delayed\n\nAs of Sunday morning, about 213 million people were under some sort of winter weather warning, Ms Santorelli said.\n\nHundreds of thousands of customers were without power according to poweroutage.us, with Tennessee and Mississippi hit especially hard.\n\nSome 11,500 flights were cancelled on Sunday and more than 16,000 delayed, according to the flight tracker flightaware.com.\n\nAirports in Philadelphia, Washington, Baltimore, North Carolina, New York and New Jersey were among those impacted.\n\nPeople in Philadelphia have been adjusted to the winter weather. (AP: Matt Rourke)\n\nBitter cold makes things worse\n\nThe danger would continue after the ice and snow, Ms Santorelli warned.\n\n\"Behind the storm it's just going to get bitterly cold across basically the entirety of the eastern two-thirds of the nation, east of the Rockies,\" she said.\n\nThat means ice and snow will not melt as fast, which could hinder efforts to restore power.\n\nIn New York City, Mayor Zohran Mamdani said that at least five people who died were found outside as temperatures plunged on Saturday, although the cause of their deaths remained under investigation.\n\nHe urged people to stay inside and off the roads.\n\n\"We want every single New Yorker to make it through this storm,\" he said.\n\nA big winter storm has dumped sleet, freezing rain and snow across much of the US, including Lake Michigan, Chicago. (AP: Nam Y Huh)\n\nTwo men died of hypothermia related to the storm in Caddo Parish in Louisiana, according to the state health department.\n\nAcross the affected areas, schools and universities announced that classes would be cancelled or held remotely on Monday.\n\nThe NBA postponed games in Memphis and Milwaukee on Sunday because of dangerous travel conditions.\n\nThe Dallas Mavericks tried twice to fly to Milwaukee for their Sunday night game against the Bucks, but conditions would not allow it.\n\nA decision to postpone was announced a few hours before tip-off.\n\nFood that had been prepared for the game was donated to shelters in the Milwaukee area.\n\nEarlier on Sunday, a game between the Denver Nuggets and Memphis Grizzlies was postponed about three hours before tip-off.\n\nPlunging temperatures have disrupted traffic, with officials in many areas asking people to stay off the roads. (AP: Nam Y Huh)\n\nRecovery could take time\n\nIn Oxford, Mississippi, police appealed for residents to stay home.\n\nUtility crews were also pulled from their jobs during the overnight hours.\n\n\"Due to life-threatening conditions, Oxford Utilities has made the difficult decision to pull our crews off the road for the night,\" the utility company posted on Facebook early on Sunday.\n\n\"Trees are actively snapping and falling around our line men while they are in the bucket trucks.\"\n\nOxford city officials posted dramatic photos on social media of slick roads and ice-coated trees sagging or breaking under the added weight.\n\nUS President Donald Trump has approved emergency declarations for at least a dozen states, due to wild weather. (AP: Julia Demaree Nikhinson)\n\nIn Tennessee, emergency officials urged motorists to give crews of workers space to treat roads as drivers had been crashing into them.\n\nIcy roads also made travel dangerous in north Georgia, where the Cherokee County Sheriff's office posted on Facebook, \"You know it's bad when Waffle House is closed!!!\" along with a photo of a shuttered restaurant.\n\nWhether the chain's restaurants are open — known as the Waffle House Index — has become an informal way to gauge the severity of weather disasters across the south.\n\nAP",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2026-01-26/delhi-india-air-pollution-residents-struggle-breathing/106085882",
        "title": "Paying money just to breathe in one of the world's most polluted cities",
        "publish_date": "Mon, 26 Jan 2026 00:30:01 +0000",
        "category": "finance",
        "authors": [],
        "text": "Sourabh Yadav says he has \"forgotten what it's like to have a window open\" at his home in Delhi.\n\nOriginally from Chhattisgarh, a small state in central India, the 26-year-old filmmaker moved to India's capital for university and has lived there for eight years.\n\n\"Summers are brutal in Delhi, so we try to go outside more during winters,\" he told the ABC.\n\n\"But now, given India's Air Quality Index (AQI), these little joys seem tarnished.\"\n\nSourabh Yadav says Delhi's residents usually venture outside for longer amounts of time during winter. (Supplied: Sourabh Yadav)\n\nAQI is the system used to measure how polluted the air is and ranges from 0–50 for \"good\" to 500 for \"severe\".\n\nSince November, Delhi's AQI has hovered between 300 and 400, more than 20 times the limit recommended by the World Health Organization.\n\nEven the air inside Mr Yadav's home is poor, so he bought an air purifier.\n\n\"When I turned it on for the first time, it displayed a near 300 AQI. After a few minutes, it managed to go down to around 20,\" he said.\n\nHowever, Mr Yadav said having an air purifier in Delhi was \"a privilege\" as they sell for between 10,000–20,000 Indian Rupee ($162–$340).\n\n\"That's around the cost of monthly rent in Delhi, even for middle-class people,\" he said.\n\n\"Having to pay that kind of money just to breathe is not always in people's capacity.\"\n\nSourabh Yadav's air purifier displays an AQI of 291, which he says is considered very high. (Supplied: Sourabh Yadav)\n\nMoney aside, Mr Yadav said air purifiers also had limitations.\n\n\"They only work for small spaces, which is why I keep it in my bedroom,\" he said.\n\n\"But as soon as I go into my living room or kitchen, I'll start to feel dizziness or get a headache.\n\n\"It means people will need multiple air purifiers in their home, which most cannot afford.\"\n\n'Simple joys' come with health risks\n\nHome to more than 30 million people, Delhi and its surrounding region routinely rank among the world's most polluted cities.\n\nIndia has six of the 10 most polluted cities globally, and Delhi tops the chart, according to an October report from Switzerland-based air quality monitoring database IQ Air.\n\nIn November, Delhi's AQI stood at 344, a level considered \"severe\" and dangerous to breathe. (AP: Manish Swarup)\n\nEach winter, farmers burn crop residue in nearby states and cooler temperatures trap the smoke that mixes with vehicle and industrial emissions.\n\nIndia's Central Pollution Control Board reported some improvements in recent years due to favourable weather conditions and anti-pollution measures.\n\nBut some studies have found Delhi's air pollution has been more severe than previously estimated.\n\nThe poor air quality has impacted nearly all aspects of life.\n\nHybrid learning has become the norm at schools and universities, offices close regularly, and people mostly stay indoors.\n\nMr Yadav said he has also lost other \"simple joys\" in life, such as enjoying a roadside chai.\n\nHe said buying a chai at a \"tapris\" — roadside shops that sell tea — was part of his regular routine and a big part of Indian culture.\n\n\"But now standing on a footpath with your mask off to sip tea feels a little uneasy,\" he said.\n\nSourabh Yadav says he misses his routine of drinking tea from roadside stalls. (AP: Manish Swarup)\n\nNow Mr Yadav buys packed tea to have at home.\n\n\"Sometimes it makes you angry,\" he said.\n\n\" It makes me wonder, God, this air is the very life you breathe. How can you not care? \"\n\nDelhi's residents are fed up.\n\nIn November, hundreds gathered at Delhi's India Gate in a rare protest, urging authorities to act.\n\nIndia's government has taken steps to address air pollution, one being its launch of the National Clean Air Program (NCAP) in 2019.\n\nIts aim was to cut PM2.5 pollution by 20 to 30 per cent by 2024 — from 2017 levels — which was later revised to a more ambitious 40 per cent reduction by 2026.\n\nCitizens protest against what they say is the government's lack of action to combat air pollution in Delhi. (AP: Manish Swarup)\n\nHowever, policing Delhi's air quality will require an \"inter-sectoral response\" according to Poornima Prabhakaran, an epidemiologist and public health researcher at Ashoka University.\n\n\"This is due to the multiple sources of pollution,\" Dr Prabhakaran said.\n\n\"Transport is a major source, as well as industrial activity, road and construction and demolition dust.\n\n\" There must be a concerted effort to address all sources to begin to lower the hazardous levels of pollution. \"\n\nAir pollution a silent killer\n\nDelhi's air pollution is shortening the life expectancy of its residents by as much as 12 years, according to a recent Air Quality Life Index report by the Energy Policy Institute at the University of Chicago.\n\n\"What we generally see during poor air quality times is an increased number of patients who present to the hospital with exacerbation of their asthma or Chronic Obstructive Pulmonary Disease (COPD),\" said Saurabh Mittal, an expert in diseases of the respiratory system at All India Institute of Medical Sciences.\n\nDelhi residents use air purifiers to improve the quality of air inside their homes. (AP: Manish Swarup)\n\n\"Young patients, who were previously asymptomatic, also come with eye, nasal and throat irritation and a persistent cough.\"\n\nDr Mittal said the pollution also had an impact on some people's mental health.\n\n\"Patients with psychological disorders can face low mood and more fatigue in poor air quality,\" he said.\n\nAnd in the long term, there was a higher risk of cardiovascular and cerebrovascular disease, Dr Mittal added.\n\n\"Higher degree of hypertension and accelerated memory loss are some long-term effects as well,\" he said.\n\nWhen breathing comes at a financial cost\n\nDelhi resident Ashna Sharma and her family have struggled with respiratory issues for years.\n\n\"Stepping outside is nearly impossible, and inside our home every single room now has an air purifier,\" Ms Sharma said.\n\nAshna Sharma says she and her family have spent more on doctor visits in Delhi in the last two months. (Instagram: @ashnaaasharmaa)\n\nThe 26-year-old counselling psychologist and content creator said she was \"genuinely worried\" about her health, but even more for her parents.\n\n\"They are ageing, and this is not the quality of life they deserve,\" she said.\n\nMs Sharma and her family have also racked up more bills as they cope with the air pollution.\n\n\"In just the last two months, we've spent more on medicines and doctor visits than anything else,\" she said.\n\n\" We can't even do something as basic as go for a walk. \"\n\nLooking back over the years, Ms Sharma said the only time she remembers breathing clean air was during the COVID lockdown \"when vehicles were off the roads\".\n\n\"Between Diwali firecrackers, overpopulation, and stubble burning, Delhi has become almost unlivable,\" she said.\n\nCutting emissions 'at the source'\n\nCritics say only long-term measures to cut emissions can bring real relief.\n\nSouth Asia is the global hotspot for air pollution. Can it be fixed? Measures to curb pollution such as installing more pollution monitors and pushing for a switch to cleaner fuels are yet to yield significant results.\n\n\"Delhi's air improves only when emissions are cut at the source,\" said Roxy Mathew Koll, a climate scientist at the Indian Institute of Tropical Meteorology.\n\n\"These emissions are from industries, vehicles, waste and crop burning,\" Dr Koll said.\n\nHe said cuts in emissions must also be complemented by cleaner energy, efficient transport, and coordination with neighbouring states.\n\nBut Delhi's geography made this challenging, he said.\n\n\"Delhi sits in a basin between the Himalayas and Aravallis mountains where weak winter winds and temperature inversions trap pollutants near the surface,\" he said.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2026-01-26/australian-open-tennis-iva-jovic-aryna-sabalenka/106269176",
        "title": "Why a US 18yo rejects the 'underdog' tag against world No.1 Sabalenka",
        "publish_date": "Mon, 26 Jan 2026 00:24:31 +0000",
        "category": "sports",
        "authors": [],
        "text": "Not long after booking an Australian Open quarterfinal berth, Iva Jović expressed quiet confidence about her chances of defeating upcoming opponent, Aryna Sabalenka.\n\nAs match-ups go, few are tougher than facing world number one Sabalenka on a court where she has twice lifted the championship trophy.\n\nIt would be easy to suggest Jović is simply enjoying the innocence of youth, given she is 18 and the youngest player inside the top 100 on the WTA rankings.\n\nBut the American is not a naïve teenager, blindly caught up in the moment at Melbourne Park.\n\nSabalenka's approach to being world number one Aryna Sabalenka reveals why she has not changed since topping the world rankings.\n\nThe world number 27 has unwavering self-belief in her game, and few could argue about her potential after watching her destroy Yulia Putintseva 6-0, 6-1 in the fourth round.\n\n\"I don't really feel like there is a lot of house money or underdog mentality that I'm feeling,\" Jović said.\n\n\"Because I don't feel like I have been playing anything outside of my comfort zone or outside of my normal level.\n\n\"I have come from two other tournaments where I was playing every day and winning a lot of matches, as well.\n\n\"So this week and the level that I'm showing right now doesn't really feel much different than that.\n\n\"it's just another week that I'm winning more matches, which is nice to see.\"\n\nIva Jović is the youngest player in the top 100 on the WTA rankings. (Getty images: Clive Brunskill)\n\nJović's run to the last eight has been impressive.\n\nShe is yet to drop a set and among her victories was a 6-2, 7-6 (7/3) defeat of seventh seed Jasmine Paolini, who is a two-time major finalist and former world number four.\n\nJović did not need to play herself into form, having made the final and semifinal of two Australian Open lead-up events, in Hobart and Auckland, respectively.\n\nHer 2025 season underlined her status as a star on the rise, highlighted by her win at the Guadalajara WTA 500 event as a 17-year-old.\n\nJović ready for Sabalenka\n\nSabalenka, who won the Australian Open in 2023 and 2024, will be a different proposition to Jović's previous opponents in Melbourne.\n\nShe arrived at the tournament on the back of winning the Brisbane International and has barely been challenged on her way to the quarterfinals.\n\nJović, though, is not intimidated by the Belarusian.\n\nAryna Sabalenka has twice won the Australian Open. (Getty Images: Fred Lee)\n\nWhile buzzing to have come this far at the season-opening major, she sees no reason why she cannot compete against Sabalenka.\n\n\"I'm just excited. I'm in the quarters, which is amazing for me,\" Jović said.\n\n\"So you're going to be playing one of the best players at this stage of the tournament. That's what you want.\n\n\"I'm just trusting the level that I have been able to put out and hopefully that will be enough.\"\n\nTuesday's quarterfinal will be the first time Sabalenka and Jović have played each other on the WTA Tour.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2026-01-26/australian-open-2026-live-jannik-sinner-maddison-inglis-swiatek/106268840",
        "title": "Live: Defending Australian Open champ sent packing as Pegula dominates Keys",
        "publish_date": "Sun, 25 Jan 2026 23:49:09 +0000",
        "category": "sports",
        "authors": [
            "Simon Smale",
            "Andrew Mcgarry"
        ],
        "text": "Jason Kubler and Marc Polmans have won an all-Australian encounter against James McCabe and Li Tu to advance to the quarterfinals of the men's doubles.\n\nKubler and Polmans broke once in each set, taking out the match 6-4, 6-4 in one hour 28 minutes.\n\nMcCabe and Tu's run ends. They knocked out British number one seeds Julian Cash and Lloyd Glasspool, which was a brilliant result.\n\nBut they didn't quite cope with their opponents today and were chasing the game for most of the event.\n\nKubler and Polmans will now face French 12th seeds Sadio Doumbia and Fabien Reboul for a place in the last four.\n\nSpeaking afterwards, Jason Kubler was asked about his fiancee Maddison Inglis, who will take on second seed Iga Świątek in the fourth round.\n\nHe said he was very proud of Inglis, who has had an amazing time at Melbourne Park this year.\n\n\"No matter what happens tonight ... she's had an incredible run from quallies (Australian Open qualifying).\n\n\"I just hope she goes out and enjoys it.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2026-01-26/roof-ripped-off-mercedes-cove-home-by-tropical-cyclone-luana/106267822",
        "title": "Heartbreak as home owner discovers roof was ripped off by Tropical Cyclone Luana",
        "publish_date": "Sun, 25 Jan 2026 23:03:50 +0000",
        "category": "finance",
        "authors": [],
        "text": "The owner of a coastal retreat in Western Australia's far north says she was heartbroken when she discovered her home had been \"all but destroyed\" by Tropical Cyclone Luana.\n\nLuana crossed the WA coast as a category two system on Saturday, bringing heavy rain and damaging winds to remote communities across the Dampier Peninsula.\n\nThe ex-tropical cyclone, now a tropical low, is tracking inland across the Kimberley.\n\nPat Channing, who runs Mercedes Cove Exclusive Retreat, an Aboriginal-owned and operated business, with her husband David, was in Broome, about 160 kilometres to the south, when the cyclone crossed.\n\nThe damaged property was Ms Channing's family home at Mercedes Cove and she heard about the destruction from managers on the ground.\n\nRoof blown off\n\nThese pictures show the debris, caved-in plaster and insulation foam covering the kitchen and living area.\n\nPat Channing says she was heartbroken when she heard the property had been destroyed. (Supplied)\n\nMs Channing said they had only recently restored the roof after ex-Tropical Cyclone Hayley, which crossed earlier this month.\n\n\"Then this other cyclone ripped the roof off and dropped the ceiling in the lounge and kitchen and water damaged everything,\" Ms Channing said.\n\nThe Mercedes Cove managers told Ms Channing that waiting out the cyclone was \"frightening and terrifying\".\n\nThey were staying at another residence on the site.\n\nPat Channing runs Mercedes Cove Coastal Retreat with her husband David. (ABC News: Erin Parke)\n\n\"The wind was horrendous, they couldn't get out in the morning for at least 3 to 4 hours to make any assessment of the damage,\" Ms Channing said.\n\n\"Luckily, all our accommodation for the tourism season was not affected so that's a plus, I suppose.\"\n\nNone of the tourist accommodation at Mercedes Cove was damaged by Tropical Cyclone Luana. (Supplied)\n\nMs Channing said the house held precious memories of her family, friends and retreat guests, which would not be forgotten.\n\n\"Twenty years [ago] my hubby built that and I helped where I could … we had a wonderful 20 years with our children and our grandchildren,\" she said.\n\nHeavy rainfall forecast\n\nDFES Kimberley Superintendent Leon Gardiner said he was aware of structural damage to a building at Mercedes Cove.\n\nThe Mercedes Cove property was hit by damaging winds and heavy rainfall. (Supplied)\n\n\"DFES is on stand-by to provide assistance but emergency services support has not been requested at this time,\" he said.\n\n\"The damage from the cyclone crossing overnight was mainly concentrated to Derby with 12 requests for assistance on Sunday.\n\n\"Mainly for fallen trees blocking access or leaning on homes.\"\n\nThe tropical low will take \"several days\" to move south through the Kimberley, Pilbara and southern interior, according to Superintendent Gardiner.\n\nLeon Gardiner advised people in affected areas to stay up to date with the latest warnings. (ABC Kimberley: Andrew Seabourne)\n\n\"[This] could bring heavy rainfall and flooding to those areas this week,\" he said.\n\n\"There are flood and storm warnings current on Emergency WA with the latest information and directions for people in those areas to prepare and stay safe.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2026-01-26/underground-kangaroo-carer-boddington-wa/106196684",
        "title": "Pub joey a story of the challenges facing country WA's 'underground' wildlife carers",
        "publish_date": "Sun, 25 Jan 2026 21:58:37 +0000",
        "category": "finance",
        "authors": [],
        "text": "Anthony \"Oz\" Ostigh is an unlikely kangaroo carer who wanders around his mining town wearing a stockman's hat and a crochet bag with an eight-month-old joey named Roofus.\n\nRoofus is one of many orphaned kangaroos Mr Ostigh has taken under his wing.\n\nMr Ostigh lives in Boddington, about 130km south-west of Perth, where he is his community's unsanctioned kangaroo carer.\n\nA joey in the pub is a strange sight for some patrons. (ABC Great Southern: Andrew Chounding)\n\nHe is not a registered wildlife carer — a requirement under WA law — but partly does the job because the nearest registered carer is more than 100km away from town.\n\nThe other reason is that caring for vulnerable kangaroos is his life's passion, which began as a boy.\n\n\"They follow you everywhere. They want the attention, they come up for their cuddles,\" Mr Ostigh said.\n\nWhen the joeys reach 12 to 18 months in age, Mr Ostigh releases them.\n\nIn Roofus's case, he was given to Mr Ostigh by a Boddington local who found the joey as a \"pinky\" in the pouch of his deceased mother.\n\nMr Ostigh has cared for several orphaned joeys, but has a special bond with Roofus. (ABC Great Southern: Andrew Chounding)\n\nPlenty of company\n\nIn a joey's early months, Mr Ostigh brings them on his day-to-day errands, including to the pub and grocery store.\n\nRoofus is a regular vistor to the pub in Boddington. (ABC South West: Anna Cox)\n\n\"They need to be fed pretty frequently, so they come with me,\" Mr Ostigh said.\n\nHe said Roofus was a welcome visitor to the local watering hole.\n\n\"It's quite amazing really, some of the miners are big burly blokes covered from head to foot in tattoos,\" he said.\n\n\"You'd think they're not the sort of person who would come up and want to pat a roo.\"\n\nPublican Julie McNamara said it was not uncommon to see animals being cared for by kind-hearted locals.\n\nJulie McNamara says the joey is the pub's cutest regular. (ABC Great Southern: Andrew Chounding)\n\n\"All of the beautiful people and souls in Boddington, they raise whichever animals that are injured … it's just the normal,\" she said.\n\n\" It's not abnormal to have someone that comes through with a sheep on a leash or a goat on a leash. \"\n\nPub patron Lou Chapman said Mr Ostigh and Roofus made him proud to be a Boddington local.\n\n\"What he's doing is relaying the fact that if you've got an injured animal, he's prepared to take it in and help,\" said Mr Chapman.\n\n\"It's good, it's human nature to be nice, even to a furry friend.\"\n\nOz Ostigh has been taking care of Roofus since he was just a baby joey. (ABC Great Southern: Andrew Chounding)\n\n'Underground' wildlife carers\n\nIn order to care for wildlife in WA, a licence from the Department of Biodiversity, Conservation and Attractions (DBCA) is required.\n\nRegistered kangaroo carer and founder of Roo Rescue, Kim Mitchell, said obtaining a licence was becoming increasingly inaccessible.\n\n\"It shouldn't be that hard, it's not rocket science,\" Ms Mitchell said.\n\nShe said the rigorous licensing process had forced many carers to work \"underground\", without official clearances.\n\nThe Boddington Hotel is 130 kilometres south of Perth. (ABC Great Southern: Andrew Chounding)\n\n\"We're only doing it because it's a calling and the animals need us and there is nowhere else for them to go,\" Ms Mitchell said.\n\n\"If the volunteers and wildlife carers stopped, we'd be in a dangerous situation of losing massive amounts of animals.\"\n\nDBCA does not condone the informal care of native animals, but said there was a pathway for temporary care arrangements.\n\n\"A person can apply to DBCA to temporarily possess fauna that is injured or abandoned until it recovers or can fend for itself to ensure successful release back into the wild,\" a spokesperson said.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2026-01-26/influencers-changing-australian-open-2026/106267980",
        "title": "Influx of influencers leaves tennis fans frustrated at Australian Open",
        "publish_date": "Sun, 25 Jan 2026 21:40:56 +0000",
        "category": "sports",
        "authors": [],
        "text": "After a record number of people streamed through Melbourne Park's gates for the first day of the Australian Open this year, Tennis Australia boss Craig Tiley said: \"Cricket's in December. Our objective is we want to own January.\"\n\nPart of that strategy is to make the tournament about more than just tennis. Over the three weeks — including qualifying week and main draw — the sporting precinct becomes a behemoth of brand activations, activities and entertainment.\n\nThere's also the slew of influencers who descend on the tournament and post relentlessly across social media. Many get invited to premier experiences and seating by brands in exchange for content to their followers, which can range from a few thousand to millions.\n\nThey have helped Tiley and co make the event not just the place to be during January, but the place to be seen at.\n\nThe 2026 Australian Open has attracted record crowds throughout the tournament. (Getty: James D. Morgan)\n\nMany long-time tennis fans say this is changing the look, feel and experience of going to the Australian Open, with comparisons drawn to the fashion-focused Spring Racing and the changing culture of the Australian Grand Prix.\n\nWith this, some frustration has been levelled at influencers and content creators by the general public — many of whom have been going to the tournament for years — with the inundation coinciding with thousands being forced to wait in queues for hours for matches while they get increased access.\n\nOne fan posted online about having to wait five hours in the sun to see Stan Wawrinka play at Kia Arena during week one.\n\nEmily Wade, 28, says she is a genuine fan who is finding it personally frustrating to see the influx of influencers take up seats at marquee matches when others who would genuinely appreciate being there for the tennis are finding it increasingly inaccessible through overcrowding and higher ticket prices.\n\n\"I've been seated behind influencers before and I've witnessed them on their phones, talking, leaving early and I personally don't think it's a good look,\" Wade told the ABC.\n\n\"The only comparison I have is the AFL/AFLW, which has very minimal influencer presence, so that doesn't affect my experience as much as the tennis, where the influencer presence is growing every year.\"\n\nLoading Instagram content\n\nKirsty Stekel, 37, said she missed when the Australian Open was more about dressing in team colours rather than fashionably.\n\n\"I love the AO no matter what, but [I'm] definitely mourning the era when you could get cheap ground passes, hop between courts and matches with ease and everyone would show up in groups dressed in countries' colours to support players — not having to worry about looking chic or fashionable,\" Stekel said.\n\n\"Wearing national colours brought so much energy to the crowd and the day and it's rarely seen anymore.\"\n\nThe role of content creators and influencers at the AO\n\nMost influencers are invited by certain brands or companies to events across the tournament, while organisers have granted increased access to content creators this year.\n\nTennis Australia director of content Brie Stewart told Code Sports: \"We understand that they're coming anyway, and we want to be a part of the story they're creating.\"\n\nBut one popular TikTok influencer, who talked to the ABC on the condition of anonymity, said they were surprised at the level of pressure placed on influencers to be creating content by organisers.\n\n\"I think it was 20 posts [across the tournament] to even be allowed into the AO creator lounge,\" they said. The creator lounge is a designated section within Tennis HQ, where creators can film, edit and work.\n\n\"Some people don't think we work for our money but 20 edited videos [is] a lot of time out of our day. I did the math, that's a minimum [equivalent] of $60K in TikToks,\" the influencer said.\n\nSome Aus Open fans frustrated by 'Opening Week' The Australian Open's \"Opening Week\" has seen record crowds, but some fans are frustrated and disappointed by the confusing messaging.\n\nThe tournament used a \"tier system\" where creators were rewarded with certain perks based on the quantity of content they posted and \"impressions\" from their audience.\n\nThe \"rewards\" included, among other perks, guided backstage tours, accreditation access to the AO grounds, going into the running for AO Reserve seats, AO partner events and seats to the quarterfinals, semifinals and men's and women's final.\n\nThe reward system kicked off the week prior to the AO starting.\n\nOne fan online wrote: \"I think the AO just played the game really well. They got all the influencers in the week before to spruce up the vibe, show off the food and the fun as well as the tennis and it worked.\"\n\nThe influencer added that they felt people would always find negative things to say about \"influencing\" because it was \"a dream job\".\n\n\"We do f**k all and get paid a shit-ton,\" they said.\n\nWhile brands have their own collaboration deals with influencers, Tennis Australia has not paid any or covered their travel costs.\n\n'Not one way to be a fan'\n\nMany tennis fans have also voiced frustration at the lack of tennis etiquette from certain influencers and groups of fans who are more concerned with getting content than watching the matches.\n\nOne fan told the ABC that a group of influencers sat in front of them at a match, took a bunch of photos with a particular branded product and then left without watching any of the match.\n\nDr Kasey Symons, lecturer of communication specialising in sports media at Deakin University, said there would always be some good and bad apples among big groups.\n\nLoading Instagram content\n\nAs someone who researched fan culture in sports, she said people needed to move away from the idea that there was one kind of sports fan, or one way to do fandom.\n\n\"We need to embrace how all fans want to connect to sport, whether that be as lovers of the sport and high consumers of the competition and match analysis, to casual fans who enjoy the atmosphere, [and] social media users who are engaging in an online community,\" Symons told the ABC.\n\n\"There are always going to be fans that cross the line and annoy other fans, but they are not reflective of the wider group.\n\n\"There are traditional fans who can be disruptive to the enjoyment of other fans, and influencers and new fans and social media users can get it wrong too.\n\n\" This has to become a broader discussion on how to be a good fan rather than what is the 'right' way to be a fan. \"\n\nBut online creator Nicole Bridget pointed out on TikTok that who got invited as guests to events like the Australian Open could still be quite rigid and exclusive.\n\nShe said the issue she had was with brands and agencies not inviting diverse people and \"making it very clear only skinny creators are invited to the AO events for yet another year because apparently if you're curvy it means you don't like sport\".\n\nSome women sport creators have also been frustrated at their lack of being championed by brands during the events.\n\nMeanwhile, others have found it hard to watch female influencers post content flaunting and laughing at their lack of tennis knowledge in a space in which they have worked hard to be taken seriously.\n\nMore women learning about the sport\n\nAtara Thenabadu, 25, said she saw similarities with changing fan cultures of tennis with the F1, which brought in a lot of young female fans after the success of the Netflix documentary series, Drive to Survive.\n\n\"When it comes to the question of whether influencers 'deserve' to be there, I can't help but feel that there are undertones of sexism in some quarters, whether realised or not, that uphold the so-called sacred guardrails of professional sport that for years acted as barriers against women who were interested in learning about the sport,\" Thenabadu told the ABC.\n\nMorgan Riddle, girlfriend of US tennis player Taylor Fritz, has been credited by many for getting more young women into the tennis. (Getty: Cameron Spencer)\n\nThe Kansas City Chiefs in the NFL had an uptick in female viewership after singer Taylor Swift started attending games with her partner, Chiefs player Travis Kelce. While this was a sugar hit for some, it did convert others into NFL fans, particularly women who long felt excluded from the sport or intimidated by its scene.\n\nSuper Bowl champ calls out Taylor Swift haters Philadelphia Eagles superstar Saquon Barkley says he does not understand why Taylor Swift was booed at the Super Bowl, adding that she is part of the reason the NFL is growing internationally and taking games to Australia.\n\n\"That said, I do believe, based on online discourse, that there have been repeated instances of a lack of engagement with the sport itself, such as not watching matches or talking loudly, which I don't think is appropriate,\" Thenabadu said.\n\nThenabadu added that when considering the two perspectives — while there wasn't a simple solution — she believed the overcrowding and long-line issues fell at the feet of Tennis Australia, rather than with influencers invited by brands.\n\n\"From my perspective … I don't feel jealousy or envy when watching influencers attend; however, I would be lying if I said I wasn't surprised by others voicing discontent with influencers who have shown little to no interest in the sport being included,\" she said.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2026-01-26/nfsa-restoration-of-mount-gambier-life-in-australia/106117106",
        "title": "1960s films restored in hope of enticing new migrants to regional Australia",
        "publish_date": "Sun, 25 Jan 2026 21:00:57 +0000",
        "category": "finance",
        "authors": [],
        "text": "Darryl Bruhn remembers he was about 10 years old when his dad, Brice, was filmed by an out-of-town crew while working at a limestone quarry near Mount Gambier, in South Australia's south east.\n\n\"For him it was just a normal day and the fact there was a film crew there … he would have been concentrating on his job,\" he said.\n\nLittle did he know, the film would be distributed around the world and seen by people who would end up moving to Australia.\n\nDarryl Bruhn has travelled the world but still feels a strong connection to Mount Gambier, where he grew up. (Supplied: Darryl Bruhn)\n\nThe film crew was part of the Commonwealth Film Unit (now Film Australia), and was visiting the town to create a Mount Gambier edition of the Life in Australia film series.\n\nThe films — commissioned by the Department of Immigration in the 1960s — screened at embassies and High Commissions, particularly in the United Kingdom, to encourage migration to Australia.\n\nMount Gambier was one of 12 locations around Australia highlighted in the series, including major capital cities and other regional towns.\n\nA glimpse into regional life\n\nReleased in 1964, the Mount Gambier film follows a local family through the rhythms of work and leisure in the region.\n\nIt showcases local industries such as forestry and cheesemaking, and highlights important locations including the hospital, Commercial Street and Brownes Lake.\n\nMr Bruhn does not remember much about the film from when he was a child, but parts of it were immortalised in the region.\n\n\"They had a whole lot of photographs that were taken at that time as part of that series and there was a photograph of [my dad] cutting limestone on a billboard on the entrance to Mount Gambier,\" he said.\n\n\"I think I did see the footage at some time later on, and then it was only probably 12-18 months ago when it popped up on Facebook.\"\n\nThe Mount Gambier Life in Australia film captured many places in the region 60 years ago, including the Valley Lakes precinct. (Supplied: National Film and Sound Archive)\n\nMr Bruhn moved to Adelaide about 20 years ago, but still visits family in the region about once a year.\n\n\"When I [drive] in, I'll come in from Millicent and I'll look up on the hill and see the lake and the tower ... that's always when something happens in my stomach,\" he said.\n\n\"When you enter the pine forest areas, that's what tells you that you're home in Mount Gambier.\n\n\" I guess there is some nostalgia about things that [people] remember and things that you've forgotten until you see something that triggers your memory. \"\n\nSelling regional Australia to migrants\n\nTowns featured in the Life in Australia films were chosen because they were considered attractive for migrants.\n\nProfessor Kate Darian-Smith from the School of Historical and Philosophical Studies at the University of Melbourne said they were intentional marketing campaigns.\n\n\"The one on Mount Gambier, for instance, really highlights that this is a regional place where there is industrial growth,\" she said.\n\n\"They're not documentaries in the sense that they're not including those who are excluded; there is really no reference or mention of First Nations people … [and] no real addressing [of] any social or class divisions.\"\n\nThe Life in Australia films showcased an idealistic view of what it was like to live in Australia. (Supplied: National Film and Sound Archive)\n\nPost-World War II migration in the 1950s and 60s was lower than expected, and the Australian government wanted to boost numbers.\n\n\"Those coming from Britain were always seen as the most desired cohort and the group of people Australia really wanted to attract,\" Professor Darian-Smith said.\n\n\"The key message is there are jobs there for migrants — both skilled and unskilled — and that the economy itself is modernising.\"\n\nProfessor Darian-Smith said the series was effective, but many did not stay longer than a few years.\n\n\"A lot of British migrants who were lured by films like this … found when they came, the reality was somewhat different,\" she said.\n\n\"Up to about 25 per cent of all migrants coming in the 50s and 60s returned to Britain or other countries of origin because the hype didn't quite ... [match] their own experience.\"\n\nRestored for modern viewing\n\nThe Life in Australia films have now been re-released on YouTube in 4K by the National Film and Sound Archive of Australia.\n\nThe old hospital in Mount Gambier was a major employer for residents in the 1960s. (Supplied: National Film and Sound Archive)\n\nSenior manager of the enterprises team with the archive, Bronwyn Dowdall, said digitising the archived film was not typical.\n\n\"The process is known as scanning and grading — not a restoration as such,\" she said.\n\n\"They're really interesting time capsules; definitely a portrayal of an idealised Australia — the Australia that the government at the time wanted the world to see.\"\n\nThe videos have been popular for those interested in looking back to the 1960s, as well as the locals who featured in the films.\n\n\"We're really hoping that people are able to engage with the material to look back and reflect on what their town was like at that time,\" Ms Dowdall said.\n\n\"It's always fun to see places that you're very familiar with … decades ago.\"\n\nThe National Film and Sound Archive's project allows people to see what the famous Blue Lake looked like 60 years ago. (Supplied: National Film and Sound Archive)\n\nWhile the Life in Australia series has not been recreated since, its legacy lives on in the form of a booklet distributed by the Department of Home Affairs to new migrants.\n\nMs Dowdall said she would like to see what a modern version of the films would look like.\n\n\"The Commonwealth Film Unit doesn't exist anymore, so it would be interesting if anybody had that as a project,\" she said.\n\n\"There could be production companies that are interested … but productions like that can be really expensive.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2026-01-26/rail-over-the-derwent-a-distant-memory-as-final-pieces-removed/106266736",
        "title": "Rail over the Derwent a distant memory as final pieces removed",
        "publish_date": "Sun, 25 Jan 2026 20:17:32 +0000",
        "category": "finance",
        "authors": [],
        "text": "The last time a train travelled across the River Derwent was more than a decade ago, and it was carrying freight rather than passengers.\n\nHobart's rail corridor has sat unused since 2014, following the opening of the Brighton Transport Hub on the northern side of the river.\n\nIt has also been more than 50 years since passenger rail rolled into Tasmania's capital, although short heritage rides have recently commenced.\n\nA Tasman Limited train winds through Hobart's northern suburbs in 1974. (trains-worldexpresses.com )\n\nDespite this, there remained some in the community who wanted to see the railway returned to its former glory.\n\nBut the removal of the heritage-listed Bridgewater Bridge's main lift span this month marks, for some, the final nail in the coffin for Hobart's rail corridor.\n\nLoss of rail connection a 'matter of regret'\n\nTasmanian Transport Museum president Jeff Bronstein said the loss of the Bridgewater rail crossing is deeply felt in Tasmania's rail heritage community.\n\n\"It's always sad and a matter of regret when you see railway infrastructure, especially iconic railway infrastructure like the Bridgewater Bridge, come to the end of its life and removed,\" he said.\n\nMr Bronstein said the physical structure was not the only thing lost, but also \"all the stories and all the human activities that were involved with the construction, design and operation of the bridge\".\n\nHe said it closes off future possibilities for rail.\n\n\"When a piece of infrastructure like rail is taken away, it's very difficult to restore it, to have it replaced, due to the costs involved with such large pieces of engineering,\" Mr Bronstein said.\n\nThe state government described the bridge as being in poor condition and requiring high maintenance costs, resulting in its removal.\n\nIt has been replaced by a four-lane bridge that opened to traffic in June 2025 and cost $786 million.\n\nThe new Bridgewater Bridge opened in June last year. (Supplied: State Growth)\n\nDisused rail corridor to become rapid busway\n\nThe government is pushing ahead with plans to use parts of the northern suburbs rail corridor for a rapid busway.\n\nThe details are yet to be confirmed, and a broader business case is overdue for release.\n\nLoading...\n\nOnce the business case is complete, the state government will seek additional funding from the Commonwealth for the busway.\n\nThere are also plans for the rapid bus system to connect to the yet-to-be-built Macquarie Point stadium precinct to help move large numbers of event goers.\n\nBut despite that, one group still hopes passenger rail will run through northern Hobart yet again.\n\nToby Rowallan from the Hobart Northern Suburbs Rail Action Group. (ABC News: Kate Nickels)\n\nThe Hobart Northern Suburbs Rail Action Group (HNSRAG) envisions an interconnected public transport network for the northern suburbs, where buses and park-and-ride facilities feed into train stations.\n\nIt believes trains would help ease congestion on Hobart's key arterial roads, as well to reduce urban sprawl, and increase housing density.\n\nHNSRAG president Toby Rowallan said the removal of the old Bridgewater Bridge makes a future rail link \"a little bit harder\", though not impossible.\n\nA visualisation of a 2013 plan for light rail in Hobart, since discarded.\n\nCould Tasmania's passenger train service ever make a comeback? Passenger trains, along with trams and trolley buses, were once part of Tasmania's transport mix.\n\n\"It just means that we'd have to do that in stages. We'd have to go from Hobart to Granton first, and then once it was a success, it would be easy to justify reconnecting the railway and putting a stop on the other side of the river,\" Mr Rowallan said.\n\nServicing the broader Brighton municipality remains an important area of interest for him, as its \"one of the highest areas of transport disadvantage\".\n\n\"People can't afford a car and have reduced bus services, and now there is no other option possible because the rail line has been removed,\" he said.\n\nThe lift span on the old bridge has long been a feature in Hobart's northern suburbs. (Supplied: Department of State Growth)\n\nHeritage train ride expansion still happening\n\nMr Bronstein said the museum's heritage train operations between Glenorchy and Berriedale, along with its plans to expand to Granton in the coming years, would not be affected by the removal of the old bridge.\n\nBut the removal of the rail crossing connecting both sides of the River Derwent will prevent any further expansion plans across the river.\n\n\"Once we've established our rail operations as far as Granton, it does become problematic for the museum not having a direct fixed rail link across the Derwent River.\"\n\nThe finished Bridgewater Bridge in Hobart. (Supplied: State Growth)\n\nWhat happened to Hobart's trams? Which was the first Australian city to get an electric tram network? Melbourne? Sydney? Nope. Try Hobart. But where did they go?\n\nHe said the museum may eventually need to move locomotives using heavy equipment or set up a new depot near the old Bridgewater Junction station, but any solution was years away and would require government assistance.\n\n\"The costs of establishing a new fixed rail link would be prohibitive,\" he said.\n\nWhile one option could involve bussing passengers across the new bridge as trains are moved separately, Mr Bronstein admits the idea is unlikely to be practical.\n\nKeeping history alive\n\nEven though the Bridgewater rail crossing has been removed, parts of its history will be preserved.\n\nThe Department of State Growth has agreed to give the museum access to some of the bridge's dismantled rail infrastructure.\n\nTasmania's most expensive infrastructure project opens to public Tasmania's largest and most expensive transport infrastructure project — the Bridgewater Bridge — has been opened to the public with thousands expected to walk it on foot.\n\n\"We are hopeful that we'll be able to get access to some welded rail. It's good quality rail. There's sleepers there, there's signalling points and those kinds of bits of infrastructure, signage et cetera,\" Mr Bronstein said.\n\nHe said the salvaged materials would be used to support the museum's plans to expand to Granton and establish a major western terminus.\n\n\" Aspects of it will still see the light of day in terms of railway operations. Just not the way it was originally intended. \"\n\nThe department intends to incorporate elements of the old bridge into a future interpretive site, giving the structure a second life in the area's storytelling.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2026-01-26/how-public-holidays-work-annual-leave/106207590",
        "title": "Why most Australians won't get a weekday off for Anzac Day in 2026",
        "publish_date": "Sun, 25 Jan 2026 19:39:28 +0000",
        "category": "finance",
        "authors": [],
        "text": "For the first time since 2020, Anzac Day will fall on a Saturday this year, which means most Australians will not get a weekday off.\n\nIn 2026, only the Australian Capital Territory and Western Australia will have Monday, April 27, as a public holiday.\n\nThe ACT announced it will transfer the public holiday to the Monday, and said: \"Anzac Day remains a national day of significance on the 25th April and all commemorative activities will be occurring on the Saturday.\"\n\nIn WA, the government has designated both the Saturday and Monday as public holidays.\n\nFor the first time since 2020, Anzac Day will fall on a Saturday this year. ( )\n\nThe reason comes down to the legislation in each state.\n\nWhen Anzac Day falls on a Sunday, people in Queensland, South Australia, WA, the Northern Territory, and the ACT get the public holiday on the Monday per their state's laws, whereas those in New South Wales, Tasmania and Victoria do not.\n\nSo how does it all get decided, and how can you maximise time off from work?\n\nWho can decide to offer a substitute public holiday?\n\nIn Queensland, if Anzac Day falls on a Saturday only the Minister for Industrial Relations, Jarrod Bleijie, can — by Gazette notice — substitute another day for a public holiday, according to the Queensland Holidays Act 1983.\n\nBut in January, Mr Bleijie said he would not be moving to substitute Anzac Day for another day as it fell on a Saturday, rather than a Sunday.\n\n\"My understanding under the legislation is the Anzac Day falling on a Saturday is the public holiday,\" he said.\n\n\"If it was to fall on a Sunday … it does then get substituted for a Monday.\n\n\"We have no intention to change [the legislation] at the moment. We're always in discussion with RSL Queensland and our veterans, but at this stage there's no plans to change that.\"\n\nQueensland's deputy premier Jarrod Bleijie declined to give Queenslanders a substitute Anzac holiday. ( )\n\nQueensland is not the only state that can shift its public holidays, with legislation in SA, NSW, the NT, and Vic also allowing for state government ministers to make one-off decisions.\n\nIn Tasmania, changes can only be made be legislative reform.\n\nIn relation to Anzac Day specifically, in the ACT, the Holidays Act 1958 outlines that if April 25 falls on a Sunday, the following Monday is a public holiday.\n\nIt is also currently legislated in WA, with the Public and Bank Holidays Act 1972 outlining that, when Anzac Day falls on a Saturday or Sunday, the next following Monday is also a public holiday.\n\nWhen is the next public holiday?\n\nPublic holidays shared nationwide: New Years Day, January 1\n\nAustralia Day, January 26\n\nGood Friday, April 3\n\nEaster Monday, April 6\n\nChristmas Day, December 25\n\nBoxing Day, December 26 (plus substitute day on December 28 for most states)\n\nWith 2026 now underway, let's take a look at when public holidays will fall this year and how to make the most of them.\n\nMainstream public holidays are shared widely among the states and territories.\n\nThese include Christmas Day, Good Friday, and Easter Monday.\n\nSome jurisdictions get a part-day holiday on Christmas Eve, with the day considered a public holiday after 6pm in Queensland and 7pm in SA and the NT.\n\nAll states and territories provide for an additional public holiday on December 28 because Boxing Day falls on a Saturday this year.\n\nLabour Day differs between the states. WA will have a public holiday on Monday, March 2, while Vic will have public holiday a week later on Monday, March 9. Queensland will have a day off on Monday, May 4, while the ACT, NSW and SA will have their public holiday on Monday, October 5.\n\nIn the NT, the day is known as May Day and is held on May 4, while in Tas it is called Eight Hours Day and is held on March 9.\n\nTasmania's Labor Day-equivalent Eight Hours Day pays tribute to those who pushed for standard working hours. ( )\n\nAll the states and territories get a King's Birthday public holiday on Monday, June 8, apart from Queensland, which has theirs on Monday, October 5, and WA, which will observe the holiday on Monday, September 28, this year.\n\nBeyond the classics, some states have unique, exclusive days off not shared by other states.\n\nQueensland Queensland's unique public holiday this year is the Ekka holiday, which will fall on Wednesday, August 12. New South Wales NSW has a Bank Holiday on Monday, August 3, but it is not a declared public holiday and only retail bank branches and certain financial institutions are required to close, unless staff voluntarily choose to work. ACT The ACT will get extra holidays for Canberra Day on Monday, March 9, and Reconciliation Day on Monday, June 1. Northern Territory The NT will celebrate Picnic Day on Monday, August 3, and also get a post-7pm public holiday on New Year's Eve. South Australia Adelaide Cup Day gets a Monday public holiday on March 9 in SA. Tasmania Tasmania's public holidays vary throughout the state. Parts of Tasmania will get a day off on February 9 for the Royal Hobart Regatta. Some areas will observe a day off for the Royal Hobart Show on Thursday, October 22, while others will have a public holiday on Monday, November 2, for Recreation Day. Victoria The Friday before the AFL Grand Final is a public holiday in Victoria, with the game held on the last Saturday in September. This year, the public holiday will fall on September 25. There will also be a public holiday for Melbourne Cup Day on Tuesday, November 3. Western Australia WA observes an additional Anzac Day holiday on Monday, April 27, and Western Australia Day on Monday, June 1.\n\nA full list of holidays for each state can be found on the Fair Work website.\n\nHow can you make the most of annual leave?\n\nIf you have annual leave banked up, you may be able to use this in conjunction with public holidays to maximise consecutive days off.\n\nFour days of annual leave in April — 7, 8, 9, 10 — becomes a 10-day break with the Good Friday and Easter public holidays.\n\nCareful planning can turn seven days of annual leave into a 16-day break over the summer holidays. ( )\n\nTaking annual leave on Friday, June 5, leads to a four-day weekend with the King's Birthday on the Monday, except in Queensland and WA.\n\nAnd getting organised in advance for the 2026/27 Christmas season can see seven days of annual leave turned into a 16-day holiday break.\n\nJust take annual leave days off on December 21, 22, 23, 24, 29, 30, and 31.\n\nFor the average full-time worker in Australia with four weeks of annual leave, that will leave you with eight days of annual leave left over.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2026-01-26/history-of-five-islands-nature-reserve-in-nsw-illawarra-region/106050352",
        "title": "Islands rich in history, marine life and debate about their names",
        "publish_date": "Sun, 25 Jan 2026 19:36:35 +0000",
        "category": "entertainment",
        "authors": [],
        "text": "They might be among the best-kept secrets in the Illawarra, but the five islands off Port Kembla on the New South Wales South Coast are rich in both history and marine life.\n\nThey can even inspire some spirited debate about what they should be called.\n\nFor thousands of years, the islands held significant importance for the Wadi Wadi people, who shared stories about their creation through the Dreaming.\n\nGeorge Bass, Matthew Flinders and William Martin battling the storm in the \"Tom Thumb\" off Providential Cove. (Supplied: From the collections of WCL and Illawarra Historical Society. P06573)\n\nBut in the early 1800s, famed explorers George Bass and Matthew Flinders, aboard the Tom Thumb II, charted and named the islands after themselves and their servant boy William Martin.\n\nExcerpt from the Illawarra Aboriginal History Poster, Early Contact Map. (Supplied: Coomaditchie United Aboriginal Corporation)\n\nCobbyr became Flinders Islet, also known as Toothbrush Island.\n\nMunnungang became Bass Islet and Booirodoong, the largest, was renamed Big Island, also called Rabbit or Perkins Island.\n\nThe smaller islets on either side of Booirodoong are called Martin Islet and Rocky Islet.\n\nThe story of five islands\n\nAunties Narelle Thomas and Lorraine Brown are visual artists and elders at Coomaditchie United Aboriginal Corporation. (ABC Illawarra: Sarah Moss)\n\nSisters Narelle Thomas and Lorraine Brown are among those determined to keep the story of the islands alive.\n\nBoth accomplished artists, they created a 21-metre mural to tell the Dreaming creation story of the islands at Hill 60 in Port Kembla.\n\nThe Story of Five Islands, a Dreaming Story book produced by Coomaditchie United Aboriginal Corporation, also tells the tale, including illustrations of the six sisters, Geera, Mimosa, Wilga, Lilli Pilli, Wattle and Clematis, produced by local children.\n\n\"Our tribal people would have probably told this story many times … we do want people to know that there is Dreaming stories in the Wollongong area and we're very proud of this,\" Ms Brown said.\n\nDreaming stories, known as Alcheringa by the Aboriginal people of the Illawarra, explain the creation of land, culture, and laws. (Supplied: Coomaditchie United Aboriginal Corporation)\n\n\"Mount Keira is a woman's area and six sisters lived up there, the six daughters of Oola-boola-woo, the west wind.\"\n\nMs Brown said the creation story detailed what happened to cheeky children who did not do their chores.\n\n\"There was one that was very naughty and very cheeky, and he really had enough of her, so he picked her up on a piece of the mountain and threw her out to sea,\" Ms Brown said.\n\nA 21-metre mural depicts the Dreaming story of Oola-boola-woo and his six daughters at Hill 60 in Port Kembla. (ABC Illawarra: Sarah Moss)\n\nAccording to the story, Oola-boola-woo eventually threw five daughters out to sea, who became the five islands of Port Kembla.\n\n\"It's a beautiful Dreaming story, even though he blew them out to sea,\" Ms Brown said.\n\n\"Eventually, the daughters turned into mermaids that swim around the islands.\n\n\"The daughter left up there was Geera, and she sat on the mountain until she was covered by leaves and moss, becoming the top of the mountain, which is now Mount Kiera.\"\n\nBirds, seals and penguins\n\nNathalie Simmonds takes tours around Five Islands Nature Reserve. (ABC Illawarra: Sarah Moss)\n\nThe islands also boast a rich array of marine life.\n\nNathalie Simmonds, Abyss Project director and University of Wollongong PhD candidate, is studying marine biology in intertidal protected areas. She also conducts tours of the Five Islands Nature Reserve.\n\n\"Of all the islands, there is only one which is actually an island, which is Big Island, so the rest are islets, which means that it's not large enough to support human life,\" she said.\n\n\"Extensive studies have been undertaken about the wildlife that lives on each island, and where they hold both national and international significance.\"\n\nNamed after navigator Matthew Flinders, this islet's Aboriginal name is Cobbyr. (ABC Illawarra: Sarah Moss)\n\nCobbyr, or Flinders Islet, is dominated by an intertidal zone.\n\n\"It's rocky around the edges and supports the vulnerable sooty oystercatcher as its preferred habitat,\" Ms Simmonds said.\n\nThe furthest from shore is Munnungang or Bass Islet, also a rugged intertidal zone.\n\nTourists are drawn to the spectacle of south coast seals, which sleep in packs by the water's edge. (ABC South East NSW: Floss Adams)\n\nMartin Islet is home to a bachelor seal colony.\n\n\"We are starting to see a change in the population on Martin Islet, with females in the last year starting to colonise during the July winter months,\" Ms Simmonds said.\n\nA pelican colony on Big Island, also known as Booirodoong. (ABC Illawarra: Justin Huntsdale)\n\nBooirodoong, or Big Island, is the largest of the islands where the majority of bird species live, including a colony of pelicans.\n\n\"Come September, the island is completely covered with migratory sea birds such as white-bellied sea eagles and our shearwaters. It's also an important habitat for the little penguin,\" Ms Simmonds said.\n\n\"Rocky Islet is the smallest of the five islands, and will occasionally have a seal or two, and of course, migratory sea birds,\" she said.",
        "source": "ABC"
    },
    {
        "url": "https://www.smh.com.au/lifestyle/health-and-wellness/are-you-ageing-well-try-these-4-simple-tests-to-find-out-20260123-p5nwgv.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Are you ageing well? Try these 4 simple tests to find out",
        "publish_date": "Mon, 26 Jan 2026 13:31:23 +1100",
        "category": "lifestyle",
        "authors": [
            "Dana G. Smith"
        ],
        "text": "Advertisement\n\nLifestyleHealth & wellnessAgeing Are you ageing well? Try these 4 simple tests to find out Dana G. Smith January 26, 2026 — 1:31pm Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share A A A\n\nTake a minute to consider the last decade of your life. What type of physical shape do you hope to be in? And what are the activities you want to be able to continue doing? While there’s no crystal ball to predict your future health, there are a few basic tests you can give yourself to gauge your current strength, power, cardiovascular fitness and balance — all of which will influence your physical abilities going forward. These kinds of tests have been associated with longevity and independent living. They’re also proxies for activities that many people want to be able to do in old age, like getting down on the floor to play with grandchildren or travelling and exploring a new city by foot. These 4 basic tests give you a great indication of how you’re ageing. Getty Images It’s never too early to begin training for your later years, said Stuart Phillips, a professor of kinesiology at McMaster University in Ontario. People naturally lose strength and muscle mass with age, so you want your starting point to be as good as possible. Getting a head start on training is “money in the bank,” Phillips said. It’s also never too late to improve your physical abilities, he added: “We’ve got data showing that nonagenarians, so people in their 10th decade of life, or in their 90s, can make gains in strength and function with just a little bit of even light activity.”\n\nAdvertisement\n\nTry these four tests to determine where you currently stand. If you don’t perform as well as you might have hoped, don’t worry: A few strength, conditioning and balance exercises, done regularly, can help you improve your score on each one. Editor's pick Fitness The goal posts for a longer, healthier life are closer than you think 1. Sitting-Rising Test The goal with this assessment is to go from standing to sitting on the floor, and back up again, using the least amount of support as possible. The test is scored on a 10-point scale — five points for sitting down and five points for standing up — and you lose a point for every hand, knee or other body part you use to help yourself. Subtract a half point if you’re unsteady or lose your balance. Adults in their 30s and 40s should aim for a perfect 10, said Dr. Claudio Gil Araújo, the dean of research and education at the Exercise Medicine Clinic in Brazil, who developed the test. Anyone over 60 who gets an 8 is “in very good shape,” he said.\n\nAdvertisement\n\nThe test evaluates strength, power, balance and flexibility. Araújo has also shown it’s a predictor of mortality. A recent study of his looked at more than 4,000 adults age 46 to 75 and found that, over the course of 12 years, the people who scored 4 or below on the sitting-rising test had death rates nearly four times higher than those who scored a 10. He said that was primarily because people with low scores were at a higher risk for falls. 2. Walking speed assessment How fast someone walks at their normal gait is “a very important indicator of functional ability and vitality,” said Jennifer Brach, a professor of health and rehabilitation sciences at the University of Pittsburgh. “It is predictive of future decline; it’s predictive of mortality, nursing home placement, disability, a whole host of different things,” she said. To assess your walking speed, measure out 4 meters, or about 13 feet, on a straight, flat surface, and time how long it takes you to cover the distance. (Remember, you’re walking at your normal speed, not as fast as you can.) People of all ages should aim for a gait of at least 1.2 meters per second, a little over three seconds total. Brach recommended people retest themselves every few months. “If the value changes, that can be a warning sign,” she said. That’s because while walking feels like a simple task, it requires proper functioning of the cardiovascular, musculoskeletal, vestibular (balance), sensory and nervous systems. A slower gait could indicate that there’s a problem in any one of those systems that may need to be investigated and addressed.\n\nAdvertisement\n\n3. Grip strength test Related Article Nutrition Can we call butter and beef tallow ‘healthy fats’? Grip strength is also related to mortality. While that connection may seem far-fetched, experts say a grip strength test serves as a helpful indicator for how active a person is in their daily life. “When you’re using your hands more, it’s probably because you’re doing things more,” said Cathy Ciolek, president of the American Physical Therapy Association Geriatrics. “You’re carrying groceries, you’re opening the car door, you’re picking up a grandchild.” All of those things work your hands, she said, and the more you do them, the better your grip strength. Grip strength is also important for maintaining independence with household tasks like cooking. (Think about pulling a heavy dish out of the oven.)\n\nAdvertisement\n\nA doctor or physical therapist typically assesses grip strength using a special device called a dynamometer. To test yourself at home, try walking for 60 seconds while holding a heavy weight in each hand (also known as a farmer’s carry), suggested Dr. Nima Afshar, a physician at concierge medical practice Private Medical. Start with lighter weights and work your way up to heavier ones over time. If you experience hand or body pain, stop. There aren’t age-related norms for the farmer’s carry like there are with a dynamometer. But Afshar said a 45-year-old man should aim to carry two 60-pound dumbbells, a 65-year-old two 40-pound dumbbells and an 85-year-old two 25-pounders. For a woman at those ages, goal weights are 40 pounds, 25 pounds and 15 pounds in each hand. 4. Single-leg stand Just as strength naturally declines with age, so does balance. And that raises the risk for falls — a major cause of injury and death in older adults. Testing one’s balance is as simple as standing on one leg. Adults should aim for a minimum of 10 seconds on at least one side. For an added challenge, Afshar recommended attempting the test with your eyes closed.\n\nAdvertisement\n\nAccording to a study Araújo published in 2022, 20% of adults age 51 to 75 were unable to make it to 10 seconds. And those individuals had an 84% higher chance of dying in the next seven years, possibly because they were unhealthier at the start of the study. “You can’t predict an individual’s precise mortality” with these types of tests, Afshar said. But if you’re below average on any of them, it’s likely you won’t fare as well long term. That said, he added, all of these metrics — strength, fitness, balance — can be improved, and as you improve, your risk of dying soon goes down. The New York Times\n\nSave You have reached your maximum number of saved items. Remove items from your saved list to add more. Share More: Ageing\n\nHealth\n\nWellbeing",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/soccer/alen-stajcic-was-just-sacked-but-his-oam-days-later-says-much-more-20260125-p5nwsy.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Alen Stajcic was just sacked – but his OAM days later says much more",
        "publish_date": "Mon, 26 Jan 2026 13:31:00 +1100",
        "category": "sports",
        "authors": [
            "Emma Kemp"
        ],
        "text": "Resilience is something Stajcic has always tried to teach his players – and there have been many over two and a half decades. From his national teams (Matildas, Young Matildas, Philippines) and clubs (Sydney FC Women, Central Coast Mariners Men, Perth Glory Men, Wanderers Men) and, right at the start, the NSWIS Women’s Football Program, through which he nurtured the Matildas’ golden generation. Resilience is also a muscle he has been forced to flex during some low periods so severe – namely his Matildas sacking and all the erroneous innuendo accompanying it – it’s perplexing to the outsider he did not give coaching away completely and start fresh as a landscaper or diving instructor, or literally anything else unrelated to football. Loading “I don’t know, I just love the game,” he reasons. “It’s the one thing I can thank my parents for, and especially my father, who sacrificed everything for me to play the game and follow my dreams within the game. They came to Australia as immigrants from Yugoslavia without a word of English or a cent to their names, and gave me and my brother everything they could. Football was one of the things that they gave us. “We’re lucky that this country gives you the opportunity to go through the ranks. As a first-generation Australian, to be able to go from immigrant parents without a cent to their name to coaching a country is pretty special. And little things like being the first Australian-born coach to win a game at a World Cup – and having three wins now at a World Cup – make it special, and more recognition for the sacrifice everyone put in for you to be able to follow your dreams.\n\n“So this is probably more recognition for my family than for me. My mother and father, and my wife and my kids, who have sacrificed the most out of everyone.” Careful, because this is not a eulogy. Stajcic is only 52 and still very much a coach, albeit one out of work (“Just hanging in there,” he laughs). But the past is what earned him this rare honour, bestowed on only a handful of Australian coaches. Matildas players listen to direction from Stajcic in 2018. Credit: Getty Images “Especially in women’s football,” he says. “I started off on the journey when everyone thought it was uncool – the poor cousin of the poor cousin. Being disregarded and discriminated against, and not thought of or cared about by pretty much everyone in administration. I was warned off going down that field, but it didn’t bother me really. I just loved the game, and anyone who loved the game I was happy to share my time with. “To think of the things we had to go through at the NSW Institute of Sport, just to get a training field and gear and women’s-sized clothing, and revenues and resources for the team. It was a pretty amazing ride. And to think about the talent ID – of finding those players from all around NSW and Australia, and how the group sort of grew up together and has become the golden generation. That probably gives me the greatest joy and pride, to see how we all evolved together as coaches and players, and went from virtually nothing to – for me – becoming probably the best team in the world.”\n\nIn 2017, the Matildas reached a record high FIFA ranking of No.4, behind No.3 England, No.2 Germany, and long-time leaders the United States. It was in July of that year that Australia first beat the US – a major milestone in Seattle after 26 fruitless attempts. Sam Kerr, Steph Catley and their contemporaries of 2023 World Cup fame were in the early 20s. With retired Matildas goalkeeper Lydia Williams. They almost repeated that 1-0 Tournament of Nations triumph at the 2018 edition (during which a 15-year-old Mary Fowler made her senior international debut against Brazil) but for an injury-time equaliser in Connecticut. Still, Megan Rapinoe shook Stajcic’s hand after that game and, in a casual chat, gave her former Sydney FC coach the impression that her all-conquering US team were wary of Australia leading into the 2019 World Cup. This evidence, on the back of finishing runners-up at April’s Asian Cup in Jordan, was enough for Stajcic to believe his Matildas were genuine World Cup contenders. Seven months later he was at the centre of one of the most controversial dismissals in Australian football history. “It hurt my soul,” he remembers. Then he repeats it. “It hurt my soul.”\n\nThe personal trauma was compounded, he says, by the knowledge he’d been offered the highly lucrative England head coaching job (China came knocking too), but turned it down. “For four or five times the money, all the resources, they told me they were going to host the [2022] Euros, everything,” he says. “I knocked it back and then Phil Neville took it after me. I wanted to stay with Australia for the [2019] World Cup … and 12 months later I got sacked. I always said I’m not going to be that loyal ever again, but then I do it again. And again.” Alen Stajcic’s magic touch set up the Central Coast Mariners for success. Credit: Getty Images Perhaps such loyalty is part of the reason he is now an OAM? “Not sure, to be honest,” is his answer, but he does know he possessed a “willingness to fight and fight back”. Three months later he was hired as Central Coast’s caretaker coach, then permanent coach, and in early 2021 oversaw the Mariners’ first back-to-back A-League Men wins since December 2017. The competition’s laughing stock had transformed into table-toppers. Western United’s coach at the time, Mark Rudan, called him “a magician, as far as I’m concerned”. “There’s no magic,” Stajcic said pragmatically. “The magic is hard work.”\n\nIn late 2021, when was appointed head coach of the Philippines – he went on to qualify the nation for its first Women’s World Cup and they made their debut in the 2023 tournament with a win over co-hosts New Zealand – and handed the reins to assistant and club great Nick Montgomery, the foundations were laid for back-to-back championships, a premiership and an AFC Cup. “Now six or seven of those guys have played [for the] Socceroos – from a team that, when I took over in 2019, had won one game out of 21 – and are now in contention for this next World Cup,” Stajcic says. Stajcic with his Philippines coaching staff. Credit: Reuters “That was a really massive highlight for me – knowing I could do it in men’s football as well and achieve so much. It was an unknown really. I had coached elite boys from 12 to 18 for 10 years as well. But coaching a professional men’s team? That was something that I had to learn. “But the longer I went on the more I realised, especially as society as well has evolved, I think the genders have come closer together. And especially the younger generation who’ve grown up with phones and social media and all those kinds of things. So the problems they face and the dilemmas they have are more closely aligned with each other.”",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/tennis/woodbridge-demon-playing-his-best-tennis-yet-20260126-p5nx1u.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Woodbridge: Demon playing his best tennis yet",
        "publish_date": "Mon, 26 Jan 2026 13:29:05 +1100",
        "category": "sports",
        "authors": [],
        "text": "Woodbridge: Demon playing his best tennis yet\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/tennis/australian-open-2026-live-updates-inglis-great-swiatek-test-all-aussie-showdown-in-doubles-sinner-keys-chase-title-defences-20260125-p5nwv9.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Australian Open 2026 LIVE updates: Pegula ousts champ Keys; Kubler, Polmans win all-Aussie clash; Inglis in Swiatek test; Sinner chases second crown",
        "publish_date": "Mon, 26 Jan 2026 13:28:11 +1100",
        "category": "sports",
        "authors": [
            "Hannah Kennelly",
            "Scott Spits"
        ],
        "text": "There’s no doubt that Tennis Australia chief executive Craig Tiley has his hands full this year.\n\nIn the midst of the Australian Open, Tiley has been the subject of unrelenting speculation over his future (suggesting he is in the frame to run the US Open), and is facing a star-studded player push for better pay and conditions.\n\nAll par for the course, you could say, given the administrative stalwart’s pay packet.\n\nCraig Tiley with Stan Wawrinka following the Swiss player’s final Australian Open match on Saturday. Credit: Getty Images\n\nTiley topped the Australian tennis governing body’s executive payroll in the organisation’s most recent tax filings in the US, raking in a modest $US1.2 million ($1.7 million). We say modest because, just a year earlier, he received almost double that amount.\n\nTennis Australia would have it be known that these filings don’t offer the full picture, once you factor in variances in reporting periods between Australia and the US, foreign currency fluctuations and other accounting quirks.\n\nLoading\n\nWhich is all to say, bonuses and other payments can fall between reporting cycles, explaining Tiley’s dip in compensation.\n\nStill, if the numbers are good enough for US regulators, they’re good enough for Open Season!\n\nAnd if the most recent filing is any indication, life at Tennis Australia doesn’t look bad at all.\n\nThe organisation declined to comment.\n\nTimothy Jolley, the organisation’s chief strategy and performance officer, had reportable compensation of $US765,646 ($1.1 million). The figure for Tennis Australia’s chief commercial officer, Cedric Cornelius, was $US608,657 ($882,751), the organisation reported, while chief operating officer Thomas Larner didn’t do too badly either, rounding out the fat cats with $US502,825 ($729,260).\n\nUS Open and Wimbledon champion Lleyton Hewitt, who is also Tennis Australia’s Davis Cup captain, took in $US287,114 ($416,408), down a touch on what he made the previous year.\n\nTodd Woodbridge, meanwhile, wasn’t listed on the filing at all. Rest assured, though, we hear he remains on the books for his ambassadorial duties.\n\nLleyton Hewitt. Credit: Getty Images\n\nThese figures and more are contained in what is known as a 990 filing, which Tennis Australia filed with the US Internal Revenue Service last August, for the 12 months to 30 September 2024.\n\nRead more in our Open Season column here.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/western-australia/where-to-watch-australia-day-fireworks-across-wa-20260126-p5nx1y.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Where to watch Australia Day fireworks across WA",
        "publish_date": "Mon, 26 Jan 2026 13:24:42 +1100",
        "category": "entertainment",
        "authors": [
            "Michael Philipps"
        ],
        "text": "Advertisement\n\nNationalWAWhat’s on Where to watch Australia Day fireworks across WA Michael Philipps January 26, 2026 — 1:24pm Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share A A A\n\nWestern Australians will have the opportunity to celebrate Australia Day with a bang with several fireworks displays set to light up the sky across the state. Australia Day fireworks over the City of Perth City of Perth The City of Perth is planning its annual Australia Day spectacular, with festivities kicking off at Langley Park from 3pm with a multicultural zone, carnival rides and sideshow alley. A freestyle motocross and BMX stunt show will add to the family-friendly entertainment before a sky-dive display. The official light show, featuring fireworks and drones, expected to kick off at 8.30pm, although exact times will depend on wind and light factors.\n\nAdvertisement\n\nCity of Perth Lord Mayor Bruce Reynolds said the Australia Day activities provided an opportunity for the community to come together to reflect, respect and celebrate Australia’s rich and diverse culture. “Australia Day is a chance to gather in the heart of our city, enjoy a beautiful summer’s day by the river, and reflect on the many stories, cultures and shared values that shape our country,” he said. “We encourage everyone to make their way into the city to enjoy a vibrant mix of cultural experiences, live performances, entertainment, rides and international cuisine. “Bring your friends and family, set up for the day along the Derbarl Yerrigan (Swan River), and come together to watch the sky light up as we celebrate the city and lifestyle we know and love.” Last year’s fireworks display were a hit. City of Perth\n\nAdvertisement\n\nSouth of the river, the City of Armadale will host a fireworks display set to begin Minnawarra Park at around 8.30pm as part of its celebrations. Families are also expected to gather along the foreshore when the City of Rockingham begins its fireworks display from the Val Street Jetty at 8.30pm. Further south, the City of Bunbury will present its SkyFest along the Koombana Bay foreshore with the night sky also set to light up at 8.30pm. In the north of the state fireworks displays are also set for the Cue Sports Oval on Wittenoom Street and along the Geraldton Breakwater foreshore at 8.30pm. Kalbarri and Port Hedland firework shows are set to begin at 8pm at Gantheaume Bay and Marie Marland Reserve respectively, while Karratha’s Australia Day spectacular will begin at 8.15pm over The Esplanade.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/tennis/defending-champ-knocked-out-by-podcast-pal-20260126-p5nx2b.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Defending champ knocked out by podcast pal",
        "publish_date": "Mon, 26 Jan 2026 13:23:34 +1100",
        "category": "finance",
        "authors": [],
        "text": "Defending champ knocked out by podcast pal\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/queensland/lone-pine-koala-sanctuary-keeps-animals-cool-amid-heatwave-20260126-p5nx24.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Lone Pine Koala Sanctuary keeps animals cool amid heatwave",
        "publish_date": "Mon, 26 Jan 2026 13:19:30 +1100",
        "category": "finance",
        "authors": [],
        "text": "Remove items from your saved list to add more.\n\nYou have reached your maximum number of saved items.\n\nSave this video for later\n\nAdd videos to your saved list and come back to them anytime.\n\nGot it",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/tennis/think-demon-doesn-t-have-the-weapons-to-beat-the-best-think-again-20260125-p5nww6.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Reckon Demon doesn’t have the weapons to beat the best? Think again",
        "publish_date": "Mon, 26 Jan 2026 13:05:12 +1100",
        "category": "sports",
        "authors": [
            "Marc Mcgowan"
        ],
        "text": "A glass ceiling has always hung above Alex de Minaur’s tennis career – but not of his doing.\n\nThere is an obsession with listing everything that de Minaur is not, and what he supposedly never will be. The problem for those repeatedly doing so, even as he continues to smash through, is that the man known as “Demon” takes great joy in proving his many critics wrong.\n\nAlex de Minaur celebrates his fourth-round win over Alexander Bublik at the Australian Open on Sunday night. Credit: AP\n\n“I know that there are a lot of people who don’t think I can do it,” de Minaur said a few nights back.\n\nThe world No.6 has never prescribed to the theory that it is counterproductive to be motivated by others. He accepts fuel from wherever he can get it, but is undoubtedly overflowing with self-motivation, too.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/afl/afl-boss-jets-off-to-india-with-lofty-goals-20260126-p5nx1w.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "AFL boss jets off to India with lofty goals",
        "publish_date": "Mon, 26 Jan 2026 13:03:30 +1100",
        "category": "finance",
        "authors": [],
        "text": "AFL boss jets off to India with lofty goals\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/queensland/possible-thunderstorm-to-cap-off-brisbane-s-hottest-australia-day-in-27-years-20260126-p5nx0b.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Possible thunderstorm to cap off Brisbane’s hottest Australia Day in 27 years",
        "publish_date": "Mon, 26 Jan 2026 13:02:44 +1100",
        "category": "finance",
        "authors": [
            "Dominique Tassell"
        ],
        "text": "Advertisement\n\nNationalQueenslandExtreme weather Possible thunderstorm to cap off Brisbane’s hottest Australia Day in 27 years Dominique Tassell January 26, 2026 — 1:02pm Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share A A A\n\nBrisbanites are sweltering through a near-40 degree Australia Day, with the possibility of another storm in the evening. At its peak, the temperature would be up to 8 degrees above average – at 36 to 37 degrees – in Brisbane, the Bureau of Meteorology’s Shane Kennedy said. People try to keep cool at South Bank, as Brisbane cops a 38-degree Australia Day. Brittney Deguara/Brisbane Times Residents in Ipswich were facing up to 39 degrees, while further west the temperature was expected to exceed 40 degrees. “It could be a pretty warm night still, but tomorrow we’ll have a southeasterly wind change,” Kennedy said.\n\nAdvertisement\n\n“[We’re] expecting that it’ll drop the afternoon temperatures back down to the low 30s, so close to average, and it should stay around those low 30s for the rest of the week.” Heatwave conditions were expected further inland for the rest of the week, with temperatures of 11 to 12 degrees above average expected through the week. Related Article Extreme weather Brisbane set for hottest Australia Day in 27 years A thunderstorm could be on the way for Brisbane on Monday afternoon, with the possibility of similar damaging winds to Sunday night’s storm. “It’d be more likely in the western suburbs and further west, so well inland, but still is around that 10 per cent chance of storms making it to the CBD today.\n\nAdvertisement\n\n“A positive effect of the thunderstorms is that it really cools conditions overnight. That’ll be a big blessing if we get some storms later [on Monday]. “It’s good for the temperatures, but potential to do a little bit of wind damage.” About 220,000 lightning strikes were recorded across the state’s south-east during storms on Sunday evening. Strikes on the power network contributed to about 13,600 homes and businesses losing power, with 450 customers affected at 8am on Monday. By 11am, this had reduced to just 66 customers, in Ashgrove and Hendra. No heat-related outages have been reported.\n\nAdvertisement\n\nStaff at Lone Pine Koala Sanctuary were working hard to ensure animals were kept cool in the heat. “During hot days, dingoes and Tasmanian devils can walk through or lie down in their ponds to cool off,” said Rebecca Bain, the head of mammals at Lone Pine. Loading “Keepers might also wet down dirt or sand areas to offer them a cooler place to rest on. ‘Bloodcicles’ [blood ice blocks] can also be a yummy way to help them cool down. “Flying foxes can use their wings as fans to help cool themselves down in hot weather. We also offer them showers on hot days – the water can cool the flying foxes down as well as the surrounding environment. They can then lick the water off themselves and nearby branches if in need of a drink.”\n\nAdvertisement\n\nLone Pine is open on Australia Day, though visitors are unlikely to see the wombats. “They tend to retreat underground in burrows during warm days – it is up to several degrees cooler down there,” Bain said. Start the day with a summary of the day’s most important and interesting stories, analysis and insights. Sign up for our Morning Edition newsletter.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/tennis/tensions-flare-as-umpire-misses-let-call-20260126-p5nx1v.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Tensions flare as umpire misses let call",
        "publish_date": "Mon, 26 Jan 2026 13:02:28 +1100",
        "category": "sports",
        "authors": [],
        "text": "Tensions flare as umpire misses let call\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/tennis/alcaraz-device-drama-angers-greats-20260126-p5nx1p.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Alcaraz device drama angers greats",
        "publish_date": "Mon, 26 Jan 2026 12:58:08 +1100",
        "category": "finance",
        "authors": [],
        "text": "Alcaraz device drama angers greats\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/tennis/alcaraz-device-drama-angers-greats-20260126-p5nx1l.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Alcaraz device drama angers greats",
        "publish_date": "Mon, 26 Jan 2026 12:54:02 +1100",
        "category": "finance",
        "authors": [],
        "text": "Alcaraz device drama angers greats\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/world/north-america/icu-nurse-alex-pretti-honored-in-video-salute-to-veteran-after-being-fatally-shot-in-minneapolis-20260126-p5nx1j.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "ICU nurse Alex Pretti honored in video salute to veteran after being fatally shot in Minneapolis",
        "publish_date": "Mon, 26 Jan 2026 12:50:46 +1100",
        "category": "finance",
        "authors": [],
        "text": "Remove items from your saved list to add more.\n\nYou have reached your maximum number of saved items.\n\nSave this video for later\n\nAdd videos to your saved list and come back to them anytime.\n\nGot it",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/tennis/commentators-stunned-by-disastrous-keys-sight-20260126-p5nx18.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Commentators stunned by 'disastrous' Keys sight",
        "publish_date": "Mon, 26 Jan 2026 12:22:23 +1100",
        "category": "finance",
        "authors": [],
        "text": "Commentators stunned by 'disastrous' Keys sight\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.sbs.com.au/news/article/australia-day-2026-migrants-share-what-it-means-to-be-australian/1d49znyhq",
        "title": "What does it mean to be Australian? We asked these migrant Australians",
        "publish_date": "Sun, 25 Jan 2026 22:50:44 +0000",
        "category": "finance",
        "authors": [],
        "text": "How Australians choose to spend their day on 26 January can vary greatly. It's a date that sparks mixed feelings and carries different meanings for different communities.\n\nFor some, it's a day of celebration; for others, it's a historical day of mourning.\n\nWith almost a third of the population born overseas — an estimated 8.6 million, according to the Australian Bureau of Statistics — Australia is one of the most multiculturally diverse countries in the world.\n\nHowever, this Australia Day comes at a time of heightened social tension, with recent data showing national belonging is at its lowest levels in more than a decade.\n\nDespite this, support for multiculturalism remains high, according to ANU's 2024 Mapping Social Cohesion report.\n\nFor many migrant Australians, 26 January remains an important milestone: the day they became Australian. This year, 20,600 people from over 150 countries will make their citizenship pledge as part of Australia Day events around the country, joining the more than six million people who've become citizens since the first ceremonies were held in 1949.\n\nTo mark the date, SBS News has spoken with five migrant Australians from India, South Sudan, Israel, China and Italy about what the day — and being Australian — means to them.\n\nFrom tasting Vegemite to quiet reflection\n\nKaran Raina came to Australia from India back in 2013 as a master's student, chasing a fresh start and a chance to build his career in a place \"known for its lifestyle and opportunity,\" he tells SBS News.\n\nRaina described his first experience of Australia Day in 2014 as a \"welcome to the club moment\".\n\n\"Coming from overseas, the concept of a BBQ and a day at the beach was the quintessential Aussie experience I heard the most,\" he says.\n\nKaran Raina's first Australia Day was spent at the local park, trying Vegemite for the first time. Credit: Supplied\n\n\"I joined in by heading to the local park with some fellow students, trying Vegemite for the first time, and just soaking up the sun and the relaxed atmosphere.\"\n\nAfter 10 years in Australia, Raina says his January 26 plans are quieter and more reflective.\n\n\"I usually use the public holiday to relax, catch up with close friends and reflect on how far I've come since I first arrived with just a couple of suitcases in 2013.\"\n\nIt's less about the big party and more about appreciating the peaceful life I have here.\n\nThis year, he is also reflecting on his \"dual identity\" as a migrant.\n\n\"Even when things feel tense in the news or the media, I focus on the reality of my day-to-day life ... For me, being Australian is about the contribution I make every day.\"\n\n'This country is built by immigrants'\n\nChef Luca Quadri came to Australia from Italy in 2015. Eight years later , he became a citizen.\n\n\"I was already a chef, so for me, it was a little bit easier because I could get a sponsor, or I could get a skill visa through my skills as a chef,\" he tells SBS News.\n\nA decade after arriving, Quadri says he feels he is part of Australia now.\n\n\"I feel like I have two homes, one in Australia and one in Italy.\"\n\nLuca Quadri says he now has two homes in Australia and Italy. Credit: Supplied\n\nDespite recent social tensions in Australia, partly driven by a spate of anti-immigration rallies, Quadri says he is unfazed, choosing to ignore the rhetoric.\n\n\"I don't believe they're [rallies] important because this country is built by immigrants. So I think they're just people that don't understand how this country works and how we arrived here.\"\n\nThe first time he heard about 26 January was from a coworker, who told him: \"It's Australia Day tomorrow, we're going to celebrate.\"\n\n\"As an immigrant here, I don't have [strong feelings about the date]. I just think that if it's just a day when we celebrate Australia and as a country and we all get together ... it should be celebrated.\"\n\nListening to First Nations voices\n\nBorn in South Sudan, Andrew Gai is a family violence prevention practitioner and community advocate. He arrived in Australia in 2006 under the humanitarian visa program, and became a citizen in 2009.\n\nBefore then, Gai says he had never celebrated a country's national day, and at first, he celebrated Australia Day passionately, but stopped after learning what the date represents for First Nations people.\n\n\"My community association used to organise youth and family fun days ... We stopped organising this event,\" he says.\n\n\"Recently, a couple of young people asked me if we were doing Australia Day event again and I said 'sadly no' and explained to them why and they understood.\"\n\nAndrew Gai no longer celebrates on 26 January after learning about the \"pain attached to this date\" for First Nations. Credit: Supplied\n\nIt's a day that requires sensitivity and the acknowledgment of historical injustices, he tells SBS News.\n\n\"Australia Day cannot be approached as business as usual,\" he says.\n\nWe can participate in national celebrations while also acknowledging the pain attached to this date and listening to the voices of First Nations peoples.\n\nGai is proud of his South Sudanese heritage, while at the same time, expresses gratitude for being Australian. He says seeing the recent anti-immigration rallies, including those planned for today, is disappointing.\n\nBut he believes \"we are more united as Australians than what we hear in the media\".\n\n\"I call these rallies un-Australian as they carry divisive and racially motivated agenda,\" Gai says.\n\n\"With exception of the First Nations peoples, we all came on different journeys, and all have very unique stories, but we all call Australia home now and no one should be made to feel like they don't belong here.\"\n\nPride despite division\n\nPhysiotherapist Gil Jelin and her husband moved to Australia from Israel in 2017.\n\n\"We always wanted to try living overseas, and in my last year of studies in Israel, I came to Australia to learn from a physio, that blew my mind ... I decided I wanted to continue to work with him and it pushed us to immigrate,\" she tells SBS News.\n\nGil Jelin believes the country is \"as divided as it's ever has been\" since she arrived in 2017 from Israel. Credit: Supplied\n\nBut as a Jewish migrant, Jelin says she \"doesn't feel great\" being an Australian at the moment, especially in the wake of the 14 December Bondi terror attack .\n\n\"I feel that right now it's as divided as it has ever been in the past eight years,\" she says.\n\n\"So much hate, politics, people who think they know you or what you've been through. Feeling like the government doesn't take antisemitism seriously enough ... So, not a walk in the park.\"\n\nHowever, this Australia Day, Jelin plans to spend time with her family and friends.\n\n\"[We'll] cheers our beers by the pool and enjoy the luxuries and privileges we have to be Australian.\"\n\n\"We love this country and we are proud to be a part of it and celebrate this day,\" she says.\n\nMoving forward, not backward\n\nOriginally from China, Felix Dong moved to Australia as a student in 2011 to complete his university studies. He was granted permanent residency and later became a citizen in 2023.\n\n\"We are not allowed dual citizenship [in China], so choosing Australian citizenship means giving up many legal and practical ties to our country of origin ... It also means returning to China in the future involves visas and additional barriers,\" he tells SBS News.\n\n\"I feel proud of becoming an Australian ... and I believe Australia's success as a multicultural country comes from strong legislation and genuine implementation.\"\n\nI still believe strongly in the Australian multicultural model, even during times of tension.\n\nOver the years, Dong has spent Australia Day like many other public holidays — occasionally attending community activities or taking a break.\n\n\"Like many international students, my early understanding was quite limited. Occasionally, I attended community events, but it did not initially carry a deep personal meaning for me.\"\n\n\"The most meaningful Australia Day experience for me was the year I became a citizen. That was the first time the day felt truly significant on a personal level,\" Dong says.\n\nREAD MORE A love letter to Australia's old school Chinese restaurants\n\nDong says he was touched to learn the meaning behind certain Australian iconography — such as the kangaroo and emu, which can't easily move backwards — symbolising a nation moving forward.\n\n\"This kind of shared belief is what brings people together across race, age and background.\"\n\nThis story was produced in collaboration with SBS Italian.\n\nFor the latest from SBS News, download our app and subscribe to our newsletter.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/australia-day-honours-revealed/9nyrl05so",
        "title": "Australia Day honours revealed",
        "publish_date": "Sun, 25 Jan 2026 13:05:00 +0000",
        "category": "finance",
        "authors": [],
        "text": "Listen to Australian and world news and follow trending topics with SBS News Podcasts.\n\nTRANSCRIPT\n\nSatwant Singh Calais was 16 years old when he fled from the deadly race riots in Malaysia in 1970.\n\nArriving in Hobart, alone, he had to navigate a new way of life; his family remaining in the southeast Asian country.\n\nThese early experiences ignited his altruism.\n\nWhile at university, Mr Calais created a service to help others resettling in Australia.\n\n“What we found was that a lot of them was lost when coming to a new nation, they had huge issues of culture, food, communication.'\n\nHe was inspired to found Sikh Youth Australia, now in its 26th year - earning him a Medal of the Order of Australia.\n\nThe volunteer-run group delivering programs and events across the country, nurturing and empowering youth to be proud of their heritage... while supporting them in adapting to life in Australia.\n\nMr Calais says the honour is for everyone who has supported the organisation.\n\n“Australia is a very fortunate, lucky, lovely country here. It's got a lot to give and we've got to give back to its development. It's social cohesion.'\n\nFor OAM recipient Trun Dzung Le a sense of belonging began with opportunity.\n\nMoving from Vietnam in 1982, Mr Le said he spent two years in a refugee camp before settling in Melbourne with his family.\n\n“At that time there were about 10,000 people in that camp. And we were lucky, we had UNHCR they looked after us.’\n\nMr Le went on to found the Hollywood Nails Group, managing nail salons across Victoria which, in turn, helps scores of migrants and refugees through training and employment, providing dignity and stability.\n\nAnd my goal, you know I trying to do something to contribute back to the country Australia. We call Australia home.'\n\nBeyond business, Mr Le's philanthropic reach extends into hospitals, aged-care homes and multicultural organisations.\n\nAlso playing a role in developing the country's first Vietnamese Museum, which aims to preserve refugee stories and celebrate community.\n\nThere's been OAM recognition too in the Top End.\n\nHong-Kong born Dr Felix Ho delivers healthcare to some of Australia's most remote communities.\n\nIn his own time, he shapes the next generation of lifesavers through St John Ambulance.\n\nFrom the age of 13, he's offered a lifetime of service by volunteering for the first aid and emergency response organisation.\n\n“We have 30 per cent of our population being Indigenous or identify as Indigenous, but they account for about 70 per cent of our hospital and health admissions and sometimes more in other areas. And discrepancies between their chronic diseases, their life expectancy is absolutely staggering. I'm so privileged to be able to work within health to make that small little difference.'\n\nDarwin's Francis Ahmat is known as 'Doodle', attributing that accolade to his family.\n\nThe local AFL and rugby league star also helps lead the Council for Aboriginal Alcohol program services.\n\nMr Ahmat says a friend of his asked him to join as a 'favour'.\n\n“30 years looking after people all the alcohol and all all that, someone said how come you last so long, and I said you don't last long unless you enjoy it.'\n\nFor Melbourne neuropsychologist Dr Judy Tang, born to Chinese-Vietnamese parents, her motivation is to help people feel seen fully and authentically.\n\nThrough leadership roles across government and local organisations, she advocates for multicultural and LGBTIQ+ communities, working to ensure mental health services reflect the diverse identities of the people they support.\n\nMs Tang says an OAM honour recognises all the work that goes into volunteering.\n\n“As I went on with education and I started noticing gaps around mental health what was missing in terms of servicing and supporting multicultural communities, there was a growing interest to see how we can support and service those gaps.'\n\nIn Australia's country music capital... a legacy celebrated and honoured.\n\nTamworth's Eddie Whitham passed away last year, but his impact is long-lasting.\n\nSince the late 70s, he had supported migrants, refugees and asylum seekers integrating into their new community.\n\nHis advocacy was instrumental in ending the requirement for temporary visa holders to travel to major cities for medical checks.\n\nAnd for her significant service to the community through social policy, and advocating for diversity and inclusion... Tanya Hosch, the first Indigenous person and second woman to join AFL's executive ranks, is now recognised as a Member of the Order of Australia... or AM.\n\nThe AM recipient says greater education is moving treaty conversations forward.\n\n“We talked about Australia had the first peoples as the oldest living continuous culture on the planet, and I think that's referenced a lot now. And that might be a small thing in itself, but I think it's a significant piece of education that's been absorbed by a lot more Australians. All those conversations are important ones and I think we will always see change even if it takes longer than any of us would like.'\n\nPeople from different walks of life... with a shared ambition of serving their communities.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/australia-day-honours-2026-recipients-full-list/su764vd7f",
        "title": "See the full list: Here's who's been awarded Australia Day honours in 2026",
        "publish_date": "Sun, 25 Jan 2026 11:03:35 +0000",
        "category": "sports",
        "authors": [],
        "text": "Olympic legend Cathy Freeman has been given the nation's highest award for service and is among hundreds recognised in the 2026 Australia Day honours list.\n\nFreeman, a proud Kuku Yalanji woman, has been appointed a Companion of the Order of Australia, recognising her service to athletics and the reconciliation movement, as well as her positive community impact and status as a role model to young people.\n\nThe Olympic gold medallist, who was previously recognised with a Medal of the Order of Australia in 2001, is among 949 Australians awarded honours this year, including former premiers, community champions, and mental health trailblazers.\n\nThe youngest recipient of Australia Day honours is Nicholas Alexander Pearce, a 32-year-old co-founder of HoMie Streetwear Store, which supports young people affected by homelessness and hardship.\n\nThe eldest living recipients are Janina Archabuz and Derrick Hammon, both at age 99, who are recognised for their community service in Melbourne and Canberra, respectively.\n\nCathy Freeman won gold in the 400m at the Sydney Olympic Games in 2000. Source: AAP / Dean Lewins\n\nRecipients are acknowledged across categories: awards in the Order of Australia (General and Military divisions), meritorious awards and recognition for distinguished and conspicuous service in the Australian Defence Force. The general division is based on nominations from the public.\n\n\"As the list so vividly showcases, so many Australians continue to give the best of themselves across many endeavours, in the interest of others,\" said Governor-General Sam Mostyn.\n\n\"It is rewarding to see an increase in the number of awards, which reflects more nominations and recognition of the many Australians who inspire the best in all of us.\"\n\nHere are some key recipients on this year's list.\n\nCompanion of the Order of Australia (AC)\n\nFreeman is among 10 Australians in the general division receiving an AC honour — the highest-ranked award in the Australia Day honours system — including three leading scientists, two former politicians and two chief justices.\n\nLeading cancer epidemiologist, emeritus professor Bruce Konrad Armstrong, has been recognised for \"eminent service to medical research, to environmental and genetic cancer epidemiology, to screening service development, to academia, and to public health administration\".\n\nFormer Queensland premier Annastacia Palaszczuk is also on the list for her \"eminent service to the people and Parliament of Queensland, particularly as Premier, to educational equity, to multiculturalism, and to public health\".\n\nAnnastacia Palaszczuk served as Queensland premier from 2015 to 2023. Source: AAP / Jono Searle\n\nMathias Cormann, who served as finance minister under the Abbott, Turnbull and Morrison governments, has also been recognised with an AC.\n\nCormann is now secretary-general at the Organisation for Economic Co-operation and Development.\n\nOfficer of the Order of Australia (AO)\n\nThis year, 38 people have received AO honours, including former NSW premier Kristina Keneally and former South Australian premier Steven Marshall.\n\nFormer Labor politician Steven Marshall was the South Australian premier between 2018 and 2022. Source: AAP\n\nSeven medical researchers and experts are also on the list, including Dr David Forbes, associate professor David Dossetor, Dr Michael Carr-Gregg and professor Anne Buist for their research on mental health.\n\nMember of the Order of Australia (AM)\n\nFormer Australian Football League (AFL) executive general manager inclusion and social policy Tanya Hosch is one of 160 people in the general division appointed to the Order of Australia this year, for her \"significant service to the community through social policy, and as an advocate for diversity and inclusion\".\n\nHosch was the first Indigenous person and second woman appointed to the AFL executive, and a recipient of South Australian of the Year in 2021.\n\nFormer AFL executive Tanya Hosch has been awarded for her service to communities. Source: AAP / Mick Tsikas\n\nDuring her time at the AFL, she implemented the AFL's enhanced First Nations strategy and was a strong advocate for the AFL's Gender Action Plan.\n\nDuring the Voice to Parliament Referendum in 2023, Hosch was a strong 'Yes' advocate who joined the launch of the campaign just two weeks after a leg amputation.\n\n\"I wanna keep working towards the elimination of racism, [it] does so much damage to not just our community but to us all as a country, to see the country come to greater awareness about its history and accepting how much it still needs to do better,\" said Hosch in an interview with NITV Living Black in 2024.\n\nMedal of the Order of Australia (OAM)\n\nSeveral multicultural leaders are among the 472 people awarded the Medal of the Order of Australia in the general division.\n\nMelbourne-based clinical neuropsychologist Dr Judy Tang has been awarded the OAM for her service to mental health, cultural diversity, equality and ageing.\n\nTang has been a strong advocate for multiculturalism and LGBTIQ+ communities, and has been volunteering to promote and advocate for equality for migrants for over a decade.\n\nDr Judy Tang spends over a decade on championing multicultural and LGBTIQ+ communities. Source: SBS News / Phoebe Deas\n\n\"It's nice to be recognised for all the volunteer work that I've been fortunate enough to contribute to the community and society,\" Tang told SBS News.\n\nIn NSW, Satwant Singh Calais, a prominent Sikh community leader who co-founded Sikh Youth Australia, has also received the OAM.\n\nHe told SBS News that he was surprised and humbled to receive the medal.\n\n\"I think it's not so much a recognition of what I've done, but it's a recognition of a community that actually works together to achieve the same goals that we've achieved over the last few years at Sikh Youth Australia,\" he said.\n\nSatwant Singh Calais is the president and co-founder of Sikh Youth Australia. Source: SBS News / Phoebe Deas\n\nCalais started volunteering for migrant communities while at university, when he noticed many international students in Hobart struggle to engage with local communities.\n\nHe then established the Overseas Student Service at the University of Tasmania, where he collaborated with social workers to offer support and mentoring to newly arrived students.\n\nHe then took the same idea to Sikh Youth Australia,where he wanted to empower young Sikh people to be \"who they are\".\n\n\"It's an honour to do the service,\" he said. \"For a voluntary organisation working for 26 years where we don't get any income from anyone else except for our own participants, it's been a challenge, but it's been a wonderful journey,\" he said.\n\nDr Felix Ho, who won the Northern Territory Australian of the Year, is a recipient of the Medal of the Order of Australia. Source: SBS News / Josh van Staden\n\nIn the Northern Territory, Hong Kong-born medical practitioner Felix Ho has been awarded the OAM, after being named the Northern Territory (NT) Australian of the Year.\n\nHo is known for his decades-long volunteering for St John Ambulance Australia, where he leads the national youth portfolio to support over 3,000 young people aspiring to be the next generation of first responders.\n\nIn a recent interview with SBS News after receiving the NT Australian of the Year award, he looked back on his upbringing as a migrant.\n\n\"I'm an immigrant, and Australia has accepted me and my family for all its faults,\" he said.\n\n\"Now recent events have highlighted some challenging times, especially for Australia as well as around the world,\" he said, encouraging people to show compassion and learn about their neighbours. \"We are all different, but that's what gives us strength.\"\n\nOrder of Australia council says gender balance 'cause for concern'\n\nWhile offering its congratulations to the 680 Australians included in the 2026 Australia Day Honours list, the Council of the Order of Australia said the fact that only 184 of them were women was \"a cause for concern\".\n\n\"The recipients come from all parts of the country and their service, achievements and impact are remarkable. All are deserving of recognition through our nation's honours system for their service to the Australian community,\" it said in a statement sent to media.\n\n\"However, the gender balance of this year's honours list more broadly is both a cause for concern and, the Council hopes, a prompt for community action.\"\n\nIt pointed out that OA honours were the result of public nominations, and this had led to a \"significantly larger pool of nominations for men\" eligible for consideration.\n\n\"Many more nominations are still being received for men than women and the Council must consider the nominations for Australians that are in the system,\" it said.\n\n\"There is no doubt there are as many outstanding women contributing to our communities as there are men,\" the council said, adding that the equal number of men and women appointed Companions of the Order this year was a reflection of that.\n\nThe council urged Australians to nominate more women for the list, saying that the online nomination process was simple and help was available to navigate it.\n\n\"We encourage all Australians to look around their community, their workplaces, and the whole of our society, identify the women, as well as the men, who make a difference and whose impact is profound and nominate them so they can be celebrated through the Order of Australia.\"\n\nFor the latest from SBS News, download our app and subscribe to our newsletter.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/australian-of-the-year-awards-2026-winners-announced/9d1srz3fi",
        "title": "Astronaut and three other 'visionaries' receive Australian of the Year awards",
        "publish_date": "Sun, 25 Jan 2026 09:51:06 +0000",
        "category": "finance",
        "authors": [],
        "text": "Katherine Bennell-Pegg, the first Australian to qualify as an astronaut through the country's space program, has been named Australian of the Year.\n\nThree other winners were announced at the National Arboretum in Canberra on Sunday: dementia treatment pioneer Professor Henry Brodaty AO as Senior Australian of the Year, ultra-marathon runner and charity champion Nedd Brockmann as Young Australian of the Year, and Indigenous construction leader Frank Mitchell as Australia's Local Hero for 2026.\n\nNational Australia Day Council CEO Mark Fraser AO CVO said all four recipients were \"visionaries\".\n\n\"Their motivations and goals go far beyond their own interests and achievements. Rather, they are driven by outcomes which benefit others,\" he said in a statement provided to the media.\n\nRead more about all four winners below.\n\nAustralian of the Year: Katherine Bennell-Pegg\n\nFrom an early age, Bennell-Pegg says she dreamed of becoming an astronaut.\n\n\"When we had our careers counselling, they said, write down three different things you want to be. I wrote down one: astronaut,\" she said in a recent interview.\n\nIn 2024, she completed basic astronaut training as one of six graduates trained by the European Astronaut Centre in Germany, becoming the first international participant to achieve this distinction.\n\nShe was selected from more than 22,500 applicants worldwide.\n\nNow 41 years old, Bennell-Pegg is working as a space engineer and has contributed to the development of numerous space missions and innovative technologies.\n\nFor her, space is not about escaping the Earth, but helping to see it more clearly.\n\n\"Space is a high point in the sky from which we can see bushfires and floods and phenomena across our country. It's how we look after our first responders by connecting them in remote regions. It's how we guide our farmers' farming equipment, how we ensure our national security, and how we unlock discoveries that can only be unlocked in space,\" she said.\n\n\"It's 'pinch me' stuff to be in this position, and I hope by being here and showing what's possible, I can unlock that path for more to follow in the future. When I grew up, I was mesmerised by the tars above me, but they felt very far away. I was inspired by Australians that had been to space before.\"\n\nBeyond her professional accomplishments, Katherine Bennell-Pegg is a passionate advocate for Australia's space sector, frequently speaking to school students and industry professionals to motivate the next generation and help foster new opportunities. Source: AAP / Darren England\n\nDespite Bennell-Pegg's long list of achievements, she says it's \"still just the beginning\" for her.\n\n\"I've not been to space yet. I'm working to remain ready in case that opportunity should arise.\"\n\nFraser said Bennell-Pegg's work was \"shaping the future not only in space, but in everyday life through the impact of research and development\".\n\n\"She leads by example, openly sharing her story to inspire the next generation and reminding us all of the power of a dream, and where determination can lead,\" he said.\n\nLISTEN TO New deep space antenna in Australia to aid exploration of universe while also creating local jobs SBS News 06:10 English\n\nSpeaking after her victory was announced, Bennell-Pegg said Australia was \"leaving too much talent on the launch pad\".\n\n\"For Australia to be able to influence and to contribute to addressing the global issues of the next years, the next century, we need every curious mind engaged, regardless of gender, of background or of postcode,\" she said.\n\n\"I've seen firsthand how space, when truly in reach, ignites powerful motivation to do just that.\"\n\nSenior Australian of the Year: Professor Henry Brodaty AO\n\nSeventy-eight-year-old Professor Henry Brodaty AO has reshaped the diagnosis, treatment and prevention of dementia, enhancing the lives of countless people in Australia and across the globe.\n\nIn 1972, Brodaty's father was diagnosed with Alzheimer's disease at the age of 52.\n\nAt the time, dementia was poorly recognised and frequently overlooked. Individuals living with dementia, along with their carers, received minimal support and had few options for care or guidance.\n\nREAD MORE More than a million Australians could be living with dementia in 40 years. These are possible risk factors\n\nHis father's experience sparked a lifelong commitment to improve the lives of people affected by dementia and their families.\n\nIn 2012, Brodaty co-founded UNSW's Centre for Healthy Brain Ageing, from which he's spearheaded internationally renowned research that has advanced global understanding of dementia risk and prevention.\n\nAt Sunday's event, Brodaty dedicated his win \"to all of us who are older, and all of us who hopefully will get older, and especially to those affected by dementia and their families.\" He also mentioned his father, who he said had died with dementia aged 59, and his mother, who was his father's carer in those years.\n\nHe also reiterated previous calls for Australia to implement a 'slip, slop, slap' type campaign for brain health.\n\nLISTEN TO \"We need the slip, slop, slap of brain health - now\": Advocates call for new national approach to dementia SBS News 06:31 English\n\n\"This needs to be a whole-of-life approach. The earlier we start, the better. So, is there hope for dementia? You bet.\"\n\nFraser said Brodaty has \"turned his personal experience into a lifelong commitment to improving outcomes for people living with dementia\".\n\n\"His work will benefit not just those affected today, but all of us in the future,\" Fraser said.\n\nDementia has recently overtaken heart disease to become Australia's leading cause of death, according to Australian Bureau of Statistics data released in November.\n\nYoung Australian of the Year: Nedd Brockmann\n\nIn 2022, 23-year-old electrician Ned Brockmann made international headlines by running from Perth to Sydney in 46 days — and raising over $2.6 million for people experiencing homelessness in the process.\n\nBrockmann's awareness of homelessness grew during his weekly trips to TAFE, where he regularly saw people sleeping rough along Sydney's Eddy Avenue.\n\nDetermined to draw attention to homelessness, the marathon runner decided to take action.\n\nHis 3,952km run from Perth's Cottlesloe Beach to Sydney's Bondi Beach didn't only raise millions for charity but also set an Australian record (although one that has since been broken).\n\nNedd Brockmann raised over $2.6 million from over 37,000 individual contributors to his Australian-record-breaking run from Perth to Sydney in 2022. Source: AAP / Steven Saphore\n\nIn 2024, he launched Nedd's Uncomfortable Challenge, a charity campaign through which participants choose their own \"uncomfortable\" physical or mental challenge to raise funds for those sleeping rough.\n\nTogether with his team, Brockmann has since raised more than $8 million for the cause.\n\nUpon receiving the award on Sunday, Brockmann, now 27-years-old, said: \"In a country as prosperous as Australia, why is it that 122,000 Australians sleep rough every night? That number should stop us all in our tracks.\"\n\nFraser said that Brockmann had \"chose[n] not to look away\" from the scale of Australia's homelessness crisis.\n\n\"Instead, he took action, and he hasn't stopped since,\" Fraser said.\n\n\"He continues to run for change, finding new ways to help end homelessness, and engaging others to join the fight along the way.\"\n\nAustralia's Local Hero for 2026: Frank Mitchell\n\nFrank Mitchell has been recognised for his efforts to create opportunities for Aboriginal Australians in the trades and construction industry.\n\nThe 43-year-old Whadjuk-Yued Noongar man has said that, as a young single father, being offered an electrical apprenticeship was a profound opportunity.\n\n\"Having lost two friends to drugs and suicide in my teenage years, I was in a bit of a death spiral when I was in my early 20s, and two things happened over the course of the next five years that really I can look back on and attest to my life's outcomes turning around,\" he said recently.\n\nHe said one was the unplanned birth of his son when he was at the age of 21, which \"really shook me to my core about recognising that I had to provide for this beautiful boy\".\n\nThe second was the opportunity to do an electrical apprenticeship.\n\n\"I really wasn't feeling confident that I could achieve an electrical apprenticeship trade, but this one man believed in me, that was my uncle,\" he said, adding that the experience had instilled in him a desire to \"pay that forward\".\n\nSo, when he became a business owner in 2015, he set about creating such opportunities for other Aboriginal Australians.\n\nMitchell and his business partners have now created over 70 Aboriginal upskilling positionsand awarded over $11 million to Aboriginal subcontractors.\n\n\"For some people, opportunity and belief might be enough. For Aboriginal and Torres Strait Islander peoples, it's more complex than that,\" Mitchell said in his acceptance speech on Sunday night.\n\n\"We're constantly navigating racism, stereotypes, and the ongoing impacts of colonisation. I used to advocate for organisations to simply give Mob a job. But I know now, opportunity alone is not enough.\"\n\nFraser said Mitchel's \"approach to building an industry-led community that combines training, employment and culture is delivering stronger futures for people who need them most and demonstrates what can be achieved through collaboration and social inclusion,\"\n\nFor the latest from SBS News, download our app and subscribe to our newsletter.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/the-aussie-dollar-has-reached-a-15-month-high-could-the-upward-momentum-continue/dx44alq8y",
        "title": "The Aussie dollar has reached a 15-month high. What does this mean for us?",
        "publish_date": "Sun, 25 Jan 2026 04:38:00 +0000",
        "category": "finance",
        "authors": [],
        "text": "The value of the Australian dollar has reached a 15-month high and could continue its current momentum upwards thanks to a mix of domestic data and overseas influences.\n\nThe Australian dollar has been sitting between 68.5 and 69 US cents over the Australia Day long weekend, an increase of around 2.3 per cent over the trading week to Friday.\n\nTony Sycamore from IG Markets told SBS News that the Australian dollar has been a \"standout performer\" compared to other currencies, while the United States dollar has weakened.\n\n\"The key driver has been the robust December labour force data,\" he said.\n\nABS data showed unemployment had edged down to 4.1 per cent from 4.3 per cent in November.\n\nHe added that tensions between the European Union and the US, and the increasing cost of precious metals, has created \"very solid support\" for the Australian dollar.\n\n\"[Reaching 70 US cents] is certainly possible in the weeks ahead if the current momentum holds,\" he said.\n\nGeopolitical uncertainties, such as the threat of a US/EU trade war, have also played a part in the fluctuating values of currencies.\n\n\"The events of this week are in line with the Trump administration's unpredictable style, which is going to keep markets on their toes in 2026,\" he said.\n\nEffect on travel, cost of living\n\nIf you're planning on travelling overseas anytime soon, you might benefit from that value jump — or lose out — depending on where you're flying to.\n\nHowever, the change in value may not make a significant difference in how far your dollar stretches in a foreign currency, according to Graeme Hughes a consumer expert from Griffith University.\n\n\"It might be worth considering exchanging some currency now to lock in a better rate,\" Hughes said.\n\n\"However, if you're not travelling soon, it might be wise to wait and see how the dollar performs.\"\n\nThe Australian dollar has been rising in the past few days when compared to the US dollar, Euro and Yen, although the gains are slight.\n\nBesides travel, a stronger dollar makes imports to Australia less expensive, which can reduce prices for commodities like petrol, because its pricing is dependent on global markets.\n\nA stronger Australian dollar may mean cheaper petrol. Source: AAP\n\nOther items Australia imports, from the US for example, would also become cheaper.\n\nHughes said predicting currency movements is \"tricky business\", but there are indicators to look out for.\n\n\"Decisions made by the Reserve Bank of Australia, the performance of the global economy, and the strength of the US dollar will all play a role.\"\n\nFor the latest from SBS News, download our app and subscribe to our newsletter.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/who-is-the-average-australian-january-26/x7yorayup",
        "title": "A century ago, the average Australian was a 24-year-old man. Who is it now?",
        "publish_date": "Sat, 24 Jan 2026 19:33:58 +0000",
        "category": "finance",
        "authors": [],
        "text": "More than 100 years ago, the typical Australian was a 24-year-old male. Today, it's a 38-year-old woman.\n\nThat statistic captures just one of the ways the country has changed since the Australian Bureau of Statistics (ABS) began conducting its Census surveys in 1911.\n\nThe first survey — which took place more than 100 years after the First Fleet arrived in 1788 — counted 4.4 million people in Australia. That number didn't include Aboriginal or Torres Strait Islander communities.\n\nOnly \"full-blooded Australian Aboriginals\" in the employ of white settlers or those living in the vicinity of settlements were recorded, and in 1911, there 19,939 were counted — 11,385 of which, were men.\n\nThe 'average' Australia is a 38-year-old woman who was born in Australia and speaks English at home. Source: SBS News\n\nThe picture remained largely incomplete until a full count of First Nations people was mandated in the 1967 referendum. The most recent Census in 2021 tells us that 3.2 per cent of Australia's total population of 25 million people identify as Aboriginal or Torres Strait Islander — approximately 812,000 residents.\n\nAustralia's population has also ballooned since that first Census, and as of June 2024, is now estimated to be 27 million.\n\nREAD MORE What does it mean to be Australian? We asked these migrant Australians\n\nSo, on the eve of January 26, SBS News wanted to ask: who are we, really?\n\nLet's find out.\n\nWe were born in Australia and live in major cities\n\nAlmost 70 per cent of residents were born in Australia, according to Australian Institute of Health and Welfare (AIHW) estimates from June 2023.\n\nTasmania has the highest Australian-born population (79 per cent), while Victoria has the lowest (65 per cent).\n\nThe overwhelming majority of Australians live in major cities — making up 73 per cent of the population.\n\nA quarter live in inner regional and outer regional areas, while the remaining 1.9 per cent live in remote and very remote areas.\n\nThree-bedroom homes are the most common form of housing, according to the 2021 Census, with 37 per cent of Australians living in a three-bedroom property. However, those in Western Australia are more likely to live in a four-bedroom home, with 37 per cent doing so.\n\nWe're married and have more than one child\n\nA couple with children is still the most common family composition in Australia, representing almost 30 per cent of residents, according to Census data from 2021.\n\nThis trend is consistent across most jurisdictions, except South Australia, Tasmania and the Northern Territory, where couples with no children are more common.\n\nMost families have at least two or more children in Australia. Source: SBS News\n\nThe average number of children per family in Australia is 1.8, and 58 per cent of families have two or more children in the household.\n\nAround a third of Australians are married, and this is the most common marital status response everywhere except the NT, where \"not married\" is the most common answer (29 per cent).\n\nWe earn around $1,436 per week\n\nThe median wage for Australians is $1,436 a week ($74,672 a year) before tax, so if you earn more than this, your income is higher than half of all working Australians.\n\nIf you're working full-time, the median is higher, rising to $1,887 a week before tax ($98,124 a year), according to the latest ABS employee earnings release published on Friday.\n\nThe median for men is even higher — $1,994 a week — which equates to $103,688 a year. For women working full-time, it is $1,758 a week ($91,416 a year).\n\nWe're a nation of migrants\n\nAustralians are slightly more likely to have at least one parent born overseas (48 per cent), than for both parents to be born in Australia (46 per cent).\n\nBut the picture can vary widely depending on which state you live in.\n\nAlmost half of all Australians have at least one parent born overseas.\n\nIn Queensland, South Australia, Tasmania and the NT, residents are more likely to have both parents born in Australia.\n\nNotably, 67 per cent of Tasmanians report both parents were born in Australia.\n\nBut in other states, you are slightly more likely to have at least one parent born overseas. In Western Australia, 56 per cent of residents had at least one overseas-born parent.\n\nBut we mostly speak English at home\n\nAround 72 per cent of residents speak English at home, nationally — this increases to 86 per cent in Tasmania.\n\nThe second most common language is Mandarin, with 2.7 per cent speaking it at home. It holds this rank in every jurisdiction except the NT, where Kriol is the second most common language. The NT also has the highest proportion of people who speak a language other than English (32 per cent).\n\nThe most common ancestry in Australia is also English (32 per cent), which remains the top response in all jurisdictions, except the NT, where 24 per cent are Australian Aboriginal.\n\nMost Australians speak English at home. Source: Getty / Maskot/Maskot\n\nMigrants are also commonly from England\n\nFor those not born in Australia, the most common birthplace is England, with 4 per cent being of English origin.\n\nBut this varies widely depending on the state or territory.\n\nIn NSW, migrants were most commonly born in China (3 per cent); in Victoria and ACT, India was the most common birthplace (around 4 per cent); in Queensland, New Zealand (4 per cent); and in the NT, it was the Philippines (3 per cent).\n\nREAD MORE How multicultural is your suburb?\n\nWe're slaves to our mortgages\n\nThe most common housing tenure type — which describes whether a property is owned or rented — in Australia is a home owned with a mortgage. Nearly a third of Australians (30 per cent) are in this situation.\n\nBut the picture changes if you live in NSW and the NT, where it's more common to rent (28.5 per cent of people rent in NSW, and 37.5 per cent in the NT).\n\nIt's a completely different story in Tasmania, where it's more common for people to own their homes outright, with 32 per cent doing so.\n\nTwenty years ago, it was most common for Australians to own their home outright (that is, without a mortgage), with 30 per cent doing so in 2006. But by 2011, this changed to owning a home with a mortgage (30 per cent ).\n\nIn NSW, the shift has been even more stark, with renting now the most common response (29 per cent).\n\nRenting was the most common housing tenure in NSW in 2021, according to ABS Census data, but in 2006 people were more likely to own their home outright. Source: SBS News\n\nWe own two cars\n\nThe typical Australian owns two cars, with 34 per cent having access to two vehicles.\n\nBut in NSW and the NT, it is more common to own just one car (35 per cent in NSW and 32 per cent in NT).\n\nWe're getting older, and more of us are female\n\nThe median age in Australia is 38, but some jurisdictions skew older or younger. In Tasmania, the median is 42, while in the NT, it's 33.\n\nAustralians are getting older. In 2001 the median age was 35.7, and in 1911, the median age was 24.\n\nTasmania has a higher proportion of older residents, while the Northern Territory has a higher proportion of younger residents, than other areas of Australia. Source: SBS News\n\nWe are also slightly more likely to be female, with 51 per cent of the population identifying as such.\n\nThis holds true for every state and territory except the NT, where 50.5 per cent are male.\n\nMore than half of all men aged 15 and over do some housework each week — 56 per cent perform up to 14 hours of unpaid domestic duties — but 27 per cent did none.\n\nAround 25 per cent of women did no housework, but 46.15 per cent reported completing between five and 29 hours of unpaid domestic duties in one week.\n\nFor the latest from SBS News, download our app and subscribe to our newsletter.",
        "source": "SBS"
    },
    {
        "url": "https://www.theage.com.au/lifestyle/health-and-wellness/are-you-ageing-well-try-these-4-simple-tests-to-find-out-20260123-p5nwgv.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Are you ageing well? Try these 4 simple tests to find out",
        "publish_date": "Mon, 26 Jan 2026 13:31:23 +1100",
        "category": "lifestyle",
        "authors": [
            "Dana G. Smith"
        ],
        "text": "Advertisement\n\nLifestyleHealth & wellnessAgeing Are you ageing well? Try these 4 simple tests to find out Dana G. Smith January 26, 2026 — 1:31pm Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share A A A\n\nTake a minute to consider the last decade of your life. What type of physical shape do you hope to be in? And what are the activities you want to be able to continue doing? While there’s no crystal ball to predict your future health, there are a few basic tests you can give yourself to gauge your current strength, power, cardiovascular fitness and balance — all of which will influence your physical abilities going forward. These kinds of tests have been associated with longevity and independent living. They’re also proxies for activities that many people want to be able to do in old age, like getting down on the floor to play with grandchildren or travelling and exploring a new city by foot. These 4 basic tests give you a great indication of how you’re ageing. Getty Images It’s never too early to begin training for your later years, said Stuart Phillips, a professor of kinesiology at McMaster University in Ontario. People naturally lose strength and muscle mass with age, so you want your starting point to be as good as possible. Getting a head start on training is “money in the bank,” Phillips said. It’s also never too late to improve your physical abilities, he added: “We’ve got data showing that nonagenarians, so people in their 10th decade of life, or in their 90s, can make gains in strength and function with just a little bit of even light activity.”\n\nAdvertisement\n\nTry these four tests to determine where you currently stand. If you don’t perform as well as you might have hoped, don’t worry: A few strength, conditioning and balance exercises, done regularly, can help you improve your score on each one. Editor's pick Fitness The goal posts for a longer, healthier life are closer than you think 1. Sitting-Rising Test The goal with this assessment is to go from standing to sitting on the floor, and back up again, using the least amount of support as possible. The test is scored on a 10-point scale — five points for sitting down and five points for standing up — and you lose a point for every hand, knee or other body part you use to help yourself. Subtract a half point if you’re unsteady or lose your balance. Adults in their 30s and 40s should aim for a perfect 10, said Dr. Claudio Gil Araújo, the dean of research and education at the Exercise Medicine Clinic in Brazil, who developed the test. Anyone over 60 who gets an 8 is “in very good shape,” he said.\n\nAdvertisement\n\nThe test evaluates strength, power, balance and flexibility. Araújo has also shown it’s a predictor of mortality. A recent study of his looked at more than 4,000 adults age 46 to 75 and found that, over the course of 12 years, the people who scored 4 or below on the sitting-rising test had death rates nearly four times higher than those who scored a 10. He said that was primarily because people with low scores were at a higher risk for falls. 2. Walking speed assessment How fast someone walks at their normal gait is “a very important indicator of functional ability and vitality,” said Jennifer Brach, a professor of health and rehabilitation sciences at the University of Pittsburgh. “It is predictive of future decline; it’s predictive of mortality, nursing home placement, disability, a whole host of different things,” she said. To assess your walking speed, measure out 4 meters, or about 13 feet, on a straight, flat surface, and time how long it takes you to cover the distance. (Remember, you’re walking at your normal speed, not as fast as you can.) People of all ages should aim for a gait of at least 1.2 meters per second, a little over three seconds total. Brach recommended people retest themselves every few months. “If the value changes, that can be a warning sign,” she said. That’s because while walking feels like a simple task, it requires proper functioning of the cardiovascular, musculoskeletal, vestibular (balance), sensory and nervous systems. A slower gait could indicate that there’s a problem in any one of those systems that may need to be investigated and addressed.\n\nAdvertisement\n\n3. Grip strength test Related Article Nutrition Can we call butter and beef tallow ‘healthy fats’? Grip strength is also related to mortality. While that connection may seem far-fetched, experts say a grip strength test serves as a helpful indicator for how active a person is in their daily life. “When you’re using your hands more, it’s probably because you’re doing things more,” said Cathy Ciolek, president of the American Physical Therapy Association Geriatrics. “You’re carrying groceries, you’re opening the car door, you’re picking up a grandchild.” All of those things work your hands, she said, and the more you do them, the better your grip strength. Grip strength is also important for maintaining independence with household tasks like cooking. (Think about pulling a heavy dish out of the oven.)\n\nAdvertisement\n\nA doctor or physical therapist typically assesses grip strength using a special device called a dynamometer. To test yourself at home, try walking for 60 seconds while holding a heavy weight in each hand (also known as a farmer’s carry), suggested Dr. Nima Afshar, a physician at concierge medical practice Private Medical. Start with lighter weights and work your way up to heavier ones over time. If you experience hand or body pain, stop. There aren’t age-related norms for the farmer’s carry like there are with a dynamometer. But Afshar said a 45-year-old man should aim to carry two 60-pound dumbbells, a 65-year-old two 40-pound dumbbells and an 85-year-old two 25-pounders. For a woman at those ages, goal weights are 40 pounds, 25 pounds and 15 pounds in each hand. 4. Single-leg stand Just as strength naturally declines with age, so does balance. And that raises the risk for falls — a major cause of injury and death in older adults. Testing one’s balance is as simple as standing on one leg. Adults should aim for a minimum of 10 seconds on at least one side. For an added challenge, Afshar recommended attempting the test with your eyes closed.\n\nAdvertisement\n\nAccording to a study Araújo published in 2022, 20% of adults age 51 to 75 were unable to make it to 10 seconds. And those individuals had an 84% higher chance of dying in the next seven years, possibly because they were unhealthier at the start of the study. “You can’t predict an individual’s precise mortality” with these types of tests, Afshar said. But if you’re below average on any of them, it’s likely you won’t fare as well long term. That said, he added, all of these metrics — strength, fitness, balance — can be improved, and as you improve, your risk of dying soon goes down. The New York Times\n\nSave You have reached your maximum number of saved items. Remove items from your saved list to add more. Share More: Ageing\n\nHealth\n\nWellbeing",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/soccer/alen-stajcic-was-just-sacked-but-his-oam-days-later-says-much-more-20260125-p5nwsy.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Alen Stajcic was just sacked – but his OAM days later says much more",
        "publish_date": "Mon, 26 Jan 2026 13:31:00 +1100",
        "category": "sports",
        "authors": [
            "Emma Kemp"
        ],
        "text": "Resilience is something Stajcic has always tried to teach his players – and there have been many over two and a half decades. From his national teams (Matildas, Young Matildas, Philippines) and clubs (Sydney FC Women, Central Coast Mariners Men, Perth Glory Men, Wanderers Men) and, right at the start, the NSWIS Women’s Football Program, through which he nurtured the Matildas’ golden generation. Resilience is also a muscle he has been forced to flex during some low periods so severe – namely his Matildas sacking and all the erroneous innuendo accompanying it – it’s perplexing to the outsider he did not give coaching away completely and start fresh as a landscaper or diving instructor, or literally anything else unrelated to football. Loading “I don’t know, I just love the game,” he reasons. “It’s the one thing I can thank my parents for, and especially my father, who sacrificed everything for me to play the game and follow my dreams within the game. They came to Australia as immigrants from Yugoslavia without a word of English or a cent to their names, and gave me and my brother everything they could. Football was one of the things that they gave us. “We’re lucky that this country gives you the opportunity to go through the ranks. As a first-generation Australian, to be able to go from immigrant parents without a cent to their name to coaching a country is pretty special. And little things like being the first Australian-born coach to win a game at a World Cup – and having three wins now at a World Cup – make it special, and more recognition for the sacrifice everyone put in for you to be able to follow your dreams.\n\n“So this is probably more recognition for my family than for me. My mother and father, and my wife and my kids, who have sacrificed the most out of everyone.” Careful, because this is not a eulogy. Stajcic is only 52 and still very much a coach, albeit one out of work (“Just hanging in there,” he laughs). But the past is what earned him this rare honour, bestowed on only a handful of Australian coaches. Matildas players listen to direction from Stajcic in 2018. Credit: Getty Images “Especially in women’s football,” he says. “I started off on the journey when everyone thought it was uncool – the poor cousin of the poor cousin. Being disregarded and discriminated against, and not thought of or cared about by pretty much everyone in administration. I was warned off going down that field, but it didn’t bother me really. I just loved the game, and anyone who loved the game I was happy to share my time with. “To think of the things we had to go through at the NSW Institute of Sport, just to get a training field and gear and women’s-sized clothing, and revenues and resources for the team. It was a pretty amazing ride. And to think about the talent ID – of finding those players from all around NSW and Australia, and how the group sort of grew up together and has become the golden generation. That probably gives me the greatest joy and pride, to see how we all evolved together as coaches and players, and went from virtually nothing to – for me – becoming probably the best team in the world.”\n\nIn 2017, the Matildas reached a record high FIFA ranking of No.4, behind No.3 England, No.2 Germany, and long-time leaders the United States. It was in July of that year that Australia first beat the US – a major milestone in Seattle after 26 fruitless attempts. Sam Kerr, Steph Catley and their contemporaries of 2023 World Cup fame were in the early 20s. With retired Matildas goalkeeper Lydia Williams. They almost repeated that 1-0 Tournament of Nations triumph at the 2018 edition (during which a 15-year-old Mary Fowler made her senior international debut against Brazil) but for an injury-time equaliser in Connecticut. Still, Megan Rapinoe shook Stajcic’s hand after that game and, in a casual chat, gave her former Sydney FC coach the impression that her all-conquering US team were wary of Australia leading into the 2019 World Cup. This evidence, on the back of finishing runners-up at April’s Asian Cup in Jordan, was enough for Stajcic to believe his Matildas were genuine World Cup contenders. Seven months later he was at the centre of one of the most controversial dismissals in Australian football history. “It hurt my soul,” he remembers. Then he repeats it. “It hurt my soul.”\n\nThe personal trauma was compounded, he says, by the knowledge he’d been offered the highly lucrative England head coaching job (China came knocking too), but turned it down. “For four or five times the money, all the resources, they told me they were going to host the [2022] Euros, everything,” he says. “I knocked it back and then Phil Neville took it after me. I wanted to stay with Australia for the [2019] World Cup … and 12 months later I got sacked. I always said I’m not going to be that loyal ever again, but then I do it again. And again.” Alen Stajcic’s magic touch set up the Central Coast Mariners for success. Credit: Getty Images Perhaps such loyalty is part of the reason he is now an OAM? “Not sure, to be honest,” is his answer, but he does know he possessed a “willingness to fight and fight back”. Three months later he was hired as Central Coast’s caretaker coach, then permanent coach, and in early 2021 oversaw the Mariners’ first back-to-back A-League Men wins since December 2017. The competition’s laughing stock had transformed into table-toppers. Western United’s coach at the time, Mark Rudan, called him “a magician, as far as I’m concerned”. “There’s no magic,” Stajcic said pragmatically. “The magic is hard work.”\n\nIn late 2021, when was appointed head coach of the Philippines – he went on to qualify the nation for its first Women’s World Cup and they made their debut in the 2023 tournament with a win over co-hosts New Zealand – and handed the reins to assistant and club great Nick Montgomery, the foundations were laid for back-to-back championships, a premiership and an AFC Cup. “Now six or seven of those guys have played [for the] Socceroos – from a team that, when I took over in 2019, had won one game out of 21 – and are now in contention for this next World Cup,” Stajcic says. Stajcic with his Philippines coaching staff. Credit: Reuters “That was a really massive highlight for me – knowing I could do it in men’s football as well and achieve so much. It was an unknown really. I had coached elite boys from 12 to 18 for 10 years as well. But coaching a professional men’s team? That was something that I had to learn. “But the longer I went on the more I realised, especially as society as well has evolved, I think the genders have come closer together. And especially the younger generation who’ve grown up with phones and social media and all those kinds of things. So the problems they face and the dilemmas they have are more closely aligned with each other.”",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/tennis/woodbridge-demon-playing-his-best-tennis-yet-20260126-p5nx1u.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Woodbridge: Demon playing his best tennis yet",
        "publish_date": "Mon, 26 Jan 2026 13:29:05 +1100",
        "category": "sports",
        "authors": [],
        "text": "Woodbridge: Demon playing his best tennis yet\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/tennis/australian-open-2026-live-updates-inglis-great-swiatek-test-all-aussie-showdown-in-doubles-sinner-keys-chase-title-defences-20260125-p5nwv9.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Australian Open 2026 LIVE updates: Pegula ousts champ Keys; Kubler, Polmans win all-Aussie clash; Inglis in Swiatek test; Sinner chases second crown",
        "publish_date": "Mon, 26 Jan 2026 13:28:11 +1100",
        "category": "sports",
        "authors": [
            "Hannah Kennelly",
            "Scott Spits"
        ],
        "text": "There’s no doubt that Tennis Australia chief executive Craig Tiley has his hands full this year.\n\nIn the midst of the Australian Open, Tiley has been the subject of unrelenting speculation over his future (suggesting he is in the frame to run the US Open), and is facing a star-studded player push for better pay and conditions.\n\nAll par for the course, you could say, given the administrative stalwart’s pay packet.\n\nCraig Tiley with Stan Wawrinka following the Swiss player’s final Australian Open match on Saturday. Credit: Getty Images\n\nTiley topped the Australian tennis governing body’s executive payroll in the organisation’s most recent tax filings in the US, raking in a modest $US1.2 million ($1.7 million). We say modest because, just a year earlier, he received almost double that amount.\n\nTennis Australia would have it be known that these filings don’t offer the full picture, once you factor in variances in reporting periods between Australia and the US, foreign currency fluctuations and other accounting quirks.\n\nLoading\n\nWhich is all to say, bonuses and other payments can fall between reporting cycles, explaining Tiley’s dip in compensation.\n\nStill, if the numbers are good enough for US regulators, they’re good enough for Open Season!\n\nAnd if the most recent filing is any indication, life at Tennis Australia doesn’t look bad at all.\n\nThe organisation declined to comment.\n\nTimothy Jolley, the organisation’s chief strategy and performance officer, had reportable compensation of $US765,646 ($1.1 million). The figure for Tennis Australia’s chief commercial officer, Cedric Cornelius, was $US608,657 ($882,751), the organisation reported, while chief operating officer Thomas Larner didn’t do too badly either, rounding out the fat cats with $US502,825 ($729,260).\n\nUS Open and Wimbledon champion Lleyton Hewitt, who is also Tennis Australia’s Davis Cup captain, took in $US287,114 ($416,408), down a touch on what he made the previous year.\n\nTodd Woodbridge, meanwhile, wasn’t listed on the filing at all. Rest assured, though, we hear he remains on the books for his ambassadorial duties.\n\nLleyton Hewitt. Credit: Getty Images\n\nThese figures and more are contained in what is known as a 990 filing, which Tennis Australia filed with the US Internal Revenue Service last August, for the 12 months to 30 September 2024.\n\nRead more in our Open Season column here.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/western-australia/where-to-watch-australia-day-fireworks-across-wa-20260126-p5nx1y.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Where to watch Australia Day fireworks across WA",
        "publish_date": "Mon, 26 Jan 2026 13:24:42 +1100",
        "category": "entertainment",
        "authors": [
            "Michael Philipps"
        ],
        "text": "Advertisement\n\nNationalWAWhat’s on Where to watch Australia Day fireworks across WA Michael Philipps January 26, 2026 — 1:24pm Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share A A A\n\nWestern Australians will have the opportunity to celebrate Australia Day with a bang with several fireworks displays set to light up the sky across the state. Australia Day fireworks over the City of Perth City of Perth The City of Perth is planning its annual Australia Day spectacular, with festivities kicking off at Langley Park from 3pm with a multicultural zone, carnival rides and sideshow alley. A freestyle motocross and BMX stunt show will add to the family-friendly entertainment before a sky-dive display. The official light show, featuring fireworks and drones, expected to kick off at 8.30pm, although exact times will depend on wind and light factors.\n\nAdvertisement\n\nCity of Perth Lord Mayor Bruce Reynolds said the Australia Day activities provided an opportunity for the community to come together to reflect, respect and celebrate Australia’s rich and diverse culture. “Australia Day is a chance to gather in the heart of our city, enjoy a beautiful summer’s day by the river, and reflect on the many stories, cultures and shared values that shape our country,” he said. “We encourage everyone to make their way into the city to enjoy a vibrant mix of cultural experiences, live performances, entertainment, rides and international cuisine. “Bring your friends and family, set up for the day along the Derbarl Yerrigan (Swan River), and come together to watch the sky light up as we celebrate the city and lifestyle we know and love.” Last year’s fireworks display were a hit. City of Perth\n\nAdvertisement\n\nSouth of the river, the City of Armadale will host a fireworks display set to begin Minnawarra Park at around 8.30pm as part of its celebrations. Families are also expected to gather along the foreshore when the City of Rockingham begins its fireworks display from the Val Street Jetty at 8.30pm. Further south, the City of Bunbury will present its SkyFest along the Koombana Bay foreshore with the night sky also set to light up at 8.30pm. In the north of the state fireworks displays are also set for the Cue Sports Oval on Wittenoom Street and along the Geraldton Breakwater foreshore at 8.30pm. Kalbarri and Port Hedland firework shows are set to begin at 8pm at Gantheaume Bay and Marie Marland Reserve respectively, while Karratha’s Australia Day spectacular will begin at 8.15pm over The Esplanade.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/tennis/defending-champ-knocked-out-by-podcast-pal-20260126-p5nx2b.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Defending champ knocked out by podcast pal",
        "publish_date": "Mon, 26 Jan 2026 13:23:34 +1100",
        "category": "finance",
        "authors": [],
        "text": "Defending champ knocked out by podcast pal\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/queensland/lone-pine-koala-sanctuary-keeps-animals-cool-amid-heatwave-20260126-p5nx24.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Lone Pine Koala Sanctuary keeps animals cool amid heatwave",
        "publish_date": "Mon, 26 Jan 2026 13:19:30 +1100",
        "category": "finance",
        "authors": [],
        "text": "Remove items from your saved list to add more.\n\nYou have reached your maximum number of saved items.\n\nSave this video for later\n\nAdd videos to your saved list and come back to them anytime.\n\nGot it",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/tennis/think-demon-doesn-t-have-the-weapons-to-beat-the-best-think-again-20260125-p5nww6.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Reckon Demon doesn’t have the weapons to beat the best? Think again",
        "publish_date": "Mon, 26 Jan 2026 13:05:12 +1100",
        "category": "sports",
        "authors": [
            "Marc Mcgowan"
        ],
        "text": "A glass ceiling has always hung above Alex de Minaur’s tennis career – but not of his doing.\n\nThere is an obsession with listing everything that de Minaur is not, and what he supposedly never will be. The problem for those repeatedly doing so, even as he continues to smash through, is that the man known as “Demon” takes great joy in proving his many critics wrong.\n\nAlex de Minaur celebrates his fourth-round win over Alexander Bublik at the Australian Open on Sunday night. Credit: AP\n\n“I know that there are a lot of people who don’t think I can do it,” de Minaur said a few nights back.\n\nThe world No.6 has never prescribed to the theory that it is counterproductive to be motivated by others. He accepts fuel from wherever he can get it, but is undoubtedly overflowing with self-motivation, too.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/afl/afl-boss-jets-off-to-india-with-lofty-goals-20260126-p5nx1w.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "AFL boss jets off to India with lofty goals",
        "publish_date": "Mon, 26 Jan 2026 13:03:30 +1100",
        "category": "finance",
        "authors": [],
        "text": "AFL boss jets off to India with lofty goals\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/queensland/possible-thunderstorm-to-cap-off-brisbane-s-hottest-australia-day-in-27-years-20260126-p5nx0b.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Possible thunderstorm to cap off Brisbane’s hottest Australia Day in 27 years",
        "publish_date": "Mon, 26 Jan 2026 13:02:44 +1100",
        "category": "finance",
        "authors": [
            "Dominique Tassell"
        ],
        "text": "Advertisement\n\nNationalQueenslandExtreme weather Possible thunderstorm to cap off Brisbane’s hottest Australia Day in 27 years Dominique Tassell January 26, 2026 — 1:02pm Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share A A A\n\nBrisbanites are sweltering through a near-40 degree Australia Day, with the possibility of another storm in the evening. At its peak, the temperature would be up to 8 degrees above average – at 36 to 37 degrees – in Brisbane, the Bureau of Meteorology’s Shane Kennedy said. People try to keep cool at South Bank, as Brisbane cops a 38-degree Australia Day. Brittney Deguara/Brisbane Times Residents in Ipswich were facing up to 39 degrees, while further west the temperature was expected to exceed 40 degrees. “It could be a pretty warm night still, but tomorrow we’ll have a southeasterly wind change,” Kennedy said.\n\nAdvertisement\n\n“[We’re] expecting that it’ll drop the afternoon temperatures back down to the low 30s, so close to average, and it should stay around those low 30s for the rest of the week.” Heatwave conditions were expected further inland for the rest of the week, with temperatures of 11 to 12 degrees above average expected through the week. Related Article Extreme weather Brisbane set for hottest Australia Day in 27 years A thunderstorm could be on the way for Brisbane on Monday afternoon, with the possibility of similar damaging winds to Sunday night’s storm. “It’d be more likely in the western suburbs and further west, so well inland, but still is around that 10 per cent chance of storms making it to the CBD today.\n\nAdvertisement\n\n“A positive effect of the thunderstorms is that it really cools conditions overnight. That’ll be a big blessing if we get some storms later [on Monday]. “It’s good for the temperatures, but potential to do a little bit of wind damage.” About 220,000 lightning strikes were recorded across the state’s south-east during storms on Sunday evening. Strikes on the power network contributed to about 13,600 homes and businesses losing power, with 450 customers affected at 8am on Monday. By 11am, this had reduced to just 66 customers, in Ashgrove and Hendra. No heat-related outages have been reported.\n\nAdvertisement\n\nStaff at Lone Pine Koala Sanctuary were working hard to ensure animals were kept cool in the heat. “During hot days, dingoes and Tasmanian devils can walk through or lie down in their ponds to cool off,” said Rebecca Bain, the head of mammals at Lone Pine. Loading “Keepers might also wet down dirt or sand areas to offer them a cooler place to rest on. ‘Bloodcicles’ [blood ice blocks] can also be a yummy way to help them cool down. “Flying foxes can use their wings as fans to help cool themselves down in hot weather. We also offer them showers on hot days – the water can cool the flying foxes down as well as the surrounding environment. They can then lick the water off themselves and nearby branches if in need of a drink.”\n\nAdvertisement\n\nLone Pine is open on Australia Day, though visitors are unlikely to see the wombats. “They tend to retreat underground in burrows during warm days – it is up to several degrees cooler down there,” Bain said. Start the day with a summary of the day’s most important and interesting stories, analysis and insights. Sign up for our Morning Edition newsletter.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/tennis/tensions-flare-as-umpire-misses-let-call-20260126-p5nx1v.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Tensions flare as umpire misses let call",
        "publish_date": "Mon, 26 Jan 2026 13:02:28 +1100",
        "category": "sports",
        "authors": [],
        "text": "Tensions flare as umpire misses let call\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/tennis/alcaraz-device-drama-angers-greats-20260126-p5nx1p.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Alcaraz device drama angers greats",
        "publish_date": "Mon, 26 Jan 2026 12:58:08 +1100",
        "category": "finance",
        "authors": [],
        "text": "Alcaraz device drama angers greats\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/tennis/alcaraz-device-drama-angers-greats-20260126-p5nx1l.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Alcaraz device drama angers greats",
        "publish_date": "Mon, 26 Jan 2026 12:54:02 +1100",
        "category": "finance",
        "authors": [],
        "text": "Alcaraz device drama angers greats\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/world/north-america/icu-nurse-alex-pretti-honored-in-video-salute-to-veteran-after-being-fatally-shot-in-minneapolis-20260126-p5nx1j.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "ICU nurse Alex Pretti honored in video salute to veteran after being fatally shot in Minneapolis",
        "publish_date": "Mon, 26 Jan 2026 12:50:46 +1100",
        "category": "finance",
        "authors": [],
        "text": "Remove items from your saved list to add more.\n\nYou have reached your maximum number of saved items.\n\nSave this video for later\n\nAdd videos to your saved list and come back to them anytime.\n\nGot it",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/tennis/commentators-stunned-by-disastrous-keys-sight-20260126-p5nx18.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Commentators stunned by 'disastrous' Keys sight",
        "publish_date": "Mon, 26 Jan 2026 12:22:23 +1100",
        "category": "finance",
        "authors": [],
        "text": "Commentators stunned by 'disastrous' Keys sight\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://au.news.yahoo.com/extraordinary-albo-welcomes-aussies-234651543.html",
        "title": "‘Extraordinary’: Albo welcomes new Aussies",
        "publish_date": "2026-01-26T02:06:04Z",
        "category": "finance",
        "authors": [],
        "text": "Anthony Albanese has welcomed a group of newly minted Aussies to the country with a message of hope.\n\nSpeaking at the Australia Day citizenship ceremony on Monday, the Prime Minister referenced the first such event in 1949, describing the seven people from seven nations who were welcomed into the “Australian family” by the then Prime Minister Ben Chifley.\n\nMr Chifley’s description of Australia as a nation “in which great opportunities will present themselves” and a country “where democracy is not just a platitude but something which is practised” still rang true to this day, Mr Albanese said.\n\nThe Australia Day citizenship ceremony is an annual tradition. Picture: NewsWire / Martin Ollman\n\nAnthony Albanese and partner Jodie Haydon were front row at the Canberra ceremony. Picture: NewsWire / Martin Ollman\n\nBoth Mr Albanese and Governor-General Sam Mostyn paid tribute to the rich Indigenous history that shaped Australia. Picture: NewsWire / Martin Ollman\n\n“Whether we are Australian by birth or by choice, we all share the opportunity, the privilege and the responsibility of being part of something extraordinary,” he said.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nMr Albanese reiterated the pledge made by the group of incoming Aussies was informed by the respect for “common humanity” that defined modern Australia.\n\n“Thank you to all of you who have made the choice to embrace that today,” he said.\n\nNew citizens at the ceremony came from countries including India, New Zealand, Turkey, the US, Nigeria, Malaysia, Nepal, and the UK, with thousands more people across the country, from a range of diverse backgrounds, due to be inducted as Aussies on Monday.\n\nGovernor-General Sam Mostyn also welcomed the group in Canberra, telling them: “This country is your home and the home of your children and the generations to come.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\n“Australia’s values are now yours, just as your stories are now part of the rich, braided story of Australia.”\n\nOften it was the nation’s strong, democratic system and values of acceptance, freedom, friendship, unity and kindness that drew citizen hopefuls to the country, Ms Mostyn said.\n\nIt was a day to show your true colours. Picture: NewsWire / Martin Ollman\n\nMs Mostyn said kindness was a fundamental Australian value. Picture: NewsWire / Martin Ollman\n\n“As you know, our stable democracy is the envy of the world and the culmination of 65,000 years of Aboriginal and Torres Strait Islander history and culture, the institutions of our democracy and structures of government, and the rich multiculturalism stemming from our generous welcome to migrants and refugees over more than eight decades,” she said.\n\nKindness was at the heart of the nation’s character, Ms Mostyn said, before welcoming the group into the “Australian family with gratitude and great hope”.\n\nNSW’s WugulOra morning ceremony\n\nHundreds gathered at Sydney’s Barangaroo Reserve beneath the Sydney Harbour Bridge to witness the annual WugulOra morning ceremony on Monday.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nWugulOra, which means “One Mob” in the local Gadigal language, celebrates the culture of the Gadigal people of the Eora nation through dance, song and storytelling.\n\nThe Doonooch Aborginal dance group performed at the WugulOra ceremony. Picture: NewsWire / Gaye Gerard\n\nHundreds of people arrived at Barangaroo to witness the celebrations. Picture: NewsWire / Gaye Gerard\n\nPremier Chris Minns (second from left) was there. Picture: NewsWire / Gaye Gerard\n\nThe event featured speeches from state governor Margaret Beazley, NSW Premier Chris Minns and an address from the Metropolitan Local Aboriginal Land Council, alongside a smoking ceremony and special performances.\n\n‘Close partnership’: Praise from Washington\n\nUS State Secretary Marco Rubio was among the first to congratulate Australia on its national day.\n\nIn a statement released at midnight, he praised the US and Australia’s “close partnership”, pointing to deep defence, economic and political ties.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\n“On behalf of the United States of America, I extend my best wishes to Australians everywhere as you celebrate Australia Day on January 26,” Mr Rubio said.\n\n“The United States and Australia are bound by a longstanding alliance, strengthened over the 75 years since the signing of the ANZUS Treaty.\n\nThe Australian flag was on full display. Picture: NewsWire / Martin Ollman\n\nA 21-gun salute occurred during the event as aircraft flew overhead. Picture: NewsWire / Martin Ollman\n\n“Over the past year, our defence, economic, and security co-operation has deepened, reflecting our shared commitment to democratic values, regional stability, and mutual prosperity.”\n\nHe highlighted AUKUS as an example of Australia and the US jointly “advancing deterrence, emerging technologies, and a rules-based order in the Indo-Pacific”, adding that Canberra’s “leadership in developing secure and reliable supply chains” for critical minerals was also “central to these shared efforts”.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\n“Our economic relationship continues to shine, marked by strong trade and record levels of two-way investment,” Mr Rubio said.\n\n“Together, we are well positioned to meet future challenges and opportunities.”\n\nHe also acknowledged the Bondi terror attack, which claimed the lives of 15 innocents and injured dozens more.\n\nHe said the US “continues to stand in solidarity with the loved ones of the fallen victims and Australia’s Jewish community” and it remained “committed to confronting and defeating the evil of anti-Semitism”.\n\nMeanwhile, Australia’s outgoing envoy in Washington, Kevin Rudd, took to social media to wish all Australians in the US and across the world a happy Australia Day.\n\n“Happy Australia Day to all Australians here in the USA, and all our friends back home and around the world, from the midst of a Washington blizzard!” he posted, sharing a video of an Australian flag flapping in the US’s snow-swept capital.",
        "source": "Yahoo"
    },
    {
        "url": "https://au.news.yahoo.com/had-numbers-huge-call-leader-220031910.html",
        "title": "‘Got the numbers’: Huge call on leader",
        "publish_date": "2026-01-26T02:02:33Z",
        "category": "finance",
        "authors": [],
        "text": "Key politicians have weighed into the debate over Sussan Ley’s future as Liberal leader as speculation of a spill intensifies following the splintering of the Coalition.\n\nThe Opposition Leader has come under intense scrutiny after 11 National Party members resigned from her front bench last week, citing the “untenable” nature of the historic Liberals-Nationals alliance under Ms Ley’s leadership as the reason for their exit.\n\nThe Coalition split is the second since Ms Ley was elected to the top job in May last year and has raised questions surrounding her ability to survive as leader.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nLiberal MPs Angus Taylor and Andrew Hastie are widely considered the main contenders in any bid to roll Ms Ley and are understood to be canvassing support for a challenge.\n\nQuestions are swirling around Sussan Ley’s ability to last as leader. Picture: Gaye Gerard /NewsWire\n\nMr Hastie has received the endorsement of his young family to pursue a leadership ticket, The Australian reports, while Mr Taylor has returned from a Europe trip early amid the unfolding leadership crisis.\n\nSpeaking to Seven’s Sunrise on Monday, former Nationals MP Barnaby Joyce – who served as deputy prime minister under two Coalition governments – claimed reports of the pair duking it out for the leadership ticket were “probably right”.\n\nWhen asked who would take the top spot, Mr Joyce backed Mr Hastie, saying the conservative MP has “got the numbers” to emerge as the winner of a party room revolt.\n\nLiberal leadership aspirant Andrew Hastie previously quit Ms Ley’s shadow cabinet. Picture: NewsWire/Philip Gostelow\n\nAngus Taylor lost the leadership ballot to Ms Ley in May. Picture: NewsWire / Martin Ollman\n\nBut deputy Liberal leader Ted O’Brien claimed there wouldn’t be spill motion against Ms Ley, describing media reports as being “very much overstated”.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\n“I haven’t received calls of canvassing. I haven’t had colleagues ringing me saying there’s a whole bunch of people canvassing,” he said.\n\nSituations like the Coalition split often triggered “a whole bunch of discussions about other possibilities and leadership is one of those things”, he added.\n\n“I don’t believe there will be any change. I think what we’ve seen is Sussan Ley displaying an enormous amount of dignity and strength over recent times, and that is recognised by my colleagues. And so I don’t believe there will be a challenge.”\n\nHis comments were echoed by Liberal backbencher Jane Hume who told Sky News: “There has been no spill call. There has been no demand for action here. Sussan Ley is the leader.”\n\nDespite being asked about Ms Ley’s survival as leader two more times, Senator Hume maintained any commentary around a spill was based on a “hypothetical”.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\n“No one has called for a spill, and a spill can’t happen until there is a party room. We haven’t got a party room for a number of days. There is no call for a spill until that happens,” she said.\n\nJane Hume was adamant no one in the party had called for a spill. Picture: NewsWire / Martin Ollman\n\n“What we need to do is focus on the job to hand, which is holding the government to account and uniting the Liberal Party as the opposition now that the coalition is no longer (together).”\n\nEarlier, Mr Taylor and Mr Hastie’s treatment of Ms Ley was described as unfair by Social Services Minister Tanya Plibersek, who claimed the pair had not given the Liberal leader a “fair go”.\n\n“They’ve been out together since day one. I don’t think Angus Taylor ever got over not winning the leadership in the first place,” she said, referencing Mr Taylor’s loss of the leadership ballot to Ms Ley in May last year.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\n“And Andrew Hastie, he’s been nipping at her heels the whole way through. So it’s been, all in all, a pretty unedifying thing to watch.”\n\nReporters also asked Anthony Albanese about the Liberal leadership spill rumours on the sidelines of the national citizenship ceremony in Canberra.\n\n“My focus is on national unity and on the national interest,” the Prime Minister said.\n\n“The Liberals and the Nationals seem to be focused on themselves, and I think they’ll be marked down for it.\n\n“What we’re seeing is real indulgence from what used to be called the Coalition, but from people who simply don’t like each other.\n\n“And if you can’t govern yourselves, I don’t see how you can be an alternative government of the country.”",
        "source": "Yahoo"
    },
    {
        "url": "https://au.news.yahoo.com/renewed-call-for-councils-to-ban-ugly-trend-sweeping-australian-suburbs-014758043.html",
        "title": "Renewed call for councils to ban 'ugly trend' sweeping Australian suburbs",
        "publish_date": "2026-01-26T01:47:58Z",
        "category": "finance",
        "authors": [],
        "text": "Another Aussie council is facing pressure to ban the use of synthetic turf along nature strips and in new homes.\n\nThe City of Swan in Western Australia is being called upon to follow other Perth suburbs in restricting artificial grass to protect public health and the environment, as the city grapples with a tree canopy crisis.\n\nAcross the country, turf is fast becoming a flashpoint between councils and residents. As homeowners turn to synthetic lawns for their low-maintenance appeal, local governments are pushing back — citing environmental, safety, and heat concerns.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nResident Catherine Dixon said fake lawns are not only ugly, but also contribute to the Urban Heat Island (UHI) effect, which drives up temperatures in Perth's already sweltering suburbs.\n\n“Synthetic turf has been documented to reach temperatures over double or triple the air temperature,” she told The Echo, adding the material is \"significantly hotter\" than natural grass and can put people at risk of burns.\n\nShe is calling for their complete ban and encourages residents to switch to natural grass, plants and trees.\n\n“The trend in new developments installing fake grass is not helping our heat island or tree canopy,” she said. “It looks ugly, weeds still grow, it fades in colour, it doesn’t hold its shape, and it smells.\"\n\nPerth city is grappling with a declining tree canopy. Source: Getty\n\nCity of Swan Mayor Tanya Richardson confirmed the council strongly discourages the use of fake turf, and those who wish to use it require permission from the city.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\n“While the City of Swan does not currently ban the use of synthetic turf on verges, it is discouraged,” she said.\n\n“Waterwise verges with native plants and mulch increase water efficiency and stormwater infiltration, creating a cooling effect, and provide habitat for local wildlife,\" she said.\n\n“Additionally, the greening of verges can be beneficial for human health and wellbeing, improving aesthetics and saving money.\"\n\nPerth's tree canopy crisis amid property development\n\nPerth city has been grappling with a tree canopy crisis as rapid, high-density development infills the city and an invasive pest decimates mature trees.\n\nAccording to Trillion Trees Australia, data shows Perth has the smallest tree canopy of all the Australian cities.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nLast year, authorities went as far as to offer a financial incentive to encourage residents to plant more trees.\n\nPlastics group calls for five-year ban on sports fields\n\nEarlier this month, a plastics research group called for a five-year ban on new synthetic sporting fields.\n\nThey are shedding enormous amounts of waste across suburbs, and creating a threat to human health.\n\nThe call for the moratorium was prompted by a seven-year study by the Australian Microplastic Assessment Project (AUSMAP), which found microplastics and rubber crumb waste are particularly problematic around coastal areas.\n\nThe group’s research director, Dr Scott Wilson, described fake grass as “insidious” and warned that very little is known about the scale of the problems it unleashes.\n\nDo you have a story tip? Email: newsroomau@yahoonews.com.\n\nYou can also follow us on Facebook, Instagram, TikTok, Twitter and YouTube.",
        "source": "Yahoo"
    }
]