[
  {
    "url": "https://www.9news.com.au/world/china-criticises-canadian-and-australian-warships-transiting-taiwan-strait/74dd14b3-3766-4a44-a2d4-698b9c4d4d83",
    "title": "China criticises  Australian and Canadian warships transiting Taiwan Strait",
    "publish_date": "Sat, 06 Sep 2025 23:11:29 +0000",
    "category": "finance",
    "authors": [
      "Sep"
    ],
    "text": "The US Navy and, on occasion, ships from allied countries including Canada, Britain and France transit the strait, which they consider an international waterway, around once a month.\n\nTaiwan\n\nalso considers it an international waterway.",
    "source": "9News",
    "cluster_id": 0
  },
  {
    "url": "https://www.9news.com.au/national/adelaide-norwood-crash-car-smashes-through-alterations-shop/d78d980e-18da-4979-87a2-61767311ac9f",
    "title": "'Miracle no one was hit': Car smashes through alterations shop",
    "publish_date": "Sat, 06 Sep 2025 10:09:32 +0000",
    "category": "finance",
    "authors": [
      "Sep"
    ],
    "text": "A car has gone crashing into an alterations shop in Adelaide, with witnesses hailing it a \"miracle\" that no one was injured.\n\nEmergency crews were called to George Street in Norwood about 11.30am today.\n\nCCTV captured the silver Toyota making a U-turn and swiping three cars before driving onto a footpath on the opposite side of the road.\n\nA car has come crashing into an alterations shop in Adelaide, with witnesses hailing it a \"miracle\" that no one was injured. (Supplied)\n\nThe car was seen knocking over a street sign and narrowly avoiding two women before it crashed into the alterations shop.\n\n\"Very loud, very loud,\" witness Sue Duong said.\n\nWitnesses rushed to help the driver, a 46-year-old man from Kent Town, and called for help.\n\nFirefighters worked to free the man, and the car was later towed away. ﻿\n\nThe driver was treated at the scene for minor injuries and fined for the crash.\n\nThe shop owner told 9News he was inside at the time, but was luckily in the back corner of the store﻿.\n\n\"It's ﻿a miracle no one was hit,\" Duong said.",
    "source": "9News",
    "cluster_id": 1
  },
  {
    "url": "https://www.9news.com.au/national/arthritis-musculoskeletal-conditions-a-leading-cause-time-off-work/34396e6c-08d3-4ba9-8fa7-f4083284c446",
    "title": "Sharyce looks perfectly healthy but hasn't been able to work in years",
    "publish_date": "Fri, 05 Sep 2025 21:05:15 +0000",
    "category": "lifestyle",
    "authors": [
      "Sep"
    ],
    "text": "Sharyce Helyar looks perfectly healthy but she hasn't been able to work in years.\n\n﻿The 27-year-old from Adelaide lives with arthritis, which is the second most common cause for time taken off work in Australia (after traumatic injury).\n\nIt's also the second most common cause of early retirement due to ill-health.﻿\n\nSharyce Helyar, 27, looks perfectly healthy but she hasn't been able to work in years. (Supplied)\n\nBy 2030, the ﻿loss of personal income due to arthritis is projected to hit $2.6 billion.\n\nBut many Australians still mistakenly believe someone Helyar's age couldn't have arthritis, despite the fact she's been living with it for more than 20 years.\n\nAlmost 65 per cent of Australians mistakenly believe arthritis mainly affects people over 65, according to new YouGov polling commissioned by Arthritis Australia.\n\nBut two-thirds of the 4.11 million cases in Australia are in working-age adults, young people and children.\n\nIn fact, Helyar was just four when she was diagnosed with ﻿juvenile idiopathic arthritis.\n\nShe was later diagnosed with ﻿psoriatic arthritis as well and has been been managing joint pain, swelling, stiffness, and fatigue ever since.\n\nIt held her back at school and though she tried to power through at university, it eventually forced her to abandon a ﻿degree in medical radiation science.\n\n\"I think there was a lot of pressure I put on myself because I wanted to be a normal young adult, and I wanted to have the uni experience,\" Helyar told 9news.com.au.\n\n\"I didn't want my arthritis, my disability to stop me from doing that.\"\n\nHelyar was just four when she was diagnosed with juvenile idiopathic arthritis. (Supplied)\n\nMore than 70 per cent of Aussies underestimate the burden of arthritis and fail to recognise that it and other musculoskeletal conditions a leading cause of time taken off work.\n\nFor almost four years of study, Helyar underestimated it too.\n\nShe thought she was managing her pain and fatigue ﻿well at uni, only to land in the emergency department in her fourth year.\n\nHer body could no longer keep up with the physical demands of her degree placements.\n\nUltimately, Helyar had to give up on her dream of a career in medical radiology.﻿\n\n\"My body just wasn't able to do what I physically wanted it to do,\" she said.\n\n\"I had to reassess everything in my life, which was really confronting and scary, and a lot of grief went with it, because I had my life mapped out out and now it all had to change.\"\n\nREAD MORE: Joe Biden undergoes surgery to remove skin cancer on forehead\n\nThe five qualifications in hot demand for Australia's future jobs View Gallery\n\nThe university worked with Helyar to help her graduate with a different degree but her arthritis has made it impossible for her to enter her chosen industry.\n\n﻿She's also been unable to return to part-time or gig work she did while studying.\n\nAfter 22 years with arthritis, permanent damage has been done to her joints and the pain and stiffness she experiences has become harder to manage.﻿\n\nThe fatigue has become so severe Helyar can usually only leave the house twice a week before her body gives out.\n\n﻿\"I'm unable to work until I find a solution,\" she said.\n\n\"And there might not be a solution for my pain, and my fatigue might not get better.\"\n\nArthritis is incurable, so Helyar's chances of entering the workforce are limited by her treatment options.\n\nBut funding for arthritis research is limited and ﻿not being able to earn a living in a cost of living crisis is a scary prospect.\n\nHelyar is just one of the ﻿2.8 million working-age Australians living with arthritis who face uncertain futures.\n\nBy 2030, the ﻿loss of personal income due to arthritis is projected to hit $2.6 billion, costing the government more than $1.1 billion a year in extra welfare payments and lost taxation revenue.\n\nLost GDP from ﻿arthritis-related early retirement is expected to reach $9.4 billion a year by 2030 as well.\n\nEven if Helyar was able to work, there's no guarantee that employers would be undersanding of her health needs.\n\nIn the past, Helyar chose not to disclose her condition to employers out of fear they would make assumptions about her ability to do a job.\n\nREAD MORE: Officer killed in Porepunkah shooting farewelled at Victoria Police Academy\n\nHelyar was forced to abandon her career goals because of her invisible illness. (Supplied)\n\n﻿\"People make the assumptions and you can see that they're thinking something, even if they don't actually say it,\" she said.\n\n\"There's definitely a lot of misconceptions about arthritis being an 'older person' condition, people just aren't aware that it affects people of all ages and in a variety of ways.\"\n\nThose misconceptions go beyond the workplace as well.﻿\n\nSome people assume that because she's young, her arthritis ﻿must be less painful or more manageable.\n\nOthers judge her when they see her using mobility aids like a wheelchair when her symptoms make it hard to walk.﻿\n\nBut arthritis can be just as debilitating for a 20-something as it can be ﻿for someone in their 80s.\n\nSince her health declined at uni, Helyar has had to move back home and currently relies on her family for support with ﻿everyday tasks like cleaning, shopping and laundry.\n\nIt's a far cry from the radiology ﻿career she had envisioned for herself, but she's found new purpose through advocacy.\n\nHelyar now puts her energy into advocacy, especially championing other young people with arthritis. (Supplied)\n\nThis week﻿ she even attended a parliamentary event alongside Prime Minister Anthony Albanese to raise awareness of the impact arthritis has on Aussies of all ages in recognition of Arthritis Australia's 75th anniversary.\n\n\"We need more awareness that it does affect people of all ages, and it is a disability, it's not just a small condition that doesn't impact life in a big way,\" Helyar said.\n\n\"The more people talk about it and are open about their experiences with it, the more people will learn.\"\n\nHave you got a story? Contact reporter Maddison Leach at mleach@nine.com.au",
    "source": "9News",
    "cluster_id": 2
  },
  {
    "url": "https://www.9news.com.au/world/elon-musk-could-be-worlds-first-trillionaire-new-tesla-deal/3b6cc294-56e8-443b-84e7-9bd22e5858f5",
    "title": "Tesla proposes Elon Musk pay package that could make him the world's first trillionaire",
    "publish_date": "Fri, 05 Sep 2025 14:41:20 +0000",
    "category": "finance",
    "authors": [
      "Sep"
    ],
    "text": "Elon Musk, already the world's richest person, could become the first trillionaire after the Tesla board unveiled a massive new pay package for its CEO to keep his focus on the troubled EV maker.\n\nThe package would grant him additional shares of Tesla stock if the company is able to grow far beyond its current value, with a market capitalisation far greater than any company has ever approached. Musk's previous pay package, which added significantly to his massive wealth, also laid out ambitious growth plans that once appeared to be a reach – but which Tesla proved able to reach easily.\n\nThe new pay package could grant Musk 423.7 million additional shares of Tesla stock. Those shares would be worth $US143.5 billion ($218.6 billion) at today's stock value.\n\nElon Musk could become the world's first trillionaire if shareholders adopt a new proposal that would give him unprecedented sums of money if the company reaches certain ambitious milestones. (Andrew Harnik/Getty Images via CNN Newsource)\n\nBut Musk would get those shares only if the value of Tesla stock increases significantly in coming years. The company stock would need to reach an overall value of $US8.5 trillion ($12.95 trillion) for Musk to get all the shares, significantly above the current market capitalisation of $US1.1 trillion ($1.68 trillion).\n\nThose 423.7 million new shares that Musk would get under this package would be worth close to $US1 trillion ($1.52 trillion) should the company hit the increased valuation targets spelled out in Friday's proxy statement.\n\nIf Tesla shares are able to reach the $US8.5 billion market capitalisation value, it could become the most valuable company ever. It would be worth roughly double the current market value of Nvidia (NVDA), the current most-valuable company on the market. Tesla is already the most valuable automaker by a large margin, even though legacy automakers, like second-most valuable automaker Toyota, sell far more vehicles and now make more profits.\n\nProposal for Tesla in invest in xAI\n\nThe company's proxy statement that laid out Musk's payment plan also included a shareholder proposal that Tesla take a stake in privately-held xAI, the artificial intelligence company that Musk also owns. That could help Elon Musk further consolidate his growing business empire.\n\nXAI recently purchased X, the social media platform formerly known as Twitter, which Musk bought for $US44 billion of his own money in 2022. The company did not take a position for or against that shareholder proposal, which does not give any details of how large a stake Tesla should take in xAI, and what price.\n\nBut any such investment could further enrich Tesla since Musk is the primary owner of xAI.\n\nREAD MORE: Fears accused killer Dezi Freeman could be down a mine shaft\n\nIf Tesla shares are able to reach the $US8.5 billion market capitalisation value, it could become the most valuable company ever. (AP)\n\nMusk currently owns 410 million shares of Tesla shares, worth $US139 billion at Thursday's closing price. That stake, along with his stakes in xAI, rocket company SpaceX, and several other companies he has started and runs, have made him the richest person on the planet, worth $US378 billion according to Bloomberg's billionaire tracker.\n\nHe currently has options to buy an additional 304 million shares of Tesla, but a judge in Delaware has twice struck down that 2018 pay package that granted him those options as illegal. Those rulings came despite overwhelming approval by Tesla shareholders – twice. The company again has tried to grant those options to Musk this year, and adding in those options, he now owns 18 per cent of the company's shares.\n\nTesla shares nearly doubled in value to a record-high price for its shares between election day and mid-December 2024, as investors bet that his close ties to US President Donald Trump would be a boon for Tesla. But as Tesla faced protests and dropping sales and falling profits in backlash to those ties (before he had a falling out with Trump), all those things resulted in Telsa's stock losing those gains. The shares have recovered some of those losses, but they are still down 26 per cent from the December peak.\n\nStill, Musk and his fans on Wall Street have insisted the company is well positioned to grow even larger and more successful in the future. He has continued to predict that his plans for self-driving cars – including a robotaxi service – will create massive profits and value for shareholders. The robotaxis would provide rides to passengers and also allow Tesla owners to rent out their cars for driverless rides when not in use.\n\nTesla shares nearly doubled in value to a record-high price for its shares between election day and mid-December 2024, as investors bet that his close ties to US President Donald Trump would be a boon for Tesla. (AP)\n\nMusk has also promised a line of humanoid robots that could bring in even more sales than Tesla's car business.\n\nKeeping Musk focused on Tesla\n\n\"It's a big pay package but Tesla needs to keep its biggest asset in Musk as CEO,\" Wedbush Securities analyst Dan Ives told CNN on Friday. Ives is one of the bigger Tesla bulls on Wall Street.\n\n\"In this AI era Musk now will drive its next leg of growth,\" Ives added. \"The Board had a $1 trillion decision and made the right one.\"\n\nThe board's proxy statement spoke of the importance of keeping Musk focused on Tesla going forward. In addition to his many business interests, he remains active in politics, despite his falling out with Trump. He has announced plans to form a third political party.\n\nTesla, in its proxy statement, warned that it needed to incentivise Musk to focus his attention on growing the company. It said that during the negotiations on the pay package, \"Musk also raised the possibility that he may pursue other interests that may afford him greater influence if he did not receive such assurances.\"\n\nThe board said it \"believes that Mr Musk singularly possesses the leadership characteristics necessary to transform Tesla and realise its long-term mission at an unparalleled level\".\n\nMusk currently owns 410 million shares of Tesla shares, worth $US139 billion at Thursday's closing price. (AP)\n\nBut the company said it is also making plans for life after Musk, saying it is already working on succession plans. And it said that one of the terms of the employment package that Musk must meet to receive the final 70 million shares of stock is that he needs to have \"developed a framework for Chief Executive Officer succession\".\n\n\"The board regularly discusses management succession planning and leadership development,\" said the proxy statement. It said those succession plans are \"for both sudden, unanticipated events, in addition to longer-term planned succession for its executives\". It said it \"believes that management has developed a robust pipeline of seasoned leadership talent within Tesla,\" and that is also looking at possible external talent.\n\nMusk does not receive a cash salary from Tesla. All of his compensation comes from Tesla shares and options he has been granted in the past. Since there is still an ongoing court fight over the 304 million options, Musk has not received any compensation for nearly a decade, since a 2012 pay package made its last disbursement of options to him in 2017.\n\nBut not all tech billionaires receive additional stock options or grants as compensation, instead benefiting from the increased valuations of their existing stakes in their companies. That includes Amazon founder Jeff Bezos and Mark Zuckerberg, who co-founded Facebook. Both took large stakes in their companies as founders, but neither has received stock grants or options since those companies had initial public offerings in 1997 and 2012, respectively.\n\nTesla faced protests and dropping sales and falling profits in backlash to Musk's ties to Donald Trump. (Getty)\n\nIf Musk and his fans are right, Musk would become far wealthier even without any additional shares of Tesla stock. His current holdings of 410 million Tesla shares, even without the disputed 304 million options, would be worth nearly $US1 trillion more than today's valuation, should Tesla's market cap rise to $US8.5 billion.\n\nDespite promises, Tesla faces problems\n\nBut to achieve that target, it would have to start doing the things Musk is promising in terms of self-driving vehicles and its robotaxi. And that would mean meeting grand claims from a man and company that have often fallen short of their promises.\n\nTesla critics say that the stock has become grossly overvalued because of Wall Street's willingness to buy into Musk's vision of the future in terms of AI, self-driving vehicles and robots, despite its failures to deliver on past promises along those lines.\n\n\"Elon Musk has been saying since 2014 'we will have a fully autonomous car next year'. It hasn't happened, but that promise has been valued in the billions by Wall Street,\" said analyst Gordon Johnson, one of the harsher critics of Tesla. \"Elon Musk is a master manipulator. He's been able to keep the stock elevated. The reason the board is paying him is he's willing to say things that other CEOs aren't willing to say or get away with.\"\n\nThe richest man's relationship with the president eventually soured before he abandoned the administration. (AP)\n\nTesla is facing growing competition from Chinese EV makers. BYD, one of those Chinese automakers, is poised to pass Tesla for the most EV sales worldwide, even though it is not available for sale in the United States.\n\nTesla also faces competition from other companies that are ahead of it in providing robotaxi services, including Waymo, the autonomous vehicle unit of Google parent Alphabet, which has its own service and has partnered with Uber in some cities.\n\nAnd a change in US law is about to remove a $7500 tax credit for buyers of most electric vehicles, which could cause prices and sales of those vehicles to fall sharply.\n\nUS law also recently removed the billions of dollars in penalties that traditional automakers have had to pay if their gas-powered vehicles exceed emissions rules. The way that they avoided those payments in the past was by buying regulatory credits from an EV maker like Tesla. But the payments that brought billions in revenue to Tesla will now vanish.\n\nJohnson said that Tesla's stock price is therefore unlikely to hit the ambitious targets laid out in this Musk pay package.\n\nMusk has also promised a line of humanoid robots that could bring in even more sales than Tesla's car business. (AP)\n\n\"Things are going to get worse for them, not better,\" said Johnson. \"Is Tesla going to go to $8 trillion? Abso-f---ing-lutely not.\"\n\nShares of Tesla (TSLA) were up about 5 per cent in early trading on the news.",
    "source": "9News",
    "cluster_id": 3
  },
  {
    "url": "https://www.9news.com.au/finance/australia-house-prices-forecast-rise/4d279b6b-fd04-4235-b30e-c34c337abebd",
    "title": "Think house prices are bad now? They're about to get much worse",
    "publish_date": "Fri, 05 Sep 2025 05:53:57 +0000",
    "category": "finance",
    "authors": [
      "Sep"
    ],
    "text": "Australians wanting to buy their first home are about to find that already-tricky task even more difficult, with house prices set to rise by as much as $154,000 by the end of next year.\n\nWestpac has forecast that dwelling prices will increase by 6 per cent this calendar year before a further 8 per cent hike in 2026, thanks in part to the Reserve Bank's three recent interest rate cuts.\n\nAccording to Canstar, those increases would see Sydney's median house price rise by a little more than $154,000 between now and the end of next year, taking it up to about $1.67 million.\n\nHouse prices are set to continue rising sharply over the coming months. (Sitthixay Ditthavong)\n\n\"Sydney's median house price could rise by up to $154,000 by the end of next year if house prices rise in line with Westpac's dwelling price forecast,\" Canstar data insights director Sally Tindall said.\n\n\"For those already in the market, that's welcome news for their equity. For those still saving, the deposit hurdle is likely to get a whole lot steeper, not to mention the difficulty in clearing a bank's serviceability test.\n\nSix-figure price rises would also hit Melbourne and Perth if Westpac's forecasts play out, with the Victorian capital joining Brisbane and Sydney in breaking the $1 million median house price barrier. ﻿\n\n\"Melbourne is shaping up as the comeback city in 2026, with double-digit growth on the cards, according to Westpac,\" Tindall said.\n\nREAD MORE: Officer killed in Porepunkah shooting farewelled\n\nLower interest rates, coupled with low supply and high demand, have helped push prices up. (Joe Armao/The Age)\n\n\"This could see Melbourne's median house price go above the million-dollar mark, which for many first home buyers will be a psychological barrier that makes it feel like the goal posts keep moving further away.\"\n\nThe forecasts for price rises have been driven by easing interest rates, as well as the chronic undersupply and high demand that has been plaguing Australia for years.\n\nHowever, while the Reserve Bank is expecting to hand down at least one more cut this year, and potentially another in early 2026, ANZ today warned that the cash rate may be left where it currently stands following stronger-than-expected GDP figures this week.\n\n\"If evidence of consumer spending momentum continues and weakness does not emerge in the CPI or labour market data, the RBA may assess the cash rate as broadly neutral with no further cuts needed,\" the big four bank's head of Australian economics, Adam Boyton, said.\n\nTindall said unexpectedly high rates could throw something of a spanner in the housing price works.\n\n\"You don't have to look too far back to see how quickly market expectations can change when conditions do,\" she said.\n\n\"The danger is, Australians will borrow to the limit, banking on prices continuing to climb. If circumstances change – whether that's interest rates, job security or the economy – it could leave some households overexposed.\n\n\"The more households borrow, the more vulnerable they become to rate rises or shocks to employment.\"",
    "source": "9News",
    "cluster_id": 4
  },
  {
    "url": "https://www.abc.net.au/news/2025-09-07/federal-perth-mp-wants-burswood-street-circuit-scrapped/105744928",
    "title": "Labor MP calls for WA government to scrap controversial street circuit plans",
    "publish_date": "Sun, 07 Sep 2025 01:32:37 +0000",
    "category": "finance",
    "authors": [],
    "text": "One of WA's highest-ranking Labor MPs has called on the state government to abandon controversial plans to build an entertainment precinct and street circuit in Burswood.\n\nThe $217 million project first proposed in the lead-up to the March state election was pitched as a street circuit for motorsports and cycling which would attract tourists and generate tens of millions of dollars in economic benefits.\n\nBut it's been vocally opposed by nearby residents, the Greens and the Liberals, with opposition leader Basil Zempilas constantly using it as an example of what he says are the state government's wrong priorities.\n\nThe site of the WA government's proposed Burswood Park multi-use community hub and racetrack. (ABC News: Glyn Jones)\n\nNow, the federal member for Perth and Assistant Minister to the Prime Minister, Patrick Gorman, has added his voice to the opposition.\n\n\"It is no surprise to anyone that as the Member for Perth my longstanding and firm view is that the Burswood Racetrack should not proceed,\" he said in a statement.\n\n\"As a local member I have heard extensive concerns from local constituents and community groups about the significant loss of amenity, environmental impacts and impacts on future housing developments.\n\nMr Gorman says community concerns have been amplified since the release of the WA government's consultation report. (ABC News: Keane Bourke)\n\n\" These concerns started immediately after the election commitment was announced and have amplified since the release of the consultation report. \"\n\nThat report, which suggested there was broad support for the project, was slammed as spin by the Save Burswood Park Alliance which is rallying community voices to oppose the development.\n\nPremier not backing down\n\nA spokesperson for Premier Roger Cook hit back at Mr Gorman's opposition, saying a letter he recently sent contained \"a number of factual errors\".\n\n\"For example, Mr Gorman asserted the precinct was being developed for numerous motorsport events — that's wrong,\" they said.\n\nRoger Cook has continued to defend the project, which he said would bolster WA's tourism economy. (ABC News: Keane Bourke)\n\n'Rita's racetrack' divides opinion Photo shows WA Premier Roger Cook smiles as he sits in a racing car. The WA government's controversial $217 million plan to build a street motorsport circuit at Perth's Burswood Park has incurred the wrath of many — and don't dare call it a motorplex.\n\n\"In fact, it will host one Supercars event a year, with the precinct being available for a range of other community events throughout the rest of the year, including cycling, as well as concerts at the new amphitheatre.\n\n\"Mr Gorman also incorrectly suggested there would be a loss of urban canopy and green space, when our plan will actually see an increase in the number of trees and natural amenity.\n\n\"While we are always interested in the views of our federal representatives, we think it would be most appropriate for Mr Gorman to spend his time in Canberra helping us to secure WA's fair share of infrastructure spending and aged care beds.\"\n\nRare rift\n\nMr Gorman said Mr Cook was leading \"one of the best\" state Labor governments he had ever seen, and that gave him hope the premier would address community concerns.\n\n\"The Cook Labor Government will always have my support and the best way I can support them now is to help build a new fair, transparent, and inclusive consultation process including a new and open site selection process,\" Mr Gorman said.\n\nOpponents to the plan have been vocal about their concerns. (ABC News: Phoebe Pin)\n\nSuch public disagreement over a major policy has been a rarity in the Western Australian Labor Party in recent years which has been defined by its solidarity.\n\nBut it does come after Mr Cook and his ministers spent weeks decrying a lack of aged care support from the federal Labor government, especially when it comes to home care packages — an issue which they have blamed for adding pressure to already overflowing hospitals.",
    "source": "ABC",
    "cluster_id": 5
  },
  {
    "url": "https://www.abc.net.au/news/2025-09-07/fervor-wines-started-by-father-and-son-during-pandemic/105734296",
    "title": "Pandemic distance did not stop father and son starting wine label",
    "publish_date": "Sun, 07 Sep 2025 00:59:36 +0000",
    "category": "finance",
    "authors": [],
    "text": "When the COVID pandemic resulted in hard borders between states, winemakers Callum and Michael Garland embarked on a new venture together despite being thousands of kilometres apart.\n\n\"It was a way to feel like we were doing something together and side by side, even though we were sort of 3,000km away,\" Callum said.\n\n\"It was a way of keeping in touch and keeping connected. It was our common love I suppose,\" Michael said.\n\nCallum was in Geelong, Victoria after spending years pursuing his winemaking dream interstate and abroad, while his father was in Western Australia's Great Southern region.\n\nIn 2021, the pair launched Fervor Wines and began independently making wines under the same label.\n\nMichael Garland and a young Callum at Garland's winery in Mount Barker. (Supplied)\n\nSome of Callum's first wines, Fervor Nonna Diana and Fervor Nonno Lou, were created in honour of his grandparents.\n\nThe father and son now work side by side on Western Australia's southern coast, but the seeds for the venture were sown many years earlier.\n\nSurrounded by winemaking at early age\n\nWith fond early memories of growing up at the family winery, Garland's, and birthdays celebrated mid-vintage, winemaking was synonymous with family for Callum.\n\n\"I remember Mum taking me up there and being at the cellar door,\" he said.\n\n\"That's one of my first memories, being at our winery in Mount Barker and running around and annoying Dad.\"\n\nWhile Callum was immersed in the industry from day dot, it was not until he began working harvest to save for university that his career vision and the world of wine combined.\n\nAnd his ideas for winemaking were closely intertwined with those of family.\n\nBut by this point, Michael had sold the family vineyard and was working at other wineries.\n\nCallum Garland says his earliest memories are of the family winery and vineyard. (Supplied)\n\n\"I've been hassling Dad since I got into the wine industry,\" Callum said.\n\n\"Halfway through the first harvest, I was like, 'No, this is what I want, we should do our own thing again, we should do something together.'\"\n\nCallum, who was a finalist in the Australian Young Gun of Wine awards last year, returned home in early 2024 to work alongside his father as an assistant winemaker and vineyard manager.\n\n\"Bringing back these wines that Dad hadn't tasted before, and we've only talked about over the phone and seeing his joy … that was a pretty special moment,\" Callum said.\n\n\"It's a very, very special place and I probably drank more Great Southern wine in Victoria than I actually did ever, and it fostered a love for this region.\n\n\"And the opportunity to work side by side with Dad was huge.\"\n\nCallum Garland (right) returned to Western Australia to work with his father Michael. (ABC News: Samantha Goerling)\n\nLaunching a \"tiny\" label together, the duo's expectations have been surpassed.\n\n\"We were planning on just making, 200 or 300 case batches just from really tiny vineyards,\" Michael said.\n\n\"Then of course, if you're selling out, you start making more.\n\n\"We're still not very big, only about 3,500 thousand cases.\"\n\nA sense of place\n\nCurrently selling to the domestic market, Michael said they saw growth opportunities in South-East Asian markets.\n\n\"We've just got our first order last week from Singapore, so that's exciting and there's lots of others irons in the fire,\" Michael said.\n\n\"We'll probably be aiming at lots of small markets rather than one big market, having seen what happens in the wine industry when you put a lot of reliance on one market.\"\n\nFervor Wines has leased the Gibraltar Rock vineyard in the Porongurups. (ABC News: Samantha Goerling)\n\nTo fill the barrel, they have recently taken on a second vineyard lease at Gibraltar Rock in Porongurup, with a vista of the Stirling Range.\n\n\"Half the time you're actually in the clouds,\" Michael said.\n\n\"That delays the ripening so you're picking very, very late in the season … so the grapes actually have more flavour.\"\n\nThe block is a mix of old and new wine riesling, shiraz, chardonnay and pinot.\n\n\"If a sense of place means anything, this is a very special site,\" Callum said.\n\nHe is also looking forward to the second vintage with his father since he returned to WA.\n\n\"It's always nice, even picking grapes together on early mornings in harvest when we're tired, but we're side by side and working together, that's really the best bits,\" Callum said.",
    "source": "ABC",
    "cluster_id": 6
  },
  {
    "url": "https://www.abc.net.au/news/2025-09-07/young-apprentices-keep-butcher-trade-alive-in-clermont/105723796",
    "title": "Young apprentices keep butcher trade alive in country town",
    "publish_date": "Sun, 07 Sep 2025 00:40:14 +0000",
    "category": "finance",
    "authors": [],
    "text": "When it came to deciding on a profession after leaving school, Lilly Reeves did not expect she would be carving out a career as a butcher.\n\nAmid sides of meat hanging at ceiling point and the sound of an electric bandsaw cutting through bone, the 17-year-old throws on her striped apron and sharpens her array of knives ahead of another day, learning the art of butchery.\n\n\"I guess I saw Dad doing it and thought it was pretty good,\" she said.\n\n\"Learning all the different cuts, slicing … it's all pretty good.\"\n\nIt is a Friday morning and the butcher shop in downtown Clermont, a small rural and mining town in central Queensland, is abuzz with regulars stocking up for the weekend.\n\nLilly Reeves is one of two apprentices working at the Clermont shop in central Queensland. (ABC Capricornia: Aaron Kelly)\n\nIt is a stark contrast to an industry that, in many places, is a dying trade.\n\n\"We've been going just over two years now … it's a good little family operation,\" Lilly's dad Steve said.\n\n\"The butcher shop had closed down out here for nearly 12 months and everyone [in town] missed it, we did.\n\n\" We'd drive past and look in and [check] … if we'd see a sign if the shop had re-opened, and in the end, we thought we'd have a crack at it. \"\n\nCountry butchers vital\n\nFrom meat trays for the footy club's fundraising raffles to supplying meat to the local pub, butcher shops are the lifeblood of Australia's smaller regional towns.\n\nWith over two decades of experience as a butcher, Mr Reeves has seen the slow decline of small town butcher shops.\n\nBut his business is going against the grain.\n\nHe has doubled his staff, which includes two apprentices, since the re-opening of what he calls the \"old-school butcher shop\".\n\nIt is all hands on deck for the Reeves family, with Lilly, Jasmine and Steve behind the counter. (ABC Capricornia: Aaron Kelly)\n\nAlong with Lilly, Steve's eldest daughter, Jasmine, 19, and son, Rhys, 16, work at the shop.\n\n\"I think butchering is a dying trade,\" Mr Reeves said.\n\n\" It's hard to find a [qualified] butcher these days. We need to train them up and that's where my kids come in and a few young local lads are keen to do it too. \"\n\nWith a population of about 3,000, keeping local businesses alive is important for the town, located 4 hours north-west of Rockhampton.\n\nMr Reeves said there needed to be more support for young apprentices who were facing cost-of-living pressures to keep them in the industry.\n\n\"With the mines they've obviously got attractive salaries and stuff like that, but I think in a small business like this, the main thing is keeping a good relationship with the staff,\" he said.\n\nThe local butcher shop is the lifeblood of smaller towns. (ABC News: Bec Whetham)\n\nRewarding and enjoyable career\n\nThe Australian Meat Industry Council said the \"local butcher\" played a key part in communities, particularly in remote, regional areas.\n\n\"Just look at the recent natural disasters such as floods and cyclones, often it's the butcher that is the last shop open in town,\" the council's chief executive Tim Ryan said.\n\n\"Of late, we have also seen an increase in consumer shopping at the local butcher, which has been positive and particularly so.\"\n\nTim Ryan is encouraging young people to get into the trade to overcome skilled staff shortages. (Supplied: Australian Meat Industry Council)\n\nMr Ryan said there were many factors behind the resurgence of consumers choosing the butcher over supermarkets.\n\n\"They're far more flexible in [responding to] changing consumer needs and that's probably the real strength of your local butcher shop,\" he said.\n\n\"You really get that tailored service and bits of advice on how to prepare a meal and the products they offer can change from day to day.\"\n\nThe industry says customers are on the increase, with butchers offering a tailored service. (ABC Rural: Daniel Fitzgerald)\n\nMr Ryan agreed finding and retaining qualified staff and apprentices was difficult.\n\n\"Across the board, finding people is really challenging in the industry, particularly getting the right skills,\" he said.\n\nWomen overcoming stereotypes\n\nApprentice butcher Lilly Reeves is determined to keep her trade alive and cut through stereotypes.\n\nShe is part of a mostly female team back in Clermont, and according to Mr Ryan, has joined a growing list of young women getting into the meat industry.\n\n\"We're actually seeing a broader trend in terms of numbers of females actually wanting to be in the industry and breaking the stigma that butchery is a male trade,\" Mr Ryan said.\n\nMore women are getting into the meat industry. (ABC Capricornia: Aaron Kelly)\n\n\"Over time we can change this image in people's minds and being able to promote young females coming through helps attract more young females in the future.\"\n\nAs she handles another slab of meat to slice up, Ms Reeves is bucking a trend in more ways than one.\n\nHalfway through her apprenticeship, the country teen said she was planning for a future in her chosen trade.\n\n\"We're thinking of opening up slaughter yards [down the track], so I might give that a crack and see how that goes.\"",
    "source": "ABC",
    "cluster_id": 7
  },
  {
    "url": "https://www.abc.net.au/news/2025-09-07/vintage-caterpillar-tractors-on-display-kojonup-west-australia/105743876",
    "title": "WA's agricultural history celebrated at $20m vintage tractor gathering",
    "publish_date": "Sun, 07 Sep 2025 00:04:26 +0000",
    "category": "finance",
    "authors": [],
    "text": "In a muddy field in country Western Australia, a slice of history rolled into town.\n\nThe farming town of Kojonup is usually bathed in a sea of yellow in September as the canola crops come into bloom.\n\nBut on the outskirts of the grain and sheep farming community, 300 kilometres south of Perth, one field was coloured yellow for a different reason.\n\nSome of the tractors at the show were 100 years old. (ABC Great Southern: Andrew Chounding)\n\nMore than 100 new and vintage tractors were trucked in from across the state to celebrate 100 years since the first Caterpillar was used in WA at the Sunnydale Vintage Day on Saturday.\n\n\"There's a lot of history to some of these machines,\" Kojonup farmer Peter Spurr said.\n\n\"There are a couple of machines here, they've got a lot of very good stories behind them.\"\n\nMr Spurr estimated the total value of the collection at $20 million.\n\nPeter Spurr with his 100-year-old Holt Caterpillar. (ABC Great Southern: Andrew Chounding)\n\nMore than machines\n\nThe farmer and prolific tractor collector, who laid claim to owning the oldest tractor in the show, a 100-year-old Holt Caterpillar, said the vintage machinery was an important part of the country's history.\n\n\"They opened the country up from the early 1920s all the way right through to the 60s, clearing farms,\" he said.\n\n\" It just opened up agriculture in WA and across Australia in general. \"\n\n\"It's very special to have this machinery around, still active; it's just a testament to the brand… to see the oldest to the latest here today, and it's all still in fairly good working order.\"\n\nAbout 1,000 people attended the event. (ABC Great Southern: Andrew Chounding)\n\nMr Spurr has more than 100 \"bits of gear\" in his personal collection.\n\n\"One day it will be too many, but at the moment I'm still collecting,\" he said.\n\nFar from gathering dust, the farmer said each machine had a role to play.\n\n\"They still get out to do a special job every now and again, so they're not quite completely tucked away in the shed,\" he said.\n\n\"They're still pretty active on the farm.\"\n\nAn iconic hue\n\nIn 1931, the brand changed the colour scheme of its tractors to hi-way yellow to increase visibility and safety, but the oldest and most historic still retain the original battleship grey paint job.\n\nThe vintage tractors were displayed at a farm in Kojonup. (ABC Great Southern: Andrew Chounding)\n\nOne of those early grey tractors, a Caterpillar Sixty that helped shape WA, belongs to Bob Lukins.\n\n\"The old Caterpillar Sixty, from 1928, was used mainly in the early days to clear the Albany Highway,\" he said.\n\n\"They used it to pull the trees down.\n\n\"It's got MRD stamped on the chassis of the tractor — that was the main road board in those days.\"\n\nBob Lukins's Caterpillar Sixty was used to clear the Albany Highway. (ABC Great Southern: Andrew Chounding)\n\nA founding member of the WA Vintage Tractor and Machinery Association, and a vintage tractor collector, Mr Lukins said he had no idea of the Sixty's history when he purchased the machine, which now holds a special place in his collection.\n\n\"I got quite excited about that because Albany Highway is a major road, and this tractor was part of that history,\" he said.\n\n\"It's the only one in Western Australia, so it's quite a rare old tractor.\"\n\nThis vintage Caterpillar Diesel Forty was part of the display. (ABC Great Southern: Andrew Chounding)\n\nMore than 1,000 people attended the event, which Mr Lukins said took months of planning to consolidate the more than 100 tractors, graders, and bobcats into one location.\n\nA feat that would likely go unmatched for some time.\n\n\"We'll never ever see a collection of Caterpillars ever again like this, I don't think so,\" he said.",
    "source": "ABC",
    "cluster_id": 8
  },
  {
    "url": "https://www.abc.net.au/news/2025-09-07/wa-health-portfolio-carve-up-is-it-working/105742308",
    "title": "How the WA government's health carve-up is performing",
    "publish_date": "Sun, 07 Sep 2025 00:00:24 +0000",
    "category": "finance",
    "authors": [],
    "text": "It's almost six months since a large WA Labor Government remained, well, large and still in charge.\n\nOn March 8, Premier Roger Cook finally stepped out from the shadow of predecessor Mark McGowan, romping to victory in the state election.\n\nThe former health minister made his first order of business a bold re-shaping of his old beat, arguably the most challenging portfolio confronting a government.\n\nIt raised eyebrows at the time.\n\nFirst-time minister Meredith Hammat was handed the health and mental health portfolios, backed by an additional four ministers — responsible for health infrastructure, aged care and seniors, medical research and the brand new preventative health ministry.\n\nMeredith Hammat has had a challenging start to life as WA health minister. (ABC News: Keane Bourke )\n\nThe government said it was the right choice to bring a \"team approach\" to a big portfolio, and experts largely agreed.\n\nSo, has it worked having five ministers working under the same umbrella? It depends on who you ask.\n\nDivision of Labor\n\nIf the past two months have demonstrated anything, it's that Ms Hammat has a tough job — even with a lightened workload.\n\nA worse-than-expected flu season combined with our ageing population forced the Department of Health's hand to reschedule over 100 elective surgeries in August following \"unprecedented\" emergency department demand.\n\nThe state then recorded back-to-back record ambulance ramping figures.\n\nWA sets new ambulance ramping record Western Australia again breaks the state record for the amount of time ambulances spent ramped outside hospitals, despite more than 100 elective surgeries being postponed to ease pressure.\n\nAmid this came a barrage of questions over the state of Sir Charles Gairdner Hospital in Nedlands.\n\nIt resulted in the government coughing up $50 million for maintenance at WA's ageing hospitals.\n\nHaving a seasoned minister like John Carey, already used to dealing with his tricky housing portfolio, copping the flak for infrastructure issues would have eased the load on Ms Hammat.\n\nBut the WA opposition hasn't seen the distribution of the vast portfolio as a sign of leadership.\n\n\"By spreading it around, what they've also done is spread the blame,\" opposition leader Basil Zempilas said.\n\nWA opposition leader Basil Zempilas says the government needs to do more to ease the health crisis. (ABC News: Courtney Withers)\n\n\"We've seen a conga line of finger pointing in different directions.\n\n\"When there's been a specific issue, often the minister's [Ms Hammat's] first reaction is to say 'Oh no, that's not me, that's one of the other health ministers — you'll have to go and speak to them' … that's not good enough.\n\n'Laser-like focus'\n\nIt's something the Australian Medical Association (AMA) is also concerned about.\n\n\"We're very very cautiously optimistic, but if we start to see that there's deliberate handballing to prevent taking responsibility for key issues, then I'd be having a very different conversation,\" AMA WA President Dr Kyle Hoath said.\n\nThe government thinks the health ministry is operating well as a team.\n\nDr Kyle Hoath is the AMA WA president. (ABC News: Courtney Withers)\n\n\"It's tough, we know it's tough, but my government is up for the challenge,\" a confident Roger Cook told reporters in Exmouth on Friday.\n\nLikewise, a government spokesperson said a team of ministers with a \"laser-like focus on different aspects\" of health was \"the best way\" to address complex challenges.\n\n\"Together, under the leadership of Health Minister Meredith Hammat, we're strengthening our health system by investing in hospitals and increasing our health workforce, and we are spearheading reforms to tackle ambulance ramping,\" the spokesperson said.\n\n'Trapped' in winter cycle\n\nTerry Slevin, an adjunct professor and chief executive officer of the Public Health Association of Australia, thinks the division of health is a good idea.\n\nWA patient devastated as complex surgery cancelled day before Photo shows A woman sits in her home, being interviewed A patient caught up in the immense pressure being placed on WA hospitals says her planned surgery being cancelled has put her under significant stress and eroded her trust in the health system.\n\n\"Roger Cook knows the extraordinary complexity of the health portfolio, he's had to wrestle with it,\" Mr Slevin said.\n\n\"So having broken it up into more chewable chunks means all of those people can focus on each of those big challenges — mental health, infrastructure, prevention, research — and they can give it greater attention and engage with the people who have the best ideas.\"\n\nMr Slevin says it's still \"relatively early days\" and the ministry needs more time to become a well-oiled machine, and called for a review after 18 months to two years.\n\nHe's naturally the most interested in Sabine Winton's portfolio — preventative health — and thinks she could be doing more to foster healthier communities to prevent ED presentations.\n\n\"If we're going to deal with the ambulance ramping, the queues for clinical services in the future, the time to start is now with regard to dialling that demand down,\" he said.\n\nTerry Slevin says the integrated approach may take time to bear fruit. (ABC News: Matt Roberts)\n\nDr Hoath echoed the sentiment.\n\n\"We get very trapped in this cycle of ramping, of winter, of vaccine, the crisises we hit, rather than taking a step back and trying to prevent the problem from getting bigger,\" Dr Hoath said.\n\nThe government insists Ms Winton is focused on this through things like vaccinations, but peak groups want more tangible results to point to.\n\nTime needed\n\nFrom a patient perspective, stronger connection between state and federal health ministers is also urgent.\n\n\"The state government has a number of levers and they are important, but I think that what we need to see is our governance mechanisms joining up to actually understand the community's perspective on the ground,\" Health Consumers Council Executive Director Clare Mullen said.\n\nAugust saw WA set another unwanted record for ambulance ramping. (ABC News: Courtney Withers)\n\nMs Mullen says this looks like consumers more \"actively involved\" in the early stages of decision making in hospital infrastructure projects, for example.\n\nIf a grace period is given to the government, its still got time to iron out the kinks.\n\nBut with an opposition quick to seize on any missteps, it might want to nip issues in the bud sooner rather than later.\n\nLoading...",
    "source": "ABC",
    "cluster_id": 9
  },
  {
    "url": "https://www.abc.net.au/news/2025-09-07/dual-brownlow-winner-nat-fyfe-bows-out-after-dockers-finals-loss/105744138",
    "title": "Fyfe bows out after Freo loss, saying 'I don't think I needed anything else'",
    "publish_date": "Sat, 06 Sep 2025 23:23:25 +0000",
    "category": "sports",
    "authors": [],
    "text": "Fremantle great Nat Fyfe says he was left feeling numb after his AFL career was brought to a close in a heartbreaking one-point loss to Gold Coast.\n\nFyfe said he still ended his AFL career content despite not winning the premiership he so desperately craved, and he was optimistic the current group had \"five or six\" more bites at the cherry.\n\nFyfe's career came to a close on Saturday night when Fremantle suffered a heartbreaking one-point loss to Gold Coast in a pulsating elimination final at Perth Stadium.\n\nThe Dockers led by six points with less than two minutes remaining, but a Mac Andrew goal with 72 seconds to go followed by a David Swallow behind with just nine seconds left on the clock sealed the 11.14 (80) to 12.7 (79) win for Gold Coast.\n\nSwallow, like Fyfe, had announced he would retire at the end of the season, and would have been the one hanging up his boots if the Suns had lost.\n\nAfter being interviewed on the field, he went to Fyfe and the two veterans spoke at the end of a big night.\n\nFyfe was then given a guard of honour, with skipper Alex Pearce and Luke Ryan chairing him off.\n\nIn an honest and emotional interview after the match, Fyfe revealed he had been in some doubt for the match after rolling his ankle at training on Tuesday.\n\n\"When you're at my age and with the scar tissue, a small ankle injury can turn into a pretty major thing, but it wasn't too bad,\" Fyfe said.\n\nThe 33-year-old won two Brownlow Medals, three club best and fairest awards and three All-Australians during his decorated 248-game career, as well as captaining Fremantle.\n\nBut team success eluded him, with the 15-point loss to Hawthorn in the 2013 grand final the closest Fyfe got to a flag.\n\nFyfe was philosophical after his dream ended on Saturday night.\n\n\"I don't think I needed anything else from the game,\" Fyfe said.\n\n\"We all want to win premierships. I do have some contentedness that I tried everything and gave absolutely everything I could to the club and evolved myself along the way.\n\n\"In some ways, maybe my journey it was more important for me not to win than to win.\n\n\"I just think that's fitting — the game does not give up its rewards very easily and there's a lot more times you finish a season heartbroken than the opposite.\n\n\"To be able to get back and actually be involved in this game this year … I'm really grateful I got to play in another final again.\"\n\nFremantle have featured in finals just twice since 2015 — in 2022 and 2025.\n\nBut with the bulk of the talent-laden squad still in their early-to-mid 20s, Fyfe sees a bright future.\n\n\"We've only lost three games of the last 14, we've learned to win on the road, we've given ourselves every chance of evolving the way you'd like a list to,\" Fyfe said.\n\n\"I think we genuinely have got the calibre of players in the right profile to have five or six bites at winning a premiership.\"\n\nDavid Swallow kept his career going with the match-winning score, but the Suns veteran went to Freo's Nat Fyfe to congratulate him on his career. (Getty Images: AFL Photos: Michael Willson)\n\nFyfe has been plagued by injuries in the latter part of his glittering career.\n\nThis year alone he dealt with knee, hamstring and calf issues, admitting that he thought he may not be able to come back on numerous occasions.\n\n\"The game tried many different times to tell me the end of the road was near and so I walk away knowing this was definitely the right time,\" Fyfe said.\n\n\"I think I came to a point last year where I felt like I'd turned every stone, given absolutely everything I could.\n\n\"Where the story went from there was out of my hands. Hopefully I get some closure and peace of mind that this part of my journey with Fremantle — I did everything I could.\n\n\"I finish disappointed in some ways because of the way this season went. But those memories will eventually turn into fond ones for what's been an amazing experience.\"\n\nSo, what's next for Fyfe, a man who has endured 25 surgeries across his career?\n\n\"A period of rest,\" Fyfe said.\n\nAAP/ABC",
    "source": "ABC",
    "cluster_id": 10
  },
  {
    "url": "https://www.abc.net.au/news/2025-09-07/gold-coast-light-rail-cut-short-of-final-destination/105720840",
    "title": "Gold Coast rail 30 years in the making cut short of final destination",
    "publish_date": "Sat, 06 Sep 2025 23:17:51 +0000",
    "category": "finance",
    "authors": [],
    "text": "A long time ago, Sydney virtually stopped building public transport infrastructure.\n\nWhen it resumed, retrofitting the city was painful and expensive, according to Bond University urban planning researcher Daniel O'Hare.\n\n\"It's been so much more expensive because they waited,\" Dr O'Hare said.\n\n\"And very much more disruptive because the city had to grow up without it and they had to retrofit it.\"\n\nThe south entrance of Gadigal station on Sydney's new Metro line was not cheap. (Supplied)\n\nOn the Gold Coast, the rapidly growing city realised it too was headed for gridlock, long before construction began on Sydney's massive underground metro or light rail projects.\n\n\"It was identified we would have gridlock unless we developed some kind of rapid transit system,\" Dr O'Hare said.\n\n30-year plan\n\nLight rail was chosen shortly after a 1998 transport plan, using population growth and migration patterns, identified problems.\n\nThe Gold Coast's population continues to surge. (Facebook: City of Gold Coast)\n\nThe city's population has since doubled and is expected to surge towards a million people by 2040.\n\nThis week the final, fourth stage that would see a light rail line run the full length of the Gold Coast's coastal strip was scrapped by Deputy Premier Jarrod Bleijie.\n\nA review found the 13-kilometre line to the airport would cost between $5.7 billion and $9.85 billion.\n\nMr Blejiie also cited a survey detailing the feelings of nearby residents about the project.\n\nNow, similar to another south-east Queensland rail project, the Gold Coast line is expected to terminate at Burleigh Heads with buses servicing the route south to the city's international airport.\n\nChanging character\n\nBurleigh Pavilion owner Ben May said he was not surprised by the decision, because it had been foreshadowed for months.\n\nBut that does not mean he thinks it is ideal.\n\n\"The reality is we're left with a half-finished transport solution,\" Mr May said.\n\n\"The fact that it was started without a guarantee that it would be finished is absolutely laughable.\"\n\nBen May has businesses in Queensland and NSW. (ABC Gold Coast: Tara Cassidy)\n\nHe said swapping between trams and buses was a turn-off for commuters, and an interchange could transform Burleigh Heads.\n\n\"No-one wants to live at the end of the line,\" he said.\n\n\"As someone from Sydney who knows what that looks like — it's a really poor result.\n\n\" Part of the jewel of Burleigh was that it wasn't Surfers Paradise. \"\n\n'Views remain mixed'\n\nCavill Avenue in Surfers Paradise isn't popular with some Gold Coast residents. (ABC News: Tom Forbes)\n\nFor some who live on the Gold Coast, Surfers Paradise is a dirty word.\n\nThere are fears of a concrete canyon stretching south, spurred along by the light rail, as one of many reasons some residents are opposed to the project.\n\nLuxury beachfront apartments rise above Palm Beach which had been largely single storey.\n\nSome say the developments follow a decades-long trend.\n\n\"We're seeing development all through the southern Gold Coast. It's market driven,\" said Coolangatta-based councillor Gail O'Neill.\n\nA post card image of Palm Beach and Currumbin circa 1960. (Supplied: John Engelander & Co via the Centre for the Government of Queensland)\n\nSome residents felt they do not have a choice about development, or how transport would work in the area.\n\nA recent government survey report found 60 per cent of those felt like they had not been listened to and were told light rail was \"a foregone conclusion\".\n\nThe report also found \"views on preferred transport modes remain mixed\", while transport demand in the already congested area is expected to increase by 32 per cent by 2041.\n\nThe report said the extension of rail was \"not an alternative to improving other public transport on the southern Gold Coast\".\n\nTit-for-tat\n\nThese issues featured heavily in recent local, state and federal elections, which Mr May said had impacted local politics in the area.\n\n\"[Burleigh MP] Hermann Vorster's been pretty vocal on it and I guess he's been elected, he feels, on the back of doing this review and then probably coming to this conclusion,\" Mr May said.\n\nSteven Miles and Meghan Scanlon with a sign of Hermann Vorster in Burleigh. (ABC News: Nicholas McElroy)\n\nWhile it was ultimately a Crisafulli government decision, Queensland opposition leader Steven Miles said the area would become a bus depot and he took aim at Mr Vorster's involvement.\n\n\"Overwhelmingly, across the Gold Coast, this is a very popular project,\" Mr Miles said.\n\n\"But instead of listening to people, that overwhelming opinion, [the government has] listened to a few. A noisy minority.\"\n\nMr Vorster said designs for the area were now being worked on by the transport department.\n\nHe said only the opposition was talking about the area becoming a bus depot.\n\nLaura Gerber, Jarrod Bleijie and Hermann Vorster announced that Stage Four of the light rail would not be going ahead. (ABC News: Mackenzie Colahan)\n\nHe said buses servicing the line would layover at a shopping centre several kilometres away before picking up passengers.\n\n\"Had light rail Stage Four progressed we still would have had five to seven years of buses connecting to light rail,\" Mr Vorster said.\n\nThe late change to the project creates a conundrum for the area, said Griffith University transport expert Matthew Burke.\n\nLight Rail Stage Three is currently under construction. The last stretch, Stage Four, could be serviced by buses. (ABC News)\n\nHe said planners now needed to create a \"seamless\" transfer between buses and trams.\n\n\"There are ways to do that, including double-deckering [stations], which will cut off the views at that location,\" Professor Burke said.\n\n\"There are other ways to do it, by taking out road space, footpath space, everything else. There's going to be challenges there.\"\n\nUrban planning researcher Daniel O'Hare. (ABC News: Glenn Mullane)\n\nWhether or not debate is helpful, Dr O'Hare said the latest decision could lead to two agitated communities.\n\nHe said politicians and planners could have been less antagonistic and more open as opposition to light rail emerged over the years.\n\n\"I really don't think the Burleigh Heads community will tolerate having a deterioration as a result [of cutting the route short],\" Dr O'Hare said.\n\n\"So, they will get active too. You'll have two very active communities … Burleigh Heads and Palm Beach.\"\n\nOver time, over budget\n\nThe \"iron law\" of mega projects states that they are often over budget and over schedule.\n\nBut the latest price tag led Gold Coast Mayor Tom Tate to ask \"are the tracks gold-plated?\"\n\nThe light rail span across Currumbin Creek was expected to be expensive. (Supplied: Queensland government)\n\nWhile budgets blow out on transport projects in Brisbane, Sydney and Melbourne, Dr O'Hare said similarly priced Gold Coast projects seemed to be less controversial.\n\nHe pointed to the 16km Coomera Connector, a road which has doubled in price.\n\n\"Nobody questions $3 billion on the current stage,\" he said.\n\nHe said the next stage of the road would likely exceed the costs of Stage Four of the light rail.\n\n\"No one seems to question that,\" he said.\n\nWhole city approach\n\nWhile the Gold Coast developed as a string of interconnected areas, rather than a central hub, Dr O'Hare said thinking of the city and south-east Queensland as a whole could be more helpful.\n\n\"I'd like us to put the whole city into context so we can get the various villages … talking, not only among themselves but also to each other,\" he said.\n\n60 years effectively rebuilding a ripped up rail line Photo shows The old South Coast rail line can be seen from above, running through Coolangatta. Melbourne's failure to build a train line to its international airport could be a little humiliating, but Queensland has been rebuilding a line it ripped up in the 1960s.\n\nThe government is now working on designs to service the southern Gold Coast with buses, but Dr O'Hare said he hoped the scrapping of the rail project was not permanent.\n\n\"I'm hopeful that the current situation is a postponement and a catching of breath [rather] than 'it's all over',\" he said.\n\nHe said neglecting public transport altogether would be too expensive.\n\n\"You lock us into the car-based future forever, which is one where there are never enough lanes, never enough parking spaces,\" he said.\n\n\"And when you get to where you're going it's dominated by parking rather than places.\"",
    "source": "ABC",
    "cluster_id": 11
  },
  {
    "url": "https://www.abc.net.au/news/2025-09-07/calls-for-housing-investment-in-remote-wa-desert-communities/105580560",
    "title": "After waiting 50 years, remote community resorts to Chinese prefab homes",
    "publish_date": "Sat, 06 Sep 2025 22:59:50 +0000",
    "category": "finance",
    "authors": [],
    "text": "There are some nights Raylene Robinson would rather sleep under the open sky than in her government-sanctioned home.\n\nMould creeps up the walls, floorboards warp at odd angles, and the tap won't stop running.\n\n\"It's making me feel like I [should] go out bush and live for a while,\" the Martu elder says.\n\n\" Houses are falling apart … it is scary. \"\n\nRaylene Robinson says people need to be able to come back home to Punmu. (ABC News: Alistair Bates)\n\nDeep in the Western Desert, on the banks of an ephemeral salt lake, a remote housing crisis is leaving families to languish in overcrowded, crumbling, and improvised humpies.\n\nBureaucratic deadlock and shifting government responsibility has seen 50 years pass without a new build.\n\nThe community of Punmu, more than 1,300 kilometres north-east of Perth, is sick of waiting.\n\nIt has gathered together enough money to buy a pair of Chinese-made, prefabricated homes so it can triage its most vulnerable residents.\n\nThe irony of turning overseas to build a future on her ancestral country is not lost on Ms Robinson.\n\n\"Desert is our home; Punmu is our home,\" she says.\n\n\" The government needs to come and see how we're living out here. \"\n\nA solution that 'won't last'\n\nTwo prefabricated houses made in China from shipping containers will travel the bumpy, dirt road to Punmu later this year.\n\nThe move seeks to circumvent long-standing land tenure disputes, which the WA government has blamed for blocking the construction of additional houses.\n\nIn the meantime, community coordinator Edith Costello, a 59-year-old former tradie from Queensland, spends her waking hours making \"endless\" emergency repairs to keep things afloat.\n\n\"Fixing blockages, rebuilding septics, patching holes in walls to stop snakes coming in: it's a band-aid fix,\" Ms Costello says.\n\nEdith Costello traverses Punmu by utility buggy, making house repair calls. (ABC News: Alistair Bates)\n\nAdvocates like Ms Costello say the aging housing stock in the Western Desert is jeopardising Martu traditional owners and their millennia-deep connection to country.\n\nThe homes in Punmu date back half a century. (ABC News: Alistair Bates)\n\nWith about 180 permanent residents, more than a third of Punmu's 21 homes have been condemned as \"irreparable\" and fit for demolition.\n\nFinanced by the local shop, tourist accommodation, and fuel stop, the new container houses cost the community $20,000 to buy and a further $40,000 to ship and install.\n\nIt is dipping into a kitty, Ms Costello says, they can hardly afford.\n\n\"We don't have the funds to purchase government-standard housing, so we've purchased two expandable container homes, which I know won't last,\" she says.\n\n\"But if they last 10 years, then they've paid for themselves.\"\n\nInside a remote housing crisis\n\nOne of Australia's last peoples to encounter colonial society, the Martu of the Western Desert are today among its most disadvantaged.\n\nRocketing rates of renal disease mean their average life expectancy does not surpass 45 years.\n\nInside Ms Robinson's Punmu home, where she lives at close quarters with three generations of her family, the bathroom walls are rotting and the electric lights overhead fail to switch on.\n\nWater pours perpetually from the faucet; its inner valve has long since rusted through.\n\nPlumbing issues, electrical failure, and insect infestations are typical in Punmu. (ABC News: Alistair Bates)\n\n\"These houses are old,\" Ms Costello says in the darkness.\n\n\"They weren't purpose-built, and it's not damage from not being looked after; they're just old.\n\n\" Every night, I go to sleep knowing people in my community are living in horrid conditions. \"\n\nThe WA state government constructed the housing in Punmu during the 1980s as the Martu sought to return to the desert after they were forcibly removed in the early 20th century.\n\nPunmu was created in 1981 as the Martu returned to the desert. (ABC News: Charlie McLean)\n\nThe buildings themselves were gifted to the community to self-manage, but because they fall within the boundaries of Karlamilyi National Park, residents do not hold tenure over the land.\n\nWA government officials say the discrepancy legally prevents them from building any more houses.\n\nThen-environment minister Stephen Dawson signed a statement of intent in 2021 to excise Punmu and another Martu community, Parnngurr, from the national park, but no further action has been taken.\n\nAll the while, brutal wind, sun, and cyclones have exacted a heavy toll on the housing.\n\n\"I think we have been left behind,\" Ms Robinson says.\n\n\"The government didn't want to do anything for us.\"\n\nPeople pushed into town\n\nThe deterioration of properties in Punmu, alongside the region's other Martu communities of Jigalong, Parnngurr and Kunawarritji, is threatening to engulf the closest regional centre as well.\n\nWith nowhere on Martu country to turn, a growing number of people have been forced into the mining town of Newman, 700km south-west of Punmu.\n\nThis diaspora is fuelling overcrowding in the iron-ore hub, from which about 78 million tonnes of Australia's most lucrative commodity is extracted by mining giant BHP annually.\n\nMuch of the raw material will be exported to China for refinement into steel and eventually turned into products like shipping containers or prefabricated homes.\n\nLast year, BHP generated nearly $24 billion in profits.\n\nNewman is home to the world's largest open-pit iron-ore mine, operated by majority owner BHP. (ABC News: Charlie Mclean)\n\nRoughly, 200 Martu live in the suburb of East Newman, a neighbourhood likened by locals to the war-ravaged areas of \"East Timor\" amid the 1970s Indonesian occupation.\n\nThe boarded-up windows and graffiti-strewn streets are in stark contrast to the outfitted 4WDs and new homes of senior mine managers on the opposite end of town.\n\nBHP owns 113 of these derelict houses, with a large proportion sitting in East Newman.\n\nEast Newman has earned the moniker \"East Timor\" from locals for its dilapidated condition. (ABC News: Alistair Bates)\n\nThe miner hopes to make 13 of the properties habitable by the end of the year.\n\nIt is part of a broader commitment to revitalise the company town, where Indigenous health outcomes and incarceration levels rank as some of the worst in the nation.\n\nBHP contributed almost $11 million to community programs during the past financial year, largely through the Newman Futures initiative it first launched in 2020.\n\nThe enterprise's landmark East Newman Precinct Structure Plan was co-designed with Martu native title bodies to overhaul the dilapidated strip, including designs for new housing, laundry facilities, and a convenience store.\n\nWhile a spokesperson noted \"positive momentum\" on several of the projects, they could not point to a single building yet delivered under the plan, which only secured state government approval in 2024.\n\nSome services, such as free meal deliveries and youth activities, are already underway.\n\nBut Martu elder and Punmu resident Milton Chapman says the significant resources being mobilised in Newman neglect the root of the issue: a lack of housing in remote communities.\n\n\"That didn't solve the problem,\" he says.\n\n\" We need houses. \"\n\nFor years, Martu organisations have pitched the bolstering of their communities as a money-saving exercise.\n\nIn 2018, the Pilbara Development Commission hired Social Ventures Australia Consulting to produce a cost-benefit analysis of investment in the Western Desert.\n\nIts 2024 final report, which drew on ABS census and WA Police Force data, found the imprisonment of Martu adults and youth cost the WA government $13 million in 2023.\n\n\"The rate of offending in [the Western Desert communities] … is identical to that of the general population,\" the report read.\n\n\" The rate of Martu offending in Newman is 95 times higher … than the general population. \"\n\nPunmu , like other remote Martu communities, has banned all alcohol. (ABC News: Alistair Bates)\n\nMr Chapman insists the explanation is simple.\n\nNewman is not traditional Martu country; alcohol is readily available, and the threat of incarceration looms.\n\nConversely, he says living in a remote community allows elders to shield young people from bad influences and a revolving justice system.\n\n\"That's where our culture is … it is safe for our kids,\" Mr Chapman says.\n\n\"Kids breaking in and stealing cars, that [does] happen in the community, but we want our kids to be out here.\"\n\nPolitics compounding problem\n\nDisagreements between state and federal governments over the maintenance of remote communities have only added to the uncertainty.\n\nThe rift flared in 2015 when former prime minister Tony Abbott labelled living in remote communities a \"lifestyle choice\" taxpayers should not subsidise.\n\nThat same year, the federal government stopped providing housing, power, and water services to remote communities and passed responsibility to the states.\n\nThe WA government has pledged to repair 22 homes. (ABC News: Alistair Bates)\n\nThrough its Remote Communities Fund, the WA government has set aside close to $20 million to improve 22 homes across three Martu communities: Punmu, Parnngurr, and Kunawarritji.\n\nAccording to the Department of Housing and Works, 62 total houses make up these settlements, although one community might accommodate upwards of 800 people for cultural events.\n\nIt also intends to build new homes in Jigalong, of rabbit-proof fence fame, where it has entered a housing management agreement.\n\nLikewise, the federal government has pledged $50 million to repair homes in remote Indigenous communities across the country between 2025 and 2030.\n\nEdith Costello says the community has been waiting a long time for investment in housing. (ABC News: Charlie Mclean)\n\nMs Costello says extreme construction costs render the current amount of investment a drop in the ocean for the Western Desert.\n\nThat is why Punmu is carving its own path forward.\n\n\"The community's been waiting a very, very long time for any action to be made to renew the housing,\" she explains.\n\n\" We're dealing with people whose life expectancy is 39 … and housing is just a basic right. \"",
    "source": "ABC",
    "cluster_id": 12
  },
  {
    "url": "https://www.abc.net.au/news/2025-09-07/wallaroos-through-to-women-s-rugby-world-cup-qf-despite-england-/105744318",
    "title": "Wallaroos through to Women's Rugby World Cup QF despite England loss",
    "publish_date": "Sat, 06 Sep 2025 22:34:37 +0000",
    "category": "sports",
    "authors": [],
    "text": "A 47-7 defeat to England has failed to dampen the spirits of Australia's rugby women, who are marching to the Rugby World Cup quarterfinals.\n\nThe Wallaroos had to avoid a 76-point defeat by the rampant tournament favourites to book their place in the last eight and their excellent, ferocious first-half display in Brighton on Saturday (Sunday AEST) effectively ensured that grim prospect was never really on the cards.\n\nInstead, in front of a 30,000-strong crowd including the Princess of Wales, the Australians were left celebrating the chance to cause an upset in next Saturday's (Sunday AEST) quarterfinal against Canada, the world's number two side who had earlier beaten Scotland 40-19 in Exeter to maintain their unbeaten record.\n\n\"We are really happy with the performance — especially in that first half, we really gave it to them — and we're just going to stick with those positives,\" said skipper Siokapesi Palu, who led her Australians excellently.\n\nThe Wallaroos went into the final game of the pool knowing exactly what they had to do.\n\nThe United States needed to beat Samoa by as many points as possible to have a chance of advancing, and they beat the Pacific nation 60-0 in York.\n\nLed by a four-try performance from Freda Tafuna, the Americans led by 27-0 at half-time, and went on to score 10 tries without reply.\n\nHowever, Australia's big points differential lead meant the Wallaroos would have had to lose by 76 points against England, without scoring a bonus point, to miss out.\n\nDespite coach John Mitchell, the former All Blacks' mentor, declaring that England aimed to be ruthless hunters, the hosts were taken aback by how the Wallaroos came at them early on with hooker Adiana Talakai ploughing over for the sixth-minute try from a driving maul that really eased their job.\n\nThe Aussies needed to score four tries, or lose by less than seven points, to earn the bonus point that would have guaranteed their progression and for the first half-an-hour, that didn't even seem wholly out of the question as they still led the world's number one side, who now haven't lost a Test in a record-equalling 30 matches.\n\nThat superb opening, featuring real resilience in defence and enterprise in attack, proved absolutely critical in their bid to ensure their points difference ended up 35 points better than the Americans, even though there felt an inevitability that England, after a scrappy opening, would eventually start wearing them down.\n\nEngland finally hit the front with three tries before the break from Jess Breach — on her 50th appearance — Abbie Ward and Sadia Kabeya, and as Australia began to tire amid the wave of attacks from the hosts after halftime, further scores followed from Kabeya, a double from Kelsey Clifford and Sarah Bern.\n\nYet despite conceding seven tries in total at the Brighton & Hove Albion Stadium, the side coached by former England player Jo Yapp never really looked like conceding the avalanche of points that would have consigned them to an early exit.\n\nYapp, who's leaving as coach after the tournament, said: \"I don't know if the scoreline was a fair reflection, but in the second half we lost momentum, we lost a couple of key set-pieces and then we were on the back foot. Credit to England, they capitalised on that.\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\n\"But the positive thing is we created opportunities, got field position, just we couldn't execute. I'm proud of the first half, the way we took it to them.\"\n\nThe Australians finished second in pool A, and will now face Canada in the quarterfinals.\n\nThe Scots came second in pool B and will now face England in the last eight.\n\nIt's going to be a tall order against Canada, who beat the Wallaroos 45-7 in their Pacific Four Series clash in Brisbane in May.\n\n\"We know what to expect, we'll preview them this week and we'll focus on ourselves,\" Yapp said.\n\nAAP/ABC",
    "source": "ABC",
    "cluster_id": 13
  },
  {
    "url": "https://www.abc.net.au/news/2025-09-07/sam-beven-sturts-meadows-station-far-west-nsw-sa/105700330",
    "title": "Young dad takes over sheep station 'bigger than Singapore' to keep legacy",
    "publish_date": "Sat, 06 Sep 2025 22:14:24 +0000",
    "category": "finance",
    "authors": [],
    "text": "Fourth-generation farmer Sam Beven is already forging the path for the next generation — his lively young brood of kids who are growing up on the property where he ran amok as a boy.\n\nLast year, his father, Randal Beven, handed over the reins to Sturt's Meadows Station, a 186,000-acre property — \"a little bit bigger than Singapore\" — about 70 kilometres north of Broken Hill.\n\nIn an age when fewer farms are being passed down through the family, the Bevens' succession plan could be a model for other farming families.\n\nSam and Erin Beven with their sons Duncan, Harvey and Walter. (Supplied: Beven family)\n\nAlthough his parents still live on the station, which mostly runs sheep, including dorpers and merinos, with some cattle, at 33 years of age, Sam is in charge.\n\nSam's mum, nurse Jo Beven, said the whole family was \"very proud of him\".\n\n\" The family farm thing is becoming a bit less common these days, so let's hope we can hang on to it for this generation and he can protect it for the next. \"\n\nCementing his place as a strong member of the farming community, Sam was elected president of the Pastoralists' Association of West Darling this year, making him one of the youngest people to serve in the role in the organisation's 118-year history.\n\nGrowing up on the family farm\n\nThe father-of-three, who will soon welcome his fourth child with his wife Erin, said he knew from a young age he would eventually take over Sturt's Meadows Station, despite being the middle child of three boys.\n\nThis resolve was further strengthened during his school years, when Sam and his brothers lived with their mother in Broken Hill, where they attended school, before returning to the station and their father on weekends and holidays.\n\nBrothers Jack, Stuart and Sam Beven as boys growing up at Sturt's Meadows Station. (Supplied: Beven family)\n\n\"Dad did his best to get into town as much as he could one or two nights a week [to see us],\" Sam said.\n\n\" [Dad] was always doing a lot of work on the station, but there was always time for us on the weekends … teaching with motorbikes and sheep work and various sorts of things. \"\n\nRandal said most of his memories of Sam involved his middle son falling off things and hurting himself.\n\nSam Beven suffered life-threatening injuries when he crashed his motorbike into this gate in 2017. (ABC Broken Hill: Katherine Spackman)\n\nHowever, his most serious injury occurred in 2017 when he was an adult.\n\nThen in his mid-20s, Sam crashed his motorbike through a metal gate on the family station.\n\nHe credits his survival to the quick thinking of his paramedic brother, Stuart, and an emergency doctor who insisted he be transported to Adelaide for treatment.\n\nHanding over the reins\n\nSam officially took over management of Sturt's Meadows about 12 months ago, when his father retired at 60.\n\nRandal and Jo Beven on Sturt's Meadows Station, 70km north of Broken Hill, in far west NSW. (ABC Broken Hill: Katherine Spackman)\n\nBut, Randal said, the transition had been underway for several years following the selling of dorper sheep to Sam.\n\nAt the time, it had been obvious to the older grazier that his son had new ideas about how to make things more profitable for the station.\n\n\"I had sold all of the dorpers to Sam so that he had a means of making an income and a toehold into the property itself, which left me only with merinos,\" Randal said.\n\nSturt's Meadows Station runs both dorper and merino sheep. (ABC Broken Hill: Katherine Spackman)\n\nOverpriced sheep stations\n\nRandal says the price of sheep stations is wildly overpriced at about $70 to $75 per acre, which affects the profitability for the next generation.\n\n\"If you borrow money on that, you can't make enough to pay the interest. So it makes it very hard for the next generations to get started,\" he said.\n\nSturt's Meadows Station is the size of Singapore. (ABC Broken Hill: Katherine Spackman)\n\nWhen Randal took over from his own father, Peter, he paid him a certain amount of money and then an ongoing lease figure.\n\n\"When it came time to do it with Sam, we did it slightly differently. He paid me a certain amount of money, which was more, but then with no lease,\" he said.\n\n\"So I've got enough money to live on, but he doesn't have to pay me lease payments anymore.\n\n\" But he did have to take over the ongoing lease payments to my parents because it's a generational thing. \"\n\nRandal said he wanted to hand over the running of the station to Sam so the young father had the means to employ a governess.\n\nSix-year-old Harvey Beven with governess Matilda Raphael, who moved to the station at the start of the year. (Supplied)\n\n\"We hired our first governess this year and she's been a godsend,\" Sam said.\n\n\"We built a house for a governess to live in [and] we built a school room, so our oldest, Harvey, and ... second-born Duncan ... can spend the whole day there.\"\n\nAdvocating for family farms\n\nFormer president of the Pastoralists' Association of West Darling Terry Smith said it was important for the next generation of graziers and farmers to be business savvy.\n\nHe said Sam, who has replaced him at the helm of the association, was \"doing a really good job\".\n\n\"He's certainly got a grip on the issues,\" Terry said.\n\n\"It's a reasonable responsibility and a lot of people in the industry come to the Pastoralists' Association of West Darling with their issues, and that feeds back to someone like Sam and the council to come up with a solution for it.\"\n\nThe agri-political lobby organisation represents about 100 members in the far west of NSW.\n\nTerry Smith says Sam Beven is doing a great job in the president's role. (ABC Broken Hill: Bill Ormonde)",
    "source": "ABC",
    "cluster_id": 14
  },
  {
    "url": "https://www.abc.net.au/news/2025-09-07/rba-inflation-targeting-and-problem-with-property-prices/105731152",
    "title": "The RBA has never known what to do about property prices, former deputy governor says",
    "publish_date": "Sat, 06 Sep 2025 21:52:34 +0000",
    "category": "finance",
    "authors": [],
    "text": "Have you wondered how the Reserve Bank of Australia came up with its \"2-3 per cent\" target for inflation?\n\nDo you like what's happened to property prices in the inflation-targeting era?\n\nLast week, the RBA published a fascinating and candid interview with Stephen Grenville.\n\nAustralian economy grows 1.8pc Photo shows Welder works at InQuik Engineering in Newcastle. The Australian economy has grown slightly faster than economists were expecting thanks to a dramatic increase in household spending.\n\nDr Grenville worked at the RBA between 1982 and 2001 (his last five years as deputy governor).\n\nHe was at the RBA when it adopted its inflation target in the early 1990s and asserted its right to move interest rates up and down without political interference.\n\nIn his interview, Dr Grenville talked about the RBA's ongoing struggle to know what to do about asset prices, including property prices.\n\nHe said Australia's inflation-targeting framework still had unresolved issues.\n\nBut does he think inflation targeting has worked well?\n\n\"We had two decades where it worked well and one decade where, in my view, it didn't work so well,\" he said. \"It worked well until 2010 […] \"[But] it shouldn't get too much of the blame for its less good performance in the third decade, and there's still a lot to be said for it. \"[It] still looks to me to be the best we can do.\"\n\nWhen did the interview occur?\n\nDr Grenville's interview is part of the RBA's new oral history collection of interviews with former governors and deputy governors.\n\nYou can read the transcript of his interview here.\n\nKeep in mind it was recorded in June 2023. At that point, inflation had only just started to decline from its recent post-COVID peak.\n\nWhere did the RBA get its inflation-targeting idea from?\n\nIn his interview, Dr Grenville said the story of inflation targeting starts with New Zealand.\n\n\"New Zealand is a pioneer of lots of things, and you have to admire them that they think up the good ideas,\" he said. \"[It] was the pioneer [of inflation targeting] and gets the credit for putting it in place, but it wasn't the model for us. \"The country at that stage was run by management experts, and they wanted to assign an objective to each instrumentality, and that was the origin of inflation targeting. \"But because of the people at their central bank − particularly the Governor Don Brash − they had the very strongly free market, sharp edged view that inflation was always caused by money. \"They saw the simple link between money and prices, so they got that going very late in the 1980s or in the early 1990s − I don't recall the exact date now − but they were ahead of everyone, and because they were only just 'over the ditch', we were obviously exposed to them. \"We knew them all well and liked them, so we more or less immediately started thinking about what we would do.\"\n\nWhy did the RBA choose a 2-3 per cent target for inflation?\n\nHe said New Zealand picked an inflation target of 0-2 per cent, but senior officials at the RBA thought that was misguided.\n\nThe RBA wanted a different target.\n\nTrump's authoritarian style is targeting the Federal Reserve Photo shows FILE PHOTO: Republican presidential nominee and former U.S. President Donald Trump holds a campaign rally in Novi, Michigan Donald Trump's declaration that, \"I have the right to do anything I want\", didn't get the attention it deserved.\n\nHe said inflation targets that contemplate getting to zero — or think that being at, or near, zero is a good thing — simply misunderstand the nature of inflation.\n\nHe said economies \"work much better with a little bit of inflation so that relative prices can change\".\n\nAnd quality improvements and lots of technical issues meant that \"zero makes no sense\".\n\n\"So that end of the New Zealand target was wrong,\" he said. \"They were also, we thought, ‘inflation nutters’ in that they thought inflation was the only thing that mattered.\"\n\nHe said at the time, when RBA officials were considering adopting an inflation target for Australia, they didn't think they could get Australia's inflation down to 2 per cent, but they still wanted to be ambitious.\n\nThat's how they stumbled upon a \"2-3 per cent\" target.\n\n\"I'm not sure what the rate of inflation was [in Australia], but it was much higher than 3 [per cent]. It was 4 or 5 [per cent], or maybe even higher,\" he said. \"We knew we'd had 'the recession we had to have' and we were going to make a lot of progress on inflation, but we didn't think we'd get much below 3 [per cent]. \"We thought to mention 2 [per cent], which by then some other central bankers were talking about, and of course was the top of the New Zealand target. \"[So] 2 would be too ambitious, but 3 would sound like we weren't trying hard enough, so we suggested 2 to 3 [per cent, but] not as a range, and this was something we had a lot of trouble explaining. \"We didn't think we would stay within 2 to 3 [per cent], because we really thought of it as − I think Glenn [Stevens] invented the term − a 'thick point'. \"We just wanted people to be saying: well, if we had a number starting with 2, most of the time we would regard that as a satisfactory outcome. \"So that's one advance, as we saw it, over the New Zealand inflation targeting.\"\n\nHas inflation targeting worked well in Australia?\n\nDr Grenville said inflation targeting worked well in Australia for two decades.\n\nThe 'golden era' of economic reform wasn't all rosy Photo shows For sale sign on Queenslander-style house that needs renovating in a street in Brisbane. Treasurer Jim Chalmers won't be making big reforms to the tax system immediately. He knows major policy changes can have unintended consequences.\n\nBut it didn't work as well after the global financial crisis of 2007-09.\n\nHe said the GFC left a \"huge legacy of damage and headwinds\" and Australia's growth performance wasn't great in the 2010s.\n\nHe said as inflation kept falling in the 2010s, the RBA faced constant pressure to keep cutting rates, even though the economic returns from cutting rates below a certain low level are questionable.\n\nBut the problem was, even though inflation was too low everyone said, 'Oh, that must be because your interest rate is still too high.\"\n\n\"Glenn [Stevens] was Governor then, and he took interest rates down quite smartly when it was clear that the mineral boom was ending, and he took them down to 2 per cent very quickly. \"Now a 2 per cent policy rate is essentially zero in real terms − that is, inflation adjusted terms — so he did what seems to me to be the sensible thing: you respond, but he hung on at 2 per cent, [even if] inflation was still too low. \"Worse still, unemployment rose. \"Unemployment … had risen during the GFC, then fell to 5 per cent immediately after the GFC, [then] it went up to 6 per cent, and this was despite a policy rate which was zero, or maybe even negative, in inflation-adjusted terms. \"[None] of that seemed to stir the economy along, and my own view is that there are other forces holding back the economy, and that it was unhelpful to push interest rates down even further into negative in inflation-adjusted terms, even though America was down and by that stage had zero nominal terms.\"\n\nAn unresolved issue with inflation-targeting\n\nHowever, he said that experience in the 2010s did expose a problem with Australia's inflation-targeting framework.\n\nHe said the framework encourages policymakers to keep cutting rates as inflation keeps falling, regardless of how low interest rates are getting.\n\nHe said people needed to realise that monetary policy had its limits, and if we keep cutting rates below a certain point it can cause economic problems, especially with property prices.\n\n\"A low interest rate does very little for activity, for real GDP growth, but it has a big effect on asset prices like houses and shares,\" he said. \"[Asset inflation] may make people feel good and for house owners, it gives them something to talk about at the dinner parties about how their house price has gone up, [and that] makes everyone feel good; maybe that would stimulate the economy a bit, but I just regard that as such a weird way of stimulating the economy by giving people a big hit to their asset prices. \"I was not attracted to that channel of monetary policy, and thought instead of pushing further and further down to essentially see a zero real [interest rate ] — or in other words, [an] inflation-adjusted [interest rate] somewhere around 2 or 1.5 per cent — as being the place to stop and admit, in public, that monetary policy was still working strongly at that low interest rate, but that it was doing all it could do. \"This was like medicine: you took the tablets that the doctor recommended and it didn't completely fix you, but there was no point in doubling the dose in the hope that that would completely fix you, it just made you worse […] \"I think that's an unresolved issue of the inflation targeting framework [it encourages policymakers to go on reducing interest rates whenever inflation is too low]. \"I don't think it actually mattered that inflation was running at 1.5 per cent − we weren't deflating, so we could have just not worried about it − but because you've signed on so rigorously to inflation targeting, it's very hard to say ‘Oh look, conditions are a bit different now, 1.5 is okay, isn't it? Who's being harmed by 1.5 per cent inflation? There's no deflation which might be harmful, but 1.5 per cent is fine. Let's just wait until the business sector regains its mojo'.\"\n\nWhat can the RBA do about property prices?\n\nHe said the RBA had also never quite known what to do about asset prices within the inflation-targeting framework, which complicates things.\n\n\"I think there's one other problem which we always knew about but didn't know what to do about, and that is asset prices, which were particularly a serious problem in this period because interest rates had been taken down so low,\" he said. \"It was always a problem that asset prices move much, much, much faster than inflation. \"Say inflation goes up from say 2 to 3 [per cent], but asset prices are going up to 5, 10 and 15 [per cent] for housing prices, so any interest rate which would contain asset price increases would be much too severe, much too high for normal activity, so there is no good resolution. \"Some people say, ‘oh, well, you give the task to [the Australian Prudential Regulation Authority]’; [but] that would be essentially giving the task of macro policy to the macro prudential regulator and at the moment they don't have that mandate, so they don't do that. \"I think that would be a very big change of the system.\"\n\nIn the 26 months since Dr Grenville's interview was recorded, Australia's headline inflation has declined to 2.1 per cent and underlying inflation has fallen to 2.7 per cent.\n\nHouse prices again on the march Photo shows a house for sale in the brisbane suburb of stafford with the sale sign in the front yard With housing affordability now improving as interest rates come down, housing accessibility is likely to worsen further as prices again rise.\n\nThe RBA has cut the cash rate target from 4.1 per cent to 3.6 per cent.\n\nThis year, average house prices also passed $1 million for the first time.\n\nDomain has also forecast Australian property prices to jump to fresh record highs in 2025-26, creating more pain for first-home hopefuls.\n\nIn June, it said the median house price in Sydney was forecast to jump by 7 per cent in 2025-26, to a staggering $1.83 million by June 2026.",
    "source": "ABC",
    "cluster_id": 15
  },
  {
    "url": "https://www.abc.net.au/news/2025-09-07/hard-quiz-weekly-trivia/105728332",
    "title": "I know you think you know the answers to this quiz",
    "publish_date": "Sat, 06 Sep 2025 21:41:04 +0000",
    "category": "finance",
    "authors": [],
    "text": "Oh, it's you. Something to prove after last week's effort? Let's see what you've got.\n\nFive points for a correct answer.\n\nLet's play, HARD!\n\nLoading\n\nStream new Hard Quiz episodes on ABC iview or watch Wednesdays 8pm on ABC TV.",
    "source": "ABC",
    "cluster_id": 16
  },
  {
    "url": "https://www.abc.net.au/news/2025-09-07/renee-gracie-gt3-v8-supercar-onlyfans-motor-sport-racing/105668240",
    "title": "Renee Gracie on how OnlyFans restored her self-esteem and motorsport career",
    "publish_date": "Sat, 06 Sep 2025 21:39:44 +0000",
    "category": "sports",
    "authors": [],
    "text": "Driving in the Bathurst 1000 was supposed to be the highlight of Renee Gracie's motorsport career.\n\nIn 2015, the now 30-year-old formed part of the first all-female line-up in two decades to compete in the iconic event.\n\nBut after crashing into the Forrest's Elbow wall on lap 15, Gracie would hit an all-time low.\n\nAt first she kept a low profile in Melbourne, where she had moved to pursue her V8 career, before travelling back to Queensland to see family for Easter the following year.\n\nIn 2015, Simona De Silvestro and Renee Gracie were the first women's team in 20 years to compete in the Bathurst 1000. (Getty Images: Robert Cianflone)\n\nUnable to afford flights, she asked for fuel vouchers from her sponsor to make the almost 2,000-kilometre journey home.\n\nBusting to go to the toilet, she stopped at a competitor's fuel station, only to be photographed by a fan, who posted the images on social media and tagged Gracie.\n\n\"By the time I got home, about six hours later, my phone had been ringing non-stop and management was losing it at me, saying I wasn't thinking and I was an idiot,\" Gracie told ABC Sport.\n\n\"I remember thinking, I don't have to put up with this … I should just be able to go to the toilet when I need to without repercussions.\n\n\"That was the moment for me when I literally cut it off, and was like 'I'm done'.\"\n\nGracie crashed the car on lap 15 of her first Bathurst 1000 race. (Getty Images: Robert Cianflone)\n\nIt was also the catalyst for a dramatic change of direction, and to Gracie's surprise as much as anyone, a lucrative OnlyFans career.\n\nAt first, Gracie chose to stay in Melbourne, relying on contacts for jobs in the car industry, but was unable to make ends meet.\n\n\"I remember sitting in my apartment with no lights on, rent due. I had no dining table, no furniture, no nothing, because I was so broke,\" Gracie said.\n\n\" Without being too graphic, I had some very deep, dark thoughts about if I was even worthy of being here. \"\n\nOn a whim, Gracie packed her things into the back of her Mustang and drove to Queensland to move in with her dad.\n\n\"From 14 years old, I had a Plan A only, and Plan A was to race cars,\" Gracie said.\n\n\"I didn't have a Plan B, so when I moved back home, I had nothing, and I mean I had zero dollars and zero cents to my name.\n\n\"I just knew, being at home and having that reset, that this was my opportunity to start again, and keep going.\"\n\nThis is how OnlyFans helped Gracie turn a career of sexualisation and sexism into monetary success, stability, and a triumphant return to GT3 (grand tourer) racing.\n\nLoading Instagram content\n\nDads didn't want sons 'beaten by a girl'\n\nBorn on the Gold Coast, Gracie never aspired to a motorsport career.\n\nA spur-of-the-moment go-karting trip on Hamilton Island, where 14-year-old Gracie lapped and out-paced her father, changed that.\n\n\"The mechanic [at the race track] ended up saying to Dad: 'I just want to let you know that this is something you don't want to sleep on. She might actually have something; she's kind of talented',\" Gracie said.\n\nGracie then proceeded down the well-worn path of junior go-karting, describing local races as \"fun and playful\".\n\nBut once on the national circuit she attracted unwanted attention; especially from competitors' fathers.\n\n\"I would take my helmet off after a practice session, and one of the dads would say: 'you can't let her beat you. You can't let a girl beat you',\" she said.\n\n\"I think for the dads, I was at risk of taking something from their sons they so desperately wanted, which was a career in motorsport.\"\n\nGracie had aspirations to race cars from the age of 14. (Getty Images: Robert Cianflone)\n\nSeventeen-year-old Gracie soon became the first woman to compete in the Carrera Cup in 2013, but describes her first year as \"really, really, really\" hard.\n\nShe made a deliberate effort to make friends with other drivers to avert a gnawing sense of alienation.\n\n\"I wanted to show them that I'm actually a normal person, that they didn't need to bully me or be mean to me,\" Gracie said.\n\nGracie's weight and appearance scrutinised\n\nBy 2014, Gracie had finished in the top 10 of the Cup five times, earning her a spot as the first full-time female V8 Supercars driver in 14 years.\n\nBut as attention on her performance increased, her image was increasingly scrutinised.\n\n\"I had to report my weight in an email check in every week,\" she said.\n\nIn 2025, Supercar drivers must maintain a minimum weight of 95kg, including any apparel.\n\nIf they are lighter, a ballast is fitted to their car to bring the weight up to that number.\n\n\"I was told certain haircuts made my face look chubby, certain colours were unflattering, or to wear high heels so I looked better,\" Gracie added.\n\nGracie says she was consistently told there is no place for women in motorsport. (Supplied: Renee Gracie)\n\nShe argues that unsolicited feedback on her appearance was relentless.\n\n\"All of that was the making of me as a sex symbol while ensuring I didn't believe it,\" she said.\n\n\"I think that was part of the plan; to build me up while making sure my confidence was low and it didn't go to my head.\"\n\nGracie says she was made to feel \"undesirable\" because she was a tomboy who did not conform to conventional feminine norms.\n\n\"My belief [was] that I was overweight and ugly, and that no-one would want to race with me because I was an unattractive female who is competitive,\" she said.\n\nGracie says she had extremely low self-esteem, with her appearance constantly scrutinised. (Getty Images: Robert Cianflone)\n\nShe was also consistently told there was \"no place for women in the sport\".\n\n\"I had team owners and managers say directly to my face: 'there's no way we'll ever have a female driver in our car,\" she said.\n\n\"I've had people say that a female would upset the team dynamic, and I'd distract the boys.\n\n\"They weren't one-offs, they were constant comments throughout my entire career.\"\n\nGracie says she was used to market Bathurst 1000 for free\n\nDespite the consistently negative feedback on her appearance, Gracie said she was called on to do \"months\" of unpaid publicity in the lead-up to the Bathurst 1000 alongside teammate Simona de Silvestro.\n\n\"I think the idea was that we were two girls, and sex sells, so we'd make them heaps of money,\" she said.\n\nGracie says she did months of unpaid publicity ahead of the Bathurst 1000 in 2015. (Getty Images: Robert Cianflone)\n\nGracie said that not only was she not paid for marketing, she was not paid for participating in the event either.\n\n\"People were coming up to me at the race going 'you must be living the life as a professional race car driver', but I literally had negative $50 in my bank account,\" she said.\n\n\"I'd comfortably say that I'd be surprised if anyone else wasn't paid, except me.\"\n\nThe ABC contacted Gracie's former team Tickford Racing (then Prodrive Racing Australia) to verify this claim, but did not receive a response.\n\nA Supercars spokesperson, meanwhile, said \"commercial arrangements for drivers are managed directly between teams, drivers and their representatives\", and that Gracie's manager had collaborated with a Supercars team to \"secure the car and financial backing required\".\n\nAdding salt to the wound, Gracie remembers being berated by her team after the oil-slick induced crash that severely damaged their Ford FG X Falcon.\n\nGracie on a practice lap in the Supergirls Falcon during the Bathurst 1000 in 2015. (Getty Images: Robert Cianflone)\n\n\"I got into a lot of trouble because of how expensive it was going to be [to repair],\" she said.\n\n\"I was like 'what are you worried about? I'm a racing car driver, I made a mistake'. That didn't sit right with me.\n\n\" While it was meant to be one of the greatest moments of my life, it was also the most stressful, chaotic and traumatising time of my life, all at the same time. \"\n\nShe describes it as the \"beginning of the end\" of her career, which led to the fateful trip back to the Gold Coast — and OnlyFans.\n\nHow OnlyFans restored Gracie's self-esteem\n\nLiving at home with her dad, Gracie said she was kept afloat by the kindness of fans who would write to ask when she would return to racing.\n\nThen came the suggestion she start an OnlyFans account, something Gracie had to Google.\n\nOnlyFans is a social media network where creators (including sex workers, athletes, musicians and more) sell content to their subscribers.\n\n\"My fans would make cheeky comments like 'I'd pay to see you take your top off',\" she said.\n\nLoading Instagram content\n\nGracie happened to know someone who had an account, and asked if she could see it.\n\n\"It was like an Instagram feed, but with photos that were a little more risqué, a bit more sexualised, nothing crazy, and I was like 'I can do that',\" she said.\n\nTen minutes later, Gracie had signed up and posted her first bikini shot, albeit not from a place of self-confidence.\n\n\"I was still in the mindset of not loving and not appreciating myself,\" she said.\n\n\"I was proud of who I was at the core. I knew deep down I was a good person, I was motivated, hard-working, a good friend … but externally, I thought I was a 2 out of 10.\n\nThe kindness of fans kept Gracie afloat in her darkest days. (GT World Challenge Australia/Jack Martin Photography: Jack Martin)\n\n\"So when the fans kept messaging and asking me for content, I thought, 'well, if you're gonna pay for it, that's on you buddy, no refunds'.\n\n\"It was kinda like, 'sucked in for you paying money to see this because I'm ugly, fat and awful'. That was my belief.\"\n\nAfter a career being told she was undesirable, Gracie said OnlyFans restored her self-esteem.\n\n\"Weirdly it gave me confidence because I had none, if that makes sense.\n\nOnlyFans gave Gracie the confidence she needed to get back into motor racing. (GT World Challenge Australia/Jack Martin Photography: Jack Martin)\n\n\"With a flick of a switch, I was like, 'what am I so worried about? I must not be as bad as I thought if people are reassuring me'.\n\n\"Actually getting acknowledgement and recognition was exactly what I needed, especially after being in the place I was in.\"\n\nAt no point did Gracie feel ambivalent about the move, arguing \"money talks\".\n\n\"The money was insane, so in my opinion, everyone else [and their opinions] could get f***ed. I didn't care,\" she said.\n\nThe long road back to motorsport\n\nFinally in a more stable place financially, and emboldened by her successful business venture, Gracie made the choice to return to motorsport in 2021.\n\nGracie returned to motorsport in 2021 and has made great gains since. (GT World Challenge Australia/Race Project: Daniel Kalisz)\n\nShe describes two difficult years of \"closed doors, unanswered phone calls and emails\".\n\nIt took a trip to the US, where she had a chance encounter with an OnlyFans staff member, to make the return a reality.\n\n\"I was at a content event, and I just said in passing, as a joke, 'you guys should sponsor me so I can go back to racing', and he said, 'absolutely, send me an email'.\"\n\nIn 2023, Gracie made a triumphant return to the GT World Challenge circuit, winning the Australian GT Trophy.\n\nIn 2023, Renee Gracie secured the Trophy Series in GT World Challenge Australia. (GT World Challenge Australia/Race Project: Daniel Kalisz)\n\nIn 2025, she once again leads the Am category, describing it as a \"dream\" return.\n\n\"I couldn't have scripted it better,\" she said.\n\n\"It's honestly been the best part of my life.\"\n\nGracie attributes that change to a new-found maturity, while she is also self-managed.\n\n\"I can handle situations differently now, and being able to steer the ship myself, as an older woman who has been successful in something else [made the biggest difference],\" she said.\n\nThat does not mean it has been all smooth sailing, with Gracie saying she had a \"lukewarm\" reception at first.\n\nGracie with teammate Paul Stokell in 2024. (GT World Challenge Australia/Race Project: Daniel Kalisz)\n\n\"I think people were a bit hesitant, like 'which Renee are we going to get?',\" she said.\n\n\"People sort of had two perspectives of me: either Renee who had a bit of a treacherous falling out with the sport, or the OnlyFans Renee. I think they were scared I was going to walk around with dildos in my hands.\n\n\"But once I started I think they realised I was actually the best version of Renee.\"\n\nSexism in motorsport may not have changed\n\nThere were other hiccups, too. In her first year on the circuit, and leading the championship, Gracie's car was conspicuously absent from TV coverage.\n\n\"I was completely cut out to the point where fans were writing in to [the broadcaster] and saying it was a disgrace,\" she said.\n\nWhile Gracie was reluctant to speculate on why, she said it was \"pretty obvious\" that it was because of her sponsor.\n\nGracie says Europe has embraced her and her team. (GT World Championship Australia/Jack Martin Photography: Jack Martin)\n\nShe said things have changed for the better since GT3 split from under the Supercars banner, but stopped short of saying the culture of motorsport has improved.\n\n\"I wish I could say it has changed, but I think it's only because I'm in a new category, with younger management, that I'm so accepted,\" Gracie said.\n\nShe said GT3 racing has the advantage of being a global sport, with Europe embracing her.\n\n\"They don't care if a car is sponsored by OnlyFans, because sex isn't as taboo, and the culture is more liberated [in Europe],\" Gracie said.\n\nRenee Gracie driving in the GT3. (GT World Challenge Australia/Race Project: Daniel Kalisz)\n\nBut while she is pessimistic about the culture of motorsport more broadly, she would still encourage young girls to pursue their racing dreams.\n\n\"Don't let anybody tell you what to do. If it's your burning desire to do something, do it. If, someone tells you no, find someone who will tell you yes,\" Gracie said.\n\n\"My biggest lesson is that it's OK to be told no, but you don't have to take no for an answer if you want it enough.\"",
    "source": "ABC",
    "cluster_id": 17
  },
  {
    "url": "https://www.smh.com.au/sport/tennis/sabalenka-beats-anisimova-to-win-back-to-back-us-opens-20250907-p5mszr.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "US Open is Aryna’s arena as top seed beats American to win back-to-back titles",
    "publish_date": "Sun, 07 Sep 2025 11:36:47 +1000",
    "category": "sports",
    "authors": [
      "Howard Fendrich"
    ],
    "text": "World No.1 Aryna Sabalenka retained her US Open crown with a battling 6-3 7-6(3) win over American eighth seed Amanda Anisimova in the US Open women’s final on Saturday, underlining her claim as the modern queen of the hardcourt.\n\nThe Belarusian has not missed a hardcourt major final since 2022, and her latest trophy brings her grand slam haul to four. It also made her the first woman to win back-to-back US Opens since Serena Williams claimed three straight from 2012 to 2014.\n\nAryna Sabalenka walks through the crowd to her team box after her straight sets victory in the US Open final. Credit: Getty Images\n\nThe clash between two of tennis’s hardest-hitting, biggest-serving women boiled down to unforced errors – Sabalenka had just 15 compared to 29 from the racquet of her opponent.\n\n“I want to thank everyone who came here, who flew in to be there in my box,” said Sabalenka, who fell to her knees after clinching victory with an unreturnable serve and embraced her coaches in the stands in a scene of utter joy.",
    "source": "SMH",
    "cluster_id": 18
  },
  {
    "url": "https://www.smh.com.au/sport/nrl/sharks-rocked-by-nicho-hynes-finals-ban-20250907-p5mt15.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Sharks rocked by Nicho Hynes finals ban",
    "publish_date": "Sun, 07 Sep 2025 11:13:48 +1000",
    "category": "sports",
    "authors": [
      "Dan Walsh"
    ],
    "text": "Cronulla’s million-dollar playmaker Nicho Hynes is facing a 1-2 week ban that will rub the Sharks chief playmaker out of their sudden-death finals clash with the Sydney Roosters.\n\nHynes was issued a grade 2 dangerous contact charge for the hip-drop tackle that injured Canterbury’s Marcelo Montoya on Saturday night, with the Bulldog’s ankle injury ruling him out of his side’s finals opener against Melbourne as well.\n\nAn early guilty plea would see Hynes accept a one-game ban, while the Sharks have until midday Monday to lodge a challenge against the match review committee’s ruling. An unsuccessful bid would earn him an extra week’s suspension.\n\nInjured five-eighth Braydon Trindall (ankle) is expected to return for Saturday’s showdown with the Roosters at Shark Park. Dragons-bound utility Daniel Atkinson would replace Hynes in the halves and impressed in the 24-6 win over Canterbury.",
    "source": "SMH",
    "cluster_id": 19
  },
  {
    "url": "https://www.smh.com.au/sport/afl/disgraceful-why-lion-should-be-fined-for-flop-20250907-p5mt18.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "'Disgraceful': Why Lion should be fined for 'flop'",
    "publish_date": "Sun, 07 Sep 2025 11:08:21 +1000",
    "category": "finance",
    "authors": [],
    "text": "'Disgraceful': Why Lion should be fined for 'flop'\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 20
  },
  {
    "url": "https://www.smh.com.au/sport/afl/collingwoods-bobby-hill-selection-conundrum-20250907-p5mt11.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Collingwood's Bobby Hill selection conundrum",
    "publish_date": "Sun, 07 Sep 2025 10:53:37 +1000",
    "category": "finance",
    "authors": [],
    "text": "Collingwood's Bobby Hill selection conundrum\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 21
  },
  {
    "url": "https://www.smh.com.au/sport/afl/giants-slammed-for-hero-play-in-finals-loss-20250907-p5mt12.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Giants slammed for 'hero' play in finals loss",
    "publish_date": "Sun, 07 Sep 2025 10:53:27 +1000",
    "category": "sports",
    "authors": [],
    "text": "Giants slammed for 'hero' play in finals loss\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 22
  },
  {
    "url": "https://www.smh.com.au/national/sydney-couple-faces-unthinkable-reality-two-weeks-out-from-wedding-20250907-p5mt0x.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Sydney couple faces unthinkable reality two weeks out from wedding",
    "publish_date": "Sun, 07 Sep 2025 10:39:25 +1000",
    "category": "finance",
    "authors": [],
    "text": "Sydney couple faces unthinkable reality two weeks out from wedding\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 23
  },
  {
    "url": "https://www.smh.com.au/national/western-australia/dockers-have-five-or-six-more-cracks-at-the-flag-fyfe-20250907-p5mt0t.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Dockers have five or six more cracks at the flag: Fyfe",
    "publish_date": "Sun, 07 Sep 2025 10:16:13 +1000",
    "category": "sports",
    "authors": [
      "Justin Chadwick"
    ],
    "text": "Fremantle great Nat Fyfe says he still ends his AFL career content despite not winning the premiership he so desperately craved, and he’s optimistic the current group have “five or six” more bites at the cherry.\n\nFyfe’s career came to a close on Saturday night when Fremantle suffered a heartbreaking one-point loss to Gold Coast in a pulsating elimination final at Optus Stadium.\n\nNat Fyfe of the Dockers is chaired off by Luke Ryan and Alex Pearce. Credit: AFL Photos via Getty Images\n\nThe Dockers led by six points with less than two minutes remaining, but a Mac Andrew goal with 72 seconds to go followed by a David Swallow behind with just nine seconds left on the clock sealed the 11.14 (80) to 12.7 (79) win for Gold Coast.\n\nFyfe was given a guard of honour after the final siren, with skipper Alex Pearce and Luke Ryan chairing him off.",
    "source": "SMH",
    "cluster_id": 10
  },
  {
    "url": "https://www.smh.com.au/lifestyle/fashion/the-timeless-style-lessons-we-learnt-from-the-duchess-of-kent-20250907-p5mt0a.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "The timeless style lessons we learnt from the Duchess of Kent",
    "publish_date": "Sun, 07 Sep 2025 09:57:38 +1000",
    "category": "lifestyle",
    "authors": [
      "Lisa Armstrong"
    ],
    "text": "There’s appropriate. There’s smart. There are lessons learned from studying the many pictures of oneself that are an inevitable part of a royal’s existence. And then there is that certain je ne sais quoi, or magic, that makes someone innately stylish. Without it, the first three can look staid and predictable.\n\nKatharine Kent, as she preferred to be known, and who died on Friday at the age of 92, had style in spades, which is all the more fascinating because she was such a retiring person. Like the Princess of Wales, she always managed to look as though she was delighted to be wherever she was.\n\nThe Duchess of Kent’s style through the years, from left: On her wedding day in a silk gown by John Cavanagh, at a wedding in 1988 and attending an event in 2016. Credit: Getty Images\n\nLesson one: a smile is a much-underestimated style asset. It looks charming when you’re young. But when you’re old, it keeps your face from collapsing.\n\nSweet but poised, even in early photographs where there are echoes of the youthful Grace Kelly in her dainty, blonde beauty and gracefulness, the duchess favoured simple, uncluttered necklines. For her wedding in 1961 – a starry occasion attended by Noel Coward and Douglas Fairbanks Jr – she wore 273 metres of silk gauze designed by John Cavanagh – a regal, high-necked, slender-bodiced dress that has withstood the test of time.",
    "source": "SMH",
    "cluster_id": 24
  },
  {
    "url": "https://www.smh.com.au/national/nsw/it-s-just-unpleasant-car-share-spots-drive-wedge-between-cafe-and-council-20250804-p5mk57.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "‘It’s just unpleasant’: Car share spots drive wedge between cafe and council",
    "publish_date": "Sun, 07 Sep 2025 09:57:34 +1000",
    "category": "finance",
    "authors": [
      "Cindy Yin"
    ],
    "text": "Sipping a coffee in Darlinghurst, visitors to a local plant shop and cafe are first met with Parisian-inspired scenes of al fresco dining areas and potted plants overflowing with lush greenery. But shattering the illusion are two GoGet vans parked squarely in front.\n\nLocal cafe Stanley Green has been at odds with the City of Sydney for more than a year over the council’s refusal to move two car share spaces where GoGet vans are parked next to coffee tables from sunrise to sunset, seven days a week.\n\nBobby Kamal, owner of the local cafe, says the council has dug its heels in and is refusing to move the car share spaces. Credit: Dylan Coker\n\nOwner Bobby Kamal is frustrated at the “visually detrimental” vans that he says obstruct views, disturbs customers and prevents visitors from fully enjoying the space. He has asked the council to move the two car share spaces so he can convert them into street dining space, but said it has not “budged”.\n\n“The vans overshadow the space and block sunlight. It’s visual pollution for us – we’ve spent so much time and money creating this beautiful, inviting space. But the only thing you can really see is the GoGet vans,” Kamal said.",
    "source": "SMH",
    "cluster_id": 25
  },
  {
    "url": "https://www.sbs.com.au/news/article/ley-stops-short-of-apologising-for-prices-indian-migrants-comments/s2li7sfrd",
    "title": "'Won't be repeated': Ley stops short of apologising for Price's Indian migrant remarks",
    "publish_date": "Sun, 7 Sep 2025 01:25:31 +0000",
    "category": "finance",
    "authors": [],
    "text": "Opposition leader Sussan Ley has stopped short of apologising for comments made by Liberal senator Jacinta Nampijinpa Price about Indian migrants, but said they were not correct and should not have taken place.\n\n\n\n\n\nSome members of the Australian-Indian community had been calling for Price to apologise , after the senator told the ABC Labor was accepting migrants who \"support their policies, their views and vote for them as well\", singling out \"the Indian community\" as an example.\n\n\n\n\n\nShortly after, Price appeared to walk back her comments, saying she didn't think she had anything to apologise for and appeared to accuse the interviewer of pushing the topic.\n\n\n\nLey told the ABC's Insiders program on Sunday that Price's comments \"won't be repeated\".\n\n\n\n\n\n\"The comments were wrong, not correct. They should not have taken place,\" she said.\n\n\n\n\n\n\"They will not be repeated. What I said subsequent and what I say now is to express my deep appreciation to the Indian community for all they have brought to Australia, for all they continue to bring, for their representation in every forum of society.\"\n\n\n\n\n\nLey praised Indian professionals and said many live in her electorate.\n\n\n\n\n\n\"We respect our Indian community as all our migrant communities.\"\n\n\n\n\n\nInsiders host David Speers pushed Ley on whether she would apologise for Price's comments but the opposition leader did not issue an apology.\n\n\n\n\n\nShe said she would be meeting with members of the Indian-Australian community on Sunday afternoon and said Nampijinpa Price is also engaging with the community.\n\n\n\n\n\nPrice's comments came after anti-immigration marches in capital cities and some regional areas, with some rhetoric from organisers singling out the Indian-Australian community.\n\n\n\nLey said on Insiders that the total number of migrants to Australia was putting pressure on jobs, infrastructure and services.\n\n\n\n\n\n\"It's not the migrants themselves themselves. I'm a migrant to this country, incredibly grateful for the opportunities it has given me and my family. I know other migrants feel the same. I welcome every single one of them,\" she said.\n\n\n\n\n\n\"The government failed in not getting infrastructure right.\"\n\n\n\n\n\n",
    "source": "SBS",
    "cluster_id": 26
  },
  {
    "url": "https://www.sbs.com.au/news/article/us-influencer-posts-second-crocodile-grabbing-video-amid-queensland-investigation/eu5oa942p",
    "title": "Crocodile-grabbing US influencer posts second video amid Queensland investigation",
    "publish_date": "Sun, 7 Sep 2025 00:35:48 +0000",
    "category": "finance",
    "authors": [],
    "text": "American influencer Mike Holston has shared another video of himself grabbing a juvenile crocodile in Australia, after Queensland authorities said it would investigate an initial video of him catching a freshwater crocodile.\n\n\n\n\n\nHolston, who posts videos under the username therealtarzann, came under criticism after sharing a video where he chases after a young crocodile in the Lockhart River, in Far North Queensland before tackling it in shallow water.\n\n\n\nHolston is then seen gagging the two-metre crocodile, saying it was a \"what dreams are made of\" to hold one, while blood dripped down his body from an apparent bite.\n\n\n\n\n\n\"This thing is sick,\" he says in the video.\n\n\n\n\n\n\"Ever since I was a kid I wanted to come to Australia and just look at crocodiles ... get my hands on them, see them up close.\n\n\n\n\n\n\"There's other crocs in here and it could get pretty ugly. I've got to get out of here fast.\"\n\n\n\n\n\nThe Queensland Department of Environment confirmed it was investigating Holston.\n\n\n\n\n\nHours later, Holston posted another video, this time getting off a boat and diving into wetlands to grab a crocodile again, this time a slightly larger saltwater species. The location was also tagged at the Lockhart River.\n\n\n\nA spokesperson for the Department told the ABC it was a \"significant offence to interfere with freshwater crocodiles in Queensland, not to mention extremely dangerous\".\n\n\n\n\n\nThe Department of Environment website states a fine of more than $2,500 can be imposed on someone caught interfering with a crocodile, administered on the spot.\n\n\n\n\n\nAnyone found to be feeding or deliberately disturbing crocodiles in Queensland could be fined more than $26,000.\n\n\n\n\n\nHolston has more than 15 million followers on Instagram and his crocodile videos have millions of views.\n\n\n\n\n\nSBS News has contacted Holston for comment.\n\n\n\n\n\nEarlier this year, another American influencer, Sam Jones, left the country after facing condemnation for sharing a now-deleted video of her briefly taking a baby wombat from its mother.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 27
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/radiotherapy-could-save-your-life-dispelling-the-misconceptions/uno2r91al",
    "title": "Radiotherapy could save your life: dispelling the misconceptions",
    "publish_date": "Sat, 6 Sep 2025 22:01:51 +0000",
    "category": "lifestyle",
    "authors": [],
    "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nWhen GP Melanie Mapleson noticed a lump above her collarbone, she went and got it checked immediately and waited for her results.\n\n\n\n\n\n\"Those days prior to the diagnosis when I'd felt the symptoms but hadn't got any answers, they were some of the worst days of my life\".\n\n\n\n\n\nAs a doctor herself, the 38-year-old knew there could be something seriously wrong, and what she was diagnosed with shocked her.\n\n\n\n\n\n“My mind was jumping to the worst possible case scenario and the worst conclusions, even though they were all hypothetical at that stage. So everything stopped. I stopped working. I basically just went into - sort of withdrew into - a state of numbness and just got all the necessary investigations and then was told by my lovely GP that I had Hodgkin's lymphoma.”\n\n\n\n\n\nAfter being diagnosed with cancer, Ms Mapleson heard about radiotherapy as a treatment option, but she was worried about potential side effects.\n\n\n\n\n\n“You go on deep dives when you're diagnosed with something like this, it's hard to resist the temptation to go and look at every possible source of information, even those that are most unreliable. And so it wasn't so much the team that was giving me misinformation, they were very clear on the fact that the radiotherapy would be a critical integral component of my cure. But some of the information that I was channelling through was incorrect. And I think that's where my fear was based, you know, around side effects and late effects and being radioactive. And I had a young child, so I was afraid of putting him at risk and all of that was really completely non-factual, but that's what the mind settled on when you're in a place of uncertainty and fear.”\n\n\n\n\n\nMs Mapleson decided to go ahead with radiation therapy as part of her treatment.\n\n\n\n\n\n“I turned up, got changed, lay down on the examination bed, and then was there for about 10, 15 minutes just lying there very, very still. And then I left. So there was really not much to it, and the staff were really lovely and receiving the radiation therapy, was never painful. I wasn't radioactive and my skin didn't break down and I didn't lose hair or anything based on the radiotherapy. So I had a bit of a mild cough for a period of time and some sensation of I guess discomfort while swallowing. But that was very short-lived. And because I was expecting it, I knew that it was part of that immediate side effects from the treatment that I'd had, and it did go away just as they said it would. So that was really it.”\n\n\n\n\n\nProfessor Sandra Turner, a senior radiation oncologist at the Sydney West Radiation Oncology Network at Westmead Hospital, says there are a lot of misconceptions when it comes to radiotherapy.\n\n\n\n\n\n“I think the common things we hear are that people fear radiotherapy and they worry that it's going to cause damage and side effects. They don't understand how safe and sophisticated it is. Often people think that you are going to be radioactive when you have treatment and that could be damaging to people's families or children or pregnant people. And although there are some much less common forms of radiation therapy that use radioactivity, the vast majority of people having radiotherapy are never radioactive. And the other thing is that people get very confused between chemotherapy and radiotherapy. So they don't understand that radiation is very focused, only treats the area that we need to treat with a very narrow safety margin. And so a lot of those generalized side effects like nausea and vomiting and other things that you can get from chemotherapy are much less common with radiotherapy, depending on that part of the body that we are treating.”\n\n\n\n\n\nProfessor Turner said that despite being a long-standing cancer treatment, 1 in 5 Australians who need radiotherapy never receive it. Research shows that people can be referred late which can reduce the treatment's effectiveness. There are also few to no radiotherapy machines in some parts of regional and rural Australia.\n\n\n\n\n\n“We know that sometimes lives can be lost because people don't get radiotherapy when they should. So we feel very much that every health professional, but particularly every doctor, needs to know at least the basics about what radiotherapy can do, how safe it is, how sophisticated it is, and what the process is of delivery so they can help advise and refer their patients like they need to on a whole lot of medical issues.”\n\n\n\n\n\nShe explained that the technology has improved immensely over the last few decades and now contributes to at least 40 per cent of cancer cures.\n\n\n\n\n\n“There used to be some places in the body that we couldn't easily use radiotherapy because of the sensitive structures or organs next to that area. And we are now able with our new technologies to be able to get around those problems. And mainly this has come about through being able to accurately visualize the organ or part of the body that's being treated at the time it's being treated. We can even follow where the cancer is within the target area that we are treating. For instance, in organs like say the lung, which moves a lot as people breathe when we're delivering the treatment, we can now make sure that we compensate for movement so that we can accurately track, for instance, the cancer in the lung so that we can be sure we're treating it every second that the machine is turned on.”\n\n\n\n\n\nOne type of cancer where radiotherapy is particularly effective is prostate cancer.\n\n\n\n\n\nKuldeep Duhan was diagnosed with the illness two years ago, he decided to go with radiotherapy treatment after hearing his options from oncologists.\n\n\n\n\n\n“It was an easy decision for me to do it because if I went for the surgery I would've had to take a month off. And from a work point of view, it won't suit me. When you are getting the radiotherapy done, you don't feel anything and everything was really seamless from my point of view. Basically I continued to work because I'll get it done in the morning and then come to work and I'll do my normal days work.”\n\n\n\n\n\nThe 63-year-old goes for regular check-ups and is grateful to his care team for the support he receives, while Ms Mapleson has reached two years of complete clinical remission.\n\n\n\n\n\nProfessor Jared Martin, a clinical and research radiation oncologist, said radiation therapy is an effective cancer treatment, but that it's often best used in combination with chemotherapy and surgery.\n\n\n\n\n\n“A lot of what we've learned from clinical trials has often been for some quite complex cancers which that just one treatment alone is unlikely to get the best outcome. Quite often you do need to get some combination of both or even all three of those modalities in a very particular kind of sequence and even overlapping sometimes to get the best chance of controlling the disease. And then on top of that, we obviously also try to prioritize quality of life because the side effects both from the tumour as well as the treatment are a huge factor. And when we have shared decision making with patients, we really do try to be very collaborative, I guess, on trying to figure out priorities, because for instance, I treat a lot of prostate cancer and it might be for a particular couple, sexual function might be a huge priority and that might be very important in helping guide treatment decisions.”\n\n\n\n\n\nProfessor Martin said while research into radiotherapy has been revolutionary, there has been poor messaging around its benefits, which extend beyond cancer.\n\n\n\n\n\n“This is kind of a bit mind-blowing, but it actually turns out that very low dose radiotherapy may be of some benefit for people with some chronic inflammatory conditions like plantar fasciitis, for instance, which is a condition that can affect people's ability to walk. So in radiation oncology, we're now working hard to get good high quality data about exactly how much we can maybe help people with these other conditions as well.”\n\n\n\n\n\nProfessor Turner is also the co-chair of World Radiotherapy Awareness Day, being launched on the 7 th of September.\n\n\n\n\n\n“World Radiotherapy Awareness Day is a way to bring the whole radiation oncology community together, and also people that have been touched by cancer and had radiation therapy, patients and survivors, and their families, and bring everyone together to raise their voice around the same issues that are worldwide. And these are about lack of awareness, lack of education, fear of radiotherapy, and access to radiotherapy, because we haven't talked about this, but in many places in the world, there aren't even any radiation machines. And ultimately, what we'd like to do is to use that joint power and amplification of that voice to impact decision makers, policy makers, and governments to understand the importance of radiation therapy and to appropriately invest in radiotherapy services that are needed to make sure that all patients get good access to radiotherapy.”\n\n\n\n",
    "source": "SBS",
    "cluster_id": 28
  },
  {
    "url": "https://www.sbs.com.au/news/article/cancer-patients-are-missing-out-on-this-life-saving-treatment/7gvsskz2v",
    "title": "Melanie was sceptical of this underutilised cancer treatment. It saved her life",
    "publish_date": "Sat, 6 Sep 2025 20:41:10 +0000",
    "category": "lifestyle",
    "authors": [],
    "text": "When Melanie Mapleson noticed a lump above her collarbone, she got it checked immediately and waited for her results.\n\n\n\n\n\nAs a doctor herself, the 38-year-old knew there could be something seriously wrong.\n\n\n\n\n\n\"Those days prior to the diagnosis when I'd felt the symptoms but hadn't got any answers, they were some of the worst days of my life,\" she tells SBS News.\n\n\n\nMy mind was jumping to the worst possible case scenario and the worst conclusions, even though they were all hypothetical at that stage.\n\nMapleson was diagnosed with Hodgkin's Lymphoma — a form of cancer that attacks the lymphatic system — in 2023 and describes feeling a \"wave of numbness\" at the news.\n\n\n\n\n\nIn the days following, she was offered radiotherapy as a treatment option.\n\n\n\n\n\nMapleson worried if she opted for radiotherapy, she could become radioactive, leaving her with damaged skin and hair loss.\n\n\n\n\n\nAbove all, she was concerned she wouldn't be able to care for her son, who was two years old at the time.\n\n\n\nLISTEN TO Radiotherapy could save your life: dispelling the misconceptions SBS News 10:13 English\n\nBut despite her reservations, the treatment proved to be life-saving.\n\n\n\n\n\n\"When you're diagnosed with something like this, it's hard to resist the temptation to go and look at every possible source of information, even those that are most unreliable,\" Mapleson says.\n\n\n\n\n\n\"I had a young child, so I was afraid of putting him at risk and all of that was really completely non-factual, but that's what the mind settled on when you're in a place of uncertainty and fear.\"\n\n\n\nREAD MORE The complex decision more Australians are making around cancer treatment\n\nWhy radiotherapy is underutilised\n\nDespite radiotherapy being a safe and reliable treatment for many types of cancer, one in five eligible Australian cancer patients never receive it, according to research cited by Australian oncologists.\n\n\n\nRadiation therapy machines have advanced significantly over the past few decades, according to oncologists. Source: Supplied / St George Cancer Care Centre Professor Sandra Turner, a senior radiation oncologist at the Sydney West Radiation Oncology Network at Westmead Hospital, explains that general knowledge about the treatment in Australia is outdated.\n\n\n\n\n\n\"We know that sometimes lives can be lost because people don't get radiotherapy when they should,\" she says.\n\n\n\n\n\n\"So we feel very much that every health professional, but particularly every doctor, needs to know at least the basics about what radiotherapy can do, how safe it is, how sophisticated it is, and what the process of delivery is so they can help advise and refer their patients.\"\n\n\n\n\n\nTurner says the technology has improved \"immensely\" over the last few decades and now contributes to at least 40 per cent of cancer eradication.\n\n\n\n\n\n\"There used to be some places in the body that we couldn't easily use radiotherapy because of the sensitive structures or organs next to that area,\" she says.\n\n\n\nWith our new technologies, [we are] able to get around those problems.\n\n\"And mainly this has come about through being able to accurately visualise the organ or part of the body that's being treated at the time it's being treated.\"\n\n\n\nProfessor Jarad Martin, a clinical and research radiation oncologist, agrees that radiation therapy is an effective cancer treatment, but says it's often best used in combination with chemotherapy and surgery.\n\n\n\n\n\n\"A lot of what we've learned from clinical trials has often been that for some quite complex cancers, just one treatment alone is unlikely to get the best outcome,\" he says.\n\n\n\n\n\n\"Quite often you do need to get some combination of both or even all three of those modalities in a very particular kind of sequence and even overlapping sometimes to get the best chance of controlling the disease.\"\n\n\n\nQuality of life\n\nAnother key factor in determining a course of treatment is its potential impact on someone's quality of life.\n\n\n\n\n\nIt's a consideration that was at the front of his mind for 63-year-old Kuldeep Duhan, who was diagnosed with prostate cancer two years ago.\n\n\n\n\n\nDespite the side effects — with the most common being skin irritation and fatigue — Duhan tells SBS News his experience of radiotherapy treatment was relatively stress-free.\n\n\n\nWhen considering his cancer treatment options, Kuldeep Duhan says he wanted to prioritise his ability to keep working. Source: Supplied \"It was an easy decision for me to do it because if I went for the surgery, I would've had to take a month off work,\" Duhan says.\n\n\n\n\n\n\"When you are getting the radiotherapy done, you don't feel anything and everything was really seamless from my point of view. I continued to work because I'd get it done in the morning, and then come to work and I'd do my normal day's work.\"\n\n\n\n\n\nMapleson also described radiotherapy as pain-free.\n\n\n\n\n\n\"I wasn't radioactive and my skin didn't break down, and I didn't lose hair or anything based on the radiotherapy,\" she says.\n\n\n\n\n\n\"So I had a bit of a mild cough for a period of time and some sensation of I guess discomfort while swallowing. But that was very short-lived. And because I was expecting it, I knew that it was part of the immediate side effects from the treatment.\"\n\n\n\nMapleson and Duhan have since successfully finished their radiation therapies, but Turner says other patients could still be sceptical or fearful of the treatment.\n\n\n\nDispelling misconceptions\n\nOne of the most common fears stems from radiation exposure, which can lead patients to believe they are at high risk of becoming \"radioactive\".\n\n\n\n\n\nBut Turner says this is a misconception.\n\n\n\n\n\n\"Often people think that you are going to be radioactive when you have treatment and that could be damaging to people's families or children or pregnant people,\" she says.\n\n\n\nAlthough there are some much less common forms of radiation therapy that use radioactivity, the vast majority of people having radiotherapy are never radioactive.\n\nTurner has also come across patients who don't understand the difference between radiotherapy and chemotherapy, which is another common treatment for cancer.\n\n\n\n\n\n\"Radiation is very focused and only treats the area that we need to treat with a very narrow safety margin,\" she says.\n\n\n\n\n\n\"So a lot of those generalised side effects like nausea and vomiting and other things that you can get from chemotherapy are much less common with radiotherapy, depending on that part of the body that we are treating.\"\n\n\n\n'Mind-blowing' applications\n\nMartin says radiotherapy can even have benefits beyond treating cancer.\n\n\n\n\n\n\"This is kind of a bit mind-blowing, but it actually turns out that very low dose radiotherapy may be of some benefit for people with some chronic inflammatory conditions like plantar fasciitis, for instance, which is a condition that can affect people's ability to walk,\" he says.\n\n\n\n\n\n\"So in radiation oncology, we're now working hard to get good high quality data about exactly how much we can maybe help people with these other conditions as well.\"\n\n\n\nLISTEN TO Michael received a devastating late-stage diagnosis. Why it's a trend among young people SBS News 06:01 English\n\nTurner also emphasised the importance of well-funded radiotherapy research.\n\n\n\n\n\n\"It's important that decision makers, policy makers, and governments understand the importance of radiation therapy and to appropriately invest in radiotherapy services that are needed to make sure that all patients get good access to radiotherapy,\" she says.\n\n\n\nRaising awareness\n\nTurner is also the co-chair of the World Radiotherapy Awareness Day committee, a global campaign launched to highlight the importance of radiotherapy in treating cancer and to advocate for its universal access, which is being launched on 7 September.\n\n\n\n\n\nOrganisers of the event say research shows approximately 200 million people live in countries with no radiotherapy facilities.\n\n\n\nREAD MORE A breakthrough and funding pledge for one of Australia's most common cancers\n\n\"World Radiotherapy Awareness Day is a way to bring the whole radiation oncology community together, and also people that have been touched by cancer and had radiation therapy, patients and survivors, and their families, and bring everyone together to raise their voice around the same issues that are worldwide,\" Turner says.\n\n\n\n\n\n\"And these are about lack of awareness, lack of education, fear of radiotherapy, and access to radiotherapy.\"\n\n\n\n\n\nMapleson says her views on radiotherapy have changed significantly since undergoing treatment.\n\n\n\n\n\n\"I did experience the fear, but I understand now that I was sort of misled online to believe certain things that aren't in fact true about the treatment.\"\n\n\n\n\n\nDisclaimer: The information in this article is for general information purposes only and should not be relied on as a substitute for professional medical advice. Readers are advised to consult a qualified health professional for guidance specific to their situation.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 28
  },
  {
    "url": "https://www.sbs.com.au/news/article/racism-nursing-nsw-report/f3go0btpx",
    "title": "Loveness says she experienced racism while working as a nurse. She isn't the only one",
    "publish_date": "Sat, 6 Sep 2025 01:29:10 +0000",
    "category": "finance",
    "authors": [],
    "text": "When Loveness Tsitsi Mauwa started her first job in a New South Wales hospital as a nurse, a colleague told her there was what she called a template for career success in the hospital.\n\n\n\n\n\n\"She told me to progress, you have to be young, Caucasian and beautiful. And at that time, it didn't make sense to me,\" Mauwa, who was born in Zimbabwe and came to Australia on a skilled worker visa, told SBS News.\n\n\n\n\n\nBut as she stayed in the sector for longer, she realised the template existed. In the following decade, Mauwa applied for various opportunities to progress her career, only to find she often didn't make it to the final stage.\n\n\n\n\n\n\"I did put out some applications, and in one of the applications, I was promised I was going to get an opportunity, but that opportunity never came. But everyone else who had applied who met the criteria was able to progress,\" she said.\n\n\n\n\n\nMauwa said the level of racism and discrimination she experienced from colleagues drove her out of working in nursing full-time.\n\n\n\n\n\nAs one of the critical sectors that face a labour shortage, the federal government has been prioritising visas for nurses in the skilled migration system.\n\n\n\n\n\nMauwa said that in the two decades she's lived and worked in Australia, she has seen the workforce become more diverse, but barriers still exist.\n\n\n\nTwo-thirds of nurses and midwives from culturally and linguistically diverse backgrounds in NSW have experienced racism at work, according to a new report by the NSW Nurses and Midwives' Association.\n\n\n\n\n\nOver 3,000 nursing union members were surveyed for the report. 64 per cent said they had experienced direct racism from staff or patients.\n\n\n\n\n\nThe report calls on employers to ensure all staff complete bystander action education. Other recommendations include prioritising the elimination of institutional racism; policies and training on incident reporting; and monitoring the effectiveness of co-designed anti-racism training.\n\n\n\n\n\nAn anti-racism roundtable will now be held to form policies and address systemic racism.\n\n\n\n\n\nThe general secretary at NSW Nurses and Midwives' Association, Shaye Candish, says the union has launched a partnership to ensure progress is made.\n\n\n\nLISTEN TO Call for action after report details racism faced by nurses, midwives SBS News 04:30 English\n\n\"It will be chaired by the Human Rights Commission, and we will have participants from governments, from employers, from the union, from the advocacy groups, from all stakeholders involved in this collaborative,\" Candish said.\n\n\n\n\n\n\"The reality, unfortunately, is that racism is a perverse problem, and it is a really layered and complex problem. It's going to take a lot of work and commitment from organisations.\n\n\n\n\n\n\"But it's also going to take a collaboration from all of our organisations, because there is no one simple solution, and there is no one organisation that can fix this on their own.\"\n\n\n\n'Racism is making people sick'\n\nRace Discrimination Commissioner Giridharan Sivaraman said the report shows racism is a public health emergency that must be dealt with urgently.\n\n\n\n\n\n\"Put simply, racism is making people sick. Racism is stopping people who are sick from getting better, and racism is making people who are sick get worse,\" he said.\n\n\n\n\n\nSivaraman says he launched a National Anti-Racism Framework last year, but hasn't seen governments put it into action.\n\n\n\n\n\nHe said that the nurses' union's report \"shows that the recommendations, and our framework, which align completely with the recommendations and their report, need to be implemented\".\n\n\n\nRace Discrimination Commissioner Giridharan Sivaraman says racism is a public health emergency. Source: AAP / Mick Tsikas NSW Health Minister Ryan Park says there are robust anti-racism policies in place, but individuals need to work together to ensure they are implemented.\n\n\n\n\n\n\"When people don't feel safe, they don't feel culturally safe, within our settings, then the health outcomes are also worse,\" Park said.\n\n\n\n\n\n\"Racism is not just offensive, it can have serious detrimental impacts on people's health and wellbeing — both in terms of our staff, but also just as importantly our patients.\"\n\n\n\n\n\nFor Mauwa, an important step is eliminating the barriers she says are stopping culturally and linguistically diverse workers from moving up in their careers.\n\n\n\n\n\n\"I think the health system is happy if we (are) just working on the floor, but not wanting to progress into management or senior roles.\"\n\n\n\n",
    "source": "SBS",
    "cluster_id": 29
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/cultural-pillage-writers-devastated-by-decision-to-close-iconic-literary-journal-meanjin/1fpasyqu5",
    "title": "'Cultural pillage': Writers devastated by decision to close iconic literary journal Meanjin",
    "publish_date": "Fri, 5 Sep 2025 22:00:00 +0000",
    "category": "finance",
    "authors": [],
    "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts .\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nAfter 85 years, one of Australia's oldest literary journals, Meanjin, will cease publication.\n\n\n\n\n\nFounded in 1940 in Brisbane, the journal is the country's second oldest literary journal after the Southerly.\n\n\n\n\n\nThe journal's name comes from the local Indigenous Yuggera language - and refers to the site where central Brisbane sits.\n\n\n\n\n\nFounding editor Clem Christesen said at the time, the name honours the importance of place in the development of culture.\n\n\n\n\n\nIn 1945, the journal's operations moved to Melbourne, after an invitation by the University of Melbourne.\n\n\n\n\n\nAnd then in 2008, Meanjin became an editorially independent imprint of Melbourne University Publishing.\n\n\n\n\n\nIn a statement, Melbourne University Publishing says the Board decided financial constraints mean the final issue will be released in December.\n\n\n\n\n\nThe statement goes on to say that the two part-time staff of Meanjin were not involved in the decision.\n\n\n\n\n\nThe decision to close Meanjin has been widely criticised by many, including award-winning writers and prominent literary figures, including Louise Adler and author Sophie Cunningham.\n\n\n\n\n\nAs of Friday (5 Sept), more than 700 people have signed an open letter to the vice-chancellor of the University of Melbourne, Emma Johnston, to sacrifice 10 per cent of her salary to save the literary magazine.\n\n\n\n\n\nSBS News has contacted Professor Johnston - and has not yet received a response.\n\n\n\n\n\nDr Jeanine Leane is a Wiradjuri writer, poet and academic, currently based in Melbourne.\n\n\n\n\n\nFor two-and-a half years, she was working as a poetry editor with Meanjin.\n\n\n\n\n\nShe says she has seen a vast number of diverse voices, in terms of poetry during her time at Meanjin.\n\n\n\n\n\n\"I found like I really had a free reign there to be adventurous, to cast out, and to make sure to cast my eye very, very broadly across and to publish a really diverse culturally linguistically, socially and politically diverse range of palettes in that space.\"\n\n\n\n\n\nDr Leane talks about the shift that happened in 1977 for First Nations communities.\n\n\n\n\n\n\"That first issue in 1977 did really evidence a shift, a cultural shift in the nation. And (Jim) Davidson put together this anthology in 1977, First Nations writing today, which was a collection from which the time was one of the early journals to showcase Aboriginal and Torres Strait Islander voices nationally.\"\n\n\n\n\n\nShe says its been an important space in historically and culturally for First Nations cultural expression.\n\n\n\n\n\n\"Meanjin has had that very strong commitment to First Nations writings, cultural and sociopolitical expression ever since that time. And arts and culture. Esther (Anatolitis) was a great arts and culture advocate, and when she became the 12th editor of Meanjin in late 2022, she established a literary and cultural advisory board.\"\n\n\n\n\n\nDr Jeanine Leane says the cultural advisory board was filled with Indigenous and culturally diverse writers and thinkers.\n\n\n\n\n\nIt centered on increasing First Nations writing and publication, as well as honouring elders and recognising the work that has been done historically, particularly in the early days of the publication.\n\n\n\n\n\nDr Jeanine Leane says the decision to close Meanjin will have serious and severe consequences for Australian writers and their audiences.\n\n\n\n\n\n\"It is cultural pillage. A real - it is a type, if you like - I deliberately use that word editing and national consciousness in a way. It's a way of enforcing, I suppose, shutting down a whole lot of voices. So in many ways it's a form of censorship. Shutting down an avenue for a lot of voices is a form of censorship.\"\n\n\n\n\n\nShe says the absence of the journal will also remove an important forum and community to develop and nurture Australian storytellers.\n\n\n\n\n\n\"And it's one less space; one more space taken away from us as a minority, but a minority but very prolific and very articulate community. It was one more safe space that we had that is now being taken away from us.\"\n\n\n\n\n\nCarody Culver who's the editor of the literary Journal, Griffith Review, says the contribution of the journal has been seminal in the development of Australia's literary scene.\n\n\n\n\n\n\"It's really devastating news. Griffith Review - we've had a long standing allyship with Meanjin Esther Anatolitis, the current editor, and what a wonderful advocate she is for arts and culture in Australia. And Meanjin, it's one of the country's most pre-eminent literary journals. It's the second oldest - was established in 1940, and over the last eight and a bit decades, it's published incredible work. I mean, the journal is responsible for giving us the phrase 'cultural cringe', which has become so embedded in the Australian lexicon. It's been an incredible platform for emerging and established writers and for First Nations writers as well.\"\n\n\n\n\n\nShe says the resource and benefits provided by the journal enriches the nation.\n\n\n\n\n\n\"Journals are wonderful platforms for writers at all stages of their careers. And in order to be able to run journals, having institutional support from somewhere like a university is incredibly valuable. So I know from my own experience of being editor of Griffith Review. We receive support from Griffith University as well as organisational funding from Creative Australia. And that's so vital to us. And this notion that some people have that literary journals should be expected to generate revenue - that's not what we're here for.\"\n\n\n\n\n\nMs Culver says she remembers the inspiration Meanjin provided when she was doing her PhD about 15 to 20 years ago.\n\n\n\n\n\n\"The expansiveness of the ideas that you would find in its pages and the fact that it had this incredibly rich, rich history and that it had contributed to our intellectual life, our intellectual culture over such a long period. So for the time that I was at my career at that stage, early on trying to establish a name to myself and trying to find the right career pathway for the editorial work that I wanted to do. Meanjin was quite a beacon for me.\"\n\n\n\n\n\nMs Culver says she has written a piece about the role and importance of literary journals in the upcoming 85th edition of Meanjin.\n\n\n\n\n\nShe says journals are really good at navigating the unpredictability and the complexity of contemporary publishing, which caters to dedicated audiences of readers and writers.\n\n\n\n\n\n\"My piece in Meanjin is really just a reflection on why journals are important and why it can sometimes feel - be a bit challenging to fearlessly or constantly having to justify the reason that journals should exist.\"\n\n\n\n\n\nShe says we have many wonderful publications in Australia that are helping to platform the work of new voices and established voices - but the absence of Meanjin will be felt.\n\n\n\n\n\n\"Knowing, knowing what I know now that Meanjin will no longer exist after this 85th edition has come out, it's, it's really heartbreaking.\"\n\n\n\n\n\nMs Culver says it's been really lovely to see the huge outpouring of support on social media, as well as news articles on the closure of Meanjin.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 30
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/anti-immigration-rallies-ignore-australias-economic-dependence-on-migration/gez59p6r5",
    "title": "Anti-immigration rallies ignore Australia's economic dependence on migration",
    "publish_date": "Fri, 5 Sep 2025 21:00:00 +0000",
    "category": "finance",
    "authors": [],
    "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nOver the weekend, thousands rallied across Australia in anti-immigration marches.\n\n\n\n\n\nAt the heart of the rallies was a call to end what protest organisers called \"mass migration\" to Australia.\n\n\n\n\n\nScientia Professor at the Kaldor Centre for International Refugee Law Jane McAdam says the rhetoric at these marches focused on a key misconception- that migrants are to blame for a number of pressures impacting Australians.\n\n\n\n\n\nSeen on banners, chanted in slogans and speeches at the rallies was the idea that high migrant numbers are responsible for rising cost of living, housing shortages and job insecurity, among other issues.\n\n\n\n\n\n\"Unfortunately, there's a lot of misunderstanding and misinformation out there about the links between migration, housing shortages, cost of living pressures, infrastructure, all those sorts of things. And I think that that has been exploited by certain elements of the community, particularly on the far right to suggest that migrants are taking your houses, taking your jobs, these sorts of things.\"\n\n\n\n\n\nGlobal Migration expert and Associate Professor of Public Policy at the University of Sydney Anna Boucher says issues like the housing crisis and rising cost of living are undoubtedly impacting many Australians.\n\n\n\n\n\nHowever, she says the idea that the fix for these pressures is to curb migration is misdirected, and misses the vital role migrants play in the functioning of Australia's economy and society.\n\n\n\n\n\n\"I mean 50 per cent of the Australian population are either migrant background or have one parent who was, so we're actually talking about most of Australia. In essence, Australia couldn't function without migration. International student migration comprise is a big component of our gross domestic product. Migrants provide necessary labor into skill shortage areas that we can't meet through domestic supply and immigration is a central component of Australia's multicultural identity.”:\n\n\n\n\n\nThe most recent ABS data shows migrants make up nearly one-third of Australia's workforce.\n\n\n\n\n\nAustralia's migrant population is also one of the most skilled among OECD countries, with nearly six in ten migrants holding a university degree or higher, in contrast with around four in ten native-born Australians.\n\n\n\n\n\nMatt Grudnoff , Senior Economist at the Australia Institute says Australia relies on its skilled migrants to fill crucial gaps in the jobs market.\n\n\n\n\n\n\"So migrants tend to be younger than the average. Australian tend to be well-skilled and so they add a lot to Australia's economy. Australia's migration system in particular is very skills focused, so it tends to target migrants with skills that we have a shortage of. And so what they actually do is they enable us to continue to have access to goods and services that might otherwise be difficult to produce in Australia or would become far more expensive.\"\n\n\n\n\n\nMigrants make up a particularly large share of the workforce in key industries such as hospitality, health care, professional services, manufacturing and administrative services.\n\n\n\n\n\nAccording to 2021-2022 ABS jobs data, 15 percent of migrants in Australia work in the area of health care and social assistance, and the 2021 census shows more than 40 per cent of registered nurses and aged and disabled carers were born overseas.\n\n\n\n\n\nProfessor Boucher says with Australia's population aging, it's expected the country will rely heavily on migrant health workers in future.\n\n\n\n\n\nWith no current visa category for low-skilled migrants, she says changes may need to be made to enable more skilled and low-skilled migrants to fill gaps expected to grow in this industry.\n\n\n\n\n\n\"So yeah, it's clear that we won't meet the needs of our aging population exclusively through our domestic labor market... we will need to think quite carefully about how we bring in migrant labor whether that's forms of labor agreements as they're called, or whether there are changes to the visa structure to permit that to occur.”\n\n\n\n\n\nMr Grudnoff says one of the key messages voiced at the anti-immigration rallies over the weekend was a concern that mass migration numbers are to blame for the housing crisis Australia is experiencing.\n\n\n\n\n\nHe says there are a few key issues with this concern.\n\n\n\n\n\nFirstly, Australia is not experiencing the historic surge in migration protesters and rally organisers claim.\n\n\n\n\n\nWhile a slump in migration during the COVID-19 Pandemic was followed by an increase once borders re-opened, Mr Grudnoff says since 2024, population growth appears to have fallen back to pre-Covid rates.\n\n\n\n\n\nHe says the idea that the population is growing at a faster rate than housing is also not supported by the data.\n\n\n\n\n\n\"Over the last 10 years, the population has grown by 16%. So in order to just house that extra 16% of people, we'd need to increase the number of homes by 16%. But the number of homes has increased by more than 16%, it's increased by 19%. So we're actually building, so actually the number of homes is growing faster than the population.\"\n\n\n\n\n\nHe says lack of affordable housing Australians are experiencing is in part driven by tax laws which favor investors.\n\n\n\n\n\n\"There's been a big increase in demand for housing and in particular, investors demand for housing. So what's happened is the capital gains tax discount was introduced under the Howard government that has made making money out of housing very tax effective. It's encouraged lots of people to go out and buy an investment property. These people are outbidding first home buyers effectively and increasing price of housing and stopping people from getting into the housing market.\"\n\n\n\n\n\nAccording to Mr Grudnoff, a lack of low-cost government housing is also contributing to the crisis.\n\n\n\n\n\n\"So one of the problems in Australia with our housing is that the government has withdrawn from the housing sector. We used to be in the sixties, seventies and eighties, the government was heavily involved in supplying public housing and now they've largely vacated that they're not building nearly as much housing. And so consequently there is a lot less of that housing available and this is adding to the affordability crisis.\"\n\n\n\n\n\nProfessor Boucher says as with other concerns over pressures like cost of living, it's clear blame for the housing crisis is falling in the wrong place.\n\n\n\n\n\n\"It doesn't mean that there might not be an issue with housing, but that needs to be addressed separately. And I think that's maybe the answer is more densification. Maybe it is a speeding up the rate of construction. Maybe it is different methods of urban planning. We have a very low density city for its population size in Sydney, for instance, if you compare it with comparable cities overseas. But that's a product of our poor planning, not of migrants.\"\n\n\n\n\n\nProfessor McAdam says while concerns people have about housing, cost of living and infrastructure can't be ignored, migration should be considered an important part of the solution, rather than the problem.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 31
  },
  {
    "url": "https://www.sbs.com.au/news/article/in-sydneys-little-india-locals-say-price-is-way-off-with-her-indian-migrant-remarks/cuvyjzcmb",
    "title": "In Sydney's 'Little India', locals say Price is 'way off' with her Indian migrant remarks",
    "publish_date": "Fri, 5 Sep 2025 20:42:25 +0000",
    "category": "finance",
    "authors": [],
    "text": "Some members of the Australian-Indian community have urged Liberal senator Jacinta Nampijinpa Price to apologise, after she claimed the government prioritises Indian migrants because many of them vote for Labor.\n\n\n\n\n\nEarlier this week, Price told ABC Radio Labor is accepting migrants who \"support their policies, their views and vote for them as well\", singling out \"the Indian community\" as an example.\n\n\n\n\n\nShortly after, she appeared to walk back her comments, saying she didn't think she had anything to apologise for and appeared to accuse the interviewer of pushing the topic.\n\n\n\n\n\nIn the western Sydney suburb of Harris Park — also known as Little India — some locals told SBS News the remarks have left them feeling unfairly targeted, coming just days after anti-immigration rallies that took place across the country.\n\n\n\n'It's not a thing'\n\nRitwik Singh, whose father migrated to Australia on a skilled visa, said the rallies have already unsettled many in the community.\n\n\n\n\n\n\"It was probably just a bit of a guise for some deeper stuff, like white supremacy,\" he told SBS News. \"A lot of people on my WhatsApp were saying that Indians were being called out and targeted in particular with this protest.\"\n\n\n\n\n\nSingh said friends overseas had reached out to check if he was safe. \"The reaction has not been positive. I had a friend from India reach out to me, saying, 'Are you guys alright?'\"\n\n\n\n\n\nSingh rejected Price's claim that Indians overwhelmingly vote Labor. \"I don't agree with her. She's way off with her comments,\" he said.\n\n\n\n\n\n\"Indian people tend to vote by looking at their backyard. They're looking at what's most important for them … They don't necessarily side each way, but both parties definitely try and get the vote because the size of the population is pretty meaningful.\"\n\n\n\nHarris Park resident Ritwik Singh said Liberal senator Jacinta Nampijinpa Price was \"way off\" with comments that claimed the government prioritises Indian migrants because many of them vote for Labor. Source: SBS News\n\n'National asset'\n\nAnother Harris Park resident, Nashih Fatima, who migrated from India seven years ago, also dismissed Price's claims about voting patterns.\n\n\n\n\n\n\"Everyone has different political parties and different views,\" she told SBS News. \"That's silly. It's not a thing.\"\n\n\n\n\n\n\"We left our country because we wanted to make this country good and better. Every immigrant has the right to live and work and be happy here.\"\n\n\n\nShail Wadhwa, president of the Council of Indian Australians Inc, said Price's remarks fuel division.\n\n\n\n\n\n\"We strongly reject any narrative that unfairly targets the Indian Australian community or misrepresents their contribution to Australian society,\" Wadhwa told SBS News. \"She should be apologising to the community.\"\n\n\n\n\n\nWadhwa pointed to a 2022 federal government report describing the Indian diaspora as a \"national asset\", highlighting its youth, high levels of education, and above-average earnings. People born in India now make up the second-largest overseas-born population in Australia, behind those from England.\n\n\n\n'Should have been voting Coalition'\n\nPrice cited polling from political research company RedBridge, showing around 85 per cent of Indian-Australians voted Labor in 2022.\n\n\n\n\n\nBut RedBridge director Kos Samaras said the numbers don't tell the full story.\n\n\n\n\n\n\"These communities should have been voting Coalition,\" Samaras said, noting that the Howard government had been responsible for introducing skilled migration pathways regularly used by Indian migrants.\n\n\n\n\n\n\"On paper, they should be voting conservative … but when we ask them why they don't, the answer is blunt: the Coalition does not like them,\" Samaras said.\n\n\n\nDamage to the 'Liberal brand'\n\nAustralian National University academic Frank Bongiorno, who specialises in political history, said Price's remarks were \"very damaging to the Liberal brand\" at a time when the party was already struggling for votes.\n\n\n\n\n\n\"All the indications are that it's electoral poison,\" he told the Australian Associated Press.\n\n\n\nREAD MORE Liberals distance themselves from Price's Indian migrant remark as backlash grows\n\nBongiorno said the comments were likely to have a lasting impact on how migrant communities viewed the Coalition. \"Those impressions stick and they can actually stick for years,\" he said.\n\n\n\n\n\n\"Many [migrants] do have quite conservative cultural values that probably are more in keeping with ideas that you find within the Liberal and the National Party but ... there's a sense this is a place that's hostile to them.\"\n\n\n\n\n\nWhile Singh believes anti-immigration sentiment is not widespread, he too warned it could have lasting consequences.\n\n\n\n\n\n\"It will become one of those reasons where people will stop wanting to send their kids [to Australia] for education, or you might have skilled migrants think that maybe Australia's not the best choice anymore,\" he said.\n\n\n\nLiberal MP side-steps calls for apology\n\nOpposition leader Sussan Ley was quick to stress the Coalition's support for Indian Australians, and said Australia's migration policy remained non-discriminatory.\n\n\n\n\n\nLiberal MP Leon Rebello, whose parents hail from the western Indian state of Goa, told SBS News he believes Price has \"walked back\" her comments and that the party must continue to support the community.\n\n\n\n\n\n\"The Indian community does so much and they've contributed so much to Australian society — I'm there with Jacinta in the party room, backing them every step of the way,\" he said.\n\n\n\n\"It's very disappointing that the marches were hijacked by neo-Nazis … However, the marches also had thousands of Australians from different backgrounds who wanted to communicate a very clear message … their concerns about the current migration problem,\" Rebello said.\n\n\n\n\n\nHe stopped short of calling Price to apologise to the community, saying: \"The fact that she has recognised or walked back those comments is an indication of her view.\"\n\n\n\n\n\nBut for locals in Harris Park, the damage is already done.\n\n\n\n\n\n\"Immigrants are always the first port of call — it's very easy to just point the finger,\" Singh said. \"This country has been built on immigrants … they tend to do a lot more good for the country than not.\"\n\n\n\n\n\n— With additional reporting by Rayane Tamer and the Australian Associated Press\n\n\n\n",
    "source": "SBS",
    "cluster_id": 32
  },
  {
    "url": "https://www.sbs.com.au/news/article/how-this-river-ended-up-with-arsenic-levels-three-times-higher-than-the-safe-limit/5r0buyf12",
    "title": "Gob has been making rafts in his local river his whole life. It's never made him sick until now",
    "publish_date": "Fri, 5 Sep 2025 20:39:55 +0000",
    "category": "lifestyle",
    "authors": [],
    "text": "In the village of Tha Ton, nestled in the hills just 3km from Thailand's border with Myanmar, there is little to life without the Kok River.\n\n\n\n\n\nFor hundreds of years, it has provided fish for families in the village, water for their crops and, in the stifling summer heat, a place for their children to cool down.\n\n\n\n\n\nIt's where 42-year-old Gob Kotekham has been making rafts all his life. But he says, lately, something strange has been happening.\n\n\n\n\n\n\"Every year when I make the rafts, I might get a rash or two, but within a week it would go away,\" Kotekham says.\n\n\n\n\n\n\"I felt unusual because, this time, there were a lot of rashes and they kept spreading. It was itchy; I had never felt that before.\"\n\n\n\nGob Kotekham has been making rafts in the Kok River almost all his life. It's never made him sick until now. Credit: SBS News / Claudia Farhart He says initially he thought he was having an allergic reaction, but then others working on the rafts got sick too.\n\n\n\n\n\n\"My friend got cut, and his wound wouldn't heal,\" Kotekham says.\n\n\n\nAnother person went into the water and felt feverish. Then, after two months, it still hadn't gone away, so I went to see the doctor.\n\nBy that point, the Kok River had taken on a strange shade of orange, and the reports of illness were becoming difficult to ignore.\n\n\n\n\n\nTwo children — aged two and six years old — became sick after eating fish from the river. Test results showed abnormally high levels of arsenic in their bodies.\n\n\n\n\n\nFish began washing up dead, and fishermen were reporting odd deformities among their daily catch. Elephants that had long been bathed in the river started to develop unusual skin rashes and boils.\n\n\n\n\n\nOfficials from Thailand's Pollution Control Department came to test the water and discovered arsenic levels three times higher than the safe limit.\n\n\n\nGob Kotekham developed this rash across his body. He says it lasted more than two months. Credit: Supplied Local authorities ordered everyone in the village, which is in the Mai Ai district of Chiang Mai, northern Thailand, to stay out of the water, putting its largest source of income off-limits.\n\n\n\n\n\n\"When I made the rafts, I had to buy wood,\" Kotekham says.\n\n\n\n\n\n\"I invested around 50-60,000 baht [$2,300-$2,800], and this year, there is no one coming — not a single customer.\n\n\n\n\n\n\"So, we are all in debt. Not just me; the whole village.\"\n\n\n\nUnregulated mining thrives in war\n\nEight successive rounds of testing have now confirmed dangerously high levels of arsenic in the Kok River.\n\n\n\n\n\nAt first, it was widely blamed on mineral waste from gold mining, a long-known cause of arsenic contamination in nearby waterways.\n\n\n\n\n\nThat was until researchers at the Shan Human Rights Foundation (SHRF) discovered two rare earth mining sites over the border in Myanmar's southern Shan State, where the Kok River originates.\n\n\n\n\n\n\"We also compared them with the rare earth mining in Kachin [a state in northern Myanmar], and the layout of the leeching pools are the same,\" an SHRF spokesperson, Sai Hark Jet, says.\n\n\n\n\n\n\"So, we said that this is not just ordinary mineral extraction or mining; this must be tied up with rare earth mining in Kachin State.\"\n\n\n\nOne of the rare earth mining sites in Myanmar's Shan State in satellite images seen by the Shan Human Rights Foundation. Credit: Shan Human Rights Foundation The two sites are located just 2 and 3km from the river's banks in territory controlled by the United Wa State Army, which is widely considered the most powerful militia in Shan State.\n\n\n\n\n\nThe group did not respond to SBS News' requests for comment.\n\n\n\n\n\n\"Local people in Shan State have limited access to the areas around the mining sites, but we believe there is a huge impact, not just for the environment, but also for the community living beside the river,\" Jet says.\n\n\n\n\n\n\"We also have heard from local people that all the water is very brown and they cannot use it anymore, but they have to because they have no other water source. But the community in Shan State dare not speak up, because of the local authority.\"\n\n\n\nRare earth mining uses chemicals to separate the valuable minerals from their ore. The process leaves behind highly contaminated liquids that often find their way back into waterways if care is not taken to contain them.\n\n\n\n\n\nThai authorities say they are working on plans to urgently install sediment traps in the Kok River to stop the arsenic from flowing downstream.\n\n\n\n\n\nBut local leaders in Tha Ton fear that sediment traps alone will not solve this crisis. They want to see Bangkok engage directly with Myanmar's military leaders in the capital Naypyidaw to end all unregulated mining across the border.\n\n\n\n\n\n\"If we just try to solve the problem by reviving the river without closing the mines, we cannot solve the issue,\" local monk Phra Mahanikom tells SBS News.\n\n\n\n\n\n\"If it cannot be fixed, then the community will change. Our way of life will change.\"\n\n\n\nWhat's behind the surge in rare earth mining?\n\nMany of the rare earth mines identified by SHRF are close to Myanmar's border with China, which imported a record high of nearly 42,000 tonnes of rare earths from the country in 2023, according to Global Witness, an NGO that reports environmental and human rights abuses.\n\n\n\n\n\nBeijing's dominance over the valuable minerals is well-documented; China controls roughly 70 per cent of rare earth mining operations globally, and accounts for 90 per cent of processing.\n\n\n\n\n\nAnd global demand for the 17 chemical elements that comprise 'rare earths' is growing. Once processed, they can be used in a wide range of modern technologies, including smartphones, weapons systems and rechargeable batteries.\n\n\n\nEnvironmentalist Pianporn Deetes says Myanmar's internal conflict means rare earth mining is largely unregulated. Credit: SBS News / Claudia Farhart Thai activists believe Chinese investors are largely behind the surge in mining in Shan State and, by extension, the contamination coming from it.\n\n\n\n\n\n\"We've learned in Kachin State there are 300 rare earth mines, legal and illegal, with Chinese-speaking investors,\" says Pianporn Deetes, the Southeast Asia campaign director at global not-for-profit International Rivers.\n\n\n\n\n\n\"On our river headwaters, there are just a few. But there will be more and more coming if there is no action from governments.\"\n\n\n\n\n\nChina's embassy in Bangkok responded to accusations in June, writing on Facebook: \"China has instructed Chinese companies operating abroad to comply with the laws of the country and operate legally at all times.\"\n\n\n\n\n\nBut environmentalists argue that the mining sites identified are beyond the state's control, making it impossible to enforce environmental regulations.\n\n\n\n\n\n\"It's happening in an area where there are no laws or even rules on safety standards. They are exploiting the situation in Myanmar,\" Deetes says.\n\n\n\nThe costs are being paid by our rivers, our forests, our lands, and our futures.\n\nTesting shows the contamination has already spread beyond the Kok River. After it passes through Tha Ton, the river empties into the Mekong — Southeast Asia's most important waterway — where abnormally high levels of arsenic have now been detected.\n\n\n\nEnvironmentalists warn a regional crisis is coming\n\nSo far, Thai authorities have taken water samples from three locations spanning a roughly 20km stretch of the Mekong River.\n\n\n\n\n\nAll have shown arsenic levels exceeding the safe limit.\n\n\n\nSource: SBS News In the small village of Ban Sob Kok, about 15km downstream from the border with Myanmar, fishermen are now finding deformed fish in their daily catch.\n\n\n\n\n\n\"There were some fish with scars. We saw them, so we didn't eat them,\" local fisherman Somdet Thanatulayakul says.\n\n\n\n\n\n\"But they took them for testing, and when they came back, they had the arsenic.\n\n\n\n\n\n\"Buyers are now afraid to eat the fish because of the news. Before, I could earn more than 1000 baht [$48] per day, but now, we can't even get 300 baht [$14] in a week.\"\n\n\n\n\n\nThe arsenic levels detected in the Mekong are currently far lower than those found in three of its tributaries (smaller streams that flow from a larger river), which originate in Shan State: the Kok, Sai and Ruak rivers.\n\n\n\nBut scientists believe the full impact is yet to be revealed.\n\n\n\n\n\nAssociate professor at Thailand's Naresuan University, Tanapon Phenrat, explains: \"Pollutants take time to transport.\"\n\n\n\n\n\n\"When we say arsenic, lead, they are in particulate format — small sediments that form in the river. These things do not transport as fast as water,\" Phenrat says.\n\n\n\n\n\n\"But if upstream mining keeps discharging this in the same fashion, it will form more particulates, more sediment and will transport, wave by wave, there will be more impact for sure. This is not at a steady state yet.\"\n\n\n\nThai fishermen are reporting finding deformed fish in the Mekong River and its tributaries. Credit: Supplied Thailand, Laos and Myanmar all meet on the Mekong River. It then continues downstream into Cambodia and Vietnam, supporting 60 million people through fisheries, agriculture and drinking water before emptying into the South China Sea.\n\n\n\n\n\nThat is how far environmentalists are warning the contamination could spread if it is not contained.\n\n\n\n\n\n\"This is the largest environmental crime I have ever experienced,\" International Rivers' Pianporn Deetes says.\n\n\n\n\n\n\"You can do rare earth mining in an accountable manner. But this is open mining.\n\n\n\nThey are just allowing everything to spill into the waterways. It is unacceptable.\n\nStudies have shown long-term exposure to high levels of arsenic is linked to increased rates of cancer and skin disease.\n\n\n\n\n\nThe World Health Organization says in utero and early childhood exposure has also been associated with negative impacts on cognitive development and premature death.\n\n\n\n\n\n\"It is long-term violence,\" Deetes says.\n\n\n\nThe Mekong River supports 60 million people as it makes its way through Southeast Asia. Credit: SBS News / Claudia Farhart \"The result might not be seen within a year or two, but it might show itself in the next three, five or 10 years in newborn babies.\n\n\n\n\n\n\"Public health is the biggest issue for us. We don't want our future generations to be sick. So I think it is important for the government to recognise the level of the crisis as it is, and fix the problem immediately.\"\n\n\n\nMounting evidence of illegal mining\n\nThe Thai government denies it is ignoring the issue, and says it is engaging with Myanmar's military government to find a solution.\n\n\n\n\n\nIts own mapping also points to a recent surge in mining activity. Bangkok's Geo-Informatics and Space Technology Development Agency has now detected 60 disturbed earth sites across Shan State with suspected links to mining, 21 of which it says are newly active this year.\n\n\n\nIt doesn't distinguish between regular mines and rare earth mines, but mapping conducted by the SHRF has detected a total of 47 rare earth mining sites across Shan State.\n\n\n\n\n\nSamples taken from the Kok River by Naresuan University in a study commissioned by the Thai government, led by Phenrat, have only added to the weight of evidence that rare earth mining is behind the contamination.\n\n\n\n\n\n\"We took water, soil, sediment and some edible plants together with fish from five stations in Chiang Rai [Thailand's northernmost province],\" Phenrat says.\n\n\n\n\n\n\"We quantified around 15 types of elements or ions in water samples.\n\n\n\n\n\n\"Then we compared the 'fingerprints of chemicals' — which is the ratio of different elements — with water samples we got from rare earth mining in Kachin State in Myanmar. The concentration in Thailand is lower, but the ratio of chemicals is similar.\n\n\n\n\n\n\"This should lead to the conclusion, or at least the identification, that the contamination has to do mostly with rare earth mining.\"\n\n\n\nPhra Mahanikom was born and raised on the Kok River. He says the water is their way of life. Credit: SBS News / Claudia Farhart\n\nWay of life under threat\n\nPhra Mahanikom was born and raised in Tha Ton. After moving away to study, he returned to preside over Wat Tha Ton; a temple perched on a hilltop that overlooks the village and its river.\n\n\n\n\n\n\"I bathed in the Kok River on the day I was born,\" he says.\n\n\n\n\n\n\"When I heard the news, I went onto the bridge and I looked out onto the river. It was muddy, very muddy.\n\n\n\n\n\n\"That day, I felt like my mother was in the ICU and I was behind the glass doors. I couldn't speak to her, I couldn't touch her, I couldn't give her support – even one bit. That's how I felt.\"\n\n\n\n\n\nThat, Mahanikom says, is the reality of his community's connection to the river.\n\n\n\nLa Boonruang has lived in this house by the Kok River for more than 50 years. Credit: SBS News / Claudia Farhart Tha Ton is a village of less than 20,000 people. Almost all of them rely on the river in some way for their survival.\n\n\n\n\n\n\"They grow vegetables and they need the Kok River to water them. Now, we don't know for sure if these vegetables can be eaten,\" he says.\n\n\n\nSome people say they can, but if you can avoid it, you should avoid it. And what if they sell the vegetables and something bad happens afterwards? These are their worries.\n\nRight now, during the wet season, there is enough water running off the region's mountains to keep their crops watered. But soon, the village will once again need to rely on water from the river.\n\n\n\n\n\nLa Boonruang has lived in the same house right beside the Kok River for more than 50 years. He says farming and fishing are all he has ever known.\n\n\n\n\n\n\"Now, I feel like I cannot breathe properly, because when I wake up, I see this and I don't know what else will come,\" he says, pointing to the river.\n\n\n\n\n\n\"Before, if we didn't have enough water, we could just go get it from the river and carry it to our farms. But now, it is very dangerous.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 33
  },
  {
    "url": "https://www.theage.com.au/sport/tennis/sabalenka-beats-anisimova-to-win-back-to-back-us-opens-20250907-p5mszr.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "US Open is Aryna’s arena as top seed beats American to win back-to-back titles",
    "publish_date": "Sun, 07 Sep 2025 11:36:47 +1000",
    "category": "sports",
    "authors": [
      "Howard Fendrich"
    ],
    "text": "World No.1 Aryna Sabalenka retained her US Open crown with a battling 6-3 7-6(3) win over American eighth seed Amanda Anisimova in the US Open women’s final on Saturday, underlining her claim as the modern queen of the hardcourt.\n\nThe Belarusian has not missed a hardcourt major final since 2022, and her latest trophy brings her grand slam haul to four. It also made her the first woman to win back-to-back US Opens since Serena Williams claimed three straight from 2012 to 2014.\n\nAryna Sabalenka walks through the crowd to her team box after her straight sets victory in the US Open final. Credit: Getty Images\n\nThe clash between two of tennis’s hardest-hitting, biggest-serving women boiled down to unforced errors – Sabalenka had just 15 compared to 29 from the racquet of her opponent.\n\n“I want to thank everyone who came here, who flew in to be there in my box,” said Sabalenka, who fell to her knees after clinching victory with an unreturnable serve and embraced her coaches in the stands in a scene of utter joy.",
    "source": "TheAge",
    "cluster_id": 18
  },
  {
    "url": "https://www.theage.com.au/sport/nrl/sharks-rocked-by-nicho-hynes-finals-ban-20250907-p5mt15.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Sharks rocked by Nicho Hynes finals ban",
    "publish_date": "Sun, 07 Sep 2025 11:13:48 +1000",
    "category": "sports",
    "authors": [
      "Dan Walsh"
    ],
    "text": "Cronulla’s million-dollar playmaker Nicho Hynes is facing a 1-2 week ban that will rub the Sharks chief playmaker out of their sudden-death finals clash with the Sydney Roosters.\n\nHynes was issued a grade 2 dangerous contact charge for the hip-drop tackle that injured Canterbury’s Marcelo Montoya on Saturday night, with the Bulldog’s ankle injury ruling him out of his side’s finals opener against Melbourne as well.\n\nAn early guilty plea would see Hynes accept a one-game ban, while the Sharks have until midday Monday to lodge a challenge against the match review committee’s ruling. An unsuccessful bid would earn him an extra week’s suspension.\n\nInjured five-eighth Braydon Trindall (ankle) is expected to return for Saturday’s showdown with the Roosters at Shark Park. Dragons-bound utility Daniel Atkinson would replace Hynes in the halves and impressed in the 24-6 win over Canterbury.",
    "source": "TheAge",
    "cluster_id": 19
  },
  {
    "url": "https://www.theage.com.au/sport/afl/disgraceful-why-lion-should-be-fined-for-flop-20250907-p5mt18.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "'Disgraceful': Why Lion should be fined for 'flop'",
    "publish_date": "Sun, 07 Sep 2025 11:08:21 +1000",
    "category": "finance",
    "authors": [],
    "text": "'Disgraceful': Why Lion should be fined for 'flop'\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 20
  },
  {
    "url": "https://www.theage.com.au/sport/afl/collingwoods-bobby-hill-selection-conundrum-20250907-p5mt11.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Collingwood's Bobby Hill selection conundrum",
    "publish_date": "Sun, 07 Sep 2025 10:53:37 +1000",
    "category": "finance",
    "authors": [],
    "text": "Collingwood's Bobby Hill selection conundrum\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 21
  },
  {
    "url": "https://www.theage.com.au/sport/afl/giants-slammed-for-hero-play-in-finals-loss-20250907-p5mt12.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Giants slammed for 'hero' play in finals loss",
    "publish_date": "Sun, 07 Sep 2025 10:53:27 +1000",
    "category": "sports",
    "authors": [],
    "text": "Giants slammed for 'hero' play in finals loss\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 22
  },
  {
    "url": "https://www.theage.com.au/national/sydney-couple-faces-unthinkable-reality-two-weeks-out-from-wedding-20250907-p5mt0x.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Sydney couple faces unthinkable reality two weeks out from wedding",
    "publish_date": "Sun, 07 Sep 2025 10:39:25 +1000",
    "category": "finance",
    "authors": [],
    "text": "Sydney couple faces unthinkable reality two weeks out from wedding\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 23
  },
  {
    "url": "https://www.theage.com.au/national/western-australia/dockers-have-five-or-six-more-cracks-at-the-flag-fyfe-20250907-p5mt0t.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Dockers have five or six more cracks at the flag: Fyfe",
    "publish_date": "Sun, 07 Sep 2025 10:16:13 +1000",
    "category": "sports",
    "authors": [
      "Justin Chadwick"
    ],
    "text": "Fremantle great Nat Fyfe says he still ends his AFL career content despite not winning the premiership he so desperately craved, and he’s optimistic the current group have “five or six” more bites at the cherry.\n\nFyfe’s career came to a close on Saturday night when Fremantle suffered a heartbreaking one-point loss to Gold Coast in a pulsating elimination final at Optus Stadium.\n\nNat Fyfe of the Dockers is chaired off by Luke Ryan and Alex Pearce. Credit: AFL Photos via Getty Images\n\nThe Dockers led by six points with less than two minutes remaining, but a Mac Andrew goal with 72 seconds to go followed by a David Swallow behind with just nine seconds left on the clock sealed the 11.14 (80) to 12.7 (79) win for Gold Coast.\n\nFyfe was given a guard of honour after the final siren, with skipper Alex Pearce and Luke Ryan chairing him off.",
    "source": "TheAge",
    "cluster_id": 10
  },
  {
    "url": "https://www.theage.com.au/lifestyle/fashion/the-timeless-style-lessons-we-learnt-from-the-duchess-of-kent-20250907-p5mt0a.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "The timeless style lessons we learnt from the Duchess of Kent",
    "publish_date": "Sun, 07 Sep 2025 09:57:38 +1000",
    "category": "lifestyle",
    "authors": [
      "Lisa Armstrong"
    ],
    "text": "There’s appropriate. There’s smart. There are lessons learned from studying the many pictures of oneself that are an inevitable part of a royal’s existence. And then there is that certain je ne sais quoi, or magic, that makes someone innately stylish. Without it, the first three can look staid and predictable.\n\nKatharine Kent, as she preferred to be known, and who died on Friday at the age of 92, had style in spades, which is all the more fascinating because she was such a retiring person. Like the Princess of Wales, she always managed to look as though she was delighted to be wherever she was.\n\nThe Duchess of Kent’s style through the years, from left: On her wedding day in a silk gown by John Cavanagh, at a wedding in 1988 and attending an event in 2016. Credit: Getty Images\n\nLesson one: a smile is a much-underestimated style asset. It looks charming when you’re young. But when you’re old, it keeps your face from collapsing.\n\nSweet but poised, even in early photographs where there are echoes of the youthful Grace Kelly in her dainty, blonde beauty and gracefulness, the duchess favoured simple, uncluttered necklines. For her wedding in 1961 – a starry occasion attended by Noel Coward and Douglas Fairbanks Jr – she wore 273 metres of silk gauze designed by John Cavanagh – a regal, high-necked, slender-bodiced dress that has withstood the test of time.",
    "source": "TheAge",
    "cluster_id": 24
  },
  {
    "url": "https://www.theage.com.au/national/nsw/it-s-just-unpleasant-car-share-spots-drive-wedge-between-cafe-and-council-20250804-p5mk57.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "‘It’s just unpleasant’: Car share spots drive wedge between cafe and council",
    "publish_date": "Sun, 07 Sep 2025 09:57:34 +1000",
    "category": "finance",
    "authors": [
      "Cindy Yin"
    ],
    "text": "Sipping a coffee in Darlinghurst, visitors to a local plant shop and cafe are first met with Parisian-inspired scenes of al fresco dining areas and potted plants overflowing with lush greenery. But shattering the illusion are two GoGet vans parked squarely in front.\n\nLocal cafe Stanley Green has been at odds with the City of Sydney for more than a year over the council’s refusal to move two car share spaces where GoGet vans are parked next to coffee tables from sunrise to sunset, seven days a week.\n\nBobby Kamal, owner of the local cafe, says the council has dug its heels in and is refusing to move the car share spaces. Credit: Dylan Coker\n\nOwner Bobby Kamal is frustrated at the “visually detrimental” vans that he says obstruct views, disturbs customers and prevents visitors from fully enjoying the space. He has asked the council to move the two car share spaces so he can convert them into street dining space, but said it has not “budged”.\n\n“The vans overshadow the space and block sunlight. It’s visual pollution for us – we’ve spent so much time and money creating this beautiful, inviting space. But the only thing you can really see is the GoGet vans,” Kamal said.",
    "source": "TheAge",
    "cluster_id": 25
  },
  {
    "url": "https://au.news.yahoo.com/respect-love-ley-bat-indian-011647142.html",
    "title": "'Respect and love': Ley into bat for Indian community",
    "publish_date": "2025-09-07T01:16:47Z",
    "category": "finance",
    "authors": [
      "Andrew Brown"
    ],
    "text": "The opposition leader has tried to further distance herself from an outspoken senator's criticism of Indian migration, saying the diaspora has been hurt by the comments.\n\nCoalition Senator Jacinta Nampijinpa Price forced her party to go into damage control after claiming in an interview the government was bringing in Indian migrants who would vote for Labor and support its policies.\n\nOpposition Leader Sussan Ley said the comments were incorrect, while reiterating support for the Indian-Australian community.\n\n\"The comments were wrong, they were not correct, they should not have taken place and corrections have been made,\" she told ABC's Insiders program on Sunday.\n\nADVERTISEMENT\n\n\"We value, respect and love our Indian community, as we do all of our migrant communities.\n\nOpposition Sussan Ley says comments from Senator Jacinta Nampijinpa Price were wrong. (Mick Tsikas/AAP PHOTOS)\n\n\"I did hear from the Indian community that they felt hurt at what they heard.\"\n\nSenator Price later said she never meant to disparage anyone with her comments and she recognised the \"enormous contribution\" Indian-Australians had made.\n\n\"My concern has always been about the broader pressures of mass migration on housing, infrastructure and families from all backgrounds, not any specific community,\" she posted on social media.\n\nHer comments followed multiple anti-immigration rallies over the previous weekend, some of which featured flyers carrying anti-Indian rhetoric.\n\nMs Ley did not offer a formal apology to the Indian community on the behalf of the coalition but said the diaspora had her full support.\n\nADVERTISEMENT\n\n\"The most important message that I can send is that appreciation of our Indian community heard directly from me as leader,\" she said.\n\nThe opposition leader is expected to meet with representatives of the Indian community in western Sydney later on Sunday.\n\nDespite Ms Ley offering support to Indian migrants, she criticised current migration as a \"mess\" and added many were losing confidence in how programs were run.\n\n\"The issue here is not about the migrants, but about the infrastructure,\" she said.\n\n\"You can never get the information from the government about what proportion of individuals are here under what visas, with what conditions attached to those visas, all you get is this headline figure.\"\n\nThe government said its permanent migration intake for 2025/26 would remain on hold at 185,000.\n\nJacinta Nampijinpa Price has recognised the \"enormous contribution\" Indian-Australians had made. (Mick Tsikas/AAP PHOTOS)\n\nNSW Premier Chris Minns described Senator Price's remarks as shocking, adding that he would \"love to see an apology\".\n\nADVERTISEMENT\n\n\"(Indian-Australians) don't vote in a homogenous way,\" he told Sky News.\n\n\"They're highly engaged in the political process, but I've seen them just as engaged in the Liberal Party.\n\n\"There's a real sense of misunderstanding, I think that's the best-case scenario ... the worst-case scenario is it's just completely divisive and it sets Australian against Australian.\"\n\nOpposition immigration spokesman Paul Scarr said the senator's comments were unhelpful.\n\n\"When events like this occur, you've got to reach out to the community, sit down with the community, empathise with the community, and build those foundations of trust,\" he said.",
    "source": "Yahoo",
    "cluster_id": 26
  }
]