[
    {
        "url": "https://www.9news.com.au/national/anz-agrees-to-240-million-dollar-fine-over-misconduct/326f0162-61d6-4afd-8046-39f9e4192875",
        "title": "Big four bank hit with record $240m fine over 'years' of misconduct",
        "publish_date": "Sun, 14 Sep 2025 23:31:08 +0000",
        "category": "finance",
        "authors": [
            "Sep"
        ],
        "text": "ANZ has agreed to a record $240 million fine sought by Australia's financial services watchdog over ﻿years of \"unconscionable conduct\".\n\nASIC and ANZ will ask the federal court to impose the penalties in relation to four separate proceedings﻿.\n\nThese include acting \"unconscionably\" in dealing with the Australian government while managing a $14 billion bond deal, and incorrectly reporting its bond trading data to the government by overstating the volumes by tens of billions of dollars over almost two years.\n\nANZ has agreed to a record $240 million fine. (Will Willitts)\n\nASIC also accused ANZ of failing to respond to hundreds of customer hardship notices, in some cases for more than two ﻿years, and of failing to have proper hardship processes in place.\n\nANZ is also accused of making \"false and misleading\" statements about its savings interest rates, and failing to pay the promised rate to tens of thousands of customers.\n\nThe fourth proceeding involves allegedly failing to refund fees charged to thousands of dead customers, and not responding to loved ﻿ones trying to deal with deceased estates within the required time frame.\n\nREAD MORE: ﻿ Teacher killed as sea biscuit ride turned to tragedy\n\nASIC Chair Joe Longo. (Peter Rae)\n\n\"Time and time again ANZ betrayed the trust of Australians,\" ASIC chair Joe Longo said.\n\n\"The total penalties across these matters are the largest announced by ASIC against one entity and reflect the seriousness and number of breaches of law, the vulnerable position that ANZ put its customers in and the repeated failures to rectify crucial issues.\"\n\nHe said ANZ had shown an \"unacceptable\" disregard for the trust of customers and the government.\n\n\"In the bond trading case, ANZ was in a trusted position and its conduct had the potential to reduce the amount of funding available to the government. This funding is used to support critical services including Australia's health and education systems, affecting all Australians,\" Longo said.\n\n\"When public funds are put at risk, every Australian pays the price.\"\n\nANZ chairman Paul O'Sullivan. (Jamila Toderas)\n\nThe court will determine whether the proposed penalties for each matter are appropriate.\n\nANZ will implement a program to address the allegations by ASIC, as well as a $150 million \"root cause remediation program\" to identify the weaknesses across the company that led to the errors.\n\n\"While we have worked hard to get regulatory certainty on these matters, the reality is we made mistakes that have had a significant impact on customers,\" ANZ chair Paul O'Sullivan said.\n\n\"On behalf of ANZ, I apologise and assure our customers we have taken the necessary action, including holding relevant executives accountable.\"\n\nANZ said it had not been accused of market manipulation in rel﻿ation to the government bonds.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/western-australia-public-holidays-overhaul/eda7b281-2f88-4594-96b7-055aff8fd1e5",
        "title": "Western Australia to receive two extra public holidays",
        "publish_date": "Mon, 15 Sep 2025 01:03:51 +0000",
        "category": "finance",
        "authors": [
            "Sep"
        ],
        "text": "R﻿esidents of Western Australia will receive two extra days off under an overhaul of the state's public holiday calendar.\n\nThe revamped schedule will include ﻿a new weekday public holiday, known as Show Day, to coincide with the first Monday of the September-October school holidays.\n\nThe other new day off will be Easter Saturday, bringing WA into line with other mainland states which already have the day as an official holiday, along with Good Friday, Easter Sunday and Easter Monday﻿.\n\nREAD MORE: How to maximise public holidays and make the most of your annual leave in 2025\n\nResidents of Perth and the rest of WA will be receiving two extra public holidays. (Hamish Hastie) (Nine)\n\nOther changes include shifting WA Day from June to ﻿the second Monday in November when the weather is usually sunnier.\n\nBut residents will still enjoy a winter day off, with the King's Birthday public holiday will moving to the second Monday in June from September.\n\nThe shake-up will also mean a change in the date of Labour Day to the second Monday in March to better align with other states. In state election years, this will be tweaked by holding the public holiday on the third Monday in March, to avoid holding an election on a long weekend.\n\nThe changes mean WA will have a total of 13 public holidays every year, the same as ﻿Victoria and the ACT.\n\nThe new schedule for public holidays will be introduced into state parliament this week, with a planned rollout in 2028.\n\nThe WA government says it received 10,000 submissions from community groups, businesses and members of the public before it announced the reforms.\n\nPremier Roger Cook says the changes are about ﻿\"modernising\" the WA public holiday calendar to better serve the community.\n\n\"By adding two new public holidays – Easter Saturday and Show Day – we're creating a schedule that better matches the rhythm of life in WA,\" he said.\n\n\"And by realigning three existing ones, we are supporting productivity and economic activity across the state.\"\n\nDOWNLOAD THE 9NEWS APP : Stay across all the latest in breaking news, sport, politics and the weather via our news app and get notifications sent straight to your smartphone. Available on the Apple App Store and Google Play .\n\n﻿",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/man-dies-truck-car-crash-darling-downs-queensland/ac33ce65-4371-4384-811a-e3879c7a74c6",
        "title": "Man dies after truck, car crash, burst into flame in Queensland",
        "publish_date": "Sun, 14 Sep 2025 22:07:42 +0000",
        "category": "sports",
        "authors": [
            "Sep"
        ],
        "text": ": Stay across all the latest in breaking news, sport, politics and the weather via our news app and get notifications sent straight to your smartphone. Available on the",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/shane-mann-death-aussie-racing-cars-event-south-australia/8e80d760-216d-42ac-b391-0cf7da24e992",
        "title": "Motorsport rocked by death of much-loved competitor and father",
        "publish_date": "Sun, 14 Sep 2025 10:00:29 +0000",
        "category": "sports",
        "authors": [
            "Sep"
        ],
        "text": "The South Australian motorsport community has been rocked by the death of a much-loved father and competitor.\n\nFather-of-two Shane Mann, 50, died after suffering a medical episode in the support paddock of the AirTouch 500 at The Bend Motorsport Park yesterday.\n\nMann was a driver in the ﻿Aussie Racing Cars category.\n\nFather-of-two Shane Mann, 50, died after suffering a medical episode in the support paddock. (9News)\n\nThe incident was unrelated to his car.﻿\n\nAussie Racing Cars race two was cancelled after Mann's death.﻿\n\nHis beloved number 21 car led the grid on its formation lap earlier today.\n\nThe front row of the grid for race three was left vacant in Mann's honour too.\n\nThe tight-knit Australian racing community is feeling the impact of Mann's sudden death.\n\nHis beloved number 21 car led the grid on its formation lap earlier today. (9News)\n\nMann has been described as a \"true racer at heart\" in a statement shared by Aussie Racing Cars.\n\n\"Shane wasn't just﻿ a competitor, he was a husband, father, friend and smiling face,\" the statement reads.\n\n\"His passion and presence will be deeply missed.\"",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/over-the-counter-supplement-revealed-to-have-anti-cancer-properties/0236cc04-5966-4bf7-abbb-767b68ed013b",
        "title": "Eye disease supplement found to have anti-cancer effect",
        "publish_date": "Sun, 14 Sep 2025 09:29:33 +0000",
        "category": "lifestyle",
        "authors": [
            "Sep"
        ],
        "text": "A﻿n over-the-counter supplement used to treat an eye disease has been found to potentially have anti- cancer properties.\n\nThe dietary supplement slowed tumour growth and boosted the effects of immunotherapy to destroy cancer in tests on mice.\n\n﻿Susan Rau has been taking a supplement every day for the past 10 years to slow the progression of her macular disease, which impacts up to two million Australians.\n\n﻿Susan Rau has been taking a supplement every day for the past 10 years. (9News)\n\n\"My mother had late stage macular disease and she had lost quite a lot of her central vision as a result,\" Rau told 9News.﻿\n\nOne of the key ingredients is zeaxanthin.\n\nIt's found naturally in dark leafy vegetables and many other foods including corn, tangerines and egg yolks.\n\nThat same nutrient, commonly used to protect vision, could also help the immune system fight cancer.\n\nResearchers from the University of Chicago identified zeaxanthin in a large library of other nutrients and compounds.\n\nOne of the key ingredients is zeaxanthin. (9News)\n\nIn mice, the dietary supplements slowed tumour growth and when combined with immunotherapy, the effects were more significant, according to the researchers.\n\nExperts here in Australia are curious.\n\n\"I think the results are really interesting, but all we know at the moment is it has been tested in mice and in cells in the laboratory,\" said Lifehouse Cancer Centre Associate Professor Kate Mahon.\n\n\"It'll be great to see it has a benefit in humans but we really need to test that in clinical trials first to find that out.\"﻿",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/missing-hiker-cameron-little-nsw-snowy-mountains/215a6313-2b17-4613-b254-739a94fd2be8",
        "title": "Missing hiker found in NSW's Snowy Mountains",
        "publish_date": "Sun, 14 Sep 2025 06:10:51 +0000",
        "category": "sports",
        "authors": [
            "Sep"
        ],
        "text": "An experienced hiker who failed to return home from a nine-day trek in the\n\nNSW\n\nSnowy Mountains yesterday has been found safe and well\n\n.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/police-investigate-brawling-nrl-fans-at-shark-park/e5a9498a-1e00-4b62-88d5-28f7e170d909",
        "title": "Brawling NRL fans could face lifetime ban, Minns says",
        "publish_date": "Sun, 14 Sep 2025 05:29:17 +0000",
        "category": "sports",
        "authors": [
            "Sep"
        ],
        "text": "Spectators involved in a brawl between rival fans during an NRL finals match in Sydney may face lifetime bans, NSW Premier Chris Minns says.\n\nPolice are investigating after supporters traded blows during the Cronulla Sharks and Sydney Roosters elimination final at Shark Park last night.\n\nOfficers and stewards were forced to step in to separate the brawling fans inside the stadium.\n\nPolice are investigating a brawl between NRL fans at Shark Park in Sydney. (Nine)\n\nA punch was thrown at one fan's head and a young girl was knocked to the ground in the tussle.﻿\n\nNSW Premier Chris Minns today said it was a \"disgraceful\" to see such a display at a rugby league match.\n\n\"﻿To see a couple of thugs punch on at the football ... it's disgraceful,\" Minns said.\n\n\"So the police will throw the book at you, you might face lifetime bans and someone who loves their football team may never see the inside of a football stadium again if they carry on like that.\"﻿\n\nPolice are investigating..\n\n\"An investigation is underway after a brawl involving up to 10 people broke out within the grounds of a football stadium in Cronulla last night,\" NSW Police said.\n\n\"Police have commenced inquiries into the circumstances surrounding the incident.\"\n\nThe NRL said they were working with authorities to find those responsible, and threatened bans to anyone found guilty of offences.\n\n\"The NRL is working with both the venue and NSW Police regarding the incident. All supporters who attend NRL games are subject to the NRL Spectator Code of Conduct\", an NRL spokesperson told 9News.\n\n\"Anyone found breaching the required standards can expect to be subject to significant sanctions, including being banned from venues.\"﻿\n\nCronulla Sharks boss Dino Mezzatesta stood firm too.\n\n\"Once those people have been identified, they will not be welcome back,\" he said.",
        "source": "9News"
    },
    {
        "url": "https://www.abc.net.au/news/2025-09-15/afl-announces-state-of-origin-return-with-wa-vic-clash-confirmed/105773392",
        "title": "AFL announces State of Origin return with WA-Vic clash confirmed",
        "publish_date": "Mon, 15 Sep 2025 01:09:23 +0000",
        "category": "sports",
        "authors": [],
        "text": "The AFL has announced the return of State of Origin football for the first time in 27 years.\n\nAFL chief executive Andrew Dillon confirmed Western Australia would host Victoria at Perth Stadium on February 14 in a standalone exhibition game.\n\nIt will mark the first true state vs state AFL match played since 1999, when Victoria defeated South Australia at the MCG.\n\nVictoria and Western Australia haven't played each other since 1992.\n\n\"State football is one of the great traditions of our game, with fans and players alike calling for its return for some time and we are thrilled to see it back,\" Dillon said.\n\n\"Origin inspires passion, state pride and draws upon years-old rivalries that are central to the history of our game and our very greatest players.\"\n\nGlen Jakovich alongside AFL chief executive Andrew Dillon at the AFL Origin announcement. (ABC News: Briana Shepherd)\n\nThe AFL has played a number of similar matches this century, including a 2008 Victoria vs Dream Team match and a 2020 Victoria vs All Stars charity game.\n\nThis year, an Indigenous All Stars team played Fremantle at Perth Stadium and drew a strong crowd.\n\nDillon has long been on record with his desire to bring back State of Origin and other marquee fixtures to extend the league's offering beyond the traditional seasons.\n\nABC/wires",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-09-15/sanfl-administrator-max-basheer-dies-aged-98/105773500",
        "title": "Breaking: SANFL administrator Max Basheer dies aged 98",
        "publish_date": "Mon, 15 Sep 2025 00:42:06 +0000",
        "category": "sports",
        "authors": [],
        "text": "Max Basheer — the football administrator who oversaw the creation of the Adelaide Crows and the purpose-built stadium Football Park — has died aged 98.\n\nBasheer safeguarded the SANFL through crisis after crisis, eventually emerging with two of Australia's leading AFL teams.\n\nHe was born in Adelaide in 1927, raised in the timber town of Kalangadoo in the state's South East, and lined up as a footballer at Prince Alfred College.\n\nDespite his successful start as a lawyer, Basheer found a passion for the tribunals of Australian rules football.\n\nDuring his decades overseeing the SANFL, he orchestrated the sport's move from cricket-dominated Adelaide Oval to the brand new Football Park at West Lakes, including a long battle for the right to play there under lights.\n\n\"We had a judicial inquiry, we had a royal commission no less, and we finished up in the Supreme Court, and that was six and a half years after we started,\" he told the ABC in 2003.\n\nBasheer with AFL legend Kevin Sheedy. (Instagram: SANFL)\n\nMore drama emerged in the early 1990s when the Port Adelaide Football Club attempted to defect to the AFL.\n\nBasheer's SANFL emerged victorious with its own AFL team, the Adelaide Crows, but the Power did eventually follow.\n\nHe attended the final SANFL match at Football Park ahead of football's return to the Adelaide Oval.\n\n\"If it's for the better of football to move to Adelaide Oval, if there's a lot more money to be made for the two AFL clubs and the SANFL, I think we all have to support it,\" he said.\n\nBasheer has been honoured in the AFL Hall of Fame, and with the naming of a stand at Adelaide Oval.\n\nA legal legacy\n\nHis former firm DBH Lawyers said Basheer was a \"much-loved and respected\" member of the legal profession, and that his death had been received with \"great sadness\".\n\n\"Max was a cornerstone of our practice, then known as Duncan Basheer Hannon, until his retirement in 2019 at the age of 92,\" managing partner Amy Nikolovski said.\n\n\"His distinguished career was marked by integrity, dedication, and an unwavering commitment to serving his clients and community.\"\n\nBasheer was raised in the timber town of Kalangadoo. (DBH Lawyers)\n\nDBH said Basheer would be remembered \"with gratitude and admiration for the legacy he leaves behind\".\n\n\"Across more than six decades in the law, Max earned the respect of colleagues, adversaries, and clients alike,\" Ms Nikolovski said.\n\n\"He was renowned for his sound judgement, calm presence, and enduring contribution to South Australia's legal profession and to the football community as the longest serving Administrator of the SANFL.\"\n\nThe company extended its condolences to Basheer's friends and family, including \"his daughters Jayne and Ann, and granddaughters Sophie and Georgie who he was so proud of and who brought his greatest joy\".\n\nPeter Humphries said his family were close friends with the Basheer family in Kalangadoo before the pair worked together in the same law firm later in life.\n\n\"I've literally grown up knowing Max virtually [since] the day I was born,\" Mr Humphries said.\n\n\"He was one of these people that was well known and well liked.\n\n\"Back in the day when he was still involved in football, walking along the street with him, you took a long time to get anywhere because everyone to say hello to him.\"\n\nMr Humphries said Basheer died on Sunday night.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-09-15/fred-brophy-takes-boxing-tent-to-birdsville-for-last-time/105761756",
        "title": "Outback ringmaster takes boxing tent to Birdsville for the last time",
        "publish_date": "Sun, 14 Sep 2025 23:46:09 +0000",
        "category": "sports",
        "authors": [],
        "text": "Not everyone has heard of Fred Brophy's Boxing Troupe, but for those who have, it's an institution.\n\nHe'll sell you a ticket, spin you a yarn and dare you into the ring.\n\nFor more than four decades, fourth-generation showman Fred Brophy has been carting his boxing tent and fighters to Birdsville, one of the most remote towns in the country, as part of its annual races.\n\nBut this year's event, held earlier this month, marked the last time he would bring his tent.\n\nThe crowd was electric at the final show at the Birdsville Races. (Supplied: Peter Wallis)\n\nFinal showdown\n\nIn his signature red shirt, on the edge of the Simpson Desert, he stands on a raised platform, beating a bass drum with ritual certainty.\n\n\"Who wants a fight,\" he spruiks.\n\nCourageous punters throw up their hands and a bell clangs as they're chosen.\n\n\n\n\n\nBrophy's grandchildren were in Birdsville for the last show. (Supplied: Peter Wallis) It's part circus, part showdown, part spectacle — but now these boxing bells have tolled for the last time.\n\n\"There comes a time when enough's enough,\" Brophy said.\n\n\"I'm 73, when I'm getting up on that ladder, I can't do it like I used to.\"\n\nBrophy said he was cutting back on shows and did not take his tent to New South Wales or Victoria anymore because of government regulations.\n\n\n\n\n\nFred Brophy is a legend in outback Queensland. (Supplied: Peter Wallis) But as long as he could get up the ladder, he said he would keep entertaining.\n\n\"When I go it will be a part of Australia that's gone but don't worry, I'll be around for a while,\" he said.\n\n\"I'm lucky like a cat, I've got nine lives.\"\n\nBoxing in Birdsville\n\nThe Birdsville Races have attracted crowds of thousands to the far south-west of Queensland for 143 years.\n\n\n\n\n\nFred Brophy at the Birdsville Races in 1990. (Supplied: State Library of Queensland) For about 42 of those, Brophy has pitched his tent across from the pub.\n\nHenry Butler grew up in Birdsville, and the 25-year-old Wangkangurru man remembers how it felt as a kid watching the town of 100 explode.\n\nAt a young age, he fell in love with the spectacle of the boxing tent.\n\n\"We used to sneak over and listen to the drum, watch all the fighters pop up,\" he said.\n\n\"One time, I think I was around 10, Fred looked at us and said, 'I reckon these two young fellas should get up and have a fight'.\"\n\nHenry and his cousin had a crack on the mats and made $600 from the crowd throwing in coins.\n\n\"It's something I never forgot,\" Henry said.\n\nHenry was sent to boarding school more than 1,000 kilometres away in Yeppoon, so it was years before he made it back to Brophy's.\n\n\"Every year Freddie was like, 'It's going to be my last year [in Birdsville],' Henry said.\n\n\n\n\n\nHenry Butler (kneeling in front) with the boxing troupe from Birdsville. (Supplied: Peter Wallis) \"That went on for a few years,\" he laughed.\n\nLast year, Henry donned the robes for Brophy and this year he stepped into the ring for a final fight in his home town.\n\n\"People think all we're doing is just boxing but you have to be there to see and understand it,\" he said.\n\n\"It's one of the best experiences I've ever had.\n\n\n\n\n\nSome people train all year to take on Fred Brophy's fighters. (Supplied: Peter Wallis) \"The main reason I love it is the atmosphere: the crowds, everyone is singing along, getting along, having a beer together and then they jump in the ring, but after everyone is having a beer and a good yarn together.\"\n\nEnd of an era\n\nGary Brook's family owns a large cattle station near Birdsville and runs the town's annual races.\n\nMr Brook, 44, has not missed a single year.\n\n\n\n\n\nFred Brophy and Gary Brook at a special Q&A session at this year's races. (Supplied: Peter Wallis) \"I've never looked out from the pub and not seen his [Brophy's] tent,\" he said.\n\n\"It's going to be a strange feeling in years to come.\n\n\" It's a great loss that he's called time, but we can understand it. \"\n\nBut even if the tent never returns, Brophy himself won't be staying away.\n\nWedding wager on Birdsville Cup win Photo shows A man and woman smiling in front of a famous troupe poster. A history-making Birdsville Races sees record prize money up for grabs, and potentially the end of a lengthy marital wager.\n\n\"I want to come back and see what they're going to do here and be able to relax … without worrying about the tent getting blown down in the wind.\"\n\nAnd of course, there's the long-standing wager with his partner Sandy that she'll marry him if he either gives up drinking or wins a Birdsville Cup.\n\nAlthough a celebrant was on hand, his horse Victory Bay didn't win this year, but maybe next year he'll have more luck.\n\n\"It's the biggest and the best event that happens in the outback,\" Brophy said.\n\nEven though his tent won't be returning to Birdsville, Fred Brophy will be. (Supplied: Peter Wallis)\n\nIt seems the tent stands only while Brophy does, and when he hangs up the gloves, the last boxing tent of its kind in Australia will stay down for good.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-09-15/winery-tax-exemption-change-nsw-winery-faces-bill/105762296",
        "title": "Agritourism expansion leaves NSW winery facing $150,000 land tax bill",
        "publish_date": "Sun, 14 Sep 2025 23:35:58 +0000",
        "category": "finance",
        "authors": [],
        "text": "Third-generation winemaker Jacob Stein has recently learned he is no longer considered a primary producer, and is now facing the prospect of a yearly land tax bill of $150,000.\n\nHe said his family's property at Mudgee, in the NSW Central West, had been exempt from the charge for almost 50 years.\n\n\"They're considering us not to be primary producers anymore, which we think is just absurd,\" Mr Stein said.\n\n\"We have a 600-acre [243-hectare] farm … we have wine, grapes, cattle, sheep, free-range pigs.\n\n\"We also have a winery where we produce wine, we have a cellar door and also a restaurant on site.\n\n\"[But] I still very much consider us farmers … [I'm] looking down on my work boots at the moment.\"\n\nJacob Stein is a third-generation Mudgee winemaker. (ABC Rural: Lucy Thackray)\n\nLand tax is a New South Wales levy usually applied to properties that are not the owner's primary place of residence.\n\nProperty used for primary production is exempt from the tax, but a recent decision by the NSW Civil and Administrative Tribunal (NCAT) has shifted the goalposts for some farmers.\n\nNCAT ruled that where wine sales generated more revenue than grape sales, the predominant purpose shifted from primary production (grape cultivation) to manufacturing (wine production), disqualifying the property from the land tax exemption.\n\nA winery's classification depends on whether it makes more money selling wine or grapes. (ABC News)\n\nStatewide impact\n\nWineries across regions such as Mudgee, the Hunter and the Central West have been investing in agritourism, encouraged by the Destination NSW Tourism Strategy.\n\nNSW Wine chief executive Matthew Jessop said the reinterpretation of land tax rules \"runs counter to all other government policy\".\n\n\"It puts NSW at odds with all the other states, it certainly puts our farmers and grape growers at a big disadvantage,\" he said.\n\nSome winemakers have claimed the reinterpretation puts NSW winemakers at a \"significant disadvantage\". (Stateline )\n\n\"Destination NSW and the Minister for Tourism, one of their strategic pillars is diversified agritourism businesses, because they know they create jobs and they create vibrant regional businesses.\"\n\nRevenue NSW has denied any reinterpretation of the Primary Production Land tax exemption.\n\nIn a statement to the ABC, a spokesperson said no legislative changes relevant to the exemption had been made in 20 years.\n\n\"Rural land is exempt from land tax if the dominant use of the land is for a primary production purpose,\" they said.\n\n\"If a business owner, such as a wine grower, offers other products or services, such as a cellar door or restaurant, whether an exemption applies will depend on whether primary production is the dominant use of the land.\"\n\nNSW Small Business Minister Janelle Saffin said it sounded as though wineries had diversified into other business areas.\n\n\"It also sounds like the primary producers' grant — if you get over 50 per cent of your income off farm, then you're not eligible for certain things and it's in that same category,\" she said.\n\n\"A lot of people diversify within their industry, and it depends where they get it.\"\n\nMs Saffin said she would \"look into\" the situation.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-09-15/port-inchinbrook-marina-remains-inaccessible-after-dredging/105739106",
        "title": "Port Hinchinbrook marina full of mud despite $1.5m dredging project",
        "publish_date": "Sun, 14 Sep 2025 23:20:49 +0000",
        "category": "finance",
        "authors": [],
        "text": "There are calls for more dredging work at the embattled Port Hinchinbrook marina in north Queensland, despite the latest project failing to improve accessibility.\n\nExacerbated by natural disasters and red tape, mud and silt have choked the channel originally dug in the 1990s to provide access to the Great Barrier Reef.\n\nSmall businesses and the fishing industry in nearby Cardwell fear the situation is getting worse, as visitor and boat numbers continue to fall.\n\nBut conservationists say dredging is expensive, has not worked, and threatens endangered dugongs that feed in the area.\n\nDigging for answers\n\nIn 2024, Cassowary Coast Regional Council acquired a licence to dredge up to 1,000 tonnes of mud and silt from the main canal, funded by a $1.5 million grant from the federal government.\n\nThat project was completed in January 2025, but by February, major flooding once again filled the port with debris.\n\n\"We undertook some flood debris clean-up, so that was actually separate to the dredging. The clean-up was completed in April,\" Mayor Teresa Millwood said.\n\nRalph Cremer says the mud is \"very destructive\" to vessels. (ABC Far North: Sophie Johnson)\n\nBut Ralph Cremer, a senior advisor with boat servicing business Port Hinchinbrook Marine, said the build-up of mud made the channel shallow and dangerous.\n\n\"At low tide, it's just full mud. You can't even move a boat on it, so it is very, very destructive to vessels,\" he said.\n\n\"Missing high tide if [fishermen] are in the channel, they can sit on the mud and go nowhere.\n\n\"If they're out in the ocean, they'll just have to wait until the tide comes back up so they can come in.\"\n\nBoat moorings remain empty in the marina at Port Hinchinbrook. (ABC Far North: Sophie Johnson)\n\nHe said that made it unattractive for commercial operators, and as a result, the number of vessels in the shipyard had halved since Cyclone Yasi devastated the area in 2011.\n\n\"All the skippers or the owners of the vessels seem to lose the appetite to come to Port Hinchinbrook, either to the marina or the marine area itself,\" Mr Cremer said.\n\n\"It's just not commercial anymore to come into this channel.\"\n\nChris Mackay says the recent work has not improved safety. (ABC Far North: Sophie Johnson)\n\nThe council's project was well short of the $20 million a 2023 feasibility study estimated it would cost for a long-term dredging and maintenance plan.\n\nCardwell recreational fisherman Chris Mackay said he was concerned it had not improved safety.\n\n\"There's that much debris in the water or in the mud that you, you got to be clearing the mud with your propeller,\" he said.\n\nMario Dimauro, also a keen recreational fisherman, moved to Cardwell five years ago.\n\nMario Dimauro says the state of Port Hinchinbrook has worsened since he moved to Cardwell. (ABC Far North: Sophie Johnson)\n\nHe agreed access had worsened.\n\n\"When I first came here, 0.9 [metre] tide, you could get back in, now it's 1.8,\" Mr Dimauro said.\n\n\"It needs a total dredge out from the mouth back and then maintenance all the time.\n\n\" You can't just dredge it, cause it'll just fill in again. It's got to be maintained periodically. \"\n\nDeeper solutions\n\nRetired engineer and local environmentalist John Mewing said dredging was not the solution.\n\nJohn Mewing says the ongoing dredging of Port Hinchinbrook is prohibitively expensive. (ABC News: Baz Ruddick)\n\nHe said the recent project was not productive.\n\n\"What they've done there is going to refill with sediment, in a relatively short space of time,\" he said.\n\n\" We're going to be back to square one again. \"\n\nHe said the Hinchinbrook channel had high siltation rates, meaning as water flowed in and out, it naturally dropped large amounts of sediment, making it \"prohibitively expensive\" to maintain.\n\nVessels are unable to get in and out of the water for most of the day from Port Hinchinbrook. (ABC Far North: Sophie Johnson)\n\nEnvironmentalist Kenn Parker opposed the original dredge that made way for the development in the 1990s, which he said threatened endangered dugongs.\n\n\"Their feed areas along the western side of the channel, the seagrass beds have mostly disappeared … because of the release of the material from the spoil ponds,\" he said.\n\nHe said fewer boats in the area also made it a safer habitat for the animals.\n\nIn its first budget in June, the new LNP state government announced it was allocating funding \"to enable delivery of options for the ongoing sustainable use of the port\" but did not disclose how much it would spend.\n\nKatter's Australian Party member for Hinchinbrook Nick Dametto said he was working with all levels of government for a long-term solution to the situation.\n\nHe said it was complicated by the legal status of the property, which made it unattractive to potential investors.\n\nNick Dametto and then-premier Steven Miles survey the silted waterway at the Port Hinchinbrook development in 2024. (Supplied)\n\n\"It was written in such a way where the developer basically became responsible for every single thing … the dredging, the roads, the sewerage,\" he said.\n\n\"A developer has not got the ability to rate and charge for any of those services.\n\n\"The way to solve the problem moving forward … [is] to replace parts of the development with a basic infrastructure agreement, for example, a long-term dredging plan.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-09-15/emmy-awards-2025-live-blog-latest-updates/105757172",
        "title": "Live: Severance leads Emmys as Adolescence star makes history",
        "publish_date": "Sun, 14 Sep 2025 23:08:51 +0000",
        "category": "entertainment",
        "authors": [
            "Jessica Riga",
            "Velvet Winter"
        ],
        "text": "Severance and The Pitt have won some of the first awards of the night at the 77th Annual Emmy Awards, while comedies Hacks and The Studio have also taken home gold.\n\nMeanwhile, 15-year-old Owen Cooper has become the youngest person to win Best Actor in an Anthology for his performance in Adolescence.\n\nFollow our live blog for all the winners, losers and key moments from television's biggest night.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-09-15/australia-beats-india-in-odi-world-cup-warm-up/105773182",
        "title": "Litchfield stars and Healy returns as Australia beats India in World Cup warm-up",
        "publish_date": "Sun, 14 Sep 2025 23:01:53 +0000",
        "category": "sports",
        "authors": [],
        "text": "Phoebe Litchfield's boundary-laden knock has helped Australia romp to an eight-wicket victory in the opening one-day international against India in New Chandigarh.\n\nIndia won the toss and elected to bat, setting Australia 282 in the first of three one-dayers serving as warm-up games for the ODI World Cup starting later this month.\n\nBut the hosts, having posted 7- 281 in their 50 overs, were clinically overhauled by the Australians, led by Litchfield as she cracked 14 fours in an 80-ball 88, while Beth Mooney (77*) and Annabel Sutherland (54*) also carded unbeaten half-centuries to steer the chase home.\n\nEarlier, India openers Smriti Mandhana (58) and Pratika Rawal (64) and then Harleen Deol (54) also went past the 50 mark for India.\n\nDeol came in at three after a 114-run opening stand and eventually became the first of two victims to Megan Schutt (2-45), who became the ninth Australian woman to play 100 one-day internationals.\n\nRicha Ghosh (25) and Radha Yadav (19) added valuable runs down the Indian order while Deepti Sharma was unbeaten on 25 in the face of tight bowling from Ellyse Perry (0-15), Sutherland (1-31) and Georgia Wareham (0-36).\n\nAll up, Australia used eight bowlers, with only opening seamer Kim Garth (1-56) completing her full complement of 10 overs during the team preparation for its first World Cup clash with New Zealand on October 1 in Indore.\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\nAustralia captain and opener Alyssa Healy, playing her first international since the Ashes Test against England ended on February 1, looked determined to take the game to India before she fell to all-rounder Kranti Goode for 27 off 23.\n\nBut then it was time for Litchfield, next backed up by Perry, to really impose herself on the game as she reached her half-century from 44 deliveries.\n\nPerry's contribution was ended early when the 34-year-old was forced to retire with a calf cramping on 30, but player of the match Litchfield maintained the momentum until she fell 12 runs short of a third one-day century when caught off Sneh Rana.\n\nThat left Mooney and Sutherland to see the visitors past the target, reaching 2-282 in 44.1 overs with 35 balls to spare, in what was the fourth-highest run chase in women's one-dayers.\n\nThe ABC of SPORT Sports content to make you think... or allow you not to. A newsletter delivered each Saturday.\n\nAAP",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-09-15/container-for-change-wa-wine-expansion-hits-small-business/105763914",
        "title": "Wineries, distilleries worry about costs to add bottles to deposit scheme",
        "publish_date": "Sun, 14 Sep 2025 22:41:32 +0000",
        "category": "finance",
        "authors": [],
        "text": "Winemakers and distillers are concerned the West Australian government's expanded trash for cash recycling scheme will increase costs for family-run businesses.\n\nUnder changes to WA's Container Deposit Scheme, announced by the premier last week, people will be able to receive a 10-cent refund for wine and spirit bottles from mid-2026.\n\nThe government said more than 4.5 billion containers had been collected since the scheme was rolled out for other drink manufacturers, including breweries and soft drink companies, in 2020.\n\nThe expansion will include glass wine and spirit bottles, cask wine and water, fruit and vegetable juices, flavoured milk and cordials.\n\nWine producers will pay to be part of the mandatory scheme. (ABC South West WA: Anthony Pancia)\n\nThe scheme is funded by beverage producers, with suppliers paying about 15 cents per container to cover the cost of refunds and operating the scheme.\n\nThe ABC has spoken to several breweries involved in the scheme which said there were significant additional costs associated with printing new labels, administration and compliance.\n\nAdministrative 'burden'\n\nMore than 25 million bottles of Margaret River wine are sold around Australia each year.\n\nMultiplied by 13.84 cents per glass container, excluding GST, the ABC has calculated the local industry would pay at least $3.46 million per year directly to the scheme.\n\nMargaret River Wine Association chief executive Amanda Whiteland said the real cost could be a lot higher.\n\n\"When you add in all the administrative costs of executing the scheme, as it's currently unique in every state, it could be up to $1 a bottle … that could be up to $25 million it could cost the industry a year,\" she said.\n\nAmanda Whiteland says it could cost the local industry millions a year to comply. (Supplied: Amanda Whiteland)\n\n\" [It] puts a huge administrative burden back on producers. \"\n\nQueensland has added wine bottles to its container scheme and other states are set to follow suit.\n\nMore expensive wine and spirits\n\nBunbury-based distiller Rory Binnie said being given one year to adjust was hard to take when producers were already battling rising costs.\n\nRory Binnie says the cost and administrative burden will hit small producers hard. (ABC South West WA: Bridget McArthur)\n\n\"The concept is a really good idea … however, the timeframe [for the] 10-cent refund … is a little bit of a kick in the guts,\" he said.\n\n\"We're getting to a spot now where wineries and distilleries are looking to export because it's more affordable to sell bottles overseas than it is in Australia.\"\n\nBeverage suppliers brought into the expansion will have to add a 10-cent refund notice to labels and ensure every product has a unique barcode.\n\nMr Binnie said it would be a significant additional cost for some companies who did not put labels on small-batch products they sold on site.\n\nSouth West distiller Greg Garnish said it was also a blow to those who printed labels in bulk.\n\nHe said he recently printed $20,000 worth of new labels which would be out of date in nine months.\n\nWA's Containers for Change program is set to include wine and spirit bottles. (ABC News: Courtney Withers)\n\n\"[But] it's a great initiative just to save the environment,\" Mr Garnish said.\n\nMr Binnie said it was just another factor placing strain on the industry, which he said was a big part of the South West's tourism sector and economy.\n\nHe said many businesses would pass those additional costs on to consumers, and called for more support from the government for local producers and more time to adjust.\n\nStakeholders consulted, government says\n\nWA Environment Minister Matthew Swinbourn said it was important producers of single-use products took responsibility for the life of their containers.\n\n\"The Containers for Change scheme means both consumers and producers are invested in that responsibility to ensure these products do not end up in landfill,\" he said.\n\n\" The wine and spirit sector has been exempted from this shared responsibility for five years. \"\n\nMatthew Swinbourn says it's important producers and consumers share the cost. (ABC News: Keane Bourke)\n\nMr Swinbourn said the Department of Water and Environmental Regulation had consulted with key stakeholders, including the wine and spirit industry.\n\nHe said there would be a transition period for labels to be changed and small producers would have the option to report less often to reduce the administrative burden.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-09-15/reece-walsh-headbutt-pat-carrigan-bans-from-broncos-raiders/105772942",
        "title": "'You're allowed to headbutt': Stuart's complaint rings true as Walsh dodges ban",
        "publish_date": "Sun, 14 Sep 2025 22:35:31 +0000",
        "category": "sports",
        "authors": [],
        "text": "Superstar Broncos fullback Reece Walsh will be free to play in the NRL preliminary final after avoiding suspension for a headbutt on Hudson Young in Brisbane's epic win on Sunday.\n\nWalsh was charged with grade-one striking for the incident in the 53rd minute of the electric contest that Brisbane eventually won 29-28 in golden point.\n\nWalsh can accept a $3,000 fine with an early guilty plea and line up in the grand final qualifier against Canterbury or Penrith, but would be banned for two matches if he tried to fight the charge at the judiciary.\n\nThe 23-year-old also copped an $1,800 contrary conduct fine for flipping the bird at Canberra fans as he walked up the tunnel to the sin bin.\n\nWalsh flipped the bird at the Canberra crowd as he went to the sin-bin. (Supplied: Kayo Sports)\n\nStand-in captain at Carrigan was not so lucky, facing a one- to two-match ban for a high shot on Morgan Smithies.\n\nBoth players spent time in the sin-bin as the Raiders built a 28-12 lead before Walsh returned with 18 minutes left in regulation and orchestrated a stunning comeback, culminating in a 94th-minute, game-winning field goal by Ben Hunt.\n\nHunt field goal seals Broncos heist after bunker denies Raiders Photo shows Ben Hunt celebrates his game-winning field goal with teammates Jamal Fogarty scores a try in golden point to send the Raiders to a preliminary final only for it to be disallowed before Ben Hunt delivers a dagger field goal.\n\nThe mercurial Broncos fullback scored one try, set up another and kicked a booming 40/20 to give Brisbane the ball for a third before hitting the crossbar with a long-range field goal attempt that would have tied the game, instead earning a penalty goal to send it to extra time when Zac Hosking ran through his kicking leg on his second attempt as the siren sounded.\n\nFor all the good he did, his afternoon will also be remembered for pushing his head into Young's face as the pair became entangled when the Raiders enforcer celebrated in his face after a Broncos knock-on.\n\nBoth players were sin-binned over the incident, with referee Ashley Klein dismissing Young for getting in Walsh's face, \"which makes him react like that\".\n\nReece Walsh and Hudson Young were sin-binned for this altercation. (Supplied: Fox Sports)\n\nWalsh told Fox Sports after the game that his phenomenal final few minutes were repayment to his teammates after the Raiders scored twice during his period in the bin.\n\n\"I had to come out with something because getting sent for 10 in a bloody final, I was disappointed in myself,\" he said, joking that Young called him a \"weak-gutted dog\" in reference to Stuart's dig at Penrith's Jaeman Salmon in 2022.\n\nRicky Stuart said he did not want to focus too much on the officiating, but was clearly unhappy. (Getty Images: Mark Nolan)\n\nYoung and Raiders captain Joe Tapine protested on the field, and in the post-match press conference Stuart was adamant Walsh should have been sent off.\n\n\"They've set a precedent now. You're allowed to headbutt,\" Stuart said.\n\n\"If Joe or Hudson headbutted Reece Walsh what do you think would have happened?\"\n\n\"They got it 100 per cent wrong,\" he added, while saying he did not want to steal focus from an incredibly entertaining contest.\n\nBroncos coach Maguire tried to downplay the clash immediately after the game.\n\nWalsh grabs the Sun to light up Brisbane's season Photo shows A man celebrates after winning a rugby league match Brisbane and Canberra went to the great beyond in their golden point finals match and it was Reece Walsh who led the Broncos to the promised land.\n\n\"I'd have to have a look at it. They were at each other a little bit,\" he told reporters.\n\n\"It was probably more just conversation, we'll have a look at it down the track.\n\n\"There is emotion out there. They were both sent for a reason, so you move on.\"\n\nThe incident is the second time Walsh has been accused of a headbutt in his career, with the Queenslander copping a grade-two striking charge for one in State of Origin in 2023.\n\nThree minutes after Walsh's effort, Carrigan joined him in the bin for a high tackle that left Smithies with a bloody lip, resulting in a grade-two careless high tackle charge.\n\nCarrigan can accept a one-game ban with an early guilty plea, or risk being rubbed out for the preliminary and grand final if he fights the charge and loses.\n\nAs their teammates fell behind 28-12 while the game was 11 vs 12, Carrigan said he and Walsh chatted in the sin bin about launching the audacious comeback.\n\n\"The conversation was pretty clear, it was just let's get out there and have a crack,\" Carrigan said.\n\n\"He was just saying let's go after this game, let's get another shot … He's clear and he backs himself.\"\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\nThe Broncos earned the week off before a preliminary final against the Bulldogs or Panthers after the 94-minute marathon match that included two periods of extra time before the golden point period ended with Hunt's field goal.\n\nThe break will be much needed as gun prop Payne Haas played out the game with a heavily strapped left ankle.\n\nThere are also real concerns over second-rower Brendan Piakura, with fears he suffered a depressed cheekbone in the first half of Sunday's match.\n\nThe team is hopeful of having captain and halfback Adam Reynolds back from a hamstring strain for the preliminary final.\n\nThe ABC of SPORT Sports content to make you think... or allow you not to. A newsletter delivered each Saturday.\n\nAAP/ABC",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-09-15/anz-record-penalty-asic-federal-court/105773084",
        "title": "ANZ faces record penalty for ripping off customers and government",
        "publish_date": "Sun, 14 Sep 2025 22:15:51 +0000",
        "category": "finance",
        "authors": [],
        "text": "ANZ bank faces a record $240 million penalty for engaging in \"unconscionable conduct\" in some of its bond trading for the federal government, as well as \"widespread misconduct\" affecting nearly 65,000 retail customers.\n\nThe bank has agreed to the penalty with the Australian Securities and Investments Commission (ASIC), although it will require Federal Court approval.\n\n\"Time and time again, ANZ has fallen short,\" ASIC's chair Joe Longo told a press conference on Monday.\n\n\"Time and time again, ANZ has betrayed the trust of Australians.\n\n\"Today many Australians will rightly be questioning their trust in ANZ.\"\n\nThe settlement includes $125 million over a specific trade in Australian government bonds on 19 April 2023, where ANZ was helping the country's sovereign debt management agency deliver $14 billion in bonds.\n\nASIC said where the bank misreported trading data and acted \"unconscionably\", and its actions had the potential to reduce the amount of funding available to the government.\n\n\"'We have looked very closely at what happened on the day,\" ANZ chair Paul O'Sullivan told an investor briefing about that trade this morning.\n\n\" We breached some of our license obligations. \"\n\nASIC said that ANZ sold a large chunk of 10-year bond futures around the time the bond issue was priced, which placed downward pressure on bond prices and could have resulted in a shortfall in the bond sale.\n\nASIC said that, when the government later asked what had happened, the bank's answers were misleading or deceptive.\n\nANZ said that ASIC has not alleged it engaged in market manipulation or over-hedging.\n\nThe bank said all trading undertaken by ANZ as duration manager was to hedge the risk borne by it in connection with its role on this transaction.\n\nANZ claims that no loss was caused to the Commonwealth from its trading as duration manager.\n\nANZ is also alleged to have overstated its bond trading turnover for nearly two years, which may have resulted in it winning more appointments as the lead for future bond issues.\n\n\"We have apologised to the AOFM [Australian Office of Financial Management] for the inadequate communication on this transaction and offered to pay the AOFM the revenue ANZ earned as duration manager,\" Mr O'Sullivan in a statement.\n\n\" The board has driven comprehensive accountability reviews in relation to the markets issues, which have resulted in significant reductions in remuneration for certain current and former executives. \"\n\nMr O'Sullivan told the investor briefing on Monday morning that it believes the bonds matter was now dealt with.\n\n\"We do believe today that this draws a line under those issues and lets us move forward,\" he said.\n\nNearly 30,000 customers underpaid savings interest\n\nThe regulator said $115 million of the proposed penalty relates to customer failings.\n\nANZ failed to respond to 488 customer hardship notices, in some cases for more than two years.\n\nASIC said that the reasons for the hardship applications included unemployment, serious health issues, bereavement and family violence.\n\nIn some cases, ANZ undertook debt collection activities, including issuing default notices and bringing in external debt collection agencies, despite not having responded to the customer's hardship application.\n\nSeparately, ANZ made false and misleading statements about some of its savings rates, failing to pay the promised introductory bonus interest rate to tens of thousands of customers.\n\nANZ had already compensated nearly 200,000 customers affected by this between July 2013 and January 2024, however ANZ is now remediating another 29,917 customers who were underpaid interest for similar reasons between August 2024 and March 2025.\n\nThe bank also failed to refund fees to thousands of dead customers and was slow in responding to loved ones trying to manage deceased estates.\n\nAs with the incorrect savings rates, ASIC said this was due to inadequate systems and processes that could not identify which fees should be waived or refunded, not whether any fees had already been waived or refunded.\n\nASIC said ANZ had already been penalised seven times in the past eight years for prior misconduct.\n\nANZ bosses say sorry\n\nANZ chair Paul O'Sullivan acknowledged the bank had \"made mistakes that have had a significant impact on customers\".\n\n\" On behalf of ANZ, I apologise and assure our customers we have taken the necessary action, including holding relevant executives accountable. \"\n\nLast week, ANZ's new chief executive Nuno Matos, who has only been in the role for a matter of months, announced the bank would be cutting 3,500 staff and around 1,000 contractor positions over the next year.\n\n\"The failings outlined are simply not good enough and they reinforce the case for change,\" he said in a statement.\n\n\"It is my expectation that we see measurable improvements across the bank to better protect and care for our customers and to create a more sustainable business.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-09-15/federal-politics-live-blog-sept-15/105772900",
        "title": "Live: Sydney heat deaths to double even at global warming best-case scenario",
        "publish_date": "Sun, 14 Sep 2025 21:53:16 +0000",
        "category": "finance",
        "authors": [
            "Joshua Boscaini",
            "Courtney Gould",
            "Jake Evans"
        ],
        "text": "The Smart Energy Council says the National Climate Risk Assessment shows Australia must rapidly roll out renewable energy and put an end to new coal and gas projects.\n\nThe group says the the risk assessment confirms what everyone knows and fears.\n\nChief executive John Grimes has also called on the government to set an ambitious 2035 emissions reduction target.\n\n\"It's clear the time for talk has passed, the time for action on slashing carbon and methane gas is now,\" Grimes says.\n\n\"One of the best and most rapidly deployable methods of doing that, is through renewable energy, and along with our members we stand ready to make that happen.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-09-15/wa-gps-soon-start-diagnosing-adhd/105759814",
        "title": "Some WA doctors will soon start diagnosing ADHD, but parents have concerns",
        "publish_date": "Sun, 14 Sep 2025 21:27:52 +0000",
        "category": "lifestyle",
        "authors": [],
        "text": "Perth mum Sarah Jackson thinks her five-year-old daughter Ayla has ADHD, just like her older sister.\n\nBut she's been told it will be four years to get a diagnosis if she wants to wait in the public system.\n\nMs Jackson said that wait has had an emotional toll on her family.\n\n\"I don't know what the future holds for Ayla and that's … scary,\" Ms Jackson said.\n\n\"There's no early intervention for her.\"\n\nAyla is only five, and therefore is unable to be given an ADHD diganosis by a GP in WA. (ABC News)\n\nAyla will miss out on a new program that makes it easier to get an ADHD diagnosis.\n\nIn Western Australia, 65 general practitioners will be trained to diagnose and prescribe ADHD medication, but only for children older than 10.\n\n\"I was pretty disappointed and disheartened that she would be nine years old just to even get that first appointment,\" Ms Jackson said.\n\nWith Ayla set to start school next year, Ms Jackson said it has filled her family with uncertainty surrounding Ayla's education.\n\n\" I don't know what's going to happen between now and [age] nine with her learning and how she's going to cope. \"\n\n\"It just puts her in limbo land because by the time she gets to the point of actually having the choice of a GP or the paediatrician ... It's going to be too late for her.\"\n\nDifficulties diagnosing younger children\n\nThe Royal Australian College of GPs, which will train the specialist doctors, said caution is needed when diagnosing younger children.\n\nSean Stevens, from RACGP's WA branch said the college hasn't decided whether more training is required to diagnose children under 10.\n\n\"We feel that … there are difficulties in that cohort,\" Dr Stevens said.\n\nDr Sean Stevens says diagnosing patiends under 10 can be problematic. (ABC News: Lily Kristanto)\n\n\"At this stage we feel it's best with this training to focus on the 10 and up.\"\n\nBut the rules differ in each jurisdiction.\n\nIn Queensland, GPs are allowed to diagnose and prescribe ADHD medication for children as young as 4.\n\nNew South Wales, South Australia and the ACT will also train doctors to diagnose and treat the condition in children, but haven't specified at what age.\n\nIn Tasmania, more GPs and paediatricians are being recruited to deal with long waitlists.\n\nThousands on public waitlist\n\nThrough WA's public health system, psychologists can diagnose children with ADHD, and paediatricians are able to diagnose and prescribe ADHD medication for children.\n\nAyla was not given a wait time, but there are more than 12,000 children on WA's public waitlist to see a paediatrician for a range of conditions.\n\nMs Jackson said it affects a lot more than just the children.\n\nSarah Jackson says the long waiting lists to see health professionals is having a big impact on society. (ABC News)\n\n\"I know that there are families out there who are really struggling, who are on that wait list who aren't getting supported and they've had to quit their job,\" Ms Jackson said.\n\n\"Some of them, they just need help now, it's absolutely shocking.\"\n\n\" It's underestimated, the impact that that wait list is having on our society. Families need more support. \"\n\nMs Jackson said going private was not an option financially.\n\nAustralia's most common ADHD drug has had a spike in adverse event reports Photo shows An illustration of a hot pink bill with blue and black liquid pouring out Australia's pharmaceuticals watchdog is investigating a spike in reports related to Vyvanse, the country's most commonly prescribed ADHD medication.\n\nPeter Jones from Queensland's Bond University says paediatricians are struggling to meet demand.\n\nHe said the move to allow doctors to diagnose and prescribe ADHD medication is a good way to relieve the burden of long waitlists.\n\n\"The average age of the general paediatrician population is getting older, and we need to be able to work out how we can address this,\" Dr Jones said.\n\n\" It's a nationwide problem. \"\n\nHe also thinks the age in WA should be lower, to allow GPs to make a diagnosis and consider the use of medication in school-aged children, but not for those in preschool.\n\nCall for consistency\n\nIndustry bodies are calling for a nationally consistent approach to diagnosing and treating ADHD.\n\nThe Royal Australasian College of Practitioners' Paediatrics and Child Health President Niroshini Kennedy said a standardised approach would be more efficient.\n\nShe says it's important minimum standards are established.\n\nDr Niroshini Kennedy says national standards for ADHD diagnosis would make sense. (Supplied)\n\n\"We've got no doubt that there is a role for general practitioners in the diagnosis and treatment of ADHD,\" she said.\n\nShe said the support provided to both young people and the general practitioners needed to be standardised and of high quality.\n\nAFLW star Emma O'Driscoll on using ADHD to her benefit Photo shows A woman does a cartwheel on a football field. The Fremantle Dockers star has found strength in having ADHD, especially on the football field. Can having neurodivergent traits like hyper-focus give athletes a real advantage?\n\nMs Kennedy said there needs to be publicly funded services for ADHD and other neurodevelopmental conditions across the country.\n\n\"Rates of ADHD are certainly rising across the Western world and also in Australia,\" she said.\n\n\"We know that there are huge waiting lists … there is a huge gap in the health infrastructure across every jurisdiction in Australia.\"\n\nWaiting game\n\nMs Jackson said it would be a big advantage if Ayla could be diagnosed as soon as possible.\n\n\"Just having the knowledge that she does have ADHD, it means that the teacher's unconscious bias is lifted,\" she said.\n\n\"Without that they just get labelled as the difficult child in class … it's about awareness.\"\n\nMs Jackson said an early diagnosis would allow Ayla, who already struggles with transitions in kindergarten, to fulfil her potential at school.\n\nSarah Jackson feels an early diagnosis would allow Ayla to achieve her potential. (ABC News)\n\n\"It would allow me and the school to then put scaffolding in place for her, so she doesn't fall behind,\" she said.\n\n\"The older that they get, the harder it is for them to have to catch up.\"\n\nLoading...",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-09-15/traditional-custodian-fights-north-west-shelf-approval/105770306",
        "title": "‘Betrayal’: Custodian threatens legal action over Woodside gas approval",
        "publish_date": "Sun, 14 Sep 2025 21:24:58 +0000",
        "category": "entertainment",
        "authors": [],
        "text": "A Murujuga traditional custodian is threatening legal action against the federal government, after it approved the extension of Australia's biggest gas project, Woodside's North West Shelf, until 2070.\n\nOn Friday, Environment Minister Murray Watt granted the project final approval, almost four months after he gave Woodside 10 days to respond to his provisional approval for the extension.\n\nThe approval is subject to 48 strict conditions, including reducing certain gas emissions by 2030, aimed at protecting nearby ancient Indigenous rock art.\n\nThe life of the North West Shelf gas project has been extended for another 40 years. (ABC News: Charlie Mclean)\n\nMardathoonera woman and Murujuga traditional custodian Raelene Cooper described the approval as a \"betrayal\" to Aboriginal people.\n\n\"I have already instructed my lawyers to put the Minister on notice that this decision may have breached his statutory duties and international legal obligations,\" she said.\n\nShe said the conditions placed on the project were no better than those that already existed.\n\nMr Watt said on Friday the 48 conditions would \"avoid and mitigate\" significant impacts to the ancient Murujuga rock art in the region, which is adjacent to the gas plant.\n\nCan Australia be both a gas giant and a climate leader? Photo shows Two flares from a tower light up the night sky. Seven years after it was first mooted, the extension of Australia's biggest gas project could not have landed at a more critical juncture for the nation's climate credentials.\n\nBut Ms Cooper said the conditions did not go far enough.\n\n\"There could be 100 [conditions] from our West Australian and Australian government … I can tell you very confidently those [conditions] aren't nearly enough,\" she said.\n\nThe Murujuga site contains the world's largest collection of ancient rock art. (ABC News: Alistair Bates)\n\nMs Cooper said Mr Watt's decision to exempt all \"industrial gaseous emissions\" was offensive and would allow industry to continue damaging the rock art.\n\n\"This was not a recommendation from the department, or the independent expert report, or part of the initial UNESCO World Heritage recommendations the government lobbied against.\n\n\" … If there is no damage occurring, why is this exemption required? \"\n\nMs Cooper has spent years fighting for the protection of the rock art in northern WA and in 2022 lodged an application under the Aboriginal Heritage Protection Act (AHPA) over fears three nearby industrial projects, including the North West Shelf, were accelerating the degradation of the World Heritage-listed rock art.\n\nMs Cooper said the federal government's North West Shelf extension approval was a betrayal of Aboriginal people, elders and all Australians.\n\nHave something to share with the ABC's WA newsroom? Photo shows Perth City and Claisebrook Cove Whether it's an image, video, story, or tip-off, you can send it to the ABC's West Australian newsroom here.\n\nBut some Indigenous groups welcomed the approval.\n\nPeter Hicks, chair of the Murujuga Aboriginal Corporation said it provided “an even clearer way forward and we thank the Federal Government for enacting a critical part of Australia's legislative framework to ensure that this sacred place is protected in perpetuity,\"\n\n'Critical role' for gas\n\nChamber of Commerce and Industry WA chief economist Aaron Morey, who will soon take the chief executive role in the Chamber of Minerals and Energy WA, also welcomed the extension.\n\n\"Gas is going to play a critical role in our energy transition and supporting new renewable technologies, it's also really important to our manufacturing sector and for keeping prices down for households,\" he said.\n\n\"So we think that's the right decision and we welcome the government's decision making and consultation on that issue.\"\n\nHave something to share with the ABC's WA newsroom? Photo shows Perth City and Claisebrook Cove Whether it's an image, video, story, or tip-off, you can send it to the ABC's West Australian newsroom here.\n\nIn a statement, Woodside's chief operating officer Liz Westcott said the project's approval provided certainty for ongoing operations.\n\n\"Over this time, the North West Shelf Project has paid more than A$40 billion in royalties and excise, supported thousands of Australian jobs and contributed well over A$300 million to communities in the Pilbara through social investment initiatives and infrastructure support,\" she said.\n\nMs Westcott said the decision had followed an \"extensive assessment and appeal process\", with conditions that would protect cultural heritage.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-09-15/asx-markets-business-news-live-updates-sept-15/105772186",
        "title": "Live: ANZ hit with $240m fine for 'unconscionable' conduct, ASX opens lower",
        "publish_date": "Sun, 14 Sep 2025 21:11:31 +0000",
        "category": "finance",
        "authors": [
            "Stephen Letts",
            "Michael Janda"
        ],
        "text": "NAB head of FX research Ray Attrill has an interesting note out this morning on the recent rise of the Australian dollar, and not just against the Greenback.\n\nLast week the little Aussie battler gained against all G10 currencies with the exception of Norway's less liquid Krona, which was given a leg up by higher oil prices.\n\n\"In an FX (foreign exchange) market that has been rediscovering its enthusiasm to sell the USD ahead of an expected resumption of the Fed easing cycle — AUD ($A) has to some extent been in demand by default,\" Mr Attrill said.\n\nTraders appear to be shying away from the likes of the Euro and UK pound given the well-ventilated fiscal and political concerns — high public debt across the UK and Europe and a crumbling French government, while the Canadian dollar (aka the Loonie) is being weighed down by the prospect of a rate cut this week.\n\n\"At the same time, iron ore prices holding on to the move above $105 a tonne, ongoing gold price appreciation, a falling USD/CNY (Chinese yuan) and an economy that looks to have positive momentum out of what was a strong Q2, are offering plenty of reasons for liking AUD in its own right,\" Mr Attrill said.\n\nMr Attrill also noted that a lot of the record speculative short bets against the Aussie dollar on the International Monetary Market are being unwound too, which is supporting the rally.\n\nAMP head of investment strategy Shane Oliver says the US Federal Reserve's likely resumption of rate cuts is positive for the Australian dollar and will marginally increase pressure on the RBA for more rate cuts.\n\n\"Money markets now see the Fed cutting by more than the RBA which will push US short term rates below the RBA's cash rate,\" Dr Oliver said. \"Historically, a rising gap between Australian and US rates has tended to see a rising trend in the Australian dollar and its break above $US0.66 may be a tentative sign that it is moving higher. \"It's also undervalued versus the $US (with fair value around $US0.73) supporting more upside.\"\n\nDr Oliver said if the $A heads significantly higher this may add pressure on the RBA to cut by more than the market is expecting because a rising $A will dampen local growth and inflation.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-09-15/round-of-upsets-shakes-up-aflw-ladder-mid-season/105772256",
        "title": "Mid-season upsets shake up AFLW ladder",
        "publish_date": "Sun, 14 Sep 2025 21:00:27 +0000",
        "category": "sports",
        "authors": [],
        "text": "Fortunes can change very quickly in the AFLW.\n\nAfter Geelong lost their opening two games, senior coach Dan Lowther said it was well publicised in the short 12-round season that early wins were important, but \"who's to say we can't win the next 10?\".\n\nThat was pretty quickly proven not possible when the Cats went down to Sydney the following week by less than a goal.\n\nBut Lowther's argument was strengthened this weekend when his side claimed its second consecutive win, a 30-point hammering over Richmond, rocketing it up the ladder to 10th spot, just outside the top eight and equal on points with reigning grand finalist Brisbane.\n\nGeorgie Prespakis has been a key part of the Cats' consecutive wins. (Getty: Kelly Defina)\n\nThe fixture structure — where ladder positions from the previous year dictate the difficulty of clubs' run — can deceive how well teams are placed after just a few rounds.\n\nThis was highlighted by commentator Abbey Holmes, who said Geelong \"have a tough start\".\n\n\"But it does seem like they are starting to find their groove,\" Holmes said on Seven.\n\nOne of the keys to those consecutive wins was the performance of midfield star Georgie Prespakis.\n\n\"Just her ability to link up. Mikayla Bowen's having an unbelievable year as well but just the one-two efforts, the third efforts, the fourth efforts, she never stops running, never stops competing,\" Holmes said.\n\n\"[She] had 31 disposals, 413 metres gained, six clearances — and it's a very big reason as to why the Cats have got consecutive wins on the board now.\"\n\nNorth Melbourne are the only side left undefeated in the AFLW after round five. (Getty: Michael Willson/AFL Photos)\n\nAfter the weekend of upsets, the only team left undefeated are, fairly unsurprisingly, reigning premiers North Melbourne.\n\nThey became the first defending premiers to win a grand final rematch in the history of the competition. In toppling Brisbane, they extended their 17-match, 651-day winning streak.\n\nThe result puts the Lions, the second-most-successful team in the history of the competition, behind Adelaide, outside the eight in ninth position.\n\n\"This isn't the Brisbane Lions that we know. Who's hungry? Who wants the footy? Who wants to put their head over it and win a contested ball?\" Holmes asked on Fox during the third quarter.\n\n\"It's something that has made them such a dominant side in this competition for a long period of time and it seems to be lacking.\"\n\nInaugural Blue hopes for finals berth after hot start Photo shows Carlton players celebrate during a match against Gold Coast. Inaugural Carlton player Gab Pound says the club has reached a turning point after not making the finals since the 2020 COVID-interrupted season.\n\nAt the same time, Adelaide, who had just the two wins under their belt coming into the weekend, defeated the previously undefeated Hawthorn.\n\nThe Crows did not just run out the victory, but did so by 21 points.\n\nCommentator Jessica Webster told Fox it was a \"reminder that the Crows are still a contender\" despite a patchy start to the year.\n\nMelbourne, who were also undefeated ahead of the round, fell to Port Adelaide by a mere two points.\n\nSimilar to Geelong, St Kilda headed into the weekend with just the one win but had a comprehensive 52-point win over Essendon spearheaded by goalscorer Jesse Wardlaw.\n\nThat victory saw them climb to 12th, just ahead of Collingwood, who had a surprise win over previously undefeated Sydney to begin the round.\n\nThe other NSW side, GWS, however, broke a 378-day winning drought when they secured a 21-point over the Western Bulldogs after Georgia Garnett starred with three goals.\n\nIt leaves just Richmond yet without a win this year.\n\nTo close out the round over in the West, Fremantle (14th) denied West Coast (seventh) a first derby win to take their tally over their rivals to 7-0.\n\nIt was a game the Dockers came into on a three-game losing run, while the Eagles had only dropped one game all season.",
        "source": "ABC"
    },
    {
        "url": "https://www.smh.com.au/national/first-climate-risk-assessment-handed-down-in-australia-20250915-p5mv48.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "First climate risk assessment handed down in Australia",
        "publish_date": "Mon, 15 Sep 2025 11:58:44 +1000",
        "category": "finance",
        "authors": [],
        "text": "First climate risk assessment handed down in Australia\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/business/the-economy/trump-s-assault-on-the-fed-has-reached-boiling-point-20250915-p5mv1o.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Trump’s assault on the Fed has reached boiling point",
        "publish_date": "Mon, 15 Sep 2025 11:57:05 +1000",
        "category": "finance",
        "authors": [
            "Stephen Bartholomeusz"
        ],
        "text": "The Miran appointment, while certain to be rubber-stamped by the Republican majority in the Senate, is controversial because he has said he won’t resign from his role as chair of Trump’s Council of Economic Advisers, instead taking an unpaid leave of absence. Miran was nominated to fill the remaining term of former governor Adriana Kugler, who resigned last month, even though her term wasn’t scheduled to end until January 31 next year. It is unclear if he will remain on the board beyond that date. Trump is still trying to fire Cook on the basis of an allegation made on social media that hasn’t been proven and now appears to have been disproved. Credit: AP By remaining a key Trump adviser while serving as a governor, Miran, regarded as the architect of the administration’s more contentious economic policies – including the tariffs and Trump’s efforts to bring the Fed under the administration’s control – would not be an independent in an institution that Congress designed to be independent of politics. Unlike Waller or Bowman, appointed by Trump but not part of the administration (although Waller is on the short list to be the next Fed chair and therefore wouldn’t want to be offside with Trump), he’d clearly be Trump’s main man inside the Fed.\n\nThe Cook affair is also tainted. Trump purported to fire her last month, via a social media post, after the head of the Federal Housing Finance Agency, Bill Pulte, alleged (in a social media post, of course) that she had named two separate properties as her principal place of residence in loan documents, which may have enabled her to borrow more cheaply. Loading She’s not been charged with anything and can only be sacked “for cause,” which is generally thought to mean that the official has done something seriously wrong while in office. The initial judgment that the administration is appealing was that Trump’s justification for firing Cooke didn’t meet the threshold for sufficient cause, in part because the alleged actions occurred before she was a governor. As it happens, what Pulte and Trump have alleged may not even have occurred.\n\nFirst Reuters, and then a string of major media outlets, have said Cook described her second property as “a vacation home,” not as her principal place of residence, in loan documents they have seen. Cook’s lawyers have said any errors in the loan documents, if there were errors, were unintentional and might be the results of clerical errors. If the documents Reuters and others have sighted – which appear to be loan estimates provided by a credit union – exist then, regardless of what the final loan documents showed, the lender would have been aware that the loan was for a holiday home, not as her primary residence. In other words, Trump is still trying to fire Cook on the basis of an allegation made on social media that hasn’t been proven and now appears to have been disproved. The allegations are a pretext to try to open another spot on the Fed board for a Trump appointee. If Trump can gain a majority of the seven-person board, he would then be in a position to remake the FOMC, where the remaining members are the president of the New York Fed and the presidents of four of the Fed’s 12 regional banks, who serve on a rotating basis. The Fed’s board can veto those appointments.\n\nThe White House, with a president who has said he wants the federal funds rate cut by three percentage points, would be able to dictate US monetary policy, ending three quarters of a century of the US central bank’s independence. When the Fed last met, in July, for the first time in more than 30 years there were two governors – Waller and Bowman – who dissented from the majority’s decision to hold rates steady. The interest this week will be in whether Miran, Waller and Bowman, argue for something more than the 25 basis points cut expected. The majority is likely to be conservative – there could be some who argue for rates to remain on hold – because, while the jobs market appears to be shrinking and the unemployment rate is rising, the full effects of Trump’s tariffs are yet to show up in the data. That’s because of the on-off-on way they were implemented, which allowed companies to build up inventories of goods before the tariffs took effect. With the main “reciprocal” tariffs finally going live last month, their impact on prices will progressively show up over the rest of this year and beyond. The worst-case outlook for the Fed is one of stagflation: low economic growth, or even a recession, while the inflation rate remains high. Trump’s trade wars and his immigration policies make it possible that there could be, simultaneously, rising unemployment and rising inflation.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/australia-news-live-polling-shows-support-for-coalition-has-plummeted-to-new-low-kirk-suspect-not-cooperating-with-authorities-says-utah-governor-20250915-p5mv0e.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Australia news LIVE: Polling shows support for Coalition has plummeted to new low; Kirk suspect not cooperating with authorities, says Utah governor",
        "publish_date": "Mon, 15 Sep 2025 11:54:43 +1000",
        "category": "finance",
        "authors": [
            "Emily Kaine"
        ],
        "text": "Climate Change Minister Chris Bowen has defined climate change’s ongoing impact on Australia as “cascading”, “compounding” and “concurrent”, as the government releases the first National Climate Risk Assessment report.\n\n“Cascading. It will get worse. Over time. Compounding its impact on climate change by making other impacts worse. And concurrent, communities will suffer the impacts of climate change in different ways at the same time. And we will have a lot to manage,” Bowen told a press conference in Parliament House.\n\n“One thing that is very clear from this climate assessment is that a whole country has a lot at stake. Every Australian regardless whether they live has a lot at stake. But the report does make clear that some communities have a particular amount of stake,” Bowen said.\n\nThe minister said climate change would particularly impact Queensland, New South Wales, the ACT and Tasmania — as well as those living in regional and rural Australia.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/business/companies/the-guardian-finally-lands-its-new-political-editor-20250915-p5mv3i.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "The Guardian finally lands its new political editor",
        "publish_date": "Mon, 15 Sep 2025 11:51:14 +1000",
        "category": "finance",
        "authors": [
            "Calum Jaspan"
        ],
        "text": "The Guardian has concluded its long-running search for a political editor, promoting its chief political correspondent Tom McIlroy, who joined the outlet this year in the lead up to the federal election.\n\nMcIlroy’s appointment means the Australian outpost of the British newspaper will now begin a search for a new chief political correspondent.\n\nIt also shifts the focus for Guardian Australia after a period of tumult for its Canberra bureau. The political editor position had been vacant after changes to the bureau led to an exodus of its top talent and an internal HR investigation.\n\nFormer Financial Review journalist Tom McIlroy has emerged as The Guardian’s political editor Credit: Oscar Colman\n\nIn late 2024, Canberra-based Guardian staff were interviewed as part of an HR investigation after political editor Karen Middleton made a complaint against the outlet’s chief political correspondent Paul Karp, who lodged a counter-claim against Middleton.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/nrl/southwell-belts-little-sister-in-nrlw-20250915-p5mv40.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Southwell belts little sister in NRLW",
        "publish_date": "Mon, 15 Sep 2025 11:46:09 +1000",
        "category": "finance",
        "authors": [],
        "text": "Southwell belts little sister in NRLW\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/rugby-union/ref-rage-generated-a-crackling-atmosphere-in-sydney-but-it-also-taught-the-wallabies-valuable-lessons-20250914-p5mux8.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Ref rage generated a crackling atmosphere in Sydney. But it also taught the Wallabies valuable lessons",
        "publish_date": "Mon, 15 Sep 2025 11:40:00 +1000",
        "category": "sports",
        "authors": [
            "Iain Payten"
        ],
        "text": "They defended stoutly and got the job done. But even 30 minutes later, a gobsmacked Contepomi couldn’t bring himself to wave it away with an “all’s well than ends well”. “It’s frustrating. I think we don’t deserve that. So I’ve got mixed emotions. It’s very frustrating, because it’s not working. It’s as simple as that. It’s not working. The system, whatever they are doing to get it better, there’s no consistency and it’s not working.” Rounding out the strange day, the Wallabies - the losing team who been caned 14-7 and had every right to pour fuel on the same bonfire - then came in and bit their tongues. Referee Christophe Ridley gestures to Harry Wilson. Credit: Getty Images Showing his years of experience, Joe Schmidt rattled off half-a-dozen things he’d observed but surmised they couldn’t worry about it. It was the wise approach, for a bunch of reasons. Referees are like elephants, and you’ll get them again.\n\nBut it’s fair to say the referee and the match officials, to put it mildly, had a rough day. Ridley is an inexperienced young Test referee and, as can occur, his attempts to stamp authority early on for minor stuff set in motion a game that may have got away from him. He then didn’t stay consistent, which irked the captains, and when new penalties in key moments were found from areas he’d previously ignored - like high shots and obstruction by retreating defenders - the captains’ grumbles spread out and into a very restless home crowd. Santiago Carreras kicks a goal for Argentina. Credit: Getty Images In many ways, it made for brilliant theatre. With a record crowd (post-rebuild), the joint was absolutely rocking. Nothing brings people together more than booing a referee whose calls they don’t agree with. In the end, all the match officials were so rattled they were the only four people in the stadium who missed, or cleared, a blatant forward pass. Even Wallabies players had their hands on their heads, missed-soccer-goal style.\n\nThe game ended in a loss for the Wallabies but oddly enough, the crackling atmosphere was arguably one of the best in years, possibly decades. With unprecedented numbers of people in generations of gold jerseys, old and new, and with lots of kids in the stands, the sense of injustice only served to unite - and amplify - the support. Loading Pubs and restaurants around Paddington and Surry Hills did a roaring trade of post-game analysis. And, also encouragingly, most Aussie fans agreed the end result was the right one. For all the harsh calls on the Wallabies, the Pumas had still been the better side on the day; hungrier and cleaner in most contests, and certainly more physical. The Wallabies mostly had themselves to blame. After getting that dangerous taste of space early - Joseph-Aukuso Suaalii’s fifth-minute try came after the Wallabies had gone backwards with their carrying - the home team then frantically chased even more quick kills.\n\nWallabies players spoke post-game about the need to fix up their discipline, having gone from 10 Tests in two Tests in South Africa to 25 in two clashes with Argentina. And patience and belief in teammates is usually the antidote to cutting penalty counts. But patience also the key to being more clinical, a bit more boring and winning a game like the one at Allianz Stadium. “We’ve been really efficient off our line breaks, but probably the last two weeks we’ve tried to score off those line breaks as opposed to the patience of,” Tate McDermott said. “We’ve got to weigh up whether the risk is actually worth the reward there.” For all the Australian fury at the referee team, the takeaway for the Wallabies is Contepomi was fuming too. Short of World Rugby doing the logical thing and using top Test referees for all top Tests, no matter their nationality (Angus Gardner was wasted as a touch judge in Wellington, for example), rookie refs will inevitably be inconsistent as they build experience.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/property/news/local-buyer-splashes-12-35m-on-tamarama-home-with-a-better-view-20250915-p5mv1q.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Local buyer splashes $12.35m on Tamarama home with a ‘better view’",
        "publish_date": "Mon, 15 Sep 2025 11:37:25 +1000",
        "category": "finance",
        "authors": [
            "Carmen Forward"
        ],
        "text": "An eastern suburbs’ buyer, upsizing in the same suburb of Tamarama, paid $12.35 million for a home with a “better view” at auction on Saturday.\n\nThe five-bedroom, four-storey ocean view property at 27 Carlisle Street drew a crowd of 80 to the house with easy access to the beach.\n\nThree registered, and two actively bid for the home guided at $11.25 million. Bidding opened at $11.5 million and rose in steady increments to $12 million until it sold under the hammer at its reserve of $12.35 million.\n\nThere is no legal requirement for a vendor’s reserve to be in line with their property’s price guide.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/traveller/reviews-and-advice/airline-reviews-a-to-z-of-travellers-expert-flight-tests-20180131-h0r914.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Airline reviews: A to Z of Traveller's expert flight tests",
        "publish_date": "Mon, 15 Sep 2025 11:30:32 +1000",
        "category": "finance",
        "authors": [],
        "text": "Add articles to your saved list and come back to them anytime.\n\nSave this article for later\n\nRemove items from your saved list to add more.\n\nYou have reached your maximum number of saved items.\n\nThis is one of Traveller’s top airlines for 2024. See all stories .\n\nKnow before you go: find your airline in our list of reviews. AP\n\nTaking a flight? Find out what to expect from your seat, service and route with our comprehensive airline reviews. Listed in alphabetical order by airline, aircraft and class.\n\nA\n\nAegean Airlines, Airbus A320neo, economy class\n\nAer Lingus, Airbus A320neo, economy class",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/nsw/so-you-think-trucks-are-taking-over-sydney-street-parking-you-re-not-alone-20250908-p5mtc1.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "So you think trucks are taking over Sydney street parking? You’re not alone",
        "publish_date": "Mon, 15 Sep 2025 11:30:00 +1000",
        "category": "finance",
        "authors": [
            "David Barwell"
        ],
        "text": "Sydney’s biggest motorsport track, and land around Pyrmont’s Fish Markets site, could be turned into overnight truck parking zones in a bid to solve a sharp rise in suburban car park battles unfolding in residential streets.\n\nBold solutions are being considered in response to a citywide shortage of dedicated heavy vehicle parking sites, resulting in more truckies using suburban areas to keep their big rigs at night.\n\nNick Rice, pictured at the Johnstons Transport depot at Marrickville. Credit: Edwina Pickles\n\nIn Blacktown Council LGA alone, the number of resident complaints about trucks illegally parked in residential on-street parking spaces has soared to 2170 in the past financial year – a 43 per cent rise on the previous year.\n\nBlacktown councillor Peter Camilleri said complaints have included gripes about trucks reversing in and out of streets at the crack of dawn, drivers running refrigeration motors “all night”, and leaving behind rubbish, including oil drums, on the sides of roads.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/queensland/iconic-brisbane-party-boat-listed-for-sale-after-years-of-lying-low-20250914-p5muus.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Iconic Brisbane party boat listed for sale after years of lying low",
        "publish_date": "Mon, 15 Sep 2025 11:28:47 +1000",
        "category": "finance",
        "authors": [
            "William Davis"
        ],
        "text": "Years after disappearing from public view, an ageing Brisbane icon has come up for sale.\n\nKookaburra Queen I was one of two similar boats built for World Expo 88. It was a near-constant presence on the Brisbane River for decades, hosting countless parties and tours.\n\nThe vessel is now tethered off Colmslie Beach Reserve at Murarrie, with the last commercial operator closing down in 2022.\n\nThe Kookaburra Queen tethered off Colmslie Beach Reserve at Murarrie in Brisbane appears to be the one now for sale. Credit: William Davis\n\nIt was listed for sale by Grays auction house this month.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/property/news/five-bedrooms-five-bathrooms-seven-figures-luxury-home-sets-suburb-record-20250915-p5mv1t.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Five bedrooms, five bathrooms, seven figures: Luxury home sets suburb record",
        "publish_date": "Mon, 15 Sep 2025 11:04:48 +1000",
        "category": "finance",
        "authors": [
            "Sarah Webb"
        ],
        "text": "A luxury family home with a yoga retreat in one of Brisbane’s most sought-after school catchments has set a suburb record in Upper Mount Gravatt, after seven bidders battled it out in an auction that hit $2.96 million in 10 minutes.\n\nIn front of a crowd of almost 200, the five-bedroom, five-bathroom house at 29 Sunnydale Street sold for a reserve-topping sum almost $1 million more than the suburb’s median, as fears of future property price hikes spark spring buying fever.\n\nFeaturing a meditation zone, an inground pool and a fully-equipped gym on a 647-square-metre block in the Mansfield State High School catchment, the home – designed and built three years ago – had more than 200 inspections throughout the campaign and 25 registered bidders.\n\nBidding started at $2 million and rose in $100,000 jumps until three punters were left standing at the $2.7 million mark.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/lifestyle/life-and-relationships/want-to-raise-good-men-start-with-their-group-chats-20250912-p5muh3.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Want to raise good men? Start with their group chats",
        "publish_date": "Mon, 15 Sep 2025 11:03:43 +1000",
        "category": "lifestyle",
        "authors": [
            "Jenna Price"
        ],
        "text": "You’re in a group chat with your mates. And then one says something so off, you don’t even know how to respond. So you let it go. Then you let it go again.\n\nIt’s a common response, says Jackson Katz, author of the new book Every Man. He is in Sydney this week to deliver a keynote at the fifth World Conference of Women’s Shelters, organised by WESNET, the Women’s Services Network, a national network of specialist domestic and family violence services across Australia.\n\nBut that common response, that moment when you can’t call out your mates, no matter how badly they behave, is partly why Katz and allies devised a new way of being a bystander. And it’s not nearly as terrifying as having to confront your mates.\n\nTeenage boys and young men may want to speak up, but it can be particularly difficult in group settings. Credit: Marija Ercegovac/ digitally altered\n\nThere is, says Katz, a pressure to remain silent just to fit in. It starts at school and gets reinforced, particularly if you are part of what he describes as “cohesive organisational cultures”. Work, sport, it happens everywhere – and it’s strengthened because you are all mates, pals, good guys here.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/property/news/yarraville-vendors-gain-double-payday-as-underbidder-buys-the-home-next-door-20250915-p5mv1r.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Yarraville vendors gain double payday as underbidder buys the new home next door",
        "publish_date": "Mon, 15 Sep 2025 11:02:28 +1000",
        "category": "finance",
        "authors": [],
        "text": "“Then there was a $75,000 attempted knockout bid, which did see one party drop out, followed by a quick succession of more $25,000 bids until it got to $1.45 million when I called it on the market,” said Dardha. “I couldn’t call it any earlier because it was just so hot.” Three active bidders, a mix of young couples and young families, participated, and a young family won. With the townhouse next door also built and owned by the same vendors as the property just sold at auction, Dardha suggested to the two parties who missed out that they inspect it.\n\n“One took me up on the offer, and after we had a look through, they bought that one for $1.39 million,” he said. “And then the other underbidder came up and asked to see it, and I had to tell them it was already sold.” The property was one of 1184 scheduled auctions in Melbourne last week. By Saturday evening, Domain Group recorded a preliminary auction clearance rate of 71.5 per cent from 911 reported results, while 72 auctions were withdrawn. Withdrawn auctions are counted as unsold properties when calculating the clearance rate. In Ascot Vale, a family relocating from nearby Flemington secured the keys to a renovated Victorian terrace for $1.63 million. The home at 47 Kent Street, built in 1890, had a price guide of $1.45 million to $1.55 million, and a reserve of $1,575,000.\n\nFour active bidders, all families looking to upsize, took part in the auction, which was held in the property’s backyard in front of a crowd of about thirty. Loading The bidding opened at $1.5 million and then “went up in $25,000 and $20,000 bids, then slowed down later to $10,000 and $5,000,” said selling agent Adam Hicks from Jellis Craig Kensington. The quality renovations completed 10 years ago, including hydronic-heated polished concrete floors and European appliances, were a drawcard for prospective buyers. “The renovation was of a high standard and completed by a well-respected local builder,” said Hicks.\n\nThe property last sold in 2013 for $750,000, records show. Meanwhile, in Ferntree Gully, a first-home buyer paid $952,000, $112,000 over the reserve, for a three-bedroom home with dual street access. The updated home at 7 Scenic Court, on a corner block of 683 square metres, had a price guide of $780,000 to $840,000 and a reserve of $840,000. Three active bidders – a mix of first home buyers and a young couple - participated in the auction, which opened at $730,000.\n\n“The second bid of $120,000 brought it up to $850,000 and put it officially on the market,” said lead agent and auctioneer, Matt Morris from Ray White, Ferntree Gully. Loading Morris said a bidder dropped out after this bid, leaving two others to go back and forth until it was sold, with the knockout bidder, a first-home buyer, successful. “The new owner took my advice of pretending to have more money than you actually do,” Morris said. Morris said that the buyer wanted to purchase a property before October 1st.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/business/markets/asx-set-to-fall-wall-street-dips-us-rate-cut-on-horizon-20250915-p5mv03.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Banks, miners down as ASX falls",
        "publish_date": "Mon, 15 Sep 2025 10:56:07 +1000",
        "category": "finance",
        "authors": [
            "Staff Reporter"
        ],
        "text": "The Australian sharemarket has started the week in the red, with declines across the board.\n\nThe S&P/ASX 200 was 50.5 points, or 0.6 per cent lower, to 8814.5 in early trade, with all 11 industry sectors in negative territory.\n\nThe ASX has started the week in the red. Credit: Oscar Colman\n\nFinancial stocks are weaker, with big four banks Commonwealth Bank (down 0.9 per cent), Westpac (down 0.1 per cent ) and NAB (down 0.1 per cent) all losing ground. ANZ (down 0.3 per cent) also declined after it was revealed it had agreed to pay a $240 million penalty to settle four legal cases from the Australian Securities and Investments Commission, admitting to unconscionable conduct relating to a bond trading scandal, incorrect reporting of trading data and failures in how it dealt with borrowers in hardship.\n\nMining stocks retreated, with BHP (down 0.4 per cent), Rio Tinto (down 0.3 per cent) and Fortescue (down 0.6 per cent).",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/culture/tv-and-radio/full-list-of-nominees-and-winners-at-the-77th-primetime-emmy-awards-2025-20250911-p5muck.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Full list of nominees and winners at the 77th Primetime Emmy Awards 2025",
        "publish_date": "Mon, 15 Sep 2025 10:50:16 +1000",
        "category": "entertainment",
        "authors": [
            "Michael Idato",
            "Louise Rugendyke"
        ],
        "text": "The 77th Primetime Emmy Awards are upon us, with Severance, The Penguin, The Studio and The White Lotus sweeping this year’s nominations, with almost 100 nods between them.\n\nIn some respects, this year’s picks were entirely predictable: comedy and drama category stalwarts such as Abbott Elementary, The Bear, Hacks, Only Murders in the Building and The White Lotus were well represented.\n\nIke Barinholtz, Chase Sui Wonders, Seth Rogen and Kathryn Hahn in The Studio.\n\nBut there was also a strong infusion of new blood, including the critically acclaimed Hollywood satire The Studio, the much-beloved vampire comedy What We Do in the Shadows, the Star Wars series Andor, Netflix’s much-loved political thriller The Diplomat and the thrilling new medical drama The Pitt. Harrison Ford has scored his first Emmy nomination, supporting actor in a comedy series category, for his role as therapist Dr Paul Rhoades in Shrinking.\n\nThe Emmys will be broadcast live from 10am (AEST) on Monday, September 15, on Foxtel and Binge, and you can join our live blog of the red carpet and ceremony here.",
        "source": "SMH"
    },
    {
        "url": "https://www.sbs.com.au/news/article/anz-penalties-widespread-misconduct/lezz3xmob",
        "title": "'Betrayed the trust of Australians': ANZ to be fined $240 million for misconduct",
        "publish_date": "Sun, 14 Sep 2025 23:03:15 +0000",
        "category": "finance",
        "authors": [],
        "text": "ANZ has issued an apology to customers after the financial regulator found the bank had committed a string of offences, including failing to refund fees charged to dead customers, not responding to customer hardship notices and failing to pay promised interest rates to thousands of people.\n\n\n\n\n\nANZ now faces a record fine of $80 million for unconscionable conduct in its dealings with the federal government while it was managing a $14 billion bond deal , along with a further $125 million for institutional and markets matters and $115 million in penalties for retail misconduct.\n\n\n\n\n\nFinancial watchdog the Australian Securities and Investments Commission (ASIC) announced on Monday that ANZ had admitted to misconduct over many years, and ASIC chair Joe Longo said the bank had again \"betrayed the trust of Australians\".\n\n\n\nLISTEN TO ANZ slashes 3,500 jobs, are there more to come? SBS News 13:19 English\n\nASIC outlined ANZ's wrongdoings as:\n\n\n\nIncorrectly reporting its bond trading data to the federal government and overstating the volumes by tens of billions of dollars\n\nFailing to respond to hundreds of customer hardship notices\n\nMaking false and misleading statements about its savings interest rates\n\nFailing to refund fees charged to thousands of dead customers.\n\nFailures with financial hardship, interest and deceased estates\n\nASIC alleged a number of failures in ANZ's treatment of customers, including failure to respond to 488 customers who submitted financial hardship notices to the bank between May 2022 and September 2024.\n\n\n\n\n\nIssues of unemployment, serious medical issues, bereavement and family violence were ignored, and in some cases, ASIC alleges ANZ took action to recover debts from customers even when they had not responded to the customers' hardship notices.\n\n\n\n\n\nThe bank has now paid out a total of $92,687 to affected customers through a remediation program.\n\n\n\n\n\nOver 11 years, the introductory bonus interest for ANZ customers who opened certain new accounts was not always applied. The bank also gave inaccurate variable and fixed bonus introductory interest rates to 26,917 customers, resulting in around $480,000 in interest not paid out.\n\n\n\nASIC also alleges ANZ failed to refund fees charged to thousands of deceased customers between July 2019 and June 2023 and did not respond to representatives of deceased estates in the required time.\n\n\n\n\n\nThe watchdog said the extent of this issue is still unknown and \"ANZ's failures are likely to have compounded the difficulties faced by loved ones dealing with the death of a family member or relative\".\n\n\n\n\n\nA 2023 inquiry report by the independent Banking Code Compliance Committee (BCCC) focused on six banks, including the 'big four' — Commonwealth, ANZ, Westpac and NAB — and found the banking industry does a poor job of handling deceased estates. This included charging fees for services no longer provided and failing to treat next of kin with respect and kindness.\n\n\n\n\n\nANZ was sanctioned in July last year by the BCCC for charging fees to the estates of dead clients.\n\n\n\nREAD MORE Lifting caps from first home buyer scheme will help some but fuel wider price rise\n\nThe committee's chair Ian Govey called the deficiencies in ANZ's compliance \"deeply concerning\" at the time and said publicly naming the bank for its failures was the most serious sanction the industry overseer could levy.\n\n\n\nRecord fine\n\nASIC said that, alongside ANZ, it will ask the Federal Court to impose $240 million in penalties, including a record $80 million penalty for its misconduct.\n\n\n\n\n\nLongo said the proposed penalties against ANZ are the largest announced by the regulator against one entity and \"reflect the seriousness and number of breaches of law\" as well as the \"vulnerable position\" the bank put its customers in.\n\n\n\n\n\n\"Banks must have the trust of customers and government. This outcome shows an unacceptable disregard for that trust that is critical to the banking system,\" he said.\n\n\n\nANZ chairman Paul O'Sullivan apologised for the bank's misconduct and said it had \"made mistakes that have had a significant impact on our customers\".\n\n\n\n\n\n\"While ASIC has not alleged that ANZ engaged in market manipulation, it's clear we have not met the standards expected of us,\" he said.\n\n\n\n\n\nThe bank also confirmed that it will submit a remediation plan required by ASIC to the Australian Prudential Regulation Authority by the end of the month and said it expects to spend approximately $150 million on implementing the plan.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/treaty-australia-papua-new-guinea-pacific-security/x532pqku7",
        "title": "Australia and PNG to sign landmark defence deal amid question on exclusivity",
        "publish_date": "Sun, 14 Sep 2025 21:14:12 +0000",
        "category": "finance",
        "authors": [],
        "text": "Australia and Papua New Guinea are set to sign a significant defence treaty, as seasoned observers wait to discover whether it will deliver a \"holy grail\".\n\n\n\n\n\nPrime Minister Anthony Albanese will travel to Port Moresby on Monday to attend Papua New Guinea's Golden Jubilee celebrations and finalise a defence agreement with counterpart James Marape.\n\n\n\n\n\nThe deal will enable PNG nationals to serve in Australia's defence force with the same pay as other members and start a pathway to citizenship.\n\n\n\n\n\nDetails are yet to be revealed, including whether both countries would be compelled to consult one another if they faced a security threat, similar to NATO's Article Four clause.\n\n\n\nAlbanese emphasised the two nations were expanding their partnership as equals and had the same vision for a stable and prosperous Pacific.\n\n\n\n\n\n\"Our relationship now is a relationship about security,\" he told reporters ahead of the trip.\n\n\n\n\n\n\"It's an economic relationship, it's about people-to-people relations.\"\n\n\n\n\n\nThe treaty speaks to a shared ambition between the two nations, Defence Minister Richard Marles said.\n\n\n\n\n\n\"What we'll be saying in the next few days is a genuinely historic agreement between our two countries,\" he said.\n\n\n\nWhat could the treaty's significance be?\n\nIt's PNG's first defence agreement with another nation and deeply significant for the country, Lowy Institute research fellow Oliver Nobetau said.\n\n\n\n\n\nThe world was waiting to learn if it included an exclusivity clause, which meant PNG could not pursue similar deals with other countries, such as China, he said.\n\n\n\n\"We can define that as a sort of the holy grail of security partnerships in the Pacific, and if you can get that, it can signal a return to greater regional stability,\" Nobetau told the Australian Associated Press.\n\n\n\n\n\nAustralia is competing with China and other countries for influence in the region, and the PNG deal comes after an agreement with Vanuatu hit a stumbling block.\n\n\n\n\n\nPNG is one of three nations in the Pacific with a military, alongside Fiji and Tonga.\n\n\n\n\n\nPNG viewed itself as a \"big brother\" in the Pacific and was seeking a more dominant role as it marked 50 years since gaining independence from Australia, Nobetau said.\n\n\n\n\n\n\"This sets the tone of what the biggest country in the Pacific wants to do in terms of security, and we may see PNG play a greater role in influencing other countries as well,\" he said.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/toilet-phone-use-can-raise-risk-of-haemorrhoids-researchers-claim/6ck0ksg1w",
        "title": "This common bathroom habit could be doing you more damage than you think",
        "publish_date": "Sun, 14 Sep 2025 07:06:32 +0000",
        "category": "lifestyle",
        "authors": [],
        "text": "Using your phone on the toilet won't just leave it covered in germs, it could also lead to an increased risk of haemorrhoids, according to a study from the United States.\n\n\n\n\n\nThe study surveyed 125 adults and found that those who reported using a phone on the throne had a higher risk of haemorrhoids than non-users.\n\n\n\n\n\nParticipants were asked how often they used their phones while on the toilet, and for how long.\n\n\n\n\n\nThe survey found 66 per cent of all participants used smartphones while on the toilet, with that group spending \"significantly more time there\" — often more than five minutes per visit — compared with those who didn't.\n\n\n\n\n\nChecking the news and using social media were the most common smartphone toilet activities, according to the study, which was published in scientific journal PLOS ONE in early September.\n\n\n\nLISTEN TO Loo scrolling: Study investigates link between this bathroom habit and a painful health condition SBS News 07:07 English\n\nThe researchers suggest that smartphone use may inadvertently prolong toilet time, potentially increasing pressure in anal tissues, which may then lead to haemorrhoids.\n\n\n\n\n\nAfter accounting for other factors linked with haemorrhoid risk — including exercise habits, age and fibre intake — the researchers found that those who scrolled on the toilet had a 46 per cent higher risk of haemorrhoids than those who didn't.\n\n\n\nWhat are haemorrhoids?\n\nGastroenterologist Graeme Young from Flinders University says there are a number of clear signs of a haemorrhoid.\n\n\n\n\n\n\"Haemorrhoids are, in the beginning, internal and small,\" Young tells SBS News.\n\n\n\n\n\n\"It's only when they start to bulge down a bit through the anus that they become apparent and you can feel uncomfortable in that area.\"\n\n\n\nREAD MORE Melanie was sceptical of this underutilised cancer treatment. It saved her life\n\n\"Usually, when you're wiping yourself after passing a bowel action, you will feel something is not right.\"\n\n\n\n\n\nHe says that you will be able to feel if you have a haemorrhoid and says it might feel like there's \"a couple of grapes in there\". You might also be able to see blood on your toilet paper as a result of them.\n\n\n\n\n\nHaemorrhoids are one of the most common anorectal health conditions in Australia.\n\n\n\nWhat's scrolling got to do with it?\n\nProfessor Rupert Leong, a gastroenterologist based at Concord Hospital in Sydney, says the prevailing theory is that haemorrhoids are caused by straining.\n\n\n\n\n\n\"People who sit on toilets, especially those who sit on for extensive periods of time and may not be focused on just defecating, they are distracted doing other things whilst defecating — i.e. on smartphones,\" he tells SBS News.\n\n\n\n\n\n\"This activity may be prolonging the defecation process, resulting in excessive straining, which can then increase the pressure of the blood vessels that lead to vascular swelling, and eventually rupture of the vessels that lead to bleeding.\"\n\n\n\n\n\nHowever, the recent study found straining while using the toilet was not, in and of itself, associated with increased haemorrhoid risk, in contrast to some prior studies.\n\n\n\n\n\n\"It is possible that time spent on the toilet is a more accurate predictor of haemorrhoids than straining,\" the study authors write.\n\n\n\nREAD MORE Would you seek health advice from TikTok? Why experts are sounding fresh cautions\n\nDr Jarrah Dowrick, a research fellow at the University of Auckland, says time spent on the toilet is most likely the primary potential risk-factor being captured by the study.\n\n\n\n\n\n\"From what I can see, this paper is a thinly veiled study of the relationship between time spent on the toilet and haemorrhoids, but using the catchier hook of \"phone use\" to attract wider attention,\" he told the Australian Science Media Centre (ASMC).\n\n\n\n\n\n\"The real story here is that spending longer on a seated toilet appears to be linked with haemorrhoid presentation.\"\n\n\n\n\n\nHe notes that it's still an \"important finding\", adding that there is a lack of evidence for commonly believed haemorrhoid risk factors like low fibre intake, straining, or time on the toilet.\n\n\n\nLISTEN TO The effects of scrolling social media on your brain SBS News 02:54 English\n\nAnother possible reason for the findings is that smartphone use on the toilet might be disrupting gut-brain communication, says Dr Kate MacKrill, gastroenterology psychologist at Middlemore Hospital and a lecturer at the University of Auckland.\n\n\n\n\n\n\"Our digestive system is controlled by the enteric nervous system, which is essentially the body's second brain,\" she told ASMC.\n\n\n\n\n\n\"Sitting on the toilet for longer than you need to might start to change the signals the bowel sends.\n\n\n\n\n\n\"The bowel becomes unsure whether it has completely evacuated, leading to abdominal pain, actual constipation, discomfort, and an even longer time sitting on the toilet.\"\n\n\n\nSome tips to lower haemorrhoid risk\n\nTo lower the risk of developing haemorrhoids, try to be efficient, strain-free, and focus on the job at hand, Young says.\n\n\n\n\n\n\"For people who have a difficult bowel habit in terms of initiating the bowel action, the chances are they are going to be sitting longer on the toilet and straining.\n\n\n\n\n\n\"What it really boils down to is it's not a good idea to be sitting on the toilet for ages, waiting and hoping for something to happen, and especially straining to achieve that.\"\n\n\n\n\n\nInstead, he says that, if there is no action, \"you need to get up and leave it, and come back to it later on\".\n\n\n\nREAD MORE Need to wee more during winter? This could be why\n\nAlong with time spent on the toilet, other commonly believed haemorrhoid risk factors include low fibre intake, straining, constipation, age, sex differences and pregnancy.\n\n\n\n\n\nYoung encourages people to address any constipation and says that's one of the \"real problems\" associated with haemorrhoid formation.\n\n\n\n\n\n\"If there is a real problem of constipation — and by constipation we mean not going to the toilet often enough — then you really need to get the constipation dealt with by dietary fibre, and discuss with the doctor if that doesn't work,\" he says.\n\n\n\n\n\n\"So I'm not sure that it's to do with reading the phones — I think people are reading the phones cause they're sitting there waiting for something to happen … it's more about sitting on the toilet for too long than it is about scrolling down the phone.\"\n\n\n\nHow can you treat haemorrhoids?\n\nIf you suspect you might have haemorrhoids, experts say you should visit a GP, who will ask you about your symptoms and will examine your anal passage to look for any swollen blood vessels.\n\n\n\n\n\nDr Leong says the GP visit could also be useful in ruling out more serious conditions, including bowel cancer.\n\n\n\n\n\n\"The symptoms of haemorrhoids are non-specific — so a passage of red blood can be something as benign as a haemorrhoid or it can be something more sinister that includes bowel cancer,\" he says.\n\n\n\n\"So anyone who's got bleeding in the bowel should present to the general practitioner, who would perform an external examination.\"\n\n\n\n\n\nThe pain and inflammation from haemorrhoids can often be easily treated with over-the-counter medications from the pharmacy.\n\n\n\n\n\nFor more severe cases, your doctor may prescribe a corticosteroid cream. Less often, a surgical procedure might be needed.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/torrie-lewis-breaks-her-own-australian-100m-record-at-world-athletics-championships-2025/3md4p5y2e",
        "title": "Torrie Lewis breaks her own Australian 100m record at World Athletics Championships 2025",
        "publish_date": "Sat, 13 Sep 2025 23:30:25 +0000",
        "category": "sports",
        "authors": [],
        "text": "Australian sprinter Torrie Lewis has made light of a stacked field and a headwind to smash her own national 100m record and storm into the semi-finals on day one of the world athletics championships in Tokyo.\n\n\n\n\n\nLining up against defending world champion Sha'Carri Richardson from the US, two-time world 200m champ Shericka Jackson from Jamaica and two other runners with career sub-11 second PBs, Lewis could well have been overwhelmed.\n\n\n\n\n\nInstead she was inspired.\n\n\n\n\n\nThe 20-year-old flew out of the blocks on Saturday and held her form in the closing stages to clock 11.08 seconds into a 0.8m per second headwind.\n\n\n\n\n\nShe finished a close third behind Richardson (11.03) and Jackson (11.04), with only the top three in each heat guaranteed to advance.\n\n\n\nLewis stripped two-hundredths of a second from her previous national record of 11.10 set last year in Canberra, with the promise of even better to come in Sunday's semi-finals.\n\n\n\n\n\n\"I was super nervous before this competition because I knew in training that these are the times I can hit,\" she said.\n\n\n\n\n\n\"Actually this is the slowest time in my mind that I had, so hopefully I can build on that.\"\n\n\n\n\n\nLewis was proud of how she handled the cards she was dealt in the heats.\n\n\n\n\n\n\"It was like 'thanks guys for giving me the hardest one',\" she said.\n\n\n\n\"But after I let it sink in I was very glad I had them because I can run with them, and who cares if they beat me, because they're the best in the world ever, almost.\n\n\n\n\n\n\"So I just wanted to run as fast as I could with them and see how I go.\"\n\n\n\nJessica Hull wins 1500m heat\n\nLooking every inch the runner who claimed a historic silver at last year's Paris Olympics, Jessica Hull was a commanding winner of the first of three women's 1500m heats.\n\n\n\n\n\nHull sat near the front for the duration of the race and covered all moves in the final straight to win in 4:04.40.\n\n\n\n\n\nShe will be joined in Sunday's semi-finals by compatriot Linden Hall, who was fourth in her heat.\n\n\n\n\n\nHull showed no after-effects from her shocking defeat at the recent Diamond League final in Zurich when she ran out of gas and was pipped on the line by Kenyan Nelly Chepchirchir.\n\n\n\nJessica Hull kept a close eye on the chasing pack as she won her 1500m heat at the world titles. Source: AP / Matthias Schrader \"It's hard when it's the first race after something like that so I definitely was a little bit more intuitive in my body,\" she said.\n\n\n\n\n\n\"I wanted to feel what I was feeling and just trust it.\n\n\n\n\n\n\"I had the gears I thought I would have when I was fully tapered and fresh.\"\n\n\n\n\n\nWatch every session of the 2025 World Athletics Championships live and free across SBS VICELAND, including the World Athletics Championships 2025 Hub via SBS On Demand.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/interview-is-there-life-on-mars-new-research-seems-to-show-there-was-once/ssg4qoqep",
        "title": "INTERVIEW: Is there life on Mars? New research seems to show there was, once.",
        "publish_date": "Sat, 13 Sep 2025 22:30:50 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/interview-the-new-aged-care-act-and-the-unintended-consequences-preventing-transformational-change/inu3t2y1l",
        "title": "INTERVIEW: The new Aged Care Act and the 'unintended consequences' preventing transformational change",
        "publish_date": "Sat, 13 Sep 2025 22:00:00 +0000",
        "category": "lifestyle",
        "authors": [],
        "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts .\n\n\n\n\n\nA new law for government-funded aged care in Australia is due to come into effect on November 1.\n\n\n\n\n\nThe commencement of the new Aged Care Act comes more than four years after the final report of the Royal Commission into aged care was handed down, with 148 recommendations for change.\n\n\n\n\n\nThe new law aims to address 58 of the recommendations, including a universal right to aged care based on assessed need.\n\n\n\n\n\nThe Inspector-General of Aged Care, Natalie Siegel-Brown, has conducted a detailed assessment of progress made in implementing the Royal Commission recommendations to date.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/loo-scrolling-study-investigates-link-between-this-bathroom-habit-and-a-painful-health-condition/jil9sefun",
        "title": "Loo scrolling: Study investigates link between this bathroom habit and a painful health condition",
        "publish_date": "Sat, 13 Sep 2025 21:00:00 +0000",
        "category": "lifestyle",
        "authors": [],
        "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT:\n\n\n\n\n\n\"I am my phone a lot, like way too much. But the people who use their phone - while they are on the toilet - that is disgusting. And I am one of those people (audience laughter). Sometimes I go to the bathroom and I sit down and I'm like: oh man, I forgot my phone. And I sit there all bored. I wonder what my phone is doing?\"\n\n\n\n\n\nThat's US stand-up comedian Anjelah Johnson-Reyes on Tik Tok, confessing about her phone use while on the toilet.\n\n\n\n\n\nAnd it's not only a phone full of germs you should be worried about.\n\n\n\n\n\nSitting on the toilet for too long and scrolling through your social media accounts or clearing out your emails can increase your risk of developing haemorrhoids.\n\n\n\n\n\nProfessor Rupert Leong is a gastroenterologist based at Concord Hospital in Sydney.\n\n\n\n\n\n\"The theory is that the pathogenesis (way the condition develops) of this vascular swelling is due to straining. So people that sit on toilets especially those that sit on for extensive periods of time and may not be focused on just defecating. They are distracted doing other things whilst defecating i.e. on smartphones. This activity may be prolonging the defecation process, resulting in excessive straining, which can then increase the pressure of the blood vessels that lead to the vascular swelling; and eventually rupture of the vessels that lead to bleeding.\"\n\n\n\n\n\nHaemorrhoids is one of the most common anorectal health conditions in Australia.\n\n\n\n\n\nFlinders University Emeritus Professor Graeme Young is a gastroenterologist.\n\n\n\n\n\nHe says there are number of clear signs of a haemorrhoid.\n\n\n\n\n\n\"Haemorrhoids are in the beginning internal and small. It's only in the modern day TV and news that we would be discussing this sort of detail isn't it? It's only when they start to bulge down a bit through the anus that they become apparent and you can feel uncomfortable in that area. And usually when you're wiping yourself after passing a bowel action you will feel something is not right. You'll even feel haemorrhoids and if they get really big and bulge well yes they're big and bulging and they feel like a couple of grapes in there. You will know if you've got haemorrhoids either because of the physical presence or the suggestion they are there because of the bleeding.\"\n\n\n\n\n\nA new US study published in peer-reviewed PLOS ONE journal surveyed 125 adults, aged 45 and older, who were having a colonoscopy at a hospital in Boston (Beth Israel Deaconess Medical Center).\n\n\n\n\n\nThe were asked how often they used their phones while on the toilet - and for how long.\n\n\n\n\n\nThe survey found 66 per cent of all participants used smartphones while on the toilet, with that group spending more time - over five minutes - on the toilet than non-phone toilet users.\n\n\n\n\n\nChecking the news and using social media were the most common smartphone toilet activities.\n\n\n\n\n\nThe researchers suggest that smartphone use may inadvertently prolong toilet time, potentially increasing pressure in anal tissues, which may then lead to haemorrhoids.\n\n\n\n\n\nProfessor Young says the focus should be on being efficient and strain-free in your bowel movements.\n\n\n\n\n\n\"For people who have a difficult bowel habit in terms of initiating the bowel action, the chances are they are going to be sitting longer on the toilet and straining. What It really boils down to is it's not a good idea to be sitting on the toilet for ages; waiting and hoping for something to happen, and especially straining to achieve that. If you go to the toilet and nothing is happening fairly quickly, you really need to get up and leave it; and come back to it later on.\"\n\n\n\n\n\nThe pain and inflammation from haemorrhoids can often be easily treated with over-the-counter medications from the pharmacy.\n\n\n\n\n\nFor more severe cases, your doctor may prescribe a corticosteroid cream.\n\n\n\n\n\nLess often, a surgical procedure might be needed.\n\n\n\n\n\nAlong with time spent on the toilet, other commonly believed haemorrhoid risk factors, include: low fibre intake, straining, constipation, age, sex differences and pregnancy.\n\n\n\n\n\n\"If there is a real problem of constipation - and by constipation we mean not going to the toilet often enough - then you really need to get the constipation dealt with by dietary fibre; and discussion with the doctor if that doesn't work. So I'm not sure that it's to do with reading the phones (scrolling on the phone). I think people are reading the phones cause they're sitting there waiting for something to happen and what are they going to do? So it's an interesting study, but I think it's more about sitting on the toilet for too long than it is about scrolling down the phone.\"\n\n\n\n\n\nHow are haemorrhoids diagnosed?\n\n\n\n\n\nExperts say you should firstly visit your general practitioner who will ask you about your symptoms and will examine your anal passage to look for any swollen blood vessels.\n\n\n\n\n\nDr Leong says the GP visit could also be useful in ruling out more serious conditions, including bowel cancer.\n\n\n\n\n\n\"The symptoms of haemorrhoids is non-specific so passage of red blood can be something as benign as a haemorrhoid or it can be something more sinister that includes bowel cancer. So anyone who has got bleeding in the bowel should present to the general practitioner who would perform an external examination. Just by looking can help to confirm haemorrhoids however somebody who has not had sufficient investigations they should have a colonoscopy. So I'm talking about someone who hasn't had a colonoscopy before or now getting in the age group where bowel cancer can be common. Then they should present to a gastroenterologist who can then perform a colonoscopy which is a fixable telescope that goes up the rectum into the bowel to have a good view on the inside. I think that's the true way to exclude something sinister.\"\n\n\n\n\n\nDr Kate MacKrill is gastroenterology psychologist at Middlemore Hospital, and a lecturer at the University of Auckland.\n\n\n\n\n\nShe told the Australian Science Media Centre that smartphone use on the toilet might be disrupting gut-brain communication.\n\n\n\n\n\nShe says the human digestive system is controlled by what's called the enteric nervous system - a neural network within the gastrointestinal tract, which is often described as the body’s second brain.\n\n\n\n\n\nDr MacKrill says sitting on the toilet for longer than you need to might start to change the signals the bowel sends, making the bowel unsure whether it has completely evacuated, leading to abdominal pain, actual constipation, discomfort, and an even longer time sitting on the toilet.\n\n\n\n\n\n\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/what-next-for-the-coalition-after-its-entirely-unedifying-week/asgpia7ch",
        "title": "What next for the Coalition after its 'entirely unedifying week'?",
        "publish_date": "Sat, 13 Sep 2025 20:37:41 +0000",
        "category": "finance",
        "authors": [],
        "text": "The Coalition needs to learn some hard lessons from a fortnight dominated by fallout after Senator Jacinta Nampijinpa Price falsely claimed Labor was prioritising the intake of Indian migrants to boost its vote, experts say.\n\n\n\n\n\nPrice has since been demoted from the frontbench and Opposition leader Sussan Ley has apologised on behalf of the Liberal Party \"to all Indian Australians and indeed others who were hurt and distressed by the comments\".\n\n\n\n\n\nHowever, despite calls from some Indian Australian figures for a direct apology from Price, that has not been forthcoming. She has, however, said her comments were \"clumsy\" and that she \"never intended to be disparaging towards our Indian community\".\n\n\n\n\n\nLiberal senator Jane Hume said there had been \"mishandling on all sides\" and hoped the Coalition would learn from its \"entirely unedifying week\".\n\n\n\n\n\n\"The good news is, we have cauterised the wound,\" she told Seven's Sunrise on Friday.\n\n\n\n\"We are going to move on now and talk about what's important to ordinary Australians,\" Hume said.\n\n\n\n\n\nBut what are the lessons the Coalition should take from this \"unedifying\" episode, and how should they better connect to \"ordinary Australians\"?\n\n\n\n'Acting like a bunch of babies'\n\nRedbridge director of strategy and analytics Kos Samaras said the imbroglio showed the Coalition still hadn't learned important lessons from the last two elections.\n\n\n\n\n\nThe former Labor Party strategist said that, while it's true that Indian Australians do skew towards supporting Labor, the Coalition needed to take a far more constructive approach to dealing with its lack of popularity.\n\n\n\n\n\n\"With the Labor Party, when we were presented with stats about how Labor was struggling with particular constituencies, we did not reject them … we did not demonise the community that was attached to them. We tried to find out ways to fix that problem,\" he said.\n\n\n\n\n\n\"So, instead of acting like a bunch of babies at a creche, perhaps they need to be professional about their profession and work out ways to fix this.\"\n\n\n\nRedbridge's research showed two-party-preferred support for Labor among Indian Australians in the 2025 election was in the \"mid-60s\", Samaras said recently.\n\n\n\n\n\nMeanwhile, new polling from Roy Morgan suggests that, among Indian-born Australians, 45 per cent back the ALP, compared to 39 per cent support for the Coalition.\n\n\n\n\n\nSamaras said the effect of Price's comments could be comparable to former prime minister Scott Morrison's \"ham-fisted approach\" to the Australian Chinese community, which resulted in many voters from that community turning away from the Coalition.\n\n\n\n\n\nAround 48 per cent of Chinese-born Australians now support Labor, while only 34 per cent favour the Coalition, the recent Roy Morgan poll suggested.\n\n\n\n'They don't like us'\n\nWhile many Chinese and Indian Australians had socially conservative values that the Coalition should be able to appeal to, Samaras said, this opportunity had been squandered by a perceived antipathy towards these groups.\n\n\n\n\n\n\"When we interview Indian Australians in particular … they have socially conservative views on a whole range of issues. We say: 'Well then, why aren't you voting for the Liberal Party?' Their answer is: 'They don't like us'.\"\n\n\n\n\n\nHe said to avoid continuing electoral erosion, the Coalition needs to \"embrace the reasons why diverse Australians come to this country in the first place\".\n\n\n\n\n\n\"And that is to start a family, be prosperous and enjoy a peaceful life. They need to understand that that's why most new Australians arrive here, looking for that life, looking for that prosperity,\" he said.\n\n\n\nSuccessful political leaders in Australia understand that elections in Australia are won from the centre, Samaras said, warning that Price's comments seemed to be imported \"from an environment which is all about mobilising and energising your base\".\n\n\n\n\n\nImporting United States-style culture war issues into a country with compulsory voting was bound to fail, Samaras said, \"because you have to actually find out ways to connect with the disengaged, the undecided\".\n\n\n\n\n\nPrice's suggestion that Labor was prioritising groups of migrants who were inclined to politically support them echoes an accusation commonly made by conservative Americans against the Democratic Party.\n\n\n\n'A cautionary tale to get the house in order'\n\nContinuing fracture in the Coalition will also be poorly received by voters, Zareh Ghazaria, a political scientist in the School of Social Sciences at Monash University, said.\n\n\n\n\n\n\"One of the things that we've seen in Australian politics is that once voters get a sense that a political party is divided over policy, over personnel, then they tend to turn away from that party,\" he said.\n\n\n\n\n\nVictoria, where the Coalition has been out of power for over 10 years, provided federal conservatives with \"a cautionary tale to get the house in order\", he said.\n\n\n\n\n\n\"[The Victorian Coalition] has been rife with internal instability, a party that has had debates about its personnel and policy settings, and voters have responded accordingly by not voting for them,\" he said.\n\n\n\nWhile the Liberal Party has always had ideological divisions, Ghazaria said, \"the trick has been for successful leaders to somehow accommodate both strands\".\n\n\n\n\n\n\"The current situation and the current tension between the more progressive and more conservative Liberals has really been amplified by the fact that it suffered such a heavy loss at the last election,\" he said.\n\n\n\n\n\nFollowing the Coalition's disastrous 2025 federal election result, many Coalition figures pushed for a change of direction.\n\n\n\n\n\nOutgoing veteran senator Simon Birmingham called for \"a reshaping of the party to connect it with the modern Australian community\" and explicitly criticised \"judgemental attitudes that exclude or isolate some\".\n\n\n\nOpposition immigration spokesperson Paul Scarr told The Guardian it was a \"profound tragedy\" that Chinese, Indian and other diaspora communities had turned away from the Liberal Party.\n\n\n\n\n\nIn a television interview this week, he again emphasised the importance of ensuring that debate about immigration \"doesn't become a debate about any particular part of the Australian community\".\n\n\n\n\n\n\"When we're talking about these issues, we're talking about failures of government policy.\"\n\n\n\nA 'contest for what the party stands for'\n\nGhazarian also said if the Coalition wanted to have a debate about immigration, it should be \"a debate that focuses on the government's performance\".\n\n\n\n\n\n\"I think we've seen hints of it, where it's been linked to economic prosperity and service delivery,\" he said.\n\n\n\n\n\n\"That provides the Opposition with a platform to demand more from the government to increase investment in infrastructure, to demand investment in service delivery, to demand investment in schools, education, hospitals, and so on.\n\n\n\n\n\n\"That plays to the Liberal Party's strengths, you'd think, in that it focuses on economic management.\"\n\n\n\n\n\n\"I don't think migration was a huge turning point for this election or the previous election. The election was very much focused on cost of living and economic policy,\" he added.\n\n\n\nREAD MORE Accusing others of a woke agenda, Peter Dutton became a victim of his own culture war\n\nThe recent controversy showed the Liberal Party was still in the midst of a \"real contest for what the party stands for,\" Ghazarian added.\n\n\n\n\n\n\"Is the party wanting to potentially portray itself as being a broad party that can represent the interest of all sorts of views in the community, or is it going to seek to pursue much more narrower policy focus, which looks at things like immigration, things like cultural identity, and so on.\"\n\n\n\n\n\nSince demoting Price, Ley has said the Coalition would remodel its policy development processes to seek input from a wider range of voices.\n\n\n\n\n\nShe told The Australian that the Coalition's policy development process would \"evolve throughout the term in response to internal and external feedback, emerging issues, and ongoing engagement with the community\".\n\n\n\n\n\nHowever, Samaras believes the Coalition won't find it easy to shift towards a more centrist policy platform.\n\n\n\n\n\n\"I think the grip that right-wing echo chambers have on the Coalition's membership is strong.\n\n\n\n\n\n\"And I think the Coalition's membership is going to continuously animate their MPs and make it very difficult for the parliamentary wings to completely detach from a form of politics that clearly is not popular in this country.\"\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.theage.com.au/sport/afl/hard-to-recapture-the-passion-afl-announces-return-of-state-of-origin-but-one-footy-state-has-been-snubbed-20250915-p5mv35.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘Hard to recapture the passion’: AFL announces return of State of Origin, but one footy state has been snubbed",
        "publish_date": "Mon, 15 Sep 2025 12:01:44 +1000",
        "category": "sports",
        "authors": [
            "Hannah Kennelly"
        ],
        "text": "State of Origin football will return to the AFL calendar for the first time in 27 years.\n\nAFL chief executive offer Andrew Dillon confirmed on Monday that Western Australia would play Victoria in Perth at Optus Stadium on February 14 next year – the first State of Origin clash since 1999.\n\nAFL CEO Andrew Dillon Credit: AFL Photos via Getty Images\n\n“State football is one of the great traditions of our game, with fans and players alike calling for its return for some time and we are thrilled to see it back,” Dillon said.\n\n“Origin inspires passion, state pride and draws upon years-old rivalries that are central to the history of our game and our very greatest players.”",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/first-climate-risk-assessment-handed-down-in-australia-20250915-p5mv48.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "First climate risk assessment handed down in Australia",
        "publish_date": "Mon, 15 Sep 2025 11:58:44 +1000",
        "category": "finance",
        "authors": [],
        "text": "First climate risk assessment handed down in Australia\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/business/the-economy/trump-s-assault-on-the-fed-has-reached-boiling-point-20250915-p5mv1o.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Trump’s assault on the Fed has reached boiling point",
        "publish_date": "Mon, 15 Sep 2025 11:57:05 +1000",
        "category": "finance",
        "authors": [
            "Stephen Bartholomeusz"
        ],
        "text": "The Miran appointment, while certain to be rubber-stamped by the Republican majority in the Senate, is controversial because he has said he won’t resign from his role as chair of Trump’s Council of Economic Advisers, instead taking an unpaid leave of absence. Miran was nominated to fill the remaining term of former governor Adriana Kugler, who resigned last month, even though her term wasn’t scheduled to end until January 31 next year. It is unclear if he will remain on the board beyond that date. Trump is still trying to fire Cook on the basis of an allegation made on social media that hasn’t been proven and now appears to have been disproved. Credit: AP By remaining a key Trump adviser while serving as a governor, Miran, regarded as the architect of the administration’s more contentious economic policies – including the tariffs and Trump’s efforts to bring the Fed under the administration’s control – would not be an independent in an institution that Congress designed to be independent of politics. Unlike Waller or Bowman, appointed by Trump but not part of the administration (although Waller is on the short list to be the next Fed chair and therefore wouldn’t want to be offside with Trump), he’d clearly be Trump’s main man inside the Fed.\n\nThe Cook affair is also tainted. Trump purported to fire her last month, via a social media post, after the head of the Federal Housing Finance Agency, Bill Pulte, alleged (in a social media post, of course) that she had named two separate properties as her principal place of residence in loan documents, which may have enabled her to borrow more cheaply. Loading She’s not been charged with anything and can only be sacked “for cause,” which is generally thought to mean that the official has done something seriously wrong while in office. The initial judgment that the administration is appealing was that Trump’s justification for firing Cooke didn’t meet the threshold for sufficient cause, in part because the alleged actions occurred before she was a governor. As it happens, what Pulte and Trump have alleged may not even have occurred.\n\nFirst Reuters, and then a string of major media outlets, have said Cook described her second property as “a vacation home,” not as her principal place of residence, in loan documents they have seen. Cook’s lawyers have said any errors in the loan documents, if there were errors, were unintentional and might be the results of clerical errors. If the documents Reuters and others have sighted – which appear to be loan estimates provided by a credit union – exist then, regardless of what the final loan documents showed, the lender would have been aware that the loan was for a holiday home, not as her primary residence. In other words, Trump is still trying to fire Cook on the basis of an allegation made on social media that hasn’t been proven and now appears to have been disproved. The allegations are a pretext to try to open another spot on the Fed board for a Trump appointee. If Trump can gain a majority of the seven-person board, he would then be in a position to remake the FOMC, where the remaining members are the president of the New York Fed and the presidents of four of the Fed’s 12 regional banks, who serve on a rotating basis. The Fed’s board can veto those appointments.\n\nThe White House, with a president who has said he wants the federal funds rate cut by three percentage points, would be able to dictate US monetary policy, ending three quarters of a century of the US central bank’s independence. When the Fed last met, in July, for the first time in more than 30 years there were two governors – Waller and Bowman – who dissented from the majority’s decision to hold rates steady. The interest this week will be in whether Miran, Waller and Bowman, argue for something more than the 25 basis points cut expected. The majority is likely to be conservative – there could be some who argue for rates to remain on hold – because, while the jobs market appears to be shrinking and the unemployment rate is rising, the full effects of Trump’s tariffs are yet to show up in the data. That’s because of the on-off-on way they were implemented, which allowed companies to build up inventories of goods before the tariffs took effect. With the main “reciprocal” tariffs finally going live last month, their impact on prices will progressively show up over the rest of this year and beyond. The worst-case outlook for the Fed is one of stagflation: low economic growth, or even a recession, while the inflation rate remains high. Trump’s trade wars and his immigration policies make it possible that there could be, simultaneously, rising unemployment and rising inflation.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/australia-news-live-polling-shows-support-for-coalition-has-plummeted-to-new-low-kirk-suspect-not-cooperating-with-authorities-says-utah-governor-20250915-p5mv0e.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Australia news LIVE: Polling shows support for Coalition has plummeted to new low; Kirk suspect not cooperating with authorities, says Utah governor",
        "publish_date": "Mon, 15 Sep 2025 11:54:43 +1000",
        "category": "finance",
        "authors": [
            "Emily Kaine"
        ],
        "text": "Climate Change Minister Chris Bowen has defined climate change’s ongoing impact on Australia as “cascading”, “compounding” and “concurrent”, as the government releases the first National Climate Risk Assessment report.\n\n“Cascading. It will get worse. Over time. Compounding its impact on climate change by making other impacts worse. And concurrent, communities will suffer the impacts of climate change in different ways at the same time. And we will have a lot to manage,” Bowen told a press conference in Parliament House.\n\n“One thing that is very clear from this climate assessment is that a whole country has a lot at stake. Every Australian regardless whether they live has a lot at stake. But the report does make clear that some communities have a particular amount of stake,” Bowen said.\n\nThe minister said climate change would particularly impact Queensland, New South Wales, the ACT and Tasmania — as well as those living in regional and rural Australia.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/business/companies/the-guardian-finally-lands-its-new-political-editor-20250915-p5mv3i.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "The Guardian finally lands its new political editor",
        "publish_date": "Mon, 15 Sep 2025 11:51:14 +1000",
        "category": "finance",
        "authors": [
            "Calum Jaspan"
        ],
        "text": "The Guardian has concluded its long-running search for a political editor, promoting its chief political correspondent Tom McIlroy, who joined the outlet this year in the lead up to the federal election.\n\nMcIlroy’s appointment means the Australian outpost of the British newspaper will now begin a search for a new chief political correspondent.\n\nIt also shifts the focus for Guardian Australia after a period of tumult for its Canberra bureau. The political editor position had been vacant after changes to the bureau led to an exodus of its top talent and an internal HR investigation.\n\nFormer Financial Review journalist Tom McIlroy has emerged as The Guardian’s political editor Credit: Oscar Colman\n\nIn late 2024, Canberra-based Guardian staff were interviewed as part of an HR investigation after political editor Karen Middleton made a complaint against the outlet’s chief political correspondent Paul Karp, who lodged a counter-claim against Middleton.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/nrl/southwell-belts-little-sister-in-nrlw-20250915-p5mv40.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Southwell belts little sister in NRLW",
        "publish_date": "Mon, 15 Sep 2025 11:46:09 +1000",
        "category": "finance",
        "authors": [],
        "text": "Southwell belts little sister in NRLW\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/rugby-union/ref-rage-generated-a-crackling-atmosphere-in-sydney-but-it-also-taught-the-wallabies-valuable-lessons-20250914-p5mux8.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Ref rage generated a crackling atmosphere in Sydney. But it also taught the Wallabies valuable lessons",
        "publish_date": "Mon, 15 Sep 2025 11:40:00 +1000",
        "category": "sports",
        "authors": [
            "Iain Payten"
        ],
        "text": "They defended stoutly and got the job done. But even 30 minutes later, a gobsmacked Contepomi couldn’t bring himself to wave it away with an “all’s well than ends well”. “It’s frustrating. I think we don’t deserve that. So I’ve got mixed emotions. It’s very frustrating, because it’s not working. It’s as simple as that. It’s not working. The system, whatever they are doing to get it better, there’s no consistency and it’s not working.” Rounding out the strange day, the Wallabies - the losing team who been caned 14-7 and had every right to pour fuel on the same bonfire - then came in and bit their tongues. Referee Christophe Ridley gestures to Harry Wilson. Credit: Getty Images Showing his years of experience, Joe Schmidt rattled off half-a-dozen things he’d observed but surmised they couldn’t worry about it. It was the wise approach, for a bunch of reasons. Referees are like elephants, and you’ll get them again.\n\nBut it’s fair to say the referee and the match officials, to put it mildly, had a rough day. Ridley is an inexperienced young Test referee and, as can occur, his attempts to stamp authority early on for minor stuff set in motion a game that may have got away from him. He then didn’t stay consistent, which irked the captains, and when new penalties in key moments were found from areas he’d previously ignored - like high shots and obstruction by retreating defenders - the captains’ grumbles spread out and into a very restless home crowd. Santiago Carreras kicks a goal for Argentina. Credit: Getty Images In many ways, it made for brilliant theatre. With a record crowd (post-rebuild), the joint was absolutely rocking. Nothing brings people together more than booing a referee whose calls they don’t agree with. In the end, all the match officials were so rattled they were the only four people in the stadium who missed, or cleared, a blatant forward pass. Even Wallabies players had their hands on their heads, missed-soccer-goal style.\n\nThe game ended in a loss for the Wallabies but oddly enough, the crackling atmosphere was arguably one of the best in years, possibly decades. With unprecedented numbers of people in generations of gold jerseys, old and new, and with lots of kids in the stands, the sense of injustice only served to unite - and amplify - the support. Loading Pubs and restaurants around Paddington and Surry Hills did a roaring trade of post-game analysis. And, also encouragingly, most Aussie fans agreed the end result was the right one. For all the harsh calls on the Wallabies, the Pumas had still been the better side on the day; hungrier and cleaner in most contests, and certainly more physical. The Wallabies mostly had themselves to blame. After getting that dangerous taste of space early - Joseph-Aukuso Suaalii’s fifth-minute try came after the Wallabies had gone backwards with their carrying - the home team then frantically chased even more quick kills.\n\nWallabies players spoke post-game about the need to fix up their discipline, having gone from 10 Tests in two Tests in South Africa to 25 in two clashes with Argentina. And patience and belief in teammates is usually the antidote to cutting penalty counts. But patience also the key to being more clinical, a bit more boring and winning a game like the one at Allianz Stadium. “We’ve been really efficient off our line breaks, but probably the last two weeks we’ve tried to score off those line breaks as opposed to the patience of,” Tate McDermott said. “We’ve got to weigh up whether the risk is actually worth the reward there.” For all the Australian fury at the referee team, the takeaway for the Wallabies is Contepomi was fuming too. Short of World Rugby doing the logical thing and using top Test referees for all top Tests, no matter their nationality (Angus Gardner was wasted as a touch judge in Wellington, for example), rookie refs will inevitably be inconsistent as they build experience.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/property/news/local-buyer-splashes-12-35m-on-tamarama-home-with-a-better-view-20250915-p5mv1q.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Local buyer splashes $12.35m on Tamarama home with a ‘better view’",
        "publish_date": "Mon, 15 Sep 2025 11:37:25 +1000",
        "category": "finance",
        "authors": [
            "Carmen Forward"
        ],
        "text": "An eastern suburbs’ buyer, upsizing in the same suburb of Tamarama, paid $12.35 million for a home with a “better view” at auction on Saturday.\n\nThe five-bedroom, four-storey ocean view property at 27 Carlisle Street drew a crowd of 80 to the house with easy access to the beach.\n\nThree registered, and two actively bid for the home guided at $11.25 million. Bidding opened at $11.5 million and rose in steady increments to $12 million until it sold under the hammer at its reserve of $12.35 million.\n\nThere is no legal requirement for a vendor’s reserve to be in line with their property’s price guide.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/traveller/reviews-and-advice/airline-reviews-a-to-z-of-travellers-expert-flight-tests-20180131-h0r914.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Airline reviews: A to Z of Traveller's expert flight tests",
        "publish_date": "Mon, 15 Sep 2025 11:30:32 +1000",
        "category": "finance",
        "authors": [],
        "text": "Add articles to your saved list and come back to them anytime.\n\nSave this article for later\n\nRemove items from your saved list to add more.\n\nYou have reached your maximum number of saved items.\n\nThis is one of Traveller’s top airlines for 2024. See all stories .\n\nKnow before you go: find your airline in our list of reviews. AP\n\nTaking a flight? Find out what to expect from your seat, service and route with our comprehensive airline reviews. Listed in alphabetical order by airline, aircraft and class.\n\nA\n\nAegean Airlines, Airbus A320neo, economy class\n\nAer Lingus, Airbus A320neo, economy class",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/nsw/so-you-think-trucks-are-taking-over-sydney-street-parking-you-re-not-alone-20250908-p5mtc1.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "So you think trucks are taking over Sydney street parking? You’re not alone",
        "publish_date": "Mon, 15 Sep 2025 11:30:00 +1000",
        "category": "finance",
        "authors": [
            "David Barwell"
        ],
        "text": "Sydney’s biggest motorsport track, and land around Pyrmont’s Fish Markets site, could be turned into overnight truck parking zones in a bid to solve a sharp rise in suburban car park battles unfolding in residential streets.\n\nBold solutions are being considered in response to a citywide shortage of dedicated heavy vehicle parking sites, resulting in more truckies using suburban areas to keep their big rigs at night.\n\nNick Rice, pictured at the Johnstons Transport depot at Marrickville. Credit: Edwina Pickles\n\nIn Blacktown Council LGA alone, the number of resident complaints about trucks illegally parked in residential on-street parking spaces has soared to 2170 in the past financial year – a 43 per cent rise on the previous year.\n\nBlacktown councillor Peter Camilleri said complaints have included gripes about trucks reversing in and out of streets at the crack of dawn, drivers running refrigeration motors “all night”, and leaving behind rubbish, including oil drums, on the sides of roads.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/queensland/iconic-brisbane-party-boat-listed-for-sale-after-years-of-lying-low-20250914-p5muus.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Iconic Brisbane party boat listed for sale after years of lying low",
        "publish_date": "Mon, 15 Sep 2025 11:28:47 +1000",
        "category": "finance",
        "authors": [
            "William Davis"
        ],
        "text": "Years after disappearing from public view, an ageing Brisbane icon has come up for sale.\n\nKookaburra Queen I was one of two similar boats built for World Expo 88. It was a near-constant presence on the Brisbane River for decades, hosting countless parties and tours.\n\nThe vessel is now tethered off Colmslie Beach Reserve at Murarrie, with the last commercial operator closing down in 2022.\n\nThe Kookaburra Queen tethered off Colmslie Beach Reserve at Murarrie in Brisbane appears to be the one now for sale. Credit: William Davis\n\nIt was listed for sale by Grays auction house this month.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/property/news/five-bedrooms-five-bathrooms-seven-figures-luxury-home-sets-suburb-record-20250915-p5mv1t.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Five bedrooms, five bathrooms, seven figures: Luxury home sets suburb record",
        "publish_date": "Mon, 15 Sep 2025 11:04:48 +1000",
        "category": "finance",
        "authors": [
            "Sarah Webb"
        ],
        "text": "A luxury family home with a yoga retreat in one of Brisbane’s most sought-after school catchments has set a suburb record in Upper Mount Gravatt, after seven bidders battled it out in an auction that hit $2.96 million in 10 minutes.\n\nIn front of a crowd of almost 200, the five-bedroom, five-bathroom house at 29 Sunnydale Street sold for a reserve-topping sum almost $1 million more than the suburb’s median, as fears of future property price hikes spark spring buying fever.\n\nFeaturing a meditation zone, an inground pool and a fully-equipped gym on a 647-square-metre block in the Mansfield State High School catchment, the home – designed and built three years ago – had more than 200 inspections throughout the campaign and 25 registered bidders.\n\nBidding started at $2 million and rose in $100,000 jumps until three punters were left standing at the $2.7 million mark.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/lifestyle/life-and-relationships/want-to-raise-good-men-start-with-their-group-chats-20250912-p5muh3.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Want to raise good men? Start with their group chats",
        "publish_date": "Mon, 15 Sep 2025 11:03:43 +1000",
        "category": "lifestyle",
        "authors": [
            "Jenna Price"
        ],
        "text": "You’re in a group chat with your mates. And then one says something so off, you don’t even know how to respond. So you let it go. Then you let it go again.\n\nIt’s a common response, says Jackson Katz, author of the new book Every Man. He is in Sydney this week to deliver a keynote at the fifth World Conference of Women’s Shelters, organised by WESNET, the Women’s Services Network, a national network of specialist domestic and family violence services across Australia.\n\nBut that common response, that moment when you can’t call out your mates, no matter how badly they behave, is partly why Katz and allies devised a new way of being a bystander. And it’s not nearly as terrifying as having to confront your mates.\n\nTeenage boys and young men may want to speak up, but it can be particularly difficult in group settings. Credit: Marija Ercegovac/ digitally altered\n\nThere is, says Katz, a pressure to remain silent just to fit in. It starts at school and gets reinforced, particularly if you are part of what he describes as “cohesive organisational cultures”. Work, sport, it happens everywhere – and it’s strengthened because you are all mates, pals, good guys here.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/property/news/yarraville-vendors-gain-double-payday-as-underbidder-buys-the-home-next-door-20250915-p5mv1r.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Yarraville vendors gain double payday as underbidder buys the new home next door",
        "publish_date": "Mon, 15 Sep 2025 11:02:28 +1000",
        "category": "finance",
        "authors": [],
        "text": "“Then there was a $75,000 attempted knockout bid, which did see one party drop out, followed by a quick succession of more $25,000 bids until it got to $1.45 million when I called it on the market,” said Dardha. “I couldn’t call it any earlier because it was just so hot.” Three active bidders, a mix of young couples and young families, participated, and a young family won. With the townhouse next door also built and owned by the same vendors as the property just sold at auction, Dardha suggested to the two parties who missed out that they inspect it.\n\n“One took me up on the offer, and after we had a look through, they bought that one for $1.39 million,” he said. “And then the other underbidder came up and asked to see it, and I had to tell them it was already sold.” The property was one of 1184 scheduled auctions in Melbourne last week. By Saturday evening, Domain Group recorded a preliminary auction clearance rate of 71.5 per cent from 911 reported results, while 72 auctions were withdrawn. Withdrawn auctions are counted as unsold properties when calculating the clearance rate. In Ascot Vale, a family relocating from nearby Flemington secured the keys to a renovated Victorian terrace for $1.63 million. The home at 47 Kent Street, built in 1890, had a price guide of $1.45 million to $1.55 million, and a reserve of $1,575,000.\n\nFour active bidders, all families looking to upsize, took part in the auction, which was held in the property’s backyard in front of a crowd of about thirty. Loading The bidding opened at $1.5 million and then “went up in $25,000 and $20,000 bids, then slowed down later to $10,000 and $5,000,” said selling agent Adam Hicks from Jellis Craig Kensington. The quality renovations completed 10 years ago, including hydronic-heated polished concrete floors and European appliances, were a drawcard for prospective buyers. “The renovation was of a high standard and completed by a well-respected local builder,” said Hicks.\n\nThe property last sold in 2013 for $750,000, records show. Meanwhile, in Ferntree Gully, a first-home buyer paid $952,000, $112,000 over the reserve, for a three-bedroom home with dual street access. The updated home at 7 Scenic Court, on a corner block of 683 square metres, had a price guide of $780,000 to $840,000 and a reserve of $840,000. Three active bidders – a mix of first home buyers and a young couple - participated in the auction, which opened at $730,000.\n\n“The second bid of $120,000 brought it up to $850,000 and put it officially on the market,” said lead agent and auctioneer, Matt Morris from Ray White, Ferntree Gully. Loading Morris said a bidder dropped out after this bid, leaving two others to go back and forth until it was sold, with the knockout bidder, a first-home buyer, successful. “The new owner took my advice of pretending to have more money than you actually do,” Morris said. Morris said that the buyer wanted to purchase a property before October 1st.",
        "source": "TheAge"
    }
]