[
  {
    "url": "https://www.9news.com.au/national/gold-coast-seaway-rescue-father-and-son-boat-capsizes-during-powerful-swell-in-queensland/baf1a3c6-a76a-4c9b-950b-407d9ab48080",
    "title": "Windscreen crashes on dad as boat capsizes during powerful swell",
    "publish_date": "Sat, 19 Apr 2025 12:02:58 +0000",
    "category": "finance",
    "authors": [
      "Apr"
    ],
    "text": "A second boat has capsized off the Gold Coast Seaway in as many days after a father and son were smashed by a powerful swell.\n\nA volunteer marine rescue crew was nearby and responded to the mayday call from the stranded swimmers within a minute today.\n\nThe crew found the vessel submerged and significantly damaged.\n\nREAD MORE:﻿ Three rescued after boat capsizes off Gold Coast beach\n\nA second boat has capsized off the Gold Coast Seaway in as many days after a father and son were smashed by a powerful swell. (9News)\n\n\"It could be $50,000 or $60,000 worth of damage, \" coast guard David Tapsall said.\n\nThe father suffered facial injuries when the wave sent the windscreen crashing down on him.\n\nHe was treated by paramedics at VMR Southport.\n\nThe boat was eventually pulled from the deep blue and towed back to the Coastguard where the rescued boatie is a member.\n\n\"﻿The skipper on our response boat that went out to assist and the child that was on the boat said 'g'day pop',\" Tapsall said.\n\n\"It happened to be his son and grandson.\"\n\nThe father suffered facial injuries when the wave sent the windscreen crashing down on him. (9News)\n\nThe incident is the second serious rescue in as many days in the same spot as yesterday's capsize where three people were thrown overboard.\n\nThe aftermath of ex-tropical Cyclone Alfred has made the bar at the seaway treacherous coupled with a massive swell.\n\nConditions over the Easter long weekend remain dangerous and authorities are urging boaties to heed the message.\n\n\"Please listen to the forecast,\" Tapsall said.",
    "source": "9News",
    "cluster_id": 0
  },
  {
    "url": "https://www.9news.com.au/national/aurelio-costarella-death-australian-fashion-designer-dies-aged-60/b1fd902a-1f83-4993-a4c7-bd0ab62d0b19",
    "title": "Australian fashion designer Aurelio Costarella dies aged 60",
    "publish_date": "Sat, 19 Apr 2025 12:06:58 +0000",
    "category": "lifestyle",
    "authors": [
      "Apr"
    ],
    "text": "TV personalities, models and members of the fashion world have paid tribute to renowned Australian fashion designer Aurelio Costarella, who has died at the age of 60.\n\nThe self-taught fashion guru's designs featured on runways across Australia, London, Paris and New York.\n\nCostarella had been battling a rare brain disease before his death.\n\nCostarella had been battling a rare brain disease before his death. (Don Arnold/WireImage)\n\nCostarella \"peacefully left this world this morning to begin his journey to a new one\" the announcement on social media told friends and followers.\n\n\"Sending love to all whose hearts he had touched.\"\n\nFellow Australian fashion designer Toni Maticevski shared his shock with a comment on the post.\n\n\"Oh no. Dear Aurelio rest in peace dear friend,\" he wrote.\n\nHe wasn't the only one paying tribute.﻿\n\n\"How terribly sad,\" The Block 's Shaynna Blaze commented. \"Such a talent that we all adore seeing his framing the celebration of women.\"\n\nAustralian model Kate Peck also shared her thoughts on the \"devastating\" news.\n\n\"I have one of your paintings hanging on my wall. Forever in my heart and my house,\" she wrote to him.\n\nComedian and TV personality Julia Morris has worn dresses by the designer and remembered him fondly\n\n\"I am so very sad and sorry to hear this news,\" she said.\n\n\"From fittings in the early mid 90's to Logies gowns over the years… Aurelio was a brilliant and generous artist and designer but even more so, a gentleman of note.\"\n\nCostarella's designs were worn by trailblazers in their own right including Rhianna, Tyra Banks, Dannii Minogue and Julia Gillard.\n\nCostarella's designs have been featured on runways in London, Paris and New York. (Donato Sardella/WireImage for Tourism Australia)\n\nThe Perth-born designer was a reflection of many immigrant families.\n\nHis father came to Australia in 1956 with a suitcase and $20, where he worked for four years to earn enough money to bring his family over.\n\nInspired by his mother, Costarella sewed his first garment at the age of 10 before he later became a household name and global success.\n\nHis designs featured on runways in London, Paris and New York, which he achieved without moving away from Australia.\n\nIn addition to his achievements in the ﻿fashion world, Costarella became a proud ambassador for Lifeline WA, after he was diagnosed with depression and anxiety.",
    "source": "9News",
    "cluster_id": 1
  },
  {
    "url": "https://www.9news.com.au/world/vegemite-canada-cafe-owners-can-serve-classic-australian-spread-after-backflip-from-authorities/b3e86611-2684-4f54-b5a1-0c63e83a735d",
    "title": "Aussie expat celebrates Canada's Vegemite backflip",
    "publish_date": "Sun, 20 Apr 2025 00:08:00 +0000",
    "category": "finance",
    "authors": [
      "Apr"
    ],
    "text": "A﻿n Australian expat running a cafe in Canada is celebrating after being given the green light to serve Vegemite after a brief ban on the pantry staple.\n\nAustralian-Canadian cafe owner Leighton Walters was ordered to stop selling the spread due to the added vitamin B in the product , which goes against Canada's food regulations.\n\nNow, he's speaking out after the Canadian Food Inspection Agency (CFIA) yesterday ruled Walters can serve Vegemite in his Toronto cafe – and he has Prime Minister Anthony Albanese to thank for it.\n\nLeighton Walters said the PM \"opened doors\" for him to reverse the CFIA decision. (9News)\n\n\"﻿This is a massive win for us as a small business. We are so proudly Australian and we are so grateful to every single one of you that gave us words of encouragement and support,\" Walters told Today this morning.\n\n\"This little thing,\" he added, holding a jar of Vegemite.\n\n\"Who would have thought it would be such a massive point of contention?\"\n\nThe fight to keep serving Vegemite was aided by Albanese, who Wa﻿lters said \"opened doors\" for the CFIA to backflip on its ruling.\n\n\"Of course the PM did a fantastic job kind of opening doors, getting it in the conversation and honestly, as an Aussie expat on the other side of the world, just building their dream coffee shop it's very easy to feel far from home,\" he added.\n\nWalters joked he was glad he wasn't going to jail over a little jar of Vegemite. (Today)\n\nThe added vitamin B in Vegemite goes against Canada's food regulations. (Nine)\n\n\"And so this whole experience has basically made me feel right at home all over again. It's given me a taste of Aussie culture that you guys actually care about us.\"\n\nWalters said he has received hundreds of messages from fellow expats who also wanted a taste of home in Canada.\n\nThe most popular Vegemite-infused cafe treat are his cheesy scrolls.\n\n\"We sell thousands of them every month, and so we're glad that we're not going to go to jail for serving them,\" Walters laughed.\n\nAlbanese earlier described the food authority's latest decision as \"a win for Australian industry\".\n\nPrime Minister Anthony Albanese said the development was \"a win for Australian industry\". (Alex Ellinghausen)\n\n\"It's also a win for those people in Canada who get to enjoy this wonderful product that is so much a part of Australian culture and indeed, Australian pride as well,\" Albanese said.\n\n\"I can report after the discussions that my government has had with the Government of Canada, and I want to thank (Canadian Prime Minister) Mark Carney and his office and his team for ensuring that the Australian cafe owner Leighton Walters can once again have Vegemite back in his cafe, back on the agenda.\n\n\"Happy Easter to all those happy little Vegemites out there.\"",
    "source": "9News",
    "cluster_id": 2
  },
  {
    "url": "https://www.9news.com.au/national/queensland-man-falls-off-cliff-first-date-hike-sunshine-coast-mount-beerwah/413ce176-a49d-4482-8acf-a790eb5fdb69",
    "title": "Man slips off Queensland cliff in first date disaster",
    "publish_date": "Sat, 19 Apr 2025 20:29:32 +0000",
    "category": "lifestyle",
    "authors": [
      "Apr"
    ],
    "text": "A man is recovering in hospital following a death-defying first date in the Glasshouse Mountains in Queensland .\n\nThe climber plunged 30 metres, sparking a major emergency rescue , which all unfolded in front of the girl he was trying to win over.\n\nScenes that should have resembled a rom-com quickly turned into an action film, after the first date took an unlikely turn on the Sunshine Coast.\n\nREAD MORE: Windscreen crashes on dad as boat capsizes during powerful swell\n\nA man is recovering in hospital following a death-defying first date in the Glasshouse Mountains. (9News)\n\nThe pair set off for a romantic Easter weekend hike yesterday, free-climbing the rock face, until the 27-year-old man slipped, falling 30 metres down Mt Beerwah.\n\n\"Yeah, quite a significant fall and mechanics of injury are high,\" Queensland Fire Department's Luke Champman told 9News.\n\nIt isn't what falling head over heels is supposed to look like, with his fall leading to a multi-agency response, with emergency crews scaling cliffs with gear in hand.\n\n\"They were able to package the patient in conjunction with QAS (Queensland Ambulance Services) and move him to a location that was suitable to be winched/extricated by a helicopter,\" Champman said.\n\nThe hiker was found unresponsive, suffering severe head and pelvic injuries.\n\n\"He's really lucky,\" Jeff Bradfield from Queensland Ambulance Services told 9News.\n\nThe climber plunged 30 metres, sparking a major emergency rescue, which all unfolded in front of the girl he was trying to win over. (9News)\n\nHis date lent a hand to first responders, as a rescue helicopter flew in and winched him to safety. (9News)\n\nA group of army reserves on a training walk witnessed the man fall, rushing to the bottom of the cliff to help.\n\n\"They were able to render first aid pretty much immediately to the casualties and provide us good location details,\" Champman said.\n\nHis date lent a hand to first responders, as a rescue helicopter flew in and winched him to safety.\n\nShe's now by his side at the Royal Brisbane and Women's Hospital, where her date is in a stable condition, receiving treatment for his injuries - and, perhaps, a bruised ego.",
    "source": "9News",
    "cluster_id": 3
  },
  {
    "url": "https://www.9news.com.au/national/easter-long-weekend-weather-forecast-2025-state-by-state-guide-australia/9dc372c8-4492-461a-b89c-84c6bc4f11b6",
    "title": "Warm weather and showers in almost every state and territory over Easter long weekend",
    "publish_date": "Fri, 18 Apr 2025 23:47:01 +0000",
    "category": "finance",
    "authors": [
      "Apr"
    ],
    "text": "Almost every state and territory is expected to get some rain this Easter long weekend, but temperatures will stay mostly warm over the break.\n\nWhile some states will start the weekend with clear skies, others will be subject to cloudy storm conditions. ﻿\n\nHere's what the weather will be like around the country across the Easter long weekend.\n\nWhile some states will start the weekend with clear skies, others will be subject to cloudy storm conditions. ﻿ (Getty Images/iStockphoto)\n\nNew South Wales\n\nSydney residents are experiencing a sunny top of 29 degrees today.\n\nConditions on Easter Sunday will be similar, with a maximum temperature ﻿forecast of 29 degrees.\n\nThe city could be in for showers on Monday, with up to 10mm of rain possible, according to the Bureau of Meteorology.﻿\n\nREAD MORE: When shops will be open and closed this Easter around the country\n\nSydney residents can expect sunny conditions on Saturday with a chance of light winds. (Getty)\n\nAustralian Capital Territory\n\nSimilar weather is occurring in Canberra.\n\nToday is a sunny top of 26 degrees with light winds.\n\nThere is a medium chance of showers forecast for tomorrow, most likely during the evening, however, temperatures will stay warm and sunny for most of Easter Sunday.\n\nCanberra residents can expect a partly cloudy day on Monday with a high chance of showers.﻿\n\nThere is a medium chance of showers in Canberra on Easter Sunday﻿, most likely during the evening. (Getty)\n\nQueensland\n\nStarting off with a sunny top of 29 degrees today, Brisbane is set to see sunny conditions over the long weekend.\n\nThere's a small chance of this afternoon, but no rain is forecast.\n\nTomorrow will be sunny with tops of 29 degrees with a slight chance of rain.\n\nTemperatures will remain high on Monday, with a slight chance of showers on Monday afternoon.\n\nVictoria\n\nMelbourne residents are experiencing a warm and sunny top of 28 degrees today.\n\nThey can expect a cloudy day tomorrow with a very high chance of showers and potentially thunderstorms. Temperatures will stay high at 26 degrees.\n\nTemperatures will drop to 20 degrees on Easter Monday but showers are expected to continue.﻿\n\nThere is a high chance of rain in Melbourne on Sunday and ﻿temperatures up to 25C. (Getty)\n\nSouth Australia\n\nIt's cloudy in Adelaide today, with the city experiencing a top of 29.\n\nThere's wet weather this afternoon and into the evening with the chance of a thunderstorm.\n\nA partly cloudy day is expected tomorrow ﻿with a very high chance of showers and maximum temperatures of 20 degrees.\n\n﻿Monday will be partly cloudy with a high chance of showers.\n\nTasmania\n\nHobart will also experience wet weather over the long weekend.\n\nThere is a high chance of showers today, most likely in the evening.\n\nThis will continue into tomorrow with 6mm expected in the morning.\n\nOn Monday the weather will be partly cloudy with a medium chance of showers and light rain in the evening.\n\nDarwin will see a weekend of cloudy but hot weather. (Leigh Henningham)\n\nNorthern Territory\n\nDarwin will see a weekend of rain with the chance of thunderstorms.\n\nToday temperatures will reach up to 33 degrees with the chance of a thunderstorm in the afternoon.\n\nResidents can expect a maximum temperature of 32 degrees tomorrow with possible thunderstorms.﻿\n\nThe city is in for a partly cloudy day with a chance of showers on Monday.\n\nWestern Australia\n\n﻿Perth residents can expect a long weekend with sunny and warm weather, and a top of 23 degrees today and 24 degrees tomorrow.\n\nSunny conditions ﻿will continue on Sunday and Monday with a slight chance of showers.",
    "source": "9News",
    "cluster_id": 4
  },
  {
    "url": "https://www.9news.com.au/national/australians-predicted-to-spend-billions-of-dollars-on-food-travel-and-entertainment-over-easter-long-weekend/f2499758-e7e3-4166-8b3d-b82b0b61acf0",
    "title": "Australians predicted to spend $4.8 billion over the Easter long weekend",
    "publish_date": "Fri, 18 Apr 2025 10:01:28 +0000",
    "category": "finance",
    "authors": [
      "Apr"
    ],
    "text": "Amid a cost-of-living crisis, Australians are still predicted to spend big this Easter.\n\nShoppers are expected to part with $4.8 billion on food, travel and entertainment over the long weekend.\n\nAlmost half of Australians plan to indulge in Easter chocolate, spending about $68 each or a national total of more than $700 million on confectionery alone, according to Australian Retailers Association and Roy Morgan research.\n\nAustralians are expected to spend $4.8 billion on food, travel and entertainment over the Easter long weekend. (Edwina Pickles)\n\nEaster eggs and bunnies have not been budget friendly after cocoa prices recently reached an all-time high, although the cost has dipped slightly in recent months.\n\nFresh fish, scallops, oysters and salmon will also be on the menu for some households.\n\nAbout 36 per cent of grocery buyers said they have regularly bought seafood in the previous four weeks but over Easter that jumps to 42 per cent or an extra 500,000 buyers.\n\nAustralians with lamb on their shopping lists can expect to pay more with prices up 20 per cent since last year, according to the Australian Bureau of Statistics.\n\nDemand for last-minute chocolate eggs will be high this weekend, with Orthodox Easter falling on the same Sunday this year.",
    "source": "9News",
    "cluster_id": 5
  },
  {
    "url": "https://www.9news.com.au/national/pilot-speaks-out-after-near-death-crash-at-avalon-airshow/62663ea8-7fa0-40af-9d79-d8d44b694ac2",
    "title": "Pilot speaks out after friend's near-death crash at Avalon Airshow",
    "publish_date": "Fri, 18 Apr 2025 10:22:07 +0000",
    "category": "finance",
    "authors": [
      "Apr"
    ],
    "text": "Three weeks after almost dying in a stunt plane crash at Avalon, veteran pilot Glenn Collins has \"beaten the odds\" and is on the road to recovery.\n\nHis team is now preparing for more airshows and a special aerobatic gesture to honour their mate.\n\nFriend Paul Bennet is getting ready for an extra special performance next Sunday in the NSW Central West.\n\nFriend Paul Bennet is getting ready for an extra special performance next Sunday in the NSW Central West. (9News)\n\nThe skies above Mudgee will be filled with love to send a message 900 kilometres away to their mate in Melbourne.\n\n\"We'll do a love heart in the middle and dedicate it to Glenn Collins and his family,\" Bennet said.\n\nCollins was left in a critical condition when his stunt plane crashed at the Avalon Airshow three weeks ago.\n\nBennet's team is now preparing for more airshows and a special aerobatic gesture to honour their mate. (9News)\n\nBennet was in the sky with Collins at the time.\n\n\"I still didn't realise, I don't think the other guys did either,\" Bennet said.\n\n\"We obviously had to get back together, so check one, check two, check three, check four.\n\n\"I got two and three and I didn't get four.\"\n\nCollins was in an induced coma for a week with horrific injuries to his spine and legs, but he has pulled through.\n\n\"He's beaten the odds at the moment and we're stoked about it,\" Bennet said.\n\nREAD MORE: When shops will be open and closed this Easter around the country\n\nPilot Glenn Collins crashed during a demonstration flight at Avalon International Airshow in Victoria (9News)\n\nCollins remains in hospital where he continues his recovery.\n\nWhile it is a long road ahead, there is hope one day the veteran pilot will take to the skies again.\n\n\"Hopefully he gets back in a plane,\" Bennet said.\n\n\"It's been amazing and the support has been sensational for everyone and especially Glenn and his family.\"\n\nThe cause of the crash remains under investigation.\n\nThe focus for Collins' team is to put on a spectacular show.\n\n\"He doesn't want us to stop, he wants us to get going and almost pretend nothing ever happened,\" Bennet said.\n\n\"He's really pulled through a miracle, hasn't he?\"",
    "source": "9News",
    "cluster_id": 6
  },
  {
    "url": "https://www.9news.com.au/national/why-morgan-cox-has-staged-a-protest-outside-of-the-prime-minister-anthony-albaneses-home-on-the-new-south-wales-central-coast/77e465ae-0765-4770-b990-b404f660a8a9",
    "title": "Sydney father stages a protest outside the prime minister's home",
    "publish_date": "Fri, 18 Apr 2025 10:47:55 +0000",
    "category": "finance",
    "authors": [
      "Apr"
    ],
    "text": "A protester has pitched a tent outside of ﻿Prime Minister Anthony Albanese's home on the NSW Central Coast to draw attention to the national housing crisis.\n\nMorgan Cox says he was forced to move out of Sydney with his family due to soaring rent costs.\n\nThe father of a one-year-old now lives in Gosford, which is about half an hour from the $4.3 million﻿ clifftop mansion the prime minister purchased late last year and has rented out.\n\nA protester has pitched a tent outside of ﻿Prime Minister Anthony Albanese's home to raise awareness of the housing crisis. (2GB)\n\nCox gained national attention on ABC's Q&A program in March when he ﻿told the panel his rent in Sydney had increased by $180 a week, which equated to almost $10,000 a year and was unaffordable for his family despite working two jobs.\n\n\"I tried to find a cheaper place and there just aren't any,\" he told the ﻿studio audience.\n\n\"What little is available, there's dozens of people lined up.\"﻿\n\nCox fears that rental prices will continue to rise and tenants will be \"in a world of pain\" without urgent reform.﻿\n\nHe told 2GB this morning he wanted to stage a protest on behalf of everyone affected by the rental crisis.\n\n\"I'm just trying to send a message to the government that they really need to listen to us,﻿\" he said.\n\nCox gained national attention on ABC'S Q&A program in March when he ﻿told the panel his rent in Sydney had increased by $180 a week. (ABC)\n\n﻿\"If rents really go up anymore, we're going to be in a world of pain.\"\n\n﻿Among the solutions, he suggested Australia follows Canada's lead to reduce immigration to address the housing supply numbers.\n\n\"I'd like them to manage immigration to a level we can sustain that's not forcing people out of homes,\" he said.\n\n\"I'm not against immigration, my partner is an immigrant but that'd be a great one.\n\nPrime Minister Anthony Albanese purchased a $4.3 million home on the NSW Central Coast. (Matt Roberts/ABC)\n\n\"That'd give us some breathing room to talk about other things.\"\n\nHe also suggested tax reform and greater investment by universities into student housing.﻿\n\nCox said he would welcome a conversation with any politician to discuss solutions to the problem.\n\n\"I'm really hoping politicians of any stripe will reach out to me,\" he said.\n\n\"I don't particularly favour one or the other, I just want them to listen to us, I want us to be heard.\"﻿",
    "source": "9News",
    "cluster_id": 7
  },
  {
    "url": "https://www.9news.com.au/national/easter-long-weekend-2025-can-you-buy-alcohol-good-friday-easter-sunday-explainer/326f1cd3-f646-495e-a540-c397d699e554",
    "title": "Where you can and can't buy alcohol today and over Easter",
    "publish_date": "Fri, 18 Apr 2025 01:42:05 +0000",
    "category": "finance",
    "authors": [
      "Apr"
    ],
    "text": "Many Australians love a drink or two over the Easter holidays , but the country's liquor trading laws restrict what can and can't be sold over the long weekend.\n\nGood Friday and the Easter weekend are some of the only days of the year that have specific restrictions on alcohol sales.\n\nIf you're in the mood for a tipple, here are the best options and what you need to know.﻿\n\nMost states will see restrictions on trading hours for alcohol purchases across venues and retail outlets. (AAP)\n\nNew South Wales\n\nOn Good Friday there is a blanket ban on all takeaway sales, whether you want a bottle from a shop, pub or restaurant - which means most liquor retail outlets will be closed in New South Wales.\n\nMost licensed premises will offer﻿ drinks in-house on Good Friday, though for some you may need to sit down with a meal.\n\nSaturday ﻿will see regular trading hours for licensed premises and retail outlets.\n\nOn Easter Sunday normal trading hours resume for licensed premises but most retail outlets will be restricted again and closed.\n\nVictoria﻿\n\nSimilar to New South Wales, Good Friday closes bottle shops unless specifically permitted otherwise.\n\nOn-premise purchases are allowed﻿ and will be offered at venues, restaurants and cafes.\n\nVenues are generally allowed to top up your glass from noon, but if your local go-to is a brewery or a distiller, you can head over at 10am.\n\nIt's safe to say regular trading hours resume Easter Saturday and Sunday - ﻿ Victoria's liquor laws don't mention any particular restrictions.\n\nREAD MORE:﻿ When shops will be open and closed this Easter around the country\n\nSome states will require you to have a 'sit-down' meal in order to purchase a drink on the venue. (A Current Affair)\n\nQueensland\n\nSimilar to Victoria, ﻿Good Friday affects trading hours of licensed premises in Queensland.\n\nTakeaway alcohol can't be sold, so retail outlets will be closed.\n\nHowever, you can buy drinks at venues from 10am to midnight, but only with a sit-down meal - as per the state government's website .\n\nThey even go as far to specifically tell us what a meal is.﻿\n\n\"A meal is food that can be eaten with cutlery while seated— for example, roast beef with vegetables\"\n\n\"It is not light takeaway food like snacks, hot chips, an entrée or kid's meal.\"\n\nRegular trading hours resume Easter Saturday, Sunday and Monday.\n\nREAD MORE: Almost every state and territory is expecting rain over Easter long weekend\n\nSouth Australia\n\nAfter legal reforms several years ago, South Australia has had all alcohol sale restrictions lifted.\n\nCurrently, South Australia has no restrictions on the sale of alcohol on Good Friday, and for the rest of the weekend.\n\nThis means venues can choose to be open over the weekend for purchases and takeaways.\n\nWestern Australia﻿\n\nIn the west of the nation, ﻿liquor stores will be closed on Good Friday.\n\nHowever, people will be allowed to have a Good Friday drink﻿ with a meal in most clubs, hotels, pubs, and restaurants.\n\nClubs will remain open until 3am.﻿\n\nRegular trading hours resume for the rest of the weekend.﻿\n\nSaturday will see regular trading hours across the country. (Nine)\n\nNorthern Territory﻿\n\nTakeaway sales are restricted on Good Friday.\n\nYou can still buy drinks at venues like restaurants, bars and clubs between 11am to 9pm so long as you buy a full, sit-down meal as well.﻿\n\nNo finger foods, sandwiches and pies for those bargaining for a drink too - the territory's website says.\n\nAustralian Capital Territory\n\n﻿For the territory where you can find the federal government, you would expect there to be harsher restrictions over the quiet, long weekend.\n\nBut patrons can keep partying over the weekend as there are no restrictions on alcohol sales or trading hours﻿ on Good Friday.\n\nTasmania﻿\n\nThe Apple Isle ﻿will see an equally, loosely restricted Easter weekend.\n\nTasmania remains much the same with no restrictions on sales or trading hours over the long weekend.﻿",
    "source": "9News",
    "cluster_id": 8
  },
  {
    "url": "https://www.9news.com.au/national/federal-election-2025-negative-gearing-capital-gains-tax/df15d235-07b5-4b5e-a952-a28db713befb",
    "title": "Election war of words erupts over $180b tax break for investors",
    "publish_date": "Thu, 17 Apr 2025 19:22:02 +0000",
    "category": "finance",
    "authors": [
      "Apr"
    ],
    "text": "A﻿n election war of words has broken out over negative gearing and the capital gains tax discount as new data reveals the multibillion-dollar cost of the tax breaks.\n\nVoters are split over the controversial concessions and both major parties have been grilled over their plans this federal election.\n\nWhile the Greens have lobbied hard for a reform﻿ and leader Adam Bandt blamed the capital gains discount for the housing crisis, Prime Minister Anthony Albanese and Opposition Leader Peter Dutton have denied there will be any changes made to either.\n\nPeter Dutton said during the second debate that cutting negative gearing would hurt renters. (James Brickwood)\n\nReports first emerged last year that federal Treasury had investigated a potential overhaul of the tax concessions awarded to property owners.\n\n\"It certainly wasn't commissioned by us to do so,\" the PM said when asked during the second debate on Wednesday night about the Treasury modelling.\n\nBut Treasurer Jim Chalmers had publicly stated back in September that he asked Treasury for \"advice\" about the subject, leading Dutton to claim in the debate that Albanese had a \"problem with the truth\".\n\nChalmers yesterday sought to strike a clear difference between that advice and \"modelling\".\n\n\"I've said on a number of occasions now that I sought a view,\" Chalmers said.\n\n\"Now that's different to commissioning modelling. The prime minister was asked about commissioning modelling. I sought a view.\"\n\nChalmers said it was \"normal practice\" to seek advice on such a matter and that the Treasury's view was a change to negative gearing \"wouldn't get the sort of improvement that we desperately need to see in our economy when it comes to supply\".\n\nPrime Minister Anthony Albanese was accused of lying over the Treasury's move to seek advice on negative gearing. (Alex Ellinghausen)\n\nHe said Labor was \"not proposing any changes in this area\".\n\n﻿Shadow treasurer Angus Taylor claimed Albanese \"lied\" about plans to raise housing taxes during the debate.\n\n\"The prime minister last night denied his government had modelled negative gearing changes. The treasurer confirmed in September it had,\" Taylor said.\n\n\"The prime minister lied to the Australian public on camera about his hidden plans to raise taxes on housing.\"\n\nDutton argued cutting negative gearing would worsen the rental market.\n\n\"I have stated very clearly, we want a sustainable housing market, which includes rental stock,\" the opposition leader when debate moderator David Speers asked why his party wouldn't change the capital gains tax discount or negative gearing.\n\n\"If you want to cut out negative gearing, as the Labor Party and the Greens would love to do, you will stop investment taking place for properties that are ultimately rented by young Australians.\"\n\nGreens leader Adam Bandt said the Greens would reform tax concessions for investors. (Alex Ellinghausen)\n\nREAD MORE: When shops will be open and closed this Easter around the country\n\nA report released today by parliament revealed the cost of revenue forgone due to both negative gearing deductions and capital gains discounts was $11.9 ﻿billion in the 2024/25 financial year.\n\nIt's estimated the combined cost will reach $180.5 billion over the next 10 years from 2026/27 until 2035/36.\n\nGreens spokesperson for housing and homelessness Max Chandler-Mather said the Greens would work to abolish \"massive tax handouts\" for property investors.\n\n\"The Greens will right the wrongs of decades of housing failure and end the tax handouts for investors with more than one investment property that are turbocharging house prices and denying renters the chance to buy a home,\" Chandler-Mather said.\n\n\"How is it fair that a young family loses at an auction to an investor buying their 10th property because that investor has massive tax handouts from the government?\"\n\nFormer prime minister Malcolm Turnbull said in a post on X that negative gearing is \"examined by every government\".\n\n﻿\"It is a major tax concession and always contentious and so it is always looked at – what does it cost?\" Turnbull said.\n\n\"What would particular changes mean in terms of revenue and housing affordability.\"",
    "source": "9News",
    "cluster_id": 9
  },
  {
    "url": "https://www.abc.net.au/news/2025-04-20/sydney-comedy-festival-2025/103519414",
    "title": "A sparky, a therapist and a rich kid walk into the Sydney Comedy Festival…",
    "publish_date": "Sun, 20 Apr 2025 01:36:43 +0000",
    "category": "finance",
    "authors": [],
    "text": "John Cruckshank is an electrician. A real one, who knows how to wire your home or business. And he's still on the tools, despite also being a comedian.\n\n\"I've sort of just merged everything in my life into one thing,\" Cruckshank said.\n\n\"I just kind of wake up and I'm like, 'Oh, what have I got to do today?' And it's like, 'Oh, I gotta put a power point in for someone or something and then come here at night and do this.'\"\n\nSpeaking to ABC News after stepping off stage at a Sydney Comedy Festival sampler event ahead of the official start to the festival on Monday, Cruckshank says there's plenty to laugh at while he's carrying out his sparky duties.\n\n\"I mean, you don't always have the answers,\" he said.\n\n\"People will be like, 'Oh, how do you save money on hot water?' And I'll be like, 'have you tried getting sunburned?'\n\nCruckshank will hit the Sydney Comedy Festival circuit. (Supplied)\n\n\"It's kind of good to be out in the world a bit and people respect the trades a lot more in Australia than the arts, I can tell you that, in terms of payment and things like that.\"\n\nWhy Anisa Nandaula swapped a six-figure day job for the stand-up stage Photo shows A woman in a red sweater smiles at the camera. After years of doing three gigs a night, Ugandan-born, Brisbane-based comedian Anisa Nandaula was finally able to follow her passion right to the Melbourne International Comedy Festival.\n\nCruckshank certainly draws inspiration from his life as an electrician in his comedy. Redfern Electrical is what he calls his business, but it's also the title of a mockumentary in which he sends up his trade.\n\nHis goal is to get funding to take the series from YouTube to a television screen or streaming service near you, perhaps tipping the vocational scales in favour of comedy.\n\nBut that doesn't mean he'll necessarily give up his day job altogether.\n\n\"I like just doing a mix of both,\" he says.\n\n\"Autonomy is the key to life.\"\n\nFinding the humour in mortality\n\nIndian comedian Daniel Fernandes also finds humour in his day-to-day life.\n\nDaniel Fernandes flew in from India for the Sydney Comedy Festival. (Supplied: Ashley Mar)\n\nHe has an MBA, and he is the business.\n\n\"I am the brand,\" he told ABC News at the same Sydney Comedy Festival event.\n\n\"I am the product, I'm the CEO, I'm the accountant and the janitor and also [the] therapist. I am my own therapist.\"\n\nFernandes is able to find humour in places others don't, like mortality.\n\n\"For me, I find my humour in places where people feel afraid,\" he said.\n\n\"So, the show that I'm doing at the festival right now is one hour on death.\n\n\"And I talk about losing my father and what death means to me and what it means to everyone else, and it's something that we don't think about often, because nobody wants to think about death but it's going to happen to all of us.\n\n\"I've always found humour in the darkest places — the places that I find myself and the audience being a little fearful — because I've understood that if you can laugh at something that scares you, it doesn't scare you that much anymore.\"\n\nThe festival kicks off on Monday, April 21, and runs until Sunday, May 18. (Supplied: Ashley Mar)\n\nFernandes has been travelling to Australia to perform at festivals for the past seven years, and says he gets his sense of humour from his late father, who wholeheartedly supported his career.\n\n\"When I was a kid, and my dad was my age, he was the comedian of the family, and he was always making people laugh,\" Fernandes said.\n\n\"Anywhere we went, there was laughter around him, so I just took it up a few notches.\"\n\nPlenty of laughs in growing up rich\n\nRussian comedian Olga Koch also leans into topics that make her uncomfortable and it just so happens one of those is growing up rich.\n\nOlga Koch comes from money and privilege and isn't afraid to poke fun at herself. (Supplied: Rachel Sherlock)\n\n\"It was an extremely privileged upbringing,\" Koch told ABC News.\n\n\"The biggest catalyst there was that it was right after the Soviet Union fell apart.\n\n\"So, not only was my privilege apparent, it was also very sudden and it also happened with the backdrop of an entire country going through turmoil, so I think I try to articulate every layer of that in my show.\"\n\nYour favourite comedian's favourite comedian Photo shows Luke McGregor stands in front of a pink background, awkwardly doing a thumbs up With practically countless comedy acts descending on Australia for comedy festivals, it can be impossible to know where to start. We asked our favourite comedians for their top picks.\n\nKoch's father Alfred was deputy prime minister of Russia under President Boris Yeltsin, who hand-picked his successor, current president Vladimir Putin.\n\n\"I am very openly anti-Putin,\" Koch said.\n\n\"That being said, I think it would be irresponsible not to acknowledge that my dad may have played a part, maybe unknowingly, in getting him to power so that's something that I guess my dad has to take accountability for. That being said, my dad is currently wanted by the Russian government and is actually on the run.\"\n\nHer parents fled Russia for Bavaria.\n\nKoch is a world citizen who lives in London and trained in New York at the Upright Citizens Brigade Theatre, which boasts famous alumni such as Amy Poehler.\n\nKoch's stand-up routine at the Sydney Comedy Festival will be about how people treat money.\n\n\"The show very much is about privilege and people's attitude towards money across different cultures,\" she said.\n\n\"Because I've lived in the US, I've lived in the UK, I've lived in Russia, attitude towards money and towards privilege are very different.\n\n\"And because I have seen and been immersed in all of them I sort of see where everybody's coming from and I see the pitfalls of every viewpoint.\"\n\nThe Sydney Comedy Festival runs from Monday, April 21 — Sunday May 18 also featuring Jimeoin, Arj Barker, Rhys Nicholson, Steph Broadbridge in Breaking the Musical and many more.",
    "source": "ABC",
    "cluster_id": 10
  },
  {
    "url": "https://www.abc.net.au/news/2025-04-20/blind-cricket-game-breaking-boundaries/105178202",
    "title": "How blind cricket is breaking boundaries for the visually impaired",
    "publish_date": "Sun, 20 Apr 2025 01:25:42 +0000",
    "category": "sports",
    "authors": [],
    "text": "Scott Jones thought his sporting days were over when he was diagnosed with an eyesight disability at the age of 30.\n\nMr Jones was told he had Stargardt disease, a degenerative disease that has left him with less than five per cent vision.\n\nBut he found a new lease on life when he discovered blind cricket eight years later.\n\n\"People with a disability, they deal with their grief and loss of the life they had prior,\" Mr Jones said.\n\n\"You could sit at home and dwell on that or you could get out and meet some like-minded people to give you that lift.\n\n\"That show you there are things out there that you can do and achieve.\"\n\nMr Jones went on to captain the NSW blind cricket side, winning multiple state titles.\n\nHe now runs a clinic teaching blind cricket, and was part of a recent exhibition match in Bathurst hoping to educate people with and without visual impairments about the sport.\n\nThe NSW blind cricket team won its sixth national championship earlier this year. (Supplied: Blind Cricket NSW)\n\nWhat is blind cricket?\n\nBlind cricket involves a bowler under-arming a ball that has a rattle inside to a batter.\n\nA blind cricket come and try session was held in Bathurst. (ABC Central West: Hamish Cole)\n\nThere are three levels of visual impairment across the team, with four completely blind players required.\n\nThe rest of the side is made up of people with less than 10 per cent vision.\n\nPlayers who are completely blind are supported by a runner between the wickets, while fielders are directed to the ball by teammates.\n\nAccording to Vision Australia, more than 450,000 people are living with blindness or some form of vision impairment, with the vast majority not participating in sport.\n\n\"Overall only about three per cent of the blind community play sport,\" NSW Blind Cricket president Mark Eschbank said.\n\n\" Through sport we improve their life, mental health and physical health, their community prospects by way of employment. \"\n\nBreaking down boundaries\n\nThe Bathurst exhibition match was organised by Mr Jones, along with NSW Blind Cricket and and advocacy group Social Futures.\n\nMark Eschbank says the event helps improve community awareness of living with a disability. (ABC Central West: Hamish Cole)\n\nIt was the second year in a row the match had been held in the city, with the aim of giving non-visually impaired people a greater understanding of living with a disability.\n\n\"They get a better understanding of the challenges that vision impaired people face,\" Mr Eschbank said.\n\n\" It helps them to deliver help without seeming condescending and without feeling like they're imposing on somebody with a disability. \"\n\nFor the past decade, the group has been running similar training programs in the Hunter and Central Coast region.\n\nThere are plans to expand it to more inland areas.\n\nBlind cricket involves the use of a ball with a rattle inside (ABC Central West: Hamish Cole)\n\nMr Jones said the involvement of non-visually impaired people was crucial for breaking down stereotypes.\n\n\"It shows our community that these people are quite talented, and can achieve things in different ways,\" he said.\n\n\"A community that is aware will then include people with a disability instead of standing off.\"\n\nScott Jones has won multiple Australian National Championships. (ABC Central West: Hamish Cole)\n\nLocal Tim Roberts, who is not visually impaired, took part in the game.\n\n\"You don't realise how much you depend on your sight for literally everything,\" he said.\n\n\"You see the ball come at you underarm and you think 'Oh I've got this everyday of the week', and then you swing that bat and miss, it makes it really tricky.\"\n\nGetting kids into sport\n\nDisability advocate Maree Jenner works with Social Futures, a not-for-profit organisation that assists people living with a disability.\n\nMaree Jenner says sport can play a vital role in making young kids with a disability feel included. (ABC Central West: Hamish Cole)\n\nMs Jenner was born with dwarfism and has experienced the benefits sport can have for children, having played hockey at school.\n\n\"My mother thought it's too dangerous … I am the height of a child now so I was a lot shorter then,\" Ms Jenner said.\n\n\"I didn't want to be left on the side, even at one point they said, 'Do you want to be the mascot?'\n\n\"I said 'No, I want to be out there with everyone else'.\"\n\nMs Jenner said she became a defender.\n\n\"I was just as important as everyone else on the team which is so important that everyone else feels included,\" she said.\n\nMr Jones has run coaching clinics for thousands of children across the central coast and Hunter region.\n\nHe said creating greater awareness among kids about what it was like to have a disability was vital for improving inclusivity.\n\n\"If the kids learn that sort of stuff when they are at school and they're young, they take that with them and hopefully one day we have a better place to live,\" he said.",
    "source": "ABC",
    "cluster_id": 11
  },
  {
    "url": "https://www.abc.net.au/news/2025-04-20/slow-furniture-how-handmade-is-fighting-fast-furniture/105157370",
    "title": "You've heard of fast fashion. What about fast furniture?",
    "publish_date": "Sun, 20 Apr 2025 00:38:15 +0000",
    "category": "finance",
    "authors": [],
    "text": "Tucked away in a converted apple coolstore in Tasmania, Laura McCusker is designing furniture that she hopes will still be around in hundreds of years.\n\nThe Hobart-based furniture maker adheres to the 'slow design movement', which she says is based off the 'slow food' ethos.\n\nLaura McCusker encourages consumers to buy from local furniture makers. (ABC News: Ebony ten Broeke)\n\n\"Instead of buying stuff that's really quick to access, quick to make and cheaper, you actually invest in pieces that will last forever,\" Ms McCusker said.\n\n\" So, buying once, buying well, looking after it, maintaining it and buying from makers who are local. \"\n\nThis movement is the antithesis to fast furniture, which like fast fashion, is mass-produced furniture made of lower-quality materials, and is cheaper than handmade pieces.\n\nOnline marketplaces such as Temu offer cheaper, lower-quality items. (ABC News: Maren Preuss)\n\nThere are a number of brands that provide these products, which are usually flat-packed, normally not made of solid timber construction and can be shipped from all around the world.\n\nMs McCusker said although fast furniture may be appealing, these \"fashion-based\" or trendy items have less longevity.\n\n\"I'd just be careful of that sugar hit,\" she said.\n\nMs McCusker designs solid timber pieces. (ABC News: Scout Wallen)\n\n\"You can get a longer hit of the dopamine if you buy something that's better quality, or if you find something and repurpose it, like a vintage piece.\n\n\" You'll love it so much more than if you buy something that turns up in 10 days from China. \"\n\nThe McRobies Gully Waste Management Centre has seen an increase in dumped fast furniture in recent years. (ABC News: Scout Wallen)\n\nFiona McAlpine works at a waste management centre in Hobart, which she said had seen a gradual increase of dumped fast furniture since the COVID pandemic.\n\nFiona McAlpine is the program manager for waste and circular economy for the Hobart City Council. (ABC News: Scout Wallen)\n\n\"We end up with a lot more of it and ultimately a lot of this material does end up in landfill because it's much harder to recycle than our traditional old solid wood timber furniture,\" she said.\n\nMs McAlpine said the type of materials, such as composite timber with lots of glues, are easily damaged and hard to repair.\n\nFast furniture is normally not made of solid timber. (ABC News: Scout Wallen)\n\n\"Often that material gets damaged really easily and people then don't pass those pieces of furniture on to others to reuse and they end up coming straight to landfill.\"\n\nThe influence of social media\n\nLin Yang, a marketing researcher at the University of Tasmania, said preferences for fast furniture have been heavily influenced by trends seen online, especially for younger people.\n\nDr Lin Yang has researched consumer patterns. (ABC News: Scout Wallen)\n\n\"When it comes to actually purchasing, they would look for social media-worthy pieces,\" Dr Yang said.\n\n\"They might be thinking, 'this piece is going to bring me more attention' or 'this is going to allow me to engage with my mates on Instagram or TikTok'.\n\n\"Fast furniture really allows them to … quickly refresh their rooms in a day or less than a day, so this actually gives that … social value they're looking for.\"\n\nMs McAlpine says composite-material furniture is easily damaged. (ABC News: Scout Wallen)\n\nShe said cost was a major factor.\n\n\" The older generation … they tend to be more affluent, and they are able to afford up-front big investments. \"\n\nImportant to be a 'conscious consumer'\n\nGeorgia Quinn uses social media to provide tips on flipping thrifted items. (Supplied: Georgia Quinn)\n\nFor 31-year-old Georgia Quinn, avoiding fast furniture and buying secondhand is the perfect middle ground between sustainability and affordability.\n\n\"It can be really tempting to just buy something because I need it for an occasion, or it's cheap enough so if it doesn't work out in my home, it doesn't really matter,\" Ms Quinn said.\n\n\"But it's not just the price that you're paying, you're also asking something of the Earth, which we all know is already in crisis.\"\n\nMs Quinn runs a social media account where she provides tips on flipping thrifted items, including furniture.\n\nLoading Instagram content\n\nShe said it was a conversation that required nuance.\n\n\"I think there's a risk of being classist when we're talking about sustainability and being really adamant about only buying from sustainable brands,\" she said.\n\n\"I think it's more about being a conscious consumer and buying things that you're actually going to use and that will actually add value to your life, and not just buying because something is cheap.\"\n\nTips for being sustainable on a budget\n\nMs McCusker said although getting an item designed is more expensive, well-made timber furniture should last hundreds of years.\n\nMs McCusker says you're more likely to want to repair and keep using a bespoke piece of furniture. (ABC News: Scout Wallen)\n\n\"When you're spending a little bit more and it takes a little bit of time for that piece to get to you, something goes wrong with it — if it gets a knock or a bruise or a dent — you're much more likely to mend it and repair it.\"\n\nMs McCusker said she does work for large and small budgets and understands why some people need to buy the cheaper option.\n\nMs McCusker designs furniture for a variety of budgets. (ABC News: Ebony ten Broeke)\n\n\"If you're on a student income and you're living in share accommodation … you gotta do what you gotta do.\n\n\"Maybe when you finish with it, pass it on to somebody else or look after it, and maybe if it gets a little bit tired, give it a coat of paint.\n\n\"There's a million ways that we can keep these things lasting longer.\"\n\nThe McRobies Gully Waste Management Centre has seen a gradual increase of fast furniture materials. (ABC News: Scout Wallen)\n\nMs McAlpine said people can go to tip shops or secondhand stores to find pieces.\n\n\"It's not that you can't get something handmade [on a smaller budget], but you might not get something that's brand new and handmade,\" she said.\n\nMs Quinn said she asks herself a series of questions when contemplating buying something new.\n\n\"Will it really add value to my life? Will I keep it for a long time when I no longer need it? Can it be useful to someone else? Will it just go to landfill next? Will I only have it for six months and then I'll just chuck it?\"",
    "source": "ABC",
    "cluster_id": 12
  },
  {
    "url": "https://www.abc.net.au/news/2025-04-20/do-new-workplace-laws-threaten-return-of-bad-old-days-pilbara/105099252",
    "title": "Will the government's new IR laws bring the Pilbara back to the 'bad old days'?",
    "publish_date": "Sun, 20 Apr 2025 00:11:27 +0000",
    "category": "finance",
    "authors": [],
    "text": "The Albanese government's changes to Australia's industrial relations laws have been hotly debated in the lead-up to the federal election.\n\nIn Western Australia, much of the attention has focused on the potential return of major unions to the Pilbara, where they once boasted significant membership and power.\n\nSome say strikes were rife and overall productivity low, as a workforce that was still majority residential defended what they viewed as hard-won pay and conditions.\n\nIndustry fears a return to \"the bad old days\" of union power will disrupt a region regarded as the powerhouse of the Australian economy.\n\nBut supporters say the concerns are overblown.\n\nHow bad were the 'bad old days'?\n\nIron ore mining took off in WA's Pilbara in the 1960s, with union presence in the region rising in line with national rates of union membership.\n\nBy the 1970s, WA mining was home to \"one of the most strike-prone sections of the Australian workforce\", according to industrial relations historian Alexis Vassiley.\n\n\"Workers struck for 12 days per year on average, compared to 'only' 7.5 days for the notorious coal miners,\" he wrote in his recently published book.\n\nEven the region's most enduring symbol — Red Dog — was a fully paid member of the Transport Workers' Union.\n\nEven Red Dog was a paid-up member of the unions in the mid-1970s. (ABC News: Charlie Mills)\n\nDr Vassiley, who has spent years researching the rise of the union movement in the Pilbara, said it was intensified by the rapidly growing workforce, with many fed up with poor conditions and long hours.\n\n\"By about 1970, the unions have a big breakthrough,\" he said.\n\nThe Party Room Photo shows An orange background with graphics and words reading The Party Room with Kelly and Karvelas with the ABC LIsten app logo. What's really going on in parliament house? Patricia Karvelas and Fran Kelly deep dive into the week's biggest political stories and answer listener questions. Stream The Party Room on ABC listen.\n\n\"All of the companies in that year, they get a big reduction in hours worked per week, a big increase in pay and significant increases in conditions.\"\n\nLarry Graham moved to the Pilbara in the 1970s and worked as an electrician and union convenor before serving as the state member for the Pilbara from 1989 until 2005.\n\nMr Graham said the way unions operated in the Pilbara was unique.\n\n\"We had shop floor unions where if you were elected by the rank and file, you had as much say in what happened in the union as the state council of the union did,\" he said.\n\n\"We were incredibly powerful and as long as you maintained the support of the troops, you basically ran the show.\n\n\"In my case, the state secretary of the union wouldn't have dared to come onto the Port Hedland site without my approval.\"\n\nLarry Graham represented the Pilbara in WA's parliament from 1989 to 2005. (Supplied: Larry Graham)\n\nMr Graham credits unions with securing things still enjoyed by the modern FIFO worker, including pay, conditions, superannuation, housing support, health insurance and job security.\n\n\"Even though the early companies were fantastic companies, the concept of doing things differently really wasn't their strong point,\" he said.\n\n\"So the unions had to arm wrestle the companies into a position where they would actually deal with the unions.\"\n\nAs an example, Mr Graham recounted an episode in the early 1980s where his footy coach, a local school teacher, mentioned their departmental houses did not have air conditioning.\n\nAttempts to get it fixed through departmental channels had failed, so he called the chief executive of Mount Newman Mining.\n\n\"I said to him, 'Are you aware school teachers don't have air conditioning, we can't live with that', I'm giving you two weeks' notice that we're going to start a Pilbara-wide dispute unless that gets fixed',\" he said.\n\n\"He rang [then-premier] Charlie Court and it was fixed in a week.\"\n\nMr Graham reflects proudly on the influence of the unions, but acknowledged they weren't perfect.\n\n\"There were things that went wrong, there's absolutely no doubt about that,\" he said.\n\n\"We had some loonies [sic] who made nuisances of themselves in a big way.\n\n\"We had some really heavy strikes, some of those were good, some of those were bad.\"\n\nBut Mr Graham said achievements far outweighed union shortfalls.\n\n\"Inside 15 years, the trade union movement in the Pilbara hammered the companies that hard on safety, that it became safer than the real estate industry in Perth,\" he said.\n\nSo, how did the unions lose face?\n\nDr Vassiley said a dispute involving workers at the \"most militant\" mine site in the Pilbara, Robe River, sparked the downfall for unions in the region.\n\nRobe River Iron was at the centre of the de-unionisation trend in the early 1980s. (Supplied: L.Whiteside/Rail Heritage WA)\n\nIn 1986, Robe River near Pannawonica was bought by Australian mining company Peko Wallsend.\n\nPeko's chief executive Charles Copeman believed the unions had become unmanageable and accused them of engaging in featherbedding — a practice by which unions force management's hand to retain excess staff.\n\n\"The [unions] managed to get a lot of people paid a lot more than they were working for — that was the biggest problem,\" Mr Copeman told the National Library of Australia in 2000.\n\nHe set about scrapping more than 200 agreements with previous management and workers.\n\nEventually, about 1,160 workers were locked out of the site for a three-week period.\n\nDr Vassiley said throughout the dispute, union lines fractured.\n\nWorking conditions across the Pilbara in the 1970s were subject to union action. (Supplied: City of Karratha Local History)\n\nLeadership wasn't keen to engage in strike action, while the more militant convenors were pushed to the side.\n\nWithin six months, Copeman and Peko won out, effectively de-unionising the site.\n\nOver the following decade, union membership eroded in the region, with major companies taking a more hardline approach.\n\nWhat are the new laws, and what are the criticisms?\n\nIn 2022, the Albanese government began introducing workplace reforms as part of the Closing Loopholes and Secure Jobs Better Pay acts to better protect workers across the country.\n\nPart of the government's new laws contain a mechanism for representatives, including unions, to force a company into bargaining.\n\nBut that can only occur when an already existing enterprise agreement has expired within the preceding five years.\n\nNegotiations are also subject to statutory approval.\n\nThe laws include provisions for multi-employer bargaining, where workers in the same sector but under different employers can negotiate collectively.\n\nIt's these changes that raise the most concern for industry groups.\n\nThe 1970s was a time of fast unionisation in the Pilbara. (Supplied: City of Karratha Local History)\n\nAustralian Resources and Energy Employer Association director of industry and advocacy, Tom Reid, said the changes were \"designed to re-insert unions into workplaces that have left them behind\".\n\n\"Why should highly productive iron ore mines be possibly threatened with the prospect of multi-employer bargaining?\" he said.\n\n\"Employees in the Pilbara are at the centre of some of the highest paid arrangements in any industry in the country — any assertion that this wave of industrial relations changes is truly about protecting workers, it just doesn't fly.\"\n\nIn April, the WA Chamber of Commerce and Industry chief economist attributed a decline in business confidence in the region to fears over increasing union membership.\n\nBut while unions still have a presence in the Pilbara today, their membership pales in comparison to the 1970s and 80s.\n\nThe laws have already been put to the test in the mining sector, after workers at three coal mines in NSW united to force companies into multi-employer bargaining last year.\n\nIn March, 400 Rio Tinto workers in the Pilbara town of Paraburdoo signed a petition to support collective bargaining — the first of its kind in 20 years.\n\nEmployment Minister Murray Watt says criticisms of the new laws are a \"deliberate misinterpretation\". (ABC News: Matt Roberts)\n\nFederal Industrial Relations Minister Murray Watt said criticisms of mechanisms such as multi-employer bargaining were a \"deliberate misinterpretation\".\n\nHe said the changes gave employees, including those in the resource sector, the choice of how they negotiated.\n\n\"We've made it easier for workers on some sites to collectively bargain, to be able to enter into agreements with their colleagues,\" he said.\n\nMining and Energy Union WA branch state secretary Greg Busson said the union and its members were highly supportive of the government's industrial relations changes.\n\n\"The rules have been too far skewed towards the bosses for a long period of time, and we see this as a start to make it fairer, and give the employee more say in their conditions,\" he said.\n\nBut he agreed with Mr Watt in not seeing multi-employer bargaining as having an impact on mine workers in the region.\n\n\"I don't know if it will work in the Pilbara at this stage,\" Mr Busson said.\n\n\"If the company sits down with the proper intention to negotiate a fair and just agreement, I don't think there's any need to enter into that.\"\n\nLoading\n\nLoading...\n\nHaving trouble seeing this form? Try this link.",
    "source": "ABC",
    "cluster_id": 13
  },
  {
    "url": "https://www.abc.net.au/news/2025-04-20/paramedics-tv-show-filming-restrictions-in-wa-criticised/105189882",
    "title": "Filming restrictions for Paramedics TV show in WA labelled dishonest",
    "publish_date": "Sun, 20 Apr 2025 00:04:56 +0000",
    "category": "finance",
    "authors": [],
    "text": "WA Health Department directives restricting filming of hospital ramping for the TV show Paramedics have been labelled dishonest by the state opposition and a disservice to health workers and the public by doctors.\n\nSt John WA, the state government's contracted ambulance service, is currently filming with production company WTFN Entertainment for the coming seventh season of the 'real-life' show.\n\nIn a press release, St John WA states: \"This popular observational documentary, which airs on the Nine Network nationally, takes viewers behind the scenes as paramedics respond to emergency calls, showcasing the fast-paced, high pressure work of pre-hospital care\".\n\nBut a document outlining filming protocols and restrictions, sent by the Department of Health to WA public hospitals and seen by the ABC, has prompted concerns from the opposition and the Australian Medical Association WA (AMA WA), for what appears to be the department's ability to control what can and cannot be seen by the public.\n\nWA's Health Department is forbidding use of vision showing \"perceived capacity constraints\" in hospitals. (ABC News)\n\nEditing protocols include:\n\nVision that is used to negatively portray the WA Health system, including but not limited to perceived capacity constraints, is not permitted to be used, broadcast, streamed or shared in the program.\n\nBefore any episode is finalised, the Department of Health and Health Service providers reserve the right to decline any part of the vision being published, broadcast or streamed.\n\nFilming protocols include:\n\nFilming of and within ambulances must conclude at the time of entering a hospital ramp.\n\nNo filming is to occur onsite at hospitals outside of the ambulance.\n\nIn several previous episodes of Paramedics, filming continued once an ambulance reached a hospital, with vision of patient transfers sometimes aired.\n\nAMA WA fears excessive censorship\n\nRamping refers to the time an ambulance spends waiting outside an emergency department, unable to transfer the patient to the hospital, meaning the patient remains in the care of the paramedics.\n\nOn Thursday, the AMA released its latest ambulance ramping report card, which has shown, in some states, ramping hours are double what they were five years ago.\n\nAmbulance ramping in WA has increased this financial year. (ABC News: Keane Bourke)\n\nWhile ramping hours in WA did drop in 2023-24 to 49,530 hours, they have since gone back up, with more than 50,300 hours already recorded in the nine months to the end of March this financial year.\n\nAMA WA president Michael Page said he would \"hate to see excessive censorship by WA Health of what comes out of this filming\".\n\n\"I hope that there's no intervention from government that prevents the viewer from seeing the full picture of the state of our health system and the tough job that our paramedics do every day, as well as the work done by our doctors, our nurses and everyone else working in our health system,\" he said.\n\nAMA WA president Michael Page says it's important the frustration faced by paramedics is seen. (ABC News: Courtney Withers)\n\n\"Paramedics do spend a lot of time waiting with patients on the ramp because they can't get their patients into the emergency department because we do not have enough hospital capacity.\n\n\"I hope that experience of paramedics is shown for what it is, which is a job [that] is occasionally frustrating.\n\n\"They're frustrated by the state of our public hospital system, the shortage of beds that causes them to have to wait outside hospitals rather than getting out and attending to the next patient in the community who needs their care.\"\n\n'Extraordinary spin': opposition\n\nWA's Shadow Health Minister Libby Mettam slammed the government for the move.\n\n\"Ambulance ramping has become part and parcel of working as a paramedic under the Cook Labor Government, and for this government to issue such a directive on this program highlights a lack of transparency and accountability,\" she said.\n\nShadow Health Minister Libby Mettam has accused the government of dishonesty. (ABC News: Jake Sturmer)\n\n\"This directive is not only a disservice to WA patients, to health workers, to paramedics, but is also deeply dishonest for the government to issue such a directive during an ambulance ramping crisis.\n\n\"We've just had an election campaign. Health was not a priority. It is still not a priority.\n\n\"And it's extraordinary that this government is just continuing to try and spin their way out of what is a health crisis costing Western Australian patients lives.\"\n\nGovernment urged to fix problem\n\nBoth Dr Page and Ms Mettam called on the government to instead deal with the issue, something they said was not an ambulance problem but a hospital capacity problem.\n\nDr Page said planned upgrades to Sir Charles Gairdner Hospital and Royal Perth Hospital, which the government ran as election promises, were welcome, but not enough.\n\nWhat it would really take to fix WA's health system? Photo shows The back of three ambulances, and the bonnet of a fourth, parked outside a hospital. Many have promised solutions to Western Australia’s problem-plagued health system, but do any of these ideas have a chance of addressing the heart of the issue?\n\n\"We do need refurbishment of our ageing hospitals but in addition to that, we need hundreds if not thousands more hospital beds to cope with our ageing and growing population,\" he said.\n\nIn a statement, a WA government spokesperson said there were \"a number of complex contributing factors that contribute to ramping, and we are working hard to address the issue\".\n\n\"We have added more than 800 hospital beds to the system since 2021 — the equivalent of another Fiona Stanley Hospital. There are hundreds more in the pipeline.\"\n\nA spokesperson for St John WA said it was the only ambulance service in the country to publish daily data on ramping.\n\n\"We support transparency and believe the series (Paramedics) complements, rather than replaces, those efforts,\" the spokesperson said.\n\nSo who has ultimate oversight?\n\nA WA Health spokesperson told the ABC the department did not have an agreement with the production company, but had prepared the filming protocols at the request of service providers, which run public hospitals.\n\nThe protocols were necessary, in part, to protect privacy and confidentiality as required under law, the spokesperson added.\n\nSt John WA is contracted by the government to provide ambulance services in the state. (ABC News: Keane Bourke)\n\nThe health minister, the department and St John WA were all asked if the protocols gave the department something akin to complete control over what could be aired.\n\nThe minister and the department did not answer the question, but St John said the query would need to be directed to the department.\n\nSt John also said it had an agreement with WTFN under which editorial control rested with the production company, but the ambulance service and other stakeholders were able to review the content to \"ensure it reflects operational, legal and reputational responsibilities\".\n\nWTFN Entertainment did not respond to questions from the ABC about the protocols, including how they differed from seasons of the show filmed in other states.",
    "source": "ABC",
    "cluster_id": 14
  },
  {
    "url": "https://www.abc.net.au/news/2025-04-20/reece-walsh-backed-by-broncos-coach-maguire-despite-costly-error/105194518",
    "title": "Brisbane coach backs Walsh despite error handing Warriors victory",
    "publish_date": "Sat, 19 Apr 2025 23:42:37 +0000",
    "category": "sports",
    "authors": [],
    "text": "Brisbane Broncos coach Michael Maguire has defended Reece Walsh despite an error by the talented fullback that handed the Warriors a golden-point 20-18 victory in New Zealand.\n\nThe 22-year-old had a torrid night in Auckland, suffering a suspected knee injury in the second minute of the game that limited his involvement to only seven runs over 50 metres.\n\nHe bravely battled through the pain barrier to score the 73rd-minute try that sent the contest to a golden point.\n\nBut Walsh made a costly gaffe by kicking out on the full from the extra-time restart, allowing the Warriors' Luke Metcalf to land a 50-metre penalty goal to hand the home side victory.\n\nMaguire refused to criticise his star man, while praising him for battling through the pain barrier to finish the match.\n\n\"He has done something to his knee,\" Maguire said. \"There is something there that we need to have a look at.\n\n\"It was a real credit to him to fight through the game.\"\n\nWalsh's injury setback puts him in doubt for Thursday's home match against the unbeaten Bulldogs, while potentially affecting his hopes of being selected as a Maroons' starter for next month's Origin opener at Lang Park.\n\nKnights' favourite Kalyn Ponga is considered Walsh's main rival for the Queensland number-one jersey.\n\n\"We need to get a scan around [Walsh's knee injury]. He fought through the whole game with that issue,\" Maguire said.\n\nWalsh was praised by coach Maguire after completing the match in New Zealand despite a knee injury. (AAP: Andrew Cornaga)\n\n\"We will have to wait and see whether or not he is right to play again over the next couple of weeks.\"\n\nThe Broncos' second consecutive defeat could see them slip out of the top four by the end of the weekend and highlights their ill-discipline at crucial times, with them losing the penalty count 10-4.\n\nNRL live blog Photo shows Three rugby league players in pink celebrate a try. Nathan Cleary becomes the Panthers' greatest point-scorer as his side makes a spectacular return to form in a statement win over the Roosters.\n\nDespite being one of the favourites to win this year's NRL, they have won only four of seven games this season.\n\n\"In the first half, we put a lot of pressure on ourselves through discipline and errors. We need to be smarter there,\" Maguire said.\n\n\"We can control how we go about our game. We defended well for a long period of time in the first half, there was a lot of effort, but we just need to be smarter in what we are doing.\"\n\nDespite another below-par performance, the Broncos showed character to score two tries in the final 15 minutes to set up the golden point after trailing 18-6 in front of a hostile Auckland crowd.\n\n\"We had an opportunity there at the back end of the game,\" Maguire said.\n\n\"We were set up for field goals and we have to be smarter in that space.\"",
    "source": "ABC",
    "cluster_id": 15
  },
  {
    "url": "https://www.abc.net.au/news/2025-04-20/cricket-vaibhav-suryavanshi-youngest-ever-ipl-debutant-at-14/105194512",
    "title": "14yo prodigy becomes youngest-ever IPL player, hits six off first ball",
    "publish_date": "Sat, 19 Apr 2025 22:57:33 +0000",
    "category": "sports",
    "authors": [],
    "text": "At just 14, the youngest cricketer in Indian Premier League history has made his debut.\n\nOpening batter Vaibhav Suryavanshi appeared as an impact substitute for Rajasthan Royals on Saturday and boldly scored 34 runs off 20 balls, including a first-ball six over extra cover. He hit three sixes and two boundaries overall until he was out stumped.\n\nHis stand of 85 with Yashasvi Jaiswal gave Rajasthan's chase a great start but their team lost to the Lucknow Super Giants by two runs.\n\nSuryavanshi replaced Rajasthan's injured skipper Sanju Samson and created a unique record: Born in 2011, he became the first IPL cricketer born after the tournament's inception in 2008.\n\nSuryavanshi hails from Bihar and made headlines in the player auction; Rajasthan snapped him up for $1.1 million after an intense round of bidding.\n\nThe youngster has a triple hundred to his name in under-19 zonal cricket, but his five first-class matches have fetched meager returns.\n\nThe previous youngest IPL debutant was 16-year-old Prayas Burman in 2019 for Royal Challengers Bengaluru.\n\nMujeeb ur Rahman is the youngest international cricketer in the IPL, debuting at 17 in 2018 for Punjab Kings.\n\nAP",
    "source": "ABC",
    "cluster_id": 16
  },
  {
    "url": "https://www.abc.net.au/news/2025-04-20/cricket-fast-bowling-shift-leaves-records-untouched/105179746",
    "title": "Fast bowling records will stay unless coaches 'let them be aggressive'",
    "publish_date": "Sat, 19 Apr 2025 22:41:48 +0000",
    "category": "sports",
    "authors": [],
    "text": "In 2010, Australian cricketer Shaun Tait stood at the top of his mark on the picturesque turf of the famous Lord's Cricket Ground, ready to open the bowling against arch rivals England.\n\nOn the fifth ball of the over, Tait again seamlessly approached the crease, with his chest out, arms swinging beside him before ripping another thunderbolt of a delivery with his trademark slinging action, leaving England's then-captain Andrew Strauss to glance the ball from chest height for a single.\n\nThat delivery was clocked at 161.1 kilometres per hour, or 100.1 miles per hour, by the radar gun.\n\nFifteen years on, it remains the fastest ever recorded ball by an Australian and second of all-time behind Pakistan's Shoaib Akhtar's bowl of 161.3kph.\n\nBowling above 160 kph, is a feat only achieved by a few across the world, but in recent years the number of bowlers even getting close to that figure has diminished.\n\nRene Ferdinands says questions are often raised about why bowling speeds have decreased compared to previous eras. (ABC News: Tara Whitchurch.)\n\nCricket biomechanics researcher and professional cricket coach, Rene Ferdinands, said questions were often raised about why bowling speeds had decreased compared to previous eras.\n\nEvolving bowling actions\n\nHe attributed changes in bowling techniques as a possible cause and said it was \"concerning\" the traditional side on action that gave rise to many world-class bowlers, including Jeff Thomson, Mitchell Johnson, Akhtar and Tait, had now become something of the past.\n\n\"Unfortunately, the side on action has gone completely out of favour, so that removes … an opportunity to develop speed,\" Dr Ferdinands said.\n\n\"It's … technically the most efficient one and probably easier to achieve than the front on action.\"\n\nDr Ferdinands said the theory behind the shift from a side on to a front on bowling action was to prevent injury and improve efficiency, but he said those theories were \"pseudo-scientific\", and that front on bowlers were more prone to injuries.\n\nFast bowling creates a lot of stress on the body and players often struggle with injuries. (ABC News)\n\nHe also said current coaching methods were prohibiting bowlers from developing a natural action, and with difficulties for bowlers to achieve optimal performance already it further reduced the number of potential players who could bowl at high speeds.\n\n\"As soon as there's a little bit of something different, it tends to be bred out of them,\" Dr Ferdinands said.\n\n\"I wouldn't be surprised if Jeff Thompson turned up today and someone changed him to another kind of action, that's how serious this is.\n\n\"This is reaching epidemic levels.\"\n\nIndividualising bowling methods\n\nShaun Tait, who now coaches teams throughout the world has overcome his fair share of injuries throughout his career.\n\nHe said he believed the sport had gone \"overboard\" with its focus on techniques and workload management in the aim of reducing injuries and promoting longevity.\n\n\"Just watching the game nearly every day, fast bowlers are still breaking down and that's the way it's going to be,\" Tait said.\n\n\"I don't think there's any one program that says if you do this, you are going to be bowl fast and you're going to bowl 150 or 160, I don't think that necessarily exists.\"\n\nTait said the onus was on the individual to figure out what method worked best to optimise their bowling potential, but emphasised the importance of mentality, aggression, and recovery to bowl at the highest of speeds.\n\nLuke Butterworth says genetics play a crucial role in fast bowling ability. (ABC News: Nethma Dandeniya)\n\nSouth Australia's Under 19 Head Coach, Luke Butterworth said genetics also played a crucial role, including height and running ability.\n\n\"You can pick up, five maybe 10 kilometres from gym and technical changes, but to get to the top end you got to have that natural pace as a young bowler,\" Butterworth said.\n\nCompact cricket schedules\n\nUnlike previous eras the current crop of bowlers have busier schedules with the influx of franchise cricket coupled with their international commitments.\n\nAustralian cricketer Billy Stanlake said the emphasis on workload management had amplified in the past 10 years as a result.\n\n\"Nowadays, I think you see guys playing so much cricket, all three formats, all year around, so there's a lot of planning to be done to make sure that … guys can sustain that level for 12 months, year on end,\" Stanlake said.\n\n\" I think the challenge is to obviously maintain that if you're playing all year round and you're travelling, that's when it probably starts to get a little bit difficult. \"\n\nAustralian cricketer Billy Stanlake says the management of workloads for bowlers has changed. (ABC News: Greg Szabo )\n\nHowever, Butterworth said bowlers were encouraged to give it their all and bowl as fast as they could but said it was important to get the balance right to ensure they remained fit.\n\nWhat does the future look like?\n\nEven though approaches to fast bowling have changed over the years, experts still believe the 160kph mark will be broken again.\n\nBut Dr Ferdinands said it was unlikely to happen without changes to current coaching regimes.\n\n\"If the biomechanics does change, and they actually look at the reality of the situation, and then coaches go through different types of coaching programs, then you really should be able to improve performance and reduce injury,\" he said.\n\nShaun Tait wants bowlers to have more say in their own techniques. (Joe Castro: AAP)\n\nSimilarly, Tait wants bowlers to have greater control over their action, rather than having coaches concerned about their technique.\n\n\"Let players go a little bit and let them be aggressive and ball fast,\" Tait said.\n\n\"I would let them go a bit more wild, I would encourage a Lance Morris to not slow down and worry about his areas, I would encourage [him] to let it go and express himself.\"",
    "source": "ABC",
    "cluster_id": 17
  },
  {
    "url": "https://www.abc.net.au/news/2025-04-20/tasmania-hobart-side-hustles-rise-in-popularity/105089818",
    "title": "Side hustles on the rise as Tasmanians lowest paid but working the most jobs",
    "publish_date": "Sat, 19 Apr 2025 22:32:02 +0000",
    "category": "finance",
    "authors": [],
    "text": "Bruno Cabral was a lawyer in Brazil before he moved to Australia in search of a fresh start.\n\nBut when he arrived in Tasmania three years ago, finding a full-time job proved difficult.\n\n\"It was really hard, because I arrived in here in June … and Tasmania is really seasonal, you know, and there weren't many job vacancies available,\" Mr Cabral said.\n\nMore Aussies working two or more jobs Photo shows Frank painting More people than ever before are picking up multiple jobs as the high cost of living pushes Australians to take on extra work, but the tax office warns people not to get caught out and know their obligations.\n\nFaced with a tough job market in Hobart, and a desperate need to pay the bills, he turned to an online job marketplace that outsources small jobs.\n\nMr Cabral picked up some home removalist jobs on the platform, which he said \"was the easiest and the quickest way to make some money\".\n\n\"When I started, I just realised that it wasn't that hard to be honest, and I was good at it, so I just decided to stay doing it,\" he said.\n\nHe has since used the experience to help him land a permanent job in the industry.\n\nBut that hasn't stopped him from side hustling.\n\n\"Being a removalist, we're not really sure about our schedule, so sometimes when I know that I'm gonna finish earlier, I just open [Airtasker] up and I look for something else to do,\" he said.\n\nAirtasker is an Australian company that allows people to outsource everyday tasks.\n\nMr Cabral estimates that he makes about an extra $300 a week by picking up the few odd jobs.\n\nTasmania is leading the nation when it comes to working multiple jobs. (Unsplash: Robert Anasch )\n\nA tough job market\n\nThe latest statistics from the Australian Bureau of Statistics (ABS) show that Tasmania is leading the nation when it comes to working multiple jobs.\n\nIn December last year, the ABS found 8 per cent of employed Tasmanians, or 1 in 12, held two or more jobs, a number that was slightly higher in its capital, Hobart, at 8.5 per cent.\n\nMeanwhile, the national average is 6.7 per cent.\n\nDr Paul Blacklow says low wage is one of the factors driving people to work multiple jobs. (ABC News)\n\nUniversity of Tasmania economics lecturer Paul Blacklow said two main factors drove people to hold multiple jobs: their primary job not being full-time hours or it having a low wage.\n\n\"They're more likely to want to take on extra jobs so that they can have enough income to sustain themselves and live,\" Dr Blacklow said.\n\nThis is particularly true in Tasmania, where wages are lower compared with the mainland.\n\nThe most recent figures from the ABS show Tasmanians have the lowest average weekly earnings for full-time workers in the country.\n\nState/territory Average weekly full-time earnings ACT $2,178 WA $2,156 NSW $1,985 Qld $1,953 Vic $1,927 NT $1,886 SA $1,857 Tas $1,765\n\nSource: ABS\n\n\"And so for that reason, Tasmanians may well be taking on additional jobs, more so than their counterparts in the other states,\" Dr Blacklow said.\n\nData from the ABS shows the number of multiple job holders across Australia is at an all-time high.\n\nBetween 1995 and 2019, the multiple job-holding rate fluctuated between 5 per cent and 6 per cent.\n\nBut after the COVID pandemic restrictions began to ease, the multiple job-holding rate rose and has remained at a historical peak of between 6.5 per cent and 6.7 per cent since December 2022.\n\nDr Blacklow said this recent increase is likely attributable to \"the cost-of-living crisis, and also because nominal wages haven't been growing that much\".\n\n\"We've noticed throughout history that other times when Australians have increased the amount of the incidence of holding multiple jobs, it's typically been when the economy has not been too well, or that inflation is high, or the wage growth is low,\" he said.\n\nYounger generations more likely to work multiple jobs\n\nABS statistics show that workers aged 20–24 years old are the most likely to be working multiple jobs.\n\nThis rings true for full-time university student Aya Gibson, who also holds three jobs.\n\nThe 21-year-old's packed schedule sees her work at least three nights a week as a waitress, serve customers at a market stall at least once a fortnight, and coach a soccer team for a couple hours each week.\n\n\"I found that with just a casual job, I still needed to find some extra hours here and there to bolster up the income,\" Ms Gibson said.\n\nShe works up to 30 hours a week on average across all three jobs, as well as studying a double degree in marine biology and Antarctic sciences, which takes up about 38 hours a week.\n\nAya Gibson works up to 30 hours a week on average across three jobs. (Supplied: Aya Gibson)\n\nMs Gibson lives at home, which she says makes her daily expenses \"probably lower than your average uni student\", but that she is conscious of the current economic climate as \"things are getting increasingly more expensive\".\n\n\"People now are struggling to get into the housing market and do stuff,\" she said.\n\n\"And so who knows what it's going to look like when I'm coming around to that kind of time in my life.\n\n\"I may as well work and put towards savings and that kind of thing, and some life things that are good to save for.\"",
    "source": "ABC",
    "cluster_id": 18
  },
  {
    "url": "https://www.abc.net.au/news/2025-04-20/federal-election-politics-live-2025-blog-albanese-dutton/105193680",
    "title": "Live: WFH a 'feature' of public service as Coalition MP dampens colleague's claim",
    "publish_date": "Sat, 19 Apr 2025 22:05:06 +0000",
    "category": "finance",
    "authors": [
      "Andrew Thorpe",
      "Caitlin Rawling",
      "Nicole Hegarty",
      "On The Trail With Albanese",
      "On The Trail With Dutton",
      "Evelyn Manfield"
    ],
    "text": "Bandt is asked to respond to criticism of the Greens' plan to abolish negative gearing and the capital gains tax (CGT) discount for new investors — specifically that doing so would damage rental supply (by lessening the incentive for developers to build properties they can then sell to investors).\n\nThe Greens leader goes into the history of housing prices in Australia, pointing to the late 1990s under John Howard as the moment \"a fire [was lit] under the housing market\" with the introduction of the CGT discount.\n\n(He also says the change \"put a big time bomb there\" — I'll need someone with more knowledge of explosives to tell me if this is a truly egregious mixed metaphor or not.)\n\nDavid Speers chats to Greens leader Adam Bandt. (ABC News)\n\n\"There's now $180 billion over the decade in handouts going to property investors, and what that means is that a first home buyer or a renter, they turn up to an auction with whatever they have been able to save — but next to them is a wealthy property investor who has a big cheque from Anthony Albanese and Peter Dutton so is able to keep bidding the price up, knowing that they can write it off on tax,\" Bandt says. \"So what we're saying is that we need to ensure that younger generations have the same chance at owning a home as previous generations have.\"\n\nHe says the challenge is to find a way to \"defuse this time bomb\" that is fair, and he believes the Greens have done so with their policy — but the party is \"willing to consider any ideas\".",
    "source": "ABC",
    "cluster_id": 19
  },
  {
    "url": "https://www.abc.net.au/news/2025-04-20/football-womens-champions-league-semi-lyon-vs-arsenal-wrap/105194482",
    "title": "Carpenter a step closer to elusive title after 'strange' battle against Matildas teammates",
    "publish_date": "Sat, 19 Apr 2025 21:56:22 +0000",
    "category": "sports",
    "authors": [],
    "text": "Australian representation at women's soccer's showpiece club final looks set to be fulfilled again by Ellie Carpenter after her Lyon side secured a valuable away win against an Arsenal side featuring two Matildas teammates.\n\nThe 2-1 victory was also a triumph for former Arsenal manager, now Lyon boss, Joe Montemurro, the Melburnian tipped to be the next Matildas coach.\n\nThough Arsenal created enough chances to feel they could get a result in the second leg in France early next Monday morning AEST, Lyon's lead, attacking panache and experience make them firm favourites.\n\nThat would delay Montemurro taking the Matildas job — if he is offered it, by another week. The French league ends eight days before the European final in Lisbon on 24 May.\n\nLoading YouTube content\n\nCarpenter was badly injured early in Lyon's 2022 final win over Barcelona, and on the pitch for all their defeat to the same opposition in last year's final, so will hope for third time lucky in Lisbon. Caitlin Foord, however, believes Arsenal can deny her the chance.\n\n\"I back us to be able to turn it around,\" the Gunners' striker said.\n\n\"We've come from behind before in the Champions League, in the league as well. There's been multiple games where we have done it, so the confidence is there.\n\n\"Off the back of any loss you just want to get into the game and play again, so everyone will be raring to go. We created, we got into the box, we just need to finish it off.\"\n\nOn a north London field far from home, Carpenter and Foord spent the afternoon tracking each other's movements, a situation the latter said was unusual.\n\n\" I don't think we've played against each other in a competition match before,\" she said.\"It's a bit strange, but once you're out on the pitch, it's just like any other game. \"\n\nThere was a third Matilda, Steph Catley, nearby at the heart of Arsenal's defence and Kyra Cooney-Cross watching on from their bench.\n\nArsenal had blown away Real Madrid 3-0 in its quarterfinal second leg here, but eight-times winners Lyon were a very different proposition.\n\nTheir multi-national collection of stars settled quickly and deserved their 17th-minute lead. A pass was slid behind Catley to Kadidiatou Diani who finished impeccably. She was flagged offside but a VAR check revealed American defender Emily Fox had played her on.\n\nBoth sides hit the bar as the half became more even, Lyon's Haitian striker Melchie Dumornay doing so from range and Alessia Russo heading onto the woodwork from close. In between, Catley blocked a goal-bound Carpenter shot in a rare foray forward by the full-back.\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\nRoared on by another impressive crowd of 40,000-plus, Arsenal dominated the second half, Foord being denied soon after the break and Beth Mead and Frida Maanum missing good chances.\n\nFourteen minutes from time, the VAR gave Arsenal a lifeline, highlighting Christiane Endler punching Leah Williamson as the goalkeeper attempted to clear a corner.\n\nMariona Caldentey rolled in the spot-kick, but as Arsenal went for a winner they were exposed at the back and Dumornay lashed in a shot, concluding a move begun by Carpenter.\n\n\"We suffered, but teams that come here will,\" said Montemurro. \"This team has the ability to control the emotion and that's important.\n\n\"It's not over yet,\" he added. \"Maybe the pressure is off Arsenal. That's a dangerous scenario and they're a good team.\"\n\nThe second semifinal is on Monday morning, AEST, with Chelsea, still without Sam Kerr, whose recuperation from her ACL injury is now its 15th month, away to Barcelona.\n\nAAP",
    "source": "ABC",
    "cluster_id": 20
  },
  {
    "url": "https://www.abc.net.au/news/2025-04-20/genetic-mutation-rnu42-renu-syndrome-discovery/105180210",
    "title": "Discovery of genetic mutation leads to first diagnosis for dozens of kids",
    "publish_date": "Sat, 19 Apr 2025 21:51:30 +0000",
    "category": "lifestyle",
    "authors": [],
    "text": "Kiera Hannigan says music \"lights up\" her four-year-old daughter Annabelle's brain like nothing else.\n\n\"It gives her an ability to make a few choices and genuinely seem happy and engaged,\" Ms Hannigan said.\n\n\"Whereas everything else, apart from playing in the water … just seems to feel unfamiliar and strange.\"\n\nAnnabelle was born with severe intellectual and physical disabilities.\n\nShe has frequent seizures, is visually impaired, non-verbal and has major developmental delays.\n\nAnnabelle Hannigan's mother says music makes the four-year-old happy and engaged. (ABC News: Danielle Bonica)\n\nWhen she was born, doctors didn't know what had caused Annabelle's disabilities.\n\nThey could only say it was an undiagnosed genetic condition.\n\n\"I think you can't help but question whether or not it's something that I did wrong in the pregnancy that meant that happened,\" Ms Hannigan says.\n\nDoctors had been unable to tell Kiera Hannigan what had caused her daughter Annabelle's disabilities. (ABC News: Danielle Bonica)\n\nBut last year Annabelle's parents got unexpected news.\n\nBritish researchers, led by associate professor Nicky Whiffin at Oxford University's Big Data Institute, were conducting genome sequencing of DNA samples.\n\nThey were looking for patterns in the data to try to find DNA changes that caused rare diseases.\n\nDr Whiffin said her team had used a large UK genetics dataset, Genomics England, to support the research.\n\n\"[This is] a large DNA sequencing project based here in the UK which includes a large number of individuals with different rare disorders and also cancer and their full DNA sequence,\" Dr Whiffin said.\n\n\"Whilst doing that, a student in my team, Yuyang Chen, came across a specific variant in a very small gene called RNU4-2 that explains a large proportion of undiagnosed neurodevelopmental disorders.\"\n\nOxford University researcher Nicky Whiffin led the team that discovered the RNU4-2 variant. (Supplied)\n\nThey immediately found the same variant in multiple DNA samples of people who were previously undiagnosed. They shared similar dysmorphic facial features and were characterised by the same kind of developmental delays.\n\n\"It was very, very clear, very quickly that we found something that was really important,\" Dr Whiffin said.\n\nAbout 30 cases of ReNU syndrome found in Australia\n\nThe team shared their findings with other genetic researchers around the world, who immediately uncovered hundreds of cases, including a number in Australia.\n\nDr Whiffin predicted there would be roughly 1,000 cases of what has been dubbed ReNU or \"ReNU syndrome\" in Australia alone.\n\nSo far around 30 cases have been confirmed nationally, including Annabelle in Melbourne.\n\nAnnabelle Hannigan's mother says the four-year-old \"lights up\" around music. (ABC News: Danielle Bonica)\n\n\"We think there's probably about 100,000 individuals worldwide that have ReNU syndrome, and it explains about half a per cent of all neurodevelopmental disorders,\" Dr Whiffin said.\n\nMaya Pinn from the support group \"Syndromes Without A Name\", or SWAN, said approximately half of all children with neurodevelopmental disorders would not have a diagnosis in their lifetime.\n\nShe said 50 per cent would also receive a misdiagnosis.\n\nMaya Pinn says around half of children with neurodevelopmental disorders won't have a diagnosis. (ABC News: Sacha Payne)\n\n\"Having a 'SWAN' child impacts every single part of your life,\" she said. \"You feel like you're in limbo land, it's like trying to hit a piñata with a blindfold on.\"\n\n\"You're hitting everything but the piñata and you don't know where to go next.\"\n\nAdelaide woman Sarah Warwick was resigned to never knowing what had caused her 16-year-old daughter Abbey's disabilities.\n\n\"It was very, very lonely,\" she said. \"You have to develop a whole lot of resilience and determination to keep going, because often there's no clear path.\"\n\nSarah Warwick (middle) watches her daughter, Abbey, as she takes part in a session with speech therapist Kate Munro. (ABC News: Stephen Opie)\n\nMs Warwick said she tried connecting with other families with children with special needs, but nothing was specific to her experience.\n\n\"They were getting diagnoses and they found their people and their community, and we never had that,\" she said.\n\nEfforts underway to find ReNU syndrome treatment\n\nAbbey was one of the first to be diagnosed in Australia, after Dr Whiffin contacted fellow researcher Daniel MacArthur at the Centre for Population Genomics in Sydney — a joint project between the Murdoch Children's Research Institute and the Garvan Institute of Medical Research.\n\nAfter getting the call from an excited Dr Whiffin, Professor MacArthur asked the head of the centre's rare diseases team to screen their patient database for the RNU4-2 mutation.\n\n\"Within 20 minutes he was able to come back and say, 'we have now found six families with diagnoses involving exactly that same gene',\" Professor MacArthur said.\n\nProfessor Daniel MacArthur says the discovery of the RNU4-2 mutation should allow children to be diagnosed soon after birth. (ABC News: Liam Patrick)\n\nHe said the discovery had already changed clinical practice worldwide.\n\n\"If there is a new child who's born that has a developmental disorder and they're given DNA sequencing, we should now pick this up as a matter of course and they should get a diagnosis very quickly,\" he said.\n\nThe next step is towards treatments, but while Professor MacArthur conceded this could be difficult, he remained hopeful of further breakthroughs.\n\n\"There are at least two pharmaceutical companies that are actively pursuing potential therapeutics for this disease,\" he said.\n\n\"That means there's a pretty good chance that patients with ReNU syndrome around the world at some point over the next five years will actually have access to treatments that could reduce or even substantially reduce the impact.\"\n\nDr Whiffin is slightly more circumspect.\n\n\"I'm very hopeful that there'll be a quick route towards a treatment, but hesitant to promise too much, because there's a lot of challenges on that road,\" she said.\n\n'Elation' as communities form around diagnosis\n\nFor Sarah Warwick, the most important part of the discovery was knowing she wasn't alone.\n\n\"It was just absolutely amazing to see pictures of photos of children who really resembled Abbey and who had similar facial features, similar challenges, both medical and developmentally,\" she says.\n\nAfter years without answers, Sarah Warwick has started a support group for families of children with ReNU syndrome. (ABC News: Stephen Opie)\n\n\"There's overwhelm, there's kind of elation that you've got an answer that you didn't think that you'd get,\" she said tearfully.\n\nMs Warwick started a Facebook group called the ReNU Syndrome Family Support Network (Australia) and is travelling to Long Island in New York later this year for the first global conference on the disease.\n\nShe said her new network had been invaluable.\n\n\"It was just really nice to find people who had trod a similar path to us and look at things that had worked for their families and talk to people who really got it,\" she said.\n\nShe said the diagnosis had also provided reassurance for the rest of Abbey's family.\n\n\"Our son is now at the same level of risk factor for having a baby with a disability as the general population. Those results were profound for me almost immediately on that first phone call to our geneticist.\"\n\nKiera Hannigan said she had resolved any notion that she might have contributed to her daughter's disability.\n\n\"You can really set that aside and know that it's a mutation, and lots of different mutations can happen when a baby is growing,\" she said.\n\nKiera Hannigan says the discovery has dispelled her fears that she may have done something to cause Annabelle's disabilities. (ABC News: Danielle Bonica)\n\n\"It's something called 'de novo', which means it really just happens by chance. It doesn't happen because it's been inherited somewhere from anyone in the family.\"\n\nBut she is also pragmatic about Annabelle's future.\n\n\"We understood that she had a genetic condition that would be lifelong but you are always trying to get your head around what your life will look like. That's the hardest part to comprehend,\" she said.\n\nDr Whiffin described the discovery as a \"once-in-a-career-type achievement\".\n\n\"It's the reason I do my job, to try and make a difference to families like these and to make such an impact overnight was pretty incredible.\"",
    "source": "ABC",
    "cluster_id": 21
  },
  {
    "url": "https://www.abc.net.au/news/2025-04-20/graziers-and-environmentalists-clash-over-buffel-grass/105145268",
    "title": "Industry backbone or massive threat? Debate rages over buffel grass",
    "publish_date": "Sat, 19 Apr 2025 21:37:26 +0000",
    "category": "finance",
    "authors": [],
    "text": "Whether you know it or not, there's a pretty good chance you've seen buffel grass if you live on the Australian mainland.\n\nEnvironmental groups and the cattle industry are at odds over a nomination to make the long, lush, green-stemmed plant with the purple flower a weed of national significance (WONS).\n\nA ruling could be made by the end of this year and interest groups are calling for their voices to be heard as authorities deliberate.\n\nBuffel grass was introduced to Australia in the late 19th century. (Supplied: Jenny Milson)\n\nBuffel grass was introduced to Australia in the 1870s by Afghan cameleers and in the 1920s it was planted across Australia's arid landscapes, becoming a pivotal pasture for the cattle industry.\n\nAs it spread through cattle country, buffel grass began to outcompete native flora and fauna and it has already been declared a weed in the Northern Territory and South Australia.\n\nThe nomination of buffel grass for WONS declaration has sparked outrage across the cattle industry, but environmental groups including the Invasive Species Council (ISC) strongly support the listing.\n\nCarol Booth says a WONS declaration will not put the beef industry at risk. (Supplied: Invasive Species Council)\n\nISC policy director Carol Booth said it was one of Australia's worst weeds and was able to rapidly infiltrate a wide variety of landscapes and suppress native flora.\n\n\"Buffel's been recognised as a threat to more than 30 threatened species,\" she said.\n\n\" It's a massive environmental threat. \"\n\nDr Booth said the beef industry was not at risk because management plans would only be implemented on non-pastoral lands.\n\n\"It's not about changing the legal status of it and stopping graziers using it … but it will help with the harmful consequences of buffel grass for others,\" she said.\n\nTagalaka man Victor Steffensen says buffel grass threatens native plants. (Supplied: Victor Steffensen)\n\nVictor Steffensen, a Tagalaka man from the Gulf Savannah and co-founder of Indigenous cultural knowledge network Firesticks, said the weed created challenges for fire management.\n\n\"We do try and encourage farmers to change buffel grass and get a good mixture of grasses in there too,\" he said.\n\n\" It's extremely important that we work together. \"\n\nCattle Australia chair Garry Edwards says buffel grass is crucial for the beef industry. (Supplied: Cattle Australia)\n\n'Absolute disaster'\n\nCattle Australia chair and grazier Garry Edwards said a WONS declaration would have a massive impact on the industry and strongly disagreed with claims to the contrary.\n\n\"My level of trust on that type of statement is incredibly low, because if we're serious about this there would have been more meaningful discussions,\" he said.\n\n\"We should be putting buffel grass up for an Order of Australia medal … that's the type of impact it's had on regional and rural communities and the nation as a whole.\n\n\" There's literally billions upon billions of economic value and landholding that's attached to the fact that buffel grass exists. \"\n\nBuffel grass can pose fire management challenges, critics say. (ABC News: Nathan Coates)\n\nMr Edwards said buffel grass could help to rehabilitate mined land and reduce erosion.\n\n\"Areas, particularly in the centre part of Australia where buffel grass has more recently entered those landscapes, has actually reduced erosion tremendously,\" he said.\n\nGraziers worry the industry will need to engage in management or eradication efforts on their property if the WONS nomination is successful.\n\n\"It would be an absolute disaster for everybody, whether you live in North Queensland or Brisbane,\" Mr Edwards said.\n\nRangeland agronomist Jenny Milson says there needs to be a clear and reasoned debate about buffel grass. (ABC News: Crispian Yeomans)\n\nUncertain impacts\n\nBuffel grass must be recognised as a \"priority current and future weed threat to Australia\" if a WONS declaration is to be made.\n\nJenny Milson, who has been a rangeland agronomist in outback Queensland for 35 years, says it is a complex issue and both sides have legitimate concerns.\n\nShe said it was uncertain what impact a WONS declaration would have on graziers.\n\n\"Once something's declared a WONS the consequences are fairly unclear for people and I think that's what causes a lot of concern,\" she said.\n\nMs Milson said a significant question would be whether it would affect the ability to buy or plant buffel grass.\n\nBuffel grass has been declared a weed in the Northern Territory. (Supplied: Arid Lands Environment Centre)\n\nShe understood the fears about buffel grass being able to form monocultures after fires but said it was the \"backbone\" of the cattle industry.\n\n\"The main thing that really concerns me at the moment is we need to have equitable, reasonable debate and make sure it's coming from both sides,\" she said.\n\n\" I don't know what the solution is, but I believe there are solutions. \"\n\nThe federal Department of Agriculture, Fisheries and Forestry said no consideration had been given as to what might follow a declaration and that state and territory governments had discretion for their own management.\n\nA spokesperson said a plant was only considered a weed when it required some form of action to reduce its negative effects.\n\n\"A pasture grass providing benefits as feed for livestock is not considered a weed,\" they said in a statement.\n\nBut they said the plant would be considered a weed if it was found in a national park and was outcompeting native plants.",
    "source": "ABC",
    "cluster_id": 22
  },
  {
    "url": "https://www.abc.net.au/news/2025-04-20/safe-seat-disruptors-changing-political-landscape/105191762",
    "title": "How a safe seat gets flipped by a disruptor",
    "publish_date": "Sat, 19 Apr 2025 21:24:03 +0000",
    "category": "finance",
    "authors": [],
    "text": "From Victoria's scenic south-west to the seaside suburbs of Perth in Western Australia, electorates that were once strongholds for the Labor and Liberal parties are witnessing a historic shift.\n\nTraditionally safe seats are flipping around the country, as voters put their hopes and dreams in independent and non-major party candidates.\n\nBut it takes more than just hopes and dreams to create a seismic political shift that flies in the face of decades of voting history.\n\nSo what does it take for a challenger to pose a real threat to a safe seat?\n\nLess support for major parties\n\nDeakin University senior politics lecturer Geoff Robinson said falling levels of support for major political parties had opened up space for independent political forces across Australia.\n\n\"Less than 60 per cent of voters now claim an allegiance to one of the major parties,\" Dr Robinson said.\n\nWho are the independents and what do they stand for? Photo shows A middle aged white woman tinted blue and an old white man tinted yellow Like their name suggests, an independent MP is separate from any party, with their own individual policies and views. Here's a guide to who's who.\n\nAnd even if these voters had previously voted for one party, Dr Robinson said those allegiances might not be as strong as they used to be.\n\nHe said general dissatisfaction with the performance of major party candidates and the perception that safe seats received less funding than marginal seats could be factors fuelling the change.\n\nMarketing strategist Toby Ralph said seats that were ripe for a challenge often had a high number of tertiary-educated people, more professional women, and more younger people.\n\n\"Very often those parties will have a tired alternative who is forced into toeing the party line and there will be discontent there,\" he said.\n\nDemographic changes, such as the sea-change phenomenon, have also changed the voter base.\n\nThe 'three Ps' of disruption\n\nMr Ralph said successfully flipping a safe seat came down to three factors: patience, patrons, and preferences.\n\nHe said patience involved waiting for a candidate to make an error, or for the public to grow tired or unhappy with the incumbent.\n\nPolitics Explained Photo shows Claudia Long appears looking confused looking towards the words Politics Explained with the ABC logo below it. It's been a minute since the last election. Need a refresher? Politics Explained has got you covered with everything you need to know about politics and parliament. Stream now on ABC iview.\n\n\"You've got to wait for someone to stuff up — either the candidate or the party — as that gives you the opportunity to harness discontent,\" Mr Ralph said.\n\nPatrons — or in other words, cashed-up supporters — are also key because running successful campaigns takes a lot of money.\n\nOne prominent patron in recent years has been the Climate 200 group, which has financed independent candidates who support a science-based response to climate change.\n\nIn 2022, the group supported 23 candidates, including 10 successful lower house candidates — six were newly elected and four were existing independents.\n\nMonique Ryan won her Kooyong seat in 2022. (AAP: Luis Ascui)\n\nThis included Monique Ryan, who won the Victorian seat of Kooyong, which had been held by the Liberals since the end of World War II; Kate Chaney, who won Curtin in WA and ended 25 years of Liberal control; and Zali Steggall, who unseated Tony Abbott in 2019 in Warringah, NSW, a safe Liberal seat for about half a century, and was re-elected in 2022 with an increased margin.\n\nAmong the beneficiaries of Climate 200 backing this election is independent Alex Dyson, who has a fundraised war chest of more than $1 million for his third tilt at the Wannon electorate in south-west Victoria, which has been a Liberal stronghold for 70 years.\n\nIndependent candidate Alex Dyson is taking his third run at the seat of Wannon. (Supplied)\n\nOf that money, Climate 200 donated about $485,000.\n\n\"First time round, Alex Dyson spent $20,000, second time round he spent $90,000, and this time he's raised more than a million,\" Mr Ralph said.\n\nIn response, the Liberal Party is spending more in the seat too — local media reports suggest incumbent MP Dan Tehan has spent $750,000 on the campaign, or roughly five times the usual amount.\n\nLiberal MP Dan Tehan has held the Wannon seat since 2010. (ABC News: David Sciasci)\n\nA similar scene is playing out in Cowper on the New South Wales north coast, held by the National Party since 1983.\n\nIn 2022, independent Caz Heise gained 47.68 per cent of the preference count, close behind incumbent Pat Conaghan's 52.32 per cent.\n\nBut it's not just independents splashing the cash and targeting Labor and Liberal in an effort to disrupt the voting status quo.\n\nIn the Victorian seat of Bendigo, where Labor has reigned since 1998, Labor incumbent Lisa Chesters is seeing a well-funded campaign coming at her from the National Party, which hasn't fielded a candidate in the seat since 2016.\n\nThe Nats preselected former local publican Andrew Lethlean way back on July 1, 2024, and he's hit the hustings a couple of times with Nationals leader David Littleproud in tow and big funding promises at the ready, all aimed at cashing in on a perceived backlash against the state Labor government.\n\nHowever, funding does not always equate to success.\n\nClive Palmer’s United Australia Party spent $123 million on campaigning in the 2022 election, only to secure one seat in the Senate, Mr Ralph said.\n\nPreference flows\n\nLast but not least are the all-important preferences.\n\nMr Ralph said preference flows were vital in getting a candidate over the line, including the role of so-called 'preference whisperers' who try to negotiate agreements around preferences.\n\nTeals in regional Qld Photo shows Graphic of six women with an image of Queensland in the background. Deep in Queensland's blue-blood heartland, six women want to dismantle decades of LNP supremacy.\n\n\"We're now in a situation where one-third of votes will go to Liberal, one-third will go to Labor, and one-third will go to minors and independents, so the distribution of preferences is incredibly important,\" he said.\n\nMr Ralph pointed to Wannon, where in 2022 Mr Tehan gained 44.5 per cent of the primary vote count and Mr Dyson gathered 19.3 per cent.\n\nBy the time preferences were distributed, Mr Tehan hung on to the seat with 53.9 per cent of the preference count, while Mr Dyson had 46.1 per cent.\n\nIn the Brisbane electorate in Queensland, preferences were the decider in the Greens flipping the previously Liberal-held seat, after Greens candidate Stephen Bates gained 53.7 per cent of the vote after preferences.\n\nStephen Bates won the Brisbane electorate for the Greens in 2022. (ABC News: Rachel Stewart)\n\nAustralian National University political marketing expert Andrew Hughes said challengers needed to gather momentum and at least 10 per cent of the primary vote to be considered a preference ally.\n\nCandidates must also be careful about which parties or candidates they aligned with on preferences, to ensure they did not alienate voters.\n\n\"It's not just about getting the right numbers across the line from anywhere and anyone,\" Dr Hughes said.\n\n\" People will raise questions about what you really do stand for if you're running for climate change [yet] you do a deal with someone who's running for more coal mines. \"\n\nDr Hughes said non-major party candidates taking on an incumbent also must begin their campaign early, to build a public profile.\n\nGrassroots campaigning\n\nMr Ralph said successful candidates tended to run strong grassroots campaigns built around activities such as door-knocking and setting up corflutes around an electorate.\n\nCandidates also needed to bridge the gap between niche local issues and the bigger picture of the national agenda — in other words, fixing a school fence while also addressing housing, cost of living or climate change.\n\nDr Hughes said it was grassroots campaigning that led to the 2013 victory of Cathy McGowan in the Victorian seat of Indi, which had been in Liberal hands since 1977.\n\nFormer independent MP Cathy McGowan won the seat of Indi in 2013. (ABC News)\n\nHe said Ms McGowan began her 2013 campaign in small rural towns by meeting with residents who often felt neglected by federal politicians.\n\n\"She sat down, listened and heard their concerns, then her campaign reflected that,\" Dr Hughes said.\n\n\"Meeting smaller communities shows you're willing to be at their level in their community.\n\n\"Even if [the issue or concern] might be very minor on a national agenda, that is powerful.\"\n\nLoading\n\nLoading...\n\nHaving trouble seeing this form? Try this link.",
    "source": "ABC",
    "cluster_id": 23
  },
  {
    "url": "https://www.smh.com.au/national/bob-katter-shares-easter-message-20250420-p5lszr.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Bob Katter shares Easter message",
    "publish_date": "Sun, 20 Apr 2025 12:04:43 +1000",
    "category": "finance",
    "authors": [],
    "text": "Bob Katter shares Easter message\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 24
  },
  {
    "url": "https://www.smh.com.au/business/the-economy/my-easter-sermon-how-we-trump-proof-our-society-20250420-p5lsxv.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "My Easter sermon: How we Trump-proof our society",
    "publish_date": "Sun, 20 Apr 2025 11:14:54 +1000",
    "category": "finance",
    "authors": [
      "Ross Gittins"
    ],
    "text": "Since it’s Easter, and we’ve got the day off – and politicians have gone to ground – it’s a good time for, if not religious observance, then at least a little moral reflection.\n\nAccording to The Economist magazine, Christianity is struggling across the developed world. The Americans seem more devout than other English-speaking countries, but since the turn of the century, church attendance there has fallen from 70 per cent of people to 45 per cent. In Italy, home of Catholicism, the number of churchgoers has shrunk by almost half over the past decade.\n\nUS President Donald Trump and his tariff madness may play a big part in this election’s outcome. Credit: AP\n\nOf course, churchgoing and religious identification aren’t quite the same thing. For example, I still put myself down as Salvation Army on the census, which would come as a surprise to my local minister. As a mate explained it, “you can take the boy out of the Salvos, but you can’t take the Salvos out of the boy”.\n\nAnyhow, here in Oz, according to the 2021 census, the proportion of people identifying as Christian has fallen from 61 per cent to 44 per cent in a decade, with those reporting “no religion” rising from 22 per cent to 39 per cent.",
    "source": "SMH",
    "cluster_id": 25
  },
  {
    "url": "https://www.smh.com.au/environment/weather/national-weather-forecast-for-sunday-april-20-20250420-p5lsz9.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "National weather forecast for Sunday April 20",
    "publish_date": "Sun, 20 Apr 2025 10:34:23 +1000",
    "category": "finance",
    "authors": [],
    "text": "National weather forecast for Sunday April 20\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 26
  },
  {
    "url": "https://www.smh.com.au/sport/afl/hardwick-clips-victorian-premier-over-balta-comments-20250420-p5lsz2.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Hardwick clips Victorian premier over Balta comments",
    "publish_date": "Sun, 20 Apr 2025 10:08:02 +1000",
    "category": "finance",
    "authors": [],
    "text": "Hardwick clips Victorian premier over Balta comments\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 27
  },
  {
    "url": "https://www.smh.com.au/sport/rugby-union/post-to-the-rescue-as-force-draw-with-hurricanes-20250420-p5lsyx.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Post to the rescue as Force draw with Hurricanes",
    "publish_date": "Sun, 20 Apr 2025 09:54:10 +1000",
    "category": "sports",
    "authors": [
      "Justin Chadwick"
    ],
    "text": "The Western Force have escaped with a 17-17 golden-point draw against the Hurricanes – and they had the post to thank for it.\n\nIn a pulsating finish to Saturday night’s Super Rugby Pacific match in Perth, Force flyhalf Ben Donaldson nailed a 39-metre penalty in the 78th minute to level the scores and send it into a super-point period.\n\nWhichever team scored first in the 10 minutes of extra time would win the game, and Donaldson’s 51-metre penalty attempt in the third minute drifted out to the left.\n\nRuben Love (10) had a chance to kick the Hurricanes to a golden-point win but hit the post. Credit: AAP\n\nDonaldson had another crack a few minutes later, but his drop-goal attempt from 30 metres was charged down.",
    "source": "SMH",
    "cluster_id": 28
  },
  {
    "url": "https://www.smh.com.au/national/vegemite-back-on-the-menu-at-canadian-coffee-shop-20250420-p5lsyj.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Vegemite back on the menu at Canadian coffee shop",
    "publish_date": "Sun, 20 Apr 2025 09:05:24 +1000",
    "category": "finance",
    "authors": [],
    "text": "Vegemite back on the menu at Canadian coffee shop\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 29
  },
  {
    "url": "https://www.smh.com.au/sport/fourteen-year-old-cricket-prodigy-smashes-his-first-ball-in-ipl-for-six-20250420-p5lsy6.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Fourteen-year-old cricket prodigy smashes his first ball in IPL for six",
    "publish_date": "Sun, 20 Apr 2025 08:44:39 +1000",
    "category": "sports",
    "authors": [
      "Bilal Kuchay",
      "Will Macpherson"
    ],
    "text": "The story of the 14-year-old earning £100,000 in the IPL Sanjeev Suryavanshi was glued to the television watching the Indian Premier League auction taking place thousands of miles away in Saudi Arabia. It was the evening of November 25 and Sanjeev was praying that his then 13-year-old son, Vaibhav, would be picked up in the IPL, the tournament in which the world’s top cricketers earn life-changing money for just a couple of months’ work. At 8pm local time, it was Vaibhav’s turn to go up under the hammer. Delhi Capitals made the first move with a bid that sent Sanjeev running and jumping around the room in jubilation. And the offers kept coming as a bidding war ensued, with Rajasthan Royals eventually coming out on top with a price of £100,000. Hundreds of neighbours and relatives, who were watching the auction on their smartphones outside the Suryavanshis’ two-storey house, hugged each other, handed out sweets and set off firecrackers as Vaibhav made history by becoming the youngest player ever picked for the IPL.\n\nVaibhav Suryavanshi is a young superstar. “I just wanted my son to be selected. For how much, that question never occurred to me,” 51-year-old Sanjeev tells Telegraph Sport at his home in Tajpur, a village in Bihar’s Samastipur district, where most of the locals are involved in farming. Rahul Dravid will be Vaibhav’s coach, while England’s Jofra Archer and Indian superstar Yashasvi Jaiswal will be team-mates. Dravid heaped praised on the teenager after the auction. “He [Vaibhav] has some really good skills, so we thought it might be a good environment for him to grow in. He came to our trials and we were really happy with what we saw.” India’s latest cricket prodigy, following in the footsteps of the likes of Sachin Tendulkar, has broken records left, right and centre. As well as being selected for the IPL, Vaibhav made history by becoming the youngest player to make his debut in the Ranji Trophy, the domestic first-class competition, and to represent his home state of Bihar in the domestic T20 championship. Last November, during a four-day match against Australia Under-19s in Chennai, the left-handed opener also smashed 104 off just 62 balls, reiterating his class against players six years his senior.\n\nTalking to the locals in Tajpur, everyone raises Vaibhav’s talent and dedication, but also the father’s resilience and determination to ensure his son’s dream came true. Vaibhav was taken by his dad aged six to a cricket academy in Samastipur. “The moment I saw him pick up a bat, I realised there is something about him,” Sanjeev says, whose constant ferrying of his son to cricket camps and matches meant he eventually had to close the family’s jewellery business. He now does a spot of farming in among mentoring the boy’s cricket career. Cricket prodigy Vaibhav Suryavanshi has created history. Throughout the boy’s childhood, Sanjeev would regularly buy three new cricket balls at $2 apiece in a region where a third of families make ends meet on a daily income of just $3.60. He would throw the balls at his son in the nets he built outside their house and invited bowlers from the village, often twice his age, to ping deliveries at him.\n\nHe also extended the invitation to faster bowlers from other parts of the district, and would pay them travel expenses to test his son. Some of these adults would whizz the ball down at 80mph, despite Vaibhav being only nine years old. “I would get scared, but I knew if I stopped, my son his career would be over,” Sanjeev explains. “Villagers would say I’m putting a heavy bet on my son. Because playing cricket was costing Vaibhav his studies and they would ask what job would he get if he didn’t succeed in cricket. But I knew he had the talent. Otherwise I would not have invested so much time and resources on him. “I may not have played at professional level but I’ve seen enough to understand what is required. I never let him play with any [softer] ball because I wanted him to play professional cricket.” At 11, Vaibhav smashed a double hundred in a 40-over match. A few months later, he scored an unbeaten 332 in an under-19 ODI tournament in Bihar.\n\nRajasthan Royals’ Vaibhav Suryavanshi plays a shot during his Indian Premier League cricket debut. Credit: AP Rakesh Tiwari, the Bihar Cricket Association president, said Vaibhav’s talent compelled them to pick him in big tournaments. Many criticised them for selecting a 12-year-old but Tiwari did not have to justify his decision for long. “His bat silenced every critic.” Vaibhav has modelled his game on another left-hander in Brian Lara, whom he describes as his “idol”. He is also a fan of Virender Sehwag and Yuvraj Singh, the free-flowing former Indian cricketers. Vaibhav’s first coach in Samastipur, Brajesh Kumar Jha, says it gave him great pride that a player from his academy had made it to the IPL. He describes Vaibhav as a very hard-working cricketer who never backs down. “He is a quick learner, a naturally attacking batsman and adapts quickly to situations... and behind his success lies determination and hard work.” He adds that Vaibhav would practise for several hours a day in searing Indian summer heat, proving his toughness.\n\n“The success people see is purely the result of Vaibhav’s hard work,” Jha explains. “When a player from a small district like Samastipur, who would play here with all these young boys, makes it to the IPL, where he will get a chance to share the field or dressing room with greats of the game like Virat Kohli or Rahul Dravid, it’s a dream, not just for that cricketer but a coach like me too. “You can’t explain how it feels to see him reach that level. It’s the dream I too had growing up but couldn’t fulfil.” Loading Vaibhav’s success at such a young age is already changing the game and inspiring those even younger than him.",
    "source": "SMH",
    "cluster_id": 16
  },
  {
    "url": "https://www.smh.com.au/sport/motorsport/norris-crashes-in-jeddah-qualifying-20250420-p5lsya.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Norris crashes in Jeddah qualifying",
    "publish_date": "Sun, 20 Apr 2025 08:38:34 +1000",
    "category": "sports",
    "authors": [],
    "text": "Norris crashes in Jeddah qualifying\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 30
  },
  {
    "url": "https://www.smh.com.au/sport/nrl/robinson-frustrated-over-props-injury-20250420-p5lsxu.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Robinson frustrated over prop's injury",
    "publish_date": "Sun, 20 Apr 2025 06:14:11 +1000",
    "category": "sports",
    "authors": [],
    "text": "Robinson frustrated over prop's injury\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 31
  },
  {
    "url": "https://www.sbs.com.au/news/article/diffusing-the-timebomb-greens-put-negative-gearing-in-sights-in-minority-government/suiqygnpu",
    "title": "'Diffusing the timebomb': Greens put negative gearing in sights in minority government",
    "publish_date": "Sun, 20 Apr 2025 02:02:58 +0000",
    "category": "finance",
    "authors": [],
    "text": "Greens leader Adam Bandt has signalled he wants discussions on changes to negative gearing and capital gains tax to be a priority in the next parliament, asking Treasury to prepare a 'green book' of policy information for the Greens.\n\n\n\n\n\nNegotiating with the crossbench would be a necessity if the election results in a minority government, which polls indicate is a possibility.\n\n\n\n\n\nThe Greens party is fighting to retain three out of its four lower house seats at the May election.\n\n\n\n\n\nGovernment departments are required to prepare a 'red book' and a 'blue book' of briefings for the Labor and Liberal parties respectively, which they only receive if they win the next election.\n\n\n\nConfident of a minority government, Bandt said the public service should \"get cracking\" on a Green book, with updated and expanded modelling on negative gearing and capital gains tax.\n\n\n\n\n\n\"Experts have panned the major parties' housing policies as a 'dumpster fire' that will push up house prices even further, and with millions of people realising we can't keep voting for the same two parties and expecting a different result,\" he said.\n\n\n\n\n\n\"We now have a chance for real reform that will level the playing field for first home buyers.\"\n\n\n\n\n\nSpeaking on the ABC's Insiders program, Bandt said reforms to improve the country were coming from the crossbench.\n\n\n\n\n\n\"In the late 1990s, John Howard's capital gains tax discount really lit a fire under the housing market,\" Bandt said.\n\n\n\n\n\n\"We've got to diffuse this time bomb in a way that is fair.\"\n\n\n\nWhat is the Greens' housing policy?\n\nAs well as scrapping negative gearing discounts, the Greens policy would abolish the existing capital gains tax concession for more than one property.\n\n\n\n\n\nThe capital gains tax is applied when selling an asset like a house after owning it for at least 12 months — sellers can claim a 50 per cent tax discount on any profit made from the sale of assets, which include stocks, bonds, jewellery and real estate.\n\n\n\n\n\nNegative gearing is the ability of an investor to offset any income from an investment against any losses or costs involved in maintaining it — meaning they could pay less income tax.\n\n\n\n\n\nA Parliamentary Budget Office analysis in June last year revealed that the tax revenue foregone as a result of these two concessions had risen from $6.7 billion in the 2014-15 financial year to $10.9 billion in the 2023-24 financial year. That figure is expected to be $12.3 billion in 2024-25.\n\n\n\nLiberal housing spokesperson Michael Sukkar defended negative gearing as \"a standard feature of our tax system\".\n\n\n\n\n\n\"Where you tax housing more, you get fewer homes and you get higher rents,\" Sukkar said.\n\n\n\n\n\n\"That will be terrible for renters and terrible for first home buyers, too, who, in the end, will have fewer homes to choose from.\"\n\n\n\n\n\nHousing policy has dominated the election campaign, with both Labor and the Coalition promising to help Australians get on the property ladder through access to new builds.\n\n\n\n\n\nAt a leader's debate this week, Opposition leader Peter Dutton accused Anthony Albanese of having \"a problem with the truth\" when the prime minister denied that the government had requested Treasury modelling on negative gearing and capital gains tax last year, despite comments from the Treasurer last year appearing to confirm the request.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 32
  },
  {
    "url": "https://www.sbs.com.au/news/video/leaders-converge-at-the-easter-show-promising-penalty-rate-protections-small-business-tax-breaks/h66uvy0jp",
    "title": "Leaders converge at the Easter Show promising penalty rate protections & small business tax breaks",
    "publish_date": "Sun, 20 Apr 2025 01:58:02 +0000",
    "category": "finance",
    "authors": [],
    "text": "Leaders converge at the Easter Show promising penalty rate protections & small business tax breaks\n\nPublished 20 April 2025, 1:39 am\n\nLabor has pledged to protect penalty rates for workers, by putting them into law. The Coalition labelled that a stunt, instead pitching millions in tax breaks for small business. SBS Political correspondent Sara Tomevska joins us live, along with Tom Stayner who's travelling with the prime minister.",
    "source": "SBS",
    "cluster_id": 33
  },
  {
    "url": "https://www.sbs.com.au/news/article/australia-is-cutting-its-number-of-atms-but-this-island-country-just-got-its-first-one/1g79mwhz9",
    "title": "Australia is cutting its number of ATMs. This island country just got its first one",
    "publish_date": "Sun, 20 Apr 2025 01:01:39 +0000",
    "category": "finance",
    "authors": [],
    "text": "Tuvalu, a remote country in the South Pacific with a population of around 12,000 people, has officially launched its first automated teller machines (ATMs) and electronic payment system in a move that marks a major milestone in the nation's financial future.\n\n\n\n\n\nUntil now, residents have had to queue at the country's only bank, with long lines often forming outside the National Bank of Tuvalu, particularly on paydays when it closes at 2pm.\n\n\n\n\n\nThis week, the Tuvalu government rolled out five ATMs and 30 EFTPOS terminals across its capital city, Funafuti.\n\n\n\nThe $3 million initiative is designed to bring more accessible banking options to the locals, many of whom have had to rely exclusively on cash.\n\n\n\n\n\nTuvaluan Prime Minister Feleti Teo celebrated the country's new system as a \"significant milestone\".\n\n\n\n\n\nSiose Teo, general manager of the National Bank of Tuvalu, described the launch as a \"transformative step\" that he believes will help unlock new opportunities for the economic empowerment of Tuvalu’s people.\n\n\n\nAustralia's ATM closures\n\nIn Australia, the number of ATMs has been steadily declining.\n\n\n\n\n\nIn 2019, there were 29,348 ATMs across the country.\n\n\n\n\n\nBy March 2024, that number had dropped to 23,518 — reflecting a growing shift in how Australians choose to pay.\n\n\n\n\n\nWith contactless and other digital payment methods becoming more popular, fewer people are using cash, and fewer are visiting ATMs.\n\n\n\n\n\nFor the latest from SBS News, download our app and subscribe to our newsletter .\n\n\n\n",
    "source": "SBS",
    "cluster_id": 34
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/albanese-dutton-spar-on-small-business-and-penalty-rates-evening-news-bulletin-19-april-2025/0abcxc8ic",
    "title": "Albanese & Dutton spar on small business and penalty rates | Evening News Bulletin 19 April 2025",
    "publish_date": "Sat, 19 Apr 2025 06:00:00 +0000",
    "category": "finance",
    "authors": [],
    "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nPrime Minister Anthony Albanese says that if re-elected, his government will legislate to prevent the reduction of penalty rates in awards.\n\n\n\n\n\nIn a move that Mr Albanese says will ensure the wages of around three million people don't go backwards, the changes will see weekend penalty rates enshrined in law.\n\n\n\n\n\nThe change will prevent the Fair Work Commission from reducing rates in response to employer group applications.\n\n\n\n\n\nSpeaking at the Royal Easter Show in Sydney, Mr Albanese says it's important people are paid properly for working over holiday periods.\n\n\n\n\n\n\"We will support your penalty rates. It shouldn't be taken for granted. One of the things that people rely upon to get by is their penalty rates. I used to work at Pancakes on the Rocks on Saturday night, eleven pm to seven am shift because for penalty rates, that's one of the things that got me through university.\"\n\n\n\n\n\nMeanwhile, Opposition Leader Peter Dutton has rejected the plan.\n\n\n\n\n\n\"The independent umpire sets the conditions. It's been abided to by from both sides of politics, and we don't propose any departure from the current arrangements.\"\n\n\n\n\n\n+++\n\n\n\n\n\nOpposition Leader Peter Dutton has announced tax incentives he says will aid small businesses and revive entrepreneurship, should he win office in the upcoming federal election.\n\n\n\n\n\nThe Coalition has set a target of 350,000 new small businesses to open in four years, supported by a proposed entrepreneurship accelerator scheme.\n\n\n\n\n\nUnder that arrangement, new incorporated businesses would only have to pay tax on a portion of their income in their first three years of operating to encourage reinvestment.\n\n\n\n\n\nMr Dutton says he wants to ensure small businesses can grow in Australia.\n\n\n\n\n\n\"30,000 small businesses have closed under this government, and we want to make sure we can get our economy and our country back on track,if we do that, then we can provide real support to families.\"\n\n\n\n\n\nBut Prime Minister Anthony Albanese says small businesses have been doing better under a Labor government.\n\n\n\n\n\n\"There are more small businesses today than there were when we were elected, we provided significant policy for small businesses, aimed at them.\"\n\n\n\n\n\n+++\n\n\n\n\n\nRussian authorities say Australian man Oscar Jenkins will stand trial on mercenary charges in Russian-occupied Lugansk.\n\n\n\n\n\nThe investigators allege Oscar Jenkins came to Ukraine in February 2024 from Melbourne and then fought against the Russian army between March and December 2024, before being captured in combat.\n\n\n\n\n\nRussia and its eastern Ukraine proxies typically consider foreigners travelling to fight in Ukraine as mercenaries.\n\n\n\n\n\nThis enables them to prosecute fighters under its criminal code, rather than treating them as captured prisoners of war with protections and rights under the Geneva Convention.\n\n\n\n\n\nPrime Minister Anthony Albanese denies Australia has abandoned Mr Jenkins.\n\n\n\n\n\n+++\n\n\n\n\n\nOfficials in Kyiv say Ukraine and Russia have carried out an exchange of soldiers' bodies amid reports of an upcoming prisoner swap.\n\n\n\n\n\nAuthorities responsible for prisoners of war in Ukraine say 909 corpses have been received from Russia.\n\n\n\n\n\nIn exchange, Russian media is reporting that 41 bodies have been received from Ukraine.\n\n\n\n\n\nSources close to negotiations say the swap took place ahead of a planned prisoner swap today which will involve 246 prisoners from either side and will be mediated by the United Arab Emirates.\n\n\n\n\n\n+++\n\n\n\n\n\nThe Health Ministry in Yemen says a U-S strike on a fuel terminal in the country has killed at least 74 people and injured 171.\n\n\n\n\n\nThe attack marks the deadliest strikes on the country since the U-S military commenced a bombing campaign in Yemen in 2024.\n\n\n\n\n\nThe U-S military says it is targeting Yemen's Houthi militant group and vows that it will continue to do so until the group halts attacks on Red Sea shipping.\n\n\n\n\n\nHouthi military spokesman Brigadier General Yahya Saree says the continued attacks on Yemen won't deter support for the Palestinian people.\n\n\n\n\n\nARABIC THEN ENGLISH VO: ”First of all, the American military buildup and the continued aggression against our country will only lead to more resistance operations, targeting, clashes, and confrontation. It will not push Yemen—its proud people and faithful leadership—toward anything but greater resilience and steadfastness in its supportive stance and solidarity with the oppressed Palestinian people\"\n\n\n\n\n\n+++\n\n\n\n\n\nIn football, Arsenal's women's team says they'll be taking inspiration from the club's men's side in tonight's European Champions League semi-final.\n\n\n\n\n\nArsenal's women, including Matildas stars Steph Catley, Caitlin Foord, and Kyra Cooney-Cross, play French side Lyon this evening in the first leg of their Champions League semi-final in London.\n\n\n\n\n\nIt comes just days after Arsenal's men qualified for the semi-finals of their Champions League by beating Real Madrid, based largely off a three goals to nil win in the first leg.\n\n\n\n\n\nArsenal's women's team coach, Renee Slegers, says that sets an example for her side.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 35
  },
  {
    "url": "https://www.sbs.com.au/news/article/peter-dutton-plans-major-tax-breaks-for-new-businesses-plus-labors-penalty-rate-pledge/hmzcecx7h",
    "title": "Dutton plans major tax breaks for new businesses, rejects Labor's penalty rate pledge",
    "publish_date": "Sat, 19 Apr 2025 01:33:00 +0000",
    "category": "finance",
    "authors": [],
    "text": "Key Points The Coalition has set a target to grow the number of small businesses in Australia by 350,000 over four years.\n\nPeter Dutton unveiled staggered three-year tax offsets to help small and family businesses reinvest.\n\nDutton also said he won't support Labor's plan to enshrine penalty rates in law, calling it yet \"another stunt\".\n\nOpposition leader Peter Dutton has announced tax incentives to aid small businesses and revive entrepreneurship, should he win office in the upcoming federal election.\n\n\n\n\n\n\"I want to make sure we can help businesses grow in the most amazing country in the world,\" he said, while at the Royal Easter Show in the Labor-held Sydney electorate of Reid.\n\n\n\n\n\nDutton has set a target of 350,000 new small businesses to open in four years, supported by a proposed \"entrepreneurship accelerator\" scheme.\n\n\n\n\n\nUnder that arrangement, new incorporated businesses would only have to pay tax on a portion of their income in their first three years of operating to encourage reinvestment.\n\n\n\nIn the first year, businesses would pay tax on 75 per cent of the first $100,000 of taxable income and 50 per cent of the second $100,000.\n\n\n\n\n\nIn year two, it will reduce to 60 and 40 per cent respectively.\n\n\n\n\n\nIn year three, it will reduce again to 50 and 30 per cent respectively.\n\n\n\n\n\nAny taxable income above $200,000 will be taxed at the marginal tax rate.\n\n\n\n\n\n\"Someone with a bedroom at the back of the house or part of the garage where they're now producing or they're now providing a service to a bigger company — they want their business to grow,\" Dutton said.\n\n\n\n\n\n\"We want to encourage small business in this country.\"\n\n\n\nIn addition, businesses will be eligible for a \"tech booster\" as part of the overall package.\n\n\n\n\n\nThat denotes a tax deduction of $2,000 for tech upgrades of $4,000 or more, in addition to existing offsets on company tax liability for a given year.\n\n\n\n\n\nEligible businesses include those with an aggregated turnover of less than $10 million and no more than 20 shareholders.\n\n\n\n\n\nProperty developers are specifically excluded.\n\n\n\nLabor's penalty rate 'stunt'\n\nMeanwhile, Dutton has rejected Labor's plan to enshrine penalty rates in law if re-elected.\n\n\n\n\n\n\"If you are after another stunt from the Labor Party, go no further than this,\" he said.\n\n\n\n\n\n\"They'll try and distract people away from the cost of living issue, which is the biggest issue that's facing Australians at the moment.\"\n\n\n\n\n\nLabor's rationale for the change is that it will prevent business groups, such as the Australian Retailers Association, from applying to the Fair Work Commission to cut the provisions from award agreements.\n\n\n\nBut Dutton said it's up to an independent umpire to set the conditions.\n\n\n\n\n\n\"It's been abided by from both sides of politics and we don't propose any departure from the current arrangements,” he said.\n\n\n\n\n\nPrime Minister Anthony Albanese responded to the Opposition leader's comments by saying that Dutton \"wants people to work longer for less\" and that the Coalition \"have never missed an opportunity to undermine the wages and conditions of working people\".\n\n\n\nDutton's bracket creep 'aspiration'\n\nThe announcement for small and family businesses rolls off the back of a late campaign pitch to index personal income tax — a plan which has not been given a timeline.\n\n\n\n\n\nAsked why the policy was mentioned during the back end of the campaign, Dutton said on Saturday that the Coalition had undergone a \"stepped process\" which involved \"going through and looking at different policies and options\".\n\n\n\n\"I want to make sure that we can clean this mess ... and make sure we can introduce the reforms necessary because bracket creep whacks every taxpayer,\" he said, referring to a situation where inflation and wage increases push people into higher tax brackets .\n\n\n\n\n\nBut Dutton earlier described the plan as \"an aspiration\", telling reporters in the NSW Hunter region on Friday that his government will \"get the budget in a position where we will index the bracket.\"\n\n\n\n\n\nAlbanese has taken aim at the comments, saying they made \"no sense\".\n\n\n\n\"I've never seen before in an election campaign an alternative Prime Minister say I’m going to increase income taxes on 14 million taxpayers, but I have an aspiration to do something about it down the track,\" Albanese said on Friday, while campaigning in Brisbane.\n\n\n\n\n\nThe Opposition plans to axe the Albanese government's 26 July tax break , promoting an alternate plan to cut the fuel excise by 25 cents a litre for a year from 1 July this year.\n\n\n\n\n\nFor the latest from SBS News, download our app and subscribe to our newsletter .\n\n\n\n",
    "source": "SBS",
    "cluster_id": 36
  },
  {
    "url": "https://www.sbs.com.au/news/article/pathological-demand-avoidance-a-different-kind-of-autism/qmcuyihun",
    "title": "Pathological demand avoidance: The autism profile growing in recognition",
    "publish_date": "Sat, 19 Apr 2025 01:01:54 +0000",
    "category": "lifestyle",
    "authors": [],
    "text": "Children with this little-known autistic neurotype are often labelled as badly behaved, and their parents' approach to raising them is often questioned.\n\n\n\n\n\nThat's why the recognition of Pathological Demand Avoidance (PDA) in the Australian government's first national autism strategy as a profile of autism earlier this year has been welcomed by many parents and advocates for families of 'PDAers', as many refer to them.\n\n\n\n\n\nChristina Keeble is both of those.\n\n\n\nDysregulation\n\nKeeble worked as a teacher in specialist education settings for years before having her own children.\n\n\n\n\n\nDespite her training and experience in supporting neurodivergent children, none of the conventional strategies seemed to work with hers; Keeble said they actually increased their dysregulation.\n\n\n\n\n\nBoth are autistic and have attention deficit hyperactivity disorder.\n\n\n\nChristina Keeble had worked in specialist education settings for years, but the techniques she had been using to support neurodivergent children did not seem to work for her own kids. Source: Supplied / Jessica Roberts \"Their extreme dysregulation and meltdowns could manifest as crying, physical or verbal aggression, breaking their things, and at its worst, self-harm,\" she said.\n\n\n\n\n\n\"It could last for hours with anything we tried to alleviate their pain or distress not working.\"\n\n\n\n\n\nShe describes her children as neurodivergent PDAers.\n\n\n\nExtreme demand avoidance\n\nChildren who fit the PDA profile may show what are often described as \"challenging behaviours\".\n\n\n\n\n\nThe term PDA was coined by British clinical psychologist Elizabeth Newson in the 1980s, and the PDA Society UK was established in 1997.\n\n\n\n\n\nThe society's website describes PDAers as people who share autistic characteristics but also have a need for control, \"which is often anxiety related\", and states for those with the PDA neurotype, \"demand avoidance is a question of can't not won't\".\n\n\n\n\n\nAustralia's national autism strategy recognises PDA as \"a profile or subtype of autism\".\n\n\n\n\n\nThe national guideline for the assessment and diagnosis of autism in Australia, which was updated in 2023, described PDA as a set of characteristics that can co-occur with autism and is recognised as a behavioural profile within autism.\n\n\n\nRecognition of PDA\n\nPDA is not considered a standalone diagnosis like autism or attention-deficit/hyperactivity disorder , but it sits under autism as a certain presentation shown by some people on the spectrum.\n\n\n\n\n\nWhile not a diagnostic test, the extreme demand avoidance questionnaire exists to measure behaviours associated with the neurotype.\n\n\n\n\n\nIn recent years, some Australian health professionals, such as paediatricians, psychologists and speech therapists, have started mentioning the profile in reports and diagnosis documentation of those who they consider fit the profile.\n\n\n\n\n\nHowever, anecdotes about health professionals and educators telling parents PDA does not exist or is not recognised in Australia have been repeatedly shared in online support groups for those who fit the neurotype and their families.\n\n\n\n\n\nThis is likely why the simple mention of PDA in a blog on the National Disability Insurance Scheme website was shared to the 14,000 followers of the PDA Australia Facebook as \"breaking news\".\n\n\n\nAn Edith Cowan University (ECU) research study released this year on the experience of mothers of children with PDA noted: \"Parents spoke about their experience of interacting with professionals in education and health-care settings who had limited understanding about PDA, invariably leading to misguided advice, poor support, or harmful practices.\"\n\n\n\n\n\nKeeble said while it was \"clear from the research that is available that it is currently a profile, not a stand-alone diagnosis, some professionals choose to not acknowledge it because it is not in the DSM (Diagnostic and Statistical Manual of Mental Disorders) or the ICD (International Classification of Diseases).\"\n\n\n\nLowering demands\n\nThose advocating for increased recognition of PDA believe that making a distinction between autism and those with the PDA profile of the condition is important because it requires a specific approach.\n\n\n\n\n\nThe PDA Society UK describes PDAers as \"driven to avoid everyday demands and expectations [including things they want to do or enjoy] to an extreme extent\".\n\n\n\n\n\nWhile demands in the case of PDAers can be direct requests or questions from others, they can come in different forms. They can be things such as eating, sleeping, and showering, but PDA Society UK explains that indirect demands such as praise, expectations, or uncertainty have the potential to cause anxiety.\n\n\n\n\n\nKeeble said PDA required a different approach to traditional parenting, and not providing PDA informed support could result in harm or trauma being caused to a child.\n\n\n\nThe PDA Society UK encourages a \"proactive and collaborative approach\" to parenting to manage anxiety in PDA children, with a focus on \"picking their battles\".\n\n\n\n\n\nIts website advises: \"In place of firm boundaries and the use of rewards, consequences and praise, an approach based on negotiation, collaboration and flexibility tends to work better in PDA households.\"\n\n\n\n\n\nSome health practitioners have started to take an approach to those who fit the profile that reduces demands.\n\n\n\n\n\nKeeble said once she was able to let go of the notion that things had to be a certain way in her household and with her children, such as everyone must sit at the kitchen table for meals, the stress that had been a constant in her household started to reduce.\n\n\n\n\n\n\"Now, when they have capacity, they naturally participate more with the demands of daily life. For us, it was finding the natural rhythm of our family,\" she said.\n\n\n\n\n\nKeeble is now one of Australia's most well-known voices on PDA and works as a neurodiversity educational consultant.\n\n\n\nREAD MORE What these autistic people want you to call them\n\nA closer look at the DSM\n\nPDA is not mentioned in the DSM, the reference guide for health professionals diagnosing autism or the International Classification of Diseases.\n\n\n\n\n\nThere have been a number of updated versions of the DSM, which have changed with new research and understanding; for example, homosexuality was listed as a diagnosable condition until 1973.\n\n\n\n\n\nThe current version was published in 2013 and is based on research done between 2000 and 2013.\n\n\n\n\n\nDavid Trembath, professor in speech pathology at Griffith University, said he expected a new edition of the DSM would likely be released in the next few years, as they were generally published every 10 to 15 years.\n\n\n\n\n\nHowever, he said he doesn't think PDA would be included in an updated version \"given the lack of an extensive evidence base to support its existence as a separate and sufficiently distinct condition\".\n\n\n\nThe PDA label\n\nTrembath, who is also the co-chair of the group that developed the second edition of the national guideline for the assessment and diagnosis of autism in Australia, said the guidelines recognise \"PDA is a term used by some members of the community to help describe and explain some of the behaviours that are seen in autistic children and adults\".\n\n\n\n\n\nHe said practitioners should be considering all available information to develop a holistic understanding of the person.\n\n\n\n\n\n\"It is not so much about whether the term PDA should be used, and instead all about understanding them as an individual,\" Trembath said.\n\n\n\n\n\n\"The guideline recommends an individualised approach, irrespective of how a person's behaviour is described, so we would say that a 'different approach' is required for each person, irrespective of whether their behaviour is described in terms of PDA or other terms.\"\n\n\n\nThe National Autism Strategy, which was launched in Perth in January by Social Services Minister Amanda Rishworth, recognises Pathological Demand Avoidance as a profile of autism. Source: AAP / Aaron Bunch Trembath said he was aware of some practitioners including mention of PDA in autism reports, but said from an anecdotal point of view: \"It is not a common way of talking about people's characteristics, strengths, and support needs.\"\n\n\n\n\n\n\"People who use the term say it helps to understand, talk about, and respond to the needs of the individual. Others will say it adds a layer of complexity, lacks an agreed definition and precision, and may be offensive to some people,\" he said.\n\n\n\n\n\nKeeble described Trembath's position as \"idealised\" and not informed by the lived experience of PDAers and their families.\n\n\n\nA push for more recognition\n\nThe recent ECU research produced what may be the first published research in Australia, giving insight into the experience of Australian families of autistic children with a PDA profile.\n\n\n\n\n\nIt highlighted the need for greater recognition, understanding and acceptance of the PDA profile and for flexible, informed and appropriate support for PDA children and their families.\n\n\n\n\n\nKeeble, who is taking part in the Inaugural PDA Conference Australia in Perth later in the year, wants more professionals who work with young children to acknowledge PDA.\n\n\n\n\n\n\"Getting professionals to acknowledge the profile on reports and formal diagnoses letters gives parents the documentation which, they can use to advocate for their children our society requires,\" she said.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 37
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/croatian-village-preserves-rare-black-easter-egg-tradition/avraawbfa",
    "title": "Croatian village preserves rare black Easter egg tradition",
    "publish_date": "Fri, 18 Apr 2025 22:00:00 +0000",
    "category": "entertainment",
    "authors": [],
    "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nIn most places in Croatia, Easter eggs are a symbol of new life, so they're painted in reds, blues, and golds.\n\n\n\n\n\nBut here in the northern Croatian county of Medimurje, it’s very different.\n\n\n\n\n\nThey’re dyed black.\n\n\n\n\n\nCakovec's Museum of Intangible Heritage in Čakovec curator Ines Virc says wax is applied with a handmade copper tool, the egg is dyed black, then the wax is removed to reveal the pattern.\n\n\n\n\n\n“It is special not only because of its colour but also due to the intricate technique used in its creation and tradition.\"\n\n\n\n\n\nIt’s a unique tradition that was added to Croatia’s Register of Cultural Goods in 2023.\n\n\n\n\n\nThe craft dates back to the 1800s and uses the batik technique.\n\n\n\n\n\nBut this Easter tradition is at risk of disappearing, and only one family still makes them: the Vuceniks.\n\n\n\n\n\nBiserka Vucenik is the matriarch of the family.\n\n\n\n\n\n“I've always been interested in this tradition. I was especially fond of the black Easter egg – with its black background and flowers in red, pink, and purple – it really stood out. It was something special, truly special. Every Easter, I would get an egg from my godmother, and my mom would buy an even more beautiful one for her daughter than the one I received. Mine was, let’s say, second or third tier. As a child, I used to resent that and would say: “I’ll make one myself – and much better! Of course, that was just a childish reaction; I didn’t mean it seriously... but in the end, that’s exactly how it turned out – because today, I genuinely love making them.”\n\n\n\n\n\nBiserka now leads workshops across Croatia.\n\n\n\n\n\nIt means young children, local women and tourists are all learning a skill that once filled every home in her village.\n\n\n\n\n\nLjudmila Suzdaljceva is a participant in a recent workshop.\n\n\n\n\n\n\"I had never done it before, but I like it. It's very interesting, but also quite difficult. You really have to practise.\"\n\n\n\n\n\nBlack Easter eggs once had deep meaning, too.\n\n\n\n\n\nPensioner Nada Simunic says they were once exchanged in friendship ceremonies.\n\n\n\n\n\n\"Easter eggs were always given as gifts. Best friends would come together and exchange Easter eggs. This tradition always took place on the Sunday after Easter. They would say, 'A sister, a bride is forever, a sister,' and that marked the beginning of a lifelong friendship.”\n\n\n\n\n\nToday, Vucenik often works late into the night before Easter, making sure the tradition lives on.\n\n\n\n\n\nShe hopes future generations will keep it going.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 38
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/rising-insurance-premiums-advocates-say-industry-needs-more-oversight/bbfemafsq",
    "title": "Rising insurance premiums: advocates say industry needs more oversight",
    "publish_date": "Fri, 18 Apr 2025 21:30:00 +0000",
    "category": "finance",
    "authors": [],
    "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nIn 2024, Australia's insurance industry recorded an annual after-tax profit of $6.1 billion.\n\n\n\n\n\nThat's three times higher than the five-year average of $2 billion.\n\n\n\n\n\nAccording to an annual review of the sector from consultancy firm KPMG, hiked up premiums, calmer weather and surging investment markets have all contributed to the boom.\n\n\n\n\n\nIn 2024, the average customer paid 19.3 per cent more for home insurance and 12 per cent more for car insurance than they did the previous year.\n\n\n\n\n\nSo, if insurers are seeing such big profits, why are consumers still seeing insurance premiums rise?\n\n\n\n\n\nMark Blades is an insurance analyst for consumer advocacy group Choice.\n\n\n\n\n\nHe says companies often justify premium hikes by pointing to external factors.\n\n\n\n\n\n“They point to a lot of external factors. So looking at cars for example, we don't make cars here in Australia, so we're reliant on overseas supply and those supply chains being disrupted, local parts manufacturers, but also external parts manufacturers. So insurers will definitely point to those delays and complex supply chains and also what's happening in world trade at the moment, it's quite a bit of a mess to put it bluntly. So yes, it's quite easy to point to those external factors. In saying that look for consumers, it's always important not to take these things on face value year on year, when you're getting your insurance renewals, you should always be shopping around to see what better values you can get to put the pressure back on insurers to make sure that they are not just taking the mickey with their increases.”\n\n\n\n\n\nWhile the KPMG report says a return to positive profits may signal an end to double-digit premium hikes, it also says climate change means it's impossible to know what's around the corner.\n\n\n\n\n\nThe review has found the annual premium revenue jumped from $65.5 billion in 2023 to $68 billion in 2024.\n\n\n\n\n\nJulia Davis is the Senior Policy and Communications officer at the Financial Rights Legal Centre.\n\n\n\n\n\nShe says that while climate change may mean less profit from home and content insurance, it isn't the whole picture.\n\n\n\n\n\n“I think when we're looking at these big profits, what we're seeing is a reflection of profits across all their types of insurance, you know, whether it's cyber insurance or liability insurance or, you know, any number of other products, mostly commercial stuff. They're making a ton of money, and they claim they're not making a lot of money on, you know, consumer insurance, home and content. But, you know, I would challenge that. The truth is, insurance pricing is really opaque. You know, we don't understand it. We don't get to see it. It's not transparent at all, and it's pretty frustrating for consumers when your prices keep going up and up, and there is just no explanation. Is it because your house is more dangerous, you know, is there a new flood map you don't know about, you know, why is the price, increasing so dramatically?”\n\n\n\n\n\nMark Blades says insurance companies often find loopholes in the system, allowing them to increase premiums even more.\n\n\n\n\n\n“Yeah, so looking to health insurance, this is a really regulated market. There's billions of dollars going in subsidies and billions more indirectly through tax incentives going from government coffers into the health funds. We also know that there's a number of loopholes that the health funds use to increase premiums far higher than the averages suggest. We also know that there's perhaps some issues with transparency in terms of people being told in the news that they have an average increase of this, but they're actually getting a 12 per cent increase higher than they thought. So look, there's always plenty that the governments can be pushing to do with pushing for greater transparency and regulations there. “\n\n\n\n\n\nMeanwhile, the Climate Council has released a report revealing how areas at high risk of climate disaster will continue to see rising premiums.\n\n\n\n\n\nThe report, titled At Our Front Door, says the increasing frequency and severity of climate related disasters in Australia is driving up insurance premiums across the country.\n\n\n\n\n\nThe review by KPMG says that with only two significant weather events and no weather catastrophes in 2024, insurance companies generated $566 million in losses from 49,000 claims.\n\n\n\n\n\nThis marks a significant drop from 2023, which saw $2.356 billion paid out by insurance companies across over 143,000 [[143,900]] claims from catastrophes and significant events.\n\n\n\n\n\nAndrew Hall is the CEO of the Insurance Council of Australia, he says without adequate measures to address climate resilience, the cost of home insurance will continue to rise.\n\n\n\n\n\n“Well, we see it in the profit of insurance, insurance profits in Australia over the last five years. Three of those years, we've seen significant losses, particularly in home and contents, all driven completely by weather events. We've had a rapidly rising population. Those homes are growing often on the east coast on cheap land. That land is cheap for a reason. It floods. That comes with a cost when it comes to insuring those properties. So as we move forward in Australia, when we're talking about housing more and more people, we need to make sure that those homes are built in safe locations, in locations that don't flood, where the assets can remain intact for a longer period of time than just five years.”\n\n\n\n\n\nFor consumers, Mark Blades says simply looking around at different options online can save hundreds.\n\n\n\n\n\n“Always be shopping around at every single year's renewal notice. Look, if I told you you could save hundreds of dollars just for say half a day's work, you'd probably be doing it right if you're looking at an hourly rate. And that's true if you're thinking about your home insurance, car insurance, health insurance, if you have it. Just looking at those three things that can be hundreds of dollars in savings you can make in just a few hours. And that's just by going online. Choice has comparisons for this, making sure you're looking at equivalent cover or less cover if you need it. And making sure as well when you're comparing insurers that you actually are looking at different competitors.”\n\n\n\n\n\nFor the insurance industry itself, Julia Davis says more oversight is needed.\n\n\n\n\n\n“So we've been calling on government to establish a permanent National Insurance pricing monitor. We just think the general insurance industry is not meeting community expectations when it comes to pricing and needs more oversight”\n\n\n\n\n\n\n\n\n\n",
    "source": "SBS",
    "cluster_id": 39
  },
  {
    "url": "https://www.sbs.com.au/news/article/labor-vows-to-protect-penalty-rates-if-re-elected/cbpxca0pl",
    "title": "Labor vows to protect penalty rates if re-elected",
    "publish_date": "Fri, 18 Apr 2025 17:30:00 +0000",
    "category": "finance",
    "authors": [],
    "text": "As the election campaign hits a brief pause for the Easter weekend, Labor has positioned itself as the protector of penalty rates for employees working during the holiday period.\n\n\n\n\n\nOn Saturday, the government announced it would enshrine penalty rates in law if re-elected.\n\n\n\n\n\nThat would prevent business groups, such as the Australian Retailers Association, from applying to the Fair Work Commission to cut the provisions from award agreements.\n\n\n\n\n\nIndustrial relations issues have worked in Labor's favour during the campaign, with polling showing Opposition leader Peter Dutton's short-lived pledge to force public servants back into the office fared poorly with voters.\n\n\n\nWith cost-of-living concerns at the forefront of the campaign, more polling has shown that how parties treat penalty rates could be a factor in how they vote.\n\n\n\n\n\nThe Essential Research polling, commissioned by Australian Unions, found 70 per cent of respondents said protecting penalty rates for workers would be an issue voters take into consideration at the ballot box.\n\n\n\n\n\nThe poll also said 44 per cent of people were more likely to vote for a party that had policies in place to protect penalty rates, compared to 10 per cent being less likely to give the party support.\n\n\n\nMinister for Employment Murray Watt said workers deserve to be rewarded for working on weekends. Source: AAP / Mick Tsikas Retail worker Pauline Lethborg said the extra money from penalty rates went a long way.\n\n\n\n\n\n\"If we lose penalty rates, it doesn't just affect the older workers, it's the younger ones as well. That bonus money goes to pay rent and food,\" she said.\n\n\n\n\n\n\"The cost of living these days is very hard, right across the board.\n\n\n\n\n\n\"It's not like we're being paid $100 an hour, a lot of retail workers are on $20 to $25 an hour ... penalty rates is what gives them their supplement income.\"\n\n\n\n\n\nEarlier in the year, the Australian Retail Association submitted a proposal for some staff at large companies to opt out of penalty rates in exchange for a 25 per cent raise.\n\n\n\nEmployer lobby Australian Industry Group has backed a similar push for the clerks and banking awards, arguing the rise in working from home has made it impractical for employees to log their hours and compounds the regulatory burden on employers.\n\n\n\n\n\nLabor had filed a submission to the Fair Work Commission opposing the changes, while also calling for the coalition to provide clarity on its penalty rate stance.\n\n\n\n\n\nAround three million workers would be affected if Labor succeeds in legislating to protect penalty rates.\n\n\n\n\n\nWorkplace Relations Minister Murray Watt said employees deserved to be rewarded for giving up family time to work during weekends.\n\n\n\n\n\n\"We will always stand with workers to protect their wages so that we can help them deal with the pressures of today and get ahead in the future,\" he said.\n\n\n\nOpposition employment spokesperson Michaelia Cash said in February that penalty rates would not be cut under a future Coalition government, dismissing Labor attacks as a scare campaign.\n\n\n\n\n\nAnthony Albanese and Peter Dutton spent Good Friday in Sydney, amid a lull in campaigning for the Easter period.\n\n\n\n\n\nBut electioneering will heat up again next week, with early voting opening on Tuesday ahead of the 3 May poll.\n\n\n\n\n\nFor the latest from SBS News, download our app and subscribe to our newsletter .\n\n\n\n",
    "source": "SBS",
    "cluster_id": 40
  },
  {
    "url": "https://www.theage.com.au/national/bob-katter-shares-easter-message-20250420-p5lszr.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Bob Katter shares Easter message",
    "publish_date": "Sun, 20 Apr 2025 12:04:43 +1000",
    "category": "finance",
    "authors": [],
    "text": "Bob Katter shares Easter message\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 24
  },
  {
    "url": "https://www.theage.com.au/business/the-economy/my-easter-sermon-how-we-trump-proof-our-society-20250420-p5lsxv.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "My Easter sermon: How we Trump-proof our society",
    "publish_date": "Sun, 20 Apr 2025 11:14:54 +1000",
    "category": "finance",
    "authors": [
      "Ross Gittins"
    ],
    "text": "Since it’s Easter, and we’ve got the day off – and politicians have gone to ground – it’s a good time for, if not religious observance, then at least a little moral reflection.\n\nAccording to The Economist magazine, Christianity is struggling across the developed world. The Americans seem more devout than other English-speaking countries, but since the turn of the century, church attendance there has fallen from 70 per cent of people to 45 per cent. In Italy, home of Catholicism, the number of churchgoers has shrunk by almost half over the past decade.\n\nUS President Donald Trump and his tariff madness may play a big part in this election’s outcome. Credit: AP\n\nOf course, churchgoing and religious identification aren’t quite the same thing. For example, I still put myself down as Salvation Army on the census, which would come as a surprise to my local minister. As a mate explained it, “you can take the boy out of the Salvos, but you can’t take the Salvos out of the boy”.\n\nAnyhow, here in Oz, according to the 2021 census, the proportion of people identifying as Christian has fallen from 61 per cent to 44 per cent in a decade, with those reporting “no religion” rising from 22 per cent to 39 per cent.",
    "source": "TheAge",
    "cluster_id": 25
  },
  {
    "url": "https://www.theage.com.au/environment/weather/national-weather-forecast-for-sunday-april-20-20250420-p5lsz9.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "National weather forecast for Sunday April 20",
    "publish_date": "Sun, 20 Apr 2025 10:34:23 +1000",
    "category": "finance",
    "authors": [],
    "text": "National weather forecast for Sunday April 20\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 26
  },
  {
    "url": "https://www.theage.com.au/sport/afl/hardwick-clips-victorian-premier-over-balta-comments-20250420-p5lsz2.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Hardwick clips Victorian premier over Balta comments",
    "publish_date": "Sun, 20 Apr 2025 10:08:02 +1000",
    "category": "finance",
    "authors": [],
    "text": "Hardwick clips Victorian premier over Balta comments\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 27
  },
  {
    "url": "https://www.theage.com.au/sport/rugby-union/post-to-the-rescue-as-force-draw-with-hurricanes-20250420-p5lsyx.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Post to the rescue as Force draw with Hurricanes",
    "publish_date": "Sun, 20 Apr 2025 09:54:10 +1000",
    "category": "sports",
    "authors": [
      "Justin Chadwick"
    ],
    "text": "The Western Force have escaped with a 17-17 golden-point draw against the Hurricanes – and they had the post to thank for it.\n\nIn a pulsating finish to Saturday night’s Super Rugby Pacific match in Perth, Force flyhalf Ben Donaldson nailed a 39-metre penalty in the 78th minute to level the scores and send it into a super-point period.\n\nWhichever team scored first in the 10 minutes of extra time would win the game, and Donaldson’s 51-metre penalty attempt in the third minute drifted out to the left.\n\nRuben Love (10) had a chance to kick the Hurricanes to a golden-point win but hit the post. Credit: AAP\n\nDonaldson had another crack a few minutes later, but his drop-goal attempt from 30 metres was charged down.",
    "source": "TheAge",
    "cluster_id": 28
  },
  {
    "url": "https://www.theage.com.au/national/victoria/take-the-age-quiz-20230608-p5df2m.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Take The Age quiz",
    "publish_date": "Sun, 20 Apr 2025 09:19:34 +1000",
    "category": "entertainment",
    "authors": [],
    "text": "WHERE AM I?\n\nWhere is this exhibition located? Credit: Chris Hopkins\n\nSince opening in December, this exhibition has attracted almost 500,000 visitors – a record number for any ticketed art show in the country. Whose art is on display, and where can you see the exhibition before it ends on April 21? Check next week’s quiz for the answer.\n\nLast week’s WHERE AM I? Laksa King is located on Pin Oak Crescent in Flemington.",
    "source": "TheAge",
    "cluster_id": 41
  },
  {
    "url": "https://www.theage.com.au/national/vegemite-back-on-the-menu-at-canadian-coffee-shop-20250420-p5lsyj.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Vegemite back on the menu at Canadian coffee shop",
    "publish_date": "Sun, 20 Apr 2025 09:05:24 +1000",
    "category": "finance",
    "authors": [],
    "text": "Vegemite back on the menu at Canadian coffee shop\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 29
  },
  {
    "url": "https://www.theage.com.au/sport/fourteen-year-old-cricket-prodigy-smashes-his-first-ball-in-ipl-for-six-20250420-p5lsy6.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Fourteen-year-old cricket prodigy smashes his first ball in IPL for six",
    "publish_date": "Sun, 20 Apr 2025 08:44:39 +1000",
    "category": "sports",
    "authors": [
      "Bilal Kuchay",
      "Will Macpherson"
    ],
    "text": "The story of the 14-year-old earning £100,000 in the IPL Sanjeev Suryavanshi was glued to the television watching the Indian Premier League auction taking place thousands of miles away in Saudi Arabia. It was the evening of November 25 and Sanjeev was praying that his then 13-year-old son, Vaibhav, would be picked up in the IPL, the tournament in which the world’s top cricketers earn life-changing money for just a couple of months’ work. At 8pm local time, it was Vaibhav’s turn to go up under the hammer. Delhi Capitals made the first move with a bid that sent Sanjeev running and jumping around the room in jubilation. And the offers kept coming as a bidding war ensued, with Rajasthan Royals eventually coming out on top with a price of £100,000. Hundreds of neighbours and relatives, who were watching the auction on their smartphones outside the Suryavanshis’ two-storey house, hugged each other, handed out sweets and set off firecrackers as Vaibhav made history by becoming the youngest player ever picked for the IPL.\n\nVaibhav Suryavanshi is a young superstar. “I just wanted my son to be selected. For how much, that question never occurred to me,” 51-year-old Sanjeev tells Telegraph Sport at his home in Tajpur, a village in Bihar’s Samastipur district, where most of the locals are involved in farming. Rahul Dravid will be Vaibhav’s coach, while England’s Jofra Archer and Indian superstar Yashasvi Jaiswal will be team-mates. Dravid heaped praised on the teenager after the auction. “He [Vaibhav] has some really good skills, so we thought it might be a good environment for him to grow in. He came to our trials and we were really happy with what we saw.” India’s latest cricket prodigy, following in the footsteps of the likes of Sachin Tendulkar, has broken records left, right and centre. As well as being selected for the IPL, Vaibhav made history by becoming the youngest player to make his debut in the Ranji Trophy, the domestic first-class competition, and to represent his home state of Bihar in the domestic T20 championship. Last November, during a four-day match against Australia Under-19s in Chennai, the left-handed opener also smashed 104 off just 62 balls, reiterating his class against players six years his senior.\n\nTalking to the locals in Tajpur, everyone raises Vaibhav’s talent and dedication, but also the father’s resilience and determination to ensure his son’s dream came true. Vaibhav was taken by his dad aged six to a cricket academy in Samastipur. “The moment I saw him pick up a bat, I realised there is something about him,” Sanjeev says, whose constant ferrying of his son to cricket camps and matches meant he eventually had to close the family’s jewellery business. He now does a spot of farming in among mentoring the boy’s cricket career. Cricket prodigy Vaibhav Suryavanshi has created history. Throughout the boy’s childhood, Sanjeev would regularly buy three new cricket balls at $2 apiece in a region where a third of families make ends meet on a daily income of just $3.60. He would throw the balls at his son in the nets he built outside their house and invited bowlers from the village, often twice his age, to ping deliveries at him.\n\nHe also extended the invitation to faster bowlers from other parts of the district, and would pay them travel expenses to test his son. Some of these adults would whizz the ball down at 80mph, despite Vaibhav being only nine years old. “I would get scared, but I knew if I stopped, my son his career would be over,” Sanjeev explains. “Villagers would say I’m putting a heavy bet on my son. Because playing cricket was costing Vaibhav his studies and they would ask what job would he get if he didn’t succeed in cricket. But I knew he had the talent. Otherwise I would not have invested so much time and resources on him. “I may not have played at professional level but I’ve seen enough to understand what is required. I never let him play with any [softer] ball because I wanted him to play professional cricket.” At 11, Vaibhav smashed a double hundred in a 40-over match. A few months later, he scored an unbeaten 332 in an under-19 ODI tournament in Bihar.\n\nRajasthan Royals’ Vaibhav Suryavanshi plays a shot during his Indian Premier League cricket debut. Credit: AP Rakesh Tiwari, the Bihar Cricket Association president, said Vaibhav’s talent compelled them to pick him in big tournaments. Many criticised them for selecting a 12-year-old but Tiwari did not have to justify his decision for long. “His bat silenced every critic.” Vaibhav has modelled his game on another left-hander in Brian Lara, whom he describes as his “idol”. He is also a fan of Virender Sehwag and Yuvraj Singh, the free-flowing former Indian cricketers. Vaibhav’s first coach in Samastipur, Brajesh Kumar Jha, says it gave him great pride that a player from his academy had made it to the IPL. He describes Vaibhav as a very hard-working cricketer who never backs down. “He is a quick learner, a naturally attacking batsman and adapts quickly to situations... and behind his success lies determination and hard work.” He adds that Vaibhav would practise for several hours a day in searing Indian summer heat, proving his toughness.\n\n“The success people see is purely the result of Vaibhav’s hard work,” Jha explains. “When a player from a small district like Samastipur, who would play here with all these young boys, makes it to the IPL, where he will get a chance to share the field or dressing room with greats of the game like Virat Kohli or Rahul Dravid, it’s a dream, not just for that cricketer but a coach like me too. “You can’t explain how it feels to see him reach that level. It’s the dream I too had growing up but couldn’t fulfil.” Loading Vaibhav’s success at such a young age is already changing the game and inspiring those even younger than him.",
    "source": "TheAge",
    "cluster_id": 16
  },
  {
    "url": "https://www.theage.com.au/sport/motorsport/norris-crashes-in-jeddah-qualifying-20250420-p5lsya.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Norris crashes in Jeddah qualifying",
    "publish_date": "Sun, 20 Apr 2025 08:38:34 +1000",
    "category": "sports",
    "authors": [],
    "text": "Norris crashes in Jeddah qualifying\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 30
  },
  {
    "url": "https://www.theage.com.au/sport/nrl/robinson-frustrated-over-props-injury-20250420-p5lsxu.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Robinson frustrated over prop's injury",
    "publish_date": "Sun, 20 Apr 2025 06:14:11 +1000",
    "category": "sports",
    "authors": [],
    "text": "Robinson frustrated over prop's injury\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 31
  },
  {
    "url": "https://au.news.yahoo.com/local-seals-cheeky-behaviour-amuses-thousands-of-aussies-mind-of-his-own-211600713.html",
    "title": "Local seal's cheeky behaviour amuses thousands of Aussies: 'Mind of his own'",
    "publish_date": "2025-04-19T21:16:00Z",
    "category": "finance",
    "authors": [],
    "text": "Footage of the creature's playful antics have been making the rounds this week as Shellharbour tries to take the title of NSW's Top Tourism Town.\n\nFootage of the Sammy the seal's playful antics have been making the rounds this week as Shellharbour tries to take the title of NSW's Top Tourism Town. Source: Bec Dunning/Janine Cable/Destination Shellharbour\n\nAs Aussies spend their Easter weekend lolling on the shorelines of beaches and rivers across the country, one town is attempting to lure even more visitors with its colourful local mascot — Sammy the seal.\n\nSeveral videos of the playful creature frolicking in the water under Windang Bridge have been making the rounds online this week as residents in Shellharbour push for the coastal city to be named NSW’s Top Tourism Town.\n\nIn the footage, Sammy can be seen performing his — or her — trademark move of lying upside-down with their flippers in the air, amusing locals and travellers, some of which said they hoped to catch a glimpse of the “beautiful” seal when they stop by.\n\n“He’s definitely got a mind of his own,” Bec Dunning, from SUP Shellharbour, told Yahoo News. “We pretty much go past him almost every day.”\n\nDunning, who spotted Sammy once again on Wednesday “wagging his tail” at her and a customer while “hiding” behind one of the bridge’s concrete pylons, explained the seal has been living in the area “for years”.\n\nADVERTISEMENT\n\n“A lot of the residents say that he’s always been here. We’ve had up to three seals underneath, and recently it’s just been the one,” she said. “They do those little barrel rolls. We sort of wonder if they’re using the pylons on the bridge for a bit of a massage.”\n\nThere are also often “lots of fish” that Sammy likely snacks on throughout the day.\n\nWhy is Sammy upside-down with his flippers in the air?\n\nSpeaking to Yahoo, Sea World Curator of Animal Welfare and Operations, Mitchell Leroy, explained that Sammy’s adorable upside-down manoeuvre is called “sailing” and is a “way for the animal to thermoregulate”.\n\n“Meaning that they use the flippers above the water to either cool down or in most cases warm up. This means they don’t have to get out of the water just to stay warm,” he said.\n\nSammy’s adorable upside-down manoeuvre is called 'sailing' and is a 'way for the animal to thermal regulate'. Source: Bec Dunning/SUP Shellharbour\n\nLeroy added that it is “quite common” for seals to inhabit locations for periods of time. “There are many who move away during the year for different life stages, such as breeding season, only to return to the locations where they spend other times such as winter.\n\nADVERTISEMENT\n\n“It is most likely dependent on prior learning and success in behaviours such as successful hunting, predator avoidance or mate selection.”\n\nSeal's cheeky Meerkat move cracks up local\n\nDunning told Yahoo that Sammy can sometimes “gets a little scared”, especially if there are jet skis around or construction on the bridge.\n\n“But generally we can go under there, chill out for a little bit, have a good look at him and then move on and see him on the way back as well,” she said.\n\n“Once I came through with a couple of guests, and couldn’t see him, and then all of a sudden he popped up behind us, had a look like a little Meerkat, and sort of followed me for a little bit, and then pushed away, and went swimming off somewhere else,” the local added, laughing about the seal's cheeky antics.\n\nDo you have a story tip? Email: newsroomau@yahoonews.com.\n\nYou can also follow us on Facebook, Instagram, TikTok, Twitter and YouTube.",
    "source": "Yahoo",
    "cluster_id": 42
  }
]