[
    {
        "url": "https://www.9news.com.au/national/artificial-intelligence-chatbot-regulation-australia-impact-teenagers/fea17557-aaea-4651-b4a2-c592a420366b",
        "title": "Why AI chatbots have fallen into Australia's online safety firing line",
        "publish_date": "Mon, 29 Dec 2025 19:23:45 +0000",
        "category": "finance",
        "authors": [
            "Dec"
        ],
        "text": "Weeks after blocking anyone aged under 16 from social media , Australia is also in the middle of ﻿another online safety crackdown in an attempt to protect young people from the potential harms of AI chatbots, but some experts say it should go even further.\n\nAs the artificial intelligence industry continues to develop rapidly, many teenagers have become more reliant on the technology in their day-to-day lives.﻿\n\nMelbourne high school teacher Matthew Micallef has noticed the shift, saying he has seen literacy rates dramatically worsen since the boom.\n\nThere are concerns teenagers are relying too much on artificial intelligence. (AP Photo/Rick Rycroft)\n\n\"Outside of academic authenticity, students are opting into an 'easy way out' mentality towards their learning,\" Micallef said. ﻿\n\n\"Also, schools are spending a considerable amount of money and funding on eSafety workshops for students that could be better spent on other endeavours.\"﻿\n\nThere is a growing concern that kids may begin to rely too much on artificial intelligence, particularly chatbots, following the absence of social media on their phones.﻿\n\n\"We know that kids are already using AI tools, whether that's talking to ChatGPT or companion apps that are actually sort of designed to make friends with people,\" director of the Centre for Human-AI Information Environments Professor Lisa Given said.﻿\n\n\"We know that there are people who get really taken in by the way that those systems engage with us.\n\nREAD MORE: Three words this CEO swears will help you land a better job ﻿\n\nThe absence of social media could have teens turning towards artificial intelligence. (AP Photo/Kiichiro Sato)\n\n\"These systems are trained to respond in that very human way, and that means people can get entranced into thinking that there's a human in the machine or that the machine is listening to and understanding what you're saying.\n\n\"That means that companion apps in particular, that are designed to make friends with you and build a relationship, have the potential for significant harm for vulnerable people, and that includes kids.\"\n\nAustralia recently rolled out new restrictions for AI bots, limiting the type of content they can provide teenagers.\n\n\"We're the only country in the world that will be tackling AI chatbots and AI companions,\" eSafety Commissioner ﻿Julie Inman Grant told 9News in early December. ﻿\n\n\"They will be prevented from ﻿serving any pornographic, sexually explicit, self-harm, suicidal ideation or disordered eating (content) to under-18s.\"\n\nGiven says the chatbots are hazardous for vulnerable people.\n\n\"What we've certainly seen around the world is that there are people who will listen to what these systems are telling them and take it to heart,\" she said.﻿\n\n\"So if a system says to you, 'that's a really great idea, you should totally pursue that', it gives a boost to our ego, and we think someone's listening.\n\neSafety Commissioner Julie Inman Grant has touted new AI regulations. (Alex Ellinghausen)\n\n\"But we've seen that sometimes that goes to a very dark place, particularly if people start saying to the system, I'm really depressed, or I'm having really horrible feelings, or I'm thinking about suicide.\n\n\"We see that some of those apps are actually responding in ways that encourage that thinking rather than trying to respond to a person and push them towards getting help.\n\n\"That means people who are very vulnerable, who are already at risk, can actually be really taken down to a dark hole by these computers.\"\n\nMicallef ﻿believes that teens should not have access to AI chatbots entirely, mostly because of the safety risk they pose.\n\n\"With some of the concerns outlined by the eSafety Commissioner, such as access to pornographic, graphic or self-harm content, it would not be wise to give impressionable teenagers the ability to utilise such applications,\" he said.\n\nGiven thinks the restrictions should go even further so to protect everyone, not just teenagers – although conceded any such regulation would be difficult to enact.\n\n\"These systems are not just harmful to children,\" she said.\n\n\"We know we've got evidence of adults that also get entranced by these systems, for anyone that is particularly vulnerable, or has existing mental health issues, that's a huge concern.\n\n\"If it's safe for adults, it should be safe for kids.\"﻿",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/great-white-shark-snagged-off-barwon-heads/f052d320-060c-4e22-90bc-bc9bb32c575a",
        "title": "'Amazing experience' as great white shark snagged off Barwon Heads",
        "publish_date": "Mon, 29 Dec 2025 11:15:47 +0000",
        "category": "sports",
        "authors": [
            "Dec"
        ],
        "text": "Oscar Ford knew he had snagged something big.\n\nBut he never imagined it would be a great white shark.\n\nThe Victorian carpenter was with three inexperienced cousins, two of them children, when he snagged the giant fish off Barwon Heads on Sunday.\n\nOscar Ford knew he had snagged something big. (Nine)\n\nHe never imagined it would be a great white shark. (Nine)\n\n\"It's a f---ing white, holy shh, holy crap, I've caught a white off Barwon Heads,\" he screamed as cameras recorded the epic catch.\n\nThe carpenter battled for more than half an hour to reel the shark in close.\n\nEvery moment of the once-in-a-lifetime experience was captured on an array of GoPro cameras.\n\n\"He's biting the boat, get that on film, get that on film,\" he can be heard saying.\n\nThe fishers even dunked one of the cameras into the water for an incredible closer look at the beast.\n\n\"I was just in disbelief, I was like this is insane, I would never have thought this would happen,\" Ford told 9News.\n\nThe fishers even dunked one of the cameras into the water for an incredible closer look at the beast. (Nine)\n\nEvery moment of the once-in-a-lifetime experience was captured on an array of GoPro cameras (Nine)\n\n\"I had so much emotion, so much adrenaline running through me.\n\n\"I was feeling a million different emotions, I was feeling on top of the world.\"\n\nFord pushed off Ocean Grove early on Sunday to fish for tuna but switched to a snapper mark near Barwon Heads after a quiet few hours to set a bait balloon.\n\n\"We chucked it out and 45 minutes later we see a fin sort of just circling the balloon and then out of nowhere it just started splashing the water, going crazy,\" he said.\n\nGreat whites are a protected species so Ford never brought his catch on board, cutting it loose to go free.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/accessible-beaches-austra-melbourne-beach-has-been-crowned-australias-best-for-one-crucial-reasonlia/c808de1f-c8b3-4319-abf5-053f08f660e6",
        "title": "This Melbourne beach has been crowned Australia's best for one crucial reason",
        "publish_date": "Sun, 28 Dec 2025 19:30:15 +0000",
        "category": "finance",
        "authors": [
            "Dec"
        ],
        "text": "A quick dip to cool off on a scorching summer's day, or a casual wade through gentle waves with family and friends, is a pastime deeply rooted in the Australian experience.\n\nBut until this month, Carly Burns struggled to get past the beach car park.\n\nBorn with spina bifida, the 38-year-old from Frankston, on the outer eastern fringe of Melbourne, has used a wheelchair for most of her life.\n\nBeach matting allows people who use wheelchairs to reach the water's edge. (Supplied)\n\n\"I've never actually been able to get down onto the beach on my own… I would have to be up on the concrete just watching,\" she said.\n\nBut an Australian-first pilot to create the nation's first fully-accessible beach has given Burns, and 30,000 other Frankston residents living with a disability, a newfound ability to enjoy the beach in the same way millions of others across the country do.\n\n\"I have family that would carry me [in the past], but to be able to do it myself is amazing,\" Burns said.\n\nAccessible Beaches Australia and Frankston Council unveiled the nation's most accessible beach to users and supporters on December 5.\n\nThe three-month pilot includes 70 metres of beach matting running to the water's edge to allow wheelchairs to traverse the sand, daybeds with cabanas, five beach wheelchairs, two beach walkers, and a hoist to support transfers between wheelchairs.\n\nOut of the 160 accessible beaches in Australia, Frankston is the first to have staff and volunteers to help beachgoers enter and exit the water.\n\nFor participant Chris Wiggett, swimming at the beach was an opportunity more than seven years in the making.﻿\n\n\"Last time I was knocked over, which frightened me,\" she said at the pilot launch.\n\n\"This morning, a volunteer helped me down to the water. I put my feet in and walked along the sand, and I cried, because it was the first time in years I could do that.\"\n\n'A new level of inclusion'\n\nOther beaches across Australia are increasing their accessibility, with some offering beach mats, wheelchairs and accessible changerooms and parking.\n\nBut the mission to create a fully accessible beach in Australia was a dream first imagined nearly 10 years ago by Accessible Beaches Australia founder Shane Hryhorec.\n\nHryhorec grew up in South Australia, where he spent his days patrolling Grange Beach as a surf lifesaver.\n\nBut after breaking his neck in a swimming pool accident in 2007, Hryhorec became an incomplete quadriplegic aged 21.\n\nAfter his accident, he says the beach quickly became a place he avoided.\n\n\"I just instantly had to stop all the things that I liked to do that I would no longer be able to do, and one of those things that first came into my mind was the beach,\" he said.\n\n\"I just instantly wrote it off in my mind.\n\n\"I tried to go to the beach a few times after my accident, and I just found it very, very difficult, to the point where ... the challenge of it just became too great.\"\n\nAlmost 10 years later, Hryhorec was scrolling the internet when he came across a photo of a beach mat.\n\n\"I was blown away, and at that point I was like, we need this in Australia,\" he said.\n\nAccessible Beaches Australia founder Shane Hryhorec (left) with former Frankston City Council mayor Kris Bolam and Accessible Beaches Australia's Bern Walker. (Facebook)\n\nFrom there, he created Accessible Beaches Australia, which led him to visit the world's most accessible beach in Antibes, in the south of France, 18 months ago.\n\n\"They went to a new level of inclusion that I've never seen before,\" Hryhorec said.\n\n\"I didn't realise we could be doing so much better until I experienced the best.\"\n\nHryhorec hopes the inclusion of daybeds and volunteer staff can also encourage the ageing population to visit the beach - a sight he said \"warmed [his] heart\" in Antibes.\n\n\"Literally half of the people that were enjoying the beach were probably around their 80s or above, which I just thought was just so special,\" he said of the French Handiplage.\n\n\"People just assume when they get older is that they just can't go to the beach, especially if you don't have someone to go with, or a partner might have passed or something,\" he said.﻿\n\n\"When you're seeing our ageing population get to experience the beach, which they may not have been able to do for 10, 15, even 20 years, then that for me is what really grabs at my heartstrings.\"\n\nThe push for accessible beaches nationwide﻿\n\nHryhorec credits much of the success of the summer pilot program to Frankston City Council, which worked with the local community to raise $200,000 to bring it to fruition.\n\n\"I've been doing this work for nearly 10 years, making beaches accessible, and I've never seen a council and community get behind something with so much passion and enthusiasm and compassion,\" he said.\n\n\"If other communities could just be a smidgen of what Frankston is, what they could achieve for inclusion would be incredible around the country.\"\n\nThe Australian-first pilot features accessible beach amenities including beach wheelchairs and walkers. (Facebook)\n\nFrankston City councillor Kris Bolam, who just finished his tenure as mayor, said he hopes the pilot \"becomes the spark that inspires similar programs across Australia\".\n\n\"Hearing families say this is the first time they'll be able to visit the beach together is incredibly moving. That's the real success of today,\" he said.\n\nThat's a goal shared by Hryhorec and Burns.\n\n\"My hope is that every patrolled beach in the entire country has a level of accessibility on the beach, just like in Frankston,\" Hryhorec said.\n\n\"I hope that others would be able to get the same opportunity that I have been able to get, and I would recommend that they do it,\" Burns said.\n\nCarly Burns, 38, was the first person to use the beach wheelchairs at Frankston beach. (Frankston City Council)\n\nUntil then, Burns is looking forward to her first summer at the beach.\n\n\"I have young nieces and nephews, so it will be good to be able to join them in the water rather than having to just sit back and watch.\"",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/superannuation-australia-victorian-woman-marilyn-late-husband-life-insurance-payout-and-super-both-lost/9fef3d02-1b93-444a-9698-0af6eda9b299",
        "title": "Marilyn lost retirement fund and husband's life insurance payout in one fell swoop",
        "publish_date": "Sun, 28 Dec 2025 19:43:17 +0000",
        "category": "finance",
        "authors": [
            "Dec"
        ],
        "text": "Exclusive: M﻿arilyn believed she was being financially responsible when she clicked on a Facebook advertisement for a superannuation health check two years ago.\n\nThe Victorian woman, 60, was looking to retire soon and pay herself a modest pension after a tough few years, including the death of her husband in 2016.\n\nShe had been paid a significant life insurance sum, along with both their superannuation funds, and wanted to protect her assets.\n\nMarilyn transferred two lots of super and her husband's life insurance payout after a financial health check. (Supplied)\n\nThe ﻿financial nightmare that followed left Marilyn feeling \"stupid\".\n\n\"﻿I thought, what a stupid thing I've done. So I felt angry with myself,\" Marilyn told nine.com.au.\n\n\"I felt so terrible that I had possibly wasted my husband's superannuation, my superannuation and the payout for his life insurance.\"\n\nBut how could 12,000 Australians make the very same costly \"mistake\"?\n\nMarilyn is among thousands who have either lost everything or had their superannuation funds frozen following the collapse of ﻿First Guardian Master Fund and Shield Master Fund.\n\nAfter a lengthy super \"health check\" with a financial advisor firm, Marilyn decided to transfer her fund from﻿ HESTA over to a fund known as AusPrac in November 2023.\n\nShe then rolled together all her money under the one account, hoping she could boost returns.﻿\n\nAusPrac, also known as Australian Practical Superannuation, is operated by parent company Sequoia Financial Group.\n\n9news.com.au has previously ﻿contacted Sequoia for comment but has not received a reply.\n\nASIC has commenced civil penalty proceedings in the Federal Court against Diversa Trustees Limited – the trustee for AusPrac – alleging failures relating to the First Guardian Master Fund. Diversa said it would \"vigorously defend\" the claims.\n\nOn December 23, ASIC imposed extra licence conditions on Diversa over what it alleges were a series of governance failures. Diversa acknowledged the new conditions but argued they were not \"necessary or warranted in the circumstances\".\n\nDo you have a story? Contact reporter April Glover at april.glover@nine.com.au\n\nMarilyn was left with just $10.49 in her super account. (Supplied)\n\nMarilyn was living off her savings and wanted to withdraw some of the funds 18 months later.\n\n\"I rang up to tell my superannuation body that I wanted to start drawing down a pension,\" Marilyn explained.\n\n\"And at the time, the man said, 'Oh look, I'm terribly sorry, haven't you heard your super is frozen and you can't access it?'\"\n\nMarilyn's heart sank.\n\nHer money had been funnelled into First Guardian, which went into liquidation ﻿in April this year.\n\nShe didn't have enough money in her savings account to keep going without the funds.\n\n\"﻿I thought, OK this is going to be difficult, but I've done difficult things before,\" she added.\n\nA recent check of her AusPrac super balance showed she had just $10.49 left in it.﻿\n\nMarilyn said a small part of her knew something was amiss after she ﻿jumped through the hoops during her \"health check\".\n\n\"I knew there was a bloody rat. I smelled the rat and I dismissed it... or allowed myself to be reassured.﻿\"\n\nAs the watchdog sues various entities and attempts to untangle First Guardian and Shield's failures﻿ in an investigation, people like Marilyn are playing the waiting game.\n\nHer money had been funnelled into First Guardian, which went into liquidation ﻿in April this year. (Supplied)\n\nAmid the heartbreak has been a bright spot: the Facebook community.\n\n﻿There are nearly 2000 Australians facing the same uncertain future who have joined forces to demand government intervention.\n\n\"That really helped,\" Marilyn said.\n\n\"And then I started to think, 'OK, maybe, you know, I wasn't so stupid making that decision'.\"\n\nMelinda Kee has been a pillar of support for thousands of Australians caught up in the twin super collapse. (Supplied)\n\nChief among the supportive Facebook group members taking action is Melinda Kee, who lost $360,000 in the First Guardian collapse.\n\nKee has become a voice for the thousands of confused and worried Australians who have lost a collective ﻿$1.2 billion in retirement savings.\n\n\"Melinda came and visited me here,\" Marilyn said.\n\n\"She was just so lovely. She gave me a hug and comforted me... I needed face and a name, having a human being in my kitchen saying, 'There's a whole lot of us, and we're already doing a whole lot of things'.\"\n\nAustralians like Marilyn and Melinda won't stop trying to find justice for the 12,000 people who have had their futures stolen.\n\n﻿Marilyn didn't want to tell anyone about the money she'd lost.\n\nNow, she hopes her vulnerability will help those financial victims still blaming themselves.\n\n\"﻿It shook trust in myself,\" she added.\n\n\"Now, I am finding out how to get back that integrity and dignity. ﻿I don't want to lose faith in myself... or feel I make bad choices.\"",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/world/brigitte-bardot-death-1960s-sex-symbol-turned-militant-animal-rights-activist-dies-aged-91/6def262c-0bbf-446c-bdb8-328054e794bc",
        "title": "French film star Brigitte Bardot dies, aged 91",
        "publish_date": "Sun, 28 Dec 2025 12:13:56 +0000",
        "category": "entertainment",
        "authors": [
            "Dec"
        ],
        "text": "Brigitte Bardot, the French 1960s sex symbol who became one of the greatest screen sirens of the 20th century and later a militant animal rights activist, has died. She was 91.\n\nBardot died Sunday at her home in southern France, according to Bruno Jacquelin, of the Brigitte Bardot Foundation for the protection of animals.\n\nSpeaking to The Associated Press, he gave no cause of death, and said no arrangements have yet been made for funeral or memorial services.\n\nFrench actress Brigitte Bardot poses with a huge sombrero she brought back from Mexico, as she arrives at Orly Airport in Paris, France, on May 27, 1965 (AP Photo)\n\nShe had been hospitalised last month.\n\nBardot became an international celebrity as a sexualized teen bride in the 1956 movie And God Created Woman . Directed by her then-husband, Roger Vadim, it triggered a scandal with scenes of the long-legged beauty dancing on tables naked.\n\nAt the height of a cinema career that spanned some 28 films and three marriages, Bardot came to symbolise a nation bursting out of bourgeois respectability. Her tousled, blond hair, voluptuous figure and pouty irreverence made her one of France's best-known stars.\n\nSuch was her widespread appeal that in 1969 her features were chosen to be the model for \"Marianne\", a bare-breasted statue representing the French Republic, and the official Gallic seal. Bardot's face appeared on statues, postage stamps and even on coins.\n\n''We are mourning a legend,'' French President Emmanuel Macron wrote Sunday on X.\n\nFrench actress Brigitte Bardot poses in character from the motion picture \"Voulez-Vous Danser Avec Moi\" (Do you Want to Dance With Me), on Sept. 10, 1959. (AP)\n\nBardot's second career as an animal rights activist was equally sensational. She travelled to the Arctic to blow the whistle on the slaughter of baby seals; she condemned the use of animals in laboratory experiments; and she opposed Muslim slaughter rituals.\n\n\"Man is an insatiable predator,\" Bardot told The Associated Press on her 73rd birthday, in 2007.\n\n\"I don't care about my past glory. That means nothing in the face of an animal that suffers, since it has no power, no words to defend itself.\"\n\nHer activism earned her compatriots' respect and, in 1985, she was awarded the Legion of Honour, the nation's highest honour.\n\nA turn to the far right\n\nLater, however, she fell from public grace as her animal protection diatribes took on a decidedly extremist tone. She frequently decried the influx of immigrants into France, especially Muslims.\n\nShe was convicted and fined five times in French courts of inciting racial hatred, in incidents inspired by her opposition to the Muslim practice of slaughtering sheep during annual religious holidays.\n\nBardot's 1992 marriage to fourth husband Bernard d'Ormale, a onetime adviser to former National Front leader Jean-Marie Le Pen, contributed to her political shift. She described the outspoken nationalist as a \"lovely, intelligent man\".\n\nFrench film legend and animal rights activist Brigitte Bardot looks on prior to a march of various animal rights associations on March 24, 2007 in Paris (AP Photo/Jacques Brinon)\n\nIn 2012, she wrote a letter in support of the presidential bid of Marine Le Pen, who now leads her father's renamed National Rally party. Le Pen paid homage Sunday to an \"exceptional woman\" who was \"incredibly French\".\n\nIn 2018, at the height of the #MeToo movement, Bardot said in an interview that most actors protesting sexual harassment in the film industry were \"hypocritical\" and \"ridiculous\" because many played \"the teases\" with producers to land parts.\n\nShe said she had never had been a victim of sexual harassment and found it \"charming to be told that I was beautiful or that I had a nice little ass\".\n\nA privileged, but 'difficult' upbringing\n\nBrigitte Anne-Marie Bardot was born September 28, 1934, to a wealthy industrialist. A shy, secretive child, she studied classical ballet and was discovered by a family friend who put her on the cover of Elle magazine at age 14.\n\nBardot once described her childhood as \"difficult\" and said her father was a strict disciplinarian who would sometimes punish her with a horse whip.\n\nBut it was French movie producer Vadim, whom she married in 1952, who saw her potential and wrote And God Created Woman to showcase her provocative sensuality, an explosive cocktail of childlike innocence and raw sexuality.\n\nBrigitte Bardot in And God Created Woman (Criterion, Cocinor/ YouTube)\n\nThe film, which portrayed Bardot as a bored newlywed who beds her brother-in-law, had a decisive influence on New Wave directors Jean-Luc Godard and Francois Truffaut, and came to embody the hedonism and sexual freedom of the 1960s.\n\nThe film was a box-office hit, and it made Bardot a superstar. Her girlish pout, tiny waist and generous bust were often more appreciated than her talent.\n\n\"It's an embarrassment to have acted so badly,\" Bardot said of her early films.\n\n\"I suffered a lot in the beginning. I was really treated like someone less than nothing.\"\n\nBardot's unabashed, off-screen love affair with co-star Jean-Louis Trintignant further shocked the nation. It eradicated the boundaries between her public and private life and turned her into a hot prize for paparazzi.\n\nBrigitte Bardot, in a striped dress, in the 1950s. (Getty)\n\nBardot never adjusted to the limelight. She blamed the constant press attention for the suicide attempt that followed 10 months after the birth of her only child, Nicolas. Photographers had broke into her house only two weeks before she gave birth to snap a picture of her pregnant.\n\nNicolas' father was Jacques Charrier, a handsome French actor whom she married in 1959 but who never felt comfortable in his role as Monsieur Bardot. Bardot soon gave up her son to his father, and later said she had been chronically depressed and unready for the duties of being a mother.\n\n\"I was looking for roots then,\" she said in an interview. \"I had none to offer.\"\n\nIn her 1996 autobiography Initiales B.B. , she likened her pregnancy to \"a tumour growing inside me,\" and described Charrier as \"temperamental and abusive\".\n\nActress Brigitte Bardot, 23, gets a hug from her new husband, actor Jacques Charrier, also 23, following their wedding here, June 18th. The marriage was slightly delayed by a swarm of newsmen who were waiting for the pair to arrive gor their \"Secret wedding.\" Rumors that Brigitte and Charrier were married have blown hot and cold during the last five days, with the pair adding to the confusion by both denying and confirming reports. Now it is cer (Bettmann Archive)\n\nBardot married her third husband, West German millionaire playboy Gunther Sachs, in 1966, but the relationship again ended in divorce three years later.\n\nAmong her films were A Parisian (1957); In Case of Misfortune , in which she starred in 1958 with screen legend Jean Gabin; The Truth (1960); Private Life (1962); A Ravishing Idiot (1964); Shalako (1968); Women (1969); The Bear And The Doll (1970); Rum Boulevard (1971); and Don Juan (1973).\n\nWith the exception of 1963's critically acclaimed Contempt , directed by Godard, Bardot's films were rarely complicated by plots. Often they were vehicles to display Bardot's curves and legs in scanty dresses or frolicking nude in the sun.\n\n\"It was never a great passion of mine,\" she said of filmmaking.\n\n\"And it can be deadly sometimes. Marilyn [Monroe] perished because of it.\"\n\nBardot retired to her Riviera villa in St. Tropez at the age of 39 in 1973 after The Woman Grabber .\n\nFrench actress Brigitte Bardot relaxes in the back of a limousine upon her arrival at London's Heathrow Airport. She has flown in from Paris to attend the premiere of her latest film 'Shalako', in which she plays an alluring countess. (Photo by Central Press/Getty Images) (Getty)\n\nReinventing herself in middle age\n\nShe emerged a decade later with a new persona: An animal rights lobbyist, her face was wrinkled and her voice was deep following years of heavy smoking.\n\nShe abandoned her jet-set life and sold off movie memorabilia and jewellery to create a foundation devoted exclusively to the prevention of animal cruelty.\n\nHer activism knew no borders. She urged South Korea to ban the sale of dog meat and once wrote to US President Bill Clinton asking why the US Navy recaptured two dolphins it had released into the wild.\n\nShe attacked centuries-old French and Italian sporting traditions including the Palio, a free-for-all horse race, and campaigned on behalf of wolves, rabbits, kittens and turtle doves.\n\nFollowing news of her death, PETA Founder Ingrid Newkirk praised her activism and labelled the late actress \"a strong voice for all species\".\n\n\"From her rescued pigeons in Saint-Tropez to her beloved dogs, PETA will miss Brigitte, an angel for animals who went to bat and to court to protect them all,\" Newkirk said in a statement.﻿\n\nFormer Actress And Now Animals Rights Activist Brigitte Bardot Invited For A Meeting On The Environment With French President Nicolas Sarkozy, At The Elysee Palace In Paris, France On September 27, 2007 - (Photo by Gilles BASSIGNAC/Gamma-Rapho via Getty Images) (Gamma-Rapho via Getty Images)\n\nBy the late 1990s, Bardot was making headlines that would lose her many fans. She was convicted and fined five times between 1997 and 2008 for inciting racial hatred in incidents inspired by her anger at Muslim animal slaughtering rituals.\n\n\"It's true that sometimes I get carried away, but when I see how slowly things move forward ... and despite all the promises that have been made to me by all different governments put together — my distress takes over,\" Bardot told the AP.\n\nIn 1997, several towns removed Bardot-inspired statues of Marianne after the actress voiced anti-immigrant sentiment. Also that year, she received death threats after calling for a ban on the sale of horse meat.\n\nBardot once said that she identified with the animals that she was trying to save.\n\n\"I can understand hunted animals because of the way I was treated,\" Bardot said.\n\n\"What happened to me was inhuman. I was constantly surrounded by the world press.\"",
        "source": "9News"
    },
    {
        "url": "https://www.abc.net.au/news/2025-12-30/donald-bradman-baggy-green-auction/106186852",
        "title": "Donald Bradman's baggy green to go under the hammer",
        "publish_date": "Tue, 30 Dec 2025 01:33:25 +0000",
        "category": "sports",
        "authors": [],
        "text": "A baggy green cap worn by Sir Donald Bradman will go under the hammer on Australia Day.\n\nThe man known fondly as \"The Don\" remains one of the greatest sportspeople of all time, scoring 29 Test-match centuries in 52 matches from 1928 to 1949.\n\nNow one of his baggy green caps is up for auction, with bidding opening at $1 and set to close on January 26.\n\nBradman's baggy green will go under the hammer on January 26. (Lloyds Auctioneers and Valuers)\n\nBradman gifted the cap to India Test cricketer S.W. Sohoni and it has remained with the family for more than 75 years, never offered for public sale or displayed outside the family.\n\nUnlike modern Australian players, the Test cricketers of Bradman's era wore a different cap for each series.\n\n\"This is a genuine piece of cricket history that Sir Donald Bradman personally gifted,\" Lloyds Auctions Lee Hames said.\n\n\"Its uninterrupted family ownership for 75 years and its direct link to 'The Don' make it one of the most important Bradman-related pieces to come to auction.\"\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\nBradman retired from Test cricket in 1948 with a career batting average of 99.94 – a record widely regarded as one of the greatest statistical achievements in world sport.\n\nThe cap, worn during the 1947-48 series against India, will be offered at public auction, drawing international interest from private collectors, museums, institutions and fans.\n\nBradman's first Baggy Green Australian cap from his 1928 debut season was sold for $450,000 in 2020, according to Cricket Australia.\n\nThe record price for a baggy green belongs to Shane Warne.\n\nThe leg spinner's cap was sold, in aid of emergency services responding to the 2019-20 bushfires, to the Commonwealth Bank for $1,007,500, but Warne only wore the one cap.\n\nAAP/ABC",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-12-30/spending-billions-post-christmas-sales-small-retailers-forgotten/106186838",
        "title": "While big outlets cash in on Boxing Day sales, small retailers feel left behind",
        "publish_date": "Tue, 30 Dec 2025 01:30:29 +0000",
        "category": "finance",
        "authors": [],
        "text": "Australian shoppers are splashing big cash in the post-Christmas sales, but some small businesses say they are not feeling the love.\n\nThe week between Christmas and New Year is expected to generate $3.83 billion in spending nationally, up 4.4 per cent on last year, according to forecasts by the National Retailers Association.\n\nDemand is being driven by Boxing Day discounts and the redemption of Christmas gift cards.\n\nDiana Derek's Canberra homewares store has been running at a loss since Christmas and she's worried consumers have overlooked small businesses. (ABC News: Lily Nothling)\n\nBut at Diana Derek's Canberra homewares store and boutique Hive, sales have plummeted, and she has been running at a loss since Christmas.\n\n\"There's been a massive drop off … we didn't plan for that,\" Ms Derek said.\n\n\"I assumed that it was just because everyone goes to the coast [after Christmas], but I went into the Canberra Centre and did see a lot of Canberrans shopping.\n\n\" Unfortunately, it does look like they've chosen the malls over the little businesses. \"\n\nCanberra Outlet Centre was packed with shoppers searching for a bargain on Boxing Day. (ABC News: Callum Flinn)\n\nHer small store is unable to compete with the sweeping discounts offered by large retailers.\n\n\"People just get so overwhelmed with the word sale, [but] it doesn't mean it's quality — mainly what we see is quantity,\" Ms Derek said.\n\nThe Canberran took over the shop six months ago with the hope of keeping the almost 30-year-old independent business running.\n\n\"You start wondering if you've done the right thing,\" she said.\n\n\" It would be great if people kept supporting it because we won't survive and we will get pushed out by the big guys. \"\n\nMs Derek says if shoppers always overlook small businesses, they will soon disappear. (ABC News: Lily Nothling)\n\nSales a double-edged sword\n\nCanberra Business Chamber chief executive Greg Harford said big sales periods like Black Friday and Boxing Day could be a double-edged sword.\n\n\"[They] can put real pressure on retailers,\" Mr Harford said.\n\n\"[There's] an opportunity there of course, because customers are out looking for bargains, but every discount a retailer offers is money off the bottom line and at the small end of retail in particular, margins are really, really narrow.\n\n\"The reality is for many small retailers, they're never going to be able to compete with larger chains on sales — they'll have to compete on service or range or offering.\"\n\nGreg Harford says small retailers can't match the sales discounts of large outlet chains. (Supplied: Greg Harford)\n\nWhile Mr Harford expected this year's local Boxing Day figures to be stronger than 2024, he said Canberra was grappling with a \"two-speed economy\".\n\n\"The best advice for retail customers is get out and support local businesses,\" he said.\n\n\" We really do need to support them, otherwise there's a risk that they will disappear. \"\n\nMaking conscious choices\n\nTayanah O'Donnell doesn't offer Boxing Day or Black Friday sales at her Canberra bookshop. (ABC News: Lily Nothling)\n\nAt Canberra's oldest independent bookshop, owner Tayanah O'Donnell has resisted the temptation to provide discounts to compete with the major retailers.\n\n\"We don't offer Black Friday sales or Boxing Day sales or anything like that,\" she said.\n\n\"Occasionally you have those quiet moments late at night where you think, 'perhaps we should this year succumb to offering a discount', but it has been a deliberate choice.\n\n\"We just operate on the basis that people coming into the store will get the best possible book at the best possible price and we really pride ourselves on the experience of people coming into the store taking as long as they need to browse.\"\n\nPaperchain \"will never replicate what the bigger stores are doing\", owner Tayanah O'Donnell says. (ABC News: Lily Nothling)\n\nWhile the store is quieter now than during the pre-Christmas rush, the business is still thriving.\n\nIn the face of rabid sales marketing, Ms O'Donnell encouraged shoppers to make conscious choices.\n\nShe said choosing to buy one perfect book was preferable over madly purchasing 10 that may never be read.\n\n\"There is something to be said for a slower, more thoughtful way in which we buy things, consume things, honour those things and pass them on to others,\" she said.\n\n\"We'll never try to replicate what the bigger stores are doing.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-12-30/eating-offal-and-why-we-should-eat-more/106093422",
        "title": "It's backed by Maggie Beer, so why don't we eat more offal?",
        "publish_date": "Tue, 30 Dec 2025 00:13:06 +0000",
        "category": "finance",
        "authors": [],
        "text": "It might seem unappetising or even gross to some, but experts say shoppers looking for a nutritious boost in their diet should consider offal.\n\nAnimal organs can be high in iron and other essential nutrients, and experts believe the benefits of the meat are being overlooked.\n\nAs cost-of-living pressures force one in five Australians to miss meals, they are urging consumers and industry not to undervalue its potential.\n\nEating animal organ meats, or offal, such as liver, tripe, or brain, is considered sustainable as it reduces the waste of animal by-products. (ABC Capricornia: Claudia Sullivan)\n\nIconic chef's first foray into cooking\n\nOne Australian who fondly remembers offal-based meals, like sheep's brain is celebrity chef, author, businesswoman and health advocate Maggie Beer.\n\nMs Beer said she found offal \"irresistible\", and it was also the first dish she ever cooked.\n\n\"I was pan-frying chicken livers. I was seven, and my father said, 'Stop picking at those, there'll be none left for anyone else,'\" Ms Beer said.\n\n\"[It] was such a special treat … and a total respecting of an animal by using every part,\" she said.\n\nCelebrated chef Maggie Beer has been working to change the culture of food in aged care and the quality of life of those living there. (Supplied: Maggie's Orchard)\n\nThe acclaimed chef has been campaigning to improve the quality of food served in aged-care facilities.\n\nShe said that because of the special memories some seniors associated with animal by-products, the food would make a great addition to any retirement home menu.\n\nFor anyone interested in cooking an animal by-product, she recommended pan-fried sheep's brain.\n\n\"[Start by] poaching the brains and then letting them chill. Then cook them in nut brown butter with capers and parsley, and a good squeeze of lemon,\" she said.\n\n\" That, to me, is one of the great dishes of the world. \"\n\nStill in demand at home and overseas\n\nAustralia exported 234,000 tonnes of edible offal in 2024, according to Meat and Livestock Australia.\n\nWhile this amount was outstripped by the 1.3 million tonnes of beef exported, it is still substantial and in league with the 359,000 tonnes of lamb and 255,000 tonnes of mutton exported.\n\nEven in Rockhampton, Australia's beef capital, there are still loyal consumers of sheep's brain.\n\nButcher Bill Douglas worked long days to find mostly locally sourced products, including animal organ meat.\n\nBill Douglas is working around the clock to supply as much locally sourced produce as possible. (ABC Capricornia: Claudia Sullivan)\n\n\"We sell it mostly to elderly people. They come in just for it,\" Mr Douglas said.\n\n\"[If] we don't have it … we make sure we have it later on in the week for them, and they'll come back for it.\"\n\nOffal was not his most popular item, but he said there was a persistent demand.\n\n\"It's getting harder and harder to get [with] fewer places actually selling it,\" he said.\n\nMore research needed to avoid 'haemorrhaging nutrients'\n\nVeterinary scientist Robyn Alders has researched food and nutrition security for more than 30 years, and said more data was needed to understand our eating habits and attitudes.\n\nRobyn Alders AO has been working in the field of global food and nutritional security for decades, as seen in her work introducing vaccinations to chickens in Tanzania in 2012. (Supplied: Sally Ingleton)\n\nShe said the data submitted by the United Nations research focused on animal muscle rather than nutrient-dense organs.\n\n\"It's something that they are actively trying to change right now,\" Dr Alders said.\n\n\"Everyone's aware now that our system is haemorrhaging nutrients if we're not taking organ meats into account,\" she said.\n\n\"Our diet has drifted. We're consuming a lot of junk food, and we're eating only the muscle. That gives us a certain range of nutrients.\"\n\nRobyn Elders says that for earlier generations, the consumption of organ meat through dishes like steak and kidney pie was very common. (ABC Capricornia: Claudia Sullivan)\n\nDr Alders said offal could be beneficial to the 25 per cent of pregnant women in Australia who were anaemic, often due to iron deficiency.\n\n\"Organ foods, such as liver, are very high in iron. [And that] iron … is what we call bioavailable. It's in a form that the body can use immediately, which means you get good uptake.\"\n\nDr Alders also said it was not clear why we were consuming less organ meat, but she had heard a few theories.\n\n\"One [could] be that as more of us are urbanised, we're more removed from the systems that sustain us and feed us, and people simply don't like the sight of organ meat,\" she said.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-12-30/stieglitz-st-helens-bushfire-caused-by-household-fire-pit/106186434",
        "title": "Waste burning in fire pit revealed as cause behind massive Stieglitz bushfire",
        "publish_date": "Mon, 29 Dec 2025 23:53:11 +0000",
        "category": "finance",
        "authors": [],
        "text": "A massive bushfire that destroyed two properties at Stieglitz, on Tasmania's north-east coast, earlier this month started in a residential fire pit, authorities say.\n\nThe fire began on December 9 at Dianas Basin, south of the beachside communities of Stieglitz and St Helens.\n\nFanned by strong winds, the bushfire raced north, burning through 1,200 hectares of vegetation, and destroyed two houses in Stieglitz.\n\nHundreds of residents evacuated their homes, while additional fire crews were called in from the state's south to help contain the blaze.\n\nTwo houses were destroyed in the blaze at Stieglitz. (Supplied: John Sullivan)\n\nThe bushfire started around Dianas Basin. (Supplied: Michael Hoult)\n\nTim McKay from the Tasmania Fire Service said the fire began when a property owner was using a fire pit to dispose of household waste.\n\n\"This incident is very disappointing and should serve as a reminder for people to exercise extreme care when using fire,\" he said.\n\nLoading...\n\n'Real sense of fear'\n\nThe bushfire occurred just days after another blaze at Dolphin Sands, also on Tasmania's east coast, which was caused by an improperly extinguished burn off.\n\nSt Helen's resident John Sullivan, who coordinates the local marine rescue group, said the incidents should serve as a cautionary tale.\n\nThe fire burnt through about 1,200 hectares of vegetation. (Supplied: Kristy Baeffel)\n\nBushfire not enough to stop students from getting to their formal Students and teachers of St Helens District High School defy the Stieglitz bushfire to hold their year 10 formal.\n\n\"If you light a fire, you're in control of it and you must therefore extinguish it,\" he said.\n\n\"Dolphin Sands wasn't done properly, and it seems to be the case here as well.\"\n\nThree weeks after the fire began, Mr Sullivan said his community was now enjoying a \"typically vibrant\" festive season.\n\nHowever, he said the scars from the bushfire remained.\n\nResidents were called on to evacuate at the height of the emergency. (Supplied: Tasmania Fire Service)\n\n\"I've taken a trip around there … the thing that really sticks in your mind is just how close it came to the back fences of residents,\" Mr Sullivan said.\n\n\"For those people at the time, there must have been a real sense of fear and trepidation.\"\n\nInvestigations continuing\n\nA fire permit period is now in effect across Tasmania.\n\nMr McKay said people needed to exercise care.\n\n\"With the bushfire season well and truly here, any unplanned fire in our landscape may be difficult to control and has the potential for devastating outcomes,\" he said.\n\n\"One spark in the wrong place at the wrong time is all it takes to put lives and property at risk.\"\n\nTasmania Police said investigations into the fire were ongoing.\n\nDozens of firefighters worked to bring the fire under control earlier this month. (Supplied: Tasmania Fire Service)",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-12-30/recreational-fishing-ban-impacts-small-businesses-midwest-coast/106181870",
        "title": "Caravan parks and tackle shops struggle as WA fishing ban bites",
        "publish_date": "Mon, 29 Dec 2025 22:04:46 +0000",
        "category": "finance",
        "authors": [],
        "text": "Small fishing boats usually fill every space at Green Head Caravan Park on WA's Midwest coast at this time of year, as fishers flock to the town to cast a line.\n\nNow, a single tinnie and a couple of caravans are all that can be seen on the site.\n\nCaravan park owner Louis Florisson said visitor numbers were the lowest they had been since his family began running the business 10 years ago, and they may have to consider closing.\n\nGreen Head caravan park has been largely empty during its peak period. (ABC Midwest & Wheatbelt: Brianna Melville)\n\nMr Florisson said he started getting calls from visitors cancelling their bookings within hours of the state government's announcement of a new raft of fishing restrictions earlier this month.\n\nThe measures included a ban on recreational boat-based fishing until spring 2027.\n\nThe announcement came two weeks before the fishery between Kalbarri and Augusta was expected to reopen to recreational fishers on December 16.\n\nMr Florisson said as a result, the small coastal town of Green Head, 250 kilometres north of Perth, lost its biggest drawcard.\n\nLouis Florisson says visitor numbers are the lowest his family has seen in 10 years. (ABC Midwest & Wheatbelt: Brianna Melville)\n\n\"That was the main reason people would come here. You can go not that far off the coast and get some really nice sized dhufish and baldie and snapper,\" he said.\n\n\"A lot of people had booked to come up on the 16th. It only gave people about a week to change their plans.\"\n\nHowever, hopes senior travellers, kite surfers and international tourists will be able to make up the losses.\n\n\"If we had a bit of warning, we'd have been able to target those audiences, but the whole community has relied on fishing,\" he said.\n\nCabins and caravan parks remain empty in Green Head after a drop in tourist numbers. (ABC Midwest & Wheatbelt: Brianna Melville)\n\nStaff dropped, businesses sold\n\nTwenty minutes down the road from Green Head, a tackle shop business has experienced a 20 per cent blow to its expected sales.\n\nSeasport Tackle Jurien Bay owner Shane Younger said he expected the losses to worsen over the rest of December and January, which was usually his peak period.\n\nTo keep his shop afloat, he has dropped two junior summer staff, decommissioned three bait freezers and sold his adjoining laundromat business.\n\n\"I've really missed already some of my main customers I get year in and year out,\" he said.\n\n\"I think they'll say, 'Look, we can't catch a dhufish, let's go to Bali or drive up to Exmouth or Shark Bay.'\"\n\nA tackle store owner in Jurien Bay says sales have dropped since the ban on boat-based demersal fishing. (ABC News: Chris Lewis)\n\nMr Younger had already ordered more than $100,000 worth of stock for the summer, which he doubts he will be able to sell until the ban lifts in 21 months.\n\nHe said many other tackle shops, bait and ice suppliers on the west coast were also suffering large falls in expected sales.\n\n\"It's huge for some of the other shops that aren't as diverse [in products],\" he said.\n\n\"All these WA family-owned businesses, they all need [customers] to help out, shop with us … don't send your money over east.\"\n\nA state government spokesperson said it was working to roll out a Fisheries Support Package as soon as possible, which would include $1.9 million for alternative recreational fishing experiences and $3.3 million in tackle shop vouchers to encourage fishers to target other species and support local businesses.\n\n\"Our iconic demersal fish species like dhufish and snapper are on the verge of extinction in some parts of WA,\" they said in a statement.\n\n\"These are reforms designed to save demersal fish and there are still alternative locations and species to fish in the West Coast zone.\n\n\"Charter fishing for demersals under the tag system will continue in the Midwest.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-12-30/1880s-zanzibar-coin-at-port-macquarie-beach-using-metal-detector/106184392",
        "title": "Coin from 1880s Zanzibar uncovered by metal detectorist on NSW beach",
        "publish_date": "Mon, 29 Dec 2025 22:02:45 +0000",
        "category": "finance",
        "authors": [],
        "text": "When metal detectorist Dale Oldham unearthed a worn coin on a northern New South Wales beach, he didn't think it was anything special.\n\nIt was not until the next day he discovered it had come from faraway shores, and originated from Zanzibar, off the coast of East Africa, in the 1800s.\n\n\"I had no idea. I thought it was just a rusted Australian $1 coin or 20 cent coin when I first put it in the bag,\" Mr Oldham said.\n\n\" I usually find a lot of can pulls and bottle caps … it was nice to find something a little more interesting. \"\n\nDale Oldham says every trip to the beach is like a treasure hunt. (ABC News: Emma Siossian)\n\nMr Oldham found the coin on December 27 and said it was buried about 20 centimetres down in the sand.\n\nHe tucked it away with his other daily discoveries and the next day went online to try to determine what he had found.\n\n\"I had a look using AI to search, which narrowed down the possibilities, and from there I could identify some of the markings,\" he said.\n\n\"I could just barely make out some details on there to identify it.\n\n\"[It's] an 1881 copper 1 Pysa coin from Zanzibar, I've never found anything like that before.\"\n\nDale Oldham says he was just able to make out enough markings to identify the coin. (ABC News: Emma Siossian)\n\nForeign currencies once common\n\nCoin expert Matthew Thompson, who runs a coin and collectables shop in Melbourne, said the coin was unlikely to hold much monetary value, but was a fascinating find.\n\nHe said it was once common for foreign currencies to be used in Australia.\n\nMatt Thompson, holding an 1852 Adelaide Pound, Australia's first gold coin. (Supplied: Matt Thompson)\n\n\"If you go back far enough, particularly in the late 1700s and early 1800s, if you look at early colonial New South Wales, to get by, we actually had to rely on currency from all around the world,\" he said.\n\n\"We didn't have our own mints here in Australia … that didn't come along until the mid-1800s.\n\n\" In the 1800s, there was currency coming on merchant ships, and things of the like, from all over the world … it was common to see international currency circulating in Australia. \"\n\nMr Thompson said old coins were often discovered by metal detectorists and offered a glimpse into the past.\n\nDale Oldham says he's recently found old Australian coins, a silver teaspoon and a euro. (ABC News: Emma Siossian)\n\n\"You can dig up these little relics … it's so fascinating to consider if these coins could talk, the stories they could tell,\" he said.\n\n\"You would learn a lot about some of the fascinating journeys these coins have taken.\"\n\nMr Oldham's coin has now taken pride of place among his collection of beach discoveries, and he said he looked forward to his next beach treasure hunt.\n\nDale Oldham enjoys spending time outside, looking for hidden trinkets at the beach. (ABC News: Emma Siossian)\n\n\"I have found jewellery for people before, gold rings, diamond rings, necklaces … I try my hardest to locate the owners.\n\n\"It's like rolling the dice every time you get down to the beach, you don't know what you're going to get.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-12-30/tas-sydney-to-hobart-yacht-race-more-boats-finish/106186132",
        "title": "Overall Sydney to Hobart leader switches as boats race ahead of wind change",
        "publish_date": "Mon, 29 Dec 2025 21:54:31 +0000",
        "category": "sports",
        "authors": [],
        "text": "The competition to nab the overall win for the 80th Sydney to Hobart yacht race is heating up, with defending champion Celestial V70 no longer in contention for a back-to-back victory.\n\nSince midnight, more than a dozen yachts have crossed the finish line — bringing the total number of boats that have completed the 2025 race to over 30.\n\nOroton Drumfire cruised into Hobart on Tuesday morning. (ABC News)\n\nThis included the first Tasmanian boat over the line, AdvantEdge.\n\nCelestial V70 had been hoping to defend its title after sailing into Hobart's Constitution Dock early on Monday morning.\n\nIt's all smiles for the crew on MWF Kayle as they near the finish line. (Supplied: Making Waves Foundation)\n\nAs of 11am, New Caledonian double-handed BNC was the clubhouse leader, after sailing into Hobart at 10:40am.\n\nHowever, with a number of contenders for handicap honours still out at sea, a victory is far from locked in.\n\nA double-handed boat, which only has two crew members, has never won the Sydney to Hobart since they got their own division in 2021.\n\nCruz and Min River, also double-handed boats, are also high on the leaderboards and expected to finish today.\n\nUnlike line honours, which is awarded to the first boat across the finish line, the overall winner takes into account handicap, such as boat size.\n\nBNC crew members Michael Quintin and Yann Rigal on their way into Hobart this morning. (Supplied: CYCA / Salty Dingo)\n\nThe fleet as at 7:45am on Tuesday, as they race around the Tasman Peninsula and Tasman Island. (Supplied: Sydneu to Hobart Yacht Race)\n\nRace worth getting emotional about\n\nRon Epstein, the skipper of Bacchanal, which also sailed in this morning, said his crew had had \"unfinished business\" after a \"disappointing\" attempt during its debut in the Sydney to Hobart race last year.\n\nThe yacht was forced to retire after its boom broke.\n\nUS Entry Bacchanal made it to Constitution Dock just after 6am on Tuesday. (Supplied: CYCA/ Salty Dingo)\n\nEpstein said he had watched this race for \"decades\" and always wanted to participate.\n\n\"And now here I am, having done something I've only watched on TV before,\" he said.\n\nSailors tell of 'horrendous' ordeal in yacht race Those now safely onshore after finishing the 2025 Sydney to Hobart tell of \"horrendous\" conditions, resulting in injuries, broken boats and seasickness — even among experienced crew members.\n\nHe said there was \"a little bit of an emotional moment\" when the crew crossed the finish line.\n\n\"But I think it's perfectly reasonable when you've sought to do something that really stretches you in this way, pushes you in this way, and to get it done with such a group of guys you've been through the wars with.\n\n\" It's something worthy to get emotional about. \"\n\nRace to beat impending southerly\n\nThe crew of First Light are hoping to reach Tasman Island before the bad weather hits. (Supplied: CYCA)\n\nAmong the yachts still working their way through the course is First Light, the only all-female crew in this year's race.\n\nAs of Tuesday morning, the 40-foot racing yacht was making its way down Tasmania's east coast and towards the Tasman Peninsula.\n\nLoading Instagram content\n\nSkipper Elizabeth Tucker said the team was hustling to beat an onslaught of southerly winds expected this afternoon.\n\n\"We're pushing quite hard to get to Tasman Island and round into Storm Bay before this southerly comes through,\" she said.\n\n\" If we hit that, it's going to be similar conditions to the first few days so we're trying to get in before then. \"\n\nYachts are trying to round Tasman Island before southerly winds hit later today. (Supplied: Rolex/Kurt Arrigo)\n\nYachts faced bruising conditions early on in this year's Sydney to Hobart, with more than a quarter of competitors retiring by the end of day three — with many citing boat damage and seasickness as the cause.\n\nTucker said Monday had brought \"champagne sailing\" conditions, which were \"chalk and cheese\" compared to days one and two.\n\n\"We're going to push hard, see what we can do. We can only go as fast as we can, but hopefully we'll get round.\n\n\" And if not, we'll just brace ourselves for another hard slog in. \"\n\nLine honours was taken out by 100-footer Comanche on Sunday evening.\n\nFollow the yachts as they sail for Hobart with the official race tracker",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-12-30/preparing-for-death-and-creating-an-end-of-life-health-care-plan/105886810",
        "title": "A shock diagnosis meant Annette and her husband had to plan for his death",
        "publish_date": "Mon, 29 Dec 2025 21:41:04 +0000",
        "category": "lifestyle",
        "authors": [],
        "text": "Dying in sudden, unexpected circumstances is not something people factor into their life plan.\n\nGenerally, we like to think death happens in old age, and for most Australians, that is the case.\n\nBut the reality is things can change in an instant, with life-changing decision-making thrust into the hands of our loved ones.\n\nWhen Perth woman Annette and her late husband Ian found out he had a rare, aggressive form of cancer, she knew they had to plan ahead.\n\nAnnette sought help to make arrangements for her husband Ian's end-of-life health care. (ABC News: Rani Fletcher)\n\nDiagnosed with cancer of the bile duct and treated with intensive palliative chemotherapy and radiation, Ian was told his life expectancy was less than five years.\n\n\"I was just looking ahead knowing Ian was terminally ill,\" she said.\n\nDeathwalkers like Zenith want to help you die well For many, voluntary assisted dying has come to symbolise control over how life ends. Yet dying well isn't just about those final hours. That's where a deathwalker like Zenith can help.\n\nThe couple went to their GP to initiate an Advance Health Directive, as it is known in WA — a legal document outlining a person's preferences for their end-of-life health care.\n\nBut at 20 pages long and involving no discussion with their GP, it was a challenge.\n\n\"We'd gone to our GP and he gave us this form with some advice on how to do [a directive], and we looked at it, and it was too hard,\" Annette said.\n\nAssistance key\n\nThat is when Annette enlisted the help of Palliative Care WA.\n\n\"[They] would say to us, 'What do you want to happen? Explain it to me,'\" she said.\n\nFor Ian, this meant refusing life-saving or prolonging intervention if he was approaching unresponsiveness or an end-of-life phase.\n\nOne-to-one assistance can help people plan for dying and what they want from the rest of their life. (ABC News: Rani Fletcher)\n\nHis wishes were then translated into medical and legal terminology that were written into the directive.\n\nAnnette described how one-to-one assistance made completing a directive \"so much easier\", and without it she believed they \"probably would have put it off again\".\n\nHaving a plan, she said, meant when Ian's health deteriorated, there were no disagreements among the family about the next steps.\n\nThe difficulties Annette and Ian encountered are not uncommon.\n\nIn 2021, just 2 per cent of Western Australians across four hospitals and aged care facilities had created a directive.\n\nPalliative Care WA's Julia Kennington (left) says people can feel overwhelmed by an Advance Health Directive. (ABC News: Rani Fletcher)\n\n\"The document itself, 99 per cent of it, is very straightforward,\" Palliative Care WA's Julia Kennington said.\n\n\"It's just that people feel a bit overwhelmed by it.\"\n\nTime a barrier\n\nIf that documentation is not done, it falls to time-poor GPs and doctors.\n\nAustralian Medical Association (AMA) spokesperson Dr David Mountain said creating a directive on the hop was \"time consuming and difficult work\".\n\n\"You're not paid extra for doing the forms and filling them out. That's supposed to be paperwork that you add on to the end of your already very long and busy day,\" he said.\n\nBusy GPs are often left to pick up the pieces on top of their normal patient workload. (ABC News: Maren Preuss)\n\nHe said the challenge was not just in GPs initiating these conversations, but in health professionals locating and following the directives.\n\nThe ABC spoke with several people who work in the sector.\n\nThey pointed out challenges in identifying and locating the documents in emergency situations, when the focus was on dealing with the immediate situation at hand.\n\nAssociate Professor Mountain said understaffed nursing homes had trouble managing patients, with residents sometimes transferred to emergency departments against their family's wishes.\n\nAged care homes face a challenge locating and following the directives in urgent situations. (ABC News: Maren Preuss)\n\n\"[The directives are] either not seen and so people don't know they're there or they're just not followed, because what's going on in the nursing home at the time means [staff] don't feel they can follow it or provide the care that's required,\" he said.\n\nExceptions to adherence\n\nAdvance Care Planning Australia — the peak, government-funded national program providing resources and education on advance care planning — said there were certain circumstances where parts of a directive do not have to be followed.\n\n\"If the instructions are ambiguous or uncertain, this may be grounds for a health professional to not be required to follow them,\" a spokesperson said in a statement.\n\nThe conversation families avoid, and why it matters when time runs out Many people struggle to approach the subject of death with family, and what kind of care they want to receive in their final months or years.\n\nThey said it was important the document outlined key, ideal outcomes, such as living in your own home.\n\nIn 2025, just one-third of Australians had engaged in a form of planning for end-of-life care, and just 6 per cent had created a directive.\n\nBut experts think Australians are also deterred by an unwillingness to talk about death.\n\nEnd-of-life consultant and educator Dr Annetta Mallon said death had become less visible in our day-to-day lives over the last century.\n\nDr Annetta Mallon says talking about death is vital for coming to terms with it. (Supplied: Annetta Mallon)\n\n\"We used to die at home, have all of our after-death, body care rituals [and] waking often done at home,\" she said.\n\n\"The language that we use frames the permissions we have to talk openly about something or not.\n\n\"If we cannot be explicit in talking about something, we cannot be explicit in trying to come to terms with it.\"\n\nTalking about death\n\nDr Mallon compared end-of-life conversations to being \"kind of like taxes\".\n\n\"I don't necessarily always want to do my taxes, but it's important to do them,\" she said.\n\nAnnette said Ian's plan was \"vital in communicating his wishes to his end-of-life carers\".\n\n\"There's so many decisions you have to make after that person's gone, and if you don't know [their wishes] it's very hard,\" she said.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-12-30/crowds-will-love-her-kasatkina-s-landmark-home-australian-open/106186126",
        "title": "Kasatkina has players' support ahead of landmark home Australian Open",
        "publish_date": "Mon, 29 Dec 2025 21:26:26 +0000",
        "category": "sports",
        "authors": [],
        "text": "Daria Kasatkina is primed to return from a mental health break and make her first Australian Open as a local winner, according to veterans Storm Hunter and Daria Saville.\n\nRussian-born Kasatkina switched allegiances to Australia in March, less than two months after reaching the fourth round at Melbourne Park for the first time.\n\nAfter declaring for Australia, the former world number eight reached the fourth round at Roland Garros and the third round of Wimbledon and the US Open.\n\nBut in October, Kasatkina pulled the pin on her season, blaming the \"emotional and mental stress\" related to the change, the strain of not seeing her family and the relentless schedule of the tennis circuit.\n\nDaria Kasatkina (right) made the fourth round the last time she played at Melbourne Park earlier his year, losing o Emma Navarro. (AAP: Lukas Coch)\n\n\"I've been far from fine for a long time and, truth be told, my results and performances show that,\" the 28-year-old wrote on social media.\n\n\"Truth is, I've hit a wall and can't continue. I need a break.\"\n\nKasatkina vowed to return \"energised and ready to rock\" in 2026 and will kick off her season at the Brisbane International, which starts on January 4.\n\nKasatkina 'taps out' of 2025 Daria Kasatkina ends her 2025 WTA season early, citing the hectic schedule and a high-stress year after switching nationalities to Australia from Russia.\n\nA French Open semi-finalist in 2022, Kasatkina finished the previous four calendar years ranked in the top 10 but is currently 37th.\n\nShe is unlikely to be seeded in January and has slipped behind world number 32 Maya Joint in terms of the Australian pecking order.\n\nBut Kasatkina will be among the event's main drawcards, likely featuring on Rod Laver Arena, given her credentials.\n\nHunter, who has known Kasatkina for years, backed her to perform — and the local crowd to \"embrace\" her.\n\n\"It'll definitely be a new thing for her,\" Hunter told AAP.\n\nDo you have a story idea about women in sport? Email us abcsport5050@your.abc.net.au\n\n\"I don't think she needs any tips from us. She's played in a lot of high-pressure moments herself.\n\n\"But I think the biggest thing is just showing her that she has our support.\n\n\"We have a group chat with Australian female tennis players. She's part of that. She's very active in it as well, talking. She knows that she has the support of the players.\"\n\nHunter predicted Kasatkina, who is still ineligible to play Billie Jean King Cup for her new country, would \"go out and do her thing\" at Melbourne Park.\n\n\"The crowds will love her because she is such a very nice person, very open, honest, she wears her heart on her sleeve,\" she said.\n\n\"She's got her YouTube channel, so everyone can get along, and they know her story and what's happened. That's really cool.\n\n\"She will definitely feel nervous, but she's going to be just fine.\"\n\nKasatkina and fellow Russian-born player Saville have been close friends for years. They have been in regular contact during the former's break.\n\n\"We always check in on each other and reach out to each other. Sometimes it's not that deep and not that serious,\" Saville told AAP.\n\n\"She's going well. She's training now. She's looking forward to the next season.\"\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\nSaville, who is pregnant and skipping the Australian Open, expected Kasatkina to thrive.\n\n\"I think she's going to really enjoy it,\" she said.\n\n\"When she played in New York, she felt very welcomed. We're a group of girls, we're really nice.\n\n\"We're like, 'you're part of us, hello'. She's really excited to come to Australia and enjoy the home advantage.\"\n\nAAP",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-12-30/sportsbet-fined-313k-for-systemic-failure-slap-on-wrist/106185320",
        "title": "Sportsbet fined $313k for 'systemic failure' to thousands of customers",
        "publish_date": "Mon, 29 Dec 2025 20:55:02 +0000",
        "category": "finance",
        "authors": [],
        "text": "Australia’s largest online bookmaker Sportsbet has been fined more than $313,000 for failing to protect thousands of customers from potential gambling harm.\n\nThe company was found to have breached its licence conditions by failing to provide 6,131 customers with \"activity statements\" over an 18-month period between 2022 and 2024.\n\nThe monthly statements from online bookmakers to customers are mandatory, to provide sports betting customers with a detailed breakdown of their gambling habits.\n\nAustralia’s de facto online gambling regulator, the NT Racing and Wagering Commission (NTRWC), fined the company $313,140 for the breaches, which it described in its decision notice last month as \"appropriate and proportionate\".\n\nUnder industry regulations, online bookmakers are required to provide sports betting customers with a detailed breakdown of their gambling habits. (Getty: svetikd)\n\nThe NTRWC said Sportsbet’s breaches represented \"a distinct and recurring failure to comply with a core consumer protection requirement\".\n\n“The ongoing nature of the contraventions demonstrates a systemic failure in the licensee’s governance and assurance framework,” the decision reads.\n\nThe NTRWC said the penalty reflected \"the seriousness of the conduct\", which it found had led to a \"heightened potential for consumer harm\".\n\nSportsbet blamed \"several technical issues\" on its failure to produce 51,525 statements in total and told the commission it \"regrets the incident\" and \"sincerely apologises\" to affected customers.\n\nThe NTRWC also found Sportsbet did not report the breaches until five months after it had investigated its internal technical problems, which the commission said \"reduc[ed] transparency and limit[ed] the commission’s ability to assess the issue in real time\".\n\nAlastair Shields says the NTRWC \"will continue to take firm enforcement action to ensure compliance\". (ABC News: Pete Garnish )\n\nIn a statement on Monday, NTRWC chair Alastair Shields said the \"assessment of multiple breaches has resulted in a substantial total fine, underscoring the seriousness of the non-compliance and the commission’s response to it\".\n\n\"The commission will continue to take firm enforcement action to ensure compliance and promote a safer wagering environment,\" he said.\n\nMr Shields said the commission had not been notified of any legal challenge to its decision.\n\n'A slap on the wrist'\n\nHead of Monash University’s Gambling and Social Determinants Unit, Charles Livingstone, said while Sportsbet’s breach was \"fairly serious\", the fine amounted \"at best, to a slap on the wrist\" for the company.\n\n\"A fine of $313,000 is certainly big for the NT regulator, but for Sportsbet it's virtually nothing, given they generate literally billions in revenue every year,\" he said.\n\n\" It's a very modest amount. \"\n\nIn 2024 the NT parliament brought in new maximum penalties available to the NTRWC, lifting them from $27,450 to $472,500.\n\nCharles Livingstone says a $313,000 fine is \"virtually nothing\" for a company the size of Sportsbet. (ABC News: William Howard)\n\nBut a Four Corners investigation earlier this year found that because of lengthy delays at the commission, recent decisions had been made under the old legislation, meaning fines remained low, and it had never cancelled or suspended a bookmaker's licence due to disciplinary action.\n\nProfessor Livingstone said the Sportsbet fine showed the NTRWC was trying to \"demonstrate a commitment\" to being a robust regulator.\n\n\"However, I'm unpersuaded,\" he said.\n\nLandmark case to recover gambled stolen millions A landmark legal case against three of Australia's biggest online betting agencies has been filed in the Federal Court, aimed at recovering millions of dollars' worth of stolen money that was gambled away and kept by corporate bookmakers.\n\n\"If the commission wants to demonstrate effectiveness it needs to be properly resourced, undertake active investigations, and be prepared to suspend or cancel licences.\n\n\" Until those changes occur, it remains wide open to accusations of being ineffective and a jurisdiction of convenience. \"\n\nMr Shields said Sportsbet's breaches \"occurred while the now repealed Racing and Betting Act 1983 was in force\" meaning the company was fined under the old system.\n\n\"The range of penalties available to the commission under the Racing and Wagering Act 2024 includes considerably higher fines,\" he said.\n\nSportsbet did not respond to a request for comment.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-12-30/cochlear-implants-debate-in-the-deaf-community/106044156",
        "title": "Jessica could have a cochlear implant but decided not to. Here's why",
        "publish_date": "Mon, 29 Dec 2025 20:32:19 +0000",
        "category": "lifestyle",
        "authors": [],
        "text": "Jessica Cosgrove was only three years old when she had surgery to insert a cochlear implant hearing device.\n\nThe Australian Sign Language (Auslan) lecturer still remembers the shock of what happened when it was turned on a year later.\n\n\"I remember feeling confused and looking at the white soundproofing walls when the noise started,\" she said.\n\n\"I was so startled that I screamed to my mum, 'I'm hurt! My ear hurts!' My mum didn't understand. She just kept saying, 'No, it's all good!' But I felt really uncomfortable.\"\n\nNow 37 years old, the Perth mother of one lives with a form of deafblindness known as Usher syndrome and does not regret her decision to stop using her cochlear implant a few years after it was installed.\n\n\"Deafness is not a tragedy,\" she said.\n\n\"It's simply a different way of experiencing the world.\"\n\nWhat is a cochlear implant?\n\nCochlear implant surgery is quick and relatively simple. (ABC News: Dominic Briggs)\n\nA cochlear implant (CI) is a device that stimulates nerves inside the ear to provide the sensation of sound to people who are profoundly deaf.\n\nOne part of the implant sits behind the ear, picking up sound and converting it into patterns of nerve stimulation.\n\nThe other part is implanted under the skin behind the ear and has electrodes that thread into the cochlea in the inner ear.\n\nImplant surgery can usually be completed in less than a day.\n\nThe Australian Institute of Health and Welfare (AIHW) said profound deafness affected approximately 10,000-12,000 adults and 1,400 children in Australia.\n\nFrom this population, roughly 2,000 adults and 570 children are eligible for a cochlear implant.\n\nAustralian children denied 'basic human right' of Auslan access Suzie watched her son's development deteriorate for years. Doctors said it was all part of the process, but they were wrong. So she went her own way.\n\nDebra Swann, the chairperson of advocacy organisation Deaf Australia, said decisions on whether to install cochlear implants in young patients were fundamentally about balancing two responsibilities.\n\n\"The first being the parents' obligation to give their child access to the world around them,\" she said.\n\n\"The second being the child's future right to autonomy, identity and linguistic freedom.\n\n\"Deaf advocates argue that parents who choose cochlear implantation for a very young child are making a profound decision that affects not only their child's hearing but also their identity, cultural belonging and the communication path they will be expected to follow.\"\n\nNew algorithm cuts time to tune bionic ears Cochlear implants can be a life-changing tool for people with hearing loss — but they're not perfect. Now, a biomedical engineer has come up with a new approach to testing improvements to the bionic ears.\n\nThe Australian Deaf community's sign language, Auslan, is recognised as its own language, separate to English, with its own grammar and structural rules.\n\nDeaf advocates argue the language ties their community together, especially given that the use of sign language in schools was once banned.\n\nMs Swann said many Deaf adults feared decisions to prioritise having CIs over learning Auslan could reflect the values of their hearing parents rather than the child's future preferences.\n\n\"The child cannot express whether they would prefer to grow up in Deaf culture or the hearing world,\" she said.\n\n\"And because implants require years of therapy and commitment, some think it is a decision that should ideally involve the child when they are old enough to understand their own needs and identity.\"\n\nThe medical perspective\n\nTim Jones is the deputy chair of the Tasmanian branch of the Royal Australian College of General Practitioners.\n\nCharlotte gains gift of sound Three-year-old Charlotte Rivett was born with profound hearing loss, but cochlear implants have given her the gift of sound. Her parents are calling on the community to help other children like her.\n\nHe said CIs were \"the most effective intervention\" for profound hearing loss but doctors did have an obligation to discuss other options like sign language before fitting children with CIs.\n\n\"It is absolutely a standard of care to support informed consent and shared decision-making,\" Dr Jones said.\n\n\"Speaking as a solo GP with a strong interest in child development, I would comment that it [the debate around consent] reflects some of the inherent gaps in our society.\n\n\"There is good evidence that children can receive assisted hearing devices like cochlear implants, and [a] strong education and learning of sign language without the two being mutually exclusive.\"\n\nHelping people find 'the right solution'\n\nEliza Brbich says access to sound early in life can help with speech and social skills. (ABC News: Dominic Briggs)\n\nPerth-based audiologist Eliza Brbich has worked in the industry for 16 years.\n\nShe said cochlear implants were a good option for people who were not getting enough benefit from conventional hearing aids.\n\nBut she also stressed that \"it is our job to guide people to find the right solution for them\", which can also include using sign language.\n\n\"In the face of difficult decisions, looking at scientific evidence is a good place to start,\" she said.\n\n\"We know that a lack of or insufficient access to sounds in our early years can lead to delays in speech, language, social and emotional skills.\n\n\"I don't envy parents having to decide whether to go ahead with getting a cochlear implant for their child.\n\n\"These parents are deciding a lifelong pathway for their child before their child has the ability to tell them what they want.\"\n\n'I don't wish my mum had waited'\n\nRyan Malonda uses sign language. (Supplied: Ryan Malonda)\n\nThirty-year-old Ryan Malonda works on accessibility technology for the government's National Disability Insurance Agency in Melbourne.\n\nHe has no regrets about receiving a cochlear implant as a child.\n\n\"I was implanted at about 17 months old, in April 1997,\" he said.\n\n\"My surgery was part of an early trial of the Nucleus 24 Cochlear Implant System.\"\n\nMr Malonda said he was the youngest person in Victoria to receive a CI at the time because surgeons then did not typically perform the procedure on babies under 18 months due to the belief that their skulls were too small.\n\nMr Malonda's deafness is classified as bilateral profound sensorineural.\n\nA world without music As an avid music lover whose hearing was rapidly deteriorating, Vicki had to make an agonising choice.\n\nAs newborn hearing tests were not commonplace at the time, his mother only discovered her son could not hear when he was between three and six months of age.\n\n\"I do not think I wish my mum had waited for me to be old enough to make that choice,\" he said.\n\n\"Language acquisition as early as possible is absolutely critical and delaying that would have had lifelong consequences.\n\n\"At that time there was no NDIS or nationally coordinated support system for parents of Deaf children.\n\n\"It would have been extremely difficult for my mum to find the Deaf community or ensure I could develop fluent sign language skills.\n\n\"That would have also been her third language, since English is not her first language.\n\n\"So, it would have been hard for her to access the support she needed to learn sign language herself and become fluent enough to communicate with me.\"\n\nHe said doctors at the time \"discouraged Mum from using sign language [but] did not provide any evidence to support that advice\".\n\n\"She was simply told to focus on speech and listening without being shown the full picture of what a bilingual approach could offer,\" he said.\n\n'Deaf people can be powerful role models'\n\nA faint scar behind her ear is the only external sign of Jessica's old CI. (ABC News: Keana Naughton)\n\nBack in Perth, Jess Cosgrove has been using sign language all her life.\n\nWhen she was seven years old her CI was packed into a box and never used again.\n\n\"I saw my brother one day running outside, super-excited. I asked my mum what was going on but she insisted I put my CI on and identify the sounds,\" she said.\n\n\"I lost my temper, grabbed her arm and screamed at her to sign to me. She eventually did, saying it was an ambulance.\n\n\"I had gotten my way, but I was exhausted.\"\n\nAfter that, her parents succumbed to their daughter's desire to use sign language and be part of the Deaf community.\n\nMs Cosgrove says if she had been given the choice she would have said \"no\" to a CI.\n\nFor parents who may be receiving medical advice for their Deaf children she recommended talking to other Deaf people.\n\n\"Lived experience differs from medical expertise,\" she said.\n\n\"And Deaf people can be powerful role models.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.smh.com.au/culture/live-reviews/thirty-years-on-rave-veterans-underworld-still-own-the-night-20251230-p5nqp0.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Thirty years on, rave veterans Underworld still own the night",
        "publish_date": "Tue, 30 Dec 2025 13:00:43 +1100",
        "category": "entertainment",
        "authors": [
            "Kate Prendergast"
        ],
        "text": "MUSIC\n\nUNDERWORLD\n\nCarriageworks, December 29\n\nReviewed by KATE PRENDERGAST\n\n★★★★½\n\n\n\nThe lore of Underworld goes deep. It’s been a rich, rambling journey over four decades – featuring existential curveballs and crowning glories in clubs, stadiums, soundtracks and their massive, stasis-defying catalogue. Now celebrating 30 years of Born Slippy (Nuxx), the rave firmament Rick Smith and Karl Hyde occupy is a legacy assured.\n\nSixty-something titans of anti-conformist dance music, sculpting mind-warping odysseys through their ever-expanding polygenre of techno and progressive, ambient and dub, city-scavenged poetry and art-rock, they’re the result of the generation of Kraftwerk and Joy Division crashing into the UK’s acid house revolution, to pioneer their own infectious groove that is dark and long, propulsive and psychogeographic, experimental and euphoric.\n\nRick Smith’s vast rig took half an hour to set up. Credit: Blake Houghton\n\nTheir live shows are legendary. This one, launching Finely Tuned’s summer warehouse series at Carriageworks, may have ended a smidge early, at the rave rat’s waking hour of 10.20pm (likely a set times gaffe). But over their 80 minutes on stage, in front of a sold-out Monday crowd of old, young and all-shining faces, these two best mates gave us everything.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/western-australia/west-coast-investigating-after-player-allegedly-involved-in-street-fight-20251230-p5nqom.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "West Coast investigating after player allegedly involved in street fight",
        "publish_date": "Tue, 30 Dec 2025 12:37:23 +1100",
        "category": "sports",
        "authors": [
            "Heather Mcneill"
        ],
        "text": "The West Coast Eagles are investigating a street fight in Geraldton at the weekend which allegedly involved one of their players, Tyler Brockman.\n\nAn altercation between three men, including a shirtless Brockman, was filmed on a mobile phone, with one of the men reportedly suffering a broken jaw in the fight.\n\nTyler Brockman. Credit: Russell Freeman/AFL Photos via Getty Images\n\nIn a statement, West Coast said it was aware of the incident, which occurred on Saturday night.\n\n“The club is providing support to Tyler while working to gather all relevant information about the incident and is unable to make any further comment at this time,” it said.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/afp-commissioner-offers-update-on-bondi-attack-investigation-20251230-p5nqp5.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "AFP Commissioner offers update on Bondi attack investigation",
        "publish_date": "Tue, 30 Dec 2025 12:13:07 +1100",
        "category": "finance",
        "authors": [],
        "text": "AFP Commissioner offers update on Bondi attack investigation\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/lifestyle/king-releases-new-years-honors-list-20251230-p5nqp1.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "King releases New Year's Honors List",
        "publish_date": "Tue, 30 Dec 2025 12:06:22 +1100",
        "category": "lifestyle",
        "authors": [],
        "text": "King releases New Year's Honors List\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/explaining-australia-s-enduring-love-affair-with-vintage-sportswear-20251215-p5nnuh.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Explaining Australia’s enduring love affair with vintage sportswear",
        "publish_date": "Tue, 30 Dec 2025 12:00:26 +1100",
        "category": "sports",
        "authors": [
            "Jonathan Drennan"
        ],
        "text": "Save Log in , register or subscribe to save articles for later. Save articles for later Add articles to your saved list and come back to them any time. Got it Normal text size Larger text size Very large text size Across Australia, closets and cupboards are being curated with collections of vintage sportswear. The choice of sport can vary dramatically, as can the monetary value of a haul, but a major motivation is found in nostalgia for a time that has passed. Sport provides good and bad memories, but a precious few are special. A formerly unloved piece of polyester or cotton can take its owner back to a season, a game, or even a moment they cherish. Or you can just look really cool and earn that knowing nod when you cross paths with a like-minded individual. In rugby, rugby league, Australian rules football, and cricket, we have explored what drives people to collect. Cricket Adam Collins has translated a lifelong love of cricket into a successful career as a commentator and writer, and is currently working on the Ashes series. His collection of cricket jerseys transports him immediately back to his childhood, when he first fell for the game. “Usually, people think of childhood as being a simpler time, and when going through and looking at these vintage jerseys or collections, it’s a way of connecting with that happier, easier time in their lives,” Collins said. “I know that for me, that’s how I identify with tops, especially from that early to mid-90s era. It’s before you’re aware of just how difficult the world can be, I suppose, and the game has got a pure innocence to it that is pure to it and lacking in any cynicism.”\n\nAdvertisement\n\nMerv Hughes appeals for a wicket during Benson & Hedges World Series match between Australia A and England in 1994 at the MCG in Melbourne, Australia. Credit: Ben Radford/Getty Images What is the greatest Australia limited-overs jersey remains a hot topic. The green side panels of the 1981-84 World Series Cup worn by the likes of Dennis Lillee and Greg Chappell set against the debut of the 1992 World Cup jersey, complete with blue, green and red-coloured shoulders. For Collins, his pick for the best Australian jersey is unusual; it’s an Australian A jersey from the 1994/1995 season. The one-day series between Australia A, England, Zimbabwe and Australia represented a happy memory of childhood and cheering the underdogs from the ‘A’ side, including Ricky Ponting, Justin Langer and Matthew Hayden. The hunt for the elusive jersey became a quest. “I was at an indie club in Melbourne about 10 years ago, and I saw a guy downstairs in the bar wearing an Australia A top,” Collins said. “By this stage, I’d had some failed missions trying to get one, a proper one from eBay. I ended up with some not-real ones; they were sort of close to it, but didn’t quite meet the criteria. Greg Blewett bowling for Australia A against Mark Taylor and Australia in 1995. Credit: Getty Images “I went up to the guy and said to him I’d pay him, thinking that he may not have an understanding of what he was wearing, maybe he got it from a secondhand shop or something, but he wasn’t interested in that.\n\nAdvertisement\n\n“Then I just outright said, I’ll give you 400 bucks, because I just arrived with that figure in my head. And he said that he wouldn’t sell it for anything. “And I immediately shook his hand and said, I respect that because I’d be the same if I had an Australia A top that was a real one from 94-95, I wouldn’t sell it to anyone for anything.” Allan Langer in the memorable Brisbane Broncos jersey of 1998. Credit: Getty Images Rugby league The owner of the Retro Rugba Leeg online store prefers to be known simply as ‘Retro’. Formerly a youth minister for over a decade, ‘Retro’ has switched to selling rugby league jerseys full-time due to skyrocketing demand. Retro grew up as a Roosters fan with a wider appreciation for jersey design across the game. Asked about the most requested jerseys, he does not hesitate. “The number one in terms of current teams would be the Broncos, and it would be like the teal and the aqua jerseys,” he says. “There was one in 1998, there was one in 2002, and then there was also the 1995 World Sevens jersey.\n\nAdvertisement\n\nJumpers of defunct clubs such as the Western Reds remain in hot demand Credit: Getty Images “They departed from their normal colours and had these teal or aqua ones. Everyone wants those. You can’t find them as most of them are player issue only. “You’d be looking upwards of two and a half grand to try and get your mitts on one, but they’re just not there, you just cannot find them. The other ones are more defunct clubs. So think like Gold Coast Chargers, South Queensland Crushers, [North Sydney] Bears, now the Bears are coming back in, Tweed Seagulls or Gold Coast Seagulls. “Anything that used to exist that doesn’t exist any more. Super League stuff, particularly Adelaide Rams or Hunter Mariners, that’s also pretty sought after.” The South Queensland Crushers jersey, worn here by Dale Shearer, didn’t grace the fields for very long. Credit: Getty Images While there is a huge global demand for rare vintage soccer jerseys, Retro believes rugby league is also holding up its end in the fashion stakes.\n\nAdvertisement\n\n“Obviously scarcity drives price. When it comes to things like Magic Round, that’s like the Milan Fashion Week of rugby league. Everyone plans – if they go on for four days, they’ll plan what they’re wearing every day. “And if their team’s not playing that day, they want to wear something really unique, something eye-catching. “There’s this whole phenomenon called ‘blokecore’ – it’s basically like where it’s on trend for even girls to dress as like 35-year-old men. “So that’s what’s behind girls buying soccer jerseys. They don’t really watch soccer, but they wear them as a fashion trend. You wear the big chunky sneakers, you know, the jean shorts, that whole look, it’s kind of come out of the culture in the UK. And it’s kind of started to work its way over here, particularly when rugby league has leaned into that.” Australian Rules Football Mitch from Footy Finds grew up a Sydney Swans supporter and parlayed his hobby of locating rare AFL merchandise into a successful business. A prized personal possession is a training jumper he believes was worn by Adam Goodes. He now fields enquiries from fans all over Australia desperate to source treasured nostalgia.\n\nAdvertisement",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/two-charged-after-semi-automatic-guns-drugs-allegedly-found-in-melbourne-home-20251230-p5nqoy.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Two charged after semi automatic guns, drugs allegedly found in Melbourne home",
        "publish_date": "Tue, 30 Dec 2025 11:53:33 +1100",
        "category": "finance",
        "authors": [],
        "text": "Two charged after semi automatic guns, drugs allegedly found in Melbourne home\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/boxing-champ-involved-in-fatal-car-crash-20251230-p5nqlr.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Boxing champ involved in fatal car crash",
        "publish_date": "Tue, 30 Dec 2025 11:52:05 +1100",
        "category": "finance",
        "authors": [],
        "text": "Boxing champ involved in fatal car crash\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/cricket/khawaja-green-healy-and-perry-what-does-2026-have-in-store-for-australian-cricket-20251222-p5npi2.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Khawaja, Green, Healy and Perry. What does 2026 have in store for Australian cricket?",
        "publish_date": "Tue, 30 Dec 2025 11:33:00 +1100",
        "category": "sports",
        "authors": [
            "Jon Pierik"
        ],
        "text": "There are key decisions to be made on and off the field if Australia are to remain an on-field force, while improving a bottom line which tumbled to a net deficit of $11.3 million over the past financial year is also a must.\n\nAdelaide must have been an emotional rollercoaster for the 39-year-old, who declared himself fit, then was overlooked for selection, only to make a dramatic late entrance at No.4 when Steve Smith was ruled out due to vertigo. Khawaja’s knocks of 82 and 40 showed he still has the game, and he has yet to publicly declare any intention to retire. However, the selectors will need to make the tough call after Sydney. It’s time for Travis Head and Jake Weatherald to be given time to mature together at the top of the order.\n\nLoading\n\nWhat happens when it’s time to sober up once the Ashes party subsides?\n\nFurther to the Khawaja question, the selectors have more decisions to make or, at least, seriously debate, although there is an eight-month break from the Sydney Test to the team’s next red-ball clash, a home series against Bangladesh in August. Nathan Lyon’s 38-year-old body is showing signs of not holding up with a serious calf injury during the 2023 Ashes, now followed by a major hamstring issue. Is it time to give a younger spinner more of an opportunity before the heavyweight 2027 tour of India? Where does Josh Hazlewood fit in after another home summer ruined by injury? And is it time to promote a new Test vice-captain, for skipper Pat Cummins has his own injury issues, and Steve Smith will be 37 in June? Travis Head seems the natural fit there.\n\nIs change also on the way for the women’s national team?",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/lifestyle/health-and-wellness/for-whatever-reason-i-still-keep-going-richard-scolyer-contemplates-the-future-20251208-p5nlvb.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘For whatever reason, I still keep going’: Richard Scolyer contemplates the future",
        "publish_date": "Tue, 30 Dec 2025 11:30:00 +1100",
        "category": "lifestyle",
        "authors": [
            "Garry Maddox"
        ],
        "text": "Save Log in , register or subscribe to save articles for later. Save articles for later Add articles to your saved list and come back to them any time. Got it Normal text size Larger text size Very large text size It’s drizzling as Professor Richard Scolyer arrives on his bike for lunch. We hug a greeting outside The Royal Hotel in Leichhardt, a short ride from his home in Sydney’s inner west, then the former Australian of the Year chains it to a pole. More than 2½ years after being diagnosed with a lethal brain tumour, Scolyer is still cycling, still running his local five-kilometre Parkrun just about every Saturday and still confounding expectations. Since taking on a world-first treatment that could have killed him at any time – a combination of three immunotherapy drugs and a personalised cancer vaccine – the internationally renowned pathologist and cancer researcher has shown amazing resilience, lasting well past the median survival for his savage glioblastoma of 14 months. The outlook was grim when an operation last March confirmed the tumour that had been largely excised during what’s called debulking surgery was aggressively growing back. But he has exceeded expectations again that he had just a few months to live. And even though Scolyer now believes he is slowly declining, he is delighted to have reached more milestones: his 59th birthday in December, another Christmas, and another summer holiday with his family – wife Katie and children Emily, 21, Matthew, 20, and Lucy, 17. “Now we’re 2½ years out and we can have a chat like this, I’m astounded and very, very happy,” he says at our table upstairs. “I keep getting told that – not in these words – ‘you don’t have much time left, and you’re gunna die within a month most likely’ and, for whatever reason, I still keep going. “I really hope that’s because of this treatment. That it can make a difference for other people, but it could be luck.”\n\nAdvertisement\n\nPrime Minister Anthony Albanese, who announced $5.9 million in funding to establish the Richard Scolyer Chair in Brain Cancer Research at Chris O’Brien Lifehouse in September, called him “inspiring to millions”. That reflects the courage Scolyer has shown in trying to reinvent brain cancer treatment with joint 2024 Australian of the Year Professor Georgina Long. The then co-medical directors of Melanoma Institute Australia – he has since stepped down – ignored the standard treatment of surgery, chemotherapy and radiotherapy to tackle his cancer and instead trialled what they had learnt successfully treating patients with advanced melanoma. “I’m not at the capacity that I was some time ago”: Richard Scolyer. Credit: Steven Siewert Scolyer has also been inspirational for his openness and positivity in chronicling the ups and downs of his treatment, including in the bestselling memoir that we wrote together, Brainstorm, and with regular posts on social media. He has been hard to pin down for a Lunch With interview, though. Months earlier he chose The Royal, a favourite place for family dinners, but had to cancel twice when he wasn’t well. After some difficult weeks, particularly during an experimental drug treatment, then the devastation of the tumour’s return, Scolyer is back to his usual upbeat self. But he admits to short-term memory problems that include struggles with words. “I forget people’s names, which is probably the worst thing that I do,” he says. “It’s not just people who aren’t real close to me. Sometimes I get one of the kids’ names wrong or people I know really well.” Scolyer says he was mortified when he recorded a video for a Tasmanian Aussie Rules team that he is the No.1 ticketholder for, the Bridgenorth Parrots, and realised when he watched it days later that he had not only got the town’s name wrong but had called his treatment centre “Chris O’Brien Landscaping” instead of “Lifehouse”. The players reportedly found the video inspirational anyway.\n\nAdvertisement\n\nLoading When he learnt from a scan that the tumour had crossed to the other hemisphere of his brain, it was a blow late in the year. “The two sides of your brain are only connected [in a few places], and for it to go to the other side, that ain’t good news,” he says. “I’m not at the capacity that I was some time ago, and the X-rays correlate with it getting worse, showing more disease.” How does he react to setbacks now? “It pisses me off, but I’m more accepting of changes,” Scolyer says. “The fact I’ve spent so much time with my kids, which I didn’t expect, that’s been good.” Despite what he says, he looks healthier than when we’d caught up for an impromptu pizza a few weeks earlier. While a couple of extra kilograms has made him less drawn in the face, recent radiotherapy has left him with a ring-barked hairstyle that, to his credit, he doesn’t cover up with a hat. Not wanting his medical team (or readers) to think he is letting himself go, Scolyer contemplates a burger then orders a fattoush salad with avocado. I go for a sweet potato salad with chicken and, to round out a healthy lunch, we’re both drinking mineral water. Fattoush salad with avocado at The Royal Hotel. Credit: Steven Siewert\n\nAdvertisement\n\nKeeping fit has continued to be important to Scolyer during treatment. Having now passed 270 Parkruns, the longtime triathlete’s next sporting goal is cycling the Tasmanian stages of the Tour de Cure cancer research fundraising ride with Matthew in March. (He grew up in Launceston and still visits his father, 90, and mother, 89, when he can.) “I’m happy to take risks now,” Scolyer says of the new challenge. “The writing’s on the wall. I’ve been here for much longer than was expected and want to do those things with my mates, getting out there and enjoying life. One thing that’s really come home for me is the importance of doing things that you like doing.” While still not entirely comfortable being a public figure, Scolyer tries to use his profile to push for more funding for research into brain tumours. “The biggest thing is to try and make a difference in this field of cancer,” he says. “It’s not funded well enough to push things along. It’s a difficult tumour to get into – it’s inside your brain, it’s got big bones, skull, around it. The brain itself doesn’t have spare cells that are not so vital there. The way some of the tumours grow is through subtle, peripheral, infiltrative growth. Sweet potato salad with chicken. Credit: Steven Siewert “Basically, you can’t see it on radiology, you can’t see it [during surgery]. The pathologist can see more, but you’re still struggling to find the end of it. So it’s a tough disease to do something about. We’ve got to find ways to do it better.” The food arrives and proves to be as tasty as it looks. What does he do now when he feels especially low? “Different things at different times,” Scolyer says. “Just lately, my threshold for being disappointed about small things is different. That’s partly the effect of the tumour, but it’s only with close family members. They’ve copped it more than others.\n\nAdvertisement\n\n“But I feel like I’ve come out of a hole. A lot of things are changing. My sleep isn’t what it used to be [during much of his treatment] – 10 or 12 hours. I’m back to seven hours.” One of Scolyer’s treatment centres is Chris O’Brien Landscaping – sorry, Lifehouse. When he was a junior doctor at Sydney’s Royal Prince Alfred Hospital, O’Brien mentored him, and they worked on research projects together. So it’s a cruel irony that Scolyer now has the same type of cancer that killed the famous head and neck surgeon around the same age, 57, in 2009. Has he ever wondered whether there is something about their work or the hospital environment that caused both their glioblastomas? The bill for lunch at The Royal Hotel in Leichhardt. Credit: “That’s a great question,” Scolyer says. “We don’t know is the bottom line. I’ve certainly wondered that. Is there some association? But it doesn’t add up. People in different fields get this sort of cancer.” How long does he think he can last? “Excuse me while I chew away,” he says. “But who knows? There are world experts in brain cancer working at some of the best institutions around the country, seeing more patients than anyone else, and they don’t get it right. “It’s not easy to predict how long you’re going to be here for. Often there are clues for particular tumours – how they’re growing, where they are, how big they are, their proliferative activity, the tissues that they’re invading. They can [indicate] how long you’re likely to be here for, but it’s not 100 per cent.”\n\nAdvertisement",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/queensland/rain-to-ring-in-new-year-with-possible-thunderstorms-on-the-way-20251230-p5nqnr.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Rain to ring in new year with possible thunderstorms on the way",
        "publish_date": "Tue, 30 Dec 2025 11:26:31 +1100",
        "category": "finance",
        "authors": [
            "Dominique Tassell"
        ],
        "text": "The first day of the new year is set to be wet in Brisbane, as rainy weather returns to the state’s south-east.\n\nWhile New Year’s Eve was forecast to be mostly sunny, with a top of 32 degrees, the Bureau of Meteorology predicted the weather would turn on January 1.\n\nShowers are a chance for New Year’s Eve in Brisbane, but the following day is when the weather is more likely to turn. Credit: Brisbane City Council\n\n“Around the Brisbane area it’s probably more likely into the early hours of New Year’s Day rather than impacting New Year’s Eve, so fingers crossed on that one,” senior forecaster Daniel Hayes said.\n\n“Hopefully if we see anything, it is just a few light showers and probably later than any of the activities.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/technology/i-was-wrong-about-elon-but-he-was-wrong-too-20251229-p5nqgx.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "I was wrong about Elon. But he was wrong too",
        "publish_date": "Tue, 30 Dec 2025 11:22:23 +1100",
        "category": "finance",
        "authors": [
            "David Swan"
        ],
        "text": "“Board members reached out to several executive search firms to work on a formal process for finding Tesla’s next chief executive, according to people familiar with the discussions,” the newspaper reported. Tesla’s eight-person board, which is chaired by Australian businesswoman Robyn Denholm, denied the accuracy of that report and ultimately went the other way. They issued Musk the largest CEO pay deal ever - a stock-based compensation plan that could be worth close to $US1 trillion ($1.5 trillion) over roughly a decade - a move designed to keep Musk focused on Tesla rather than shifting his attention elsewhere. Tesla’s chairperson Robyn Denholm said Elon Musk was a “generational leader” and the right CEO during this “transformative period of time.” Credit: Bloomberg So, I maintain that I was on the money with my prediction that Elon’s controversies, distractions and workload were unsustainable. But he didn’t quit Tesla. What about my other predictions?\n\nVirtual reality having another year of unfulfilled promise, seems largely accurate. By Apple’s usual standards, sales of its $5999 Vision Pro VR headsets have clearly fallen short of expectations, with the company reportedly selling hundreds of thousands fewer than it had anticipated. Tick. I predicted crypto would soar and bitcoin would surpass $US200,000 - wrong there - and my prediction of an ‘AI winter’ beginning was also off, with AI stocks like Nvidia and others staying hot. Flying cars have also not taken off. They remain decidedly grounded. Some of my other stray predictions seem spot on. It’s early days, but Australia’s teen social media ban has indeed been largely successful so far, with other countries taking notice, and Trump’s tariffs have hit electronics prices. There was no major AI deepfake reported in Australia’s federal election, however. Here are seven predictions for 2026. I’ll probably get half of them wrong. But the fun is in the guessing. Australia gets its first major homegrown AI scandal\n\nLoading The ingredients are all there. Government agencies are rushing to deploy AI for “efficiency.” Corporations are automating decisions about loans, insurance, hiring, and welfare. And Australia’s track record on algorithmic accountability - Robodebt, anyone? - suggests the guardrails aren’t up to the task. The scandal could take several forms: a Services Australia AI that wrongly denies benefits to thousands of vulnerable people; a major employer’s hiring algorithm found to systematically discriminate; a health insurer using AI to deny claims based on race or income ... AI will inevitably stuff up somewhere, the only question is which sector gets caught first. Meta’s ‘smart glasses’ are a hit, haters be damned Remember how everyone mocked Google Glass? Meta’s smart glasses are proving that the tech industry’s first instinct - wear a computer on your face - wasn’t wrong, just premature.\n\nThe difference is in form factor and social acceptability. These actually look like normal sunglasses. You don’t look like a tech bro uberdork wearing them to the pub. And with AI features built in, they’re genuinely useful: real-time translation, object identification (ask them: ‘What am I looking at?’), hands-free messaging, and navigation that doesn’t require you to stare at your phone while walking into traffic. Meta Platforms is seeking to turn its burgeoning smart glasses into a must-have product. Credit: Bloomberg The 2026 iteration will likely add a subtle heads-up display, and that’s when things get interesting. Apple is reportedly working on its own version, which will legitimise the category further. This won’t be VR-style hype, it’ll be more of a slow burn. But by year’s end, smart glasses will be the wearable that actually sticks, succeeding where VR flopped. China wins Australia’s EV war\n\nBYD already outsells Tesla in Australia in some months, and that’s just the beginning. The Chinese manufacturer - along with MG, GWM, and newcomers like Zeekr and Xiaomi - are flooding the market with competent, affordable EVs that legacy carmakers simply can’t match on price. BYD electric vehicles parked in a private storage yard in Kilsyth in Melbourne’s east. Credit: Aaron Francis Australia seems uniquely vulnerable to some of these dynamics: we have no local car manufacturing left, and consumers are historically happy to buy whatever’s cheapest. Tesla’s brand remains politically toxic to some buyers thanks to Musk’s antics, and Ford and Toyota are still playing catch-up when it comes to EVs at scale. By the end of 2026, Chinese manufacturers will command between 30 and 40 per cent of Australia’s EV market, and nobody in Canberra will quite know what to do about it. Nvidia’s reign ends Nvidia has been the undisputed king of the AI boom. Its processors are the pickaxes in a gold rush that sent its market cap past $US3 trillion. But 2026 is when gravity reasserts itself. Giants like Google, Amazon, Microsoft and Meta are all developing custom AI chips to reduce their dependency on Nvidia, whose sky-high share price has long seemed almost impossible to justify.\n\nCritically, the AI infrastructure spending spree can’t continue at this rate forever. At some point, companies need to see returns. This doesn’t mean that Nvidia becomes irrelevant. It just means that its era of unquestioned dominance - and its title as the Most Important Company In The World - ends in 2026. Quantum computing is - maybe - set for a breakout year. Credit: PsiQuantum Quantum computing has its ChatGPT moment Quantum computing has been ‘five years away’ for every year I’ve been reporting on the industry. But Google’s Willow chip and IBM’s steady progress on error correction suggest we’re approaching a genuine inflection point. The breakthrough won’t be quantum computers replacing your laptop. It’ll be a clear demonstration of quantum advantage on a problem that actually matters: think simulating a molecule for drug discovery, or cracking an encryption protocol (which will terrify everyone). When it happens, every CEO will suddenly need a ‘quantum strategy’ and start-ups will raise billions on pitch decks that don’t make sense.\n\nMost of the hype will be largely premature, just as it was with AI in 2023, but the narrative will shift permanently. Quantum will go from ‘interesting science experiment’ to ‘inevitable technology disruption’ next year. A major Australian bank gets breached After Optus, Medibank, Latitude, and a parade of smaller breaches, the statistical reality is grim: Australia’s big four banks are operating on borrowed time. They’re attractive targets: massive repositories of sensitive financial data, legacy systems that are barely held together and complex supply chains with countless potential entry points. Australia’s banks have invested heavily in security, but so have every other company that’s been breached. It only takes one missed patch, one phished employee, or one compromised vendor for the worst to happen. And when it does happen, the fallout will be nuclear. Banking data is more sensitive than telco records. The political response will be severe, potentially including personal liability for executives and board members who failed to prioritise security, and regulators like APRA may come into the firing line.\n\nThe silver lining is that it might be the shock that forces an overhaul of Australia’s approach to cybersecurity, from mandatory breach disclosure timelines to more severe penalties for negligence. Canva IPOs - and stuns Wall Street The Melanie Perkins-led company times its listing perfectly, riding renewed appetite for profitable tech. Its AI design tools are a moat rather than a commodity, and enterprise adoption accelerates as marketing teams ditch expensive Adobe subscriptions. Canva co-founders Cliff Obrecht and Melanie Perkins, pictured with fellow co-founder Cameron Adams. Credit: Canva The blockbuster public listing on New York’s Nasdaq becomes Australia’s biggest tech success story in history, finally putting Sydney and Australia on the map as a serious global tech hub. Hundreds of new millionaires - many of whom are the company’s early employees - are minted in the process, unlocking a tidal wave of capital.",
        "source": "SMH"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/interview-feyza-tuncay-on-helping-children-learn-about-ethics/2nm7kbgh1",
        "title": "INTERVIEW: Feyza Tuncay on helping children learn about ethics",
        "publish_date": "Mon, 29 Dec 2025 20:28:00 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/video/birdwatching-a-new-generation-embracing-an-old-hobby/yuhrqzevh",
        "title": "Birdwatching: a new generation embracing an old hobby",
        "publish_date": "Mon, 29 Dec 2025 08:58:48 +0000",
        "category": "finance",
        "authors": [],
        "text": "Birdwatching: a new generation embracing an old hobby\n\nPublished 29 December 2025, 7:07 am\n\nAustralians are flocking to birdwatching once again. It’s known for its health benefits, including reduced stress and improved fitness, and has long been associated with retirees. But a new generation is making the hobby their own.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/video/western-sydneys-green-roof-revolution/dmue6mtd0",
        "title": "Western Sydney’s green roof revolution",
        "publish_date": "Mon, 29 Dec 2025 07:40:26 +0000",
        "category": "finance",
        "authors": [],
        "text": "Western Sydney’s green roof revolution\n\nPublished 29 December 2025, 7:07 am\n\nAustralia is a world leader in the use of rooftop solar with more than 4.2 million solar systems installed on homes and businesses nationwide. Some researchers say this renewable energy could be even greener, with the use of bio-solar technology which is being trialled in a new suburb, near the new airport in Western Sydney.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/search-resumes-for-mh370-more-than-a-decade-after-it-went-missing/wjjt5wnv5",
        "title": "Search resumes for MH370 more than a decade after it went missing",
        "publish_date": "Mon, 29 Dec 2025 07:05:55 +0000",
        "category": "finance",
        "authors": [],
        "text": "Listen to Australian and world news and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT:\n\n\n\n\n\n\"The search is important personally, because I think it could point to knowing a little more, if not the totality of the answer, at least a little more about what may have happened. For many other families, it has a very deep personal significance because it's about saying goodbye with an air of finality. It's about the dignity of separation and of parting and many other things that remain suspended in some ways.\"\n\n\n\n\n\nThat's KS Narendran.\n\n\n\n\n\nHis wife, Chandrika Sharma, was on her way to Mongolia's capital, Ulaanbaatar, for a conference, and transiting through Kuala Lumpur and Beijing.\n\n\n\n\n\nShe's one of the 239 people on board Malaysia Airlines Boeing 777 - Flight MH370 - when it went missing.\n\n\n\n\n\nThe aircraft departed from Kuala Lumpur on the 8th of March in 2014, bound for Beijing.\n\n\n\n\n\nThere were 227 passengers and 12 crew members on board, mostly Chinese nationals, but also 50 Malaysians and seven Australian citizens.\n\n\n\n\n\nAmong others were citizens of France, Indonesia, India, the United States, Ukraine and Canada.\n\n\n\n\n\n\"There's bewilderment, there is perplexity. I mean, one is still quite incredulous when one thinks about it. So I suppose it's quite natural as human beings to kind of agonise, to think about questions that remain unanswered. And you're not at peace until you have a reasonably acceptable, reasonably clear answer to the questions because it has had a life-changing impact.\"\n\n\n\n\n\nHe looks back to the day everything changed.\n\n\n\n\n\n\"It was a very long day, that's what I remember, a long day where I essentially had to manage the communication with my mother, Chandrika's mother, my daughter who was at that time in Delhi, and to be very certain.\"\n\n\n\n\n\nHe says by lunchtime, the news was out on television and he wanted to ensure they heard it from him first.\n\n\n\n\n\n\"So it was emotionally difficult - it was physically punishing as well, it messed up my mind. It must have messed up my capacity to respond to even day-to-day challenges for quite a while. And so I had to reconfigure life all over again, afresh, in terms of what it means to live without a partner of close to 25 years.\"\n\n\n\n\n\nHe says he had to re-think the future, rather differently from what he had envisaged with his wife.\n\n\n\n\n\nHe says it took about five to six years, and now the emotional charge of the loss has eased somewhat.\n\n\n\n\n\n\"The tears have dried, but it doesn't mean that anger doesn't well up once in a while, just the fact that something like this happened and we're still struggling to know what happened. So like many other families, we have tried to reconstruct our lives, reconfigure what's important and what's immediate. And it's a different world today. It's a different life today. I think it significantly impacted both what I thought was important in life, who were important in life.\"\n\n\n\n\n\nMilitary radar at the time showed the plane left its flight path to fly back over northern Malaysia, before going into the region of the Andaman Sea and then turning south.\n\n\n\n\n\nAfter that, all contact was lost and the plane has never been found, save for some debris that washed up along the coast of Africa and on islands in the southwestern Indian Ocean.\n\n\n\n\n\nFuad Sharuji is the former crisis director of MH370 at Malaysia Airlines.\n\n\n\n\n\nHe says he was woken up abruptly, nearly 12 years ago.\n\n\n\n\n\n\"When I got a call at about two o'clock in the morning of 8th of March, 2014, from my operations control centre to report that MH370 was missing from our radar. So I knew there was something wrong. So immediately I asked my duty manager to try and locate what are the other aircraft (nearby) and try to communicate with MH370.\"\n\n\n\n\n\nHe says there were four flights over South Indian Ocean at that time.\n\n\n\n\n\n\"Unfortunately, all four failed, couldn't establish any contact with Flight 370. So after that, we declared an emergency.\"\n\n\n\n\n\nMalaysia's Transport Ministry announced a fresh search of 15,000 square kilometres in the southern Indian Ocean will be carried out by UK- and US-based marine robotics company Ocean Infinity, on a 'no find, no fee' basis.\n\n\n\n\n\nOcean Infinity has confirmed with the Ministry the new seabed search operations will last 55 days, to be conducted intermittently.\n\n\n\n\n\nIf they find the wreckage of the aircraft they'll receive a fee of AU$106 million.\n\n\n\n\n\nA statement from Ocean Infinity says due to the sensitive nature of the search, formal communications will come through the Malaysian government.\n\n\n\n\n\nThe initial searches saw investigators from Malaysia, China and Australia scour 120,000 square kilometres of the ocean.\n\n\n\n\n\nMr Sharuji says the technology today is significantly more capable than it was in the 2014 and 2018 searches.\n\n\n\n\n\n\"But this time the technology has advanced over more than a decade that the technology has got a better understanding, the use of improved AUVs (autonomous underwater vehicles), better terrain mapping, and then we also have a better, more refined modelling based on satellite and drift data.\"\n\n\n\n\n\nOcean Infinity was involved in two other searches earlier this year, looking for the bulk of the missing plane.\n\n\n\n\n\nTheir last search in March-April looked for the plane in four so-called hotspots, 1,500 kilometres west of Perth.\n\n\n\n\n\nThat search was halted due to rough seas and poor weather conditions.\n\n\n\n\n\nMr Sharuji says the plane's black boxes will hold the answers, but he has reservations on what condition they're in, if retrieved.\n\n\n\n\n\n\"If the black boxes are found, then we have to send it for analysis. And whether the black boxes is readable or not is another question, but assuming, which we hope that it could still be read, that the data that's provided in the two black boxes, the CVR (cockpit voice recorder) and DFDR (Digital Flight Data Recorder) could give us some light on what actually happened towards the end of the flight.\"\n\n\n\n\n\nHe says it's important to know why the flight abandoned its filed path.\n\n\n\n\n\n\"Also why the flight diverted so many times, diverted over Igari, diverted over Penang, and then also diverted over Andaman. So there were three diversions and we want to know why.\"\n\n\n\n\n\nBetween October 2014 and January 2017, the Australian Transport Safety Bureau led the initial underwater search for the missing Boeing 777 aircraft, to support the Malaysian government.\n\n\n\n\n\nTheir active involvement in search efforts for the aircraft concluded with the publication of their 2017 report on the search.\n\n\n\n\n\nA statement from the ATSB spokesperson says they welcome the new search and remain supportive of renewed efforts to find the aircraft by providing technical assistance.\n\n\n\n\n\nAt Malaysia’s request, ATSB representatives have joined a working group to review seafloor imagery if the search operator identifies potential debris from MH370.\n\n\n\n\n\nBlaine Alan Gibson is an adventurer and has been on a quest to find the missing parts of the aircraft.\n\n\n\n\n\nHe has found debris of the plane that were brought to him by locals along Africa's east coast and islands in the southwestern Indian Ocean.\n\n\n\n\n\nMr Gibson says he was inspired to search for missing parts of the plane after attending MH370's one-year anniversary in Kuala Lumpur.\n\n\n\n\n\n\"I heard Grace (Nathan) speak about losing her mother on the plane. And I thought, well, how would it be if my mother had been on that plane or how would it be for my mother if I had been on that plane? And I realised that I could maybe make a difference because nobody was searching for debris on the beaches and shorelines.\"\n\n\n\n\n\nHe says the renewed search area is the right area - but points out it's a very large area.\n\n\n\n\n\n\"I have always believed with the UWA (University of Western Australia) drift analysis that the plane is at or near Broken Ridge between 32 and 33 degrees south. And I think if they search that whole area where they started around 36.5 degrees south and go all the way up to 33 and extend it up into the UWA area to 32 at Broken Ridge, I think they'll find it.\"\n\n\n\n\n\nA 495-page report into the missing flight by the Malaysian government's Flight 370 Safety Investigation team has suggested the plane's controls were probably deliberately manipulated to go off course.\n\n\n\n\n\nBut investigators could not determine who was responsible, and Mr Gibson says that depends on finding the wreckage.\n\n\n\n\n\n\"We do not know what happened, and the accusations against Captain Zahari (Ahmad Shah), to me, are very unfair. I mean, I remember hearing Jacquita (Gonzales) telling me before she passed, ‘Innocent until proven guilty.’ There is no evidence, there is no proof. We need to find the plane to know.\"\n\n\n\n\n\nHe says it's important to know what happened.\n\n\n\n\n\n\"That's in the family's interest, in the flying public's interest, and it's in Malaysia's interest because it's important for Malaysia to be able to put this behind them and move on. They need to find the plane and the truth.\"\n\n\n\n\n\nMr Sharuji echoes the sentiment, saying it's the government's responsibility to continue the search.\n\n\n\n\n\n\"This renewed search is not about reopening old wounds, it is about responsibility: responsibility to the passengers, to the families, and also to the integrity of aviation safety. And we hope that this time the search mission would bear some positive results.\"\n\n\n\n\n\nSBS News has contacted Malaysia's Transport Ministry for a comment, but is yet to receive a response.\n\n\n\n\n\nFor Mr Narendran the questions remain - why did an aircraft that was meant to be safe simply disappear, and what if the plane is never found?\n\n\n\n\n\nThe thought of that saddens and bothers him.\n\n\n\n\n\nHe says it doesn't feel right to stop looking.\n\n\n\n\n\nWhen asked about his hopes for answers, he says it is not about celebrating if it's found.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/silvers-us-80-record-investment-themes-for-2026/ds01g5odj",
        "title": "Silver's US$80 record & investment themes for 2026",
        "publish_date": "Mon, 29 Dec 2025 06:28:21 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/cinema-icon-brigitte-bardot-dies-91/2054ga2om",
        "title": "Cinema icon Brigitte Bardot dies, 91",
        "publish_date": "Mon, 29 Dec 2025 03:44:12 +0000",
        "category": "entertainment",
        "authors": [],
        "text": "Listen to Australian and world news and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT:\n\n\n\n\n\nBrigitte Bardot, the French 1960s actor who became one of the greatest screen sirens of the 20th century and later a militant animal rights activist, has died aged at her home in southern France.\n\n\n\n\n\nBardot was born September 28th, 1934, to a wealthy industrialist family.\n\n\n\n\n\nShe studied classical ballet and was 'discovered' by a family friend who put her on the cover of Elle magazine at age 14.\n\n\n\n\n\nBut it was French movie producer Vadim, whom she married in 1952, who made her an international celebrity as a sexualised teen bride in the 1956 movie “And God Created Woman.”\n\n\n\n\n\nAt the height of a cinema career that spanned some 28 films and three marriages, Bardot became one of France's best-known stars.\n\n\n\n\n\nParis Resident Clovis Pontevin says for many people, she was a household name.\n\n\n\n\n\n\"She was an icon. Even at the international level. Bardot, for me, a man of a certain age now, I have always known the era of Bardot. We have appreciated her films. Some of her first films caused a furore, not a scandal but.. No. No it is a shock for me to learn that she has died.\"\n\n\n\n\n\nFrench President Emmanuel Macron paid tribute to Bardot in a social media post.\n\n\n\n\n\n\"Her films, her voice, her dazzling fame, her initials, her sorrows, her generous passion for animals, her face that became Marianne—Brigitte Bardot embodied a life of freedom. A French existence, a universal radiance. She touched us. We mourn a legend of the century.\"\n\n\n\n\n\nSuch was her widespread appeal that in 1969 her features were chosen to be the model for “Marianne,” the national emblem of France and the official Gallic seal.\n\n\n\n\n\nBardot’s face appeared on statues, postage stamps and even on coins.\n\n\n\n\n\nBardot’s second career as an animal rights activist was equally sensational.\n\n\n\n\n\nShe travelled to the Arctic to blow the whistle on the slaughter of baby seals; she condemned the use of animals in laboratory experiments; and she opposed sending monkeys into space.\n\n\n\n\n\nIsabelle Goetz is the spokesperson for the French branch of the activist group People for the Ethical Treatment of Animals.\n\n\n\n\n\n\"What was the most important thing for her was to defend animals. She did so with her heart, her voice, her image and even with her heritage since Brigitte Bardot started her foundation by auctioning her personal things that she auctioned in order to generate funds to start her foundation to defend animals. So it really was her whole life, her spiritual life, her material life, which finally became animals.\"\n\n\n\n\n\nIn 1985, she was awarded the Legion of Honour, the nation’s highest honour, for her work with animals.\n\n\n\n\n\nLater, however, she fell from public grace as her animal protection diatribes took on an extremist tone and her far-right political views frequently decried the influx of immigrants into France, especially Muslims.\n\n\n\n\n\nShe also made a number of public homophobic slurs.\n\n\n\n\n\nAnd she was convicted five times in French courts of inciting racial hatred.\n\n\n\n\n\nBardot never adjusted to the limelight.\n\n\n\n\n\nShe blamed the constant press attention for the suicide attempt that followed 10 months after the birth of her only child, Nicolas.\n\n\n\n\n\nBardot soon gave up her son to his father, and later said she had been chronically depressed and unready for the duties of being a mother.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.theage.com.au/culture/live-reviews/thirty-years-on-rave-veterans-underworld-still-own-the-night-20251230-p5nqp0.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Thirty years on, rave veterans Underworld still own the night",
        "publish_date": "Tue, 30 Dec 2025 13:00:43 +1100",
        "category": "entertainment",
        "authors": [
            "Kate Prendergast"
        ],
        "text": "MUSIC\n\nUNDERWORLD\n\nCarriageworks, December 29\n\nReviewed by KATE PRENDERGAST\n\n★★★★½\n\n\n\nThe lore of Underworld goes deep. It’s been a rich, rambling journey over four decades – featuring existential curveballs and crowning glories in clubs, stadiums, soundtracks and their massive, stasis-defying catalogue. Now celebrating 30 years of Born Slippy (Nuxx), the rave firmament Rick Smith and Karl Hyde occupy is a legacy assured.\n\nSixty-something titans of anti-conformist dance music, sculpting mind-warping odysseys through their ever-expanding polygenre of techno and progressive, ambient and dub, city-scavenged poetry and art-rock, they’re the result of the generation of Kraftwerk and Joy Division crashing into the UK’s acid house revolution, to pioneer their own infectious groove that is dark and long, propulsive and psychogeographic, experimental and euphoric.\n\nRick Smith’s vast rig took half an hour to set up. Credit: Blake Houghton\n\nTheir live shows are legendary. This one, launching Finely Tuned’s summer warehouse series at Carriageworks, may have ended a smidge early, at the rave rat’s waking hour of 10.20pm (likely a set times gaffe). But over their 80 minutes on stage, in front of a sold-out Monday crowd of old, young and all-shining faces, these two best mates gave us everything.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/western-australia/west-coast-investigating-after-player-allegedly-involved-in-street-fight-20251230-p5nqom.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "West Coast investigating after player allegedly involved in street fight",
        "publish_date": "Tue, 30 Dec 2025 12:37:23 +1100",
        "category": "sports",
        "authors": [
            "Heather Mcneill"
        ],
        "text": "The West Coast Eagles are investigating a street fight in Geraldton at the weekend which allegedly involved one of their players, Tyler Brockman.\n\nAn altercation between three men, including a shirtless Brockman, was filmed on a mobile phone, with one of the men reportedly suffering a broken jaw in the fight.\n\nTyler Brockman. Credit: Russell Freeman/AFL Photos via Getty Images\n\nIn a statement, West Coast said it was aware of the incident, which occurred on Saturday night.\n\n“The club is providing support to Tyler while working to gather all relevant information about the incident and is unable to make any further comment at this time,” it said.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/afp-commissioner-offers-update-on-bondi-attack-investigation-20251230-p5nqp5.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "AFP Commissioner offers update on Bondi attack investigation",
        "publish_date": "Tue, 30 Dec 2025 12:13:07 +1100",
        "category": "finance",
        "authors": [],
        "text": "AFP Commissioner offers update on Bondi attack investigation\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/lifestyle/king-releases-new-years-honors-list-20251230-p5nqp1.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "King releases New Year's Honors List",
        "publish_date": "Tue, 30 Dec 2025 12:06:22 +1100",
        "category": "lifestyle",
        "authors": [],
        "text": "King releases New Year's Honors List\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/explaining-australia-s-enduring-love-affair-with-vintage-sportswear-20251215-p5nnuh.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Explaining Australia’s enduring love affair with vintage sportswear",
        "publish_date": "Tue, 30 Dec 2025 12:00:26 +1100",
        "category": "sports",
        "authors": [
            "Jonathan Drennan"
        ],
        "text": "Save Log in , register or subscribe to save articles for later. Save articles for later Add articles to your saved list and come back to them any time. Got it Normal text size Larger text size Very large text size Across Australia, closets and cupboards are being curated with collections of vintage sportswear. The choice of sport can vary dramatically, as can the monetary value of a haul, but a major motivation is found in nostalgia for a time that has passed. Sport provides good and bad memories, but a precious few are special. A formerly unloved piece of polyester or cotton can take its owner back to a season, a game, or even a moment they cherish. Or you can just look really cool and earn that knowing nod when you cross paths with a like-minded individual. In rugby, rugby league, Australian rules football, and cricket, we have explored what drives people to collect. Cricket Adam Collins has translated a lifelong love of cricket into a successful career as a commentator and writer, and is currently working on the Ashes series. His collection of cricket jerseys transports him immediately back to his childhood, when he first fell for the game. “Usually, people think of childhood as being a simpler time, and when going through and looking at these vintage jerseys or collections, it’s a way of connecting with that happier, easier time in their lives,” Collins said. “I know that for me, that’s how I identify with tops, especially from that early to mid-90s era. It’s before you’re aware of just how difficult the world can be, I suppose, and the game has got a pure innocence to it that is pure to it and lacking in any cynicism.”\n\nAdvertisement\n\nMerv Hughes appeals for a wicket during Benson & Hedges World Series match between Australia A and England in 1994 at the MCG in Melbourne, Australia. Credit: Ben Radford/Getty Images What is the greatest Australia limited-overs jersey remains a hot topic. The green side panels of the 1981-84 World Series Cup worn by the likes of Dennis Lillee and Greg Chappell set against the debut of the 1992 World Cup jersey, complete with blue, green and red-coloured shoulders. For Collins, his pick for the best Australian jersey is unusual; it’s an Australian A jersey from the 1994/1995 season. The one-day series between Australia A, England, Zimbabwe and Australia represented a happy memory of childhood and cheering the underdogs from the ‘A’ side, including Ricky Ponting, Justin Langer and Matthew Hayden. The hunt for the elusive jersey became a quest. “I was at an indie club in Melbourne about 10 years ago, and I saw a guy downstairs in the bar wearing an Australia A top,” Collins said. “By this stage, I’d had some failed missions trying to get one, a proper one from eBay. I ended up with some not-real ones; they were sort of close to it, but didn’t quite meet the criteria. Greg Blewett bowling for Australia A against Mark Taylor and Australia in 1995. Credit: Getty Images “I went up to the guy and said to him I’d pay him, thinking that he may not have an understanding of what he was wearing, maybe he got it from a secondhand shop or something, but he wasn’t interested in that.\n\nAdvertisement\n\n“Then I just outright said, I’ll give you 400 bucks, because I just arrived with that figure in my head. And he said that he wouldn’t sell it for anything. “And I immediately shook his hand and said, I respect that because I’d be the same if I had an Australia A top that was a real one from 94-95, I wouldn’t sell it to anyone for anything.” Allan Langer in the memorable Brisbane Broncos jersey of 1998. Credit: Getty Images Rugby league The owner of the Retro Rugba Leeg online store prefers to be known simply as ‘Retro’. Formerly a youth minister for over a decade, ‘Retro’ has switched to selling rugby league jerseys full-time due to skyrocketing demand. Retro grew up as a Roosters fan with a wider appreciation for jersey design across the game. Asked about the most requested jerseys, he does not hesitate. “The number one in terms of current teams would be the Broncos, and it would be like the teal and the aqua jerseys,” he says. “There was one in 1998, there was one in 2002, and then there was also the 1995 World Sevens jersey.\n\nAdvertisement\n\nJumpers of defunct clubs such as the Western Reds remain in hot demand Credit: Getty Images “They departed from their normal colours and had these teal or aqua ones. Everyone wants those. You can’t find them as most of them are player issue only. “You’d be looking upwards of two and a half grand to try and get your mitts on one, but they’re just not there, you just cannot find them. The other ones are more defunct clubs. So think like Gold Coast Chargers, South Queensland Crushers, [North Sydney] Bears, now the Bears are coming back in, Tweed Seagulls or Gold Coast Seagulls. “Anything that used to exist that doesn’t exist any more. Super League stuff, particularly Adelaide Rams or Hunter Mariners, that’s also pretty sought after.” The South Queensland Crushers jersey, worn here by Dale Shearer, didn’t grace the fields for very long. Credit: Getty Images While there is a huge global demand for rare vintage soccer jerseys, Retro believes rugby league is also holding up its end in the fashion stakes.\n\nAdvertisement\n\n“Obviously scarcity drives price. When it comes to things like Magic Round, that’s like the Milan Fashion Week of rugby league. Everyone plans – if they go on for four days, they’ll plan what they’re wearing every day. “And if their team’s not playing that day, they want to wear something really unique, something eye-catching. “There’s this whole phenomenon called ‘blokecore’ – it’s basically like where it’s on trend for even girls to dress as like 35-year-old men. “So that’s what’s behind girls buying soccer jerseys. They don’t really watch soccer, but they wear them as a fashion trend. You wear the big chunky sneakers, you know, the jean shorts, that whole look, it’s kind of come out of the culture in the UK. And it’s kind of started to work its way over here, particularly when rugby league has leaned into that.” Australian Rules Football Mitch from Footy Finds grew up a Sydney Swans supporter and parlayed his hobby of locating rare AFL merchandise into a successful business. A prized personal possession is a training jumper he believes was worn by Adam Goodes. He now fields enquiries from fans all over Australia desperate to source treasured nostalgia.\n\nAdvertisement",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/two-charged-after-semi-automatic-guns-drugs-allegedly-found-in-melbourne-home-20251230-p5nqoy.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Two charged after semi automatic guns, drugs allegedly found in Melbourne home",
        "publish_date": "Tue, 30 Dec 2025 11:53:33 +1100",
        "category": "finance",
        "authors": [],
        "text": "Two charged after semi automatic guns, drugs allegedly found in Melbourne home\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/boxing-champ-involved-in-fatal-car-crash-20251230-p5nqlr.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Boxing champ involved in fatal car crash",
        "publish_date": "Tue, 30 Dec 2025 11:52:05 +1100",
        "category": "finance",
        "authors": [],
        "text": "Boxing champ involved in fatal car crash\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/cricket/khawaja-green-healy-and-perry-what-does-2026-have-in-store-for-australian-cricket-20251222-p5npi2.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Khawaja, Green, Healy and Perry. What does 2026 have in store for Australian cricket?",
        "publish_date": "Tue, 30 Dec 2025 11:33:00 +1100",
        "category": "sports",
        "authors": [
            "Jon Pierik"
        ],
        "text": "There are key decisions to be made on and off the field if Australia are to remain an on-field force, while improving a bottom line which tumbled to a net deficit of $11.3 million over the past financial year is also a must.\n\nAdelaide must have been an emotional rollercoaster for the 39-year-old, who declared himself fit, then was overlooked for selection, only to make a dramatic late entrance at No.4 when Steve Smith was ruled out due to vertigo. Khawaja’s knocks of 82 and 40 showed he still has the game, and he has yet to publicly declare any intention to retire. However, the selectors will need to make the tough call after Sydney. It’s time for Travis Head and Jake Weatherald to be given time to mature together at the top of the order.\n\nLoading\n\nWhat happens when it’s time to sober up once the Ashes party subsides?\n\nFurther to the Khawaja question, the selectors have more decisions to make or, at least, seriously debate, although there is an eight-month break from the Sydney Test to the team’s next red-ball clash, a home series against Bangladesh in August. Nathan Lyon’s 38-year-old body is showing signs of not holding up with a serious calf injury during the 2023 Ashes, now followed by a major hamstring issue. Is it time to give a younger spinner more of an opportunity before the heavyweight 2027 tour of India? Where does Josh Hazlewood fit in after another home summer ruined by injury? And is it time to promote a new Test vice-captain, for skipper Pat Cummins has his own injury issues, and Steve Smith will be 37 in June? Travis Head seems the natural fit there.\n\nIs change also on the way for the women’s national team?",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/lifestyle/health-and-wellness/for-whatever-reason-i-still-keep-going-richard-scolyer-contemplates-the-future-20251208-p5nlvb.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘For whatever reason, I still keep going’: Richard Scolyer contemplates the future",
        "publish_date": "Tue, 30 Dec 2025 11:30:00 +1100",
        "category": "lifestyle",
        "authors": [
            "Garry Maddox"
        ],
        "text": "Save Log in , register or subscribe to save articles for later. Save articles for later Add articles to your saved list and come back to them any time. Got it Normal text size Larger text size Very large text size It’s drizzling as Professor Richard Scolyer arrives on his bike for lunch. We hug a greeting outside The Royal Hotel in Leichhardt, a short ride from his home in Sydney’s inner west, then the former Australian of the Year chains it to a pole. More than 2½ years after being diagnosed with a lethal brain tumour, Scolyer is still cycling, still running his local five-kilometre Parkrun just about every Saturday and still confounding expectations. Since taking on a world-first treatment that could have killed him at any time – a combination of three immunotherapy drugs and a personalised cancer vaccine – the internationally renowned pathologist and cancer researcher has shown amazing resilience, lasting well past the median survival for his savage glioblastoma of 14 months. The outlook was grim when an operation last March confirmed the tumour that had been largely excised during what’s called debulking surgery was aggressively growing back. But he has exceeded expectations again that he had just a few months to live. And even though Scolyer now believes he is slowly declining, he is delighted to have reached more milestones: his 59th birthday in December, another Christmas, and another summer holiday with his family – wife Katie and children Emily, 21, Matthew, 20, and Lucy, 17. “Now we’re 2½ years out and we can have a chat like this, I’m astounded and very, very happy,” he says at our table upstairs. “I keep getting told that – not in these words – ‘you don’t have much time left, and you’re gunna die within a month most likely’ and, for whatever reason, I still keep going. “I really hope that’s because of this treatment. That it can make a difference for other people, but it could be luck.”\n\nAdvertisement\n\nPrime Minister Anthony Albanese, who announced $5.9 million in funding to establish the Richard Scolyer Chair in Brain Cancer Research at Chris O’Brien Lifehouse in September, called him “inspiring to millions”. That reflects the courage Scolyer has shown in trying to reinvent brain cancer treatment with joint 2024 Australian of the Year Professor Georgina Long. The then co-medical directors of Melanoma Institute Australia – he has since stepped down – ignored the standard treatment of surgery, chemotherapy and radiotherapy to tackle his cancer and instead trialled what they had learnt successfully treating patients with advanced melanoma. “I’m not at the capacity that I was some time ago”: Richard Scolyer. Credit: Steven Siewert Scolyer has also been inspirational for his openness and positivity in chronicling the ups and downs of his treatment, including in the bestselling memoir that we wrote together, Brainstorm, and with regular posts on social media. He has been hard to pin down for a Lunch With interview, though. Months earlier he chose The Royal, a favourite place for family dinners, but had to cancel twice when he wasn’t well. After some difficult weeks, particularly during an experimental drug treatment, then the devastation of the tumour’s return, Scolyer is back to his usual upbeat self. But he admits to short-term memory problems that include struggles with words. “I forget people’s names, which is probably the worst thing that I do,” he says. “It’s not just people who aren’t real close to me. Sometimes I get one of the kids’ names wrong or people I know really well.” Scolyer says he was mortified when he recorded a video for a Tasmanian Aussie Rules team that he is the No.1 ticketholder for, the Bridgenorth Parrots, and realised when he watched it days later that he had not only got the town’s name wrong but had called his treatment centre “Chris O’Brien Landscaping” instead of “Lifehouse”. The players reportedly found the video inspirational anyway.\n\nAdvertisement\n\nLoading When he learnt from a scan that the tumour had crossed to the other hemisphere of his brain, it was a blow late in the year. “The two sides of your brain are only connected [in a few places], and for it to go to the other side, that ain’t good news,” he says. “I’m not at the capacity that I was some time ago, and the X-rays correlate with it getting worse, showing more disease.” How does he react to setbacks now? “It pisses me off, but I’m more accepting of changes,” Scolyer says. “The fact I’ve spent so much time with my kids, which I didn’t expect, that’s been good.” Despite what he says, he looks healthier than when we’d caught up for an impromptu pizza a few weeks earlier. While a couple of extra kilograms has made him less drawn in the face, recent radiotherapy has left him with a ring-barked hairstyle that, to his credit, he doesn’t cover up with a hat. Not wanting his medical team (or readers) to think he is letting himself go, Scolyer contemplates a burger then orders a fattoush salad with avocado. I go for a sweet potato salad with chicken and, to round out a healthy lunch, we’re both drinking mineral water. Fattoush salad with avocado at The Royal Hotel. Credit: Steven Siewert\n\nAdvertisement\n\nKeeping fit has continued to be important to Scolyer during treatment. Having now passed 270 Parkruns, the longtime triathlete’s next sporting goal is cycling the Tasmanian stages of the Tour de Cure cancer research fundraising ride with Matthew in March. (He grew up in Launceston and still visits his father, 90, and mother, 89, when he can.) “I’m happy to take risks now,” Scolyer says of the new challenge. “The writing’s on the wall. I’ve been here for much longer than was expected and want to do those things with my mates, getting out there and enjoying life. One thing that’s really come home for me is the importance of doing things that you like doing.” While still not entirely comfortable being a public figure, Scolyer tries to use his profile to push for more funding for research into brain tumours. “The biggest thing is to try and make a difference in this field of cancer,” he says. “It’s not funded well enough to push things along. It’s a difficult tumour to get into – it’s inside your brain, it’s got big bones, skull, around it. The brain itself doesn’t have spare cells that are not so vital there. The way some of the tumours grow is through subtle, peripheral, infiltrative growth. Sweet potato salad with chicken. Credit: Steven Siewert “Basically, you can’t see it on radiology, you can’t see it [during surgery]. The pathologist can see more, but you’re still struggling to find the end of it. So it’s a tough disease to do something about. We’ve got to find ways to do it better.” The food arrives and proves to be as tasty as it looks. What does he do now when he feels especially low? “Different things at different times,” Scolyer says. “Just lately, my threshold for being disappointed about small things is different. That’s partly the effect of the tumour, but it’s only with close family members. They’ve copped it more than others.\n\nAdvertisement\n\n“But I feel like I’ve come out of a hole. A lot of things are changing. My sleep isn’t what it used to be [during much of his treatment] – 10 or 12 hours. I’m back to seven hours.” One of Scolyer’s treatment centres is Chris O’Brien Landscaping – sorry, Lifehouse. When he was a junior doctor at Sydney’s Royal Prince Alfred Hospital, O’Brien mentored him, and they worked on research projects together. So it’s a cruel irony that Scolyer now has the same type of cancer that killed the famous head and neck surgeon around the same age, 57, in 2009. Has he ever wondered whether there is something about their work or the hospital environment that caused both their glioblastomas? The bill for lunch at The Royal Hotel in Leichhardt. Credit: “That’s a great question,” Scolyer says. “We don’t know is the bottom line. I’ve certainly wondered that. Is there some association? But it doesn’t add up. People in different fields get this sort of cancer.” How long does he think he can last? “Excuse me while I chew away,” he says. “But who knows? There are world experts in brain cancer working at some of the best institutions around the country, seeing more patients than anyone else, and they don’t get it right. “It’s not easy to predict how long you’re going to be here for. Often there are clues for particular tumours – how they’re growing, where they are, how big they are, their proliferative activity, the tissues that they’re invading. They can [indicate] how long you’re likely to be here for, but it’s not 100 per cent.”\n\nAdvertisement",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/queensland/rain-to-ring-in-new-year-with-possible-thunderstorms-on-the-way-20251230-p5nqnr.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Rain to ring in new year with possible thunderstorms on the way",
        "publish_date": "Tue, 30 Dec 2025 11:26:31 +1100",
        "category": "finance",
        "authors": [
            "Dominique Tassell"
        ],
        "text": "The first day of the new year is set to be wet in Brisbane, as rainy weather returns to the state’s south-east.\n\nWhile New Year’s Eve was forecast to be mostly sunny, with a top of 32 degrees, the Bureau of Meteorology predicted the weather would turn on January 1.\n\nShowers are a chance for New Year’s Eve in Brisbane, but the following day is when the weather is more likely to turn. Credit: Brisbane City Council\n\n“Around the Brisbane area it’s probably more likely into the early hours of New Year’s Day rather than impacting New Year’s Eve, so fingers crossed on that one,” senior forecaster Daniel Hayes said.\n\n“Hopefully if we see anything, it is just a few light showers and probably later than any of the activities.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/technology/i-was-wrong-about-elon-but-he-was-wrong-too-20251229-p5nqgx.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "I was wrong about Elon. But he was wrong too",
        "publish_date": "Tue, 30 Dec 2025 11:22:23 +1100",
        "category": "finance",
        "authors": [
            "David Swan"
        ],
        "text": "“Board members reached out to several executive search firms to work on a formal process for finding Tesla’s next chief executive, according to people familiar with the discussions,” the newspaper reported. Tesla’s eight-person board, which is chaired by Australian businesswoman Robyn Denholm, denied the accuracy of that report and ultimately went the other way. They issued Musk the largest CEO pay deal ever - a stock-based compensation plan that could be worth close to $US1 trillion ($1.5 trillion) over roughly a decade - a move designed to keep Musk focused on Tesla rather than shifting his attention elsewhere. Tesla’s chairperson Robyn Denholm said Elon Musk was a “generational leader” and the right CEO during this “transformative period of time.” Credit: Bloomberg So, I maintain that I was on the money with my prediction that Elon’s controversies, distractions and workload were unsustainable. But he didn’t quit Tesla. What about my other predictions?\n\nVirtual reality having another year of unfulfilled promise, seems largely accurate. By Apple’s usual standards, sales of its $5999 Vision Pro VR headsets have clearly fallen short of expectations, with the company reportedly selling hundreds of thousands fewer than it had anticipated. Tick. I predicted crypto would soar and bitcoin would surpass $US200,000 - wrong there - and my prediction of an ‘AI winter’ beginning was also off, with AI stocks like Nvidia and others staying hot. Flying cars have also not taken off. They remain decidedly grounded. Some of my other stray predictions seem spot on. It’s early days, but Australia’s teen social media ban has indeed been largely successful so far, with other countries taking notice, and Trump’s tariffs have hit electronics prices. There was no major AI deepfake reported in Australia’s federal election, however. Here are seven predictions for 2026. I’ll probably get half of them wrong. But the fun is in the guessing. Australia gets its first major homegrown AI scandal\n\nLoading The ingredients are all there. Government agencies are rushing to deploy AI for “efficiency.” Corporations are automating decisions about loans, insurance, hiring, and welfare. And Australia’s track record on algorithmic accountability - Robodebt, anyone? - suggests the guardrails aren’t up to the task. The scandal could take several forms: a Services Australia AI that wrongly denies benefits to thousands of vulnerable people; a major employer’s hiring algorithm found to systematically discriminate; a health insurer using AI to deny claims based on race or income ... AI will inevitably stuff up somewhere, the only question is which sector gets caught first. Meta’s ‘smart glasses’ are a hit, haters be damned Remember how everyone mocked Google Glass? Meta’s smart glasses are proving that the tech industry’s first instinct - wear a computer on your face - wasn’t wrong, just premature.\n\nThe difference is in form factor and social acceptability. These actually look like normal sunglasses. You don’t look like a tech bro uberdork wearing them to the pub. And with AI features built in, they’re genuinely useful: real-time translation, object identification (ask them: ‘What am I looking at?’), hands-free messaging, and navigation that doesn’t require you to stare at your phone while walking into traffic. Meta Platforms is seeking to turn its burgeoning smart glasses into a must-have product. Credit: Bloomberg The 2026 iteration will likely add a subtle heads-up display, and that’s when things get interesting. Apple is reportedly working on its own version, which will legitimise the category further. This won’t be VR-style hype, it’ll be more of a slow burn. But by year’s end, smart glasses will be the wearable that actually sticks, succeeding where VR flopped. China wins Australia’s EV war\n\nBYD already outsells Tesla in Australia in some months, and that’s just the beginning. The Chinese manufacturer - along with MG, GWM, and newcomers like Zeekr and Xiaomi - are flooding the market with competent, affordable EVs that legacy carmakers simply can’t match on price. BYD electric vehicles parked in a private storage yard in Kilsyth in Melbourne’s east. Credit: Aaron Francis Australia seems uniquely vulnerable to some of these dynamics: we have no local car manufacturing left, and consumers are historically happy to buy whatever’s cheapest. Tesla’s brand remains politically toxic to some buyers thanks to Musk’s antics, and Ford and Toyota are still playing catch-up when it comes to EVs at scale. By the end of 2026, Chinese manufacturers will command between 30 and 40 per cent of Australia’s EV market, and nobody in Canberra will quite know what to do about it. Nvidia’s reign ends Nvidia has been the undisputed king of the AI boom. Its processors are the pickaxes in a gold rush that sent its market cap past $US3 trillion. But 2026 is when gravity reasserts itself. Giants like Google, Amazon, Microsoft and Meta are all developing custom AI chips to reduce their dependency on Nvidia, whose sky-high share price has long seemed almost impossible to justify.\n\nCritically, the AI infrastructure spending spree can’t continue at this rate forever. At some point, companies need to see returns. This doesn’t mean that Nvidia becomes irrelevant. It just means that its era of unquestioned dominance - and its title as the Most Important Company In The World - ends in 2026. Quantum computing is - maybe - set for a breakout year. Credit: PsiQuantum Quantum computing has its ChatGPT moment Quantum computing has been ‘five years away’ for every year I’ve been reporting on the industry. But Google’s Willow chip and IBM’s steady progress on error correction suggest we’re approaching a genuine inflection point. The breakthrough won’t be quantum computers replacing your laptop. It’ll be a clear demonstration of quantum advantage on a problem that actually matters: think simulating a molecule for drug discovery, or cracking an encryption protocol (which will terrify everyone). When it happens, every CEO will suddenly need a ‘quantum strategy’ and start-ups will raise billions on pitch decks that don’t make sense.\n\nMost of the hype will be largely premature, just as it was with AI in 2023, but the narrative will shift permanently. Quantum will go from ‘interesting science experiment’ to ‘inevitable technology disruption’ next year. A major Australian bank gets breached After Optus, Medibank, Latitude, and a parade of smaller breaches, the statistical reality is grim: Australia’s big four banks are operating on borrowed time. They’re attractive targets: massive repositories of sensitive financial data, legacy systems that are barely held together and complex supply chains with countless potential entry points. Australia’s banks have invested heavily in security, but so have every other company that’s been breached. It only takes one missed patch, one phished employee, or one compromised vendor for the worst to happen. And when it does happen, the fallout will be nuclear. Banking data is more sensitive than telco records. The political response will be severe, potentially including personal liability for executives and board members who failed to prioritise security, and regulators like APRA may come into the firing line.\n\nThe silver lining is that it might be the shock that forces an overhaul of Australia’s approach to cybersecurity, from mandatory breach disclosure timelines to more severe penalties for negligence. Canva IPOs - and stuns Wall Street The Melanie Perkins-led company times its listing perfectly, riding renewed appetite for profitable tech. Its AI design tools are a moat rather than a commodity, and enterprise adoption accelerates as marketing teams ditch expensive Adobe subscriptions. Canva co-founders Cliff Obrecht and Melanie Perkins, pictured with fellow co-founder Cameron Adams. Credit: Canva The blockbuster public listing on New York’s Nasdaq becomes Australia’s biggest tech success story in history, finally putting Sydney and Australia on the map as a serious global tech hub. Hundreds of new millionaires - many of whom are the company’s early employees - are minted in the process, unlocking a tidal wave of capital.",
        "source": "TheAge"
    }
]