[
    {
        "url": "https://www.9news.com.au/national/australia-housing-data-stats/a7c34aab-4a1e-4385-8a39-ab2aaf5b3caa",
        "title": "Majority of Aussies living in homes that are 'too big'",
        "publish_date": "Thu, 21 Aug 2025 01:37:53 +0000",
        "category": "finance",
        "authors": [
            "Aug"
        ],
        "text": "A majority of Australians are living in houses too big for them, new data reveals.\n\nUp to 60 per cent of Aussies either live on their own or with just one other person, but the bulk of houses in Australia have three bedrooms or more, a study from Cotality shows.\n\nThe reasons for Aussies wanting larger homes include the desire to have a home office as work from home rises, as well as having a spare bedroom for visitors.\n\nDespite most housing having three bedrooms or more, it is clear most households have no more than two people in them. (Supplied/Cotality)\n\nHouses have also become larger over time; as the urban sprawl pushes new developments further away from urban centres, homeowners prioritise features such as home gyms and home theatres.\n\nHowever, it could cause inefficiencies in how housing is allocated across the country, exacerbating the housing crisis that has gripped Australia.\n\n\"When most Australians picture the 'Great Australian Dream', they see a family with kids in a three or four-bedroom house. But data shows that dream does not match reality,\" Eliza Owen from Cotality said.\n\n\"Couples without children and people living alone make up the majority of households, raising questions about how well our housing market is serving real demand.\"\n\nREAD MORE: NATO warplanes scrambled amid Russian drone attacks on Ukraine\n\n(A Current Affair)\n\nOne-bedroom and studio homes make up just six per cent of Australia's current housing stock.\n\nDespite this, there is some change beginning to be seen; the share of units and dwellings other than houses has risen to 40 per cent, which would provide a more appropriate housing option for smaller households, according to Owen.\n\nShe said governments need to take more action to help stimulate change, however.\n\n\"Governments could make it more expensive to have more housing than you need, and cheaper to live in smaller housing,\" she said.\n\n\"Many advocate for tax reform like abolishing stamp duty - which makes it cheaper to move housing - and replacing it with a broad-based land tax, which raises costs the more land you own.\"",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/world/part-of-delta-air-lines-737s-wing-breaks-off-during-flight/3a0d1b5a-3816-4929-bb8b-b7abaf2cbbb7",
        "title": "Part of US plane's wing breaks off during flight",
        "publish_date": "Wed, 20 Aug 2025 22:53:08 +0000",
        "category": "finance",
        "authors": [
            "Aug"
        ],
        "text": "The Federal Aviation Administration in the US is investigating after a flap on a Boeing 737's wing partially broke off before landing in Texas on Tuesday.\n\nDelta Air Lines Flight 1893 was flying from Orlando International to Austin-Bergstrom International Airport when passengers noticed something had partially broken away from the back of the wing.\n\n\"We felt it was bad turbulence. The plane was shaking,\" passenger Shanila Arif told CNN.\n\nA still from a video taken aboard a Delta flight, on August 19, shows a flap dangling behind a wing of the plane. (Shanila Arif via CNN Newsource)\n\n\"The lady in front of us opened the window and told us it is broken. I opened the window and got scared.\"\n\nVideo recorded by Arif showed the flap dangling behind the wing, as the plane flew at hundreds of miles an hour thousands of feet in the air.\n\nShe worried if the piece completely broke off it could hit the tail of the aircraft and cause a crash.\n\nAfter landing \"it was observed that a portion of the left wing's flap was not in place,\" Delta Air Lines said in a statement. \"The aircraft has been taken out of service for maintenance.\"\n\nFlaps are surfaces on the back of the wing designed to be extended for takeoff and landing.\n\n\"We apologise to our customers for their experience as nothing is more important than the safety of our people and customers,\" the airline said.\n\nThere were 62 passengers and six crew members onboard the plane. No one was injured.",
        "source": "9News"
    },
    {
        "url": "https://www.abc.net.au/news/2025-08-21/us-open-tennis-mixed-doubles-semifinals-and-final/105679772",
        "title": "Ruud, Świątek first pair into mixed doubles final, qualifiers washed out",
        "publish_date": "Thu, 21 Aug 2025 01:11:35 +0000",
        "category": "sports",
        "authors": [],
        "text": "Third seeds Casper Ruud and Iga Świątek have come from behind in the 10-point tiebreaker to be the first team through to the US Open mixed doubles final at Flushing Meadows.\n\nThe Norwegian-Polish duo were down 4-8 in the first to 10 tiebreaker, before reeling off the final six points of the match to defeat top seeds Jack Draper and Jessica Pegula 3-5, 5-3 [10-8].\n\nThe second semifinal pits defending champions Sara Errani and Andrea Vavassori against American duo Danielle Collins and Christian Harrison.\n\nThat semifinal will be played next at Flushing Meadows' famed Arthur Ashe Stadium.\n\nThe final will be played on Thursday afternoon, AEST.\n\nSingles qualifying washed out as rain persists in New York\n\nPersistent rain in New York on Wednesday, local time, washed out the day's qualification matches for the men's and women's singles draw.\n\nAcross 14 matches, six men's and eight women's, none were able to be completed as just 45 minutes of playing time was possible before the downpour.\n\nAustralian teen Emerson Jones leads 5-4 in the first set against Brazilian Laura Pigossi.\n\nFellow Australian Astra Sharma claimed the first set against Victoria Jiménez Kasintseva from Andorra. When play resumes, Sharma will lead 6-2, 2-1.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-08-21/cba-backtracks-on-ai-job-cuts-as-chatbot-lifts-call-volumes/105679492",
        "title": "Commonwealth Bank backtracks on AI job cuts, apologises for 'error'",
        "publish_date": "Thu, 21 Aug 2025 00:37:14 +0000",
        "category": "finance",
        "authors": [],
        "text": "The Commonwealth Bank has backtracked on dozens of job cuts, describing its decision to axe 45 roles due to artificial intelligence as an \"error\".\n\nCBA said it had apologised to the affected employees after finding the customer service roles were not redundant despite introducing an AI-powered \"voice-bot\".\n\nThe Finance Sector Union has described the reversal as a \"major win\", after it raised a dispute at the Fair Work Commission.\n\nIt said its members found work actually spiked after the bot was introduced, despite the bank's claims it would reduce calls.\n\n\"Our investment in technology, including AI, is making it easier and faster for customers to get help, especially in our call centres,\" CBA had said when confirming the job cuts in July.\n\nThe FSU said the experience of workers after the bot was introduced was \"a very different story\".\n\n\"Call volumes were rising, with management scrambling to offer overtime and even pulling team leaders onto the phones,\" its statement read.\n\nCBA admitted it \"did not adequately consider all relevant business considerations\" when announcing the redundancies and acknowledged \"we should have been more thorough in our assessment of the roles required\".\n\nWorkers reported an increase in call volumes after the AI \"voice-bot\" was introduced. (ABC News: Giulio Saggin)\n\nAffected staff have now been provided the choice to continue in their current roles, pursue redeployment within the bank or proceed with leaving CBA.\n\n\"We are also reviewing our internal processes to improve our approach going forward,\" a bank spokesperson said.\n\nHowever, the FSU said the \"damage is already done\".\n\n\"CBA has been caught out trying to dress up job cuts as innovation,\" FSU national secretary Julia Angrisano said.\n\n\" Using AI as a cover for slashing secure jobs is a cynical cost-cutting exercise, and workers know it. \"\n\nAI 'very, very disruptive' to jobs Photo shows Tech start-up founder Julian Fayed with new staff member Tien Hung Nguyen. While overall employment is holding up, there are increasing signs that artificial intelligence is eating away at opportunities in some parts of the job market.\n\nThe union said it was continuing to collect accounts from members at CBA about the impact of offshoring, automation and AI on workloads and job security, ahead of a Fair Work hearing next week.\n\nCBA chief executive Matt Comyn recently told ABC News it was difficult to predict the impact of AI on jobs in the long term.\n\n\"I think the full potential of AI, to the extent that we even understand how that can be done, is one that is many years away.\n\n\"It's true of any technology that some tasks may be automated.\n\n\"Ultimately, what we've been able to say before is that people have migrated to higher-value work.\"\n\nThe CEO highlighted around 2,000 extra staff hired in recent months, but acknowledged that many of those roles had been added in India, as the bank expanded its technology team there.\n\nCBA reported a record $10.25 billion cash profit for the 2025 financial year.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-08-21/man-denied-entry-to-wollongong-hotel-for-maori-facial-tattoo/105646590",
        "title": "Man frustrated after being denied entry to hotel for Māori facial tattoo",
        "publish_date": "Thu, 21 Aug 2025 00:32:08 +0000",
        "category": "sports",
        "authors": [],
        "text": "When Brian Gardiner chose to have his face tattooed with Māori symbols, or facial tā moko, he was recovering from a deep depression and reconnecting to his New Zealand ancestry.\n\nHe never thought it would result in him being refused entry to a hotel.\n\nThe former professional rugby league winger was separated from his friends and went home early on a night out in Wollongong this month.\n\n\"I saw some mates that play soccer with my son and they said, 'Why don't you come out on the town?' So as we're walking up Crown Street, they said they were going to go into this hotel,\" he told ABC Illawarra Drive.\n\n\"I walked up to the mall and when I came back [to the venue] and walked up to the security guard, he said, 'Sorry mate, you can't come in'. I thought it must be full.\n\n\" I called out to my friends that I'd have to wait for someone to come out but then the security guard then said, 'He can't come in because he has a facial tattoo.' \"\n\nAfter unsuccessfully trying to negotiate with the security guard and then a venue manager, Mr Gardiner chose to go home for the night.\n\nMr Gardiner returned to the hotel and was served a beer on a Monday morning. (ABC News: James Carmody)\n\nPolicy not enforced in daylight hours\n\nCurious about whether the facial tattoo policy would be enforced during the day, Mr Gardiner returned to the venue at 10:30am on a Monday.\n\nNot only was he able to enter the venue, but he was also served a beer by bar staff.\n\n\"I said to her, 'That's strange, I came here Saturday night and I was refused entry to this hotel and now you're serving me a beer,'\" he said.\n\n\"I asked to leave a note for a duty manager so I wrote down my name and number and I've never heard anything back.\"\n\nBrian Gardiner spent hours designing his facial tattoo to reflect his cultural background. (ABC Illawarra: Justin Huntsdale)\n\nSignificance of facial tā moko\n\nTā moko is a centuries-old tattooing tradition that is a sacred and personal cultural practice for Māori people.\n\nThe patterns usually represent the bearer's ancestry, and Mr Gardiner said he spent hours with a tattoo artist discussing the elements he wanted to be represented on his face.\n\nHis facial tā moko includes animals significant to his ancestry like the hawk and shark, as well as symbolism for his ancestors who served in the military.\n\n\"What's on my face carries my prestige, love of the people, love of the land and my family and ancestors,\" he said.\n\n\"It's a protection for power, strength and endurance and I'm the only one in our whānau (family) that has the tā moko, so all my cousins contact me when they want to know something [about family history].\n\n\"You can see it's not a tattoo that's just slapped on.\"\n\nMr Gardiner said he lost his partner eight months ago and his experience at the Wollongong hotel had been an emotional setback.\n\n\"My son says, 'Dad, you gotta get out, you can't sit at home,'\" he said.\n\n\"I've been good and then it comes crashing down on Saturday night.\"\n\nBrisbane nightclub apologises for similar incident\n\nThree years ago, Papuan Australian Moale Jones was declined entry to a Brisbane nightclub because of her traditional facial tattoos.\n\nMs James posted about the incident on social media, calling out the club, Hey Chica!.\n\nMoale James says there is a lot of pride in wearing Papuan reva reva markings. (Supplied)\n\nThe club apologised in a private message to Ms James but said it would continue to enforce a blanket ban on face and neck tattoos.\n\nAs a result of this and other similar cases, Queensland's anti-discrimination laws are under review and some individual clubs have changed their policies.\n\nThe Wollongong venue in question states in its dress code that uncovered neck, facial and head tattoos will not be accepted.\n\nAnti-Discrimination NSW referred the ABC to the Australian Human Rights Commission when asked about the legality of banning patrons from entering NSW clubs due to traditional facial tattoos.\n\nA spokesperson for the federal body said it was up to the courts to interpret racial discrimination laws.\n\nThe ABC contacted Clubs NSW to ask about its polices on facial tattoos but it failed to respond, and there was no freely available information about the policies on its website.\n\nThe ABC contacted the Wollongong hotel that refused Mr Gardiner entry for a response.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-08-21/muster-dogs-star-frank-finger-rebuilds-after-family-heartbreak/105659784",
        "title": "Adored Muster Dogs trainer rebuilds after family heartbreak",
        "publish_date": "Wed, 20 Aug 2025 23:58:58 +0000",
        "category": "finance",
        "authors": [],
        "text": "Sitting down for a morning cuppa next to the resting place of his \"lovely dog\", Frank Finger is slowly adjusting to a new way of life on his central Queensland cattle property.\n\nNearly two months since the death of his beloved wife, Cathy, and champion kelpie, Annie, the adored Muster Dogs TV personality is remembering the pair with the support of an entire nation.\n\n\"It's meant just so much, but it is a little bit overwhelming,\" he said.\n\n\"I'm a bit like the rhinestone cowboy getting cards and letters from people I don't know.\"\n\nHe said he received a letter from an 88-year-old lady in central Western Australia.\n\n\"She said she wrote it at four o'clock in the morning and she just had to get up and write a letter,\" he said.\n\n\"I'm trying to answer them all and if I live long enough, I might get through them.\"\n\nCathy Finger was a beloved wife to Frank and member of the Clermont community. (ABC Capricornia: Aaron Kelly)\n\nA true community stalwart of the small town of Clermont, four hours north-west of Rockhampton, Catherine Finger died on June 25.\n\nJust two days later, Annie died suddenly at the age of five from a brain aneurysm.\n\n\"It has been [a blur] and my biggest regret is not keeping a diary of all the people who came to visit and brought food and brought things [including] the rose tree here,\" Mr Finger said.\n\n\"The generosity has just been unbelievable.\"\n\nA rose tree grows where Annie was laid to rest. (ABC Capricornia: Aaron Kelly)\n\nThat rose tree has been placed where Annie was laid to rest, near the back patio overlooking the sprawling hills of grazing land at the family's Hillview cattle operation.\n\nMr Finger said Cathy, his wife of 47 years, was farewelled by hundreds in town before she was laid to rest at the Clermont Cemetery.\n\nHe said roses were Cathy's favourite flower.\n\n\"Annie and Catherine had, if there can be such a thing, a very good send off,\" he said.\n\n\"It was just an array of flowers and roses.\"\n\nFrank with muster dogs Lucky, Lucifer and Annie on the family property. (Supplied: Stock Chick Photography)\n\n'Brilliance … and unwavering support'\n\nMr Finger, a third-generation cattle farmer, was given Annie as a puppy for season one of Muster Dogs.\n\nAfter winning the television show, Annie became Mr Finger's prized dog on his Clermont property, working on mobs of cattle daily and demonstrating at working dog schools hosted by the family on weekends.\n\n\"I've just got to be thankful for the five years I've had, but I've only ever had two dogs with brilliance like she had and out of all the dogs I've had in 30 years,\" he said.\n\n\"I just had a good connection with her right from the very beginning and everywhere I went, she came with me.\"\n\nFrank and his family regularly host dog training schools. (ABC Capricornia: Aaron Kelly)\n\nThe first working dog school since the family's heartbreak was held in Clermont at the weekend.\n\nIt was a tribute to Annie's brilliance and Mrs Finger's unwavering support of her family and the industry.\n\n\"Both were very genuine and both supported me in whatever I wanted to do,\" Mr Finger said.\n\n\"Cathy's probably most noted for a love for the grandchildren and our own children, of course, but the grandchildren they're the ones that are missing her very much.\"\n\nCathy Finger was adored by family and friends. (ABC Capricornia: Aaron Kelly)\n\nMr Finger recalled a trip to Tasmania where he, Cathy and Annie were invited to make a guest appearance at an agricultural show just outside of Hobart.\n\n\"The organisers said they had about 5,000 people come, and I said to Cathy, 'Well, that's a lot, we'll have to do a good demo' and we drew 11,500 people on the day,\" he said.\n\n\" That's when I realised the effect Muster Dogs had on people. \"\n\nFrank's other Muster Dogs favourite, Lucifer, is missing Annie. (ABC Capricornia: Aaron Kelly)\n\nAn unsung hero\n\nClermont residents have rallied behind the Finger family, with the outpouring of support evident throughout the close-knit community of about 3,000 people.\n\nGrazier and lifelong friend, Shane Benney, said Cathy was not one for the spotlight but she was always there for her rural community.\n\nFrank shares a special bond with all of his dogs. (ABC Capricornia: Aaron Kelly)\n\n\"She was a great supporter of the community always and a great supporter of Frank, very big supporter,\" he said.\n\n\"It's still hard to believe.\"\n\nFrank and his border collie Lucky, who also starred on Muster Dogs. (ABC Capricornia: Aaron Kelly)\n\nLong-time resident Prue Lonergan said the Finger family was well-respected not only in Clermont but in all walks of farming life.\n\n\"The community is heartbroken for Frank at the moment in terms of how we support him moving on,\" she said.\n\n\"The Muster Dogs program only showed the world I suppose what their family is about.\n\n\"They're going to be missing Cath's dampers and everything she did behind the scenes was quite significant.\"\n\nFrank's new kelpie pup, Jonty, is being trained to join Lucifer and Lucky on the mustering team. (ABC Capricornia: Aaron Kelly)\n\nBack on the farm, Mr Finger's new kelpie pup, Jonty, is learning the ropes to join his other Muster Dog favourites, Lucifer and Lucky, mustering cattle.\n\nIronically, the three-month-old brown pup has similar markings to Annie and hopefully one day her brilliance.\n\n\"A good dog is where they can smell cattle, find cattle, bring them out of the bush and just what to do without being told,\" Mr Finger said.\n\nFrank is known for his commitment to the agricultural industry. (ABC Capricornia: Aaron Kelly)\n\nTogether, Mr Finger and Jonty represent the heart and future of Australia's working dog community.\n\n\"We'll still have our working dog and stock handling schools, probably not as many, but I think it'll do us good to get back into it again.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-08-21/local-supermarket-returns-to-perenjori-wa/105670810",
        "title": "Council spend rewarded as town gets first supermarket in seven years",
        "publish_date": "Wed, 20 Aug 2025 23:30:47 +0000",
        "category": "finance",
        "authors": [],
        "text": "Residents of a small farming town in Western Australia's Wheatbelt are getting used to being able to shop locally for the first time in seven years.\n\nResidents in Perenjori, about 340 kilometres north-east of Perth, have long faced a 100km round trip to do their regular shopping.\n\nThe town's previous supermarket closed in 2018 and the remaining building was reduced to rubble during ex Tropical Cyclone Seroja.\n\nBut residents hope a new grocery store, opened officially on August 8, will help breathe new life into the town.\n\nLocals and residents from out of town gathered in Perenjori for the shop's grand opening. (ABC Midwest & Wheatbelt: Piper Duffy)\n\nLocals expect the opening of the town's new supermarket, backed by the Shire of Perenjori, will be a big time and cost saver.\n\nPerenjori Shire took out a $1.5 million loan and cashed in $500,000 of disaster recovery funding to get the project off the ground.\n\nShoppers came to Perenjori well-prepared with a groceries list. (ABC Midwest & Wheatbelt: Piper Duffy)\n\nPrior to the opening, Perenjori residents had to travel to Morawa, further to Geraldton or even as far as Perth for shopping, depending on the items needed.\n\nNew way of life\n\nChloe Heard travels 40km each day from nearby Latham to work in Perenjori.\n\nChloe Heard says her family is grateful to be able to minimise travel for groceries. (ABC Midwest & Wheatbelt: Piper Duffy)\n\nShe said no longer having to plan weeks in advance on where and when to buy groceries would take some getting used to.\n\n\"I reckon I'm going to forget a couple of times before [I realise] I can just duck down to the shops after work,\" she said.\n\n\"It's going to be a lot easier for families … if you need to stock up on school supplies or anything now we've got a supermarket just down the road.\n\n\"So you don't have to wait to go to Perth of Geraldton to do that kind of thing, it makes [Perenjori] more family friendly.\"\n\nPerenjori shoppers make the most of their new supermarket. (ABC Midwest & Wheatbelt: Piper Duffy)\n\nHenry Chabros lives in Perth with his girlfriend Gemma Cusworth, who grew up in Perenjori.\n\nThey made the trip up to celebrate the supermarket opening.\n\n\"Coming from Perth, we definitely take [having supermarkets] for granted and there's probably a whole bunch of people that live in Perth who never really venture out to country towns,\" he said.\n\n\"So for me it's a pretty big eye-opener just to see how people here live and no-one makes a fuss … morale seems pretty good.\"\n\nHarry Chabros and Gemma Cusworth say the supermarket would be a huge win for families. (ABC Midwest & Wheatbelt: Piper Duffy)\n\nMs Cusworth said her parents used to pack their esky with fresh produce whenever they visited her in Perth and she would always check if they needed anything before visiting.\n\n\"[Now] they don't have to worry about stocking the pantry or fridge and freezer with all sorts of stuff because they don't know what they're going to feel like or what they'll want to eat,\" she said.\n\n\"If they run out of milk or bread then it's just a quick drive into town, which is so much easier for them.\"\n\nThe supermarket makes it easier for residents to restock if they run out of supplies. (ABC Midwest & Wheatbelt: Piper Duffy)\n\nHelping other businesses\n\nPerenjori publican Kirk Pohl said being able to walk \"30 seconds\" down the road to quickly stock up on ingredients in the middle of a lunch-time rush would be \"fantastic\".\n\nKirk Pohl says a supermarket will be especially appreciated by the townspeople. (ABC Midwest & Wheatbelt: Piper Duffy)\n\n\"[At the pub] you might have 20 meals one night and 130 meals the next so it's very hard, especially with fresh produce, to know how much to have on hand,\" he said.\n\n\"Our closest drive to a shop is Morawa … an 80km round trip just to buy some groceries so having this shop 100 metres from the pub is fantastic news for us.\"\n\nAmbrose Heelan's Red Emu Motel has been almost fully booked since it opened about a year ago.\n\nMr Heelan said being able to buy groceries in town would benefit his guests and staff.\n\nAmbrose Hill says he is proud his town can now offer a supermarket to guests and residents. (ABC Midwest & Wheatbelt: Piper Duffy)\n\n\"I think every business sort of floats off each other, so the more people we bring to town, the more money they spend at the supermarket and cafe as well,\" he said.\n\n\"I've got staff here now and we don't have to travel [out of town] to the shop so hopefully we save a bit of money too.\"\n\n'Need, not a want'\n\nRecently retired shire chief executive Paul Anderson said he was proud the town would be given back an essential for daily life.\n\nPaul Anderson spearheaded the project to get a local supermarket off the ground. (ABC Midwest & Wheatbelt: Piper Duffy)\n\n\"It's not just a want, it's an actual need for people,\" Mr Anderson said.\n\n\"Having a supermarket is one of the basic necessities of a community where you can walk down the street and buy your groceries and what you need for tea.\"\n\nMr Anderson said he hoped the shop would bring people back into town to make it \"brighter and more community orientated\".",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/health/2025-08-21/gynaecological-cancer-survivors-teach-students/105672692",
        "title": "Ovarian cancer signs can be overlooked. This program aims to change that",
        "publish_date": "Wed, 20 Aug 2025 23:00:00 +0000",
        "category": "lifestyle",
        "authors": [],
        "text": "When Kristin Young was diagnosed with stage 3 ovarian cancer in 2009, it had taken her doctors some time to figure out what was wrong.\n\n\"Ovarian cancer is difficult to pick up and often thought to be other things,\" she said.\n\n\"The most common symptoms — bloating, feeling full [quickly] and the need to urinate more often … they present like other common conditions.\"\n\nIn Kristin's case, it was a much rarer symptom — swollen lymph nodes in her groin — that prompted concern.\n\nKristin Young is an ovarian cancer survivor and a volunteer for Survivors Teaching Students. (Supplied)\n\n\"The really tricky thing about ovarian cancer is it manifests in many different ways … and spreads quite widely before it ever gets big enough to give you a symptom,\" she said.\n\n\"Many women have hoped that the medical system would do better to pick it up early, but the system is up against the perplexing biology of ovarian cancer, which is worsened by its rarity.\"\n\nKristin underwent treatment, which was successful, but 4.5 years later, the cancer returned.\n\nThe now-retired psychologist said one of the biggest challenges of dealing with a cancer diagnosis was navigating the health system and \"getting the right communication\" with her medical team.\n\n\"It is challenging for patients to get the best out of the medical system, so it became very important to me to try to optimise that communication,\" she said.\n\nWhen an opportunity came up to work with trainee health professionals to improve their understanding of gynaecological patients' lived experiences, Kristin knew she wanted to be involved.\n\n\"One of the really important things … is to share that message that [ovarian cancer] is difficult to diagnose, and how important it is to listen to the stories that women bring to the doctor,\" she said.\n\n\"If, through education and awareness, we can help a small number of people be diagnosed even a bit earlier, it's better than things staying the way they are.\"\n\nGynaecological cancers poorly understood\n\nThe volunteer-led program, Survivors Teaching Students, is a national initiative that brings ovarian and other gynaecological cancer survivors and caregivers into the classrooms of medical, nursing and other health professional students across the country.\n\nAlison Evans, CEO of the Australian and New Zealand Gynaecological Oncology Group (ANZGOG), said the program was developed by the Ovarian Cancer Research Alliance in the US and brought to Australia by ANZGOG in 2017.\n\n\"It's vital because it's really giving voice to what symptoms are, what diagnosis looks like, and what treatment looks like from a patient's perspective,\" Ms Evans told the Health Report.\n\nLoading...\n\nIn Australia, 19 women are diagnosed and six women die from gynaecological cancer every day.\n\nDespite this, Ms Evans said gynaecological cancers — which include uterine, endometrial, ovarian, vulval, vaginal and cervical — were poorly understood in the community.\n\n\"There's a stigma around these cancers because they are part of the reproductive system, and therefore they're hidden and they're very personal,\" she said.\n\nWith the exception of cervical screening, there are no early detection tests available, and as a result, gynaecological cancers often grow silently during the curable stage.\n\nMore than 100 volunteers currently participate in the Survivors Teaching Students program across Australia and New Zealand. (Supplied: ANZGOG)\n\nAdding to the challenge is the fact women may have symptoms overlooked or minimised by health professionals, which Ms Evans hopes the program will help to change.\n\n\" We ask women to know their body and to advocate for their body … it is vital that they are listened to and that doctors hear what these women are saying to them. \"\n\nShining a light on the patient experience\n\nSince 2017, Survivors Teaching Students volunteers have delivered in-person and online programs to more than 20,000 students across 22 universities in Australia and New Zealand.\n\nDuring a typical session, students hear from three volunteers — including patients, carers and family members — about their personal experience with gynaecological cancer, including the physical, mental and emotional toll it takes.\n\n\"Patients are real people with lives and families, and we want the doctors and nurses of the future to see that,\" Kristin said.\n\nAfter 27 rounds of radiation, Alex wants urgent funding for gynaecological cancers Photo shows Zoe embraces her mum, Alex Neville, alongside twin sister Kate A new report has found gynaecological cancers have been among the poorest funded for almost two decades — these women hope to change that.\n\nOne of the key goals, she said, is to emphasise the importance of good health communication and compassionate care.\n\n\"Patients remember what doctors and nurses say, and that sometimes can be engraved in your mind forever.\"\n\nBut the most important part, according to Kristin, is answering the questions from students.\n\n\"Many students are really touched at an emotional level … and perhaps start to think they would consider a career in oncology or oncology-based research.\"\n\nLike many women with gynaecological cancer, Kristin Young experienced delays in getting a diagnosis. (Supplied)\n\nFurther research was critical for early detection and treatment options to be improved, Ms Evans said, particularly for the 55 per cent of gynaecological cancers considered rare or less common, which often had limited treatment options.\n\n\"We want doctors to be curious about these diseases for the rest of their career,\" she said.\n\n\"The most important thing is that GPs and nurses … have a voice in their head that is the woman's voice or the carer's voice that they take with them.\"\n\nLeaving a lasting legacy\n\nKristin said her own experience with ovarian cancer was proof that oncology research was having an impact.\n\n\"I'm a 'super responder' on one of these new molecular-based treatments … so the prognosis that I had, which was very poor, I have now outlived this, and I know that that represents hope,\" she said.\n\n\"Research is prolonging lives in some people and with more research it will prolong more lives.\"\n\nABC Health in your Instagram feed Follow @abchealth on Instagram, where we're busting myths and sharing practical, smart health advice.\n\nIn addition to inspiring and educating the next generation of health professionals, she said the Survivors Teaching Students program had strengthened the community of people living with gynaecological cancer.\n\n\"At the very personal level, I have made good friends, what I feel are lifelong friends.\n\n\"The term lifelong is ironic in ovarian cancer because many of the women I have met … unfortunately have not had long lives. I have my contacts list and my phone is full of people who have passed away, but I never delete them.\"\n\nThe program helped people affected by gynaecological cancer leave a \"lasting legacy\", Ms Evans added.\n\n\"Many women and their families at the end of treatment are looking for a way to make a difference.\n\n\" It gives people a sense that they could take their experience of this disease and turn it into something good. \"\n\nListen to the full story and subscribe to the Health Report podcast for more.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-08-21/nicola-olyslagers-tied-first-diamond-league-high-jump-lausanne/105679514",
        "title": "Olyslagers soars in the rain to claim share of Diamond League win",
        "publish_date": "Wed, 20 Aug 2025 22:45:05 +0000",
        "category": "sports",
        "authors": [],
        "text": "Australian Nicola Olyslagers has defied the teeming rain to swan over the bar with just one bound and share the win in the Diamond League high jump in Switzerland.\n\nThe incessant downpour in Lausanne made it a fairly miserable night for athletes at the Swiss venue on Wednesday, local time, but you could not keep the smile from two-time Olympic silver medallist Olyslagers's face as she pulled off a successful gamble to share a three-way victory.\n\nDeciding to be the last jumper to enter the competition at 1.91m, Olyslagers feared the worst the more the track got deluged.\n\n\"This is a very wet competition, so I decided to be bold and start high, like I usually do when it's good conditions, and when the rain started pouring down, then I was thinking, 'have I made the right decision?'\" Olyslagers said.\n\n\"But in the end, it worked, because the one jump was the winning jump.\"\n\nIndeed, that proved her only clearance of the night as she went on to share first place with Germany's Christina Honsel — who had three successful jumps — and Poland's Maria Żodzik, who had four. They all failed at 1.94m.\n\nOlyslagers's perennial domestic rival Eleanor Patterson also cleared 1.91m, but a first-time failure at that height meant the other three shared the spoils.\n\nUkraine's Olympic champion Yaroslava Mahuchikh withdrew from the competition after two missed attempts at 1.86m and 1.91m, feeling it was not worth the risk with a wet run-up.\n\nThe 28-year-old Olyslagers is in fine form leading into the world championships, her major target of the year, but success in the season-long Diamond League, the finals of which take place in Zurich next week, is another incentive.\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\nWhile Britain's Olympic champion Keely Hodgkinson continued her comeback to racing with a meeting 800m record of 1 minute 55.69 seconds, Australia's new national record holder Claudia Hollingsworth had to settle for seventh in 1:58.81.\n\nLiam Adcock (7.50m) was eighth in the long jump, which was won by Uzbekistan's Anvar Anvarov (7.84), while Jack Rayner splashed home in 16th in the 5000m in 13:31.22.\n\nIn a non-Diamond League event, Aussie speedster Torrie Lewis won the 100m A final in 11.31sec.\n\nIn the meet's big 100m clash, Olympic champion Noah Lyles was beaten again by Oblique Seville, with the Jamaican's 9.87-second run hugely impressive in the conditions. Lyle clocked 10.02 seconds in his third straight 100m loss on the Diamond League circuit.\n\nAAP",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-08-21/south-african-spinner-reported-over-suspect-bowling-action/105679452",
        "title": "South African spinner reported over suspect action during win over Australia",
        "publish_date": "Wed, 20 Aug 2025 22:21:28 +0000",
        "category": "sports",
        "authors": [],
        "text": "South Africa's spinning all-rounder Prenelan Subrayen has been reported for a suspect bowling action after the Proteas' victory in the first one-day international against Australia.\n\nThe 31-year-old off spinner, who took the key wicket of Travis Head early on before taking 1-46 in his 10 overs, had been making his ODI debut in the 98-run win in Cairns on Tuesday.\n\nBut in the match officials' report, concerns were cited about the legality of his bowling action.\n\nWith Subrayen now having to face an independent assessment of his action at an ICC-accredited testing facility within 14 days, the news is a blow to the Proteas, who are already having to cope without injured star paceman Kagiso Rabada.\n\nAfter losing the T20I series 2-1, the Proteas are eyeing revenge in the ODI series with two matches still to be played in Mackay on Friday and Sunday.\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\nIt was only two months ago that Subrayen also earned his first Test appearance against Zimbabwe in Bulawayo, and he was immensely proud and emotional after the honour of receiving his first ODI cap in Cairns.\n\nSubrayen has previously had plenty of scrutiny over his action, starting well over a decade ago.\n\nIn December 2012, Cricket South Africa (CSA) placed him under rehabilitation after two separate independent tests showed his action to be illegal, but he was cleared to bowl again in January 2013 after re-testing.\n\nSubrayen was subsequently reported twice during the following two years during matches, before he was eventually cleared to resume bowling after having his action examined at South Africa's national performance centre in March 2016.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-08-21/businesses-may-change-states-to-avoid-vic-work-from-home-laws/105632726",
        "title": "Business considers changing states to avoid work-from-home laws",
        "publish_date": "Wed, 20 Aug 2025 21:49:11 +0000",
        "category": "finance",
        "authors": [],
        "text": "Real estate agent William Bonnici regularly finds himself speaking to clients across two states.\n\nHis real estate business has three offices: two in Victoria, in the towns of Beechworth and Wodonga, and one in New South Wales, in Albury.\n\nHe said a Victorian government proposal to make working from home two days a week a legal right was an overreach, and he would consider closing his Victorian offices if the laws passed.\n\n\"When state legislation starts dictating to a business — and I know that this government has been referred to as a dictatorship in recent years — as to how they should run their business, then it's going to make me question whether or not where you're based is where you should be based,\" he said.\n\n\" I wouldn't go to the extreme of saying that it would be the straw that breaks the camel's back, but this camel is definitely weary. \"\n\nWorking from home rights to be protected Photo shows A close up of Jactina Allan speaking at a media event. Victorians will be able to work at least two days a week from home under the state governments new plan to develop legal protections for employees.\n\nSeveral staff at Mr Bonnici's real estate agency regularly work from home, but he said it was not a specified regime and some tasks at his workplace could not be afforded flexibility.\n\nMr Bonnici said he believed the proposed laws could lead to calls of inequality from those who had no choice in where they worked, such as paramedics, nurses or baristas.\n\n\"Laws are there to be put in place to protect employees from recalcitrant employers and to protect employers from lazy employees,\" he said.\n\n\"I don't see how this can be legislated and then policed effectively without someone claiming victimisation.\"\n\nAdding to the bureaucracy\n\nBusiness Wodonga chief executive Graham Jenkin said the proposal had angered businesses and would bring more bureaucracy and frustration.\n\nGraham Jenkin says many businesses are \"aghast\" at the proposal. (ABC Goulburn Murray: Callum Marshall)\n\n\"Loyalty breeds loyalty, and to try and put something in the legislation that happens every day of the week around the border can be an issue,\" he said.\n\nMr Jenkin said the passing of the legislation, along with higher land taxes and rents, could mean businesses may be enticed to move across the border.\n\n\"Victoria is a very difficult place to do business at the moment … so often you'll find that similar office in NSW might be considerably cheaper and better off than here in Victoria,\" he said.\n\nWodonga's business chamber says there is too much red tape. (ABC Goulburn Murray: Philippe Perez)\n\nVictorian Chamber of Commerce and Industry chief executive Paul Guerra said mandating working from home within Victoria was \"perplexing\".\n\n\"If Victoria moves away from the legislated national system, businesses will move interstate and jobs will be lost,\" he said\n\n\"If we want businesses to be productive, and to raise the economic prospects of everyone in this state and this country, we need to get out of their way and let them operate in a way that best suits their model.\"\n\nLooking for flexibility\n\nWhile some businesses might not want to offer work from home as an option, accountant Tom Hall said working from home suited him and his family.\n\n\"I'm able to make more time for my kids, and it gets more time back in the day because you aren't losing time in the commute,\" he said.\n\nTom Hall works from home as it gives him more time with his kids. (ABC Goulburn Murray: Erin Somerville)\n\n\" You're able to structure how you can take on the day a little bit better. \"\n\nMr Hall lives in Baranduda, just outside Wodonga, but works for Albury-based Dream Accounting.\n\nHis boss, Hayley Foot, said she offered flexible work as an incentive to entice employees.\n\n\"It was increasingly hard to find skilled staff, so in November last year [we had] to advertise for new staff,\" she said.\n\n\"We put an ad up … and gave candidates the option to work flexible hours with a portion within business hours to meet clients' needs, and we got a huge response.\n\n\"It speaks for itself.\"\n\nGlen Robinson says working from home arrangements should be built on trust. (Supplied: Glen Robinson)\n\nAlbury Business Connect general manager Glen Robinson said he believed the laws would only apply to a small subset of the workforce in Wodonga, considering health care and manufacturing were the lead industries in the region.\n\nHe said the cost of moving a Wodonga business to Albury would be outweighed by having a robust conversation with a staff member.\n\n\"I know a number of people who can work quite comfortably, whether they're in an office, whether they're at home, whether on the international space station, as long as they've got access, it doesn't matter where they are,\" he said.\n\nThe Victorian government on Tuesday opened up feedback on the proposed laws, which will include roundtable discussions.\n\nSome Wodonga businesses say they may think about moving. (ABC Goulburn Murray: Philippe Perez)\n\nIndustrial Relations Minister and Northern Victoria MP Jaclyn Symes said she was confident that businesses on the border would not move to NSW because of the legislation.\n\n\"The best and brightest these days are looking for flexibility,\" she said.\n\n\"So when people say that people might be attracted to NSW, I would say that I think employers want the best and brightest, and the best and brightest like flexibility, and that'll be right here in Victoria.\"\n\nConsultation on the proposed legislation closes on September 28.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-08-21/asx-markets-business-live-news-aug-21-2025/105679346",
        "title": "Live: ASX rises, Skycity in trading halt",
        "publish_date": "Wed, 20 Aug 2025 21:42:34 +0000",
        "category": "finance",
        "authors": [
            "Samuel Yang",
            "Stephanie Chalmers",
            "Michael Janda",
            "Nassim Khadem"
        ],
        "text": "I have been participating in a rare on-the-record virtual media conference with the chair of Australia's banking, superannuation and insurance regulator, APRA.\n\nHaving recently interviewed the CBA CEO and asked him about the bank's 139,000 customers that went onto \"tailored payment plans\" over the past financial year, I asked APRA chair John Lonsdale whether he thought these kinds of hardship provisions were making official arrears levels look lower than they really should be.\n\n\"The arrears figures, the delinquencies and, ultimately, the non-performing loans, have held up incredibly well over a rising and now falling interest rate environment,\" he told me and the other financial journalists gathered on a Teams meeting. \"So, probably as good as we could have hoped for as we were moving into a rising interest rate environment. \"If you look today at the loans data, I mean, they are still at very low levels.\"\n\nI then went back with a follow-up question.\n\n\"My question was really, effectively, are they masking what would be mortgage arrears if those customers hadn't been put on hardship packages? Because clearly they can't afford their mortgage,\" I asked.\n\nIt doesn't seem like APRA knows what proportion of those on hardship provisions with their bank would have fallen into arrears in the absence of that assistance.\n\n\"It's difficult for me to comment on that, Michael, on the data that I've got, other than to say in broad terms, when you look at the system and in aggregate, the numbers have held up very, very well in terms of hardship. \"But there are people who are in hardship, and it's important to remember that. \"And we remember that when we're making calls on the serviceability buffer and other macroprudential settings.\"\n\nAnother hint there that banks and borrowers probably shouldn't expect so-called macroprudential rules like the 3% interest rate buffer on the mortgage serviceability test to be lowered soon.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-08-21/phoebe-litchfield-guides-northern-superchargers-eight-wicket-win/105679308",
        "title": "Litchfield continues impressive form as Aussies star in The Hundred",
        "publish_date": "Wed, 20 Aug 2025 21:28:30 +0000",
        "category": "sports",
        "authors": [],
        "text": "Phoebe Litchfield, inspired by a night out watching a Michael Jackson musical, has delivered a thriller of an innings in The Hundred to leave one former England captain swooning about a \"fabulous\" cricketing talent.\n\nThe gifted 22-year-old left-hander may have made a slow start to the 100-ball-a-side tournament, but blossomed this past week as the event entered its business end with glorious innings at three English Test grounds.\n\nFollowing her match-winning unbeaten 59 at her home ground, Headingley, against Birmingham Phoenix last week — her first half-century of the year — the Northern Superchargers' Australian star cracked a speedy 31 against Manchester Originals at the weekend.\n\nOn Wednesday, Litchfield played perhaps her best innings yet at Lord's, a decisive 55 not out, featuring a bewildering variety of switch hits that made her seem nigh on impossible to bowl at for the London Spirit's attack.\n\nShe hit 10 boundaries in her 38-ball knock and, along with Australian international teammate Annabel Sutherland (29 not out off 21), steered the Superchargers to 2-93 to earn an eight-wicket victory with 34 balls to spare.\n\nPlayer-of-the-match Litchfield smiled afterwards about how much she'd enjoyed being taken out the previous evening with the rest of the squad into London's West End on a team trip organised by Superchargers captain Hollie Armitage to watch MJ The Musical.\n\nAnother teammate, experienced England bowler Kate Cross, also could not help noting how Litchfield had rediscovered a real joie de vivre belatedly in this year's edition.\n\n\"After Phoebe's 50 against the Phoenix, I asked her what she'd done differently, and she said, 'I remembered what it was like in my first year here in 2023 when I came over and had no pressure on me, and I had so much fun — and I just wanted to have some fun today.'\"\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\nFormer England men's skipper Nasser Hussain described her on Sky Sports as a \"fabulous talent\", while Cross noted her switch-hitting was a freakish gift.\n\n\"I imagine when you've so many options like her, it can sometimes get quite confusing as to what shot to play. I felt like maybe that was how she started the tournament, almost trying to show off all her skills, rather than being excellent at just some,\" Cross said.\n\n\"Now she's had the opportunity to showcase it all, and she's a bit of a freak when it comes to being able to switch it over extra cover for four or six.\"\n\nSutherland was equally impressive, playing a key role in the unbroken 76-run stand with Litchfield.\n\nEarlier, Sutherland had also been key in reducing the Spirit to 8-90 with her 3-20.\n\nGrace Harris holed out at long-on to Sutherland off the bowling of another Aussie, Nicola Carey, for just seven, while the Spirit's top-scorer was yet another of the green-and-gold army, with opener Georgia Redmayne compiling a run-a-ball 29.\n\nIn Wales, Australian Jess Jonassen took 4-10 off her 20 balls in a losing effort for the Welsh Fire against the undefeated Southern Brave.\n\nAAP",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-08-21/wa-clean-energy-transition-billions-sitting-unspent/105674942",
        "title": "Two years after billions set aside for WA's energy transition, money still unspent",
        "publish_date": "Wed, 20 Aug 2025 21:14:38 +0000",
        "category": "finance",
        "authors": [],
        "text": "There are concerns WA's transition to renewable energy could be even further delayed, with $3 billion in federal funds sitting idle more than two years after they were announced.\n\nIn its first budget after the 2022 election, the Albanese government set aside $20 billion for its 'Rewiring the Nation' fund, to \"upgrade, expand and modernise Australia's\" electricity grid, to cope with the transition to renewables.\n\nIt's in the hands of the Clean Energy Finance Corporation, which will use the money to provide concessional loans and equity investments in projects across the nation.\n\nIn August 2023, the federal government signed a deal for $3 billion of that money to be set aside for Western Australian projects — something federal Energy Minister Chris Bowen described as a \"good deal for Australia\" in its decarbonisation journey.\n\nChris Bowen said the funding allocation was a good deal for WA. (ABC News: Bridget McArthur)\n\nAt a mining industry breakfast on Tuesday, WA Premier Roger Cook continued to talk up the deal.\n\n\"Poles and wires may not sound sexy … but the sexiness is in what they will achieve,\" he said.\n\n\"The Pilbara's network of mines largely run on fossil fuels. As a result, the Pilbara contributes around 40 per cent of the state's emissions.\n\n\" Eliminating those emissions will not only make the Pilbara the most sustainable mining precinct in the world, it will also take out a huge chunk of state and national emissions. \"\n\nRoger Cook says it's important to reduce the emissions produced in the Pilbara. (ABC News: Keane Bourke)\n\nBut the Clean Energy Finance Corporation has confirmed to the ABC not a single dollar has been allocated to specific projects under that deal.\n\n\"That means that any attempts at decarbonisation, in particular in the North-West Interconnected System, have been set back by years whilst the state government messes around with money that's siting on the table,\" the state's Shadow Energy Minister Steve Thomas said.\n\nNo investments made\n\nThe CEFC signed high-level agreements with the New South Wales, Tasmanian and Victorian governments in late 2022 with references to specific projects which would be invested in.\n\nThe Rewiring the Nation fund is designed to upgrade the electricity grid to deliver renewable energy. (ABC Great Southern: Andrew Chounding)\n\nThe first money was out the door by late 2023, and most major investments to date were made within about two years of those agreements being signed.\n\nSo far, $3.54 billion has been committed under the Rewiring the Nation fund across projects in New South Wales and Victoria.\n\nWA to fast-track $584m transmission link for wind and solar Photo shows Powerlines suspended between towers against orange dusk sky. New wind turbines, solar panels and big batteries might be the shiny face of the renewable energy transition, but it won't mean much without a lot more transmission lines.\n\nBut Western Australia's deal, signed in August 2023 without the mention of any specific projects, is yet to result in any investments being made.\n\nIn December, more than a year after the ink had dried on that deal, the state government gave four projects \"state recommendation\" to be considered for Rewiring the Nation funding.\n\n\"The successful proponents are now undertaking further feasibility activities and working with the state government to document project milestones,\" a state government spokesperson said.\n\n\"The CEFC is negotiating directly with proponents in relation to RTN funding.\"\n\nAsked if the process was moving quickly enough, Energy Minister Amber-Jade Sanderson said that was a question for proponents and the Clean Energy Finance Corporation.\n\n\"The state government is playing a role in supporting negotiations with traditional owners. We are working through the land tenure issues,\" she said.\n\n\"This is complex and really uncharted territory for governments and the Rewiring the Nation funding will allow those transmission lines to be built for future capacity.\"\n\nFour projects waiting\n\nThe Yindjibarndi Energy Corporation is responsible for the Chichester Corridor project, one of the four with state recommendation, and said it expected to receive a decision on Rewiring the Nation funding in late 2027.\n\nThe Chichester Range Corridor project in WA's Pilbara will connect industry in the area to renewable energy generation to the south. (Supplied: WA government)\n\n\"We understand that RTN funding, like all project finance, will require a significant amount of detail from the proponent,\" CEO Craig Ricato said.\n\n\"We're working hard to collate that information over the next two years and working proactively with the CEFC in the interim so that we have a complete understanding of their requirements.\"\n\nCan Australia's staggering 'small-scale flex' save our energy future? Photo shows Electricians place solar panels on roof As Australia's energy transition hits turbulence, a quiet but fundamental shift is underway.\n\nMr Ricato said the state government had provided \"timely support\" which \"enabled us to maintain momentum and continue progressing our projects\".\n\nA spokesperson for APA, an Australian energy infrastructure business responsible for two of the four projects, said the company \"continues discussions with potential customers in the Pilbara and continues to work with Energy Policy WA to progress priority corridor agreements for the Burrup and Hamersley Corridors\".\n\nAustralian Renewable Energy Hub, which is responsible for the other project, declined to comment.\n\n'We can't afford to wait'\n\nDirector of think tank Climate Energy Finance, Tim Buckley, agreed with Dr Thomas that inaction would cause significant delays.\n\n\"There is not enough skilled workforce, we don't have the domestic supply chains, and so grid transmission projects could take five or 10 years,\" he said.\n\n\" If the government doesn't approve things in 2025, they're not going to be operating this decade and we can't afford to wait. \"\n\nTim Buckley accused the state government of being slow to act. (ABC News)\n\nMr Buckley said that could have even wider-ranging effect.\n\nHe shares the view of others that WA has the potential to become a \"renewable energy export superpower\", but only if it is a competitive place for the private sector to invest.\n\n\"At the end of the day, capital is very mobile, it will go where it gets the best return,\" he said.\n\n\"And WA absolutely will miss out if they don't provide the enabling infrastructure and the planning approvals, and also the guidance.\"\n\nGovernment has 'no idea': Thomas\n\nDr Thomas said necessary guidance included a solid plan for the state's electricity grids, which was behind schedule.\n\n\"Companies are trying to work out where new transmission lines are going to go so they can put their business plans in place,\" he said.\n\nSteve Thomas says the government has no plan for WA's energy future. (ABC News: Ezra Kaye)\n\n\"The government though has no idea.\n\n\"What we need is a far better plan, a whole of system plan that covers all of the needs in terms of new distribution infrastructure, and then we can work out where we're going to invest, in what order.\"\n\nIt is unclear when those plans will be released.\n\nAmong the companies frustrated with the pace of development is Woodside, with CEO Meg O'Neill earlier this year blaming slow progress on transmission infrastructure for issues building solar power for its Pluto plant.\n\nMeg O'Neill said Woodside could build the transmission lines. (ABC News: Keane Bourke)\n\n\"We were ready to build transmission lines ourselves,\" she said.\n\n\"The state's got a desire for transmission to be state owned infrastructure, which we fully support, and we were happy, in fact, we were happy to build it then give it to the state or hand it over in a proper commercial manner to the state.\n\n\"We … kind of don't care how it gets built. We just want it to get built so we can cut our emissions at the Pluto site.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-08-21/federal-politics-live-aug-21/105678526",
        "title": "Live: Jim Chalmers and shadow treasurer have 'heated exchange' at roundtable",
        "publish_date": "Wed, 20 Aug 2025 21:11:49 +0000",
        "category": "finance",
        "authors": [
            "Joshua Boscaini",
            "Olivia Caisley",
            "Maani Truu"
        ],
        "text": "Australian Council of Trade Unions (ACTU) secretary Sally McManus says the focus of today's economic reform roundtable must be around intergenerational inequality.\n\nMcManus says house prices have outgrown wages, and capital gains tax and negative gearing reforms should be considered by the roundtable.\n\nShe says she believes the ACTU will have \"allies\" in the room on those matters.\n\n\"It's not acceptable to us at all that they are facing a worse standard of living than the generations before them, and essentially we're at a time when people have got to step up and take action on this matter, and the biggest part of that of course is housing affordability,\" McManus says.\n\nYesterday McManus said she felt a little lonely in the room. However it appears she wasn't alone when it came to regulating artificial intelligence (AI) in Australia.\n\nMcManus says there was discussion about properly paying creatives and protecting them from AI.\n\n\"That ended up being not a lonely discussion, and one where I think that probably the business community ... better understood where we were coming from, and they too don't want to see outcomes that are bad for their businesses,\" she says.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-08-21/jeremy-rockliff-outlines-tasmanian-liberals-first-actions/105676256",
        "title": "From stadium to TasInsure, Rockliff's agenda faces tests",
        "publish_date": "Wed, 20 Aug 2025 21:11:35 +0000",
        "category": "finance",
        "authors": [],
        "text": "Tasmanian Premier Jeremy Rockliff says his minority government remains \"committed to working across the parliament\", as it plans to make inroads on budget repair, a new state-owned insurance agency, and allowing pets in rentals early in the new term.\n\nThe state's net debt, which is projected to reach $13 billion by 2027-28, was one of the main reasons the state went to the polls.\n\nThe budget outlook was a key policy platform for Labor and most members of the crossbench.\n\n\"It'll be a lot of work,\" Mr Rockliff said on Wednesday.\n\nWithin the first week, the government intends to consult with Treasury and government agencies, ahead of the November budget.\n\nMr Rockliff said using the original 2025 budget as a baseline, the party would \"work across the political divide\" to bring it into shape.\n\n\"We want everyone's ideas as we work towards a sustainable budget, which we are committed to,\" he said.\n\nJeremy Rockliff survived a no-confidence motion in parliament this week, with only Labor supporting the motion. (ABC News: Ebony ten Broeke)\n\nIndependent MP Peter George said the party needed to show transparency and accountability.\n\n\"The big problem is going to be whether the Liberal government is prepared to share the information that's necessary for making decisions, and whether it's also prepared to take the responsibility for the state of the budget that we've got now,\" he said.\n\n\"I don't have a lot of faith in this Liberal administration.\n\n\"It takes a long, long time to build trust, confidence and faith, and it can be very easily destroyed.\n\n\"We need to do this very slowly.\"\n\nThe first 100 days\n\nLandlords will not be able to \"unreasonably\" refuse a request for a pet under the new legislation. (ABC News: Ebony ten Broeke)\n\nWithin the first 100 days, the government wants to introduce legislation to advance state-owned insurance agency, TasInsure, planning to have it set up in 2026.\n\nThe plan was slammed by the opposition, prominent economist Saul Eslake, and the Insurance Council of Australia during the campaign, but heralded as game-changing by the Tasmanian Chamber of Commerce and Industry.\n\nLoading...\n\nAlso a priority is amending the Residential Tenancy Act, to give tenants more secure right to keep pets in rentals — a promise the Liberals took to the 2024 election.\n\nLabor campaigned this time around with TassieDoc, pledging to deliver five fully bulk-billed clinics across the state. The Liberals quickly matched it, but did not follow on when Labor bumped the number up to 10.\n\nLabor's Dean Winter campaigned for 10 TassieDoc bulk-billing GP clinics during the election campaign, with the Liberals agreeing to implement five of them. (ABC News: Luke Bowden)\n\nNow, the government plans to run an expression of interest for four new bulk-billed clinics within the first 100 days, \"based on evidence of need\".\n\nThe Liberals have also promised to release updated costings on the leasing arrangement for Spirit of Tasmania IV, which was docked in Scotland from late 2024 and is due to reach Tasmanian waters this week.\n\nWorking with the new crossbench\n\nThe government needs either Labor or at least four crossbenchers in order to pass legislation. (ABC News: Ebony ten Broeke)\n\nWithout a majority in parliament, the Liberals have made a number of policy concessions to win over crossbenchers, including phasing out greyhound racing, abandoning a plan to release more native forest for logging and, most recently, a pause on salmon farming expansions while an independent review of the industry takes place.\n\nAnd the Liberals will need to continue appeasing the crossbench if they want to stay in power for a full four years.\n\n\"There's no time for hubris. There's no need or want for hubris,\" Mr Rockliff said.\n\n\" [Tasmanians] want us to get on with the job, but also in the spirit of collaboration, and working in and across the parliament. \"\n\nJeremy Rockliff (right) could face stiff opposition to his agenda. (ABC News: Ebony ten Broeke)\n\nBut they remain at an impasse when it comes to Hobart's proposed Macquarie Point stadium.\n\nIndependent MP Kristie Johnston said she did not expect the premier to abandon the project, but \"the reality is we are in a power-sharing parliament now\".\n\n\"We don't need [the stadium]. We can't afford it and it doesn't fit. And I will continue to execute that argument in parliament at every possible opportunity,\" she said.\n\nLoading...\n\nTasmania's turmoil is finally over, as Rockliff promises to 'make it work' Photo shows Man in suit stands at press conference Having survived an early election and another no-confidence motion straight after, Premier Jeremy Rockliff says he will focus on keeping the crossbench onside in the new Tasmanian parliament.\n\nThe Project of State Significance (PoSS) process for assessing the project continued throughout the election campaign, and the premier said regardless of whether the PoSS or enabling legislation came before the parliament, every parliamentarian would have their vote.\n\nShooters, Fishers and Farmers member Carlo di Falco, one of the most conservative crossbenchers, told ABC Mornings he planned to push back on the concessions made that he did not agree with, such as the greyhound racing ban. He said he was \"blindsided\" by the move.\n\n\"I'm not going to give Jeremy a free ride, and I've got a better chance of getting a better outcome for my constituents being inside the tent rather than outside, so every time Jeremy gets comfortable in his sleeping bag, I'm going to be kicking it,\" he said.\n\nCarlo Di Falco says he will make sure Mr Rockliff does not get complacent. (ABC News: Maren Preuss)\n\nLoan for struggling smelter\n\nDays after Labor accused the government of \"tossing aside\" salmon workers to \"cling on to power\", Minister for Business, Industry and Resources Felix Ellis on Wednesday announced a $20 million bridging loan to Liberty Bell Bay owner GFG Alliance, to ensure the \"bright future\" of hundreds of Tasmanians.\n\n\"It will provide a shipment of ore so that workers on site can get on with what they do best and produce manganese through the smelter,\" he said.\n\n\" This is about supporting local Tasmanian families. \"\n\nThe Liberty Bell Bay smelter, near George Town, has been struggling to secure ore to continue operating. (Supplied: Liberty Steel Group)\n\nAustralian Workers Union president Robert Flanagan welcomed the support, but remained disappointed by the salmon review.\n\n\"What we want to see is a government that supports job opportunities in Tasmania, and we think that [with] the crossbench the government has to work with [it] will be very difficult to achieve that outcome,\" he said.",
        "source": "ABC"
    },
    {
        "url": "https://www.smh.com.au/lifestyle/steptember-2025-is-about-to-kick-off-with-registrations-now-open-20250821-p5mopv.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Steptember 2025 is about to kick off with registrations now open",
        "publish_date": "Thu, 21 Aug 2025 11:59:34 +1000",
        "category": "lifestyle",
        "authors": [],
        "text": "Steptember 2025 is about to kick off with registrations now open\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later. Dismiss\n\nOur network\n\nOpen Navigation Menu The Sydney Morning Herald",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/business/banking-and-finance/wall-street-giant-targets-australia-s-richest-families-20250819-p5mo14.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Wall Street giant targets Australia’s richest families",
        "publish_date": "Thu, 21 Aug 2025 11:58:29 +1000",
        "category": "finance",
        "authors": [
            "Richard Henderson"
        ],
        "text": "Goldman Sachs plans to expand its private wealth management team in Australia to capture a boom in self-made multimillionaires and family wealth looking for global investments.\n\n“We are absolutely looking to grow,” Jean-Paul Churchouse, the firm’s head of private wealth management for Southeast Asia and Australia, said in an interview. “We are looking to hire, but it’s really about finding the right people rather than hitting a target.”\n\nSoftware giants Canva and Atlassian have minted a younger generation of entrepreneurs including Mike Cannon-Brookes, who are in lucrative targets for the wealth management giant. Credit: Bloomberg\n\nGoldman now has around 13 people on the ground in Sydney and Melbourne, including eight advisers, targeting ultrarich clients that have at least $100 million of investable assets. It established this setup about four years ago, the only private wealth team that was set up in Asia-Pacific during this time, and said it’s only getting started.\n\nThe Wall Street bank is offering Australian investors access to the firm’s network of investment bankers around the world and staff with relationships on otherwise hard-to-access private deals. It’s seeking to get a slice of the wealth opportunity in the country, alongside other foreign banks such as UBS as well as domestic wealth management firms like LGT Crestone, which also target less affluent individuals.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/nrl/nrl-around-the-clubs-round-25-20250817-p5mnjy.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "First time father at 11:55, kick-off at 2: inside Simpkin’s whirlwind Sunday",
        "publish_date": "Thu, 21 Aug 2025 11:56:36 +1000",
        "category": "sports",
        "authors": [
            "Adrian Proszenko",
            "Christian Nicolussi",
            "Dan Walsh"
        ],
        "text": "As noon approached, Simpkin admitted he was getting nervous. “I was like ’12:15 is the cut off love, so you’ve gotta get him out, and you’ve gotta get him out now’,” Simpkin recalled. “She was good about it, she was ‘if he comes, I’m happy for you to go play.’ So that was good. It was an important game for us even though it didn’t go the way we wanted it to, I wanted to play it.” Simpkin, who met Surjan at Clovelly Beach six years ago, said his head was a mess when he ran onto the field.\n\n“I had a good chat to Chez [Daly Cherry-Evans], he was pretty good to me,” Simpkin said. Loading “He just said I’m not a chance today, just take a second and breathe. When you get out there, obviously there were all the formalities at the start of the game, he was just ‘take that time, that minute or two to just have a couple of breaths and just clear your mind before the game.’ “That helped me, I had a couple of moments like that. Everyone was really good, they got me in shape and ready to go pretty quickly, so it was good.” Simpkin said it has been an eye-opening adjustment to footy with fatherhood.\n\n“It’s hard, just the sleep and stuff like that,” he said. “She made me do the first nappy, it is disgusting …I was saying to her if we did this at the start of the year, I would have struggled just with the sleep and adjusting to everything. “Hopefully we win all of our games and see what happens, but if that doesn’t happen, we’re pretty close to the end of the season, so it’s not too bad anyway.” Graham still in pain but keen to rush field for Johnston’s try milestone Campbell Graham’s back injury has been so painful that the South Sydney centre struggles getting out of chairs and driving long distances. But it won’t stop him being the first one running onto the field when teammate Alex Johnston finally breaks the NRL’s try-scoring record.\n\nJohnston needs four more tries to pass Ken Irvine’s mark of 212 four-pointers, but time is running out for the winger to enter rarefied air this season. The 15th-placed Rabbitohs host St George Illawarra on Thursday night for their penultimate game before facing bitter rivals Sydney Roosters after a bye. Souths officials have publicly urged fans not to storm the field once Johnston finally breaks the record, as supporters did when AFL star Lance Franklin kicked his 1000th goal in 2022. But teammates could be a different matter, with Graham keen to run through his pain and show Johnston some love.\n\nInjured Rabbitohs centre Campbell Graham. Credit: Kate Geraghty “Absolutely I would, I’d try to be the first one there to cuddle him. Obviously it’s a matter of when, not if, so we’ll just see how it plays out,” Graham said. “It’s been a monkey on his back for a couple of years now. “It’s such a great achievement, not only in our game but in Australian sport to have a record like that. It really couldn’t happen to a better person.” Seeing his mate break the record would be a rare bright spot in a tough season for Graham, who has been troubled by a bulging disc in his back since March. The 26-year-old initially needled up to play but has been sidelined since round 18 and will not line up again this year.\n\nRabbitohs try-scoring sensation Alex Johnston. Credit: Getty Images The injury is unlikely to require off-season surgery but has nevertheless been “pretty rough” for Graham to handle. Loading “Simple things like driving long distances is not great, getting up out of chairs, stuff like that. It isn’t ideal, day to day,” Graham said of his pain. “It does get you pretty down, even just day to day, dealing with a chronic issue like that. My focus is just to get on top of this, not only for footy but for myself as well. At the moment, the goal is to be back fit and training by pre-season.”\n\nAnother disrupted year was a tough pill to swallow for Graham, who had been hampered by a sternum injury across the previous two seasons. The sternum issues forced Graham to withdraw from NSW’s squad for the 2023 State of Origin series opener and eventually sidelined him from Souths’ entire 2024 campaign. But Graham is hopeful his luck will turn in 2026, when Souths will fight to recover from a season of injury horror across the board. “That’s something that helps me in my mindset, that although I’ve had a pretty unlucky run the last couple of years I know things will get better,” he said. “I know if I keep doing the right things, I’ll give myself every chance to be fully fit by pre-season.” AAP Murray lifting training standards as Rabbitohs get their groove back\n\nChristian Nicolussi Cameron Murray has been credited with helping South Sydney win their past two games, simply by returning from injury and lifting the standards at training. The Rabbitohs’ skipper was not named to return from an Achilles injury for Thursday night’s clash against St George Illawarra, while Latrell Mitchell was also left off the team sheet as he continues to battle a nerve issue in his back. The sight of Murray back in full training at Heffron Park has been the circuit-breaker the Bunnies needed, according to injured representative centre Campbell Graham.\n\n“The way he leads and communicates with the boys out there, you can see training has gone up a gear,” Graham said. “In all honesty, I think he has helped contribute to our wins the last couple of weeks, just with his presence. “Cam is giving himself every opportunity to get back and play. The medical staff aren’t pushing him, but Cam is his own man, and if he feels like he’s ready, he’ll push to play. Souths skipper Cameron Murray Credit: NRL Images “Just seeing someone like that and how dedicated he is to his rehab, how professional he has been about the whole thing – he hasn’t left any stone unturned – it’s pretty admirable.”\n\nMurray and Mitchell went down within minutes of each other in the pre-season, with the captain rupturing his Achilles tendon. He wants to play in the last round against the Sydney Roosters if fit, and has the full blessing of coach Wayne Bennett. The easy thing would be to keep Murray on ice and let him be fresh for day one of 2026 pre-season training, but as Bennett said recently, “He wants to reward himself for nine months of rehab. Even if it’s just a couple of games, it’s a game he loves, and it’s something he hasn’t been able to do.” Mitchell has also had an injury-interrupted year, with the latest back injury forcing him to miss another week. With the bye next week, he is also a chance to return for the Roosters. Campbell Graham helps launch the Telstra Footy Country Round at East Hills on Tuesday. Credit: Kate Geraghty/SMH Bennett acknowledged the role Murray had played by being back at training, but was equally complimentary of Mitchell and Cody Walker, who both played big roles in their returns against the Titans and Eels, respectively.\n\n“Cam is a pretty exceptional guy, he’s one of the elite players in the game with his attitude, and everything he does is at 100 per cent,” Bennett said. “We appreciate him being back at training, but the wins also come down to having quality players on the field. Cody and Latrell have played the last two weeks; they’ve been really good for us and made a difference.” Meanwhile, Graham, who missed all of last year with a sternum injury, then broke his hand in the off-season, injured his calf in round three, and has not been sighted since round 18, confirmed a back complaint had left him with mental demons. He has avoided surgery and been limited to pilates, swimming and physiotherapy, with the aim of resuming running in the pre-season.\n\n“It doesn’t leave you in a good headspace, especially after the year I had last year, it’s just been very stop-start,” Graham said. “Not feeling at your physical best for such a long time, it gets pretty draining.” In team news, Isaah Yeo has been named on an extended bench for the Panthers when they host Canberra in Mudgee on Friday, Ryan Papenhuyzen (concussion) was listed in jersey No.21 for Friday night’s Storm clash with the Bulldogs, Sydney Roosters winger Daniel Tupou (concussion) is replaced by Junior Tupou for their trip to Parramatta, while Krystian Mapapalangi is the centre named on the Wests Tigers’ extended bench in case Starford To’o (shoulder) is not fit. A summer to relish breaking Irvine’s record sits fine with AJ Alex Johnston hopes to break Ken Irvine’s all-time try-scoring record at the start of next season – not in the coming weeks – so he can have all summer to savour the prospect of achieving the historic feat. Johnston failed to add to his career tally against Parramatta on the weekend to remain on 209 tries, three shy of Irvine’s long-standing mark.\n\nThe player marking him on Thursday night, when the Rabbitohs take on St George Illawarra, will be former Rabbitoh Corey Allan, who gave Johnston the easiest try of his career in the final round of 2020. Johnston needed five tries in the final round to finish as that year’s top try-scorer, and Allan got across the line, only to wait for Johnston to catch up to him and give him the ball to score. Allan said he was yet to receive the carton of beer Johnston had promised. “I’m still waiting for that case – it will be interesting to see if it ever rocks up at my doorstep,” Allan said. “I could have scored that night, but I thought I better look behind me to see if he was coming. He needed five to draw level with Kyle Feldt [on the top try-scorers list]. Lo and behold, he was screaming my name, and his eyes lit up when I turned around. The rest is history.\n\n“I don’t think the record will be broken again. ‘AJ’ is a special player.” Alex Johnston and Corey Allan celebrate that try in 2020. Credit: Getty Images Johnston said of Allan: “Hopefully he can help me with a couple of more tries this weekend.” South Sydney coach Wayne Bennett said after the win over the Eels that the likely return of Latrell Mitchell to left centre would help Johnston in his quest to break the record. “I love playing with ‘T-Mitt’ [Mitchell],” Johnston said. “Cody Walker has given me most of my tries, but Trell would be the second most.\n\n“I sort of only want to get three tries this year, that way I’ve got the whole off-season and the lead-up [to] next year to try and get it in round one. A hat-trick this weekend will see Alex Johnston draw level with Ken Irvine’s long-standing try record. Credit: Getty Images “I’ve been thinking about what I should do [to celebrate]. I’ll have to do something.” Souths have asked fans not to storm the playing pitch when Johnston reaches the milestone, but the winger has other ideas. “I think it will happen, and the NRL and Souths will have to be prepared for it to happen,” Johnston said.\n\n“There were pretty crazy scenes in the AFL when [Sydney Swans forward Lance] Buddy Franklin [kicked 1000 goals], so there will be a lot that goes on behind the scene to make sure it is safe. I’m all for it. I think the NRL will need to prepare for it.” The Bunnies are chasing three straight wins, while the Dragons need three replacements, for Jack de Belin, Hamish Stewart and Hame Sele, who were all ruled out with category-one concussion symptoms on the weekend. Why Haas chose Samoa Dan Walsh Queensland Origin centre Rob Toia will prioritise his Tongan heritage over a potential Ashes tour berth as fellow Kangaroos defector Payne Haas declared Samoa now has the playing stocks to win next year’s World Cup.\n\nHaas confirmed on Sunday his switch of allegiance to the rising Pacific nation, with high hopes that fellow Australian stars Tino Fa’asuamaleaui and Hamiso Tabuai-Fidow do the same for this year’s Pacific Championships. Tonga’s October 26 clash with Samoa at Suncorp Stadium is predicted to draw one of the best Test attendances in decades on Australian soil and outsell the 33,196 who turned out for Australia’s win over the Mate Ma’a in Brisbane last year. Toia’s decision to represent his family’s Tongan roots does, however, take another outside back option off the table for Australia’s three-Test tour of the UK in October and November. Big names Latrell Mitchell and Tom Trbojevic loom as the Kangaroos’ first-choice centre pairing for the first Ashes tour since 2003. However, both have been hampered by injury as South Sydney and Manly have struggled this season, and arguments could be made for them focusing on club commitments given their injury histories.\n\nToia’s rise as a rookie of the year contender and an eye-catching debut Origin series keeping Mitchell quiet had him in Kevin Walters’ sights, particularly given Stephen Crichton (Samoa), Valentine Holmes (torn rotator cuff) and Campbell Graham are unavailable for Australia. Rob Toia has committed to Tonga at the end of the season. Credit: NRL Photos Like Tabuai-Fidow, Brisbane’s Kotoni Staggs is still considering whether he makes himself available for Australia or Tonga at season’s end. Melbourne’s Xavier Coates, Canterbury’s Matt Burton and Jacob Kiraz, Parramatta’s Zac Lomax and Josh Addo-Carr, and Roosters rugby convert Mark Nawaqanitawase loom as Australia’s other leading three-quarter options. Under current international eligibility rules, Toia’s opting to play for Tonga after coach Kristian Woolf got in contact won’t preclude him from representing Australia or New Zealand (where his father was born), just as Haas’s call won’t impact his NSW Origin career.\n\n“Woolfy reached out, and I responded. I was very surprised to be honest, but I told him I’d love the opportunity to play for Tonga if he was to choose me,” Toia said. Payne Haas has confirmed his allegiance switch to Samoa. Credit: Getty Images “I had a chat with my parents about it, telling them that opportunity was there, and they were over the moon. My grandparents on both sides have lived in Tonga the majority of their lives, so they were probably the happiest. They were telling me they can’t wait to see me represent them if that happens.” League Immortal Andrew Johns on Sunday likened Haas’s decision to represent Samoa to Jason Taumalolo’s generational switch to Tonga for the 2017 World Cup. Haas said he was inspired by the North Queensland veteran’s move, though he was reluctant to put public pressure on Fa’asuamaleaui to follow his lead.\n\n“Hopefully, we get a few more boys over, but they have to follow their heart and do what’s right for them,” Haas said. “To play with [Fa’asuamaleaui] would be special. I hope he makes the switch.” Haas said on Sunday that new Australian coach Walters was understanding of his decision, which was first set in motion when he played against Samoa in 2023, and the island’s national anthem played. Haas, Crichton, Jarome Luai, Brian To’o and Terrell May headline an already star-studded Samoan contingent under coach Ben Gardiner, prompting Haas’s prediction of World Cup glory at next year’s tournament. “I feel like we can win it, especially with the team we have got now,” Haas said.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/lifestyle/steptember-participant-sean-explains-why-he-s-taking-part-of-his-year-s-fundraiser-20250821-p5mopo.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Steptember participant Sean explains why he’s taking part of his year’s fundraiser",
        "publish_date": "Thu, 21 Aug 2025 11:55:39 +1000",
        "category": "lifestyle",
        "authors": [],
        "text": "Steptember participant Sean explains why he’s taking part of his year’s fundraiser\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/car-stolen-from-melbourne-with-familys-luggage-and-passports-inside-20250821-p5mopn.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Car stolen from Melbourne with family's luggage and passports inside",
        "publish_date": "Thu, 21 Aug 2025 11:54:41 +1000",
        "category": "finance",
        "authors": [],
        "text": "Car stolen from Melbourne with family's luggage and passports inside\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/politics/federal/every-number-you-just-said-is-wrong-chalmers-o-brien-brawl-behind-closed-doors-20250821-p5mop1.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘Every number you just said is wrong’: Chalmers, O’Brien brawl behind closed doors",
        "publish_date": "Thu, 21 Aug 2025 11:54:40 +1000",
        "category": "finance",
        "authors": [
            "Paul Sakkal",
            "Shane Wright"
        ],
        "text": "Treasurer Jim Chalmers and shadow treasurer Ted O’Brien have fought over government spending inside the high-powered economic roundtable on Thursday morning.\n\nAt the opening of a session on fiscal management, the Coalition representative at the government-run summit made his major first intervention in the three-day event, accusing Chalmers of over-spending and baking in long-term deficits.\n\nTreasurer Dr Jim Chalmers takes his seat during day three of the Economic Reform Roundtable. Credit: Alex Ellinghausen\n\nA source familiar with the conversation, unauthorised to disclose it publicly, said the argument became “heated”. NSW Treasurer Daniel Mookhey, who was due to speak next, stepped in and encouraged the pair to move on from the debate.\n\n“Jim [Chalmers] got very defensive and said, ‘We’re not in question time, Ted’,” the source said.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/nsw/how-merivale-s-powerful-political-ties-helped-move-a-light-rail-stop-20250820-p5mobx.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "How Merivale’s powerful political ties helped move a light rail stop",
        "publish_date": "Thu, 21 Aug 2025 11:49:38 +1000",
        "category": "finance",
        "authors": [
            "Eryk Bagshaw"
        ],
        "text": "Merivale has denied the allegations and accused this masthead of malicious journalism. “Merivale is and has always constantly strived to improve its workplaces and services,” Merivale’s lawyers said in July. Fair Work has launched an investigation into the company. One Transport NSW proposal contained in the documents shows the centre of the light rail stop covering Palings Lane, which divides Merivale’s CBD headquarters. But the proposed stop would have blocked access to Merivale’s Ivy restaurant precinct, which houses restaurants Uccello and Felix as well as its VIP club Level 6. The Wynyard light rail stop out the front of Merivale venues. Credit: Edwina Pickles Instead, the light rail stop was constructed further away from Wynyard and closer to Angel Place, allowing Merivale to expand its al fresco dining outside its restaurant Totti’s. Merivale was also able to secure a “super taxi rank” on Pitt Street to ferry customers away from the Ivy. The company did not respond to requests for comment about its lobbying of Transport for NSW. A spokesperson for Transport for NSW said a wide range of factors were considered during the planning of the major new public transport project, which had an extensive and lengthy design process, involving public consultation and stakeholder feedback.\n\n“Transport considered a variety of locations for the Wynyard Light Rail stop and its design went through a number of iterations throughout the planning process,” the spokesperson said. “Factors taken into consideration included pedestrian safety, crowding, traffic, road interfaces, platform size, positioning in relation to train stations and other key infrastructure, drainage, accessibility and distance to locations and services.” The construction of the light rail was dogged by repeated delays, legal battles and prolonged disruption, leaving smaller businesses struggling to survive with debts of up to $500,000. Emanuel Tzirtzilakis, the owner of a cafe on Devonshire Street in Surry Hills, told a NSW Parliamentary inquiry in 2018 that he had been driven to the “brink of financial ruin” by the project.\n\nConstance led a $31 million compensation scheme for some businesses, but others have taken their claims to the High Court after the NSW government won an appeal against further compensation in 2023. Constance became closer to Hemmes as the hospitality baron expanded his empire into Narooma in Constance’s electorate of Bega. Hemmes bought the Glasshouse Rocks estate in 2017 and now owns four venues and several expansive waterfront properties. Loading The former transport minister, who declined to comment, was regularly seen at events at the Ivy, including parties hosted by Liberal lobbyist and Hemmes’ political consigliere Michael Photios, who ensured the 52-year-old’s relationships reached the top of the Liberal Party. In January 2022, two days after New Year’s Eve, NSW Premier Dominic Perrottet scheduled a meeting with Hemmes at Constance’s home, a separate set of documents released under freedom of information laws reveals.\n\n“7:30pm Private Drink-Dinner: Premier/Andrew Constance/Justin Hemmes,” the calendar invite from Perrottet shows. “Where: Andrew Constance Property”. When the trio met up, it was not at Constance’s home in Moruya but Hemmes’ 60-hectare mansion in Narooma. The scheduled meeting was never disclosed in the premier’s ministerial diary entries. The rules governing ministerial diary entries do not require ministers to disclose social events but cautions them to make public any “substantive discussion of issues” that may be considered by the minister. The documents show Hemmes would personally email Perrottet’s office to request meetings, including one to discuss Merivale’s unsolicited proposal for the commercial development of Hunter Street metro station, which went ahead on 14 December 2021 and was disclosed in ministerial diary entries.\n\nBut another titled “6pm catch up. Justin Hemmes” on September 15, 2022 at his restaurant Felix, was not disclosed. The former premier declined to comment. In his previous role as state treasurer, Perrottet became a key supporter of ending the lockout laws that had dented Hemmes’ hospitality empire and put restrictions on the wider industry. Perrottet appointed the billionaire to his Treasury advisory council in 2018. As premier, Perrottet described him as a “pub doyen” in 2021 and lauded him for his plans to revitalise the CBD. During the COVID-19 pandemic, Perrottet and Hemmes unsuccessfully lobbied then federal treasurer Josh Frydenberg, one of Hemmes’ close friends, for an extension of JobKeeper and pushed for a repeal of the fringe benefits tax to encourage corporate long lunches. Perrottet arrives at the Ivy in August 2024 with his wife Helen. Credit: Wolter Peeters After Constance resigned as transport minister and triggered a by-election in Bega in 2022, a briefing from Perrottet’s office spruiked Hemmes’ establishments in Narooma during a campaign stop to highlight a $4 million upgrade to Narooma wharf, which helps service Merivale venues and other restaurants in the southern inlet.\n\nWhen Perrottet resigned as premier in 2023, he had a three-hour lunch at Hemmes’ restaurant Felix. A year later, when he left state parliament, the Ivy and the penthouse that is home to the infamous private members club, Level 6, hosted Perrottet’s farewell. Merivale paid for the former premier’s send-off. The gift did not need to be disclosed because Perrottet left parliament that day. Ministerial diaries show the former state Liberal government had 20 meetings with Merivale between 2019 and 2023, involving the premier, police minister, transport minister, and treasurer. NSW Labor Premier Chris Minns has had two meetings with Merivale since being elected in 2023. Hemmes and his companies have donated more than $350,000 to the Liberal Party since 2018, Australian Electoral Commission records show, while hosting fundraisers with prime ministers at his mansion, the Hermitage, now estimated to be worth $200 million, as part of his decade-long campaign for greater political influence. Internal messages show the company has also targeted men with political capital, including former chiefs of staff in the state government, for special treatment by offering them complimentary Level 6 memberships.\n\nLoading In 2021, Merivale secured one of the biggest government catering contracts in the state: a six-year multimillion-dollar deal under a competitive tender by the Liberal government run by Venues NSW to provide food and drinks at two of Sydney’s largest stadiums, the SCG and Allianz. The state Labor government has put the company on notice, signalling that any plans to renew the contract are under threat following the allegations of exploitation, harassment and underpayment revealed by this masthead. “We should make sure that we do everything we can to keep workers safe, particularly young women workers who are vulnerable to exploitation in these circumstances,” NSW Legislative Council member Dr Sarah Kaine, the government’s procurement inquiry chair, said in July. The company is also in a $124 million dispute with the state government over the compulsory acquisition of two properties it bought opposite Wynyard Station for $77 million in 2018, which it had planned to turn into “Ivy 2.0” as part of its $3 billion property empire.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/australia-news-live-israel-calls-on-60-000-reservists-for-full-gaza-offensive-tax-reform-to-be-discussed-on-final-day-of-roundtable-20250821-p5moli.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Australia news LIVE: Israel calls on 60,000 reservists for full Gaza offensive; Tax reform to be discussed on final day of roundtable",
        "publish_date": "Thu, 21 Aug 2025 11:48:23 +1000",
        "category": "finance",
        "authors": [
            "Daniel Lo Surdo"
        ],
        "text": "The Commonwealth Bank has reversed a decision to cut 45 call centre jobs as it rolls out an artificial intelligence-powered chatbot, admitting it made a mistake and failed to properly consider “all business considerations” when it made the cuts.\n\nCBA last month said it was introducing a new system that would automate simple queries from customers to its call centres, and this meant it no longer needed 45 positions.\n\nCommonwealth Bank chief executive Matt Comyn. Credit: AFR\n\nHowever, the Finance Sector Union (FSU) said their members then struggled with a rising volume of calls, and management needed to scramble by offering overtime and pulling team leaders onto the phones.\n\nAfter a dispute at the Fair Work Commission and pressure from the union, the bank has now backflipped and will allow the workers to keep their jobs, a move that was first reported in the Australian Financial Review.\n\nCBA on Thursday confirmed the change, saying it would now give the affected 45 staff the choice of staying in their current jobs, taking a redundancy or pursuing redeployment within the bank.\n\nThe bank is still using the chatbot and rolling out other AI technology – indeed, investment in AI was a top priority for chief executive Matt Comyn at its latest results.\n\nFSU national secretary Julia Angrisano. Credit:\n\nFSU national secretary Julia Angrisano said the backflip was a massive win for the workers, and members wanted to be part of the conversation about how technology was used in banking.\n\n“CBA has been caught out trying to dress up job cuts as innovation. Using AI as a cover for slashing secure jobs is a cynical cost-cutting exercise, and workers know it,” Angrisano said.\n\nA CBA spokesman admitted the mistake, said it had apologised to staff and it was reviewing its internal processes.\n\n“CBA’s initial assessment that the 45 roles in our Customer Service Direct business were not required did not adequately consider all relevant business considerations and this error meant the roles were not redundant,” he said.\n\n“We have apologised to the employees concerned and acknowledge we should have been more thorough in our assessment of the roles required … we are also reviewing our internal processes to improve our approach going forward.”",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/racing/waller-backs-via-sistina-to-handle-heavy-challenge-in-winx-stakes-defence-20250821-p5momg.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Waller backs Via Sistina to handle heavy challenge in Winx Stakes defence",
        "publish_date": "Thu, 21 Aug 2025 11:46:03 +1000",
        "category": "sports",
        "authors": [
            "Craig Kerry"
        ],
        "text": "Chris Waller believes Via Sistina will thrive “getting into the ground” in the Winx Stakes at Randwick on Saturday, despite the superstar mare failing in her only attempt on heavy going.\n\nAnd the premier Sydney trainer is looking to the Irish-bred eight-year-old’s European form, and a tip from star English jockey Ryan Moore as evidence.\n\nVia Sistina and Kerrin McEvoy charge home in the 2024 Winx Stakes. James McDonald has the ride on Saturday. Credit: Getty Images\n\nVia Sistina, destined to be crowned Australian horse of the year after a record-equalling seven group 1 wins last season, is set to resume in the 1400m Winx Stakes on Saturday, although heavy rain this week and forecasts for more showers on Friday and Saturday have raised questions about the meeting going ahead, and which stars will line up if it does.\n\nThe opening group 1 of the season has a field of 12, including five from the Waller stable.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/lifestyle/fashion/the-women-shortlisted-to-replace-anna-wintour-at-vogue-20250821-p5momh.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "The women shortlisted to replace Anna Wintour at Vogue",
        "publish_date": "Thu, 21 Aug 2025 11:44:13 +1000",
        "category": "lifestyle",
        "authors": [
            "Laura Craik"
        ],
        "text": "“No one can replace Anna” has long been the refrain among fashion’s highest echelons.\n\nNot being a 500-year-old immortal like the Highlander, however, someone eventually must. Nothing – not even a diet of rare steak and daily tennis – can make a person live forever. And yet, Anna Wintour’s 37-year reign at American Vogue was so formidable that many assumed she might go on editing indefinitely.\n\nWhich is why June’s announcement that she would be stepping back from her day-to-day duties at Vogue came as such a surprise – and why speculation over her successor is now at fever pitch. While Wintour still holds two powerhouse titles – chief content officer of Condé Nast and global editorial director of Vogue – relinquishing the hands-on editorship of US Vogue marks the end of an era. It also signals the fading of a golden age for glossy magazines, when seven-figure salaries, chauffeured limousines and lavish expense accounts were de rigueur.\n\nLauren Sanchez is among the possible candidates tipped to replace Anna Wintour as editor of US Vogue. Credit: Getty Images for amfAR\n\nHer successor, taking on the newly created role of head of editorial content, will face a daunting challenge. With magazine sales in decline, they will need to combine journalistic rigour, marketing acumen and managerial diplomacy with formidable networking skills, elite hosting and fundraising prowess – not to mention the hide of a rhinoceros.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/culture/art-and-design/in-a-first-the-city-s-biggest-cultural-institutions-are-run-by-women-20250707-p5md14.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "In a first, the city’s biggest cultural institutions are run by women",
        "publish_date": "Thu, 21 Aug 2025 11:30:00 +1000",
        "category": "entertainment",
        "authors": [
            "Linda Morris"
        ],
        "text": "Save Log in , register or subscribe to save articles for later. Save articles for later Add articles to your saved list and come back to them any time. Got it Normal text size Larger text size Very large text size The appointment of Maud Page as the Art Gallery of NSW’s first female director in 154 years marks a historic moment for the state’s six galleries and museums. All are now headed by women: Annette Pitman leads Museums of History of NSW; Dr Caroline Butler-Bowdon, the State Library of NSW; Kim McKay, the Australian Museum; Louise Herron, the Sydney Opera House; and Lisa Havilah, the Powerhouse Museum. Last year, their cultural institutions welcomed more than eight million visitors, commanded operational budgets of more than $600 million and employed 2200 full-time staff. They lead in the tricky aftermath of COVID, which temporarily shut their doors, reshaped public buying habits globally and played havoc with the costs of doing business. Audiences are changing, at once more informed, and increasingly sophisticated but also weaned on novelty; time poor and distracted. From left Dr Caroline Butler-Bowdon (State Library of NSW); Maud Page (Art Gallery of NSW); Kim McKay (Australian Museum); Louise Herron (Sydney Opera House); Lisa Havilah, (Powerhouse Museum); Annette Pitman (Museums of History NSW). Credit: Wolter Peeters Their museums and galleries are under pressure to leverage technology and enhance visitor experience, without turning their halls into places of entertainment, or quasi-wedding venues. Many occupy heritage sites built at the high watermark of the British Empire, their collections over-represented when it comes to the works, perspectives and deeds of white men, and all the while their budgets are under pressure, as they seek new funding streams that can bring ethical dilemmas.\n\nAdvertisement\n\nSpectrum sat down with the leaders in the boardroom of the Australian Museum to talk budgets, philanthropy and future directions. Annette Pitman, you lead Museums of History of NSW, but before that, you were chief executive of Create NSW, and you have had the benefit of sitting in on countless budget meetings. Can you set the scene: What is the reality of the financial climate that the state’s major galleries and museums currently find themselves in? Annette Pitman: I think we are in a period of unprecedented demand for what we do. The pandemic really made people appreciate what cultural institutions provide and appreciate the gathering that happens around culture in these spaces. We are incredibly nimble at doing really cutting-edge and meaningful things with small budgets. So we are in a period where we’ll have to be at our most creative. Kim McKay with a favourite object from the Australian Museum collection: a Pormpuraaw Ghost Net sculpture, made from discarded plastic commercial fishing nets, lines and traps. Ghost nets drift in the ocean and create a deadly hazard for marine life before washing up on beaches. In the late 1980s, McKay co-founded Clean Up Australia and saw first-hand the devastation ghost nets cause. Credit: Wolter Peeters Are cultural institutions out of the woods post-pandemic, Louise Herron? Louise Herron: Our audience statistics suggest many of the worst of the COVID impacts are behind us. Even in the current cost-of-living crisis, people will still save up and go to see the performers they love. Since COVID, we have become more intentional and analytical about what we do. People got out of the habit of going out, so we need to be even more conscious of who we are trying to attract – be that children, Pasifika people, contemporary music fans. We keep working to let people know we do a lot more than opera, though opera still accounts for a bit more than 10 per cent of tickets sold. Kim McKay: The fact that we are free for all to come into and enjoy the museum (yes, you pay for special exhibitions and programming) is especially important in a cost-of-living crisis and tight budgets. It’s a way to level the playing field. I see migrant families, three generations in the one family coming in together because all people want their kids to be exposed to knowledge and learning. The Australian Museum brings in one and a half million people a year but imagine if we could reach 10 million people.\n\nAdvertisement\n\nThe Holy Grail for cultural institutions is the 18 to 30-year-olds. How does the Art Gallery of NSW engage with these young adults? Maud Page: Our youth engagement strategy begins in early childhood. [We] do that through artist-led children’s programming, like Hive Festival, which attracted more than 28,000 visitors over one weekend in January. If you bring in children, you bring in their aunties, their cousins, their grandparents and their parents and you provide an experience that resonates with all ages. The magic has to come from education, but people don’t want to be dictated to any more. They want to be enthralled. So in our case, it is all about stepping into experimental music like Grammy Award-winning artist Solange in 2023 and ARIA award-winning Northern Territory rock band King Stingray, who last month attracted more than 6000 visitors to the Art Gallery in one night. Maud Page holds an Aurukun fire stick gifted to her from artist. “It took me a long time to fall pregnant. The fabulous artist Tony Albert had begun at Queensland Art Gallery in the same week as me. After three years working together, in 2005, my daughter Alia was born. Sharing in my exultation, Tony gave me a rare Aurukun fire stick made by Joe Ngallametta. Joe passed away not long after and this beautiful object represented birth and death but also the beginning of a learning journey into the extraordinary world of First Nations art. Credit: Wolter Peeters And yet, your gallery has been accused in the Murdoch press of being too woke. Maud Page: It is a very reductive description of what we do, and I would say every single institution around this table is open and generous and welcoming to everyone. The art gallery showcases such a broad spectrum of artistic voices and contemporary and historical art that offers an enriching experience for all visitors. Writing and reading are somewhat old-fashioned ideas in the internet age, Caroline Butler-Bowdon. How does the state’s oldest library survive? Caroline Butler-Bowdon: Books and stories are just as relevant today and remain at the heart of libraries. But libraries have always evolved, and today they’re also places for creativity, lifelong learning and social connection. People used to go to cathedrals and other sorts of places for a sense of connection but these days they are coming to our institutions for the same experience. We work with the Sydney Writers’ Festival, Sydney Film Festival, Mardi Gras and it’s through partnerships and collaboration that we build audiences, we diversify our audiences. We’ve had a 25 per cent growth in visitation in one year. The core ingredients are essential services, magical experiences and everything in between using social media to share stories, to share our research and depth and drive audiences.\n\nAdvertisement\n\nLouise Herron: You definitely need to have a clear ambition and ours is to be Everyone’s House. Last night, one of Australia’s heaviest metal bands, Parkway Drive, played to a sold-out Concert Hall of 2500 people, backed by a full symphony orchestra. Almost 80 per cent of the audience was new to the Opera House. Some people were so disappointed to miss out on tickets that they came anyway and stood on the Forecourt during the concert, many in black tie. We’re looking for artists or genres that will bring new audiences to the Opera House. And if one of our organisations connects with a new community, it helps all of us. Annette Pitman holds Laminex samples circa 1956. “This post-war period marked a series of shifts in Australian society; housing boom, Australian Dream, kitchen becoming the heart of the home. Laminex was produced in hundreds of colours and patterns; something for every home, and as a result this durable, practical and affordable Australian made product became ubiquitous in our homes.” Credit: Wolter Peeters Lisa Havilah, you are building a cultural institution from scratch on the banks of the Parramatta River. If you build it, will the crowds come? Lisa Havilah: One of the reasons the museum at Parramatta is designed to be so vertical is to give as much green space as is possible back to the community and wrapping around each of the exhibition spaces with public space that will lead to an open rooftop. It’s in the mix of public space, exhibition space, amenity and experience that we hope to make the museum a part of somebody’s everyday life. We are creating exhibitions that people can immerse themselves in in new ways, like working with architects, presenting the collection in new ways that engage young audiences. Because you might come to an exhibition, you might come to have dinner, you might come to just sit in the garden or you might come with your family to sit on the riverbank. Loading So, why do you say the traditional show-and-tell model of programming is on the way out? Lisa Havilah: Museums need to change and move more than they used to. Exhibitions need to change. Stories need to shift and become more relevant. Historically, museum exhibitions have been very didactic, presenting one position on an object or one story. So it’s about giving space for people’s perspectives, their own histories and memories.\n\nAdvertisement\n\nKim McKay: In our early years, our institutions didn’t engage with First Nations people. It’s very different now. Why should we speak for First Nations people when they can speak for themselves? Museums of History of NSW cares for 12 house museums, and a written archive that dates to 1788, the arrival of the First Fleet. Annette Pitman, how do you avoid romanticising the past, and how do you represent an Australia that has changed since the foundational times of those house museums? Loading Annette Pitman: History is messy, right? It’s a multidimensional thing and no matter what topic we might be talking about, with the hindsight of time, we come to understand it differently. I think the public understands this, especially today when we see so much manipulation of the truth. There is value to be found in the information we hold about our past. We’re partnering with the Aboriginal Languages Trust on a wonderful program that supports First Nations teams to go through our archives and identify references to culture and language that aren’t known. So there are ways we can engage without sugar-coating what’s happened and that’s our duty as a public institution. Museums and galleries pitch themselves as places of public trust at a time of misinformation, but do you run the danger of turning culture into a commodity? Annette Pitman: “I don’t think there is anything wrong with making quality content entertaining. We just had a kids program called Beautiful waterways, Stinky Sewers that drew 7000 kids from all over NSW who came to the Tank Stream and learn the history of public sanitation. I think we’re clever enough to navigate that line. Caroline Butler-Bowdon with Dorothea Mackellar’s 1907-1908 poetry notebook from the library’s collection, the only known manuscript of her iconic poem Core of My Heart, later renamed My Country. “The poem is still loved today for its enduring themes, and shows just how powerfully words can spark creativity, stir emotion, and stay meaningful across generations. The same can be said for libraries. What I love is that it was first written when Dorothea was just 19 years old. Our reading rooms are full of young people, studying and creating and it’s nice to think that a future Dorothea indeed could be one of them.” Credit: Wolter Peeters\n\nAdvertisement",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/military-camps-malaria-and-dysentery-how-a-naive-couple-tested-their-love-20250721-p5mgiq.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Military camps, malaria and dysentery: How ‘a naive couple’ tested their love",
        "publish_date": "Thu, 21 Aug 2025 11:30:00 +1000",
        "category": "finance",
        "authors": [
            "Dani Valent"
        ],
        "text": "TV producer PJ Madam, 45, and her 43-year-old partner, Tim Noonan, a documentary-maker, put their relationship to the ultimate test. Now she stays home with their two sons (five years and 10 months) while he creates TV shows.\n\n“We crammed 10 years of arguments into one year – and filmed it,” says Tim Noonan of his “unimaginably testing” time with partner PJ Madam. Credit: Andrew Wilson\n\nPJ: Last night, Tim asked me if we’ll ever have sex again. I was breastfeeding at the time. I wondered, is it a male thing, needing physicality to feel the love? I need to feel the love to be physical. I need a good night’s sleep and a bit of quiet, then I might be in the mood. We’ve worked hard at our relationship and I’m embarrassed to wonder, “Oh, my god, after everything, are we going to lose each other through the chaos of parenthood?”\n\nWe met as reporters on Sunday Night at Channel 7 in 2013. There was an attraction, but I mostly loved how hard he worked. Maybe it’s an in-built evolutionary thing: he’s going to be hunting for me forever. I could see he was a solid person – stable, honest – but I’d been ­married before and I was wary; I carried a huge amount of shame.\n\nAfter a couple of years, Tim decided we needed to explain our relationship to my parents; the next minute, we’re in a car with them. Tim said, “Pull over at the nearest pub, Mr and Mrs Madam, we need to talk to you. I want to be with your daughter forever.” It went so well that now I think they favour him over me! Like me, they saw a man of honour, big on telling the truth; it unlocked a lot of trust.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/nsw/why-rba-s-sydney-office-rebuild-has-landed-it-in-trouble-with-a-court-20250819-p5mo6m.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Why RBA’s Sydney office rebuild has landed it in trouble with a court",
        "publish_date": "Thu, 21 Aug 2025 11:30:00 +1000",
        "category": "finance",
        "authors": [
            "David Barwell"
        ],
        "text": "The Reserve Bank of Australia has a new critic – and this time not mortgage-laden home owners – as a long-planned redevelopment of its asbestos-ridden headquarters has prompted concerns over the impact on one of Sydney’s busiest courthouses.\n\nThe NSW Justice Department has raised alarm bells over plans to revamp the RBA’s Martin Place office tower, fearing noise and vibrations from construction could impede the neighbouring Land and Environment Court.\n\nThe first stage of the RBA’s head office upgrade is due to be determined by the City of Sydney Council next week. Credit: Louise Kennerley\n\nThe department’s concerns centre on the proximity of the court, which shares walls with the RBA’s head office.\n\nThe Reserve Bank is seeking approval from the City of Sydney Council to carry out the first stage of its long-planned office upgrade which includes removing hazardous building material along with original building slabs, marble walls, windows, and leather doors.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/business/markets/asx-climbs-as-brambles-gold-stocks-rise-james-hardie-s-horror-run-continues-20250821-p5mokz.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "ASX climbs as Brambles, gold stocks rise; James Hardie’s horror run continues",
        "publish_date": "Thu, 21 Aug 2025 11:28:37 +1000",
        "category": "finance",
        "authors": [
            "Staff Writers"
        ],
        "text": "Northern Star Resources, Australia’s biggest gold producer, saw its shares rise 1.4 per cent after the company said it more than doubled its net profit over the past financial year, helped by a higher gold price amid resilient demand for safe haven assets amid tariff uncertainty for the global economy. Other gold stocks also gained. Evolution Mining was up 1.8 per cent and Newmont rose 1.3 per cent.\n\nA flurry of local company results took investor attention away from Wall Street, where indexes ended mixed as the sell-down of AI superstars such as Nvidia continued, albeit at a more muted pace.\n\nThe S&P/ASX 200 climbed 65.90 points, or 0.7 per cent, to 8983.90 as of 11.05am AEST, with nine of its 11 industry sectors in the green, led by industrials, mining and consumer stocks. The ASX added 0.3 per cent on Wednesday. The Australian dollar was 0.3 per cent lower at US64.34¢.\n\nThe Australian sharemarket opened stronger this morning, putting it on track for a new record on one of the busiest days of reporting season.\n\nMining giants BHP, Fortescue Metals and Rio Tinto also advanced, rising 1.2 per cent, 0.9 per cent and 1.5 per cent, respectively. So did the big four banks, with CBA up 0.1 per cent, Westpac rising 0.7 per cent, NAB up 0.2 per cent and ANZ Bank up 0.5 per cent, respectively. Mining and financial stocks make up more than half of the ASX, so even small movements can steer the wider market.\n\nBrambles shares climbed 5.2 per cent. The pallet supplier this morning announced a share buyback of up to $US400 million ($622.5 million) and declared a final dividend of US20.83¢ a share, taking its payout for the year to US39.83¢, up 17 per cent from the last year, as an efficiency drive helped it improve profits.\n\nOn the flip side, Whitehaven Coal shed 2.3 per cent after reporting its underlying net profit fell by more than half to $319 million in the past financial year, with earnings markedly slowing in the second half as coal prices declined. The news came a day after Yancoal, the nation’s biggest pure play coal producer, said its revenues fell in the June half despite a higher coal output because of weaker prices. Yancoal’s shares added 0.4 per cent after their 11.4 per cent loss on Wednesday.\n\nAnd James Hardie’s horror sell-down continued, with the share price falling another 8.2 per cent after plummeting 27.8 per cent on Wednesday after the home cladding maker said its full-year net income was down 60 per cent as sales in its key US market declined. Demand in home repairs, renovations and new construction is “challenging”, it warned.\n\nSuper Retail Group, which owns the Rebel sports, Supercheap Auto and Macpac chains, jumped 13.9 per cent. They hit a record high after the company said it boosted sales by 4.5 per cent to a record $4.1 billion in the past financial year, with growth accelerating in the second half.",
        "source": "SMH"
    },
    {
        "url": "https://www.sbs.com.au/news/article/melbourne-university-privacy-palestinian-protests-wi-fi-data/xeeuuxn64",
        "title": "University of Melbourne breached privacy by tracking protesters' Wi-Fi location",
        "publish_date": "Thu, 21 Aug 2025 00:20:31 +0000",
        "category": "finance",
        "authors": [],
        "text": "The University of Melbourne has been found to have breached Victoria's privacy laws by using information to track students involved in a 2024 pro-Palestinian protest.\n\n\n\n\n\nAccording to the state's deputy information commissioner, the university has breached two information privacy principles (IPPs) in the way it used \"a combination of student Wi-Fi location data, student card photographs and CCTV footage to identify\" student protesters.\n\n\n\n\n\n\"Because the collection and use of the data involved the surveillance of students and staff, and surveillance by its nature is antithetical to human rights, the breach was serious,\" the Office of the Victorian Information Commissioner (OVIC) stated.\n\n\n\n\n\nIn response, Katerina Kapobassis, the University of Melbourne's chief operating officer, said the university \"acknowledges that it could have provided clearer active notice to students and staff members in relation to the use of WiFi location data, and a number of remedial actions are progressing\".\n\n\n\nREAD MORE Australian students walk out of class, calling for sanctions on Israel\n\nHow did the investigation start?\n\nFollowing a sit-in protest at the university's Arts West Building on the Parkville campus in May last year, the university's vice-chancellor instructed everyone occupying the building to leave the premises.\n\n\n\n\n\nAccording to OVIC's report, some demonstrators ignored the direction, resulting in the university starting an investigation into potential student misconduct.\n\n\n\n\n\nThe university identified 20 students and started misconduct proceedings against them.\n\n\n\n\n\nAfter media reports in July 2024 revealed the university had tracked protesters using CCTV and Wi-Fi data, the Privacy and Data Protection deputy commissioner launched the investigation.\n\n\n\nAccording to the OVIC's report, the university identified staff involvement in the protest through an analysis of Wi-Fi location data, CCTV footage, and a review of 10 staff members' email accounts. Source: AAP / James Ross\n\nWhat did the investigation find?\n\nThe investigation focused on the university's \"use of staff and students' Wi-Fi location data, and was expanded to include the university's review of a small group of staff members' email accounts\".\n\n\n\n\n\nThe investigation found the university \"contravened\" two different IPPs when using the Wi-Fi data.\n\n\n\n\n\nConsidering the number of people impacted and the level of the impact, the deputy commissioner determined the breaches were \"serious\".\n\n\n\nThe privacy principles were about whether the university \"properly informed students and staff about how their personal information would be used\" and if the use of data was \"consistent with the primary purpose of collecting this information or was for an authorised secondary purpose\".\n\n\n\n\n\nThe investigation, however, did not find any breaches in relation to staff email accounts.\n\n\n\nWhat did the university say?\n\nKapobassis said in a statement that the university \"takes its privacy obligations seriously and has cooperated openly and responsively to the deputy commissioner in the conduct of her investigation\".\n\n\n\n\n\nWhile acknowledging the university could have provided clearer notice, she said \"the use of WiFi location data in student misconduct cases was reasonable and proportionate in the circumstances\".\n\n\n\n\n\n\"The university has already completed a number of actions that are proposed in the final report, and all others are progressing. We will ensure the university community is kept informed as these changes are made.\"\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/politically-unpopular-but-needed-call-for-tax-reform-to-fix-housing-mismatch/kw2k0n7fs",
        "title": "Most Australian houses have space for bigger families. But that's not who's in them",
        "publish_date": "Wed, 20 Aug 2025 20:53:23 +0000",
        "category": "finance",
        "authors": [],
        "text": "Australian households are mostly one or two people, but analysis shows the housing stock is dominated by three-and four-bedroom properties.\n\n\n\n\n\nCouples without kids and people living alone make up 61 per cent of households, raising the question of how well a housing market focused on bigger families is serving real demand.\n\n\n\n\n\nA comparison between the number of people in a household and data on housing by number of bedrooms shows a stark mismatch, according to the latest analysis from property research firm Cotality.\n\n\n\n\n\nResearch head Eliza Owen said a potential solution could lie in government housing reform.\n\n\n\nGovernments could make it more expensive to have more housing than needed, and cheaper for those who opt to live in smaller properties.\n\n\n\n\n\nAbolishing taxes such as stamp duty could make it cheaper for those to move across different housing, and the introduction of a broad-based land tax would raise costs for those who own more land.\n\n\n\n\n\n\"It's politically unpopular but has a broad consensus among economists that it would help us achieve a more efficient housing market,\" she told the Australian Associated Press.\n\n\n\nThe data also highlights the high number of empty-nest households of people aged 65 and over.\n\n\n\n\n\n\"There's a lot of scope for older Australians to leave their homes to free up homes for younger generations,\" Owen said.\n\n\n\n\n\n\"But it's really hard to implement taxes to encourage people to downsize.\n\n\n\n\"Things like broad-based land taxes are an incentive for income-poor but asset-rich Australians to downsize,\" Owen said.\n\n\n\n\n\nStrides are already being taken on the supply side to establish well-located apartments in larger cities to accommodate smaller households, but shifting demand through tax reform could help the take-up of these homes.\n\n\n\n\n\n\"It's a tough transition to make.\n\n\n\n\n\n\"But it's also a really hard ask to young families to pay a million dollars to own a house in one of our major cities.\"\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/video/pm-responds-to-south-australias-algal-bloom-with-financial-support-package/c5r0gkd9j",
        "title": "PM responds to South Australia’s algal bloom with financial support package",
        "publish_date": "Wed, 20 Aug 2025 11:21:52 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/video/victorian-government-commits-to-22-reforms-following-childcare-review/5ogc1vs7t",
        "title": "Victorian Government commits to 22 reforms following childcare review",
        "publish_date": "Wed, 20 Aug 2025 11:06:53 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/video/australiss-housing-crisis-focus-of-day-two-of-economic-roundtable/ksr9jx82d",
        "title": "Australis's housing crisis focus of day two of economic roundtable",
        "publish_date": "Wed, 20 Aug 2025 10:56:40 +0000",
        "category": "finance",
        "authors": [],
        "text": "Australis's housing crisis focus of day two of economic roundtable\n\nPublished 20 August 2025, 9:06 am\n\nHousing has been placed under the spotlight on the second day of the government's economic roundtable. Moves to make the construction code simpler and cheaper have attracted widespread support but there's a push to better utilise the skills of permanent migrants to help be part of the solution.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/video/art-exhibition-supporting-afghan-women-living-under-the-taliban/ityfpuzju",
        "title": "Art exhibition supporting Afghan women living under the Taliban",
        "publish_date": "Wed, 20 Aug 2025 10:42:42 +0000",
        "category": "entertainment",
        "authors": [],
        "text": "Art exhibition supporting Afghan women living under the Taliban\n\nPublished 20 August 2025, 9:01 am\n\nAn exhibition of handcrafted embroidery is helping women in Afghanistan, forbidden from working since the Taliban took over four years ago. 'Sparks in the Dark' features more than 200 handkerchiefs with intricate designs, from creative women who refuse to be silenced.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/thriving-kids-the-plan-to-move-children-with-autism-and-developmental-delays-off-ndis/dg1r2612r",
        "title": "Thriving Kids: The plan to move children with autism and developmental delays off NDIS",
        "publish_date": "Wed, 20 Aug 2025 09:49:25 +0000",
        "category": "finance",
        "authors": [],
        "text": "A plan to divert children with autism and developmental delays from the NDIS is crucial to ensure the scheme remains sustainable, the disability minister says.\n\n\n\n\n\nDisability Minister Mark Butler used a speech at the National Press Club on Wednesday to say the NDIS was not the right fit for the growing number of children on the autism spectrum or with developmental delays.\n\n\n\n\n\nA separate program called Thriving Kids will be set up to focus on those children previously covered by the NDIS.\n\n\n\n\n\nIt will begin rolling out from July 2026 and be fully implemented by July 2027.\n\n\n\nREAD MORE ADHD and autism: Experts urge caution as social media blurs diagnostic boundaries\n\nBulk-billed check-ups\n\nChildren with autism on the NDIS would not be steered from the scheme until supports were fully rolled out, the minister said.\n\n\n\n\n\n\"I know this will be hard for some parents to hear and I don't say it lightly,\" Butler said in the speech.\n\n\n\n\n\n\"We need as a matter of some urgency to create a better system that will enable our children to thrive.\n\n\n\n\n\n\"Diverting this group of kids over time from the NDIS is an important element of making the scheme sustainable and returning it to its original intent.\"\n\n\n\n\n\nMedicare items for occupational therapy, speech pathology and psychosocial therapy would be considered for the program, including a bulk-billed check-up for three-year-olds, Butler said.\n\n\n\n\n\nThe government would start by making a $2 billion contribution, matched by states and territories.\n\n\n\n'A once-in-a-generation change'\n\nEarly intervention strategies were key for ensuring children received the right support, Autism Awareness chief executive Nicole Rogerson said.\n\n\n\n\n\n\"(Thriving Kids) potentially has the opportunity to be a once-in-a-generation change in how we look at developmental pediatrics,\" she said.\n\n\n\n\n\nShe said what Butler was doing was \"pretty rare for a politician\" because he was \"owning what the problem is\".\n\n\n\n\n\nEnsuring the program was in place before children were moved from the scheme was reassuring, People with Disability acting chief executive Megan Spindler-Smith said.\n\n\n\n\n\nThe minister said while one-in-50 people had a significant disability which would be covered by the NDIS, one-in-five young children were on the autism spectrum or had a developmental delay.\n\n\n\n\n\nParents had little choice but to put their children with autism on a scheme designed for permanent disability, Butler said.\n\n\n\n\n\n\"Families who were looking for additional supports in mainstream services can't find them because they largely don't exist anymore, and in that, all governments have failed them,\" he said.\n\n\n\nButler said the changes would help to bring down the cost of the NDIS, with taxpayers set to fork out more than $52 billion for the scheme in 2025/26.\n\n\n\n\n\nLaws passed in 2024 put in place a cap on spending growth of eight per cent per year.\n\n\n\n\n\nBut the minister said the existing level of growth was unsustainable and a cap of between five and six per cent would be more effective.\n\n\n\n\n\n\"After we achieve our current target, a further wave of reform will be needed to get growth down to a more sustainable position,\" he said.\n\n\n\n\n\n\"There's no significant change in disability prevalence in the community, and the scheme is now fully rolled out. So growth should really reflect unit price inflation plus growth in Australia's population.\"\n\n\n\n\n\nAutism peak body Aspect said families needed the right level of support.\n\n\n\n\n\n\"Given the number of autistic children we support through our schools and therapy programs, families must have confidence there will be continuity of supports, real choice and control, and no gaps during the transition,\" chief executive Jacqui Borland said.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/bush-medicine-program-helping-keep-knowledge-and-culture-alive-for-future-generations/g07e9seye",
        "title": "Bush medicine program helping keep knowledge and culture alive for future generations",
        "publish_date": "Wed, 20 Aug 2025 09:23:37 +0000",
        "category": "lifestyle",
        "authors": [],
        "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT:\n\n\n\n\n\n\"(Yolngu dialect phrase) ... I will say Gululu, Gululu, Gululu. Which means welcome, welcome, welcome to this beautiful land of ours.\"\n\n\n\n\n\nOn-country in the Northern Territory's northeastern Arnhem Land region, Yolngu elder Mayalil Marika is sharing her knowledge of bush medicine with students close to graduating from university.\n\n\n\n\n\nIt's a visceral learning experience - using the senses to learn: smelling, tasting and listening.\n\n\n\n\n\nMayalil Marika: \"(Yolngu dialect phrase)...it's bush medicine. We eat them, raw or we make juice. And it's for flu. Any flu. And, have a smell... \"\n\n\n\n\n\nStudent: \"It's very strong.\"\n\n\n\n\n\nMayalil Marika: \"It is very strong. It's bush medicine.\"\n\n\n\n\n\nThe students learn the Indigenous names for the plants and their uses - knowledge that is closely connected to the land and the oral traditional of learning.\n\n\n\n\n\n\"The (Yolngu dialect name for a specific tree) trees are here. It is everywhere. The outer bark is used for painting. Maybe you have come across the paintings around the camp, the shelters? It is used from (made from) bark. But it is the inner part that was used when we had the COVID, flu, itchy throat. Your whole body. It can heal you. And it goes real deep. But you will have a taste of it.\"\n\n\n\n\n\nThe students are part of a bush medicine two-way learning program run through Flinders University in South Australia.\n\n\n\n\n\nThe learning can take last for six weeks or six months.\n\n\n\n\n\nMayalil Marika says she sees her teaching as an important way of keeping First Nations knowledge and culture alive for future generations.\n\n\n\n\n\n\"It is the stories of the waterways. The fresh water and the salt water. And the songlines that are connected to each and every tree. Everything blends.\"\n\n\n\n\n\nA final year nursing student at Flinders University, Wiradjuri woman Sarahjane Salmon says it has been an honour to learn about Yolngu ways of health and healing.\n\n\n\n\n\n\"The wisdom is beyond anything you can imagine. It is amazing being able to go out - and go out bush - and listen to their stories and their families; and their history. And it is amazing. There is no experience like it. And I feel so grateful to be part of it, yeah.\"\n\n\n\n\n\nShe says the perspective is something she will inform her approach to treating patients going forward.\n\n\n\n\n\n\"I believe that nursing and health science and medicine is all about patient-centred care and holistic care. So being in community and really bonding and connecting with community from the roots is where it starts; and how you make those relationships and connections.\"\n\n\n\n\n\nPhysiotherapy student Tameka was able to join the program as part of partnership with the University of Canberra.\n\n\n\n\n\nShe says the experience has been eye-opening.\n\n\n\n\n\n\"There is a couple of programs. There is a lot of chronic kidney disease. So just over this weekend, I have met people that doing research in renal disease - and through that I have now got research papers that have been made and done on Indigenous community to prevent renal failures. And how to keep them active while doing dialysis and things. So just this event - with the networking and meeting new people. And having a yarn to different people has just been so great in so many different aspects.\"\n\n\n\n\n\nCompared with the general population, Aboriginal and Torres Strait Islander peoples are five times more likely to develop kidney disease; and four times more likely to die from kidney disease.\n\n\n\n\n\nTameka says she will be taking the insights into her final placement at a hospital in Canberra.\n\n\n\n\n\n\"It has just been a completely different way of treating. You've got the clinical side of the way we've been taught; and the way we think and things like that. But having to bring that into the culture aspect has been really interesting. Understanding the difference between the men and women and the way they function together and separately. And what can and can't be done together, is just incredible. And trying to work out different ways of how to interpret that; and how to get it working within the community.\"\n\n\n\n\n\nLarrakia traditional owner Richard Fejo is the senior elder on campus at Flinders University.\n\n\n\n\n\nAs a member of Stolen Generations, he is passionate about improving the health outcomes of Indigenous Australians, who die between - on average - between 8 and 9 years** earlier than the wider population.\n\n\n\n\n\nHe says he has taken immense joy out of seeing the students graduate with bush medicine knowledge.\n\n\n\n\n\n\"I think it is really important to actually demonstrate that. We actually have a beautiful culture. So out here Yolngu talk a lot about kinship. And this is a system that most Australians are unaware of. But through the systems we are able to interact better with Aboriginal people and Aboriginal patients. And if a doctor has an understanding of this, we are then setting a standard that can be applied across the board in different disciplines for better interactions with Aboriginal people, amounting to better outcomes across the social determinants of health.\"\n\n\n\n\n\nAnd he says he is already seeing change.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/how-the-us-economy-is-affecting-australias-reporting-season/oelntf06y",
        "title": "How the US economy is affecting Australia's reporting season",
        "publish_date": "Wed, 20 Aug 2025 08:19:41 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/permanent-migrants-in-australia-are-working-below-their-skill-level/4dkyi1crv",
        "title": "The employee skills 'mismatch' leaving Australia $9 billion poorer each year",
        "publish_date": "Wed, 20 Aug 2025 07:20:52 +0000",
        "category": "finance",
        "authors": [],
        "text": "More than half a million permanent migrants in Australia are working below their skill level, despite concerns that widespread workforce shortages are impeding productivity.\n\n\n\n\n\nIt's a topic of discussion this week, as 30 leaders from business, unions and civil society convene in Canberra to debate the country's economic future.\n\n\n\n\n\nFormer Treasury secretary Martin Parkinson, who presented on skills at the roundtable this week, said there was agreement on the need for skilled workers, but how to achieve that remains a challenge.\n\n\n\n\n\n\"It's about how we break down the barriers. Everybody at the roundtable today could see the benefits of building better systems for workers and what skilled immigration can bring to the table. The challenge is how to operationalise it,\" he said.\n\n\n\nREAD MORE What is the economic reform roundtable and what will it achieve?\n\nSkilled migrant 'mismatch'\n\nIn its submission to the roundtable, the Activate Australia's Skills campaign has suggested that a national governance system for all overseas skills and qualifications recognition is needed.\n\n\n\n\n\nActivate Australia's Skills is an alliance campaign of businesses, unions, social services and community groups pushing a skills and qualifications recognition policy.\n\n\n\n\n\n620,000 permanent migrants are currently working below their skill level in Australia, according to government figures.\n\n\n\n\n\nDane Moores is the head of strategic relations at Settlement Services International and is also the campaign manager for Activate Australia's Skills.\n\n\n\n\n\nHe told SBS News migrants face a range of obstacles to finding employment.\n\n\n\n\n\n\"It's what we call the migrant skills mismatch,\" he said.\n\n\n\n\n\n\"Some of the barriers include a lack of local work experience, limited professional networks and social capital in some cases, language barriers, and in many cases, discrimination in the labour market.\"\n\n\n\n\n\nHe said blind resume testing showed applicants with non-Anglo names were 57 per cent less likely to be considered for leadership positions in Australia, despite identical resumes.\n\n\n\nLISTEN TO Change Agents: Overcoming the employment stumbling block facing many migrants SBS News 08:12 English\n\nMoores said the group has a number of recommendations to improve the skills recognition process.\n\n\n\n\n\n\"We're calling on the government to provide financial support for those migrants who can't afford to go through the system. And secondly, to reduce information barriers by creating an online portal with all the information migrants need to get their skills and qualifications recognised.\"\n\n\n\n\n\nThe organisation's research has found Australia's economy could grow by $9 billion every year or $25 million a day if the skills of migrants were put to better use.\n\n\n\n\n\nThere are currently 39 skilled migration assessing authorities approved to undertake assessments for 650 occupations, according to the Australian Council of Trade Unions (ACTU).\n\n\n\n\n\n\"Current skill assessment processes are expensive, complex, lack transparency, and prevent migrant workers from having equal employment opportunities,\" the ACTU told SBS News in a statement.\n\n\n\n\n\n\"Thousands of people are being needlessly locked out from filling skills shortages due to barriers unrelated to their skills: excessive fees, bureaucratic red tape, and slow and confusing processes throughout the skills recognition system.\"\n\n\n\nCritical sector hampered by 'red tape'\n\nSectors that rely on engineers to support construction and infrastructure have been a focus of the roundtable.\n\n\n\n\n\nEngineers Australia, which does skills recognition for overseas-born engineers, estimates that two-thirds of Australian-born engineers are working directly in engineering roles, compared with half of overseas-born engineers working in engineering roles.\n\n\n\n\n\nThe organisation says its recent research found some 47 per cent of migrant engineers actively seeking a job in the sector are unemployed.\n\n\n\n\"Engineers Australia welcomes efforts to make skills recognition clearer and more consistent, but it has to be profession-specific. Alongside recognising overseas qualifications, the real challenge is getting national harmony and consistency across states and territories,\" Engineers Australia CEO Romilly Madew told SBS News.\n\n\n\n\n\nMadew added that the government needs to address \"the red tape\" around licensing and registration between different states, to better realise the \"full benefits\" of the engineering workforce.\n\n\n\n\n\nA spokesperson for the Skills and Training Minister, Andrew Giles, told SBS News the government is \"already doing critical work\".\n\n\n\n\n\n\"Programs like Free TAFE have provided the opportunity for hundreds of thousands of people to upskill in areas where we need more workers – including in housing construction, nursing and aged care.\n\n\n\n\n\n\"On top of that, our Government’s Advanced Entry Trades Training program will see the skills of 6,000 people recognised.\"\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/daryl-maguire-jailed-misleading-icac/gfh2xsdax",
        "title": "Former MP Daryl Maguire sentenced to 10 months' jail for misleading evidence at ICAC",
        "publish_date": "Wed, 20 Aug 2025 02:31:07 +0000",
        "category": "finance",
        "authors": [],
        "text": "A high-profile former MP has been sentenced for misleading a corruption probe about potential profits from a major property deal, before being released on bail about an hour later.\n\n\n\n\n\nDaryl Maguire, known for his secret relationship with Gladys Berejiklian while she was NSW premier, was sentenced to 10 months in jail, with a non-parole period of five months, on Wednesday.\n\n\n\n\n\nThe former NSW MP was found guilty of giving misleading evidence at an Independent Commission Against Corruption (ICAC) inquiry into a Sydney council in 2018.\n\n\n\n\n\nMaguire was granted bail about an hour after being taken into custody on Wednesday. An appeal has been launched against his conviction and the sentence imposed.\n\n\n\n\n\nThe misleading evidence canvassed Maguire's dealings with former Canterbury City councillor Michael Hawatt on a potential property development, in which Maguire could have received about $720,000 in commission.\n\n\n\n\n\n\"His evidence — there was nothing in it for him — was misleading,\" Sydney magistrate Clare Farnan said when sentencing Maguire on Wednesday.\n\n\n\nThe misleading evidence concerned Daryl Maguire's dealings with former Canterbury City councillor Michael Hawatt on a potential property development, in which Maguire could have received about $720,000 in commission. Source: AAP / Dean Lewins \"In fact, he expected to receive part of a commission if the property was sold,\" Farnan said.\n\n\n\n\n\nShe said it was difficult to determine the long-time Wagga Wagga MP's motivation, as Maguire maintained his innocence and did not give evidence about why he gave the misleading evidence.\n\n\n\n\n\n\"Mr Maguire was clearly trying to protect his reputation, possibly amongst other things,\" she said.\n\n\n\n\n\nMaguire has not demonstrated any remorse, the magistrate said. But she found he had good prospects of rehabilitation and was unlikely to reoffend.\n\n\n\n\n\nFarnan said she would have imposed a 12-month term but for an almost five-year delay in prosecuting the offence.\n\n\n\nDaryl Maguire made headlines in 2020 when it emerged he had been in a secret relationship with former NSW premier Gladys Berejiklian. Source: AAP / Dean Lewins Former deputy prime minister Michael McCormack provided a letter of support for Maguire, telling the court of his hard work ethic and ongoing efforts to benefit the community.\n\n\n\n\n\nMaguire served in the NSW coalition governments until his retirement in 2018.\n\n\n\n\n\nHe made headlines in 2020 when it emerged he had been in a secret \"close personal relationship\" for at least five years with Berejiklian while she was treasurer and then premier.\n\n\n\n\n\nIn 2023, the NSW ICAC found Maguire had acted corruptly by misusing his role for his own financial interest.\n\n\n\n\n\nWhile under compulsory examination by the anti-corruption watchdog, Maguire admitted he had sought to \"monetise\" his position as an MP and parliamentary secretary.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.theage.com.au/lifestyle/steptember-2025-is-about-to-kick-off-with-registrations-now-open-20250821-p5mopv.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Steptember 2025 is about to kick off with registrations now open",
        "publish_date": "Thu, 21 Aug 2025 11:59:34 +1000",
        "category": "lifestyle",
        "authors": [],
        "text": "Steptember 2025 is about to kick off with registrations now open\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later. Dismiss\n\nOur network\n\nOpen Navigation Menu The Age",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/business/banking-and-finance/wall-street-giant-targets-australia-s-richest-families-20250819-p5mo14.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Wall Street giant targets Australia’s richest families",
        "publish_date": "Thu, 21 Aug 2025 11:58:29 +1000",
        "category": "finance",
        "authors": [
            "Richard Henderson"
        ],
        "text": "Goldman Sachs plans to expand its private wealth management team in Australia to capture a boom in self-made multimillionaires and family wealth looking for global investments.\n\n“We are absolutely looking to grow,” Jean-Paul Churchouse, the firm’s head of private wealth management for Southeast Asia and Australia, said in an interview. “We are looking to hire, but it’s really about finding the right people rather than hitting a target.”\n\nSoftware giants Canva and Atlassian have minted a younger generation of entrepreneurs including Mike Cannon-Brookes, who are in lucrative targets for the wealth management giant. Credit: Bloomberg\n\nGoldman now has around 13 people on the ground in Sydney and Melbourne, including eight advisers, targeting ultrarich clients that have at least $100 million of investable assets. It established this setup about four years ago, the only private wealth team that was set up in Asia-Pacific during this time, and said it’s only getting started.\n\nThe Wall Street bank is offering Australian investors access to the firm’s network of investment bankers around the world and staff with relationships on otherwise hard-to-access private deals. It’s seeking to get a slice of the wealth opportunity in the country, alongside other foreign banks such as UBS as well as domestic wealth management firms like LGT Crestone, which also target less affluent individuals.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/nrl/nrl-around-the-clubs-round-25-20250817-p5mnjy.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "First time father at 11:55, kick-off at 2: inside Simpkin’s whirlwind Sunday",
        "publish_date": "Thu, 21 Aug 2025 11:56:36 +1000",
        "category": "sports",
        "authors": [
            "Adrian Proszenko",
            "Christian Nicolussi",
            "Dan Walsh"
        ],
        "text": "As noon approached, Simpkin admitted he was getting nervous. “I was like ’12:15 is the cut off love, so you’ve gotta get him out, and you’ve gotta get him out now’,” Simpkin recalled. “She was good about it, she was ‘if he comes, I’m happy for you to go play.’ So that was good. It was an important game for us even though it didn’t go the way we wanted it to, I wanted to play it.” Simpkin, who met Surjan at Clovelly Beach six years ago, said his head was a mess when he ran onto the field.\n\n“I had a good chat to Chez [Daly Cherry-Evans], he was pretty good to me,” Simpkin said. Loading “He just said I’m not a chance today, just take a second and breathe. When you get out there, obviously there were all the formalities at the start of the game, he was just ‘take that time, that minute or two to just have a couple of breaths and just clear your mind before the game.’ “That helped me, I had a couple of moments like that. Everyone was really good, they got me in shape and ready to go pretty quickly, so it was good.” Simpkin said it has been an eye-opening adjustment to footy with fatherhood.\n\n“It’s hard, just the sleep and stuff like that,” he said. “She made me do the first nappy, it is disgusting …I was saying to her if we did this at the start of the year, I would have struggled just with the sleep and adjusting to everything. “Hopefully we win all of our games and see what happens, but if that doesn’t happen, we’re pretty close to the end of the season, so it’s not too bad anyway.” Graham still in pain but keen to rush field for Johnston’s try milestone Campbell Graham’s back injury has been so painful that the South Sydney centre struggles getting out of chairs and driving long distances. But it won’t stop him being the first one running onto the field when teammate Alex Johnston finally breaks the NRL’s try-scoring record.\n\nJohnston needs four more tries to pass Ken Irvine’s mark of 212 four-pointers, but time is running out for the winger to enter rarefied air this season. The 15th-placed Rabbitohs host St George Illawarra on Thursday night for their penultimate game before facing bitter rivals Sydney Roosters after a bye. Souths officials have publicly urged fans not to storm the field once Johnston finally breaks the record, as supporters did when AFL star Lance Franklin kicked his 1000th goal in 2022. But teammates could be a different matter, with Graham keen to run through his pain and show Johnston some love.\n\nInjured Rabbitohs centre Campbell Graham. Credit: Kate Geraghty “Absolutely I would, I’d try to be the first one there to cuddle him. Obviously it’s a matter of when, not if, so we’ll just see how it plays out,” Graham said. “It’s been a monkey on his back for a couple of years now. “It’s such a great achievement, not only in our game but in Australian sport to have a record like that. It really couldn’t happen to a better person.” Seeing his mate break the record would be a rare bright spot in a tough season for Graham, who has been troubled by a bulging disc in his back since March. The 26-year-old initially needled up to play but has been sidelined since round 18 and will not line up again this year.\n\nRabbitohs try-scoring sensation Alex Johnston. Credit: Getty Images The injury is unlikely to require off-season surgery but has nevertheless been “pretty rough” for Graham to handle. Loading “Simple things like driving long distances is not great, getting up out of chairs, stuff like that. It isn’t ideal, day to day,” Graham said of his pain. “It does get you pretty down, even just day to day, dealing with a chronic issue like that. My focus is just to get on top of this, not only for footy but for myself as well. At the moment, the goal is to be back fit and training by pre-season.”\n\nAnother disrupted year was a tough pill to swallow for Graham, who had been hampered by a sternum injury across the previous two seasons. The sternum issues forced Graham to withdraw from NSW’s squad for the 2023 State of Origin series opener and eventually sidelined him from Souths’ entire 2024 campaign. But Graham is hopeful his luck will turn in 2026, when Souths will fight to recover from a season of injury horror across the board. “That’s something that helps me in my mindset, that although I’ve had a pretty unlucky run the last couple of years I know things will get better,” he said. “I know if I keep doing the right things, I’ll give myself every chance to be fully fit by pre-season.” AAP Murray lifting training standards as Rabbitohs get their groove back\n\nChristian Nicolussi Cameron Murray has been credited with helping South Sydney win their past two games, simply by returning from injury and lifting the standards at training. The Rabbitohs’ skipper was not named to return from an Achilles injury for Thursday night’s clash against St George Illawarra, while Latrell Mitchell was also left off the team sheet as he continues to battle a nerve issue in his back. The sight of Murray back in full training at Heffron Park has been the circuit-breaker the Bunnies needed, according to injured representative centre Campbell Graham.\n\n“The way he leads and communicates with the boys out there, you can see training has gone up a gear,” Graham said. “In all honesty, I think he has helped contribute to our wins the last couple of weeks, just with his presence. “Cam is giving himself every opportunity to get back and play. The medical staff aren’t pushing him, but Cam is his own man, and if he feels like he’s ready, he’ll push to play. Souths skipper Cameron Murray Credit: NRL Images “Just seeing someone like that and how dedicated he is to his rehab, how professional he has been about the whole thing – he hasn’t left any stone unturned – it’s pretty admirable.”\n\nMurray and Mitchell went down within minutes of each other in the pre-season, with the captain rupturing his Achilles tendon. He wants to play in the last round against the Sydney Roosters if fit, and has the full blessing of coach Wayne Bennett. The easy thing would be to keep Murray on ice and let him be fresh for day one of 2026 pre-season training, but as Bennett said recently, “He wants to reward himself for nine months of rehab. Even if it’s just a couple of games, it’s a game he loves, and it’s something he hasn’t been able to do.” Mitchell has also had an injury-interrupted year, with the latest back injury forcing him to miss another week. With the bye next week, he is also a chance to return for the Roosters. Campbell Graham helps launch the Telstra Footy Country Round at East Hills on Tuesday. Credit: Kate Geraghty/SMH Bennett acknowledged the role Murray had played by being back at training, but was equally complimentary of Mitchell and Cody Walker, who both played big roles in their returns against the Titans and Eels, respectively.\n\n“Cam is a pretty exceptional guy, he’s one of the elite players in the game with his attitude, and everything he does is at 100 per cent,” Bennett said. “We appreciate him being back at training, but the wins also come down to having quality players on the field. Cody and Latrell have played the last two weeks; they’ve been really good for us and made a difference.” Meanwhile, Graham, who missed all of last year with a sternum injury, then broke his hand in the off-season, injured his calf in round three, and has not been sighted since round 18, confirmed a back complaint had left him with mental demons. He has avoided surgery and been limited to pilates, swimming and physiotherapy, with the aim of resuming running in the pre-season.\n\n“It doesn’t leave you in a good headspace, especially after the year I had last year, it’s just been very stop-start,” Graham said. “Not feeling at your physical best for such a long time, it gets pretty draining.” In team news, Isaah Yeo has been named on an extended bench for the Panthers when they host Canberra in Mudgee on Friday, Ryan Papenhuyzen (concussion) was listed in jersey No.21 for Friday night’s Storm clash with the Bulldogs, Sydney Roosters winger Daniel Tupou (concussion) is replaced by Junior Tupou for their trip to Parramatta, while Krystian Mapapalangi is the centre named on the Wests Tigers’ extended bench in case Starford To’o (shoulder) is not fit. A summer to relish breaking Irvine’s record sits fine with AJ Alex Johnston hopes to break Ken Irvine’s all-time try-scoring record at the start of next season – not in the coming weeks – so he can have all summer to savour the prospect of achieving the historic feat. Johnston failed to add to his career tally against Parramatta on the weekend to remain on 209 tries, three shy of Irvine’s long-standing mark.\n\nThe player marking him on Thursday night, when the Rabbitohs take on St George Illawarra, will be former Rabbitoh Corey Allan, who gave Johnston the easiest try of his career in the final round of 2020. Johnston needed five tries in the final round to finish as that year’s top try-scorer, and Allan got across the line, only to wait for Johnston to catch up to him and give him the ball to score. Allan said he was yet to receive the carton of beer Johnston had promised. “I’m still waiting for that case – it will be interesting to see if it ever rocks up at my doorstep,” Allan said. “I could have scored that night, but I thought I better look behind me to see if he was coming. He needed five to draw level with Kyle Feldt [on the top try-scorers list]. Lo and behold, he was screaming my name, and his eyes lit up when I turned around. The rest is history.\n\n“I don’t think the record will be broken again. ‘AJ’ is a special player.” Alex Johnston and Corey Allan celebrate that try in 2020. Credit: Getty Images Johnston said of Allan: “Hopefully he can help me with a couple of more tries this weekend.” South Sydney coach Wayne Bennett said after the win over the Eels that the likely return of Latrell Mitchell to left centre would help Johnston in his quest to break the record. “I love playing with ‘T-Mitt’ [Mitchell],” Johnston said. “Cody Walker has given me most of my tries, but Trell would be the second most.\n\n“I sort of only want to get three tries this year, that way I’ve got the whole off-season and the lead-up [to] next year to try and get it in round one. A hat-trick this weekend will see Alex Johnston draw level with Ken Irvine’s long-standing try record. Credit: Getty Images “I’ve been thinking about what I should do [to celebrate]. I’ll have to do something.” Souths have asked fans not to storm the playing pitch when Johnston reaches the milestone, but the winger has other ideas. “I think it will happen, and the NRL and Souths will have to be prepared for it to happen,” Johnston said.\n\n“There were pretty crazy scenes in the AFL when [Sydney Swans forward Lance] Buddy Franklin [kicked 1000 goals], so there will be a lot that goes on behind the scene to make sure it is safe. I’m all for it. I think the NRL will need to prepare for it.” The Bunnies are chasing three straight wins, while the Dragons need three replacements, for Jack de Belin, Hamish Stewart and Hame Sele, who were all ruled out with category-one concussion symptoms on the weekend. Why Haas chose Samoa Dan Walsh Queensland Origin centre Rob Toia will prioritise his Tongan heritage over a potential Ashes tour berth as fellow Kangaroos defector Payne Haas declared Samoa now has the playing stocks to win next year’s World Cup.\n\nHaas confirmed on Sunday his switch of allegiance to the rising Pacific nation, with high hopes that fellow Australian stars Tino Fa’asuamaleaui and Hamiso Tabuai-Fidow do the same for this year’s Pacific Championships. Tonga’s October 26 clash with Samoa at Suncorp Stadium is predicted to draw one of the best Test attendances in decades on Australian soil and outsell the 33,196 who turned out for Australia’s win over the Mate Ma’a in Brisbane last year. Toia’s decision to represent his family’s Tongan roots does, however, take another outside back option off the table for Australia’s three-Test tour of the UK in October and November. Big names Latrell Mitchell and Tom Trbojevic loom as the Kangaroos’ first-choice centre pairing for the first Ashes tour since 2003. However, both have been hampered by injury as South Sydney and Manly have struggled this season, and arguments could be made for them focusing on club commitments given their injury histories.\n\nToia’s rise as a rookie of the year contender and an eye-catching debut Origin series keeping Mitchell quiet had him in Kevin Walters’ sights, particularly given Stephen Crichton (Samoa), Valentine Holmes (torn rotator cuff) and Campbell Graham are unavailable for Australia. Rob Toia has committed to Tonga at the end of the season. Credit: NRL Photos Like Tabuai-Fidow, Brisbane’s Kotoni Staggs is still considering whether he makes himself available for Australia or Tonga at season’s end. Melbourne’s Xavier Coates, Canterbury’s Matt Burton and Jacob Kiraz, Parramatta’s Zac Lomax and Josh Addo-Carr, and Roosters rugby convert Mark Nawaqanitawase loom as Australia’s other leading three-quarter options. Under current international eligibility rules, Toia’s opting to play for Tonga after coach Kristian Woolf got in contact won’t preclude him from representing Australia or New Zealand (where his father was born), just as Haas’s call won’t impact his NSW Origin career.\n\n“Woolfy reached out, and I responded. I was very surprised to be honest, but I told him I’d love the opportunity to play for Tonga if he was to choose me,” Toia said. Payne Haas has confirmed his allegiance switch to Samoa. Credit: Getty Images “I had a chat with my parents about it, telling them that opportunity was there, and they were over the moon. My grandparents on both sides have lived in Tonga the majority of their lives, so they were probably the happiest. They were telling me they can’t wait to see me represent them if that happens.” League Immortal Andrew Johns on Sunday likened Haas’s decision to represent Samoa to Jason Taumalolo’s generational switch to Tonga for the 2017 World Cup. Haas said he was inspired by the North Queensland veteran’s move, though he was reluctant to put public pressure on Fa’asuamaleaui to follow his lead.\n\n“Hopefully, we get a few more boys over, but they have to follow their heart and do what’s right for them,” Haas said. “To play with [Fa’asuamaleaui] would be special. I hope he makes the switch.” Haas said on Sunday that new Australian coach Walters was understanding of his decision, which was first set in motion when he played against Samoa in 2023, and the island’s national anthem played. Haas, Crichton, Jarome Luai, Brian To’o and Terrell May headline an already star-studded Samoan contingent under coach Ben Gardiner, prompting Haas’s prediction of World Cup glory at next year’s tournament. “I feel like we can win it, especially with the team we have got now,” Haas said.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/lifestyle/steptember-participant-sean-explains-why-he-s-taking-part-of-his-year-s-fundraiser-20250821-p5mopo.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Steptember participant Sean explains why he’s taking part of his year’s fundraiser",
        "publish_date": "Thu, 21 Aug 2025 11:55:39 +1000",
        "category": "lifestyle",
        "authors": [],
        "text": "Steptember participant Sean explains why he’s taking part of his year’s fundraiser\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/car-stolen-from-melbourne-with-familys-luggage-and-passports-inside-20250821-p5mopn.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Car stolen from Melbourne with family's luggage and passports inside",
        "publish_date": "Thu, 21 Aug 2025 11:54:41 +1000",
        "category": "finance",
        "authors": [],
        "text": "Car stolen from Melbourne with family's luggage and passports inside\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/politics/federal/every-number-you-just-said-is-wrong-chalmers-o-brien-brawl-behind-closed-doors-20250821-p5mop1.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘Every number you just said is wrong’: Chalmers, O’Brien brawl behind closed doors",
        "publish_date": "Thu, 21 Aug 2025 11:54:40 +1000",
        "category": "finance",
        "authors": [
            "Paul Sakkal",
            "Shane Wright"
        ],
        "text": "Treasurer Jim Chalmers and shadow treasurer Ted O’Brien have fought over government spending inside the high-powered economic roundtable on Thursday morning.\n\nAt the opening of a session on fiscal management, the Coalition representative at the government-run summit made his major first intervention in the three-day event, accusing Chalmers of over-spending and baking in long-term deficits.\n\nTreasurer Dr Jim Chalmers takes his seat during day three of the Economic Reform Roundtable. Credit: Alex Ellinghausen\n\nA source familiar with the conversation, unauthorised to disclose it publicly, said the argument became “heated”. NSW Treasurer Daniel Mookhey, who was due to speak next, stepped in and encouraged the pair to move on from the debate.\n\n“Jim [Chalmers] got very defensive and said, ‘We’re not in question time, Ted’,” the source said.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/nsw/how-merivale-s-powerful-political-ties-helped-move-a-light-rail-stop-20250820-p5mobx.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "How Merivale’s powerful political ties helped move a light rail stop",
        "publish_date": "Thu, 21 Aug 2025 11:49:38 +1000",
        "category": "finance",
        "authors": [
            "Eryk Bagshaw"
        ],
        "text": "Merivale has denied the allegations and accused this masthead of malicious journalism. “Merivale is and has always constantly strived to improve its workplaces and services,” Merivale’s lawyers said in July. Fair Work has launched an investigation into the company. One Transport NSW proposal contained in the documents shows the centre of the light rail stop covering Palings Lane, which divides Merivale’s CBD headquarters. But the proposed stop would have blocked access to Merivale’s Ivy restaurant precinct, which houses restaurants Uccello and Felix as well as its VIP club Level 6. The Wynyard light rail stop out the front of Merivale venues. Credit: Edwina Pickles Instead, the light rail stop was constructed further away from Wynyard and closer to Angel Place, allowing Merivale to expand its al fresco dining outside its restaurant Totti’s. Merivale was also able to secure a “super taxi rank” on Pitt Street to ferry customers away from the Ivy. The company did not respond to requests for comment about its lobbying of Transport for NSW. A spokesperson for Transport for NSW said a wide range of factors were considered during the planning of the major new public transport project, which had an extensive and lengthy design process, involving public consultation and stakeholder feedback.\n\n“Transport considered a variety of locations for the Wynyard Light Rail stop and its design went through a number of iterations throughout the planning process,” the spokesperson said. “Factors taken into consideration included pedestrian safety, crowding, traffic, road interfaces, platform size, positioning in relation to train stations and other key infrastructure, drainage, accessibility and distance to locations and services.” The construction of the light rail was dogged by repeated delays, legal battles and prolonged disruption, leaving smaller businesses struggling to survive with debts of up to $500,000. Emanuel Tzirtzilakis, the owner of a cafe on Devonshire Street in Surry Hills, told a NSW Parliamentary inquiry in 2018 that he had been driven to the “brink of financial ruin” by the project.\n\nConstance led a $31 million compensation scheme for some businesses, but others have taken their claims to the High Court after the NSW government won an appeal against further compensation in 2023. Constance became closer to Hemmes as the hospitality baron expanded his empire into Narooma in Constance’s electorate of Bega. Hemmes bought the Glasshouse Rocks estate in 2017 and now owns four venues and several expansive waterfront properties. Loading The former transport minister, who declined to comment, was regularly seen at events at the Ivy, including parties hosted by Liberal lobbyist and Hemmes’ political consigliere Michael Photios, who ensured the 52-year-old’s relationships reached the top of the Liberal Party. In January 2022, two days after New Year’s Eve, NSW Premier Dominic Perrottet scheduled a meeting with Hemmes at Constance’s home, a separate set of documents released under freedom of information laws reveals.\n\n“7:30pm Private Drink-Dinner: Premier/Andrew Constance/Justin Hemmes,” the calendar invite from Perrottet shows. “Where: Andrew Constance Property”. When the trio met up, it was not at Constance’s home in Moruya but Hemmes’ 60-hectare mansion in Narooma. The scheduled meeting was never disclosed in the premier’s ministerial diary entries. The rules governing ministerial diary entries do not require ministers to disclose social events but cautions them to make public any “substantive discussion of issues” that may be considered by the minister. The documents show Hemmes would personally email Perrottet’s office to request meetings, including one to discuss Merivale’s unsolicited proposal for the commercial development of Hunter Street metro station, which went ahead on 14 December 2021 and was disclosed in ministerial diary entries.\n\nBut another titled “6pm catch up. Justin Hemmes” on September 15, 2022 at his restaurant Felix, was not disclosed. The former premier declined to comment. In his previous role as state treasurer, Perrottet became a key supporter of ending the lockout laws that had dented Hemmes’ hospitality empire and put restrictions on the wider industry. Perrottet appointed the billionaire to his Treasury advisory council in 2018. As premier, Perrottet described him as a “pub doyen” in 2021 and lauded him for his plans to revitalise the CBD. During the COVID-19 pandemic, Perrottet and Hemmes unsuccessfully lobbied then federal treasurer Josh Frydenberg, one of Hemmes’ close friends, for an extension of JobKeeper and pushed for a repeal of the fringe benefits tax to encourage corporate long lunches. Perrottet arrives at the Ivy in August 2024 with his wife Helen. Credit: Wolter Peeters After Constance resigned as transport minister and triggered a by-election in Bega in 2022, a briefing from Perrottet’s office spruiked Hemmes’ establishments in Narooma during a campaign stop to highlight a $4 million upgrade to Narooma wharf, which helps service Merivale venues and other restaurants in the southern inlet.\n\nWhen Perrottet resigned as premier in 2023, he had a three-hour lunch at Hemmes’ restaurant Felix. A year later, when he left state parliament, the Ivy and the penthouse that is home to the infamous private members club, Level 6, hosted Perrottet’s farewell. Merivale paid for the former premier’s send-off. The gift did not need to be disclosed because Perrottet left parliament that day. Ministerial diaries show the former state Liberal government had 20 meetings with Merivale between 2019 and 2023, involving the premier, police minister, transport minister, and treasurer. NSW Labor Premier Chris Minns has had two meetings with Merivale since being elected in 2023. Hemmes and his companies have donated more than $350,000 to the Liberal Party since 2018, Australian Electoral Commission records show, while hosting fundraisers with prime ministers at his mansion, the Hermitage, now estimated to be worth $200 million, as part of his decade-long campaign for greater political influence. Internal messages show the company has also targeted men with political capital, including former chiefs of staff in the state government, for special treatment by offering them complimentary Level 6 memberships.\n\nLoading In 2021, Merivale secured one of the biggest government catering contracts in the state: a six-year multimillion-dollar deal under a competitive tender by the Liberal government run by Venues NSW to provide food and drinks at two of Sydney’s largest stadiums, the SCG and Allianz. The state Labor government has put the company on notice, signalling that any plans to renew the contract are under threat following the allegations of exploitation, harassment and underpayment revealed by this masthead. “We should make sure that we do everything we can to keep workers safe, particularly young women workers who are vulnerable to exploitation in these circumstances,” NSW Legislative Council member Dr Sarah Kaine, the government’s procurement inquiry chair, said in July. The company is also in a $124 million dispute with the state government over the compulsory acquisition of two properties it bought opposite Wynyard Station for $77 million in 2018, which it had planned to turn into “Ivy 2.0” as part of its $3 billion property empire.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/australia-news-live-israel-calls-on-60-000-reservists-for-full-gaza-offensive-tax-reform-to-be-discussed-on-final-day-of-roundtable-20250821-p5moli.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Australia news LIVE: Israel calls on 60,000 reservists for full Gaza offensive; Tax reform to be discussed on final day of roundtable",
        "publish_date": "Thu, 21 Aug 2025 11:48:23 +1000",
        "category": "finance",
        "authors": [
            "Daniel Lo Surdo"
        ],
        "text": "The Commonwealth Bank has reversed a decision to cut 45 call centre jobs as it rolls out an artificial intelligence-powered chatbot, admitting it made a mistake and failed to properly consider “all business considerations” when it made the cuts.\n\nCBA last month said it was introducing a new system that would automate simple queries from customers to its call centres, and this meant it no longer needed 45 positions.\n\nCommonwealth Bank chief executive Matt Comyn. Credit: AFR\n\nHowever, the Finance Sector Union (FSU) said their members then struggled with a rising volume of calls, and management needed to scramble by offering overtime and pulling team leaders onto the phones.\n\nAfter a dispute at the Fair Work Commission and pressure from the union, the bank has now backflipped and will allow the workers to keep their jobs, a move that was first reported in the Australian Financial Review.\n\nCBA on Thursday confirmed the change, saying it would now give the affected 45 staff the choice of staying in their current jobs, taking a redundancy or pursuing redeployment within the bank.\n\nThe bank is still using the chatbot and rolling out other AI technology – indeed, investment in AI was a top priority for chief executive Matt Comyn at its latest results.\n\nFSU national secretary Julia Angrisano. Credit:\n\nFSU national secretary Julia Angrisano said the backflip was a massive win for the workers, and members wanted to be part of the conversation about how technology was used in banking.\n\n“CBA has been caught out trying to dress up job cuts as innovation. Using AI as a cover for slashing secure jobs is a cynical cost-cutting exercise, and workers know it,” Angrisano said.\n\nA CBA spokesman admitted the mistake, said it had apologised to staff and it was reviewing its internal processes.\n\n“CBA’s initial assessment that the 45 roles in our Customer Service Direct business were not required did not adequately consider all relevant business considerations and this error meant the roles were not redundant,” he said.\n\n“We have apologised to the employees concerned and acknowledge we should have been more thorough in our assessment of the roles required … we are also reviewing our internal processes to improve our approach going forward.”",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/racing/waller-backs-via-sistina-to-handle-heavy-challenge-in-winx-stakes-defence-20250821-p5momg.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Waller backs Via Sistina to handle heavy challenge in Winx Stakes defence",
        "publish_date": "Thu, 21 Aug 2025 11:46:03 +1000",
        "category": "sports",
        "authors": [
            "Craig Kerry"
        ],
        "text": "Chris Waller believes Via Sistina will thrive “getting into the ground” in the Winx Stakes at Randwick on Saturday, despite the superstar mare failing in her only attempt on heavy going.\n\nAnd the premier Sydney trainer is looking to the Irish-bred eight-year-old’s European form, and a tip from star English jockey Ryan Moore as evidence.\n\nVia Sistina and Kerrin McEvoy charge home in the 2024 Winx Stakes. James McDonald has the ride on Saturday. Credit: Getty Images\n\nVia Sistina, destined to be crowned Australian horse of the year after a record-equalling seven group 1 wins last season, is set to resume in the 1400m Winx Stakes on Saturday, although heavy rain this week and forecasts for more showers on Friday and Saturday have raised questions about the meeting going ahead, and which stars will line up if it does.\n\nThe opening group 1 of the season has a field of 12, including five from the Waller stable.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/lifestyle/fashion/the-women-shortlisted-to-replace-anna-wintour-at-vogue-20250821-p5momh.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "The women shortlisted to replace Anna Wintour at Vogue",
        "publish_date": "Thu, 21 Aug 2025 11:44:13 +1000",
        "category": "lifestyle",
        "authors": [
            "Laura Craik"
        ],
        "text": "“No one can replace Anna” has long been the refrain among fashion’s highest echelons.\n\nNot being a 500-year-old immortal like the Highlander, however, someone eventually must. Nothing – not even a diet of rare steak and daily tennis – can make a person live forever. And yet, Anna Wintour’s 37-year reign at American Vogue was so formidable that many assumed she might go on editing indefinitely.\n\nWhich is why June’s announcement that she would be stepping back from her day-to-day duties at Vogue came as such a surprise – and why speculation over her successor is now at fever pitch. While Wintour still holds two powerhouse titles – chief content officer of Condé Nast and global editorial director of Vogue – relinquishing the hands-on editorship of US Vogue marks the end of an era. It also signals the fading of a golden age for glossy magazines, when seven-figure salaries, chauffeured limousines and lavish expense accounts were de rigueur.\n\nLauren Sanchez is among the possible candidates tipped to replace Anna Wintour as editor of US Vogue. Credit: Getty Images for amfAR\n\nHer successor, taking on the newly created role of head of editorial content, will face a daunting challenge. With magazine sales in decline, they will need to combine journalistic rigour, marketing acumen and managerial diplomacy with formidable networking skills, elite hosting and fundraising prowess – not to mention the hide of a rhinoceros.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/culture/art-and-design/in-a-first-the-city-s-biggest-cultural-institutions-are-run-by-women-20250707-p5md14.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "In a first, the city’s biggest cultural institutions are run by women",
        "publish_date": "Thu, 21 Aug 2025 11:30:00 +1000",
        "category": "entertainment",
        "authors": [
            "Linda Morris"
        ],
        "text": "Save Log in , register or subscribe to save articles for later. Save articles for later Add articles to your saved list and come back to them any time. Got it Normal text size Larger text size Very large text size The appointment of Maud Page as the Art Gallery of NSW’s first female director in 154 years marks a historic moment for the state’s six galleries and museums. All are now headed by women: Annette Pitman leads Museums of History of NSW; Dr Caroline Butler-Bowdon, the State Library of NSW; Kim McKay, the Australian Museum; Louise Herron, the Sydney Opera House; and Lisa Havilah, the Powerhouse Museum. Last year, their cultural institutions welcomed more than eight million visitors, commanded operational budgets of more than $600 million and employed 2200 full-time staff. They lead in the tricky aftermath of COVID, which temporarily shut their doors, reshaped public buying habits globally and played havoc with the costs of doing business. Audiences are changing, at once more informed, and increasingly sophisticated but also weaned on novelty; time poor and distracted. From left Dr Caroline Butler-Bowdon (State Library of NSW); Maud Page (Art Gallery of NSW); Kim McKay (Australian Museum); Louise Herron (Sydney Opera House); Lisa Havilah, (Powerhouse Museum); Annette Pitman (Museums of History NSW). Credit: Wolter Peeters Their museums and galleries are under pressure to leverage technology and enhance visitor experience, without turning their halls into places of entertainment, or quasi-wedding venues. Many occupy heritage sites built at the high watermark of the British Empire, their collections over-represented when it comes to the works, perspectives and deeds of white men, and all the while their budgets are under pressure, as they seek new funding streams that can bring ethical dilemmas.\n\nAdvertisement\n\nSpectrum sat down with the leaders in the boardroom of the Australian Museum to talk budgets, philanthropy and future directions. Annette Pitman, you lead Museums of History of NSW, but before that, you were chief executive of Create NSW, and you have had the benefit of sitting in on countless budget meetings. Can you set the scene: What is the reality of the financial climate that the state’s major galleries and museums currently find themselves in? Annette Pitman: I think we are in a period of unprecedented demand for what we do. The pandemic really made people appreciate what cultural institutions provide and appreciate the gathering that happens around culture in these spaces. We are incredibly nimble at doing really cutting-edge and meaningful things with small budgets. So we are in a period where we’ll have to be at our most creative. Kim McKay with a favourite object from the Australian Museum collection: a Pormpuraaw Ghost Net sculpture, made from discarded plastic commercial fishing nets, lines and traps. Ghost nets drift in the ocean and create a deadly hazard for marine life before washing up on beaches. In the late 1980s, McKay co-founded Clean Up Australia and saw first-hand the devastation ghost nets cause. Credit: Wolter Peeters Are cultural institutions out of the woods post-pandemic, Louise Herron? Louise Herron: Our audience statistics suggest many of the worst of the COVID impacts are behind us. Even in the current cost-of-living crisis, people will still save up and go to see the performers they love. Since COVID, we have become more intentional and analytical about what we do. People got out of the habit of going out, so we need to be even more conscious of who we are trying to attract – be that children, Pasifika people, contemporary music fans. We keep working to let people know we do a lot more than opera, though opera still accounts for a bit more than 10 per cent of tickets sold. Kim McKay: The fact that we are free for all to come into and enjoy the museum (yes, you pay for special exhibitions and programming) is especially important in a cost-of-living crisis and tight budgets. It’s a way to level the playing field. I see migrant families, three generations in the one family coming in together because all people want their kids to be exposed to knowledge and learning. The Australian Museum brings in one and a half million people a year but imagine if we could reach 10 million people.\n\nAdvertisement\n\nThe Holy Grail for cultural institutions is the 18 to 30-year-olds. How does the Art Gallery of NSW engage with these young adults? Maud Page: Our youth engagement strategy begins in early childhood. [We] do that through artist-led children’s programming, like Hive Festival, which attracted more than 28,000 visitors over one weekend in January. If you bring in children, you bring in their aunties, their cousins, their grandparents and their parents and you provide an experience that resonates with all ages. The magic has to come from education, but people don’t want to be dictated to any more. They want to be enthralled. So in our case, it is all about stepping into experimental music like Grammy Award-winning artist Solange in 2023 and ARIA award-winning Northern Territory rock band King Stingray, who last month attracted more than 6000 visitors to the Art Gallery in one night. Maud Page holds an Aurukun fire stick gifted to her from artist. “It took me a long time to fall pregnant. The fabulous artist Tony Albert had begun at Queensland Art Gallery in the same week as me. After three years working together, in 2005, my daughter Alia was born. Sharing in my exultation, Tony gave me a rare Aurukun fire stick made by Joe Ngallametta. Joe passed away not long after and this beautiful object represented birth and death but also the beginning of a learning journey into the extraordinary world of First Nations art. Credit: Wolter Peeters And yet, your gallery has been accused in the Murdoch press of being too woke. Maud Page: It is a very reductive description of what we do, and I would say every single institution around this table is open and generous and welcoming to everyone. The art gallery showcases such a broad spectrum of artistic voices and contemporary and historical art that offers an enriching experience for all visitors. Writing and reading are somewhat old-fashioned ideas in the internet age, Caroline Butler-Bowdon. How does the state’s oldest library survive? Caroline Butler-Bowdon: Books and stories are just as relevant today and remain at the heart of libraries. But libraries have always evolved, and today they’re also places for creativity, lifelong learning and social connection. People used to go to cathedrals and other sorts of places for a sense of connection but these days they are coming to our institutions for the same experience. We work with the Sydney Writers’ Festival, Sydney Film Festival, Mardi Gras and it’s through partnerships and collaboration that we build audiences, we diversify our audiences. We’ve had a 25 per cent growth in visitation in one year. The core ingredients are essential services, magical experiences and everything in between using social media to share stories, to share our research and depth and drive audiences.\n\nAdvertisement\n\nLouise Herron: You definitely need to have a clear ambition and ours is to be Everyone’s House. Last night, one of Australia’s heaviest metal bands, Parkway Drive, played to a sold-out Concert Hall of 2500 people, backed by a full symphony orchestra. Almost 80 per cent of the audience was new to the Opera House. Some people were so disappointed to miss out on tickets that they came anyway and stood on the Forecourt during the concert, many in black tie. We’re looking for artists or genres that will bring new audiences to the Opera House. And if one of our organisations connects with a new community, it helps all of us. Annette Pitman holds Laminex samples circa 1956. “This post-war period marked a series of shifts in Australian society; housing boom, Australian Dream, kitchen becoming the heart of the home. Laminex was produced in hundreds of colours and patterns; something for every home, and as a result this durable, practical and affordable Australian made product became ubiquitous in our homes.” Credit: Wolter Peeters Lisa Havilah, you are building a cultural institution from scratch on the banks of the Parramatta River. If you build it, will the crowds come? Lisa Havilah: One of the reasons the museum at Parramatta is designed to be so vertical is to give as much green space as is possible back to the community and wrapping around each of the exhibition spaces with public space that will lead to an open rooftop. It’s in the mix of public space, exhibition space, amenity and experience that we hope to make the museum a part of somebody’s everyday life. We are creating exhibitions that people can immerse themselves in in new ways, like working with architects, presenting the collection in new ways that engage young audiences. Because you might come to an exhibition, you might come to have dinner, you might come to just sit in the garden or you might come with your family to sit on the riverbank. Loading So, why do you say the traditional show-and-tell model of programming is on the way out? Lisa Havilah: Museums need to change and move more than they used to. Exhibitions need to change. Stories need to shift and become more relevant. Historically, museum exhibitions have been very didactic, presenting one position on an object or one story. So it’s about giving space for people’s perspectives, their own histories and memories.\n\nAdvertisement\n\nKim McKay: In our early years, our institutions didn’t engage with First Nations people. It’s very different now. Why should we speak for First Nations people when they can speak for themselves? Museums of History of NSW cares for 12 house museums, and a written archive that dates to 1788, the arrival of the First Fleet. Annette Pitman, how do you avoid romanticising the past, and how do you represent an Australia that has changed since the foundational times of those house museums? Loading Annette Pitman: History is messy, right? It’s a multidimensional thing and no matter what topic we might be talking about, with the hindsight of time, we come to understand it differently. I think the public understands this, especially today when we see so much manipulation of the truth. There is value to be found in the information we hold about our past. We’re partnering with the Aboriginal Languages Trust on a wonderful program that supports First Nations teams to go through our archives and identify references to culture and language that aren’t known. So there are ways we can engage without sugar-coating what’s happened and that’s our duty as a public institution. Museums and galleries pitch themselves as places of public trust at a time of misinformation, but do you run the danger of turning culture into a commodity? Annette Pitman: “I don’t think there is anything wrong with making quality content entertaining. We just had a kids program called Beautiful waterways, Stinky Sewers that drew 7000 kids from all over NSW who came to the Tank Stream and learn the history of public sanitation. I think we’re clever enough to navigate that line. Caroline Butler-Bowdon with Dorothea Mackellar’s 1907-1908 poetry notebook from the library’s collection, the only known manuscript of her iconic poem Core of My Heart, later renamed My Country. “The poem is still loved today for its enduring themes, and shows just how powerfully words can spark creativity, stir emotion, and stay meaningful across generations. The same can be said for libraries. What I love is that it was first written when Dorothea was just 19 years old. Our reading rooms are full of young people, studying and creating and it’s nice to think that a future Dorothea indeed could be one of them.” Credit: Wolter Peeters\n\nAdvertisement",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/military-camps-malaria-and-dysentery-how-a-naive-couple-tested-their-love-20250721-p5mgiq.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Military camps, malaria and dysentery: How ‘a naive couple’ tested their love",
        "publish_date": "Thu, 21 Aug 2025 11:30:00 +1000",
        "category": "finance",
        "authors": [
            "Dani Valent"
        ],
        "text": "TV producer PJ Madam, 45, and her 43-year-old partner, Tim Noonan, a documentary-maker, put their relationship to the ultimate test. Now she stays home with their two sons (five years and 10 months) while he creates TV shows.\n\n“We crammed 10 years of arguments into one year – and filmed it,” says Tim Noonan of his “unimaginably testing” time with partner PJ Madam. Credit: Andrew Wilson\n\nPJ: Last night, Tim asked me if we’ll ever have sex again. I was breastfeeding at the time. I wondered, is it a male thing, needing physicality to feel the love? I need to feel the love to be physical. I need a good night’s sleep and a bit of quiet, then I might be in the mood. We’ve worked hard at our relationship and I’m embarrassed to wonder, “Oh, my god, after everything, are we going to lose each other through the chaos of parenthood?”\n\nWe met as reporters on Sunday Night at Channel 7 in 2013. There was an attraction, but I mostly loved how hard he worked. Maybe it’s an in-built evolutionary thing: he’s going to be hunting for me forever. I could see he was a solid person – stable, honest – but I’d been ­married before and I was wary; I carried a huge amount of shame.\n\nAfter a couple of years, Tim decided we needed to explain our relationship to my parents; the next minute, we’re in a car with them. Tim said, “Pull over at the nearest pub, Mr and Mrs Madam, we need to talk to you. I want to be with your daughter forever.” It went so well that now I think they favour him over me! Like me, they saw a man of honour, big on telling the truth; it unlocked a lot of trust.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/nsw/why-rba-s-sydney-office-rebuild-has-landed-it-in-trouble-with-a-court-20250819-p5mo6m.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Why RBA’s Sydney office rebuild has landed it in trouble with a court",
        "publish_date": "Thu, 21 Aug 2025 11:30:00 +1000",
        "category": "finance",
        "authors": [
            "David Barwell"
        ],
        "text": "The Reserve Bank of Australia has a new critic – and this time not mortgage-laden home owners – as a long-planned redevelopment of its asbestos-ridden headquarters has prompted concerns over the impact on one of Sydney’s busiest courthouses.\n\nThe NSW Justice Department has raised alarm bells over plans to revamp the RBA’s Martin Place office tower, fearing noise and vibrations from construction could impede the neighbouring Land and Environment Court.\n\nThe first stage of the RBA’s head office upgrade is due to be determined by the City of Sydney Council next week. Credit: Louise Kennerley\n\nThe department’s concerns centre on the proximity of the court, which shares walls with the RBA’s head office.\n\nThe Reserve Bank is seeking approval from the City of Sydney Council to carry out the first stage of its long-planned office upgrade which includes removing hazardous building material along with original building slabs, marble walls, windows, and leather doors.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/business/markets/asx-climbs-as-brambles-gold-stocks-rise-james-hardie-s-horror-run-continues-20250821-p5mokz.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "ASX climbs as Brambles, gold stocks rise; James Hardie’s horror run continues",
        "publish_date": "Thu, 21 Aug 2025 11:28:37 +1000",
        "category": "finance",
        "authors": [
            "Staff Writers"
        ],
        "text": "Northern Star Resources, Australia’s biggest gold producer, saw its shares rise 1.4 per cent after the company said it more than doubled its net profit over the past financial year, helped by a higher gold price amid resilient demand for safe haven assets amid tariff uncertainty for the global economy. Other gold stocks also gained. Evolution Mining was up 1.8 per cent and Newmont rose 1.3 per cent.\n\nA flurry of local company results took investor attention away from Wall Street, where indexes ended mixed as the sell-down of AI superstars such as Nvidia continued, albeit at a more muted pace.\n\nThe S&P/ASX 200 climbed 65.90 points, or 0.7 per cent, to 8983.90 as of 11.05am AEST, with nine of its 11 industry sectors in the green, led by industrials, mining and consumer stocks. The ASX added 0.3 per cent on Wednesday. The Australian dollar was 0.3 per cent lower at US64.34¢.\n\nThe Australian sharemarket opened stronger this morning, putting it on track for a new record on one of the busiest days of reporting season.\n\nMining giants BHP, Fortescue Metals and Rio Tinto also advanced, rising 1.2 per cent, 0.9 per cent and 1.5 per cent, respectively. So did the big four banks, with CBA up 0.1 per cent, Westpac rising 0.7 per cent, NAB up 0.2 per cent and ANZ Bank up 0.5 per cent, respectively. Mining and financial stocks make up more than half of the ASX, so even small movements can steer the wider market.\n\nBrambles shares climbed 5.2 per cent. The pallet supplier this morning announced a share buyback of up to $US400 million ($622.5 million) and declared a final dividend of US20.83¢ a share, taking its payout for the year to US39.83¢, up 17 per cent from the last year, as an efficiency drive helped it improve profits.\n\nOn the flip side, Whitehaven Coal shed 2.3 per cent after reporting its underlying net profit fell by more than half to $319 million in the past financial year, with earnings markedly slowing in the second half as coal prices declined. The news came a day after Yancoal, the nation’s biggest pure play coal producer, said its revenues fell in the June half despite a higher coal output because of weaker prices. Yancoal’s shares added 0.4 per cent after their 11.4 per cent loss on Wednesday.\n\nAnd James Hardie’s horror sell-down continued, with the share price falling another 8.2 per cent after plummeting 27.8 per cent on Wednesday after the home cladding maker said its full-year net income was down 60 per cent as sales in its key US market declined. Demand in home repairs, renovations and new construction is “challenging”, it warned.\n\nSuper Retail Group, which owns the Rebel sports, Supercheap Auto and Macpac chains, jumped 13.9 per cent. They hit a record high after the company said it boosted sales by 4.5 per cent to a record $4.1 billion in the past financial year, with growth accelerating in the second half.",
        "source": "TheAge"
    },
    {
        "url": "https://au.news.yahoo.com/lehrmann-returns-court-clear-name-200644020.html",
        "title": "‘Cover up’ claim in Lehrmann case",
        "publish_date": "2025-08-21T01:33:33Z",
        "category": "finance",
        "authors": [
            "Steve Zemek"
        ],
        "text": "Bruce Lehrmann is appealing after he lost his high-profile defamation trial against Network 10. Picture: NewsWire / Nikki Short\n\nBruce Lehrmann has sensationally claimed that Lisa Wilkinson and The Project did not name the former Liberal staffer because they were trying to drive up ratings, not because they were acting reasonably.\n\nLehrmann has appealed to the Full Court of the Federal Court following his multimillion dollar defamation suit loss to Ten and Wilkinson last year.\n\nJustice Michael Lee found that Lehrmann – on the civil standard of the balance of probabilities – had raped his colleague Brittany Higgins inside Parliament House in 2019.\n\nLehrmann sued over Ms Wilkinson’s interview with Ms Higgins on The Project but Justice Lee made damning findings against him and he was subsequently ordered to pay $2m in Ten’s legal costs.\n\nADVERTISEMENT\n\nThe former Liberal staffer has now appealed Justice Lee’s decision and is being represented by solicitor Zali Burrows at a three-day hearing.\n\nTen is being represented by Dr Matt Collins SC while barrister Sue Chrysanthou SC is appearing for Ms Wilkinson.\n\nBruce Lehrmann leaves the Federal Court on Wednesday. Picture: NewsWire / Nikki Short.\n\nLisa Wilkinson and Brittany Higgins. Picture: Supplied.\n\n‘Whodunnit’\n\nBruce Lehrmann’s lawyer has argued that he was not named in The Project broadcast because they were trying to create a “whodunnit”.\n\nMs Wilkinson has argued that she acted reasonably when preparing the broadcast and has challenged Justice Lee’s finding that their qualified privilege defence had failed.\n\nMs Chrysanthou has pointed out that Lehrmann was not named by The Project - but accepts he was identifiable to a small number of people.\n\nHowever, in her written submissions — which were published by the court on Thursday — Ms Burrows argues Ten and Wilkinson did not name him for “disingenuous” purposes.\n\nADVERTISEMENT\n\n“Mr Lehrmann does not agree with Ms Wilkinson’s assertion it was a factor to consider on assessing reasonableness, that in effect she should be commended for not naming Mr Lehrmann in the program is viewed is disingenuous, and viewed as a crafted strategy to maximise the ratings of a story, to achieve an exciting air of mystery akin to a ‘whodunnit’, a common phrase used to ask who committed a crime with the effect of provoking a greater public interest to ‘create chatter’ a ‘buzz’, placing the primary focus on the identity of the alleged perpetrator, arguably highlighting the sensationalism of a complex plot-driven story involving political scandal cover up of a rape in Parliament,” she wrote.\n\nBruce Lehrmann and Zali Burrows. Picture: NewsWire/Nikki Short.\n\n‘Cover up’\n\nMs Chrysanthou has told the court Justice Lee in his finding was “distracted” by the “so-called cover-up” allegation.\n\nIn his judgment, Justice Lee wrote that “the allegation of rape was the minor theme, and the allegation of cover-up was the major motif” of The Project broadcast.\n\nADVERTISEMENT\n\nMs Chrysanthou told the court on Wednesday: “His Honour should have been more open to the reasonableness finding because that’s an acceptance of the fact because the program really wasn’t about Mr Lehrmann.”\n\nShe also disputed Justice Lee’s finding that the broadcast made allegations of “corrupt conduct”.\n\nMs Chrysanthou said the cover-up allegations would be relevant if Ms Wilkinson considered Higgins’ rape allegations “absurd and fanciful”.\n\n“That just wasn’t the way His Honour addressed it,” Ms Chrysanthou said.\n\nJustice Michael Wigney said: “It’s of some relevance is it not?\n\n“Because His Honour’s reasoning was, given the way this story has been initially presented by (Higgins’ partner) Mr (David) Sharaz in particular - that is that it was a political bombshell so to speak - that should have caused her to be even more cautious about her underlying allegation.\n\nADVERTISEMENT\n\n“You can’t completely disassociate the two.”\n\nBrittany Higgins during her interview with Lisa Wilkinson.\n\nQualified privilege\n\nJustice Lee did make adverse findings against Wilkinson and Ten after their qualified privilege defence failed.\n\nQualified privilege is a defence to defamation but relies on whether the publisher’s conduct was “reasonable”.\n\nWilkinson is appealing against that and Ms Chrysanthou is arguing that her client acted reasonably when preparing the Project broadcast.\n\n“There was a huge amount of communication between the producers that Ms Wilkinson was excluded from,” Ms Chrysanthou told the court on Thursday.\n\nBarrister Sue Chrysanthou and Lisa Wilkinson. Picture: NCA NewsWire/Simon Bullard.\n\nTen say Lehrmann was ‘totally unreliable’\n\nLehrmann has asked that Justice Lee’s findings be overturned on appeal, arguing that they differed from the case pleaded by Ten and Wilkinson, as well as the oral evidence at trial.\n\nHowever in the written submissions which were, on Thursday, released by the court, Ten’s legal team of Dr Collins and Tim Senior argue: “None of these submissions is correct.”\n\nThey say it was not an “exceptional case” where Justice Lee could not have been able to make findings either way about whether Lehrmann and Higgins should be believed.\n\n“Rather, the primary judge found Mr Lehrmann to be a totally unreliable witness, while being forcefully struck by the credibility of Ms Higgins’ oral evidence of the sexual assault,” Ten says in their submissions.\n\nLehrmann contends he was denied “procedural fairness” because some of Justice Lee’s findings were never put to him when he was on the witness stand.\n\nIt’s a proposition that Ten attacked, saying that from the outset of the case they had put forth an alternative case that Higgins was too drunk to give consent.\n\n“He was extensively cross-examined as to his knowledge of Ms Higgins’ state of intoxication,” they said.\n\nDuring the trial, Dr Collins asked: “Now, Mr Lehrmann, did you at any time seek Ms Higgins’ consent to have sexual intercourse with you?”\n\nLehrmann replied: “I didn’t have sexual intercourse with her.”\n\nBruce Lehrmann lost a case against Channel 10, which he is appealing. Picture: NCA NewsWire / John Appleyard\n\n‘Denial of natural justice’\n\nMs Burrows told the court on Wednesday that Lehrmann was the victim of procedural unfairness because the findings of Justice Lee were different to the case put forward at trial.\n\n“It’s a really, serious unfair denial of natural justice if Mr Lehrmann goes through a trial where it’s said ‘you are accused of A, B, D, E to Ms Higgins, this is the way it happened. And the judge finds ‘well I don’t find any of those A, B, C, D, E’,” Ms Burrows said.\n\nHowever Justice Michael Wigney replied: “That’s not what happened. He did a find … it was A, B, C, D, E, F, G, H, I … A number of the matters alleged and particularised were found.”\n\nMs Burrows further argued that it was pleaded by Ten and Wilkinson as a “violent rape” but Justice Lee found it was a “non-violent rape”.\n\nJustice Craig Colvin replied: “I’m not sure he found a non-violent rape and I’m not sure that’s a concept that I understand.”\n\nMs Burrows told the court that Lehrmann was “taken by surprise” that Justice Lee made findings that differed from Ms Higgins’ account and “he came up with a different version, a softer version.”\n\nBruce Lehrmann was branded Australia’s most hated man by his solicitor. Picture: NewsWire / John Appleyard\n\n‘Australia’s most hated man’\n\nIn his judgment, Justice Lee found that Lehrmann could have only been awarded $20,000 had he won the trial.\n\nHowever Ms Burrows said he should be awarded a substantial amount if he had the findings overturned on appeal.\n\nShe has pointed to media coverage of the trial, “social media insults he gets” and other “harassment”.\n\n“He’s pretty much become the national joke,” Ms Burrows said.\n\n“As I previously submitted to this court, he’s probably Australia’s most hated man.”\n\nBarrister Sue Chrysanthou and Lisa Wilkinson. Picture: NewsWire/Simon Bullard.\n\nTen attack’s Lehrmann’s ‘astonishing’ claim\n\nDr Collins on Wednesday attacked Lehrmann’s argument that he might have given different evidence had he known the findings that Justice Lee was going to make.\n\nAt trial, Lehrmann told the court that he had no sexual contact with Ms Higgins at Parliament House.\n\nMs Burrows told the court on Wednesday that he was the victim of procedural fairness and was surprised by Justice Lee’s findings.\n\nBut Dr Collins attacked that argument as “astonishing” given that he has persistently claimed that he did not have sex with Ms Higgins.\n\n“Our learned friend said today at the bar table that well the unfairness resides in the fact they might have called further evidence, although she backed away from that when questioned about that evidence might have been,” Dr Collins said.\n\n“There were only two people in the room.\n\n“But she said Mr Lehrmann’s evidence might have been different.\n\n“That’s, with respect, an astonishing submission.\n\n“It could only be that had the pleading alleged a sexual assault in which consent was in question, he would have conceded having sexual intercourse with her and argued that he had her consent or thought he had her consent.”",
        "source": "Yahoo"
    },
    {
        "url": "https://au.news.yahoo.com/crossed-line-blow-over-hospital-005556727.html",
        "title": "‘Crossed a line’: Blow up over hospital crisis",
        "publish_date": "2025-08-21T01:17:54Z",
        "category": "finance",
        "authors": [
            "Thomas Henry"
        ],
        "text": "The NSW government has come under fire over the state’s hospital bed crisis and the delivery of a $120m expansion to beds in Blacktown and Mt Druitt hospitals.\n\nDuring state budget estimates on Thursday morning, Labor Health Minister Ryan Park clashed with opposition MPs over claims the government was delaying on much-needed investments into public hospitals in Western Sydney.\n\nLiberal MP Susan Carter questioned why the minister was “playing politics” with a $120m rollout of 60 beds between Blacktown and Mt Druitt hospitals.\n\nHealth Minister Ryan Park has come under fire over the state’s hospital bed crisis. Picture: NewsWire/ Gaye Gerard\n\nShe accused the government of delaying the rollout, which is forecast to be delivered in the 2027-28 financial year but listed with a financial completion date of 2029.\n\nADVERTISEMENT\n\n“I’m more interested in what we should be saying to a 70-year old grandfather Raymond Ryan forced to sleep on the floor of the hospital ED after waiting more than 24 hours for a bed,” Ms Carter said.\n\n“That was in July … what do we say to Raymond Ryan?”\n\nIn response, Mr Park referenced the previous Liberal government’s record of wage cuts and a lack of investment in “frontline staff”.\n\n“It was your government that paid 0 per cent during the middle of Covid to frontline healthcare workers,” Mr Park said.\n\n“Over the last three years we’ve invested more in the health workforce than any other government has.”\n\nLabor has been accused of ‘playing politics’ with a $120m rollout of 60 beds between Blacktown and Mt Druitt hospitals. Picture: NewsWire/ Gaye Gerard\n\nMs Carter was ultimately held up on a point of order by committee chair and Greens MLC Amanda Cohn after she “crossed a line”.\n\n“We do have rules around procedural fairness that include treating the witnesses with respect, and I think that actually did cross a line,” Ms Cohn said of Ms Carter’s “playing politics” comment.\n\nADVERTISEMENT\n\nThe hearing was disrupted by consistent points of order after a series of fiery exchanges between Mr Park and Ms Carter.\n\nLabor MLC Stephen Lawrence accused Nationals MLC Wes Fang of “screaming, pointing, ranting and raving” after he clashed with Mr Park over an inquiry into the issues at Blacktown Hospital\n\n“You’ve been asked a question, you’re not answering the question. Your side of government supported an inquiry into rural health in the last term of parliament. Why won’t you support an inquiry into Blacktown Hospital?” Mr Fang shouted.\n\nMr Park defended the government’s record on inquiries into the state’s healthcare system.\n\n“I had a royal commission into my own agency … I don’t know any other minister over the last 20 years who has initiated a royal commission,” Mr Park said.\n\nSusan Carter grilled the Health Minister. Picture: NewsWire / Simon Bullard.\n\nHe claimed the government was adding “significantly increased amounts of staff” and bed expansions “to the tune of $120m” at Blacktown Hospital and said his government was committed to focusing on “patient experience” at problem hospitals.\n\nADVERTISEMENT\n\n“We’ve seen significant improvements at Blacktown Hospital but there is more to do,” he said.\n\nMr Park also defended the government’s interim offer of a 5 per cent increase to the 15 per cent night duty penalties for nurses and midwives.\n\nThe government has previously come under fire for the gap in pay between NSW healthcare workers and workers in other states around the country.\n\n“Do you expect this to address recruitment issues when for example in WA nurses have a night duty of 35 per cent, in Tasmania 27.5 per cent, in the Northern Territory 25 per cent and in the ACT 25 per cent,” Ms Cohn asked.\n\nMr Park said neither he nor the Premier Chris Minns were “doing a lap of honour” about the interim offer, instead suggesting the offer was a quick way to practically increase nurses pay.\n\n“The challenge is after a decade of wage suppression brought about the Coalition government … there are discrepancies in pay for healthcare workers in NSW and other jurisdictions,” he said.",
        "source": "Yahoo"
    }
]