[
    {
        "url": "https://www.9news.com.au/national/graham-richardson-dies-at-76/d6d1ef51-319f-41d9-ac51-bc0aacce8df2",
        "title": "Labor legend Graham Richardson dies at 76",
        "publish_date": "Sat, 08 Nov 2025 00:23:15 +0000",
        "category": "finance",
        "authors": [
            "Nov"
        ],
        "text": "F﻿ormer Labor senator, party powerbroker and media commentator Graham Richardson has died at the age of 76.\n\nThe former senator died at 3.50am, from influenza and pneumonia., his wife told Ben Fordham on 2GB.\n\n\"Darcy and Amanda have asked me to share the news with everyone that, sadly, Richo has passed away in the early hours of this morning,\" Fordham said.\n\nREAD MORE: Couple who enslaved woman for eight years have home sale proceeds forfeited ﻿\n\nRichardson died this morning at the age of 76. (Australian Financial Review)\n\n\"In the past few weeks, he's had a bout of influenza and then pneumonia, he also had a little stint on dialysis, trying to clean up his blood a little bit.\"﻿\n\nFordham said he lived long enough to see his son mark a milestone.\n\n\"When he had his big health challenge, he said to his wife Amanda, 'I'm going to live till I see Darcy finish exams and his HSC'. Darcy did his last HSC exam on Thursday, which was his French exam. And Richo's died this morning,\" Fordham said.\n\nIn 2017, Richardson told 60 Minutes that﻿ he hoped his son would become Prime Minister one day.\n\n\"I want him to be Prime Minister. If I hang around long enough, I reckon I could manage it,\" he said\n\n\"I could get him there.\"﻿\n\nRichardson served as New South Wales senator in federal parliament between 1983 and 1994.\n\nRichardson served as a NSW Senator from 1983 to 1984. (Sydney Morning Herald)\n\nWhen he first arrived in parliament, he was the youngest elected senator at the time, at the age of just 33.\n\nHe served as a cabinet minister under prime ministers Bob Hawke and Paul Keating for a range of positions, including social security, transport and communications, health and the environment.\n\nIn 1999, Richardson was diagnosed with ﻿a chondrosarcoma, a rare and usually lethal bone cancer in his pelvis.\n\nFor over two decades, he underwent multiple surgeries to remove tumours but remained active in politics.\n\nAs a political commentator, he appeared on election night coverage ﻿and hosted his Richo until 2021, an evening commentary program.\n\nHe also appeared on Richo + Jones , a joint show with former broadcaster Alan Jones. ﻿\n\nIn a post this morning, former Liberal treasurer Josh Frydenberg described Richardson as a ﻿\"fiercely loyal Labor man who was not afraid to make friends across the political aisle.\"",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/sophadophaa-sophia-begg-all-for-mimi-founder-secrets-to-success/6374bbca-4a4a-4495-8719-86b3fb02cbbd",
        "title": "21-year-old business owner reveals mistake jobseekers keep making",
        "publish_date": "Fri, 07 Nov 2025 19:58:53 +0000",
        "category": "finance",
        "authors": [
            "Nov"
        ],
        "text": "Exclusive: In a new nine.com.au series starting today we'll be talking to some of Australia's smartest and sharpest ﻿entrepreneurs, founders and CEOs to find out what makes them tick - and what advice they'd have for anyone starting out.\n\nSophia Begg (known online as @sophadophaa) is one of Australia's most recognisable young influencers ﻿with more than 2 million combined social media followers.\n\nShe's also co-founder of All For Mimi, the wildly successful fashion brand she launched in 2023 that shot to fame for its viral sell-out tank tops.\n\nNow a successful internet personality and business owner, she's juggling two lucrative careers ﻿at just 21 years old.\n\n﻿ These are her secrets to success.\n\nSophia Begg is one of Australia's most recognisable young influencers and co-founder of fashion brand All For Mimi. (Supplied)\n\nHow do you start the day to set yourself up for success?\n\nI love to start the day with a morning walk with my partner before making my Tropeaka matcha to enjoy a quiet moment before the chaos!\n\nWhat are three daily habits you always stick to?\n\nMorning matcha, daily gratitude, and 'no-phone' time before bed.\n\nLots of Aussies are looking for a career change — what small action can help them get ahead of other candidates?\n\nWhat stands out to me is when applicants take the time to attend to the finer details.\n\nYou'd be surprised at how many applications don't have a cover letter or have spelling errors!\n\nBegg revealed a surprising number of people who apply to work with her don't include a cover letter. (Supplied)\n\nWhat financial myth do you wish you never bought into?\n\nIn my first ever car, when I was 18, I believed that if I put my windows down the car would go slower and therefore use more petrol.\n\nSo even in summer, in 30 degree heat, I would keep my windows up and never use the aircon to save money.\n\nWhat do you wish you could tell your 20-year-old self?\n\nLast year [Begg turned 20 in 2024] was a wild one as it was the first year of my brand All For Mimi.\n\nI would tell my 20-year-old self to speak kindly to herself, take each \"mistake\" as a learning curve, and keep moving forward.\n\nHave you got a story? Contact reporter Maddison Leach at mleach@nine.com.au",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/sydney-artist-rachael-egan-painting-taken-in-suspected-case-of-mistaken-street-bounty/021e9a36-e9ad-4344-be6c-ae5ad917025b",
        "title": "'Priceless' painting taken in suspected case of mistaken street bounty",
        "publish_date": "Fri, 07 Nov 2025 03:07:02 +0000",
        "category": "finance",
        "authors": [
            "Nov"
        ],
        "text": "A Sydney artist has faith that the \"priceless\" painting that took her more than 100 hours to complete will be returned after it was taken by someone in just minutes in a suspected case of mistaken street bounty. ﻿\n\nRachael Egan was in the process of moving home in Erskineville on Tuesday afternoon when the centrepiece of her upcoming solo exhibition disappeared from the footpath.\n\nIn the chaos, the 26-year-old did not realise it was missing until she woke up the next morning and thought: \"﻿Where on earth is that painting?\"\n\nRachael Egan spent 100 hours creating the centrepiece for her upcoming solo exhibition in January. (Supplied)\n\n\"I moved everything in and out that whole day. We did a lot of rounds from the car, and we would have definitely seen it outside the front,\" she told 9news.com.au.\n\n\"So I think there was like a five- to 10-minute window when it was outside and someone took it. It wouldn't have been outside for very long.\"\n\nEgan spent 100 hours over several months this year painting the piece and had planned to sell it at her very first solo exhibition in January.\n\nTo her, it is priceless. ﻿\n\n﻿﻿\"I put a lot of love and labour into that work, and it's the crux of all the other pieces,\" she said.\n\n\"It was the first piece that jump-started the exhibit.\n\n\"So it's very important to me, and a very special artwork for me.\"\n\nThe artwork, ﻿titled Bliss - field of infinite potential , was born out of a phrase her yoga teacher had said during a class five years ago.\n\nEgan's mind immediately went to the famed Windows wallpaper.\n\nShe spent the years honing her techniques ﻿and waiting until she was ready to paint it.\n\nREAD MORE: Tesla approves pay packet that could make Elon Musk the first trillionaire\n\nRachael Egan is a 26-year-old Sydney-based artist. (Supplied)\n\nEgan felt up to it this year, but an injury to her dominant hand meant she had to wait another six months to get started.\n\nWhen she was finally able to pick up the paintbrush, it took her months to create her take on the Windows wallpaper.\n\nIt inspired the rest of the art in her collection.\n\n\"My exhibit is an exploration of fields with infinite potentials, but some literal like that, and then others very abstracted,\" she said.\n\nEgan has posted up flyers around the street, spoken to neighbours and shared her art on her social media, @unsoftserve, to help reunite her with her painting. ﻿\n\nShe is convinced it will be returned, believing someone had mistaken it for an item destined for council pickup.\n\n\"I know it was an innocent mistake, I'm sure someone fully just took it with street bounty, it wasn't actually intentionally stolen,\" she said.\n\n\"I just really have faith that whoever took it will see this and will return it to me, and they can come to my exhibit because they obviously liked my artwork.\"\n\nRachael Egan's artwork ﻿titled \"Bliss - field of infinite potential\". (Rachael Egan)",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/world/gta-vi-release-delayed/a75e5375-6093-47ef-8e29-08726232fc8f",
        "title": "Most anticipated video game of all time delayed yet again",
        "publish_date": "Fri, 07 Nov 2025 04:16:12 +0000",
        "category": "finance",
        "authors": [
            "Nov"
        ],
        "text": "The release date of Grand Theft Auto VI has been pushed back once again, forcing fans to wait even longer to get their hands on arguably the most anticipated video game of all time.\n\nThe latest instalment of the popular series was officially announced in December 2023, when developer Rockstar Games promised a 2025 release date.\n\nHowever, earlier this year it was announced the title wouldn't hit shelves until next May, and this morning, Rockstar announced the release date has been delayed once again, this time until November 2026.\n\nGrand Theft Auto VI was originally slated for release this year. (Take Two Interactive)\n\n\"Hi everyone, Grand Theft Auto VI will now release on Thursday, November 19, 2026,\" a statement from the developer read.\n\n\"We are sorry for adding additional time to what we realise has been a long wait, but these extra months will allow us to finish the game with the level of polish you have come to expect and deserve.\n\n\"We want to thank you again for your patience and support.\"\n\nThe predecessor to the hotly anticipated title, GTA V , was enormously successful on its release in September 2013, breaking all kinds of records as it racked up more than $US1 billion in sales in its first three days.\n\nHowever, assuming the latest release date proves accurate, fans are now faced with the prospect of having to wait more than 13 years for its sequel – which will be the eighth main instalment of the popular Grand Theft Auto series – to land.\n\nOfficial announcements about GTA VI have been eagerly devoured by fans, with the two trailers for the game to date racking up a combined 405 million views on YouTube.\n\nFollowing the announcement this morning, shares in Rockstar's parent company, Take Two Interactive, plunged up to 18 per cent in after-hours trading, despite the NASDAQ-listed business also posting better-than-expected quarterly earnings figures.\n\nThe company has since pared back a good portion of those losses, although, as of 2.30pm (AEDT), shares are still down about 6 per cent.",
        "source": "9News"
    },
    {
        "url": "https://www.abc.net.au/news/2025-11-08/millstream-water-aquifer-yindjibarndi-pilbara/105979000",
        "title": "Partnership protects sacred Pilbara water site but leaves questions",
        "publish_date": "Sat, 08 Nov 2025 01:49:15 +0000",
        "category": "finance",
        "authors": [],
        "text": "The Pilbara's Yindjibarndi Nation has welcomed a new partnership with the West Australian government around the Millstream aquifer, a sacred water source which has been heavily depleted.\n\nThe state government has announced a $12.4 million investment to protect cultural sites at the Millstream Chichester National Park aquifer, 1,600 kilometres north of Perth.\n\nIt will see the relocation of bores impacting significant ecological and cultural sites, and the installation of solar-powered battery systems to reduce noise.\n\nThe Millstream aquifer is 120km from Karratha and provides water for Dampier, Point Samson, Roebourne, Karratha and Wickham.\n\nThe announcement came after the state's Environmental Protection Authority launched an investigation into the groundwater usage of the aquifer.\n\nThe Millstream aquifer is 100km from Karratha. (ABC Pilbara: Kelsey Reid)\n\nWatering the region\n\nMillstream is considered to be sacred and significant by the Yindjibarndi.\n\nThe arid landscape of the Millstream Chichester National Park. (ABC Pilbara: Kelsey Reid)\n\nThe Millstream aquifer supplies Karratha's drinking water and the region's lucrative resources industry.\n\nIn 2022, the state government lowered the abstraction from the Millstream aquifer from 15 billion litres to 6 billion litres per year, however, a temporary 3 billion-litre contingency remains.\n\nYindjibarndi Nation heritage and cultural management officer Aaron Hubert Snr said they first noticed water levels dropping a decade ago.\n\nAaron Hubert Snr has a heritage and cultural management role with Yindjibarndi Nation. (ABC Pilbara: Kelsey Reid)\n\nThe traditional owners want it reduced further to 4 billion litres.\n\n\"If we don't do anything now, if we don't act on it … there's going to be more damage than what we see here now,\" Mr Hubert said.\n\n\"We need to be a lot more involved in the control of water.\"\n\nThe Yindjibarndi say the Millstream's flora and fauna are facing degradation if the groundwater is over-abstracted and becomes saline.\n\nYindjibarndi rangers have reported a decline in native species and an increase in semi-arid flora able to thrive in saline water, such as acacias, in the area.\n\nNative trees, such as old melaleucas, have begun to die and rangers are concerned there are no new trees to replace them.\n\n\"We'd rather see [the water] here for the environment and for the animals,\" Mr Hubert said.\n\nOnslow's Karlon Parker, 11, cools off at Jirndawurrunha Pool. Swimming is only permitted by traditional owners until a certain age. (ABC Pilbara: Kelsey Reid)\n\nCost to future generations\n\nMillstream is a special place for Yindjibarndi ranger Tremayne Guiness, who has camped at the site with his family since he was a young boy.\n\n\"In the morning, we'd get up at breakfast and come out to all the swimming places — back then it was beautiful, and the water was so blue and green,\" Mr Guiness said.\n\nTremayne Guiness has been a ranger three months and worries his daughter will not be able to enjoy the landscape he once did. (ABC Pilbara: Kelsey Reid)\n\nNow as a caretaker of country, Mr Guiness said he had watched most of the native fauna leave Millstream, and questioned if the environmentwould still be around for his daughter.\n\nIf the area is not protected, Mr Guiness said his daughter would not have the same opportunities, and she would need to rely on photos and documentaries to learn about her culture.\n\n\"It makes me feel sad, you know, because then I can't bring her here. What's the use of bringing her here?\" he said.\n\nTremayne Guiness takes part in a welcome to country. (ABC Pilbara: Kelsey Reid)\n\nSaline water\n\nAccording to the Department of Water and Environmental Regulation, rainfall in the Pilbara has been decreasing.\n\nHydrogeologist Ryan Vogwill said the lack of recharge at Millstream had caused saline water to be drawn into the bore field, affecting vegetation which previously had access to fresh water.\n\n\"Should 15 gigalitres have been approved? In hindsight, obviously not,\" Dr Vogwill said.\n\n\"If that saline water keeps coming to the Millstream river itself, it would be devastating, I'm sure, for the traditional owners.\"\n\nJirndawurrunha Pool in Millstream Chichester National Park. (ABC Pilbara: Kelsey Reid)\n\nHe said the use of water from a sacred site for irrigating public spaces and dust suppression for mining should be reconsidered and perhaps restricted.\n\n\"We have to stop short of having really optimistic assessments of how much water is available,\" he said.\n\nKarratha relies on water from the Millstream aquifer. (ABC Pilbara: Kelsey Reid)\n\nPlans for the future\n\nWater Minister Don Punch agreed Millstream was not a sustainable long-term resource and acknowledged the current output was having an effect on the land.\n\n\"Traditionally, we've made decisions into water based on Western science, and that means it's essentially what water is where, and how much can we take,\" he said.\n\nDon Punch was in the Pilbara this week to make an announcement alongside Michael Woodley. (ABC Pilbara: Kelsey Reid)\n\nYindjibarndi Aboriginal Corporation chief executive Michael Woodley said the two parties would continue to work together to find a solution.\n\n\"We've been on this path for a long, long time in terms of the concerns and issues that we've raised in relation to the extraction of water at Millstream,\" he said.\n\n\"We wanted to obviously make sure that there is a shared view and a shared solution so that we can all kind of bear some responsibilities in terms of how much do we take, what is the reasonable limit and continue to walk on that journey together.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-11-08/discarded-syringes-on-the-rise-in-kalgoorlie-boulder/105974538",
        "title": "Number of discarded syringes a 'frightening statistic' says mayor",
        "publish_date": "Sat, 08 Nov 2025 01:00:31 +0000",
        "category": "finance",
        "authors": [],
        "text": "For the past year, Patricia Harman has routinely taken some tongs and an empty water bottle on her morning walks.\n\nShe uses the kitchen utensil to pick up discarded syringes.\n\nOn an hour-long walk, the long-time Boulder resident and school traffic warden said it was not uncommon to find a dozen needles.\n\nPatricia Harman uses tongs to pick up needles and stores them in empty water bottles. (ABC Goldfields: Jarrod Lucas)\n\n\"My neighbour comes with me and she finds more than I do,\" she said.\n\n\"It has become normal. They are everywhere. I can't just leave them there.\"\n\nHer frustration is growing, saying it was not uncommon to witness illicit drug deals or use in public.\n\n\"I want to drop them [the water bottles containing needles] on the council's front desk,\" she said.\n\nKalgoorlie-Boulder is Australia's biggest inland city with a population of about 30,000 people. (ABC Goldfields: Jarrod Lucas)\n\n'Frightening statistic', mayor says\n\nKalgoorlie-Boulder, 580 kilometres east of Perth, ranks as Australia's biggest outback city.\n\nIts population of 29,306 people at the 2021 Census was larger than Alice Springs (25,912), Mt Isa (18,727) and Broken Hill (17,588).\n\nA community safety forum this week heard Mayor Glenn Wilson describe the spike in the number of discarded syringes being collected on the streets as \"frightening\".\n\nGlenn Wilson speaking at a community safety forum earlier this week. (ABC Goldfields: Jarrod Lucas)\n\nAccording to the City of Kalgoorlie-Boulder, its staff collected 1,138 needles throughout 2024.\n\nBut this year, in the nine months from January to September, that number has surged to more than 5,323 needles.\n\nThat is equivalent to 19 needles collected every day, or 135 a week.\n\nThe job of safely disposing of needles falls to the City's Safer Streets Patrol, which was set up in 2018 as a quasi-security force to conduct foot patrols of the CBD to reduce anti-social behaviour.\n\nCouncil staff from the Safer Streets Patrols are a regular site in the Kalgoorlie CBD and are equipped with body-worn cameras. (ABC Goldfields: Jarrod Lucas)\n\nThe patrol has expanded to 11 staff and three vehicles for officers, who have ranger-like powers under the Local Government Act.\n\n\"Our Safer Streets Patrol picked up between January and April this year, the same amount of needles as what they did for all of 2024,\" Cr Wilson said.\n\n\"That is a frightening statistic for our community to understand.\"\n\nThe City of Kalgoorlie-Boulder introduced its Safer Streets Patrol in 2018 to kerb anti-social behaviour. (ABC Goldfieds: Jarrod Lucas)\n\nA concerned mother named Mandy told the forum it was only a matter of time before someone gets stuck by a needle.\n\n\"The streets are littered with glass, they're littered with needles, they're littered with rubbish,\" she said.\n\n\"Where is the accountability for the people who are offending?\n\n\"This is disgusting that the vulnerable people of our community are going to come undone when they land on a needle.\"\n\nThe Kalgoorlie Health Campus operates a needle and syringe dispensing machine, known as NSDMs. (ABC Goldfields: Elsa Silberstein)\n\nNeedle dispensing and exchange\n\nAccording to the Department of Health, Kalgoorlie Health Campus operates a needle and syringe dispensing machine, known as NSDMs, to provide free, sterile needles and syringes.\n\nThe WA Country Health Service operates a needle exchange at its Goldfields Population Health site on Ware Street.\n\nKalgoorlie Pharmacy on Hannan Street also allows patients to return used needles, syringes and lancets for safe disposal.\n\nPolice Minister Reece Whitby listens to Glenn Wilson at the community safety forum. (ABC Goldfields: Jarrod Lucas)\n\nCr Wilson said the city's powers to crack down on the problem were limited.\n\n\"We can issue infringements, and we have, but the problem we face is they never get paid,\" he said.\n\n\"The large number of needles in the streets tells us there's an epidemic when it comes to the drug problem, so where's the support services?\"\n\nAli Kent speaks at the community safety forum. (ABC Goldfields: Jarrod Lucas)\n\nMeth use on rise\n\nThe Australian Criminal Intelligence Commission (ACIC) conducts wastewater testing to determine rates of drug consumption in capital cities and various regional sites.\n\nIts latest data suggests methylamphetamine use in regional WA is at an all-time high.\n\nIt would not comment specifically on Kalgoorlie-Boulder, but previous wastewater testing identified the city as a meth hotspot.\n\n\"We note that the consumption of methylamphetamine in regional Western Australia has been increasing since August 2021 and is at record levels,\" a spokesperson for ACIC said.\n\nPatricia Harman says it took her just two days to collect these syringes. (ABC Goldfields: Jarrod Lucas)\n\nKalgoorlie MLA Ali Kent said she had raised the issue with WA Health Minister Meredith Hammat, saying the use of methamphetamine had \"increased dramatically\" and is a \"very complex problem\".\n\n\"Even if you have a mandatory needle exchange it wouldn't stop what is happening,\" she said.\n\n\"I believe 90 per cent of people using drugs do use the needle exchange.\n\n\"I've talked to the heath minister and she's really keen for the health department and the City of Kalgoorlie-Boulder to work collaboratively, because needles in the streets is not acceptable.\"\n\nKate Collins says illegal substance use and abuse is the problem. (ABC Goldfields: Jarrod Lucas)\n\nGoldfields-Esperance Police Superintendent Kate Collins said officers work closely with the Safer Streets Patrol to reduce anti-social behaviour and gather intelligence.\n\n\"We will search people when we have grounds, we do a lot of work behind the scenes that is not always publicised because it might be part of the bigger picture,\" she said.\n\n\"We are seizing drugs daily off people, mostly small amounts that we see here in Kalgoorlie.\n\n\"While we can talk about needle programs, let's not shy away from what it is, illegal substance use and abuse.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-11-08/graham-richardson-labor-powerbroker-dies/7305430",
        "title": "ALP heavyweight Graham 'Richo' Richardson dies, aged 76",
        "publish_date": "Sat, 08 Nov 2025 00:36:22 +0000",
        "category": "finance",
        "authors": [],
        "text": "Labor powerbroker Graham Richardson has died aged 76.\n\nThe former politician died at 3.50am on Saturday after weeks of influenza and pneumonia, 2GB Breakfast host Ben Fordham announced after speaking to his wife and son.\n\nPrime Minister Anthony Albanese said Mr Richardson was loyal, insightful and a close friend.\n\n\"Graham Richardson was a Labor legend. He was someone who was a real character, someone who rose up through the ranks of the Labor party,\" he told ABC Radio Sydney.\n\nPolitics was an integral part of Mr Richardson's life, from the time he dived headlong into Labor's factional brawls in the 1960s to his final days.\n\nCutting short his university degree to learn from the party's toughest powerbrokers, he emerged as the youngest ever general secretary of the NSW Labor Party at the age of just 26.\n\nAt Labor's Sydney headquarters, Mr Richardson became known as the \"numbers man\" for the right-wing faction.\n\nRichardson at a NSW State Labor Conference in Sydney on July 30, 2017. (AAP: Daniel Munoz)\n\nBy 1983, Mr Richardson's influence reached to the top of Labor, as he delivered the numbers to dump leader Bill Hayden in favour of Bob Hawke.\n\nAt 33, he negotiated his own way into parliament to become the youngest senator ever elected at the time.\n\nHe was later installed as the minister for environment and sustainability.\n\nMr Hawke needed Mr Richardson's deal-making skills to secure an alliance with the Australian Democrats and early Green parties to win a tight election in 1990.\n\nIn exchange, Mr Richardson blocked Tasmania's Wesley Vale pulp mill and saved the Daintree rainforest, staring down angry timber workers at ugly demonstrations.\n\nPolitical scandals, ill health and television career\n\nHowever, the relationship with Mr Hawke soured in 1990, and Mr Richardson transferred his allegiance and numbers to Paul Keating, who became prime minister in December 1991.\n\nMr Richardson was appointed minister for transport and communications, but his close relationship with media magnate Kerry Packer earned him the nickname \"the Minister for Channel Nine\".\n\nHis dream job did not last long. He was forced to resign and head to the backbench after revelations he used his position and influence to carry out a migration scam in what became known as the Marshall Islands affair.\n\nFollowing Mr Keating's surprise election win in 1993, Mr Richardson returned to cabinet as minister for health.\n\nHis portfolio grew to take in the environment and sport after another government scandal, but once again, his tenure was short-lived.\n\nGraham Richardson lived for years after being diagnosed with a rare form of bone cancer. (AAP: Tracey Nearmy)\n\nJust four weeks later, the 45-year-old retired from parliament, citing ill health.\n\nMr Richardson went on to capitalise on his extensive contacts and forge a career as a corporate negotiator, broadcaster and commentator.\n\nBut he never appeared far from controversy, with allegations of his involvement in sex scandals, dodgy developments and secret deals.\n\nHe was a familiar face on election night panels and a very unpopular choice as the mayor of the 2000 Sydney Olympic Village.\n\nYet he kept up his busy schedule despite his deteriorating health, penning a regular newspaper column and appearing alongside Alan Jones for a weekly television program on Sky News.\n\n'I'm not making long-term plans'\n\nOn April 6, 2016, Mr Richardson underwent a marathon 18-hour surgery to remove part of his prostate, bladder, bowel rectum, tailbone and part of his hipbone.\n\n\"Don't worry — as the Terminator says — 'I'll be back',\" he told viewers of Richo and Jones the night before the surgery.\n\nGraham Richardson and wife Amanda pose at a charity movie screening in 2015. (AAP: Paul Miller)\n\nThree weeks after the surgery he was rushed into intensive care to spend a night under supervision at Sydney's Royal Prince Alfred Hospital.\n\nSky News boss Angelos Frangopoulos told his Twitter followers he had lots of concern for Mr Richardson but \"things are positive and he's doing OK\".\n\nWhile Mr Richardson was bullish in his optimism, he was well aware of his mortality.\n\n\"You have to say, yes, I am frightened,\" he told The Daily Telegraph in 2015 when news of the cancer setback emerged.\n\n\"I've been worrying about this for a long time.\n\n\"You're talking 15 hours under the knife and, let's be honest, I'm no spring chicken.\"\n\n'No one ignored what Richo had to say'\n\nFormer Labor minister Craig Emerson, who worked closely with Mr Richardson, said his greatest legacy was his commitment to the environment.\n\n\"Richard was always very affable,\" he told ABC News Channel.\n\n\"When Richard felt that a change was needed or a particular policy should be supported he was able to marshal all of the members of the New South Wales right in the caucus.\n\n\"People would [continue to] listen to him once he was out of parliament. No one ignored what Richo had to say.\"\n\nEx-Liberal treasurer Josh Frydenberg described Mr Richardson as a \"fiercely loyal Labor man who was not afraid to make friends across the political aisle\".\n\nNationals senator Bridget McKenzie also offered her condolences in a post on X.\n\n\"In all our debates he was always gracious and wise with his unique encyclopedic knowledge of Labor lore and history. He … loved our country,\" she said.\n\n\"His determination to continue public debate despite his illness was extraordinary.\"\n\nABC/AAP",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-11-08/ocean-safety-call-after-drowning-at-surfing-mecca-margaret-river/105396284",
        "title": "Calls for better safety support at Margaret River surfing mecca",
        "publish_date": "Sat, 08 Nov 2025 00:11:54 +0000",
        "category": "sports",
        "authors": [],
        "text": "The Margaret River surfing community is calling for more safety precautions at Western Australia's surfing mecca following the death of a surfer at a notorious break known as Bombie.\n\nExperienced surfer and trained lifeguard Sean Lennon was pulled out of the water by other surfers on Gnarabup Beach in Prevelly, about 270 kilometres south of Perth, on Tuesday afternoon.\n\nSadly, he could not be revived.\n\nHe was among the surfers out taking advantage of big swells on the day.\n\nThe beaches along Prevelly and Gnarabup are world famous, with the Margaret River Pro running in various forms there since 1985.\n\nEmergency nurse Mitchell Cooper is a friend of Mr Lennon and was surfing at a nearby beach.\n\n\"It was pretty gut-wrenching,\" Mr Cooper said.\n\n\"It's not a great feeling at all when that's going down and you hear two ambulances and see the commotion on the beach.\"\n\nSean Lennon's death has sparked calls for better ocean safety from local surfers. (Supplied: Tom Pearsall)\n\nA passion for ocean safety\n\nFriends remember Mr Lennon, who was in his 50s, as a happy and enthusiastic surfer who was passionate about ocean safety.\n\nThey have vowed to continue his fight to improve beach safety.\n\nMr Cooper grew up just 50km away from Mr Lennon in regional New South Wales, where they both worked as lifeguards, though their paths did not cross until they both moved west to Margaret River.\n\nMr Cooper said more needed to be done to make local beaches safer.\n\n\"It's getting to the point that we have had a few of these mishaps, and who knows how many near misses as well,\" he said.\n\n\"I just feel like it needs to be like the eastern states or Hawaii, where you have council-paid lifeguards who are incentivised with decent pay and trained properly.\n\n\"So you'd have a couple of towers that have a good vantage point, communication and a jet ski.\"\n\nMargaret River's surfing community has been devastated by the recent tragedy at Bombie break. (ABC News)\n\nThe 'grandaddy' of waves\n\nMr Lennon's friend, Bec Sheedy-Ryan, said he had been preparing and training ahead of taking on the \"intense\" waves at the Bombie break where he died.\n\nBombie surf break is located between Gnarabup and Main Break at Surfers Point, where the Margaret River Pro is held as part of the World Surf League tour.\n\n\"It's like the grandaddy of all the waves … on any given day, it's always getting the biggest waves,\" Ms Sheedy-Ryan said.\n\n\"I know he had been doing a lot of physical and mental preparation.\"\n\nShe said she wanted to see locals trained up to help in water emergencies.\n\n\"We have got so many incredible ocean people in this area,\" Ms Sheedy-Ryan said.\n\n\"Just to get them upskilled and trained up in rescue would make a huge difference straight off the bat because they're often first on scene.\"\n\nSean Lennon's death comes two years after the disappearance of veteran surfer Aaron Beveridge at a nearby surf break. (ABC South West WA: Andrew Williams)\n\nCalls for government action\n\nThe Margaret River surfing community last faced tragedy when Aaron Beveridge disappeared while surfing at Surfer's Point in Prevelly in 2024.\n\nA WA Police investigation concluded Mr Beveridge most likely drowned after his leg rope got caught on a reef.\n\nVeteran surfer Mitch Thorson said Mr Beveridge was an experienced surfer who had previously faced some of the biggest waves alongside him.\n\n\"He met his fate under similar circumstances where the power of the ocean just overwhelmed him,\" he said.\n\n\"It's very sad, but it just highlights how vulnerable even the most experienced people can be in the surf around here.\"\n\nMr Thorson said the local and state governments needed to heed the local surfing community's calls for more safety awareness.\n\n\"There's a real population explosion in this area of people immigrating here from other states and countries,\" he said.\n\n\"There's a lot of adult learners … who are fit and strong, who are capable paddlers, able to get themselves out to these surf breaks, but they're not necessarily aware of what the dangers are.\"\n\nHe said local surfers would like to see signage erected with a surf break rating system, similar to those found in ski fields or on bush walks.\n\nThe ABC has contacted the state government and the Shire of Augusta-Margaret River for comment.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-11-08/nrl-kangaroos-determined-to-win-final-ashes-test-against-england/105987460",
        "title": "Kangaroos focus on 'wonderful opportunity' in final Ashes Test",
        "publish_date": "Fri, 07 Nov 2025 23:54:12 +0000",
        "category": "sports",
        "authors": [],
        "text": "Australia captain Isaah Yeo says his side has not played to its full potential in the Ashes series, despite convincing wins in the first two Tests against England.\n\nThe Kangaroos triumphed 26-6 in the first Test at Wembley, before clinching a series victory with a 14-4 defeat of England at Everton Stadium last Sunday AEDT.\n\nThe final Test will be played at a sold-out Headingley in Leeds on Sunday morning AEDT.\n\nYeo said the Kangaroos were determined to produce a \"full 80-minute performance\" as they chased a series clean sweep.\n\n\"We just haven't done that yet, but it makes for a wonderful opportunity,\" he said.\n\n\"England will be all out to make sure it's not a 3-0 whitewash and we're trying to make sure it is.\n\nPitch invader stands with Kangaroos A man is arrested by police after he lined up next to Cameron Munster before the Kangaroos' victory over England in the second Ashes Test in England.\n\n\"In the history of the game, you don't want to lose these things.\n\n\"This tour's been truly something special and something we will look back on in our careers and be really fond of having been over here.\"\n\nYeo said England was a far better opponent than the scorelines in the opening two Tests suggested.\n\n\"There was a five-minute period there in that second game where it could have gone either way and we were lucky enough to get a couple of tries,\" he said.\n\n\"There were moments we certainly weren't at our best, but that was because of the standard they were playing at as well.\n\n\"The way they've competed through this whole series has been outstanding.\"\n\nYeo has returned to the Kangaroos line-up after missing the second Test because of concussion protocols.\n\nHe suffered a head knock early in the Wembley Test a fortnight ago.\n\nHarry Grant captained the Kangaroos in Yeo's teammate's absence.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-11-08/grammy-awards-nominations-2026-kendrick-lamar-lady-gaga/105987408",
        "title": "Australian acts get nod as Kendrick Lamar, Lady Gaga lead Grammy nominations",
        "publish_date": "Fri, 07 Nov 2025 23:53:49 +0000",
        "category": "entertainment",
        "authors": [],
        "text": "Nominees for the 2026 Grammy Awards have been announced with Kendrick Lamar and Lady Gaga receiving the most nods.\n\nThree Australian acts — Amyl and the Sniffers, Tame Impala, and Rüfüs Du Sol — have also been nominated, and for the first time ever a K-pop song has been nominated for Song of the Year.\n\nFor the second year in a row rapper Kendrick Lamar has the most nominations — nine in total for his album GNX.\n\nLamar faces competition for Album of the Year against contemporaries Tyler, the Creator, Clipse, Pusha T & Malice, and Bad Bunny.\n\nIt is the first time three rap albums have been up for that category.\n\nLady Gaga has seven nominations in total for her album Mayhem.\n\nHere is the full list of nominees.\n\nSong of the year\n\nLady Gaga — Abracadabra\n\nDoechii — Anxiety\n\nRosé & Bruno Mars — APT\n\nBad Bunny — DtMF\n\nHunter/x — Golden\n\nKendrick Lamar feat SZA — Luther\n\nSabrina Carpenter — Manchild\n\nBillie Eilish — Wildflower\n\nRecord of the year\n\nBad Bunny — DtMF\n\nSabrina Carpenter — Manchild\n\nDoechii — Anxiety\n\nBillie Eilish — Wildflower\n\nLady Gaga — Abracadabra\n\nKendrick Lamar feat SZA — Luther\n\nChappell Roan — The Subway\n\nRosé & Bruno Mars — APT\n\nAlbum of the year\n\nBad Bunny — Debí Tirar Más Fotos\n\nJustin Bieber — Swag\n\nSabrina Carpenter — Man's Best Friend\n\nClipse, Pusha T & Malice — Let God Sort Em Out\n\nLady Gaga — Mayhem\n\nKendrick Lamar — GNX\n\nLeon Thomas — Mutt\n\nTyler, the Creator — Chromakopia\n\nBest new artist\n\nOlivia Dean\n\nKatseye\n\nThe Marias\n\nAddison Rae\n\nSombr\n\nLeon Thomas\n\nAlex Warren\n\nLola Young\n\nBest pop vocal album\n\nJustin Bieber — Swag\n\nSabrina Carpenter — Man's Best Friend\n\nMiley Cyrus — Something Beautiful\n\nLady Gaga — Mayhem\n\nTeddy Swims — I've Tried Everything But Therapy Pt 2\n\nBest pop solo performance\n\nJustin Bieber — Daisies\n\nSabrina Carpenter — Manchild\n\nLady Gaga — Disease\n\nChappell Roan — The Subway\n\nLola Young — Messy\n\nBest pop duo/group performance\n\nCynthia Erivo & Ariana Grande — Defying Gravity\n\nHuntr/x — Golden\n\nKatseye — Gabriela\n\nRosé & Bruno Mars — APT\n\nSZA With Kendrick Lamar — 30 For 30\n\nBest dance/electronic recording\n\nDisclosure & Anderson .Paak — No Cap\n\nFred again.., Skepta, & PlaqueBoyMax — Victory Lap\n\nKaytranada — Space Invader\n\nSkrillex — Voltage\n\nTame Impala — End Of Summer\n\nBest dance/electronic album\n\nFKA Twigs — Eusexua\n\nFred again.. — Ten Days\n\nPinkPantheress — Fancy That\n\nRüfüs Du Sol — Inhale / Exhale\n\nSkrillex — F*** U Skrillex You Think Ur Andy Warhol But Ur Not!! <3\n\nBest dance/pop recording\n\nSelena Gomez & Benny Blanco — Bluest Flame\n\nLady Gaga — Abracadabra\n\nZara Larsson — Midnight Sun\n\nTate McRae — Just Keep Watching\n\nPinkPantheress — Illegal\n\nBest traditional pop vocal album\n\nLaila Biali — Wintersongs\n\nJennifer Hudson — The Gift Of Love\n\nElton John & Brandi Carlile — Who Believes In Angels?\n\nLady Gaga — Harlequin\n\nLaufey — A Matter Of Time\n\nBarbra Streisand — The Secret Of Life: Partners, Volume 2\n\nBest Latin pop album\n\nRauw Alejandro — Cosa Nuestra\n\nAndrés Cepeda — Bogotá (Deluxe)\n\nKarol G — Tropicoqueta\n\nNatalia Lafourcade — Cancionera\n\nAlejandro Sanz — ¿Y ahora qué?\n\nBest música urbana album\n\nBad Bunny — DeBÍ TiRAR MáS FOToS\n\nJ Balvin — Mixteip\n\nFeid — Ferxxo Vol X: Sagrado\n\nNicki Nicole — Naiki\n\nTrueno — Eub Deluxe\n\nYandel — Sinfónico (En Vivo)\n\nBest rock performance\n\nAmyl and The Sniffers — U Should Not Be Doing That\n\nLinkin Park — The Emptiness Machine\n\nTurnstile — Never Enough\n\nHayley Williams — Mirtazapine\n\nYungblud ft Nuno Bettencourt, Frank Bello, Adam Wakeman, II — Changes (Live From Villa Park) Back To The Beginning\n\nBest rock song\n\nNine Inch Nails — As Alive As You Need Me To Be\n\nSleep Token — Caramel\n\nHayley Williams — Glum\n\nTurnstile — Never Enough\n\nYungblud — Zombie\n\nBest rock album\n\nDeftones — Private Music\n\nHaim — I quit\n\nLinkin Park — From Zero\n\nTurnstile — Never Enough\n\nYunglbud — Idols\n\nBest alternative music album\n\nBon Iver — Sable, Fable\n\nThe Cure — Songs Of A Lost World\n\nTyler, the Creator — Don't Tap the Glass\n\nWet Leg — Moisturizer\n\nHayley Williams — Ego Death At A Bachelorette Party\n\nBest alternative music performance\n\nBon Iver — Everything Is Peaceful Love\n\nThe Cure — Alone\n\nTurnstile — Seein' Stars\n\nWet Leg — Mangetout\n\nHayley Williams — Parachute\n\nBest metal performance\n\nDream Theater — Night Terror\n\nGhost — Lachryma\n\nSleep Token — Emergence\n\nSpiritbox — Soft Spine\n\nTurnstile — Birds\n\nBest rap performance\n\nCardi B — Outside\n\nClipse, Pusha T & Malice feat Kendrick Lamar & Pharrell Williams — Chains & Whips\n\nDoechii — Anxiety\n\nKendrick Lamar feat Lefty Gunplay — TV Off\n\nTyler, the Creator feat Teezo Touchdown — Darling, I\n\nBest melodic rap performance\n\nFridayy feat Meek Mill — Proud Of Me\n\nJID feat Ty Dolla $ign & 6Lack — Wholeheartedly\n\nKendrick Lamar with SZA — Luther\n\nTerrace Martin & Kenyon Dixon feat Rapsody — WeMaj\n\nPartynextdoor & Drake — Somebody Loves Me\n\nBest rap song\n\nDoechii — Anxiety\n\nClipse, Pusha T & Malice feat John Legend & Voices of Fire — The Birds Don't Sing\n\nTyler, the Creator feat GloRilla, Sexyy Red & Lil Wayne — Sticky\n\nGloRilla — TGIF\n\nKendrick Lamar feat Lefty Gunplay — TV Off\n\nBest rap album\n\nClipse, Pusha T & Malice — Let God Sort Em Out\n\nGloRilla — Glorious\n\nJID — God Does Like Ugly\n\nKendrick Lamar — GNX\n\nTyler, the Creator — Chromakopia\n\nCountry\n\nBest country solo performance\n\nTyler Childers — Nose On The Grindstone\n\nShaboozey — Good News\n\nChris Stapleton — Bad As I Used To Be\n\nZach Top — I Never Lie\n\nLainey Wilson — Somewhere Over Laredo\n\nBest country duo/group performance\n\nMiranda Lambert and Chris Stapleton — A Song To Sing\n\nReba McEntire, Miranda Lambert, Lainey Wilson — Trailblazer\n\nMargo Price & Tyler Childers — Love Me Like You Used To Do\n\nShaboozey & Jelly Roll — Amen\n\nGeorge Strait & Chris Stapleton — Honky Tonk Hall Of Fame\n\nBest country song\n\nTyler Childers — Bitin' List\n\nShaboozey — Good News\n\nZach Top — I Never Lie\n\nLainey Wilson — Somewhere Over Laredo\n\nChris Stapleton — A Song To Sing\n\nBest contemporary country album\n\nKelsea Ballerini — Patterns\n\nTyler Childers — Snipe Hunter\n\nEric Church — Evangeline vs The Machine\n\nJelly Roll — Beautifully Broken\n\nMiranda Lambert — Postcards From Texas\n\nBest R&B performance\n\nJustin Bieber — Yukon\n\nChris Brown feat Bryson Tiller — It Depends\n\nKehlani — Folded\n\nLeon Thomas — Mutt (Live From NPR's Tiny Desk)\n\nSummer Walker — Heart Of A Woman\n\nBest R&B song\n\nKehlani — Folded\n\nSummer Walker — Heart Of A Woman\n\nChris Brown feat Bryson Tiller — It Depends\n\nDurand Bernarr — Overqualified\n\nLeon Thomas — Yes It Is\n\nBest R&B album\n\nGiveon — Beloved\n\nCoco Jones — Why Not More?\n\nLedisi — The Crown\n\nTeyana Taylor — Escape Room\n\nLeon Thomas — Mutt\n\nBest African music performance\n\nBurna Boy — Love\n\nDavido feat Omah Lay — With You\n\nEddy Kenzo & Mehran Matin — Hope & Love\n\nAyra Starr feat Wizkid — Gimme Dat\n\nTyla — Push 2 Start\n\nProducer of the year, non-classical\n\nDan Auerbach\n\nCirkut\n\nDijon\n\nBlake Mills\n\nSounwave\n\nSongwriter of the year, non-classical\n\nAmy Allen\n\nEdgar Barrera\n\nJessie Jo Dillon\n\nTobias Jesso Jr\n\nLaura Veltz",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-11-08/queensland-health-review-into-gold-coast-mental-health-service/105983904",
        "title": "Review to assess 'quality' of Gold Coast mental health service",
        "publish_date": "Fri, 07 Nov 2025 23:33:36 +0000",
        "category": "finance",
        "authors": [],
        "text": "Queensland's chief psychiatrist has commissioned a review of the Gold Coast Child and Youth Mental Health Service.\n\nIf you or anyone you know needs help: Lifeline on 13 11 14\n\nSuicide Call Back Service on 1300 659 467\n\nBeyond Blue on 1300 224 636\n\nHeadspace on 1800 650 890\n\nReachOut at au.reachout.com\n\nJohn Reilly announced the review on Saturday, which he said came after the suicide of two young people in the past five years who had received care at the service based at Robina Hospital.\n\n\"It's important to note that this is a service improvement review, not an investigation into any deaths or individual cases,\" Dr Reilly said.\n\nThe review has been ordered in accordance with the Mental Health Act 2016, after a request by Gold Coast Hospital and Health Service chief executive Ron Calvert.\n\n\"It will focus on the model of care currently adopted by the service and identify any opportunities to improve the care provided and mitigate preventable harm,\" Dr Reilly said.\n\nThe service provides care to more than 260 \"consumers\".\n\nPush for any findings to be made public\n\nA four-person team, led by experienced youth psychiatrist Paul Denborough, who has held peak health roles in Victoria, will assess the capacity and quality of care pathways of the service, as well as identify areas for improvement.\n\nDr Reilly will determine whether the findings can be publicly released once the review is completed.\n\nMs Fentiman is calling for the report to be released once completed so Queenslanders \"have an understanding\" of the issues. (ABC News)\n\nOpposition treasurer Shannon Fentiman welcomed the review but said it was important any reported findings were promptly released.\n\n\"We welcome this review, I can't think of anything more important than making sure our young people who are experiencing mental health challenges are safe,\" she said.\n\n\"Obviously, we'll await the report. I really hope the [health] minister releases that promptly.\"\n\nOne of the busiest services in the state\n\nThe announcement of a review came after an ABC investigation into the way Queensland Health's Gold Coast mental health service had responded when its mental health patients died by suicide in the community.\n\nJonathan died at 28, but a review of his care said parts 'worked well' Queensland Health is criticised for moving away from holding independent investigations into patient suicides on the Gold Coast in favour of in-house probes that let treating staff review the care.\n\nThe service is one of the busiest in the state, dealing with numerous complex mental health patients — including many seriously ill teenagers at extreme risk of suicide.\n\nFormer Queensland Health staff, patients' families, advocates and experts in patient safety and mental health have raised concerns with the ABC about whether the service followed all appropriate official policies and procedures, and if the best possible care was being provided.\n\nAmong the concerns raised with the ABC was whether official departmental investigations into patient deaths were exhaustive and had led to failures, mistakes or problems being exposed and improved.\n\nTeen's final message to health service met with silence The ABC has uncovered the case as part of an examination of Gold Coast Hospital and Health Service's treatment of mental health patients and their suicides.\n\nThe state's health department and Gold Coast Hospital and Health Service have vigorously rejected claims that it failed to appropriately respond to patient deaths, or there were any significant problems with the treatment being provided.\n\nQueensland Health has previously told the ABC it used the most appropriate methodology to review a clinical incident and respond to people at risk of suicide and when incidents occurred.\n\nA Gold Coast Hospital and Health Service spokesperson said the nature of mental health was often highly complex.\n\n\"The tireless work of dedicated clinicians to provide high-quality and safe care is paramount,\" they said.\n\n\"Despite best efforts, clinical incidents can occur.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-11-08/the-wright-brothers-comics/105978078",
        "title": "New Wright Brothers take flight creating comics for kids",
        "publish_date": "Fri, 07 Nov 2025 23:23:47 +0000",
        "category": "finance",
        "authors": [],
        "text": "Marlow and Carter Wright kneel beside each other at the dining table, drawing their cartoon characters on a giant piece of cardboard.\n\nThis is where the young brothers' initial idea for their books usually starts.\n\nCurrently working on book three in a series of six, Marlow, nine, and Carter, 10, never actually set out to write a comic book.\n\n\"We were reading lots of comics and graphic novels from our school library and then decided that we wanted to write a book,\" Carter said.\n\nFrom the initial idea to the published work. (Supplied: Maddi Wright)\n\nTheir mum, Maddi Wright, was happy to support their dream but made an agreement with them that they had to stick it out to the end.\n\nShe has now turned their ideas into hardcover, self-published comic books, printing 5,000 copies of their first book and 2,000 copies of the second.\n\nThey have sold more than 2,500 books and donated 500 to school libraries, hospitals and an aged care home.\n\nIllustrations of a work in progress. (Supplied: Stu Thornton)\n\nIt is no wonder the books resonate with kids: the stories are full of fart jokes, snot balls, undead monster sharks, stink-eyed butt dragons, smelly armpits, quicksand and treasure maps.\n\nNearly all the characters have unusual superpowers, such as chilli farts or an electric-shock jock, and the places have cool names, like Diarrhoea Darklands, Venom Valley and The Donut Desert.\n\n\"I often hear the boys giggling with their mates when they read it,\" Maddi said.\n\n\"Basically, it's written by kids, for kids.\"\n\nMarlow interacts with customers for his books at a market stall. (Supplied: Maddi Wright)\n\nTurning an idea into reality\n\nWanting to turn Carter and Marlow's drawings into a real comic book, Maddi went in search of a professional comic book artist.\n\nStu Thornton from 4th Monkey answered the call and is now the official illustrator of the Poo Head books.\n\n\"Maddi has a huge following on social media, and my wife is one of her followers,\" he said.\n\n\"She saw that Maddi was looking for a cartoonist on Facebook and told me to contact her, so I did.\"\n\nPoo Heads illustrator and cartoonist, Stu Thornton, loves the boys' imagination. (Supplied: Stu Thornton)\n\nCarter and Marlow send pages over as soon as they draw them, and Stu sends them back the next morning to edit and approve.\n\nMaddi then sticks each page to their hallway wall, creating a work-in-progress storyboard of their current book.\n\nLoading...\n\n\"I stuck the pages on the wall so the boys would see it every time they walked past and be reminded to work on it,\" she said.\n\n\"I print off the finished page Stu sends and swap it with their hand-drawn page so they can see the book develop.\"\n\nMaddi said the storyboard had been a real motivator for the boys.\n\nThe storyboard in the hallway as the latest book develops. (Supplied: Maddi Wright)\n\nWhat's in a name?\n\nBeing a NewsCorp News Award finalist three times and a winner once for Headline of the Year while working for newspapers, Stu said the importance of a headline or title could not be underestimated.\n\nHe said the book Captain Underpants by Dav Pilkey resonated with young readers because of the catchy name, so he encouraged Carter and Marlow to choose a fun name for their book.\n\nThe boys chose Poo Heads, and kids seem to love it.\n\nMarlow draws a character before Stu brings the characters to life. (Supplied: Maddi Wright)\n\nTheir main characters are a bat called Tab, a seagull called Gully and a human called Lloyd, named after their dad.\n\nAnd there are all sorts of other weird and wonderful characters that pop up.\n\nYoung readers around Australia are clearly loving the characters. So much so that many dressed as characters from the Poo Heads books for Book Week this year.\n\nPublishing their own comic books has been a great experience for the family. (Supplied: Maddi Wright)\n\nMaddi said it had been heartwarming to receive such positive feedback since publishing the books.\n\n\"I've had teachers, parents and speech pathologists reach out and say our books have encouraged struggling readers to start reading,\" she said.\n\n\"I didn't realise the impact we would have.\"\n\nThe appeal of comics\n\nDavid Blumenstein, the deputy president of the Australian Cartoonist Association, agrees that comic books are attractive to kids because they are visually appealing.\n\n\"Most kids often draw in the back of their school books when people are not watching them anyway,\" he said.\n\nDavid Blumenstein from the Australian Cartoonist Association says comics have a wide appeal. (Supplied: David Blumenstein)\n\nHe was encouraged to hear of kids like Carter and Marlow creating their own comic books and said that, with the rise of AI, there was a need for illustrators who still created comics rather than just becoming AI manipulators.\n\n\"We are actually seeing more people read comics now because they're being published by book publishers and you don't have to go to a comic shop to buy them,\" he said.\n\nMaddi said while book publishing was a new venture for their family, it had given her a chance to teach the boys about business.\n\nMaddi Wright packs books to send to Poo Heads customers. (Supplied: Maddi Wright)\n\nThey have learned about customer service, public speaking, doing interviews, running workshops, book signings, and attending book festivals and markets.\n\n\"I don't think the boys understand the gravity and impact they're having on other kids,\" she said.\n\n\"Maybe, when they are older, they will look back and think, 'We did that.'\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-11-08/wa-government-to-win-over-australia-with-gst-deal-review/105973500",
        "title": "Saffioti says attack the best form of defence in protecting GST deal",
        "publish_date": "Fri, 07 Nov 2025 23:14:18 +0000",
        "category": "finance",
        "authors": [],
        "text": "WA's treasurer says there is absolutely no compromise on the table with other states and territories ahead of a looming GST review, arguing the existing deal \"should be the minimum\".\n\nRita Saffioti and Premier Roger Cook started their GST offensive this week with the launch of a $1 million campaign aimed at educating the eastern states coinciding with a visit to the nation's capital.\n\nThe pair wanted direct reassurance from Prime Minister Anthony Albanese WA's current GST carve up won't be touched ahead of a Productivity Commission review into the distribution, which is not due to produce a final report until the end of 2026.\n\nWA Premier Roger Cook and Treasurer Rita Saffioti say the state government is prioritising investment in health infrastructure. (ABC News: Luke Stephenson)\n\n\"We don't want to be on the back foot,\" Ms Saffioti told Stateline.\n\n\"We don't want to be responding to attacks or further attacks from the eastern states about a GST deal … [I] absolutely trust the prime minister and the federal government, but what we want to do is make sure that we stop or blunt the attacks from the eastern states.\"\n\nThe WA government wants 2018 reforms by the Morrison government that gave the state at least 75 cents for every dollar of GST revenue to stay put, signalling there's no wiggle room.\n\nRoger Cook says Anthony Albanese recommitted to maintaining WA's share of the GST. (ABC News: Adam Kennedy)\n\n\"We still contribute $2.5 billion each year to the other states, so the minimum for us is to keep the existing deal,\" Ms Saffioti said.\n\nHeavy hitters show support\n\nThe state government has been on the front foot since Federal Treasurer Jim Chalmers released the terms of reference for the GST review in September, however Ms Saffioti rejects the suggestion WA's attack was premature.\n\n\"The submissions are due by February, so there's a lot of work being done,\" she said.\n\nMs Saffioti says the GST review has raised eyebrows in the business and industry sectors. (ABC News: Kenith Png)\n\n\"We've also had a lot of engagement from industry in WA.\n\n\"We've got WA industry wanting to back and be loud on our message to protect our GST deal.\"\n\nHow does GST work? Goods and services tax (GST) is a broad-based tax of 10% on most goods, services and other items sold or consumed in Australia.\n\nThe Australian Government helps put state governments in a position to provide their residents with comparable services by distributing revenue from the goods and services tax pool according to need.\n\nIt is the job of the Commonwealth Grants Commission to advise the Australian Government on how the GST pool should be distributed. Source: Australian Taxation Office and Commonwealth Grants Commission.\n\nThe treasurer said she had some \"very interested big business figures\" rounded up to help with her GST fight — mining magnate Andrew 'Twiggy' Forrest, property developer Nigel Satterley and businessman Michael Chaney to name a few.\n\nContentious issue\n\nShe may have the support from some heavy hitters, but WA's GST deal continues to face a battering from states and territories, with many arguing others are paying the price for WA's special deal.\n\nIt's something Ms Saffioti flatly refutes.\n\n\"Well, they don't because through the no-worse-off guarantee, they are in the similar position as they would be without the deal,\" she said.\n\n\" So they're not paying the price and the other point, too, is that they actually benefit through the higher iron ore prices in WA. \"\n\nMs Saffioti argues other states are \"better off\" with the current deal because 90 per cent of iron ore royalties are redistributed to them, backed up by the federal government.\n\nMs Saffioti rejects suggestions other jurisdictions are paying the price for WA's GST deal. (ABC News: Kenith Png)\n\nBut eastern states critics still think the current deal produces a healthy WA surplus and argue it's not \"working for Australia\" as the government's advertisements suggest.\n\n\"Absolutely it works for Australia,\" Ms Saffioti said.\n\nCritics argue WA's GST deal isn't working for Australia. (AAP)\n\n\"One of our key messages is that a strong WA economy helps drive a strong national economy and also helps the federal budget bottom line.\"\n\nWhere to from here?\n\nMs Saffioti has butted heads with those critics in recent weeks — namely Tasmanian economist Saul Eslake.\n\nMr Eslake has labelled WA's current deal \"the worst public policy decision of the 21st century\", arguing WA is not spending any more than other states on economic infrastructure.\n\nSaul Eslake describes WA's GST deal as \"the worst public policy decision of the 21st century\". (ABC News: Ebony ten Broeke)\n\n\"No, he actually got that wrong. So when you look at the total public sector, he just measured the general government sector,\" Ms Saffioti quipped.\n\n\"When you factor in total public sector, including our government utilities, we actually spend the highest on economic infrastructure.\"\n\nAs for other GST models such as distribution per capita, Ms Saffioti said WA would be even better off.\n\nMs Saffioti says a GST per capita model would see WA receive even more of the distribution. (ABC News: Kenith Png)\n\n\"A GST per capita would see WA getting more GST, and so a GST per capita would see WA getting another $2.5 billion,\" she said.\n\n\"Some states have argued for that, and of course we would back [that] if that's where people want to go, we would back that in.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-11-08/sarah-ferguson-faces-uncertainty-after-30-years-of-bad-headlines/105972406",
        "title": "As King Charles banishes Andrew, some say Fergie 'won't go quietly'",
        "publish_date": "Fri, 07 Nov 2025 22:58:04 +0000",
        "category": "finance",
        "authors": [],
        "text": "It was on the couch of an opulent apartment in Mayfair, one of London's wealthiest areas, that Sarah Ferguson hit one of her lowest ebbs.\n\nCigarette in hand, she sat in front of a half-drunk bottle of wine and $US40,000 ($61,000) in cash.\n\nFerguson had just agreed to provide a foreign businessman access to Prince Andrew, her ex-husband, in return for a payment of half a million British pounds ($1.01m).\n\n\"That opens up everything you would ever wish for,\" she told the man.\n\n\"I can open any door you want, and I will for you.\"\n\nHowever, that foreign businessman was an undercover journalist secretly recording the interaction for the now-defunct British tabloid News of the World.\n\nSarah Ferguson was covertly filmed by a tabloid journalist posing as a business entrepreneur in 2010. (Supplied)\n\nThe story caused headlines around the globe when the footage came out in May 2010, and laid bare the financial issues Ferguson had been facing.\n\n\"I very deeply regret the situation and the embarrassment caused,\" she said in a statement released shortly after it was revealed.\n\nFergie tells Oprah of drunken sting Sarah Ferguson has told Oprah Winfrey she was drinking and \"in the gutter\" during a videotaped sting in which she apparently offered to sell access to her ex-husband, Prince Andrew.\n\n\"It is true that my financial situation is under stress, however, that is no excuse for a serious lapse in judgement and I am very sorry that this has happened.\"\n\nShe later said she had been drinking and was \"not in my right place\".\n\n\"It was an extraordinary scandal,\" historian and royal biographer Andrew Lownie told the ABC.\n\n\"No-one thought that she could come back for it, but within weeks she was on Oprah, she was basically saying she was a victim that she had sort of learned her lesson.\"\n\nDespite the negative headlines, Ferguson bounced back and eventually found herself back in Queen Elizabeth's good graces.\n\nFerguson was entrusted by the late Queen to take care of her corgis Sandy and Muick after her death. (Instagram: sarahferguson15)\n\n\"She was plausible, she was outgoing, she was a bit of fun telling jokes and so on,\" Peter Thompson, who wrote the biography Fergie Confidential, told the ABC.\n\n\"And that was all a facade.\"\n\nA lifetime of debt\n\nThe News of the World sting painted a picture of the depths Ferguson was willing to go to to get money.\n\nAnd for the former duchess of York, getting into large debt stretches back decades — as far back to the breakdown of her marriage with former prince Andrew Mountbatten Windsor in the early 1990s.\n\n\"The financial woes of Sarah Ferguson go back a long way,\" Lownie said.\n\n\" I think very soon after she became a member of the royal family, she realised that she was in the sweetie shop and she could go wild. \"\n\nFerguson, seen here driving past paparazzi amid publicised financial woes in 1996, was rarely out of the headlines. (AP: Max Nash)\n\nAccording to Lownie's book Entitled: The Rise and Fall of the House of York, Ferguson liked to spend big — often racking up tens of thousands of pounds of bills at luxury London department stores like Harrods and Selfridges.\n\n\"She lived very extravagantly with extensive staffs in very expensive rented homes, often renting things when she could have been cheaper to buy them,\" Lownie said.\n\n\"Often missing flights and then not having them refunded.\n\n\"I mean, there are talks of literally 25 suitcases of things that she would bring back as excess luggage and a special car having to come to carry them all with coat hangers and stuff in them.\"\n\nAnd when she couldn't pay, sometimes it was her mother-in-law, the Queen, stepping in to help pay those debts off.\n\nBut by the time she and Andrew officially divorced in 1996, the Queen's patience had run out, leading to Buckingham Palace putting out an astonishing statement to distance the royal family from Ferguson's financial dealings.\n\n\"The Queen has made a generous provision to the Duchess of York over a number of years,\" a palace spokesperson said at the time.\n\n\"Her business ventures are conducted quite separately from any royal duties, and any transactions resulting from them must be resolved between the Duchess and her business associates and creditors.\"\n\nAround that time, the money she owed was reported to be anywhere from one to five million British pounds.\n\nBooks and charitable causes\n\nSarah Ferguson poses with two of her children's books at her book signing in Pasadena, California, in December 1996. (AP: Holly Stein)\n\nAmid her split with Andrew, Ferguson's career as an author was taking off, first with children's books before moving onto autobiographies and self-help books, which coincided with her career as a spokesperson for the US weight loss company Weight Watchers.\n\nAnd like Princess Diana, Ferguson got involved in multiple charities, even setting up several of her own, including one named Sarah's Trust.\n\n\"There were these two twin strands to her money-making,\" Lownie said.\n\n\"One was to basically be a brand ambassador for anyone who would pay her and often with very close royal links. It was always 'Her Royal Highness, Duchess of York', she would actually have things like the 'Duchess Collection' of biscuits.\n\nBiscuits and tea promoted by Ferguson as part of the 'Duchess Collection'. (Facebook/The Duchess Collection)\n\n\"She also realised that she could use a position in charities and also to raise money, and this is particularly true in places like the Middle East.\"\n\nBut by the late 2000s her financial issues were again spiralling out of control and she was facing bankruptcy.\n\nHartmoor, a US company she set up to deal with her business and charitable activities in America, was forced to fold with debts in the millions.\n\n\"There were too many expensive members of staff in expensive accommodation, and the whole thing collapsed,\" Lownie said.\n\nFerguson, seen here in 2006 in her role as global ambassador for Children's World Day, was involved with dozens of charities. (AP: Elizabeth Dalziel)\n\n\"And rather than go bankrupt, which would be very embarrassing, she did sort of vow to pay back some of the creditors, though only a very small percentage of the money they were owed.\n\n\"This then made her vulnerable to borrowing money, or actually, more often, just taking money off people. And one of the main people she got money off was Jeffrey Epstein.\"\n\nFalling into Epstein's web\n\nWhile Ferguson admitted to accepting 15,000 British pounds from the convicted sex offender in March 2011, the UK newspaper Mail on Sunday reported it had seen emails from Epstein claiming to have bankrolled the former duchess for 15 years.\n\nSex offender Jeffrey Epstein, who took his own life in prison 2019, gave Sarah Ferguson money. (7.30 Report)\n\nIn September this year the same newspaper published an email Ferguson sent to Epstein in April 2011, describing him as a \"steadfast, generous and supreme friend\".\n\n\"[It] explains why she wrote the grovelling email,\" Thompson said.\n\n\"You don't do that sort of thing under normal circumstances, when a man is exposed as a paedophile.\n\n\" You distance yourself from him permanently, and there she was grovelling. \"\n\nA spokesperson for Ferguson said at the time it was only sent to \"assuage Epstein and his threats\" in relation to a previous interview she had done distancing herself from him and apologising for taking his money.\n\nMultiple charities severs tie with Duchess of York The decisions come after British media reported that the Duchess had described the disgraced financier as a \"steadfast, generous and supreme friend\" in a 2011 letter.\n\nThe email led to a host of charities cutting links with Ferguson and was the first in a cascade of leaked correspondence between her, Andrew and Epstein that ultimately saw the duke and duchess have their titles removed.\n\nThe ABC tried to contact Sarah's Trust for comment about Ferguson's role at the organisation but the charity's email address bounced back and the listed phone number was not connected.\n\nWhat next for 'Fergie'?\n\nDespite their 1996 divorce, Ferguson has been living with her ex-husband at the 30-room Royal Lodge on the Windsor Great Park estate since 2003.\n\nRoyal Lodge is a large mansion on the estate surrounding Windsor Castle. (Reuters)\n\nBut with King Charles stripping Andrew Mountbatten Windsor's royal titles last month and banishing him to Windsor from the end of 2025, Ferguson too will be looking for a new home.\n\n\"Sarah Ferguson is the great Houdini — she does escape from these things and bounces back, but it's difficult to know what's going to happen,\" Lownie said.\n\nPrince Andrew to lose title and leave Royal Lodge Prince Andrew will have his royal titles removed and surrender the lease of the Royal Lodge on the grounds of Windsor.\n\nWhile it is expected Andrew will move to a property on King Charles's personally owned estate Sandringham, there has been no word on Ferguson's next movements.\n\n\"She doesn't seem to have any friends, she doesn't have any money,\" Thompson said.\n\n\"She really needs her daughters [Beatrice and Eugenie] to do something and to rally around and look after her.\n\nPrincesses Beatrice and Eugenie have retained their royal titles despite their parents becoming commoners. (Instagram/sarahferguson15)\n\n\"The prospect of her writing a book would be one the family's worried about.\"\n\nLownie also thinks the world may not have heard the last of the former duchess.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-11-08/salt-n-pepa-inducted-into-rock-and-roll-hall-of-fame/105986642",
        "title": "Salt-N-Pepa's musical influence recognised by Rock & Roll Hall of Fame",
        "publish_date": "Fri, 07 Nov 2025 22:23:40 +0000",
        "category": "entertainment",
        "authors": [],
        "text": "Right now, women in hip hop are \"eating\" — as they say in the biz — meaning new-school artists like Cardi B, Doja Cat, and Megan Thee Stallion are thriving.\n\nThe level of commercial success and recognition experienced by so many female rappers these days was made possible because others paved the way.\n\nThis weekend, one of those acts, Salt-N-Pepa, will be inducted into the Rock & Roll Hall of Fame along with Cyndi Lauper, Outkast, the White Stripes, Soundgarden, Joe Cocker, Chubby Checker, and others.\n\nAs superstar female rappers in hip hop's male-dominated golden era, Salt-N-Pepa are credited with bringing fun, fashion and femininity to the genre.\n\nThe group is made up of Cheryl \"Salt\" James, Sandra \"Pepa\" Denton and Deidra \"DJ Spinderella\" Roper.\n\nSpinderella filed an unsuccessful lawsuit against the other band mates in 2019 over alleged unpaid royalties, but Salt told cleveland.com they have reconciled, describing the \"Spin situation\" as \"so long over\".\n\nThe three will perform together at the induction ceremony.\n\nSpinderella will be the first female DJ to be inducted into the Hall of Fame.\n\nSalt-N-Pepa are more than just hip hop royalty, and their impact stretches beyond the rap community — the ensemble also crossed over into the pop world, influencing men and women, alike, globally.\n\nBut Salt told The New York Times they at first struggled to be taken seriously.\n\nFounded in 1985 by James and Denton, they were originally called Super Nature, and, along with DJ Latoya Hanson, released the single The Show Stoppa (Is Stupid Fresh) in response to Doug E Fresh and Slick Rick's The Show.\n\nThey had been asked to record the song by Hurby \"Lu Bug\" Azor for his class project, and he would become their long-time producer and manager.\n\nThe song reached Billboard's R&B chart.\n\nA name change came later in 1985 after the group scored a record deal.\n\nSpinderella replaced Hanson in 1987.\n\nThe group reportedly sold more than 15 million albums worldwide.\n\nCheryl \"Salt\" James (left), Sandra \"Pepa\" Denton and Deidra \"DJ Spinderella\" Roper at the 37th annual Grammy Awards. (AP Photo: Mark J. Terrill)\n\nSalt-N-Pepa won Best Rap Performance by a duo or group for None of Your Business at the 37th annual Grammy Awards in 1995 — the first female rap acts to do so along with Queen Latifah, who won the Best Rap Solo Performance award that same year.\n\nSalt-N-Pepa were also awarded a lifetime achievement Grammy in 2021.\n\nThey were honoured with a star on the Hollywood Walk of Fame in November 2022.\n\nEligible since 2010, their induction into the Hall of Fame is in the musical influence category.\n\nFrom Push It to Let's Talk About Sex, Salt-N-Pepa's singles have spice\n\nWith its catchy, upbeat, electronic beats, the song Push It became a massive crossover success, but it was first released on the B-side of the single Tramp in 1987.\n\n\"It wasn't even meant to be a hit,\" Salt said when reflecting on the track's success.\n\n\"And then a DJ turned Tramp over and started playing it, and then all of a sudden, it's the biggest Salt-N-Pepa song ever.\"\n\nSalt-N-Pepa at the Sisters In The Name Of Rap Concert in New York City in 1991. ( Photo by Al Pereira/Getty Images/Michael Ochs Archives)\n\nThe meaning of the song has been widely debated with members of the group clarifying that its primarily about dancing and confidence, rather than being suggestive.\n\nIt appears as the 13th track on the album A Salt with a Deadly Pepa released in Australia in 1988.\n\nSalt-N-Pepa are the queens of catchy singles — Whatta Man, Shoop, I'll Take Your Man, and My Mic Sounds Nice, but their most impactful song is arguably Let's Talk About Sex.\n\nIt samples I'll Take You There by the Staple Singers and canvasses safe sex, media censorship and the positive and negative sides of sex.\n\nThere is a line in the song where Salt says, \"Yo, Pep, I don't think they gonna play this on the radio,\" but play it on the radio they did. Over and over again.\n\nThe group also released a PSA version of the song called Let's Talk About AIDS.\n\nBy using their platform to address a critical public health issue, Salt-N-Pepa helped normalise conversations around sex and challenged the stigma around HIV/AIDS at the height of the epidemic.\n\nRock & Roll Hall of Fame Class of 2025\n\nBad Company\n\nCarol Kaye\n\nChubby Checker\n\nCyndi Lauper\n\nJoe Cocker\n\nLenny Waronker\n\nNicky Hopkins\n\nOutkast\n\nSalt-N-Pepa\n\nSoundgarden\n\nThombell\n\nWarren Zevon\n\nThe White Stripes\n\nThe 2025 Rock & Roll Hall of Fame Induction ceremony will be streamed live on Disney+ from 12pm AEDT Sunday, November 9.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-11-08/tennis-sabalenka-to-face-rybakina-in-wta-finals-decider/105987334",
        "title": "Sabalenka to face Rybakina in WTA Finals title decider",
        "publish_date": "Fri, 07 Nov 2025 21:56:23 +0000",
        "category": "sports",
        "authors": [],
        "text": "World number one Aryna Sabalenka has booked a WTA Finals title showdown with Elena Rybakina, with both players eyeing off their first season-ending championship win.\n\nSabalenka advanced to the tournament decider in Riyadh by defeating Wimbledon and US Open runner-up Amanda Anisimova, 6-3, 3-6, 6-3.\n\nRybakina came from a set down to beat Jessica Pegula, 4-6, 6-4, 6-3, reaching the final with an undefeated record at the King Saud University Sports Arena.\n\nKyrgios to face Sabalenka in Dubai exhibition Nick Kyrgios and Aryna Sabalenka are to star in the latest man-vs-woman tennis match, with Kyrgios following several notable Australians in doing so.\n\n\"It's going to be another powerful match,\" Sabalenka said as she looked ahead to her ninth final of the season.\n\n\"I feel like today was great preparation for Elena and I'm looking forward to leaving everything I have [on court] in the last match of the season and fight for this beautiful trophy.\"\n\nAfter gruelling early exchanges with Anisimova, the rematch of September's US Open final swung in favour of Sabalenka when she surged to a 5-3 lead in the first set.\n\nShe turned up the aggression from the baseline to take the opening set in an hour.\n\nSabalenka found herself on the back foot in the second set when Anisimova reeled off the opening four games and it was a matter of time until the match went into a decider.\n\nA flurry of aces saw Sabalenka hold for 3-3 in the third set and she grabbed the decisive break in the next game with a huge backhand winner.\n\nSabalenka survived some nervous moments at the end, before seeing off her American opponent.\n\nIn the earlier semifinal, Pegula secured the opening set thanks to Rybakina's 25th unforced error.\n\nBut there was a sudden shift in momentum in the next set as Pegula found herself 1-4 behind and in danger of being dragged the distance.\n\nPegula recovered her rhythm and pushed hard in her bid to draw level in the set, but Rybakina responded strongly in the 10th game to force a decider.\n\nThey swapped breaks again in a tight battle, before a forehand into the net from Pegula at the end of the eighth game handed the advantage back to Rybakina.\n\nRybakina held in the next game to sealed the victory.\n\n\"It was such a tough battle … I'm glad I managed to find my way in the second and win it in a three-set battle,\" Rybakina said.\n\n\"My serve helped me when I needed it. I was trying to stay focused on each point when we had some tough rallies.\n\n\"In the end I managed to push myself a bit more.\"\n\nReuters",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-11-08/the-believers-amateur-english-cricket-club-gambia-national-team/105929550",
        "title": "How these English amateur players made it to international cricket",
        "publish_date": "Fri, 07 Nov 2025 21:43:21 +0000",
        "category": "sports",
        "authors": [],
        "text": "For years, players at the Believers Cricket Club (BCC) were hearing \"you guys are not good enough\".\n\nBCC is a London-based amateur cricket team that's made up of players who didn't make the cut for their local sides.\n\nIt was established in 2008 by player Matthew Hawkes and operated successfully for about ten years.\n\nThen COVID hit, the captain moved abroad, and the club was on the verge of collapse.\n\nThat's when current captain Ben Geffen stepped in.\n\n\"I always dreamed of playing Test cricket for England, but, like most of my mates, I gave up on that dream pretty quickly when there was a mismatch between my dream and my ability,\" Geffen said.\n\nGeffen's dream of playing international cricket was finally realised, albeit in a different way. (Supplied: Ben Geffen)\n\nSo a new dream came about while Geffen was watching YouTube videos of a famously average Romanian cricketer called Pavel Floren.\n\n\"He really was quite terrible,\" Geffen said.\n\n\"But I loved the fact that he didn't care and did what he loved without fear.\n\n\"I also had no idea the Romanians played cricket [so] I spent the next few hours googling loads of lesser-known countries that play.\n\n\"We may not be able to play for our own country, but we might just be able to play against another country.\n\n\"[I] thought if Pavel can do it, why can't we?\"\n\nGeffen reached out to more than 50 countries asking to play their national teams.\n\n\"I sent a bunch of emails not thinking anyone would actually reply,\" Geffen said.\n\nBut to his shock a few countries did.\n\nDreams of international cricket come true\n\nThe BCC has already embarked on tours of Romania and Slovenia, and is off to West Africa this month to play the Gambian national team.\n\nThe Believers have already taken on Slovenia and Romania. (Supplied: Ben Geffen)\n\nThe team suffered hefty defeats in both Romania and Slovenia. But as player James Hutcherson puts it, particularly in Slovenia, there were other factors at play.\n\n\"These were largely the result of excessive alcohol consumption and a dodgy souvlaki at Lake Bled,\" Hutcherson said.\n\n\"This year the preparation has been good and I think after having travelled all the way to Africa we will be hungry for a series win.\n\n\"To now be taking on Gambia is, I think, pushing the Believers to the next level.\"\n\nThe team consists of players with varying degrees of ability.\n\n\"To a Believer's novice I would describe the team as something similar to a British and Irish Lions squad, in all respects, apart from the playing standard,\" Hutcherson said.\n\n\"We are a bunch of friends, from all walks of life, playing for the love of the game.\"\n\nThe Believers on their tour of Romania. (Supplied: Ben Geffen)\n\nGeffen agrees, adding the team doesn't take themselves too seriously.\n\n\"We really are a mix, but the most important thing is, regardless of background and ability, we all give it our best shot,\" he said.\n\n\" The only thing that happens when someone drops a catch is everyone bursts into laughter. \"\n\nInspiration meets comedy\n\nBCC has played six games this year so far, but the snippets of their journey have been strangely inspiring — or comedic, depending how you look at it.\n\nIn their first match BCC limited the opposition to 109 runs before chasing down the 110-run target with six wickets remaining.\n\nInterestingly they played without bails, having forgotten them, and won it with only nine players on the field.\n\nStream End Game with Tony Armstrong on ABC iview Tony Armstrong tackles Australia's overdue reckoning with racism in sport with the help of some of its biggest sports stars.\n\nTheir second match was against former Believers players who no longer represent the club.\n\n\"I thought this would be a comfortable victory, but it was instead a comfortable loss,\" Geffen said.\n\nThey lost to the Legends by five wickets.\n\nThe third match was one to forget, but the learning was immense. The BCC played against an under-16 schoolboys' team and suffered a thumping 142-run loss after getting all out for 169 while chasing a mammoth 312.\n\n\"The only positive was their coach sat down with his boys after the game and mentioned that if any of them could go on to play cricket in their 30s with the same love and spirit we showed, then he'd consider that a success,\" Geffen said.\n\nMatch four was the day after Ben's wedding. The Believers suffered a heartbreaking loss after being all out for 134 while chasing a 227-run total.\n\nThe team held their cricket bats high at Geffen's wedding, showing their support for each other off the pitch. (Supplied: Ben Geffen)\n\nMatch five was called off after Chiswick double-booked the game.\n\nAnd match six was played against Peper Harrow, who have a long history with cricket.\n\nThe club finished the season with a victory, despite three first-time players all receiving golden ducks.\n\nThe team's experiences have been so colourful a documentary is now in production to help share their story.\n\nFrom the field to the screen\n\nJai Sarvesh is directing the film and says the team gave him Lagaan (Bollywood movie) vibes.\n\n\"Each team member was a distinct character in their own right,\" Sarvesh said.\n\n\"One guy holds the bat like a baseball bat and can only hit the ball if it's a full-toss.\n\n\"Everyone has a cricketing character inside them and I've never seen a team enjoy their game so much like the Believers do.\"\n\nMudit Agarwal owns the company producing the documentary and says the entire process has been eye-opening.\n\nLoading Instagram content\n\n\"I was never much of a cricket fan myself, but over time, being around the team has been like a slow poison,\" he said.\n\n\"I've started developing a real interest, and I've grown to love the drama, the emotions, and the way the game binds people together.\"\n\nWhat's truly evident is that the players share a special bond.\n\nAsh Silva, who is vice-captain of the team — and who hopes to emulate Lankan legend Kumar Sangakkara one day — says the Believers go beyond the game of cricket.\n\n\"The club doesn't just mean something to me, it's a part of me,\" Silva said.\n\n\" When I arrived and our team was worse than a group of pensioners I knew I'd found the right place. \"\n\nSilva hopes to win one international match with the team.\n\nHe believes that it's what they need for a lifetime of stories.\n\nVaishnavi Iyer is a sports journalist based in India, working at IANS. She has a love of covering cricket.\n\nABC International Development's Women in News and Sport Initiative is funded by the Australian Department of Foreign Affairs and Trade through the Team Up program.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-11-08/below-hobart-bank-arcade-is-tasmania-earliest-building/105964274",
        "title": "A CBD basement hides the remains of Hobart's oldest-known building",
        "publish_date": "Fri, 07 Nov 2025 21:27:49 +0000",
        "category": "finance",
        "authors": [],
        "text": "Behind a 1920s facade near the crossroads of Hobart's epicentre is a building hiding the earliest-known European-built structure in Tasmania.\n\nDating to 1805, when the young colony of Hobart Town was struggling to survive, the remains of the first merchant building are from a time when there were no roads.\n\nWhat the private store would have looked like in 1805, when it opened 18 months after the settling of Hobart Town. (Supplied: John Short)\n\nThe timber and brick building was replaced a year later with one of stone.\n\nThe 1806 building's ornate stone window — carved with care with vertical grooves to keep off the weather — was once at street level.\n\nThe remains of the window frame and building can now be found hidden away two metres below ground in the basement of the Bank Arcade on Liverpool Street, in Hobart's CBD.\n\nHow the stone replacement building from 1806 would have looked. (Supplied: John Short)\n\nOriented towards the harbour, it once looked out over a bend in the town's freshwater rivulet and onwards to Hunter Island.\n\nWhat remains of the stone building is well preserved. Along with the window, other features survived — an eight-metre-long stone shopfront, a doorframe, sandstone lintel and multiple timber beams.\n\nAnd digging below that, the foundation and footings of the earlier timber building can be seen.\n\nMr Short sits on the windowsill of the early colonial building. (ABC News: Maren Preuss)\n\nThe importance of the find — partly buried under rubble in a basement — is not lost on the building's current owner, archivist and custodian John Short.\n\n\"We rely a lot on colonial artwork to show us what early buildings look like. Well here, we can actually see it,\" Mr Short said.\n\nThis early print from 1821 shows Hobart Town 16 years after the store was built.\n\nHow did a window get to be 2m below ground?\n\nThe answer lies in Hobart's hilly topography.\n\nIn its earliest days when the rivulet was the main form of goods transport, the township had pedestrian tracks not roads.\n\nWhen Governor Macquarie set about creating a city grid of seven straight streets in 1811, the survey made little allowance for the land's natural contours.\n\nHobart Town's grid-like seven streets seen in this 1879 woodcut map. (AC Cooke)\n\n\"They had to over time smooth out those lumps and bumps to make the street trafficable,\" Mr Short said.\n\n\" It must have been very difficult to travel up and down these hills with your horse and cart. It wouldn't have been logical to do so. \"\n\nA street-levelling project soon began, with dips in the road in-filled. The store was in one such dip.\n\nRemnants of the old storefront still exist. (ABC News: Maren Preuss)\n\nArchitectural historian Warwick Oakman helped Mr Short to peel back the building's layered history.\n\n\"Up until very recently, buildings were not fully demolished,\" Mr Oakman said.\n\n\"If there was a cellar they built upon that. Now if we're going to build a big tower block we go well beyond the earliest archaeology in a big dig out.\n\n\"I suggest there are a lot more early kernels of Hobart fragmented and built up upon.\"\n\nJohn Short examines the stonework of the old building. (ABC News: Maren Preuss)\n\nBuilding's history unfolds\n\nToday, the Bank Arcade fronts Liverpool Street, but Mr Short said the building predated the street.\n\nThe first clue was its orientation.\n\nWhile neighbouring buildings run perfectly parallel to the street, the Bank Arcade \"is on a five-degree angle. It's a bit skewiff,\" Mr Short said.\n\n\"If it had been more than that, they would have got rid of it.\"\n\nThe building's timber joists were thriftily repurposed in other parts of the growing structure. (ABC News: Maren Preuss)\n\nOther clues were 1805-era nails driven into timber framework and timber beams branded with the name William Collins, the colony's first harbourmaster and merchant.\n\n\"Some of the timber that we've found, with the joists and floorboards, will be the oldest bits of sawn timber that we have.\n\n\"It's on a national scale now. You're looking at very few buildings in Sydney that would be older than that.\"\n\nMr Short checked the \"CWM\" mark against Hobart's early sawmills to confirm it belonged to merchant William Collins. (ABC News: Maren Preuss)\n\nFrom shingled room to five floors\n\nOver the centuries, the building grew as it was shaped by its nine successive owners.\n\n\"They needed it a bit bigger so they built out to the sides, they dug downwards, they went upwards, they went out the back,\" Mr Short said.\n\nA sketch of the rear of the Bank Arcade as it would have been from 1860–1957, the early stone building in the basement is shown in yellow. (Supplied: John Short)\n\nAt its height in the 1860s —and then known as Whitesides — the humble store had become a grand building. Newspaper stories of the time told of its grand construction.\n\nWhile it remains a large, multi-room complex with 29 tenancies, it has become dwarfed and hemmed in by surrounding buildings.\n\nToday's Bank Arcade is a main shopping thoroughfare. Its current layout dates predominantly from a 1950s renovation with its cluster of shops linking Liverpool Street with Wellington Court at the rear.\n\nWhitesides building 1898, now known as the Bank Arcade on Liverpool Street, Hobart, seen on the left with the sign. (Supplied: John Short)\n\nBut as shoppers bustle through, evidence of two centuries of continuous use surround them.\n\nA mostly intact 1950s dance hall with pressed tin ceiling and small stage lives on in a subterranean space.\n\nOther tenants drifted in and out over the years.\n\n\"The cabaret starts its life as the Victoria tea rooms, and it has a set of stairs going down to the basement. Then the cafe changes its name to the Lido, so the cabaret becomes The Lido cabaret,\" Mr Short said.\n\n\"By 1944 it's become the Lido grocer. So we have an upstairs shop selling tobacco and other goods, then a grocery downstairs. We then become the Lido toy store. Then, the Lido dolls hospital.\"\n\nBank Arcade building, Liverpool st, Hobart pictured in 1955. (Supplied: John Short)\n\nIt's about the stories of the occupants\n\nFor Mr Short, the building's stories are its heritage.\n\n\"It's not the edifice building. It's the people who built it, the people who lived in it, the people who worked in it,\" he said.\n\n\"The building is more a reflection of the people, and not the other way around.\n\n\"You keep following their tracks and learning more and more about those people.\"\n\nOne of his favourite stories to recount is how the building lost its early Georgian facade in a minor collapse, an event well documented in The Mercury newspaper.\n\nThe Mercury newspaper detailed the collapse of the facade.\n\nIt was during a retrofit of the store's street frontage in 1925.\n\n\"The builder duly removed some bricks at ground level, put up some supports and went off to North Hobart football ground,\" Mr Short said.\n\n\" Allegedly, the vibration from a tram rattling past was enough to bring the whole thing crashing down. \"\n\nBuilding's story still to come to light\n\n\"You're really only someone who is passing through,\" says building custodian John Short. (ABC News: Maren Preuss)\n\nOver time, Mr Short would like the shop's history to be more accessible.\n\nOpen House southern midlands showcases homestead In Tasmania's Southern Midlands, Alan Townsend has spent years restoring an 1800s agricultural homestead This weekend, its doors will be open for people to visit.\n\nHe hopes his tenure as caretaker has helped to preserve its colonial foundations for future generations.\n\n\"As the story of the history of the building starts to unfold, your own role in it become less and less,\" he said.\n\n\"You're really only someone who is passing through. It's really looking to how you can put something back into the building.\"\n\nThe Bank Arcade will be open November 8 and 9 as part of Open House Hobart.\n\nTours have booked out, but many other historically interesting buildings in Hobart will be open without bookings including Alexandra Battery, Anglesea Barracks, Princes Park signal station and the underground concourse at Hobart Town Hall.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-11-08/act-inside-the-race-to-restore-unique-1939-art-deco-theatre/105980190",
        "title": "Inside the race to restore Yass's unique 1939 art deco theatre",
        "publish_date": "Fri, 07 Nov 2025 21:19:50 +0000",
        "category": "finance",
        "authors": [],
        "text": "Towering above the main street in the New South Wales country town of Yass is an art deco treasure with a peeling facade and a storied history.\n\nDesigned in an 'ocean liner' style, the 700-seat Liberty Theatre opened in 1939 with great fanfare.\n\nThe theatre was a cultural hub for Yass when it opened in 1939. (Supplied)\n\nFor 35 years the cinema was a cultural hub, hosting everything from comedies to thrillers, news reels and even banking services.\n\nIt was common for couples to take their wedding photos in the theatre's lounge. (Supplied)\n\nThe theatre's lounge became a popular spot for couples taking their wedding photos.\n\nBut the cinema screened its final movie in 1974, unable to compete with the growing popularity of television.\n\n\"It's had so many iterations since the cinema closed,\" lifelong local Janno Scanes said.\n\n\"It's been offices, it's been a skating rink.\n\n\"You name it, it's been here — but nothing ever lasted very long.\"\n\n'Huge job' ahead\n\nThe Liberty Theatre became dilapidated over the years of disuse. (ABC News: Lily Nothling)\n\nOver the years, the heritage building has fallen into a state of disrepair.\n\nA group of volunteers, called the Friends of the Liberty Theatre, is working to revitalise the cinema and preserve its legacy.\n\n\"The Liberty Theatre is a unique building,\" the group's Jo Mulligan said.\n\n\"We understand that there's only two of this particular design that have survived through to today.\"\n\nJo Mulligan says the Liberty Theatre is one of just two buildings that still exists with its design. (ABC News: Lily Nothling)\n\nThere is a long road ahead, and the job is expected to cost several million dollars.\n\n\"It's a huge job … because it's an old building,\" Ms Mulligan said.\n\n\"She's structurally sound, we've had engineers do an assessment … but she needs some work, and we do need to replace the roof as well.\"\n\nCinematic homecoming\n\nIn a major milestone, the group recently installed a new state-of-the-art cinema screen and projector.\n\nIt means the movies have returned to Yass for the first time in 51 years.\n\nJanno Scanes says it was very emotional to see the Liberty Theatre filled with people again. (ABC News: Lily Nothling)\n\nFor Ms Scanes, who grew up watching films at the Liberty Theatre, seeing the seats filled again is a marvel.\n\n\"It's actually very emotional, because it's been a long hard road to get here,\" she said.\n\nThe early screenings were a sellout, with residents flocking to the theatre for a novel night out.\n\n\"I think the whole district is behind it, and the whole community is delighted to see it happening,\" local Ian Wearing said.\n\nAn early screening at the Liberty Theatre was the first time local Kellie Mossop had been in the cinema. (ABC News: Lily Nothling)\n\nKellie Mossop has lived in Yass for 20 years, but had never stepped foot in the theatre until now.\n\n\"It's very special,\" she said.\n\n\"We spend plenty of time going into Canberra to watch the movies, so I think it's lovely.\"\n\nPlans are underway to introduce a more regular film schedule.\n\nLong-term vision\n\nThe Friends of Liberty Theatre are currently trying to buy the building and put it in a community trust. (ABC News: Lily Nothling)\n\nThe Friends of the Liberty Theatre group is raising money to buy the theatre from its private owners.\n\nThe committee envisages the theatre becoming an arts hub for the community.\n\n\"Having a cinema back in Yass means the community can come together, and there's a sense of pride as well,\" Ms Mulligan said.\n\n\"We want to be able to purchase it and protect it for the community, so putting it in a community trust, to remove any threat of somebody else having a different vision for the site or the building.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-11-08/elon-musk-tesla-shareholder-meeting-trillion-dollar-payday/105985856",
        "title": "Elon Musk's quest for trillions is merely a means to an end",
        "publish_date": "Fri, 07 Nov 2025 21:17:19 +0000",
        "category": "finance",
        "authors": [],
        "text": "The world's richest man emerged triumphant from a gathering of the faithful on Friday with a new goal — to out-earn everyone else on the planet over the course of the next decade.\n\nHis believers, some of whom were calling for his overthrow just months ago, once again have agreed to enrich the Tesla boss to levels far beyond the realm of ordinary billionaires.\n\nIf he can pull it off, Musk may become the world's first trillionaire. To get there, he must deliver on an arduous 12-point plan that will put Tesla, and hence Musk, into a position of global domination.\n\nIt's a position that will only partly be determined by his fabulous wealth.\n\n\"What we're about to embark upon is not merely a new chapter of the future of Tesla, but a whole new book,\" he told the congregation.\n\nThe storyline for Musk's new narrative is more science fiction than corporate mission statement and it was on full display at Friday's meeting in Austin, Texas.\n\nSure, there's cars, electric ones and self-driving at that. But it was the humanoid robots attending the meeting that hinted of a bold new world.\n\nKnown as Optimus, they bore a striking similarity to Musk's demeanour.\n\nElon Musk unveils humanoid robot Elon Musk says the robots will initially do boring or dangerous jobs, but says there's still a lot of work to be done before they hit factory floors.\n\nThere's the thousand-yard stare, not to mention the lack of emotion and the jerky head rolls — characteristics the Tesla founder used to full effect during his brief time as Donald Trump's slash-and-burn man.\n\nHis brief tenure in the White House as the head of the Department of Government Efficiency and the near-devastating impact it had on the company was just a receding memory on Friday, soon to be consigned to the vaults.\n\nThis was no time to be discussing the alienation of Tesla's natural target market – relabelled as \"woke\" – and the accompanying alarming drop in Tesla sales for most of the past year, nor the impact of US tariffs and stiff global competition from Chinese and European competitors.\n\nInstead, the faithful lapped up the vision and the promise of fabulous riches, of which they were only too eager to sling a greater share to their leader.\n\nDonald Trump and Elon Musk's partnership created a lot of controversy. (Reuters: Brandon Bell/pool)\n\nFriends and enemies\n\nWhat do you do when you're publicly ostracised for being too greedy?\n\nIf your name is Elon Musk, you don't just double down; you employ the 10X Rule.\n\nIn 2018, Tesla shareholders voted to deliver their leader a $US50 billion ($77 billion) pay cheque (now valued at $US125 billion – $192 billion – at today's share prices), an agreement that ultimately was struck down by the courts.\n\nChancellor Kathaleen McCormick of the Court of Chancery in Delaware declared that negotiations over the package had been inappropriate, highlighting a lack of independence from board members and undue influence by Musk.\n\nThere's an old saying that \"Delaware is to corporations as Liberia is to ships\", particularly when it comes to taxation and entrenching the power of incumbents.\n\nTexas, however, is more lax when it comes to shareholder votes and Tesla since has moved its registered address to the Lone Star State.\n\nRobyn Denholm has continued to back Elon Musk. (Reuters: Christine Chen)\n\nMusk, despite being the biggest shareholder with 15 per cent and being the beneficiary of the package, was allowed to vote on the motion.\n\nOnce again, Tesla chairwoman Robyn Denholm went into bat for Musk, publicly advocating a yes vote.\n\nAn Australian and a former senior executive at Telstra, her net worth in recent years has ballooned to just shy of a billion dollars, courtesy of her shares in the electric vehicle manufacturer.\n\nElon Musk's DOGE agency explained There has been an escalation in the legal battles over billionaire Elon Musk's new US government efficiency agency. Here's what we know about DOGE.\n\nWhile small shareholders and a good many institutions overlooked Musk's recent transgressions, there were some notable opponents.\n\nIt's not often the pope weighs into boardroom tussles, especially annual meeting resolutions.\n\n\"Yesterday, the news [said] that Elon Musk is going to be the first trillionaire in the world,\" Pope Leo XIV noted in his first interview after his ascendance to the pinnacle of the Catholic Church.\n\n\"What does that mean, and what's that about?\n\n\" If that is the only thing that has value anymore, then we're in big trouble. \"\n\nHe was in good company. Proxy advisory firm Institutional Shareholder Services urged shareholders to vote against the package, while the world's biggest national wealth fund, Norges Bank, announced it would vote against the deal.\n\n\"We are concerned about the total size of the award, dilution and lack of mitigation of key person risk — consistent with our views on executive compensation,\" it said. \"We will continue to seek constructive dialogue with Tesla on this and other topics.\"\n\nBut to no avail.\n\nStriking a blow for humanity\n\nLoading\n\nWhen it comes to the papacy, Musk has a closer relationship than most.\n\nHe had a private audience with Pope Francis in May, shortly before his death, and was quick to fire back a retort to Pope Leo on his X account, with a scripture quote that alluded to hypocrisy, given the incredible wealth accumulated by the Church.\n\nElon Musk became CEO of the electric car company in October 2008. (ABC News: Daniel Mercer)\n\nAt Friday's shareholder meeting, however, Musk attempted to soothe the new pontiffs concern with his vision for the future of humanity.\n\n\"People often talk about eliminating poverty, giving everyone amazing medical care,\" he told the gathering.\n\n\"Well, there's actually only one way to do that, and that's with the Optimus robot.\n\n\"You start getting into, like, some pretty wild sci-fi sort of scenarios.\"\n\nThe message echoed his previous claims to altruism as his primary motivation.\n\nShortly after he snapped up Twitter (then to become X), he claimed he made the move \"to help humanity\" and improve free speech.\n\n\"Free speech is the bedrock of a functioning democracy and Twitter is the digital town square where matters vital to the future of humanity are debated,\" he said.\n\nWhile most attention to Friday's events focused upon Musk's potential trillion-dollar pay packet and the hurdles to achieve that, a more troubling picture of the man may be emerging.\n\nX, DOGE and his obsession with humanoids speak volumes about Musk's view of the world and his vision of where he should sit.\n\nThe money is merely a means to an end.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-11-08/gestational-diabetes-pregnant-women-postnatal-care/105978200",
        "title": "Mum shocked after being diagnosed with gestational diabetes as diagnoses rise",
        "publish_date": "Fri, 07 Nov 2025 21:10:55 +0000",
        "category": "lifestyle",
        "authors": [],
        "text": "Marketing manager Christine Newton can't believe how much joy little Indiana has bought into her life.\n\nBut her first pregnancy was frightening for her after she was diagnosed with gestational diabetes at 28 weeks.\n\n\"It was definitely terrifying once you find out and then told of the risks that come with diabetes, it is a shock,\" the 36-year-old said.\n\n\"The potential of still birth, premature birth, having a bigger baby and jaundice.\n\nMs Newton had support from her partner Ryan Miller. (Supplied: Christine Newton)\n\n\"I was also thinking, what have I done to get this, what could I have done better, have I hurt little bub?\n\n\"I was also very surprised as I am a healthy person, but I was happy to tackle the disease.\"\n\nOne in five pregnant women diagnosed\n\nStatistically Ms Newton is among \"one in five\" of pregnant women diagnosed with gestational diabetes.\n\nA patient at Australia's largest maternity hospital The Mater Mothers in Brisbane, she was put onto a management plan where she had to test her glucose levels four times a day.\n\nShe used an app co-designed by the CSIRO called \"Mother\" to log and send data to nutritionists — who helped create a diet and exercise regime to reduce sugar levels.\n\n\"I was definitely worrying about my fasting levels, that I would have to have insulin when I woke up every day,\" Ms Newton said.\n\n\"But I managed that with the help of the team, especially the nutritionists.\"\n\nStatistically she was \"one in five\" of pregnant women diagnosed with gestational diabetes. (Supplied: Christine Newton)\n\nCute as a button, Indiana is now two weeks old and doing just fine.\n\nMs Newton is still managing her diet and exercise regime, along with the sleepless nights that come with newborns.\n\nAssociate Professor Jo Laurie, who is director of obstetrics at the Mater, said there had been a dramatic increase in diagnosis over the last five years of 70 per cent.\n\nJo Laurie says there has been a dramatic increase in the diagnosis of gestational diabetes. (ABC News: Mark Leonardi)\n\n\"Women often feel like they are at fault when they get diagnosed, and quite concerned they have done something,\" she said.\n\nShe said the spike was partly due to hormonal differences from the placenta, but it had also been put down to women being older in their first pregnancy; possibly overweight and not doing enough exercise.\n\nStaggering rise in cases needing injections\n\nData shows a third need insulin injections for their entire pregnancies, while the remaining 70 per cent can treat the disease with diet and sometimes tablets.\n\nAssociate Professor Laurie said there was also a danger postpartum with women at risk of kidney and heart disease in the future.\n\nIndiana is two weeks old and doing just fine. (Supplied: Annette Dew )\n\nThey also have a 30 per cent to 50 per cent chance of developing type 2 diabetes within 10 to 15 years.\n\nWhile Christine's gestational diabetes went away after she gave birth, she is now being monitored for risk factors in the long term through the Mater's new postnatal clinic.\n\nWhile Ms Newton is still managing her diet and exercise regime, along with the sleepless nights that come with newborns. (ABC News: Mark Leonardi)\n\n\"We see them in the first year after the pregnancy and have clear links with their GPs\", she said.\n\n\"We were one of the first, and leader in Australia, and it is being championed now in other facilities.\n\n\"Unlike a lot of care and medical research for men this has been missing for women. We are trying to be advocates for women's health.\"\n\nRegular insulin testing helps manage gestational diabetes. (ABC News: Mark Leonardi)\n\nExtremely concerning epidemic\n\nDiabetes Australia's chief medical officer professor David Simmons said the spike was extremely concerning, with lifestyle reasons mostly driving it.\n\n\"It is extremely concerning, we do not want these large numbers of people having these kind of risks\" he said.\n\nProfessor David Simmons says Australia is lagging behind some countries when it comes to subsidising new diabetes technologies. (Supplied)\n\n\"One of the things we have picked up is that a large number come into pregnancy with pre-diabetes or impaired glucose tolerance.\n\n\"And later on during the pregnancy there is a surge of insulin resistance and that adds a further number of women who can't make enough insulin for their own needs.\n\n\"The larger they are the more risk they have of getting gestational diabetes.\n\n\"And as you get older you do not make enough insulin when pregnant\".\n\nHe said there was a global debate about how high blood glucose levels should be, before a doctor should raise a red flag.\n\n\"Glucose levels fluctuate, so when you draw a line and say if you are above this you have got something if you are below it then you don't you are going to miss some on either side,\" Professor Simmons said.\n\n\" You are going to over-diagnose some and under-diagnose others. \"\n\nIndiana is a happy baby. (ABC News: Mark Leonardi)\n\nNew national guidelines were introduced in 2025, and potentially affect more than 280,000 pregnant Australian women every year.\n\nThey will still have an oral glucose tolerance test, a measure of how the body processes sugar.\n\nThe test involves fasting overnight, and having a blood test in the morning before drinking a sugary drink.\n\nMums-to-be are encouraged to get regular check-ups. (ABC News: Mark Leonardi)\n\nThen there are two more blood tests over two hours. However, fewer women will have this test twice in their pregnancy.\n\nThe guidelines have been published in The Medical Journal of Australia.\n\nAs for Christine, who is still recovering from a caesarean, staying on top of her risk factors is a no-brainer.\n\nMs Newton says she is grateful Indiana passed her blood sugar tests and was able to come home quickly. (ABC News: Mark Leonardi)\n\n\"It is always there and the habits I have learnt now will help me not to get diabetes in the future I hope,\" she said.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-11-08/mildura-council-campaign-to-take-yellow-peril-art-piece/105985016",
        "title": "Victorian council aims to take Melbourne's controversial art piece",
        "publish_date": "Fri, 07 Nov 2025 21:08:14 +0000",
        "category": "entertainment",
        "authors": [],
        "text": "They say one man's trash is another man's treasure, and now the regional Victorian town of Mildura is making a play to have the controversial but iconic Melbourne sculpture \"Yellow Peril\" brought \"home\".\n\nVault was designed by Ron Roberston-Swann in 1980 and installed in Melbourne's City Square a year later.\n\n\n\n\n\nVault caused controversy in the 1980s, but Mildura wants it back. (Supplied: City of Melbourne) But the large abstract polygonal sheets of yellow steel attracted controversy from the public and media, earning it the lasting moniker \"Yellow Peril\".\n\nAt its opening, the sculpture even drew the comment from the late Queen Elizabeth II that it should be painted \"a more agreeable colour\".\n\nIt lasted just eight months in that location.\n\nThe sculpture now sits outside the Australian Centre for Contemporary Art in Southbank, but Mildura's tourism bosses say taking the sculpture from Melbourne will help prove the regional city's status as an international destination for arts and culture with its murals, laneways, coffee shops and bars.\n\n\"We believe Vault belongs back in Mildura and we want to see it looked after and get some support to bring it back to its proper home,\" Mildura Rural City Council's general manager of strategy and growth, Phil Stone.\n\n\"Unless you ask, you don't get, right?\n\n\" So, we are intentionally trying to be a little provocative here. I think that goes without saying. \"\n\nMildura Rural City Council said if it was successful, Vault would be placed next to its brother sculpture, Beethoven, on the front lawn of the Mildura Arts Centre where it would be \"respected, celebrated and loved\".\n\n\n\n\n\nBeethoven is displayed in front of the Mildura Arts Centre. (ABC News: Nethma Dandeniya) Beethoven was also sculpted by Robertson-Swann in 1968 and is one of 12 sculptures located in front of the Mildura Arts Centre.\n\n'A fair offer'\n\nThe Bring Vault Home campaign is the beginning of a wider tourism campaign portraying Mildura as the new arts and culture capital.\n\nRobertson-Swann said he was backing the rehoming of Vault to sit alongside Beethoven.\n\n\"Beethoven has lived with great respect in Mildura for more than 50 years,\" he said.\n\n\"Reuniting these works would be an appropriate and meaningful tribute to their shared history.\"\n\nMildura's deputy mayor Helen Healy said the City of Melbourne was on notice \"and a fair offer had been made\".\n\n\"Mildura feeds Melbourne every day,\" she said.\n\n\"Those trucks that deliver produce could easily return with a work of art.\n\n\"We have the community, the space and the respect to give Vault the welcome it deserves.\"\n\n\n\nThe Bring Home Vault campaign is an extension of the controversial Tropical North Victoria campaign that was launched in August last year and fronted by actor and Mildura's tourism ambassador Shane Jacobson.\n\n\n\n\n\nShane Jacobson fronted the Tropical North Victoria campaign. (Supplied: Flourish PR) The Tropical North Victoria campaign aimed to increase tourism to the region by 5 per cent a year for four years and generate more than a billion dollars in economic benefits.\n\nJacobson said Mildura was \"ready to step in and care for a piece of art that Melbourne has neglected for decades\".\n\n\n\n\"If Melbourne won't give Vault the home it deserves, Mildura will,\" Mr Jacobson said.\n\n\n\n\"Let's not forget, Melbourne once stuffed it in a storage shed like an unwanted toy.\n\n\"We've got the space, the sunshine and, frankly, the trucks are already waiting.\"\n\n\n\nIf Vault can be secured, it will add to the growing art projects in the region, which include the Trail of Lights and FOSO, which is set to open next year.\n\nThe City of Melbourne said it was unable to comment on the proposal, but in past social media posts, Lord Mayor Nick Reece has made his views on the sculpture clear.\n\n\"Love it or hate it, Vault, which is its official name, is an iconic part of our city,\" he posted on Instagram.",
        "source": "ABC"
    },
    {
        "url": "https://www.smh.com.au/sport/cricket/plenty-of-life-left-in-old-legs-hazlewood-defends-ageing-attack-as-cummins-prepares-for-brisbane-20251107-p5n8on.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Plenty of life left in old legs: Hazlewood defends ageing attack as Cummins prepares for Brisbane",
        "publish_date": "Sat, 08 Nov 2025 12:48:35 +1100",
        "category": "sports",
        "authors": [
            "Christian Nicolussi"
        ],
        "text": "If you wanted proof injured Australia captain Pat Cummins is on track for a return for the second Ashes Test at The Gabba, you only had to witness the scenes at the Sydney Cricket Ground on Saturday morning.\n\nCummins, who will miss the opening Test in Perth from November 21, was showing no signs of discomfort in his back as he steamed in and bowled a decent spell at NSW training.\n\nStand-in Australian skipper Steve Smith at one stage walked over, tossed Cummins a pink ball – the colour of choice for the day-night Test that will be played in Brisbane – before he broke into laughter.\n\nEngland can only hope they win the first match before returning to the east coast, knowing what awaits them.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/world/dashcam-footage-captures-cargo-plane-crash-20251106-p5n85x.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Dashcam footage captures cargo plane crash",
        "publish_date": "Sat, 08 Nov 2025 11:31:20 +1100",
        "category": "finance",
        "authors": [],
        "text": "Dashcam footage captures cargo plane crash\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/politics/federal/a-life-in-pictures-graham-richardson-20230606-p5debj.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "A life in pictures – Graham Richardson",
        "publish_date": "Sat, 08 Nov 2025 11:22:18 +1100",
        "category": "finance",
        "authors": [],
        "text": "13/18\n\nGraham Richardson, with his daughter Katie, salutes his standing ovation in June 1994. “For the last month I have undergone an extraordinary bar­rage, arguably the dirtiest barrage yet launched in the Australian Parliament. It tells me a lot about what I must have done, having resigned and still being a target suggests over the past 20-odd years I must have hurt those bastards. If I hurt the bastards, I am proud to have done so, they deserve every bloody bit of it.” Credit:Julian Andrews",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/lifestyle/fashion/beach-ready-fashion-starting-at-37-20251028-p5n5t8.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Beach-ready fashion starting at $37",
        "publish_date": "Sat, 08 Nov 2025 11:19:25 +1100",
        "category": "lifestyle",
        "authors": [
            "Damien Woolnough"
        ],
        "text": "This story is part of the November 8 edition of Good Weekend.\n\nWhat’s hot this summer in terms of swimwear?\n\nBottom pride is taking over Australian beaches and swimming pools, with thongs of the G-string – rather than the foot – variety surging in popularity. A sliver of fabric worn between toned buttocks requires, among other things, a liberal use of sunscreen, but there are alternatives for those who prefer greater protection against scalding sand and concrete.\n\nStand out by keeping swimwear simple – let your accessories create all the waves. Credit: Getty Images\n\nInvest in bathing suits made from quality fabrics in block colours that are actually designed for swimming rather than selfies. A well-cut bikini with brief bottoms can accentuate, or even create, curves while offering greater coverage than a thong.\n\nIf you prefer the security of a one-piece, dip into the asymmetry trend with a single-strap design, while remembering that any tan lines may attract interest in a strapless top the next day.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/politics/federal/labor-powerbroker-graham-richardson-dies-aged-76-20251108-p5n8q0.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Labor powerbroker Graham Richardson dies aged 76",
        "publish_date": "Sat, 08 Nov 2025 10:56:46 +1100",
        "category": "finance",
        "authors": [
            "Anthony Segaert",
            "Millie Muroi"
        ],
        "text": "Graham “Richo” Richardson, the longtime former Labor senator, party powerbroker and media commentator, has died at 76.\n\nHe died at 3.50am on Saturday, following weeks of influenza and pneumonia, his wife and son told 2GB Breakfast host Ben Fordham, who announced the news.\n\n“Darcy and Amanda have asked me to share the news with everyone that sadly Richo has passed away in the early hours of this morning,” Fordham said.\n\nFamed Labor powerbroker Graham Richardson has died. Credit: Ben Appleton\n\nRichardson served as a NSW senator in federal parliament between 1983 and 1994. He was, at the time, the youngest elected senator, aged 33 when he first arrived at parliament.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/world/north-america/repeating-bell-heard-in-ups-plane-s-cockpit-as-drone-footage-reveals-crash-devastation-20251108-p5n8pu.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘Repeating bell’ heard in UPS plane’s cockpit as drone footage reveals crash devastation",
        "publish_date": "Sat, 08 Nov 2025 10:50:27 +1100",
        "category": "finance",
        "authors": [],
        "text": "Louisville: A repeating bell sounded in the cockpit for 25 seconds as pilots tried to control a UPS cargo plane that caught fire, had an engine fall off and crashed during take-off this week in Louisville, Kentucky, a National Transportation Safety Board member said on Friday.\n\nThe cockpit voice recorder captured a persistent bell that began about 37 seconds after the crew called for take-off thrust, and the bell continued until the recording ended, which investigators believe was the final point of impact, NTSB member Todd Inman said.\n\nInman said there could be different types of alarms with varying meanings, but investigators know there was a fire in the plane’s left wing and will use flight data to help determine a clearer picture of what happened.\n\nOn Friday, the NTSB released drone footage showing the devastation on the ground caused by the burning plane crashing through a swath of industrial buildings, including a petroleum recycling facility.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/lifestyle/princess-anne-expected-to-touch-down-in-australia-20251108-p5n8pp.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Princess Anne expected to touch down in Australia",
        "publish_date": "Sat, 08 Nov 2025 09:40:41 +1100",
        "category": "lifestyle",
        "authors": [],
        "text": "Princess Anne expected to touch down in Australia\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/culture/music/oasis-perform-in-sydney-first-show-of-sold-out-concerts-20251108-p5n8pv.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Oasis perform in Sydney first show of sold-out concerts",
        "publish_date": "Sat, 08 Nov 2025 09:35:37 +1100",
        "category": "entertainment",
        "authors": [],
        "text": "Oasis perform in Sydney first show of sold-out concerts\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/rugby-union/respect-italy-target-ireland-how-wallabies-can-rescue-faltering-season-20251106-p5n8e6.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Respect Italy, target Ireland: How Wallabies can rescue faltering season",
        "publish_date": "Sat, 08 Nov 2025 09:30:00 +1100",
        "category": "sports",
        "authors": [
            "Paul Cully"
        ],
        "text": "The logistics of picking Wallabies from overseas, and particularly from France, are not easy – a point worth remembering by those who just want to blow the eligibility doors off.\n\nTake Will Skelton, who will again be absent against Italy – a Test that is no longer a banana skin so much as a meeting of well-matched teams, with only a fraction more World Rugby rankings points currently separating England and the Wallabies than the Wallabies and Italy.\n\nSkelton was actually playing for La Rochelle on Sunday evening, French time, due to the Top 14’s staggered scheduling – shortening his preparation time to the point that it was too limited for the Wallabies.\n\nWhile the French could “protect” their preferred 23 from last weekend’s Top 14 round ahead of their Test against South Africa this weekend, that is not an avenue open to Australia.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/culture/music/kendrick-lamar-and-lady-gaga-lead-2026-grammy-nominations-20251108-p5n8pm.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Australian K-pop star Rosé nominated for record of the year Grammy",
        "publish_date": "Sat, 08 Nov 2025 09:18:34 +1100",
        "category": "entertainment",
        "authors": [
            "Debbie Cuthbertson",
            "Nicole Precel"
        ],
        "text": "Lamar’s nominations include record, song and album of the year – marking the third time he’s had simultaneous nominations in those big categories. He’s also nominated for pop duo/group performance, melodic rap performance, rap song and rap album. He’s also nominated twice in the rap performance category. He is due to perform in Australia next month, headlining the Spilt Milk festival, which begins in Ballarat on December 6, before heading to Perth, Canberra and the Gold Coast. Kendrick Lamar won five awards at the 2025 ceremony. Credit: Getty Images for The Recording Academy Lamar, who is riding the success of last year’s blockbuster GNX album, has 22 Grammy career wins and 66 nominations. GNX is his fifth consecutive studio album to be nominated for album of the year, something no other artist has ever done. If it wins, it will be his first win in the category. And it will be only the third rap album to win the top prize, following OutKast in 2004 for Speakerboxxx/The Love Below and Lauryn Hill in 1999 for The Miseducation of Lauryn Hill.\n\nLady Gaga is up for song, record and album of the year – her first time receiving nominations in all three categories simultaneously. She could also score potential wins in the pop solo performance, pop vocal album, dance pop recording and traditional pop vocal album categories. Lady Gaga at the MTV Video Music Awards in September. Credit: AP Antonoff is nominated in the record, album and song of the year categories twice, for his work with Lamar and Sabrina Carpenter. He’s also nominated for rap song for the first time, for TV Off with Lamar, featuring Lefty Gunplay. Antonoff and Cirkut are this year’s leading producers. However, Antonoff will not face off with Cirkut in the producer of the year, non-classical category – though he’s won it three times before. Cirkut is up for both record and song of the year twice – for Lady Gaga’s Abracadabra and Rosé and Bruno Mars’ Apt – as well as album of the year and best dance pop recording.\n\nIn addition to Lady Gaga’s Mayhem and Lamar’s GNX, the album of the year category is rounded out by Carpenter’s Man’s Best Friend, Bad Bunny’s Debi Tirar Mas Fotos, Justin Bieber’s Swag, Clipse, Pusha T & Malice’s Let God Sort Em Out, Leon Thomas’ Mutt, and Tyler, the Creator’s Chromakopia. Bad Bunny, seen performing in Puerto Rico in September 20, received six nominations. Credit: Getty Images This is the first time three albums have been up for both rap album and album of the year: GNX, Let God Sort Em Out and Chromakopia. Bad Bunny’s Debi Tirar Mas Fotos is only the second all-Spanish language album to be nominated for the top prize. The first was also a Bad Bunny release – Un Verano Sin Ti in 2023. Harry Styles’ Harry’s House won that year. Carpenter, Bad Bunny, Leon Thomas and Serban Ghenea all boast six nominations. Andrew Watt, Clipse, Doechii, Sounwave, SZA, Turnstile and Tyler, the Creator have five each.\n\nThere were also some significant snubs. Despite earning major chart success, musicians including Lorde, Gracie Abrams and Megan Moroney did not receive any nominations. Also overlooked was The Weeknd, who released his sixth studio album Hurry Up Tomorrow, which was a critical and commercial success, debuting at No.1 on the Billboard 200 chart. It also topped charts in 16 other countries. Perhaps the biggest surprise was Taylor Swift’s name missing from the list of nominees. But The Life of a Showgirl was released in October - too late to be in the running. Only recordings commercially released in the United States between August 31, 2024, and August 30, 2025, were eligible for nominations. The final round of Grammy voting, which determines its winners, will take place from December 12 until January 5. In the best new artist category, global girl group Katseye, Olivia Dean, The Marias, Addison Rae, Sombr, Leon Thomas, Alex Warren and Lola Young will all go head-to-head. The record of the year category is made up of Bad Bunny’s Debi Tirar Mas Fotos, Carpenter’s Manchild, Doechii’s Anxiety, Billie Eilish’s Wildflower, Lady Gaga’s Abracadabra, Lamar and SZA’s Luther, Chappell Roan’s The Subway and Rosé and Bruno Mars’ Apt. Some may be surprised to see Eilish included in the bunch as Wildflower was released on her 2024 album Hit Me Hard and Soft, ahead of the eligibility window. However, there is a Recording Academy rule that allows albums released during the previous ceremony’s eligibility period to be considered, “provided the same tracks were not entered the previous year and the album did not win a Grammy”, with a few exceptions. By that rule, Eilish’s Wildflower – which was not previously entered – is eligible.\n\nTimothee Chalamet, as Bob Dylan in A Complete Unknown, is up for best compilation soundtrack for visual media. Credit: Song of the year – an award for a track’s songwriters, which sometimes include the performer but not always – is made up of an almost identical list to record of the year, except Roan is replaced by Golden from the KPop Demon Hunters soundtrack. Loading “The Grammy Awards are our opportunity to honour the people who make this community so vibrant and this year’s nominees remind us of the incredible talent that is driving music forward,” said Recording Academy chief executive Harvey Mason Jr in a statement. “From emerging talent to influential icons, these nominees reflect today’s broad and diverse musical landscape and I am excited to celebrate them in the coming weeks ahead.”",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/lifestyle/beauty/from-45-to-1500-advent-calendars-for-every-budget-20251030-p5n6ge.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "From $45 to $1500: Advent calendars for every budget",
        "publish_date": "Sat, 08 Nov 2025 09:00:00 +1100",
        "category": "lifestyle",
        "authors": [
            "Nell Geraets"
        ],
        "text": "You can’t have an advent calendar guide without some chocolate. Many will remember the excitment of opening cheap, gimmicky advent calendars as a child, revealing an unidentifiable festive chocolate that tasted vaguely like plastic. Well, the Christmas chocolate industry has really levelled up, now offering a huge range of quality treats for sweet-toothed adults. And what’s says quality better than Australian made Haigh’s? For just over $50, you can feast on a selection of 24 handmade mild and dark chocolates, all of which can be tucked away in an adorable gingerbread house calendar. At the other end of the scale, there’s a $1350 version filled with a range of Haigh’s top-tier selections. Haigh’s top-tier advent calendar, $1350. Bang for buck Given the classic calendar is 150 grams and a 150 gram box of assorted Haigh’s chocolates costs a similar price, the retail value of the chocolate itself is presumably nearly on par with the purchase price. The Gourmet Collection Popcorn Advent Calendar ($44.99)\n\nThe Gourmet Collection Popcorn Advent Calendar, $44.99. Chocolate is far from the only advent calendar option for foodies these days. Myer is now offering a popcorn countdown, replete with 24 days of caramel, salted caramel and chocolate flavoured snacks. Perfect to pair with a Christmas movie marathon, perhaps? Bang for buck Myer lists no actual retail value for the advent calendar (192 grams). However, when comparing it to their 200 gram “Big Night In” caramel popcorn, which sells for $14.99, it seems rather pricey. Perhaps you’re paying for the theatrics of opening a new treat each day. And it must be noted that the calendar consists of several flavours as opposed to just one. T2 Cabinet Of Curiosity 24 Day Tea Bag Advent ($48)\n\nT2 Cabinet Of Curiosity 24 Day Tea Bag Advent, $48. Fancy a tea with that fruit mince pie? Australian tea icon T2 has once again curated a 24-day calendar that consists of a wide range of individual sachets, including some of their bestsellers. Though made up primarily of black teas (notable favourites are Melbourne Breakfast and, of course, Christmas Breakfast), it also includes an array of fruit, green and herbal teas, as well as one particularly enticing rooibos called “sticky date delight”. Bang for buck An average T2 tea bag usually costs around $1.40 (though they aren’t usually sold separately). That means the approximate value of the tea bags inside the advent calendar is around $33.60. This isn’t too steep compared to the $48, especially given the specialty packaging. Bitty Pop! Holiday Countdown Calendars ($85)\n\nBitty Pop! Holiday Countdown Calendars, $85. Christmas is the best time of year for many people, but especially for those who are kids at heart. The Funko Bitty Pop calendars will prove particularly enticing for these young souls, no matter what their particular interests. There’s a range of these mini collectible countdowns this year, including Stitch, Marvel and Disney princesses. Each contain 10 miniature collectibles, seven stackable display pieces, three holiday accessories, two keychain cases and two pin cases. Bang for buck Based on the average price of one miniature Funko collectible (around $5.99), $85 for 10 figures may sound steep. However, the calendar contains a whole swathe of accessories, which probably makes this advent calendar more or less on par with its estimated retail price. The moderate spends\n\nL’Occitane Classic Advent Calendar ($179) L’Occitane Classic Advent Calendar, $179. Not only do you get 24 items ranging from skincare to hair-care in L’Occitane’s classic calendar, but the yellow-and-white packaging is also so beautiful you won’t want to throw it away (hot tip: you could use it to store jewellery well past Christmas). Though slightly more expensive than calendars from brands like The Body Shop ($99), L’Occitane delivers their ultimate skincare favourites (like the Immortelle Overnight Reset Oil-In-Serum) to limited edition bonuses and full-size items (for example, the shea butter hand cream). Bang for buck According to the L’Occitane website, the total value of the items in their classic advent calendar is a whopping $367. That means you’re supposedly getting all the products for around half price – a great bargain for such a dependable, higher-end brand.\n\nMac’s 24 Mystery Must Haves Advent Calendar ($390) Mac’s 24 Mystery Must Haves Advent Calendar, $390. Make-up advent calendars are some of the most in-demand countdowns every Christmas season, so it’s little surprise that festive favourites from Charlotte Tilbury and Nars sold out as early as September. But fear not, there are still some stellar beauty options available, including Mac’s monster “Mystery Must Haves”. Valued at a mammoth $840, this make-up calendar includes 24 mini and full-sized items from the iconic brand, as well as limited-edition gel eye pads and gua sha tool. Mascaras, lipsticks, eyeshadows – you name it, it’s probably in it. Bang for buck This may be one of the best-value advent calendars this year given it costs less than half of its retail value. You also get it in a cool, extendable box that can be re-used for other things like make-up or jewellery storage, and which even contains a mirror. The only caveat is not every colour may be to your liking.\n\nReverie Puzzles’ Christmas Around The World Puzzle Advent Calendar ($149.99) Reverie Puzzles’ Christmas Around The World Puzzle Advent Calendar, $149.99. Many people take a break from work over the holidays, but that doesn’t mean an occasional brain-teaser is out of the question. Reverie Puzzles’ calendar consists of 24 individually packaged 99-piece puzzles, which showcase the ways Christmas is celebrated around the world (including a nod to Australia’s famous Carols by Candlelight). This calendar isn’t numbered – it’s a choose-your-own-adventure whereby the owner opens up whichever world flag speaks to them each day. Its book design and gold foil detailing also means it could make a great coffee table display every December. Bang for buck Based on the closest comparable puzzle sets sold by Reverie Puzzles, the retail value of those in the advent calendar would be approximately $300. This is only an estimate, but it still suggests good value given the calendar sells for half this price, and even comes in an aesthetic, re-useable book box.\n\nThe Book Grocer’s Advent Calendar ($180) The Book Grocer’s Advent Calendar, $180. Bookworms rejoice for The Book Grocer is offering an array of different advent calendars designed for those who want nothing more at Christmas than to settle in with a good book. Whether you love fiction, non-fiction, romance or crime, there’s a book countdown for you. They each contain 24 individually wrapped and numbered books, some of which are new and some of which are second-hand (though all in good condition). Bang for buck It’s difficult to say how worthwhile this advent calendar is without knowing the exact titles they contain (titles tend to sell for varied prices at The Book Grocer). However, if the average book costs about $19 in Australia, this calendar is presumably excellent value ($180 compared to an estimated $456). This is just an approximate guess, however.\n\nThe splurges The Australian Wool Stores’ Embroidery Yarn Advent Calendar ($225) The Australian Wool Stores’ Embroidery Yarn Advent Calendar, $225. Keen for a new hobby? There’s an advent calendar for that. Instead of just opening up something to eat, drink or spray on your body, countdowns from places like The Australian Wool Store aim to get your hands busy. The embroidery yarn calendar contains 25 mini embroidery skeins (a bundle of embroidery yarn) to be opened daily in the lead-up to Christmas, an embroidery design, sweet treats, and a couple of other surprises. The 50 per cent yak and 50 per cent silk version is for those searching for something a little more luxe, but there’s also a slightly cheaper merino version if spending more than $200 on wool feels a bit extreme.\n\nBang for buck The value here is not so much based on the weight of the yarn itself, but on having 25 individually curated and hand-dyed colours that are typically not available for sale separately, or are custom blends. Based on similar yarn advent calendars from other Australian independent dyers, where prices range from $150 to over $300, this calendar falls into a mid-to-high-end range. Glasshouse’s 24 Days of Christmas Advent Calendar ($290) Glasshouse’s 24 Days of Christmas Advent Calendar, $290. Getting into the heavy-hitters, this Glasshouse calendar is a favourite every festive season, largely due to the impressive range it features. Each of the 24 drawers contain either one of Glasshouse’s signature soy candles, a mini eau de parfums, or a bath and body product. On top of that, it also includes holiday stickers for a playful touch. Bang for your buck Glasshouse doesn’t list the retail value of their advent calendar, and it’s difficult to definitively calculate given it consists of several miniature products. That being said, the perceived value of the products inside is typically placed in the $450 to $700 range, making the $290 purchase price a strong offer for those who want to sample a wide range of their most premium products.\n\nFrancesca’s Jewellery Advent Calendar ($499) Francesca’s Jewellery Advent Calendar, $499. There’s treating yourself and then there’s buying yourself 12 pieces of jewellery in one fell swoop. Australian jeweller Francesca is offering their annual 12-day advent calendar, replete with gold-plated hoops, charms and bracelets. The gold option is the flashiest of all, but you can also get it in rose gold and silver, the last of which is $100 cheaper. Bang for buck You may be wondering, “why spend so much money on just 12 days when most other calendars are 24 days?” Well, not every advent calendar consists of gold-plated jewellery, and buying 24 pieces at once for yourself may seem … A bit much, perhaps. According to Francesca’s website, the 12 days of jewellery is valued at $838, so you’re getting it all for just over half-price.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/lifestyle/prince-harry-attends-charity-gala-in-canada-20251108-p5n8pq.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Prince Harry attends charity gala in Canada",
        "publish_date": "Sat, 08 Nov 2025 08:40:33 +1100",
        "category": "lifestyle",
        "authors": [],
        "text": "Prince Harry attends charity gala in Canada\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/lifestyle/king-charles-officially-removes-brother-andrew-s-titles-20251108-p5n8po.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "King Charles officially removes brother Andrew’s titles",
        "publish_date": "Sat, 08 Nov 2025 08:35:52 +1100",
        "category": "lifestyle",
        "authors": [],
        "text": "King Charles officially removes brother Andrew’s titles\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/toddler-dies-after-being-clipped-by-train-in-new-south-wales-north-20251108-p5n8pj.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Toddler dies after being clipped by train in New South Wales north",
        "publish_date": "Sat, 08 Nov 2025 07:35:48 +1100",
        "category": "finance",
        "authors": [],
        "text": "Toddler dies after being clipped by train in New South Wales north\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later. Dismiss\n\nOur network\n\nOpen Navigation Menu The Sydney Morning Herald",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/queensland-teachers-walk-away-from-plans-to-strike-next-week-20251108-p5n8ph.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Queensland teachers walk away from plans to strike next week",
        "publish_date": "Sat, 08 Nov 2025 07:32:09 +1100",
        "category": "finance",
        "authors": [],
        "text": "Queensland teachers walk away from plans to strike next week\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/midday-news-bulletin-8-november-2025/b2fprprhi",
        "title": "Midday News Bulletin 8 November 2025",
        "publish_date": "Sat, 8 Nov 2025 01:14:28 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/whooping-cough-vaccine-rates/fdcd1iz7d",
        "title": "'Unacceptable': Hospitals are missing opportunity to vaccinate for whooping cough",
        "publish_date": "Sat, 8 Nov 2025 01:10:37 +0000",
        "category": "lifestyle",
        "authors": [],
        "text": "New analysis has found hospitals are sleeping on an opportunity to vaccinate more Australians against whooping cough, a disease that's infecting the population at record rates.\n\n\n\n\n\nA probe from the Immunisation Foundation of Australia finds few hospitals are stocking a whooping cough-containing booster to jab patients with tetanus-prone wounds.\n\n\n\n\n\nThat's despite health guidelines recommending emergency departments use the combined vaccine in routine wound management to help boost protection against whooping cough (pertussis), with studies suggesting immunisation levels are \"concerningly low\".\n\n\n\nAustralia is in the grips of an unprecedented outbreak of whooping cough, an infection that can be life-threatening for babies and young children.\n\n\n\n\n\nAuthorities have been notified of 80,000 cases in the past two years, an all-time high.\n\n\n\n\n\nOften referred to as the '100-day cough', the bacterial infection attacks the airways and causes uncontrollable coughing and trouble breathing.\n\n\n\nIt is more contagious than the flu or COVID-19.\n\n\n\n\n\nImmunisation Foundation founder Catherine Hughes said an opportunity to boost immunisation rates against the dangerous disease was being missed.\n\n\n\n\n\n\"It's unacceptable that so many vaccines used for tetanus in Australian hospitals do not include added protection against whooping cough, despite established national recommendations,\" she said.\n\n\n\n\n\nHughes lost her 32-day-old son Riley to the disease a decade ago.\n\n\n\nREAD MORE New research on COVID vaccine and children\n\nThe probe by the vaccination advocacy group found 401 of 469 hospitals were stocking the older diphtheria and tetanus vaccine, not the one that also provides protection against whooping cough and costs a few dollars extra per dose.\n\n\n\n\n\nEarlier research has found one million adults older than 50 had been given the older vaccine rather than the recommended whooping cough combined jab when seeking tetanus protection.\n\n\n\n\n\nRaina MacIntyre, head of global biosecurity at the Kirby Institute at the University of New South Wales, said vaccinating adults was key to managing the outbreak.\n\n\n\n\"Adults are a large component of the massive pertussis epidemic we've seen unfold in Australia, so vaccination of adults is part of the solution,\" MacIntyre said.\n\n\n\n\n\n\"Whooping cough is deadly for infants but has also caused serious complications in adults.\"\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/heartbreaking-experts-argue-egg-donation-rules-could-change-to-help-australias-fertility-issues/4cd5nz1zc",
        "title": "'Heartbreaking': Experts argue egg donation rules could change to help Australia's fertility issues",
        "publish_date": "Fri, 7 Nov 2025 20:00:00 +0000",
        "category": "finance",
        "authors": [],
        "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts .\n\n\n\n\n\n\n\nTRANSCRIPT:\n\n\n\n\n\nLiz Buckley-Stokes says she always wanted to be a mother.\n\n\n\n\n\nBut it took a little longer than she expected to try to start a family.\n\n\n\n\n\n\"My husband and I were a little bit later in life getting married, so we really wanted to have children and this was the only way that we could was through egg donation. I was 47, so my age was really against me.\"\n\n\n\n\n\nLiz, who is now in her 50s and lives on the Sunshine Coast, says she joined online forums for egg donation but it took around seven months to match with a donor.\n\n\n\n\n\n\"It is quite a long, drawn-out process and it is really hard because you're putting yourself out there and you get nothing in return and it is actually really soul-destroying when you're thinking that you're never going to be a mum and you're never going to have that chance because no-one's responding to your advert.\"\n\n\n\n\n\n\n\nLiz has since had three children using eggs from the same donor: a six-year-old boy and two four-year-old twins.\n\n\n\n\n\nShe also says she's maintained a close relationship with the donor who made them possible.\n\n\n\n\n\n\"Her reasons for becoming a donor were she had actually had to go through I-V-F herself because she had had to have her fallopian tubes removed, so she understood the process and she understood the heartbreak.\"\n\n\n\n\n\nWhile the process took a while, Liz considers herself lucky to have found an egg donor at all.\n\n\n\n\n\nSince the first I-V-F babies were born in the early 1980s, the fertility industry has boomed and now around one in every 16 babies born in Australia is conceived via I-V-F, with the demand for donated eggs far outstripping their supply in Australia.\n\n\n\n\n\nMonash University's School of Public Health senior research fellow, Dr Karin Hammarberg, says increasing fertility struggles are driving demand for donated eggs.\n\n\n\n\n\n\"Generally as a population, women are having children later or start trying for a baby later than they used to. You know, the proportion of women trying in their late 30s or early 40s is much higher now than it was 20 years ago and that means the ones who approach their 40s or are in their 40s. A lot of them will struggle to conceive.\"\n\n\n\n\n\nDr Hammarberg says that often these women are directed to use donated eggs.\n\n\n\n\n\nThey can find them in one of two ways in Australia: through personal connections like Liz or through I-V-F clinics.\n\n\n\n\n\nHowever, the Doctor says altruistic donation is still relatively rare.\n\n\n\n\n\n\"Most egg donations in Australia is through a known connection, so someone comes to the clinic and they have a sister or a sister or a cousin or something who is willing to do it for this very person but is not willing to do it for just anyone. And that's where the gap is. We don't have enough people who are prepared to do all this just out of the goodness of their heart.\"\n\n\n\n\n\nWhile the exact number of people waiting for donated eggs is unknown, one survey from The University of Melbourne found that out of 59 women placed on an egg donation waiting list at an IVF clinic, only 13 received a donor egg.\n\n\n\n\n\nStephen Page is a fertility lawyer from family law firm Page Provan.\n\n\n\n\n\nHe says this demand has led people to use eggs imported from overseas.\n\n\n\n\n\n\"So, we're seeing eggs imported from the United States, Malaysia and Ukraine, among other countries.\"\n\n\n\n\n\nSome hopeful parents also travel internationally to buy eggs and undergo fertility treatment - though other countries can have different legal and ethical standards for the process.\n\n\n\n\n\nIn countries such as the U-S, for example, donors can be paid a significant sum for eggs.\n\n\n\n\n\nBut in Australia, any direct or indirect financial inducements are illegal - which Dr Hammarberg says can create what she argues is a fairly bizarre situation.\n\n\n\n\n\n\"In a setting where everyone gets paid, the doctor gets paid, the clinic gets paid the recipient pays a lot of money, the only person who doesn't get any compensation is the woman who does the actual work. And that doesn't sit well with our understanding of what's equitable.\"\n\n\n\n\n\nTo try and address the shortage of eggs, experts are now arguing Australia could change its approach to donation.\n\n\n\n\n\nIn the United Kingdom, women are not paid directly for altruistic egg donation either, but donors can receive standardised compensation of around $2,000 for each cycle to cover their costs.\n\n\n\n\n\nWomen can also claim extra compensation for expenses such as travel, accommodation, and childcare.\n\n\n\n\n\nDr Hammarberg has suggested that there could be set compensation here in Australia too.\n\n\n\n\n\n\"In a way I think there must be some sort of middle ground here where there's some kind of recognition of the effort and some kind of appreciation of the fact that the woman takes risks and she goes through all of this.\"\n\n\n\n\n\nStephen Page agrees that Australia could make some changes and suggests that women could be better informed about the possibility of eggs they have already frozen with I-V-F clinics for personal use.\n\n\n\n\n\nIt's estimated there are approximately 100,000 eggs currently sitting in storage in Australia.\n\n\n\n\n\nAnd one study that examined ten years of egg freezing in Victoria found less than 13 per cent of patients returned to use their eggs each year.\n\n\n\n\n\n\"We're having lots and lots of eggs being frozen but hardly any of those extra eggs being frozen are being donated or used. Part of the problem is we have all these eggs in storage, none of them or very few of them are being made available for donation and maybe they won't be but if some of those women are encouraged and counselled and are willing to donate, that will help solve this problem.\"\n\n\n\n\n\nMr Page says that ultimately, using eggs from local donors could make things more fair for children born from these pregnancies.\n\n\n\n\n\n\"If we think of it from the child's perspective, from the child's perspective, many donor-conceived individuals want to know where they've come from. If they know that the donor is somewhere in Australia, that makes it a lot easier. It's just really easy and simpler. They're down the road or they're in the next state, they're not on the other side of the world where I may never find them.\"\n\n\n\n\n\nHowever, it is unlikely these changes will come soon and while Australia's supply and demand issue continues, Liz says she will try to connect donors and hopeful parents on a Facebook group she now runs.\n\n\n\n\n\nShe says she sees the continued impacts of a lack of donor eggs every day.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/does-building-more-apartments-help-housing-affordability/0opkcmpj4",
        "title": "'Won't make a lick of difference': Why building apartments may not bring prices down",
        "publish_date": "Fri, 7 Nov 2025 19:33:28 +0000",
        "category": "finance",
        "authors": [],
        "text": "As property prices across Australia continue to rise, many aspiring homeowners have their hopes pinned on what has become the mantra of housing affordability — increasing supply.\n\n\n\n\n\nGovernments across the country have been working to deliver 1.2 million new well-located homes over five years as one way of unlocking quality, affordable housing.\n\n\n\n\n\nCouncil decisions to allow for larger developments in certain areas, such as Sydney's inner-west, have been welcomed by some young people who are showing up to meetings and standing against opposition to increased density, which has slowed approvals in some areas and been a barrier to delivering more homes.\n\n\n\n\n\nFigures released this week showed apartment approvals have hit a near three-year high. Australian Bureau of Statistics data shows 5,430 apartment dwellings were approved in September, the highest number since December 2022.\n\n\n\nApartment building approvals are on the rise, including for blocks of more than nine storeys. Source: SBS News But as local councils move forward with rezoning land for high-rise apartment blocks, questions have been raised around whether these projects will actually improve housing affordability.\n\n\n\n\n\nSpeaking with SBS News last month, an attendee of an Inner West Council meeting said: \"I do not believe handing over vast swathes of land to private property developers and investors is the way to solve the housing affordability crisis.\"\n\n\n\n\n\n\"Private property developers don't exist to create affordable housing — they exist to create profit for their shareholders.\"\n\n\n\n\n\nSo, will building more apartments bring down prices?\n\n\n\nRezoning impacts housing affordability\n\nWhen the City of Sydney council was deliberating over the Green Square redevelopment in the 1990s — which involved the construction of a new train station and rezoning of areas from industrial uses to mixed-use — concerns were raised about the plan's impact on housing affordability.\n\n\n\n\n\nAuthorities were concerned because rezoning generally increases the value of land. A 2012 report on the Green Square Affordable Housing Program noted this upward pressure on property values \"would raise purchase and private rental accommodation costs beyond the reach of low to moderate income households\".\n\n\n\n\n\nSince its rezoning in 1999, 179 apartment buildings have been constructed in the Green Square urban renewal area, ranging in size from three to 29 storeys.\n\n\n\nThe Green Square urban renewal area in Sydney, in which the suburbs of Alexandria, Beaconsfield, Waterloo, Zetland and Rosebery were rezoned from industrial to mixed-use and 179 apartment blocks built, is one of the biggest urban renewal projects in Australia. Source: SBS News One of the objectives of the renewal was to retain a socially diverse population, but the report observed that in the first five to 10 years, the proportion of people with well-paid jobs and higher incomes had increased in Green Square and surrounding suburbs, including Alexandria, Beaconsfield, Waterloo, Zetland and Rosebery.\n\n\n\n\n\nCensus data indicated the proportion of households with a gross yearly income of $50,000 rose from 15.1 per cent in 1991, to 21.6 per cent in 1996.\n\n\n\n\n\nMedian rents had also increased by $25 per week in just one year, from $195 (in June 1997) to $220 in June the next year. In comparison, rents in Greater Sydney had only increased by $10 (from $200 to $210) and the median rent was lower than in those five suburbs, despite originally being marginally higher.\n\n\n\n\n\nTo address this, the council developed a policy to ensure around 330 units would remain under the ownership of a community housing provider for low to moderate-income households. Developers are now required to set aside 3 per cent of residential development as affordable housing or to provide a monetary contribution towards this.\n\n\n\nA spokesperson for the City of Sydney told SBS News that 254 affordable housing units have been built in the area, with another 500 approved.\n\n\n\n\n\nThese units are rented out to eligible households for around 30 per cent of the household's income.\n\n\n\n\n\nCity West Housing, which manages the affordable housing program, generally restricts eligibility to households with a gross income of less than $138,000, although other factors, such as links to the area, can be taken into account.\n\n\n\n\n\nAffordable housing differs from social housing, which is government-subsidised long-term housing for people on very low incomes.\n\n\n\n\n\n\"Social housing is the sole responsibility of the state and federal governments and is not an area the City of Sydney has remit over,\" the spokesperson says.\n\n\n\nApartments are not always affordable\n\nDeborah Nixon, a former Redfern resident, says she was lucky to buy a one-bedroom apartment in Waterloo during the COVID-19 pandemic.\n\n\n\n\n\nHer apartment is across the road from Green Square town centre and this has allowed her to stay close to the city. But she says the unit is not particularly affordable.\n\n\n\nFor the people that really need housing, I don't think they'd find it here.\n\nWaterloo homeowner Deborah Nixon lives close to Zetland and finds it very convenient, although she would like to see more green space. Source: SBS News RMIT University urban planning lecturer Liam Davies says simply allowing more apartments to be built won't make properties affordable.\n\n\n\n\n\n\"If we take affordable housing as housing which is affordable to people on low or very low incomes, it won't make a lick of difference because all it does is stop it getting more unaffordable,\" Davies says.\n\n\n\nPeople that are priced out, won't be priced in.\n\nHe says no one would call areas such as Mascot and Green Square (in Sydney), or Docklands (in Melbourne) 'affordable' despite being areas where large amounts of new apartments have been built.\n\n\n\n\n\n\"They're just less expensive than areas like Potts Point [in Sydney].\"\n\n\n\nMany apartment blocks have been built in Docklands, Melbourne. Source: AAP / James Ross However, while extra supply doesn't automatically make housing affordable, it can keep a lid on price increases.\n\n\n\n\n\nSince 2006, the population of Zetland in Sydney has grown by almost 400 per cent, according to the latest Census in 2021, increasing from 2,614 to 12,622 people in 15 years.\n\n\n\n\n\nUnit prices in Zetland during the same time period have also grown by 92 per cent, rising from a median price of $499,000 in September 2006 to $960,000 in September 2021, according to Domain.\n\n\n\nMedian unit prices grew more slowly in areas with large amounts of apartments such as Zetland, when compared to the broader Sydney area. The same happened in Docklands compared to greater Melbourne. Source: SBS News This is lower than the 121 per cent increase across Greater Sydney, despite Zetland being located just a few kilometres from the central business district.\n\n\n\n\n\nBut the median unit price in Zetland is still higher than Sydney's overall ($805,947).\n\n\n\nSupply doesn't equal affordability, but it can help\n\nDavies says one of the reasons we can't rely on the construction of more apartments to deliver affordable housing is that developers are less inclined to build when prices are going down.\n\n\n\n\n\nBanks will also reduce lending in urban areas with price declines because they don't want to be left with bad mortgages.\n\n\n\nREAD MORE Why young people are leaving these once-booming suburbs\n\nBut KPMG urban economist Terry Rawnsley says the average dwelling price in a desirable suburb like Newtown in Sydney might come down because new apartments will be cheaper than the terrace houses already there.\n\n\n\n\n\n\"[Although] it's not necessarily cheap enough for your hospitality workers or lower-income workers to afford those properties,\" he says.\n\n\n\n\n\nRawnsley notes that apartments can also help provide a better mix of housing options, which may also help those on lower incomes.\n\n\n\n\n\nBuilding better housing for high-income earners, he says, means they'll shift to the higher quality option and leave the cheaper homes for lower-income earners.\n\n\n\n\n\nHe points out that in gentrifying areas, run-down terrace houses that may previously have been a sharehouse for three or four people have been renovated and turned into family homes.\n\n\n\nIn gentrifying areas, terrace houses that used to be home to many young renters have been renovated, making them unaffordable. Source: AAP / Bianca De Marchi \"That's part of the reason why cities have become less affordable, we sort of lost that cheap and cheerful sharehouse market,\" he says.\n\n\n\n\n\nIf the market had provided more apartments and townhouses, this would have prevented some people from being squeezed out at the bottom end of the market, Rawnsley notes.\n\n\n\nApartments don't necessarily help families\n\nThe picture can be more complicated for families.\n\n\n\n\n\nDavies says if large numbers of houses are demolished and redeveloped into townhouses or flats, prices for houses often rise significantly because they become rarer.\n\n\n\n\n\nThis has implications for families who want dwellings with at least three bedrooms, as developers often don't build large multi-bedroom apartments suitable for families.\n\n\n\nYou're increasing the supply of two-bedroom dwellings [through the construction of apartments] and maintaining those prices reasonably stably or at least halting the increases — but you're reducing the supply of three-bedroom dwellings.\n\nDomain revealed last year that prices for three-bedroom units had risen faster than for two-bedroom units.\n\n\n\n\n\nThe median price for a three-bedroom unit in Sydney is now higher than a three-bedroom house, partly because units are often more centrally located .\n\n\n\n\n\nDavies says knocking down houses to build two-bedroom units means you'll probably see fewer families living in a certain area, and more renters.\n\n\n\nWhat this means is you can have a more rotational population — people aren't going to be living there for the long haul.\n\nHe says more thought needs to be put into what Australians want their communities to look like.\n\n\n\n\n\n\"I think we need to have stricter or more rigid standards on how many of these apartments should be three-bedroom or more, to encourage more family housing,\" he says.\n\n\n\n\n\nDavies would also like to see better minimum design standards in most states.\n\n\n\n\n\n\"[Areas] always change, but we should be guided by how we want areas to change and be intentional about that.\"\n\n\n\n\n\nHe says building more mid-rise, almost Parisian-style apartments of around five storeys may be more desirable than high rises.\n\n\n\nBuildings on the Rue de Rivoli, which runs through the centre of Paris. Source: Getty / Delmarty J/Alpaca/Andia/Universal Images Group Grattan Institute modelling released on Thursday found one million homes could be unlocked in Sydney if developments of up to three storeys could be done without a planning permit (as long as they met clear standards).\n\n\n\n\n\nIt says allowing three-storey townhouses and apartments on all residential land in capital cities could lift housing construction across Australia by up to 67,000 homes a year. Over a decade this could cut rents by 12 per cent and reduce the cost of a median-priced home by $100,000.\n\n\n\nSupply needed at every level, experts say\n\nBut Davies says if the aim is to provide affordable housing for low-income earners, this is best achieved if it is built intentionally and that usually means government involvement.\n\n\n\n\n\nAs part of the N ational Housing Accord, federal, state and territory governments have agreed to build or incentivise the construction of up to 20,000 affordable homes.\n\n\n\n\n\nThis makes up just 1.7 per cent of the 1.2 million homes to be delivered over five years.\n\n\n\n\n\nBut Housing Minister Clare O’Neil says in total the government will deliver 55,000 new social and affordable homes by 2029.\n\n\n\n\n\n\"We’ve got more than 25,000 social and affordable homes in planning or construction with over 5,000 social and affordable homes completed,\" she tells SBS.\n\n\n\nFederal Minister for Housing Clare O’Neil says more than 5,000 social and affordable homes have been built in the past two years. Source: AAP / Joel Carrett However, there are concerns about the slow delivery of homes, with an audit underway into the operation of the Federal Government's Housing Australia Future Fund (HAFF), an investment vehicle established two years ago to support the construction of social and affordable housing.\n\n\n\n\n\nJust 567 homes have been built so far through the HAFF program.\n\n\n\n\n\nGreens senator Barbara Pocock has questioned why the government isn't directly funding public and community housing.\n\n\n\n\n\n\"It's faster, cheaper, and it worked the last time Australia faced a housing crisis in the post-war years. We know we can do it. We've done it before.\"\n\n\n\nREAD MORE Government housing affordability scheme under pressure\n\nFotheringham says if Australia is serious about improving affordability, it would also require every development over a certain size to include a certain number of units at an affordable rent level.\n\n\n\n\n\n\"That's common practice in several other countries or jurisdictions,\" he says.\n\n\n\n\n\n\"It's part of the fabric of London and has been for a long time.\"\n\n\n\n\n\nIn response to community concern, the Inner West Council has adopted the City of Sydney's inclusionary zoning policy, which requires a 3 per cent affordable housing contribution in upzoned areas. Fotheringham says other neighbouring areas need to do the same.\n\n\n\n\n\n\"It just falls apart because some councils are willing to say 'don't worry about it' and then nothing happens,\" he says.\n\n\n\nWe should have it consistent across the country.\n\nRawnsley points out that calculating what's affordable can also be complicated.\n\n\n\n\n\nAffordable rents in Green Square are calculated using household income but some schemes use discounted market rent — calculated around 80 per cent of market value — which means rents can still be high in popular inner city areas.\n\n\n\n\n\nIncome caps for certain schemes can also squeeze out families earning slightly more than the threshold.\n\n\n\nFor example, affordable housing may help someone earning under $60,000 to find accommodation, but someone earning $80,000 may then struggle to compete with those on high incomes for the remaining properties.\n\n\n\n\n\nIf someone on $100,000 can't find good options within their price range, they will apply for other cheaper properties that may have otherwise been affordable to those on $80,000.\n\n\n\n\n\n\"I think the current approach of trying to go more public housing, more social housing, more affordable housing and more private sector housing is best. You've got to put supply into all those markets,\" Rawnsley says.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/video/new-south-wales-best-junior-spellers-face-off-in-the-premiers-spelling-bee/1jbwkzo42",
        "title": "New South Wale's best junior spellers face off in the Premier's Spelling Bee",
        "publish_date": "Fri, 7 Nov 2025 08:34:12 +0000",
        "category": "finance",
        "authors": [],
        "text": "New South Wale's best junior spellers face off in the Premier's Spelling Bee\n\nPublished 7 November 2025, 5:21 am\n\nTurn off the auto correct, think back to the mnemonics, and test yourself against the fastidious students in this next report. They're some of the best junior spellers in New South Wales for this year. And for a number of them, English isn't their first language.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/video/leys-leadership-under-pressure/kbbxmbx3t",
        "title": "Ley's leadership under pressure",
        "publish_date": "Fri, 7 Nov 2025 08:14:57 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/elon-musks-trillion-dollar-payday-uncertainty-creeps-back-into-markets/a9zn17411",
        "title": "Elon Musk’s trillion-dollar payday; uncertainty creeps back into markets",
        "publish_date": "Fri, 7 Nov 2025 06:51:03 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/elon-musk-trillionaire-pay-package/uj2zmnioi",
        "title": "Elon Musk's path to $1 trillion: These are the 'aggressive goals' he must hit",
        "publish_date": "Fri, 7 Nov 2025 04:07:10 +0000",
        "category": "finance",
        "authors": [],
        "text": "Is Elon Musk worth $1 trillion?\n\n\n\n\n\nAccording to shareholders of Tesla, the answer is a resounding yes.\n\n\n\n\n\nThe billionaire, already the world's richest man by some estimates, had a pay package approved on Friday (AEST) that could give him as much as US$1 trillion ($1.54 trillion) over the next decade. Required payments, though, would take the value down to US$878 billion ($1.35 trillion).\n\n\n\n\n\nWhile there were some objectors to the package, the board argued the company could lose Musk and his vision without such a hefty remuneration.\n\n\n\n\n\nIn the lead up to the vote, Tesla chair Robyn Denholm argued that the package was needed to stop Musk from investing more time on other pursuits. In addition to Tesla, Musk is the CEO and chief engineer of aersopace company SpaceX, has a range of other businesses, including in AI, and was a former adviser to the Trump administration .\n\n\n\n\n\n\"If we fail to foster an environment that motivates Elon to achieve great things through an equitable pay-for-performance plan, we run the risk that he gives up his executive position, and Tesla may lose his time, talent and vision, which have been essential to delivering extraordinary shareholder returns,\" Denholm wrote in a letter to Tesla shareholders in late October.\n\n\n\nWho objected to the pay increase?\n\nThe California Public Employees' Retirement System, the largest public pension fund in the United States, said it went against its policy of evaluating executive pay against performance and industry norms.\n\n\n\n\n\n\"It would also further concentrate power in a single shareholder,\" Drew Hambly, the fund's global public equity investment director, said.\n\n\n\nNorway's sovereign wealth fund also said it objected to the size of the compensation, among other issues.\n\n\n\n\n\n\"While we appreciate the significant value created under Mr Musk's visionary role, we are concerned about the total size of the award, dilution, and lack of mitigation of key person risk — consistent with our views on executive compensation,\" the Norges Bank Investment Management said in a statement.\n\n\n\nMusk 'worth' the $1 trillion pay packet\n\nThere are a few hurdles Musk needs to clear in order to cash in on the deal.\n\n\n\n\n\nHe has to increase Tesla's stock price to US$8.5 trillion ($13.1 trillion) from the current US$2.3 trillion ($3.5 trillion) and oversee the rollout of 20 million vehicles — including one million robotaxis on roads — and one million robots.\n\n\n\n\n\n\"You're going to have to see extreme growth in the share price of and in the market cap of Tesla but that is just one of the hurdles he would need to hit in order to get this pay packet,\" US-based markets analyst Thomas Essaye told ABC News Radio.\n\n\n\n\n\n\"He will have to hit many aggressive goal posts to get the pay package.\"\n\n\n\nEssaye said he believed Musk was worth the trillion due to his transformative vision, comparing him to a modern-day version of legendary US inventor Thomas Edison.\n\n\n\n\n\n\"(Elon Musk) is truly a visionary. He isn't creating existing technology and making it better, he's creating it out of thin air,\" Essaye said.\n\n\n\n\n\n\"And he is the face of the company, so I think that does warrant some special consideration.\"\n\n\n\n\n\nMusk told the shareholder meeting the company was about to embark on a \"whole new book\" in the history of Tesla.\n\n\n\n\n\nHe then made a string of promises on stage — from, in April, beginning production of the Cybercab, its two-seater steering-less robotaxi, to unveiling its next-generation Roadster electric sports car. He also said Tesla would need \"a gigantic chip fab\" [fabrication plant] to make AI chips and should consider working with manufacturer Intel.\n\n\n\n\n\n— With additional reporting by the Reuters news agency.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.theage.com.au/sport/cricket/plenty-of-life-left-in-old-legs-hazlewood-defends-ageing-attack-as-cummins-prepares-for-brisbane-20251107-p5n8on.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Plenty of life left in old legs: Hazlewood defends ageing attack as Cummins prepares for Brisbane",
        "publish_date": "Sat, 08 Nov 2025 12:48:35 +1100",
        "category": "sports",
        "authors": [
            "Christian Nicolussi"
        ],
        "text": "If you wanted proof injured Australia captain Pat Cummins is on track for a return for the second Ashes Test at The Gabba, you only had to witness the scenes at the Sydney Cricket Ground on Saturday morning.\n\nCummins, who will miss the opening Test in Perth from November 21, was showing no signs of discomfort in his back as he steamed in and bowled a decent spell at NSW training.\n\nStand-in Australian skipper Steve Smith at one stage walked over, tossed Cummins a pink ball – the colour of choice for the day-night Test that will be played in Brisbane – before he broke into laughter.\n\nEngland can only hope they win the first match before returning to the east coast, knowing what awaits them.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/world/dashcam-footage-captures-cargo-plane-crash-20251106-p5n85x.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Dashcam footage captures cargo plane crash",
        "publish_date": "Sat, 08 Nov 2025 11:31:20 +1100",
        "category": "finance",
        "authors": [],
        "text": "Dashcam footage captures cargo plane crash\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/politics/federal/a-life-in-pictures-graham-richardson-20230606-p5debj.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "A life in pictures – Graham Richardson",
        "publish_date": "Sat, 08 Nov 2025 11:22:18 +1100",
        "category": "finance",
        "authors": [],
        "text": "13/18\n\nGraham Richardson, with his daughter Katie, salutes his standing ovation in June 1994. “For the last month I have undergone an extraordinary bar­rage, arguably the dirtiest barrage yet launched in the Australian Parliament. It tells me a lot about what I must have done, having resigned and still being a target suggests over the past 20-odd years I must have hurt those bastards. If I hurt the bastards, I am proud to have done so, they deserve every bloody bit of it.” Credit:Julian Andrews",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/lifestyle/fashion/beach-ready-fashion-starting-at-37-20251028-p5n5t8.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Beach-ready fashion starting at $37",
        "publish_date": "Sat, 08 Nov 2025 11:19:25 +1100",
        "category": "lifestyle",
        "authors": [
            "Damien Woolnough"
        ],
        "text": "This story is part of the November 8 edition of Good Weekend.\n\nWhat’s hot this summer in terms of swimwear?\n\nBottom pride is taking over Australian beaches and swimming pools, with thongs of the G-string – rather than the foot – variety surging in popularity. A sliver of fabric worn between toned buttocks requires, among other things, a liberal use of sunscreen, but there are alternatives for those who prefer greater protection against scalding sand and concrete.\n\nStand out by keeping swimwear simple – let your accessories create all the waves. Credit: Getty Images\n\nInvest in bathing suits made from quality fabrics in block colours that are actually designed for swimming rather than selfies. A well-cut bikini with brief bottoms can accentuate, or even create, curves while offering greater coverage than a thong.\n\nIf you prefer the security of a one-piece, dip into the asymmetry trend with a single-strap design, while remembering that any tan lines may attract interest in a strapless top the next day.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/politics/federal/labor-powerbroker-graham-richardson-dies-aged-76-20251108-p5n8q0.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Labor powerbroker Graham Richardson dies aged 76",
        "publish_date": "Sat, 08 Nov 2025 10:56:46 +1100",
        "category": "finance",
        "authors": [
            "Anthony Segaert",
            "Millie Muroi"
        ],
        "text": "Graham “Richo” Richardson, the longtime former Labor senator, party powerbroker and media commentator, has died at 76.\n\nHe died at 3.50am on Saturday, following weeks of influenza and pneumonia, his wife and son told 2GB Breakfast host Ben Fordham, who announced the news.\n\n“Darcy and Amanda have asked me to share the news with everyone that sadly Richo has passed away in the early hours of this morning,” Fordham said.\n\nFamed Labor powerbroker Graham Richardson has died. Credit: Ben Appleton\n\nRichardson served as a NSW senator in federal parliament between 1983 and 1994. He was, at the time, the youngest elected senator, aged 33 when he first arrived at parliament.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/world/north-america/repeating-bell-heard-in-ups-plane-s-cockpit-as-drone-footage-reveals-crash-devastation-20251108-p5n8pu.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘Repeating bell’ heard in UPS plane’s cockpit as drone footage reveals crash devastation",
        "publish_date": "Sat, 08 Nov 2025 10:50:27 +1100",
        "category": "finance",
        "authors": [],
        "text": "Louisville: A repeating bell sounded in the cockpit for 25 seconds as pilots tried to control a UPS cargo plane that caught fire, had an engine fall off and crashed during take-off this week in Louisville, Kentucky, a National Transportation Safety Board member said on Friday.\n\nThe cockpit voice recorder captured a persistent bell that began about 37 seconds after the crew called for take-off thrust, and the bell continued until the recording ended, which investigators believe was the final point of impact, NTSB member Todd Inman said.\n\nInman said there could be different types of alarms with varying meanings, but investigators know there was a fire in the plane’s left wing and will use flight data to help determine a clearer picture of what happened.\n\nOn Friday, the NTSB released drone footage showing the devastation on the ground caused by the burning plane crashing through a swath of industrial buildings, including a petroleum recycling facility.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/lifestyle/princess-anne-expected-to-touch-down-in-australia-20251108-p5n8pp.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Princess Anne expected to touch down in Australia",
        "publish_date": "Sat, 08 Nov 2025 09:40:41 +1100",
        "category": "lifestyle",
        "authors": [],
        "text": "Princess Anne expected to touch down in Australia\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/culture/music/oasis-perform-in-sydney-first-show-of-sold-out-concerts-20251108-p5n8pv.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Oasis perform in Sydney first show of sold-out concerts",
        "publish_date": "Sat, 08 Nov 2025 09:35:37 +1100",
        "category": "entertainment",
        "authors": [],
        "text": "Oasis perform in Sydney first show of sold-out concerts\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/rugby-union/respect-italy-target-ireland-how-wallabies-can-rescue-faltering-season-20251106-p5n8e6.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Respect Italy, target Ireland: How Wallabies can rescue faltering season",
        "publish_date": "Sat, 08 Nov 2025 09:30:00 +1100",
        "category": "sports",
        "authors": [
            "Paul Cully"
        ],
        "text": "The logistics of picking Wallabies from overseas, and particularly from France, are not easy – a point worth remembering by those who just want to blow the eligibility doors off.\n\nTake Will Skelton, who will again be absent against Italy – a Test that is no longer a banana skin so much as a meeting of well-matched teams, with only a fraction more World Rugby rankings points currently separating England and the Wallabies than the Wallabies and Italy.\n\nSkelton was actually playing for La Rochelle on Sunday evening, French time, due to the Top 14’s staggered scheduling – shortening his preparation time to the point that it was too limited for the Wallabies.\n\nWhile the French could “protect” their preferred 23 from last weekend’s Top 14 round ahead of their Test against South Africa this weekend, that is not an avenue open to Australia.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/culture/music/kendrick-lamar-and-lady-gaga-lead-2026-grammy-nominations-20251108-p5n8pm.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Australian K-pop star Rosé nominated for record of the year Grammy",
        "publish_date": "Sat, 08 Nov 2025 09:18:34 +1100",
        "category": "entertainment",
        "authors": [
            "Debbie Cuthbertson",
            "Nicole Precel"
        ],
        "text": "Lamar’s nominations include record, song and album of the year – marking the third time he’s had simultaneous nominations in those big categories. He’s also nominated for pop duo/group performance, melodic rap performance, rap song and rap album. He’s also nominated twice in the rap performance category. He is due to perform in Australia next month, headlining the Spilt Milk festival, which begins in Ballarat on December 6, before heading to Perth, Canberra and the Gold Coast. Kendrick Lamar won five awards at the 2025 ceremony. Credit: Getty Images for The Recording Academy Lamar, who is riding the success of last year’s blockbuster GNX album, has 22 Grammy career wins and 66 nominations. GNX is his fifth consecutive studio album to be nominated for album of the year, something no other artist has ever done. If it wins, it will be his first win in the category. And it will be only the third rap album to win the top prize, following OutKast in 2004 for Speakerboxxx/The Love Below and Lauryn Hill in 1999 for The Miseducation of Lauryn Hill.\n\nLady Gaga is up for song, record and album of the year – her first time receiving nominations in all three categories simultaneously. She could also score potential wins in the pop solo performance, pop vocal album, dance pop recording and traditional pop vocal album categories. Lady Gaga at the MTV Video Music Awards in September. Credit: AP Antonoff is nominated in the record, album and song of the year categories twice, for his work with Lamar and Sabrina Carpenter. He’s also nominated for rap song for the first time, for TV Off with Lamar, featuring Lefty Gunplay. Antonoff and Cirkut are this year’s leading producers. However, Antonoff will not face off with Cirkut in the producer of the year, non-classical category – though he’s won it three times before. Cirkut is up for both record and song of the year twice – for Lady Gaga’s Abracadabra and Rosé and Bruno Mars’ Apt – as well as album of the year and best dance pop recording.\n\nIn addition to Lady Gaga’s Mayhem and Lamar’s GNX, the album of the year category is rounded out by Carpenter’s Man’s Best Friend, Bad Bunny’s Debi Tirar Mas Fotos, Justin Bieber’s Swag, Clipse, Pusha T & Malice’s Let God Sort Em Out, Leon Thomas’ Mutt, and Tyler, the Creator’s Chromakopia. Bad Bunny, seen performing in Puerto Rico in September 20, received six nominations. Credit: Getty Images This is the first time three albums have been up for both rap album and album of the year: GNX, Let God Sort Em Out and Chromakopia. Bad Bunny’s Debi Tirar Mas Fotos is only the second all-Spanish language album to be nominated for the top prize. The first was also a Bad Bunny release – Un Verano Sin Ti in 2023. Harry Styles’ Harry’s House won that year. Carpenter, Bad Bunny, Leon Thomas and Serban Ghenea all boast six nominations. Andrew Watt, Clipse, Doechii, Sounwave, SZA, Turnstile and Tyler, the Creator have five each.\n\nThere were also some significant snubs. Despite earning major chart success, musicians including Lorde, Gracie Abrams and Megan Moroney did not receive any nominations. Also overlooked was The Weeknd, who released his sixth studio album Hurry Up Tomorrow, which was a critical and commercial success, debuting at No.1 on the Billboard 200 chart. It also topped charts in 16 other countries. Perhaps the biggest surprise was Taylor Swift’s name missing from the list of nominees. But The Life of a Showgirl was released in October - too late to be in the running. Only recordings commercially released in the United States between August 31, 2024, and August 30, 2025, were eligible for nominations. The final round of Grammy voting, which determines its winners, will take place from December 12 until January 5. In the best new artist category, global girl group Katseye, Olivia Dean, The Marias, Addison Rae, Sombr, Leon Thomas, Alex Warren and Lola Young will all go head-to-head. The record of the year category is made up of Bad Bunny’s Debi Tirar Mas Fotos, Carpenter’s Manchild, Doechii’s Anxiety, Billie Eilish’s Wildflower, Lady Gaga’s Abracadabra, Lamar and SZA’s Luther, Chappell Roan’s The Subway and Rosé and Bruno Mars’ Apt. Some may be surprised to see Eilish included in the bunch as Wildflower was released on her 2024 album Hit Me Hard and Soft, ahead of the eligibility window. However, there is a Recording Academy rule that allows albums released during the previous ceremony’s eligibility period to be considered, “provided the same tracks were not entered the previous year and the album did not win a Grammy”, with a few exceptions. By that rule, Eilish’s Wildflower – which was not previously entered – is eligible.\n\nTimothee Chalamet, as Bob Dylan in A Complete Unknown, is up for best compilation soundtrack for visual media. Credit: Song of the year – an award for a track’s songwriters, which sometimes include the performer but not always – is made up of an almost identical list to record of the year, except Roan is replaced by Golden from the KPop Demon Hunters soundtrack. Loading “The Grammy Awards are our opportunity to honour the people who make this community so vibrant and this year’s nominees remind us of the incredible talent that is driving music forward,” said Recording Academy chief executive Harvey Mason Jr in a statement. “From emerging talent to influential icons, these nominees reflect today’s broad and diverse musical landscape and I am excited to celebrate them in the coming weeks ahead.”",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/lifestyle/beauty/from-45-to-1500-advent-calendars-for-every-budget-20251030-p5n6ge.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "From $45 to $1500: Advent calendars for every budget",
        "publish_date": "Sat, 08 Nov 2025 09:00:00 +1100",
        "category": "lifestyle",
        "authors": [
            "Nell Geraets"
        ],
        "text": "You can’t have an advent calendar guide without some chocolate. Many will remember the excitment of opening cheap, gimmicky advent calendars as a child, revealing an unidentifiable festive chocolate that tasted vaguely like plastic. Well, the Christmas chocolate industry has really levelled up, now offering a huge range of quality treats for sweet-toothed adults. And what’s says quality better than Australian made Haigh’s? For just over $50, you can feast on a selection of 24 handmade mild and dark chocolates, all of which can be tucked away in an adorable gingerbread house calendar. At the other end of the scale, there’s a $1350 version filled with a range of Haigh’s top-tier selections. Haigh’s top-tier advent calendar, $1350. Bang for buck Given the classic calendar is 150 grams and a 150 gram box of assorted Haigh’s chocolates costs a similar price, the retail value of the chocolate itself is presumably nearly on par with the purchase price. The Gourmet Collection Popcorn Advent Calendar ($44.99)\n\nThe Gourmet Collection Popcorn Advent Calendar, $44.99. Chocolate is far from the only advent calendar option for foodies these days. Myer is now offering a popcorn countdown, replete with 24 days of caramel, salted caramel and chocolate flavoured snacks. Perfect to pair with a Christmas movie marathon, perhaps? Bang for buck Myer lists no actual retail value for the advent calendar (192 grams). However, when comparing it to their 200 gram “Big Night In” caramel popcorn, which sells for $14.99, it seems rather pricey. Perhaps you’re paying for the theatrics of opening a new treat each day. And it must be noted that the calendar consists of several flavours as opposed to just one. T2 Cabinet Of Curiosity 24 Day Tea Bag Advent ($48)\n\nT2 Cabinet Of Curiosity 24 Day Tea Bag Advent, $48. Fancy a tea with that fruit mince pie? Australian tea icon T2 has once again curated a 24-day calendar that consists of a wide range of individual sachets, including some of their bestsellers. Though made up primarily of black teas (notable favourites are Melbourne Breakfast and, of course, Christmas Breakfast), it also includes an array of fruit, green and herbal teas, as well as one particularly enticing rooibos called “sticky date delight”. Bang for buck An average T2 tea bag usually costs around $1.40 (though they aren’t usually sold separately). That means the approximate value of the tea bags inside the advent calendar is around $33.60. This isn’t too steep compared to the $48, especially given the specialty packaging. Bitty Pop! Holiday Countdown Calendars ($85)\n\nBitty Pop! Holiday Countdown Calendars, $85. Christmas is the best time of year for many people, but especially for those who are kids at heart. The Funko Bitty Pop calendars will prove particularly enticing for these young souls, no matter what their particular interests. There’s a range of these mini collectible countdowns this year, including Stitch, Marvel and Disney princesses. Each contain 10 miniature collectibles, seven stackable display pieces, three holiday accessories, two keychain cases and two pin cases. Bang for buck Based on the average price of one miniature Funko collectible (around $5.99), $85 for 10 figures may sound steep. However, the calendar contains a whole swathe of accessories, which probably makes this advent calendar more or less on par with its estimated retail price. The moderate spends\n\nL’Occitane Classic Advent Calendar ($179) L’Occitane Classic Advent Calendar, $179. Not only do you get 24 items ranging from skincare to hair-care in L’Occitane’s classic calendar, but the yellow-and-white packaging is also so beautiful you won’t want to throw it away (hot tip: you could use it to store jewellery well past Christmas). Though slightly more expensive than calendars from brands like The Body Shop ($99), L’Occitane delivers their ultimate skincare favourites (like the Immortelle Overnight Reset Oil-In-Serum) to limited edition bonuses and full-size items (for example, the shea butter hand cream). Bang for buck According to the L’Occitane website, the total value of the items in their classic advent calendar is a whopping $367. That means you’re supposedly getting all the products for around half price – a great bargain for such a dependable, higher-end brand.\n\nMac’s 24 Mystery Must Haves Advent Calendar ($390) Mac’s 24 Mystery Must Haves Advent Calendar, $390. Make-up advent calendars are some of the most in-demand countdowns every Christmas season, so it’s little surprise that festive favourites from Charlotte Tilbury and Nars sold out as early as September. But fear not, there are still some stellar beauty options available, including Mac’s monster “Mystery Must Haves”. Valued at a mammoth $840, this make-up calendar includes 24 mini and full-sized items from the iconic brand, as well as limited-edition gel eye pads and gua sha tool. Mascaras, lipsticks, eyeshadows – you name it, it’s probably in it. Bang for buck This may be one of the best-value advent calendars this year given it costs less than half of its retail value. You also get it in a cool, extendable box that can be re-used for other things like make-up or jewellery storage, and which even contains a mirror. The only caveat is not every colour may be to your liking.\n\nReverie Puzzles’ Christmas Around The World Puzzle Advent Calendar ($149.99) Reverie Puzzles’ Christmas Around The World Puzzle Advent Calendar, $149.99. Many people take a break from work over the holidays, but that doesn’t mean an occasional brain-teaser is out of the question. Reverie Puzzles’ calendar consists of 24 individually packaged 99-piece puzzles, which showcase the ways Christmas is celebrated around the world (including a nod to Australia’s famous Carols by Candlelight). This calendar isn’t numbered – it’s a choose-your-own-adventure whereby the owner opens up whichever world flag speaks to them each day. Its book design and gold foil detailing also means it could make a great coffee table display every December. Bang for buck Based on the closest comparable puzzle sets sold by Reverie Puzzles, the retail value of those in the advent calendar would be approximately $300. This is only an estimate, but it still suggests good value given the calendar sells for half this price, and even comes in an aesthetic, re-useable book box.\n\nThe Book Grocer’s Advent Calendar ($180) The Book Grocer’s Advent Calendar, $180. Bookworms rejoice for The Book Grocer is offering an array of different advent calendars designed for those who want nothing more at Christmas than to settle in with a good book. Whether you love fiction, non-fiction, romance or crime, there’s a book countdown for you. They each contain 24 individually wrapped and numbered books, some of which are new and some of which are second-hand (though all in good condition). Bang for buck It’s difficult to say how worthwhile this advent calendar is without knowing the exact titles they contain (titles tend to sell for varied prices at The Book Grocer). However, if the average book costs about $19 in Australia, this calendar is presumably excellent value ($180 compared to an estimated $456). This is just an approximate guess, however.\n\nThe splurges The Australian Wool Stores’ Embroidery Yarn Advent Calendar ($225) The Australian Wool Stores’ Embroidery Yarn Advent Calendar, $225. Keen for a new hobby? There’s an advent calendar for that. Instead of just opening up something to eat, drink or spray on your body, countdowns from places like The Australian Wool Store aim to get your hands busy. The embroidery yarn calendar contains 25 mini embroidery skeins (a bundle of embroidery yarn) to be opened daily in the lead-up to Christmas, an embroidery design, sweet treats, and a couple of other surprises. The 50 per cent yak and 50 per cent silk version is for those searching for something a little more luxe, but there’s also a slightly cheaper merino version if spending more than $200 on wool feels a bit extreme.\n\nBang for buck The value here is not so much based on the weight of the yarn itself, but on having 25 individually curated and hand-dyed colours that are typically not available for sale separately, or are custom blends. Based on similar yarn advent calendars from other Australian independent dyers, where prices range from $150 to over $300, this calendar falls into a mid-to-high-end range. Glasshouse’s 24 Days of Christmas Advent Calendar ($290) Glasshouse’s 24 Days of Christmas Advent Calendar, $290. Getting into the heavy-hitters, this Glasshouse calendar is a favourite every festive season, largely due to the impressive range it features. Each of the 24 drawers contain either one of Glasshouse’s signature soy candles, a mini eau de parfums, or a bath and body product. On top of that, it also includes holiday stickers for a playful touch. Bang for your buck Glasshouse doesn’t list the retail value of their advent calendar, and it’s difficult to definitively calculate given it consists of several miniature products. That being said, the perceived value of the products inside is typically placed in the $450 to $700 range, making the $290 purchase price a strong offer for those who want to sample a wide range of their most premium products.\n\nFrancesca’s Jewellery Advent Calendar ($499) Francesca’s Jewellery Advent Calendar, $499. There’s treating yourself and then there’s buying yourself 12 pieces of jewellery in one fell swoop. Australian jeweller Francesca is offering their annual 12-day advent calendar, replete with gold-plated hoops, charms and bracelets. The gold option is the flashiest of all, but you can also get it in rose gold and silver, the last of which is $100 cheaper. Bang for buck You may be wondering, “why spend so much money on just 12 days when most other calendars are 24 days?” Well, not every advent calendar consists of gold-plated jewellery, and buying 24 pieces at once for yourself may seem … A bit much, perhaps. According to Francesca’s website, the 12 days of jewellery is valued at $838, so you’re getting it all for just over half-price.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/lifestyle/prince-harry-attends-charity-gala-in-canada-20251108-p5n8pq.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Prince Harry attends charity gala in Canada",
        "publish_date": "Sat, 08 Nov 2025 08:40:33 +1100",
        "category": "lifestyle",
        "authors": [],
        "text": "Prince Harry attends charity gala in Canada\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/lifestyle/king-charles-officially-removes-brother-andrew-s-titles-20251108-p5n8po.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "King Charles officially removes brother Andrew’s titles",
        "publish_date": "Sat, 08 Nov 2025 08:35:52 +1100",
        "category": "lifestyle",
        "authors": [],
        "text": "King Charles officially removes brother Andrew’s titles\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/toddler-dies-after-being-clipped-by-train-in-new-south-wales-north-20251108-p5n8pj.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Toddler dies after being clipped by train in New South Wales north",
        "publish_date": "Sat, 08 Nov 2025 07:35:48 +1100",
        "category": "finance",
        "authors": [],
        "text": "Toddler dies after being clipped by train in New South Wales north\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later. Dismiss\n\nOur network\n\nOpen Navigation Menu The Age",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/queensland-teachers-walk-away-from-plans-to-strike-next-week-20251108-p5n8ph.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Queensland teachers walk away from plans to strike next week",
        "publish_date": "Sat, 08 Nov 2025 07:32:09 +1100",
        "category": "finance",
        "authors": [],
        "text": "Queensland teachers walk away from plans to strike next week\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://au.news.yahoo.com/ex-labor-senator-powerbroker-dead-000548325.html",
        "title": "Richo’s vow to 17yo son before death",
        "publish_date": "2025-11-08T01:32:53Z",
        "category": "finance",
        "authors": [],
        "text": "Former Labor senator, powerbroker and political commentator Graham “Richo” Richardson has died aged 76.\n\nRichardson served as a cabinet minister in the Hawke and Keating governments and was a Labor senator for NSW for the duration of his parliamentary career.\n\nHe later became a political commentator and a regular contributor to Sky News Australia.\n\nHe died early on Saturday after years of health issues, issues. But he had vowed to hang on till his son D’Arcy had completed his HSC exams – which he did on Thursday.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\n“When he had his big health challenge, he said to his wife Amanda, ‘I’m going to live till I see Darcy finish exams and his HSC’,” 2GB host Ben Fordham told the station on Saturday.\n\n“Darcy did his last HSC exam on Thursday, which was his French exam. And Richo died this morning.”\n\nFordham said Richardson had suffered bouts of influenza and pneumonia and had been undergoing dialysis.\n\nHe is survived by his wife Amanda and his son D’Arcy. He had a son and daughter from his first marriage.\n\n“I’ve lost the love of my life. D’Arcy’s lost the greatest dad and Australia’s lost one of its best. He was a man ahead of his time,” Amanda said in a statement.\n\nRichardson is survived by his wife Amanda and his son D’Arcy. Picture: Instagram\n\nAnthony Albanese described Richardson as a “Labor legend”.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\n“He was someone who was very passionate about the cause of Labor,” the Prime Minister told Sky News on Saturday.\n\n“He was a true believer, someone who was very much loved within the Labor Party.\n\n“He was an ultimate machine man, but also someone who had a real policy impact … the Daintree remains intact today because of Graham Richardson.”\n\nSky News chief executive Paul Whittaker also paid tribute.\n\n“During his almost 15 years delivering his frank yet charismatic commentary on political affairs on Sky News, Richo added an insight, expertise, and depth that enhanced political discourse in Australia,” Mr Whittaker said in a statement.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\n“His uncompromising style and enviable ability to call the election result, often before anyone else, cemented him as a key fixture of Sky News’ election night coverage, while his contributions across the network helped shape Sky News into the leading destination for live political news coverage it is today.\n\n“Richo was an inspiring and loyal member of the Sky News team whose presence in the newsroom, and on our screens, will be greatly missed.\n\nGraham Richardson, former Labor senator for NSW, has died aged 76. Picture: Supplied\n\nRichardson had battled ill health for years, including a cancer diagnosis in the 1990s. Picture: Ryan Osland / The Australian.\n\nFordham phoned into the station on Saturday with the news.\n\n“This has come as a huge shock to me,” Mr Fordham said on the program.\n\n“I’m a great mate of Richo. We were regular lunch companions.”\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\n“We’ve been great mates for many years now.”\n\nThe outspoken political powerbroker had battled ill health for years – dating back to a cancer diagnosis in the 1990s.\n\nRichardson’s wife Amanda said she had lost the love of her life and Australia had lost ‘one of its best’. Picture: X\n\nLabor powerbroker and political commentator Graham Richardson has been remembered as one of the sharpest political minds. Picture: NewsWire / Damian Shaw\n\nFormer Prime Minister Scott Morrison was among the country’s political figures to pay tribute to the Labor powerbroker.\n\n“Jen and I extend our deepest and sincere sympathies to Amanda and Darcy Richardson following the passing of their husband and father Graham and to Graham’s broader family,” he wrote on Instagram.\n\n“I first properly met Richo on a seven news set at the old national tally centre in Canberra where we shared a panel on 2010 election night. We struck up an unlikely friendship that continued ever since.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nhttps://www.instagram.com/p/DQxqfkaFOfU/?utm_source=ig_web_copy_link\n\n“Richo was a good friend. He was loyal, tribal, insightful and truly one of a kind. He showed extraordinary courage during his long running illness and was cared for selflessly by his loving wife Amanda, who has been a saint to him, along with Darcy, as they shared these years together. He was very grateful for his second chance.”\n\nSky News chief news anchor Kieran Gilbert said Richardson had been a great political commentator and friend.\n\n“We should remember the career that he had, from the Labor Party machine into the Senate,”\n\nGilbert said.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\n“He served was elected on three occasions. He served across various portfolios, from the environment to transport to health,”\n\n“But his legacy is much broader than that. He’s been one of the great political commentators for so long, a key part of our election nights.\n\n“It’s is a sad day for all of us at Sky News, a sad day for Labor.”\n\nRichardson was a central – and at times controversial – figure in NSW Labor politics for decades.\n\nIn 1983, became the youngest elected senator at the time.\n\nHe held several portfolios in the Hawke and Keating governments and has been credited for securing increased protections for native forests in Tasmania, in addition to the heritage listing of Queensland’s Daintree Rainforest and the Northern Territory’s Kakadu National Park while environment minister.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nRichardson was awarded an Order of Australia honour in 2020 for his service to Parliament, his subsequent career as a political commentator, as well as his philanthropic support of the Fred Hollows Foundation and the Asthma Foundation.\n\nMore to come",
        "source": "Yahoo"
    }
]