[
  {
    "url": "https://www.9news.com.au/world/global-cities-index-two-australian-cities-rank-among-top-10-best-cities-in-the-world/ac1382ed-b4f3-4aa0-819f-650824c745cd",
    "title": "Two Australian cities rank among top 10 best cities in the world",
    "publish_date": "Thu, 22 May 2025 19:56:08 +0000",
    "category": "finance",
    "authors": [
      "May"
    ],
    "text": "1 of 11 Attribution: Nine\n\nO﻿xford Economics has released its 2025 list of the best cities in the world to live in, with two Australian cities making their way into the top 10.\n\nThe Global Cities Index scores cities in five categories: Economics, Human Capital, Quality of Life, Environment, and Governance.\n\nEight of the top ten cities have stayed the same as last year, with two new entries, including a bustling Australian city.\n\nClick through to see which cities worldwide made the top 10 list. ﻿",
    "source": "9News",
    "cluster_id": 0
  },
  {
    "url": "https://www.9news.com.au/national/cruise-ship-rescues-four-people-and-three-dogs-from-boat-stranded-off-new-caledonia/b11c6b8f-0781-4cfc-a410-5475fde9206a",
    "title": "Cruise ship crew rescues four people and three dogs from stricken boat",
    "publish_date": "Thu, 22 May 2025 03:48:07 +0000",
    "category": "finance",
    "authors": [
      "May"
    ],
    "text": "\"The two couples and their three dogs were safely welcomed onto\n\nCarnival Splendor\n\nand are receiving food, water and medical assistance,\" a Carnival Cruise line spokeswoman said.",
    "source": "9News",
    "cluster_id": 1
  },
  {
    "url": "https://www.9news.com.au/national/housing-market-australia-auction-boom-this-weekend-interest-rate-cut/73a7e665-0d29-4483-9d71-d46cb6b958a9",
    "title": "Interest rate cut sparks surge in number of auctions across capital cities",
    "publish_date": "Thu, 22 May 2025 03:10:37 +0000",
    "category": "finance",
    "authors": [
      "May"
    ],
    "text": "T﻿he number of auctions being held over the next two weeks is set to skyrocket as sellers look to cash in on the Reserve Bank's interest rate cut.\n\nThe RBA reduced the official cash rate by 25 basis points on Tuesday, providing relief for existing mortgage holders but also increasing the borrowing power of prospective buyers, which is expected to push up house prices.\n\nSellers are clearly looking to take advantage of the ﻿expected price surge, with the number of scheduled auctions rising steeply this weekend, particularly in the two largest property markets.\n\nT﻿he number of auctions across Australia is set to skyrocket over the next two weeks following the Reserve Bank's interest rate cut. (Justin McManus/The Age)\n\nAccording to real estate data firm Cotality (formerly known as CoreLogic), ﻿2395 homes are scheduled to go under the hammer this week, a 34.2 per cent rise from last week and up 5.8 per cent from the same time last year, when interest rates were half a percentage point higher.\n\nThe increase is even sharper in Sydney, up 44.7 per cent week on week to 803 auctions, while Melbourne will host its most since Easter.\n\n\"For the first time in six weeks, Melbourne's scheduled auction numbers are set to exceed 1000 this week, with 1152 homes scheduled to go under the hammer,\" Cotality economist Kaytlin Ezzy said.\n\n\"Last week saw 890 homes auctioned, while this time last year, 1087 auctions were held across the city.\"\n\nREAD MORE: Wall Street nosedive over Trump tax bill\n\n﻿ Cotality is expecting the number of auctions across the country to increase even further to about 2700 the following weekend.\n\nThe Reserve Bank's decision to cut the cash rate to 3.85 per cent effectively increased the average Australian's borrowing power by ﻿$12,000, and the average couple's by $23,000.\n\nHowever, with economists expecting at least one more cut by August and another by early 2026, and the RBA's first cut from February already in the bank, someone on the average wage could enter next March with $50,000 extra in borrowing power compared to the start of this year.\n\nAuction volumes are expected to surge further next weekend. (Max Mason-Hubers)\n\n\"Prospective buyers will get another boost to their maximum borrowing capacity as a result of this week's cash rate cut, however, it's unlikely to help them get a foot on the property ladder faster,\" Canstar data insights director Sally Tindall said.\n\n\"When buyers see their maximum borrowing budgets rise at the same time, on the back of a policy change or a cash rate cut, the biggest winner in the equation is often the person selling the property.\n\nBest suburbs to buy an investment property in top states View Gallery\n\n\"This cut will be a shot in the arm for the property market.\n\n\"However, if homeowners aren't equally encouraged to list their property for sale, then a surge in demand could see property prices rise even further.\"",
    "source": "9News",
    "cluster_id": 2
  },
  {
    "url": "https://www.9news.com.au/world/tourists-scramble-as-600yearold-chinese-tower-partially-collapses/35db432a-18cd-472f-938b-3d8031f4bbc1",
    "title": "Tourists scramble as 600-year-old Chinese tower partially collapses",
    "publish_date": "Wed, 21 May 2025 22:16:23 +0000",
    "category": "finance",
    "authors": [
      "May"
    ],
    "text": "Visitors to a centuries-old tourist site in eastern China were sent scrambling after hundreds of roof tiles came loose and cascaded more than two stories to the ground.\n\nThe Fengyang Drum Tower—built in 1375 and used to announce the beginning of ceremonies and the time of day—is one of the largest such towers in China, according to state media.\n\nThe tower is a major tourist attraction in Anhui province, which is around 320 kilometres away from Beijing, China's capital.\n\nThis screengrab taken from a video shows roof tiles collapsing from a centuries-old Chinese drum tower in Anhui, China, on May 19. (@fennafaxing/Douyin via CNN Newsource)\n\nBut on Monday, the quiet around the site was shattered as hundreds of roof tiles began slipping from the roof and crashing to the ground, raising a huge cloud of gray-brown dust.\n\n\"The tile falling lasted for a minute or two,\" one eyewitness told Yangcheng Evening News , a state-controlled newspaper.\n\nAnother witness described how he heard the crisp sound of one tile falling after another from a shop at the entrance of the Drum Tower.\n\n\"There was no one in the square and no one was injured,\" he told state media outlet The Beijing News .\n\n\"If it happened a little later, there would be many children playing (near the tower) after dinner.\"\n\nThe local culture and tourism bureau said no casualties had been reported and that the \"situation is under investigation\".\n\nThe collapse happened just a year after the tower was renovated following minor damage to the roof.\n\nHowever, the building consists of two parts: the original Ming-era tower base and the tower on top of it.\n\nDamages mainly happened to the latter, which was once rebuilt in 1995, local officials say .\n\nFengyang county is famous for its history and culture, and was the hometown of Zhu Yuanzhang (the Hongwu Emperor), founder of the Ming dynasty.\n\nHe oversaw a prosperous era fueled by strong international trade and a growing population.",
    "source": "9News",
    "cluster_id": 3
  },
  {
    "url": "https://www.abc.net.au/news/2025-05-23/kinetic-apology-school-bus-incidents-townsville/105267264",
    "title": "School bus company apologises for latest driver breach",
    "publish_date": "Fri, 23 May 2025 01:35:22 +0000",
    "category": "finance",
    "authors": [],
    "text": "A regional Queensland bus company has apologised to families for a third driver breach in as many months as concerns about student safety grow.\n\nKinetic is a state government-contracted bus service that operates in and around Townsville.\n\nLast week a driver was stood down after students reported inappropriate behaviour.\n\n\"They exited and boarded another Kinetic service, making the second driver aware of the incident,\" a Townsville Catholic Education spokesperson said.\n\n\"The safety and wellbeing of our students is our highest priority and we commend the students on acting in a responsible way.\"\n\nKinetic said the driver exhibited \"unprofessional behaviour\".\n\nThe company has committed to undertaking a thorough investigation into the May 15 incident.\n\nConcern growing\n\nKinetic relies received more than $16 million worth of state funding in the 2023-24 financial year to deliver its Townsville services, but parents are concerned for their children's safety.\n\nAmanda Wright's daughter was on board a Kinetic bus in April when the driver attempted a risky turn in a 110-kilometre-per-hour zone.\n\nFootage taken by the schoolgirl showed Flinders Highway traffic at a standstill as the driver attempted a U-turn.\n\n\"The driver made the turn on a crest, crossing double white lines, blocking the highway in both directions in our first fog of the season,\" Ms Wright said.\n\n\" She said, 'Mum I needed to film so if anything happened to me you would know why.' \"\n\nLoading...\n\nMs Wright said the driver involved also missed a stop that day.\n\nKinetic confirmed that a stop was missed and said the company had a policy to never leave a child behind.\n\nBut Ms Wright said Kinetic regularly left children behind, including her own.\n\n\"All the parents out here know Kinetic's number by heart,\" Ms Wright said.\n\n\"So we can call and say, 'Hey you have left our children on the side of the Flinders Highway, can you please go get them before they get stolen?'\"\n\nKinetic told the ABC that the actions seen on the video did not meet company standards.\n\nIt said it conducted a prompt investigation and reinforced training.\n\nFlooding incident\n\nA mother whose children were abandoned by Kinetic at a flooded bridge said she feared the company was not improving.\n\nThe woman, who cannot be identified for legal reasons, has two children who use the service.\n\nShe said in March a Kinetic driver told one of her children to disembark and remove a road-closed sign so the bus could cross the flooded bridge.\n\n\"As locals we know you don't go through that — it is fast-moving,\" the mother said.\n\nKinetic said the incident had been investigated. (ABC North Qld: Chloe Chomicki)\n\nShe raised concerns with Kinetic and submitted a formal complaint, but a week later her children and other school passengers were told to get off the bus at the same flooded bridge.\n\n\"We are worried about retaliation if we report something on the bus,\" the woman said.\n\nThe driver involved in the incidents raised by the mother was stood down.\n\nKinetic said an investigation into the incident had been completed, but would not comment on whether the driver would return to work.\n\nUnreserved apology\n\nKinetic general manager Martin Hall said the company took full responsibility for the incidents.\n\n\"None of the occurrences were to the standard we hold ourselves to,\" he said.\n\n\"The trust families place in us to transport their children safely is something we deeply value.\n\n\"We apologise unreservedly to the students and families affected.\"\n\nSixteen Townsville school routes are serviced by government-contracted buses. (ABC North Qld: Chloe Chomicki)\n\nMr Hall said Kinetic drivers in Townsville worked through difficult circumstances over the last few months.\n\n\"Our drivers have worked tirelessly to deliver services across Townsville despite recent challenges that have impacted the entire community, including weather events and labour shortages,\" he said.\n\n\"Our bus drivers come to work each day committed to providing safe transportation for the communities they serve, often navigating difficult road conditions and making decisions in real time.\"\n\nTranslink, a division of the state transport department, refused to comment on recent Kinetic incidents.\n\n\"Delivery partner staff are employed by the operators,\" a Translink spokesperson said.\n\n\"We work with operators to ensure an investigation in relation to significant service delivery complaints has been undertaken.\n\n\"We do not comment on delivery partner decisions on their staff.\"",
    "source": "ABC",
    "cluster_id": 4
  },
  {
    "url": "https://www.abc.net.au/news/2025-05-23/mlb-boston-red-sox-liam-hendriks-social-media-threats/105327658",
    "title": "Aussie MLB pitcher Hendriks calls out 'vile' social media death threats",
    "publish_date": "Fri, 23 May 2025 01:02:00 +0000",
    "category": "sports",
    "authors": [],
    "text": "The Boston Red Sox's Australian pitcher Liam Hendriks has taken to social media to express disgust about death threats he claims to have received following his side's most recent loss to the New York Mets.\n\nIn a post on Instagram, Hendriks — a 36-year-old reliever who previously battled non-Hodgkin lymphoma — said comments were directed at both him and his family.\n\n\"Just as an FYI: threats against me and my wife's life are horrible and cruel. You need help,\" Hendriks wrote in the post.\n\n\"Leaving comments and telling me to commit suicide and how you wish I died from cancer is disgusting and vile.\"\n\nHendriks has appeared in 11 MLB games this season.\n\nHe relieved starter Garrett Crochet with one out in the sixth inning of the Red Sox's 5-1 loss to the Mets on Thursday (AEST) at Fenway Park in Boston.\n\nHendriks finished the inning but gave up three straight singles to start the seventh, including an infield hit by Luisangel Acuña that was initially ruled an out before replays showed he beat the throw to first.\n\n\"Maybe you should step back and re-evaluate your life's purpose before hiding behind a screen and attacking players and their families,\" Hendriks added in his post.\n\n\"Whether you do it from your fake accounts or are dumb enough to do it from your real account.\n\n\"I think I speak for all players who have had to deal with this in their career when I say enough is enough.\"\n\nThe incident comes less than a month after Red Sox All-Star left fielder Jarren Duran said a fan near the dugout in Cleveland said \"something inappropriate\" to him during a 13-3 victory over the Guardians.\n\nThat came days after the debut of a Netflix documentary that included Duran opening up about his mental health.\n\nAP",
    "source": "ABC",
    "cluster_id": 5
  },
  {
    "url": "https://www.abc.net.au/news/2025-05-23/perth-boonji-spaceman-sculpture-unveiled-amid-controversy/105325332",
    "title": "Spaceman sculpture's landing angers fans of 'the kebab' in Perth",
    "publish_date": "Fri, 23 May 2025 00:57:33 +0000",
    "category": "entertainment",
    "authors": [],
    "text": "A gleaming blue, 7-metre-tall astronaut has been unveiled in Perth's CBD, taking pride of place outside Council House.\n\nDesigned by US artist Brendan Murphy, the sculpture called Boonji Spaceman was a donation by the artist but City of Perth took on costs of transportation and installation, believed to be between $150,000–$250,000.\n\nThe acquisition was championed by former Perth Lord Mayor Basil Zempilas who stepped down from the council in March after being elected to state parliament.\n\nMr Zempilas has long championed branding Perth as the City of Light — as it was dubbed by astronaut John Glenn in 1962 when the people of Perth turned on their lights to acknowledge his mission to become the first American to orbit the earth.\n\nIt was that story and meeting Mr Zempilas that persuaded Murphy to donate one of his spacemen to Perth after the pair were introduced by gallery owner Paul Gullotti.\n\nBrendan Murphy is the artist and creator of Perth's Boonji Spaceman. (ABC News: Phoebe Pin)\n\n\"I'm not in the business of giving my work away. I'm one of the top-selling artists in the world,\" Murphy told Mark Gibson on ABC Radio Perth.\n\n\"[Mr Zempilas and I] had a couple of great chats and Zoom calls, and Basil was really inspired by my work.\n\n\"When that happens that means a lot to me, and this history of John Glenn identifying Perth as the city of lights, that really connected the dots for me.\"\n\nThe kebab out, Spaceman in\n\nWhen the council voted to accept the donation last year Mr Zempilas said it was \"an incredible opportunity\" to bring a real tourist attraction that fit Perth's story to the city.\n\nBut not everyone was pleased with the idea, particularly as the site allocated was previously occupied by another popular piece of public art — the Ore Obelisk, affectionately dubbed \"the kebab\".\n\nThe 15-metre-tall sculpture was designed by City of Perth town planner Paul Ritter and erected to celebrate Western Australia's population reaching 1 million in 1971.\n\nThe Ore Obelisk, pictured in December 1980, once sat in Stirling Gardens. (Supplied: State Library of Western Australia)\n\nFeaturing different geological specimens of rock, it symbolised the expansion of mining in the state in the 1960s and 1970s.\n\nThe sculpture was dismantled and placed in storage in 2021 following \"engineering reports that it was unsafe and posed a risk to public safety\", a spokesperson for the council said.\n\nHelen Curtis, who runs a public art consultancy, launched the \"Save the Kebab\" campaign to restore and bring back the Ore Obelisk.\n\nShe was annoyed to find the council had allocated funds to the Boonji Spaceman.\n\nNow that the spaceman is in place she is continuing her campaign to reinstate the the kebab.\n\n\"We don't really love what he's bringing, and it's not just me,\" Ms Curtis said.\n\n\"There is a huge groundswell of people from the arts, design, the history professions.\n\n\"But also the broader Perth community and even people who worked in parks and gardens at the City of Perth are showing support for the campaign.\"\n\nThe Ore Obelisk was removed in 2021 due to structural safety concerns. (Facebook: City of Perth)\n\nSpaceman 'not local'\n\nMs Curtis said the Boonji Spaceman was not unique to Perth, as Murphy had already installed versions of the sculpture in London, Oslo, Dubai and Antigua.\n\nThe Perth version of the Boonji Spaceman is called Lightning.\n\n\"This is not about parochialism at all,\" Ms Curtis said.\n\n\"If the City of Perth is into Instagrammable tourism attractions then we can do that here ourselves.\n\n\"Let's look after what we have first, right? That should be our priority. The Ore Obelisk — why didn't the City of Perth look after that?\n\n\" These are really important parts of our heritage. They're our own Perth story. \"\n\nShe said if the city wanted tourist attractions it should commission local artists to create original work.\n\nA 'forward moving' sculpture\n\nThe unveiling of the Boonji Spaceman sculpture at Stirling Gardens. (ABC News: Phoebe Pin)\n\nMurphy said he was surprised to learn that his spaceman had caused controversy.\n\n\"I had no idea any of this existed until recently,\" he said.\n\nThe artist rejected claims his work was not connected with the story of Perth and was simply a copy of work he had created elsewhere.\n\n\"First of all I'm not an American artist. I'm an artist, and my role … is to bring people together and to try and create works that inspire people,\" he said.\n\n\"Having put [the Boonji Spaceman] in other cities around the world I know the effect it has.\n\n\"I've seen it bring people together and … in most cases, I think people will be proud because it's a very forward-looking, forward-moving sculpture. It's very contemporary.\"\n\nBasil Zempilas attended the Boonji Spaceman unveiling. (ABC News: Phoebe Pin)\n\nMurphy said the words written on the sculpture had been personalised for Perth, based on conversations with locals and research on the city's history.\n\nThe words \"ambition\" and \"City of Light\" appear on the spaceman's chest.\n\n\"I'm hopeful and pretty confident that everyone will come together once they experience the sculpture and I think they'll be proud of it,\" Murphy said.\n\nCity of Perth said the Boonji Spaceman would remain in its Stirling Gardens location for a year before being moved to another, as yet unnamed, location in the city.\n\nIt did not say how much it would cost to restore the Ore Obelisk but said it required significant work, including replacing all the conglomerate rock elements.",
    "source": "ABC",
    "cluster_id": 6
  },
  {
    "url": "https://www.abc.net.au/news/2025-05-23/charles-and-camilla-view-aussie-orchid-at-chelsea-flower-show/105326104",
    "title": "Aussie orchid turns heads with gold at world's most prestigious flower show",
    "publish_date": "Fri, 23 May 2025 00:42:03 +0000",
    "category": "sports",
    "authors": [],
    "text": "Celebrity sightings at the Chelsea Flower Show are a dime a dozen.\n\nThe prestigious annual garden extravaganza — widely considered the world's most famous — draws a stream of A-listers to west London.\n\nIf you looked up from the colourful exhibits this year, you might even have caught a glimpse of King Charles III and Queen Camilla, who are annual attendees.\n\nDavid Beckham, Joanna Lumley and Piers Morgan were also among those sashaying between the blooms.\n\nBut spotting the Australian Great Sun Orchid. Well, that's much rarer.\n\nBritish actor Joanna Lumley strikes a pose at the show on Monday. (Reuters: Toby Melville)\n\nIt was the first time the purple flower has ever been displayed at the show, and that's for a good reason.\n\nThe orchid grows naturally only in specific parts of southern Australia, where it flowers between September and December.\n\nBut at Chelsea this year, it bloomed months out of season, thousands of kilometres from its natural habitat, in a completely different climate.\n\nThe incredible feat saw judges from Britain's Royal Horticultural Society — the centuries old charity behind the show — reward it with a gold medal.\n\n\"It's like winning the plant Olympics,\" said Kinglsey Dixon, the West Australian botanist who masterminded the Great Sun Orchid's appearance.\n\n\"The gold is beyond the icing of the cake. It is the cake.\"\n\nBut it almost didn't happen.\n\nThe Great Sun Orchids brought a slice of Australia to the Chelsea Flower Show. (Supplied: Reece Morgan-Tolworthy)\n\nThe Australian flower was part of a wider exhibit which also showcased orchids from South-East Asia and the Pacific.\n\nAssisted by the elite team at Kew Royal Botanic Gardens and other collaborators around the world, each display featured orchids as they would look in their natural habitat.\n\nThe Great Sun Orchid was planted in sandy soil amongst granite rocks and blackened sticks, taken from Professor Dixon's own Western Australian property after a recent bushfire.\n\nIt was in stark contrast to the tropical displays around it, and that was exactly what Professor Dixon intended.\n\n\"It's us. It's Australia,\" he said.\n\n\"It's a country of extremes and amongst all this, orchids are growing.\"\n\nQueen Camilla was among those inspecting the orchids at the show. (Supplied: Reece Morgan-Tolworthy)\n\nKew's orchid team pitched the idea of bringing the rare flower to Chelsea eight months ago.\n\n\"I said, 'Yeah, but we need years,'\" Professor Dixon said.\n\nWith transporting the plant from Australia and getting it to flower logistically impossible in that time frame, the team called on a colleague in Germany for help.\n\n\"I knew he had material that he's been growing for about 40 years from seed … I begged him, and he agreed,\" Professor Dixon said.\n\nWith the centrepiece secured, every other aspect was planned with the utmost precision, in the pursuit of winning gold.\n\nThe show's judging is notoriously strict.\n\nIt dates to 1913 and draws the world's most prominent gardeners to the smart streets of West London, not to mention celebrities and the British aristocracy.\n\nAustralia's Great Sun Orchid flowers only between September and December. (fickr: Corymb34 from Australia)\n\nStandards are eye-wateringly high, eclipsed perhaps only by the cost of an entry ticket, which can cost over 130 pounds ($270).\n\n\"We had some intel from previous years one display was disqualified because the font size was not quite the correct accredited size,\" Professor Dixon said.\n\n\"So we just were literally going around with tweezers, pulling off sand, pulling off grass and making sure the rocks are perfect.\"\n\nTheir hard work not only won gold, but the admiration of Camilla and Charles, who grow orchids in their Wildflower meadow at the king's country estate, Highgrove.\n\nCharles has supported the species' conservation for many years.\n\nThe exhibition organisers hope the win at Chelsea can attract more support to protect them, as the species faces growing threats in every corner of the globe.\n\nProfessor Kingsley Dixon was all smiles in London after claiming a gold medal. (ABC News: Adrian Wilson)\n\nOrchids 'particularly sensitive'\n\nThere are more than 30,000 species of orchids globally. They grow on every continent except Antarctica.\n\nBut their future is far from guaranteed.\n\n\"If you have degradation of land, fires out of season, other types of disruptions due to climate change, for example, then many plants and animals are then disrupted by those,\" said Mike Fay, the senior research leader in conservation genetics at Kew.\n\n\"The orchids are particularly sensitive.\"\n\nProfessor Fay explained the complex interactions orchids had with the environment meant they act as early warning systems for looming issues.\n\n\"If the orchid starts doing badly, then it's a sign that there's something major going wrong … they are the canary in the coal mine,\" Professor Fay said.\n\nScientists believe up to 60 per cent of orchids face possible extinction, and they're considered the most threatened plant group in Australia.\n\n\"It is important that every effort is made to arrest this decline for future generations to experience our incredible diversity,\" said Australian Orchid Foundation (AOF) co-chair Helen Richards.\n\n\"The AOF is delighted with the success that Kingsley has had with his display at Chelsea as it focuses local and international attention on the plight of Australia's orchid populations and the attempts being made to preserve our orchid heritage.\"\n\nThat sentiment is shared by the gold medal winners.\n\n\"It's not a message of despair but it's a message of a call to arms,\" Professor Dixon said.\n\n\"We can do it, and we can change it from bad news to a good news story very quickly.\"",
    "source": "ABC",
    "cluster_id": 7
  },
  {
    "url": "https://www.abc.net.au/news/2025-05-23/afl-luke-beveridge-kane-cornes-bulldogs-cats-geelong/105327304",
    "title": "Bulldogs coach Beveridge tight-lipped about Cornes 'confrontation'",
    "publish_date": "Thu, 22 May 2025 23:53:05 +0000",
    "category": "sports",
    "authors": [],
    "text": "Western Bulldogs coach Luke Beveridge has played down a heated exchange with TV commentator Kane Cornes, which occurred before Thursday night's AFL match at Kardinia Park.\n\nCornes's tense relationship with Beveridge reached a flashpoint when the pair shared a brief interaction on the boundary line ahead of the Bulldogs' clash with Geelong.\n\nBeveridge was walking past Cornes when the dialogue started and he stopped for a moment to share words in the direction of the Seven Network commentator.\n\nHe was then ushered away by Bulldogs communications staff.\n\nBeveridge was tight-lipped when quizzed on the incident at his post-match media conference following the Bulldogs' 20.7 (127) to 16.17 (113) loss to the Cats.\n\n\"Ultimately, we come in here and we talk about the game,\" Beveridge said.\n\n\"That's all we're after, isn't it?\n\n\"If you're trying to drum up any controversy, I don't think there was any.\n\n\"I've really got nothing to say.\"\n\nClarkson and Kangaroos ban Channel 7 pundit from interviews Photo shows Kane Cornes The Kangaroos confirm they have banned Channel 7 pundit Kane Cornes from talking to players and coaches over \"vindictive attacks\" aimed at North Melbourne stars.\n\nPressed further by a reporter, Beveridge said: \"I know what you're trying to do. You're not going to get me to bite.\"\n\nThe Bulldogs are one of the clubs that have banned Cornes from their change rooms.\n\nCornes addressed Thursday night's incident during Seven's coverage.\n\n\"There was a confrontation, there were some words spoken,\" Cornes said.\n\n\"But he's [Beveridge] combative, and they [Bulldogs] do like to protect their club and their players. I don't have an issue with it, it's a big game of footy.\n\n\"Clearly the relationship between myself and the Western Bulldogs isn't a strong one.\"\n\nCornes claimed Beveridge was staring at him \"quite strongly\" as the interaction developed.\n\n\"I didn't really know what to say, so I just said, 'G'day, Bevo', and it wasn't received that well as you can see in the vision,\" Cornes said.\n\n\"I would have liked to go on with the conversation and have it respectfully, but it wasn't the time or the place.\"\n\nAAP",
    "source": "ABC",
    "cluster_id": 8
  },
  {
    "url": "https://www.abc.net.au/news/rural/2025-05-23/tully-sugar-mill-turns-100-years-old/105323472",
    "title": "After a sour start to 2025, Tully celebrates 100 years of sweet success",
    "publish_date": "Thu, 22 May 2025 23:46:58 +0000",
    "category": "finance",
    "authors": [],
    "text": "Determined not to let back-to-back disasters crush their celebration, Australia's wettest town is preparing for its 100th sugarcane harvest.\n\nA sour start to 2025 threatened to overshadow the sweet milestone for Tully in Far North Queensland after successive tropical lows brought months of flooding rain during the peak growing season.\n\nDespite a significant reduction in the size of the crop, the growers say they are hopeful there's another 100 years ahead for the Tully Sugar Mill.\n\nOvercoming the odds\n\nOver the past two weeks multiple events have been held to mark the occasion, including the development of a historical site and mural.\n\nA mural has been established near the mill to mark the event. (ABC Far North: Sophie Johnson)\n\nTully Sugar chief executive Andrew Yu said it was a special time for the town and the industry.\n\n\"This is not only a celebration of Tully Sugar it's really a celebration of the town, of the community, because basically Tully was built around the sugar mill,\" he said.\n\n\"The theme of the celebration is called 'growing together for 100 years'. That's very true because without the community support, without the growers, there wouldn't be a mill.\"\n\nAndrew Yu says the town was built around its sugar mill. (ABC Far North: Sophie Johnson)\n\nHe said every time he heard the factory noise or saw the smoke coming out of the stack it made him excited.\n\nFor canegrowers like Anthony Silvestro and Hardeep Singh this season is extra special.\n\nEven though both are expecting lower yields on their farms south of Tully due to the floods, their spirits remained high.\n\n\"It's a good legacy what the mill has done for the district and the growers. It's been good to see that it's kept our community going,\" Mr Silvestro said.\n\n\" It's good to be a part of it, good to be connected to a mill that's lasted the century and hopefully it's got a few more centuries in it. \"\n\nSugarcane growers hope the industry will continue to thrive for centuries to come. (ABC Far North: Sophie Johnson)\n\nCane growing is an industry used to overcoming extreme weather, like Tropical Cyclone Larry in 2006 and Tropical Cyclone Yasi in 2011.\n\nIn 1925, Tully received more than 3,600 millimetres of rain. In 2025 it reached that figure in the first five months.\n\nThat is just 100mm shy of the total for the same period in 1950, the wettest year on record, with 7,898mm.\n\nIt is the reason the town's famous Golden Gumboot is 7.9 metres tall.\n\nThe sugar mill in Tully has been crushing cane for a century. (ABC Far North: Sophie Johnson)\n\nEven so, Mr Singh feels confident there are good years to come.\n\n\"I can see the mill going for 100 more years with the next generation and yeah, it's great to be a part of a good community,\" he said.\n\nBuilding on early success\n\nSugarcane has been grown in Tully since 1865, but it was not until November 1925 the town got its own mill.\n\nThe mill was built between 1924 and 1925. (Supplied: Greg Shannon)\n\nIt quickly became successful — by 1927 it was the first Australia sugar mill to crush more than 200,000 tonnes in a season.\n\nBy 1931 the Tully Co-Operative Sugar Million Association Limited was formed and local canegrowers bought the mill off the government.\n\nIt remained a grower-owned co-operative until 1990 when it became a public company known as Tully Sugar Limited.\n\nIn 2011 Chinese agribusiness company COFCO took over the mill which this year expects to crush at least 2.3 million tonnes of cane.\n\nTerry Grandshaw and Danielle Skocaj work together at SRA. (ABC Far North: Sophie Johnson)\n\nThe celebration is about more than looking back.\n\nFor Danielle Skocaj, who joined the industry 20 years ago, it was also about the future.\n\nNow principal researcher for Sugar Research Australia (SRA), she said when she first started there were only two or three female extension officers employed by the company.\n\n\"Whereas now you look at a lot of our advisory staff — not just in SRA but other industry organisations — its researchers, technicians [have] got to be at least 50-50, if not more a female than male ratio,\" she said.\n\n\" I think women have a very bright future in the industry. I guess we're able to look at things from a different perspective. \"\n\nThe Tully sugar industry has been growing since 1925. (Supplied: Greg Shannon via Brice Henry)\n\nSRA Burdekin district manager Terry Grandshaw said both the people and the technology had come a long way since cutting cane by hand.\n\n\"We've got to remember our fathers and grandfathers, they made real step change in the industry,\" he said.\n\n\"I think it's really important to understand we went from hand harvesting to mechanical harvesting, to trash blanket, to green cane harvesting.\"\n\nMs Skocaj is thrilled to see the mill continue to thrive today.\n\n\"The mill is the centre of our town,\" she said.\n\n\"It's a large industry, employs a lot of people, and to have withstood the last 100 years for all the different challenges is something definitely worth celebrating.\"",
    "source": "ABC",
    "cluster_id": 9
  },
  {
    "url": "https://www.abc.net.au/news/2025-05-23/nsw-sydney-weather-flooding-rain-rainfall-lllawarra-wollongong/105325886",
    "title": "Sydney suburbs cop more than 100mm of rain as deluge moves south",
    "publish_date": "Thu, 22 May 2025 23:09:56 +0000",
    "category": "finance",
    "authors": [],
    "text": "The weather system that dumped hundreds of millimetres of flooding rain on the Hunter and Mid North Coast has hit Sydney overnight.\n\nSteady rain developed late on Thursday and built through the night with the biggest falls recorded in the city's west.\n\nRichmond recorded 181mm in the 24 hours to 9am on Friday, with 116mm in Penrith, 116mm in Hornsby, 103mm in Auburn, 112mm in North Parramatta, 100mm at Belrose in the city's north and 92mm and 88mm at Canterbury and Marrickville, respectively.\n\nAbout 156mm has also been recorded at Darkes Forest, between Sydney and Wollongong.\n\nParramatta Wharf on Friday morning. (ABC News: Nandini Dhir)\n\nThe flooding north of Sydney was caused by the system lingering, but Bureau of Meteorology senior meteorologist Anges Hines said the wild weather was now on the move south.\n\n\"What that means [is] rain clearing out of the Hunter by about midday, rain clearing out of Sydney by this afternoon … and then it will be the Illawarra and the South Coast of NSW seeing further rain into the evening,\" he said.\n\n\" Much of that should be clearing up overnight and a brighter day across almost the entire state come Saturday. Sun should be out in most places. \"\n\nThe water has risen around Parramatta Wharf. (ABC News: Nandini Dhir)\n\nFresh train disruptions, flash flooding risk\n\nFlooding has cut road and rail lines north of Sydney and in parts of the city.\n\nLimited bus services are replacing trains with the Hunter Line out of action because of flooding at Sandgate.\n\nParramatta River breaks its banks at the Powerhouse Parramatta construction site. (ABC News: Patrick Thomas)\n\nOn the Central Coast, there are landslips between Kotara and Cardiff affecting the line.\n\n\n\nMatt Quinn from Sydney Trains said there were some problems on the inner city lines as well with trains skipping Lewisham Station because of flooding at the entrance to the station.\n\nOn Sydney's north shore line, trains are running late due to flooding on the tracks between Central and Town Hall.\n\nOn the T8 line in Sydney's southwest, trains are not running in both directions between Turrella and Revesby due to flooding on the tracks between Bardwell Park and Bexley North.\n\nFlooding near the rail line has caused disruptions to services on Friday. (ABC News)\n\nIn Sydney, flooding cut Richmond Road, Cattai Road, Pitt Town Road, the Wakehurst Parkway and the Audley Weir in the Royal National Park.\n\nA little rain will not stop the show's opening night tonight, Sydney's annual Vivid festival artistic director Gil Minervini said.\n\n\"The rain does present a number of challenges but as long as it's safe to do so, we go ahead no matter what,\" she said.\n\nSES warns of flash flooding risk\n\nThe rising water levels has prompted authorities to close low-lying areas. (ABC News: Warwick Ford)\n\nNSW State Emergency Service (SES) warned there was enough rain expected to present the risk of flash flooding, storm-related incidents and minor flooding on the Colo, Hawkesbury and Nepean rivers.\n\nSES Metro Zone responded to 327 incidents in the 24 hours to 5am on Friday.\n\n\"The real risk over the next 24 hours is flash flooding, with heavy rainfall totals between 60 and 100mm possible,\" Assistant Commissioner Colin Malone said.\n\n\"[Sydney] roads may become cut quickly and without warning. We ask the community to remain vigilant and never drive through flooded areas.\"\n\nThe rain began to set in on Thursday evening. (ABC News: Warwick Ford)\n\nThe SES is expecting heavy rainfall to extend further south to the Southern Tablelands and inland South Coast later on Friday, affecting Bowral, Braidwood, Bega, Katoomba, Goulburn, Nerriga and Captains Flat.\n\nIn addition to the rain, swimmers and surfers have been warned large and powerful surf conditions are expected along the coast.\n\nAuthorities say a spill at Sydney's Warragamba Dam is now less likely after overnight rain over the catchment came in below the highest forecasts.\n\nWater NSW says it will continue to monitor dam inflows and rainfall throughout the day.\n\nThe dam is currently 96 per cent full.",
    "source": "ABC",
    "cluster_id": 10
  },
  {
    "url": "https://www.abc.net.au/news/2025-05-23/queer-theatre-in-port-macquarie-brings-love-and-expression/105258200",
    "title": "Performer returning to hometown finds love, thanks to queer play",
    "publish_date": "Thu, 22 May 2025 22:58:43 +0000",
    "category": "entertainment",
    "authors": [],
    "text": "When April McLennan was 14, she knew she was queer but did not feel supported to express herself authentically in her small regional town.\n\nIt took another 14 years and a return to the town where she felt there was no queer community to find her first same-sex relationship.\n\nAfter finishing high school, April left her hometown of Port Macquarie for Sydney to follow her dreams in the arts and to find a community.\n\n\"You almost have to pause on your authenticity until you can get to places where you can express yourself freely and find a community,\" she said.\n\nBeing part of a queer play has given April the confidence to date a woman. (Supplied: Glitterbug Photography)\n\nNow back in Port Macquarie, she has found the support of a queer community she did not believe existed in her teens.\n\nShe credits taking a role in a queer theatre production with giving her the confidence to date a woman.\n\n\"It's everything that 18-year-old April wanted: to have a hot girlfriend and be in a cool play and have these cool friends,\" April said.\n\n\" I dreamed of finding a cast and a story and production company like this one and it happened when I went back to my small hometown at 28. \"\n\nPutting aside fear\n\nApril is part of a local production of The Swell, about a queer love triangle.\n\nProducer Stacey Napper says the play presents a normal love and a sense of belonging. (Supplied: Glitterbug Photography)\n\n\"The character I was auditioning for was in love and they were engaged, and I had never been engaged or in love,\" April said.\n\n\"I guess I went a bit method [acting]. It got me thinking about where in my life I could be more authentic.\"\n\nApril (right) says when she met her girlfriend, Jess, \"I just knew instantly.\" (Supplied: April McLennan)\n\nNot long after she auditioned, she put aside her long-term fear of dating a woman and matched with her now-girlfriend on a dating site.\n\n\"Female scared me more, it just seemed more serious,\" she said.\n\nApril said being part of the play gave her an instant group of supportive friends to ask questions and see relationships modelled.\n\n\"Without seeing it in front of me, it would have taken a lot longer,\" she said.\n\nThe Swell was a sellout success first time around and is back by popular demand. (Supplied: Glitterbug Photography)\n\nThe power of storytelling\n\nThose sentiments are exactly what social worker Stacey Napper and wife Kirsty Napper hoped to achieve when they decided to become first-time theatre directors and producers of the Port Macquarie production of The Swell.\n\nStacey had seen the play during Sydney's Gay and Lesbian Mardi Gras and said she was so moved by it that she told her wife: \"We have to do this.\"\n\nKirsty (left) and Stacey Napper felt their town needed more queer theatre and made it happen. (Supplied: Stacey Napper)\n\nThey cast all-local actors and crew with varying degrees of experience, each fitting somewhere into the spectrum of queer, if even as an ally.\n\n\"It's incredibly important, especially in regional areas, to have that visibility, gender expression, identity, sexuality and LGBT story themes,\" Stacey said.\n\n\"When you are able to see parts of yourself, whether you're questioning or you know someone who is, and you see that representation through the art of storytelling, it allows you to build that relationship to that experience.\n\n\" It can make it easier for people to step into that if that's their truth. \"\n\nHaving queer theatre in a regional town has brought the community together through creative opportunities. (Supplied: Glitterbug Photography)\n\nSparking conversation\n\nMichelle Ingram-Dobell, from the Port Macquarie-based LGBTQIA+ community group Out Loud and Proud, said having The Swell play in the town had brought the queer community more visibility and connection.\n\n\"In smaller towns people can feel really isolated if they're queer or questioning,\" she said.\n\n\"Putting those stories on stage helps people feel seen and understood, and it also gives others a chance to connect with experiences that they might not have thought about before.\"\n\nMichelle said the play had sparked more conversation within the community.\n\n\"It's sharing a real human story that makes people laugh and cry and has a bit of shock factor as well, and makes people think about it.\"\n\nQueer group Out Loud and Proud says bringing a queer play to a regional town brings visibility and connection. (Supplied: Glitterbug Photography)\n\nStacey said it presented a normal love, regardless of whether it was a queer relationship, showing how friendships in any sphere gave a sense of belonging.\n\n\"Arts and culture and storytelling are such a valuable way of expanding our minds and our hearts,\" she said.\n\n\"Love is love and we all deserve to exist harmoniously.\"",
    "source": "ABC",
    "cluster_id": 11
  },
  {
    "url": "https://www.abc.net.au/news/2025-05-23/camogie-association-votes-to-allow-shorts/105326988",
    "title": "Camogie ends 'skort war', allows players to wear shorts",
    "publish_date": "Thu, 22 May 2025 22:32:22 +0000",
    "category": "sports",
    "authors": [],
    "text": "Ireland's camogie players have won the right to wear shorts after the female sport's governing body voted overwhelmingly in favour of changing its rules at a special congress on Thursday, putting an end to the recent controversy and protests which hit the headlines.\n\nThe contested rule of camogie, the women's equivalent of hurling, stated that playing gear must include a skirt, skort or divided skirt.\n\nPlayer protests and the suspension of the Munster Final between Cork and Waterford put pressure on the Camogie Association of Ireland to call a special congress, where a vote was taken.\n\n\"We are pleased to announce that delegates have voted by an overwhelming majority in favour of giving players greater choice in their playing attire,\" a Camogie Association statement said.\n\nThe new rule, passed with 98 per cent of delegates in favour, will come into effect from midnight on Thursday, in time for the start of this year's All-Ireland championship on Saturday.\n\nKilkenny players initially took to the field in shorts ahead of their Leinster Senior Camogie final against Wexford, before changing into skirts or skorts. (Getty Images: Sportsfile/Michael P Ryan)\n\n\"I want to sincerely thank our incredible volunteers for their ongoing support over the last few weeks, and to our delegates for voting on behalf of over 120,000 members, including 94,000 playing members,\" Camogie Association president Brian Molloy said.\n\n\"As the All-Ireland Championships begin this weekend, we ask everyone to support their teams, drive higher attendances at all upcoming games, and help us fill Croke Park for the finals on 10 August.\"\n\nABC Elite Athletes in Australian Women's Sport Survey: We want to hear from you Photo shows A stylised graphic with three silhouettes of unidentified a female footballer, tennis player, basketballer ABC Sport and Deakin University have partnered to produce the first ABC Elite Athletes in Australian Women's Sport Survey.\n\nTwo motions to introduce shorts were defeated at last year's congress but the issue came to the fore again in the past few weeks when the Gaelic Players Association (GPA) published the results of a survey showing 83 per cent of players wanted the choice to wear shorts.\n\n\"The GPA would like to put on the record our admiration for camogie players across Ireland and beyond, both at inter-county and club level, who made their voices heard to ensure this outcome,\" the GPA said in a statement.\n\n\"To our own membership who have led the campaign for choice, we salute your willingness to stand up for both yourselves, and future generations of camogie players.\n\n\"We thank the delegates who listened to players' call for choice.\n\n\"The last few weeks have once again shown the necessity of putting players at the heart of decision making within Gaelic Games.\"\n\nABC/Reuters",
    "source": "ABC",
    "cluster_id": 12
  },
  {
    "url": "https://www.abc.net.au/news/rural/2025-05-23/australian-farmers-molasses-manure-fertiliser-fermented-costs/105295980",
    "title": "Farmers blend molasses, manure to brew cut-price fertiliser",
    "publish_date": "Thu, 22 May 2025 22:27:02 +0000",
    "category": "finance",
    "authors": [],
    "text": "Molasses, milk and manure may sound like an unusual combination, but for farmer Louise Vuillerman, they make a cheap, sustainable way of fertilising crops.\n\nMs Vuillerman farms beef cattle in the picturesque town of Corner Inlet, at the gateway to Wilsons Promontory.\n\nShe is one of a growing number of farmers experimenting with biofertiliser, a type of fermented fertiliser used to make nutrients more available to soil and plants.\n\n\"The aim is to grow more grass and improve our soils, but to do it in an economical way,\" Ms Vuillerman said.\n\nLouise Vuillerman uses biofert to grow more grass for her cattle. (ABC Rural: Faith Tabalujan)\n\nLike brewing beer\n\nBiofert producer and consultant, Daniel Hodges, said the process of making biofertiliser was a lot like brewing beer.\n\n\"We're putting sugar, protein and a starter in a vessel to brew together,\" he said.\n\n\"In warm conditions it will brew very quickly and it's ready to go onto the paddock once it stops bubbling.\n\n\"That can take anywhere from a week to four weeks, depending on the weather.\"\n\nA group of farmers gather around a bucket of recently-brewed biofert. (ABC Rural: Faith Tabalujan)\n\nMr Hodges said farmers could customise their batch.\n\n\"You can do a broad-spectrum biofert which targets a little bit of everything, or you can make one that targets an individual element you're missing in your soil,\" he said.\n\n\"We do that by adding rock dust or seaweed or specific sulphates to boost the nutrient content of the biofert.\"\n\nBig batches\n\nCarol and Brian Fitzpatrick started experimenting with biofertiliser five years ago, at their broadacre cropping operation at Waitchie in north-west Victoria.\n\n\"It was just trial and error at the beginning,\" Ms Fitzpatrick said.\n\n\"We started with two shuttles [containers] that didn't work, but another shuttle worked perfectly so we just went on from there.\"\n\nCarol and Brian Fitzpatrick use biofert on their broadacre cropping farm. (Supplied: Brian Fitzpatrick)\n\nThe Fitzpatricks produced about 120,000 litres of biofertiliser for sowing this year, and about 100,000 litres more to apply as a spray.\n\n\"No other farmers in our general area are doing what we're doing,\" Mr Fitzpatrick said.\n\n\"For years we followed the simple recipe of applying fertiliser and waiting for it to rain.\n\n\"But because we're cutting back on synthetic fertilisers, it's a bit of an unknown as to whether it'll work in this area.\"\n\nMrs Fitzpatrick said they had noticed an improvement in their crops.\n\n\"We get good emergence of our seeds and they're still healthy after the first eight weeks, so that means our liquid inject biofert is pretty effective,\" she said.\n\n\"But we've only used a general recipe, so the next step is to figure out exactly what blends of biofert work on our farm.\"\n\nCutting costs\n\nDeniliquin-based regenerative farming consultant Luke Harrington said poor farmers in Latin America were the first to brew biofertiliser.\n\nLuke Harrington says biofert is gaining traction with farmers across Australia. (Supplied: Luke Harrington)\n\n\"Producers in the Americas, Asia and across the world have been fermenting plant extracts and manures for centuries. So it's not a recent concept,\" he said.\n\nMr Harrington said bioferts were becoming more popular in Australia as farmers looked for ways to cut the cost of farming.\n\n\"Some larger farms in WA and SA are using bioferts as the main input for their crops and pastures now,\" he said.\n\nAustralian farmers brew hundreds of thousands of litres of biofert each year. (ABC Rural: Faith Tabalujan)\n\nMrs Fitzpatrick said it took time to make, blend and apply bioferts.\n\n\"And you can only really brew biofert in the warmer months,\" she said.\n\n\"So bioferts are a lot more cost-effective, but they do take time to produce.\"\n\nA farmer adds molasses to a batch of biofert to provide a sugar source for the brewing process. (ABC Rural: Faith Tabalujan)\n\nMr Fitzpatrick said he saw a potential market opportunity for farmers who used biofertilisers.\n\n\"So if we could get a premium for regeneratively-grown grain, for example, that might push more people into things like biofert,\" he said.",
    "source": "ABC",
    "cluster_id": 13
  },
  {
    "url": "https://www.abc.net.au/news/2025-05-23/sport-mitch-marsh-hits-maiden-ipl-century/105326814",
    "title": "Mitch Marsh smashes maiden IPL century",
    "publish_date": "Thu, 22 May 2025 22:02:34 +0000",
    "category": "sports",
    "authors": [],
    "text": "Mitch Marsh has been thumping attacks around in the Indian Premier League for 15 years with mixed success — but he's never enjoyed a season quite like 2025, which he's now capped with his first IPL ton.\n\nAustralia's T20I captain Marsh has worked wonders at the top of the order this campaign, trying to pummel the Justin Langer-coached Lucknow Super Giants towards the playoffs, only to be frustrated to miss out on making the knockouts.\n\nBut despite their elimination, the 33-year-old powerhouse was still determined to keep thrashing on Thursday in Lucknow's penultimate match of the season, hitting his first IPL ton in his 48th knock to propel the Super Giants to a consolation 33-run win against the ladder-leading Gujarat Titans at Ahmedabad.\n\nIt was the first century by an overseas player all season and took him to a total of 560 runs in just 12 innings, a tally only surpassed by the Indian trio of Sai Sudharsan (638), Shubman Gill (636) and Suryakumar Yadav (583).\n\nIn doing so, Mitch joined brother Shaun in being the only pair of brothers to hit an IPL ton.\n\nMitchell Marsh turned a slow start into a fine century. (Getty Images: Pankaj Nangia)\n\nThe eight booming sixes in his 64-ball 117 took his total this tournament to 32.\n\nOnly teammate Nicholas Pooran, who has 40, has scored more this year after adding another five in his 56 not out.\n\nMarsh has been Langer's mainstay this season and some of his power hitting has been staggering, like the 25 he took off the leg-spinning wizard Rashid Khan in his first over — 6, 4, 6, 4, 4, 1.\n\nHe added 121 off just 52 balls with Pooran and reached his hundred off 56 balls — only his second in all T20 cricket after the 100 not out he made for Perth Scorchers in a Big Bash match in 2021.\n\nIt was a particularly striking effort after he had struggled to get off to a flyer, making just 19 off his first 15 balls.\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\n\"In T20s these days, if you're 12 off 12 balls and not timing it well, it's panic stations. But today showed you can bat through and go on to stitch big partnerships.\"\n\nIndeed, his tour de force enabled Lucknow to make a monster 2-235 with tall New Zealand quick Will O'Rourke then taking 3-27 to help restrict Gujarat to 9-202 despite Shahrukh Khan 57 off 29 balls.\n\nFor Marsh, the century felt like the reward for a \"long journey\" that had begun when he was playing for Deccan Chargers back in 2010, but the frustration of missing out on the playoffs still hurt.\n\n\"It's been disappointing, all teams come in to win it but the IPL is a beast of a competition, you've got to be on it every game,\" he said.\n\n\"Any team can beat any team and that makes it the best tournament in the world.\"\n\nAAP/ABC",
    "source": "ABC",
    "cluster_id": 14
  },
  {
    "url": "https://www.abc.net.au/news/2025-05-23/asx-markets-business-live-news-23-may/105326858",
    "title": "Live: ASX rises, Bitcoin hits fresh high",
    "publish_date": "Thu, 22 May 2025 21:53:38 +0000",
    "category": "finance",
    "authors": [
      "Rhiana Whitson",
      "Stephanie Chalmers",
      "David Chau"
    ],
    "text": "Local shares rose modestly in early trade following a fairly flat finish on Wall Street, after US government bond yields eased off early highs.\n\nThe US House passed Donald Trump's tax bill, which now heads to the Senate. Bitcoin reached a fresh peak.\n\nFollow the day's financial news and insights from our specialist business reporters on our live blog.\n\nDisclaimer: this blog is not intended as investment advice.",
    "source": "ABC",
    "cluster_id": 15
  },
  {
    "url": "https://www.abc.net.au/news/2025-05-23/douglas-park-cemetery-plan-halves-capacity/105317632",
    "title": "Residents continue fight as developer reduces capacity of cemetery",
    "publish_date": "Thu, 22 May 2025 21:47:14 +0000",
    "category": "finance",
    "authors": [],
    "text": "Plans to bury tens of thousands of dead in a rural community outside of Sydney to address the city's cemetery shortage have been scaled back by the developer by almost half.\n\nHT Building Pty Ltd has lodged a revised concept plan with the NSW Department of Planning Housing and Infrastructure (DPHI) for a new multi-denominational cemetery and crematorium at Douglas Park, about a 40-minute drive north-west of Wollongong.\n\nDouglas Park Memorial Park is currently being assessed through a State Significant Development (SSD) pathway, however the proponent told the ABC it had now adjusted the number of burial plots outlined in its 2024 application from 69,759 to 37,000.\n\nThe Gilead-based company said a number of site studies including environmental heritage, waste management and infrastructure highlighted the need to reduce the cemetery's capacity.\n\nThe developer wants to build the cemetery and crematorium on vacant land wedged between two residential streets. (Supplied: DPHI Major Projects Portal)\n\n\"[This] has been informed by the completion of these technical studies and consultation with the government's State Design Review Panel,\" the company said.\n\n\"The crematorium remains part of the proposal for a later stage [of the development], and there will be dedicated consultation for this and all later stages of the project.\"\n\nThe revised concept plan, yet to be made public, is the third time the developer has changed the cemetery's size despite calls from Wollondilly Shire Council and the community to relocate or scrap the project.\n\n\"The amendments make no difference,\" said Tracey McConchie, who lives metres from the site.\n\nSandstone burials in bushfire zone\n\nBuilding Douglas Park Memorial Park, on a nearly 17,000 square-metre irregular block owned by Benima Pty Ltd, was first earmarked seven years ago.\n\nBut dozens of residents like Ms McConchie said it was the wrong site for the multi-million-dollar development.\n\n\"[The site] is basically a sandstone rock shelf. [The developer] would have to use a rock whipping process to basically manufacture soil to a depth to bury bodies,\" Ms McConchie said.\n\nTracey McConchie (centre) is among dozens of residents fighting the proposed cemetery since 2018. (ABC Illawarra: Brooke Chandler)\n\n\" There's no public transport to the site. It's in a bushfire zone, there's no sewerage, there's no gas line. It basically fails every criteria devised. \"\n\nFive years ago, despite strong opposition from the community and council, Wollondilly's Local Planning Panel approved the first blueprint for Douglas Park Memorial Park at 27,784 burial plots.\n\nThat capacity was almost tripled by the developer last year, alongside plans to offer funeral services daily using a crematorium and chapel.\n\nResidents staged a funeral procession in 2020 to demonstrate how the cemetery would clog roads. (Supplied: Paul Grierson)\n\nIn its 2024 scoping report the developer said increasing the number of burial plots \"responds to the need for cemeteries in NSW\" as evidenced in the 11th Hour report which found public cemeteries in Sydney would close to new burials in a decade.\n\n\"But we are on the outskirts of the [Sydney] region … and Wollondilly Shire itself is well supplied into the future, even with increases in the population,\" Ms McConchie said.\n\nShe also said a crematorium close to people's homes was \"inappropriate\" and raised health concerns.\n\nTo access the cemetery, cars would have to use either the Hume Highway or a windy, one-way route over the Nepean River known as The Gorge which Deputy Mayor Matthew Deeth said \"doesn't make sense\".\n\nMatthew Deeth says Wollondilly Shire Council will back the community's ongoing opposition to the cemetery. (ABC Illawarra: Kelly Fuller)\n\n\"We're not seeing the local infrastructure plans for the road networks being ready in time to not only take this type of development, but also the surrounding development of Wilton and Appin,\" Cr Deeth said.\n\nHe said if the DPHI approved the cemetery the road network would reach a \"failure point\".\n\nResidents ill, move away\n\nWhen Paul Grierson learnt the Douglas Park cemetery would be assessed as an SSD he sold his \"dream home\" and moved to nearby Picton.\n\n\"I just didn't have another two years of fighting in me,\" Mr Grierson said.\n\n\"I don't want to live with a cemetery, and it's going to happen at some level.\"\n\nPaul Grierson and his wife no longer live at Douglas Park due to the proposed cemetery. (ABC Illawarra: Brooke Chandler)\n\nHe is one of about four households who no longer live near Douglas Park Drive, partly because of the proposal.\n\nMs McConchie said \"it's a very unfair [and] sad outcome\" for the community.\n\n\"Some people have been made very ill trying to deal with this,\" she said.\n\nWollondilly Shire Council is currently reviewing whether developments like cemeteries should be built on rural land in the future.\n\nIf any amendments are made to the Local Environmental Plan (LEP), like prohibiting cemeteries in rural zones, the council told the ABC it would only affect development applications lodged after the change is made.\n\nHT Building Pty Ltd said the amended concept plan would be available for public comment in the coming months.",
    "source": "ABC",
    "cluster_id": 16
  },
  {
    "url": "https://www.abc.net.au/news/2025-05-23/pioneer-dam-in-tasmania-concerns-over-structural-stability/105324366",
    "title": "Dam in Tasmania's north-east at risk of 'imminent instability', report finds",
    "publish_date": "Thu, 22 May 2025 21:40:13 +0000",
    "category": "finance",
    "authors": [],
    "text": "A dam in north-east Tasmania has \"significant structural concerns\" and should be decommissioned, a report has found.\n\nNeighbouring the small township of Pioneer, the Pioneer Dam is believed to have been built nearly a century ago by the Endurance Tin Mining Company, with \"limited records of its construction\".\n\nA report released in April, commissioned by the Department of Natural Resources and Environment, found the structural condition of the disused dam was \"critically compromised\".\n\nIt said recent severe weather events had caused trees to fall and create holes in the dam wall, and \"unauthorised modifications\" including the removal of culvert pipes had further compromised the dam's structural integrity.\n\nThe report found the dam had \"indicators of imminent instability\". (Flussig)\n\nFurthermore, it said the top of the dam wall had been used as \"unauthorised access to an adjacent campground\".\n\nThe report recommended the water levels be lowered immediately, and the dam decommissioned, given \"indicators of imminent instability\".\n\n\"The most risk averse and responsible course of action is to implement an immediate reservoir drawdown, followed by a staged decommissioning plan, unless a clear operational need justifies comprehensive rehabilitation works,\" Max Moller, of Hobart-based Flussig Engineers, stated in the report.\n\nModelling of a piping failure shows the extent of a potential breach. (Flussig)\n\nThe Parks and Wildlife Service (PWS) said in the short term, it had decided to lower the water level once it receives engineering advice — expected in early July — advising it how to do so.\n\n\"A final decision on the long-term management of Pioneer Dam will be made following the next stage of planning, advice and completion of works to lower the dam level,\" a spokesperson said.\n\nPWS closed the dam and nearby Pioneer Lake, which is popular for camping and fishing, following a site visit by the engineering company in December.\n\nCommunity calls for safety measures\n\nAlana Keygan at Pioneer Lake in north-east Tasmania. (Supplied: Alana Kegan)\n\nAlana Keygan lives in Pioneer with her family.\n\n\"I used to go kayaking on the lake on a daily basis, take the kids down there. It's just a really beautiful spot to be,\" she said.\n\n\"It's completely silent, you can hear the birds chirping and you're just surrounded by so much nature and beauty.\"\n\nBut she hasn't been since it was closed to the public, and is concerned about a potential dam breach.\n\n\"It seems to be quite an urgent thing that needs to be addressed,\" she said.\n\nThe Dorset council is facilitating a community meeting between PWS and residents on Monday to discuss the situation.\n\nA breach could inundate nearby roads with floodwaters reaching depths of 2.3–3 metres within an hour, the report found. (Flussig)\n\nDorset Mayor Rhys Beattie said Flussig Engineers would deliver a briefing on their findings.\n\n\"Parks and Wildlife are taking the required steps to assure safety,\" she said.\n\nMs Keygan will be attending and advocating for an emergency plan in the event of a breach, and the installation of floodwater warning signs for the roads.\n\n\"And what systems are in place for the community to get the word out quickly to each other?\" she said.\n\nIt's something another Pioneer local, Jenny Bellinger, would also like to see.\n\n\"I'm quite concerned on the safety aspect,\" she said.\n\n\"The kids in the town swim in the river because they couldn't go to the lake this year.\n\n\"Are kids going to notice that the water is rising quickly? I don't know.\n\n\"We need probably a siren there to let everyone know if the dam wall does break.\"\n\nModelling shows flood could cut access routes\n\nAs part of the report, the engineers undertook modelling to see what would happen if the dam wall breached.\n\nFlood mapping withheld from public Photo shows Flooding covers most of the town of Huonville Tasmania's hydroelectric operator says it did not want to \"create unnecessary concern\" for residents of a small town by releasing flood mapping, done in 2016, which shows what could happen should a rare earthquake event cause catastrophic failure of two dams.\n\nThe modelling assumed the weather on the day of the breach was fair, with no rain.\n\nWhile it predicted no residential or commercial buildings would be inundated, the floodwaters would likely cut off critical access routes and isolate communities.\n\nMs Bellinger wants more modelling done to see what would happen during rainy conditions.\n\n\"I think it needs to be updated to what would happen in a one-in-20-year event or a one-in-50-year event,\" she said.\n\nThe report said further assessments may be required to consider potential loss of life, given Pioneer Lake's use as a recreational camping and fishing site.",
    "source": "ABC",
    "cluster_id": 17
  },
  {
    "url": "https://www.abc.net.au/news/2025-05-23/sport-french-open-serves-up-tough-draw-for-alex-de-minaur/105326726",
    "title": "De Minaur handed tough French Open draw",
    "publish_date": "Thu, 22 May 2025 21:40:08 +0000",
    "category": "sports",
    "authors": [],
    "text": "Alex de Minaur will have to negotiate a minefield of a first week at the French Open if he is even to battle his way to a potential quarterfinal date with his nemesis, Jannik Sinner.\n\nThe 15-strong Australian contingent will all face tough tests at Roland Garros, with two of the top women, Maya Joint and Ajla Tomljanović facing off against one another in the first round.\n\nRemarkably, the 19-year-old Joint, in her debut Paris main draw, and 32-year-old Tomljanović, in her 10th French Open, will first have a dress rehearsal on Friday in the Morocco Open semifinal in Rabat.\n\nNumber nine seed de Minaur, a quarterfinalist last year, has his work cut out to do better this time around as he faces the prospect of a third-round meeting with rising teenage Czech comet Jakub Menšík with the probability of the winner facing British hot shot Jack Draper in the last-16.\n\nDe Minaur should have confidence about taking on Serbian Laslo Djere in his opener, a player he's beaten three times and never lost to, before the possibility of an all-Australian match-up in the last 64 against James Duckworth, should his fellow Sydneysider get past the unpredictable Alexander Bublik first-up.\n\nMaya Joint will take on fellow Aussie Ajla Tomljanović in the first round. (Getty Images: Dan Istitene)\n\nThe Aussie star would then likely face Sinner, the returning world number one, who de Minaur has only taken one set off in 10 one-sided defeats, with potentially Novak Djokovic and reigning champ Carlos Alcaraz awaiting beyond that point.\n\nAlcaraz, victor in Rome over Sinner last week, attended the draw and rubbed shoulders with Paris St Germain footballer Ousmane Dembélé at the ceremony.\n\nThe Spanish ace will take on former world number four Kei Nishikori in the first round and could meet two-time finalist Casper Ruud in the quarters.\n\nSinner, just back after a three-month doping ban, will start by having to silence the locals in the first round, who will be backing 196cm-tall local Arthur Rinderknech, the world number 72.\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\nAlexei Popyrin, Australia's 25th seed, will fancy his chances against Japanese world number 75 Yoshihito Nishioka first up but there are forbidding first hurdles for Chris O'Connell, facing French 22nd seed Ugo Humbert, and Aleksandar Vukic, who's drawn number 24 seed Karen Khachanov.\n\nThe only consolation of the Joint-Tomljanović clash is the guarantee of one Aussie woman at least featuring in the second round.\n\nOlivia Gadecki has the toughest draw of all, up against number two seed Coco Gauff in the first round, while Daria Kastkina, in her first grand slam representing Australia, has a demanding opener against Kateřina Siniaková, the Czech doubles world number who's still a dangerous singles opponent for anyone.\n\nIga Świątek, after a fourth consecutive title and fifth overall, starts against Rebecca Sramkova, with the prospect of facing Britain's former US Open champ Emma Raducanu in the second round.\n\nShe's in the same quarter of the draw as last year's runner-up Jasmine Paolini, fresh off her Italian Open title, and world number one Aryna Sabalenka, who opens against Kamilla Rakhimova.\n\nOf the 15 Australian hopefuls who started the week in the qualifying tournament at the French Open, only battle-hardened Daria Saville is still left in the hunt for one of the precious Roland Garros main draw places.\n\nThe 31-year-old battler had too much know-how on the Paris clay for a promising young Frenchwoman 15 years her junior, Daphnee Mpetshi-Perricard, in the second round of quallies as she eased through 6-2 6-1 on Thursday.\n\nIf the world number 134 can next defeat the equally experienced American Taylor Townsend in Friday's make-or-break third-round qualifier, she'll make it into the Roland Garros main draw for the ninth time, 10 years since her debut on the Paris red clay.\n\nFirst round draw for Australian players\n\nWomen's singles\n\n(17) Daria Kasatkina v Kateřina Siniaková (CZE)\n\nKim Birrell v Jaqueline Cristian (ROM)\n\nAjla Tomljanović v Maya Joint\n\nOlivia Gadecki v (2) Coco Gauff (USA)\n\nDestanee Aiava v Dayana Yastremska (UKR)\n\nMen's singles\n\n(9) Alex de Minaur v Laslo Djere (SRB)\n\n(25) Alexei Popyrin v Yoshihito Nishioka (JPN)\n\nJordan Thompson v Jiří Lehečka (CZE)\n\nAleksandar Vukic v (24) Karen Khachanov (RUS)\n\nRinky Hijikata v Reilly Opelka (USA)\n\nAdam Walton v Qualifier\n\nChristopher O'Connell v (22) Ugo Humbert (FRA)\n\nJames Duckworth v Alexander Bublik (KAZ)\n\nTristan Schoolkate v Márton Fucsovics (HUN)\n\nAAP/ABC",
    "source": "ABC",
    "cluster_id": 18
  },
  {
    "url": "https://www.abc.net.au/news/2025-05-23/human-rights-lawyers-to-take-moreton-bay-council-to-court/105308698",
    "title": "Human rights lawyers challenge council over homeless camp destructions",
    "publish_date": "Thu, 22 May 2025 21:15:25 +0000",
    "category": "finance",
    "authors": [],
    "text": "Human rights lawyers are taking the City of Moreton Bay to court over its destruction of homeless camps on public land.\n\nOn Thursday, lawyers representing Basic Rights Queensland and the Northwest Community Group applied for a Supreme Court judicial review on behalf of homeless people evicted from Eddie Hyland Park.\n\nThe judicial review would determine whether the council's actions were lawful.\n\nIn April the council bulldozed the homeless encampment with an excavator and garbage truck, as well as threatening fines of up to $8,065 if people stayed.\n\nBasic Rights Queensland legal practice director Sam Tracy said they would argue that the City of Moreton Bay had violated their clients' human rights.\n\nSam Tracy believes the City of Moreton Bay has not upheld its human rights obligations. (ABC Radio Brisbane: Kenji Sato)\n\n\"We believe the obligations in regards to people's human rights have not been sufficiently taken into account,\" Mr Tracy said.\n\n\" We can't simply continue to stand back and watch people's tents, possessions, and stability be thrown away. \"\n\nMr Tracy said they were applying for a judicial review to test in court whether the seizures were legal.\n\nThe human rights lawyer said they would argue that the seizures were a breach of property rights and the prohibition against \"cruel, inhuman, or degrading\" treatment.\n\nA council spokesperson said it had not violated human rights laws.\n\n\"Council has received appeals from individuals who were removed from Eddie Hyland Park,\" the spokesperson said.\n\n\"We respond to appeals in accordance with any requirements of the law.\n\n\"There is no breach of anyone's human rights in relation to this matter.\"\n\nDaughter's ashes discarded in eviction\n\nHomeless couple Debbie and John Bobeldyk have both lodged appeals with the City of Moreton Bay after being evicted from Eddie Hyland Park.\n\nDebbie Bobeldyk says she feels as though she has been stripped of her dignity. (ABC Radio Brisbane: Kenji Sato)\n\nThe couple said they were given one hour to collect some of their belongings before council officers loaded the rest into a garbage truck.\n\nMrs Bobeldyk said they had lost several tents, a fridge, a portable air conditioner, and their daughter's ashes in the process.\n\nThe 56-year-old said she felt as though she had also been stripped of her human dignity.\n\n\"They make you feel as though you're not worth the land you're standing on,\" Mrs Bobeldyk said.\n\n\"We're not homeless because we want to be.\"\n\nCouncil declares all homeless camping illegal on public land Photo shows A woman at a campsite. City of Moreton Bay chief executive Scott Waters says the change will benefit the region's homeless population.\n\nMrs Bobeldyk said the Department of Housing did not offer them accommodation because they were unable to find their ID documents after their camp was destroyed.\n\nShe said they had since applied for the documents but were yet to hear back from the department.\n\nA housing department spokesperson said they were unable to comment on the Bobeldyks's case due to privacy reasons.\n\n\"The department and our specialist homelessness services work with individuals to establish their identity and obtain ID documents,\" the spokesperson said.\n\n\"Our Critical Response Team is working on the ground across the Moreton Bay region offering housing support to every person willing to engage.\"\n\nHoping to set precedent\n\nPaul Slater says he hopes to take Brisbane City Council to court next. (ABC Radio Brisbane: Kenji Sato)\n\nNorthwest Community Group president Paul Slater said he hoped that taking City of Moreton Bay to court would set a precedent for other councils.\n\n\"From the start we've said this is a violation of people's human rights,\" Mr Slater said.\n\n\"If it is found to be illegal we're hoping this will stop not just Moreton Bay but any other council, including Brisbane City Council and the Gold Coast council.\"\n\nDebbie and John Bobeldyk spent Anzac Day without a tent to keep out the rain. (ABC Radio Brisbane: Kenji Sato)\n\nMr Bobeldyk said they spent Anzac Day sheltering under a tarp because they did not have a tent to keep out of the rain.\n\nThe disability pensioner said they had since set up camp in a secluded plot of land and were lying low in the hopes of not being reported.\n\nBut he said their remote location meant less access to charity and support services.\n\n\"The rangers told us to stay sight unseen,\" Mr Bobeldyk said.\n\n\"If nobody complains they'll leave us alone. That's what it's come to.\"\n\nThe City of Moreton Bay said it would follow a complaints-based system, responding to resident reports of illegal homelessness.",
    "source": "ABC",
    "cluster_id": 19
  },
  {
    "url": "https://www.abc.net.au/news/2025-05-23/family-rescued-ses-helicopter-from-roof-loses-home-taree-floods/105325222",
    "title": "'I don't think anyone is coming': Family's anxious roof wait for flood help",
    "publish_date": "Thu, 22 May 2025 21:12:05 +0000",
    "category": "finance",
    "authors": [],
    "text": "Just hours after her family were airlifted from their roof with floodwaters swelling below, Seeanna Briscoe was preparing for another double shift at Taree Hospital.\n\n\"What else am I going to do?\" she told the ABC.\n\nIt's all hands on deck at the hospital and that includes healthcare worker Ms Briscoe, who on Wednesday lost almost everything.\n\nSeeanna Briscoe's husband, Troy, was told by emergency services to kick a hole in the roof to bring his family up above rising floodwaters. (Supplied)\n\nHer husband Troy, sons Jax and Cruz, her father Lawrence, their dogs and three baby chickens were winched to safety by a rescue helicopter as raging floods claimed their newly rented Glenthorne home on Wednesday morning.\n\nMs Briscoe went to work the morning earlier thinking the incoming rain \"was nothing like the 2021 floods\".\n\nBy midday she would be trapped at the hospital with all roads around Taree flooded, her family stranded at home.\n\nBriscoe's family were rescued from the roof of their new home while she was stranded at Taree Hospital. (Supplied)\n\nAt 8pm the second level of their home began to flood. Troy swam through the garage to fetch life vests for the children and told them to pack a bag of clothes each.\n\nThrough Tuesday night the family would progressively move higher and higher up their three-level home.\n\n'I didn't know if my family would survive'\n\nIn the early hours of Wednesday morning, Troy was told by emergency services to kick a hole in the roof and bring his family up above the house.\n\nThe family was rescued by helicopter. (Supplied)\n\nThey were soon on the roof with the floodwaters lapping at their feet.\n\n\"[Troy] said, 'I don't think anyone is coming, I think we're gonna die',\" she recalled her partner saying as the flooding intensified on Tuesday evening.\n\n\"I didn't know if my family would survive.\n\n\"I just kept telling him it would be daylight soon.\"\n\nFrom the helicopter her family had the most devastating vantage point of all, watching as their belongings swept into the deluge that has battered the Mid North Coast this week.\n\nVideos taken by the family showed the frightening moment as their home was slowly swallowed.\n\nOther footage showed them pacing on the roof trying to get the attention of emergency services above.\n\nThe family was rescued by an SES helicopter after living in the home for just five months. (Supplied)\n\nPolAir rescued Ms Briscoe's teenage sons first.\n\nThey were eventually bussed to safety in Tuncurry while her husband and father were dropped to safety on a nearby verandah.\n\nThe family had been there just five months. Nothing they lost was insured and they are now homeless.\n\nWater rose quickly through the family's home. (Supplied)\n\n'Taree is an island now'\n\nMs Briscoe is helping flood victims in the hospital who have a raft of injuries, while her family finds refuge with different relatives.\n\nShe is sleeping in a makeshift wing of the hospital, holed up until the waters recede. She plans to continue working \"to keep my mind off it\".\n\nWhen she can eventually leave she will have no home to go back to.\n\n\"Taree is an island now,\" Ms Briscoe said.\n\n\" We lost everything, the cars, everything. \"\n\nTreasured pictures, mementos, clothes, furniture, electronics and husband Troy's prized Harley Davidson motorbike are likely lost forever.\n\nThe family are just one story among the more than 300 people who were rescued from raging floodwaters that day.\n\nTaree has been inundated by floodwaters, with hundreds of rescues. (ABC News: Liam Patrick)\n\n\"The kids' stuff is just stuff, at least they're alive,\" Ms Briscoe said.\n\n\"It's traumatising for everyone, my kids don't have a home and we're actually homeless.\"\n\nThree maps that show the scale of the NSW flood disaster Photo shows A white house surrounded by water caused by flooding. Large parts of NSW are experiencing flooding, with more than 50,000 people preparing to evacuate. The mid-north coast is bearing the brunt of this weather event, with Taree and Port Macquarie particularly hard hit.\n\nOn her double shift on Thursday afternoon, Ms Briscoe told the ABC she is preparing for another night sleeping at the hospital.\n\nWhen she finishes she has no home to go to, with her family spread out across the Mid North Coast sleeping in spare rooms of loved ones.\n\nTheir only lifeline right now are the generous friends and family willing to lend a hand or with a crowdfunding campaign to help their attempts to rebuild their lives.",
    "source": "ABC",
    "cluster_id": 20
  },
  {
    "url": "https://www.smh.com.au/national/australia-news-live-anthony-albanese-announces-nsw-flood-disaster-relief-former-pm-turnbull-lashes-coalition-split-trump-blocks-harvard-from-enrolling-international-students-20250523-p5m1ks.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Australia news LIVE: Anthony Albanese announces NSW flood disaster relief; Former PM Turnbull lashes Coalition split; Trump blocks Harvard from enrolling international students",
    "publish_date": "Fri, 23 May 2025 12:00:22 +1000",
    "category": "finance",
    "authors": [
      "Cindy Yin"
    ],
    "text": "The Australian sharemarket has advanced after a choppy session on Wall Street caused by worries coming out of the bond market about the US government’s debt.\n\nThe ASX 200 rose 26.6 points, or 0.3 per cent, to 8366.8 by 11am AEST on Friday, with five of 11 industry sectors in the green.\n\nMining giant Rio Tinto was 1.5 per cent lower in early trade after it announced on Thursday night it had started a global search to replace chief executive Jakob Stausholm, who will step down from his position after spending almost five years at the top.\n\nLoading\n\nBHP was 0.4 per cent lower and Fortescue shed 1.6 per cent in early trade.\n\nThe big four banks are in positive territory. NAB added 0.6 per cent, Westpac gained 0.5 per cent while CBA and ANZ both edged up 0.1 per cent.\n\nEnergy stocks are the best-performing sector with Woodside and Santos adding 0.5 per cent in early trade.\n\nWall Street trading remained choppy throughout most of the day following Wednesday’s big slump for the S&P 500. That loss has put the benchmark index on track for its worst week in the past seven.\n\nThe S&P 500 slipped 2.60 points, or less than 0.1 per cent, to close at 5842.01. The Dow Jones fell 1.35 points, or less than 0.1 per cent, to 41,859.09. The Nasdaq composite rose 53.09 points, or 0.3 per cent to 18,925.73.\n\nRead more on the markets here.",
    "source": "SMH",
    "cluster_id": 21
  },
  {
    "url": "https://www.smh.com.au/business/consumer-affairs/trump-turbulence-and-travel-are-us-skies-still-safe-20250521-p5m137.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Trump, turbulence and travel: Are US skies still safe?",
    "publish_date": "Fri, 23 May 2025 11:55:00 +1000",
    "category": "finance",
    "authors": [
      "Chris Zappone"
    ],
    "text": "Save Log in , register or subscribe to save articles for later. Save articles for later Add articles to your saved list and come back to them any time. Got it Normal text size Larger text size Very large text size Anyone considering a trip to the US is confronted with a question: Is it safe to go? Headlines from the second administration of President Donald Trump convey scenes of disruption, confusion, corruption and shattered norms. Is it possible to enjoy a vacation in a country like this? There are 27,500 commercial flights travelling in US skies a day. Credit: Bloomberg You can imagine two circles of a Venn diagram: One represents the Trump-spurred disruption and sense of perma-crisis he brings. A second one represents basic aviation safety and having a good time. Surely, the two circles can’t stay separate forever. If and when they overlap, will they overlap on your holiday to the US? The US suffered its most deadly air crash in years in January when an American Airlines Flight collided with a US Army Black Hawk helicopter near Ronald Reagan Washington National Airport in Virginia, killing 67 people. A preliminary investigation raised questions about congestion in the area and the air traffic control staffing. A perhaps more pressing example in the era of Trump: air traffic controllers at Newark Liberty airport near New York lost radar vision and radio contact with flights on April 28. Some controllers were so upset afterwards that they took trauma leave. After the scare, the chief executive of United, which uses Newark as a hub, cut back flights for safety. One contributing factor is that Newark is a temporarily closed runway, set to reopen in June.\n\nAdvertisement\n\nLoading But to give a sense of the challenge for the US more broadly, consider that there are 3800 commercial flights a day in Australia. In the US, that number is closer to 27,500, with air traffic controllers monitoring and directing 5000 flights simultaneously in peak periods. The Federal Aviation Administration has been trying to upgrade its network of staff and equipment for decades, while attracting more air traffic controllers. There are now 14,000 air traffic controllers in the US, nearly 2000 of them hired last year. However, that still leaves a shortfall of 3000. Trump has largely inherited this problem, though he previously had four years as president to address it. However, it’s far from clear that Trump is inclined or capable of improving the situation for US air traffic control. Immediately after the January crash near Washington, Trump blamed “diversity, equity and inclusion” hires as contributing to the ability of air traffic controllers to function. In a statement at the time, Trump claimed that under former president Joe Biden the FAA “specifically recruited and hired individuals with ‘severe intellectual’ disabilities [and] psychiatric issues ...’” When Trump returned to office in January, he came with billionaire campaign funder Elon Musk in tow, pushing a radical government-slashing project called DOGE (the Department of Government Efficiency).\n\nAdvertisement\n\nFAA air traffic controllers are themselves exempt from DOGE cuts and are being recruited. But at more senior levels, the Washington Post reports, in keeping with the DOGE purges, there has been an exodus of people. American air traffic control is ripe for reform. As the Brookings Institute notes: “The consensus of countless commissions and expert reports is that air traffic management is a 24/7 high-tech service ‘business’ trapped in a regulatory agency that is constrained by federal budget and acquisition rules.” That is, the budget for its modernisation keeps getting eaten up by the cost of maintaining legacy systems. United chief executive Scott Kirby reassured reporters in New York on May 13: “At Newark, first and foremost, it is safe. It is absolutely safe when these issues happen. Our pilots are trained with back-up procedures to keep the airline safe, and so whether you lose communications or radar, we have back-up procedures.” Donald Trump is all about disruption and retribution. But what does that do for aviation safety? Credit: AP To his credit, Kirby has not shied away from the issue. Kirby has publicly highlighted the jam United and the US aviation sector has been put in by the FAA, and by Trump. In April, as the world watched and waited for the next shoe to drop in Trump’s tariff strategy, Kirby offered not one but two earnings estimates, depending on whether the US president’s moves triggered a recession or not.\n\nAdvertisement\n\nTrump, in his first 100 days in office, has imposed hiring freezes across government, stripped federal employees of job protections and fundamentally downsized the US government while centralising White House power. The head of the US Department of Transportation, Sean Duffy – an ex-congressman, prosecutor and former reality TV star, natch – has announced a plan expected to cost tens of billions of dollars to fix the US air traffic control system within four years. Trump supports the plan. But the devil is in the delivery. And to be sure, many air traffic controller bodies around the world are in the process of rebuilding staff. Airservices Australia, for example, is recruiting and training controllers. “We expect controller numbers to be back to surplus capacity by mid-year,” a company spokesman said. But in the US, the problem is longstanding and deep-seated. Now uncertainty abounds for Americans and visiting travellers alike. And it’s not just the fear of accidents. It’s also the waiting, the delays and the disruptions on the ground that mark so much travel in the US. As for Newark Liberty Airport, Kirby cut back flights in light of the safety scare and issued two messages exhorting regulators to take further actiondespite his insistence that it’s safe. Not everyone agrees.\n\nAdvertisement\n\nWilliam McGee, a senior fellow for aviation and travel at the American Economic Liberties Project, told NPR he just didn’t “see the seriousness and the sense of purpose from this administration” to address the FAA problems. The US has been grappling with air traffic control issues for years. Credit: AP Despite Kirby’s commentary on the FAA and US aviation, he is supportive of Trump’s aspirations to bring back well-paid jobs to the US, saying the goal is “laudable”. He notes that United is “one of the few companies left in the country that creates the kind of jobs where you can make a six-digit income, you can support a family, buy a house and [send] your kids to college, even if you only have a high school education”. Kirby says he is taking a wait-and-see approach to Trump on the economy and tariffs. Speaking the day after Trump announced a reduction in tariffs with China, Kirby said: “Everyone should kind of take a breath because we’re not at the end game yet. We’re not at the new normal yet”. Whatever the outcome, United is betting big on the future. After being the only American airline to fly to Australia through COVID lockdown, United is piling on more capacity for flights to Australia. Already, from November to March, United says it was the largest carrier between the US and Australia as measured by available seat miles. While the majority of those flights were Americans visiting Australia, Australians travelling to the US are well represented.\n\nAdvertisement",
    "source": "SMH",
    "cluster_id": 22
  },
  {
    "url": "https://www.smh.com.au/environment/climate-change/the-rumours-were-true-china-s-greenhouse-gas-emissions-are-falling-20250522-p5m19y.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "The rumours were true: China’s greenhouse gas emissions are falling",
    "publish_date": "Fri, 23 May 2025 11:49:50 +1000",
    "category": "finance",
    "authors": [
      "Nick O'Malley"
    ],
    "text": "Crucially, it had done so as its energy demand increased. This is what makes the data so remarkable. Over recent years, the world – and China in particular – has deployed renewable energy technology far faster than expected. This was always good news. The problem has always been that demand for electricity kept growing faster than the supply of new renewables, so while there was more clean energy in global systems, emissions kept growing. Myllyvirta’s new analysis, first published in Carbon Brief earlier this month, shows that China has finally broken this terrible nexus: emissions in China are finally falling as its use of electricity grows.\n\n“Being able to cut emissions while power demand not just grew but grew above the historical average is certainly a historic milestone, showing the scale that clean energy additions have reached in China,” Myllyvirta told this masthead on Tuesday. And what happens in China affects us all. Loading “Needless to say, if the fall in emissions is sustained, that constitutes a major breakthrough for the global energy transition and the global climate effort, as China has been responsible for all of the net increase in CO2 emissions since the Paris climate conference, so an emission peak in China would highly likely enable global emissions to peak and decline,” Myllyvirta said. “Whether the falling trend in China’s emissions continues depends strongly on the clean energy targets in China’s upcoming Paris climate commitments and five-year plan; if the current rate of clean energy additions is continued, it is very likely that it will.”\n\nSo far, the indications for this are good, at least politically. Though China’s “all of the above” energy policy includes new coal plants as well as clean power, the clean is outweighing the dirty. Those new coal plants are not only displacing older ones, they are running under capacity. And China remains determined to achieve energy independence at pace – which means generating energy domestically to cut its dependence on imports of oil, gas and coal. Energy analyst Tim Buckley notes that China is acting in self-interest here. As it expands its regional hegemony, China is determined both to free itself of coal, oil and gas imported via potentially vulnerable shipping lanes, and to dominate the technologies of the future. It is also worth noting that the slight dip in emissions may be a signal of a plateau in emissions rather than an ongoing decline, Buckley says.\n\nLoading This means that even as the Trump administration goes about unpicking former president Joe Biden’s subsidies for green energy deployment to support the American shale oil industry, China is pushing harder on new clean tech. A speech made by Chinese President Xi Jinping last month also caught the attention of climate analysts and diplomats. China must accelerate the transition to clean energy, he said. “Clear waters and green mountains are just as valuable as gold and silver. Green transformation is not only the essential way to address climate change, but also a new engine for economic and social development.”\n\nStriking a determinedly different tone from the Trump administration, he added, “We must deepen international co-operation. Solidarity and co-operation are needed more than ever as the world faces multiple, compounded challenges. We should rise above estrangement and conflict with openness and inclusiveness.” But the key news in a colourful speech was buried in some of its most drab language. Xi said that in coming months China would announce a new emissions reduction target for 2035 that would cover “all economic sectors and all greenhouse gases”. This is significant because in the past China has committed to reducing greenhouse pollution only relating to electricity production. China will increase its climate ambition across its economy, even as it beats its own climate targets. This is a good sign for crucial global climate talks to be held in Brazil later this year, before which other nations, including Australia, are expected to announce strong new 2035 targets. “What’s already clear is that China’s recipe for peaking and reducing emissions is a combination of rapid electrification – not just in transportation but also in industry and buildings – with very large-scale additions of clean energy,” Myllyvirta says.",
    "source": "SMH",
    "cluster_id": 23
  },
  {
    "url": "https://www.smh.com.au/goodfood/sydney-eating-out/killer-char-siu-and-spicy-soups-your-guide-to-eastwood-s-best-chinese-and-korean-food-20250522-p5m1gu.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Killer char siu and spicy soups: Your guide to Eastwood’s best Chinese and Korean food",
    "publish_date": "Fri, 23 May 2025 11:48:29 +1000",
    "category": "finance",
    "authors": [
      "David Matthews"
    ],
    "text": "Treat a visit to Rowe Street like a pub crawl, and discover a cult soup spot, an epic mart with a “sauce corner”, barbecue eateries, night markets, grocers and lots more.\n\nSave Log in , register or subscribe to save recipes for later. You have reached your maximum number of saved items. Remove items from your saved list to add more. Share\n\nEastwood’s food claim to fame, historically at least, is the Granny Smith apple. First discovered growing on Maria Ann “Granny” Smith’s property back in the 1860s, the apple is still celebrated with an annual festival. But since Eastwood’s commercial centre was pedestrianised in the 1990s, the suburb has had plenty more to offer in the culinary stakes. The catalyst has been a rapid shift in demographic: as of 2021, more than 48 per cent of residents claim Chinese ancestry, while nearly 9 per cent have roots in Korea. Rowe Street takes those figures off the page and renders them in full colour, with the Koreatown Project, backed by government funding, accelerating the transformation of the street’s east end from local hub to delicious destination, as vital for Korean cooking and culture as Strathfield or Lidcombe. Jimmy Park, the project’s manager, has witnessed the change first-hand. “When I came in 1988, there were only two Korean shops on Rowe Street,” he says. “Now, it’s more than 120.” Those range from hairdressers and boutiques, to the grocers and restaurants that give the street its distinctive flavour. Cross the station, and Korean turns to Chinese, with broad regional representation and plenty outside the lines. Justin Li, a Ryde councillor who recommends treating a visit to Rowe Street a little like a pub crawl, says it’s the demise of a fast-food giant that best represents Eastwood’s evolution. “An old Chinatown institution, Super Bowl, recently opened on Rowe Street West, ironically where Eastwood’s McDonald’s once stood. It says a lot about the changing demographics and tastes locally over the last few decades.” The choice of side is your own, but such is the scope that whichever you pick first, odds are it won’t be too long before you’re back for more. Hwagae Banchan’s specialty is the array of side dishes – banchan – that accompany a Korean meal. Jennifer Soo\n\nAdvertisement\n\nHwagae Banchan Shop Exit the station to the east, and you’ll find a clutch of stalls specialising in Korean street food, including tteokbokki, the spicy rice cakes, and flash-fried Korean-style hot dogs. Stop at Hwagae Banchan Shop, though, and the specialty is the array of side dishes – banchan – that accompany a Korean meal. Classics include cabbage or spring onion kimchi tinted red with gochugaru, Korean chilli powder, or braised lotus root. Stock up, then grab some kimbap, Korea’s answer to a sushi roll, to takeaway. 10 Railway Parade, Eastwood Rice cakes, or tteok, are the main draw at Siroo. Jennifer Soo Siroo Rice Cake Cafe Make for Rowe Street, perhaps drop into ginseng specialist Cheong Kwan Jang, then join the line at Siroo. With South Koreans now drinking 353 cups of coffee per head a year – more than double the global average – the nation’s cafe culture is ever-expanding. That partly explains Siroo’s popularity, but it’s the rice cakes, or tteok, that are the main draw. Made each morning by owner Changhyun Lee, Siroo’s tteok are characteristically chewy, with the injeolmi – made with sticky rice and finished with roasted soybean powder – a signature. Buy a pack, or try it in the cafe’s viral shaved-ice dessert, bingsu. 106 Rowe Street, Eastwood, sirooricecakecafe.com\n\nAdvertisement\n\nMiryang Gukbap soup shop channels South Korea’s south-east. Jennifer Soo Miryang Just a couple of doors up from celebrated Korean-Chinese restaurant Biwon (try the jajangmyeon) is Miryang, a freshly opened soup restaurant channelling South Korea’s south-east. The menu may be short, but the flavours are long and deep in everything from wagyu shank soup and gukbap with sundae – the Korean blood sausage – to the signature, light and aromatic Miryang-style pork soup loaded with spring onions. Season yours with salted shrimp and load up on fluffy rice – refills come free. 104 Rowe Street, Eastwood, instagram.com/miryang_eastwood The sauce section at Eastwood Mart. Jennifer Soo Eastwood Mart There’s no shortage of grocers on this side of Eastwood station: S-Mart is an all-rounder, while KMALL09 (also in Lidcombe) stands out for its epic size, heaving shelves and range of K-beauty products. But Eastwood Mart, smack-bang on Rowe Street, is a classic. Big enough to have the range, small enough to feel personal, it’s the place for bulk kimchi, noodles, seaweed and fresh vegetables. Don’t leave without taking a turn around the “sauce corner” or grabbing some mandu from the staff helming the hotplate out front.\n\nAdvertisement\n\n73 Rowe Street, Eastwood Getbawi specialises in hoe, or raw seafood. Jennifer Soo GetBawi Up the hill from K-bakery La Vigne and tucked into a shopping mall, newcomer GetBawi has quickly garnered a dedicated following. The reason? It’s one of the few Sydney restaurants specialising in hoe, or raw seafood, served here on platters with the likes of perilla leaves for wrapping. Other highlights include spicy blue swimmer crab hotpot and the textural masterpiece that is yukhoe tang tang, featuring high-grade raw beef strewn with umami-rich octopus. 201/62-80 Rowe Street, Eastwood, instagram.com/getbawi Split a bowl of gamjatang soup with friends at Guk’s Eedaero Gamjatang. James Brickwood Guk’s Eedaero Gamjatang\n\nAdvertisement\n\nFor years, family-run Pu Ji Mi sold mountains of jok bal (soy-braised pork hocks) in this unassuming mall. Its closure in February was mourned far and wide, but the good news is that in its place Eastwood now has its own outpost of Guk’s Eedaero Gamjatang, Jongguk Lee’s cult soup kitchen. Split a gamjatang with friends, and it’ll be rich from long-simmered pork bones and doenjang, spicy from gochugaru and gochujang and loaded with perilla, potatoes and enoki mushrooms. Add a round of ice-cold Cass lager to keep the vibes high. 202/62-80 Rowe Street, Eastwood Photo: Jennifer Soo Dae Jang Kum Crossing the road, Uncles’ Butchery, is a chance to score Korean barbecue meats – Black Onyx chuck tail flap, say – but if you’d prefer to grill here and now, a block up is Dae Jang Kum, where the charcoal burns hot, and the beef intercostal in soy and sesame is the order. Don’t skip the yukhoe, either, which sees Korea’s own beef tartare levelled up with a crisp puffed rice cracker for texture. 29 Rowe Street, Eastwood Kowloon Cafe in Eastwood. James Brickwood\n\nAdvertisement",
    "source": "SMH",
    "cluster_id": 24
  },
  {
    "url": "https://www.smh.com.au/sport/nrl/why-silent-latrell-mitchell-is-still-league-s-loudest-voice-20250521-p5m0z6.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Why silent Latrell Mitchell is still league’s loudest voice",
    "publish_date": "Fri, 23 May 2025 11:40:00 +1000",
    "category": "sports",
    "authors": [
      "Dan Walsh"
    ],
    "text": "Save Log in , register or subscribe to save articles for later. Save articles for later Add articles to your saved list and come back to them any time. Got it Normal text size Larger text size Very large text size Latrell Mitchell’s former coach Jason Demetriou says it as well as anybody. “When Latrell speaks the narrative doesn’t always go the direction he wants. The narrative can go anywhere because he’s either loved or he’s not liked.” For nine months and counting, the NRL’s most intriguing figure has kept his counsel and kept the quotes to himself. Yet Mitchell is still rugby league’s biggest star and accordingly, the man rugby league media flocks to most. Even when he won’t talk. Shots of him playing golf in the rain and his Instagram account - endorsing South Sydney’s social media campaign to ditch Accor Stadium for Allianz - have counted as Latrell news this week from NSW Origin camp. Along with updates that Latrell still ain’t talking. And conjecture about whether he should be. It hasn’t always been this way. More just Mitchell’s latest wrestle in his complicated relationship with the fourth estate, not to mention his place in the rugby league ecosystem.\n\nAdvertisement\n\nLatrell Mitchell: the man everyone wants a piece of. Credit: Michael Howard Now in his tenth season of first-grade, Mitchell has occupied rare air for years as far as newsworthiness goes. No-one in rugby league compares. For what he does on the field that no-one else can. And what he says off the field that no-one else will. Since the internet came into being, only Jarryd Hayne has broken it like Mitchell in this game. Though you suspect Andrew Johns would have rivalled them if his career - mercifully for the Eighth Immortal - hadn’t just missed the rise of social media. Loading Brisbane’s enigmatic Reece Walsh might still match Mitchell some day, though more headlines are the last thing he or the Broncos need. Nick Kyrgios is probably the only Australian athlete who trumps South Sydney’s superstar in turning the heads of Sydney-based editors and TV producers chasing clicks, comments and views.\n\nAdvertisement\n\nMitchell’s lasting impact on his Indigenous people will always, rightly, leave all that in the shade. I still recall standing in the SCG sheds in 2019, when he was just 22 and still a Rooster, as he addressed the torrent of racial abuse he was receiving on social media for the first time. I asked Mitchell if he truly grasped the pile-on coming his way. “I don’t care. Everything that is said about Aboriginal people really affects me,” was his simple, lasting reply. On Indigenous issues and representation, no voice has rung louder or longer than Mitchell’s in Australian sport since. Latrell Mitchell before an Indigenous All Stars game. Credit: NRL Photos For a while afterwards, Mitchell revelled in the lighter side of breaking the world wide web too. When the Rabbitohs flew him to Philadelphia to work with reconditioning guru Bill Knowles in 2022, Mitchell returned with his hamstrings in order and a new outlook on his rugby league life. “I’ve been having fun, that’s always been me, I’ve just been perceived as someone else,” Mitchell told colleague Christian Nicolussi during a mid-season South Sydney media day, conducting no less than a dozen interviews in the Redfern Oval stands.\n\nAdvertisement\n\n“I’ve done it all my life, I’ve talked a big game but always backed it up. “I think a lot more players need to be outspoken and confident in themselves, and understand the power you have in this game… In the US they are funny, and I took a lot out of the way they talk. “They know the power they have. We need to start understanding that.” Good times for all. Because Mitchell did back himself up with big game after big game in a career-best run. And delivered a slew of headline-worthy quotes to boot. He declared “that NSW jersey is mine” after terrorising incumbent Blues centre Matt Burton one Friday night, laughed off accusations of lying down to draw a penalty with “call me Trell Milk” and “used [the media] to my advantage and the Roosters took the bait” when tensions were at their highest against his former club and Mitchell was being booed relentlessly. Box office: Latrell Mitchell roars to the crowd after nailing a sideline conversion against the Roosters in 2022. Credit: Getty Two years on, Mitchell understands the power he also wields in not speaking.\n\nAdvertisement\n\nAfter the most tumultuous period of his career, when he briefly considered walking away from the game and Souths pondered similarly uncomfortable questions about his future at the club, Mitchell needed Wayne Bennett like never before. Forget the side-mouth, single word answers and cranky old Wayne routine. The 75-year-old uses the media to his advantage better than anyone. Bennett’s return to the Rabbitohs coincided with Mitchell needing to put his head down. Needing to repay the club for a hellish campaign that ended with a foot injury, one-game ban and $40,000 in NRL and South Sydney fines (with a further $80,000 fine suspended) for the photos of him standing over a white substance in a Dubbo hotel room. The Mitchell narrative of last year - which also included his involvement in the Spencer Leniu-Ezra Mam racism saga, an expletive-laden Triple M interview and suspension for belting Shaun Johnson - was wilder than ever as it grew untenable. Wayne Bennett returned to South Sydney when Latrell Mitchell needed him most. Credit: Getty Nine months of no comment is Mitchell, with South Sydney’s backing, taking charge of the narrative and letting “his footy do the talking” - one of his favourite refrains over the years. Nine months of no comment also leaves that potentially career-defining drama in Dubbo hanging in the air though. It remains the reference point for any reporter worth their salt because Mitchell has never addressed it himself.\n\nAdvertisement",
    "source": "SMH",
    "cluster_id": 25
  },
  {
    "url": "https://www.smh.com.au/sport/do-not-get-involved-arbib-s-warning-to-australian-olympians-about-enhanced-games-20250523-p5m1mq.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "‘Do not get involved’: Arbib’s warning to Australian Olympians about Enhanced Games",
    "publish_date": "Fri, 23 May 2025 11:40:00 +1000",
    "category": "sports",
    "authors": [
      "Vince Rugari"
    ],
    "text": "Australian Olympic Committee chief Mark Arbib has warned any Australian athletes who are considering a tilt at the Enhanced Games next year to think again, saying their involvement would not be supported or sanctioned.\n\nArbib has taken a dim view of plans for the Enhanced Games to be launched next year in Las Vegas, including events in swimming, athletics, and weightlifting and with a format that will pit clean athletes against those who have taken performance-enhancing drugs under supervision for the same lucrative prize money.\n\n“It’s a dangerous and risky venture,” Arbib said on Friday.\n\n“People need to remember drugs in sport are banned primarily for health reasons. We care about the welfare of the athletes. We care about the welfare of the community. Taking drugs can negatively impact your health, but it can also lead to death.",
    "source": "SMH",
    "cluster_id": 26
  },
  {
    "url": "https://www.smh.com.au/world/footage-captures-sound-of-titan-sub-imploding-20250523-p5m1oe.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Footage captures sound of Titan sub imploding",
    "publish_date": "Fri, 23 May 2025 11:36:51 +1000",
    "category": "finance",
    "authors": [],
    "text": "Footage captures sound of Titan sub imploding\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 27
  },
  {
    "url": "https://www.smh.com.au/national/when-the-party-machine-wouldn-t-listen-sussan-ley-paid-attention-to-me-20250522-p5m1ac.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "When the party machine wouldn’t listen, Sussan Ley paid attention, to me",
    "publish_date": "Fri, 23 May 2025 11:30:00 +1000",
    "category": "finance",
    "authors": [
      "Lucy Wicks"
    ],
    "text": "Sussan Ley was the last person I spoke to in alarm about the Liberal Party’s disastrous policy that proposed to restrict public servants working from home. At the time, she was shadow minister for women.\n\nAs the Liberal candidate for Robertson, the longest-running bellwether electorate in Australia, I felt the impact immediately. It was beyond bad. People who were once interested in Liberal plans and policies no longer cared. “Yeah – nah” they said, and that was that.\n\nLiberal leader Sussan Ley was the only one who listened. Credit: AAP\n\nThe mere suggestion that the Liberals might not uphold values of individual freedom by telling people what to do in their homes and workplaces went down like a lead balloon in Robertson. Not surprising, given we are a Central Coast commuter belt where people can spend four hours a day commuting to work.\n\nI spoke up loudly against the policy from the day it was announced, to every relevant shadow minister and the opposition leader too. Every person I spoke to justified the policy.",
    "source": "SMH",
    "cluster_id": 28
  },
  {
    "url": "https://www.smh.com.au/culture/tv-and-radio/mark-ruffalo-returns-to-screens-in-official-trailer-for-hal-and-harper-20250523-p5m1o2.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Mark Ruffalo returns to screens in official trailer for Hal & Harper",
    "publish_date": "Fri, 23 May 2025 11:28:08 +1000",
    "category": "finance",
    "authors": [],
    "text": "Mark Ruffalo returns to screens in official trailer for Hal & Harper\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 29
  },
  {
    "url": "https://www.smh.com.au/politics/federal/the-coalition-break-up-isn-t-a-divorce-they-re-just-sleeping-in-different-bedrooms-20250522-p5m1hd.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "The Coalition break-up isn’t a divorce. They’re just sleeping in different bedrooms",
    "publish_date": "Fri, 23 May 2025 11:25:00 +1000",
    "category": "finance",
    "authors": [
      "Kate Halfpenny"
    ],
    "text": "Before I married my first husband, we broke up twice. Once at 18, a few months after meeting on the Surfers Paradise beach during HSC. I was bemused.\n\nSecond time, we were 23 and living in a St Kilda flat when he pulled the pin. I was strategic. Quit my job, moved to London, replied to his Air Mail letters when it suited. Came home six months later to a marriage proposal.\n\nThe final split at 46, I was inconsolable. But accepting. When our wise, supportive couples’ counsellor Sarah said after a lot of work, “this marriage is over”, I trusted her external confirmation of what was being thought inside the relationship.\n\nThere are always separations before a divorce, and there are rules to ensure unnecessary damage isn’t done. Credit:\n\nSo among the pieces of wisdom our kids have been subjected to – always say “very well, thank you” when asked how you are because nobody cares anyway, look under the rug at house inspections, beef mince is your friend – one is a mainstay: Most breakups take three cracks at it before you really break up (or stay together).",
    "source": "SMH",
    "cluster_id": 30
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/midday-news-bulletin-23-may-2025/0c4da3z2v",
    "title": "Midday News Bulletin 23 May 2025",
    "publish_date": "Fri, 23 May 2025 02:00:00 +0000",
    "category": "finance",
    "authors": [],
    "text": "Key Points A fourth death in northern New South Wales floods\n\nAustralia consults the US over Harvard deportations\n\nChallenges ahead for top seeds at the French Open\n\nListen to Australian and world news, and follow trending topics with SBS News Podcasts .\n\n\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\n\n\nA man in his 70s has been found dead in a submerged car near Coffs Harbour, bringing the flood death toll in New South Wales to four, with several people missing.\n\n\n\n\n\nHis vehicle was spotted by a passing motorist about 30 kilometres northwest of the town this morning.\n\n\n\n\n\nAuthorities have yet to confirm his identity.\n\n\n\n\n\nSince Thursday, severe flooding has triggered 1,535 calls for help and 177 rescues, according to the SES Deputy Commissioner, Damien Johnson, who gave this update this morning.\n\n\n\n\n\n\"Sadly, there's a number of people that have lost their lives as a result of this severe weather event, and our condolences go out to friends and family of those that have lost their lives. There are a number that are still missing as well, and that search continues. And our thoughts are for those communities out there that have been affected by this major and significant weather event. It's going to take some time. As we know, Australians and New South Wales people are resilient, we will get through this, and we will be there to support you.\"\n\n\n\n\n\nPrime Minister Anthony Albanese is travelling to flood-affected areas today.\n\n\n\n---\n\n\n\n\n\nLiberal MPs have expressed broad support for reuniting with the Nationals, though concerns linger over the latter’s policy demands.\n\n\n\n\n\nBoth parties have delayed announcing their shadow cabinet line-ups as talks continue.\n\n\n\n\n\nDuring a virtual party room meeting last night, Liberal leader Sussan Ley said there was strong backing to remain in coalition, but not at any cost.\n\n\n\n\n\nThe Nationals are pushing for commitments to nuclear energy, divestiture laws, a regional investment fund, and improved phone coverage.\n\n\n\n\n\nOne Liberal source says that none of the proposals were deal breakers, but M-Ps remain cautious about unclear costings and the risk of signing what they call, a blank cheque.\n\n\n\n---\n\n\n\n\n\nIsrael has allowed limited aid into Gaza for the first time in weeks, but shortages remain severe.\n\n\n\n\n\nPalestinian officials say just 100 trucks carrying food and medical supplies entered on Wednesday local time, far below what's needed.\n\n\n\n\n\nSome southern bakeries have reopened using U-N-supplied flour, but many trucks remain stuck at the border.\n\n\n\n\n\nThe Palestinian Red Crescent fears crowds may loot incoming aid.\n\n\n\n\n\nIsraeli Prime Minister Netanyahu says a new distribution zone will soon allow U-S companies to deliver food safely in military-controlled areas.\n\n\n\n\n\n\"Ultimately, we intend to have large safe zones in the south of Gaza. The Palestinian population will move there for their own safety, while we conduct combat in other zones, and receive humanitarian aid there without Hamas interference. In the meantime, we authorised letting trucks enter Gaza to provide for immediate needs. Yesterday, I think 100, more than 100 trucks went in. More will come in today.\"\n\n\n\n\n\nIsrael imposed the blockade in March, accusing Hamas of diverting aid, claims Hamas denies.\n\n\n\n\n\nThe UN says a quarter of Gaza’s population faces famine.\n\n\n\n\n\nAccording to health officials, at least 29 people, including children, have died from starvation in recent days.\n\n\n\n---\n\n\n\n\n\nOfficials are working to understand how the ban on international student enrolments at Harvard University will impact Australians studying there.\n\n\n\n\n\nThe Trump administration revoked the university's ability to enrol international students and is forcing existing students to transfer to other schools or lose their legal status.\n\n\n\n\n\nAustralian Ambassador to the United States Kevin Rudd posted on X [[former Twitter]] that the Embassy is working to obtain further details from the U-S government.\n\n\n\n\n\n\"We are monitoring closely developments at Harvard University in relation to the administration’s statement this afternoon on the future enrolment of international students. I know this will be distressing for Harvard’s many Australian students. The Embassy is working with the United States Government to obtain the details of this decision so that Australian students can receive appropriate advice.\"\n\n\n\n\n\nMr Rudd adds that he intends to engage with the U-S administration on the impact this decision will have on Australian students and their families both at Harvard and at other campuses across the United States.\n\n\n\n---\n\n\n\n\n\nAccording to a University of Queensland study, Australians are swearing less online than expected, ranking below the U-S and UK in global profanity use.\n\n\n\n\n\nResearchers analysed over 1.7 billion words from online content across 20 English-speaking countries, tracking 597 vulgar words using computational linguistics.\n\n\n\n\n\nDespite Australia’s reputation for colourful language, lead researcher Martin Schweinberger suggests Aussies may reserve swearing for in-person conversations.\n\n\n\n\n\nHe notes many might find the findings surprising, as profanity and slang are often embraced as part of Australian culture, even in tourism slogans like “so where the bloody hell are you?” asked by model Lara Bingle.\n\n\n\n---\n\n\n\nTo tennis, and Alex de Minaur faces a challenging first week at the French Open, with a potential quarter-final clash against rival Jannik Sinner looming, if he can get that far.\n\n\n\n\n\nThe draw has offered little relief for Australia’s 15-strong contingent.\n\n\n\n\n\nIn the women’s bracket, Maya Joint and Ajla Tomljanovic will meet in a first-round clash dubbed a 'battle of the generations'.\n\n\n\n\n\nIt comes just days after the two face off in the Morocco Open semi-final on Friday, Joint's first W-T-A semi-final and Tomljanovic’s 10th French Open campaign.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 31
  },
  {
    "url": "https://www.sbs.com.au/news/article/drop-in-the-ocean-first-supply-of-aid-in-months-reaches-gaza-as-israel-orders-evacuations/dg67loglc",
    "title": "'Drop in the ocean': First supply of aid in months reaches Gaza as Israel orders evacuations",
    "publish_date": "Thu, 22 May 2025 11:55:48 +0000",
    "category": "finance",
    "authors": [],
    "text": "Flour and other food aid will start reaching some of Gaza's most vulnerable people after Israel let some humanitarian aid trucks through, but nowhere near enough to make up for shortages caused by an 11-week blockade, Palestinian officials said.\n\n\n\n\n\nIsrael said it allowed 100 trucks also carrying baby food and medical equipment into the enclave on Wednesday, two days after announcing its first relaxation of the restrictions under mounting international pressure.\n\n\n\n\n\nIsrael imposed the blockade on all supplies in March, saying Hamas was seizing deliveries for its fighters — a charge the group denies\n\n\n\n\n\nThe United Nations said a quarter of Gaza's 2.3 million people were at risk of famine.\n\n\n\nTrucks carrying aid have begun entering Gaza through the Kerem Shalom crossing. Source: Getty / Amir Levy \"Some bakeries will begin receiving flour to produce bread, and we expect the distribution of bread to begin later today,\" Amjad al-Shawa, director of the Palestinian Non-Governmental Organizations Network in Gaza, told the Reuters news agency.\n\n\n\n\n\nHe said just 90 trucks had entered.\n\n\n\n\n\n\"During the ceasefire, 600 trucks used to enter every day, which means that the current quantity is a drop in the ocean, nothing,\" he said.\n\n\n\nWorkers produce bread for distribution at the World Food Programme bakery after a limited amount of flour entered the Gaza Strip. Source: Getty / Anadolu Bakeries backed by the UN's World Food Programme would produce the bread and the agency's staff would hand it out — a more controlled system than previously when bakers sold it directly to the public at a low cost, he added.\n\n\n\n\n\n\"The idea is to try and reach the most needy families, those who are desperate, as it is just the start,\" Shawa said.\n\n\n\n\n\nPalestinian health minister Majed Abu Ramadan said on Thursday that 29 children had died from \"starvation-related deaths\" in Gaza in recent days and that many more were at risk.\n\n\n\n\n\nPalestinians have been scrambling for basic supplies, with Israel's blockade leading to critical food and medicine shortages.\n\n\n\nUmm Talal al-Masri, 53, a displaced Palestinian in Gaza City, described the situation as \"unbearable\".\n\n\n\n\n\n\"No one is distributing anything to us. Everyone is waiting for aid, but we haven't received anything,\" she said.\n\n\n\n\n\n\"We barely manage to prepare one meal a day.\"\n\n\n\n\n\nUN agencies have said that the amount of aid entering Gaza falls far short of what is required to ease the crisis.\n\n\n\nREAD MORE Global criticism of Israel mounts as its Gaza campaign continues\n\n\"I am tormented for my children,\" Hossam Abu Aida, another resident of the Gaza Strip, told AFP.\n\n\n\n\n\n\"For them, I fear hunger and disease more than I do Israeli bombardment,\" the 38-year-old added.\n\n\n\nIsrael orders evacuation of parts of northern Gaza\n\nThe Israeli army issued an evacuation warning on Thursday for 14 neighbourhoods of northern Gaza, as it pressed a renewed offensive that has drawn international condemnation.\n\n\n\n\n\nIn an Arabic-language statement on Thursday, the military said it was \"operating with intense force\" in 14 areas in the northern Gaza Strip, accusing \"terrorist organisations\" of operating there.\n\n\n\nIsraeli strikes have continued along the Gaza Strip. Source: AAP / Mohammed Saber/EPA Israeli military strikes on Gaza killed at least 52 Palestinians across the enclave on Thursday, Gaza's civil defence agency said.\n\n\n\n\n\nThere was no immediate comment from the Israeli military on the reports.\n\n\n\n\n\nIt has repeatedly said it seeks to avoid civilian casualties and targets militants.\n\n\n\n\n\nIn Beit Lahiya on the northern edge of the enclave, a tank shell hit a medicine warehouse inside Al-Awda Hospital and set it ablaze, the health ministry said.\n\n\n\nRescue workers had been trying to extinguish the fires for hours, it added.\n\n\n\n\n\nTanks are stationed outside the hospital, medics say, effectively blocking access to the facility.\n\n\n\n\n\nThe Gaza healthcare system has been barely functioning, with most of the medical facilities out of order, because of repeated Israeli military strikes, raids and the ban on the entry of medical supplies.\n\n\n\n\n\nPrime Minister Benjamin Netanyahu said on Wednesday that Israel would be open to a temporary ceasefire to enable the return of hostages taken by Hamas-led fighters.\n\n\n\n\n\nBut if they were not returned, he said it would press ahead with a military campaign to gain total control of Gaza.\n\n\n\nREAD MORE Pope Leo calls on Israel to allow humanitarian aid into Gaza\n\n\"Netanyahu continues to stall and insist on pursuing the war. There is no value to any agreement that doesn't stop the massacres in Gaza permanently,\" senior Hamas official Sami Ab Zuhri said in response to Netanyahu's comments.\n\n\n\n\n\nIsrael launched its campaign in Gaza in response to the Hamas attack in October 2023, in which some 1,200 people were killed and more than 250 taken hostage, according to Israeli tallies.\n\n\n\n\n\nIsrael's campaign has since killed more than 53,600 Palestinians, according to Gaza health authorities, and devastated the coastal strip, where aid groups say signs of severe malnutrition are widespread.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 32
  },
  {
    "url": "https://www.sbs.com.au/news/video/discrimination-concerns-grow-as-ai-increasingly-used-in-job-recruitments/605kdiuhv",
    "title": "Discrimination concerns grow as AI increasingly used in job recruitments",
    "publish_date": "Thu, 22 May 2025 10:26:15 +0000",
    "category": "finance",
    "authors": [],
    "text": "Discrimination concerns grow as AI increasingly used in job recruitments\n\nPublished 22 May 2025, 9:16 am\n\nThe use of AI in recruitment is on the rise with almost two-thirds of Australian organisations believed to be using the technology in their job hiring processes. But there are growing concerns over the risks of discrimination.",
    "source": "SBS",
    "cluster_id": 33
  },
  {
    "url": "https://www.sbs.com.au/news/video/prescription-drug-to-slow-alzheimers-disease-approved-in-australia/jsgv8lcy0",
    "title": "Prescription drug to slow Alzheimer’s disease approved in Australia",
    "publish_date": "Thu, 22 May 2025 10:20:53 +0000",
    "category": "lifestyle",
    "authors": [],
    "text": "Prescription drug to slow Alzheimer’s disease approved in Australia\n\nPublished 22 May 2025, 9:15 am\n\nA groundbreaking treatment to slow the progression of Alzheimer's Disease has been cleared for prescription in Australia. The Therapeutic Goods Administration has approved the medication for some people with early disease symptoms. It's the first new treatment of its kind in 25 years.",
    "source": "SBS",
    "cluster_id": 34
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/new-drug-to-treat-early-alzheimers-adds-to-hopes-for-better-treatment/jno1gk3et",
    "title": "New drug to treat early Alzheimer's adds to hopes for better treatment",
    "publish_date": "Thu, 22 May 2025 08:57:58 +0000",
    "category": "lifestyle",
    "authors": [],
    "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nAustralia's Therapeutic Drug Administration has approved a new drug that could offer hope to those with Alzheimer's.\n\n\n\n\n\nAlzheimer's disease is the most common form of dementia and affects around 600,000 Australians.\n\n\n\n\n\nResearchers say the new medication represents a significant step on the path to better treatments.\n\n\n\n\n\n\"So I think we're seeing with Alzheimer's what we saw with cancer research about 50 years ago; we no longer have drugs just for the symptoms, we have drugs that now target the underlying disease process in Alzheimer's disease.\"\n\n\n\n\n\nAssociate Professor Michael Woodward is the Director of Aged Care Research and Memory Clinic at Austin Health.\n\n\n\n\n\nHe says the drug, Donanemab, works to remove the build-up of the protein called amyloid plaque, which is linked to memory loss and impaired thinking.\n\n\n\n\n\nWhile this can slow the progression of Alzheimer's, Professor Woodward says the drug is no panacea.\n\n\n\n\n\n\"The drug is only effective, however, for people with mild Alzheimer's disease. That includes mild cognitive impairment and early dementia due to Alzheimer's disease. It's not suitable for people who are considerably affected by their Alzheimer's disease, people who need day to day care, people who can't look after their bathing, their dressing, or what have you. [With] that degree of severity, unfortunately, this drug will not be effective. It's only effective in people with the early symptoms such as significant memory loss and maybe a little loss of day to day independence.\"\n\n\n\n\n\n67 year old Joel Fulton was diagnosed with Alzheimer's three years ago.\n\n\n\n\n\nHis wife Diane says the drug offers hope.\n\n\n\n\n\n\"If this drug could do what it says and give us quality time, that would be just everything. It really would.\"\n\n\n\n\n\n77 year old Frank Freschi is being treated with a similar drug that targets the amyloid plaque.\n\n\n\n\n\nHe's part of a clinical trial that started three years ago.\n\n\n\n\n\n\"My view is if I can help and I can get some benefit perhaps at the end, even if it's only a year of slowing down that decline, that's worth doing.\"\n\n\n\n\n\nDonanemab can have some major side effects including brain swelling and bleeding.\n\n\n\n\n\nExperts say symptomatic side effects are fairly rare though.\n\n\n\n\n\nProfessor Christopher Rowe is the Director of the Australian Dementia Network.\n\n\n\n\n\n\"They occur in about two per cent of patients getting this drug, but that is because they're watched very carefully, with MRI scans - you have to have about five in the first six months - and if you see early signs of the development of swelling in the brain or a little bit of bleeding in the brain, you need to stop the drug for a while.\"\n\n\n\n\n\nDonanemab isn't cheap either.\n\n\n\n\n\nIt's not currently listed on the Pharmaceutical Benefits Scheme, and costs around $4,700 a month, with treatment lasting 12 to 18 months.\n\n\n\n\n\nThere is a possibility that could change after a review process in July, but Professor Rowe says listing the drug could lead to a large jump in demand.\n\n\n\n\n\n\"This is going to be a bit of a shock for the health system. There's already fairly long waiting times to see a memory specialist, and we expect this to really lead to a surge in demand for those services that are already overstretched.\"\n\n\n\n",
    "source": "SBS",
    "cluster_id": 35
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/bitcoin-hits-a-record-high-despite-us-debt-concerns-hitting-sharemarkets/e3taspg3z",
    "title": "Bitcoin hits a record high despite US debt concerns hitting sharemarkets",
    "publish_date": "Thu, 22 May 2025 07:58:19 +0000",
    "category": "finance",
    "authors": [],
    "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
    "source": "SBS",
    "cluster_id": 36
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/federal-coalition-split-may-be-shortlived-evening-news-bulletin-22-may-2025/kulsv37a0",
    "title": "Federal coalition split may be shortlived | Evening News Bulletin 22 May 2025",
    "publish_date": "Thu, 22 May 2025 06:00:27 +0000",
    "category": "finance",
    "authors": [],
    "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nThe Liberal and National parties have taken the first steps towards reforming the coalition after a shock split.\n\n\n\n\n\nThe opposition frontbench was expected to be announced by the Liberal Party this week, with the Nationals convening in Canberra today [[22/05]] to assign their own portfolio spokespeople.\n\n\n\n\n\nBut the Liberal Party has delayed an announcement, and the Nationals are indicating they're hopeful a coalition agreement will be reached before Parliament returns.\n\n\n\n\n\nNationals leader David Littleproud says the pause is a sign of good faith to allow Liberal leader Sussan Ley [[lee]] to work with her senior team.\n\n\n\n\n\n\"She made an offer to reconvene her party room to discuss the four policy areas that the National Party demand as part of a coalition agreement. And I thank her for that. And as a consequence, I have decided to send those spokespeople home as a sign of good faith, and Sussan, as a sign of good faith, will not be announcing Shadow Cabinet.\"\n\n\n\n\n\nThe four policy areas are: a 20 billion-dollar regional investment fund; divestiture powers over large supermarkets engaging in anti-competitive behaviour; a recommitment to nuclear energy; and an expansion of telecommunications universal service obligations for regional Australia.\n\n\n\n\n\n+++\n\n\n\n\n\nAnthony Albanese has announced that M-Ps and Senators will return to Canberra for the 48th Parliament on July the 22nd.\n\n\n\n\n\nMore than two weeks after their resounding election victory, Labor will return to parliament with at least 93 seats in the House of Representatives, up from 78 in its first term.\n\n\n\n\n\nLabor could have as many as 94 seats, depending on the outcome in the Melbourne-based seat of Calwell, which is yet to be finalised.\n\n\n\n\n\nThe Australian Electoral Commission says Calwell has been the most complicated count in its history.\n\n\n\n\n\n+++\n\n\n\n\n\nTwo men have died and others are missing as as intense rainfall and flooding continues over a large section of New South Wales.\n\n\n\n\n\nAt least three people are missing and tens of thousands of people remain isolated along the state's mid-north coast.\n\n\n\n\n\nThe flooding has been caused by a low pressure system over the region that has dumped months of rain in just a few days.\n\n\n\n\n\nEvacuation orders have been issued to 34 areas and more than 48,000 people remain isolated.\n\n\n\n\n\nNew South Wales S-E-S Commissioner Mike Wassing is urging people to heed the warnings.\n\n\n\n\n\n\"These are very high risk operations. I will not compromise the safety of my people, or any other emergency services people. These are highly trained people, they are working very closely with the community. What the community can do to help us is to heed those warnings, relocate early and evacuate if it is safe to do so.\"\n\n\n\n\n\n+++\n\n\n\n\n\nA mother and her two children have suffered critical burns after a gas cylinder explosion caused a fire at their home in Melbourne's south-east.\n\n\n\n\n\nThe fire is being treated as suspicious.\n\n\n\n\n\nAbout 30 firefighters arrived at the townhouse in Chadstone last night [[21/05]] to find flames burning through the roof of the two-story home.\n\n\n\n\n\nA 37-year-old woman and two primary school aged children were found unconscious inside; they're all in a critical condition in hospital.\n\n\n\n\n\nA neighbour says smoke billowed kilometres up into the air.\n\n\n\n\n\n+++\n\n\n\n\n\nTwo Israeli embassy staff have been shot and killed while attending an event at the Capital Jewish Museum in Washington D-C.\n\n\n\n\n\nThe mayor of D-C, Muriel Bowser, says there is no active threat.\n\n\n\n\n\nFollowing his arrest, police say the suspect yelled 'Free Palestine'.\n\n\n\n\n\nChief Pamela Smith from the D-C Police Department says the suspect has been apprehended and has indicated that he is responsible.\n\n\n\n\n\n\"We believe the shooting was committed by a single suspect, who is now in custody. Prior to the shooting, the suspect was observed pacing back and forth outside of the museum. He approached a group of four people, produced a handgun and opened fire, striking both of our decedents.\"\n\n\n\n\n\n+++\n\n\n\n\n\nThe United Nations reports around 90 trucks carrying aid have been dispatched into Gaza, but says they are just a drop in the ocean compared to how much aid is needed.\n\n\n\n\n\nIt remains unclear how much, if any, of the aid being allowed into Gaza is reaching civilians, with the U-N and other humanitarian workers saying even once inside the enclave, Israeli officials are restricting their movements and activity.\n\n\n\n\n\nThe U-N Office for the Corrdination of Humanitarian Affairs, says around 500 trucks need to enter Gaza daily in order to provide adequate food and supplies to the population.\n\n\n\n\n\nWorld Food Programme Director for the occupied Palestinian territories, Antoine Renard, says access must be granted to all aid convoys.\n\n\n\n\n\n“As we speak, there have been only 78 trucks that have been managed by the United Nations to enter into Gaza. All the different goods so far are just in Keren Shalom on the Gaza side. We have not been able to pick them up because we are still facing challenges related to the routing to access Gaza.\"\n\n\n\n\n\n+++\n\n\n\n\n\nThe New Zealand government has brought down a budget with a deficit of 14.7 billion dollars- despite making more than five billion dollars in savings.\n\n\n\n\n\nThere's no easy path back to surplus, either, with the forward estimates forecasting deficits in each of the next four years.\n\n\n\n\n\nFinance Minister Nicola Willis is emphasising growth in this budget, with the centrepiece being a business tax break worth more than 1.5 billion dollars.\n\n\n\n\n\nThe opposition Labour party has attacked the savings made, saying they are disproportionately coming from female-dominated industries.\n\n\n\n\n\n+++\n\n\n\n\n\nAnge Postecoglou says Tottenham's victory in the Europa League final can be a springboard for his future at the club.\n\n\n\n\n\nThe 59-year-old Australian coach has made history, guiding Tottenham to the Europa League title, and thus a spot in the Champions League next season, with a one goal to nil over Manchester United in the Spanish city of Bilbao.\n\n\n\n\n\nIt's Tottenham's first major title in 17 years, and first title in Europe in 41 years.\n\n\n\n\n\nPostecoglou has admitted he's prioritised the Europa League since the end of January.\n\n\n\n\n\nHe admits that's had a deleterious effort on his team in the English Premier League, where they are coming 17th.\n\n\n\n\n\nTottenham's fall in the Premier League has put extreme pressure on Postecoglou's job, but he says this victory proves his critics don't understand what he's doing.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 37
  },
  {
    "url": "https://www.theage.com.au/national/australia-news-live-anthony-albanese-announces-nsw-flood-disaster-relief-former-pm-turnbull-lashes-coalition-split-trump-blocks-harvard-from-enrolling-international-students-20250523-p5m1ks.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Australia news LIVE: Anthony Albanese announces NSW flood disaster relief; Former PM Turnbull lashes Coalition split; Trump blocks Harvard from enrolling international students",
    "publish_date": "Fri, 23 May 2025 12:00:22 +1000",
    "category": "finance",
    "authors": [
      "Cindy Yin"
    ],
    "text": "The Australian sharemarket has advanced after a choppy session on Wall Street caused by worries coming out of the bond market about the US government’s debt.\n\nThe ASX 200 rose 26.6 points, or 0.3 per cent, to 8366.8 by 11am AEST on Friday, with five of 11 industry sectors in the green.\n\nMining giant Rio Tinto was 1.5 per cent lower in early trade after it announced on Thursday night it had started a global search to replace chief executive Jakob Stausholm, who will step down from his position after spending almost five years at the top.\n\nLoading\n\nBHP was 0.4 per cent lower and Fortescue shed 1.6 per cent in early trade.\n\nThe big four banks are in positive territory. NAB added 0.6 per cent, Westpac gained 0.5 per cent while CBA and ANZ both edged up 0.1 per cent.\n\nEnergy stocks are the best-performing sector with Woodside and Santos adding 0.5 per cent in early trade.\n\nWall Street trading remained choppy throughout most of the day following Wednesday’s big slump for the S&P 500. That loss has put the benchmark index on track for its worst week in the past seven.\n\nThe S&P 500 slipped 2.60 points, or less than 0.1 per cent, to close at 5842.01. The Dow Jones fell 1.35 points, or less than 0.1 per cent, to 41,859.09. The Nasdaq composite rose 53.09 points, or 0.3 per cent to 18,925.73.\n\nRead more on the markets here.",
    "source": "TheAge",
    "cluster_id": 21
  },
  {
    "url": "https://www.theage.com.au/business/consumer-affairs/trump-turbulence-and-travel-are-us-skies-still-safe-20250521-p5m137.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Trump, turbulence and travel: Are US skies still safe?",
    "publish_date": "Fri, 23 May 2025 11:55:00 +1000",
    "category": "finance",
    "authors": [
      "Chris Zappone"
    ],
    "text": "Save Log in , register or subscribe to save articles for later. Save articles for later Add articles to your saved list and come back to them any time. Got it Normal text size Larger text size Very large text size Anyone considering a trip to the US is confronted with a question: Is it safe to go? Headlines from the second administration of President Donald Trump convey scenes of disruption, confusion, corruption and shattered norms. Is it possible to enjoy a vacation in a country like this? There are 27,500 commercial flights travelling in US skies a day. Credit: Bloomberg You can imagine two circles of a Venn diagram: One represents the Trump-spurred disruption and sense of perma-crisis he brings. A second one represents basic aviation safety and having a good time. Surely, the two circles can’t stay separate forever. If and when they overlap, will they overlap on your holiday to the US? The US suffered its most deadly air crash in years in January when an American Airlines Flight collided with a US Army Black Hawk helicopter near Ronald Reagan Washington National Airport in Virginia, killing 67 people. A preliminary investigation raised questions about congestion in the area and the air traffic control staffing. A perhaps more pressing example in the era of Trump: air traffic controllers at Newark Liberty airport near New York lost radar vision and radio contact with flights on April 28. Some controllers were so upset afterwards that they took trauma leave. After the scare, the chief executive of United, which uses Newark as a hub, cut back flights for safety. One contributing factor is that Newark is a temporarily closed runway, set to reopen in June.\n\nAdvertisement\n\nLoading But to give a sense of the challenge for the US more broadly, consider that there are 3800 commercial flights a day in Australia. In the US, that number is closer to 27,500, with air traffic controllers monitoring and directing 5000 flights simultaneously in peak periods. The Federal Aviation Administration has been trying to upgrade its network of staff and equipment for decades, while attracting more air traffic controllers. There are now 14,000 air traffic controllers in the US, nearly 2000 of them hired last year. However, that still leaves a shortfall of 3000. Trump has largely inherited this problem, though he previously had four years as president to address it. However, it’s far from clear that Trump is inclined or capable of improving the situation for US air traffic control. Immediately after the January crash near Washington, Trump blamed “diversity, equity and inclusion” hires as contributing to the ability of air traffic controllers to function. In a statement at the time, Trump claimed that under former president Joe Biden the FAA “specifically recruited and hired individuals with ‘severe intellectual’ disabilities [and] psychiatric issues ...’” When Trump returned to office in January, he came with billionaire campaign funder Elon Musk in tow, pushing a radical government-slashing project called DOGE (the Department of Government Efficiency).\n\nAdvertisement\n\nFAA air traffic controllers are themselves exempt from DOGE cuts and are being recruited. But at more senior levels, the Washington Post reports, in keeping with the DOGE purges, there has been an exodus of people. American air traffic control is ripe for reform. As the Brookings Institute notes: “The consensus of countless commissions and expert reports is that air traffic management is a 24/7 high-tech service ‘business’ trapped in a regulatory agency that is constrained by federal budget and acquisition rules.” That is, the budget for its modernisation keeps getting eaten up by the cost of maintaining legacy systems. United chief executive Scott Kirby reassured reporters in New York on May 13: “At Newark, first and foremost, it is safe. It is absolutely safe when these issues happen. Our pilots are trained with back-up procedures to keep the airline safe, and so whether you lose communications or radar, we have back-up procedures.” Donald Trump is all about disruption and retribution. But what does that do for aviation safety? Credit: AP To his credit, Kirby has not shied away from the issue. Kirby has publicly highlighted the jam United and the US aviation sector has been put in by the FAA, and by Trump. In April, as the world watched and waited for the next shoe to drop in Trump’s tariff strategy, Kirby offered not one but two earnings estimates, depending on whether the US president’s moves triggered a recession or not.\n\nAdvertisement\n\nTrump, in his first 100 days in office, has imposed hiring freezes across government, stripped federal employees of job protections and fundamentally downsized the US government while centralising White House power. The head of the US Department of Transportation, Sean Duffy – an ex-congressman, prosecutor and former reality TV star, natch – has announced a plan expected to cost tens of billions of dollars to fix the US air traffic control system within four years. Trump supports the plan. But the devil is in the delivery. And to be sure, many air traffic controller bodies around the world are in the process of rebuilding staff. Airservices Australia, for example, is recruiting and training controllers. “We expect controller numbers to be back to surplus capacity by mid-year,” a company spokesman said. But in the US, the problem is longstanding and deep-seated. Now uncertainty abounds for Americans and visiting travellers alike. And it’s not just the fear of accidents. It’s also the waiting, the delays and the disruptions on the ground that mark so much travel in the US. As for Newark Liberty Airport, Kirby cut back flights in light of the safety scare and issued two messages exhorting regulators to take further actiondespite his insistence that it’s safe. Not everyone agrees.\n\nAdvertisement\n\nWilliam McGee, a senior fellow for aviation and travel at the American Economic Liberties Project, told NPR he just didn’t “see the seriousness and the sense of purpose from this administration” to address the FAA problems. The US has been grappling with air traffic control issues for years. Credit: AP Despite Kirby’s commentary on the FAA and US aviation, he is supportive of Trump’s aspirations to bring back well-paid jobs to the US, saying the goal is “laudable”. He notes that United is “one of the few companies left in the country that creates the kind of jobs where you can make a six-digit income, you can support a family, buy a house and [send] your kids to college, even if you only have a high school education”. Kirby says he is taking a wait-and-see approach to Trump on the economy and tariffs. Speaking the day after Trump announced a reduction in tariffs with China, Kirby said: “Everyone should kind of take a breath because we’re not at the end game yet. We’re not at the new normal yet”. Whatever the outcome, United is betting big on the future. After being the only American airline to fly to Australia through COVID lockdown, United is piling on more capacity for flights to Australia. Already, from November to March, United says it was the largest carrier between the US and Australia as measured by available seat miles. While the majority of those flights were Americans visiting Australia, Australians travelling to the US are well represented.\n\nAdvertisement",
    "source": "TheAge",
    "cluster_id": 22
  },
  {
    "url": "https://www.theage.com.au/environment/climate-change/the-rumours-were-true-china-s-greenhouse-gas-emissions-are-falling-20250522-p5m19y.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "The rumours were true: China’s greenhouse gas emissions are falling",
    "publish_date": "Fri, 23 May 2025 11:49:50 +1000",
    "category": "finance",
    "authors": [
      "Nick O'Malley"
    ],
    "text": "Crucially, it had done so as its energy demand increased. This is what makes the data so remarkable. Over recent years, the world – and China in particular – has deployed renewable energy technology far faster than expected. This was always good news. The problem has always been that demand for electricity kept growing faster than the supply of new renewables, so while there was more clean energy in global systems, emissions kept growing. Myllyvirta’s new analysis, first published in Carbon Brief earlier this month, shows that China has finally broken this terrible nexus: emissions in China are finally falling as its use of electricity grows.\n\n“Being able to cut emissions while power demand not just grew but grew above the historical average is certainly a historic milestone, showing the scale that clean energy additions have reached in China,” Myllyvirta told this masthead on Tuesday. And what happens in China affects us all. Loading “Needless to say, if the fall in emissions is sustained, that constitutes a major breakthrough for the global energy transition and the global climate effort, as China has been responsible for all of the net increase in CO2 emissions since the Paris climate conference, so an emission peak in China would highly likely enable global emissions to peak and decline,” Myllyvirta said. “Whether the falling trend in China’s emissions continues depends strongly on the clean energy targets in China’s upcoming Paris climate commitments and five-year plan; if the current rate of clean energy additions is continued, it is very likely that it will.”\n\nSo far, the indications for this are good, at least politically. Though China’s “all of the above” energy policy includes new coal plants as well as clean power, the clean is outweighing the dirty. Those new coal plants are not only displacing older ones, they are running under capacity. And China remains determined to achieve energy independence at pace – which means generating energy domestically to cut its dependence on imports of oil, gas and coal. Energy analyst Tim Buckley notes that China is acting in self-interest here. As it expands its regional hegemony, China is determined both to free itself of coal, oil and gas imported via potentially vulnerable shipping lanes, and to dominate the technologies of the future. It is also worth noting that the slight dip in emissions may be a signal of a plateau in emissions rather than an ongoing decline, Buckley says.\n\nLoading This means that even as the Trump administration goes about unpicking former president Joe Biden’s subsidies for green energy deployment to support the American shale oil industry, China is pushing harder on new clean tech. A speech made by Chinese President Xi Jinping last month also caught the attention of climate analysts and diplomats. China must accelerate the transition to clean energy, he said. “Clear waters and green mountains are just as valuable as gold and silver. Green transformation is not only the essential way to address climate change, but also a new engine for economic and social development.”\n\nStriking a determinedly different tone from the Trump administration, he added, “We must deepen international co-operation. Solidarity and co-operation are needed more than ever as the world faces multiple, compounded challenges. We should rise above estrangement and conflict with openness and inclusiveness.” But the key news in a colourful speech was buried in some of its most drab language. Xi said that in coming months China would announce a new emissions reduction target for 2035 that would cover “all economic sectors and all greenhouse gases”. This is significant because in the past China has committed to reducing greenhouse pollution only relating to electricity production. China will increase its climate ambition across its economy, even as it beats its own climate targets. This is a good sign for crucial global climate talks to be held in Brazil later this year, before which other nations, including Australia, are expected to announce strong new 2035 targets. “What’s already clear is that China’s recipe for peaking and reducing emissions is a combination of rapid electrification – not just in transportation but also in industry and buildings – with very large-scale additions of clean energy,” Myllyvirta says.",
    "source": "TheAge",
    "cluster_id": 23
  },
  {
    "url": "https://www.theage.com.au/goodfood/sydney-eating-out/killer-char-siu-and-spicy-soups-your-guide-to-eastwood-s-best-chinese-and-korean-food-20250522-p5m1gu.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Killer char siu and spicy soups: Your guide to Eastwood’s best Chinese and Korean food",
    "publish_date": "Fri, 23 May 2025 11:48:29 +1000",
    "category": "finance",
    "authors": [
      "David Matthews"
    ],
    "text": "Treat a visit to Rowe Street like a pub crawl, and discover a cult soup spot, an epic mart with a “sauce corner”, barbecue eateries, night markets, grocers and lots more.\n\nSave Log in , register or subscribe to save recipes for later. You have reached your maximum number of saved items. Remove items from your saved list to add more. Share\n\nEastwood’s food claim to fame, historically at least, is the Granny Smith apple. First discovered growing on Maria Ann “Granny” Smith’s property back in the 1860s, the apple is still celebrated with an annual festival. But since Eastwood’s commercial centre was pedestrianised in the 1990s, the suburb has had plenty more to offer in the culinary stakes. The catalyst has been a rapid shift in demographic: as of 2021, more than 48 per cent of residents claim Chinese ancestry, while nearly 9 per cent have roots in Korea. Rowe Street takes those figures off the page and renders them in full colour, with the Koreatown Project, backed by government funding, accelerating the transformation of the street’s east end from local hub to delicious destination, as vital for Korean cooking and culture as Strathfield or Lidcombe. Jimmy Park, the project’s manager, has witnessed the change first-hand. “When I came in 1988, there were only two Korean shops on Rowe Street,” he says. “Now, it’s more than 120.” Those range from hairdressers and boutiques, to the grocers and restaurants that give the street its distinctive flavour. Cross the station, and Korean turns to Chinese, with broad regional representation and plenty outside the lines. Justin Li, a Ryde councillor who recommends treating a visit to Rowe Street a little like a pub crawl, says it’s the demise of a fast-food giant that best represents Eastwood’s evolution. “An old Chinatown institution, Super Bowl, recently opened on Rowe Street West, ironically where Eastwood’s McDonald’s once stood. It says a lot about the changing demographics and tastes locally over the last few decades.” The choice of side is your own, but such is the scope that whichever you pick first, odds are it won’t be too long before you’re back for more. Hwagae Banchan’s specialty is the array of side dishes – banchan – that accompany a Korean meal. Jennifer Soo\n\nAdvertisement\n\nHwagae Banchan Shop Exit the station to the east, and you’ll find a clutch of stalls specialising in Korean street food, including tteokbokki, the spicy rice cakes, and flash-fried Korean-style hot dogs. Stop at Hwagae Banchan Shop, though, and the specialty is the array of side dishes – banchan – that accompany a Korean meal. Classics include cabbage or spring onion kimchi tinted red with gochugaru, Korean chilli powder, or braised lotus root. Stock up, then grab some kimbap, Korea’s answer to a sushi roll, to takeaway. 10 Railway Parade, Eastwood Rice cakes, or tteok, are the main draw at Siroo. Jennifer Soo Siroo Rice Cake Cafe Make for Rowe Street, perhaps drop into ginseng specialist Cheong Kwan Jang, then join the line at Siroo. With South Koreans now drinking 353 cups of coffee per head a year – more than double the global average – the nation’s cafe culture is ever-expanding. That partly explains Siroo’s popularity, but it’s the rice cakes, or tteok, that are the main draw. Made each morning by owner Changhyun Lee, Siroo’s tteok are characteristically chewy, with the injeolmi – made with sticky rice and finished with roasted soybean powder – a signature. Buy a pack, or try it in the cafe’s viral shaved-ice dessert, bingsu. 106 Rowe Street, Eastwood, sirooricecakecafe.com\n\nAdvertisement\n\nMiryang Gukbap soup shop channels South Korea’s south-east. Jennifer Soo Miryang Just a couple of doors up from celebrated Korean-Chinese restaurant Biwon (try the jajangmyeon) is Miryang, a freshly opened soup restaurant channelling South Korea’s south-east. The menu may be short, but the flavours are long and deep in everything from wagyu shank soup and gukbap with sundae – the Korean blood sausage – to the signature, light and aromatic Miryang-style pork soup loaded with spring onions. Season yours with salted shrimp and load up on fluffy rice – refills come free. 104 Rowe Street, Eastwood, instagram.com/miryang_eastwood The sauce section at Eastwood Mart. Jennifer Soo Eastwood Mart There’s no shortage of grocers on this side of Eastwood station: S-Mart is an all-rounder, while KMALL09 (also in Lidcombe) stands out for its epic size, heaving shelves and range of K-beauty products. But Eastwood Mart, smack-bang on Rowe Street, is a classic. Big enough to have the range, small enough to feel personal, it’s the place for bulk kimchi, noodles, seaweed and fresh vegetables. Don’t leave without taking a turn around the “sauce corner” or grabbing some mandu from the staff helming the hotplate out front.\n\nAdvertisement\n\n73 Rowe Street, Eastwood Getbawi specialises in hoe, or raw seafood. Jennifer Soo GetBawi Up the hill from K-bakery La Vigne and tucked into a shopping mall, newcomer GetBawi has quickly garnered a dedicated following. The reason? It’s one of the few Sydney restaurants specialising in hoe, or raw seafood, served here on platters with the likes of perilla leaves for wrapping. Other highlights include spicy blue swimmer crab hotpot and the textural masterpiece that is yukhoe tang tang, featuring high-grade raw beef strewn with umami-rich octopus. 201/62-80 Rowe Street, Eastwood, instagram.com/getbawi Split a bowl of gamjatang soup with friends at Guk’s Eedaero Gamjatang. James Brickwood Guk’s Eedaero Gamjatang\n\nAdvertisement\n\nFor years, family-run Pu Ji Mi sold mountains of jok bal (soy-braised pork hocks) in this unassuming mall. Its closure in February was mourned far and wide, but the good news is that in its place Eastwood now has its own outpost of Guk’s Eedaero Gamjatang, Jongguk Lee’s cult soup kitchen. Split a gamjatang with friends, and it’ll be rich from long-simmered pork bones and doenjang, spicy from gochugaru and gochujang and loaded with perilla, potatoes and enoki mushrooms. Add a round of ice-cold Cass lager to keep the vibes high. 202/62-80 Rowe Street, Eastwood Photo: Jennifer Soo Dae Jang Kum Crossing the road, Uncles’ Butchery, is a chance to score Korean barbecue meats – Black Onyx chuck tail flap, say – but if you’d prefer to grill here and now, a block up is Dae Jang Kum, where the charcoal burns hot, and the beef intercostal in soy and sesame is the order. Don’t skip the yukhoe, either, which sees Korea’s own beef tartare levelled up with a crisp puffed rice cracker for texture. 29 Rowe Street, Eastwood Kowloon Cafe in Eastwood. James Brickwood\n\nAdvertisement",
    "source": "TheAge",
    "cluster_id": 24
  },
  {
    "url": "https://www.theage.com.au/sport/nrl/why-silent-latrell-mitchell-is-still-league-s-loudest-voice-20250521-p5m0z6.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Why silent Latrell Mitchell is still league’s loudest voice",
    "publish_date": "Fri, 23 May 2025 11:40:00 +1000",
    "category": "sports",
    "authors": [
      "Dan Walsh"
    ],
    "text": "Save Log in , register or subscribe to save articles for later. Save articles for later Add articles to your saved list and come back to them any time. Got it Normal text size Larger text size Very large text size Latrell Mitchell’s former coach Jason Demetriou says it as well as anybody. “When Latrell speaks the narrative doesn’t always go the direction he wants. The narrative can go anywhere because he’s either loved or he’s not liked.” For nine months and counting, the NRL’s most intriguing figure has kept his counsel and kept the quotes to himself. Yet Mitchell is still rugby league’s biggest star and accordingly, the man rugby league media flocks to most. Even when he won’t talk. Shots of him playing golf in the rain and his Instagram account - endorsing South Sydney’s social media campaign to ditch Accor Stadium for Allianz - have counted as Latrell news this week from NSW Origin camp. Along with updates that Latrell still ain’t talking. And conjecture about whether he should be. It hasn’t always been this way. More just Mitchell’s latest wrestle in his complicated relationship with the fourth estate, not to mention his place in the rugby league ecosystem.\n\nAdvertisement\n\nLatrell Mitchell: the man everyone wants a piece of. Credit: Michael Howard Now in his tenth season of first-grade, Mitchell has occupied rare air for years as far as newsworthiness goes. No-one in rugby league compares. For what he does on the field that no-one else can. And what he says off the field that no-one else will. Since the internet came into being, only Jarryd Hayne has broken it like Mitchell in this game. Though you suspect Andrew Johns would have rivalled them if his career - mercifully for the Eighth Immortal - hadn’t just missed the rise of social media. Loading Brisbane’s enigmatic Reece Walsh might still match Mitchell some day, though more headlines are the last thing he or the Broncos need. Nick Kyrgios is probably the only Australian athlete who trumps South Sydney’s superstar in turning the heads of Sydney-based editors and TV producers chasing clicks, comments and views.\n\nAdvertisement\n\nMitchell’s lasting impact on his Indigenous people will always, rightly, leave all that in the shade. I still recall standing in the SCG sheds in 2019, when he was just 22 and still a Rooster, as he addressed the torrent of racial abuse he was receiving on social media for the first time. I asked Mitchell if he truly grasped the pile-on coming his way. “I don’t care. Everything that is said about Aboriginal people really affects me,” was his simple, lasting reply. On Indigenous issues and representation, no voice has rung louder or longer than Mitchell’s in Australian sport since. Latrell Mitchell before an Indigenous All Stars game. Credit: NRL Photos For a while afterwards, Mitchell revelled in the lighter side of breaking the world wide web too. When the Rabbitohs flew him to Philadelphia to work with reconditioning guru Bill Knowles in 2022, Mitchell returned with his hamstrings in order and a new outlook on his rugby league life. “I’ve been having fun, that’s always been me, I’ve just been perceived as someone else,” Mitchell told colleague Christian Nicolussi during a mid-season South Sydney media day, conducting no less than a dozen interviews in the Redfern Oval stands.\n\nAdvertisement\n\n“I’ve done it all my life, I’ve talked a big game but always backed it up. “I think a lot more players need to be outspoken and confident in themselves, and understand the power you have in this game… In the US they are funny, and I took a lot out of the way they talk. “They know the power they have. We need to start understanding that.” Good times for all. Because Mitchell did back himself up with big game after big game in a career-best run. And delivered a slew of headline-worthy quotes to boot. He declared “that NSW jersey is mine” after terrorising incumbent Blues centre Matt Burton one Friday night, laughed off accusations of lying down to draw a penalty with “call me Trell Milk” and “used [the media] to my advantage and the Roosters took the bait” when tensions were at their highest against his former club and Mitchell was being booed relentlessly. Box office: Latrell Mitchell roars to the crowd after nailing a sideline conversion against the Roosters in 2022. Credit: Getty Two years on, Mitchell understands the power he also wields in not speaking.\n\nAdvertisement\n\nAfter the most tumultuous period of his career, when he briefly considered walking away from the game and Souths pondered similarly uncomfortable questions about his future at the club, Mitchell needed Wayne Bennett like never before. Forget the side-mouth, single word answers and cranky old Wayne routine. The 75-year-old uses the media to his advantage better than anyone. Bennett’s return to the Rabbitohs coincided with Mitchell needing to put his head down. Needing to repay the club for a hellish campaign that ended with a foot injury, one-game ban and $40,000 in NRL and South Sydney fines (with a further $80,000 fine suspended) for the photos of him standing over a white substance in a Dubbo hotel room. The Mitchell narrative of last year - which also included his involvement in the Spencer Leniu-Ezra Mam racism saga, an expletive-laden Triple M interview and suspension for belting Shaun Johnson - was wilder than ever as it grew untenable. Wayne Bennett returned to South Sydney when Latrell Mitchell needed him most. Credit: Getty Nine months of no comment is Mitchell, with South Sydney’s backing, taking charge of the narrative and letting “his footy do the talking” - one of his favourite refrains over the years. Nine months of no comment also leaves that potentially career-defining drama in Dubbo hanging in the air though. It remains the reference point for any reporter worth their salt because Mitchell has never addressed it himself.\n\nAdvertisement",
    "source": "TheAge",
    "cluster_id": 25
  },
  {
    "url": "https://www.theage.com.au/sport/do-not-get-involved-arbib-s-warning-to-australian-olympians-about-enhanced-games-20250523-p5m1mq.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "‘Do not get involved’: Arbib’s warning to Australian Olympians about Enhanced Games",
    "publish_date": "Fri, 23 May 2025 11:40:00 +1000",
    "category": "sports",
    "authors": [
      "Vince Rugari"
    ],
    "text": "Australian Olympic Committee chief Mark Arbib has warned any Australian athletes who are considering a tilt at the Enhanced Games next year to think again, saying their involvement would not be supported or sanctioned.\n\nArbib has taken a dim view of plans for the Enhanced Games to be launched next year in Las Vegas, including events in swimming, athletics, and weightlifting and with a format that will pit clean athletes against those who have taken performance-enhancing drugs under supervision for the same lucrative prize money.\n\n“It’s a dangerous and risky venture,” Arbib said on Friday.\n\n“People need to remember drugs in sport are banned primarily for health reasons. We care about the welfare of the athletes. We care about the welfare of the community. Taking drugs can negatively impact your health, but it can also lead to death.",
    "source": "TheAge",
    "cluster_id": 26
  },
  {
    "url": "https://www.theage.com.au/world/footage-captures-sound-of-titan-sub-imploding-20250523-p5m1oe.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Footage captures sound of Titan sub imploding",
    "publish_date": "Fri, 23 May 2025 11:36:51 +1000",
    "category": "finance",
    "authors": [],
    "text": "Footage captures sound of Titan sub imploding\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 27
  },
  {
    "url": "https://www.theage.com.au/national/when-the-party-machine-wouldn-t-listen-sussan-ley-paid-attention-to-me-20250522-p5m1ac.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "When the party machine wouldn’t listen, Sussan Ley paid attention, to me",
    "publish_date": "Fri, 23 May 2025 11:30:00 +1000",
    "category": "finance",
    "authors": [
      "Lucy Wicks"
    ],
    "text": "Sussan Ley was the last person I spoke to in alarm about the Liberal Party’s disastrous policy that proposed to restrict public servants working from home. At the time, she was shadow minister for women.\n\nAs the Liberal candidate for Robertson, the longest-running bellwether electorate in Australia, I felt the impact immediately. It was beyond bad. People who were once interested in Liberal plans and policies no longer cared. “Yeah – nah” they said, and that was that.\n\nLiberal leader Sussan Ley was the only one who listened. Credit: AAP\n\nThe mere suggestion that the Liberals might not uphold values of individual freedom by telling people what to do in their homes and workplaces went down like a lead balloon in Robertson. Not surprising, given we are a Central Coast commuter belt where people can spend four hours a day commuting to work.\n\nI spoke up loudly against the policy from the day it was announced, to every relevant shadow minister and the opposition leader too. Every person I spoke to justified the policy.",
    "source": "TheAge",
    "cluster_id": 28
  },
  {
    "url": "https://www.theage.com.au/culture/tv-and-radio/mark-ruffalo-returns-to-screens-in-official-trailer-for-hal-and-harper-20250523-p5m1o2.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Mark Ruffalo returns to screens in official trailer for Hal & Harper",
    "publish_date": "Fri, 23 May 2025 11:28:08 +1000",
    "category": "finance",
    "authors": [],
    "text": "Mark Ruffalo returns to screens in official trailer for Hal & Harper\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 29
  },
  {
    "url": "https://www.theage.com.au/politics/federal/the-coalition-break-up-isn-t-a-divorce-they-re-just-sleeping-in-different-bedrooms-20250522-p5m1hd.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "The Coalition break-up isn’t a divorce. They’re just sleeping in different bedrooms",
    "publish_date": "Fri, 23 May 2025 11:25:00 +1000",
    "category": "finance",
    "authors": [
      "Kate Halfpenny"
    ],
    "text": "Before I married my first husband, we broke up twice. Once at 18, a few months after meeting on the Surfers Paradise beach during HSC. I was bemused.\n\nSecond time, we were 23 and living in a St Kilda flat when he pulled the pin. I was strategic. Quit my job, moved to London, replied to his Air Mail letters when it suited. Came home six months later to a marriage proposal.\n\nThe final split at 46, I was inconsolable. But accepting. When our wise, supportive couples’ counsellor Sarah said after a lot of work, “this marriage is over”, I trusted her external confirmation of what was being thought inside the relationship.\n\nThere are always separations before a divorce, and there are rules to ensure unnecessary damage isn’t done. Credit:\n\nSo among the pieces of wisdom our kids have been subjected to – always say “very well, thank you” when asked how you are because nobody cares anyway, look under the rug at house inspections, beef mince is your friend – one is a mainstay: Most breakups take three cracks at it before you really break up (or stay together).",
    "source": "TheAge",
    "cluster_id": 30
  },
  {
    "url": "https://au.news.yahoo.com/aussie-household-staple-being-snapped-up-by-kiwis-as-local-price-jumps-by-65-per-cent-073609759.html",
    "title": "Aussie household staple being snapped up by Kiwis as local price jumps by 65 per cent",
    "publish_date": "2025-05-22T07:36:09Z",
    "category": "finance",
    "authors": [],
    "text": "It's now cheaper to buy Kiwi butter in Australian supermarkets than in New Zealand stores.\n\nBuying local butter in New Zealand has become prohibitively expensive for local shoppers. Source: Michael Dahlstrom\n\nA “perfect storm” has led to butter prices increasing by more than 65 per cent over the last year in New Zealand, forcing one popular bakery to buy it from Australia instead.\n\nKaye’s Bakery owner Luella Penniall told Yahoo News she always tries to buy local butter, but lately the price has been too high. Her broker often advises her to import her massive multi-tonne order of butter from Australia, where she can make greater savings.\n\n“It’s craziness. There could be $1.50 a kilo difference, and when you’re buying $50,000 or $100,000 worth at a time, that adds up to a lot,” she said.\n\nContracts with retailers who sell her produce prevent her from suddenly altering her price, so continuing to always use local butter as the cost soars would come at a massive financial cost. Besides, increasing the price of her famous cakes, slices and biscuits would harm Kiwi shoppers who are already struggling with the cost of living.\n\nADVERTISEMENT\n\n“I’m a New Zealand manufacturer and I don’t want my products to become unaffordable,” she said.\n\nRelated: 🌏 Grocery shop brings New Zealand dad to tears after move to Australia\n\nA 400-gram packet of Westgold sells at Woolworths for NZ$9.95 (A$9.16) locally, but the price in the Australian supermarket is $6.50. Source: Michael Dahlstrom/Woolworths\n\nWoolworths selling NZ butter cheaper to Aussie customers\n\nKiwi shoppers are also feeling the pinch at the country's three major supermarkets, Woolworths, PAKnSAVE and New World.\n\nAt Woolworths, New Zealand-made 400-gram packs of Westgold sell for NZ$9.95 (A$9.16) locally, but the price drops to just $6.50 in Australian stores. While 250-gram packs of New Zealand's famous Mainland butter are selling for $8.90 ($8.15) in New Zealand versus $6.50 in Australian stores.\n\nWhy are New Zealand butter prices so high?\n\nAccording to an international supply chain expert, a major reason Kiwis are charged high prices for their own butter is that it’s in high demand overseas, where it can be bought at a \"good price\" in greater amounts.\n\nADVERTISEMENT\n\n“New Zealand butter is a premium product, and it’s really well recognised around the world,” Australian National University business and economics lecturer David Leaney explained.\n\nThe New Zealand dollar is struggling due to concerns about a recession, China’s slumping economy, and the threat of tariffs from US President Donald Trump. This makes it more affordable right now for overseas buyers to use their strong currencies to snap up Kiwi butter.\n\nDemand is also being driven by problems in the northern hemisphere with extreme weather and crop failure leading to shortages. This reduced competition is also leading to the New Zealand product attracting a premium.\n\nWhy farmers are also paying more to make butter\n\nLooking domestically, New Zealand farmers are facing ongoing pressures as drought continues to increase the cost of raising animals. Buying and transporting extra feed comes with an added cost. And when cattle consume supplementary feed rather than paddock grass the fat concentration of the milk is altered, further impacting the sale price.\n\nADVERTISEMENT\n\n“It's unusual for all of the international factors to line up all in the same direction. And it's even more unusual for all the domestic ones to do the same. It’s a perfect storm at the moment,” Leaney said.\n\nAustralians also paying higher prices due to overseas contracts\n\nTravelling around New Zealand, it’s often astonishing to see how little local fresh fruit and vegetables are available in supermarkets. When orchards and backyard trees are sprouting lemons, oranges and apples, retail shelves are lined with American-grown fruit.\n\nThis is driven by producers being locked into big international contracts, which buy a greater volume of food than local retailers need.\n\n“Even if they wanted to sell locally at a higher price, they’ve already been lured in by big contracts,” he said.\n\n“The same thing happens with Australia’s natural gas. We signed some really big contracts to supply gas at a huge volume to overseas markets, with prices locked in. And even though we could sell it for more domestically, we can't, because we’re locked into those contracts.\n\nADVERTISEMENT\n\n“You end up with gas going overseas, and then being imported back here at a higher price.”\n\nLeaney thinks increasing butter prices will be temporary, and the price will stabilise due to market forces.\n\nHe compares the situation to eggs in Australia, where avian influenza outbreaks led to shortages and increased prices. While prices no longer seem to be increasing, they’re unlikely to drop again unless economic drivers change.\n\n“The problem is hard to fix. It self-adjusts because sometimes not all of the factors will keep aligning. Exchange rates could change, or the gap in the market will be filled by someone else. Once you become the most expensive option, then suddenly people will start looking for the second or third,” Leaney said.\n\nLove Australia's weird and wonderful environment? 🐊🦘😳 Get our new newsletter showcasing the week’s best stories.",
    "source": "Yahoo",
    "cluster_id": 38
  },
  {
    "url": "https://au.news.yahoo.com/virgin-australia-defends-bizarre-detail-in-110-million-plane-upgrade-063132472.html",
    "title": "Virgin Australia defends bizarre detail in $110 million plane upgrade",
    "publish_date": "2025-05-22T06:31:32Z",
    "category": "finance",
    "authors": [],
    "text": "Virgin angered passengers by installing what has been described as a 'shower curtain' to divide business and economy classes. Source: Australianfrequentflyer/serfty\n\nVirgin Australia is in the throes of a massive $110 million upgrade to its Boeing 737 airliners, aimed at enhancing the guest experience. However, the airline has been forced to respond after a 'disappointing' detail was spotted on a recent flight — and passengers can expect to see it until at least next year.\n\nCabin reconfigurations, which have added extra rows of seating in the planes, saw the removal of perspex dividers that separate economy and business classes. Now, what's replaced it is what passengers have described as a \"shower curtain\" in a move that has frustrated many.\n\nHowever, Virgin Australia has defended the move, assuring Aussies the dividers are temporary. \"Virgin Australia is currently rolling out new cabin dividers as part of the refurbishment of our Boeing 737 interiors,\" a spokesperson told Yahoo News.\n\n\"The first of which includes the installation of a cross-aisle curtain between Business and Economy class to help manage guest flow. From early next year, divider panels will be mounted underneath the overhead bins on either side of the curtain, providing a more defined partition between cabins.\"\n\nVirgin is in the process of upgrading its fleet of airplanes. Source: Getty\n\nIt's understood that this type of divider is used in many airlines with narrowbody aircraft around the world and allows for more efficient use of floor space in the Economy cabin. However, some customers have questioned why the airline didn't simply wait to do the perspex upgrade.\n\nADVERTISEMENT\n\n\"It seriously looks like someone has ducked down to Spotlight and bought something off the specials table,\" one traveller lamented.\n\nAnother speculated that the purpose of the curtain was to prevent economy passengers from using the forward toilet, usually reserved for business class passengers.\n\n\"Could have waited until the perspect was finished and installed altogether next year,\" they said.\n\nWhat else is Virgin Australia upgrading?\n\nThe upgrade will see an extra six to 12 economy seats added to the planes.\n\nBoth business and economy have had new or refurbished seating implemented in the 737s, with in-seat power in both classes. Wi-Fi and in-flight entertainment via passengers' own devices are also a new feature on the upgraded planes.\n\nADVERTISEMENT\n\nThe airline claims that larger overhead lockers have been installed so that 50 per cent more carry-on baggage can fit, although there will be no increase in the individual passenger allowance.\n\nIt's expected the works will be completed in the next two years, subject to operational requirements.\n\nDo you have a story tip? Email: newsroomau@yahoonews.com.\n\nYou can also follow us on Facebook, Instagram, TikTok, Twitter and YouTube.",
    "source": "Yahoo",
    "cluster_id": 39
  }
]