[
  {
    "url": "https://www.9news.com.au/national/papua-new-guinea-conjoined-twins-tom-sawong-emergency-surgery-sydney/bb71e644-db4f-4d91-b6da-42f0d1ad0366",
    "title": "Conjoined twin baby dies after emergency surgery",
    "publish_date": "Tue, 09 Dec 2025 01:32:18 +0000",
    "category": "lifestyle",
    "authors": [
      "Dec"
    ],
    "text": "O﻿ne of the conjoined twins who were flown from Papua New Guinea to Australia in a desperate attempt to save their lives has died following an emergency surgery.\n\nTom and Sawong were almost two months old when they were rushed into a seven-hour surgery at ﻿Sydney Children's Hospital on Sunday.﻿\n\nTom, the most critical of the two, died, while Sawong survived the separation.\n\nREAD MORE: ﻿ TPG says possible second death linked to Triple Zero outages\n\nTom has died after a seven-hour emergency surgery. (Supplied)\n\nMedevac pilot Jurgen Ruh, who has stayed with the family, said the parents were feeling a mixture of sadness and relief.\n\nSawong is in critical but stable condition and under close intensive care.\n\nHe is expected to remain in Sydney for the next few months until the hole in his stomach closes.\n\n\"In the first day, he made vast improvements on his medical condition. He is getting better as fast as he can﻿,\" Ruh told 9news.com.au.\n\nA funeral is being prepared for Tom. ﻿\n\nThe brothers were almost two months old when they rushed into the operating room. (Supplied)\n\nThe brothers were born attached at the lower abdomen in the remote province of Morobe on October 9 and shared several critical organs, including parts of their liver, bladder and gastrointestinal tract.\n\nTom also had further issues, including a congenital heart defect and only one kidney. ﻿\n\nRuh said it was lucky the local hospital could perform the C-section needed to deliver the babies, as only one in 200,000 conjoined twins are born alive.\n\nThe brothers were receiving treatment in Port Moresby for several weeks, but the hospital could not perform the separation surgery.\n\nTheir parents sought help from Australia, Germany and India.\n\nThe conjoined twins were flown to Sydney. (Supplied)\n\nAt the time, their father said: ﻿\"Tom and Sawong are fighters and have fought since.\"﻿\n\nThe parents were in the process of making arrangements for Germany when Tom's health deteriorated on Thursday, and the twins were rushed to nearby Sydney. ﻿\n\nSpecialists from the ﻿Sydney Children's Hospitals Network had helped with the transfer.\n\nPapua New Guinea's Prime Minister James Marape told reporters he was assured that the Australian government would cover the medical bills.\n\nThe twins were assessed in Sydney.\n\nRuh ﻿said specialists believed ﻿Tom had very little chance of surviving their separation. ﻿﻿",
    "source": "9News",
    "cluster_id": 0
  },
  {
    "url": "https://www.9news.com.au/national/domestic-airfares-reach-highest-prices-for-three-years-accc-report/93bac459-ee49-4df5-9d16-37eb24a787d3",
    "title": "Glimmer of hope for cheaper domestic air fares",
    "publish_date": "Tue, 09 Dec 2025 00:16:13 +0000",
    "category": "finance",
    "authors": [
      "Dec"
    ],
    "text": "T﻿he consumer watchdog has found domestic air fares surged through October as airlines cashed in on demand during the sports finals season and school holidays.\n\nDuring the period, NRL and AFL fans from Brisbane flew to Sydney and Melbourne to watch their teams capture grand final victories over Victorian clubs. ﻿\n\nOctober and late September recorded 5.5 million domestic passengers, according to the Australian Competition and Consumer Commission's airline report released today.\n\nBrisbane Broncos fans descended on Sydney in October for the NRL grand final (Photo: Steven Siewert) (Sydney Morning Herald)\n\nThis was 3.8 per cent higher than last October and the second biggest set of passenger numbers recorded for any month since January 2019, the month when the ACCC first began gathering data on the domestic airline industry.\n\nQantas and Virgin put on an 45 extra flights to meet the demand, but flights were still fuller than normal.\n\nIn October 2025, 84.4 per cent of available seats were filled by passengers, compared with the 12-month average of 81.6 per cent.\n\nACCC Commissioner Anna Brakey said interstate AFL and NRL teams playing in finals series pushed up air travel demand.\n\n\"Airfares are typically elevated during peak demand periods, but the higher passenger levels in October 2025 placed additional pressure on seat capacity which pushed up airfares for consumers,\" she said.\n\nQantas and Virgin Australia put on an extra 45 domestic flights during October to meet a surge in demand.. (Getty)\n\nThe ACCC research reinforced what many air travellers already know: the aviation market in Australia is heavily concentrated around Qantas and Virgin Australia, with the two airlines holding 98 per cent market share.\n\nBut the regulator provided a glimmer of hope for cheaper future air tickets, noting Qantas and Virgin Australia are planning to increase their fleets next year.\n\nThis includes Qantas redeploying its 13 Airbus A320 planes from the axed Jetstar Asia carrier.﻿",
    "source": "9News",
    "cluster_id": 1
  },
  {
    "url": "https://www.9news.com.au/national/tpg-telecom-addresses-triple-zero-failures-senate-appearance/57b31dff-7fbe-4f9c-bc3d-4d40d2e9e7ca",
    "title": "TPG says possible second death linked to Triple Zero outages",
    "publish_date": "Mon, 08 Dec 2025 23:23:02 +0000",
    "category": "finance",
    "authors": [
      "Dec"
    ],
    "text": "TPG Telecom says that it is possible a second death has been linked to the network's ongoing struggles with users attempting to contact Triple Zero on Samsung devices using out-of-date software.\n\nAs company representatives appeared before a Senate committee on Triple Zero outages and resilience, TPG said it was working to clarify the circumstances around a person's death in December.\n\n﻿\"TPG was made aware on December 8, 2025, that the calls to Triple Zero may have been made in connection with an individual who has lost their life,\" the telco said in a statement today.\n\nTPG Telecom says that it is possible a second death has been linked to the network's ongoing struggles with users attempting to contact Triple Zero. (Supplied)\n\n\"We have sought to clarify the circumstances, but details have not yet been verified by relevant emergency authorities.\"\n\nTPG said it had provided and would continue to provide information to the Australian Communication and Media Authority (ACMA) regarding the incident.\n\nThe failed September contact was made using a Samsung device that was operating out-of-date software.﻿\n\nSome older Samsung phones need software updates to contact triple zero, TPG says. (iStock)\n\nLast month, TPG confirmed a Sydney person had died after a customer on their network was unable to make Triple Zero calls on their Samsung device.\n\nThe incident took place on November 13.\n\nThe telco has said Samsung had recently identified that certain older devices needed a software update to contact Triple Zero on TPG's mobile network.﻿\n\nShadow Minister for Communications Melissa McIntosh. (Alex Ellinghausen)\n\nTPG said it had been communicating with affected customers about \"urgently\" updating their software.\n\n\"TPG also continues to urge all customers with outdated software to replace or update their devices without delay to ensure they can reach Triple Zero in an emergency,\" the company said today.\n\nShadow Communications Minister Melissa McIntosh called the Triple Zero outages a \"public safety risk\".\n\nIn a release, her office said 71 Samsung mobile devices had been identified as not correctly connecting to Triple Zero in October.\n\nOf those, 11 needed a replacement, and 60 a software update, with 28 days for affected phone users to act.\n\n\"I am again urging all Australians with one of these Samsung devices to act on the message they have received to either update their software or get a new device,\" she said.\n\n\"If you have one of the 71 Samsung devices, I urge you to update your software urgently or contact your telco provider.\"",
    "source": "9News",
    "cluster_id": 2
  },
  {
    "url": "https://www.9news.com.au/world/baby-among-10-people-who-shaped-science-in-2025/273def02-3e98-4045-a0a1-3269cd6d4d10",
    "title": "This baby just won a title usually reserved for microbiologists, neuroscientists",
    "publish_date": "Tue, 09 Dec 2025 00:17:44 +0000",
    "category": "lifestyle",
    "authors": [
      "Dec"
    ],
    "text": "A baby has miraculously snagged a spot on the list of most influential people in science for 2025.﻿\n\nNature Magazine today announced its annual list of 10 people who shaped science and one honouree was not like the others.\n\nUnlike the physicists, geoscientists and biologists that dominated the list, KJ Muldoon is just a little boy from Pennsylvania, US.\n\nBaby KJ Muldoon's illness is so rare it only affects about 1 in 1.3 million people. (Children's Hospital of Philadelphia)\n\nKJ was diagnosed with an incredibly rare, deadly genetic disease﻿ called carbamoyl-phosphate synthetase 1 deficiency shortly after he was born in August 2024.\n\nThe \"one in a million\" ﻿metabolic condition can cause brain damage and death, especially in infants.\n\nAbout 50 per cent of babies diagnosed with the disease die in early infancy.\n\nDoctors at the Children's Hospital of Philadelphia﻿ worked tirelessly to develop a bespoke treatment using CRISPR gene-editing technology in the hopes of saving KJ's life.\n\nThe first of three treatment infusions was administered in February, when KJ was about seven months old.\n\nAnd it seems to have worked.\n\nKJ's parents and siblings were over the moon when the first-of-its-kind treatment started working. (Chloe Dawson/CHOP via AP)\n\nBefore long, KJ was gaining weight and thriving.\n\nHe became the first patient to successfully receive personalised CRISPR gene editing therapy and, after spending his first 307 days in hospital, was finally able to go home in June.\n\n\"He's always smiling,\" KJ's mum Nicole Aaron told Nature .\n\nTwo of KJ's doctors, paediatrician Rebecca Ahrens-Nicklas and cardiologist Kiran Musunuru are now working on clinical trials to help more children.\n\nThe other \" Nature's 10\" honourees included ﻿geoscientist Mengran Du, who took a submersible 9km down into the deep sea to catch the first glimpse of new ecosystems.\n\nAssistant Professor Mengran Du dove 9000m below the ocean's surface in this deep-sea manned submersible. (Billy H.C. Kwok for Nature)\n\nAgricultural researcher Luciano Moreira was lauded for opening a factory that produces mosquitoes infected with a bacteria that helps stop the spread of human diseases.\n\nMicrobiologist and immunologist Susan Monarez was celebrated after being fired as head of the US Centres for Disease Control and Prevention for standing up to the Trump administration.",
    "source": "9News",
    "cluster_id": 3
  },
  {
    "url": "https://www.9news.com.au/national/wentworth-park-greyhound-racing-track-to-be-replaced-by-housing-sydney/1d5378e6-6e3a-4bec-baa9-8e7ebdc73f05",
    "title": "'Cities change': Decades-old greyhound track to be torn down",
    "publish_date": "Mon, 08 Dec 2025 21:04:27 +0000",
    "category": "sports",
    "authors": [
      "Dec"
    ],
    "text": "A greyhound racing track that has stood in Sydney's Inner West for almost a century will be demolished to make room for thousands of homes and community sporting grounds.\n\nNew South Wales Premier Chris Minns announced today that the Wentworth Park area, which includes the eponymous greyhound racing track, will become the site of 7300 new homes and green spaces.\n\nThe track itself﻿ will be demolished when the racing licence of the NSW Greyhound Breeders, Owners and Trainers Association (GBOTA) for the site runs out in late 2027, with the land to be returned to the City of Sydney and converted into sports grounds.\n\nConcept art of the new-look Wentworth Park. (City of Sydney)\n\n\"We recognise Wentworth Park holds deep history and meaning for many people, and we know some will be disappointed by this change,\" Minns said.\n\n\"But cities change and we have a responsibility to plan for the future.\"\n\nThe 3.3-hectare Wentworth Park Sporting Complex precinct will be converted into more sports fields and public green space.\n\nThe greyhound track will be demolished. (Janie Barrett)\n\nThis will allow for rezoning of the surrounding area the government said would in turn allow for 2500 extra homes.\n\nThese will be in addition to the 4800 homes already planned or approved nearby, including 2000 at the old Sydney Fish Market site.\n\nIn total, the government's current plan for the area involves 7300 new homes.\n\nThe track currently hosts 102 race meets a year. (Janie Barrett)\n\nMirvac has been tapped as the preferred tenderer for the former Fish Market site, with the company to begin building 1400 homes, including 580 student housing units, by early 2027 if planning is approved.﻿\n\nThe government has also committed to supporting the transfer of greyhound racing to other tracks, to the tune of a $10 million allocation to the Greyhound Capital Grants Program for track upgrades.\n\nAccording to GBOTA, the Wentworth Park grounds currently host 102 race meetings a year.\n\nPremier Chris Minns. (Sitthixay Ditthavong)\n\n\"The transition of the Wentworth Park Sporting Complex site to new, enhanced open space and community recreation uses is an exciting new chapter that marks the end of an era for inner city greyhound racing that has taken place there since 1932,\" Gaming and Racing Minister David Harris said.\n\n\"The NSW Government continues to support a competitive, responsible and sustainable greyhound racing industry with the highest standards of animal welfare and integrity that balances tradition with community expectations.\n\n\"Greyhound racing is a valuable contributor to regional communities supporting thousands of jobs.\"",
    "source": "9News",
    "cluster_id": 4
  },
  {
    "url": "https://www.9news.com.au/world/golden-globes-2026-nominations-revealed/289c7745-38bc-487d-8b28-e4952e30a4c3",
    "title": "Snubs and surprises: All the 2026 Golden Globe nominees",
    "publish_date": "Mon, 08 Dec 2025 22:47:30 +0000",
    "category": "entertainment",
    "authors": [
      "Dec"
    ],
    "text": "This morning, the Golden Globes nominations were unveiled. Were there big surprises?\n\nThe snub of Wicked: For Good in the best picture category, for one. There was also a very gratifying nomination of Amy Madigan for her turn as the villain in Weapons . Overall, most of the nominations closely tracked awards predictions.\n\nAlso, all the popular TV shows got nominated.\n\nPaul Thomas Anderson's film \"One Battle After Another\" led the awards charge. (AP)\n\nAs is the case every year, the Globes awards categories suffer from the insistence to categorise movies and television shows as either drama or as \"musical or comedy.\" (There are also always a good couple questions each year about who's a \"supporting\" actor and who's just acting.)\n\nOne Battle After Another was considered by awards-watchers to be the lead contender for awards and it did just that.\n\nThat film, which stars Leonardo DiCaprio at his most offhandedly brilliant as a hapless revolutionary bumbling into nightmarish political machinations, all while surrounded by fabulous, powerful and troubled women, is currently available for streaming at movie-theater ticket prices.\n\nREAD MORE: The Louvre hit by embarrassing new blunder ﻿\n\nCynthia Erivo as Elphaba Thropp and Ariana Grande as Glinda Upland in Wicked: For Good. (Universal Pictures)\n\nIt will return to select IMAX theatres on December 11 for a week; few tickets remain.\n\nThe gorgeous Joachim Trier film Sentimental Value , which received multiple nominations, tracks the relationship between a distressed, easily panicked actress and her callous film director father – plus the life of their family's house as well.\n\nIn addition to an unbelievable performance by Renate Reinsve in the lead role, the film also has Elle Fanning absolutely nailing the role of an American actress pushed to the levels of her comfort and talent.\n\nJacob Elordi and Mia Goth as The Creature and Elizabeth in Guillermo del Toro's Frankenstein. (Netflix)\n\nIt seems like a lifetime ago, but Sinners was released just back in April and voters remembered its cultural moment and box office success. The Ryan Coogler Jim-Crow-plus-vampires hit neatly mashed up the horrors of the supernatural with the horrors of the very human.\n\nHamnet and Wicked: For Good , representing polar opposites of the year in film, also had strong showings.\n\nParents were unsurprised by nominations for KPop Demon Hunters , the soundtrack of their lives since the mega-hit was released on Netflix just (can you believe it!) back in June.\n\nZoey, from left, Rumi and Mira in a scene from KPop Demon Hunters. (AP)\n\nThere was a very important nomination for the very avatar of our age of apprehension: the terrifying clown-witch visage of Aunt Gladys in Weapons .\n\n( One Battle , Weapons , and Sinners are produced, co-produced and/or distributed by Warner Bros Pictures, which currently shares a parent company with CNN.)\n\nBoth Severance , the eerie tribute to the awfulness of having to work, and Adolescence , the Netflix mega-smash about a teenager accused of murder, were well-recognised.\n\nWalton Goggins and Amy lou Wood in The White Lotus. (HBO/Supplied)\n\nPluribus , The Last of Us and The Pitt – all extremely stressful shows, each apocalyptic in their own way, especially about the dire state of the American health care system – performed well too.\n\nThe Golden Globes awards show, hosted by comedian Nikki Glaser, will take place on Sunday, January 11, 2026, US time.\n\nBest Motion Picture, Musical or Comedy\n\nBlue Moon\n\nBugonia\n\nMarty Supreme\n\nNo Other Choice\n\nNouvelle Vague\n\nOne Battle After Another\n\nBest Motion Picture, Drama\n\nFrankenstein\n\nHamnet\n\nIt Was Just an Accident\n\nThe Secret Agent\n\nSentimental Value\n\nSinners\n\nBest Director – Motion Picture\n\nRyan Coogler, Sinners\n\nPaul Thomas Anderson, One Battle After Another\n\nGuillermo del Toro, Frankenstein\n\nJafar Panahi, It Was Just An Accident\n\nJoachim Trier, Sentimental Value\n\nChloe Zhao, Hamnet\n\nBest Male Actor – Motion Picture, Musical/Comedy\n\nTimothee Chalomet, Marty Supreme\n\nGeorge Clooney, Jay Kelly\n\nLeonardo DiCaprio, One Battle After Another\n\nEthan Hawke, Blue Moon\n\nLee Byung-hun, No Other Choice\n\nJesse Plemons, Bugonia\n\nBest Performance by a Male Actor in a Motion Picture – Drama\n\nDwayne Johnson, The Smashing Machine\n\nJeremy Allen White, Springsteen: Deliver Me From Nowhere\n\nJoel Edgerton, Train Dreams\n\nMichael B Jordan, Sinners\n\nOscar Isaac, Frankenstein\n\nWagner Moura, The Secret Agent\n\nBest Performance by a Female Actor in a Motion Picture – Musical or Comedy\n\nAmanda Seyfried, The Testament of Ann Lee\n\nChase Infiniti, One Battle After Another\n\nCynthia Erivo, Wicked: For Good\n\nEmma Stone, Bugonia\n\nKate Hudson, Song Sung Blue\n\nRose Byrne, If I Had Legs I'd Kick You\n\nBest Performance by a Female Actor in a Motion Picture – Drama\n\nEva Victor, Sorry Baby\n\nJennifer Lawrence, Die My Love\n\nJessie Buckley, Hamnet\n\nJulia Roberts, After The Hunt\n\nRenate Reinsve, Sentimental Value\n\nTessa Thompson, Hedda\n\nBest Supporting Male Actor in a Motion Picture\n\nBenicio del Toro, One Battle After Another\n\nJacob Elordi, Frankenstein\n\nPaul Mescal, Hamnet\n\nSean Penn, One Battle After Another\n\nAdam Sandler, Jay Kelly\n\nStellan Skarsgard, Sentimental Value\n\nBest Supporting Female Actor in a Motion Picture\n\nEmily Blunt, The Smashing Machine\n\nElle Fanning, Sentimental Value\n\nAriana Grande, Wicked: For Good\n\nInga Ibsdotter Lilleaas, Sentimental Value\n\nAmy Madigan, Weapons\n\nTeyana Taylor, One Battle After Another\n\nBest Screenplay – Motion Picture\n\nChloe Zhao, Maggie O'Farrell – Hamnet\n\nJafar Panahi – It was Just An Accident\n\nJoachim Trier, Eskil Vogt – Sentimental Value\n\nPaul Thomas Anderson – One Battle After Another\n\nRonald Bronstein, Josh Safdie – Marty Supreme\n\nRyan Coogler – Sinners\n\nBest Motion Picture – Animated\n\nArco\n\nDemon Slayer: Kimetsu no Yaiba – Infinity Castle\n\nElio\n\nKPop Demon Hunters\n\nLittle Amelie or the Character of the Rain\n\nZootopia 2\n\nBest Motion Picture – Non-English Language\n\nIt Was Just An Accident\n\nNo Other Choice\n\nSentimental Value\n\nSirat\n\nThe Secret Agent\n\nThe Voice of Hind Rajab\n\nBest Original Score – Motion Picture\n\nAlexandre Desplat, Frankenstein\n\nHans Zimmer, F1\n\nJonny Greenwood, One Battle After Another\n\nKangding Ray, Sirat\n\nLudwig Göransson, Sinners\n\nMax Richter, Hamnet\n\nBest Original Song – Motion Picture\n\n\"Dream as One,\" Miley Cyrus, Andrew Wyatt, Mark Ronson, Simon Franglen, Avatar: Fire and Ash\n\n\"Golden,\" Joong Gyu Kwak, Yu Han Lee, Hee Dong Nam, Jeong Hoon Seo, Park Hong Jun, Kim Eun-jae (EJAE), Mark Sonnenblick, KPop Demon Hunters\n\n\"I Lied to You,\" Raphael Saadiq, Ludwig Göransson, Sinners\n\n\"No Place Like Home,\" Stephen Schwartz, Wicked: For Good\n\n\"The Girl in the Bubble,\" Stephen Schwartz, Wicked: For Good\n\n\"Train Dreams,\" Nick Cave, Bryce Dessner, Train Dreams\n\nCinematic and Box Office Achievement\n\nAvatar: Fire and Ash\n\nF1\n\nKPop Demon Hunters\n\nMission: Impossible – The Final Reckoning\n\nSinners\n\nWeapons\n\nWicked: For Good\n\nZootopia 2\n\nBest Television Series – Drama\n\nThe Diplomat\n\nPluribus\n\nSeverance\n\nSlow Horses\n\nThe Pitt\n\nThe White Lotus\n\nBest Television Series – Musical or Comedy\n\nAbbott Elementary\n\nThe Bear\n\nHacks\n\nNobody Wants This\n\nOnly Murders in the Building\n\nThe Studio\n\nBest Television Limited Series\n\nAdolescence\n\nAll Her Fault\n\nThe Beast in Me\n\nBlack Mirror\n\nDying for Sex\n\nThe Girlfriend\n\nBest Female Actor – Television – Drama\n\nKathy Bates, Matlock\n\nBritt Lower, Severance\n\nHelen Mirren, MobLand\n\nBella Ramsey, The Last of Us\n\nKeri Russell, The Diplomat\n\nRhea Seehorn, Pluribus\n\nBest Performance by a Male Actor in a Television Series – Drama\n\nSterling K. Brown, Paradise\n\nDiego Luna, Andor\n\nGary Oldman, Slow Horses\n\nMark Ruffalo, Task\n\nAdam Scott, Severance\n\nNoah Wylie, The Pitt\n\nBest Female Actor – Television, Musical or Comedy\n\nKristen Bell, Nobody Wants This\n\nAyo Edebiri, The Bear\n\nSelena Gomez, Only Murders in the Building\n\nNatasha Lyonne, Poker Face\n\nJenna Ortega, Wednesday\n\nJean Smart, Hacks\n\nBest Female Actor in a Limited Series\n\nAmanda Seyfried, Long Bright River\n\nClaire Danes, The Beast in Me\n\nMichelle Williams, Dying for Sex\n\nRashida Jones, Black Mirror\n\nRobin Wright, The Girlfriend\n\nSarah Snook, All Her Fault\n\nBest Male Actor – Television, Musical or Comedy\n\nAdam Brody, Nobody Wants This\n\nGlen Powell, Chad Powers\n\nJeremy Allen White, The Bear\n\nMartin Short, Only Murders in the Building\n\nSeth Rogen, The Studio\n\nSteve Martin, Only Murders in the Building\n\nBest Supporting Female Actor – Television\n\nAimee Lou Wood, The White Lotus\n\nCarrie Coon, The White Lotus\n\nCatherine O'Hara, The Studio\n\nErin Doherty, Adolescence\n\nHanna Einbinder, Hacks\n\nParker Posey, The White Lotus\n\nBest Male Actor in a Limited Series\n\nCharlie Hunnam, Monster: The Ed Gein Story\n\nJacob Elordi, The Narrow Road to the Deep North\n\nJude Law, Black Rabbit\n\nMatthew Rhys, The Beast in Me\n\nPaul Giamatti, Black Mirror\n\nStephen Graham, Adolescence\n\nBest Supporting Male Actor – Television\n\nOwen Cooper, Adolescence\n\nBilly Crudup, The Morning Show\n\nWalton Goggins, The White Lotus\n\nJason Isaacs, The White Lotus\n\nTramell Tillman, Severance\n\nAshley Walters, Adolescence\n\nBest Podcast\n\nArmchair Expert with Dax Shepherd\n\nCall Her Daddy\n\nGood Hang with Amy Poehler\n\nThe Mel Robbins Podcast\n\nSmartless\n\nUp First\n\nBest Performance in Stand-up Comedy on Television",
    "source": "9News",
    "cluster_id": 5
  },
  {
    "url": "https://www.abc.net.au/news/2025-12-09/university-of-technology-vote-of-no-confidence-vice-chancellor/106114890",
    "title": "'Time to go': Calls for UTS VC to resign after staff no-confidence vote",
    "publish_date": "Tue, 09 Dec 2025 01:31:30 +0000",
    "category": "finance",
    "authors": [],
    "text": "One of Australia's top universities is facing a historic crisis, with 95 per cent of staff voting no confidence in vice-chancellor Andrew Parfitt as hundreds of staff and subjects face the axe.\n\nThe National Tertiary Education Union (NTEU), which ran the vote, said 1,549 of the roughly 4,000 University of Technology Sydney (UTS) staff cast a ballot, with 1,465 expressing no confidence and just 84 expressing confidence.\n\n\"In our 35-year history, UTS has never had a staff ballot on confidence in a vice-chancellor until now. That alone speaks to the unprecedented scale of concern,\" said Dr Hossai Gul, a researcher at UTS and NTEU representative.\n\n\" Staff have waited patiently for a year, hoping for reasons to trust leadership again, but instead have experienced further secrecy, deeper fear and worsening harm. \"\n\nAndrew Parfitt came under fire earlier this year for being one of five senior executives who spent more than $140,000 on flights, accommodation and food during a trip to the US. (AAP: Bianca De Marchi)\n\nDr Parfitt was not immediately available for an interview but in a statement a university spokesperson questioned the \"integrity\" of the vote.\n\n\"We will always respect and listen to the views of our staff. However, the integrity of the vote itself is in question given complaints from some staff who tried to vote and found that their email address had already been used,\" a university spokesperson said.\n\n\"We have raised these serious concerns with the NTEU.\"\n\nThe NTEU responded to university management in a letter, saying it would correct any \"mistakes\" in the vote.\n\nWhile the vote was run by the NTEU, it was open to all UTS staff, not just NTEU members.\n\nStaff held a rally on Tuesday to announce the vote results amid a year of conflict over the need for job cuts and revelations of expensive executive travel.\n\nHossai Gul says staff have lost confidence in the vice-chancellor because of a lack of transparency and a collapse in democratic academic governance. (Supplied: Hossai Gul)\n\nThe proposed cuts also attracted the attention of state and federal inquiries and regulators, as staff in distress were given stress management advice that included \"washing delicates\".\n\n\"Staff have lost confidence in the vice-chancellor because of a pervasive lack of transparency, a collapse in democratic academic governance, and a year-long process that has caused significant organisational harm,\" Dr Gul said.\n\n\"Instead of reassurance, staff have experienced fear, confusion and exclusion from decisions that define the future of UTS.\"\n\nUniversity sends executives to US as staff face sack The spending on alumni events in May comes as the university says it needs to sack 400 staff to save $100 million.\n\nThe university spokesperson said the NTEU had \"chosen to grandstand\" rather than find \"viable\" solutions to the university's financial challenges.\n\n\"These tactics are in stark contrast to the approach from staff who have engaged in the change process, gave thoughtful ideas and worked constructively to help find solutions,\" the spokesperson said.\n\n\"Their feedback is influencing the outcomes and next steps.\"\n\nMehreen Faruqi says the VC needs to resign. (AAP: Lukas Coch)\n\nGreens deputy leader and higher education spokesperson Mehreen Faruqi, who questioned UTS leaders at a recent Senate inquiry into alleged governance failures, attended the rally and called on the vice-chancellor to resign.\n\n\"Today's no-confidence vote makes one thing undeniable: the people who make this university run no longer trust the people who are supposed to lead it,\" Ms Faruqi said.\n\n\" When staff resoundingly reject you, it's time to go. There is no other option but for the VC to resign. \"\n\nSarah Kaine is leading a separate parliamentary inquiry into university governance. (AAP: Bianca De Marchi)\n\nThat was echoed by NSW upper house Labor MP Sarah Kaine, who is leading a separate state inquiry into university governance and also attended the rally.\n\n\"Given the debacle that has been the change process at UTS, the decent thing to do would be for the VC to resign — remembering that he has been at, or close to the helm, of the university that he claimed was in [financial] crisis,\" Dr Kaine said.\n\n$7 million spent on consultants\n\nThe turmoil at UTS began when management paid consultants KPMG $7 million to design a change management proposal called Operational Sustainability Initiative.\n\nIt proposed about 400 academic and professional staff, or roughly 10 per cent of the workforce, be made redundant and roughly 1,100 subjects be scrapped.\n\n\"UTS is operating under a deeply concerning power structure where major decisions affecting academic governance, finances, job security, teaching and research, are driven centrally by the vice-chancellor, with others expected simply to comply,\" Dr Gul said.\n\nUniversity management says mass sackings unavoidable With the university sector in crisis, thousands face losing their jobs as unions blame poor management and students say they've lost hope.\n\n\"That is not how a public university should be governed. Staff see no credible vision for the future of UTS.\"\n\nThe university spokesperson said the proposal was necessary to \"secure the future of the university\", which was spending more than it earned.\n\n\"The challenges we are facing, and change, is difficult and emotional, especially for a purpose-driven community like ours,\" the spokesperson said.\n\nLast month, the university updated its change proposal and said most academic redundancies would now be voluntary and that some of the 1,100 planned subject cuts would not proceed.\n\nEarlier this year, the university proposed about 400 academic and professional staff be made redundant. (ABC News: Monish Nand)\n\nHowever, staff anger continued to simmer, particularly when a NSW inquiry heard that amid the furore the vice-chancellor was appointed to another five-year term.\n\n\"The handling of the vice-chancellor's contract extension is a key example: over a year ago, his term was extended to seven years, without informing staff, without explaining the decision,\" Dr Gul said.\n\n\"While simultaneously telling us UTS is financially unstable and that jobs must go. That contrast has destroyed any remaining trust.\"\n\nIn a statement, the university said the failure to communicate the extension was an oversight.\n\nMore than 100 courses suspended at Sydney university The University of Technology Sydney is suspending more than 100 courses as it prepares for a controversial redundancy program to save $100 million dollars.\n\n\"In 2024, the UTS Council was mindful of the need for continuity in leadership with the chancellor's term ending in 2025 and proposed extending the vice-chancellor's contract,\" the spokesperson said.\n\n\"It was an oversight that this was not widely communicated at the time.\"\n\nDr Kaine said the current governance arrangements \"do not pass the pub test, let alone any test of good governance\".\n\nUTS said it had increased the representation of staff and students on the council.\n\n\"UTS Council has chosen to increase its representation of elected staff and student members above the minimum to support a strong voice in the constitution of its membership,\" the spokesperson said.\n\n\"UTS also has a student council liaison group.\"",
    "source": "ABC",
    "cluster_id": 6
  },
  {
    "url": "https://www.abc.net.au/news/2025-12-09/remote-kids-social-ban-isolation/106114026",
    "title": "Kids in remote towns say social media ban will make isolation worse",
    "publish_date": "Tue, 09 Dec 2025 01:26:43 +0000",
    "category": "finance",
    "authors": [],
    "text": "As the social media ban for kids edges closer, teenagers in remote and rural communities are worried about becoming even more isolated.\n\nFrom Wednesday, kids under 16 will no longer be able to use popular social media platforms, like Snapchat, Facebook, Instagram, YouTube, TikTok, Reddit, Kick, X and Twitch.\n\nBut for those who aren't always surrounded by kids their own age, socialising may have just become that much harder.\n\nFrankie Andrews, 13, is a state swimming champion and year 7 student enrolled at the Swifts Creek P-12 School.\n\nSwifts Creek is a remote community in Victoria's High Country, almost five hours north-east from Melbourne.\n\nFrankie said the ban coming into place was going to be a big change, and contacting her long-distance friends would not be as easy.\n\n\"I think [the ban] is a good idea and that it should be a thing; but maybe the age should be a bit lower, I reckon like maybe under fourteens,\" Frankie said.\n\n\"Just seeing what happens.\"\n\nShe said social media was something to do for people to fill time, and that it kept them up-to-date.\n\n\"It's going to be bad not being able to contact friends as easily,\" Frankie said.\n\n\" I reckon there'll be a lot of people arguing against it and that it'll still stay a thing, but people are going to find their way around it eventually. \"\n\nSocial media a way to maintain family bonds\n\nLowanna College student Sabrina Glibanovic, 13, has an online community of friends and finds inspiration for her artwork on a range of social media platforms.\n\nThe teenager from Yallourn, a regional town in Victoria's Gippsland area, also uses social media to communicate with her mother's family in Vietnam.\n\n\"I don't think they fully understand how we use it and how young people use it to connect with the world,\" she said.\n\n\" I go on to social media, and I can find images to recreate … I just struggle a bit with creativity, and some other artists do too and they like having the inspiration there, so they can have ideas help them fuel their mind. \"\n\nSabrina said she used Pinterest, Instagram and TikTok to look at different art.\n\nSabrina Glibanovic (back left) uses social media to speak with her family in Vietnam. (Supplied: Sabrina Glibanovic)\n\nShe said her friends were also concerned about the ban.\n\n\"Like all my friends, [social media] is how we communicate to each other and it's how we connect and how we just relate to each other,\" she said.\n\n\"It's going to cut off all my contact with my family from Vietnam.\n\n\"I won't be able to communicate as well with my friends and have that connection through like videos and things.\"\n\nLoading\n\nIsolation impact\n\nWith the school holidays around the corner, Sabrina said it would be harder to make plans with her friends.\n\n\"I probably won't be able to go out as much because I don't think I have a lot of their numbers, and I won't be able to hang out with them anymore,\" she said.\n\n\"I'll just be really isolated as well.\"\n\nSabrina said there were also a lot of learning opportunities on social media.\n\n\"On social media you can learn a lot about how the world works and other worldly problems, and just everything that's happening in the world,\" she said.\n\n\"I know for me, I understand how the rest of the world is, and I've got a lot of that information from social media instead of actually like searching it up, I feel like it's a more fun way of learning than just actually researching.\"\n\nDaswin De Silva says the social media ban is unlikely to stop kids. (Supplied: La Trobe University)\n\nDoubts about ban's effectiveness\n\nThe federal government has put the onus on social media companies to enforce the ban, which comes into effect on December 10.\n\nSocial media companies have announced they will use several methods to verify users' age, including having them upload identification, using AI to scan their face and analysing how they use the platforms.\n\nBut Latrobe University professor of artificial intelligence (AI) and analytics Daswin De Silva told ABC Gippsland Breakfast he doubted whether the ban would be effective.\n\n\"One thing that's clear is that this ban has made kids more innovative and creative thinking outside the box,\" Professor De Silva said.\n\n\" There's been many different methods shared on social platform using a $20 Halloween mask to bypass the facial recognition or a lot of kids moving to new apps that aren't in the ban. \"\n\nHe said the ban would lead to a \"whack-a-mole\" approach where children would move to new platforms as existing platforms were banned.",
    "source": "ABC",
    "cluster_id": 7
  },
  {
    "url": "https://www.abc.net.au/news/2025-12-09/travelling-instrumental-music-teacher-tina-greenfield/106107440",
    "title": "Travelling teacher brings instrumental music to regional schools",
    "publish_date": "Tue, 09 Dec 2025 01:05:00 +0000",
    "category": "finance",
    "authors": [],
    "text": "You can hear Tina Greenfield's classroom from the other side of the school.\n\nIt is not because she has rowdy students; in fact, they work together to quickly unpack their instruments, music stands and chairs as they settle in for band practice.\n\nThere is always a hum of excitement on the days Ms Greenfield comes to town.\n\nThe students also gather for band practice after school. (ABC Wide Bay: Grace Whiteside)\n\nShe travels between five schools in the North Burnett, inland from Bundaberg, teaching instrumental music and sharing her passion with students who would otherwise miss out.\n\n\"Music is for everyone,\" Ms Greenfield said.\n\nShe has been a key part in revitalising the instrumental music program at primary and high schools in the towns of Monto, Mundubbera and Gayndah.\n\nThe program is available to students in year 3 and above. (ABC Wide Bay: Grace Whiteside)\n\n\"When I first started out here at the beginning of the year, I put out a note saying, 'Any children that are interested, we'll get them in,'\" Ms Greenfield said.\n\n\"Everyone has equal opportunity to join the program.\"\n\nAbout 80 students across the five schools are now learning percussion, brass and woodwind instruments.\n\nTina Greenfield teaches 82 students in the North Burnett. (ABC Wide Bay: Grace Whiteside)\n\nEmbraced by students\n\nMs Greenfield said the benefits of music flowed into other classrooms.\n\n\"The biggest thing is we can really help foster teamwork … we are an ensemble-based program, so every single child is part of an ensemble,\" she said.\n\n\"It also helps develop their focus.\n\n\" My job is to help build that relationship with music so that they've always got a healthy output for their emotions. \"\n\nThose life lessons are already being recognised by the students.\n\nThe clarinet is Dusty-Rose Louttit's instrument of choice. (ABC Wide Bay: Grace Whiteside)\n\n\"[For] some people who are nervous of performing, sometimes an instrument can get them out there, make them feel more confident,\" Monto State High School student Dusty-Rose Louttit said.\n\nFellow student Charlotte Dahtler said she was keen to keep playing flute after graduating.\n\n\"I'd like to still do it as a hobby — just as a fun thing to do,\" she said.\n\nCharlotte Dahtler plans to continue playing flute through high school and after graduating. (ABC Wide Bay: Grace Whiteside)\n\n\"It gives you a great experience. It opens you up to different talents that you didn't have before, or you never knew you had.\"\n\nThe program has helped boost music exposure to younger students, such as Joseph Slattery.\n\nJoseph Slattery is enjoying learning percussion. (ABC Wide Bay: Grace Whiteside)\n\n\"I get to play a variety of instruments, and I can learn new stuff,\" he said.\n\n\"I've played bass drum, snare drum, drum kit, xylophone, glockenspiel, claves, tambourine.\"\n\n'Happiness on a plate'\n\nMonto State School principal Troy Jenkins said finding someone with both instrumental skills and a passion for teaching was a unique challenge — especially in a regional area.\n\nTroy Jenkins says the program helps fill a gap in the regional town. (ABC Wide Bay: Grace Whiteside)\n\n\"We had issues around getting staff members to facilitate the program, so for a small period of time we went to a distance ed [education] model,\" he said.\n\nMr Jenkins said Ms Greenfield's teaching was a huge boost to the school community.\n\n\"Our kids don't have a music teacher just down the road that they can access privately,\" he said.\n\n\"[Now] they're able to learn an instrument of their choice, but they're also able to participate in that band element and become immersed in that arts culture.\"\n\nFor Ms Greenfield, seeing her students succeed is \"just happiness on a plate\".\n\n\"Once they get it, it is just like jumping for joy. That is the best part of my career,\" she said.\n\n\" It's the biggest joy that you will ever see. Their faces just light up. \"\n\nTina Greenfield also conducts band practice. (ABC Wide Bay: Grace Whiteside)\n\nTheir success reflects Ms Greenfield's own journey, from shy child to confident teacher.\n\n\"I wouldn't have a conversation with someone unless I had my instrument in my hand and my instrument was my safety net,\" she said.\n\n\"I would never be comfortable sitting down and talking in front of people until it came to playing an instrument — and I could perform in front of everyone.\n\n\" I found my confidence through music. \"",
    "source": "ABC",
    "cluster_id": 8
  },
  {
    "url": "https://www.abc.net.au/news/2025-12-09/ashes-2025-josh-hazelwood-ruled-out-of-series-with-injury/106119372",
    "title": "Aussie quick ruled out for remainder of Ashes in blow to bowling attack",
    "publish_date": "Tue, 09 Dec 2025 01:02:23 +0000",
    "category": "sports",
    "authors": [],
    "text": "Australian fast bowler Josh Hazlewood has been ruled out of the remainder of the Ashes series amid hamstring and Achilles tendon injuries.\n\nInjuries have thwarted the reliable right-arm quick in recent years and had forced him to watch from afar as Australia took a 2-0 series lead at the Gabba last week.\n\nHazlewood had been expected to play some part in the summer until a fresh Achilles issue clouded his availability last week and prevented him from reuniting with the squad in Brisbane.\n\nCoach Andrew McDonald today confirmed he would miss the remainder of the series.\n\nAustralia is out for Ashes domination The snarl on Steve Smith's face proves conclusively that Australia doesn't just want to beat the English in this Ashes series. It wants to break them.\n\n\"He will be out of the series and his preparation will then shift towards the [2026 T20] World Cup, which is an incredibly important campaign for us but unfortunately, Josh won't be a part of the Ashes,\" McDonald said.\n\n\"It's really flat for him. A couple of setbacks we didn't see coming. We thought he'd play a huge part in the series. We really feel for him that he won't get that opportunity.\"\n\nIt comes after Hazlewood missed the entire Test tour of Sri Lanka earlier this year and played only two of a possible five Tests in last summer's home series against India.\n\nHazlewood's absence will likely mean Scott Boland, or possibly Michael Neser, keeps his spot in the XI for the third Test and beyond.\n\nBoland has been the leading understudy for the pace-bowling cartel in recent years but Neser is coming off a five-wicket haul that helped secure victory at the Gabba.\n\nMcDonald flagged captain Pat Cummins' return from a back injury is likely to be the only change to Australia's squad for Adelaide, with Brendan Doggett expected to make way.\n\nConfirmation of the 15-player squad is expected on Wednesday, with batter Usman Khawaja set to feature on return from his back injury.\n\nLoading...\n\nDespite Mitchell Starc's heavy workloads with bat and ball, Australia is expected to play a full-strength bowling attack given a chance to secure a series victory.\n\nPlayers will have had nine full days off in between the end of the Gabba Test and the toss in Adelaide.\n\n\"We wouldn't be thinking about someone needing a rest there, it's probably more so in Test match four and five,\" McDonald said.\n\nMcDonald says there's nothing to patch up with Lyon\n\nNathan Lyon is expected to play a significant role in the attack after bowling only two overs in the first Test and being dropped for the second.\n\nThe veteran off-spinner has taken more Test wickets at Adelaide Oval than any other ground in world cricket.\n\n\"I'll make this a headline: We still do value spin,\" said McDonald, after part-timer Travis Head bowled Australia's only over of spin in Brisbane.\n\n\"That's the first game Nathan's missed in Australia for a long time. Has his impact been as great as previous seasons with the surfaces that we're playing on? Potentially not.\n\n\"(But) I think Nathan's going to have an incredibly huge impact in the last three Test matches if you look to what he did at the MCG last year.\n\n\"When the surface became benign day three onwards, he was able to navigate through a hole.\"\n\nMcDonald insisted there was nothing to patch up with Lyon, who told the Seven Network he was \"absolutely filthy\" about being dropped for the Gabba Test in favour of Neser.\n\n\"I don't think 'patch up' are the right words, that's probably a little bit of an overreaction,\" McDonald said.\n\n\"We just value different things in the pink-ball game and unfortunately that meant that Nathan had to squeeze (out), that's nothing to do with his skill set.\n\n\"For him to be disappointed, I understand that, I get that. I'd be disappointed if he wasn't disappointed.\"\n\nThe ABC of SPORT Sports content to make you think... or allow you not to. A newsletter delivered each Saturday.\n\nAAP",
    "source": "ABC",
    "cluster_id": 9
  },
  {
    "url": "https://www.abc.net.au/news/2025-12-09/canada-traditional-owners-in-australia-to-protest-against-gas/106111960",
    "title": "Canadian traditional owners fear Australian-style LNG development",
    "publish_date": "Tue, 09 Dec 2025 00:29:41 +0000",
    "category": "finance",
    "authors": [],
    "text": "As hereditary chief Na'Moks is driven around Western Australia's Burrup Peninsula, the starkness of the infrastructure stands out in the Murujuga National Park.\n\nA high chief of the Wet'suwet'en nation, he travelled from British Columbia's snowy mountain ranges to see what the West Australian government claimed was successful coexistence between industry and ancient Aboriginal heritage.\n\n\"All I see is people being ignored,\" he said.\n\nWoodside Energy has processed the fossil fuel at two liquefied natural gas (LNG) plants on the peninsula, known by traditional owners as Murujuga, for 40 years, and has permission to do so for another 45.\n\nAt Murujuga, the gas plant sits a stone's throw from World Heritage-listed Aboriginal rock art. (ABC News: Chris Lewis)\n\nIts operations are opposed by environmentalists and some traditional owners, who worry about its proximity to the oldest collection of rock art on Earth, recently inscribed into UNESCO's World Heritage List.\n\n\"[It's] the same type of path Canada's putting itself on where the dollar becomes more important than the human,\" Chief Na'Moks said.\n\nWoodside and the West Australian government maintain there is no conclusive evidence about what impact industrial emissions are having on the Murujuga rock engravings.\n\nCanadian govt backing LNG\n\nCanada is only now starting to develop an LNG export industry, targeting the large volumes of shale gas contained within British Columbia's Montney formation.\n\nBut like in Australia, gas development has divided the region's traditional owners.\n\n\"Over the last 25 years in our homelands we have fended off upwards of 17 pipeline proposals and projects … until around 2019 and 2020,\" Gitxsan nation man Gwii Lok'im Gibuu Jesse Stoeppler said.\n\nChief Na'Moks was taken to the Karratha Gas Plant by Raelene Cooper. (ABC News: Charlie Mclean)\n\nThat project was Shell's LNG Canada facility, which shipped its first cargo in June.\n\nNow a second LNG facility is being proposed for British Columbia, called Ksi Lisims.\n\nIt is being driven by a consortium of gas companies — including Woodside — and the Nisga'a Nation, which owns the coastal lands where the facility would be built.\n\nIts proponents say it will bring social benefits and jobs to Indigenous Nations and other nearby communities.\n\nBut a 900-kilometre pipeline would need to be built to bring the gas in, slicing through other Indigenous nations' lands, including Mr Stoeppler's, who have not consented to the project.\n\n'Dangerous' times\n\nThe Canadian government is desperate to boost the economy with more mining and infrastructure projects as the country continues to wrestle with the Trump administration's unpredictable tariff policies.\n\nKsi Lisims was recently referred to the Major Projects Office, a new department created to speed up approvals for projects deemed to be of national interest.\n\nThe idea mirrors the West Australian Labor government's State Development Bill, which Premier Roger Cook wants passed through parliament before the end of the year.\n\nThe premier has made no secret of his desire to cut red tape for industry, telling a recent audience of business leaders he had \"a little bit of industrial FOMO\".\n\n\"An obsession with big shiny job-creating projects, an insatiable desire for even faster approvals,\" Mr Cook said.\n\nGwii Lok'im Gibuu Jesse Stoeppler has been fending off gas developments slated for his homelands for years. (ABC News: Charlie Mclean)\n\nMr Stoeppler said he believed it was a dangerous time for the rights of Indigenous peoples across the western world.\n\n\"It is dangerous when elected bodies of government seemingly create interest or appetite where there is none on a local landscape,\" he said.\n\n\" What I'm seeing here with some of these projects is usually they come at the cost of Indigenous people and I take big issue with that. \"\n\nMurujuga traditional custodian Raelene Cooper, who guided chief Na'Moks and Mr Stoeppler around Murujuga, said she was saddened to see other traditional owners go through the same ordeal as her people.\n\nRaelene Cooper has campaigned against industrial development at Murujuga. (ABC News: Charlie Mclean)\n\n\"We shared the very same stories, you know, of the concerns, the betrayal from our governments,\" she said.\n\n\"Those individuals who are supposed to be speaking on behalf of us are basically opening the door and bringing us to the slaughter.\"\n\nA final investment decision for the Ksi Lisims project is expected early next year.\n\nLong-term coexistence\n\nA Woodside spokesperson said the company had operated on Murujuga for more than 40 years and took its commitment to managing and protecting cultural heritage in the area seriously.\n\n\"Our support for World Heritage listing of the Burrup Peninsula reflects the successful and long-term coexistence of heritage and industry,\" the spokesperson said.\n\n\"We actively engage with traditional custodians on the management of cultural heritage at our sites, including through heritage surveys, annual audits of heritage places and on-country visits.\n\n\"In consultation with traditional custodians, we develop and implement cultural heritage management plans to ensure the heritage values of the area are protected as far as practicable and in line with the requirements of applicable approvals and relevant laws.\n\n\"We believe long-term coexistence between cultural heritage and industry is possible when guided by credible science, traditional custodian leadership and genuine collaboration.\"",
    "source": "ABC",
    "cluster_id": 10
  },
  {
    "url": "https://www.abc.net.au/news/2025-12-09/triple-zero-outage-senate-hearing-tpg-telecom-second-death-link/106118690",
    "title": "TPG Telecom links second death to Triple Zero failure",
    "publish_date": "Tue, 09 Dec 2025 00:21:25 +0000",
    "category": "finance",
    "authors": [],
    "text": "TPG says a second death may be linked to a customer being unable to contact Triple Zero (000), as telco bosses face a Senate hearing in Canberra.\n\nTPG Telecom chief executive Iñaki Berroeta revealed another possible death linked to a customer's inability to call Triple Zero on their Samsung mobile phone.\n\nIt follows the death of a TPG customer in Sydney in November, after outdated software blocked a Samsung phone from making Triple Zero calls.\n\nOn Tuesday, Mr Berroeta told the parliamentary hearing that another incident occurred on September 24, at Wentworth Falls in NSW's Blue Mountains, and TPG was made aware of it on Monday of this week when informed by Telstra.\n\n\"What we know … is … the customer was calling Triple Zero on that device, it did not work, the device was not compatible with the 4G calling emergency service,\" he said.\n\n\"And then five minutes later, that device was able to reach emergency services through an alternative means.\"\n\nThe alternative means was believed to be the National Relay Service, a 1800 number.\n\n\"Yesterday we were told that the call might have been made in connection to someone who has passed away,\" Mr Berroeta said.\n\nIn November, TPG confirmed a customer in Sydney had died after a mobile phone could not make Triple Zero calls.\n\nAt the time, the telco said early investigations indicated the failed calls were due to a Samsung device operating on software that was not compatible with making Triple Zero calls on the network.\n\nIñaki Berroeta says he was informed of a second death linked to a Triple Zero failure on Monday. (AAP: Paul Miller)\n\nTPG operates the Vodafone brand, alongside internet providers TPG and iiNet.\n\n'We don't blame the end user at all here'\n\nMr Berroeta told the Senate hearing TPG had identified tens of thousands of mobile phones that would need software updates in order to make emergency calls, which now requires 4G technology.\n\nWhen asked why the necessary software updates were not automatic, Mr Berroeta said they were, but \"it requires the customer to accept\".\n\n\"We don't blame the end user at all here,\" Mr Berroeta later said.\n\nSome Samsung phones unable to make triple-0 calls Some Samsung mobile phone users may be unable to call triple-0 in an emergency after Telstra announced testing had revealed more than 70 models were not connecting correctly.\n\nTPG has sent messages via text, email and calls to customers whose devices need to be updated in order to access Triple Zero.\n\nMr Berroeta confirmed that included the customers whose deaths, in September and November, were believed to be linked to the telco.\n\nAdditionally, thousands of customers have phones that would never be able to make emergency calls via 4G and needed to be replaced in order to connect to Triple Zero.\n\nCustomers have been warned their phones will be blocked by TPG if they do not take action, while thousands of older models have already been blocked.\n\nThe ABC revealed in October that mobile phone testing by Telstra had identified more than 70 Samsung models that were unable to call Triple Zero on the Vodafone network when the Telstra and Optus networks were unavailable.\n\n\"Good customer relations would be to give these people a new phone now,\" Greens senator Sarah Hanson-Young put to Mr Berroeta.\n\n\"You're a big company, you make massive profits, making sure your customers have access to have a phone that can call Triple Zero should be a priority.\"\n\n\"It is a priority for us,\" Mr Berroeta replied. He told the hearing that around 500 customers had taken up the offer to replace their phones.\n\nExecutives from Nokia, Ericsson, Telstra, Samsung and consumer advocacy groups will also face questions at the hearings in Canberra.\n\nThe telcos have faced scrutiny in recent months after several deaths were linked to a widespread Optus outage in September, which revealed shocking failings across the sector.",
    "source": "ABC",
    "cluster_id": 2
  },
  {
    "url": "https://www.abc.net.au/news/2025-12-09/fifa-2026-world-cup-water-breaks-to-be-scheduled-for-all-games/106118696",
    "title": "FIFA confirms all 2026 World Cup games will include two water breaks",
    "publish_date": "Mon, 08 Dec 2025 23:00:49 +0000",
    "category": "sports",
    "authors": [],
    "text": "FIFA says it will include three-minute hydration breaks in each half of every game at next year's World Cup, not just those played in hot weather.\n\nThe referee will stop the game 22 minutes into each half for players to take drinks, regardless of the temperature, the host country — the United States, Canada or Mexico — or whether the stadium has a roof and air conditioning.\n\nThe change may also be a hit with broadcasters, since it makes the game schedule more predictable and opens up more opportunities for advertisements.\n\nFIFA said it was first announced when the governing body's chief tournament officer for the 2026 World Cup, Manolo Zubiria, attended a meeting with broadcasters.\n\nSocceroos based on west coast for World Cup Australia's North American west coast adventure at the World Cup is confirmed, with matches in Vancouver, Seattle and Santa Clara in California.\n\nHe indicated that referees may have some flexibility if there was a stoppage shortly before the 22-minute mark for an injury.\n\n\"This will be addressed on the spot with the referee,\" Zubiria said.\n\nFIFA said the move was a \"streamlined and simplified version\" of an earlier practice of having breaks after 30 minutes over a certain temperature threshold, once set at 32 degrees Celsius on the wet bulb global temperature system.\n\nThe change comes after heat and humidity affected players during some games at this year's Club World Cup in the US.\n\nAt that tournament, FIFA reacted by lowering the threshold for cooling or water breaks and also placing more water and towels around the edge of the field.\n\nHeat has long been an issue at major soccer tournaments. Amid concerns ahead of the 2014 World Cup, a Brazilian court ordered FIFA to make its recommended breaks mandatory or face fines.\n\nThe ABC of SPORT Sports content to make you think... or allow you not to. A newsletter delivered each Saturday.\n\nAP",
    "source": "ABC",
    "cluster_id": 11
  },
  {
    "url": "https://www.abc.net.au/news/2025-12-09/wa-regional-air-travel-fare-cap-changes-anger-residents/106081870",
    "title": "Isolated families furious over WA's regional flight cap changes",
    "publish_date": "Mon, 08 Dec 2025 22:30:57 +0000",
    "category": "finance",
    "authors": [],
    "text": "Regional West Australians say the government's increased airfare caps during peak flight periods will unfairly isolate them.\n\nThe state government introduced a scheme in 2022 that capped fares for one-way trips to Perth within 1,000 kilometres at $199, and $299 for flights longer than that distance.\n\nPrior to the scheme, regional residents — particularly in the Pilbara and Kimberley — would often pay more than $1,000 for one-way trips to Perth.\n\nBut from July 1 next year, the capped fares will increase during \"high-demand\" periods, and remain the same for \"low-demand\" periods.\n\nDuring high-demand periods, one-way flights to airports less than 1,000 kilometres from Perth will be capped at $265, while those further away will increase to $385.\n\nFamilies 'locked out'\n\nThe $385 cost per flight during peak periods will affect those in WA's northern regional towns, including Karratha, Broome, Exmouth, Kununurra, Newman, Paraburdoo and Port Hedland.\n\nKarratha mother of three Kirsty Freeman said busy periods such as school holidays were the only time her family could visit her Adelaide-based family and friends.\n\nKirsty and Karl Freeman have children who have appointments in Perth. (ABC Pilbara: Mietta Adams)\n\nThe raised peak-period cap will see her family pay an extra $860 to fly to and from Perth, with a total cost of $3,850.\n\n\"My friends and family can't afford to come and visit us up here,\" Ms Freeman said.\n\n'We're basically isolated in this town.\"\n\nShe said the changes meant her family would now drive 16 hours to the city to catch a flight to Adelaide.\n\n\"It's really scary for us financially,\" Ms Freeman said.\n\nShe said her teenage children needed braces, which could only be fitted and removed in Perth.\n\nA rally opposing increases to subsidised regional airfares was held in Karratha last month. (ABC Pilbara: Mietta Adams)\n\nWA's Patient Assisted Travel Scheme (PATS) subsidises the costs of accessing medical services that are not available locally, but allied health and dental treatments are not included in the scheme.\n\n\"Just having the procedure is expensive, but then adding on flights and accommodation to get those things done as well is a little bit daunting,\" Ms Freeman said.\n\n\"People think because we're in a mining town that we're all just made of money, and that's definitely not how it is.\"\n\nJo Camilleri says families with children at boarding schools will be affected. (Supplied)\n\nConcerns for boarders\n\nKimberley parent and Isolated Children's Parents' Association member Jo Camilleri said the changes were \"worrying\", especially for students who were studying away from home.\n\n\"It's during the peak season we need the cap more,\" she said.\n\n\"It's during school holidays that kids are flying home and that's why we really needed it in the first place.\n\n\"If anything, you'd hope the cap was in place for [busy periods] rather than the reverse.\"\n\nMs Camilleri was concerned the price changes would most affect families living in remote towns like Halls Creek and Fitzroy Crossing, who also have to travel long distances just to get to an airport.\n\n\"It just gets further and further out of reach for families … the more remote people get, the more difficult this becomes,\" she said.\n\nKim Simpson says the cap increase is \"garbage\". (ABC Pilbara: Mietta Adams)\n\nKim Simpson organised a petition against increased subsidised fare caps and has so far collected more than 6,000 signatures.\n\nShe described the changes as \"garbage\".\n\nShe said while it was \"fantastic\" the cap was kept, the subsidised flights were already too expensive.\n\n\"I've flown to Perth three times in the past month and I've spent close to $3,000,\" she said.\n\n\"We are still going to keep on with the petition … we can still fight for these cheaper fares,\" she said.\n\nHigh-demand period remains vague\n\nPremier Roger Cook said the cap increase was necessary to keep the scheme sustainable and to meet the difference between airline prices in peak periods.\n\nRoger Cook says the government and airlines will decide what is considered a \"peak period\". (ABC Pilbara: Kimberley Putland)\n\n\"We want to reward those people who are looking to travel in times of low demand,\" he said.\n\n\"But for last-minute bookings or for high peak demands, the subsidy isn't as high.\"\n\n\"This is better than pre-2022, when they [regional families] would have paid literally thousands.\"\n\nDeciding what is considered \"peak period\" will be an arrangement between the government and the airlines, he said.\n\n'We will work closely with airlines to ensure that they bring the right approach, the right attitude to this,\" Mr Cook said.\n\nThe state government said that for the first time, airlines could choose to offer capped fares that were cheaper than the set maximums.\n\nMr Cook said the scheme would continue until June 2031 before it would be reviewed again.",
    "source": "ABC",
    "cluster_id": 12
  },
  {
    "url": "https://www.abc.net.au/news/2025-12-09/ashes-2025-jake-weatherald-and-ben-stokes-caught-up-in-sledging/106118556",
    "title": "'Finally rocked up': Weatherald and Stokes caught up in Ashes sledging",
    "publish_date": "Mon, 08 Dec 2025 22:27:20 +0000",
    "category": "sports",
    "authors": [],
    "text": "Ben Stokes and Jake Weatherald have been caught sledging each other during the heated conclusion of the second Ashes Test in Brisbane.\n\nThe verbal back and forth came after English quick Jofra Archer and Australian batting star Steve Smith traded barbs as Australia went 2-0 up in the five Test Ashes series.\n\nWith only a handful of runs to make to claim victory, Smith went for his shots to end the match quickly, scoring 23 runs from just nine balls.\n\nSmith's cavalier attitude earned an odd rebuke from Archer, who had struggled with the pink ball throughout the Test.\n\n\"You like to play shots when there's not much on the scoreboard,\" Archer, who is yet to dimiss Smith in a Test, said.\n\n\"You bowl fast when there's nothing going on, champion,\" Smith replied, after Archer bowled his fastest spell of the tour so far.\n\nAfter the incident, Archer briefly turned his attention to Weatherald at the other end but it wasn't clear if he said anything to the rookie opener.\n\n\"Spit it out if you're going to say something,\" Weatherald appeared to say to Archer.\n\nLoading...\n\n\"Finally rocked up.\"\n\nWeatherald's response caught the attention of English skipper Stokes, who referenced the runs the newcomer made in the first innings having struggled in the first Test in Perth.\n\n\"You got 70 and started chatting,\" Stokes said.\n\n\"I was only saying something because you were saying something now,\" Weatherald responded.\n\nAustralia is out for Ashes domination The snarl on Steve Smith's face proves conclusively that Australia doesn't just want to beat the English in this Ashes series. It wants to break them.\n\n\"I say it with a smile my face though, Jake,\" Stokes said.\n\nWhile sledging is a common part of the game, the heated end to the Brisbane Test is bound to create tension ahead of the start of the third Test in Adelaide on December 17.\n\nThe English squad has travelled to Noosa for a break before the third Test, as England's second team lost badly to Australia A at Allan Border Field in Brisbane, highlighting the nation's current lack of depth.\n\n\"I actually felt like we over-prepared to be honest,\" McCullum said after the second Test.\n\n\"I think sometimes when you're in the heat of the battle, as we all know, sometimes the most important thing is to feel a bit fresh.\"",
    "source": "ABC",
    "cluster_id": 13
  },
  {
    "url": "https://www.abc.net.au/news/2025-12-09/wa-food-ambassador-demersal-fishing-ban/106109474",
    "title": "Chef highlights alternative fish species ahead of demersal ban",
    "publish_date": "Mon, 08 Dec 2025 21:32:46 +0000",
    "category": "finance",
    "authors": [],
    "text": "The West Australian food ambassador says the fishing industry should take the lead on education as consumers search for local alternatives in the wake of major changes to fishing rules.\n\nLast week the WA government announced a plan to slash demersal catch limits and shut down some fisheries to save species on the brink of extinction.\n\nThat was followed by warnings from fishers and the food service industry that the new rules could make it harder for the public to source locally caught fish or find them on restaurant menus.\n\nDhufish will be difficult to find at restaurants from next month. (ABC News: Chris Lewis)\n\nAffordable, healthy alternatives\n\nMany chefs and cooks across the state will be rethinking their shopping lists and menus before the ban comes into effect later this month.\n\nWhat are demersal fish? Demersal scalefish are long-living, slow-growing fish species that live and feed near the seabed. Popular demersal fish in WA waters include dhufish, pink snapper and red emperor.\n\nChef Don Hancey, who has been appointed WA's food ambassador to promote local produce, said he felt for the fishers impacted by the changes, particularly generational family businesses.\n\nHe suggested those planning new menus consider the \"underutilised species\" found in WA waters.\n\n\"We've got beautiful herring, we've got mullet, we've got the sardines from Freo and down south, we've also got the Australian salmon,\" Mr Hancey said.\n\n\"So there's great opportunities to make something simple, like fish cakes, that are super affordable.\n\n\"There are alternatives, but there needs to be a push now to educate people that using these underutilised species is not only good for the pocket, but good for your health.\"\n\nMr Hancey believes Australian salmon is an \"under-utilised\" species. (Supplied: Louise FitzRoy)\n\nIndustry-led showcase\n\nMr Hancey anticipated it would take time for the public to change culinary habits, but believed industry showcases could expedite the process.\n\n\"It needs WAFIC [Western Australian Fishing Industry Council] and other organisations like FRDC [Fisheries Research and Development Corporation] to really start showcasing these species to the general public and chefs to increase their knowledge,\" he said.\n\nMr Hancey said a herring dish at his former restaurant in Yallingup had been a popular addition to the menu.\n\n\"One of the biggest sellers on the breakfast menu was herring, pan-fried, lots of lemon juice, little bit of butter, and some chopped parsley served on a sourdough toast,\" he said.\n\n\" It's not only tasty and economical, but it is so, so healthy for you. \"\n\nAs a pelagic species of fish, herring are unaffected by the rule changes. (Supplied: Shannon Conway)\n\nAdapting with consumer tastes\n\nAlbany commercial fisher Tony Westerberg said he was in \"disbelief\" when he heard of the changes that would affect his industry peers.\n\n\"Fish stocks are ailing but what they've done is ridiculous,\" he said.\n\nMr Westerberg's business is focused on pelagic species — catching sardines, herring and salmon.\n\nCommercial fisherman and seafood wholesaler Tony Westerberg expects demand will change. (ABC Great Southern: Georgia Hargreaves)\n\nHe said one challenge with herring was an aversion to \"strong\" flavours among younger consumers.\n\n\"It's normally fairly strong-tasting and not many younger people like the oiliness of the fish,\" Mr Westerberg said.\n\n\"So we've done the herring in a way which is deep skinning, and there's no traditional herring flavour … it's still got all the goodness in there.\"\n\nHe expects demand to slowly shift after the changes come into effect on December 16.",
    "source": "ABC",
    "cluster_id": 14
  },
  {
    "url": "https://www.abc.net.au/news/2025-12-09/jaraka-anthony-matt-graham-claim-moguls-gold/106118416",
    "title": "'How the hell does this happen?' Double skiing gold for 'beach nation' Aussies",
    "publish_date": "Mon, 08 Dec 2025 21:32:34 +0000",
    "category": "sports",
    "authors": [],
    "text": "Australia's moguls skiers have got their Winter Olympic season up and running with a superb double gold in the FIS World Cup event in Ruka, Finland.\n\nDefending Olympic champion Jakara Anthony and 2018 Olympic silver medallist Matt Graham both claimed victories on the Battery Course in the Finnish resort on Monday night.\n\nIt is Anthony's first World Cup gold in 12 months after missing most of last season with a broken collar bone.\n\n\"It's pretty special,\" she told FIS.com.\n\n\"It's probably nearly a year to the day of getting injured. I've been out since then, so this is a pretty special one.\"\n\nAnthony made the final of the season opener in tough, icy conditions the day prior after qualifying third, but was unable to complete her run, perhaps a little rusty after watching from afar for the past 12 months.\n\n\"Yesterday was a bummer,\" she said.\n\n\"I just didn't quite nail that last one.\n\n\"To get redemption tonight is pretty special. It's been a while since I skied a comp, so I had to remember that and make those adjustments tonight.\"\n\nAmerican pair Olivia Giaccio and last year's World Cup winner Jaelen Kauf claimed the other two podium positions.\n\nThe victory is the 27-year-old's 24th World Cup gold.\n\nAustralians Charlotte Wilson (13th) and Emma Bosco (20th) also competed.\n\nMeanwhile, Graham claimed his first victory in a World Cup since Deer Valley in the 2022/23 season, nailing a superb run as last skier to compete.\n\n\"It's good to be putting down really good runs. The course was challenging, but really fun, and I'm just enjoying it,\" he said.\n\n\"To get a double gold with Jakara — it's massive. We're not a skiing nation. We're a beach nation, so how the hell does this happen?\"\n\nFellow Australian Harvey Jackson (18th) also competed, with Cooper Woods and George Murphy both failing to complete the course in what remained tough conditions.\n\nGraham, 31, has had a superb start to the season, claiming fourth place in the season opener on the same course on Sunday.\n\nIt is the third time in history that Australia has claimed gold medals in both men's and women's events on the same day.\n\nVeteran skier Graham has been a part of all three.\n\nThere was disappointment for the aerial skiers though, with Australia missing having a skier on the podium for the first time in a World Cup event since January 2023.\n\nAirleigh Frigo (6th), Laura Peel (10th), Danielle Scott (13th) and Abbey Willcox (14th) all competed in the women's event, with Riley Flanagan (19th) in the men's.\n\nThe next two moguls events on the calendar in Sweden and Georgia have been cancelled, so the moguls skiers will take a break and resume competition in the new year at Val Saint-Come in Canada.\n\nThe Winter Olympic Games competition gets underway in Livigno on February 10.\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.",
    "source": "ABC",
    "cluster_id": 15
  },
  {
    "url": "https://www.abc.net.au/news/2025-12-09/the-australian-christmas-carols-that-should-be-on-your-playlist/106105838",
    "title": "Australian carols that are perfect for celebrating Christmas in the sun",
    "publish_date": "Mon, 08 Dec 2025 21:00:00 +0000",
    "category": "finance",
    "authors": [],
    "text": "Are you stuck listening to Let It Snow while figuring out how to crank your aircon?\n\nMost Australians can't have chestnuts roasting on an open fire because there's usually a fire ban in December.\n\n\"Even my favourite carol line of all time, 'let steeple bells be swungen' is a little off for an Aussie summer,\" says Vanessa Hughes, the presenter of ABC Classic Drive.\n\nChristmas Crackers Turn up the volume for the holiday season with a curated selection of Christmas favourites from ABC Classic.\n\n\"Let pints in pubs be drunken\" seems more apt for Christmas here,\" she says.\n\nBut fear not.\n\nFrom Carol of the Birds to Christmas in the Sun, Australian composers have been coming up with seasonally appropriate Christmas carols for decades.\n\n\"This year's Classic Choir song, Christmas in the Sun, perfectly captures our antipodean holiday vibes,\" Hughes says.\n\nThese carols won't give you brain freeze from dreaming of a white Christmas.\n\nClassic Australian Christmas carols\n\nIf you've heard any Australian Christmas carols or sung them at school, there's a good chance they're by William G James.\n\nHe composed three books of Australian Christmas carols.\n\nOne of James's most famous carols is Carol of the Birds, sometimes called Orana based on the words of the chorus.\n\nJames had the Australian answer to Northern Hemisphere carols.\n\nThe Three Drovers, the Australian stand-in for shepherds, ride across the plain when the air is thick with summer heat and smoke is on the yellow moon.\n\nTalking about Australian sky, The Silver Star, which has a lovely treble solo, is another famous tune by James.\n\nLoading...\n\nJames was a longtime music director at the ABC.\n\nMany of his tunes were published during his tenure and found their way into songbooks for primary schools in the 50s and 60s.\n\nA summer celebration\n\nMore recently, ABC Classic has been expanding Australian Christmas carol collections with the Classic Choir songbook.\n\nIf you grew up here, or have lived in Australia for some time, you know that Christmas falls in the summer.\n\nWe mark the season of sunshine by trying to stay cool, spending time with family and eating.\n\nMany Australian Christmas carols immortalise these moments.\n\nIn 2020, when the COVID-19 lockdowns restricted our ability to sing or be with our loved ones, ABC Classic launched the virtual Classic Choir.\n\nDeborah Cheetham Fraillon wrote Christmas With You, and 1,500 people submitted videos of themselves singing the song.\n\nLoading...\n\nIn 2023, Gardening Australia host Clarence Slockee wrote new words for the classic, Oh Christmas Tree, honouring First Nations languages around Australia.\n\nThis Australian take of Oh Christmas Tree (Yerrbill with Clarence), was arranged by Joseph Twist.\n\nLoading...\n\nOther carols include Katie Noonan's All is Love, Elena Kats-Chernin's quintessential Summer Together and another addition from Cheetham Fraillon: The Christmas Card.\n\nAfter launching five successful carols, the Classic Choir project wraps up in 2025 with Joseph Twist's brand new carol: Christmas in the Sun.\n\nThe carol will be premiered on December 14 by the Sydney Philharmonia Choirs at the Sydney Opera House, and broadcast live on ABC Classic at 2pm.\n\nAussie Christmas in pop culture\n\nOver the years, Australian artists have written some Christmas hits which now reside deep in our collective psyche.\n\nComedy duo Colin Buchanan and Greg Champion, performing as Bucko & Champs, have adapted familiar Christmas jingles in an Australian context.\n\nMost people would probably assign ultimate Christmas classic status to Paul Kelly's 1996 ballad How To Make Gravy, about a man called Joe who writes a letter home from prison.\n\nLoading...\n\nThe song became a movie in 2024, and earlier this year Kelly released Rita Wrote a Letter, which details what happens when Joe is released.\n\nOther artists might not be as dramatic as Joe's family but, as we all know, Christmas can be difficult for some.\n\nStella Donnelly's Seasons Greetings explores this family tension when an estranged relative turns up.\n\nThe history of the estrangement is first revealed through what they did with the gravy, and from there tension mounted until insults are hurled.\n\nAustralians love our summertime Christmas with its glorious sunshine, surf and stars.\n\nChristine Anu's Island Christmas captures all of these tropical beauties with a powerful love letter filled with colours, laughter and music.\n\nGet the latest classical music stories direct to your inbox",
    "source": "ABC",
    "cluster_id": 16
  },
  {
    "url": "https://www.smh.com.au/national/graham-richardson-state-funeral-live-updates-prime-minister-labor-heavyweights-farewell-late-political-kingmaker-in-sydney-20251209-p5nm25.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Graham Richardson state funeral LIVE updates: Prime minister delivers eulogy as Labor heavyweights farewell late political kingmaker",
    "publish_date": "Tue, 09 Dec 2025 12:59:29 +1100",
    "category": "finance",
    "authors": [
      "Angus Dalton"
    ],
    "text": "“Those who knew Dad, no matter their background, shared a deep admiration for his wit, humour, principles and policy achievements,” Graham Richardson’s son D’Arcy, who just finished his HSC, has told those gathered.\n\n“Mum and I had the immense honour of being invited by the Prime Minister and the Speaker of the House to sit on the floor of Parliament to hear the testimonies from his condolence motion during Parliament’s last sitting week.\n\nAmanda and D’Arcy Richardson speak. Credit: James Brickwood\n\n“What struck me most was the number of MPs who came up to talk about the ways dad helped them in their careers. I had no idea the different ways dad touched those in Parliament throughout their lives, contributing to the great work they’re doing representing their communities.”\n\nHe said being a great dad was Richardson’s greatest legacy.\n\nWhile several speakers spoke highly of D’Arcy, there has been scant mention of Richardson’s two children from his previous marriage to Cheryl Gardner, Matthew and Kate.",
    "source": "SMH",
    "cluster_id": 17
  },
  {
    "url": "https://www.smh.com.au/national/victoria/gp-caught-up-in-niddrie-fatal-crash-vows-to-rebuild-as-floral-tributes-grow-20251209-p5nm0f.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "‘I saw my patient fly to the ceiling’: GP caught up in Niddrie fatal crash vows to rebuild",
    "publish_date": "Tue, 09 Dec 2025 12:52:27 +1100",
    "category": "finance",
    "authors": [
      "Alexander Darling"
    ],
    "text": "Dr Rafid Hamdan was consulting a patient - one of hundreds, if not thousands, in his decades-long career - when everything changed.\n\nHe turned briefly to his computer, and then a huge explosion filled the room.\n\nGeraldine Maguire, right, lays a floral tribute at the Niddrie practice where a fatal car crash occurred on Monday, December 8. Credit: Eddie Jim\n\n“I heard my receptionist scream, and suddenly I just saw my patient fly to the ceiling,” he said.\n\n“Then everything collapsed in the room.”",
    "source": "SMH",
    "cluster_id": 18
  },
  {
    "url": "https://www.smh.com.au/politics/federal/wells-left-car-waiting-for-hours-at-nrl-grand-final-costing-more-than-1200-20251209-p5nm0i.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Wells left car waiting for hours at NRL grand final, costing more than $1200",
    "publish_date": "Tue, 09 Dec 2025 12:44:43 +1100",
    "category": "finance",
    "authors": [
      "James Massola",
      "Brittany Busch",
      "Nigel Gladstone"
    ],
    "text": "Farrell charges for hundreds of family flights Farrell charged taxpayers more than $116,000 for family travel since 2022, according to Independent Parliamentary Expenses Authority data. This includes flying a family member to Uluru, where he had been gifted tickets to a Wintjiri Wiru Sunset Dinner in August 2024. The flights that coincided with the dinner cost $2093.65 for a return trip from Adelaide to Uluru via Sydney. Other family travel matched dates that Farrell had been gifted tickets, including return flights for a family member to Sydney, costing $1385.21, at the same time as opera La Boheme at the Sydney Opera House. Farrell had been given a double pass and hospitality, according to his register of interests. Minister for Trade and Tourism, and Special Minister of State Don Farrell. Credit: Alex Ellinghausen Farrell defended the expenses, saying they were within the guidelines and that the rules allowed for carers and single parents to become politicians.\n\n“The family reunion provisions are an important feature of our framework, allowing a diverse range of members and senators to represent their communities in our nation’s parliament,” he said in a statement.\n\n\n\n“Our parliament would be a lesser place if it weren’t for the mechanisms that allow young mothers, single parents, those with families, and those with caring responsibilities to serve as elected members.” Loading Minister for Home Affairs Tony Burke, in 2020, repaid the cost of flights for his family to join him on a trip to Uluru in 2012 because, while within the rules, he said the expenses “did not meet community expectations”. Under the family reunion rules, federal MPs are allowed up to three return business class flights per year for family members flying between the MP’s home base and a city other than Canberra, and the value of nine business class flights to Canberra, though there is some flexibility to the rules that allows ministers to claim more. Coalition MP calls for Wells to resign as minister\n\nWells has defended the flights and expenses as within the rules, but has endured ongoing criticism for the nature of her trips and a lack of judgment in flying her children and husband to Thredbo for a ski trip, and billing taxpayers thousands to fly her husband to three AFL grand finals and two Boxing Day Test matches. On most occasions, her husband flew home to Brisbane on the same day. Wells’ expenses first came under scrutiny last Wednesday when it was revealed in an answer to a Senate estimates committee that she billed taxpayers almost $100,000 to fly herself, a staffer and a public servant to New York in September for the United Nations General Assembly. Nationals senator Matt Canavan on Tuesday called for Wells to resign because though she may not have broken any rules, there was a pattern of misjudgment that did not meet community expectations. Family reunion travel rules The obligations of MPs when determining whether they can claim family reunion expenses. Dominant purpose: Under family reunion rules, an MP’s family can accompany or join them at Commonwealth expense while they are conducting parliamentary business. Travel must be for the “dominant purpose” of facilitating the family life of the parliamentarian.\n\nUnder family reunion rules, an MP’s family can accompany or join them at Commonwealth expense while they are conducting parliamentary business. Travel must be for the “dominant purpose” of facilitating the family life of the parliamentarian. Value for money: MPs are required to use public resources for parliamentary business in a way that achieves value for money. MPs can have family members travel to Canberra under a cost-based limit per year, and can claim up to three return business-class airfares for family to travel elsewhere in Australia.\n\nMPs are required to use public resources for parliamentary business in a way that achieves value for money. MPs can have family members travel to Canberra under a cost-based limit per year, and can claim up to three return business-class airfares for family to travel elsewhere in Australia. Good faith: MPs need to act ethically and in good faith when using, or accounting for, public resources. They must not seek to disguise personal or commercial business as parliamentary business.\n\nMPs need to act ethically and in good faith when using, or accounting for, public resources. They must not seek to disguise personal or commercial business as parliamentary business. Personal responsibility and accountability: An MP is personally responsible and accountable for their use of public resources and should consider how the public would perceive their use of these resources.\n\nAn MP is personally responsible and accountable for their use of public resources and should consider how the public would perceive their use of these resources. Conditions: An MP must not make a claim, or incur an expense, in relation to a public resource if they have not met all of the conditions for its provision. “I think there’s too many yellow cards here from Anika Wells. I think she needs to be shown a red,” he told Sky News.\n\nCanavan said getting a Comcar to wait seven hours at the tennis was “ridiculous”, and other ministers had been forced out of parliamentary positions for less, including former Speaker Bronwyn Bishop and Opposition Leader Sussan Ley. “You’re spending other people’s money, not your own. So I don’t think Anika Wells, as a minister of the crown, has shown any care and diligence here to make sure her spending ... meets that value for money test,” Canavan said. “The question now is to the prime minister, what standards do you have? Do you apply any discipline to your ministers to pay a price if they’re not seen to be spending money in a value sense?” This masthead revealed on Monday that Wells charged taxpayers almost $1000 to have a government-funded Comcar wait seven hours for her while she attended the Australian Open tennis final in January 2023, and the Australian Financial Review reported on Tuesday she claimed another $765 for a chauffeur-driven car while attending the Magic Millions Race Day on the Gold Coast in January 2024. Coalition figures have challenged the government’s response, saying the travel was outside what Australians expect.\n\n“Whether things are in the guidelines or not, it’s always up to the individual parliamentarian to justify his or her expenses. That’s always been the case,” shadow treasurer Ted O’Brien told ABC Radio National. Loading He called the judgment of Wells and the prime minister into question for claiming the expenses were appropriate during a cost-of-living crisis. “What we see here is the prime minister defending a minister who is spending money that is hard to justify in the public eye,” O’Brien said. “Saying that this level of spending is fine – that goes to his judgment.”",
    "source": "SMH",
    "cluster_id": 19
  },
  {
    "url": "https://www.smh.com.au/lifestyle/love-actually-musical-parody-pokes-fun-at-iconic-christmas-movie-20251209-p5nm0n.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Love Actually musical parody pokes fun at iconic Christmas movie",
    "publish_date": "Tue, 09 Dec 2025 12:38:57 +1100",
    "category": "lifestyle",
    "authors": [],
    "text": "Love Actually musical parody pokes fun at iconic Christmas movie\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 20
  },
  {
    "url": "https://www.smh.com.au/goodfood/melbourne-eating-out/bountiful-mediterranean-dishes-are-best-shared-at-this-carnegie-fine-diner-20251209-p5nm5b.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Bountiful Mediterranean dishes are best shared at this Carnegie fine diner",
    "publish_date": "Tue, 09 Dec 2025 12:38:11 +1100",
    "category": "finance",
    "authors": [
      "Dani Valent"
    ],
    "text": "1 / 5 Inside the Carnegie restaurant. Simon Schluter 2 / 5 Saganaki. Simon Schluter 3 / 5 S.owl’s “lamb of the gods” compressed lamb shoulder. Simon Schluter 4 / 5 Rhum baba. Simon Schluter 5 / 5 Fettucine with chicken and anchovy crumb. Simon Schluter Previous Slide Next Slide\n\nMediterranean$$$$\n\nWhen you want Carnegie fine dining, you come to Sowl. The name is pronounced “soul” but it also suggests the wisdom of an owl: this is smart cuisine and a very accomplished restaurant. The food and mood is infused with the emotion and passion of owner-chef Yiannis Kasidokostas, who channels dishes from his Greek heritage into bountiful Mediterranean menus that are best shared. The hilopites (pasta) with lobster and pull-apart “lamb of the gods” are must-not-miss dishes.\n\nWant to visit this venue? Save it in the Good Food app.",
    "source": "SMH",
    "cluster_id": 21
  },
  {
    "url": "https://www.smh.com.au/goodfood/melbourne-eating-out/get-daily-suet-pies-and-traditional-sunday-roasts-on-thornbury-s-high-street-20251209-p5nm4x.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Get daily suet pies and traditional Sunday roasts on Thornbury’s High Street",
    "publish_date": "Tue, 09 Dec 2025 12:16:40 +1100",
    "category": "finance",
    "authors": [
      "Dani Valent"
    ],
    "text": "Add articles to your saved list and come back to them anytime.\n\nRemove items from your saved list to add more.\n\nYou have reached your maximum number of saved items.\n\nNorthern Git is all about meat and classic sides.\n\n1 / 3 Get a Sunday roast with Yorkshire pudding at Northern Git. Fairfax Media 2 / 3 Inside the Thornbury restaurant. Patrick Scala 3 / 3 Chef Michael Slade pouring Christmas gravy. Chris Hopkins Previous Slide Next Slide\n\nSteakhouse$$$$\n\nClocking up a decade on the strip this year, the Git is an easygoing restaurant with a meat focus. There’s house-made salami, rillettes and bresaola, and the steak is aged in-house for 80 days. The name references the no-nonsense north of England, which is given culinary life in dishes like the daily pie with suet pastry and a Sunday roast with Yorkshire pud. Vegetarians are showered with love too.\n\nWant to visit this venue? Save it in the Good Food app.",
    "source": "SMH",
    "cluster_id": 22
  },
  {
    "url": "https://www.smh.com.au/culture/live-reviews/not-feeling-the-christmas-vibe-this-show-will-fix-all-that-20251209-p5nm3j.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Not feeling the Christmas vibe? This show will fix all that",
    "publish_date": "Tue, 09 Dec 2025 12:08:50 +1100",
    "category": "entertainment",
    "authors": [
      "Kate Prendergast"
    ],
    "text": "THEATRE\n\nIRVING BERLIN’S HOLIDAY INN\n\nRiverside Theatres Parramatta, December 6\n\nUntil December 14\n\nReviewed by KATE PRENDERGAST\n\n★★★★\n\n\n\nIn the 1940s, the legendary Irving Berlin (who was, ironically, Jewish) dreamt of a little number called White Christmas. At Riverside Theatres, audiences dreamt of a Christmas that doesn’t sweat their entrails out, while being razzle-dazzled to distraction by the stage adaptation of Holiday Inn, a two-hour affair featuring a live band, a dizzying array of sparkle-heavy costumes, old-world charm and some vigorously inventive original choreography by Veronica Beattie George.\n\nIf you haven’t seen a tap-dancing ensemble perform synchronised jump-rope with green tinsel, are you even in the silly season?\n\nThe show features a dizzying array of sparkle-heavy costumes. Credit: Robert Catto\n\nHoliday Inn is the film that launched the world’s best-selling single, which also starred musical history’s most dapper dynamic duo: Fred Astaire and Bing Crosby. Filling those enormous singin’ and dancin’ shoes just fine in this Well Done Creative production are Rob Mallet as Jim Hardy and Max Patterson as Ted Hanover – showbiz characters whose long friendship is put to the test when Jim’s domestic impulses and anxious sentimentality clash with Ted’s big-time ambitions. To put it another way: narrative conflict, thy name is woman.",
    "source": "SMH",
    "cluster_id": 23
  },
  {
    "url": "https://www.smh.com.au/national/victoria/a-mayor-on-a-mission-nominates-crime-crackdown-as-biggest-achievement-of-his-first-year-20251120-p5nh2l.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "A mayor on a mission nominates crime crackdown as biggest achievement of his first year",
    "publish_date": "Tue, 09 Dec 2025 11:59:37 +1100",
    "category": "finance",
    "authors": [
      "Cara Waters"
    ],
    "text": "Save Log in , register or subscribe to save articles for later. Save articles for later Add articles to your saved list and come back to them any time. Got it Normal text size Larger text size Very large text size Over lunch at Marmelo, Lord Mayor Nick Reece weighs in on Zohran Mamdani’s historic win to become mayor of New York. “I think it was very exciting,” Reece says. “I think he ran an incredible campaign, certainly in terms of his social media campaign, I think it’s the best campaign I’ve ever seen.” I feel like Reece is missing the point. I want to know whether Mamdani’s policies on universal childcare, rent freezes and free buses have resonated with Reece, a Labor Party member who is proud of his progressive background but who ran as an independent with a Liberal deputy in his election to Town Hall last year. Lord Mayor Nick Reece weighs up his first year in office over lunch at Marmelo. Credit: Justin McManus “What about his agenda?” I ask. “I will be watching with great interest,” Reece says, moving on to his own agenda. “I went to the people of Melbourne with a very big and inspiring agenda. I’m in the reform game. I’m not here for the title and the chains. I’m here because I want to make a difference, and I’m a mayor on a mission.”\n\nAdvertisement\n\nIt’s one year since Reece was elected as lord mayor and to mark the occasion we are having lunch at Marmelo, a hatted restaurant in this year’s Good Food Guide and one of the finalists for best new restaurant. Loading The hotel is located in the ground floor of luxury hotel Hyde Melbourne Place and the dining room with its large glass windows looks out onto a graffiti-covered laneway filled with wheelie bins. You couldn’t get much more Melbourne. Reece has been to Marmelo before and is enthusiastic about the menu. We start with the anchovies, two single salty slivers doused in oil and laid across the plate, which are delicious in their simplicity. “Those anchovies are next level,” Reece says. It’s the first of many superlatives he uses to describe our meal, that include ‘delicious’, ‘absolutely sublime’ and ‘a culinary revelation’.\n\nAdvertisement\n\nIt’s typical of Reece, at times he is so enthusiastic it’s almost infectious. His enthusiasm is a quality he brings to his work as lord mayor, a role he describes as “the greatest honour of my life” and one where he deploys his expertise in networking and lobbying. We both order a glass of chardonnay and Reece tells me about moving to Australia as a child from the United Kingdom and growing up in a “churchy” family with a strong emphasis on community service. His dad still volunteers at St Vincent de Paul and regularly calls him to take his son to task on various policies. The “next level” anchovies at Marmelo. Credit: Justin McManus Reece is married to Felicity Pantelidis, the deputy chief executive of Labor law firm Maurice Blackburn, and started his career there as a lawyer before becoming an adviser to then-prime minister Julia Gillard and more recently a public policy fellow at the University of Melbourne. I ask Reece what his major achievements have been in his first year as mayor and he nominates cracking down on crime and safety in the city.\n\nAdvertisement\n\n“There still are people who are surprised I went so hard on that,” he says. “I also have a very strong view that a great city begins with being a safe city, and there’s no getting around what the crime data was telling us and what I was hearing out there in the community as well. It’s not only about being a safe city, it’s that people feel safe as well.” Reece points to the 11 council security guards who now patrol Melbourne’s streets and his push to double the number of CCTV cameras in the city. Crime and safety have dominated the agenda at the City of Melbourne’s council meetings and at a recent meeting, the council heard from dozens of people experiencing homelessness along with community legal services about how vulnerable people are targeted by the security guards and moved on. Celeraic Portuguese tarts topped with spanner crab. Credit: Justin McManus Reece has personal experience of homelessness and addiction in his own family after his brother-in-law, Evan, was badly injured in a bike accident, and through the pain management became a heroin addict. “We were all close and lived through the downward spiral,” Reece says. “It caused a lot of heartache and a lot of pain in our family.” Reece says the experience has stayed with him and shapes how he approaches issues like safe-injecting rooms, homelessness and street support services.\n\nAdvertisement\n\nHe voted against the majority of his fellow councillors recently in backing a safe-injecting room in the CBD. “I am a strong supporter of active outreach, of saying, ‘I’m sorry you can’t stay there, that’s not good for you, it’s not good for the city, you need support’,” he says. Reece approves of the Allan government’s move to try children as young as 14 as adults if they are accused of violent crime. Skewers of garfish at Marmelo are doused in vinho verde vinegar. Credit: Justin McManus “I certainly welcome the direction that they have taken, and I do think the underlying principle that there needs to be consequences for violent and illegal behaviour is a very important one.” I point to my own children and Reece’s three teenagers and ask whether he thinks a 14-year-old’s brain is fully developed and they should cop the adult consequences of jail. “Well if your kid was pulling out a machete and walking through a shopping centre threatening people, then yes,” Reece says.\n\nAdvertisement",
    "source": "SMH",
    "cluster_id": 24
  },
  {
    "url": "https://www.smh.com.au/business/markets/they-re-killing-their-own-customers-beijing-we-have-a-1-5-trillion-problem-20251209-p5nm1l.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "‘They’re killing their own customers’: Beijing, we have a $1.5 trillion problem",
    "publish_date": "Tue, 09 Dec 2025 11:57:38 +1100",
    "category": "finance",
    "authors": [
      "Stephen Bartholomeusz"
    ],
    "text": "China’s trade surplus with the rest of the world has surpassed $US1 trillion ($1.5 trillion) for the first time – and that in only 11 months. That’s a problem for China, and the world.\n\nChina’s exports grew 5.9 per cent in November, and were up 5.4 per cent to $US3.4 trillion for the year to date. Imports, however, grew only 1.9 per cent in November and have actually fallen 0.6 per cent to $US2.3 trillion in the 11 months to the end of November, compared with the same period last year.\n\nTherein lies the problem. The gulf between exports of $US3.4 trillion and imports of $US2.3 trillion – the $US1.08 trillion trade surplus China has produced so far this year – is generating increasing pushback from the rest of the world as other countries see their economies threatened by a Chinese-induced deindustrialisation.\n\nGantry cranes and shipping containers at the Yangshan Deepwater Port in Shanghai: China’s exports to the rest of the world have swelled in the face of Trump’s trade war. Credit: Bloomberg\n\nIn a state visit to China last week, French President Emmanuel Macron threatened China with European Union tariffs if no effort was made to reduce an expanding trade surplus with the EU. China’s exports to the EU have grown by more than 8 per cent this year.",
    "source": "SMH",
    "cluster_id": 25
  },
  {
    "url": "https://www.smh.com.au/national/death-of-lindy-lucena-20251209-p5nm50.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Death of Lindy Lucena",
    "publish_date": "Tue, 09 Dec 2025 11:53:03 +1100",
    "category": "finance",
    "authors": [],
    "text": "Death of Lindy Lucena\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 26
  },
  {
    "url": "https://www.sbs.com.au/news/article/tpg-reveals-second-possible-fatality-linked-to-triple-zero-failure/fe88mf1nm",
    "title": "TPG reveals second possible fatality linked to triple-zero failure",
    "publish_date": "Mon, 8 Dec 2025 23:32:32 +0000",
    "category": "finance",
    "authors": [],
    "text": "Mobile network company TPG Telecom says a possible second fatality may be linked to a triple-zero failure from a Samsung handset.\n\n\n\n\n\nIn his opening statement to a Senate inquiry on Tuesday, the telco's chief executive Iñaki Berroeta said TPG was informed by Telstra on Monday that a customer in Wentworth Falls in the NSW Blue Mountains was unable to call triple-zero on their Samsung phone on 24 September.\n\n\n\n\n\nThat customer was able to reach emergency services about five minutes later through an alternate method but is believed to have later died, Berroeta said.\n\n\n\n\n\nHe added company was awaiting confirmation from NSW Ambulance that the customer's death was linked to the failure.\n\n\n\n\n\n\"We knew about the device not being able to make a call at that time, we investigated that device, including getting in contact with that device, but we did not know that there might be a person passed away,\" he told the Senate.\n\n\n\nREAD MORE Thousands of Samsung phones may still be unable to call triple-zero, estimates hears\n\nIt comes after another person died in Sydney on 13 November .\n\n\n\n\n\nEarly investigations into that incident point to the TPG customer's ageing Samsung phone using software incompatible with making triple-zero calls.\n\n\n\n\n\n\"Even though it was a 4G device, when an emergency call was placed, they would go into the 3G technology at the time, where 3G networks were not going to be available,\" Berroeta said.\n\n\n\n\n\nTPG claims it made regulators aware of the problem at the end of 2023 before the national 3G network shutdown.\n\n\n\n\n\nUnder Australian laws, telcos are required to block devices if they are unable to call triple-zero.\n\n\n\nAround 18,000 TPG customers still have phones that cannot access triple-zero because they require a software update or an entirely new device, Berroeta said.\n\n\n\n\n\n\"These devices will be progressively blocked in the coming weeks, if no action is taken,\" he said.\n\n\n\n\n\nSamsung has identified 11 phones needing replacement and another 60 requiring a software update to overcome the 3G network issue.\n\n\n\n\n\nAnyone who has not done so within five weeks of receiving notice from their telco will have their handset blocked.\n\n\n\n\n\nThe Samsung-specific issue with the Vodafone network was discovered by Telstra and Optus in late October, a year after the two telcos turned off 3G.\n\n\n\n\n\n— With additional reporting by the Australian Associated Press.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 2
  },
  {
    "url": "https://www.sbs.com.au/news/article/australia-under-16-social-media-ban-explained/4j58qo83f",
    "title": "Australia's teen social media ban: Here are all the key details",
    "publish_date": "Mon, 8 Dec 2025 18:37:51 +0000",
    "category": "finance",
    "authors": [],
    "text": "The federal government's long-awaited social media ban for children under 16 is on the verge of taking effect.\n\n\n\n\n\nThe restrictions will prevent Australian children from creating or keeping an account on many popular social platforms, including Instagram, Snapchat and Facebook.\n\n\n\n\n\nCommunications Minister Annika Wells has repeatedly said the ban will protect children from exposure to pressures and risks that come with being logged into social media accounts and insists any \"short-term discomfort will be worth the long-term benefits\".\n\n\n\n\n\nSome experts have been divided over the issue, saying the ban will have positive and negative effects , while others have argued social media is an important tool for young people to have access to .\n\n\n\nWhen does Australia's social media ban start and who will it impact?\n\nThe ban comes into force on Wednesday 10 December — the deadline for specified social media platforms to restrict users aged under 16 from accessing their accounts.\n\n\n\n\n\nMeta has confirmed users aged under 16 travelling overseas for a short-term holiday will still be restricted from using Facebook and Instagram.\n\n\n\n\n\nFor temporary visa holders, such as international students, a spokesperson for the eSafety commissioner said the rules apply to young people under 16 who are \"ordinarily resident\" in Australia and that these users should be aware their accounts may be flagged.\n\n\n\n\n\nThe Meta spokesperson said it's unlikely teens who enter Australia for a short holiday will have their accounts restricted.\n\n\n\n\n\n\"However, if they stay in Australia for an extended period, such as long study periods, then our age assurance measures will take effect,\" the spokesperson said.\n\n\n\nWhat apps will be banned for kids in Australia?\n\nThe platforms banned had to meet certain criteria as decided by Wells, which includes that they allow users to interact, and link, with other users, and post material.\n\n\n\n\n\nAs of 21 November, eSafety commissioner Julie Inman Grant decided the following services will be age-restricted social media platforms:\n\n\n\n\n\n— Facebook\n\n\n\n— Instagram\n\n\n\n— Kick\n\n\n\n— Reddit\n\n\n\n— Snapchat\n\n\n\n— Threads\n\n\n\n— TikTok\n\n\n\n— Twitch\n\n\n\n— X\n\n\n\n— YouTube\n\n\n\nCould more apps be added to Australia's social media ban?\n\nThe following platforms will not be age-restricted, at least, for now:\n\n\n\n\n\n— Discord\n\n\n\n— GitHub\n\n\n\n— Google Classroom\n\n\n\n— LEGO Play\n\n\n\n— Messenger\n\n\n\n— Pinterest\n\n\n\n— Roblox\n\n\n\n— Steam and Steam Chat\n\n\n\n— WhatsApp\n\n\n\n— YouTube Kids\n\n\n\n\n\nInman Grant says the list is dynamic, meaning there could be additions to age-restricted platforms, especially if children flock to one platform amid the ban.\n\n\n\nSeveral smaller apps are growing in popularity as children migrate to those not included in the ban.\n\n\n\n\n\nThey include Lemon8, which has agreed to restrict use of its app to those 16 and older as of Wednesday.\n\n\n\nHow will age verification work on social media platforms?\n\nIt's ultimately up to the platform to decide how it will verify the age of its users. However, the government says requesting ID cannot be the only method.\n\n\n\n\n\nFacebook and Instagram’s parent company Meta hasn't specified how it plans to verify users’ ages. However, it has already notified users aged 13 to 15 that their accounts will be shut down.\n\n\n\n\n\nAbout 150,000 Facebook users and 350,000 Instagram accounts are expected to be affected.\n\n\n\nREAD MORE Meta starts blocking under-16s as social media ban approaches\n\nTikTok said in a statement it already uses a \"multi-layered approach that combines technology and human moderation to detect accounts used by teens who may not have provided their correct date of birth\".\n\n\n\n\n\nSnapchat has told users it will verify ages through k-ID, which is an age assurance platform, or data verification site ConnectID. Users can also upload government-issued photo identification.\n\n\n\n\n\nKick will also use the same k-ID technology, while YouTube said it would determine age based on its associated Google account and other signals.\n\n\n\nCan kids get around the social media ban?\n\nPlatforms face up to $49.5 million in fines if they do not take \"reasonable steps\" to prevent under-16s from holding an account.\n\n\n\n\n\nAs outlined by eSafety, this includes measures to prevent children from using false identity documents, AI tools or deepfakes, and from using virtual private networks (VPNs) to make it appear as though they're outside the country.\n\n\n\n\n\nPlatforms could also investigate signals such as activity patterns consistent with school schedules, connections with other users under 16, and analysis of the language level and style used by the account holder.\n\n\n\n\n\nThey can also use location-based signals such as IP addresses, device language and time settings and an Australian phone number.\n\n\n\nWill children or parents be penalised if they do access an account?\n\nThere are no penalties for children, parents or carers. The government has stated the age-restriction laws are to encourage platforms to take greater responsibility for a child's safety.\n\n\n\n\n\nTherefore, it is the platforms themselves that could face penalties of up to $49.5 million if they don’t take the steps to implement the changes as laid out by the Australian government.\n\n\n\n\n\neSafety has also warned that if your child is asked to pay a fine for being on social media while under 16, it is a scam.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 27
  },
  {
    "url": "https://www.sbs.com.au/news/video/children-of-disengaged-palm-workers-left-in-undocumented-limbo-as-concerns-grow-for-female-workers/ejppbkpge",
    "title": "Children of disengaged PALM workers left in undocumented limbo as concerns grow for female workers",
    "publish_date": "Mon, 8 Dec 2025 08:33:43 +0000",
    "category": "finance",
    "authors": [],
    "text": "Children of disengaged PALM workers left in undocumented limbo as concerns grow for female workers\n\nPublished 8 December 2025, 6:03 am\n\nThere is a growing number of new residents in regional Australia who are completely undocumented because they're born to disengaged migrant workers. There are more than 7,000 workers who have disengaged from the federal government's Pacific Australia Labour Mobility scheme but stayed working unlawfully or on bridging visas. There are growing calls for the scheme to be urgently reviewed.",
    "source": "SBS",
    "cluster_id": 28
  },
  {
    "url": "https://www.sbs.com.au/news/video/sports-minister-anika-wells-scrutinised-over-family-travel-to-major-sporting-events/kn8vp5k0a",
    "title": "Sports Minister Anika Wells scrutinised over family travel to major sporting events",
    "publish_date": "Mon, 8 Dec 2025 08:29:48 +0000",
    "category": "sports",
    "authors": [],
    "text": "Sports Minister Anika Wells scrutinised over family travel to major sporting events\n\nPublished 8 December 2025, 6:03 am\n\nSports Minister Anika Wells charged taxpayers more than $13,000 in flights for family member to some of the nation's most lucrative sporting events. Cabinet colleagues today closed ranks over the new revelations, even as the government acknowledges it has tough budget decisions ahead.",
    "source": "SBS",
    "cluster_id": 29
  },
  {
    "url": "https://www.sbs.com.au/news/video/dolphin-sands-still-off-limits-after-bushfire-is-contained/hdje78tfi",
    "title": "Dolphin Sands still off-limits after bushfire is contained",
    "publish_date": "Mon, 8 Dec 2025 08:26:26 +0000",
    "category": "finance",
    "authors": [],
    "text": "Dolphin Sands still off-limits after bushfire is contained\n\nPublished 8 December 2025, 7:35 am\n\nIn Tasmania, access to a fire-affected community remains closed as authorities work to make the scene safe after a bushfire destroyed more than a dozen homes. The fire at Dolphin Sands burned more than 700 hectares before being contained at the weekend. Tasmania correspondent Kerrin Thomas is near Dolphin Sands.",
    "source": "SBS",
    "cluster_id": 30
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/markets-brace-for-global-interest-rate-decisions/hahqeu7od",
    "title": "Markets brace for global interest rate decisions",
    "publish_date": "Mon, 8 Dec 2025 06:24:19 +0000",
    "category": "finance",
    "authors": [],
    "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
    "source": "SBS",
    "cluster_id": 31
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/joyce-to-join-one-nation-evening-news-bulletin-8-december-2025/ok4nms7u0",
    "title": "Joyce to join One Nation| Evening News Bulletin 8 December 2025",
    "publish_date": "Mon, 8 Dec 2025 05:00:00 +0000",
    "category": "finance",
    "authors": [],
    "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\nBarnaby Joyce to join One Nation\n\nEnergy rebates to end\n\nThe West Tigers are now without a CEO\n\nBarnaby Joyce has confirmed he is joining the One Nation, after leaving the Nationals in the final sitting week of parliament.\n\n\n\n\n\nMr Joyce says he feels he has a lot more to deliver when it comes to policy issues like energy and immigration.\n\n\n\n\n\nHe told Tamworth Radio 88.9FM, he has done a lot of thinking - and running as a One Nation candidate for Senate is the best fit.\n\n\n\n\n\n\"Now, I'm really going to focus back on the Australian people. Working with people like such to Pauline, I think I have a fellow traveller, and I have great respect for the work that Pauline has done. She has driven the political agenda. She has made us when I was when I was with the Coalition, react to where she has gone, and that has been an incredibly positive thing.\"\n\n\n\n_\n\n\n\nTreasurer Jim Chalmers has confirmed he government's energy bill rebates will not be continued after this year.\n\n\n\n\n\nHe says three rounds of rebates worth up to $150 dollars has cost the Commonwealth Government almost $7 billion, with states and territories also contributing around $1.5 billion.\n\n\n\n\n\nDr Chalmers says substantial pressures on the budget mean the mid-year budget update next week will be sensible, responsible, and restrained - not a 'spend-a-thon'.\n\n\n\n\n\nHe has framed the decision to dump energy rebates as marking a shift in the way the government is delivering cost-of-living relief.\n\n\n\n\n\n\"This shift is from temporary measures first decided when inflation was almost 8 per cent - a shift towards ongoing cost of living help, whether it's getting wages moving again, as we have been, whether it's the Medicare bulk billing incentives, because more bulk billing means less pressure on families, whether it's cheaper medicines, or all of the other ways that we're now providing permanent, ongoing, substantial, meaningful help.\"\n\n\n\n_\n\n\n\nA coroner in West Australia says the youth wing of a high-security adult prison south of Perth should be closed as a matter of urgency after the death of an Indigenous teenager.\n\n\n\n\n\nCleveland Dodd was found unresponsive inside a cell in 'Unit 18' of Banksia Detention Centre after self harming in October 2023, and he died in hospital about a week later.\n\n\n\n\n\nCoroner Phil Urquhart said the 16-year-old had been subjected to prolonged periods of solitary confinement, and a lack of access to health, education and running water.\n\n\n\n\n\nHe has found Mr Dodd's death was avoidable, and recommended a special inquiry into how Unit 18 came to be established, in addition to its urgent closure.\n\n\n\n_\n\n\n\nThe Australian Federal Police have charged three men for allegedly displaying Nazi symbols or possessing extremist material as part of a week-long blitz.\n\n\n\n\n\nAFP Assistant Commissioner Stephen Nutt says a 43-year-old UK citizen living in Queensland is the third man to be charged in the last week as part of an investigation aimed at stopping those who are damaging social cohesion by spreading violence and hate.\n\n\n\n\n\nHe says the charges could result in a jail term of up to five years.\n\n\n\n\n\n\"Members of the national security investigation teams executed a search warrant at a home in Caboolture on 21 November and seized mobile phone along with some several weapons, including swords bearing a swastika, symbols, axes and knives. The man was charged with three counts of public display of prohibited Nazi symbol, and also one count of using a carried service to menace harass or cause offence.\"\n\n\n\n_\n\n\n\n\n\nTo sport now and in NRL,\n\n\n\n\n\nShane Richardson has resigned as Wests Tigers CEO one week after the embattled club's majority owner, Holman Barnes Group, dismissed all four independents from the Tigers board.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 32
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/minister-defends-travel-expenses-as-coalition-demands-independent-review/h6pp4md1f",
    "title": "Minister defends travel expenses as Coalition demands independent review",
    "publish_date": "Mon, 8 Dec 2025 04:34:11 +0000",
    "category": "finance",
    "authors": [],
    "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts .\n\n\n\n\n\nTRANSCRIPT:\n\n\n\n\n\nCommunications Minister Annika Wells is facing public scrutiny for her expenses.\n\n\n\n\n\nRevelations show that her business class flights to New York for her and two staffers cost taxpayers nearly $95,000.\n\n\n\n\n\nMs Wells airfares cost $34,427, while her Deputy Chief of Staff’s flights cost $38,166, and an Assistant Secretary for Online Safety incurred $22,236.31 in airfares.\n\n\n\n\n\nAppearing on Sky News, James Patterson, the Shadow Minister for Cyber Security, is slamming the flight costs as exorbitant.\n\n\n\n\n\n\"I don't even know how you can spend one hundred thousand dollars on return flights to new york city, even if you're flying business class. sometimes first class flights don't even cost that much money.\"\n\n\n\n\n\nMs. Wells is defending her three-day New York trip, which cost taxpayers over $100,000.\n\n\n\n\n\nShe says she was scheduled to travel with the Prime Minister to the U-N General Assembly to deliver a speech on Australia's social media ban in September.\n\n\n\n\n\nFollowing the news of the Optus triple zero outage, her departure was delayed, forcing a last-minute re-booking of the New York flights.\n\n\n\n\n\nShe maintains that the travel was for important work and that the expenses adhered to official guidelines.\n\n\n\n\n\n\"I had to be in two places at once. The communications portfolio had two really serious things happening at the same time. Like you said, I was initially meant to leave the Saturday morning with the prime minister the Optus crisis. We only found out about 12 hours earlier than that. We made the decision that I should delay work through that across the weekend, get the independent investigation on foot, and then get to the UN to uphold my commitment.\"\n\n\n\n\n\n\n\nOn ABC's Insiders Prime Minister Anthony Albanese defended the government's decision to book these last minute flights.\n\n\n\n\n\n\"You or your office had to approve that flight? of course, of course, and we spoke. We spoke on the morning that Minister wells travelled. It was a very significant event for Australia.\"\n\n\n\n\n\nMinister for Social Services Tanya Plibersek stood behind Ms Wells, defending the trip as an important part of the world-first social media ban coming into effect on December 10.\n\n\n\n\n\n\"When we're up against the big tech giants, having that sort of global support really helps us in what we're doing, and the reason we're doing this, of course, is because we've been contacted by so many parents who are worried about the impact that social media has had on their kids or is having on a whole generation of kids. Being in New York was valuable, important. It helps Australia's interests, and it helps us do what we want to do, which is stand up to the big tech giants and protect our kids.\"\n\n\n\n\n\nNow Minister Wells is being asked to explain other travel expenses.\n\n\n\n\n\nIn June, Ms Wells attended the Paralympics Australia Adaptive Festival, where she claimed $3000 in taxpayer family reunion entitlements so her husband and children could join her for a weekend at the Thredbo ski resort in June.\n\n\n\n\n\nIn 2024, while serving as Minister for Sports, Ms Wells was sent to Paris for the 2024 Olympic games.\n\n\n\n\n\nDuring her time there, Minister Wells was allocated $10,000 for ground transport and authorised to spend up to $1,200 a day on food.\n\n\n\n\n\nOn top of this, she spent $1,000 for a working dinner with the Australian Ambassador to France and a French official.\n\n\n\n\n\nIn a Sky News interview the Minister defended her actions by maintaining that she operated strictly within the rules.\n\n\n\n\n\n\"Viewers can absolutely have an opinion about the rules and parliamentarian entitlements and whether or not they should be changed but my role is to abide by them and that is what I've done.\"\n\n\n\n\n\nShadow Minister for Industry and Innovation, Alex Hawke, says that Minister Wells's actions \"don't pass the pub test.\"\n\n\n\n\n\nHe is questioning why taxpayers were billed for expensive meals when she claimed to be only eating \"muesli bars\" or \"falling asleep at the table\" in Paris.\n\n\n\n\n\n\"The Minister's defenses don't seem to stack up either. I mean, if the Minister is eating a muesli bar and falling asleep in Paris, then why is the taxpayer being charged for expensive dinners and expensive food and expensive travel if she's not partaking of them? So if her defense is, well, I was working really hard and I didn't eat much and I wasn't really paying attention or asleep at the table, then we could presumably recoup some of that money.\"\n\n\n\n\n\nMr Hawke says the Australian public will not be convinced by the justification that the expenses were simply within the rules.\n\n\n\n\n\n\"I mean, when you look at the expenses of Anna wells, whether it's New York, whether it's Paris, whether it's thread bow, these are expenses that would make the Royals blush. And yet she looks down the camera and says, Oh, well, it's all within the guidelines. Now, I think Australians aren't going to buy that. I think this is these are very expensive trips for relatively junior minister, and she hasn't justified why the expenses were so high, unbelievably high.\"\n\n\n\n\n\nThe Australian is now reporting that Anika Wells charged taxpayers nearly $9,000 for return flights so her husband could attend the AFL Grand Final three years in a row between 2022 and 2024.\n\n\n\n\n\nShe also spent almost $1800 for her and her husband to attend the Melbourne Formula 1 Grand Prix last year, after receiving four free tickets to the event from the organiser Motorsport Australia.\n\n\n\n\n\nThe Coalition is calling for an independent review into Ms Well's expenses as well as asking her to repay the money.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 33
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/got-a-lot-on-your-plate-food-poisoning-can-sleigh-the-christmas-spirit-experts-warn/odz5uzjez",
    "title": "Got a lot on your plate? Food poisoning can sleigh the Christmas spirit, experts warn",
    "publish_date": "Mon, 8 Dec 2025 04:09:01 +0000",
    "category": "finance",
    "authors": [],
    "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts .\n\n\n\n\n\nTRANSCRIPT:\n\n\n\n\n\nIf you're like most people, the summer holiday period might involve shared meals and there are some favourites in the mix - turkey and chicken among them.\n\n\n\n\n\nBut one in two people are making a stomach-turning mistake.\n\n\n\n\n\nDo you know what it is?\n\n\n\n\n\nThe C-E-O of the Food Safety Information Council, Lydia Buchtmann, is here to bust a common myth.\n\n\n\n\n\n\"And a huge number of people, one in two people, adults who cook raw chicken said they actually wash it before they cook it. Now this is really risky, because firstly any poultry is washed in processing so you don't need to do it. But if you wash it, you're going to splash it right around the kitchen and you're going to get bacteria everywhere. Particularly salmonella, which gives you a really nasty form of food poisoning.\"\n\n\n\n\n\nShe wants to make sure fewer than the average 4.67 million* people get food poisoning this year, because it is no joke.\n\n\n\n\n\nIt's also costing the economy around three billion dollars a year*, with an uptick in cases over the Christmas-New Year period.\n\n\n\n\n\nFood safety experts say food poisoning is more dangerous than most people realise.\n\n\n\n\n\n\"It's not just a funny tummy, it really is nasty. And it can make you really ill. It can be life threatening if you have a poor immune system or if you're pregnant or if you're frail and elderly.\"\n\n\n\n\n\nIf you're keen for a roast, Christmas ham is another European tradition, adopted in the southern hemisphere.\n\n\n\n\n\nYou can have your ham hot or cold, but experts including Ms Buchtmann say; it can't be old!\n\n\n\n\n\nIf it's wrapped, check the use-by date and abide by it.\n\n\n\n\n\nLydia Buchtmann says to remember that a ham is for a few days - not for life.\n\n\n\n\n\n\"Wrap it up in, I'd get something called a ham-bag which is sort of just a cloth bag you can put it in. Or a clean cloth. Soak that cloth in a mixture of vinegar and water, so about a litre of water with two tablespoons of vinegar in it. And keep that cloth moist so it doesn't dry out and keep it in the fridge and change it every three days or so.\"\n\n\n\n\n\nTemperature matters in the preparation process - try to remember these numbers.\n\n\n\n\n\nCook your meat to 75 degrees when you test it with a thermometer - that includes mince and sausages.\n\n\n\n\n\nKeep your fridge at 5 degrees - it's important, so you might need to get a thermometer, to test it every few hours.\n\n\n\n\n\nAnd if you've bought some top shelf bubbles or wine, it shouldn't be on the top shelf of the fridge - take it out and put it on ice.\n\n\n\n\n\nBeers and wine are shelf-stable when they're in unopened bottles - so they don't present a risk of illness, unless you drink too much of them!\n\n\n\n\n\nIf you're hosting a big meal, save your valuable fridge space for the food; and there is a hierarchy.\n\n\n\n\n\nDrinks are out - except for juice and dairy.\n\n\n\n\n\nThe top shelf belongs to salads, with cheeses and dips below and at the bottom, uncooked meats and poultry - that's to make sure they don't contaminate anything else.\n\n\n\n\n\nIf you're not a drinker and you don't eat meat - a lingering cheese platter and dip are an opportunity for bacteria to thrive.\n\n\n\n\n\nHosts will need to make hourly trips to the fridge to refresh these dishes - and a generous serving can be a mistake.\n\n\n\n\n\n\"The idea is to put them out in small servings at a time. It's a real risk if you, say, put out a dip or you put a brie there or something and then you get more stuff out of the fridge and you put it on top. So, put out small amounts, leave the rest in the fridge and replace it every hour or so.\"\n\n\n\n\n\nVegans are not in the clear, either - there are some key considerations with your summer salads and vegetables.\n\n\n\n\n\nJust like your cheeses and dips, they can't sit out for too long - and they can easily spoil in the heat.\n\n\n\n\n\nYou'll know, if you've ever left a salad in your bag on a hot day.\n\n\n\n\n\nAnd Ms Buchtmann says there is another big mistake we're making, in the name of being clean: gloves.\n\n\n\n\n\n\"Most people leave them on way too long, so we actually think it is better if you just wash your hands quite often. And you need to wash your hands before you handle food and if you've been handling risky foods like raw meat and raw poultry.\"\n\n\n\n\n\nAnother tip is to buy what you need and not too much more - it cuts down the risk of food spoiling.\n\n\n\n\n\nBut there is a fix if you find yourself swimming in leftovers.\n\n\n\n\n\nDon't love them and leave them - love them and freeze them.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 34
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/sbs-news-in-easy-english-8-december-2025/wq9hsgqct",
    "title": "SBS News in Easy English 8 December 2025",
    "publish_date": "Mon, 8 Dec 2025 04:01:42 +0000",
    "category": "finance",
    "authors": [],
    "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nWelcome to SBS News in Easy English. I'm Greg Dyett\n\n\n\n\n\nNew South Wales Premier Chris Minns says a firefighter has died while battling fires on the state's Central Coast.\n\n\n\n\n\nThe man died after being crushed by a tree during bushfire prevention work north of Newcastle.\n\n\n\n\n\n\"We're hearing distressing news this morning that a member of our national parks firefighting team has died on a fireground which is obviously a terrible reminder of how difficult and dangerous this work is and how the people who put their lives on the line to protect lives and property do an incredible job for us in this state. But it's a deeply distressing turn of events, and a sad day for New South Wales this morning.\"\n\n\n\n\n\nAt least 20 homes have been destroyed in the fires.\n\n\n\n\n\nAnd in Tasmania, authorities say 19 homes have been destroyed in a bushfire at Dolphin Sands.\n\n\n\n\n\nCoalition frontbencher James Paterson says he opposes the inclusion of YouTube in the social media ban for those under 16.\n\n\n\n\n\nThe ban takes effect on Wednesday and requires tech companies to bring in technology to stop children under the age of 16 from having accounts.\n\n\n\n\n\nMortgage holders aren't expected to get an early Christmas present from the Reserve Bank, with a cut to interest rates all but off the table.\n\n\n\n\n\nThe central bank has started two days of talks in its final board meeting of the year, after which the official cash rate is expected to remain at 3.6 per cent.\n\n\n\n\n\nBritish photographer Martin Parr died at his home on Bristol at the age of 73.\n\n\n\n\n\nThe Martin Parr Foundation confirmed the news.\n\n\n\n\n\nA celebrated photographer, Parr was known for his documentary-style photography focusing on British social class that was often colourful and satirical, but also thought-provoking.\n\n\n\n\n\nHaving risen to prominence in the 1980s, his career went on to span decades.\n\n\n\n\n\nIn this interview, he says photography continues to play an important role in society.\n\n\n\n\n\n\"I think people still think of photography as something that's done as a craft rather than as an accessory to other arts. Whereas, if you look at the democracy of photography, you look at the incredible number of people who are posting images on Instagram, the support photography, photography shows are very popular. Photographic books sell very well. So, it's really just the establishment from the art world catching up and understanding how important photography is.\"\n\n\n\n\n\nMourners in Hong Kong continue to lay flowers and tributes at a memorial site where a fire engulfed seven residential towers.\n\n\n\n\n\nThe blaze on November 26, killed at least 159 people and took nearly two days to extinguish.\n\n\n\n\n\nPolice have arrested 15 people on suspicion of manslaughter, and 12 have also been arrested in a corruption investigation.\n\n\n\n\n\nPolice have arrested a man in London after a group of people were assaulted with pepper spray in a Heathrow Airport car park.\n\n\n\n\n\nAmbulance crews treated 21 people, including a three-year-old girl, at the scene and five were taken to the hospital although their injuries were not believed to be serious.\n\n\n\n\n\nPolice say the incident occurred after an argument escalated between two groups who knew each other.\n\n\n\n\n\nOne man was being held on suspicion of assault.\n\n\n\n\n\nPolice were searching for other suspects who left the scene.\n\n\n\n\n\nKaty Perry and Justin Trudeau have gone Instagram official with their romance.\n\n\n\n\n\nThe 41-year-old singer shared a post on the social media platform that contained intimate photos and videos from a trip to Japan with Canada's former prime minister.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 35
  },
  {
    "url": "https://www.sbs.com.au/news/article/energy-bill-rebates-not-extended-labor/saa5etpk0",
    "title": "Energy bill rebates to be axed in cost of living relief 'shift'",
    "publish_date": "Mon, 8 Dec 2025 03:26:11 +0000",
    "category": "finance",
    "authors": [],
    "text": "Treasurer Jim Chalmers has announced the federal government will not provide another round of energy bill rebates.\n\n\n\n\n\nSpeaking in Canberra ahead of the upcoming mid-year budget update on Monday, Chalmers said the rebate scheme would not be extended beyond the end of this year.\n\n\n\n\n\n\"This marks a shift in the way that we are delivering cost of living relief,\" he said. \"This is a shift from temporary measures, first decided when inflation was almost 8 per cent, a shift towards ongoing cost of living help.\"\n\n\n\n\n\nHe argued that changes to the tax system, as well as to Medicare and the Pharmaceutical Benefits Scheme, would deliver more permanent relief.\n\n\n\n\n\n\"People can use that to help pay their electricity bills or to meet their other cost of living pressures,\" he said of the tax cuts. \"This wasn't an easy decision, but it's the right decision.\"\n\n\n\n\"There is more than one way to provide this cost of living relief that people still need in their household budgets.\"\n\n\n\n\n\nAll households and many small businesses received $300 in relief in the 2024 budget, paid quarterly. A $150 extension for the second half of 2025 was announced ahead of the election.\n\n\n\n\n\nChalmers has now ruled out a fourth round, saying the government had \"been up-front with people and said that these were never going to be a permanent feature of the budget\".\n\n\n\nREAD MORE Why your energy bills could be getting higher and what you can do about it\n\nLabor delivered tax cuts in July 2024, with further rate reductions scheduled from 1 July 2026 and 1 July 2027. In March, the government said the combined effect of these changes would see the average tax cut reach around $43 a week in 2026–27.\n\n\n\n\n\n\"Round two is not that far away,\" Chalmers said.\n\n\n\nOpposition reacts\n\nIn a joint statement, Opposition Treasury spokesperson Ted O'Brien and finance spokesperson James Paterson said: \"Labor’s decision to end household energy bill relief exposes the Albanese Government’s cost-of-living, energy policy and budget disasters for all to see.\"\n\n\n\n\n\n\"The Albanese Government has already overseen the sharpest fall in living standards in the developed world, and all signs point to further cost-of-living pain in the year ahead.\n\n\n\n\n\n\"The Coalition understands we must address the root causes of Labor’s energy bill crisis.\n\n\n\n\n\n\"That’s why the Coalition is offering an alternative energy plan that prioritises affordable and reliable energy. Our emissions reduction goals will never come at the expense of Australian families, and this principle will guide every decision we take.\"\n\n\n\n\n\nThe Coalition revealed its energy policy last month after both the Nationals and the Liberals dumped net zero by 2025 commitments from their platforms.\n\n\n\nAustralians feeling the pressure as energy prices rise\n\nMany Australians are feeling the pinch as electricity prices drive up inflation.\n\n\n\n\n\nInflation data released last month showed electricity prices had jumped by 37 per cent in the past year, with the Australian Bureau of Statistics noting that the rise was primarily driven by state government rebates being used up by households.\n\n\n\n\n\nIn July, Energy Consumers Australia found in a report that one in five Australian households is struggling to pay its energy bills, with renters disproportionately affected.\n\n\n\nDavid Stuart runs a paint business on Sydney’s northern beaches. Last month, he told SBS News he had been spending $24,000 a year on electricity before investing in renewables.\n\n\n\n\n\n\"We took the plunge. We went solar, we got a bank loan to do it,\" he said. \"That bank loan is now paid off. Our power bills are now negative.\"\n\n\n\nWhat to do about pricey energy bills\n\nSally Tindall, data insights director at financial comparison website Canstar, said millions of Australians are overpaying for utilities simply because they haven't checked the competition in a while.\n\n\n\n\n\n\"Our research shows switching from an average-priced plan to one of the lowest in the market could save a typical household up to $406 a year in some areas, even more for larger households,\" she told SBS News earlier this year.\n\n\n\nConsumers can also speak with energy providers and ask what support is available to pay bills. Legally, retailers must declare if a better offer is available.\n\n\n\n\n\nAs Australians face a hot summer, there are several ways to keep cool while limiting energy costs — such as running the dishwasher and washing machine during off-peak periods, and using the oven only during cooler times of day.\n\n\n\n\n\nThe CSIRO recommends setting air conditioning temperatures between 24C and 25C, noting that for every degree you lower the temperature, costs can increase by 10 per cent.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 36
  },
  {
    "url": "https://www.theage.com.au/national/graham-richardson-state-funeral-live-updates-prime-minister-labor-heavyweights-farewell-late-political-kingmaker-in-sydney-20251209-p5nm25.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Graham Richardson state funeral LIVE updates: Prime minister delivers eulogy as Labor heavyweights farewell late political kingmaker",
    "publish_date": "Tue, 09 Dec 2025 13:07:59 +1100",
    "category": "finance",
    "authors": [
      "Angus Dalton"
    ],
    "text": "“Those who knew Dad, no matter their background, shared a deep admiration for his wit, humour, principles and policy achievements,” Graham Richardson’s son D’Arcy, who just finished his HSC, has told those gathered.\n\n“Mum and I had the immense honour of being invited by the Prime Minister and the Speaker of the House to sit on the floor of Parliament to hear the testimonies from his condolence motion during Parliament’s last sitting week.\n\nAmanda and D’Arcy Richardson speak. Credit: James Brickwood\n\n“What struck me most was the number of MPs who came up to talk about the ways dad helped them in their careers. I had no idea the different ways dad touched those in Parliament throughout their lives, contributing to the great work they’re doing representing their communities.”\n\nHe said being a great dad was Richardson’s greatest legacy.\n\nWhile several speakers spoke highly of D’Arcy, there has been scant mention of Richardson’s two children from his previous marriage to Cheryl Gardner, Matthew and Kate.",
    "source": "TheAge",
    "cluster_id": 17
  },
  {
    "url": "https://www.theage.com.au/national/victoria/gp-caught-up-in-niddrie-fatal-crash-vows-to-rebuild-as-floral-tributes-grow-20251209-p5nm0f.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "‘I saw my patient fly to the ceiling’: GP caught up in Niddrie fatal crash vows to rebuild",
    "publish_date": "Tue, 09 Dec 2025 12:52:27 +1100",
    "category": "finance",
    "authors": [
      "Alexander Darling"
    ],
    "text": "Dr Rafid Hamdan was consulting a patient - one of hundreds, if not thousands, in his decades-long career - when everything changed.\n\nHe turned briefly to his computer, and then a huge explosion filled the room.\n\nGeraldine Maguire, right, lays a floral tribute at the Niddrie practice where a fatal car crash occurred on Monday, December 8. Credit: Eddie Jim\n\n“I heard my receptionist scream, and suddenly I just saw my patient fly to the ceiling,” he said.\n\n“Then everything collapsed in the room.”",
    "source": "TheAge",
    "cluster_id": 18
  },
  {
    "url": "https://www.theage.com.au/politics/federal/wells-left-car-waiting-for-hours-at-nrl-grand-final-costing-more-than-1200-20251209-p5nm0i.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Wells left car waiting for hours at NRL grand final, costing more than $1200",
    "publish_date": "Tue, 09 Dec 2025 12:44:43 +1100",
    "category": "finance",
    "authors": [
      "James Massola",
      "Brittany Busch",
      "Nigel Gladstone"
    ],
    "text": "Farrell charges for hundreds of family flights Farrell charged taxpayers more than $116,000 for family travel since 2022, according to Independent Parliamentary Expenses Authority data. This includes flying a family member to Uluru, where he had been gifted tickets to a Wintjiri Wiru Sunset Dinner in August 2024. The flights that coincided with the dinner cost $2093.65 for a return trip from Adelaide to Uluru via Sydney. Other family travel matched dates that Farrell had been gifted tickets, including return flights for a family member to Sydney, costing $1385.21, at the same time as opera La Boheme at the Sydney Opera House. Farrell had been given a double pass and hospitality, according to his register of interests. Minister for Trade and Tourism, and Special Minister of State Don Farrell. Credit: Alex Ellinghausen Farrell defended the expenses, saying they were within the guidelines and that the rules allowed for carers and single parents to become politicians.\n\n“The family reunion provisions are an important feature of our framework, allowing a diverse range of members and senators to represent their communities in our nation’s parliament,” he said in a statement.\n\n\n\n“Our parliament would be a lesser place if it weren’t for the mechanisms that allow young mothers, single parents, those with families, and those with caring responsibilities to serve as elected members.” Loading Minister for Home Affairs Tony Burke, in 2020, repaid the cost of flights for his family to join him on a trip to Uluru in 2012 because, while within the rules, he said the expenses “did not meet community expectations”. Under the family reunion rules, federal MPs are allowed up to three return business class flights per year for family members flying between the MP’s home base and a city other than Canberra, and the value of nine business class flights to Canberra, though there is some flexibility to the rules that allows ministers to claim more. Coalition MP calls for Wells to resign as minister\n\nWells has defended the flights and expenses as within the rules, but has endured ongoing criticism for the nature of her trips and a lack of judgment in flying her children and husband to Thredbo for a ski trip, and billing taxpayers thousands to fly her husband to three AFL grand finals and two Boxing Day Test matches. On most occasions, her husband flew home to Brisbane on the same day. Wells’ expenses first came under scrutiny last Wednesday when it was revealed in an answer to a Senate estimates committee that she billed taxpayers almost $100,000 to fly herself, a staffer and a public servant to New York in September for the United Nations General Assembly. Nationals senator Matt Canavan on Tuesday called for Wells to resign because though she may not have broken any rules, there was a pattern of misjudgment that did not meet community expectations. Family reunion travel rules The obligations of MPs when determining whether they can claim family reunion expenses. Dominant purpose: Under family reunion rules, an MP’s family can accompany or join them at Commonwealth expense while they are conducting parliamentary business. Travel must be for the “dominant purpose” of facilitating the family life of the parliamentarian.\n\nUnder family reunion rules, an MP’s family can accompany or join them at Commonwealth expense while they are conducting parliamentary business. Travel must be for the “dominant purpose” of facilitating the family life of the parliamentarian. Value for money: MPs are required to use public resources for parliamentary business in a way that achieves value for money. MPs can have family members travel to Canberra under a cost-based limit per year, and can claim up to three return business-class airfares for family to travel elsewhere in Australia.\n\nMPs are required to use public resources for parliamentary business in a way that achieves value for money. MPs can have family members travel to Canberra under a cost-based limit per year, and can claim up to three return business-class airfares for family to travel elsewhere in Australia. Good faith: MPs need to act ethically and in good faith when using, or accounting for, public resources. They must not seek to disguise personal or commercial business as parliamentary business.\n\nMPs need to act ethically and in good faith when using, or accounting for, public resources. They must not seek to disguise personal or commercial business as parliamentary business. Personal responsibility and accountability: An MP is personally responsible and accountable for their use of public resources and should consider how the public would perceive their use of these resources.\n\nAn MP is personally responsible and accountable for their use of public resources and should consider how the public would perceive their use of these resources. Conditions: An MP must not make a claim, or incur an expense, in relation to a public resource if they have not met all of the conditions for its provision. “I think there’s too many yellow cards here from Anika Wells. I think she needs to be shown a red,” he told Sky News.\n\nCanavan said getting a Comcar to wait seven hours at the tennis was “ridiculous”, and other ministers had been forced out of parliamentary positions for less, including former Speaker Bronwyn Bishop and Opposition Leader Sussan Ley. “You’re spending other people’s money, not your own. So I don’t think Anika Wells, as a minister of the crown, has shown any care and diligence here to make sure her spending ... meets that value for money test,” Canavan said. “The question now is to the prime minister, what standards do you have? Do you apply any discipline to your ministers to pay a price if they’re not seen to be spending money in a value sense?” This masthead revealed on Monday that Wells charged taxpayers almost $1000 to have a government-funded Comcar wait seven hours for her while she attended the Australian Open tennis final in January 2023, and the Australian Financial Review reported on Tuesday she claimed another $765 for a chauffeur-driven car while attending the Magic Millions Race Day on the Gold Coast in January 2024. Coalition figures have challenged the government’s response, saying the travel was outside what Australians expect.\n\n“Whether things are in the guidelines or not, it’s always up to the individual parliamentarian to justify his or her expenses. That’s always been the case,” shadow treasurer Ted O’Brien told ABC Radio National. Loading He called the judgment of Wells and the prime minister into question for claiming the expenses were appropriate during a cost-of-living crisis. “What we see here is the prime minister defending a minister who is spending money that is hard to justify in the public eye,” O’Brien said. “Saying that this level of spending is fine – that goes to his judgment.”",
    "source": "TheAge",
    "cluster_id": 19
  },
  {
    "url": "https://www.theage.com.au/lifestyle/love-actually-musical-parody-pokes-fun-at-iconic-christmas-movie-20251209-p5nm0n.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Love Actually musical parody pokes fun at iconic Christmas movie",
    "publish_date": "Tue, 09 Dec 2025 12:38:57 +1100",
    "category": "lifestyle",
    "authors": [],
    "text": "Love Actually musical parody pokes fun at iconic Christmas movie\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 20
  },
  {
    "url": "https://www.theage.com.au/goodfood/melbourne-eating-out/bountiful-mediterranean-dishes-are-best-shared-at-this-carnegie-fine-diner-20251209-p5nm5b.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Bountiful Mediterranean dishes are best shared at this Carnegie fine diner",
    "publish_date": "Tue, 09 Dec 2025 12:38:11 +1100",
    "category": "finance",
    "authors": [
      "Dani Valent"
    ],
    "text": "1 / 5 Inside the Carnegie restaurant. Simon Schluter 2 / 5 Saganaki. Simon Schluter 3 / 5 S.owl’s “lamb of the gods” compressed lamb shoulder. Simon Schluter 4 / 5 Rhum baba. Simon Schluter 5 / 5 Fettucine with chicken and anchovy crumb. Simon Schluter Previous Slide Next Slide\n\nMediterranean$$$$\n\nWhen you want Carnegie fine dining, you come to Sowl. The name is pronounced “soul” but it also suggests the wisdom of an owl: this is smart cuisine and a very accomplished restaurant. The food and mood is infused with the emotion and passion of owner-chef Yiannis Kasidokostas, who channels dishes from his Greek heritage into bountiful Mediterranean menus that are best shared. The hilopites (pasta) with lobster and pull-apart “lamb of the gods” are must-not-miss dishes.\n\nWant to visit this venue? Save it in the Good Food app.",
    "source": "TheAge",
    "cluster_id": 21
  },
  {
    "url": "https://www.theage.com.au/goodfood/melbourne-eating-out/get-daily-suet-pies-and-traditional-sunday-roasts-on-thornbury-s-high-street-20251209-p5nm4x.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Get daily suet pies and traditional Sunday roasts on Thornbury’s High Street",
    "publish_date": "Tue, 09 Dec 2025 12:16:40 +1100",
    "category": "finance",
    "authors": [
      "Dani Valent"
    ],
    "text": "Add articles to your saved list and come back to them anytime.\n\nRemove items from your saved list to add more.\n\nYou have reached your maximum number of saved items.\n\nNorthern Git is all about meat and classic sides.\n\n1 / 3 Get a Sunday roast with Yorkshire pudding at Northern Git. Fairfax Media 2 / 3 Inside the Thornbury restaurant. Patrick Scala 3 / 3 Chef Michael Slade pouring Christmas gravy. Chris Hopkins Previous Slide Next Slide\n\nSteakhouse$$$$\n\nClocking up a decade on the strip this year, the Git is an easygoing restaurant with a meat focus. There’s house-made salami, rillettes and bresaola, and the steak is aged in-house for 80 days. The name references the no-nonsense north of England, which is given culinary life in dishes like the daily pie with suet pastry and a Sunday roast with Yorkshire pud. Vegetarians are showered with love too.\n\nWant to visit this venue? Save it in the Good Food app.",
    "source": "TheAge",
    "cluster_id": 22
  },
  {
    "url": "https://www.theage.com.au/culture/live-reviews/not-feeling-the-christmas-vibe-this-show-will-fix-all-that-20251209-p5nm3j.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Not feeling the Christmas vibe? This show will fix all that",
    "publish_date": "Tue, 09 Dec 2025 12:08:50 +1100",
    "category": "entertainment",
    "authors": [
      "Kate Prendergast"
    ],
    "text": "THEATRE\n\nIRVING BERLIN’S HOLIDAY INN\n\nRiverside Theatres Parramatta, December 6\n\nUntil December 14\n\nReviewed by KATE PRENDERGAST\n\n★★★★\n\n\n\nIn the 1940s, the legendary Irving Berlin (who was, ironically, Jewish) dreamt of a little number called White Christmas. At Riverside Theatres, audiences dreamt of a Christmas that doesn’t sweat their entrails out, while being razzle-dazzled to distraction by the stage adaptation of Holiday Inn, a two-hour affair featuring a live band, a dizzying array of sparkle-heavy costumes, old-world charm and some vigorously inventive original choreography by Veronica Beattie George.\n\nIf you haven’t seen a tap-dancing ensemble perform synchronised jump-rope with green tinsel, are you even in the silly season?\n\nThe show features a dizzying array of sparkle-heavy costumes. Credit: Robert Catto\n\nHoliday Inn is the film that launched the world’s best-selling single, which also starred musical history’s most dapper dynamic duo: Fred Astaire and Bing Crosby. Filling those enormous singin’ and dancin’ shoes just fine in this Well Done Creative production are Rob Mallet as Jim Hardy and Max Patterson as Ted Hanover – showbiz characters whose long friendship is put to the test when Jim’s domestic impulses and anxious sentimentality clash with Ted’s big-time ambitions. To put it another way: narrative conflict, thy name is woman.",
    "source": "TheAge",
    "cluster_id": 23
  },
  {
    "url": "https://www.theage.com.au/national/victoria/a-mayor-on-a-mission-nominates-crime-crackdown-as-biggest-achievement-of-his-first-year-20251120-p5nh2l.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "A mayor on a mission nominates crime crackdown as biggest achievement of his first year",
    "publish_date": "Tue, 09 Dec 2025 11:59:37 +1100",
    "category": "finance",
    "authors": [
      "Cara Waters"
    ],
    "text": "Save Log in , register or subscribe to save articles for later. Save articles for later Add articles to your saved list and come back to them any time. Got it Normal text size Larger text size Very large text size Over lunch at Marmelo, Lord Mayor Nick Reece weighs in on Zohran Mamdani’s historic win to become mayor of New York. “I think it was very exciting,” Reece says. “I think he ran an incredible campaign, certainly in terms of his social media campaign, I think it’s the best campaign I’ve ever seen.” I feel like Reece is missing the point. I want to know whether Mamdani’s policies on universal childcare, rent freezes and free buses have resonated with Reece, a Labor Party member who is proud of his progressive background but who ran as an independent with a Liberal deputy in his election to Town Hall last year. Lord Mayor Nick Reece weighs up his first year in office over lunch at Marmelo. Credit: Justin McManus “What about his agenda?” I ask. “I will be watching with great interest,” Reece says, moving on to his own agenda. “I went to the people of Melbourne with a very big and inspiring agenda. I’m in the reform game. I’m not here for the title and the chains. I’m here because I want to make a difference, and I’m a mayor on a mission.”\n\nAdvertisement\n\nIt’s one year since Reece was elected as lord mayor and to mark the occasion we are having lunch at Marmelo, a hatted restaurant in this year’s Good Food Guide and one of the finalists for best new restaurant. Loading The hotel is located in the ground floor of luxury hotel Hyde Melbourne Place and the dining room with its large glass windows looks out onto a graffiti-covered laneway filled with wheelie bins. You couldn’t get much more Melbourne. Reece has been to Marmelo before and is enthusiastic about the menu. We start with the anchovies, two single salty slivers doused in oil and laid across the plate, which are delicious in their simplicity. “Those anchovies are next level,” Reece says. It’s the first of many superlatives he uses to describe our meal, that include ‘delicious’, ‘absolutely sublime’ and ‘a culinary revelation’.\n\nAdvertisement\n\nIt’s typical of Reece, at times he is so enthusiastic it’s almost infectious. His enthusiasm is a quality he brings to his work as lord mayor, a role he describes as “the greatest honour of my life” and one where he deploys his expertise in networking and lobbying. We both order a glass of chardonnay and Reece tells me about moving to Australia as a child from the United Kingdom and growing up in a “churchy” family with a strong emphasis on community service. His dad still volunteers at St Vincent de Paul and regularly calls him to take his son to task on various policies. The “next level” anchovies at Marmelo. Credit: Justin McManus Reece is married to Felicity Pantelidis, the deputy chief executive of Labor law firm Maurice Blackburn, and started his career there as a lawyer before becoming an adviser to then-prime minister Julia Gillard and more recently a public policy fellow at the University of Melbourne. I ask Reece what his major achievements have been in his first year as mayor and he nominates cracking down on crime and safety in the city.\n\nAdvertisement\n\n“There still are people who are surprised I went so hard on that,” he says. “I also have a very strong view that a great city begins with being a safe city, and there’s no getting around what the crime data was telling us and what I was hearing out there in the community as well. It’s not only about being a safe city, it’s that people feel safe as well.” Reece points to the 11 council security guards who now patrol Melbourne’s streets and his push to double the number of CCTV cameras in the city. Crime and safety have dominated the agenda at the City of Melbourne’s council meetings and at a recent meeting, the council heard from dozens of people experiencing homelessness along with community legal services about how vulnerable people are targeted by the security guards and moved on. Celeraic Portuguese tarts topped with spanner crab. Credit: Justin McManus Reece has personal experience of homelessness and addiction in his own family after his brother-in-law, Evan, was badly injured in a bike accident, and through the pain management became a heroin addict. “We were all close and lived through the downward spiral,” Reece says. “It caused a lot of heartache and a lot of pain in our family.” Reece says the experience has stayed with him and shapes how he approaches issues like safe-injecting rooms, homelessness and street support services.\n\nAdvertisement\n\nHe voted against the majority of his fellow councillors recently in backing a safe-injecting room in the CBD. “I am a strong supporter of active outreach, of saying, ‘I’m sorry you can’t stay there, that’s not good for you, it’s not good for the city, you need support’,” he says. Reece approves of the Allan government’s move to try children as young as 14 as adults if they are accused of violent crime. Skewers of garfish at Marmelo are doused in vinho verde vinegar. Credit: Justin McManus “I certainly welcome the direction that they have taken, and I do think the underlying principle that there needs to be consequences for violent and illegal behaviour is a very important one.” I point to my own children and Reece’s three teenagers and ask whether he thinks a 14-year-old’s brain is fully developed and they should cop the adult consequences of jail. “Well if your kid was pulling out a machete and walking through a shopping centre threatening people, then yes,” Reece says.\n\nAdvertisement",
    "source": "TheAge",
    "cluster_id": 24
  },
  {
    "url": "https://www.theage.com.au/business/markets/they-re-killing-their-own-customers-beijing-we-have-a-1-5-trillion-problem-20251209-p5nm1l.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "‘They’re killing their own customers’: Beijing, we have a $1.5 trillion problem",
    "publish_date": "Tue, 09 Dec 2025 11:57:38 +1100",
    "category": "finance",
    "authors": [
      "Stephen Bartholomeusz"
    ],
    "text": "China’s trade surplus with the rest of the world has surpassed $US1 trillion ($1.5 trillion) for the first time – and that in only 11 months. That’s a problem for China, and the world.\n\nChina’s exports grew 5.9 per cent in November, and were up 5.4 per cent to $US3.4 trillion for the year to date. Imports, however, grew only 1.9 per cent in November and have actually fallen 0.6 per cent to $US2.3 trillion in the 11 months to the end of November, compared with the same period last year.\n\nTherein lies the problem. The gulf between exports of $US3.4 trillion and imports of $US2.3 trillion – the $US1.08 trillion trade surplus China has produced so far this year – is generating increasing pushback from the rest of the world as other countries see their economies threatened by a Chinese-induced deindustrialisation.\n\nGantry cranes and shipping containers at the Yangshan Deepwater Port in Shanghai: China’s exports to the rest of the world have swelled in the face of Trump’s trade war. Credit: Bloomberg\n\nIn a state visit to China last week, French President Emmanuel Macron threatened China with European Union tariffs if no effort was made to reduce an expanding trade surplus with the EU. China’s exports to the EU have grown by more than 8 per cent this year.",
    "source": "TheAge",
    "cluster_id": 25
  },
  {
    "url": "https://au.news.yahoo.com/second-death-probed-failed-triple-223151586.html",
    "title": "Minister’s shock move in triple-0 probe",
    "publish_date": "2025-12-09T01:52:56Z",
    "category": "finance",
    "authors": [],
    "text": "Embattled Anika Wells has refused to front a parliamentary inquiry into an Optus triple-0 outage linked to the deaths of three people.\n\nThe inquiry was told chair Senator Sarah Hanson-Young had written to Ms Wells seeking for her to appear on Tuesday.\n\n“Unfortunately, the Minister has declined to appear today,” Senator Sarah Henderson said.\n\nMs Wells is not bound to appear before the inquiry.\n\nIn a written response, Ms Wells acknowledged the outage was “a tragedy” and commended the committee, but as a Minister and MP was “accountable to the Parliament in the House of Representatives and, accordingly, I do not attend the Senate or its committees”\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\n“I have answered sixteen questions during Question Time in the House along with questions from the media and will continue to do so,” she said.\n\nThe Communications Minister has faced a bruising week after it was revealed her office spent about $100,000 to fly Ms Wells and some of her staff to the UN in New York.\n\nIt was later revealed she also billed the taxpayer $3000 for a trip to Thredbo in support of Paralympians in June in which her family tagged along for a ski weekend.\n\nMs Wells has defended the cost, stating that “every parliamentarian has family reunion entitlements”.\n\nPrime Minister Anthony Albanese defended Ms Wells, telling ABC’s Insiders that “all of the travel was within guidelines”.\n\nEmbattled Communications Minister Anika Wells has refused to front an inquiry into the Optus triple-0 outage. Picture: NewsWire / Martin Ollman\n\nThe snap inquiry is also examining the death of a Sydney woman and Lebara customer who attempted to dial triple-0 from an incompatible Samsung device but could not do so on November 13.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nIt was revealed earlier this year that thousands of older Samsung devices on the Optus or Telstra network were unable to reach triple-0 when attempting to reach emergency services when transferred to the TPG network.\n\nSpeaking at the inquiry, TPG Telecom chief executive Iñaki Berroeta said he was informed by Telstra on Monday of a second death in Wentworth Falls in NSW on September 24 that could be linked to the triple-0 failure.\n\nHe said this was yet to be confirmed with NSW Ambulance.\n\n“That customer was able to contact emergency services via an alternative option after five minutes,” he said.\n\n“Yesterday, we were told that the call might have been made in connection to someone that has passed away.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\n“We have sought to clarify the circumstances, but the relevant agency has not verified this.”\n\nMr Berroeta said the phone was unable to call triple-0, but worked five minutes later on the 4G network.\n\nThe alternative network used was the National Relay Service.\n\nMr Berroeta said ACMA had been notified.\n\nSpeaking later, Telstra chief executive Vicki Brady said the telco had been contacted by NSW Ambulance via email as the emergency contact person (ECP) and informed them someone had tried and failed to contact Triple-0, but could make calls to other numbers on the device.\n\n“They asked us, as the ECP, to confirm if it was a Vodafone TPG customer, and they advised in that email that the patient had passed away,” she said.\n\n\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nTPG was also informed by the department, Ms Brady said.\n\nThe “unusual” incident led to an investigation and testing of Samsung devices.\n\nHowever, in a meeting with Ms Wells on October 7 the incident was not raised, the inquiry was told.\n\nThe revelation drew condemnation from Ms Hanson-Young.\n\n“I’m staggered that another death on another network wouldn’t have been raised in that meeting,” she said.\n\nShe added: “This is a very serious Senate inquiry that’s been underway … And not at one point in this did anyone within the industry want to fess up and say there’d been another death six days later, and it’s a cover up.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\n“You’re all looking after yourselves.”\n\nTPG Telecom chief executive Iñaki Berroeta revealed on Tuesday he had been informed of a second possible death. Picture: NewsWire / Martin Ollman\n\nIt was on October 20 that Ms Wells was informed of the Samsung device issue, including that Telestra devices were unable to “camp” onto the TPG network, but not the second death.\n\n“I’m not sure when a discussion with the minister’s office happened on the Wentworth Falls incident,” Ms Brady said.\n\nAsked if there had been any discussions about it with the minister, she said: “Not that I’m aware”.\n\nA representative of Telstra told the inquiry they were “under the strong recollection that the Department inferred that the Minister would be told” of the September 24 incident, and that the incident was regularly referred to as an “incident” and not a “fatality” out of respect for the family.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nTelstra public affairs executive said Cecelia Burgman said the telco had been “confident” the incident was being investigated, including by NSW Ambulance and ACMA.\n\nOf the earlier incident, Mr Berroeta expressed his “deep regret” for the incident in November.\n\n“We extend our heartfelt condolences to the family,” he said.\n\n“We are committed to taking whatever actions are necessary to prevent this from happening again.”\n\nMr Berroeta said the incident related to a customer attempting to make an emergency call on a Samsung mobile device on the “shutdown 3G networks prior to the closure of the 3G networks across Australia”.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\n“We worked closely with all manufacturers to identify models of phones not able to make 4G emergency calls,” he said.\n\n“Based on the information received from Samsung in March 2024, we had determined that the particular device used in this incident was able to make emergency calls over our 4G network also.\n\n“We also had evidence from our network call records of other instances of these models successfully making 4G emergency calls only on November 5, 2025.\n\n“After receiving additional information from Samsung, we identify this particular device required the customer to accept the software update to be able to make emergency calls.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\n“The customer was notified by text message on November 2 of the urgent need to accept the software update or the device will be blocked on December 10.”\n\nHundreds of thousands of Samsung devices are impacted by the issue, requiring either a software update to make emergency calls or to be replaced.\n\n‘It hasn’t worked’\n\nCurrently, Mr Berroeta said there were 10,000 devices needing the software update, and about 8000 devices that would need to be replaced because they cannot be upgraded.\n\nGreens Senator Sarah Hanson-Young pressed Mr Berroeta on why those 8000 devices had not been replaced by TPG.\n\n“I’d put it to you that good customer relations would be giving those people a new phone now, given everything is it really worth the corporate reputation to not have them be able to call triple-0?”\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\n“I understand you’re informing them that it’s clearly not working. It hasn’t worked.”\n\nShe continued: “I put it to you that you’re a big company, you make massive profits making sure that your customers have access to a phone that can call triple-0 should be a priority.”\n\nOptus chief executive Stephen Rue was grilled last month by the inquiry on who knew what and when. Picture: NewsWire / Martin Ollman\n\nMr Berroeta said TPG was informing those customers and that information on the affected devices was only received from the manufacturers in “the last couple of weeks”.\n\nHe denied TPG had breached regulatory requirements to shut down affected devices within the 28 to 35-day period – a mandate of recently introduce laws – and had not received a notice from ACMA.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nSo far, about 7500 devices already on the network which cannot be updated have been blocked by TPG, the inquiry was told.\n\nTPG has 5.5 million customers in Australia on their mobile network.\n\nOnly 550 had taken up the offer of a free replacement device, the inquiry was told.\n\nThe inquiry was told TPG was poised to sign a memorandum of understanding with Telstra and Optus which would see the telecom giants provide mutual assistance to “support each other actively when there are disasters and other emergency situations”.\n\nSamsung head of mobile experience Eric Chou said, overall, about 60,000 Telstra and 28,000 Optus devices also needed an update.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nHe told the inquiry the hardware giant was confident all affected models had been identified.\n\n‘First time we’ve seen this happen’\n\nThe inquiry is also examining an September 18 outage of Optus triple-0 services that has been linked to the deaths of at least three people.\n\nThe cause of the outage and the role of the Communications Minister, ACMA, and the federal government play in ensuring access to emergency communications will all be looked at.\n\nNokia Oceania managing director Andrew Cope said the network firewall upgrade contracted by Optus involved a process known as an SBG lock, which “we completed and unfortunately resulted in the outcome that we are now investigating”.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nMr Cope said all calls were expected to be diverted in using this method.\n\n“In this instance, they did not divert because of a way that the triple-0 calls are configured,” he said.\n\n“This is the first time we’ve seen this happen through this process.”\n\nGreens Senator Sarah Hanson-Young pressed Mr Berroeta on why those 8000 devices had not been replaced by TPG. Picture: NewsWire / Martin Ollman\n\nMr Cope said: “We were given an instruction to perform and we executed it with a procedure that we know works, and has worked in the past … we had no indication they would not work this time.”\n\nHe confirmed the procedure would not be used in the future.\n\n“All upgrades are scrutinised closely and carefully, and we follow known procedures,” he said.\n\n“In this instance, as such, there’s no immediate, obvious negligence or inappropriate behaviour.\n\n“While people are being assessed and procedures are being strengthened and we’re finding ways to avoid this, we’re also going through the process with Optus of understanding exactly what happened in the decision process and what happened in the governance process, and subject to that independent investigation findings, we will then, at that time, take appropriate action.”\n\nMr Cope said some no disciplinary action had been taken against staff, adding some of those involved were “quite distressed by what’s happened”.\n\n“They’re, of course, taking relevant, compassionate leave around that (and) others are providing evidence,” he said.\n\nOptus chief executive Stephen Rue was grilled last month by the inquiry on who knew what and when.\n\nHe told the inquiry Optus was informed of the first fatality at 8.43pm on 18 September, with senior management told after midnight.\n\nMr Rue became aware of the information about 8am the following morning, but did not contact either the government regulator or the Communications Minister until about 2.30pm.\n\nHe admitted there were delays, but that his team were gathering information and making welfare checks before 2.30pm.\n\nThe outage affected services across Western Australia, South Australia, and border communities in NSW.",
    "source": "Yahoo",
    "cluster_id": 37
  },
  {
    "url": "https://au.news.yahoo.com/nrl-sets-itself-unity-force-011313955.html",
    "title": "NRL sets itself as unity force against China in PNG",
    "publish_date": "2025-12-09T01:13:13Z",
    "category": "sports",
    "authors": [],
    "text": "In the PNG Chiefs, James Marape sees a \"national unity project\" akin to South Africa's Rainbow Nation Rugby World Cup win in 1995.\n\nThe Papua New Guinea prime minister hopes the incoming NRL team will get kids in school and companies investing in the economy, transforming his nation.\n\n\"Sport has more unification than any other pursuit of life,\" Mr Marape said in Sydney on Tuesday.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\n\"Look at the Nelson Mandela strategy using rugby union to unite South Africa ... we find common unity behind a team.\"\n\nMr Marape was visiting Australia for an annual PNG investment conference in Sydney, also attended by Anthony Albanese.\n\nJames Marape believes the NRL team will help unite and transform PNG. (Mick Tsikas/AAP PHOTOS)\n\nThe PNG leader was wrong-footed by a goosestep from colourful ARL Commission chairman Peter V'landys, who said rugby league would be a tool to repel Chinese influence.\n\n\"Having rugby league there for the community as a whole - taking the kids to school, bringing all the people together like a glue,\" Mr V'landys said on Tuesday.\n\n\"No matter how much investment China makes in PNG, it can never achieve that.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\n\"You can never achieve the heart and soul and brain of the PNG person - and we can in sport.\"\n\nMr Marape hurriedly stepped in to affirm support for critical Chinese investment in his country.\n\n\"I want to quickly say a word or two, a big thank you to China and all our bilateral partners,\" he interrupted.\n\nDivisions at home and abroad are the last thing Mr Marape is hoping for from the team's historic entry into the NRL in 2028, saying he wants the Chiefs to be a \"national unity project\".\n\nHowever, it's plain that Australia - which is spending $600 million on the team - hopes the Chiefs will give a diplomatic boost with PNG at Beijing's expense.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nMr Albanese hailed the Chiefs as an opportunity for education investment across the largely rural nation.\n\n\"Prospects of representing the Chiefs in the NRL when (PNG kids) grow up will encourage education, because (they will) have to be at school to play,\" the prime minister said.\n\nUnder Mr Albanese, Australia has made vast commitments to deepening the trans-Torres relationship.\n\nThe recent Pukpuk treaty, which elevates PNG to Austalia's third defence ally, will drastically increase defence co-operation.\n\nAustralia is also investing heavily in PNG infrastructure projects, Anthony Albanese says. (Mick Tsikas/AAP PHOTOS)\n\nAustralia maintains a high level of development aid for its northern partner, which includes climate financing.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nAustralia was also investing hundreds of millions of dollars in infrastructure projects such as ports and highways designed to help diversify the traditionally resources-heavy PNG economy, Mr Albanese said.\n\nThe PNG leader wasn't short of a rhetorical flourish of his own though, enticing the hundreds of companies in attendance with a substantial offer.\n\n\"When the economy hits 200 billion kina ($A71 billion), I will drop corporate tax,\" the leader of the 135 billion kina economy said to wrap up his speech.\n\nAs to who would eventually coach the much-anticipated NRL team, Mr V'landys ensured Panthers multi-premiership-winning mentor Ivan Cleary would have an awkward few days ahead.\n\n\"I'll say something controversial - there's a reason why the prime minister was at Penrith,\" he said.",
    "source": "Yahoo",
    "cluster_id": 38
  },
  {
    "url": "https://au.news.yahoo.com/high-honour-labor-powerbroker-laid-234800820.html",
    "title": "‘Legend’: Albo’s tribute to Richardson",
    "publish_date": "2025-12-09T00:50:51Z",
    "category": "finance",
    "authors": [],
    "text": "Anthony Albanese has paid tribute to Graham Richardson as someone “bigger than a Labor legend” at the political kingmaker’s state funeral.\n\nThe Prime Minister delivered the eulogy at Richardson’s funeral service on Tuesday, where a number of high-profile political figures have joined the crowd of mourners.\n\nRichardson died aged 76 in November, having battled health issues for years.\n\n“He transcended tribalism to become something bigger than a Labor legend,” Mr Albanese said on Tuesday.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\n“Richo knew everyone and everyone knew Richo. He was as comfortable in the circles of the powerful, the famous and the wealthy as he was in the front bar.\n\n“That was the thing about Richo - he could talk to anyone and, importantly, listen to anyone as well.”\n\nThe first mourners to gather at St James’ Church in Sydney’s CBD on Tuesday morning included the new One Nation MP Barnaby Joyce and controversial neurosurgeon Charlie Teo.\n\nGraham Richardson is survived by his wife Amanda and son D'Arcy. Pic: Instagram\n\nGraham Richardson promised to hang on until his son D'Arcy Richardson completed his HSC exams, a promise he kept. Picture: Supplied.\n\nThe coffin has arrived at St James Church ahead of the service. Picture: NewsWire,\n\nAnthony Albanese will also be in attendance and will deliver the eulogy, before tributes and vignettes from Deputy Prime Minister Richard Marles, ambassador to the Holy See Keith Pitt, and former prime minister Tony Abbott.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nAlso spotted among the mourners is embattled media figure Alan Jones, Home Affairs Minister Tony Burke, Nationals senator Matt Canavan, former Queensland premier Annastacia Palaszczuk and billionaire Gretel Packer.\n\nJones and Richardson co-hosted the Sky News show ‘Richo + Jones’ for several years before Mr Richardson’s ill-health saw him replaced by Mark Latham.\n\nSome of the country’s most powerful figures are expected to be in attendance. Picture: NewsWire\n\nThe Prime Minister will give Mr Richardson’s eulogy. Picture: NewsWire\n\nRichardson first entered the Senate in 1983 before going onto serve as a Cabinet minister in both the Hawke and Keating governments.\n\nHe is regarded as one of the main players both in installing Bob Hawke as prime minister and in the leadership coup of 1991 that saw then-treasurer Paul Keating take the federal leadership.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nHe resigned from parliament in 1994 and went on to be a political commentator and regular contributor to Sky News Australia.\n\nDespite his ailing health, Mr Richardson promised to live until his son D’Arcy had completed his HSC exams.\n\nThe funeral’s venue was changes last minute from St Marys Cathedral to St James’ Church New South Wales. Picture: NewsWire,\n\n“When he had his big health challenge, he said to his wife Amanda, ‘I’m going to live till I see Darcy finish exams and his HSC’,” 2GB host Ben Fordham told the station in the wake of his death.\n\n“Darcy did his last HSC exam on Thursday, which was his French exam. And Richo died this morning.”\n\nThe funeral service is due to begin at 11am.\n\nThe venue of Richardson’s service was changed from St Mary’s Cathedral to the Anglican Church at the 11th hour on Friday.\n\nThe change occurred due to the Richardson family’s desire to have his coffin draped with the Australian flag or the flag of the St George Dragons, the Daily Telegraph reported.\n\nMore to come.",
    "source": "Yahoo",
    "cluster_id": 39
  }
]