[
  {
    "url": "https://www.9news.com.au/national/prime-minister-anthony-albanese-invites-uae-retail-giant-to-australia-to-challenge-coles-and-woollies/06837547-fdb1-41d9-9eb6-f1ce16c79134",
    "title": "PM invites global retail giant to Australia to challenge Coles and Woolies",
    "publish_date": "Tue, 30 Sep 2025 00:59:37 +0000",
    "category": "finance",
    "authors": [
      "Sep"
    ],
    "text": "P﻿rime Minister Anthony Albanese has invited a United Arab Emirates retail chain to come to Australia to break up the Coles and Woolworths duopoly.\n\nHe met with LuLu Hypermarket chairman Yusuff Ali in Abu Dhabi on his way home from an 11-day diplomatic trip to meet world leaders in New York and London.\n\nLuLu Hypermarket is one of the largest retail chains in the Middle East, with more than 260 stores across the Gulf.\n\nREAD MORE: ﻿ RBA almost certain to leave interest rates on hold\n\nPrime Minister Anthony Albanese with Lulu Chairman Yusuff Ali during a visit to Lulu Hypermarket. (Dominic Lorrimer)\n\n﻿Albanese ﻿confirmed he had formally asked Ali to bring LuLu to Australia to drive greater competition.\n\n\"I want to see more competition. That's one of the things that it can bring,\" he told reporters in Abu Dhabi.\n\n\"This is a significant company. They are the largest throughout the Middle East. They're the second-largest in Saudi Arabia.\n\n\"We know that Aldi has come to Australia, and this is a significant player that has an engagement with Australia, and I want to see more competition.\"\n\nThe Australian Competition and Consumer Commission ﻿in March this year estimated that Woolworths dominates 38 per cent of all supermarket sales, while Coles controls 29 per cent and Aldi owns nine per cent.\n\nPrime Minister Anthony Albanese poses with Arnott's Shapes at the LuLu Hypermarket. (Dominic Lorrimer)\n\nIt also found Australia's supermarkets are among the most profitable in the world as grocery prices jumped 24 per cent in five years. ﻿\n\nLuLu Hypermarket imports some of its products from Australia, with beef and Tim Tams among some of the items retailing for cheaper in the UAE.\n\nThe retail conglomerate laid out the red carpet for the prime minister during a tour of one of its stores, with ﻿Australian products and flags on display.\n\nAli ﻿said he was \"very happy\" to welcome Albanese.\n\n\"I am very honoured, and I am thankful to his excellency for visiting and to display and show our Australian products, and very high-quality products which Australia is exporting and we are importing,\" he said.\n\nPrime Minister Anthony Albanese with LuLu Global Director, Global Operations and Chief Sustainability Officer Mohamed Althaf MM and Lulu Chairman Yusuff Ali. (Dominic Lorrimer)\n\nAlbanese is celebrating a new free trade agreement with the UAE, which will remove tariffs on 99 per cent of Australian exports and increase investment from the UAE sovereign wealth fund into Australia.\n\n\"What that does is open up all of the markets of the Middle East through the United Arab Emirates that are an important trading partner for Australia,\" he said.\n\n\"This is important to deliver for Australian businesses, for Australian consumers and for our economy﻿.\"",
    "source": "9News",
    "cluster_id": 0
  },
  {
    "url": "https://www.9news.com.au/national/retirement-crisis-facing-millions-of-australian-women/a8fb73ec-2d41-4d5b-9dcc-8ff3eb082c41",
    "title": "The millions of Australians at risk of retiring into poverty",
    "publish_date": "Tue, 30 Sep 2025 00:36:21 +0000",
    "category": "finance",
    "authors": [
      "Sep"
    ],
    "text": "Millions of o﻿lder women in Australia face entering retirement in poverty, unless action is taken, a new report today warns.\n\nWhile the superannuation gap has historically been put down to women having children and accumulating less super﻿, events later in life are also behind the shortfall, research commissioned by the Super Members Council (SMC) found.\n\nThey include separation with partners, unpaid caregiving for older relatives, and family violence.\n\nOlder Australian women face entering retirement in poverty, a new report warns. (AFR)\n\nThey can dramatically erode women's ability to save for retirement, and could mean up to $95,000 less in super.\n\n﻿Super Members Council chief executive Misha Schubert says the report's findings should be a wake-up call for policymakers.\n\n\"Australia has made important strides in recent years on the gaps in pay, super and workforce participation, but this research shines a spotlight on the need for further bold reforms to ensure our retirement system truly works for women – especially low-income women,\" Schubert said.\n\n\"Without urgent action, generations of Australia's lowest-paid women risk poverty in retirement.\"\n\nThe report also found rising numbers of single older women are now renting, with nearly 60 per cent of older female renters already living below the poverty line.\n\nWomen are retiring with 25 per cent less superannuation than men. (Getty Images/iStockphoto)\n\nPolicies enabling women to withdraw super early for house deposits would make them significantly poorer in retirement, with less income to live on.\n\nThe SMC data showed women today retire with 25 per cent less super than men.\n\nThe median super balance of women aged 60 to 64 is $51,000 lower than for men, and women are around 10 per cent more likely to have no super at all.\n\nFrom July 1, ﻿new parents taking paid maternity or paternity leave can be paid superannuation.\n\nSchubert said this and other reforms are welcome, but more needs to be done.\n\nThey include: unfreezing the Low-Income Super Tax Offset, to help low-income women to build their super; paying super for all workers, including nannies, housekeepers and carers, and for all workers aged under 18; and enabling fairer splitting of super in divorce settlements whether or not they are handled in a court.",
    "source": "9News",
    "cluster_id": 1
  },
  {
    "url": "https://www.9news.com.au/national/alcoa-alumina-refinery-to-close-in-kwinana-western-australia/1b5affd3-879b-4ad5-acae-9fb4d1e6fe7f",
    "title": "Jobs to go as Western Australia refinery shut down",
    "publish_date": "Tue, 30 Sep 2025 00:14:54 +0000",
    "category": "finance",
    "authors": [
      "Sep"
    ],
    "text": "Jobs will be lost as a major alumina refinery shuts down in Western Australia .\n\nThe US-based Alcoa Corporation has announced it would permanently close its Kwinana refinery, which curtailed production in June last year.﻿\n\nThe refinery currently has about 220 employees, a number Alcoa said would be \"reduced\" during 2026 in the closure process.\n\nREAD MORE: Nicole Kidman and Keith Urban split after 19 years of marriage\n\nAlcoa will close its Kwinana refinery in Western Australia. (Trevor Collens)\n\nSome employees will remain beyond 2026 to prepare the site for future redevelopment.\n\nFactors in the decision to shut down the refinery included the age of the facility, scale and operating costs, market conditions and bauxite grade challenges.﻿\n\n\"Alcoa operated the Kwinana refinery for a number of years in a challenging environment and made the difficult decision to permanently close the facility after unsuccessfully exploring multiple options for a sustainable path to restarting,\" Alcoa chief operations officer and executive vice president Matt Reed.\n\n\"We appreciate the dedication and support of our Kwinana employees, contractors and suppliers who have made a major contribution to Western Australia's economic development and prosperity over more than six decades.\"\n\nREAD MORE: Aussie industry worth billions of dollars under threat\n\nHundreds of jobs are at risk. (Trevor Collens)\n\n﻿The company will work with the WA state government on site redevelopment options and potential future land use.\n\nAlcoa will also continue to operate its port and rail facilities at Kwinana, along with its other Western Australian and Victorian operations.",
    "source": "9News",
    "cluster_id": 2
  },
  {
    "url": "https://www.9news.com.au/finance/interest-rates-almost-certain-to-be-left-on-hold-by-rba/a4ea66fe-689d-465a-8152-73d5530397a4",
    "title": "RBA almost certain to leave interest rates on hold",
    "publish_date": "Mon, 29 Sep 2025 22:08:39 +0000",
    "category": "finance",
    "authors": [
      "Sep"
    ],
    "text": "The Reserve Bank of Australia (RBA) will today hand down its latest interest rate decision, but borrowers hoping to be handed another rate cut are likely to be disappointed.\n\nStrong inflation figures have cooled hopes, with markets forecasting only an 8 per cent chance the central bank will announce a cash rate reduction at 2.30pm today.\n\nThe consensus among economists is the RBA will maintain the cash rate at 3.6 per cent, with mortgage holders unlikely to see a cut before November.\n\nRBA governor Michele Bullock is almost certain to announce today interest rates will be left on hold. (RENEE NOWYTARGER)\n\nThe cautious strategy by the RBA comes on the back of ABS figures released earlier this month showing inflation hit a 12-month high for August.\n\nThe annual trimmed mean inflation, the RBA's preferred measure of underlying inflation, was at 2.6 per cent for the month.﻿﻿\n\nA panel of 32 financial experts quizzed about the next rates move came to the unanimous ﻿conclusion the RBA has little room to make a cut today.\n\nDespite strong consumer spending, rising inflation and increasing unemployment paint a mixed economic picture.\n\nThe experts canvassed by Finder said the RBA was seeking a step-by-step reduction in the cash rate.\n\n\"No doubt the RBA is on a slide down with the cash rate.\n\n\"However, the several promised cuts will be spread over quite some time, and we should not expect a cut at every single meeting,\" Tomasz Wozniak, from the University of Melbourne, said.﻿\n\nIt's likely mortgage holders will be left eying the next RBA board meeting on November 4, which is also Melbourne Cup Day, for any cash rate cut.\n\nSebastien Mullins, head of multi-asset and fixed income at global investment firm Schroders,﻿ told Today this morning that markets are pricing in a 50 per cent chance reduction by the RBA in November.\n\n\"Either they cut or don't cut, we'll have the October number or the official September inflation data by then. So they'll actually have more clarity at that point.\"",
    "source": "9News",
    "cluster_id": 3
  },
  {
    "url": "https://www.9news.com.au/world/youtube-to-pay-millions-to-settle-donald-trump-lawsuit-over-suspended-account/23216830-5086-415c-9d03-191862121618",
    "title": "YouTube reveals seven-figure payout to settle Trump lawsuit",
    "publish_date": "Mon, 29 Sep 2025 23:46:28 +0000",
    "category": "finance",
    "authors": [
      "Sep"
    ],
    "text": "YouTube agreed to pay US$24.5 million ($37.26 million) to settle a lawsuit filed by US President Donald Trump after he was suspended by social media platforms following the January 6, 2021, insurrection.\n\nThis makes Alphabet-owned YouTube the last of the three Big Tech social media companies sued by Trump – which included Meta and then Twitter, now called X – to settle over his removal from their platforms.\n\nYouTube will pay US$22 million ($33.46 million) to settle the claims made by Trump to the nonprofit Trust for the National Mall, which is \"dedicated to restoring, preserving, and elevating the National Mall, to support the construction of the White House State Ballroom,\" according to a court document.\n\nREAD MORE: Nicole Kidman and Keith Urban split after 19 years of marriage\n\nYouTube agreed to pay US$24.5 million to settle a lawsuit filed by President Donald Trump. (CFOTO/Future Publishing/Getty Images/File via CNN)\n\nThe social media company will also pay US$2.5 million ($3.8 million) to settle with other plaintiffs, such as the nonprofit American Conservative Union.\n\nYouTube directed CNN to the court document when asked for comment.\n\n﻿Meta agreed to settle Trump's lawsuit in January for US$25 million ($38.02 million).\n\nX's settlement in February involved a payment of around US$10 million ($15.21 million), according to the New York Times.\n\nREAD MORE: Aussie industry worth billions of dollars under threat\n\nMark Zuckerberg, chief executive officer of Meta Platforms Inc, from left, Lauren Sanchez, Jeff Bezos, founder of Amazon.com Inc., Sundar Pichai, chief executive officer of Alphabet Inc., and Elon Musk, chief executive officer of Tesla Inc., during the 60th presidential inauguration in the rotunda of the US Capitol in Washington, DC. (Bloomberg)\n\nWhen they suspended his accounts, the platforms said Trump's posts about the riot risked inciting further violence.\n\nAt the time, legal experts said similar suits had been dismissed because tech companies have the right to run their platforms as they see fit.\n\nHowever, the settlements come as tech giants have taken a more conciliatory, if not outright supportive, approach to Trump and Republican interests since he took office in January.\n\nAfter Elon Musk acquired X – then known as Twitter – in late 2022, he reinstated Trump's account; Meta followed suit in February 2023 and YouTube the following month.\n\nTrump's accounts were suspended after the January 6 insurrection. (Photo by Samuel Corum / Getty Images)\n\nMusk, Meta chief executive Mark Zuckerberg and Alphabet chief executive Sundar Pichai all sat front and center at Trump's inauguration, and social media platform has rolled back content moderation efforts that Republican users had likened to censorship.\n\nJust last week, YouTube said it would reinstate some accounts banned for violating now-defunct rules meant to curb repeated posting of misinformation, including about the results of the 2020 election.\n\nIn its announcement, the company said it \"values conservative voices on its platform and recognises that these creators have extensive reach and play an important role in civic discourse.\"",
    "source": "9News",
    "cluster_id": 4
  },
  {
    "url": "https://www.9news.com.au/world/nicole-kidman-keith-urban-separate-us-media-reports/5f822d9d-b6c7-4085-8e53-937da06a0378",
    "title": "Nicole Kidman and Keith Urban have split, US outlets report",
    "publish_date": "Mon, 29 Sep 2025 21:43:56 +0000",
    "category": "sports",
    "authors": [
      "Sep"
    ],
    "text": ": Stay across all the latest in breaking news, sport, politics and the weather via our news app and get notifications sent straight to your smartphone. Available on the",
    "source": "9News",
    "cluster_id": 5
  },
  {
    "url": "https://www.9news.com.au/national/sky-news-australia-cancels-freya-leach-program-freya-fires-up-after-six-weeks/c622f43d-0305-40d8-8916-92e674eae1d8",
    "title": "Sky News Australia axes Freya Leach's new show after guest's anti-Islam comments",
    "publish_date": "Mon, 29 Sep 2025 06:14:32 +0000",
    "category": "finance",
    "authors": [
      "Sep"
    ],
    "text": "S﻿ky News Australia has axed its new program Freya Fires Up after six weeks on the air.\n\nThe network confirmed the After Dark show, hosted by Freya Leach, has been pulled from its line-up following an incident where a guest wore bacon rashers on his shoulders during a segment in which he made anti-Islam comments.\n\nA spokesperson for News Corp Australia, which owns Sky News Australia, said Freya Fires Up will be cancelled after just six ﻿episodes.\n\nWilliams appeared on the Sky News Australia program Freya Fires Up on September 21. (Sky News)\n\nLeach, 22, will remain a co-host of The Late Debate on Sky.﻿\n\n\"We have undertaken a thorough internal review, implemented its recommendations and taken appropriate action with everyone involved in this incident,\" a spokesperson told The Sydney Morning Herald.\n\n\"We took immediate action during the live broadcast to cut off the guest, our host promptly apologised, and we ensured the content was not published or republished to any of our digital platforms.\"\n\nScottish-born ﻿Ryan Williams, 33, appeared on the show on Sunday, September 21.\n\nHe was introduced by Leach as a \"social media sensation\", before Williams made disparaging remarks about Islam.\n\nThe segment was pulled from the air just one minute into the live broadcast.\n\n﻿\"I've just been told we have to apologise for what was just aired, those comments earlier,\" Leach told viewers shortly after.\n\nLeach then apologised during T﻿he Late Debate the following Monday.\n\nIt was initially reported that Sky News Australia would pre-record Freya Fires Up after Williams' appearance.\n\n\"Sky News Australia apologises unreservedly for the deeply offensive comments made by a guest during a live broadcast on Sunday evening,\" Sky said last week.\n\n\"We recognise the harm such rhetoric can cause and take full responsibility for this failure in our editorial processes.\"\n\nThe show did not air last night.﻿\n\n9news.com.au has contacted News Corp and Leach for comment.﻿",
    "source": "9News",
    "cluster_id": 6
  },
  {
    "url": "https://www.abc.net.au/news/2025-09-30/afl-community-react-to-geelongs-disrespectful-mad-monday/105834040",
    "title": "AFL community reacts to Cats' 'disrespectful' and 'embarrassing' Mad Monday",
    "publish_date": "Tue, 30 Sep 2025 01:46:37 +0000",
    "category": "sports",
    "authors": [],
    "text": "Kane Cornes has labelled Geelong's Mad Monday antics \"disrespectful\" and \"embarrassing\", after a slew of social media posts raised eyebrows across the AFL community, including one referencing his Seven colleague Caroline Wilson.\n\nCats star Bailey Smith posted a picture with teammate Max Holmes dressed as award-winning journalist Wilson with the caption \"Caro has never looked better\" with a water emoji. It was quickly deleted but had already been widely circulated across social media.\n\n\"Imagine Max Holmes thinking it's a good idea to disrespect a legend of Australian football media in Caroline Wilson and trying to ridicule her,\" former Port Adelaide player Cornes said on SEN Trade Radio.\n\n\"And have a photo of that and put the captain alongside of it.\"\n\n'Makes you a loser': Brown hits out at Cats players over Mad Monday post Photo shows Two men smiling for the camera in costumes, one dressed as a woman, the other with a western hat and moustache. Mitch Brown, the first AFL player to reveal he is bisexual, hits out at Bailey Smith and Patrick Dangerfield over a social media post from Mad Monday.\n\nHolmes has gone as media personalities in past Geelong Mad Mondays, dressing up as SEN's Gerard Whateley in 2023 and Channel 7's Mitch Cleary in 2024.\n\nThese were widely received by the footballing community as in good taste, however, many took issue with the posting of the Wilson outfit.\n\nSmith's post came just weeks after he apologised by text to Geelong Advertiser photographer Alison Wynd for verbally abusing her at an open training session.\n\nMembers of the AFL's LGBTQIA+ community also took issue with another Instagram post from Smith, which referenced Brokeback Mountain while he and captain Patrick Dangerfield were hugging.\n\n\"This is what losing a granny does to you,\" Smith wrote.\n\nMitch Brown, the first AFL player to publicly reveal he is bisexual, joked via his own social media post: \"Just for the record Heath Ledger's way hotter\".\n\nHe then added, \"In all seriousness though, guys do better\".\n\n\"Last time I checked, losing a grand final doesn't make you gay, but being homophobic definitely makes you a loser.\"\n\nBailey Smith and Patrick Dangerfield pose during Geelong's Mad Monday celebrations. (Instagram)\n\nChief executive of Pride Cup Hayley Conway told ABC Sport it was disappointing to see jokes that centred around sexuality still featured at Mad Monday celebrations.\n\n\"My first reaction is how disappointing it is to see people using the experiences of gay and bisexual men — which is what the film Brokeback Mountain is about — as a punchline in a joke when they should be out celebrating what was really a pretty terrific season for the Geelong Cats,\" Conway said.\n\n\"Any joke like this has a really meaningful and deep impact on people. It stops them from coming out, it stops them from being true to who they are.\n\n\"LGBTQI young people have a six times higher rate of suicide than their straight peers. I think if we weigh that up, is it about the importance of a young person and their dignity and their self-respect or is it about our ability to tell a joke that we feel is funny — to me, that is not an equation at all.\"\n\nCornes also took issue with Brad Close, who dressed up as fanatical Geelong supporter \"Catman\".\n\n\"I thought that was one of the more embarrassing days at the Geelong footy club that I've seen in a while,\" Cornes said.\n\n\"They've owned this space for a long time, but at some point, you have just got to say, it's not book week, we're not in year five.\"",
    "source": "ABC",
    "cluster_id": 7
  },
  {
    "url": "https://www.abc.net.au/news/2025-09-30/australias-glenn-maxwell-out-of-nz-t20-series-with-broken-arm/105833900",
    "title": "Glenn Maxwell out of T20 series against NZ after mishap in nets",
    "publish_date": "Tue, 30 Sep 2025 01:15:41 +0000",
    "category": "sports",
    "authors": [],
    "text": "Glenn Maxwell's shocking luck continues with a broken arm forcing the Australian star out of the T20 series against New Zealand.\n\nHe was bowling to Mitch Owen at training in the nets when his big-hitting teammate launched into a drive that hit Maxwell near the wrist.\n\nThey were training at Mount Maunganui ahead of the three-game T20 tour, which starts on Wednesday.\n\nNSW wicketkeeper-batter Josh Philippe has been called up as the Victorian's replacement.\n\nMaxwell will need medical advice on the injury and it's unclear when he will play next.\n\nAfter the New Zealand series, the Australian T20 team will host India in a month's time for a five-game series.\n\nThe two series are important parts of Australia's build-up to the T20 World Cup next year in India and Sri Lanka. Australia last won the tournament in 2021.\n\nMatthew Short was batting next to Owen at Tauranga's Bay Oval when the accident happened.\n\nCan't get enough cricket from Grandstand? Tune in for the latest cricket news, interviews and analysis from the ABC team in the Grandstand Cricket Podcast.\n\n\"I saw [Owen] smoked it and then the aftermath, it hit Maxi on the wrist. It didn't sound good,\" Short told Cricket Australia.\n\n\"[Owen] is not the guy you want to be bowling to in T20 training, that's for sure.\"\n\nThree years ago, Maxwell suffered a broken leg when a friend fell on him at a 50th birthday party.\n\nThen he was concussed at the 2023 World Cup in another freak accident when he fell off a golf cart.\n\nAustralia had already lost Josh Inglis to a calf muscle injury for the New Zealand series and Alex Carey took his place.\n\nAAP",
    "source": "ABC",
    "cluster_id": 8
  },
  {
    "url": "https://www.abc.net.au/news/2025-09-30/man-missing-after-east-lismore-house-fire-northern-nsw/105833494",
    "title": "Man missing after fire destroys home in northern NSW",
    "publish_date": "Tue, 30 Sep 2025 01:11:30 +0000",
    "category": "finance",
    "authors": [],
    "text": "A man is unaccounted for after a \"very dangerous\" fire destroyed a home in northern New South Wales.\n\nFire and Rescue New South Wales (FRNSW) received numerous triple-0 calls about 5.47am.\n\nActing Chief Superintendent Tom Cooper said responders arrived at the Belvedere Drive address in East Lismore to find the fire was \"well developed\".\n\n\"They [firefighters] described that the flames were through the roof and there was a lot of smoke about,\" he said.\n\n\" They quickly got to work ... unfortunately, the fire had taken hold and the building was well alight when they arrived. \"\n\nFire and Rescue NSW says the fire caused significant structural collapse. (ABC News: Cathy Adams)\n\nChief Superintendent Cooper said the situation was more challenging because the roof had collapsed.\n\n\"It's a two-level brick veneer dwelling and it has timber beams and all that sort of thing in the roof,\" he said.\n\n\"But it has concrete roof tiles, which are very heavy and the beams have burned away, so it's very dangerous for firefighters to enter that structure.\"\n\nChief Superintendent Cooper said a man who lived at the address was unaccounted for when crews arrived.\n\nSpecialist investigators are working to determine the cause of the blaze.",
    "source": "ABC",
    "cluster_id": 9
  },
  {
    "url": "https://www.abc.net.au/news/2025-09-30/southern-cross-austereo-and-seven-west-media-merge/105833848",
    "title": "Breaking: Kerry Stokes to stand down as Seven West Media chair amid Austereo merger",
    "publish_date": "Tue, 30 Sep 2025 00:53:56 +0000",
    "category": "finance",
    "authors": [],
    "text": "Media magnate Kerry Stokes will stand down as chair of Seven West Media after the company announced plans to merge with Southern Cross Media.\n\nIn a deal that will have major implications for the Australian media sector, the partnership would bring radio networks Triple M and Hit together with the Seven Network.\n\nThe move will see Kerry Stokes step down as the chairman of Seven West Media, which owns the Channel 7 TV network and the state's daily newspaper, The West Australian.\n\nMr Stokes would chair the board of the combined group until February 2026 when he will hand the reins to Heith Mackay-Cruise, the current chair of Southern Cross Radio.\n\nJeff Howard, who is the current managing director and chief executive of Seven West Media, will take the helm as chief executive.\n\nSeven West Media's headquarters is in Osborne Park, eight kilometres from Perth's CBD. (ABC News: Greig Johnston)\n\nThe merger would create a \"leading integrated multi-media platform, delivering world-class content to national and local audiences\" through free-to-air television, streaming, audio, digital and publishing platforms.\n\nBut the move will be closely scrutinised by Australian's competition and media watchdogs, with regulatory approval still required from the Australian Communications and Media Authority (ACMA) and the Australian Competition and Consumer Commission (ACCC).\n\nGas project delays see domestic market tapped for exports Photo shows An aerial view of a gas project with the sun low in the sky behind it. A gas development backed by media mogul Kerry Stokes has been tapping into Western Australia's domestic gas market to supply overseas customers amid long delays in the delivery of the plant.\n\nWhile the boards of both companies have backed the merger, shareholders will also need to approve the plan.\n\n\"The combination of these two companies brings together the best creators of media content in the country, delivering significant financial and strategic benefits for SWM shareholders,\" Mr Stokes said.\n\n\"This is an important merger, as the combined company will be better able to serve both metropolitan and regional viewers, listeners, partners and advertisers.\n\n\"It will add strength to each of the combined businesses' television, audio, digital and publishing operations across the country.\"\n\nUnder the merger, Seven West Media shareholders will receive 0.1552 Southern Cross Media Group (SCA) shares for every Seven West Media (SWM) share, which would result in SWM shareholders and SCA shareholders owning 49.9 per cent and 50.1 per cent of the combined business, respectively.",
    "source": "ABC",
    "cluster_id": 10
  },
  {
    "url": "https://www.abc.net.au/news/2025-09-30/alcoa-announces-permanent-closure-of-kwinana-aluminium-refinery/105833688",
    "title": "Hundreds of jobs axed as aluminium giant confirms closure of Perth refinery",
    "publish_date": "Tue, 30 Sep 2025 00:38:32 +0000",
    "category": "finance",
    "authors": [],
    "text": "US aluminium giant Alcoa says there is no \"sustainable\" path to restarting its Kwinana refinery in Western Australia after winding down production at the facility.\n\nAlcoa started phasing out its workforce at the Kwinana Alumina Refinery in January 2024, which one economic expert estimated would cut roughly $650 million from the state's economy per year.\n\nIn a statement, Alcoa's chief operations officer Matt Reed said the company had assessed the \"future of the refinery, including restart and closure\" since the curtailment.\n\nAlcoa's COO Matt Reed says the refinery's future, \"including restart and closure\", has been assessed. (ABC News: Cason Ho)\n\n\"Alcoa operated the Kwinana refinery for a number of years in a challenging environment and made the difficult decision to permanently close the facility after unsuccessfully exploring multiple options for a sustainable path to restarting,\" he said.\n\n\"We appreciate the dedication and support of our Kwinana employees, contractors and suppliers who have made a major contribution to Western Australia's economic development and prosperity over more than six decades.\"\n\nAround 1,000 jobs lost as Alcoa shuts alumina refinery Photo shows An empty beach leads to a heavy industrial area with large smoke plumes Around 1,000 workers are set to lose their jobs as Alcoa announces it will phase down production at its alumina refinery in Perth's south.\n\nMr Reed said it was a \"commercial decision\" when Alcoa initially announced it was winding down production in 2024, citing the facility's age, operating costs, and market conditions.\n\n\"We are very much committed to WA and are continuing to run two large refineries in the state,\" Mr Reed said at the time.\n\nThe company said it would spend approximately $US890 million ($1.4 billion) on \"restructuring and related charges\" in the third quarter of 2025, and an additional $US600 million over the next six years on costs related to the closure.\n\nWorkforce phased out\n\nAlcoa said the refinery had a workforce of around 800 employees at the start of 2024 before the initial shutdown of production, and that the number had been cut down to about 220 employees.\n\nThe company said most of the workforce would continue to be gradually phased out.\n\nAn aerial view of Alcoa's Alcoa refinery, south of Perth, which has been closed since last year. (Supplied: Nearmap)\n\n\"Certain employees will remain beyond 2026 to prepare the site for future redevelopment,\" an Alcoa statement said.\n\nAlcoa said the Kwinana refinery represented about 16 per cent of its global refining capacity of 13.9 million tonnes, now reduced to 11.7 million tonnes.\n\nThe aluminium giant has been mining and refining alumina in WA since the 1960s.\n\nIts announcement comes as the state's Environmental Protection Authority assesses the company's proposals to expand its mining operations in the world's only jarrah forests, in WA.",
    "source": "ABC",
    "cluster_id": 2
  },
  {
    "url": "https://www.abc.net.au/news/2025-09-30/fruit-and-vegetable-prices-remain-high-in-kimberley/105749056",
    "title": "Remote WA residents pay $18 for a watermelon quarter",
    "publish_date": "Mon, 29 Sep 2025 23:48:27 +0000",
    "category": "finance",
    "authors": [],
    "text": "At small-town supermarkets in Western Australia's far north, a quarter of a watermelon could set you back $18, and you may pay up to $30 for a kilogram of truss tomatoes.\n\nIn Sydney or Melbourne supermarkets, you would pay around half that price for watermelon, and three times less for the tomatoes.\n\nMegan Krakouer says the price of tomatoes and watermelon in Halls Creek is \"astronomical\". (Supplied: Megan Krakouer)\n\nPerth-based First Nations advocate Megan Krakouer visited a supermarket in Halls Creek in August and said some of the prices were \"astronomical\" — including tomatoes priced at $11.99 per kilogram and watermelon at $6 per kilogram.\n\n\"We're living in a cost-of-living crisis — how are people supposed to be able to feed their families healthily with prices like this?\" she said.\n\nMegan Krakouer says she has been shocked by the prices in Halls Creek's only supermarket. (ABC News: Keane Bourke)\n\nAlmost 300 kilometres away in Fitzroy Crossing, red gala apples were priced at $12.99 per kilogram and pears at $10.99 per kilogram.\n\nIn the coastal tourist town of Broome, supermarket giant Coles listed red gala apples for $8.90 per kilogram and pears at $6.90 per kilogram.\n\nSupermarkets in metropolitan areas list those same products for around half the price.\n\nApples and pears cost around double in Fitzroy Crossing compared to major metro supermarkets. (Supplied)\n\nConcerns of food insecurity\n\nResidents in Fitzroy Crossing and Halls Creek have one supermarket in their town, a local IGA, which also services surrounding remote communities.\n\nMarianne Skeen says the price of healthy food in Halls Creek is impacting the community's wellbeing. (ABC Kimberley: Erin Parke)\n\nFormer Halls Creek health worker and resident Marianne Nungarri Skeen said the cost of fresh food had been an ongoing issue leading to chronic health issues such as diabetes and heart problems.\n\n\"It's a vicious cycle that needs to be stopped. We need to have something better in place,\" she said.\n\nFitzroy Crossing resident Patrick Davies said some people were struggling to feed their families, while others travelled to Broome or Derby to do their shopping.\n\n\"The employment benefits that people do receive don't necessarily meet the needs of … families,\" he said.\n\nWhy are costs so high?\n\nIn February, the Australian Competition and Consumer Commission found prices were \"significantly higher\" in remote locations due to freight costs and lack of competition.\n\nThe final inquiry report into Australia's supermarkets also found remote independent supermarkets were faced with greater costs when procuring products compared to larger supermarket chains.\n\nWayne Bergmann is the managing director of Leedal Pty Ltd, which owns Fitzroy Crossing's Tarunda IGA.\n\nHe said transport, the town's small population, worker shortages and insurance were all pricing factors.\n\nA kilogram of truss tomatoes in Fitzroy Crossing has recently been priced at $28.99. (Supplied)\n\n\"There isn't enough scale when you add the transport cost and logistics of organising things, the cost of keeping the supermarket open seven days a week, the cost to find workers to work in the supermarket,\" he said.\n\n\"The biggest cost that impacts the whole group is insurance … we pay over $1 million a year in insurance and it doesn't even cover floods.\n\n\" On average across the board, we probably spent about $700,000 a year on freight. \"\n\nHe said the supermarket was trying to reduce costs using a range of strategies, including selling fresh produce with blemishes at a lower price, and selling meat from local pastoral stations.\n\n\"We see the supermarket in Fitzroy as a bit of a social responsibility,\" he said.\n\n\"I don't think we're the cheapest but I think we're in between.\"\n\nPaying the price for government 'inaction'\n\nThe federal government began its Low-Cost Essentials Subsidy Scheme in July, which aimed to reduce the cost of 30 essential items across 152 remote stores throughout the country.\n\nInitially some fresh fruit, vegetables and meat were expected to be on the essentials list, but that has since changed to canned items, with the government citing the company delivering the program's lack of \"cold storage capacity\".\n\nThe government says its Low-Cost Essentials Subsidy Scheme will reduce the cost of 30 items in 152 remote stores. (Supplied: NIAA)\n\nFitzroy Crossing nutritionist Clint Bussey said while \"any help\" was appreciated, he would like to see more fresh produce at \"lower costs, better quality and routinely available\".\n\n\"With tinned items … when people consume these regularly their salt intake increases, so then you get things like renal diseases [and] high blood pressure,\" he said.\n\nA government spokesperson said an expert advisory group was established to determine the list of 30 essential items.\n\nHalls Creek IGA did not respond to requests for comment.",
    "source": "ABC",
    "cluster_id": 11
  },
  {
    "url": "https://www.abc.net.au/news/2025-09-30/nrl-grand-final-2025-jordan-riki-seeks-nrl-redemption/105833446",
    "title": "Broncos star says pain of 2023 has his team on a redemption mission",
    "publish_date": "Mon, 29 Sep 2025 23:29:50 +0000",
    "category": "sports",
    "authors": [],
    "text": "Brisbane second-rower Jordan Riki talks about his desire for redemption for the 2023 grand final loss with more passion than most.\n\nMost Broncos will speak of it, but Riki is forthright and digs deep into his feelings about that heartbreaking 26-24 defeat to Penrith, the lessons learned and why he's ready to atone against Melbourne on Sunday.\n\nThe 25-year-old played one of the best, if not the best, games of his career in the 16-14 comeback preliminary final win over the Panthers on Sunday.\n\nHis 48 tackles, including two crucial defensive plays to stop Nathan Cleary from scoring in the second half, plus his trademark kick-chase game, were on-song. It was the big moments he won that were the key.\n\nMaking up for the 2023 loss, where he was below his best, was on his mind.\n\n\"Oh yeah. Absolutely, hands down,\" Riki said.\n\n\"It was probably on a lot of us players' minds throughout the week. It was definitely on my mind.\n\n\"I had a few chats with Madge (coach Michael Maguire). Myself and a lot of other boys … kept saying 'redemption' throughout this whole week. To tick that box and obviously move on to the grand final is going to be awesome.\n\n\"All we can say is that we've been there, we've done that and we know what it's like. We took a lot of lessons from that 2023 year and obviously it's also not done. We've got one more game.\"\n\nRiki admits that he \"probably took that 2023 year for granted\" and it caught up with him in the decider.\n\n\"A lot of us boys that were in that team were deers in headlights really. We didn't really know what was going on,\" he said.\n\n\"The whole outside noise of media, fans and obviously the grand final parade … everything was a massive blur and you weren't really focusing on the game.\n\n\"Now we know that the games are most important. Obviously it's good to enjoy that week and soak it in with the fans. But at the end of the day, we have got to knuckle down and get that win.\"\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\nRiki's tackles on Cleary last Sunday showed total attention to his defensive role.\n\n\"I'd probably have clocked off a couple of years ago and not only myself, but a few of the other boys as well,\" he said.\n\n\"Madge has really nailed up into us about concentrating for the full 80 minutes.\n\n\"Concentration's massively important for us. We were a young team a couple of years ago and we've just evolved and turned into such a good team.\n\n\"I can just commend the coaching staff and everyone behind the scenes that have helped us get here.\"\n\nRiki had a wonderful match in the 26-0 qualifying final win over Melbourne in 2023. Another display like that would be just the tonic.\n\n\"They are such quality team,\" he said.\n\n\"We've had many great battles along the years. They're such a great club, great organisation and got great players as well.\n\n\"They're very experienced. It'll be a good game. I'm just excited to be able to enjoy this week with my club and my players and just go out there on grand final day.\"\n\nThe ABC of SPORT Sports content to make you think... or allow you not to. A newsletter delivered each Saturday.\n\nAAP",
    "source": "ABC",
    "cluster_id": 12
  },
  {
    "url": "https://www.abc.net.au/news/2025-09-30/tip-cat-depot-duck-animals-pets-at-work-boost-morale/105808500",
    "title": "Meet the tip cat and the depot duck boosting workplace morale",
    "publish_date": "Mon, 29 Sep 2025 23:03:47 +0000",
    "category": "finance",
    "authors": [],
    "text": "On a cold winter's day in Victoria's north-west, a five-week-old kitten is discovered dumped at a recycling centre.\n\nMildura Landfill staff who had been mourning the death of their grouchy-looking office cat leapt at the opportunity to make a new feline friend.\n\nThey named the kitten Winter and set up a spot for her in a thatched basket from where she could watch the birds outside.\n\nWinter has plenty of energy and often knocks items off people's desks. (ABC Mildura-Swan Hill: Wade Stephens)\n\nWinter has quickly become a popular fixture at the facility and is a beloved member of the team of about 20 people.\n\nWaste operations team leader Josie Good said Winter had been assigned the unofficial role of care and therapy officer.\n\n\"When you are having a bad day, it's actually quite nice just to sit and give the cat a scratch on the head … it makes you realise that things aren't really that bad,\" she said.\n\n\"I have a particular member of my team who comes in to say hello to me under false pretences.\n\n\" He's actually coming in to sit down and cuddle and pat the kitten. \"\n\nWinter is a source of comfort for the landfill staff and an energetic member of the team. (ABC Mildura-Swan Hill: Wade Stephens)\n\nBig paws to fill\n\nWinter is not the first cat to grace the landfill office.\n\nA gruff-looking male named Chopper was part of the tip team for six years until he died in January.\n\nThe original Mildura landfill cat, Chopper. (Supplied: Mildura Rural City Council)\n\n\"He was a very friendly cat and the staff had grown very fond of him,\" Mildura Rural City Council chief executive Martin Hawson said.\n\n\"He was able to make friends quickly and of course, he became a bit of a comfort for staff from time to time.\"\n\nWinter has made herself at home at the Mildura landfill. (ABC Mildura Swan-Hill: Wade Stephens)\n\nCouncil staff would routinely get updates as to Chopper's movements and experiences and the same is now happening for Winter.\n\n\"She likes to chase the cord on a mouse when it's unplugged rather than play with cat toys and she likes to push things off people's desks,\" Ms Good said.\n\n\"She's been known to make her way over to the weighbridge … sometimes she'd end up in the meeting room at a meeting.\n\n\"I have to take her home with me, so if I'm going to staff social club, she has to come with me.\"\n\nDuck Duck has befriended Parks and Gardens staff at the Kyabram depot. (Supplied: Campaspe Shire)\n\n'A bit of a cult hero'\n\nAbout five hours south-east of Mildura, parks and gardens staff at Kyabram congregate for the 9am smoko and await a familiar sight.\n\nA rotund Muscovy duck appeared one day at the Goulburn Valley depot and trekked over in pursuit of food.\n\nParks and Gardens supervisor Tony McDonell said the bird was quickly named Duck Duck.\n\n\"It's become a bit of a cult hero really,\" he said.\n\n\"It's friendly and tame.\n\n\"I was amazed — you can even feed it out of your hand if she's hungry on that given day.\"\n\nDuck Duck's makeshift Christmas tree at the Kyabram Parks and Gardens depot. (Supplied: Campaspe Shire)\n\nMr McDonnell said \"pretty much\" the whole council had come to know of Duck Duck.\n\n\"A lot of times, when you get different people come in for whatever reason, they'll always ask, 'Where's the duck? We've heard so much about it,'\" he said.\n\n\"It's had its photo taken every Friday … it's pretty well-known now, good old Duck Duck.\n\n\" It's just one of us now, part of the furniture. \"",
    "source": "ABC",
    "cluster_id": 13
  },
  {
    "url": "https://www.abc.net.au/news/rural/2025-09-30/goat-meat-salami-expansion-genetic-improvement/105814906",
    "title": "Australia is the world's biggest goat exporter — so why don't we eat it?",
    "publish_date": "Mon, 29 Sep 2025 22:31:30 +0000",
    "category": "finance",
    "authors": [],
    "text": "Australia is the world's biggest goat meat exporter, but Australians are among the least likely in the world to eat it.\n\nProducers and scientists are working to put more goat on Australian plates by looking at genetics and finding new ways to use the meat.\n\nAustralia produces about 44 per cent of the world's goat meat exports, according to Meat and Livestock Australia (MLA), and in 2024, there were nearly 3.5 million goats slaughtered, according to the Australian Bureau of Statistics.\n\nMLA's 2025 global goat meat snapshot said Australian production had increased by 248 per cent since 2020.\n\nBut in the past, only 9 per cent of domestic goat meat has been consumed locally.\n\nGoat producer Jo Stuart from Collie in western New South Wales is keen to increase that margin.\n\nShe said she found herself often having to tell people \"there's more to goat than curry\".\n\nJo Stuart, also known as The Gourmet Goat Lady, at her property in Collie. (ABC Western Plains: Jen McCutcheon)\n\nIn an effort to make goat meat more accessible, she has started producing a goat salami.\n\n\"We're hoping to bring something new to the market that people haven't tasted before,\" Ms Stuart said.\n\nShe would like to see more Australians cooking or eating meals such as goat steak, pies and sausages.\n\n\"I've always wanted it incorporated into people's food because it's … high in protein, high in iron.\"\n\nThe Measured Goats program will help identify key breeding values for the industry. (ABC Western Plains: Jen McCutcheon)\n\nPlenty of alternatives\n\nThe lack of demand from Australians has made goat meat an uncommon sight in many butcher shops.\n\nEmilio's Butcher in Rozelle, Sydney, stocks the meat, but typically only goes through one goat a fortnight.\n\n\"It's not a lot … a lot of it is bone-in diced goat … and a lot of people buy that for, I assume, curries,\" Max Sovechles said.\n\n\"I would say for the most part, people are buying it to try it, as well as some regulars who know it's here.\"\n\nGoat meat is a niche protein in Australia. (ABC News: Cam Lang)\n\nHe said the meat was often described by customers as gamey and had been hard to source in the past.\n\n\"And [there was] not a whole lot of reason to get it — we have plenty of lamb, and goat wasn't necessarily tasting better than lamb,\" Mr Sovechles said.\n\nDubbo butcher Stephen Boyle said goat had only entered displays in the last 10 years.\n\nHe said many farmers culled wild goats, which meant the quality of the meat was inconsistent.\n\nThe Measured Goats project is looking to quantify the genetics of goats, including Rangeland goats. (ABC Rural: Amy Phillips)\n\nIndustry in its infancy\n\nQuality has improved thanks to the farming of goats, and now a collaborative research and development project is aiming to increase consistency by creating a dataset of genetics.\n\nThe Measured Goats project is co-funded by the NSW Department of Primary Industry and Regional Development and Meat and Livestock Australia and led by livestock scientist Tom Granleese.\n\n\"The goat industry has not been very good adopters of using breeding values,\" Dr Granleese said.\n\nAustralia only consumes 9 per cent of its total goat production. (ABC Western Plains: Jen McCutcheon)\n\nDr Granleese said utilising breeding values was necessary for any animal breeder.\n\n\"We're aiming to breed up to 10,000 kids over these five years of the project, in five cohorts,\" he said.\n\n\"We'll come up with some really good key messages and recommendations for industry.\"\n\nGoat Industry Research, Development and Adoption Committee member James Boland said despite a higher inventory of goats on the First Fleet — upon which the animals arrived in Australia — than cattle, the latter industry had moved ahead in leaps and bounds.\n\n\"The goat industry is really still in its infancy,\" he said.\n\n\" There's a massive opportunity to do more with goats, to learn more about goats and to normalise goat meat consumption in Australia. \"",
    "source": "ABC",
    "cluster_id": 14
  },
  {
    "url": "https://www.abc.net.au/news/2025-09-30/queensland-bureaucrats-paid-termination-benefits/105833188",
    "title": "Queensland bureaucrats paid hundreds of thousands in 'termination benefits'",
    "publish_date": "Mon, 29 Sep 2025 22:17:47 +0000",
    "category": "finance",
    "authors": [],
    "text": "Queensland's former top bureaucrat has been paid hundreds of thousands of dollars in termination benefits after he was replaced by the LNP when the party came to office.\n\nMike Kaiser served as the director-general of the Department of Premier and Cabinet for roughly 10 months under former premier Steven Miles.\n\nNew figures released in the department's annual report reveal Mr Kaiser was paid \"termination benefits\" of $397,000 in the 2024-25 financial year.\n\nThe LNP was highly critical of Mr Kaiser's appointment to Queensland's top public service job ahead of last October's state election.\n\nQueenslands spends $162k to recruit bureacrats Photo shows A shot of Queensland Parliament House. Queensland taxpayers have footed a $162,500 recruitment bill for the government to hire four top bureaucrats.\n\nBefore he was made boss of the Department of Premier and Cabinet, Mr Kaiser headed up other state government departments.\n\nHe also previously briefly represented the electorate of Woodridge as a Labor MP in the early 2000s and was Labor's state secretary in the 1990s.\n\nHe has since been appointed secretary of the federal government's Department of Climate Change, Energy, the Environment and Water.\n\nHis former role of director-general of the Department of Premier and Cabinet has been permanently filled by Damien Walker.\n\nMr Walker earned a total salary of $440,000 from his appointment on December 23 last year through to June 30 this year.\n\nMore six-figure termination payments\n\nQueensland Treasury's 2024-25 annual report also shows former under treasurer Michael Carey was paid \"termination benefits\" of $460,000.\n\nMr Carey was replaced by an acting under-treasurer within days of the LNP's election victory, with the role since permanently filled by Paul Williams.\n\nMr Carey has since been appointed head of the Department of Premier and Cabinet in Western Australia.\n\nAccording to Queensland Health's annual report, its former director-general Michael Walsh was also paid termination benefits of $511,000.\n\nMr Walsh ceased his duties as the health department boss on October 31 last year, just days after the LNP came to power.\n\nForemer Queensland Health director-general Michael Walsh was paid termination benefits of $511,000, according to the report. (ABC News: Nickoles Coleman)\n\nTen directors-general were replaced by the LNP when it came to government.\n\nA spokesperson for the Crisafulli government said all protocols were followed after Queenslanders voted for a change in government.\n\n\"The Crisafulli government is focused on delivering a fresh start to Queensland after a decade of decline under Labor,\" they said.\n\nBonuses for power bosses\n\nMeanwhile, energy and power bosses at state government-owned corporations have been paid well over $1 million in bonuses and performance payments.\n\nIn 2024-25, Energy Queensland key management personnel were awarded $536,000 in performance payments, recognising their performance from the 2023-24 financial year.\n\nThis included $105,000 given to Chief Executive Officer Peter Scott — on top of his salary of more than $1 million.\n\nCalls for clarity on Queensland's energy future Photo shows Transmission lines. Queensland renewable energy and conservation groups say there's uncertainty and wavering investor confidence being caused by the state government's mixed messages on energy policy.\n\nEnergy Queensland said performance payments were contingent on the overall performance of the entity, as well as individual achievements against key indicators and targets.\n\nA spokesperson for Energy Queensland confirmed no performance payments would be paid in the 2025-26 financial year for performance in 2024-25.\n\nBosses at Stanwell were paid $513,000 in bonuses in the 2024-25 financial year in recognition of their performance for the prior financial year.\n\nA Stanwell spokesperson said the corporation's executive remuneration is awarded in accordance with the state government's expectations.\n\n\"Stanwell's strict governance arrangements for senior executive remuneration means senior executives cannot be paid more than the market median,\" they said. \"Incentive-based payments are determined by the board through a formal process of reviewing the performance of the CEO and senior executives, including the achievement of Stanwell's electricity maintenance guarantee key performance indicators.\"\n\nNo bonuses at CS Energy\n\nCS Energy bosses were paid no bonuses in 2024-25, and a spokesperson for the energy generator confirmed none would be paid in 2025-26 for the prior year.\n\nThey said this was because CS Energy did not achieve all its KPIs under the electricity maintenance guarantee, which was introduced by the new LNP government.\n\nThe government-owned corporation came under pressure earlier this year after an explosion at its trouble-plagued Callide power station.\n\nCallide Power Station's C3 coal-fired generator was badly damaged by a powerful \"pressure spike\" inside its boiler on April 4. (ABC News: Scout Wallen)\n\nCleanCo executives were also paid $357,000 in cash incentives in 2024-25 in recognition of their performance in 2023-24.\n\nBut they also will not get incentive payments this financial year following the government-owned corporation's performance in 2024-25.\n\n\"Under the electricity maintenance guarantee, all KPIs must be achieved before the board can approve incentives for executives,\" a CleanCo spokesperson said. \"While CleanCo met eight of its nine targets, one KPI was missed, meaning no bonuses have been paid for FY25.\"\n\nPowerlink bosses were given $158,000 in performance payments in the 2024-25 financial year.\n\n\"Powerlink's board determine performance payments to executives in accordance with government policy,\" a Powerlink spokesperson said. \"Decisions for awarding performance pay are based on organisational and individual KPIs around safety, maintenance compliance, financial performance and overall performance of the state's electricity transmission network.\"\n\nExecutives at Powerlink will miss out on bonus payments in 2025-26 for their performance in 2024-25.",
    "source": "ABC",
    "cluster_id": 15
  },
  {
    "url": "https://www.abc.net.au/news/2025-09-30/afghanistan-taliban-imposes-communication-shutdown/105833300",
    "title": "Taliban imposes communication shutdown in Afghanistan to prevent 'vice'",
    "publish_date": "Mon, 29 Sep 2025 22:04:41 +0000",
    "category": "finance",
    "authors": [],
    "text": "Taliban authorities in Afghanistan have imposed a nationwide shutdown of communications, weeks after they began severing fibre optic connections to prevent \"vice\".\n\nConnectivity was operating at less than 1 per cent of its normal levels on Monday, according to internet watchdog Netblocks, which called it a \"comprehensive, or total blackout\".\n\nIn the minutes before it happened, a government official told news agency AFP the shutdown would last \"until further notice\".\n\n\"It is going to be cut, it will happen gradually tonight, there are eight to nine thousand telecommunications pillars it will shut down,\" he told AFP on condition of anonymity.\n\n\"There isn't any other way or system to communicate … the banking sector, customs, everything across the country will be affected.\"\n\nAFP lost all contact with its bureau in the capital, Kabul. (Reuters: Ali Khara)\n\nAFP lost all contact with its bureau in the capital, Kabul, at around 5:45 pm, local time.\n\nAfghanistan's Taliban authorities began the crackdown on access earlier this month, effectively shutting down high-speed internet in several regions.\n\nTelephone services are often routed over the internet, sharing the same fibre lines, especially in countries with limited telecoms infrastructure.\n\n\"A nationwide telecoms blackout is now in effect,\" said Netblocks, a watchdog organisation that monitors cybersecurity and internet governance, adding it \"appears consistent with the intentional disconnection of service\".\n\n\"It may turn out that disconnecting internet access while keeping phone service available will take some trial and error.\"\n\nThe Taliban has banned the sound of women's voices in Afghanistan. But these women want to be heard Photo shows Three women with their faces covered sit at a table and draw on paper Women living under a regime which banned them from using their voice in public risk punishment to tell the world the brutal, bleak truth of life in Afghanistan.\n\nOver the past weeks, internet connections have been extremely slow or intermittent.\n\nOn September 16, Balkh provincial spokesman Attaullah Zaid said fibre optic internet was completely banned in the northern province on the Taliban leader's orders.\n\n\"This measure was taken to prevent vice, and alternative options will be put in place across the country to meet connectivity needs,\" he wrote on social media.\n\nAt the time, AFP correspondents reported the same restrictions in the northern provinces of Badakhshan and Takhar, as well as in Kandahar, Helmand, Nangarhar and Uruzgan in the south.\n\nTaliban soldiers celebrate on the second anniversary of the fall of Kabul. (Reuters: Ali Khara)\n\nIn 2024, Kabul had touted the 9,350-kilometre fibre optic network — largely built by former US-backed governments — as a \"priority\" to bring the country closer to the rest of the world and lift it out of poverty.\n\nSince regaining power, the Taliban have instituted numerous restrictions in accordance with their interpretation of Islamic law.\n\nIt is the first time since the Taliban government won their insurgency in 2021 that communications have been shut down in the country.\n\nAFP",
    "source": "ABC",
    "cluster_id": 16
  },
  {
    "url": "https://www.abc.net.au/news/2025-09-30/rba-interest-rates-asx-markets-business-live-news-29-sept/105831264",
    "title": "Live: Seven West and Southern Cross Media shares leap on merger news",
    "publish_date": "Mon, 29 Sep 2025 21:50:04 +0000",
    "category": "finance",
    "authors": [
      "Emily Stewart",
      "David Taylor",
      "Daniel Ziffer",
      "Stephanie Chalmers"
    ],
    "text": "Ever-reliable Kyle Rodda of Capital.com has his summary of where we're at ahead of the stock market opening at its usual time of 10AM on the eastern coast.\n\nWhat's going on? Let's look at the US markets first.\n\n\"Wall Street edged higher, following through from the post-PCE Index data move on Friday night. Enthusiasm was curbed by fresh dysfunction in the US government. Another shutdown looms, with Congress having only a couple of days to pass a funding bill to keep a myriad of federal services running. The most immediate implication for the markets is the shut down may delay the release of certain data, including the critical Non-Farm Payrolls report.\n\n\"In the bigger picture, some within the Trump administration and Congressional Republicans are threatening to permanently lay-off swathes of workers if a deal does not get done, threatening to put thousands out of work.\n\n\"At the margins, that would put upward pressure on unemployment and weaken economic activity. The primary focus for market participants is currently the path forward for US interest rates, with asset prices being supported by the notion that cuts are coming and they could end up being relatively deep.\n\n\"As the markets await the beginning of the final quarter of the year, the odds remain skewed to another Fed cut in October and December. The odds for a December move have diminished, however, largely due to some cautious language coming from Fed officials in the past week. The markets are ascribing a 68% implied probability of a cut at that meeting, down from over 80% last week. A soft or benign Non-Farm Payrolls report on Friday will help lift those odds. That is, of course, if the data is released at all this week.\"",
    "source": "ABC",
    "cluster_id": 17
  },
  {
    "url": "https://www.abc.net.au/news/2025-09-30/moorambilla-voices-bush-choir-celebrates-20th-anniversary/105816166",
    "title": "How a bush choir helped a young man avoid 'becoming a statistic'",
    "publish_date": "Mon, 29 Sep 2025 21:32:54 +0000",
    "category": "entertainment",
    "authors": [],
    "text": "When Justin Welsh thinks back to his teenage years in Coonamble, he is certain of one thing — without the regional children's choir Moorambilla Voices, his life could have taken a very different turn.\n\n\"It definitely changed the trajectory of my life,\" he said.\n\nThe choir features students from years 3 to 12 from 34 towns across western New South Wales.\n\nFounded in 2005, Moorambilla Voices runs camps at Baradine, about six hours west of Sydney, where students rehearse and prepare for a series of gala concerts.\n\nIt gave Mr Welsh a way out of the statistics that often define young men in small country towns.\n\n\"It's very easy to get caught up in what friends and family are doing, and the majority of the time it's not very good,\" he said.\n\n\"There are a lot of statistics about boys ending up in jail or on drugs. [The choir] opened up doors and windows and pathways.\n\n\"If I didn't get involved in Moorambilla when I did, I think I would have easily slipped into a statistic.\"\n\nLoading...\n\nTeaching Indigenous language through song\n\nNow married and a father of two, Mr Welsh has returned to the program as a guest Indigenous language consultant, invited back by his longtime mentor and Moorambilla's artistic director, Michelle Leonard.\n\n\"Michelle is my mentor and has guided me through life — even after Moorambilla,\" he said.\n\n\"After Michelle found out I was teaching language in Tamworth, she asked me to come and help.\n\n\"I'm not scared anymore that language will die out, where I was five years ago.\n\n\"Even if we can just teach each student a name of an animal or how to pronounce a verb correctly, it will stay alive, and that is awesome.\"\n\nTime to shine\n\nMs Leonard said the choir provided space for students to be themselves at times when school and life could be difficult.\n\nMichelle Leonard has trained over 54,000 young people in workshops across regional Australia. (Supplied: Noni Carroll)\n\n\"There are so many stories over the 20 years at Moorambilla where, at that pivotal moment in someone's life, there was an environment that celebrated their true sense of self,\" Ms Leonard said.\n\n\"That gave them an opportunity to meet like-minded people and to connect artistically — the most powerful antidote to any lack of social cohesion.\"\n\nMr Welsh said his cousin was now involved.\n\n\"I text him often to make sure he's staying on the straight and narrow,\" he said.\n\nStudents travel from as far south as Griffith, west to Bourke, east to Wellington and north to Tamworth to perform.\n\nOriginally just choral singing, the Moorambilla Voices ensemble now encompasses Japanese Taiko, drumming, dance and visual arts.\n\nThe choir will celebrate its 20th anniversary with sold-out concerts in Dubbo this weekend.\n\nIt hopes to sing at Sydney's Opera House next year for its 21st birthday.",
    "source": "ABC",
    "cluster_id": 18
  },
  {
    "url": "https://www.abc.net.au/news/2025-09-30/geelong-cats-mad-monday-mitch-brown-hits-out-at-smith/105833250",
    "title": "'Makes you a loser': Brown hits out at Cats players over Mad Monday post",
    "publish_date": "Mon, 29 Sep 2025 21:27:38 +0000",
    "category": "sports",
    "authors": [],
    "text": "A controversial social media post from Geelong star Bailey Smith has drawn the ire of Mitch Brown, who has called it homophobic.\n\nBrown, the first AFL player to publicly reveal he is bisexual, was unimpressed after Smith made a series of Instagram posts from the Cats' Mad Monday function.\n\nOne of the posts featured Smith and captain Patrick Dangerfield hugging, with Smith referencing Brokeback Mountain in a caption.\n\nBailey Smith and Patrick Dangerfield pose during Geelong's Mad Monday celebrations. (Instagram)\n\nSmith had dressed as Brad Pitt in the movie Legends of the Fall, while Dangerfield had dressed as a cowboy from the TV show Yellowstone. There is no suggestion the players came to the event dressed as Heath Ledger and Jake Gyllenhaal's characters from Brokeback Mountain.\n\n\"Or brokeback mountain depends how ya look at it,\" Smith posted on the photo of him with Dangerfield.\n\n\"This is what losing a granny does to ya.\"\n\nSmith added that he was putting away his phone, before two more posts, and then adding that Dangerfield was confiscating his phone for the rest of the day.\n\nSmith also had to check with Dangerfield at one point to ask who he was dressed as, adding that he had never seen the 1994 western drama.\n\nBrown first published a picture of deceased Australian actor Heath Ledger, who played one of the lead characters in the movie.\n\n\"Just for the record, Heath Ledger's way hotter,\" Brown joked.\n\nBut then Brown added in a separate post: \"In all seriousness though, guys do better.\n\nCillian Burke, Mark Blicavs and Mark O'Connor dressed as controversial band Kneecap. (Krock Football)\n\n\"Last time I checked, losing a grand final doesn't make you gay, but being homophobic definitely makes you a loser.\"\n\nSmith also courted controversy by commenting on Max Holmes's costume.\n\nHolmes — who has previously attended Mad Monday celebrations as journalists Mitch Cleary and Gerard Whateley — this time came as footy journalist Caroline Wilson, with Smith commenting that Wilson \"had never looked better\".\n\nMark Blicavs and Irish teammates Mark O'Connor and Cillian Burke also raised eyebrows by attending the celebrations as controversial Irish band Kneecap.\n\nThe ABC of SPORT Sports content to make you think... or allow you not to. A newsletter delivered each Saturday.\n\nAAP/ABC",
    "source": "ABC",
    "cluster_id": 19
  },
  {
    "url": "https://www.abc.net.au/news/2025-09-30/federal-politics-live-blog-september-30/105830872",
    "title": "Live: Singtel boss blames human error for Optus outage after meeting government",
    "publish_date": "Mon, 29 Sep 2025 21:19:34 +0000",
    "category": "finance",
    "authors": [
      "Joshua Boscaini",
      "Courtney Gould",
      "Olivia Caisley"
    ],
    "text": "A pair of triple-0 outages will be the topic of discussion when Communications Minister Anika Wells meets with Optus boss Stephen Rue and chief executive of the telco's parent company, Singtel, today.\n\nYuen Kuan Moon was summoned for a meeting with the minister to explain Singtel's role in an emergency network outage on September 18 that's been linked to the death of three people.\n\nThe meeting follows another outage affecting triple-0 calls on Sunday near Wollongong on the NSW south cost, that led to nine failed calls.\n\nAhead of the meeting, Environment Minister Murray Watt said Wells was prepared to \"lay down the law\" with Singtel.\n\n\"I'm very confident that Anika will really lay down the law the parent company, [Singtel], CEO,\" he told Nine. \"She's obviously already had discussions with Optus themselves, but escalating that now to the parent company demonstrates how seriously we are taking this.\"\n\nThe government has ordered the Australian Communications Media Authority to get to the bottom of the outages.\n\nAsked if Australians could still have faith in the triple-0 system, Watt said people were right to have questions and called for Optus to \"come clean\" on what it knows.\n\n\"I don't think it goes as far as people needing to lose faith in the system.\"\n\nGreens leader Larissa Waters, who was also on the panel, called for the communications minister to put the conditions of Optus' telco licence under review.",
    "source": "ABC",
    "cluster_id": 20
  },
  {
    "url": "https://www.abc.net.au/news/2025-09-30/qld-council-rejects-development-approval-extension-for-hospital/105777972",
    "title": "Coastal town's hospital hopes dashed as council rejects development extension",
    "publish_date": "Mon, 29 Sep 2025 21:00:38 +0000",
    "category": "finance",
    "authors": [],
    "text": "A Queensland council is being criticised for refusing to extend its approval for a hospital and retirement facility in a burgeoning coastal community with limited health services.\n\nIn 2018, Gladstone Regional Council granted preliminary approval for the development, which was to be built between the growing central coast communities of Agnes Water and Seventeen Seventy.\n\nSunshine State Developments Pty Ltd and Jamworth Pty Ltd requested a six-year extension to the approval, but it was recently rejected.\n\nThe region has three doctors' surgeries, but the nearest hospitals are a 90-minute drive to Bundaberg or Gladstone.\n\nHundreds over 50s homes are in staged construction. (Supplied: Gladstone Area Promotion and Development Ltd)\n\nSenior project manager Andrew Hunter said a development of that scale required time, adding the decision was \"frustrating\" and sent them \"back to square one\".\n\n\"We really wanted to see if we could get a satellite hospital [off] the ground, which requires support from the state government or one of the bigger private health providers,\" Mr Hunter said.\n\n\"We don't see any real town planning purpose in refusing the extension … our approval was under the current scheme and it still required further applications for the site.\n\n\" It just seems to be a waste of taxpayers' money, refusing it and making us go through an appeal and potentially having to look at other options for the site. \"\n\nPlans for a hospital and retirement facility were given preliminary approval in 2018. (Supplied: Zone Planning Group)\n\nIn a letter to the applicant, council staff said the companies failed to take reasonable steps to act on the approval and had not given sufficient reason for an extension.\n\nLimited services for growing population\n\nThe region's population of 3,000 more than triples in holiday periods, and hundreds of homes targeting over-50s, resort-style living are in staged construction.\n\nMr Hunter said demand for the project remained strong, with many retirees relocating from southern cities.\n\n\"In the 2021 census, 30 per cent of the population in Agnes Water was over 60, and with the popularity of these over-50s lifestyle communities, that population is going to continue to grow,\" he said.\n\n\"Those people need convenient access to higher levels of care than just a general practice.\"\n\nThe nearest hospitals are a 90-minute drive to Bundaberg or Gladstone. (ABC Capricornia: Ellie Willcox)\n\nThe applicant has lodged an appeal in the Planning and Environment Court.\n\nAmber Rodgers says it is disappointing the development approval was not extended. (Supplied: Amber Rodgers)\n\nDiscovery Coast Tourism and Commerce president Amber Rodgers said it was an unfortunate outcome given the region's growth.\n\n\"I find it disappointing when private investment is offering to increase the services available in our community and that doesn't progress,\" she said.\n\n\"If we can have a facility like a hospital provided by some investment that is not all government-related, that seems like a fantastic idea.\"\n\nCommunity backs calls for hospital\n\nLong-term resident and business owner Wayne Mellick said the coastal destination was perfect for retirees, but health services were significantly lacking.\n\n\"The over-50s developments are absolutely awesome for our community, it makes sure that we are getting growth and it boosts our economy,\" Mr Mellick said.\n\n\"We need a hospital … it's past the stage of desperate.\n\n\"People aren't aware when they do get older that they are going to require medical [services] and we don't have those medical facilities here at Agnes Water.\"\n\nWayne Mellick says the region desperately needs a hospital. (ABC News: Jasmine Hines)\n\nMr Mellick has been living in the region for more than 40 years, but said he may have to relocate if local health services did not match those in other high-growth regional centres.\n\n\"I'm 63 years old now and I'm looking at relocating one day to Emu Park or Yeppoon [near Rockhampton] for that very reason of not having a complete medical system at my doorstep,\" he said.\n\nThe Gladstone Regional Council said it could not comment on matters before court.\n\nIn a statement, a Queensland Health spokesperson said a health facility at Agnes Water was in its capital pipeline for further planning and investigation.",
    "source": "ABC",
    "cluster_id": 21
  },
  {
    "url": "https://www.abc.net.au/news/rural/2025-09-30/obese-kids-undernourished-as-ultra-processed-junk-food-blamed/105810274",
    "title": "Finding of more obese yet malnourished kids reignites junk food debate",
    "publish_date": "Mon, 29 Sep 2025 20:47:18 +0000",
    "category": "lifestyle",
    "authors": [],
    "text": "Health experts and farmers are calling for a tax on ultra-processed food (UPF) as the obesity crisis worsens and childhood malnutrition increases.\n\nA global report by UNICEF has found children are now more likely to be overweight and under-nourished than too thin.\n\nIt is the first time obesity has surpassed underweight as the prevalent cause of malnutrition in children aged five to 17.\n\n\"When we talk about malnutrition, we are no longer just talking about underweight children,\" UNICEF executive director Catherine Russell said.\n\nFor the first time, more malnourished children are overweight than too thin. (ABC News)\n\nJunk food 'like eating nothing'\n\nNutritional psychiatry researcher Megan Lee said people could become malnourished even if they ate a lot of food.\n\nShe said junk food did not have the \"correct nutrients\", including minerals, vitamins and fibre.\n\n\"When we eat ultra-processed foods, it's nutritionally basically like eating nothing,\" Dr Lee said.\n\nShe is part of a group reviewing Australia's dietary guidelines, with recommendations expected to be released in 2026.\n\nDr Lee said there was an over-reliance on junk food in Australian diets.\n\n\"Because we have been assaulting our taste buds with this hyper-sweet and salty food for decades, it takes a while for us to recalibrate back to fresh food,\" she said.\n\nJunk food is convenient and tasty, but lacks whole-food nutrition. (AAP: Dave Hunt)\n\nUltra-processed food and beverages are industrially formulated in factories, primarily from refined ingredients and additives with little or no whole foods.\n\n\"Junk foods\" like chicken nuggets, hot dogs, lollies and soft drinks have high calories, added sugars, refined starches, salt and unhealthy fats.\n\nUNICEF said these foods were designed to be convenient and highly palatable, but offered \"little in terms of vitamins, minerals or fibre\".\n\n\n\nIn high-income countries, including Australia and the US, the share of dietary energy derived from UPF ranges between 42 per cent and 58 per cent.\n\nObesity on the rise\n\nThe latest figures from the Australian Institute for Health and Welfare from 2022 showed a quarter of school-aged children were overweight or obese.\n\nThat is about 1.3 million children aged two to 17, a 20 per cent increase since 1995.\n\nBy 2050, half of the country's children are expected to be overweight or obese.\n\n\"Obesity is a growing concern that can impact the health and development of children,\" Ms Russell said.\n\n\" Ultra-processed food is increasingly replacing fruits, vegetables and protein at a time when nutrition plays a critical role in children's growth, cognitive development and mental health. \"\n\nAbout two-thirds of all Australians are obese or overweight. (Reuters)\n\nJunk food tax?\n\nThe UNICEF report made eight recommendations, including implementing \"food taxes and subsidies\", restrictions on food marketing, new policies to improve the availability and affordability of locally produced nutritious foods, and improvements in food labelling.\n\nIt said interventions were needed to prevent lifetime health and economic impacts.\n\n\"Individuals are stuck in a system where we are advertised UPFs every day, we've been eating it for decades and it's hard,\" Dr Lee said.\n\n\"UPFs are also cheaper, unfortunately, than whole foods. We're also working more and we don't have the time to be making things from scratch.\"\n\nDr Lee said the federal government should consider a tax.\n\n\"A tax on UPF is a good idea, not because we want to make food more expensive. We want to funnel that money into making healthier foods cheaper,\" she said.\n\nMegan Lee says a tax on UPF should be funnelled into supporting access to healthier food. (Supplied: Megan Lee)\n\nFarmers need people to eat more whole foods\n\nThe National Farmers Federation (NFF) said it supported the idea of a tax if the revenue raised went to farmers to subsidise costs.\n\n\"Increasing consumption of fresh fruit, vegetables and nuts is absolutely in the industry's interest,\" NFF Horticulture Council chair Jolyon Burnett said.\n\n\"It's one of those happy coincidences where it would align with a great community health outcome.\"\n\nMr Burnett said a tax on UPF was \"definitely worth looking carefully at\".\n\n\"One of the problems is UPF can be produced extremely cheaply in a huge volume with a lack of labour costs and fresh ingredients,\" he said.\n\nThe federal government said it was not considering a tax on UPF, but said fruit, vegetables and other core foods were exempt from GST, to support healthy food choices.\n\n\"Our government is working with the food industry to reduce the amount of sodium, sugar and saturated fat across a range of products through the Healthy Food Partnership Reformulation Program,\" a government spokesperson said.\n\n\"The government has also committed $3.5 million to develop Feeding Australia, a new national food security strategy.\n\n\"The aim of the strategy is to provide a long-term, whole-of-system plan to boost the productivity, resilience and security of our national food system.\"",
    "source": "ABC",
    "cluster_id": 22
  },
  {
    "url": "https://www.smh.com.au/sport/afl/petracca-speaks-with-crows-and-suns-20250930-p5myxp.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Petracca speaks with Crows and Suns",
    "publish_date": "Tue, 30 Sep 2025 11:51:04 +1000",
    "category": "finance",
    "authors": [],
    "text": "Petracca speaks with Crows and Suns\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 23
  },
  {
    "url": "https://www.smh.com.au/sport/nrl/inside-the-miserable-manly-dressing-room-where-brisbane-finally-believed-in-madge-s-mission-20250930-p5myvp.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Inside the miserable Manly dressing room where Brisbane finally believed in Madge’s mission",
    "publish_date": "Tue, 30 Sep 2025 11:50:00 +1000",
    "category": "sports",
    "authors": [
      "Dan Walsh"
    ],
    "text": "“‘Did we want to bow out and have a poor year like the year before?’ was the conversation we were having. ‘Did we want to actually make something or our season and work hard, really buy into what we needed to do?’ “There was obviously a little bit of change for the boys with a new face [in Maguire], new philosophies, and work ethic. That game at Manly, it was good to go through that as a group. It highlighted some key areas that we were pretty poor at. I think we needed that to wake us up a little bit.” Ezra Mam’s try celebration was met with a chorus of boos by Manly fans. Credit: NRL Imagery That disastrous Sea Eagles loss was Brisbane at their worst. Commitment to the cause was hard to spot. Five-eighth Ezra Mam was booed with every touch in response to his perceived light punishment for a drug driving incident that left three people injured. A clumsy post-game interview from the five-eighth didn’t help. Talk of player burnout under Maguire’s polarising training methods gathered momentum. Especially given the knives were already out after the cut-throat way his predecessor Kevin Walters, a most popular figure with media heavy hitters and Broncos old boys, was rolled to make way.\n\nDressing room footage was analysed. CEO Dave Donaghy and chairman Karl Morris were put on blast, and leaders Reynolds and Kotoni Staggs were openly questioned about player revolt. “Externally, all that chat was pretty big and hard to ignore,” hooker Corey Paix says. Broncos coach Michael Maguire and Adam Reynolds. Credit: NRL Imagery “But we did because we were having the proper conversations, those very hard, very honest chats ourselves. “As a group, we ended up demanding commitment from one another because the coaches can say and do as much as possible, but at the end of the day, it’s up to the players to turn it around.\n\n“We went back to work, trained harder, got in and did what we needed to. Looking back, that really was our turning point.” When Brisbane emerged at the end of a long week, they ran onto Suncorp Stadium resembling the All Blacks in what is now an iconic, completely black kit as part of the club’s mental health round and charity partnership with the Black Dog Institute. A 44-14 blitz of the Titans was Brisbane at their all-running, all-attacking best, just seven days after bottoming out at Brookvale. In 14 games since, they’ve lost only twice - including a 22-2 defeat in Melbourne where Reynolds, Mam and Selwyn Cobbo all tore their hamstrings and their season was apparently gone.\n\nThe graft and grind their coach prizes above all else was plain to see in running down Penrith from 14-0, defending their goal line like demons all the while. Loading And as for Maguire’s much-discussed intensity, methods, and a little madness, back-rower Jordan Riki can only laugh now. Along with Reynolds and prop Payne Haas, the Kiwi international’s prior experience of Brisbane’s new coach was eagerly, and at times apprehensively, mined by his teammates. For anyone who’s had their fingers crushed in one of Maguire’s vice-like handshakes - “and he’s got this big grin on his face when he does it” Riki laughs - it’s as good an indication as any of what you’re in for. “There is a bit of an aura about him, you know, when he steps into a room that he needs everybody’s attention and he needs you locked in and focused,” Riki says.",
    "source": "SMH",
    "cluster_id": 24
  },
  {
    "url": "https://www.smh.com.au/national/australia-news-live-netanyahu-backs-us-plan-to-end-war-triple-zero-network-under-scrutiny-as-government-fast-tracks-watchdog-20250930-p5myuo.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Australia news LIVE: Netanyahu backs US plan to end war; Triple Zero network under scrutiny as government fast-tracks watchdog",
    "publish_date": "Tue, 30 Sep 2025 11:42:26 +1000",
    "category": "finance",
    "authors": [
      "Emily Kaine"
    ],
    "text": "Google’s YouTube has agreed to pay $US24.5 million ($37.2 million) to settle a lawsuit by US President Donald Trump over his 2021 account suspension following the January 6, 2021 attack on the US Capitol.\n\nDonald Trump and rioters on January 6. Credit: AP\n\nAccording to documents filed in federal court in California, $US22 million of the settlement will be contributed to the Trust for the National Mall to help pay for the construction of the White House State Ballroom. The rest will go to other plaintiffs, including the American Conservative Union.\n\nGoogle is the latest big tech company to settle lawsuits brought by Trump. In January, Meta Platforms agreed to pay $US25 million to settle a lawsuit over his 2021 suspension from Facebook. Elon Musk’s X agreed to settle a similar lawsuit brought against the company then known as Twitter for $US10 million.\n\nThe settlement does not constitute an admission of liability, the filing says. Google confirmed the settlement but declined to comment beyond it.\n\nThe disclosure of the settlement came a week before a scheduled October 6 court hearing to discuss the case with US District Judge Yvonne Gonzalez-Rogers in Oakland, California.\n\nAP",
    "source": "SMH",
    "cluster_id": 4
  },
  {
    "url": "https://www.smh.com.au/national/queensland/brisbane-news-live-miles-hits-out-at-premier-s-vaccination-stance-amid-measles-alerts-20250929-p5myrq.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Brisbane news live: Arts Minister John-Paul Langbroek downplays threat of Trump tariff on Qld films | Suspicious fire at CWA hall | Miles slams premier’s vaccination stance amid measles alerts",
    "publish_date": "Tue, 30 Sep 2025 11:40:45 +1000",
    "category": "finance",
    "authors": [],
    "text": "Queensland Arts Minister John-Paul Langbroek will write to his federal counterpart to seek clarification about the latest tariff proposal on the state’s film industry, but he downplayed the threat and said the sector was thriving despite the ongoing trade uncertainty.\n\nUS President Donald Trump revived a threat first announced in May to impose a 100 per cent tariff on foreign-made films, which has the potential to devastate the multibillion-dollar film industry in Australia.\n\nMany states have created tax incentives to lure the sector to their jurisdictions, including Queensland which has boosted production activity.\n\nLoading\n\nLangbroek said the new threat was merely a repeat of comments made earlier this year, but he confirmed he would once again write to federal counterpart Tony Burke to seek a diplomatic clarification.\n\n“The local industry continues to be very active, both since May and even as recently as last week, when we had Subversion being filmed with Chris Hemsworth,” he told reporters on Tuesday morning.\n\n“The local industry is vibrant and very positive about the future – having said that, we would like some clarification.”",
    "source": "SMH",
    "cluster_id": 25
  },
  {
    "url": "https://www.smh.com.au/politics/federal/im-still-a-new-minister-wells-20250930-p5myy9.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "'I'm still a new minister': Wells",
    "publish_date": "Tue, 30 Sep 2025 11:35:31 +1000",
    "category": "finance",
    "authors": [],
    "text": "'I'm still a new minister': Wells\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 26
  },
  {
    "url": "https://www.smh.com.au/national/nsw/the-sydney-developer-166-000-in-fines-and-the-exhausted-street-20250916-p5mvgt.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "The Sydney developer, $166,000 in fines and the ‘exhausted’ street",
    "publish_date": "Tue, 30 Sep 2025 11:30:00 +1000",
    "category": "finance",
    "authors": [
      "David Barwell"
    ],
    "text": "Residents living in a street in Willoughby say their once-peaceful cul-de-sac has been turned into an “unbearable” construction zone due to a string of non-compliant building works at one of the largest housing projects on the north shore.\n\nWilloughby Council has issued 20 separate fines totalling $166,000 to the head contractor of an 186-unit development on Walter Street due to multiple construction breaches of the site’s conditions of consent including polluting waters and obstructing public land.\n\nThe development under construction on Walter St in Willoughby. Credit: James Brickwood\n\nMajor work on the project has been under way for three years and has involved demolition of 21 homes on the northern side of the street to make way for five new apartment buildings up to 11 storeys tall.\n\nSince work began, homeowners living on the southern side of the same street have repeatedly raised concerns to Willoughby Council over alleged non-compliant building work at the site including construction works undertaken outside approved hours, cracked roads and footpaths, and utilities – including water and power – cut off without notice.",
    "source": "SMH",
    "cluster_id": 27
  },
  {
    "url": "https://www.smh.com.au/business/markets/asx-set-to-edge-up-wall-street-drifts-oil-falls-20250930-p5myug.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "ASX edges higher on RBA day, led by miners; Seven, Southern Cross jump",
    "publish_date": "Tue, 30 Sep 2025 11:14:37 +1000",
    "category": "finance",
    "authors": [
      "Staff Writers"
    ],
    "text": "The Australian sharemarket opened higher ahead of the Reserve Bank’s interest rate decision on Tuesday afternoon, tracking gains on Wall Street overnight.\n\nThe S&P/ASX 200 added 22.7 points, or 0.3 per cent, to 8885.50 as of 10.38am AEST. Seven of its 11 industry sectors advanced, led by mining stocks. The Australian dollar was fetching US65.77¢.\n\nWall Street has made a positive start to the week. Credit: Bloomberg\n\nThe RBA announces its interest decision at 2.30pm AEST, with economists expecting the central bank to leave rates unchanged at 3.6 per cent. The market focus will be on the comments and outlook by Governor Michele Bullock when she fronts reporters at 3.30pm.\n\nThe higher open comes after the local bourse had its best day in more than three weeks in the previous session, helped by investment funds rebalancing their portfolios for the end of the month and the quarter, according to IG Markets analyst Tony Sycamore.",
    "source": "SMH",
    "cluster_id": 28
  },
  {
    "url": "https://www.smh.com.au/lifestyle/new-bridesmaid-for-hire-popping-off-20250930-p5myxu.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "New 'Bridesmaid for Hire' popping off",
    "publish_date": "Tue, 30 Sep 2025 11:01:00 +1000",
    "category": "lifestyle",
    "authors": [],
    "text": "New 'Bridesmaid for Hire' popping off\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 29
  },
  {
    "url": "https://www.smh.com.au/culture/art-and-design/ngv-cartier-winter-masterpieces-20250925-p5mxyt.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "‘It’s not just bling’: The dazzling blockbuster show heading for Melbourne",
    "publish_date": "Tue, 30 Sep 2025 11:00:00 +1000",
    "category": "entertainment",
    "authors": [
      "Will Cox"
    ],
    "text": "A major exhibition of jewellery from famed fashion house Cartier is set to open at the National Gallery of Victoria in 2026, the gallery announced today.\n\nCartier, which premiered at London’s Victoria & Albert Museum earlier this year, will see more than a century of historic jewellery items on display, including many associated with aristocratic and pop culture figures, from Princess Margaret and Wallis Simpson to Elizabeth Taylor and Rihanna. It is set to be the largest exhibition of Cartier pieces ever staged in Australia.\n\nElizabeth Taylor at the Tropicana Hotel in Las Vegas, June 1958 Credit: Photofest, courtesy of the NGV\n\nIn an Australian exclusive, the NGV’s iteration of the show will also feature jewellery worn by opera singer Dame Nellie Melba – who was a major client of Cartier at the turn of the century – as well as a range of jewellery made with Australian opals.\n\n“The Melba pieces represent a moment when Cartier was really gaining in international significance,” said Amanda Dunsmore, the NGV’s senior curator for international decorative arts and antiquities. Dunsmore said the pieces reflect key shifts in design, including incorporating platinum into the settings and the evolution of Cartier’s Garland style, which took cues from Parisian architecture.",
    "source": "SMH",
    "cluster_id": 30
  },
  {
    "url": "https://www.smh.com.au/business/banking-and-finance/banks-doling-out-loans-as-rate-cuts-and-first-home-scheme-fuel-demand-20250929-p5myo4.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Banks doling out loans as rate cuts and first home scheme fuel demand",
    "publish_date": "Tue, 30 Sep 2025 11:00:00 +1000",
    "category": "finance",
    "authors": [
      "Clancy Yeates"
    ],
    "text": "Westpac, National Australia Bank and ANZ Bank are ruling off their financial year as rising house prices and falling interest rates fuel quicker growth in the $2.3 trillion mortgage market, which analysts say should help banking giants rake in more revenue.\n\nThe three banks will close their books on the financial year on Tuesday, after a year in which falling interest rates have had a significant impact on Australia’s banking market. Their larger rival Commonwealth Bank, which uses a June financial year, reported its full-year results last month.\n\nHousing credit growth has picked up to its quickest pace in more than two years as interest rates have fallen. Credit: Peter Rae\n\nThe Reserve Bank has made three 0.25 percentage point cuts to interest rates this year, sparking stronger growth in mortgages and business loans, while lower rates have also eased the financial squeeze on households, which is further good news for banks’ loan portfolios.\n\nAt the same time, however, analysts say competition remains intense in business and home lending, which is eating into the sector’s profit margins. Cost-cutting is also a key theme and investors expect the banks to keep a tight rein on expenses, following recent job cuts announced at ANZ Bank, NAB, Westpac and Bendigo and Adelaide Bank.",
    "source": "SMH",
    "cluster_id": 31
  },
  {
    "url": "https://www.smh.com.au/technology/serious-lack-of-confidence-minister-slams-optus-after-high-stakes-meeting-20250930-p5myvt.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "‘Serious lack of confidence’: Minister slams Optus after high-stakes meeting",
    "publish_date": "Tue, 30 Sep 2025 10:56:49 +1000",
    "category": "finance",
    "authors": [
      "David Swan"
    ],
    "text": "Communications Minister Anika Wells says there is a “very serious lack of confidence” in Optus to deliver Triple Zero services to Australians, after its fatal outage in which three people died.\n\nWells met in Sydney on Tuesday morning with Optus chief executive Stephen Rue and his boss, Singtel chief Yuen Kuan Moon, who flew in from Singapore. Amid mounting political pressure Wells said she sought assurances from both Optus and Singtel that they would prioritise restoring confidence in the Triple Zero system.\n\nOptus chief executive Stephen Rue leaves his house on Tuesday morning. Picture Nine News Credit: Nine News\n\n“I think the CEO of Optus has a lot of work to do, given these two outages have happened in short succession and has given rise to a very serious lack of confidence in both Optus and their ability to deliver Triple Zero services to Australians when they need it most,” Wells told reporters after the meeting.\n\n“The CEO of Optus now needs to work with their parent company, Singtel, on the systems and holistic change required within their own company to give that confidence back to Australians.”",
    "source": "SMH",
    "cluster_id": 20
  },
  {
    "url": "https://www.smh.com.au/money/planning-and-budgeting/why-isn-t-my-money-making-me-happier-20250930-p5myww.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Why isn’t my money making me happier?",
    "publish_date": "Tue, 30 Sep 2025 10:53:40 +1000",
    "category": "finance",
    "authors": [
      "Paridhi Jain"
    ],
    "text": "I feel like I should be happier than I am, but I don’t really know what’s missing. I’ve ticked the boxes: I make good money, have a nice home and family, and I’ve got a good stable career, savings and investments. I’m not really asking for financial advice. I’m doing well financially, and that’s not something I take for granted. But I guess I wasn’t expecting to feel this way, after working hard to achieve everything that I have. You talk a lot about money mindset, so I thought you might have some insights that could help.\n\nCongratulations, you’ve hit a new financial level. This is the: “Is this it? Now what?” level. I’m being playful, but I want you to know: you’re not alone. This is a phase I see many people go through on the other side of accomplishing a certain level of financial success.\n\nReaching the peak of your money goals can be strangely unfulfilling. Credit: Simon Letch\n\nThat level isn’t defined by a certain dollar figure – I’ve seen this play out at different levels for different people: for some it hits after the successful exit of their start-up, for others it might hit after achieving a specific financial milestone they’d been working towards – e.g. $X in savings or investments, or paying off the mortgage, or retirement.\n\nThe common denominator isn’t a number, but the accomplishment of something you had placed a lot of value on, and getting to the other side only to realise – it wasn’t a magical portal into a different life, like you thought it’d be. There is now a gap between how your life looks, and how you thought it would feel. So, how do you start to close that gap?",
    "source": "SMH",
    "cluster_id": 32
  },
  {
    "url": "https://www.smh.com.au/culture/movies/trump-has-doubled-down-on-his-non-us-movie-tariff-threat-that-s-a-bad-thing-for-cinema-20250930-p5mywe.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Trump has doubled down on his non-US movie tariff threat. That’s a bad thing for cinema",
    "publish_date": "Tue, 30 Sep 2025 10:50:14 +1000",
    "category": "finance",
    "authors": [
      "Karl Quinn"
    ],
    "text": "Donald Trump has restated his intention to introduce a 100 per cent tariff on all movies produced outside the United States, a move that would have enormous consequences not just for Hollywood but for those countries – Australia, New Zealand, the UK and Canada among them – in which the studios increasingly base their filmmaking efforts.\n\nThe US president announced the plan on his social media platform Truth Social overnight, stating, “Our movie making business has been stolen … Therefore, in order to solve this long time, never ending problem, I will be imposing a 100% Tariff on any and all movies that are made outside of the United States”.\n\nUS President Donald Trump has restated his intention to hit Hollywood with tariffs. Credit: Matt Willis\n\nThe threat was first made by Trump in May. As then, this latest statement lacks any clear detail about how or when the move would be implemented. It is unclear, for example, if a tariff would apply to television production as well as movies, or if a tariff would be applied only to the production costs incurred outside the US or to the entire show.\n\nIf followed through, the move would be a nightmare for the Hollywood studios and their offshore production partners, but would be welcomed by the powerful guilds in the sector.",
    "source": "SMH",
    "cluster_id": 33
  },
  {
    "url": "https://www.smh.com.au/sport/afl/the-demons-said-good-bye-to-goodwin-should-they-do-the-same-to-petracca-and-oliver-20250826-p5mpt6.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "The Hawks have improved steadily under Sam Mitchell. But their next step will be the toughest",
    "publish_date": "Tue, 30 Sep 2025 10:42:51 +1000",
    "category": "sports",
    "authors": [
      "Andrew Wu",
      "Jon Pierik",
      "Marc Mcgowan",
      "Scott Spits",
      "Vince Rugari"
    ],
    "text": "It could be a rough exit meeting for: James Worpel and Mitchell have a bit to talk about. Worpel is a restricted free agent, and has interest from the Cats, having slipped in the Hawks’ midfield pecking order. Will Mitchell offer him more time to stay, or will that depend on what hap]pens during the trade period? Jai Serong is likely to leave, while Sam Butler is mulling a shift to West Coast.\n\nSomething to look forward to: The Hawks have made no secret they want to beef up their list, and they will be busy through the trade period. They could yet land one of Zach Merrett, Christian Petracca or Zak Butters.\n\nWill Day is on the mend from another fractured foot. Loading Day remains the Hawks’ most skilful player, but will need to be monitored closely for the rest of his career. The likes of Nick Watson and Ginnivan continue to add to their games, while skipper James Sicily will give his sore body time to heal over summer.\n\nPredicted best and fairest: Jai Newcombe.\n\n– Jon Pierik\n\nNick Daicos is in his prime and Scott Pendlebury is on the brink of the AFL games record. Credit: AFL Photos Collingwood (preliminary finalist) Wins: 17 Losses: 8. Draft picks: 34, 52, 64, 70 What went well: Plenty, despite being the “Dad’s Army” of the competition – their preliminary final team was the oldest line-up ever fielded in an AFL final. That they reached the penultimate weekend of the season meant this campaign was a success. Just not as successful as they had hoped. Nick Daicos had another superb season, capped with his second-straight runner-up finish in the Brownlow Medal count. Is there a better kick in the league? Brother Josh provided drive from half-back, while ruckman Darcy Cameron had a career year.\n\nSteele Sidebottom and Jack Crisp were consistent contributors, Jamie Elliott booted a team-high 60 goals, while former Giant Harry Perryman settled in well across half-back. Ned Long had a break-out year, while Scott Pendlebury, 37, defied his age until he was stopped by a calf strain in the opening minutes of the preliminary final. The AFL games record will be his in 2026 if he plays the eight more games needed to go past Brent Harvey on 432. It could be a rough exit meeting for: More than one Magpie, and even for the Magpies’ list managers, for Elliott, 33, may need to be dissuaded from joining the Gold Coast Suns on a three-year deal, while Brody Mihocek, 32, has a three-year offer from Melbourne to consider. The Magpies, however, may tell Mihocek they won’t budge from their two-year offer. Mason Cox, 34, faces an uncertain future, while Dan Houston – and the Pies – will agree they need more from him next season. Bobby Hill, having missed so much football because of personal issues, remains a close watch.\n\nSomething to look forward to: Houston was not the same counter-puncher he was at Port Adelaide in his first year with the Magpies – expect that to change next year. He is exemplary with ball in hand, and needs to have more of it. Skipper Darcy Moore had an indifferent season, and may need to revisit the balance between pure defending and hunting the ball. Get that right, and the Magpies – already built on defence – will be even stronger. Coach Craig McRae wants a blend of good draft picks and established players through this trade/draft period. They missed out on Jack Silvagni, but will trade for Swans’ forward Jack Buller. Another established defender may be front of mind, for Jeremy Howe, 35, is showing signs of wear and tear. Predicted best and fairest: Nick Daicos.\n\n– Jon Pierik\n\nAdelaide (fifth after finals loss) Wins: 18 Losses: 7 Draft picks: 18, 41, 48, 54, 66, 72. What went well: There was much to like. The Crows not only leapt back into the finals for the first time since 2017, but won 12 of their final 13 home-and-away games to finish as minor premier.\n\nMatthews Nicks’ game plan, essentially built on going long down the line, held up during the season proper. Taylor Walker may not like what he hears from the Crows’ bosses in his end-of-season meeting. Credit: AFL Photos via Getty Images Skipper Jordan Dawson and full-forward Riley Thilthorpe were All-Australians, while fellow forwards Taylor Walker and Darcy Fogarty, and forward-midfielder Ben Keays, also enjoyed strong home-and-away seasons. Former Demon Alex Neal-Bullen was a fine acquisition, and could be a future skipper. Izak Rankine provided creativity up field and close to goal, and was badly missed through suspension for a homophobic slur in September. “What it did do was it changed the dynamic of our group,” Nicks said of Rankine’s absence. “Izak is, and this is my opinion, one of the best players in the game, so I think if any team loses their best player, then it becomes quite challenging to replace that.” It could be a rough exit meeting for: Taylor Walker. The champion forward, 35, is off contract, and his time may be up after a modest finals campaign. The Crows may feel Thilthorpe and Fogarty need to be empowered and shoulder greater responsibility. Fellow veteran Brodie Smith, 33, is also weighing up his future.\n\nSomething to look forward to: This was a year when the Crows built a foundation for what should be a five-year premiership tilt. Yes, they failed to win a quarter in their two finals defeats, becoming the first minor premiers in more than 40 years to be dumped from September in straight sets, but that sting should fire this squad. However, they do have holes. While unbeaten in 13 games against bottom nine teams, they were 6-7 against top nine teams, their scoring and defence dropping off. They need another X-factor in addition to Rankine, while a forward line of three talls didn’t hold-up in September, when the ball is on the ground more. Another strong defender would also help. Nicks will need to tinker with his game plan. As he said after the semi-final loss to Hawthorn, it’s harder to move the ball the way you want in the finals when the intensity rises. The Crows have been linked with off-contract Lions forward Callum Ah Chee.\n\n\n\nBest and fairest tip: Jordan Dawson.\n\n– Jon Pierik Suns gun Matt Rowell takes a physical battering in every game he plays. Credit: Getty Images Gold Coast (sixth after finals loss) Wins: 16 Losses: 9 Draft picks 6, 14, 15, 32, 56, 68 What went well: The Suns have finally risen. This was a breakthrough season for a club, which not only made its maiden finals run in its 15th attempt, but conjured a miraculous win over the Dockers in Perth.\n\nSkipper Noah Anderson and fellow midfielder Matt Rowell were first-time All-Australians, their sustained efforts in the midfield a sight to behold. The physical punishment Rowell takes reminds us of the hits an NFL running back endures. Marking forward Ben King was superb in front of goal but will need to add a new trick or two. Fellow forward Ben Long had a breakout campaign, although he was disappointing in the semi-final, while recruits Daniel Rioli and John Noble delivered what was expected of them at half-back. Sam Collins is a beast at full-back, Touk Miller delivered run and carry, while Bailey Humphrey showed signs of morphing into the Suns’ version of Cam Rayner. It could be a rough exit meeting for: Jed Walter. The young forward was dropped after round 19 and did not return to the side. While the former Suns academy product is contracted for next season, he could be used in a trade for Carlton’s Charlie Curnow. While a star in the making, Mac Andrew will face a strong review of his finals performances.\n\nSomething to look forward to: There is plenty to look forward to with this emerging list, coach Damien Hardwick declaring his team is built for September. The base is there, it’s now time to build internally and through canny trades. The Suns were too reliant on Rowell and Anderson, and need another robust midfielder who can deliver under pressure. The unicorn that is Ethan Read struggled in the semi-final but has the height and talent to be a long-term marking threat. They could lose Sam Flanders, who has two years remaining on his contract, and Malcolm Rosas, through the trade period. Best and fairest tip: Noah Anderson.\n\n– Jon Pierik Fremantle (8th)\n\nWins: 16. Losses: 8. Draft picks 13, 31, 38, 49, 67. What went well: After last year’s meltdown, when they slipped from the top eight at the start of August to 10th by the end, the Dockers held firm this year and returned to the finals for the first time since 2022, winning 12 of their last 14 games to finish sixth. Caleb Serong again starred in the Fremantle midfield. Credit: AFL Photos They adopted a more attacking gameplan after five losses from their first nine games, but failed to fully embrace this mantra in a stinging elimination final defeat to the Suns. “We’ve grown so much throughout the year with the way we play our footy, the way we embrace challenges, the way we’ve improved our footy on the road,” coach Justin Longmuir said after the loss to the Suns.\n\nMarking talls Josh Treacy (44 goals) and Patrick Voss (37) had strong seasons, while Murphy Reid claimed the AFLPA’s best young player award. Former premiership Tiger Shai Bolton (28) was arguably the recruit of the year. Defender Jordan Clark and midfield stud Caleb Serong were All-Australians, while Andrew Brayshaw was unlucky not to be. It could be a rough exit meeting for: Jye Amiss. While he played all 24 games, Amiss, a key marking tall, returned a modest 32 goals, and averaged career-lows in marks and disposals per game. He had only two touches (one goal) in the elimination final before being subbed off. Amiss could be a trade target. Then there’s ruckman Sean Darcy. Will he and Luke Jackson continue to be a one-two punch in the ruck? We’ll see.\n\nSomething to look forward to: The Dockers are building nicely. They had an average age of just 24.9 years through the season – the fourth youngest in the competition. Fremantle ruckman Sean Darcy. Credit: AFL Photos AFL great James Hird has set high expectations for them next year, despite their loss to the Suns on Saturday. “I think they have to be top four next year with their list and the way they’ve had the final this year and the performances against the best teams in the competition. I’ve really gotten locked in that top four next year,” Hird said. But they cannot afford to have lulls and slip back into a defensive mindset when the pressure is at its greatest. This will be Longmuir’s greatest challenge.\n\nBest and fairest: Caleb Serong.\n\n– Jon Pierik GWS (7th) Wins: 16. Losses: 8. Draft picks: 12, 30, 36. What went well: After a dodgy first half of the year, the Giants won nine of their last 10 home-and-away games, scoring more than 100 points in each of them. In the end, they finished with one of the AFL’s best attacking records, just two points behind third place.\n\nToby Greene and his Giants were eliminated at home by the Hawks. Credit: AFL Photos At their best, they were absolutely awe-inspiring: their stunning third quarters against the Swans in the second Sydney derby of the season, plus their (eventually unsuccessful) comeback against Hawthorn in their elimination final, will live long in the memory. The challenge will be closing the gap between their frightening best and their timid worst. It could be a rough exit meeting for: Everyone. The Giants have now lost their past four finals, including two at home (and three in Sydney) – the sort of record that each player needs to take a varying degree of responsibility for, as well as the coaching group, and will require them all to look deeply within over the summer. September stumbles are becoming too much of a theme. What’s clear is that they concede too many entries, which can’t be wholly pinned on the six poor blokes in defence who had to deal with that avalanche. All things considered, they managed OK, but it felt unsustainable, and so it has proved. And there’s a similar problem going the other way. When they’re on, they’re on, but the Giants’ attack falls to pieces when they mindlessly blaze away inside 50 as they did against Hawthorn, which completely undermines their forward set-up. Composure in key moments is lacking in this side across every line, and that’s not an easy thing to add.\n\nSam Taylor is a star defender for GWS, but the Giants’ defensive unit is under pressure. Credit: AFL Photos Something to look forward to: As Adam Kingsley said post-match, the Giants still have “all the pieces” to contend, although their ageing stars are running out of petrol. But the window remains open, their next tier of rising stars will be better with another season under their belts and if they can address their inconsistencies, get to the psychological nub of their finals failures and have some better luck with injuries, there’s no reason why they won’t be back contending again in 2026. Best and fairest tip: Finn Callaghan showed exactly why St Kilda threw a $17 million, 10-year contract offer at him; thank heavens he said no. He and Tom Green (likely second in the best and fairest) run this team now.\n\n– Vince Rugari Western Bulldogs (9th)\n\nWins: 14. Losses: 9. Draft picks: 10, 28 What went well: Offensive power. The Doggies poured on the goals this season, scoring more points (2493) than any other team. Led by Marcus Bontempelli, Tom Liberatore, Ed Richards and an increasingly influential Sam Darcy up forward, they beat up teams with regularity. While that resulted in a 14-9 record, the team from the west missed the finals. The Bulldogs were an offensive juggernaut in 2025 but still missed finals. Credit: Getty Images It could be a rough exit meeting for: Jamarra Ugle-Hagan. The one-time No.1 draft pick has occupied so much of the Bulldogs top brass’ time this season. It would be fascinating to witness his official exit meeting given there’s so much to discuss for a player who didn’t add to his tally of 67 AFL games this season. Defenders will be in the spotlight, too, but each player on the list will be pressed for explanations as to why the Dogs simply couldn’t beat teams who were vying for finals spots.\n\nSomething to look forward to: Plenty, to be truthful. The Dogs have recorded 14 wins in consecutive seasons; in 2024 they played finals, so they can’t wallow in pity about what happened this year. Jamarra Ugle-Hagan didn’t play a game for the Bulldogs this season. Credit: Justin McManus Darcy, at age 22, remains one of the most exciting young players in the game. Aaron Naughton’s best season (65 goals) is a beacon of hope for even better things, too. Best and fairest tip: I’ve landed on Ed Richards ahead of Tom Liberatore. Bontempelli’s missed games through injury will cost him.\n\n– Scott Spits Port Adelaide (13th)\n\nWins: 8. Losses: 15. Draft picks: 26, 42, 60 What went well: That’s tough to answer because this was an extremely disappointing year, despite Ken Hinkley’s protestations the list is set up well for 2026. Port Adelaide chairman David Koch stuck with Ken Hinkley to the end. Credit: Getty Images Having made a preliminary final last year, the Power slipped markedly. However, skipper Connor Rozee and fellow star midfielder Zak Butters were typically industrious, while forward Mitch Georgiades delivered a half-century of goals for the first time. Aliir Aliir enjoyed another stellar season in defence, while Travis Boak and Hinkley were given a classy send-off against the Suns, the victory fully deserved. Zak Butters won Port Adelaide’s best and fairest award - the John Cahill Medal - for the third consecutive year in 2025. Credit: Getty Images\n\nIt could be a rough exit meeting for: President David Koch and his board. The succession plan designed to ease Hinkley out and Josh Carr to prepare for the senior role next season was done with the best of intentions, but the scoreboard says it was a failure. If Hinkley wasn’t the man to take the team forward, then Carr should have been immediately installed, and Hinkley given a thank-you payout for his years of fine service. Something to look forward to: The Power should be back in the finals hunt next year, but they will need to get busy in the trade period. Do they have enough true stars? Missing out on Nasiah Wanganeen-Milera will hurt.\n\nLate season injuries have given the youngsters a chance. We like what we have seen of Jack Whitlock, who can play ruck and go forward. Best and fairest winner: Zak Butters.\n\n– Jon Pierik Essendon (15th)\n\nWins: 6. Losses: 17. Draft picks: 4, 5, 22, 25. What went well: The Bombers have some superb youngsters. In his second year, Nate Caddy again gave glimpses of the player he could become, with 20 goals and more flashes of brilliance.\n\nIsaac Kako gave Bombers fans something to get excited about. Credit: AFL Photos Isaac Kako impressed with his smarts around goals and showed late in the season he can also be developed as a pinch-hitter in the centre square. Archie Roberts, the lowest draft pick of the trio, could end up being a steal. The teenager is advanced beyond his years, demonstrating composure and skill in a defence that was under siege. Angus Clarke is another of the club’s 15 debutants this year who has provided Bombers fans with hope in a wretched campaign.\n\nIt could be a rough exit meeting for: Ben Hobbs. In his fourth season, Hobbs, 21, failed to take a more significant role in the side. Worryingly for Hobbs, despite Essendon’s litany of injuries, he was dropped for the first leg of the final round and could not break back into the team. Hobbs has stagnated in his past two seasons, reaching 20 disposals in just three of his past 30 games. His disposal remains a worry. If time has run out for the first-round pick from the 2021 draft, it would raise further queries on the Bombers’ recruiting and player development. Something to look forward to: The draft. The Bombers have a strong hand in this year’s draft after acquiring Melbourne’s first selection through a pick swap last year. Even accounting for father/son, academy and NGA picks, the Bombers should have access to two very good youngsters. If Sam Draper departs through free agency, that should deliver another first-round pick. Unfortunately for the Dons, this is not considered the strongest draft, but one experienced recruiter has said they would not be surprised if smokies emerge deeper in the pool.\n\nBest and fairest: Zach Merrett.\n\n– Andrew Wu West Coast (18th) Wins: 1. Losses: 22. Draft picks: 1, 14, 19, 32, 50. What went well: Sorry West Coast fans, this is not pretty. The Eagles have managed 11 wins in four seasons, including just one victory, over St Kilda, in a torturous 2025 season.\n\nBut there’s always a glimmer of hope and performances and players to celebrate. Two-time Richmond premiership player Jack Graham, who joined the Eagles for 2025, comfortably exceeded his career average for disposals (19.2 possessions per game this season) and had 7.8 tackles per game (which is considered “elite”). It could be a rough exit meeting for: The defensive unit and the defence coaches. West Coast comfortably conceded the highest number of points (2438) this season, leaving them with a limp percentage of 60.1. If premierships are built from the backline, they need to focus there. It will be fascinating to see the club’s attitude towards Tim Kelly, who played 19 games in his sixth season with the Eagles. Something to look forward to: It couldn’t get any worse, could it? If West Coast haven’t bottomed out, where is the bottom?\n\nThe Eagles can expect the No.2 draft pick as compensation for losing free agent Oscar Allen to Brisbane, so that’s something. And Harley Reid is staying for now, having resisted interest from big Victorian clubs to extend until the end of 2028. Eagles fans can only look forward to better times ahead. Best and fairest tip: Jack Graham.\n\n– Scott Spits North Melbourne (16th)\n\nWins: 5 Losses: 17 Draws: 1 Draft picks: 20, 21, 39, 57 What went well: They made it out of the bottom two! The Kangaroos and coach Alastair Clarkson would have liked to see more progress on the ladder, but he remains bullish they are heading in the right direction. North Melbourne avoided another bottom-two finish. Credit: Getty Images After a torrid first six rounds and the odd thrashing beyond that, North were generally more competitive, including securing a draw with Brisbane, but there were no statement wins. Instead, they would be pleased with Harry Sheezel’s transition to a midfield-forward role, the continued development of Colby McKercher and career-best seasons from Cam Zurhaar and Paul Curtis.\n\nIt could be a rough exit meeting for: Will Phillips. The No.3 pick in the COVID-19-impacted 2020 draft class played only seven matches this season and does not appear to be in the Roos’ plans. He should latch on somewhere, but needs to get going to save his career. Something to look forward to: Next year promises to be the season when North Melbourne finally take a genuine leap. How high that is remains to be seen, but the expectations must rise, even if that is as modest as aiming for between eight and 10 wins. The young talent is there, and they may have finally found Nick Larkey’s sidekick in Cooper Trembath. A stiffer defence and another progression from their midfield group should enable them to take another belated step.\n\nBest and fairest: Luke Davies-Uniacke.\n\n– Marc McGowan Richmond (17th) Wins: 5. Losses: 18. Draft picks: 2,3 What went well: Plenty for a club that was widely tipped to sail through turbulent waters with a drastically young and inexperienced list.\n\nThe season began on the best note possible with a stunning round-one win over Carlton. The nature of the victory, a come-from-behind triumph, set the tone for the season for both the Tigers and Blues. Throw in highlights from Maurice Rioli jnr, and all was swell. Tim Taranto had a strong season as one of the Tigers’ on-field leaders. Credit: AFL Photos It could be a rough exit meeting for: The club’s forwards and the forward coaches. The Tigers scored the fewest number of points (1449), less even than West Coast, a club that limped to one victory, compared to Richmond’s five. Veteran spearhead Tom Lynch could cop a drive-by sledge for missing games. He played only 16 matches (due largely to a suspension) after a tough couple of years with injuries.\n\nSomething to look forward to: There’s so much to look forward to. Realistically, the Tigers will battle to replicate their win-loss tally (5-18) as they continue to develop their young group. It could be a case of the “second-year blues” for a host of players. But Richmond will be eyeing off their matches against Carlton and the chance to knock them off again. Best and fairest tip: Tim Taranto.\n\n– Scott Spits St Kilda (12th)\n\nWins: 9. Losses: 14. Draft picks: 7, 43, 58. What went well: The Saints were a popular choice to sink into the bottom four, but finished three wins clear of that territory while prioritising youth. The Saints will welcome Tom De Koning in 2026 and welcome back Max King after another injury-riddled season. Credit: AFL Photos St Kilda’s round two upset of Geelong was a false dawn, but a peek at their upside. They also demolished Fremantle and executed the greatest three-quarter-time comeback from 46 points down against Melbourne. That latter win was the first of four in a row before they almost upset GWS in round 24.\n\nNasiah Wanganeen-Milera’s emergence as a top-liner was massive, while Max Hall followed Cooper Sharman and Max Heath as a mid-season draft success story. It could be a rough exit meeting for: Zak Jones. The brother of ex-Demons captain Nathan was not one of the five Saints who re-signed last week, and faces an uncertain future. Jones turns 31 in March, and St Kilda already made it clear they want to get younger in the midfield. Something to look forward to: Another two years from Wanganeen-Milera, who they retained despite Adelaide and Port Adelaide wanting him.\n\nThere is optimism about what Mattaes Phillipou, Darcy Wilson, Alix Tauru and Tobie Travaglia can become, while the likes of Hugo Garcia, Isaac Keeler, Hugh Boxshall and Lance Collard also show promise. Tom De Koning will be on the list in 2026, and Max King will hopefully be fit again. Best and fairest tip: Nasiah Wanganeen-Milera.\n\n– Marc McGowan Sydney (10th) Wins: 12. Losses: 11. Draft picks: 9, 27, 45, 63. What went well: Having won just four of their first 12 games under new coach Dean Cox, the Swans showed fortitude to rebound and win eight of their final 11 games.\n\nBrodie Grundy returned to his best form for Sydney in 2025. Credit: AFL Photos Playmaker Isaac Heeney had a tough start, but then reminded everyone why he is a legitimate star. Chad Warner was a consistent threat through the midfield, but did not have the impact he enjoyed through 2022-24. A serious ankle injury through the pre-season sidelined Errol Gulden for months and seriously hurt the Swans’ midfield and creative drive, just as his return in round 15 had the reverse effect. Brodie Grundy reinforced why he is one of the competition’s premier ruckmen.\n\nIt could be a rough exit meeting for: Skipper Callum Mills. For the Swans to make the leap next season, Mills needs to consistently be on the park. His 2024 campaign was derailed after injuring his rotator cuff in a Mad Monday celebration. He missed the first half of this year because of plantar fascia. He needs to lead the way in 2026. Something to look forward to: This has been a year of recalibration for the Swans, and learning, particularly for Cox, who is now more at ease in the top role after replacing John Longmire. While it feels somewhat of a wasted year, the Swans are still in top-four mode, and are likely to be strengthened through the trade period. They just need to get moving earlier next season. Best and fairest tip: Isaac Heeney.\n\n– Jon Pierik\n\nCarlton (11th) Wins: 9. Losses: 14. Draft picks: 34, 44, 62*. What went well: Not much. George Hewett was one of few Blues to exceed expectations, putting together a career-best season in the midfield. Jack Silvagni and Tom De Koning are both leaving the Blues. Credit: Getty Images Better known as a defensive onballer, Hewett became a prolific ball-winner in his own right. In his 12th season on an AFL list, the former Swan is a strong chance to win his first best and fairest award.\n\nVeteran Nick Haynes overcame a horror start at the club to become dependable defender. He deserves another year. Young midfielder Cooper Lord is one to watch. George Hewett stepped up for the Blues in 2025, but didn’t get enough support. Credit: Getty Images The Blues blooded seven debutants, the best of whom looks to be key defender Harry O’Farrell, who, unfortunately, injured his knee. Other gains were bitter-sweet. Jack Silvagni was a revelation in defence but played just 13 games and is now on the move. Ollie Hollands found plenty of the ball in his new role as a running defender but his kicking needs work. It could be a rough exit meeting for: Mitch McGovern. The Blues are keen to get money off their books and the writing is on the wall for the 30-year-old, who narrowly missed a games trigger that would have earned a contract extension.\n\nWith Silvagni walking out and O’Farrell to be unsighted for much of 2026, the defender may yet get another year, but it will be on the Blues’ terms. Veterans Adam Saad and Blake Acres both had ordinary seasons. Something to look forward to: With mass change underway in the coaches box, free agents Tom De Koning and Silvagni confirming their departures, and ongoing chatter about Charlie Curnow, it’s already been a turbulent off-season for the Blues, and the AFL home and away season isn’t even officially over yet! Expect that turmoil to continue for some time yet. But once they ride that out, there will be hope again. The departures of De Koning and Silvagni will strengthen the Blues’ draft hand to acquire highly-rated Harry Dean as a father-son pick.\n\nDecimated by injury in 2025, the Blues can vault back into finals contention with a cleaner bill of health. Curnow (assuming he stays) and Sam Walsh had interrupted preseasons which severely impacted their year. Harry McKay missed half the season. Matthew Cottrell and Elijah Hollands, two of their best runners, hardly played, and heart-and-soul defender Nic Newman didn’t get on the field at all. Then there’s the prospect of a fit Jagga Smith. Get all them right and the Blues should be stronger – but this was a year when they fell well below expectations. Best and fairest tip: George Hewett.\n\n– Andrew Wu\n\nMelbourne (14th) Wins: 7. Losses: 16. Draft picks: 23, 51, 59* What went well: Kysaiah Pickett graduated from a star goalsneak to a game-breaking midfielder/forward who now rivals skipper Max Gawn as the club’s best player. Despite their troubles, the Demons secured Pickett’s prized signature in a huge coup, keeping him in the red and the blue until the end of 2034 on a lucrative contract. Midfielders Christian Petracca and Clayton Oliver are stars for Melbourne and both have long-term contracts, but that no longer means their respective futures at the club are guaranteed. Credit: Getty Images Gawn was again a colossus, talking through action on the field and becoming their spokesperson for almost every crisis off it.\n\nRebounding defender Jake Bowey has taken the next step to become a driver of the team while Harvey Langford, the No.6 pick in last year’s draft, is the Demons’ next A-grade midfielder after making a seamless transition to senior football. Veteran forward Jake Melksham, with 33 goals from 18 games, earned himself another contract, which was confirmed by the Demons just days after their season ended. It could be a rough exit meeting for: Clayton Oliver and Christian Petracca. Do two of Melbourne’s greatest players want to stay? If either player wants out, the club should not stand in their way.\n\nComing back from a life-threatening injury, Petracca’s season was steady, and he will likely finish in the top six of the club’s best and fairest award, but a long way from his game-breaking ways. Loading Oliver was better than last year when his campaign was compromised by his off-field issues. Both still have time to return to their best but the competition trend away from contest and stoppage towards speed and ball use is against them. Jacob van Rooyen went backwards in a season the club needed him to hold down a key forward posting.",
    "source": "SMH",
    "cluster_id": 34
  },
  {
    "url": "https://www.smh.com.au/politics/federal/the-latest-illustrations-from-artist-matt-golding-20230608-p5df5o.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "The latest illustrations from artist Matt Golding",
    "publish_date": "Tue, 30 Sep 2025 10:21:53 +1000",
    "category": "entertainment",
    "authors": [],
    "text": "The latest illustrations from artist Matt Golding\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 35
  },
  {
    "url": "https://www.sbs.com.au/news/article/afghanistan-internet-blackout-after-taliban-cuts-internet/1rtgkw8ml",
    "title": "Afghanistan under 'total' internet blackout after Taliban cuts fibre cables",
    "publish_date": "Mon, 29 Sep 2025 23:55:23 +0000",
    "category": "finance",
    "authors": [],
    "text": "The Taliban imposed a nationwide shutdown of communications in Afghanistan, weeks after they started severing fibre optic connections to prevent what it calls \"vice\" and immorality.\n\n\n\n\n\nConnectivity was operating at less than 1 per cent of its normal levels, according to internet watchdog Netblocks, which called it a \"comprehensive, or total blackout\".\n\n\n\n\n\nIn the minutes before it happened, a government official told the Agence France-Presse news agency the shutdown would last \"until further notice\".\n\n\n\n\n\n\"It is going to be cut, it will happen gradually tonight, there are eight to nine thousand telecommunications pillars that will shut down,\" he told AFP on condition of anonymity.\n\n\n\n\n\n\"There isn't any other way or system to communicate ... the banking sector, customs, everything across the country will be affected.\"\n\n\n\nAFP said it lost all contact with its bureau in the capital Kabul at around 11:30pm AEST.\n\n\n\n\n\nThe Taliban started the crackdown on access earlier this month, effectively shutting down high-speed internet in several regions.\n\n\n\n\n\nTelephone services are often routed over the internet, sharing the same fibre lines, especially in countries with limited telecoms infrastructure.\n\n\n\n\n\n\"A nationwide telecoms blackout is now in effect,\" said Netblocks, which monitors cybersecurity and internet governance, adding it \"appears consistent with the intentional disconnection of service\".\n\n\n\n\n\n\"It may turn out that disconnecting internet access while keeping phone service available will take some trial and error.\"\n\n\n\n\n\nOver the past weeks, internet connections have been extremely slow or intermittent.\n\n\n\n\n\nOn 16 September, Balkh provincial spokesperson Attaullah Zaid said fibre optic internet was completely banned in the northern province on the Taliban leader's orders.\n\n\n\n\"This measure was taken to prevent vice, and alternative options will be put in place across the country to meet connectivity needs,\" Zaid wrote on social media.\n\n\n\n\n\nAt the time, AFP correspondents reported the same restrictions in the northern provinces of Badakhshan and Takhar, as well as in Kandahar, Helmand, Nangarhar and Uruzgan in the south.\n\n\n\n\n\nAfghans in Australia and worldwide recently told SBS News the internet was a lifeline for women in a country where they are increasingly being \"erased\" from public life .\n\n\n\n\n\n\"Internet connection is a vital lifeline for the people of Afghanistan, including Balkh province, where I come from, linking local communities with the rest of the world,\" Nasir Ahmad Haidarzai, a PhD candidate at the University of Southern Queensland, told SBS Pashto.\n\n\n\n\n\n\"For many, especially youth and women, online access is the only way to study, gain knowledge and engage with the wider world,\" he said.\n\n\n\n\n\nIn 2024, Kabul had touted the 9,350-kilometre fibre optic network — largely built by former United States-backed governments — as a \"priority\" to bring the country closer to the rest of the world and lift it out of poverty.\n\n\n\n\n\nSince regaining power, the Taliban have instituted numerous restrictions in accordance with their interpretation of Islamic Sharia law.\n\n\n\n\n\nIt is the first time since the Taliban government won their insurgency in 2021 that communications have been shut down in the country.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 16
  },
  {
    "url": "https://www.sbs.com.au/news/video/what-is-the-palestinian-authority-in-60-seconds/c0iqo88i1",
    "title": "What is the Palestinian Authority in 60 seconds",
    "publish_date": "Mon, 29 Sep 2025 23:18:39 +0000",
    "category": "finance",
    "authors": [],
    "text": "What is the Palestinian Authority in 60 seconds\n\nPublished 29 September 2025, 11:05 pm\n\nThe Palestinian Authority is under the spotlight as more nations officially recognise a Palestinian state. So what is the Palestinian Authority, and whom does it represent?",
    "source": "SBS",
    "cluster_id": 36
  },
  {
    "url": "https://www.sbs.com.au/news/article/albanese-courts-middle-eastern-supermarket-giant/fr23o8co1",
    "title": "Albanese invites Arab 'hypermarket' to compete with Coles and Woolworths",
    "publish_date": "Mon, 29 Sep 2025 22:56:25 +0000",
    "category": "finance",
    "authors": [],
    "text": "He once derided his opponents as \"delulu with no solulu.\" But in Lulu, Prime Minister Anthony Albanese hopes he has found an answer to Australia's supermarket competition challenge.\n\n\n\n\n\nAlbanese finished his 10-day overseas mission with a stopover in the United Arab Emirates, visiting a local Lulu \"hypermarket\" and inviting the business to expand to Australia.\n\n\n\n\n\n\"I want to see more competition,\" he said. \"This is a significant company.\"\n\n\n\n'I want to see that competition'\n\nLulu Hypermarket is one of the largest retail chains in the Middle East, with over 250 stores across the region.\n\n\n\n\"They are the largest throughout the Middle East. Egypt, here ... the second-largest in Saudi Arabia,\" Albanese said.\n\n\n\n\n\n\"We know that Aldi, of course, has come to Australia, but this is a significant player that has an engagement with Australia and I want to see that competition.\"\n\n\n\n\n\nAlbanese said he \"had a little discussion\" with Lulu Hypermarket chair Yusuff Ali, as they were walking around the Abu Dhabi store, which had a display specially arranged with Australian products, including meats, cheese and biscuits.\n\n\n\n\n\n\"This company is big enough to have direct relations with [Australian] producers, whether they be mango producers, the orange producers, the meat producers that the chairman met in Mudgee that are still providing Halal-certified meat into this market,\" Albanese said.\n\n\n\nElection promises to outlaw price gouging\n\nDuring its election campaign, Labor promised to outlaw supermarket price gouging, with Albanese saying supermarkets were \"taking the piss\" out of Australians.\n\n\n\nA free trade deal between Australia and the UAE will enter into force on Wednesday, removing tariffs between the two countries. Source: Getty / Tasneem Alsultan / Bloomberg In March, the Australian Competition and Consumer Commission released its final report after a year-long supermarket inquiry, finding the dominance of Woolworths and Coles had an \"oligopolistic\" effect on the broader industry.\n\n\n\n\n\nThere was also a \"limited incentive\" for Coles and Woolworths to compete on price due to their market dominance, the review found.\n\n\n\n\n\nBut the consumer watchdog said it was \"very difficult\" to tell whether price gouging was actually happening in supermarkets.\n\n\n\n\n\nBoth Coles and Woolworths denied accusations of price gouging.\n\n\n\nFree trade deal with UAE about to start\n\nA free trade deal between Australia and the UAE will enter into force on Wednesday, removing tariffs between the two countries.\n\n\n\n\n\nThe UAE is one of the wealthiest countries in the region, with two-way goods and services trade worth $9.9 billion in 2023, and two-way investment exceeding that amount by just over double.\n\n\n\nThe visit was also timed to coincide with the 50-year anniversary of formal diplomatic relations between the two countries.\n\n\n\n\n\nThe quick stopover in the Middle East followed more lengthy engagements in the United States, specifically for the leaders' week at the United Nations, and the United Kingdom.\n\n\n\n\n\nAlbanese will be back overseas again soon, expected to take in a number of international gatherings during \"summit season\", and then for a much-anticipated formal meeting with US President Donald Trump.\n\n\n\n\n\nTrump couldn't squeeze Albanese into his diary during the prime minister's recent travel, but has confirmed a bilateral meeting on 20 October at the White House .\n\n\n\n",
    "source": "SBS",
    "cluster_id": 0
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/vital-role-of-translators-celebrated-amid-ai-challenge/maplcq05e",
    "title": "Vital role of translators celebrated amid AI challenge",
    "publish_date": "Mon, 29 Sep 2025 21:00:00 +0000",
    "category": "finance",
    "authors": [],
    "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nLess than a year ago, KaBik says she was put in an impossible position.\n\n\n\n\n\nHer mother was in the Emergency Department.\n\n\n\n\n\nBut she could not understand English and the doctors didn't speak Cantonese, so KaBik was forced to become her interpreter.\n\n\n\n\n\n\"It became really hard, especially in those critical moments. It was very overwhelming and heartbreaking to try and be her daughter in those moments and trying to be there for her.\"\n\n\n\n\n\nShe says it was an emotionally charged situation.\n\n\n\n\n\n“I think the most heartbreaking part was when the doctors told me that my mother was dying and they looked at me to translate it to her. And I really couldn't get myself to say those words to her, the words just got stuck in my throat. So I didn't tell her that - and to this day I wish she could have been told directly by someone, so she knew. I really believe no family should ever have to be put in that position.\"\n\n\n\n\n\nJinhyun Cho is a senior lecturer in the department of linguistics at Macquarie University.\n\n\n\n\n\nShe says circumstances like these are unethical - and avoidable.\n\n\n\n\n\n\"It's not fair to ask family members who are bilingual to do interpreting. I mean ethically, it's not fair, it's not right. Because in Australia, we have healthcare interpreter services.\"\n\n\n\n\n\nDr Cho believes Australia's language workforce, which is made up of more than 20,000 interpreters and translators are \"invisible\" to many.\n\n\n\n\n\n\"Not many people know the differences between translating and interpreting. The biggest difference is that translation is written whereas interpreting is spoken. In Australia, translators and interpreters. They are invisible. You know, in other countries such as Korea and China, they often appear in media because they interpret for high-ranking officials. And they follow the president on state visits. So they are like celebrities. In Australia, how many translators and interpreters do we see in media?\"\n\n\n\n\n\nFor over three decades, Selina Phan has been a Vietnamese interpreter and translator.\n\n\n\n\n\nShe says it's not just language she's conveying.\n\n\n\n\n\n\"There are things that are being said, not just in words, not being uttered. But you, as an interpreter, you understand both cultures. And therefore when you interpret you have to convey the meaning in full.\"\n\n\n\n\n\nAssociate Professor Rosemary Wyber at the Australian National University is also a clinical GP at Companion House, a health service for refugees in the ACT.\n\n\n\n\n\n\"Interpreters are transformative in our capacity to deliver healthcare to people who speak a language other than English. There's simply no substitute for people being able to hear medical information in their own language and more importantly to be able to tell their story in their own language. And even though there's not a translator in the room with us. It's a service that's provided through the phone. I can see the relief and the happiness that people take from being able to tell their own story and know that they're being understood.\"\n\n\n\n\n\nDr Cho says accurately conveying the meaning of a health condition or diagnosis is challenging for translators.\n\n\n\n\n\n\"There are many concepts that cannot be translated into other languages. Taking depression as an example, in many countries in Africa, depression doesn't exist. And people there they see someone who is depressed as lazy, or that person sleeps too much. If the interpreter is not familiar with that kind of culture, how would that be interpreted.\"\n\n\n\n\n\nThe development and adoption of AI also poses another challenge for translators.\n\n\n\n\n\nIn early September, Apple announced its headphone product, AirPods, now has live translating capabilities.\n\n\n\n\n\nAd: \"Want to translate a message, call or conversation in person?\"\n\n\n\n\n\nThe company says the feature is set to \"bridge language barriers in person\".\n\n\n\n\n\nIn April, language-learning app, Duolingo more than doubled its content offering; launching 148 new language courses with the assistance of generative AI.\n\n\n\n\n\nIt previously took 12 years to develop the initial 100 courses.\n\n\n\n\n\nMicrosoft has also published a report which aims to quantify the \"AI applicability\" of various occupations.\n\n\n\n\n\nIt identified translators and interpreters as being most at risk, with 98 per cent of the tasks overlapping.\n\n\n\n\n\nBut professional translator Ms Phan believes she can work alongside the technology.\n\n\n\n\n\n\"Look, I don't see it as a risk. AI is here, technology, all these new technologies are you know here. In fact, they've been here for ages. We need to work with it, and adapt, so that it works for us - and not against us.\"\n\n\n\n\n\nIt's not uncommon for language service providers to use artificial intelligence to provide a rough translation in the first instance, which is then reviewed by humans for accuracy.\n\n\n\n\n\nDr Cho says there are pitfalls with the current technology.\n\n\n\n\n\n\"It often takes more amount of time than translating the text by themselves - because ... depending on the quality of machine generated translation. Then, another issue is that the payment tends to be low for post-editing. Because language service providers have these rating systems. And because you translate the whole text by yourself, so the payment is higher.\"\n\n\n\n\n\nAssociate Professor Rosemary Wyber says as a clinical GP she can see the benefits, as along as the technology is used appropriately.\n\n\n\n\n\n\"When we can work together with a patient, a translating service and a clinician to all be on the same page and have a shared understanding of the medical issues - what's working, what's not working - that really enables care to be delivered in a way that would be impossible without translating services.\"\n\n\n\n\n\nKaBik says there should be more clarity about what services are available to Australians in emergency situations.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 37
  },
  {
    "url": "https://www.sbs.com.au/news/article/spouses-for-sale-inside-the-black-market-for-skilled-visa-applications/hrvnc37nc",
    "title": "Spouses for sale: Inside the black market for skilled visa applications",
    "publish_date": "Mon, 29 Sep 2025 19:43:06 +0000",
    "category": "finance",
    "authors": [],
    "text": "Jerry (not his real name) was looking for a shortcut — he wanted to obtain permanent residency in Australia by Christmas.\n\n\n\n\n\nSo using the Chinese e-commerce app Xiaohongshu, the international student posted a request online in April.\n\n\n\n\n\nHe wrote he was looking for a \"primary applicant\" to take him along to lodge subclass 189 and 190 skilled migration applications — both of which are permanent visas for skilled migrants.\n\n\n\n\n\nA reply came back, saying they could act as his agent with a \"ready-made\" primary applicant with \"a very high score\".\n\n\n\nHow 'spouses' for skilled visas are sold on the black market\n\nIn Australia’s skilled migration program, a primary applicant applies for permanent residency based on qualifications and work experience.\n\n\n\n\n\nThey may include a spouse or children as secondary applicants. Only one spouse can be included. The applicants are points-tested based on factors such as age, work experience, education, and English proficiency.\n\n\n\n\n\nSBS Mandarin has uncovered that a secondary applicant place, which should be reserved for family, is being openly sold on the black market through online apps such as Xiaohongshu.\n\n\n\nJerry* used a Chinese e-commerce app to find a migration agent. Credit: SBS Mandarin The migration agent who replied to Jerry said they would charge tens of thousands of dollars. Jerry said this was considered \"market rate\".\n\n\n\n\n\nJerry — who requested anonymity for this story — met the agent at their Sydney office in April and signed the contract in May.\n\n\n\n\n\nThen, he paid a $5,000 deposit, signed a contract and the agent told Jerry they'd found him a \"partner\".\n\n\n\n\n\n\"They helped us match with a suitable primary applicant,\" Jerry told SBS Mandarin.\n\n\n\n\n\n\"That primary applicant had to have a very high score, was within state nomination quotas, and the profession had to be on the skilled occupation list.\"\n\n\n\n'She told me how to pose for photos'\n\nThe migration agent found Jerry a fake \"spouse\" in nursing with a migration score of 90 points.\n\n\n\n\n\nAfter the match, to prove their spousal relationship, they had to fabricate a series of cohabitation documents.\n\n\n\n\n\n\"We had to start building a de-facto relationship,\" Jerry said.\n\n\n\n\n\n\"The (agent) required us to go out together for meals, take intimate photos.\n\n\n\n\n\n\"The (agent) would instruct us how to pose.\n\n\n\n\n\n\"I felt something was wrong because my primary applicant was very skilled at taking these photos, as if she had done it with others before.\n\n\n\n\n\n\"She told me exactly where to put my hand, how to pose for the photo.\"\n\n\n\nThe migration agent told Jerry to open a joint bank account in which combined spending between him and his partner had to go through.\n\n\n\n\n\n\"So the government would believe we were living together,\" Jerry explained.\n\n\n\n\n\n\"They even said they would help us produce utility bills, and rent a place together.\"\n\n\n\n\n\nJerry said the application process arranged by the agent was \"very efficient\". In July, the agent told him he would be granted permanent residency by Christmas.\n\n\n\n\n\nExcited at the prospect of finalising his dream within months, he went straight to pay the second instalment.\n\n\n\n\n\n\"That joy clouded my judgement,\" he said.\n\n\n\n\n\n\"I lost my basic ability to think clearly.\"\n\n\n\n'My whole body was trembling'\n\nBut earlier this month, a phone message shattered his ambitions. It was the \"nurse\" — his fake spouse — with a confession to make.\n\n\n\n\n\nShe told Jerry that the migration agent had \"tricked\" her into meeting and taking staged photos with other secondary applications.\n\n\n\n\n\nNot only was she not even a nurse in NSW, her points were fabricated.\n\n\n\n\n\n\"When I read this message in the morning, I was shocked awake,\" Jerry said.\n\n\n\n\n\n\"My whole body was trembling.\"\n\n\n\nJerry joined a victims' chat group, and discovered that not only had he not been invited, but no application had ever been lodged under his name.\n\n\n\n\n\nHe discovered that the screenshots he was sent from what was purported to be the Department of Home Affairs' official website were fake.\n\n\n\n\n\nJerry met someone with the same fake spouse as him and compared the screenshots — they were identical, bar details like the date of birth.\n\n\n\n\n\nHe called the Department of Home Affairs, which confirmed there was in fact, no application lodged in his name.\n\n\n\n\n\n\"From that day, my life just stopped.\"\n\n\n\nAn estimated multi-million dollar scam with multiple alleged victims\n\nLater, many victims in the group chat said the joint accounts they had set up with their fake spouse had been shut down by the agents, and all the money inside was taken away.\n\n\n\n\n\nMore than 90 people are part of that victims' group, scammed of an estimated amount exceeding $10 million, according to Jerry.\n\n\n\n\n\nSome victims confronted the agents, but instead of resolving the issue, they were threatened.\n\n\n\n\n\n\"They told us directly: if you keep making trouble, we will make sure you cannot stay in Australia.\n\n\n\n\n\n\"They said they would report our visas, and even insulted us as 'trash from China's lower class'.\n\n\n\n\n\n\"Some victims said their visas really had been reported by the agents, leaving them without any valid status in Australia, forcing them to return home.\"\n\n\n\nREAD MORE The new scam that could target anyone scrolling social media\n\nSBS News has contacted the Department of Home Affairs for comment.\n\n\n\n\n\nLast week, the department issued a notice to the public stating it was cracking down on dodgy migration agents who'd ripped off applicants through unlawful migration advice.\n\n\n\n\n\nFour scam agents operating in Australia illegally in Victoria and Queensland — who were charging people $1.4 million for protection visas when the applicants were not asylum seekers — were detained and another three are being deported, it said.\n\n\n\n\n\n\"If you'e a visa applicant, scam agents may tell you to provide false or misleading information and false documents when applying for a Protection visa,\" the department said in a Facebook post.\n\n\n\n\n\n\"But this activity is illegal and could result in you facing large fines and possible jail time for up to 10 years.\"\n\n\n\n\n\nSean Dong, a senior lawyer and migration agent at ProActive Legal, said the department has the power to investigate and cancel visas if fraud is detected.\n\n\n\n\n\n\"If refused, there will be a three-year bar, meaning most visas cannot be granted,\" he said.\n\n\n\n\n\nDong said people should look for only licenced migration lawyers, which can be checked on the Office of the Migration Agents Registration Authority website.\n\n\n\n\n\nJerry said he has now reported the matter to NSW Police, and he'd been granted a case number.\n\n\n\n\n\nThis story was produced in collaboration with SBS Mandarin.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 38
  },
  {
    "url": "https://www.sbs.com.au/news/article/these-investors-lost-millions-to-failed-sda-housing-scheme/zid4j9ewc",
    "title": "'They destroy lives': How property investors lost millions to a failed housing scheme",
    "publish_date": "Mon, 29 Sep 2025 19:42:27 +0000",
    "category": "finance",
    "authors": [],
    "text": "In 2019, Egyptian Australian businessman Ahmed Sokarno arrived in Tehran to sell to a group of Iranians the dream of a new life in a \"land of opportunities\".\n\n\n\n\n\nSokarno's offer was simple: Invest in Australian disability accommodation, get \"guaranteed\" annual returns of between 10 and 24 per cent and secure permanent business visas.\n\n\n\n\n\nSeveral of them bought in, transferring hundreds of thousands of dollars to companies set up by Sokarno and his company, then known as Auscare.\n\n\n\n\n\nOne of the investors, Saadegh Shams Haaeri, tells SBS News his wife Zainab Kaaranjaam \"had a dream about Australia\".\n\n\n\n[We wanted to] grow our children in a free, fair, and developed country … We wanted to have a better future for our baby.\n\nShams and Kaaranjaam are pharmacists who co-owned a pharmacy in Tehran — a business they sold to fund their $600,000 investment in Australia.\n\n\n\nSaadegh Shams Haaeri says the $600,000 he and his wife Zainab Kaaranjaam invested through Ahmed Sokarno represented 20 years of hard work. Source: SBS News / Otis Filley In addition to the promise of \"guaranteed\" returns, investors' confidence in Auscare was bolstered by the fact that, at the time, the company's director was a former premier of Queensland, Rob Borbidge.\n\n\n\n\n\nWhile some investors made it to Australia, their dreams never eventuated.\n\n\n\n\n\nBy 2022, all of the money they'd transferred was in bank accounts to which they had no access, and construction of the homes was yet to start.\n\n\n\nSaadegh Shams Haaeri and Zainab Kaaranjaam invested hundreds of thousands of dollars to buy land in Melbourne's north-western suburb of Melton. Source: SBS News / Otis Filley Some have now returned to Iran, while others remain in Australia, working whatever jobs they can to make ends meet.\n\n\n\n\n\nTheir story is among the many unrealised promises that have emerged in connection with the National Disability Insurance Scheme's (NDIS) Specialist Disability Accommodation (SDA) program, which relies on private sector investment.\n\n\n\n'Everything looked very legitimate'\n\nIn July 2019, dozens of Iranians gathered at a hotel in Tehran to hear how Sokarno could help them secure temporary 188 Business Innovation and Investment visas — a pathway to permanent residency if a successful business is up and running. (The visa class was discontinued in July 2024.)\n\n\n\n\n\nHis proposal involved setting up a joint company with each investor to buy land, construct SDA housing and then collect rent from NDIS participants — revenue he told prospective investors was \"guaranteed\" because of the government's commitment to the NDIS.\n\n\n\n\n\n\"This business is guaranteed income because you get paid by the government,\" Sokarno told the seminar's attendees.\n\n\n\n\n\nTwo other investors, Amir Mohammadi and Hamidreza Dehghanian — who lost $462,900 and $115,600, respectively — tell SBS News that it was this promise of government support that won them over.\n\n\n\nAhmed Sokarno told seminar attendees that Auscare was one of \"the very small number of companies in Australia [that] provide services for accommodation and disability services\". Source: Supplied SBS News is aware of at least three other Iranian investors who also signed on.\n\n\n\n\n\nShams says he \"didn't have any doubts because they gave us a lot of guarantees for the success of the business\".\n\n\n\nEverything looked very convincing and everything looked very legitimate.\n\nSokarno told participants they could expect returns of between 10 and 24 per cent per annum, stressing this was far higher than mainstream residential rental returns of between 4 and 6 per cent.\n\n\n\n\n\nTo put this into perspective, an initial investment of $600,000 would, according to Sokarno, deliver a return of between $60,000 and $144,000 a year.\n\n\n\n\n\nThe contracts Shams and Dehghanian ended up signing stated that their return on investment would be up to 24 per cent and no less than 10 per cent per year, while Mohammadi's contract promised returns of up to 28 per cent.\n\n\n\nSaadegh Shams Haaeri received a large amount of Auscare material singing the praises of SDA investment before he decided to invest. Source: SBS News / Otis Filley Experts tell SBS News promises of the SDA market providing \"guaranteed\" returns, especially returns that high, are misleading.\n\n\n\n\n\nResponding to questions about these projections, Sokarno tells SBS News he \"believed it was an honest representation at the time\".\n\n\n\n\n\n\"There was, and continues to be, a high demand for SDA housing, and the potential returns vary depending on the property's location. These factors were communicated as part of the overall investment considerations,\" he says.\n\n\n\n\n\nDuring his 2019 seminar in Tehran, Sokarno also mentioned several times that Auscare's director was Rob Borbidge, who served as Queensland's premier from 1996 to 1998.\n\n\n\nRob Borbidge (third from right), Ahmed Sokarno (second from right) and Ali Shahami (far right) at a 2019 Melbourne event seeking to attract SDA investors. (RACV is not associated with the group.) Source: Supplied Borbidge's involvement gave Shams and Kaaranjaam confidence in Auscare. Shams says they were convinced someone of his stature was \"not going to ruin his reputation\" by being associated with a company that isn't reputable.\n\n\n\n\n\nBorbidge stepped down from his director role in July 2022, around the same time Auscare changed its name to Care Services Australia following a legal challenge from a similarly named company.\n\n\n\n\n\nResponding to questions put by SBS News, Borbidge denied he had any knowledge of the matters raised or involvement with any investors, saying: \"To the best of my recollection, I] have never met any of the individuals referred to.\"\n\n\n\nRob Borbidge talks with soon-to-be-elected Queensland Premier David Crisafulli at an election debate in Brisbane on 16 October 2024. Source: AAP / Darren England \"I have never received any communication from the individuals concerned in regard to the matters you have raised during my time with Care Services Australia or since,\" Borbidge says.\n\n\n\n\n\nIn 2023, he was hit with a $112,361 tax bill for unpaid employee super payments that Care Services Australia allegedly failed to make during his tenure as director, The Courier Mail reported.\n\n\n\n\n\nSBS News understands Borbidge paid the outstanding amount, and the action was discontinued.\n\n\n\n'Not the time to think … time to act'\n\nMohammadi says that, at the time of the 2019 Tehran seminar, he was led to believe that \"Auscare is one of the best companies in Australia\".\n\n\n\n\n\nAuscare — now Care Services Australia — was and remains a relatively small company.\n\n\n\n\n\nPromotional material sent to investors ahead of the seminar describes Auscare as one of the \"top three\" NDIS providers in Australia, a point that also helped win over some investors.\n\n\n\nSaadegh Shams Haaeri says what drew him to Australia was \"the promise that if you invest and work hard here, you’ll be rewarded — with permanent residency, a secure life and the chance to contribute meaningfully to the community\". Source: SBS News / Otis Filley When asked whether this was an appropriate claim to make, Sokarno tells SBS News: \"It is an accurate description, as we have been recognised as one of the leading providers with a strong focus on multicultural communities.\"\n\n\n\n\n\nThat material was shared by Ali Shahami, an Iranian-Australian migration agent, who was closely involved in recruiting the Iranian investors.\n\n\n\n\n\nIn fact, the company does not appear in any reputable listing of top-rated or large-scale NDIS providers.\n\n\n\nA flyer for the 2019 Tehran seminar shows Ahmed Sokarno alongside Iranian-Australian migration agent Ali Shahami. Source: SBS News / Otis Filley During the Tehran seminar, Shahami praised Sokarno's offer.\n\n\n\n\n\n\"If you have a plan, this is not the time to think. It is time to act,\" he said.\n\n\n\n\n\nIn a 2019 interview with a Persian-language community station, Shahami was introduced as the business development manager of Auscare, and promised investors that the company could organise a \"work dinner\" with the NDIS minister.\n\n\n\nIranian-Australian migration agent Ali Shahami told seminar attendees: \"Auscare is very good for the 188 visa, it has been embraced by [people in] China and Saudi Arabia, and they have started with Iran recently.\" Source: Supplied Sokarno confirmed to SBS News that Auscare engaged Shahami's company \"as a consultant from 3rd February 2020 to 24th March 2020\".\n\n\n\n\n\nSBS News approached Shahami with a list of questions, but received no response.\n\n\n\n'I felt there was something wrong'\n\nAt the Tehran seminar and in contracts signed with investors, Sokarno promised that, upon receiving the final investment amounts, NDIS-approved properties would be up and running within nine to 12 months.\n\n\n\n\n\nAt least two of the investors pulled out before providing all of the funds. They say they are still waiting for their money to be refunded.\n\n\n\n\n\nDehghanian came to Australia in May 2022. At this point, he had only handed over $115,600 of a promised $420,000 as he had \"some hesitations [to pay the full amount] and decided to come to Australia and see the situation first\".\n\n\n\n\n\n\"When I came to Australia, I felt there was something wrong and the investment was not going to work,\" he says.\n\n\n\n\n\nIn January 2023, he sought to exit the deal, but Sokarno quickly became unresponsive, Dehghanian says, adding that he was unable to afford a lawyer to take the matter to court.\n\n\n\n\n\nAccording to Sokarno, Dehghanian's deposit was not repaid because, under the terms of the agreement, \"early termination did not entitle the investor to an automatic full refund, particularly where funds had already been committed to project-related expenses\".\n\n\n\nHamidreza Dehghanian, who was a GP in Iran, says due to the \"economic, social, and cultural situation in Iran\", he no longer felt comfortable raising his children there. Source: SBS News / Otis Filley Mohammadi paid more than $462,000 of the promised $600,000 and planned to pay the rest after he landed in Australia in late 2022.\n\n\n\n\n\nHe says that, during his two weeks in Australia, he had several meetings with Sokarno and Shahami to discuss the project.\n\n\n\n\n\nHowever, he soon became suspicious — especially when Sokarno refused to show him statements for their joint company's bank account, to which he still hadn't been granted access.\n\n\n\n\n\nOther investors allege Sokarno and his accountant repeatedly refused to provide this information, despite multiple email requests sent over the span of several years, which have been seen by SBS News.\n\n\n\n\n\nThe joint venture partnership agreements — also seen by SBS News — contain several provisions giving investors the right to access bank accounts.\n\n\n\nSokarno says he had \"made efforts to ensure transparency in accordance with those agreements\".\n\n\n\n\n\n\"However, any specific requests for access were either addressed directly or pending clarification, particularly where banking or legal protocols required additional steps or third-party cooperation,\" he says.\n\n\n\n\n\n\"If there were delays or issues in providing access, they were not intentional.\"\n\n\n\n\n\nHe says Westpac, the bank at which the accounts were set up, raised issues with him relating to its 'Know Your Customer' (KYC) and Anti-Money Laundering (AML) obligations, particularly relating to some investors of Iranian nationality or origin.\n\n\n\n\n\n\"These requirements were outside of my control and applied to multiple investors … I am in the process of gathering documentary evidence from the relevant financial institutions that reflect these compliance-related issues and access restrictions,\" Sokarno says.\n\n\n\n\n\nSBS News has not been provided with evidence to suggest the bank raised these issues, and multiple investors have confirmed they never received any documentation regarding this matter either. Westpac declined to comment on the matter.\n\n\n\n\n\nMohammadi then advised Sokarno in April 2023 that he wanted to cancel his investment in the project.\n\n\n\nAmir Mohammadi suspects Ahmed Sokarno \"wouldn't dare to do this with an Australian citizen, because the law would have supported them, but our visa was temporary, and we didn't know about Australian law\". Source: Supplied Mohammadi was advised by Sokarno's lawyer in May that he could recoup his money — minus $86,237 Sokarno had deducted for expenses — if either party found a replacement investor for the joint company.\n\n\n\n\n\nSo far, his money has still not been returned.\n\n\n\n\n\nAccording to Sokarno, the reasoning behind his request to find a replacement investor is \"to maintain the financial stability of the project and avoid jeopardising commitments already made on behalf\" of the joint company.\n\n\n\n\n\nHe says multiple other provisions within the agreement \"support the position that the return of funds is not unconditional or automatic\", and other factors, such as \"tax and accounting implications\", also affected the return of the funds.\n\n\n\n'We are trapped'\n\nUnlike other Iranian investors interviewed by SBS News, Shams and Kaaranjaam paid the full investment amount before coming to Australia.\n\n\n\n\n\nThey had been pressuring Sokarno to buy a block of land since mid-2020, Shams says, and the process finally started in February 2022, a month before Shams and Kaaranjaam's arrival in Australia.\n\n\n\n\n\nA statement of account seen by SBS News shows the joint company set up with Sokarno, Deniz Care, settled the land for $435,416 in June 2022, with around half the money paid upfront and half borrowed.\n\n\n\n\n\nGiven the delays in generating revenue, Sokarno employed Shams as a community engagement manager and Kaaranjaam as an administration manager for Auscare, but Shams says they were never paid for their almost four months of work.\n\n\n\nAhmed Sokarno, Zainab Kaaranjaam and Saadegh Shams Haaeri outside the block of land bought for their planned SDA property in the north-west Melbourne suburb of Melton. Source: Supplied \"I started to become suspicious about it,\" Shams says.\n\n\n\n\n\n\"[Sokarno] was not paying anything. He promised to give the revenue of Deniz Care, but he didn't.\"\n\n\n\n\n\nIn the following months, Shams asked for all the company's financial statements. He says the only thing he and Kaaranjaam ever received was an account summary showing a $357,000 balance, without a transaction history.\n\n\n\n\n\nLike other investors, he had long been suspicious of Sokarno's unwillingness to provide access to the company's bank account.\n\n\n\n\n\n\"Every time he was giving me some excuses, I fully became sure that, 'Oh my God, we are trapped,'\" Shams says.\n\n\n\n\n\n\"I understood it was never going to become a good business for us for our permanent residency pathway.\n\n\n\nWe lost our money, we lost our time.\n\nDue to the resulting stress, Kaaranjaam was hospitalised in July 2022 after experiencing an anxiety attack.\n\n\n\nMelbourne's Melton-Bacchus Marsh area is possibly one of the \"epicentres of SDA market failure\", according to disability housing expert Joseph Connellan. Source: SBS News / Otis Filley The couple decided to pursue legal action against Sokarno in September of that year after delays in building the property and continued denial of access to bank records.\n\n\n\n\n\nThe land was ultimately repossessed by the lender in September 2024, as no repayments had been made. SBS News has seen documents that show the lender repeatedly sought payment from Sokarno for an outstanding amount of $227,500 for at least a year before the property's repossession.\n\n\n\n\n\n\"Sokarno didn't even pay one instalment of the loan for purchasing the land. What does that mean?\" Shams says.\n\n\n\n\n\nSokarno has blamed the collapse on Shams and Kaaranjaam lodging a caveat on the property in February 2023, a legal instrument that protects equity and prevents the sale or transfer of a property without the involvement of the party who lodges the caveat (typically the buyer).\n\n\n\n\n\nSokarno says while he was \"fully prepared to commence construction\", the caveat prevented him \"from proceeding further with construction or refinancing\". It is worth noting that a caveat does not preclude loan repayments being made on the property in question, which is the reason the property was repossessed.\n\n\n\nDocuments seen by SBS News show the design for the property Saadegh Shams Haaeri and Zainab Kaaranjaam invested in received SDA approval on 9 May 2023. Source: Supplied \"In my view, the failure to bring the project to completion was due to their [Shams and Kaaranjaam's] voluntary withdrawal and subsequent legal actions, which created legal and financial barriers to progressing the development,\" Sokarno says.\n\n\n\n\n\nAccording to an email Sokarno sent to Shams in August 2022, there was an amount of $357,103 remaining in the joint company's bank account. In October 2023, via their solicitors, Shams and Kaaranjaam tried to compel Sokarno to use those remaining funds to settle the defaulted loan; however, no payments were made, and the money was never refunded.\n\n\n\n\n\nResponding to SBS News' questions, Sokarno says: \"The reason I did not return any remaining funds is that, to the best of my knowledge and financial records, there were no remaining funds available to return.\"\n\n\n\nA house has since been built on the site bought by Saadegh Shams Haaeri, Zainab Kaaranjaam and Auscare — and it's currently for sale. Source: SBS News / Otis Filley \"Additionally, any potential return of funds was subject to the terms of our agreement, which outlined that funds could only be returned after costs and under specific exit conditions,\" he says.\n\n\n\n\n\nShams and Kaaranjaam dropped their claim against Sokarno in December 2022, as they were unable to continue paying their lawyers after spending an initial $16,000 on legal fees and were quoted almost $170,000 to complete the proceedings.\n\n\n\nOverseas, CALD investors 'more vulnerable'\n\nThese stories are far from the only examples of private investment in SDA housing going awry.\n\n\n\n\n\nThe national peak body for the SDA housing market, the SDA Alliance, has been fielding a growing number of complaints over dodgy retail investment practices and the construction of housing that is not fit for purpose.\n\n\n\n\n\nCEO Jeramy Hope tells SBS News there is \"ongoing concern about the presence of unethical, underqualified, and at times outright fraudulent operators in the SDA market\".\n\n\n\n\n\n\"We receive complaints each month from concerned families, investors and stakeholders about questionable practices,\" Hope says, adding that the alliance is preparing to report several matters of concern this month.\n\n\n\nSDA Alliance CEO Jeramy Hope says the media narrative around SDA \"often focuses on 'fraud' and 'bad actors', but it's essential not to lose sight of the fact that when done well, SDA can be life-changing for participants\". Source: Supplied / SDA Alliance \"These bad actors frequently promote SDA as a 'guaranteed high-return' or 'NDIS-backed' investment, misusing official terms and logos in marketing.\n\n\n\n\n\n\"These claims are often deceptive or outright false. SDA is not a standard real estate product; it is a complex, regulated housing stream underpinned by human rights obligations and participant choice.\"\n\n\n\n\n\nHope says his organisation is \"increasingly seeing international investors, particularly from Asia and the Middle East, being targeted through property expos, migration schemes, and online promotions\".\n\n\n\nSaadegh Shams Haaeri says that, since he lost faith in his SDA investment, he and his wife, Zainab Kaaranjaam, \"decided to focus on rebuilding our life wisely\". Source: SBS News / Otis Filley He says \"investors from overseas or culturally and linguistically diverse (CALD) communities are often more vulnerable\" to buying into such schemes.\n\n\n\n\n\n\"Language barriers, unfamiliarity with Australia's regulatory frameworks, and targeted marketing in their native languages all contribute to this vulnerability,\" he says.\n\n\n\n\n\nAccording to Sokarno, Care Services Australia has only targeted overseas investors for SDA projects.\n\n\n\n'Screwed over' by 'spruikers'\n\nEthical Property Investments CEO Goro Gupta — who has worked in disability housing since 2017 — says he's also heard multiple stories of foreign investors being \"screwed over\" by SDA \"spruikers\".\n\n\n\n\n\nIn May, the Courier Mail reported that Cocoon SDA Care — a company that has been the subject of much media coverage and which the NDIS has now permanently banned from providing disability support and services — sought to recruit foreign investors.\n\n\n\n\n\nGupta also says any promises of \"guaranteed\" government-backed returns for an SDA investment were a \"lie\".\n\n\n\n\n\n\"There is no direct relationship between the investor and the government. The way the system works is, once a resident moves in, an SDA provider can bill their plan, and it's up to the SDA provider what their arrangement with the landlord is,\" he says.\n\n\n\nGoro Gupta says that, despite issues in the SDA system, \"it is thoroughly profitable and ethical if done right\". Source: Supplied NDIS Minister Jenny McAllister agrees that finding a government-funded occupant for an SDA property isn't a guarantee.\n\n\n\n\n\n\"Specialist Disability Accommodation investments are not government-backed. Occupancy is not guaranteed,\" she says.\n\n\n\n\n\n\"There are unfortunately some people active in the Specialist Disability Accommodation sector that come to mum and dad investors and give them information that just isn't true.\"\n\n\n\n\n\nOnce a tenant moves in, general returns are typically anywhere from 8 to 15 per cent, with an industry median of around 12 per cent, Gupta says.\n\n\n\n\n\nHowever, because much construction has occurred in areas with little or no demand, the national vacancy rate for available but empty SDA properties is around 16 per cent, according to SBS News' analysis of vacancy data from the National Disability Insurance Agency (NDIA).\n\n\n\nBut as many SDA dwellings are designed to house multiple people, the proportion of empty bedrooms is even higher — above 40 per cent, according to disability housing expert Joseph Connellan.\n\n\n\n\n\nThat's despite an overall shortfall of 7,352 rentals nationally, based on the number of people currently eligible for SDA but not accessing it. (Around 40 per cent of SDA-eligible participants are not living in SDA dwellings.)\n\n\n\nThere is an overall shortfall of 7,352 rentals nationally, based on the number of people currently eligible for SDA but not accessing it. Source: SBS News While vacant SDA properties leave investors out of pocket, it's not just specific investors who suffer from these poorly planned investments, Hope says.\n\n\n\n\n\n\"At the provider level, unscrupulous behaviour leads to oversupply in areas of low demand, distorts pricing, and discourages ethical investment,\" he says.\n\n\n\n\n\n\"At the participant level, the consequences are personal and distressing as people with disability may be placed in housing that is inappropriate, poorly built, or not aligned with their support needs, further limiting their choice and control.\"\n\n\n\nSokarno, Shahami still in business\n\nCare Services Australia still provides disability and aged care services to multicultural communities and promotes itself as having over 3,000 \"satisfied patients\".\n\n\n\n\n\nInformation about companies in the NDIS — such as the number of employees they have or properties they manage — is not publicly available.\n\n\n\n\n\nHowever, a reverse image search of the six customer testimonials listed on Care Services Australia's website, which includes customer names and photographs, shows all were generated using stock images.\n\n\n\n\n\nSokarno did not provide SBS News with further information about his company.\n\n\n\n\n\nOf the several industry sources SBS News spoke to for this investigation, none had heard of Care Services Australia or Auscare.\n\n\n\n\n\nShahami's company R&K Immigration Group is also still operational and, as of September 2025, he is still a registered Australian migration agent.\n\n\n\nIn 2020, Ali Shahami was advertising himself as the business development manager of Auscare, which some Iranian investors said was a conflict of interest with his role as their migration agent. Source: Supplied Groups that oversee the NDIS, such as the NDIA and NDIS Quality and Safeguards Commission, are primarily focused on protecting participants.\n\n\n\n\n\nAn NDIA spokesperson told SBS News the agency's \"role in relation to Specialist Disability Accommodation is as a market steward\".\n\n\n\n\n\n\"The NDIA is committed to supporting a robust and efficient market for SDA that gives NDIS participants the modern options and choices that they deserve,\" the spokesperson said.\n\n\n\n\n\n\"The NDIA does not own, commission, lease or provide SDA dwellings, nor does it regulate or investigate investment schemes.\n\n\n\n\n\n\"SDA investors should always conduct their own thorough due diligence and research, and seek independent legal and financial advice when deciding whether to invest in SDA.\"\n\n\n\nAhmed Sokarno tells SBS News he was \"not in a position to determine\" whether Ali Shahami's role as a consultant for his business constituted a conflict of interest, \"as I was not involved in how he managed his relationships or communications with his clients\". Source: Supplied Suspected investor fraud is handled by the Australian Securities and Investments Commission (ASIC).\n\n\n\n\n\nWhen asked whether the NDIA intends to alter the SDA scheme to shield against unethical investment from the private market, McAllister said: \"Investors should contact ASIC if they are concerned that an SDA investment scheme has engaged in misleading behaviour or misappropriated investor funds.\"\n\n\n\n\n\nKaaranjaan and Shams lodged a report of misconduct in respect of Sokarno and Deniz Care with ASIC on 13 November 2024. They have not heard back since.\n\n\n\n\n\nASIC is a member agency of the NDIS Fraud Fusion taskforce, which the government launched in November 2022.\n\n\n\n'We need accountability'\n\nFor many of Sokarno's clients, the future remains uncertain.\n\n\n\n\n\nWhen Dehghanian first came to Australia, he found work renovating kitchens and bathrooms, and then he worked as a house painter.\n\n\n\n\n\nHe is now working as a car dealer but is unsure whether he will be able to obtain a permanent business visa to stay in Australia.\n\n\n\n\n\nMohammadi returned to Iran shortly after losing faith in Sokarno's plan, where he remains today.\n\n\n\n\n\n\"I thought if I stayed in Australia, I would only spend money [not make any] … I was hopeless,\" he says.\n\n\n\n\n\nShams and Kaaranjaam are still living in Melbourne, and Shams is working as an Uber and Amazon delivery driver to support his wife and their seven-month-old daughter.\n\n\n\nSaadegh Shams Haaeri says he often works 12-hour days, starting at 4 am and finishing around 5 pm, while Kaaranjaam \"takes care of our newborn daughter, manages everything at home, and continues to support me through all of this\". Source: SBS News / Otis Filley They tried to apply for Centrelink payments, but their visa status makes them ineligible.\n\n\n\n\n\n\"So we went to a charity and took some food from them. I didn't want to say that, because it's a shame for me. I brought $600,000 here in Australia, but I need to go to a charity and ask them for help with food,\" Shams says.\n\n\n\nI feel devastated. I don't know what to do.\n\nTheir visas will expire in March 2026 and, unless they can find another visa pathway, they will return to Iran \"to start from scratch\".\n\n\n\n\n\nShams says he has found a pharmacy in Western Australia that has agreed to sponsor him for a work visa, and the couple will soon move so he can start work there.\n\n\n\n\n\nHe says experiences such as this can \"destroy lives\".\n\n\n\n\n\n\"We’ve had really hard times — harder than we could have ever imagined. We brought $600,000 to Australia, hoping to invest and build a better life than we had in Iran. But I never imagined that instead of stability, I would be forced to struggle just to survive.\n\n\n\n\n\n\"We believed in this country; we still do. But belief is not enough. We need accountability, enforcement, and protection for vulnerable migrants.\"\n\n\n\n",
    "source": "SBS",
    "cluster_id": 39
  },
  {
    "url": "https://www.sbs.com.au/news/video/federal-government-under-pressure-after-latest-optus-000-blackout-in-nsw/bint5l3fg",
    "title": "Federal Government under pressure after latest Optus 000 blackout in NSW",
    "publish_date": "Mon, 29 Sep 2025 10:56:40 +0000",
    "category": "finance",
    "authors": [],
    "text": "Federal Government under pressure after latest Optus 000 blackout in NSW\n\nPublished 29 September 2025, 9:47 am\n\nTelecommunications company, Optus, has experienced another 000 outage, this time in New South Wales. Nine calls failed in Wollongong, with the service blackout affecting 4500 customers. The Federal Government now facing questions over it handling of the successive outages.",
    "source": "SBS",
    "cluster_id": 40
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/natural-disasters-are-growing-could-an-army-of-young-volunteers-help/nv2fml0m7",
    "title": "Natural disasters are growing; could an army of young volunteers help?",
    "publish_date": "Mon, 29 Sep 2025 09:07:44 +0000",
    "category": "finance",
    "authors": [],
    "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nFloods, fires, and now algal blooms provide frequent reminders that natural disasters are set to happen more often, and with greater intensity.\n\n\n\n\n\nIt's prompted a Senate inquiry to look at proposals for an incentive scheme that could help build and underpin a so-called youth Climate Army.\n\n\n\n\n\n\"Government has a direct interest in strengthening the backbone of Australia's disaster response workforce, and this is the people who volunteer their own time and their own effort.\"\n\n\n\n\n\nThat's Katherine Peroz, Chief People and Culture Officer at Australian Red Cross.\n\n\n\n\n\n\"However our contribution seems to have become expected, without a sustainable source of funding. For us at Australian Red Cross, we focus on psychological wellbeing of people impacted by disasters. Many other volunteer-led organisations involved in disaster response faced the same challenge we do. And any consideration of new volunteer-based workforce will need to need to consider sustainable sources of funding.\"\n\n\n\n\n\nAustralia has seen a long-term trend of decline in volunteerism, and it's showing no sign of slowing down, especially among younger people.\n\n\n\n\n\nRoughly 90 per cent of fire and emergency service workers are volunteers, and experts say more will be needed as climate change worsens.\n\n\n\n\n\nVarious incentives are being considered, like scholarships, expense re-imbursement, stipends, tax offsets, and reductions in student loans.\n\n\n\n\n\n\"I think the kind of things that we need to have in the back pocket to lift this system, you're right ...\"\n\n\n\n\n\nRob Webb is the CEO of the Australasian Fire and Emergency Service Authorities Council.\n\n\n\n\n\n\".... those types of things, and I think that's where we can look over things and try and understand the best of. We need volunteers across every phase, but we'd have to support them and what you're suggesting there, ideas you're suggesting, are the types of things that we need to be looking at.\"\n\n\n\n\n\nThe inquiry is also examining how to build and acknowledge the skills and contribution of volunteers by creating a nationally recognised qualifications system.\n\n\n\n\n\nOn the other hand, the chief officer of the South Australian Country Fire Service, Brett Loughlin, emphasised the importance of balancing volunteering with an existing job.\n\n\n\n\n\n\"Some kind of scheme that the Commonwealth can offer to be able to guarantee and mandate leave for emergency service volunteers is something that would be, I think, of great interest nationally. But also, how do you recognize those small business employers who are employing our volunteers? And how do they release their volunteers to go out and make a contribution, without financially disincentivised - as they are now - is something else that I would encourage.\"\n\n\n\n\n\nIt's not the first time the volunteer system - and how it applies to disaster preparedness, emergency response, and long-term recovery - has been examined.\n\n\n\n\n\nA Royal Commission and Senate Select Committee have previously looked at the issue, and there's also already a National Strategy for Volunteering.\n\n\n\n\n\nBut the CEO at Volunteering Australia, Mark Pearce, says there's still a significant gap in national oversight and coordination.\n\n\n\n\n\n\"The Australian government must play a vital role with the volunteering ecosystem, acting as an essential enabler of policies that support volunteering, and the national strategy for volunteering. The first three year action plan of the national strategy for volunteering includes the development of a national volunteer passport, a platform to boost volunteer mobility, reduce barriers to participation and enhance planning through better data collection. Volunteering Australia has called on the government to progress this initiative over several years. However, progress on this initiative has stalled.\"\n\n\n\n\n\nExperts who gave evidence at the Senate inquiry's public hearing also warned of duplication with states, which typically manage the response to natural disasters.\n\n\n\n\n\nThe legal work health and safety requirements that come with volunteer employees also present significant issues, as do declining populations in rural and regional areas.\n\n\n\n\n\nTogether, these challenges have led to an over-reliance on the Australian defence force during natural disasters.\n\n\n\n\n\nDisaster Relief Australia is one organisation that has started harnessing veterans to help.\n\n\n\n\n\nDavid Smith is their CEO.\n\n\n\n\n\n\"Now if you look at a picture of one of our volunteers with a community member, and they're giving them a hug, who's actually benefiting from this? Who's actually getting the most out of this? And a lot of our veterans, particularly, find benefit in that engagement with community members, because the work helps them adjust, to transition, to feel as though their previous experience is of benefit to the community more broadly.\"\n\n\n\n\n\nBacked by federal funding, his organisation has bucked the trend, increasing its volunteer base to almost 6,000 since it was founded in 2016.\n\n\n\n\n\nBut as the broader decline continues, the inquiry highlights the need to raise a so-called volunteer army - especially among younger people.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 41
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/first-nations-youth-train-as-firefighters-to-defend-country-and-community-i-want-to-make-a-difference/ukq0tojjo",
    "title": "First Nations youth train as firefighters to defend Country and Community: 'I want to make a difference'",
    "publish_date": "Mon, 29 Sep 2025 08:45:42 +0000",
    "category": "finance",
    "authors": [],
    "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nFor seven months, aspiring firefighters like Hannah Berman have been put through their paces.\n\n\n\n\n\nThey've taken part in simulated emergencies, workshops, and training, that attempts to simulate what it is like to be a professional.\n\n\n\n\n\nFor Hannah, it's of additional, personal, significance.\n\n\n\n\n\n\"My uncle, Danny Eastwood, was actually the first known Indigenous firefighter, so it's very exciting in my family to hopefully take after him and make my family proud.”\n\n\n\n\n\nSince the course began in 2014, more than eighty Indigenous graduates have gone on to becomes firefighters in New South Wales and the Australian Capital Territory.\n\n\n\n\n\nThe Indigenous participants come from a variety of backgrounds, and are spurred on by a variety of motivations.\n\n\n\n\n\nAnother aspiring firefighter, Michael Bolt, says he, too, has matters of the heart driving him towards his goal.\n\n\n\n\n\n\" I lost my brother at the start of the year and he was also someone that wanted to be a firefighter, so it's been hard going through a grieving process and also doing this program, but I'm doing it for him, for me and him, you know?\"\n\n\n\n\n\n19 young people from across New South Wales graduated from the program this year.\n\n\n\n\n\nCalled the Indigenous Fire and Rescue Employment Strategy, or IFARES, the pathway program is designed by Aboriginal staff from New South Wales Fire and Rescue... and has a strong focus on culturally safe and supportive learning.\n\n\n\n\n\nThe program pairs students with an Aboriginal or Torres Strait Islander mentor.\n\n\n\n\n\nMichael says, just as he is being mentored, so too does he want to be a mentor himself to future generations of people just like him.\n\n\n\n\n\n\"Well, I think firefighters are heroes, honestly, like the work that they do, the dangerous work, they put their lives on the line every single day to serve their community and save lives. And I want to be a part of that team and make a difference. I want to be a role-model for my family, my younger family that look up to me as well.... and just a role model in general, you know.\"\n\n\n\n\n\nServing the community through connection to culture, and identity.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n",
    "source": "SBS",
    "cluster_id": 42
  },
  {
    "url": "https://www.sbs.com.au/news/article/where-australians-are-travelling-spring/wkn0xklma",
    "title": "Here are the travel destinations Australians are heading to this spring",
    "publish_date": "Mon, 29 Sep 2025 08:31:25 +0000",
    "category": "finance",
    "authors": [],
    "text": "New data has revealed where Australians are planning on travelling these spring school holidays and the biggest barriers to making vacation plans.\n\n\n\n\n\nThe Tourism and Transport Forum (TFF) has released its survey about travel plans over spring, with 67 per cent of Australians planning to travel between 15 September and 31 October this year — either domestically or overseas.\n\n\n\n\n\nThat number is down slightly from the same time last year when 71 per cent of people reported plans to travel.\n\n\n\n\n\nOf the people planning to travel over the school holidays, 11 per cent are heading overseas.\n\n\n\n\n\n“Internationally we’ve seen a bit of a shake-up. New Zealand has jumped into the number one spot, overtaking Europe, which was most popular during the winter holidays just passed,\" Margy Osmond, CEO of TFF, told SBS News.\n\n\n\nOsmond said New Zealand is a top international destination because it presents the \"perfect balance\" for Australians.\n\n\n\n\n\n\"Close, familiar, and offering that international holiday feel at a fraction of the cost of a long-haul trip,” she added.\n\n\n\n\n\nHolidays to Europe have already proved popular this year. In July, ANZ projected its customers would spend $280 million travelling to Europe across winter based on trends in hotel and airline bookings — a 10 per cent increase compared to 2024.\n\n\n\n\n\nFor domestic travellers, Sydney, Melbourne and Brisbane are the top cities for holidaymakers and the Gold Coast, the Sunshine Coast, NSW's south coast and Victoria's Mornington Peninsula are the most popular regional destinations.\n\n\n\n\n\n\"Something like 35 per cent of people will be staying within their own home state, and a lot of them will be having a staycation. So they might be staying at home with the kids and going out and exploring their own terrific home city, and having those kinds of experiences,\" Osmond said.\n\n\n\nThe biggest barriers\n\nHowever, cost is still the greatest barrier for Australians looking to travel, with 44 per cent of Australians citing it as their main obstacle to making plans.\n\n\n\n\n\n\"[Australian travellers] are feeling the pinch. ... There is no doubt that the cost of living is starting to have an impact. And people are perhaps going away for a little bit shorter and spending not quite so much,\" Osmond said.\n\n\n\n\n\nThe vast majority of travellers planned to spend under $5,000 on their holidays, including 41 per cent who were planning to spend less than $2,000 on their entire trip.\n\n\n\nClimate concerns are also front of mind for some, with people aged 25 to 34 years old most likely to cite extreme temperatures as a concern for travelling.\n\n\n\n\n\nPolitical considerations as a barrier for travel have also increased since last year, rising from 2 per cent to 6 per cent this year.\n\n\n\n\n\n“Uncertainty in different parts of the world is certainly weighing on many Australians when they think about travel, and our data suggests this concern could become more pronounced over the next five years,\" Osmond said.\n\n\n\n\n\n“That said, history shows Australians are rarely deterred from taking a holiday. Major sporting events, cultural attractions and festivals remain powerful drawcards, generally strong enough to outweigh broader political unease when it comes to choosing where to go.”\n\n\n\n\n\nSarah Dolnicar, Professor at the University of Queensland's Business School, told SBS News earlier this year that a decline in interest in travelling to the US has been driven at least part due to political instability.\n\n\n\n\n\n\"I don't know if it's specifically the Trump administration or whether it's the perceived volatility of decision-making, but there is absolutely no doubt that that has affected international travel into the US,\" Dolnicar said.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 43
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/brisbane-broncos-light-up-sharemarket-final-budget-outcome-revealed/jtv30xpuy",
    "title": "Brisbane Broncos light up sharemarket & final budget outcome revealed",
    "publish_date": "Mon, 29 Sep 2025 07:38:09 +0000",
    "category": "finance",
    "authors": [],
    "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
    "source": "SBS",
    "cluster_id": 44
  },
  {
    "url": "https://www.sbs.com.au/news/article/what-happened-to-an-australian-republic-why-albanese-has-quashed-the-idea/3m63klhlc",
    "title": "What happened to an Australian republic? Why Albanese has quashed the idea",
    "publish_date": "Mon, 29 Sep 2025 05:55:44 +0000",
    "category": "finance",
    "authors": [],
    "text": "Australians won't be voting in a republic referendum as long as Anthony Albanese remains prime minister, with experts explaining there's currently \"no point\" to the proposal.\n\n\n\n\n\nDespite being a longtime advocate for an Australian republic, Albanese told SBS News he won't be pursuing the constitutional change.\n\n\n\n\n\n\"Look, I've always supported an Australian as our head of state. But the existing arrangements are in place,\" he said.\n\n\n\n\n\n\"We have, I think, a very respectful relationship and we have a monarch, His Majesty, who's passionate and interested about Australia, of world affairs, and the future.\"\n\n\n\n\n\nHe told Insiders, \"I think I've made it clear that I wanted to hold one referendum while I was prime minister, and we did that\", referring to the 2023 referendum to enshrine an Indigenous Voice to Parliament, which nearly 60 per cent of Australians rejected.\n\n\n\n\"We're concentrating on cost of living and on making a real, practical difference to people's lives,\" Albanese said.\n\n\n\n\n\nThe revelation is at odds with the Australian Labor Party's policy platform, which outlines \"work toward establishing an Australian republic with an Australian head of state\" as part of its objectives to modernise the constitution.\n\n\n\n\n\nBut experts agree Albanese has made the right call. And here's why.\n\n\n\n'No political gain' in referendum\n\nFormer Labor adviser Bruce Hawker said there is \"no point\" in holding a referendum without bipartisan support.\n\n\n\n\n\nHe noted that of the 44 referendum questions to date, backing from both major parties was critical to the eight that resulted in constitutional change .\n\n\n\n\n\n\"So that means, effectively, that unless you do have that support, you're really just wasting taxpayers' money,\" Hawker told SBS News.\n\n\n\n\n\nHe suggests Labor should not have gone ahead with the Voice referendum once it became clear that the Coalition was going to oppose it.\n\n\n\nWhile the Coalition backed the idea of constitutional recognition for Australia's First Nations people, it did not support doing this through the establishment of a Voice to Parliament.\n\n\n\n\n\n\"I think at that point it probably was worthwhile seriously considering abandoning the Voice referendum for that very reason, that once you lose bipartisan support, it's almost impossible to guarantee support by the public of Australia,\" Hawker said.\n\n\n\n\n\nAlbanese's personal advocacy for a republic also appeared to wane during a 2024 cabinet reshuffle, during which the government scrapped the portfolio of the country's first Assistant Minister for the Republic, Matt Thistlethwaite.\n\n\n\n\n\nPaul Williams, a political scientist at Griffith University, agrees that the recent referendum took \"a lot of personal bark\" off Albanese, which has taken Labor \"a long time to recover\" from.\n\n\n\n\n\nHe said it's political capital the prime minister is not willing to squander, with \"no political gain\" from another referendum, especially amid longer-term aspirations.\n\n\n\n\"It's almost certain he'll win the next election in 2028 and he may be eyeing up a term after that to become one of the great, longest-serving Labor prime ministers. That's his plan,\" Williams told SBS News.\n\n\n\n\n\n\"He doesn't want to endanger any of that by losing any unnecessary political capital. He's got big enough problems to solve in terms of tax reform, in terms of housing reform and those sort of bread and butter issues.\"\n\n\n\n\n\nWilliams said the niche issue was not worth turning off voters, or worse, providing the Coalition with ammunition to claim that Albanese is focused on issues that don't matter.\n\n\n\nDo voters support a republic?\n\nA YouGov poll of 1,500 voters in November 2024, marking 25 years since the Republic referendum failed, found 59 per cent of Australians would reject the proposal.\n\n\n\n\n\nIt found that voting intention for a republic was 4 percentage points lower than in 1999, with 41 per cent of Australians supporting a republic.\n\n\n\n\n\nDespite the data, Esther Anatolitis, co-chair of the Australian Republic Movement, said it was a surprising move, given Albanese's long-term advocacy for a republic, and insisted there was growing support.\n\n\n\nThe death of Queen Elizabeth II led to a resurgence of support for the constitutional monarchy in Australia. Source: AP / Alastair Grant \"The Republic movement itself is growing. We've got people who are really, really interested in that everyday conversation about Australian democratic reform,\" Anatolitis told the ABC.\n\n\n\n\n\nDavid Flint, national convener of Australians for a Constitutional Monarchy, said the call rightly \"reflects a realism that there's no great interest or passion in Australia [for change]\".\n\n\n\n\n\n\"Nobody's ever had somebody at the ministerial level, a minister of the crown, actually working to remove the crown. But [Albanese] had that for a while,\" Flint said, referring to Thistlethwaite's previous republic portfolio.\n\n\n\n\n\n\"I think [the prime minister's] realised that's a dead end, and he's got much more relevant things to do.\"\n\n\n\n\n\nWilliams notes the constitutional monarchy has seen an uptick in support since the accession of King Charles, as well as other events such as the death of Queen Elizabeth II and the wedding of Prince William and Princess Kate .\n\n\n\nConcluding that there's clearly \"no appetite for Australia to become a republic anytime soon\", Williams said support is more likely for a referendum that impacts voters in a meaningful way.\n\n\n\n\n\n\"Will it improve my life? Will it get me a pay rise? Will it get me, give my children a house? Those are the sorts of questions a lot of Australians would ask,\" he said.\n\n\n\n\n\n\"And of course, the answer is no.\"\n\n\n\n\n\nHawker agrees that unless the republican movement can demonstrate how the lives of voters will change materially as a result of becoming a republic, it'll be a \"long time before the Australian public is going to go down the path of supporting a referendum along those lines\".\n\n\n\n",
    "source": "SBS",
    "cluster_id": 45
  },
  {
    "url": "https://www.theage.com.au/sport/afl/petracca-speaks-with-crows-and-suns-20250930-p5myxp.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Petracca speaks with Crows and Suns",
    "publish_date": "Tue, 30 Sep 2025 11:51:04 +1000",
    "category": "finance",
    "authors": [],
    "text": "Petracca speaks with Crows and Suns\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 23
  },
  {
    "url": "https://www.theage.com.au/sport/nrl/inside-the-miserable-manly-dressing-room-where-brisbane-finally-believed-in-madge-s-mission-20250930-p5myvp.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Inside the miserable Manly dressing room where Brisbane finally believed in Madge’s mission",
    "publish_date": "Tue, 30 Sep 2025 11:50:00 +1000",
    "category": "sports",
    "authors": [
      "Dan Walsh"
    ],
    "text": "“‘Did we want to bow out and have a poor year like the year before?’ was the conversation we were having. ‘Did we want to actually make something or our season and work hard, really buy into what we needed to do?’ “There was obviously a little bit of change for the boys with a new face [in Maguire], new philosophies, and work ethic. That game at Manly, it was good to go through that as a group. It highlighted some key areas that we were pretty poor at. I think we needed that to wake us up a little bit.” Ezra Mam’s try celebration was met with a chorus of boos by Manly fans. Credit: NRL Imagery That disastrous Sea Eagles loss was Brisbane at their worst. Commitment to the cause was hard to spot. Five-eighth Ezra Mam was booed with every touch in response to his perceived light punishment for a drug driving incident that left three people injured. A clumsy post-game interview from the five-eighth didn’t help. Talk of player burnout under Maguire’s polarising training methods gathered momentum. Especially given the knives were already out after the cut-throat way his predecessor Kevin Walters, a most popular figure with media heavy hitters and Broncos old boys, was rolled to make way.\n\nDressing room footage was analysed. CEO Dave Donaghy and chairman Karl Morris were put on blast, and leaders Reynolds and Kotoni Staggs were openly questioned about player revolt. “Externally, all that chat was pretty big and hard to ignore,” hooker Corey Paix says. Broncos coach Michael Maguire and Adam Reynolds. Credit: NRL Imagery “But we did because we were having the proper conversations, those very hard, very honest chats ourselves. “As a group, we ended up demanding commitment from one another because the coaches can say and do as much as possible, but at the end of the day, it’s up to the players to turn it around.\n\n“We went back to work, trained harder, got in and did what we needed to. Looking back, that really was our turning point.” When Brisbane emerged at the end of a long week, they ran onto Suncorp Stadium resembling the All Blacks in what is now an iconic, completely black kit as part of the club’s mental health round and charity partnership with the Black Dog Institute. A 44-14 blitz of the Titans was Brisbane at their all-running, all-attacking best, just seven days after bottoming out at Brookvale. In 14 games since, they’ve lost only twice - including a 22-2 defeat in Melbourne where Reynolds, Mam and Selwyn Cobbo all tore their hamstrings and their season was apparently gone.\n\nThe graft and grind their coach prizes above all else was plain to see in running down Penrith from 14-0, defending their goal line like demons all the while. Loading And as for Maguire’s much-discussed intensity, methods, and a little madness, back-rower Jordan Riki can only laugh now. Along with Reynolds and prop Payne Haas, the Kiwi international’s prior experience of Brisbane’s new coach was eagerly, and at times apprehensively, mined by his teammates. For anyone who’s had their fingers crushed in one of Maguire’s vice-like handshakes - “and he’s got this big grin on his face when he does it” Riki laughs - it’s as good an indication as any of what you’re in for. “There is a bit of an aura about him, you know, when he steps into a room that he needs everybody’s attention and he needs you locked in and focused,” Riki says.",
    "source": "TheAge",
    "cluster_id": 24
  },
  {
    "url": "https://www.theage.com.au/national/australia-news-live-netanyahu-backs-us-plan-to-end-war-triple-zero-network-under-scrutiny-as-government-fast-tracks-watchdog-20250930-p5myuo.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Australia news LIVE: Netanyahu backs US plan to end war; Triple Zero network under scrutiny as government fast-tracks watchdog",
    "publish_date": "Tue, 30 Sep 2025 11:42:26 +1000",
    "category": "finance",
    "authors": [
      "Emily Kaine"
    ],
    "text": "Google’s YouTube has agreed to pay $US24.5 million ($37.2 million) to settle a lawsuit by US President Donald Trump over his 2021 account suspension following the January 6, 2021 attack on the US Capitol.\n\nDonald Trump and rioters on January 6. Credit: AP\n\nAccording to documents filed in federal court in California, $US22 million of the settlement will be contributed to the Trust for the National Mall to help pay for the construction of the White House State Ballroom. The rest will go to other plaintiffs, including the American Conservative Union.\n\nGoogle is the latest big tech company to settle lawsuits brought by Trump. In January, Meta Platforms agreed to pay $US25 million to settle a lawsuit over his 2021 suspension from Facebook. Elon Musk’s X agreed to settle a similar lawsuit brought against the company then known as Twitter for $US10 million.\n\nThe settlement does not constitute an admission of liability, the filing says. Google confirmed the settlement but declined to comment beyond it.\n\nThe disclosure of the settlement came a week before a scheduled October 6 court hearing to discuss the case with US District Judge Yvonne Gonzalez-Rogers in Oakland, California.\n\nAP",
    "source": "TheAge",
    "cluster_id": 4
  },
  {
    "url": "https://www.theage.com.au/national/queensland/brisbane-news-live-miles-hits-out-at-premier-s-vaccination-stance-amid-measles-alerts-20250929-p5myrq.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Brisbane news live: Arts Minister John-Paul Langbroek downplays threat of Trump tariff on Qld films | Suspicious fire at CWA hall | Miles slams premier’s vaccination stance amid measles alerts",
    "publish_date": "Tue, 30 Sep 2025 11:40:45 +1000",
    "category": "finance",
    "authors": [],
    "text": "Queensland Arts Minister John-Paul Langbroek will write to his federal counterpart to seek clarification about the latest tariff proposal on the state’s film industry, but he downplayed the threat and said the sector was thriving despite the ongoing trade uncertainty.\n\nUS President Donald Trump revived a threat first announced in May to impose a 100 per cent tariff on foreign-made films, which has the potential to devastate the multibillion-dollar film industry in Australia.\n\nMany states have created tax incentives to lure the sector to their jurisdictions, including Queensland which has boosted production activity.\n\nLoading\n\nLangbroek said the new threat was merely a repeat of comments made earlier this year, but he confirmed he would once again write to federal counterpart Tony Burke to seek a diplomatic clarification.\n\n“The local industry continues to be very active, both since May and even as recently as last week, when we had Subversion being filmed with Chris Hemsworth,” he told reporters on Tuesday morning.\n\n“The local industry is vibrant and very positive about the future – having said that, we would like some clarification.”",
    "source": "TheAge",
    "cluster_id": 25
  },
  {
    "url": "https://www.theage.com.au/politics/federal/im-still-a-new-minister-wells-20250930-p5myy9.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "'I'm still a new minister': Wells",
    "publish_date": "Tue, 30 Sep 2025 11:35:31 +1000",
    "category": "finance",
    "authors": [],
    "text": "'I'm still a new minister': Wells\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 26
  },
  {
    "url": "https://www.theage.com.au/national/nsw/the-sydney-developer-166-000-in-fines-and-the-exhausted-street-20250916-p5mvgt.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "The Sydney developer, $166,000 in fines and the ‘exhausted’ street",
    "publish_date": "Tue, 30 Sep 2025 11:30:00 +1000",
    "category": "finance",
    "authors": [
      "David Barwell"
    ],
    "text": "Residents living in a street in Willoughby say their once-peaceful cul-de-sac has been turned into an “unbearable” construction zone due to a string of non-compliant building works at one of the largest housing projects on the north shore.\n\nWilloughby Council has issued 20 separate fines totalling $166,000 to the head contractor of an 186-unit development on Walter Street due to multiple construction breaches of the site’s conditions of consent including polluting waters and obstructing public land.\n\nThe development under construction on Walter St in Willoughby. Credit: James Brickwood\n\nMajor work on the project has been under way for three years and has involved demolition of 21 homes on the northern side of the street to make way for five new apartment buildings up to 11 storeys tall.\n\nSince work began, homeowners living on the southern side of the same street have repeatedly raised concerns to Willoughby Council over alleged non-compliant building work at the site including construction works undertaken outside approved hours, cracked roads and footpaths, and utilities – including water and power – cut off without notice.",
    "source": "TheAge",
    "cluster_id": 27
  },
  {
    "url": "https://www.theage.com.au/business/markets/asx-set-to-edge-up-wall-street-drifts-oil-falls-20250930-p5myug.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "ASX edges higher on RBA day, led by miners; Seven, Southern Cross jump",
    "publish_date": "Tue, 30 Sep 2025 11:14:37 +1000",
    "category": "finance",
    "authors": [
      "Staff Writers"
    ],
    "text": "The Australian sharemarket opened higher ahead of the Reserve Bank’s interest rate decision on Tuesday afternoon, tracking gains on Wall Street overnight.\n\nThe S&P/ASX 200 added 22.7 points, or 0.3 per cent, to 8885.50 as of 10.38am AEST. Seven of its 11 industry sectors advanced, led by mining stocks. The Australian dollar was fetching US65.77¢.\n\nWall Street has made a positive start to the week. Credit: Bloomberg\n\nThe RBA announces its interest decision at 2.30pm AEST, with economists expecting the central bank to leave rates unchanged at 3.6 per cent. The market focus will be on the comments and outlook by Governor Michele Bullock when she fronts reporters at 3.30pm.\n\nThe higher open comes after the local bourse had its best day in more than three weeks in the previous session, helped by investment funds rebalancing their portfolios for the end of the month and the quarter, according to IG Markets analyst Tony Sycamore.",
    "source": "TheAge",
    "cluster_id": 28
  },
  {
    "url": "https://www.theage.com.au/lifestyle/new-bridesmaid-for-hire-popping-off-20250930-p5myxu.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "New 'Bridesmaid for Hire' popping off",
    "publish_date": "Tue, 30 Sep 2025 11:01:00 +1000",
    "category": "lifestyle",
    "authors": [],
    "text": "New 'Bridesmaid for Hire' popping off\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 29
  },
  {
    "url": "https://www.theage.com.au/culture/art-and-design/ngv-cartier-winter-masterpieces-20250925-p5mxyt.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "‘It’s not just bling’: The dazzling blockbuster show heading for Melbourne",
    "publish_date": "Tue, 30 Sep 2025 11:00:00 +1000",
    "category": "entertainment",
    "authors": [
      "Will Cox"
    ],
    "text": "A major exhibition of jewellery from famed fashion house Cartier is set to open at the National Gallery of Victoria in 2026, the gallery announced today.\n\nCartier, which premiered at London’s Victoria & Albert Museum earlier this year, will see more than a century of historic jewellery items on display, including many associated with aristocratic and pop culture figures, from Princess Margaret and Wallis Simpson to Elizabeth Taylor and Rihanna. It is set to be the largest exhibition of Cartier pieces ever staged in Australia.\n\nElizabeth Taylor at the Tropicana Hotel in Las Vegas, June 1958 Credit: Photofest, courtesy of the NGV\n\nIn an Australian exclusive, the NGV’s iteration of the show will also feature jewellery worn by opera singer Dame Nellie Melba – who was a major client of Cartier at the turn of the century – as well as a range of jewellery made with Australian opals.\n\n“The Melba pieces represent a moment when Cartier was really gaining in international significance,” said Amanda Dunsmore, the NGV’s senior curator for international decorative arts and antiquities. Dunsmore said the pieces reflect key shifts in design, including incorporating platinum into the settings and the evolution of Cartier’s Garland style, which took cues from Parisian architecture.",
    "source": "TheAge",
    "cluster_id": 30
  },
  {
    "url": "https://www.theage.com.au/business/banking-and-finance/banks-doling-out-loans-as-rate-cuts-and-first-home-scheme-fuel-demand-20250929-p5myo4.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Banks doling out loans as rate cuts and first home scheme fuel demand",
    "publish_date": "Tue, 30 Sep 2025 11:00:00 +1000",
    "category": "finance",
    "authors": [
      "Clancy Yeates"
    ],
    "text": "Westpac, National Australia Bank and ANZ Bank are ruling off their financial year as rising house prices and falling interest rates fuel quicker growth in the $2.3 trillion mortgage market, which analysts say should help banking giants rake in more revenue.\n\nThe three banks will close their books on the financial year on Tuesday, after a year in which falling interest rates have had a significant impact on Australia’s banking market. Their larger rival Commonwealth Bank, which uses a June financial year, reported its full-year results last month.\n\nHousing credit growth has picked up to its quickest pace in more than two years as interest rates have fallen. Credit: Peter Rae\n\nThe Reserve Bank has made three 0.25 percentage point cuts to interest rates this year, sparking stronger growth in mortgages and business loans, while lower rates have also eased the financial squeeze on households, which is further good news for banks’ loan portfolios.\n\nAt the same time, however, analysts say competition remains intense in business and home lending, which is eating into the sector’s profit margins. Cost-cutting is also a key theme and investors expect the banks to keep a tight rein on expenses, following recent job cuts announced at ANZ Bank, NAB, Westpac and Bendigo and Adelaide Bank.",
    "source": "TheAge",
    "cluster_id": 31
  },
  {
    "url": "https://www.theage.com.au/technology/serious-lack-of-confidence-minister-slams-optus-after-high-stakes-meeting-20250930-p5myvt.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "‘Serious lack of confidence’: Minister slams Optus after high-stakes meeting",
    "publish_date": "Tue, 30 Sep 2025 10:56:49 +1000",
    "category": "finance",
    "authors": [
      "David Swan"
    ],
    "text": "Communications Minister Anika Wells says there is a “very serious lack of confidence” in Optus to deliver Triple Zero services to Australians, after its fatal outage in which three people died.\n\nWells met in Sydney on Tuesday morning with Optus chief executive Stephen Rue and his boss, Singtel chief Yuen Kuan Moon, who flew in from Singapore. Amid mounting political pressure Wells said she sought assurances from both Optus and Singtel that they would prioritise restoring confidence in the Triple Zero system.\n\nOptus chief executive Stephen Rue leaves his house on Tuesday morning. Picture Nine News Credit: Nine News\n\n“I think the CEO of Optus has a lot of work to do, given these two outages have happened in short succession and has given rise to a very serious lack of confidence in both Optus and their ability to deliver Triple Zero services to Australians when they need it most,” Wells told reporters after the meeting.\n\n“The CEO of Optus now needs to work with their parent company, Singtel, on the systems and holistic change required within their own company to give that confidence back to Australians.”",
    "source": "TheAge",
    "cluster_id": 20
  },
  {
    "url": "https://www.theage.com.au/money/planning-and-budgeting/why-isn-t-my-money-making-me-happier-20250930-p5myww.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Why isn’t my money making me happier?",
    "publish_date": "Tue, 30 Sep 2025 10:53:40 +1000",
    "category": "finance",
    "authors": [
      "Paridhi Jain"
    ],
    "text": "I feel like I should be happier than I am, but I don’t really know what’s missing. I’ve ticked the boxes: I make good money, have a nice home and family, and I’ve got a good stable career, savings and investments. I’m not really asking for financial advice. I’m doing well financially, and that’s not something I take for granted. But I guess I wasn’t expecting to feel this way, after working hard to achieve everything that I have. You talk a lot about money mindset, so I thought you might have some insights that could help.\n\nCongratulations, you’ve hit a new financial level. This is the: “Is this it? Now what?” level. I’m being playful, but I want you to know: you’re not alone. This is a phase I see many people go through on the other side of accomplishing a certain level of financial success.\n\nReaching the peak of your money goals can be strangely unfulfilling. Credit: Simon Letch\n\nThat level isn’t defined by a certain dollar figure – I’ve seen this play out at different levels for different people: for some it hits after the successful exit of their start-up, for others it might hit after achieving a specific financial milestone they’d been working towards – e.g. $X in savings or investments, or paying off the mortgage, or retirement.\n\nThe common denominator isn’t a number, but the accomplishment of something you had placed a lot of value on, and getting to the other side only to realise – it wasn’t a magical portal into a different life, like you thought it’d be. There is now a gap between how your life looks, and how you thought it would feel. So, how do you start to close that gap?",
    "source": "TheAge",
    "cluster_id": 32
  },
  {
    "url": "https://www.theage.com.au/culture/movies/trump-has-doubled-down-on-his-non-us-movie-tariff-threat-that-s-a-bad-thing-for-cinema-20250930-p5mywe.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Trump has doubled down on his non-US movie tariff threat. That’s a bad thing for cinema",
    "publish_date": "Tue, 30 Sep 2025 10:50:14 +1000",
    "category": "finance",
    "authors": [
      "Karl Quinn"
    ],
    "text": "Donald Trump has restated his intention to introduce a 100 per cent tariff on all movies produced outside the United States, a move that would have enormous consequences not just for Hollywood but for those countries – Australia, New Zealand, the UK and Canada among them – in which the studios increasingly base their filmmaking efforts.\n\nThe US president announced the plan on his social media platform Truth Social overnight, stating, “Our movie making business has been stolen … Therefore, in order to solve this long time, never ending problem, I will be imposing a 100% Tariff on any and all movies that are made outside of the United States”.\n\nUS President Donald Trump has restated his intention to hit Hollywood with tariffs. Credit: Matt Willis\n\nThe threat was first made by Trump in May. As then, this latest statement lacks any clear detail about how or when the move would be implemented. It is unclear, for example, if a tariff would apply to television production as well as movies, or if a tariff would be applied only to the production costs incurred outside the US or to the entire show.\n\nIf followed through, the move would be a nightmare for the Hollywood studios and their offshore production partners, but would be welcomed by the powerful guilds in the sector.",
    "source": "TheAge",
    "cluster_id": 33
  },
  {
    "url": "https://www.theage.com.au/sport/afl/the-demons-said-good-bye-to-goodwin-should-they-do-the-same-to-petracca-and-oliver-20250826-p5mpt6.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "The Hawks have improved steadily under Sam Mitchell. But their next step will be the toughest",
    "publish_date": "Tue, 30 Sep 2025 10:42:51 +1000",
    "category": "sports",
    "authors": [
      "Andrew Wu",
      "Jon Pierik",
      "Marc Mcgowan",
      "Scott Spits",
      "Vince Rugari"
    ],
    "text": "It could be a rough exit meeting for: James Worpel and Mitchell have a bit to talk about. Worpel is a restricted free agent, and has interest from the Cats, having slipped in the Hawks’ midfield pecking order. Will Mitchell offer him more time to stay, or will that depend on what hap]pens during the trade period? Jai Serong is likely to leave, while Sam Butler is mulling a shift to West Coast.\n\nSomething to look forward to: The Hawks have made no secret they want to beef up their list, and they will be busy through the trade period. They could yet land one of Zach Merrett, Christian Petracca or Zak Butters.\n\nWill Day is on the mend from another fractured foot. Loading Day remains the Hawks’ most skilful player, but will need to be monitored closely for the rest of his career. The likes of Nick Watson and Ginnivan continue to add to their games, while skipper James Sicily will give his sore body time to heal over summer.\n\nPredicted best and fairest: Jai Newcombe.\n\n– Jon Pierik\n\nNick Daicos is in his prime and Scott Pendlebury is on the brink of the AFL games record. Credit: AFL Photos Collingwood (preliminary finalist) Wins: 17 Losses: 8. Draft picks: 34, 52, 64, 70 What went well: Plenty, despite being the “Dad’s Army” of the competition – their preliminary final team was the oldest line-up ever fielded in an AFL final. That they reached the penultimate weekend of the season meant this campaign was a success. Just not as successful as they had hoped. Nick Daicos had another superb season, capped with his second-straight runner-up finish in the Brownlow Medal count. Is there a better kick in the league? Brother Josh provided drive from half-back, while ruckman Darcy Cameron had a career year.\n\nSteele Sidebottom and Jack Crisp were consistent contributors, Jamie Elliott booted a team-high 60 goals, while former Giant Harry Perryman settled in well across half-back. Ned Long had a break-out year, while Scott Pendlebury, 37, defied his age until he was stopped by a calf strain in the opening minutes of the preliminary final. The AFL games record will be his in 2026 if he plays the eight more games needed to go past Brent Harvey on 432. It could be a rough exit meeting for: More than one Magpie, and even for the Magpies’ list managers, for Elliott, 33, may need to be dissuaded from joining the Gold Coast Suns on a three-year deal, while Brody Mihocek, 32, has a three-year offer from Melbourne to consider. The Magpies, however, may tell Mihocek they won’t budge from their two-year offer. Mason Cox, 34, faces an uncertain future, while Dan Houston – and the Pies – will agree they need more from him next season. Bobby Hill, having missed so much football because of personal issues, remains a close watch.\n\nSomething to look forward to: Houston was not the same counter-puncher he was at Port Adelaide in his first year with the Magpies – expect that to change next year. He is exemplary with ball in hand, and needs to have more of it. Skipper Darcy Moore had an indifferent season, and may need to revisit the balance between pure defending and hunting the ball. Get that right, and the Magpies – already built on defence – will be even stronger. Coach Craig McRae wants a blend of good draft picks and established players through this trade/draft period. They missed out on Jack Silvagni, but will trade for Swans’ forward Jack Buller. Another established defender may be front of mind, for Jeremy Howe, 35, is showing signs of wear and tear. Predicted best and fairest: Nick Daicos.\n\n– Jon Pierik\n\nAdelaide (fifth after finals loss) Wins: 18 Losses: 7 Draft picks: 18, 41, 48, 54, 66, 72. What went well: There was much to like. The Crows not only leapt back into the finals for the first time since 2017, but won 12 of their final 13 home-and-away games to finish as minor premier.\n\nMatthews Nicks’ game plan, essentially built on going long down the line, held up during the season proper. Taylor Walker may not like what he hears from the Crows’ bosses in his end-of-season meeting. Credit: AFL Photos via Getty Images Skipper Jordan Dawson and full-forward Riley Thilthorpe were All-Australians, while fellow forwards Taylor Walker and Darcy Fogarty, and forward-midfielder Ben Keays, also enjoyed strong home-and-away seasons. Former Demon Alex Neal-Bullen was a fine acquisition, and could be a future skipper. Izak Rankine provided creativity up field and close to goal, and was badly missed through suspension for a homophobic slur in September. “What it did do was it changed the dynamic of our group,” Nicks said of Rankine’s absence. “Izak is, and this is my opinion, one of the best players in the game, so I think if any team loses their best player, then it becomes quite challenging to replace that.” It could be a rough exit meeting for: Taylor Walker. The champion forward, 35, is off contract, and his time may be up after a modest finals campaign. The Crows may feel Thilthorpe and Fogarty need to be empowered and shoulder greater responsibility. Fellow veteran Brodie Smith, 33, is also weighing up his future.\n\nSomething to look forward to: This was a year when the Crows built a foundation for what should be a five-year premiership tilt. Yes, they failed to win a quarter in their two finals defeats, becoming the first minor premiers in more than 40 years to be dumped from September in straight sets, but that sting should fire this squad. However, they do have holes. While unbeaten in 13 games against bottom nine teams, they were 6-7 against top nine teams, their scoring and defence dropping off. They need another X-factor in addition to Rankine, while a forward line of three talls didn’t hold-up in September, when the ball is on the ground more. Another strong defender would also help. Nicks will need to tinker with his game plan. As he said after the semi-final loss to Hawthorn, it’s harder to move the ball the way you want in the finals when the intensity rises. The Crows have been linked with off-contract Lions forward Callum Ah Chee.\n\n\n\nBest and fairest tip: Jordan Dawson.\n\n– Jon Pierik Suns gun Matt Rowell takes a physical battering in every game he plays. Credit: Getty Images Gold Coast (sixth after finals loss) Wins: 16 Losses: 9 Draft picks 6, 14, 15, 32, 56, 68 What went well: The Suns have finally risen. This was a breakthrough season for a club, which not only made its maiden finals run in its 15th attempt, but conjured a miraculous win over the Dockers in Perth.\n\nSkipper Noah Anderson and fellow midfielder Matt Rowell were first-time All-Australians, their sustained efforts in the midfield a sight to behold. The physical punishment Rowell takes reminds us of the hits an NFL running back endures. Marking forward Ben King was superb in front of goal but will need to add a new trick or two. Fellow forward Ben Long had a breakout campaign, although he was disappointing in the semi-final, while recruits Daniel Rioli and John Noble delivered what was expected of them at half-back. Sam Collins is a beast at full-back, Touk Miller delivered run and carry, while Bailey Humphrey showed signs of morphing into the Suns’ version of Cam Rayner. It could be a rough exit meeting for: Jed Walter. The young forward was dropped after round 19 and did not return to the side. While the former Suns academy product is contracted for next season, he could be used in a trade for Carlton’s Charlie Curnow. While a star in the making, Mac Andrew will face a strong review of his finals performances.\n\nSomething to look forward to: There is plenty to look forward to with this emerging list, coach Damien Hardwick declaring his team is built for September. The base is there, it’s now time to build internally and through canny trades. The Suns were too reliant on Rowell and Anderson, and need another robust midfielder who can deliver under pressure. The unicorn that is Ethan Read struggled in the semi-final but has the height and talent to be a long-term marking threat. They could lose Sam Flanders, who has two years remaining on his contract, and Malcolm Rosas, through the trade period. Best and fairest tip: Noah Anderson.\n\n– Jon Pierik Fremantle (8th)\n\nWins: 16. Losses: 8. Draft picks 13, 31, 38, 49, 67. What went well: After last year’s meltdown, when they slipped from the top eight at the start of August to 10th by the end, the Dockers held firm this year and returned to the finals for the first time since 2022, winning 12 of their last 14 games to finish sixth. Caleb Serong again starred in the Fremantle midfield. Credit: AFL Photos They adopted a more attacking gameplan after five losses from their first nine games, but failed to fully embrace this mantra in a stinging elimination final defeat to the Suns. “We’ve grown so much throughout the year with the way we play our footy, the way we embrace challenges, the way we’ve improved our footy on the road,” coach Justin Longmuir said after the loss to the Suns.\n\nMarking talls Josh Treacy (44 goals) and Patrick Voss (37) had strong seasons, while Murphy Reid claimed the AFLPA’s best young player award. Former premiership Tiger Shai Bolton (28) was arguably the recruit of the year. Defender Jordan Clark and midfield stud Caleb Serong were All-Australians, while Andrew Brayshaw was unlucky not to be. It could be a rough exit meeting for: Jye Amiss. While he played all 24 games, Amiss, a key marking tall, returned a modest 32 goals, and averaged career-lows in marks and disposals per game. He had only two touches (one goal) in the elimination final before being subbed off. Amiss could be a trade target. Then there’s ruckman Sean Darcy. Will he and Luke Jackson continue to be a one-two punch in the ruck? We’ll see.\n\nSomething to look forward to: The Dockers are building nicely. They had an average age of just 24.9 years through the season – the fourth youngest in the competition. Fremantle ruckman Sean Darcy. Credit: AFL Photos AFL great James Hird has set high expectations for them next year, despite their loss to the Suns on Saturday. “I think they have to be top four next year with their list and the way they’ve had the final this year and the performances against the best teams in the competition. I’ve really gotten locked in that top four next year,” Hird said. But they cannot afford to have lulls and slip back into a defensive mindset when the pressure is at its greatest. This will be Longmuir’s greatest challenge.\n\nBest and fairest: Caleb Serong.\n\n– Jon Pierik GWS (7th) Wins: 16. Losses: 8. Draft picks: 12, 30, 36. What went well: After a dodgy first half of the year, the Giants won nine of their last 10 home-and-away games, scoring more than 100 points in each of them. In the end, they finished with one of the AFL’s best attacking records, just two points behind third place.\n\nToby Greene and his Giants were eliminated at home by the Hawks. Credit: AFL Photos At their best, they were absolutely awe-inspiring: their stunning third quarters against the Swans in the second Sydney derby of the season, plus their (eventually unsuccessful) comeback against Hawthorn in their elimination final, will live long in the memory. The challenge will be closing the gap between their frightening best and their timid worst. It could be a rough exit meeting for: Everyone. The Giants have now lost their past four finals, including two at home (and three in Sydney) – the sort of record that each player needs to take a varying degree of responsibility for, as well as the coaching group, and will require them all to look deeply within over the summer. September stumbles are becoming too much of a theme. What’s clear is that they concede too many entries, which can’t be wholly pinned on the six poor blokes in defence who had to deal with that avalanche. All things considered, they managed OK, but it felt unsustainable, and so it has proved. And there’s a similar problem going the other way. When they’re on, they’re on, but the Giants’ attack falls to pieces when they mindlessly blaze away inside 50 as they did against Hawthorn, which completely undermines their forward set-up. Composure in key moments is lacking in this side across every line, and that’s not an easy thing to add.\n\nSam Taylor is a star defender for GWS, but the Giants’ defensive unit is under pressure. Credit: AFL Photos Something to look forward to: As Adam Kingsley said post-match, the Giants still have “all the pieces” to contend, although their ageing stars are running out of petrol. But the window remains open, their next tier of rising stars will be better with another season under their belts and if they can address their inconsistencies, get to the psychological nub of their finals failures and have some better luck with injuries, there’s no reason why they won’t be back contending again in 2026. Best and fairest tip: Finn Callaghan showed exactly why St Kilda threw a $17 million, 10-year contract offer at him; thank heavens he said no. He and Tom Green (likely second in the best and fairest) run this team now.\n\n– Vince Rugari Western Bulldogs (9th)\n\nWins: 14. Losses: 9. Draft picks: 10, 28 What went well: Offensive power. The Doggies poured on the goals this season, scoring more points (2493) than any other team. Led by Marcus Bontempelli, Tom Liberatore, Ed Richards and an increasingly influential Sam Darcy up forward, they beat up teams with regularity. While that resulted in a 14-9 record, the team from the west missed the finals. The Bulldogs were an offensive juggernaut in 2025 but still missed finals. Credit: Getty Images It could be a rough exit meeting for: Jamarra Ugle-Hagan. The one-time No.1 draft pick has occupied so much of the Bulldogs top brass’ time this season. It would be fascinating to witness his official exit meeting given there’s so much to discuss for a player who didn’t add to his tally of 67 AFL games this season. Defenders will be in the spotlight, too, but each player on the list will be pressed for explanations as to why the Dogs simply couldn’t beat teams who were vying for finals spots.\n\nSomething to look forward to: Plenty, to be truthful. The Dogs have recorded 14 wins in consecutive seasons; in 2024 they played finals, so they can’t wallow in pity about what happened this year. Jamarra Ugle-Hagan didn’t play a game for the Bulldogs this season. Credit: Justin McManus Darcy, at age 22, remains one of the most exciting young players in the game. Aaron Naughton’s best season (65 goals) is a beacon of hope for even better things, too. Best and fairest tip: I’ve landed on Ed Richards ahead of Tom Liberatore. Bontempelli’s missed games through injury will cost him.\n\n– Scott Spits Port Adelaide (13th)\n\nWins: 8. Losses: 15. Draft picks: 26, 42, 60 What went well: That’s tough to answer because this was an extremely disappointing year, despite Ken Hinkley’s protestations the list is set up well for 2026. Port Adelaide chairman David Koch stuck with Ken Hinkley to the end. Credit: Getty Images Having made a preliminary final last year, the Power slipped markedly. However, skipper Connor Rozee and fellow star midfielder Zak Butters were typically industrious, while forward Mitch Georgiades delivered a half-century of goals for the first time. Aliir Aliir enjoyed another stellar season in defence, while Travis Boak and Hinkley were given a classy send-off against the Suns, the victory fully deserved. Zak Butters won Port Adelaide’s best and fairest award - the John Cahill Medal - for the third consecutive year in 2025. Credit: Getty Images\n\nIt could be a rough exit meeting for: President David Koch and his board. The succession plan designed to ease Hinkley out and Josh Carr to prepare for the senior role next season was done with the best of intentions, but the scoreboard says it was a failure. If Hinkley wasn’t the man to take the team forward, then Carr should have been immediately installed, and Hinkley given a thank-you payout for his years of fine service. Something to look forward to: The Power should be back in the finals hunt next year, but they will need to get busy in the trade period. Do they have enough true stars? Missing out on Nasiah Wanganeen-Milera will hurt.\n\nLate season injuries have given the youngsters a chance. We like what we have seen of Jack Whitlock, who can play ruck and go forward. Best and fairest winner: Zak Butters.\n\n– Jon Pierik Essendon (15th)\n\nWins: 6. Losses: 17. Draft picks: 4, 5, 22, 25. What went well: The Bombers have some superb youngsters. In his second year, Nate Caddy again gave glimpses of the player he could become, with 20 goals and more flashes of brilliance.\n\nIsaac Kako gave Bombers fans something to get excited about. Credit: AFL Photos Isaac Kako impressed with his smarts around goals and showed late in the season he can also be developed as a pinch-hitter in the centre square. Archie Roberts, the lowest draft pick of the trio, could end up being a steal. The teenager is advanced beyond his years, demonstrating composure and skill in a defence that was under siege. Angus Clarke is another of the club’s 15 debutants this year who has provided Bombers fans with hope in a wretched campaign.\n\nIt could be a rough exit meeting for: Ben Hobbs. In his fourth season, Hobbs, 21, failed to take a more significant role in the side. Worryingly for Hobbs, despite Essendon’s litany of injuries, he was dropped for the first leg of the final round and could not break back into the team. Hobbs has stagnated in his past two seasons, reaching 20 disposals in just three of his past 30 games. His disposal remains a worry. If time has run out for the first-round pick from the 2021 draft, it would raise further queries on the Bombers’ recruiting and player development. Something to look forward to: The draft. The Bombers have a strong hand in this year’s draft after acquiring Melbourne’s first selection through a pick swap last year. Even accounting for father/son, academy and NGA picks, the Bombers should have access to two very good youngsters. If Sam Draper departs through free agency, that should deliver another first-round pick. Unfortunately for the Dons, this is not considered the strongest draft, but one experienced recruiter has said they would not be surprised if smokies emerge deeper in the pool.\n\nBest and fairest: Zach Merrett.\n\n– Andrew Wu West Coast (18th) Wins: 1. Losses: 22. Draft picks: 1, 14, 19, 32, 50. What went well: Sorry West Coast fans, this is not pretty. The Eagles have managed 11 wins in four seasons, including just one victory, over St Kilda, in a torturous 2025 season.\n\nBut there’s always a glimmer of hope and performances and players to celebrate. Two-time Richmond premiership player Jack Graham, who joined the Eagles for 2025, comfortably exceeded his career average for disposals (19.2 possessions per game this season) and had 7.8 tackles per game (which is considered “elite”). It could be a rough exit meeting for: The defensive unit and the defence coaches. West Coast comfortably conceded the highest number of points (2438) this season, leaving them with a limp percentage of 60.1. If premierships are built from the backline, they need to focus there. It will be fascinating to see the club’s attitude towards Tim Kelly, who played 19 games in his sixth season with the Eagles. Something to look forward to: It couldn’t get any worse, could it? If West Coast haven’t bottomed out, where is the bottom?\n\nThe Eagles can expect the No.2 draft pick as compensation for losing free agent Oscar Allen to Brisbane, so that’s something. And Harley Reid is staying for now, having resisted interest from big Victorian clubs to extend until the end of 2028. Eagles fans can only look forward to better times ahead. Best and fairest tip: Jack Graham.\n\n– Scott Spits North Melbourne (16th)\n\nWins: 5 Losses: 17 Draws: 1 Draft picks: 20, 21, 39, 57 What went well: They made it out of the bottom two! The Kangaroos and coach Alastair Clarkson would have liked to see more progress on the ladder, but he remains bullish they are heading in the right direction. North Melbourne avoided another bottom-two finish. Credit: Getty Images After a torrid first six rounds and the odd thrashing beyond that, North were generally more competitive, including securing a draw with Brisbane, but there were no statement wins. Instead, they would be pleased with Harry Sheezel’s transition to a midfield-forward role, the continued development of Colby McKercher and career-best seasons from Cam Zurhaar and Paul Curtis.\n\nIt could be a rough exit meeting for: Will Phillips. The No.3 pick in the COVID-19-impacted 2020 draft class played only seven matches this season and does not appear to be in the Roos’ plans. He should latch on somewhere, but needs to get going to save his career. Something to look forward to: Next year promises to be the season when North Melbourne finally take a genuine leap. How high that is remains to be seen, but the expectations must rise, even if that is as modest as aiming for between eight and 10 wins. The young talent is there, and they may have finally found Nick Larkey’s sidekick in Cooper Trembath. A stiffer defence and another progression from their midfield group should enable them to take another belated step.\n\nBest and fairest: Luke Davies-Uniacke.\n\n– Marc McGowan Richmond (17th) Wins: 5. Losses: 18. Draft picks: 2,3 What went well: Plenty for a club that was widely tipped to sail through turbulent waters with a drastically young and inexperienced list.\n\nThe season began on the best note possible with a stunning round-one win over Carlton. The nature of the victory, a come-from-behind triumph, set the tone for the season for both the Tigers and Blues. Throw in highlights from Maurice Rioli jnr, and all was swell. Tim Taranto had a strong season as one of the Tigers’ on-field leaders. Credit: AFL Photos It could be a rough exit meeting for: The club’s forwards and the forward coaches. The Tigers scored the fewest number of points (1449), less even than West Coast, a club that limped to one victory, compared to Richmond’s five. Veteran spearhead Tom Lynch could cop a drive-by sledge for missing games. He played only 16 matches (due largely to a suspension) after a tough couple of years with injuries.\n\nSomething to look forward to: There’s so much to look forward to. Realistically, the Tigers will battle to replicate their win-loss tally (5-18) as they continue to develop their young group. It could be a case of the “second-year blues” for a host of players. But Richmond will be eyeing off their matches against Carlton and the chance to knock them off again. Best and fairest tip: Tim Taranto.\n\n– Scott Spits St Kilda (12th)\n\nWins: 9. Losses: 14. Draft picks: 7, 43, 58. What went well: The Saints were a popular choice to sink into the bottom four, but finished three wins clear of that territory while prioritising youth. The Saints will welcome Tom De Koning in 2026 and welcome back Max King after another injury-riddled season. Credit: AFL Photos St Kilda’s round two upset of Geelong was a false dawn, but a peek at their upside. They also demolished Fremantle and executed the greatest three-quarter-time comeback from 46 points down against Melbourne. That latter win was the first of four in a row before they almost upset GWS in round 24.\n\nNasiah Wanganeen-Milera’s emergence as a top-liner was massive, while Max Hall followed Cooper Sharman and Max Heath as a mid-season draft success story. It could be a rough exit meeting for: Zak Jones. The brother of ex-Demons captain Nathan was not one of the five Saints who re-signed last week, and faces an uncertain future. Jones turns 31 in March, and St Kilda already made it clear they want to get younger in the midfield. Something to look forward to: Another two years from Wanganeen-Milera, who they retained despite Adelaide and Port Adelaide wanting him.\n\nThere is optimism about what Mattaes Phillipou, Darcy Wilson, Alix Tauru and Tobie Travaglia can become, while the likes of Hugo Garcia, Isaac Keeler, Hugh Boxshall and Lance Collard also show promise. Tom De Koning will be on the list in 2026, and Max King will hopefully be fit again. Best and fairest tip: Nasiah Wanganeen-Milera.\n\n– Marc McGowan Sydney (10th) Wins: 12. Losses: 11. Draft picks: 9, 27, 45, 63. What went well: Having won just four of their first 12 games under new coach Dean Cox, the Swans showed fortitude to rebound and win eight of their final 11 games.\n\nBrodie Grundy returned to his best form for Sydney in 2025. Credit: AFL Photos Playmaker Isaac Heeney had a tough start, but then reminded everyone why he is a legitimate star. Chad Warner was a consistent threat through the midfield, but did not have the impact he enjoyed through 2022-24. A serious ankle injury through the pre-season sidelined Errol Gulden for months and seriously hurt the Swans’ midfield and creative drive, just as his return in round 15 had the reverse effect. Brodie Grundy reinforced why he is one of the competition’s premier ruckmen.\n\nIt could be a rough exit meeting for: Skipper Callum Mills. For the Swans to make the leap next season, Mills needs to consistently be on the park. His 2024 campaign was derailed after injuring his rotator cuff in a Mad Monday celebration. He missed the first half of this year because of plantar fascia. He needs to lead the way in 2026. Something to look forward to: This has been a year of recalibration for the Swans, and learning, particularly for Cox, who is now more at ease in the top role after replacing John Longmire. While it feels somewhat of a wasted year, the Swans are still in top-four mode, and are likely to be strengthened through the trade period. They just need to get moving earlier next season. Best and fairest tip: Isaac Heeney.\n\n– Jon Pierik\n\nCarlton (11th) Wins: 9. Losses: 14. Draft picks: 34, 44, 62*. What went well: Not much. George Hewett was one of few Blues to exceed expectations, putting together a career-best season in the midfield. Jack Silvagni and Tom De Koning are both leaving the Blues. Credit: Getty Images Better known as a defensive onballer, Hewett became a prolific ball-winner in his own right. In his 12th season on an AFL list, the former Swan is a strong chance to win his first best and fairest award.\n\nVeteran Nick Haynes overcame a horror start at the club to become dependable defender. He deserves another year. Young midfielder Cooper Lord is one to watch. George Hewett stepped up for the Blues in 2025, but didn’t get enough support. Credit: Getty Images The Blues blooded seven debutants, the best of whom looks to be key defender Harry O’Farrell, who, unfortunately, injured his knee. Other gains were bitter-sweet. Jack Silvagni was a revelation in defence but played just 13 games and is now on the move. Ollie Hollands found plenty of the ball in his new role as a running defender but his kicking needs work. It could be a rough exit meeting for: Mitch McGovern. The Blues are keen to get money off their books and the writing is on the wall for the 30-year-old, who narrowly missed a games trigger that would have earned a contract extension.\n\nWith Silvagni walking out and O’Farrell to be unsighted for much of 2026, the defender may yet get another year, but it will be on the Blues’ terms. Veterans Adam Saad and Blake Acres both had ordinary seasons. Something to look forward to: With mass change underway in the coaches box, free agents Tom De Koning and Silvagni confirming their departures, and ongoing chatter about Charlie Curnow, it’s already been a turbulent off-season for the Blues, and the AFL home and away season isn’t even officially over yet! Expect that turmoil to continue for some time yet. But once they ride that out, there will be hope again. The departures of De Koning and Silvagni will strengthen the Blues’ draft hand to acquire highly-rated Harry Dean as a father-son pick.\n\nDecimated by injury in 2025, the Blues can vault back into finals contention with a cleaner bill of health. Curnow (assuming he stays) and Sam Walsh had interrupted preseasons which severely impacted their year. Harry McKay missed half the season. Matthew Cottrell and Elijah Hollands, two of their best runners, hardly played, and heart-and-soul defender Nic Newman didn’t get on the field at all. Then there’s the prospect of a fit Jagga Smith. Get all them right and the Blues should be stronger – but this was a year when they fell well below expectations. Best and fairest tip: George Hewett.\n\n– Andrew Wu\n\nMelbourne (14th) Wins: 7. Losses: 16. Draft picks: 23, 51, 59* What went well: Kysaiah Pickett graduated from a star goalsneak to a game-breaking midfielder/forward who now rivals skipper Max Gawn as the club’s best player. Despite their troubles, the Demons secured Pickett’s prized signature in a huge coup, keeping him in the red and the blue until the end of 2034 on a lucrative contract. Midfielders Christian Petracca and Clayton Oliver are stars for Melbourne and both have long-term contracts, but that no longer means their respective futures at the club are guaranteed. Credit: Getty Images Gawn was again a colossus, talking through action on the field and becoming their spokesperson for almost every crisis off it.\n\nRebounding defender Jake Bowey has taken the next step to become a driver of the team while Harvey Langford, the No.6 pick in last year’s draft, is the Demons’ next A-grade midfielder after making a seamless transition to senior football. Veteran forward Jake Melksham, with 33 goals from 18 games, earned himself another contract, which was confirmed by the Demons just days after their season ended. It could be a rough exit meeting for: Clayton Oliver and Christian Petracca. Do two of Melbourne’s greatest players want to stay? If either player wants out, the club should not stand in their way.\n\nComing back from a life-threatening injury, Petracca’s season was steady, and he will likely finish in the top six of the club’s best and fairest award, but a long way from his game-breaking ways. Loading Oliver was better than last year when his campaign was compromised by his off-field issues. Both still have time to return to their best but the competition trend away from contest and stoppage towards speed and ball use is against them. Jacob van Rooyen went backwards in a season the club needed him to hold down a key forward posting.",
    "source": "TheAge",
    "cluster_id": 34
  },
  {
    "url": "https://www.theage.com.au/politics/federal/the-latest-illustrations-from-artist-matt-golding-20230608-p5df5o.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "The latest illustrations from artist Matt Golding",
    "publish_date": "Tue, 30 Sep 2025 10:21:53 +1000",
    "category": "entertainment",
    "authors": [],
    "text": "The latest illustrations from artist Matt Golding\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 35
  },
  {
    "url": "https://au.news.yahoo.com/does-fasted-cardio-help-lose-011831496.html",
    "title": "Does ‘fasted’ cardio help you lose weight? Here’s the science",
    "publish_date": "2025-09-30T01:18:31Z",
    "category": "lifestyle",
    "authors": [],
    "text": "Every few years, the concept of fasted exercise training pops up all over social media.\n\nFasted training refers to exercising in the morning, before eating breakfast.\n\nFans will claim it’s the most efficient way to lose body fat. Opponents say it’s a terrible idea and will cause you to gain weight.\n\nWho’s right and what does the research evidence say?\n\nWhere did the idea come from?\n\nFasted exercise, proponents say, will cause better changes in body composition – the proportion of lean mass (muscle), bone and fat. In particular, they say fasted exercise leads to fat loss.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nPositive changes in body composition can occur through losses of fat mass, while either maintaining or gaining lean mass. Or even through gaining lean mass in the absence of any loss of body fat. All of which may be considered positive.\n\nThe idea fasted exercises leads to such positive body composition changes stems from research that shows exercising after eating versus exercise before eating affects metabolism differently.\n\nAerobic exercise in a fasted state causes you to burn more fat as a fuel (what researchers would call “fat oxidation”) when measured at a single point in time.\n\nSo it wasn’t a big leap to assume this would translate to longer-term fat loss.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nHowever, a 2017 systematic review from my team demonstrated that a fasted exercise training program doesn’t seem to translate into long-term differences in body fat loss.\n\nThis discrepancy between fat burned as a fuel during exercise, and changes in body fat in the long term has often been misunderstood.\n\nThis apparent contradiction may come down to the fact the body seems to find ways to compensate. Fat burning seems to reduce once you eat, and people who have exercised hard may end up expending less total energy over the course of the day.\n\nIn exercise science, it’s actually pretty common to find that short-term effects don’t always translate to longer-term impacts.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nFor example, intense short-term exercise can negatively affect your immune system in the moment, but doing regular exercise can actually affect it positively in the longer term.\n\nExercising after eating improves performance in activities lasting over 60 minutes. Photo by Jonathan/Pexels\n\nWhat does eating soon after or just before your workout do?\n\nEating a meal featuring carbohydrates and protein close to when you exercise is likely to help with performance during your next exercise session.\n\nHowever, whether that meal is before or after your workout seems to have limited impact.\n\nInterestingly, research has shown that increasing the proportion of the food you eat in the morning – and in particular, eating more protein – may help to improve body composition and enhance weight loss.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nHowever, this timing is not in relation to exercise, rather in relation to when in the day you eat.\n\nWhat about sports performance?\n\nIt’s fairly clear eating before exercising improves performance in activities lasting over 60 minutes but has little effect on performance of shorter duration activities.\n\nThis is also evidenced by the lack of elite athletes supporting fasted exercise. A survey completed by almost 2,000 endurance athletes showed non-professional athletes are more likely to exercise fasted compared to professional athletes.\n\nWhat about strength training?\n\nSo do you get differences in muscle strength, size, and body composition changes in response to doing resistance training (such as weightlifting) when you’ve fasted versus when you’ve eaten? Unfortunately, the research is limited and low quality.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nThis limited evidence so far suggests it makes no difference.\n\nOne recent randomised controlled trial also found no difference in strength, power, or lean body mass when resistance training was done twice a week for 12 weeks either after fasting or after eating.\n\nWhat are the potential drawbacks?\n\nFasted training can make you feel really hungry after exercise, which can lead you to make poorer food choices.\n\nSome people may even get headaches and nausea when trying to exercise fasted. This isn’t universal experience, though; social media is full of people who say exercising while fasting makes them feel great.\n\nIn summary, there is no clear winner.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nThe evidence doesn’t support the superiority of fasted exercise for weight loss, or sports performance.\n\nHowever, the evidence also doesn’t show it causes a problem in many scenarios (except perhaps elite sports performance).\n\nSo if you’re short on time and skipping breakfast is going to allow you to get out and get that run or workout in, then go for it. Don’t worry too much about the consequence.\n\nBut if the idea of exercising on an empty tummy makes you want to avoid the gym, then grab some breakfast before you go. Rest assured it won’t be working against your goals.\n\nExercise fads and wellness hacks come and go but the thing backed by solid and consistent evidence is exercise.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nSimply doing it matters the most.\n\nNot the time of day, not the exact exercise choice, not even the exact amount – and definitely, not if you have or haven’t eaten before you exercise.\n\nThis article is republished from The Conversation. It was written by: Mandy Hagstrom, UNSW Sydney\n\nRead more:\n\n\n\nMandy Hagstrom is affiliated with Sports Oracle, the company that delivers the IOC Diploma of Strength and Conditioning",
    "source": "Yahoo",
    "cluster_id": 46
  }
]