[
    {
        "url": "https://www.9news.com.au/national/qantas-to-close-jetstar-asia-budget-airline/9d44e44a-9400-4bea-8e75-e90bd5ab9132",
        "title": "Qantas to close budget airline Jetstar Asia in major shake-up",
        "publish_date": "Wed, 11 Jun 2025 01:07:38 +0000",
        "category": "finance",
        "authors": [
            "Jun"
        ],
        "text": "Q﻿antas today announced it was closing the group's Singapore-based budget airline Jetstar Asia as it moves to strengthen its core business in Australia and New Zealand.\n\nThe decision will free $500 million for Qantas Group to invest in its fleet renewal plans. Around 500 jobs will be lost from the Asia region.\n\nQantas says that 13 Jetstar Asia Airbus A320 aircraft will be progressively redeployed to Australia and New Zealand, bringing more low fares and local jobs.\n\nREAD MORE: Bank staff catch red flags that nearly cost woman her life savings\n\nQantas Group announced today it was closing its JetStar Asia airline. (Getty)\n\nJetstar Asia has been impacted by rising supplier costs, high airport fees, and intensified competition in the region.\n\nQantas Group chief executive Vanessa Hudson said the company had been hit with some supplier costs rising by up to 200 per cent, materially changing its cost base.\n\n\"We are incredibly proud of the Jetstar Asia team and the work they have done to deliver low fares, strong operational performance and exceptional customer service,\" she said.\n\n\"This is a very tough day for them.\"\n\nHudson said Jetstar Asia's 13 mid-life A320 aircraft will be progressively redeployed to core markets in Australia and New Zealand to create more than 100 local jobs and more low fares﻿, including on regional routes.\n\nREAD MORE: Death toll of horrific Austrian school shooting rises to 11\n\nQantas chief executive Vanessa Hudson. (Peter Mathew)\n\n\"We are currently undertaking the most ambitious fleet renewal program in our history, with almost 200 firm aircraft orders and hundreds of millions of dollars being invested into our existing fleet,\" she said.\n\nThe airline is expected to post a $35 million underlying Earnings Before Interest and Taxes (EBIT) loss this financial year, prior to the closure decision.\n\nJetstar Asia was launched more than 20 years, but has recently faced stiff competition from other low-cost carriers and a hike in operating costs.\n\nThe airline will stop operating on July 31. Flights will run for the next seven weeks.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/powerball-lotto-100-million-dollar-jackpot-largest-of-2025/e1dc3389-2988-4b0b-8fdf-0e27e23228b1",
        "title": "Biggest Powerball jackpot of 2025 hits $100 million",
        "publish_date": "Wed, 11 Jun 2025 01:29:59 +0000",
        "category": "sports",
        "authors": [
            "Jun"
        ],
        "text": "Only six Australians know what it's like to win a $100 million\n\nPowerball\n\njackpot, but tomorrow, one more person could join that tiny club.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/first-look-inside-finished-western-sydney-airport/ae251854-e240-4b66-8f05-1b7a01ee1540",
        "title": "First look inside Sydney's newest global airport",
        "publish_date": "Wed, 11 Jun 2025 01:08:36 +0000",
        "category": "finance",
        "authors": [
            "June"
        ],
        "text": "6 of 18 Attribution: Trevor Mein\n\n\"People will love spending time in this terminal as they enjoy the iconic vistas of the surrounding Blue Mountains that are reflected in our stunning feature ceiling and take in the thoughtful design and materials like the extensive use of beautiful sandstone that was sourced from a quarry on the Central Coast,\" Hickey said.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/world/rare-lost-rodin-sculpture-sells-for-one-million-dollars/8d5f4d49-1157-439d-8c3b-548c251ecc3b",
        "title": "A family thought the sculpture was a 'fake'. Now it's sold for nearly $1.5 million",
        "publish_date": "Tue, 10 Jun 2025 22:00:56 +0000",
        "category": "finance",
        "authors": [
            "Jun"
        ],
        "text": "A sculpture by French artist Auguste Rodin that had disappeared from public view for almost 120 years and was thought to be a copy has sold for 860,000 euros ($1.5 million) at auction.\n\nLe Desespoir , or Despair, which shows a female figure sat on a rock holding one foot with her knee hugged to her chest, was rediscovered late last year after last being sold in 1906, said auction house Rouillac in a statement.\n\nRodin, who lived from 1840 to 1917, made several versions of Le Desespoir . This particular sculpture was modelled in 1890 and sculpted from marble in 1892 to 1893.\n\nLe Desespoir (Despair) by French sculptor Auguste Rodin. (Guillaume Souvant/AFP via Getty Images) (CNN)\n\nMeasuring just 28.5cm by 15cm by 25cm, the sculpture was originally modelled to form part of Rodin's monumental work The Gates of Hell , which features more than 200 figures and groups.\n\nThe previous owners – a family from central France – had no idea of its value and had displayed the sculpture on top of a piano alongside family photos, auctioneer Aymeric Rouillac told CNN on Tuesday.\n\n\"They said 'it's a fake, it's a copy,'\" Rouillac said, but he decided to investigate further.\n\nThe details of this sculpture are striking, Rouillac told CNN.\n\n\"The back, the muscles, they are perfect,\" he said. \"You can feel every vertebra in the spinal column.\"\n\nREAD MORE: Bank staff catch red flags that nearly cost woman her life savings\n\nFrench sculptor Auguste Rodin. (public domain)\n\nFollowing his own initial investigation, Rouillac took the sculpture for assessment by the Comite Rodin, which maintains a catalogue of the artist's work.\n\nOn Tuesday, Jerome Le Blay, co-founder of the Comite Rodin, told CNN that he was immediately struck by the \"exceptional\" piece.\n\n\"I realised in a second that it was real,\" he said. \"I had absolutely no doubt.\"\n\nThis particular example is \"extremely well made,\" said Le Blay, adding that it dates back to a period when Rodin was dedicating a huge amount of time to making a small number of sculptures.\n\nRodin would have worked with assistants who would have carried out the initial work on a piece of marble, before he performed the final stages, he explained.\n\nREAD MORE: Amazon launches new service in Australia for business owners\n\nThe fine detail on one of the feet in the sculpture \"Le Desespoir\". (Guillaume Souvant/AFP via Getty Images) (CNN)\n\nAccording to Le Blay, the sculpture dates to \"one of the best moments of Rodin's career,\" before his growing fame meant that he started to produce more and more works after the turn of the century.\n\nUpon his death, Rodin left his works to the Musee Rodin in Paris, as well as granting it permission to continue producing his bronze sculptures.\n\nWhile many of these posthumous bronzes go under the hammer each year, marbles are much harder to find, said Le Blay.\n\nMost of Rodin's marbles are owned by the Musee Rodin or by other large museums around the world, he said.\n\n\"Marbles in private collections are rare,\" he said, adding that this piece has a \"kind of magic\" due to the fact that it has reappeared for sale after such a long time.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/amazon-business-launches-in-australia/fe3d3e85-6027-4fa0-b0ad-c4339d11d61c",
        "title": "Amazon launches new service in Australia for business owners",
        "publish_date": "Tue, 10 Jun 2025 19:24:41 +0000",
        "category": "finance",
        "authors": [
            "Jun"
        ],
        "text": "Online commerce giant Amazon is today launching a new service in Australia targeting the multibillion-dollar business-to-business (B2B) market.\n\n﻿Amazon Business will offer small, medium and large companies office products, electronics, furniture and more, at what Amazon says will be competitive pricing.\n\nIts launch comes as businesses stock up on supplies ahead of the new financial year.\n\nREAD MORE: Hundreds of jobs on the line as Don Watson Transport shuts down after 77 years\n\nAmazon is launching a new service for B2B customers.. (AP Photo/Reed Saxon, File) (AP)\n\nAmazon says its new division will offer a cheaper and simpler purchasing process through business-only pricing, quantity discounts on eligible products and dedicated customer support.\n\nCompanies will also be offered the choice of upgrading to Business Prime, which combines the shipping benefits Amazon Prime members enjoy with exclusive business features such as shared accounts and buying policies.\n\nLena Zak, Amazon Business Australia country manager, says the new service will ease the purchasing process for companies.\n\n\"We know that 78 per cent of SMBs (small to medium businesses) have had to implement cost-cutting measures over the past three years,\" she told 9News.com.au.\n\n\"As operating costs keep rising, Amazon Business can help take some of that pressure off by offering meaningful savings on everyday goods and supplies, along with the convenience and simplicity of our delivery experience.\"\n\nE-commerce giant Amazon Australia says it has invested heavily in its operations network. (Supplied)\n\nAustralia is the eleventh country where Amazon Business has launched, following the US, Canada, France, Germany, India, Italy, Japan, Mexico, Spain and the UK.\n\nSince its launch in 2015, it has driven about $35 billion in annualised gross sales and has more than 8 million customers worldwide.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/home-prices-australia-average-1-million-dollars/461fee7a-7bd8-4e21-83fd-82a612345a24",
        "title": "Aussies sitting on massive $11.4 trillion jackpot",
        "publish_date": "Tue, 10 Jun 2025 03:01:17 +0000",
        "category": "finance",
        "authors": [
            "Jun"
        ],
        "text": "T﻿he cost of buying a new home has hit another milestone, even as the speed at which prices are increasing slowed over the past year.\n\nNew data released this morning by the Australian Bureau of Statistics (ABS) showed that the national average dwelling price is now sitting at just over $1 million – the first time it has reached seven figures.\n\nIt also showed the combined value of all homes in Australia had reached $11.4 trillion for the March quarter, an increase of $130.7 billion ﻿or 1.2 per cent since December.\n\nREAD MORE: Huge changes just made to the way millions of Aussies shop ﻿\n\nThe average Australian home now costs $1 million. (Dion Georgopoulos/SMH)\n\nFive years ago, that figure was sitting at just $7.3 trillion.﻿\n\nBut while﻿ prices are still increasing – and, with more interest rate cuts expected throughout the year, are showing no signs of going backwards – they are rising at a slower pace than at the same time last year.\n\n\"Despite the quarterly rise in national dwelling value, annual growth in the March quarter slowed to 5.9 per cent,\" ABS head of finance statistics Dr Mish Tan said.\n\n\"This was down from 9.5 per cent in March quarter 2024.\"\n\nREAD MORE: Aussie IVF giant admits to another embryo bungle ﻿\n\nNew South Wales, where the average home price is ﻿$1.25 million, remains Australia's most expensive property market.\n\nThe average price in the ACT went backwards, falling slightly to $941,300, with Queensland $944,700 overtaking it to become the second-priciest market in the country.\n\n\"The national mean price of residential dwellings passed $1 million for the first time in the March quarter 2025, rising 0.7 per cent to $1,002,500,\" Tan said.\n\n\"Western Australia, South Australia and Queensland were the main drivers of the rise, with Queensland reaching the second highest mean price in Australia, behind New South Wales.\"\n\nThe Northern Territory ($517,700﻿) remains the country's least expensive market.",
        "source": "9News"
    },
    {
        "url": "https://www.abc.net.au/news/2025-06-11/abc-panel-show-q-a-discontinued-after-18-years-on-air/105400400",
        "title": "ABC to discontinue Q+A after panel show's 18 years on air",
        "publish_date": "Wed, 11 Jun 2025 01:42:07 +0000",
        "category": "finance",
        "authors": [],
        "text": "The ABC will discontinue its weekly panel show Q+A after 18 years, the public broadcaster has announced.\n\nThe show, hosted by Patricia Karvelas since 2023, will not return after its hiatus, which started last month.\n\nThe ABC's news director, Justin Stevens, said Q+A had made a huge contribution to the national public discussion.\n\n\"We're very proud of Q+A's great achievements over the years. The team has done a terrific job, including a strong performance during the federal election campaign,\" he said.\n\n\"Discontinuing the program at this point is no reflection on anyone on the show.\n\n\"We always need to keep innovating and renewing and, in the two decades since Q+A began, the world has changed.\n\n\"It's time to rethink how audiences want to interact and to evolve how we can engage with the public to include as many Australians as possible in national conversations.\n\n\"We'll be working on how we can continue to foster engagement of this nature in an innovative way.\"\n\nKarvelas will continue hosting Afternoon Briefing and the popular Politics Now podcast along with writing her column for the ABC News website.\n\n\"Patricia also recently reported for Four Corners, and we've now asked her to do more for Four Corners as time permits,\" Stevens said.\n\nFouding Q&A host Tony Jones and executive producer Peter McEvoy helmed the show for 12 years. (ABC News)\n\nThe Q+A proposal would result in some redundancies, Stevens told ABC staff in an email.\n\nThe ABC also announced it would invest in producing more news documentaries, with a new position of executive producer, documentaries and specials to be advertised soon.\n\nIt will also make the Your Say project — launched during the recent federal election — a permanent initiative to drive audience engagement in communities around the country.\n\n\"Your Say ensures we have a strong framework for putting the public's views, concerns and questions at the heart of our journalism, complementing our daily commissioning and reporting,\" Stevens said. \"We're keen to see what else we can do with this.\"\n\nAudience-powered journalism\n\nLaunched by founding executive producer Peter McEvoy and host Tony Jones in 2008, Q+A was an agenda-setting program that pushed politicians beyond their standard talking points.\n\nThen-prime minister Kevin Rudd appeared solo on the first episode, before the second episode introduced the regular format of five panellists, including politicians from across the spectrum and others in public life.\n\nQ&A crew sign off after 12 years Photo shows Jones and McEvoy standing in front of Q&A sign with arms around each other. Reflections on the memorable and sometimes controversial moments of Q&A.\n\nWhat made it stand out from other panel shows was the role of the audience, who led the questioning in the studio or via video and social media.\n\nMcEvoy said in 2019 that the audience was the show's biggest challenge and its strength.\n\n\"An ordinary panel program just has to wrangle four or five guests,\" he said.\n\n\"Q&A has to manage 300, 400 — up to a thousand audience participants — recruiting, registering, checking identities, keeping them informed, generating and choosing questions.\"\n\nWith the audience asking the questions, the conversation could go in unexpected directions, giving a platform to people who were not being heard in other areas of public life.\n\nBut not every question took the conversation forward, earning Jones's signature line, \"I'll take that as a comment\".\n\nWhen Jones left the show in 2019, Hamish Macdonald joined as host for 18 months, before resigning. He was replaced by rotating hosts David Speers, Virginia Trioli and Stan Grant, before Grant took the role on solo.\n\nGrant resigned from the program in May 2023 after sustained racist abuse and trolling, saying on his last show: \"To those who have abused me and my family, I would just say — if your aim was to hurt me, well, you've succeeded.\"\n\nPatricia Karvelas has hosted Q+A for the past two years.\n\nTributes to staff, panellists\n\nStevens paid tribute to the many people who had worked on screen and behind the camera over the show's 18-year run.\n\n\"I want to call out current executive producer Eliza Harvey and presenter Patricia Karvelas. They are hugely talented journalists who have done an outstanding job with Q+A in recent years,\" he said.\n\n\"Many extremely talented and dedicated people have worked on Q+A, as presenters and behind the scenes.\n\n\"I extend our sincerest thanks to them all, and to everyone who has contributed as audience members and panellists.\"\n\nKarvelas said she had immensely enjoyed being part of the program.\n\n\"Spending time with the audience members who came to Q+A late on a Monday night has been the best part of this job,\" she said.\n\n\"They have always been the reason for this show and I'm forever grateful to them for coming on national TV and having the courage to ask questions of powerful people.\"\n\nThe Project axed\n\nThe news comes in the same week Channel Ten has axed its long-running nightly panel show The Project, after almost 16 years and 4,500 episodes.\n\nThe show's hosts, Waleed Aly, Hamish McDonald and Sarah Harris, will leave Channel Ten after the final episode airs on Friday, June 27.\n\nThe network announced a new national \"news, current affairs and insights\" show that will air for an hour from Sunday to Friday.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-06-11/erin-phillips-daisy-pearce-hall-of-fame-legacy/105402816",
        "title": "Why Phillips and Pearce's contribution to footy goes far beyond the field",
        "publish_date": "Wed, 11 Jun 2025 01:31:44 +0000",
        "category": "sports",
        "authors": [],
        "text": "There's a poetic tilt to the year that the AFLW will enter its 10th season, as its first former players are inducted into the Australian Football Hall of Fame.\n\nThe wider footballing community may have started to take note of the names Erin Phillips and Daisy Pearce when the women's elite competition erupted onto the scene in 2017, but the roots of their impact go far deeper and extend a lot further back than from that first ball up between Collingwood and Carlton at Princes Park.\n\nAs AFLW analyst and commentator Gemma Bastiani pointed out, Pearce and Phillips represent two very different, but equally worthy versions of women in footy pre-AFLW.\n\n\"Erin pursued other sports after being told no, Daisy raised the standard of the then-VWFL to force the AFL's hand,\" Bastiani wrote on X.\n\nThe timing of the AFLW's introduction being brought forward to 2017 from 2020 meant that Pearce and Phillips got to play at the top level, but its delayed start meant we never really got to see them in their prime.\n\nErin Phillips, crouching in the middle of shot, during a WNBL promotion shoot in 2005, when she played for the Adelaide Fellas. (Getty Images: Robert Cianflone)\n\nAfter being forced away from football age 13, Phillips turned to basketball. There, she made herself known on the international stage, becoming a two-time WNBA champion, world champion, Commonwealth gold medallist and Olympic silver medallist.\n\nWhen the whispers came that the AFLW may be forming, she made the courageous choice to follow her first calling. She packed up her family in the US and moved back to Australia for the competition's first iteration in 2017.\n\nExternally, she brought gravitas, excitement and, importantly, eyeballs to the competition. Internally leadership and belief in what they were building.\n\nErin Phillips left the AFLW as the most decorated player in the league's young history. (Getty Images: Dylan Burns/AFL Photos)\n\nShe left the game as the most decorated elite women's football player to date: a three-time premiership player, two-time league best and fairest, three-time All Australian, two-time grand final best on ground and two-time club champion.\n\nPearce, on the other hand, carried the weight of being the face of the newly formed AFLW.\n\nIn 2013, when women's football pioneers were pushing for a professional competition, Pearce was taken by Melbourne with the first pick in the inaugural national women's draft for the first women's exhibition game.\n\nDaisy Pearce thanks the crowd playing in a curtain raiser at MCG in 2013. (Getty Images: Darrian Traynor)\n\nShe then became a marquee signing for Melbourne and entered the competition a 10-time VWFL/VFLW premiership player with Darebin, where she was captain between 2008 and 2016.\n\nIn her Hall of Fame speech, Pearce said she carried a weight in those early days of feeling like they had to put on a good spectacle, kick enough goals, gaining enough attention, as the future of women's footy was riding on their shoulders.\n\nPearce ended her speech honouring the ones that came before her, the pioneers who never got to play at the top level. The likes of Debbie Lee, Peta Searle and Jan Cooper.\n\nHighlighted in both stories on the night was that they used to run around with the boys as kids, as there were no girl teams for them to play in growing up.\n\n\"I never wanted to be a boy,\" Phillips said in her speech.\n\n\"I just wanted the opportunities that boys had, and that was footy.\"\n\nThis is a common story within the first generation of AFLW players, who came from all corners across the country to fight for the right to play and grow the game they love, in the face of fierce adversity and constant pushback.\n\nWithout those trailblazers, spearhead by Phillips and Pearce, we would not have a 10th season to enter into this year.\n\nNow, almost 600,000 women and girls participate in Australian Rules footy across the country.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-06-11/mount-gambier-queer-art-trail-pride-month/105392996",
        "title": "City's queer art trail helps creator 'feel safe to be myself'",
        "publish_date": "Wed, 11 Jun 2025 00:54:34 +0000",
        "category": "entertainment",
        "authors": [],
        "text": "Chelsea Dynan has only been in Mount Gambier a short time, but reconnecting with art has helped her find her place in her new home.\n\nTo start Pride Month, a queer art trail has been established to promote LGBTQIA+ visibility in common community spaces.\n\nDynan has entered art competitions and exhibitions before, including winning the Packer Prize at the Penola Art Show.\n\nBut putting her work in the first local queer art trail as a bisexual woman has been one of her most vulnerable experiences.\n\nDynan focused on drawing new students studying medicine in Mount Gambier. (ABC South East SA: Sam Bradbrook)\n\n\"I think this has a different meaning for me because my identity came with a lot of threats and fear,\" she said.\n\n\"When I was back home, I didn't feel safe to be myself.\n\n\"Having this opportunity and showcasing that we can put ourselves out there and be seen and heard and feel safe in doing so, that's been the biggest impact for me.\"\n\nDynan's art captured a group she felt a strong connection with — medical students who had just moved from home to Mount Gambier to study.\n\nPublic places across Mount Gambier, including the Riddoch Art Gallery, are housing pieces from the queer art trail. (ABC South East SA: Sam Bradbrook)\n\n\"I wanted to celebrate other people as well as being able to showcase myself in some form of anonymity, so that it's not me in the image,\" she said.\n\n\"I get to celebrate women and other people who are living in this township.\"\n\nArt a safe space amid 'chaos'\n\nThe queer art trail includes work from LGBTQIA+ artists throughout the Limestone Coast region of South Australia.\n\nThe exhibition is on display in public places throughout SA's second-largest city, including the Riddoch Art Gallery, shopping centres and cafes.\n\nArtworks are on display from people aged nine to 50.\n\nKit Cooper organised the queer art trail, and had their own art featured. (ABC South East SA: Sam Bradbrook)\n\nKit Cooper helped organise the event and also entered their own pyrography work, something they started after being diagnosed with Postural Orthostatic Tachycardia Syndrome (POTS).\n\n\"I make art because it takes me where my body can't anymore,\" Cooper said.\n\n\"These particular pieces were created from a point of calm and zen, just a chance to centre myself amidst the chaos.\n\n\"I have four children and obviously a lot of organisation going on, so my art is my safe space for myself.\"\n\nPyrography is an art medium that uses fire to burn designs into wood. (ABC South East SA: Sam Bradbrook)\n\nCooper said having the exhibition in busy places in Mount Gambier was important.\n\n\"I'm incredibly proud of what has been pulled together,\" they said.\n\n\"The artists have come together, the community is taking notice and appreciating queer artists.\n\n\"It's been wonderful seeing it be so successful, more successful than I admit I even estimated that it might.\"\n\nIncreasing visibility\n\nPatrick Smith has been a long-term advocate for queer representation in Mount Gambier and is working on a set of artworks for a full solo exhibition in his home town.\n\nHe said visibility for the local LGBTQIA+ community was important to create lasting change.\n\nPat Smith says queer art will only make the world \"better and richer\". (ABC South East SA: Sam Bradbrook)\n\n\"The incidental appearance of queer iconography, queer motifs, and themes is also to show that you are going to bump into a queer person regardless of the space you're going to be in,\" he said.\n\n\" Queer spaces do exist and queer life does exist in rural areas. \"\n\nSmith said his art focused on subverting the normalised way of looking at the human body.\n\nMr Smith hopes young LGBTQIA+ people will feel inspired seeing queer representation around Mount Gambier. (ABC South East SA: Sam Bradbrook)\n\n\"You can then get a very homogeneous and very staid look on the world,\" he said.\n\n\"But to be able to bring in different ways, different angles, to interpret and understand the world around us, it will only make it better and richer.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-06-11/mums-playing-football-sport-after-children/105366654",
        "title": "Mums forge new traditions and connections by returning to footy",
        "publish_date": "Wed, 11 Jun 2025 00:39:50 +0000",
        "category": "sports",
        "authors": [],
        "text": "Dramatic premiership wins reminisced about in the change rooms and rivalries that outlast playing careers, playing footy for your country town is a rite of passage.\n\nAs more women join the game, new traditions and a new miniature support base have been born.\n\nGeorgia Carroll had her first child nine months ago, but is back this season, playing for Brothers in Rockhampton.\n\nThe Rockhampton Brothers in a huddle before a game. (Supplied: Rockhampton Brothers)\n\nArriving at training with footy boots in hand, the nursing student said the support from other mums in the team was important to her.\n\n\"That's probably the most special part, you can go and talk to a lot of the other mums about things that you might be curious as to whether they have experienced it as well,\" Ms Carroll said.\n\n\"If you need to step away to breastfeed or something like that, I feel very comfortable to do that because there are two other mums at the moment who are currently breastfeeding as well.\"\n\nAFL Queensland says female participation in the sport continues to grow. (ABC Capricornia: Freya Jetson)\n\nThe team environment and sense of community made her desperate to return to the field as soon as possible after giving birth.\n\n\"It's one of the most important things in my life. I wouldn't have met Zac, my partner, and I wouldn't have 90 per cent of the friends I have today,\" she said.\n\nMs Carroll is one of a growing number of mums in the sport, and AFL Queensland has thrown its support behind them.\n\nWomen's competition grows\n\nHead of AFL Queensland and International Trisha Squires said the sports body was committed to empowering women at all levels of the game.\n\n\"Mums are absolutely encouraged to play, and we take great pride knowing they are making connections with their teammates and community club,\" Ms Squires said.\n\nAFL Queensland says the sport can help players build connections with their teammates and community. (ABC Capricornia: Freya Jetson)\n\n\"Regional competitions and communities benefit our national league, as so many of our players were introduced to AFL in their local towns.\"\n\nBut returning to any sport after having children can be difficult.\n\nReturn to sport is different for everyone\n\nResearcher Mel Hayman, who led the development of the 2020 Australian Exercise During Pregnancy Guidelines, said one of the best ways for mums to get back into sport was by setting milestones, rather than timelines.\n\n\"Each return should be tailored and take into account the individual circumstances,\" Dr Hayman, from Central Queensland University said.\n\nHow Olympian Alyce Wood approached pregnancy Photo shows Alyce Wood and daughter Florence on a pier, holding a paddle, smiling. Dual Olympian Alyce Wood found managing her exercise during pregnancy challenging due to a lack of research on the topic. She's now returned to sport postpartum but rejects the idea of \"bouncing back\".\n\nAnother player in the AFL Capricornia league Amelia Bartlem said she started with low-intensity exercise after recovering from a caesarean section.\n\n\"I had six weeks before I could get around and go for my big walks, and eventually I got back into playing AFL,\" she said.\n\n\"I lacked core strength, so it made it really hard to play footy without building it up.\"\n\nDr Hayman said an increased number of women were returning to sport at both the community and elite levels.\n\n\" If they are returning in high numbers that means the community is doing something right. \"\n\nMental health boost\n\nRockhampton Panthers AFL team co-captain Laila Howard struggled with her mental health after the birth of her daughter three years ago.\n\nLaila Howard says mums playing football are inspiring the next generation of girls. (Supplied: Laila Howard)\n\n\"I've never played footy before, but I was experiencing some really bad postpartum anxiety,\" she said.\n\n\"My partner saw the ad and said you should go down and try it out, and I went down and absolutely loved it.\n\n\"My main circle aside from family is football right now … we love to catch up outside of footy.\"\n\nMs Howard said it was inspiring the next generation.\n\n\"My three-year-old daughter is always saying, 'I'm a footy girl', and I said, 'You're going to have to wait a couple more years.'\"\n\nLaila Howard is playing in her third season. (Supplied: Laila Howard)\n\nDr Hayman said the sense of community in sport was an important element.\n\n\"It's the adult interaction, and it's also time to yourself as well where you can just focus on yourself, do something that you love doing, so that again you can then be a better mum,\" Dr Hayman said.\n\nMs Carroll agreed.\n\n\"I think a lot of people talk about losing their identity when they have a kid, and I don't feel like I've done that,\" she said.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-06-11/wallabies-coach-full-of-praise-for-jake-gordon/105402434",
        "title": "Wallabies coach praises 'utterly committed' Gordon ahead of Lions tour",
        "publish_date": "Wed, 11 Jun 2025 00:35:56 +0000",
        "category": "sports",
        "authors": [],
        "text": "Joe Schmidt has detailed why Jake Gordon is Wallabies captaincy material, while conceding individual form will trump team performances when selectors sit down to pick a squad to topple the touring British and Irish Lions.\n\nGordon's emergence as a frontrunner to lead the Wallabies in the showpiece three-Test series against the Lions has raised eyebrows due to the NSW skipper missing several games during his team's failure to make the Super Rugby Pacific finals for a second straight season.\n\nABC Sport will have live blog coverage of the British and Irish Lions' tour of Australia this July and August.\n\nBut coach Schmidt was glowing in his praise when asked about the halfback's captaincy credentials.\n\n\"Jake, he's one of the leaders in the group,\" Schmidt told reporters during a visit to the Western Force's training hub in Perth.\n\n\"So is Nic White, so there's a few halfbacks … and Tate McDermott has been a former [Wallabies] captain, so of the nines we had last year, they're all leaders within the group.\n\nRugby needs Lions series to be 'State of Origin moment' Photo shows Jarome Luai tackled by Daly Cherry-Evans in 2024 State of Origin series. State of Origin provides the NRL with a marquee event attracting interest nationally, which Australian rugby must achieve with the Wallabies' upcoming series against the British and Irish Lions.\n\n\"Jake is a really good skill set, mature player, [has a] very nice kicking game, one of the sharper passers around, and he is utterly committed when he's on the grass.\n\n\"His ability to cover corners and make tackles, be involved in the physical stuff, he's a multi-purpose sort of player.\n\n\"But the sharp edge of his game is really his pass-kick … [They] were very helpful to us last year.\"\n\nSchmidt will name a squad of up to 40 players before the Wallabies' first Test of the year against Fiji in Newcastle on July 6.\n\nBut the Kiwi mentor said his squad would not necessarily be dominated by the ACT Brumbies, Australia's last team standing in the Super Rugby Pacific competition.\n\nSchmidt promised he was looking at a raft of players from all four Australian franchises.\n\n\"Results are fickle,\" he said of the topsy-turvy Super Rugby season.\n\n\"The Wallabies will be judged on them, but there's a lot of work that goes on behind the scenes, and there's a lot of moments in games that decide results.\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\n\"An individual can stack up plenty of good moments in a game where they've performed really well, and sometimes the team doesn't get the results.\n\n\"So we're probably anchored to results. We're anchored more around performance and individual performance in a team context, definitely.\n\n\"You know that you've got to be connected with your teammates because that's one of the beauties of the game. It's so interdependent.\n\n\"You're reliant on the guys up front doing the job so you can get the space out the back. A guy like Mac Grealy or Harry Potter or Dylan Pietsch, they can't do a lot in space if the boys up front aren't doing their job.\"\n\nThe Force will be the first Australian side to tackle the Lions at Perth Stadium on June 28.\n\nThe ABC of SPORT Sports content to make you think... or allow you not to. A newsletter delivered each Saturday.\n\nAAP",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-06-11/qld-gov-ev-zero-emissions-target-qfleet/105402258",
        "title": "Queensland government dumps zero-emissions vehicle goal set by Labor",
        "publish_date": "Tue, 10 Jun 2025 23:49:18 +0000",
        "category": "finance",
        "authors": [],
        "text": "Queensland's LNP government is dumping a Labor-era mandate that required certain vehicles driven by public servants to transition to zero emission alternatives.\n\nPublic Works Minister Sam O'Connor will today unveil a new emissions reduction strategy for QFleet, which manages more than 11,000 vehicles for the government.\n\nUnder the former Labor administration, a target was introduced to transition all \"eligible\" passenger vehicles in the fleet to zero-emission vehicles (ZEV) by 2026.\n\nThis would have impacted around 3,600 vehicles in the fleet.\n\nThe former plan would have involved electric vehicles as well as other low-emissions options. (ABC News: Curtis Rodda)\n\nIn the new strategy, the ZEV push will be scrapped and a new target will be introduced, aimed at lowering the entirety of QFleet's tailpipe emissions by 10 per cent by 2030.\n\nThe plan will allow for other vehicles beyond electric vehicles to be used, such as hybrids and plug-in hybrids.\n\nMr O'Connor said every government agency would be held accountable to reduce their emissions, rather than buying a particular type of car.\n\n\"We're not here to tick boxes — we're here to focus on outcomes,\" he said.\n\n\"We've laid out a genuine pathway to reduce tailpipe emissions and better support the hardworking public servants who rely on QFleet to get them to where they need to be.\"\n\nSam O'Connor says the government should focus on results, not what type of car they use. (ABC Gold Coast: Dominic Cansdale)\n\nPlans to increase fleet size\n\nThe new strategy would see the fleet's tailpipe emissions lowered from 33.19 kilotonnes as of June 2024 to 29.86 kilotonnes by 2030.\n\nOver the same period, the government wants to grow the fleet of vehicles by about 9 per cent.\n\nThe strategy notes the plan was put together in response to \"significant\" feedback from government agencies, particularly public servants in regional areas.\n\n\"The [emissions reduction] strategy will mean for the first time the progress of total fleet emissions reduction is being monitored rather than just the number of EVs introduced,\" it said. \"This expansion of scope will provide the government with a more accurate account of its progress towards net zero emission targets.\"\n\nThe Queensland government has a target for the state to reach net zero emissions by 2050.\n\nThe new plan will aim to reduce tailpipe emissions by 10 per cent. (ABC News: Curtis Rodda)\n\nThe previous strategy rolled out by the former Labor government, which included the ZEV mandate, projected the fleet's emissions would drop to 26.7 kilotonnes by 2025-26.\n\nIt also argued a transition to electric vehicles would result in \"significant savings\" for taxpayers through running costs, such as fuel.\n\nEmissions targets under review Photo shows a high voltage power line in front of a cloudy, stormy sky Queensland's greenhouse gas emission reduction targets will be reviewed, with the treasurer saying gas will play a \"critical role\" in supply reliability as the state shifts to renewables.\n\nAnother aim of the plan was to increase the availability of second-hand electric vehicles in the used car market.\n\nThe ZEV mandate meant that as a vehicle lease expired, a zero-emission vehicle had to be taken up as long as there was a ZEV alternative and sufficient charging infrastructure was available.\n\nThe government's new QFleet strategy points out the fleet already has more than 2,000 active EVs.\n\n\"Thoughtful vehicle selection\" and \"responsible driving behaviour\" are among the measures it lists in its bid to cut vehicle emissions.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-06-11/mosquito-borne-illness-fears-prompt-free-insect-repellent-wa/105398966",
        "title": "Warning from widow of man killed by mosquito-borne illness in WA",
        "publish_date": "Tue, 10 Jun 2025 23:38:10 +0000",
        "category": "lifestyle",
        "authors": [],
        "text": "When Sonia Blackaby set out caravanning with her husband across Western Australia's far north, she never thought a mosquito bite would make it their last trip together.\n\nTravelling from Tom Price, 1,450 kilometres north-east of Perth, to the Kimberley two years ago, her husband, Peter, contracted a rare mosquito-borne illness.\n\n\"We returned home and, within a week of that, he started showing symptoms, which I thought at the beginning was a stroke,\" she said.\n\nPeter Blackaby, pictured with wife Sonia, died after contracting Murray Valley encephalitis. (Supplied)\n\nPeter Blackaby had contracted Murray Valley encephalitis (MVE), a rare but serious mosquito-borne disease that can cause brain inflammation, coma and death.\n\nThere is no treatment or vaccine for it.\n\nMr Blackaby was flown to Royal Perth Hospital for treatment, but his condition worsened in the following hours.\n\n\"He went from showing signs [of life] to being in a coma, non-verbal, unresponsive, quadriplegic, and basically in a vegetative state,\" Ms Blackaby said.\n\n\" Eventually, my family and I made the decision to turn off his life support. \"\n\nGovernment to provide free repellent\n\nMs Blackaby's story struck a chord with the West Australian government, which is now offering free insect repellent kits to community groups in areas deemed at high risk of a mosquito-borne illness.\n\n\"So sporting clubs, caravan parks, other places in the community will always have insect repellent available,\" WA Health Minister Meredith Hammat said.\n\nMeredith Hammat says there have been 12 cases of MVE since 2023, five of which have been fatal. (ABC News: Charlie Mclean)\n\n\"There were 12 cases of Murray Valley encephalitis reported since 2023, and five of those have resulted in deaths.\n\n\"It is serious.\"\n\nRaising awareness\n\nPart of the reason Ms Blackaby is speaking out now is that she does not think the existing messaging about mosquito-borne illnesses is cutting through.\n\nFor years, the government has backed a campaign called \"Fight the Bite\".\n\nThe WA government has been running a campaign called \"Fight the Bite\" for years. (ABC News: Charlie Mclean)\n\nBut Ms Blackaby said most people she talked to had not heard of MVE.\n\n\"I still travel with my caravan and I make it my public duty to talk to people and ask if they've heard of MVE,\" she said.\n\n\"If I can stop one family from going through what my family went through, it's worth it.\"\n\nKimberley residents are reporting increased mosquito activity following recent rains. (Supplied: Broome Bird Observatory)\n\nMosquito plague\n\nThe initiative comes as Kimberley residents report increased mosquito activity following recent unseasonal rains.\n\nMosquito traps detected MVE in the West Kimberley earlier this month.\n\nMurray Valley encephalitis is a rare but serious illness carried by mosquitoes. (ABC News)\n\nBroome resident Robyn Maher said the mosquitoes were \"out in force\".\n\n\"On this morning's walk through Minyirr I had a black T-shirt on, and my husband said, 'Your whole back is covered in mosquitoes,'\" she said.\n\nMs Maher said free mosquito repellent was a \"really good idea\".\n\n\"It's ridiculously expensive. Not everyone can afford food, let alone a can of Aerogard, so that's a really good initiative,\" she said.\n\nCalls to normalise applying repellent\n\nMs Blackaby said everyone living in high-risk mosquito regions like the Pilbara and Kimberley should be applying insect repellent as part of their daily routine.\n\n\"It just has to become ingrained a bit like 'slip, slop, slap' with sunscreen,\" she said.\n\nThe WA government is offering free insect repellent dispensers to community groups in high-risk areas. (ABC News: Charlie Mclean)\n\n\"It needs to become something that we're just aware of on the regular, not just a news article that pops up every now and again.\"\n\nThe government said it was planning a statewide rollout of the initiative next year.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-06-11/socceroos-vs-saudi-arabia-qualify-fifa-world-cup-resilience/105402090",
        "title": "Special Socceroos have tools to be 'bigger and better' at World Cup",
        "publish_date": "Tue, 10 Jun 2025 23:31:22 +0000",
        "category": "sports",
        "authors": [],
        "text": "Amid the euphoric scenes following the Socceroos' direct qualification for the 2026 FIFA World Cup, coach Tony Popovic allowed himself a smile.\n\nAnd my word, he's earned it!\n\nBut behind that smile lay a steely resolve — a clear sign this special Socceroos team is far from finished.\n\n\"We've done the first part, qualifying automatically,\" Popovic told Paramount+ at full-time of the Socceroos' come-from-behind 2-1 victory in Jeddah.\n\n\"Now, the next part is to be bigger and better at the World Cup.\"\n\nSocceroos reach FIFA World Cup with 2-1 win over Saudi Arabia Photo shows Mitch Duke and the Socceroos celebrate The Socceroos have qualified for the 2026 FIFA World Cup with a gritty 2-1 victory over Saudi Arabia in Jeddah.\n\nBetter may be subjective — personnel is unlikely to change dramatically in the next 12 months or so before the tournament — and in some regards, there is little to improve.\n\nWorld Cups are, of course, hard-won by some of the greatest names in world football with the sort of depth that Australian fans can only dream of.\n\nBut tournaments are not the places to be flashy.\n\nCharacter matters almost as much as skill.\n\nThe ability to respond to setbacks and bounce back from adversity is as prized as the mazy dribbling skills of Europe's best.\n\nGoal scorers Mitch Duke and Connor Metcalf both praised the character of the Socceroos in their post-match interviews, and it is that character that has seen them through to a sixth-successive finals.\n\nMitch Duke (right) scored the winner from Martin Boyle's free kick cross. (AP Photo)\n\n\"That's the mentality the boss has created within us, we didn't get fazed by the one-goal deficit and we bounced back,\" Duke said.\n\n\"This group is so special and so mentally tough,\" Metcalf added.\n\n\"It's hard to beat us.\n\nFive quick hits: Dazzling Duke, Mat's magnificence, and the red card that wasn't Photo shows SoccerQH Mitch Duke scored a goal and set one up, Mat Ryan pulled off a superb penalty save in his 100th Socceroos match, and there was mystery around a red card that wasn't.\n\n\"I think that's been a characteristic since the first day I arrived,\" added Popovic, who saw his charges come from a goal down in his first game in charge against China, hold Japan to a draw in his second, rescue a point from a goal down in Bahrain in his fourth, and then record back-to-back wins over two of Asia's biggest teams in Japan and Saudi Arabia.\n\n\"To show that character, resilience, to come back and win the game…\" he added.\n\n\"We've built a good foundation now.\"\n\nPopovic has every reason to be happy.\n\nHe is now eight games unbeaten since taking over the job, turning a floundering ship away from the troubled waters they found themselves in at the start of qualification.\n\nAll aboard the Socceroos World Cup party bus. (AP Photo)\n\nOf course, not many of these matches have been of the free-flowing style that some may prefer.\n\nIndeed, of the eight matches Popovic has presided over, just three have seen the Socceroos hold the majority of possession — both home and away victories against China and the 2-2 draw in Bahrain in November.\n\nAnd yet, only twice have the Socceroos allowed more shots on target than they have managed themselves: In the 1-1 draw against Japan in Saitama — Japan had three shots on target to Australia's zero — and in Wednesday's victory over Saudi Arabia, when the Green Falcons managed six shots on goal to Australia's three.\n\nIndeed, the Socceroos have had fewer shots in total than their opponents in five of their eight matches under Popovic (with one level).\n\nBut they've still not been beaten, their conversion rate is superb.\n\nAfter some wayward shooting in the first three matches under Popovic, when just six of the 32 shots the Socceroos had were on target for four goals, in the five matches since then, Australia has had 20 of its 35 shots on target and scored 12 goals.\n\nThe six shots on goal that they conceded against Saudi Arabia in Jeddah was the same number as the previous three games combined.\n\nIn short, the Socceroos are limiting guilt-edged chances for their opponents, and making the most of theirs. That's perfect tournament football.\n\nConnor Metcalfe (right) levelled for the Socceroos before half time. (Getty Images: Robert Cianflone)\n\nWhile the victory over Japan in Perth defined the very meaning of a smash and grab, this victory over the Saudis in the stifling humidity and heat of Jeddah was a triumph of planning and execution.\n\nSure, Saudi Arabia dominated possession, and territory, and had twice as many shots on target as Australia, but given they needed to win big, that was to be expected.\n\nThe Green Falcons needed goals, five to be exact, to knock Australia out of second spot on the table and steal the second direct qualification spot.\n\nAnd Popovic knew this — a resolute back five created a defensive shield that no manner of sprightly Saudi attacks could breach with the frequency they required, with Nashville midfielder Patrick Yazbek handed a first start to sit in front of that five in a defensive role to stymie the hosts' inventiveness.\n\nIn the end, Yazbek was simply one member of a four-man midfield that, without the ball, sat deep and added another rampart to the Roos defence.\n\nSaudi Arabia was not to be denied, the brilliant Salem Al-Dawsari creating magic and dragging the Green Falcons into the lead early enough in the piece to create a murmur of concern through the Socceroos ranks.\n\nConceding, given the situation, was not unexpected, but fighting back and taking the chances that came their way shows resilience and character in this team that proves it is capable of doing great things.\n\nMiloš Degenek celebrates Mat Ryan's save to deny Salem Al-Dawsari. (Getty Images: Yasser Bakhsh)\n\n\"It's exciting,\" Popovic said.\n\n\"We want to really get better, kick on and try and do something special at the World Cup.\n\n\" We wanna be a squad that's much better than we are now, and that's the expectation we should have. \"\n\nThat should not be beyond the realms of possibility.\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\nWith a solid foundation and a year of international windows for Popovic to trial new combinations without the pressure of needing wins, is another fairytale run in North America really beyond reach?\n\nThe Socceroos are likely to be written off by the rest of the world.\n\nBut as Japan and Saudi Arabia will tell them, this Socceroos team are far from being pushovers.\n\nNobody is suggesting that the Socceroos head to this bloated, 48-team World Cup among the favourites.\n\nBut football is a funny beast, and stranger things have happened, and few would relish the challenge of dismantling a defence that is likely to be bolstered by Harry Souttar's immense presence when he recovers from his Achilles tear.\n\nDare to dream? That's the whole point, isn't it?",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-06-11/western-sydney-international-airport-which-airlines-will-fly-in/105401932",
        "title": "First look inside Australia's newest international airport as issues remain",
        "publish_date": "Tue, 10 Jun 2025 23:18:53 +0000",
        "category": "finance",
        "authors": [],
        "text": "Despite Western Sydney International Airport (WSI) being close to completion, two obstacles remain, including just how many airline carriers are willing to fly into the precinct, 44 kilometres from the city's CBD.\n\nMajor construction is now complete, with the terminal at Badgerys Creek unveiled on Wednesday.\n\nWSI CEO Simon Hickey said the \"24-hour international gateway\" terminal would create \"significant economic opportunities for all of Greater Sydney\".\n\nThe airport itself is on track to open for domestic, international, and air cargo services in late 2026, though clarity on addressing the key drawbacks remain up in the air.\n\nThe new airport is due to open late next year. (Supplied: Trevor Mein)\n\nWill international airlines be enticed?\n\nSo far, only four airlines have confirmed their plans to operate out of WSI — two of those being Australia's Qantas and Jetstar.\n\nThe third, Singapore Airlines, announced their intention back in August 2024, and the fourth, Air New Zealand, was announced on Wednesday by Prime Minister Anthony Albanese.\n\nAir New Zealand confirmed it would not start flying into WSI until 2027 and would be dependent on \"when aircraft become available\".\n\nAt Sydney Airport in Mascot, over 50 airlines fly in and out, the vast majority being overseas carriers.\n\nOnly two international carriers have been announced so far for WSI. (Supplied: Multiplex)\n\nMr Hickey said conversations with \"a lot\" of airlines had taken place, but he would not be drawn on any finalities.\n\n\"We are gathering momentum each passing day,\" he said at WSI's unveiling.\n\nIndian media reported \"discussions\" had occurred with IndiGo and Air India, with Destination NSW's country manager for India saying an airport in Western Sydney would be ideal for \"a lot of the Indian community\".\n\nPublic transport conundrum continues\n\nA delayed Western Sydney Airport Metro Line is likely a thorn in the side of WSI's grand plans.\n\nThe NSW government had initially expressed a desire for the Metro to be ready in time for WSI's opening in late 2026. (Supplied: NSW Government)\n\nThe first tracks have been laid on this Metro line, but visitors to WSI won't be able to use this service until at least April 2027, as per Sydney Metro's annual report.\n\n\"Major projects like these are inherently complex and this project has faced impacts due to industrial relations and supply chain disruption,\" a Sydney Metro spokesperson said.\n\nAlternative transport options for passengers — such as \"plenty of parking\" — will be a focus in the early stages of the airport's opening.\n\n\"It is true that not everything will be operating on day one, but a lot of work has been done and considerable investment to ensure this airport is accessible,\" Mr Albanese said.\n\nAustralia's most 'Instagrammable' airport?\n\nDespite a delayed Metro line and a limit of confirmed airline carriers, the $5.3 billion investment in the airport's build is visible.\n\nAs Australia's first new greenfield international airport in more than 50 years, WSI's design is sustainability-focused, according to the architects behind the project.\n\nZaha Hadid Architects, based in London, and Australia's COX Architecture developed the initial design concepts of WSI. (Supplied: Trevor Mein)\n\nOver 6,000 solar panels are affixed to its roof to provide energy efficiency and renewable electricity in a bid to reduce the airport's carbon footprint.\n\nCollected rainfall on-site will also be recycled for use in the airport's bathrooms, irrigation systems and cooling towers.\n\nMr Hickey said the design had taken inspiration from \"iconic vistas\" around Western and Greater Sydney, including the Blue Mountains, and sandstone materials also sourced from the Central Coast.\n\nThe entrace to the terminal at Western Sydney Airport. (Supplied: Multiplex)\n\nWith construction mostly finalised, the fit-out of the terminal's retail precinct and airline lounges will take place closer to the airport's opening, said a WSI spokesperson, with commercial tenders contracts still to be finalised.\n\nWhen asked by 702 ABC Radio Sydney if WSI would be the most \"Instagrammable terminal in Australia\", he agreed.\n\n\"It's an exciting day for Western Sydney,\" he said.\n\nMr Hickey added: \"I've been to a lot of airports in Australia and this is by far the best-looking airport.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-06-11/queensland-sugarcane-harvest-underway-habana-mass/105400820",
        "title": "Tractor blessings signal start of north Queensland's cane harvest",
        "publish_date": "Tue, 10 Jun 2025 22:28:52 +0000",
        "category": "finance",
        "authors": [],
        "text": "Under the shade of a north Queensland mango tree, farmers and the Habana community gather for an annual harvest mass where it is not only people who are blessed.\n\nTractors and other farm equipment line up against a backdrop of stunning green cane fields as Catholic priest Andrew Hogan delivers the outdoor service.\n\nFather Hogan prays for the crop to deliver a good financial return and for the safety of those working in the sugar industry — on the land and in the mills.\n\nMass is held in Habana ahead of the cane harvest. (Supplied: Palmina Rae)\n\nHarvest mass has been a tradition in Habana, a rural community of about 1,000 people near Mackay, for more than 40 years.\n\nOrganising committee chair Laurence Bonaventura said it was the last chance for many farmers to relax before the end of the year.\n\n\"It will get very, very busy for them,\" he said.\n\n\" There'll be a lot of pressure on families to achieve what they've got to achieve in the harvest period, so it's a bit of a special day. \"\n\nTractors, machinery blessed\n\nFarmer Joseph Grech had been bringing his older tractor to be blessed for 40 years, but decided to \"give it a rest\" this year and brought his newer model.\n\nMr Grech said farming had changed a lot in his 54-year career, including the move from burning and cutting cane by hand to mechanised harvesting.\n\nHarvest mass has a special place in Joseph Grech's heart. (ABC Tropical North: Liam McNally)\n\nBut he said harvest mass had remained a constant.\n\n\"It has stayed the same because everything [in the mass] is perfection,\" he said.\n\n\" If I miss this, it's as if I've missed something very, very special because it really binds in my heart, and not only my heart but the heart of everybody around here. \"\n\nAbout 80 people attended this year's mass, which ended with the congregation and machinery being blessed by holy water.\n\nRural fire trucks, an ambulance, and other work vehicles were also included as an acknowledgement of those who kept the farming community safe.\n\nFather Andrew Hogan blesses parishioners with holy water. (ABC Tropical North: Liam McNally)\n\nHabana and Districts Progress Association secretary Palmina Rae said the expanded line-up reflected how much cane farming meant to the community.\n\n\"We wanted to gather everybody who's involved in the industry, that includes teachers, ambulance drivers, everybody is contributing to our local sugarcane industry,\" she said.\n\n\"It means a lot to me, it's a tradition, it's an opportunity for us to celebrate our faith but also to celebrate the sugar industry, which is a big part of the history in Habana.\"\n\nSymbols of the harvest are displayed on the altar. (ABC Tropical North: Liam McNally)\n\nReduced tonnage expected\n\nCanegrowers chair Owen Menkens said the industry was under pressure with a couple of years of less-than-ideal conditions in Australia's sugar industry.\n\nHe said the organisation expected 28.5 million tonnes of sugarcane to be harvested from 13 districts in Queensland.\n\nHe said the smaller-than-average crop was due to flooding in the Herbert region north of Townsville and about 1 million tonnes of cane being left in the paddock from last season.\n\n\"Last year was a pretty bad year,\" Mr Menkens said.\n\n\"We had some wet weather as well as some poor mill performance issues, and that's why we have a smaller crop this year.\"\n\nMany farmers were still harvesting into January this year, which was at the top of cane farmer Stephen Vella's mind as he received his blessing at harvest mass.\n\nSteven Vella and his granddaughter attend the mass. (ABC Tropical North: Liam McNally)\n\n\"We're praying that the mills have a good run, that we can get the cane off within that 23 [or] 24-week period,\" Mr Vella said.\n\n\"And just for once to sit and enjoy the last couple of weeks before Christmas instead of having to harvest cane and do farm chores.\"\n\nMore mills to fire up\n\nMackay Sugar is Australia's second-largest raw sugar producer with almost 1,300 mainly family-owned farms supplying its three mills.\n\nLast year, the company contributed about 800,000 tonnes of raw sugar to the 4 million tonnes produced in Queensland.\n\nThe first bin of cane was tipped at Farleigh Mill on June 10, with Racecourse and Marian Mill to fire up in the coming week.\n\nThe crush is already underway in Far North Queensland on the Tablelands, Tully, the Burdekin, Sarina, and Bundaberg.\n\nThe Herbert River and Isis mills are expected to start crushing within the next two weeks.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-06-11/five-quick-hits-saudi-arabia-socceroos-world-cup-qualification/105401934",
        "title": "Five quick hits: Dazzling Duke, Mat's magnificence, and the red card that wasn't",
        "publish_date": "Tue, 10 Jun 2025 22:03:21 +0000",
        "category": "sports",
        "authors": [],
        "text": "The Socceroos have done it, beating Saudi Arabia 2-1 in Jeddah to confirm their spot at the 2026 FIFA World Cup finals.\n\nOnly needing to avoid a massive defeat, the Socceroos went behind early, but fought back to win a wild game played out in 31-degree temperatures in the Middle East.\n\nHere are the five quick hits from the King Abdullah Sports City stadium.\n\n1. Saudi Arabia score opener after bad Boyle miss\n\nThe Socceroos were always going to be under pressure in Jeddah, meaning that they would need to take any chance that came their way.\n\nThat first chance came in the 18th minute, when Martin Boyle was played in on the edge of the penalty area after Hassan Kadesh gave the ball away cheaply.\n\nBoyle, who has scored 11 Premiership goals for Hibernian this season, should have done better, flashing his shot wide of the far post.\n\nAbdulrahman Alobud scored the opening goal to give Saudi Arabia hope. (Getty Images: Robert Cianflone)\n\nLess than a minute later, Saudi Arabia had the lead.\n\nSalem Al-Dawsari worked his way into the box with a scything run and then his low cross was spun into the net by Abdulrahman Al-Obud on the line.\n\nThe Socceroos appealed in vain for offside but the goal stood and the pressure mounted.\n\n2. Duke's magic pass and Metcalfe's maiden goal\n\nThere is never a bad time to score your first goal for your country, but there sure is a great time.\n\nWith Saudi Arabia pressing, the counterattack was always going to be the Socceroos' best chance of breaking the shackles, and so it proved when a long ball was gathered by Mitch Duke out on the left touchline.\n\nHe held the ball up brilliantly before flicking it back inside perfectly into the path of the rampaging St Pauli midfielder Connor Metcalfe, who hammered the ball into the ground and over the despairing, flailing arms of the Saudi keeper to score his first goal in green and gold.\n\nGiven injury has limited the 25-year-old to just 10 Bundesliga appearances this season, he may have felt a moment like this would be a long way away.\n\nBut his composure under pressure allowed the Socceroos to extinguish any hope the Saudis had of the dramatic goal-fest victory they so desperately needed.\n\n3. Duke nails his moment\n\nMitch Duke probably wasn't going to be in this squad, only being brought in when Mat Leckie went down with an injury.\n\nBut now he's here, boy did he make his moment count.\n\nThe assist for the Socceroos' first goal was special, but the header for the winner was much more in his wheelhouse.\n\nA perfect delivery, a perfect leap, and the perfect sound of silence as the ball bulged the back of the net and the Jeddah crowd felt their dreams of direct World Cup progression evaporate.\n\nDuke's goal makes him just the sixth Socceroo to score a goal and provide an assist in a match outside of Australia since 2015.\n\n4. The send-off that wasn't\n\nOnce again it was the Socceroos counterattack that paid off, leaving Saudi Arabia desperately exposed at the back.\n\nDuke and Boyle combined up top to latch onto a through ball only for Boyle to hit the deck.\n\nAli Majrashi was the closest player and referee Abdulrahman Al Jassim did not hesitate in reaching for the red card.\n\nAli Majrashi was sent off, then he wasn't. (Getty Images: Yasser Bakhsh)\n\nExcept, that wasn't quite it.\n\nAl Jassim was called over to the monitor after a lengthy VAR check and saw that there was barely any contact on Boyle and so the red card was rescinded.\n\nBoyle, by the way, was already on a yellow card and may have momentarily been worried that he could have been sent off for simulation.\n\nHowever, VAR cannot rule on yellow card incidents so he remained on the pitch, albeit a little miffed that he had not been fouled.\n\n5. Mat Ryan's star turn\n\nMat Ryan admitted that he felt his career in green and gold may have been over after he was overlooked for Tony Popovic's first couple of matches in charge.\n\nA torrid time in club-land meant that Ryan, despite his experience and expertise, was no certainty to regain his spot.\n\nBut however temporary form is, class remains permanent and by pulling on the gloves in Jeddah, the ex-Brighton man made his 100th appearance for the Socceroos.\n\nMiloš Degenek celebrates Mat Ryan's save to deny Salem Al-Dawsari. (Getty Images: Yasser Bakhsh)\n\nQualifying for the World Cup may be enough to remember such a milestone match, but that was not going to be enough for the scriptwriters.\n\nWhen Salem Al-Dawsari hit the deck under Jason Geria's challenge, Ryan was to be called upon to preserve his country's lead.\n\nHe did not disappoint.\n\nA good penalty, struck low to Ryan's left, was brilliantly saved by the Socceroos veteran to compound the Saudi's woes and enshrine Ryan into legend.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-06-11/asx-markets-business-news-live-updates/105401972",
        "title": "Live: ASX edges up in muted reaction to US-China 'handshake deal'",
        "publish_date": "Tue, 10 Jun 2025 21:20:55 +0000",
        "category": "finance",
        "authors": [
            "Stephanie Chalmers",
            "Gareth Hutchens",
            "David Taylor",
            "Michael Janda"
        ],
        "text": "Trade talks between China and the US appear to be progressing after the two countries met for a second day of talks in London.\n\nUS and Chinese officials have announced a \"framework\" to restore the flow of critical goods, like rare earths and magnets, between them.\n\nIn seeking to de-escalate trade tensions, the two countries have agreed to a preliminary deal on how to implement the consensus the two sides reached in Geneva.\n\nUS negotiators said they \"absolutely expect\" that issues around shipments of rare earth minerals and magnets will be resolved with the framework implementation.\n\nBut the global financial markets reaction has so far been muted.\n\nInTouch Capital Markets Senior FX Analyst Sean Callow says the announcement from the two countries has largely already been priced in by financial markets.\n\n\"The market reaction to the US-China trade announcements appears to be a classic 'buy the rumour, sell the fact',\" he said. \"Equity markets were notably buoyant in Asia-Pacific yesterday and again in the US, so they were priced for good news. \"We await details, but the headlines so far suggest that the London meetings appear to have achieved little more than cooling the temperature of US-China relations and implementing what was supposed to have been agreed almost a month ago in Geneva. \"The offshore Chinese yuan popped higher briefly and US equity futures are now slipping, but overall a very muted to slightly negative reaction.\"\n\nThe Australian dollar is little changed following the news buying just over 65 US cents.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-06-11/power-pain-sends-businesses-to-the-wall-amid-renewables-warning/105400032",
        "title": "Once called an energy paradise, WA's grid may be sliding into crisis",
        "publish_date": "Tue, 10 Jun 2025 21:18:53 +0000",
        "category": "finance",
        "authors": [],
        "text": "Western Australia's biggest electricity system could be sliding towards a crisis as customers not shielded by taxpayer subsidies are hit by eye-watering price rises.\n\nBusinesses have reported electricity price hikes of up to 50 per cent or more, prompting warnings some are scaling back their operations or could even go under in the face of power bills costing thousands of dollars more a month.\n\nIt has led to questions over whether the WA government can meet its ambitious plans of shutting its two remaining coal-fired generators within five years.\n\nPrice hike despite solar\n\nNeil Handasyde, an Albany strawberry grower who branched into food processing and hospitality, said the situation was a concern.\n\nIn a bid to diversify, Neil Handasyde has branched into food processing, a power-hungry game. (ABC News: Tyne Logan)\n\nMr Handasyde said his businesses had never needed more power but the cost of that energy was starting to hurt.\n\nDespite efforts by some businesses to offset the costs, power price rises have been painful. (Supplied)\n\nHe has gone to extreme lengths to cushion the blow, including installing a vast array of solar panels and batteries at a cost of $350,000.\n\nBut his power bills have still \"gone through the roof in the last 18 months\".\n\n\"It's been a massive jump. Thousands … thousands more a month,\" he said.\n\nOver the past 18 months, Neil Handasyde’s power costs have leapt about 50 per cent. (ABC News: Tyne Logan)\n\nMr Handasyde is not alone.\n\nUnder WA's energy rules, small-scale energy users such as householders and some small businesses are shielded from the full cost of providing power by state government subsidies.\n\nBut that still leaves most businesses in the state fully exposed to the whims of the state's biggest electricity market, which spans the relatively populous south-western corner of the continent.\n\nThese customers — those using more than 50 megawatt hours of electricity a year — are what are known as \"contestable\" customers who can shop around between energy providers.\n\nPower prices are hurting local businesses in Western Australia. ( ABC News: Andrew O'Connor )\n\nEnergy consultant Etienne Quayle is a veteran of the energy system and his brokerage firm represents more than 1,500 clients across the country.\n\nMr Quayle said contestable customers usually benefited from the power of being able to choose where they bought their electricity.\n\nBut the sheer scale of the price rises in the market now means few — if any — customers would be feeling the benefit.\n\nEtienne Quayle is the director of Electrical Consultancy WA. (ABC News: Daniel Mercer)\n\n\"From our biggest client to our smallest, we do not see decreases anymore, or savings,\" he said.\n\n\"We've changed our discussions with a client from, 'this is how much we can save you', to, 'this is how much we've mitigated the increase.'\"\n\nCoal and gas price jump\n\nAt the heart of the upheaval is the rising cost of generating and transporting electricity.\n\nMuch of that comes thanks to higher coal and gas prices, but experts have also pointed to a sharp rise in the costs of poles and wires amid interest rate hikes and capital spending.\n\nDoubts raised over WA's coal phase-out Photo shows Aerial picture of a coal fired power station in a regional area. WA Labor has been talking up the clean energy transition ahead of the state election.\n\nOn top of this, Mr Quayle noted significant pressures from services and new infrastructure such as batteries needed to back up the power system.\n\nAs part of a shake-up of the market that came into effect in late 2023, these costs exploded and although they have since eased, they remain significant.\n\nHe said these services and new assets were the insurance premium WA paid as a stand-alone grid that could not turn to anyone else for help.\n\nAdding to the pressure are WA government plans to get out of coal by the end of the decade.\n\nThe coal-fired Muja Power Station in Collie is set to be taken offline by 2030. (ABC South West: Anthony Pancia)\n\nCoal still accounts for almost 30 per cent of the power produced in the state's biggest grid, with the state-owned Collie and Muja among the last three remaining coal plants in the west.\n\nThrough a spokesman, new WA Energy Minister Amber-Jade Sanderson acknowledged medium and large users of electricity were \"directly\" affected by the changes in the electricity market and urged contestable customers to shop around for the best deal possible.\n\n\"The Cook government is delivering on a sensible, managed transition to a greater use of renewables and is committed to getting out of coal by 2030, faster than any other state,\" the spokesman said.\n\nNew capacity shortfall\n\nShadow Energy Minister Steve Thomas is not so charitable or optimistic.\n\nDr Thomas accused the government of mishandling the energy system, pointing to the rising costs across the board.\n\nShadow Energy Minister Steve Thomas says the size of power price rises could imperil some businesses. (ABC News: Daniel Mercer)\n\nHe said the government's biggest failure was its inability to build enough new capacity to replace retiring coal plants.\n\n\"If you look at their transition plan, there's not enough generation in the system,\" Dr Thomas said.\n\n\"Whether you want it in renewables or gas, it's still insufficient.\"\n\nWorse still, Dr Thomas said the situation was pushing some businesses to the wall.\n\nNeil Handasyde says power is becoming ever more central to everything his business does. (ABC News: Tyne Logan)\n\nMr Handasyde sees little relief in sight.\n\n\"There's certainly no cheaper power coming our way any time soon, if ever,\" he said.",
        "source": "ABC"
    },
    {
        "url": "https://www.smh.com.au/culture/books/a-dark-satire-of-girlboss-feminism-and-the-cult-of-beauty-20250530-p5m3ic.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "A dark satire of girlboss feminism and the cult of beauty",
        "publish_date": "Wed, 11 Jun 2025 12:00:00 +1000",
        "category": "finance",
        "authors": [
            "Jessie Tu"
        ],
        "text": "FICTION\n\nRytuał\n\nChloe Elisabeth Wilson\n\nPenguin, $34.99\n\nDespite our best efforts, the pursuit of beauty for women feels like an inescapable project of distraction. Case in point: we’re not entirely sure if the overpriced lash serum will deliver on its promise of longer, lusher lashes, but we hand over money anyway because, well, we want to be beautiful.\n\nWe crave the power that beauty holds. We’re comfortably deluded in contributing to the global industry that’s worth $650 billion a year.\n\nBeing beautiful is a reliable religion. Or rather, wanting to be included in the exclusive club of Beautiful Women can feel like an ungovernable lust. In Chloe Elisabeth Wilson’s debut novel, Rytuał, a dark, suspenseful yet funny book traces the obsessions and pitfalls of a group of young, listless Melburnian women vying for power under a beguiling boss.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/culture/books/i-know-what-you-read-last-summer-and-it-was-probably-horror-20250530-p5m3md.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "I know what you read last summer (and it was probably horror)",
        "publish_date": "Wed, 11 Jun 2025 12:00:00 +1000",
        "category": "entertainment",
        "authors": [
            "Jordan Prosser"
        ],
        "text": "Save Log in , register or subscribe to save articles for later. Save articles for later Add articles to your saved list and come back to them any time. Got it Normal text size Larger text size Very large text size In the mid-2010s, moviegoers embraced the so-called “elevated” horror boom, with films such as The Babadook, Get Out, Midsommar and The Witch at the vanguard – low-budget, high-concept genre fare that used classic horror tropes to probe contemporary societal ills like toxic relationships, racism and mental illness. (The “elevated” label was a bit of clever rebranding, like slapping an “organic” sticker on a hamburger; these movies function the same way great horror always has – you just feel a little less dirty about enjoying them.) Now it seems it’s literature’s turn. In 2023, there was a record number of new horror books both published and sold, and two years on, the trend shows little sign of slowing. Literary agents are reporting submission piles filling up with more tales of the weird and eerie, from eco-horror to folk horror to the aptly named “femgore” – hyper-violent, female-centric body horror. In the last year alone – and this is but a tiny sliver of what’s on offer – we’ve had Gretchen Felker-Martin’s Cuckoo, which made the very real horrors of gay conversion camps manifest in a grotesque body-snatching teen epic. Rachel Harrison’s So Thirsty took a big, bloody bite out of 21st-century female friendship with its ultra-gory vampire antics. The Lamb, Lucy Rose’s fairytale debut, told the touching story a young girl caring for her mother … by bringing her stray hikers to satiate her cannibalistic urge for human flesh (pair it with Monika Kim’s The Eyes are the Best Part for a stomach-churning family-sized feast). And 50 years after the publication of his first novel, Carrie, horror stalwart Stephen King released his latest short story anthology You Like It Darker (just months after a brand-new novel, Holly – also featuring cannibals). The late horror director George A. Romero, whose horror novel has been – fittingly – published posthumously. Credit: AP King isn’t the only elder statesman jostling for shelf space alongside the BookTok generation. George A. Romero, the man responsible for our modern conception of zombies, with films like The Night of the Living Dead and Dawn of the Dead, released his final novel earlier this year, somewhat fittingly from beyond the grave.\n\nAdvertisement\n\nCo-written by Daniel Kraus, who discovered the incomplete manuscript in an archive box at the University of Pittsburgh Library in 2019, Pay the Piper is a sweaty, cosmic eco-horror set in the muggy depths of the Louisiana bayou, where a nine-year-old girl named Pontiac and a rag-tag group of townsfolk from her home of Alligator Point come up against an ancient, vengeful evil that’s been lurking in the swamp and preying on children. While Romero will forever be remembered primarily as an orchestrator of gnarly kills and ground-breaking special effects, his zombie movies always had more than merely brains on the brain. His seminal Night of the Living Dead is often read as a critique of racial tensions in 1960s America; it features a Black protagonist (played by Duane Jones) who survives an undead horde only to be shot by a white sheriff. The 1978 follow-up, Dawn of the Dead, set entirely in a shopping mall, can only be seen as a satirical indictment of rampant consumerism. Pay the Piper continues this tradition of smuggling hefty themes into seemingly straightforward horror schtick. Young Pontiac’s home is under threat from a nefarious character known only as The Oil Man – a phantom-like stand-in for the entire fossil fuel industry – as well as The Piper itself, an aquatic Lovecraftian creature seeking restitution for the thousands of slaves slaughtered and dumped in its waters by the infamous Pirates Lafitte in the 1800s. Romero and Kraus’ book mutates from gooey Southern Gothic to a full-throated treatise on human cruelty and environmental calamity; it’s spooky, stirring Cajun cli-fi with a healthy dose of tentacles. YA author Margot McGovern has long been a fan of slasher and horror films. Closer to home, this March saw the release of Margot McGovern’s riveting supernatural YA slasher This Stays Between Us. McGovern’s second book boasts a little bit of everything: early 2000s nostalgia, late-night seances, teenage crushes, buried secrets and a predatory entity known only as Smiling Jack that hunts its four young female protagonists as they try to survive year 11 camp in a remote, abandoned mining town. McGovern’s first book, Neverland, released in 2018, hewed much closer to magical realism – but a life-long love of horror helped inspire her sophomore stab. “I’ve always been a huge horror fan,” says McGovern. “I read and watched a lot growing up, but there wasn’t a lot of Australian horror at that time. Most of the movies came from the US. And with horror books, in the ’90s it felt like you had R.L. Stine and then there was this huge gap before you jumped to Stephen King and Clive Barker.”\n\nAdvertisement\n\nTeen horror films filled that gap for McGovern. “I always knew I wanted to write a book that was set here in Australia and evoked the Australian landscape and personality, but embodied all the fun of a late-90s slasher,” she says. “Kevin Williamson’s screenplays were a huge influence on me. I love Scream and I Know What You Did Last Summer and Teaching Mrs. Tingle – even movies like The Craft.” A scene from classic 90s slasher film I Know What You Did Last Summer. Credit: Amazon Prime Of course, the defining feature of all these movies – and many of the books already mentioned – is teenagers. In horror, teens are often the heroes, the hapless victims and the target audience all at once. “Horror occupies this really interesting liminal space for teenagers,” McGovern says of her passion for writing YA. “It gives you that last little bit of make-believe. “It offers a step up into the adult world, where things can be genuinely terrifying and violent. When you’re 13 or 14, you feel like things are out of your control – you’re going through this huge transition, you’re figuring out who you are, your body’s changing, all the rules are changing! – and horror not only explores that, but gives you a way to take back some power and agency.” Perhaps that explains our present-day horror boom, then. We’re all of us teenagers in a world that feels increasingly out of control – but instead of regressing into childhood and escaping into all-out fantasy, we’re ready to confront our fears; to look the monster under the bed, or the creature in the swamp, or the thing in the mirror dead in the eye. “Horror has always responded to what’s happening in the culture,” McGovern says. “I think that’s part of the reason why it’s making such a comeback now. In times of uncertainty and upheaval, horror offers a set of familiar tropes that lets you approach your darkest fears in an almost comforting way.”\n\nAdvertisement",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/culture/books/a-terrifying-tour-of-silicon-valley-s-deluded-plans-for-a-techno-utopia-20250609-p5m5ym.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "A terrifying tour of Silicon Valley’s deluded plans for a techno-utopia",
        "publish_date": "Wed, 11 Jun 2025 12:00:00 +1000",
        "category": "finance",
        "authors": [
            "Pat Sheil"
        ],
        "text": "But to hear Elon Musk tell it, his Starship and its successors will soon be the workhorses of an interplanetary fleet that will take humans to Mars. And not just a few intrepid Apollo-style explorers collecting rocks and taking pictures, mind you. Musk and his disciples want to colonise the red planet, and by that, he means setting up an entire, self-sufficient civilisation there.\n\nAsk a deckhand on a fishing trawler in the Gulf of Mexico what he saw, when yet another doomed Space X Starship detonated 10 kilometres above his head, and these are not words he would use.\n\nIn commercial space flight PR jargon, a catastrophic launch failure is routinely glossed over with seemingly innocuous explanations. The second stage booster did not “explode, destroying millions of dollars’ worth of engines and several satellites”. No, it “underwent a rapid unplanned disassembly”, the results of which were “mission sub-optimal”.\n\nAdam Becker’s marvellous “disassembly” of Musk’s ludicrous fantasy is neither unplanned nor sub-optimal. Subtitled AI Overlords, Space Empires, and Silicon Valley’s Crusade to Control the Fate of Humanity, More Everything Forever gives a trawler deckhand’s eye view of what awaits us, should a deluded cabal of tech billionaires somehow make their dreams come true.\n\nElon Musk brandishing a chainsaw at a pro-Trump conference earlier this year. Credit: AP\n\nThe paving stones of these roads to hell are, seductively as ever, presented by advocates as nothing more sinister than the greatest good for the greatest number, and history is littered with the wreckage of such beneficent intentions.\n\nAnd so it is that Becker begins his descent into the AI underworld in the seemingly harmless realm of EA, or “effective altruism”; the notion that it is incumbent on people with wealth to share it around, and so help those less fortunate. The catch here is the E before the A, and what began as a fairly harmless, if occasionally wacky, crusade in the minds of philosophers like Peter Singer can, and did, come utterly unhinged when the brutal logic of algorithms is used to maximise the “effectiveness” of altruism. Particularly in the hands of the likes of cryptocurrency lunatics such as Sam Bankman-Fried, and the deluded Scottish philosopher William MacAskill.\n\nBankman-Fried was very keen on EA, and he did give away a lot of money, but as most of it belonged to other people, he was convicted of fraud on a titanic scale in 2023 and consigned to the hoosegow for 25 years. But 25 years is a millisecond to MacAskill, an advocate of “longtermism”, a clumsy word which means that in order to ensure the greatest good for the greatest number, it’s clear (to longtermists, anyway) that we need a lot more people to make happy. More people, indeed, than Earth’s ecology could ever support.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/victoria/two-hour-delays-after-11-vehicle-smash-closes-princes-freeway-20250611-p5m6gx.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Princes Freeway crash: Hours-long delays continue after road damage causes 11-vehicle collision",
        "publish_date": "Wed, 11 Jun 2025 11:58:25 +1000",
        "category": "finance",
        "authors": [
            "Alexander Darling"
        ],
        "text": "Surface damage on the Princes Freeway in Melbourne’s outer west caused multiple crashes involving a truck and up to 10 cars on Wednesday morning, closing the busy road for hours.\n\nTwo of the three northbound lanes remain closed, and motorists trying to get from Geelong to Melbourne still face traffic delays of more than two hours.\n\nMotorists are being diverted through Werribee and Wyndham Vale, where there are also reports of traffic jams.\n\nAll northbound lanes of the road were closed for more than four hours after a series of crashes at about 4.20am.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/rugby-union/appetite-for-destruction-how-mum-s-kitchen-put-suaalii-back-on-track-to-tame-lions-20250611-p5m6h5.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Appetite for destruction: How mum’s kitchen put Suaalii back on track to tame Lions",
        "publish_date": "Wed, 11 Jun 2025 11:57:52 +1000",
        "category": "sports",
        "authors": [
            "Iain Payten"
        ],
        "text": "Forget the $1.6 million pay cheque. It’s a mum’s humble home cooking that could prove a more valuable factor in Joseph-Aukuso Suaalii leading the Wallabies to victory over the British and Irish Lions next month.\n\nAfter a 12-year wait, the highly anticipated Lions tour is now just weeks away and Suaalii joined fellow Wallabies Angus Bell and Andrew Kellaway at Taronga Zoo on Wednesday to visit some real lions and promote the blockbuster series.\n\nThe smile on Suaalii’s face will be a welcome sight for Wallabies fans – and coach Joe Schmidt – after the star recruit suffered a broken jaw four weeks ago, throwing his involvement into doubt.\n\nBut after surgery and a rehab period that involved wearing a protective face mask, Suaalii says he is back to full health and will be ready to take on Fiji early next month, and then the Lions in the main show later in July.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/business/markets/has-trump-created-an-opportunity-for-the-euro-to-displace-the-us-dollar-20250611-p5m6hh.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Has Trump created an opportunity for the euro to displace the US dollar?",
        "publish_date": "Wed, 11 Jun 2025 11:57:30 +1000",
        "category": "finance",
        "authors": [
            "Stephen Bartholomeusz"
        ],
        "text": "Others, conscious that the US relies on foreign capital inflows to fund its yawning (and rapidly growing) government deficits and debt and enable the government and US citizens to live beyond their means, won’t view the apparent crack in the value of the dollar and the US markets’ status as the world’s safe haven quite as positively. In the near term, the weaker US dollar also means the inflationary impacts in the US of Trump’s trade war on the rest of the world will be exaggerated. A strong dollar, by making imports cheap in US dollar term, would muffle the impact on inflation. ‘European leaders have recognised the window of opportunity opened by America’s self-destructive trade policies.’ The likely effects of Trump’s war is reflected in this week’s downgrading of the outlook for global and US growth by the World Bank, which sees global growth slowing from 2.8 per cent last year to 2.3 per cent and growth in the US economy halving from 2.8 per cent to 1.4 per cent. That outlook, if it eventuates, would provide even less reason to invest in the US and would result in an even greater reduction in demand for US dollars.\n\nDoes that provide an opportunity for the euro? Perhaps, albeit not one that could be easily or quickly realised. The dollar has reined supreme as the world’s reserve currency in the post-war era and still does. Even though the degree of dominance has been waning in recent years, it still accounts for about 58 per cent of central bank reserves – it was above 70 per cent in the early years of this century and was still above 60 per cent five years ago – and about 55 per cent of trade invoicing is denominated in dollars. The US dollar has depreciated about 10 per cent this year. Credit: Bloomberg The euro ranks second on both counts, with a 30 per cent or so share of reserves and a similar share of trade financing.\n\nThe challenge for the Europeans, if they want to challenge the dollar’s status, is that, while they might have the “next best” currency, they lack some of the foundations that would make it the reserve currency. Loading They do have a floating exchange rate, no capital controls, an independent and respected central bank and an independent and respected judicial system. They don’t have deep and liquid capital markets nor a single economy that is growing consistently and strongly, nor do they have current account deficits to expand the supply of euros – the European Union consistently runs current account surpluses (and hence is a major target for Trump’s tariffs). The European capital markets are fragmented and shallow – European companies rely on banks rather than markets as their primary source of funding – and the condition of the underlying economies varies considerably.\n\nThe closest thing the EU has to a US Treasury bond is a Germany bund but, where the US Treasury market has about $US28 trillion ($43 trillion) of securities on issue, the market for bunds is only about €1.8 trillion (about $3.2 trillion). That market, thanks to the historic decision to reform the country’s “debt brake” in order to use debt-financing for what might be a €600 billion increase in military spending, will grow, but it would still remain small relative to the Treasury market. Loading What could the EU do to create a deeper bond market? It could issue eurobonds, or debt raised on behalf of all its members and backed by all their economies. It has toyed with that idea for decades and, indeed, created a eurobond facility of up to €800 billion to help member countries recover from the pandemic, although those bonds are supposed to progressively mature and disappear by 2058.\n\nGermany has historically been opposed to the issuance of collective EU debt. It’s strict fiscal discipline means it can borrow more cheaply than other EU members and pay lower interest rates on its debt. With eurobonds, it would pay more and effectively be subsidising the rest of the EU. The prize for the EU as a whole – a greater share of world reserves, a more stable currency in stressful times, cheaper funding generally and therefore greater economic growth and the geopolitical benefits from having a reserve currency – is, however, worth striving for. The EU could do more trade in euros – it buys a lot of energy but pays for it almost exclusively in US dollars, for instance – it could issue a digital euro to facilitate global transactions, and it could integrate its economies and policies more deeply. While the Europeans have the “next best” currency, they lack some of the foundations that would make it THE reserve currency. Credit: AP It could also do as the US Federal Reserve Board has done in financial crises, and create permanent swap lines with its major trading partners to provide euro liquidity in moment of stress. That would bolster confidence in the currency.\n\nIt is improbable that the euro could displace the dollar as the world’s reserve currency in anything other than the truly long term. Loading It could, however, increase its share of global reserves and transactions and share some of the dollar’s “exorbitant privilege” – the ability to borrow cheaply without any real limits, the haven status in a crisis, the ability, if they ever transpired, to run trade deficits without any fear of a balance of payments crisis, and, above all, the enhanced geopolitical authority the EU has always sought. European leaders have recognised the window of opportunity opened by America’s self-destructive trade policies – it’s been a growing topic of conversation in Europe since Trump’s “Liberation Day” tariffs announcement – but have also acknowledged the complexities and obstacles to taking advantage of it. Still, small but important steps could be taken, with eurobond issuance at the forefront and, with the EU members committed to ramping up their defence spending in response to Russia’s invasion of Ukraine, this could be an instance where, thanks to Trump and Vladimir Putin, opportunity and need start to converge.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/australia-news-live-australia-sanctions-israeli-ministers-trump-vows-heavy-force-against-protesters-20250611-p5m6gi.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Australia news LIVE: Curfew imposed on LA as Trump calls protesters ‘animals’; Israeli ministers sanctioned by Australia, US allies",
        "publish_date": "Wed, 11 Jun 2025 11:54:10 +1000",
        "category": "finance",
        "authors": [
            "Amber Schultz"
        ],
        "text": "Loading\n\nPrime Minister Anthony Albanese will, from next month, be paid more than Donald Trump after the Remuneration Tribunal boosted federal politicians’ pay by 2.4 per cent.\n\nThe decision, which takes effect on July 1, lifts Albanese’s salary from $607,500 to $622,071.\n\nThat means he will now overtake Trump, who is paid US$400,000 ($614,175) for his presidential duties.\n\nThe pay rise, revealed today, is lower than the 3.5 per cent increase granted by the Fair Work Commission (FWC) for minimum wage earners earlier this month.\n\nIn its justification, the tribunal said it had taken account of economic conditions, past and projected movements in pay in the private and public sectors, and the FWC’s decision.\n\n“This adjustment reflects a measured approach, balancing the need for restraint given economic conditions with the recognition of the upward pressure on household costs since the Tribunal’s 2024 review,” it said.\n\nTreasurer Jim Chalmers’ salary will hit $448,609 while Opposition Leader Sussan Ley’s pay will rise from the $432,253 figure previously received by her predecessor Peter Dutton, to $442,627.\n\nPoliticians who do not hold senior positions, will see their pay reach $239,258.\n\nMPs will sit in the House of Representatives for fewer days this year than any other in the past two decades, spending just 40 days this year passing laws. That’s two weeks less than the average of 48 sitting days during previous election years.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/world/asia/the-us-and-china-thrashed-out-their-trade-fight-for-20-hours-here-s-what-they-agreed-to-20250611-p5m6j3.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "The US and China thrashed out their trade fight for 20 hours. Here’s what they agreed to",
        "publish_date": "Wed, 11 Jun 2025 11:48:26 +1000",
        "category": "finance",
        "authors": [
            "Lisa Visentin"
        ],
        "text": "Singapore: US officials said Chinese restrictions on the export of critical rare earth minerals and magnets had been resolved under a preliminary deal to resurrect a fragile trade truce struck in Geneva last month.\n\nEmerging from two days of intense discussions in London, US and Chinese negotiators said they had reached a new framework committing to the original trade deal struck on May 12, which almost unravelled in a dispute over China’s export curbs on rare earths and US controls on technology sales.\n\nUS Treasury Secretary Scott Bessent, second right, departs following trade talks at Lancaster House in London. Credit: Bloomberg\n\nThe new agreement still needs to be signed off by both US President Donald Trump and Chinese President Xi Jinping.\n\nBoth sides offered few concrete details about what had been brokered over almost 20 hours of discussions.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/culture/books/two-journalists-an-eclectic-restaurant-and-taylor-swift-inside-the-making-of-jac-maley-s-new-book-20250609-p5m5wz.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Two journalists, an eclectic restaurant and Taylor Swift: Inside the making of Jac Maley’s new book",
        "publish_date": "Wed, 11 Jun 2025 11:45:00 +1000",
        "category": "finance",
        "authors": [
            "Melanie Kembrey"
        ],
        "text": "Save Log in , register or subscribe to save articles for later. Save articles for later Add articles to your saved list and come back to them any time. Got it Normal text size Larger text size Very large text size Lunch begins with an editorial intervention. “I want to say, for the record,” Jacqueline Maley – ever the journalist – announces. “That this was on my vision board before Tay Tay came. I was so on the zeitgeist.” We’re dining at Pellegrino 2000, tucked inside a historic terrace in Surry Hills, where the vibe is old-school Italian with a wink. Chianti bottles sit like trophies, tomato tins masquerade as rustic decor, and ropes of dried herbs and spices dangle above the bar. An eccentric collection of framed artwork lines the walls – including an image of the Michelin Man, beaming over the room like an ironic deity, blessing the carb-loading faithful below. It’s theatrical, yet charming. The perfect setting for a pop star – or, in Maley’s case, her second novel, Lonely Mouth. Long before Taylor Swift and her gal pal Sabrina Carpenter turned the restaurant into pop culture real estate when they spent the first night of their Eras and Sydney Zoo tour here, Maley was already a regular. She started visiting for the relaxed refinement and crema caramello alla banana (accompanied, no hyperbole, by an entire plate of cream!), but she kept visiting once she realised Pellegrino 2000 also served up perfect inspiration for a novel. Lunch with journalist and novelist Jacqueline Maley Credit: Steven Siewert “It’s one of my favourite Sydney restaurants,” Maley says. “The restaurant I had in mind for the novel was elegant and cool, but it was never going to try too hard or be like a white tablecloth place. I love good food, but I hate any stuffy atmosphere.” Maley would sit at the bar, sketching details in a notepad, absorbing the restaurant’s textures and rhythms. In Lonely Mouth, Pellegrino 2000 becomes the inspiration for the fictional Bocca – an Italian restaurant with a Japanese twist and a trattoria-meets–art deco aesthetic, located in Darlinghurst. Her narrator, Matilda, works there as the manager: a sharp and solitary 30-something nursing an unrequited crush on the restaurant’s bad-boy owner, Colson, and quietly shouldering the aftershocks of her mother leaving her and her sister, Lara, when they were children (made doubly traumatic by the fact it happened outside the Big Merino rest stop at Goulburn, off the Hume Highway). As a menu reduces a sauce, so too does a plot summary flatten Lonely Mouth. It’s a novel, rich with humour and sharp observations, about desire – for food, for love, for life – and what happens when that desire gets swallowed. It’s about sisters, and mothers and daughters. And Bocca becomes more than a backdrop: it’s a space where chaos meets order, appetite meets discipline, and everyone’s slightly hungry for something they can’t quite name.\n\nAdvertisement\n\n“I knew I wanted to set the novel in a restaurant. I thought it would be a dynamic setting,” Maley says. “I wanted it to be very realistic. I really wanted the restaurant to be like a character in the book, to be so atmospheric, it would take people there.” Caponata di melanzane: Eggplant, tomato, pine nuts and pickled celery. Credit: Steven Siewert How many times did she visit Pellegrino 2000? “You should ask my accountant when I put through my next tax return,” Maley quips. Mercifully, we avoid the worst part of Lunch Withs – the stilted pas de deux over the menu, the self-consciousness of wondering if one’s contributions to the ordering are too much, too little, too indulgent, too virtuous. Maley takes full control, like someone who has asked far tougher questions than “shared plates or mains”? To start, we opt for a pillowy focaccia and truffle-parmesan, an unexpectedly punchy caponata due to pickled celery, and a lush buffalo mozzarella, adorned with figs and honey. The wine stays on theme – a glass of Italian Pinot Grigio and a sharp Catarratto. Photographer Steven Siewert hovers nearby like a set designer reworking a diorama – moving errant phones out of frames, opening blinds for better light, repositioning cutlery with surgical precision. Pappardelle al pomodoro: Pappardelle, truss tomatoes and stracciatella. Credit: Steven Siewert “It is weird to be on the receiving end of what we usually do to other people,” Maley says. She has a deadline for her own Lunch With interview, with a senior public figure, looming. After completing an arts law degree, Maley started at The Sydney Morning Herald as a cadet in 2003. She comes from media stock: her mother, Judy, to whom Lonely Mouth is dedicated, worked at the Herald; her great-grandfather and great-uncle were political journalists; and her brother, Paul, was a reporter at The Australian. Maley’s a senior writer, columnist, podcast host and newsletter editor and, today, the unfortunate soul sitting on the wrong side of the notepad.\n\nAdvertisement\n\nYet, Maley’s not entirely unprepared. This isn’t our first time at the Lunch With table together. When her debut novel, The Truth About Her, came out in 2021, we met for breakfast in a courtyard of a cafe that was a little more toast crumbs than terrazzo tables. Now look at us: dining in a hot spot frequented by actual celebrities. For everyone’s sake, I suggest Maley consider setting her next novel in a five-star resort. Jacqueline Maley’s second novel Lonely Mouth is largely set in a restaurant. “We’re cosmopolitan ladies of the world now,” Maley retorts. “I think we need to really level up. I’m thinking ... Denmark. What’s that place? Noma.” The three-Michelin-star restaurant serves 20-course meals and regularly tops lists of the best restaurants in the world. For Lonely Mouth, Maley became something of a restaurant obsessive – fascinated by the ecosystems they contain and the quiet dramas unfolding between courses. She interviewed chefs and hospitality managers, read a stack of chef memoirs, watched YouTube videos of kitchens in action – and, for balance, quite a bit of The Great British Bake Off (the latter more for pleasure). In full Daniel Day-Lewis mode, she even picked up a few waitressing shifts. “They were sort of a bit bemused, but they were nice about it. I just did what I was told. I think the other waiters were like: Who is this lady? But everyone tolerated me,” Maley says. “People open up when you take a real interest in them, their lives, what they want to do, what they have done, the thing they are passionate about, and ask them to explain it to you. People were really giving that way, even though it was a weird ask, and no one really knew what I was doing.”\n\nAdvertisement\n\nIt wasn’t quite Down and Out in Paris, but the experience gave Maley what she needed: a feel for the choreography, the repetition, the small tensions and quiet triumphs of restaurant life. What surprised her was how much it resembled a newsroom – fast-paced, hierarchical, and always one dropped order away from chaos. “It’s a structured environment, but it attracts people who are unstructured in other ways. It’s a little like journalism and a newsroom in that way,” she says. Bill, please! “Journalists are not people who want to work a 9 to 5 job, they’re in for the experience and the adventure. We’re solo operators, but we have to work within an organism, which is the newsroom. Newspapers are very hierarchical, even though we’re all recalcitrant personalities who don’t like being told what to do.” With classic recalcitrance, I break the fourth wall to ask our off-duty journalist if she’s enjoying her turn in the Lunch With hot seat. “Are you checking in?,” Maley jokes. “It’s going great for me, but am I giving you what you need?” A master of the form, I ask Maley for her Lunch With advice – she’s got the recipe down, but I’m probably still chopping onions. “Just get them really drunk,” she deadpans. “It’s quite high pressure, I think. It’s like a social interaction on the surface, but your journalist brain is constantly working. ” A pause in proceedings: the main. Pappardelle with stracciatella and truss tomatoes so ripe they look ready to explode on impact. Maley unfolds a paper napkin and tucks it, bib-style, into the relaxed collar of her blue silk shirt. She catches my eye – the journalist’s brain, even now, still quietly whirring.\n\nAdvertisement\n\n“Can you not put this in the piece?” A pause, a sigh, a smile. “No, you can, if you want.” The same brain – always scanning for angles and incoming alerts– makes it hard for Maley to write fiction while working her day job. Journalism brings a constant overload of information, paired with the nagging sense you’re always missing something important. And while her reporting and novels both circle themes of gender and power, she doesn’t see them as flexing the same muscle. Jacqueline Maley did shifts at a restaurant while she was writing her second novel Lonely Mouth. Credit: Louise Kennerley Her ideal writing conditions are long, uninterrupted stretches away from work, not trying to wedge sentences between school drop-offs, play dates, early dog walks and breaking news alerts. Annual leave became writing leave – less a break than a change of deadlines. There was also the pressure of following up the success of her first novel and being contracted to a deadline as part of a two-book deal – a deadline she fell so far behind on that she can’t even precisely remember when it was. “I didn’t take a holiday in years,” Maley says. “So I ended up, at the end of it, realising it’s quite hard to juggle all of this. It took a toll on me in terms of stress levels, and so that was something that I wouldn’t want to do again. ” She’s got ideas bubbling away – another novel, maybe a non-fiction project – but for now, she’s letting them simmer. And at least restaurants are just restaurants again, no longer research sites in disguise.\n\nAdvertisement",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/lifestyle/health-and-wellness/living-better-for-longer-the-health-checks-for-your-40s-50s-and-beyond-20250526-p5m2el.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Living better for longer: The health checks for your 40s, 50s and beyond",
        "publish_date": "Wed, 11 Jun 2025 11:44:18 +1000",
        "category": "lifestyle",
        "authors": [
            "Shona Hendley"
        ],
        "text": "While there is no one-size-fits-all approach for preventative health checks, individual factors– including family or personal medical history, gender, ethnicity, and lifestyle – influence which tests a person should undertake, as well as when to begin them and the frequency at which they are performed. However, the Royal Australian College of General Practitioners (RACGP) does recommend certain health screens for the general population at each decade of life. Taking an active interest in your health increases your chances of living a long, full life. Credit: Getty Images In your 40s “By your early 40s, you should have a thorough check-up, including history and a full physical examination,” says Dunne.\n\nCertain regular health screenings should also begin. These include annual blood pressure monitoring from age 40 and STI tests if you are sexually active. Five-yearly blood tests for cholesterol, glucose, cell counts, and nutrition deficiency, as well as bowel cancer screening, should begin at age 45. Loading Skin cancer checks are recommended due to the increased risk with age, and due to a trend of increasing colon cancer in people under age 50, the Australian government has recently changed the starting age for colorectal cancer screening from 50 to 45, says Ding. In your 50s\n\nNatasha Yates, assistant professor of general practice at Bond University, says that people in their 50s should continue all the health screenings from their 40s, with the addition of some others. “Add a bone health assessment and consider screening for osteoporosis, especially if risk factors are present,” she says. “Vision and hearing tests to detect age-related changes are also recommended.” Yates says the National Lung Cancer Screening Program is due to commence in July this year. It will offer two-yearly low-dose CT scans to detect lung cancer in asymptomatic patients aged 50 to 70 who are deemed to be at high risk from smoking, she says. In your 60s\n\nIn addition to existing screenings, Yates says that a cognitive function evaluation, which assesses for signs of cognitive decline or dementia, should be undertaken. Similarly, a physical functioning screening for preventing falls and frailty should also be considered, adds Ding. 70s and beyond In your 70s, on top of existing checks, ensure your immunisations, including tetanus and shingles, are up-to-date, says Dunne. “There is a funded vaccination program for older Australians, including influenza, COVID, shingles and pneumococcal pneumonia,” he says. Gendered screenings\n\nDue to anatomy and physiology, women and men each have unique health risks, which warrant their own specific health screenings. “For example, whereas women are at risk of cancers of the cervix, ovaries and uterus, men are at risk of prostate cancer,” says Dunne. Breast screening is free for Australian women once they reach 40 years. Women aged 50 to 74 years will receive an invitation for screening from BreastScreen Australia. Credit: Getty Images Gender can also impact their approach to healthcare. “Unlike women, who are often introduced to regular health screenings from a young age, such as pap smears, breast checks, and GP visits for contraception, men typically don’t develop the same routine health-seeking behaviours,” Dunne says.\n\n“This makes early detection for men especially important, as they are more likely to delay seeking help until symptoms become severe.” Health screenings for men 40 + Men in their 40s should discuss with their GP screening tests for things like prostate cancer, high cholesterol, and type 2 diabetes. “Your GP will consider your individual circumstances, including family history, when recommending when to begin these tests,” says Dunne. Screening tests and regular GP check-ups should continue through your 50s and 60s.\n\nHealth screening for women 40 + Women are going through a lot during their 40s and 50s, says general practitioner Judith Hammond of women’s health clinic, Jean Hailes. “Peri menopause, menopause … women start to get to that sandwich generation, when they are working, worried about children who need support and supporting elderly parents, life really gets quite crushed around that time,” she says. In this period, it is increasingly important for women to undergo mental health screening, she says. Additionally, regular breast cancer screening via free mammograms can be undertaken from age 40.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/queensland/brisbane-news-live-millions-of-dollars-unaccounted-for-in-queensland-winter-chill-hits-brisbane-20250610-p5m69o.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Brisbane news live: Broncos new logo elicits mixed reviews; Jewellery store worker hit with hammer in armed hold-up; Calls mount for Crisafulli government to buy Toowong Private Hospital",
        "publish_date": "Wed, 11 Jun 2025 11:40:01 +1000",
        "category": "finance",
        "authors": [],
        "text": "News of a potential Broncos logo rebrand has elicited mixed reviews from fans online.\n\nRecords show Brisbane Broncos Corporation Pty Ltd submitted the design to IP Australia for trademark protection last week.\n\nAfter this masthead revealed the new design yesterday, punters were quick to vocalise their dislike of the new design.\n\n“Nope stick with the old logo thanks,” one punter said.\n\nAnother wrote: “If we go with this logo I won’t be buying Broncos merchandise.”\n\nA third said: “Hell no, there’s no Maroon, it’s our identity.”\n\nWhile the trademarked image is in black and white, a fully realised logo would most likely incorporate the Broncos’ club colours of maroon, white and yellow.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/queensland/watching-a-disaster-unfold-calls-mount-for-crisafulli-government-to-buy-brisbane-private-hospital-20250611-p5m6jc.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘Watching a disaster unfold’: Calls mount for Crisafulli government to buy Brisbane private hospital",
        "publish_date": "Wed, 11 Jun 2025 11:38:57 +1000",
        "category": "finance",
        "authors": [
            "Marissa Calligeros"
        ],
        "text": "The state opposition has joined 11th-hour calls for the Queensland government to swoop in and save one of Brisbane’s few mental health hospitals from closure.\n\nThe financially stricken Toowong Private Hospital, which treated 3000 patients annually, was set to close its doors on Wednesday after administrators brought in last month found no viable option to keep it open, and found no potential buyers.\n\nThe hospital’s chief executive, Christine Gee, denied rumours it was at risk of closing in September last year, despite a funding crisis involving health insurers that threatened the viability of private hospitals nationwide.\n\nToowong Private Hospital has been operating on Milton Road for more than 40 years. Credit: Facebook\n\nPatients and their treating psychiatrists were given just two weeks’ notice that the hospital would close, leaving doctors scrambling to find available beds at the few other facilities in Brisbane.",
        "source": "SMH"
    },
    {
        "url": "https://www.sbs.com.au/news/article/the-murky-food-label-thats-costing-australian-families-2-500-a-year/wmudzdd59",
        "title": "The 'murky' food label that's costing Australian families $2,500 a year",
        "publish_date": "Tue, 10 Jun 2025 23:27:20 +0000",
        "category": "finance",
        "authors": [],
        "text": "Unclear and inconsistent food date labels are contributing significantly to household food waste, according to new research, and it's costing the average family up to $2,500 annually in discarded groceries.\n\n\n\n\n\nThe study from RMIT University and End Food Waste Australia shows that Australia discards around 7.6 million tonnes of food annually, much of it still safe to eat.\n\n\n\n\n\nResearchers are calling for a national overhaul of food labelling, recommending clearer date markings, larger print, and simple icons to help consumers understand how long food stays safe and how it should be stored.\n\n\n\nProfessor Lukas Parker from RMIT says the research points to poor label design and inconsistent packaging as key factors driving food waste.\n\n\n\n\n\n\"We’re in a cost-of-living crisis and people are doing their best to feed their families, \" he said.\n\n\n\n\n\n\"But they’re being let down by packaging that makes it too hard to make informed decisions. That waste is devastating — 2kg per family per week. It's not just for people’s wallets, but for our farmers and our environment.\"\n\n\n\n\n\nThe study suggests small changes in how information is presented, such as clearly distinguishing between \"best before\" and \"use by\" dates, could go a long way in helping shoppers decide whether food is still good to eat.\n\n\n\nWhy current labels aren't working\n\nThe problem, researchers found, is twofold: Australians are confused about the difference between \"use by\" and \"best before\" dates, and they struggle to locate or read those dates on packaging.\n\n\n\n\n\n\"Most people understand that 'use by' means the food might not be safe to eat,\" Parker said.\n\n\n\n\n\n\"But 'best before' is murkier. A lot of people throw food away just because it’s past that date, even if it’s still fine.\"\n\n\n\n\n\nThe research also highlighted frustration around label location, font size, and formatting, such as dates printed in hard-to-read spots like the crinkled rim of a can.\n\n\n\n\n\n\"It takes a lot of effort to find and understand date labels, and that effort makes it harder for people to make the right call,\" Parker said.\n\n\n\nDespite widespread consumer support for clearer labelling, researchers found that the food industry has been hesitant to make changes.\n\n\n\n\n\nIn a series of workshops, food producers and retailers raised concerns about costs, compliance issues and regulatory red tape.\n\n\n\n\n\nTristan Butt, CEO of End Food Waste Australia, said reducing waste through improved labelling will only be possible if all parts of the supply chain work together.\n\n\n\n\n\n\"Clear, consistent date labelling is one of the most cost-effective and scalable ways to reduce household food waste, but it won’t happen without industry-wide collaboration,\" Butt said.\n\n\n\n\n\n\"This single change could prevent nearly a million tonnes of food waste by 2030.\n\n\n\n\n\n\"The UK’s retail sector has already proven this change is possible, without compromising food safety. It’s time we did the same.\"\n\n\n\nIndustry wants direction, government says change is coming\n\nThe workshops revealed that food manufacturers and retailers are hesitant to act alone, fearing that early adopters might face financial or competitive disadvantages.\n\n\n\n\n\n\"Everyone’s waiting for someone else to go first,\" Parker said.\n\n\n\n\n\n\"The government wants industry to take action, and industry wants clearer direction from government.\"\n\n\n\n\n\nDespite this stalemate, Parker says there’s strong in-principle support for clearer labels across the board.\n\n\n\n\n\nThe next phase of the National Date Labelling and Storage Advice Project will bring together government and industry partners to test and co-design clearer labelling.\n\n\n\nLabels should be self-explanatory\n\nThe researchers say clearer design is more important than one-off education campaigns.\n\n\n\n\n\n\"Good labelling should be so clear it doesn’t need to be explained,\" Parker said.\n\n\n\n\n\n\"Education is great, but it only works if people remember it. Design is what they see every time they pick something up.\"\n\n\n\n\n\nThe project will also test consumer reactions using tools like eye-tracking to see how real people interact with packaging.\n\n\n\n\n\n\"It’s not about making people feel guilty,\" Parker said.\n\n\n\n\n\n\"It’s about giving them the tools to make confident decisions and keeping good food out of the bin.\"\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/how-the-socceroos-have-performed-at-fifa-world-cups/0p0lt5z1e",
        "title": "Saudi Arabia v Australia: Socceroos qualify for FIFA 2026. How've they gone before?",
        "publish_date": "Tue, 10 Jun 2025 20:24:23 +0000",
        "category": "sports",
        "authors": [],
        "text": "Goals from striker Mitch Duke and midfielder Connor Metcalfe earned the Socceroos a 2-1 win over Saudi Arabia on Tuesday morning and qualification for a sixth consecutive FIFA World Cup.\n\n\n\n\n\nAfter their upset 1-0 win over Japan in Perth on Thursday, the Socceroos only needed to avoid defeat by less than five goals in Jeddah to seal automatic World Cup finals qualification for the first time in 12 years.\n\n\n\n\n\nThe result means Australia came second to Japan in Group C in Asian Football Confederation qualifying and avoided having to go to a fourth round of qualifiers.\n\n\n\nSaudi forward Abdulrahman Al-Aboud scored in the 19th minute at the King Abdullah Sports City Stadium to make things tense.\n\n\n\n\n\nBut Duke teed up Metcalfe to equalise in the 42nd minute, before putting Australia in front in the 48th.\n\n\n\n\n\nIn his 100th appearance, goalkeeper and captain Mat Ryan denied Salem Al-Dawsari from the penalty spot in the 84th minute.\n\n\n\n\n\n'The dedication, the sacrifice'\n\n\n\n\n\nAfter the match, Ryan praised the hard work of the team.\n\n\n\n\n\n\"It'd be nice if I could work out how to freeze time,\" Ryan said.\n\n\n\n\n\n\"You sit down together as a group and you work out how you can be successful,\" he said.\n\n\n\n\n\n\"The final moment where it comes — that feeling — that's why we keep going and going for moments like this, the dedication, the sacrifice.\"\n\n\n\nSocceroos defender Milos Degenek (right) challenges Saudi Arabia's Feras Albrikan in their World Cup qualifier in Jeddah on Tuesday morning. Source: AP / . Socceroos coach Tony Popovic, who came into the job in September after former coach Graham Arnold quit following the Socceroos getting just a point from their first two qualifiers, said the result was still sinking in.\n\n\n\n\n\n\"Very satisfying, right now. I'm sure it'll sink in as the days go by,\" Popovic said of the \"very special\" accomplishment.\n\n\n\n\n\n\"It's been a very intense period since I've joined and I've loved it so far.\n\n\n\n\n\n\"We've done the first part, qualifying automatically, and now the next part is to be bigger and better for the World Cup.\"\n\n\n\n\n\nExactly a year before the start of next year's finals in the United States, Canada and Mexico, Australia (19 points, +9 goal difference) qualify in the second automatic spot behind Japan (23 points, +27) and ahead of Saudi Arabia (13 points, -1).\n\n\n\n\n\nPopovic is unbeaten as national team coach since taking over from Arnold.\n\n\n\nHow did the Socceroos perform at the last five World Cups?\n\nAustralia first qualified for a World Cup in 1974, in West Germany, but failed to qualify from 1978 to 2002.\n\n\n\n\n\nBut they finally did in 2006, ending 32 years of heartache.\n\n\n\n\n\nHere's a quick rundown of how the Socceroos performed at the previous five World Cups:\n\n\n\nGermany 2006\n\nAustralia qualified by defeating Uruguay in a two-legged intercontinental playoff. After both teams won their home legs 1–0, the tie was decided by a penalty shootout, which Australia won 4–2.\n\n\n\n\n\nIn the tournament, the Socceroos advanced from the group stage for the first time, finishing second in their group to Brazil. They were eliminated after a 1–0 loss to Italy.\n\n\n\nSocceroos striker John Aloisi celebrates scoring the penalty against Uruguay in Sydney in 2005 that sent Australia through to the 2006 World Cup. Source: AP / Mark Baker\n\nSouth Africa 2010\n\nAustralia qualified directly by finishing at the top of their group in the AFC fourth round of qualifiers.\n\n\n\n\n\nIn the World Cup, they finished third in their group.\n\n\n\nCredit: SBS News\n\nBrazil 2014\n\nThe Socceroos secured qualification by finishing second in their AFC fourth-round group, behind Japan.\n\n\n\n\n\nIn the tournament, Australia was drawn into a challenging group with Spain, the Netherlands and Chile. They lost all three matches and were eliminated in the group stage.\n\n\n\nRussia 2018\n\nAustralia's path to qualification involved finishing third in their AFC third-round group, playing off against Syria and then Honduras in the intercontinental playoff.\n\n\n\n\n\nAt the World Cup, the Socceroos finished fourth in their group, with one draw and two losses, exiting in the group stage.\n\n\n\nQatar 2022\n\nAustralia finished third in their AFC third-round group, leading to a playoff against the United Arab Emirates, which they won 2–1. They then faced Peru in an intercontinental playoff, winning 5–4 on penalties after a 0–0 draw.\n\n\n\n\n\nIn the tournament, Australia advanced to the Round 16 after finishing second in their group.\n\n\n\n\n\nThey were eliminated after a 2–1 loss to Argentina.\n\n\n\nWhich other countries have qualified for the 2026 World Cup so far?\n\nCanada, Mexico and the United States have automatically qualified as the joint hosts of the 48-team tournament.\n\n\n\n\n\nThis will be the first time that Canada has ever reached back-to-back tournaments﻿, after it qualified in 2022.\n\n\n\n\n\nJapan's Samurai Blue will compete in their eighth successive World Cup, along with Iran, New Zealand and Argentina.\n\n\n\n\n\nUzbekistan reached their first World Cup after securing a top-two finish in the third round of Asian qualifiers, and have been joined by Korea Republic and Jordan.\n\n\n\n\n\nCountries aiming to qualify for the tournament play games in their confederations, which cover Europe, South America, Asia, Africa, North and Central America and Oceania.\n\n\n\nSocceroos midfielder Aaron Mooy challenges Argentina's Lionel Messi during their Round of 16 match at the 2022 World Cup in Qatar. Australia lost 2-1 and Argentina went on to win the tournament. Source: Getty / Alex Grimm\n\nWhen and where is the 2026 FIFA World Cup?\n\nThe 2026 tournament will be the biggest yet, after FIFA increased the number of competing teams from 32.\n\n\n\n\n\nMatches will be held across 16 cities in Canada, Mexico and the United States, with the tournament kicking off in June 2026.\n\n\n\n\n\n— with additional reporting from the Australian Associated Press.\n\n\n\n\n\nYou can watch all 104 games of the FIFA World Cup 2026 LIVE on SBS and SBS VICELAND.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/creative/sbs50-across-the-seas/4gh2wywnc",
        "title": "Refugees, foreign students and 'boat people': What it's really like to migrate to Australia",
        "publish_date": "Tue, 10 Jun 2025 19:42:27 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/video/50-years-since-iconic-patris-ship-brought-thousands-of-greek-migrants-to-australia/nsb4yex8s",
        "title": "50 years since iconic 'Patris' ship brought thousands of Greek migrants to Australia",
        "publish_date": "Tue, 10 Jun 2025 09:48:54 +0000",
        "category": "finance",
        "authors": [],
        "text": "50 years since iconic 'Patris' ship brought thousands of Greek migrants to Australia\n\nPublished 10 June 2025, 6:54 am\n\nSBS is marking its 50th anniversary by recognising various broadcasts over the years, including its first ever radio broadcast in Greek. This year also marks half a century since the ‘Patris’ - a ship that brought tens-of-thousands of Greek migrants to Australia - left our shores for the last time. This story was produced in collaboration with SBS Greek.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/video/prime-minister-condemns-horrific-rubber-bullet-shooting-of-australian-journalist-in-la-protests/qoupt8ku2",
        "title": "Prime Minister condemns \"horrific\" rubber bullet shooting of Australian journalist in LA protests",
        "publish_date": "Tue, 10 Jun 2025 09:42:55 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/asx200-hits-a-record-high-whats-with-the-labubu-craze/2bgsoh5po",
        "title": "ASX200 hits a record high & what's with the Labubu craze?",
        "publish_date": "Tue, 10 Jun 2025 09:15:31 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.theage.com.au/culture/books/a-dark-satire-of-girlboss-feminism-and-the-cult-of-beauty-20250530-p5m3ic.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "A dark satire of girlboss feminism and the cult of beauty",
        "publish_date": "Wed, 11 Jun 2025 12:00:00 +1000",
        "category": "finance",
        "authors": [
            "Jessie Tu"
        ],
        "text": "FICTION\n\nRytuał\n\nChloe Elisabeth Wilson\n\nPenguin, $34.99\n\nDespite our best efforts, the pursuit of beauty for women feels like an inescapable project of distraction. Case in point: we’re not entirely sure if the overpriced lash serum will deliver on its promise of longer, lusher lashes, but we hand over money anyway because, well, we want to be beautiful.\n\nWe crave the power that beauty holds. We’re comfortably deluded in contributing to the global industry that’s worth $650 billion a year.\n\nBeing beautiful is a reliable religion. Or rather, wanting to be included in the exclusive club of Beautiful Women can feel like an ungovernable lust. In Chloe Elisabeth Wilson’s debut novel, Rytuał, a dark, suspenseful yet funny book traces the obsessions and pitfalls of a group of young, listless Melburnian women vying for power under a beguiling boss.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/culture/books/i-know-what-you-read-last-summer-and-it-was-probably-horror-20250530-p5m3md.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "I know what you read last summer (and it was probably horror)",
        "publish_date": "Wed, 11 Jun 2025 12:00:00 +1000",
        "category": "entertainment",
        "authors": [
            "Jordan Prosser"
        ],
        "text": "Save Log in , register or subscribe to save articles for later. Save articles for later Add articles to your saved list and come back to them any time. Got it Normal text size Larger text size Very large text size In the mid-2010s, moviegoers embraced the so-called “elevated” horror boom, with films such as The Babadook, Get Out, Midsommar and The Witch at the vanguard – low-budget, high-concept genre fare that used classic horror tropes to probe contemporary societal ills like toxic relationships, racism and mental illness. (The “elevated” label was a bit of clever rebranding, like slapping an “organic” sticker on a hamburger; these movies function the same way great horror always has – you just feel a little less dirty about enjoying them.) Now it seems it’s literature’s turn. In 2023, there was a record number of new horror books both published and sold, and two years on, the trend shows little sign of slowing. Literary agents are reporting submission piles filling up with more tales of the weird and eerie, from eco-horror to folk horror to the aptly named “femgore” – hyper-violent, female-centric body horror. In the last year alone – and this is but a tiny sliver of what’s on offer – we’ve had Gretchen Felker-Martin’s Cuckoo, which made the very real horrors of gay conversion camps manifest in a grotesque body-snatching teen epic. Rachel Harrison’s So Thirsty took a big, bloody bite out of 21st-century female friendship with its ultra-gory vampire antics. The Lamb, Lucy Rose’s fairytale debut, told the touching story a young girl caring for her mother … by bringing her stray hikers to satiate her cannibalistic urge for human flesh (pair it with Monika Kim’s The Eyes are the Best Part for a stomach-churning family-sized feast). And 50 years after the publication of his first novel, Carrie, horror stalwart Stephen King released his latest short story anthology You Like It Darker (just months after a brand-new novel, Holly – also featuring cannibals). The late horror director George A. Romero, whose horror novel has been – fittingly – published posthumously. Credit: AP King isn’t the only elder statesman jostling for shelf space alongside the BookTok generation. George A. Romero, the man responsible for our modern conception of zombies, with films like The Night of the Living Dead and Dawn of the Dead, released his final novel earlier this year, somewhat fittingly from beyond the grave.\n\nAdvertisement\n\nCo-written by Daniel Kraus, who discovered the incomplete manuscript in an archive box at the University of Pittsburgh Library in 2019, Pay the Piper is a sweaty, cosmic eco-horror set in the muggy depths of the Louisiana bayou, where a nine-year-old girl named Pontiac and a rag-tag group of townsfolk from her home of Alligator Point come up against an ancient, vengeful evil that’s been lurking in the swamp and preying on children. While Romero will forever be remembered primarily as an orchestrator of gnarly kills and ground-breaking special effects, his zombie movies always had more than merely brains on the brain. His seminal Night of the Living Dead is often read as a critique of racial tensions in 1960s America; it features a Black protagonist (played by Duane Jones) who survives an undead horde only to be shot by a white sheriff. The 1978 follow-up, Dawn of the Dead, set entirely in a shopping mall, can only be seen as a satirical indictment of rampant consumerism. Pay the Piper continues this tradition of smuggling hefty themes into seemingly straightforward horror schtick. Young Pontiac’s home is under threat from a nefarious character known only as The Oil Man – a phantom-like stand-in for the entire fossil fuel industry – as well as The Piper itself, an aquatic Lovecraftian creature seeking restitution for the thousands of slaves slaughtered and dumped in its waters by the infamous Pirates Lafitte in the 1800s. Romero and Kraus’ book mutates from gooey Southern Gothic to a full-throated treatise on human cruelty and environmental calamity; it’s spooky, stirring Cajun cli-fi with a healthy dose of tentacles. YA author Margot McGovern has long been a fan of slasher and horror films. Closer to home, this March saw the release of Margot McGovern’s riveting supernatural YA slasher This Stays Between Us. McGovern’s second book boasts a little bit of everything: early 2000s nostalgia, late-night seances, teenage crushes, buried secrets and a predatory entity known only as Smiling Jack that hunts its four young female protagonists as they try to survive year 11 camp in a remote, abandoned mining town. McGovern’s first book, Neverland, released in 2018, hewed much closer to magical realism – but a life-long love of horror helped inspire her sophomore stab. “I’ve always been a huge horror fan,” says McGovern. “I read and watched a lot growing up, but there wasn’t a lot of Australian horror at that time. Most of the movies came from the US. And with horror books, in the ’90s it felt like you had R.L. Stine and then there was this huge gap before you jumped to Stephen King and Clive Barker.”\n\nAdvertisement\n\nTeen horror films filled that gap for McGovern. “I always knew I wanted to write a book that was set here in Australia and evoked the Australian landscape and personality, but embodied all the fun of a late-90s slasher,” she says. “Kevin Williamson’s screenplays were a huge influence on me. I love Scream and I Know What You Did Last Summer and Teaching Mrs. Tingle – even movies like The Craft.” A scene from classic 90s slasher film I Know What You Did Last Summer. Credit: Amazon Prime Of course, the defining feature of all these movies – and many of the books already mentioned – is teenagers. In horror, teens are often the heroes, the hapless victims and the target audience all at once. “Horror occupies this really interesting liminal space for teenagers,” McGovern says of her passion for writing YA. “It gives you that last little bit of make-believe. “It offers a step up into the adult world, where things can be genuinely terrifying and violent. When you’re 13 or 14, you feel like things are out of your control – you’re going through this huge transition, you’re figuring out who you are, your body’s changing, all the rules are changing! – and horror not only explores that, but gives you a way to take back some power and agency.” Perhaps that explains our present-day horror boom, then. We’re all of us teenagers in a world that feels increasingly out of control – but instead of regressing into childhood and escaping into all-out fantasy, we’re ready to confront our fears; to look the monster under the bed, or the creature in the swamp, or the thing in the mirror dead in the eye. “Horror has always responded to what’s happening in the culture,” McGovern says. “I think that’s part of the reason why it’s making such a comeback now. In times of uncertainty and upheaval, horror offers a set of familiar tropes that lets you approach your darkest fears in an almost comforting way.”\n\nAdvertisement",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/culture/books/a-terrifying-tour-of-silicon-valley-s-deluded-plans-for-a-techno-utopia-20250609-p5m5ym.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "A terrifying tour of Silicon Valley’s deluded plans for a techno-utopia",
        "publish_date": "Wed, 11 Jun 2025 12:00:00 +1000",
        "category": "finance",
        "authors": [
            "Pat Sheil"
        ],
        "text": "But to hear Elon Musk tell it, his Starship and its successors will soon be the workhorses of an interplanetary fleet that will take humans to Mars. And not just a few intrepid Apollo-style explorers collecting rocks and taking pictures, mind you. Musk and his disciples want to colonise the red planet, and by that, he means setting up an entire, self-sufficient civilisation there.\n\nAsk a deckhand on a fishing trawler in the Gulf of Mexico what he saw, when yet another doomed Space X Starship detonated 10 kilometres above his head, and these are not words he would use.\n\nIn commercial space flight PR jargon, a catastrophic launch failure is routinely glossed over with seemingly innocuous explanations. The second stage booster did not “explode, destroying millions of dollars’ worth of engines and several satellites”. No, it “underwent a rapid unplanned disassembly”, the results of which were “mission sub-optimal”.\n\nAdam Becker’s marvellous “disassembly” of Musk’s ludicrous fantasy is neither unplanned nor sub-optimal. Subtitled AI Overlords, Space Empires, and Silicon Valley’s Crusade to Control the Fate of Humanity, More Everything Forever gives a trawler deckhand’s eye view of what awaits us, should a deluded cabal of tech billionaires somehow make their dreams come true.\n\nElon Musk brandishing a chainsaw at a pro-Trump conference earlier this year. Credit: AP\n\nThe paving stones of these roads to hell are, seductively as ever, presented by advocates as nothing more sinister than the greatest good for the greatest number, and history is littered with the wreckage of such beneficent intentions.\n\nAnd so it is that Becker begins his descent into the AI underworld in the seemingly harmless realm of EA, or “effective altruism”; the notion that it is incumbent on people with wealth to share it around, and so help those less fortunate. The catch here is the E before the A, and what began as a fairly harmless, if occasionally wacky, crusade in the minds of philosophers like Peter Singer can, and did, come utterly unhinged when the brutal logic of algorithms is used to maximise the “effectiveness” of altruism. Particularly in the hands of the likes of cryptocurrency lunatics such as Sam Bankman-Fried, and the deluded Scottish philosopher William MacAskill.\n\nBankman-Fried was very keen on EA, and he did give away a lot of money, but as most of it belonged to other people, he was convicted of fraud on a titanic scale in 2023 and consigned to the hoosegow for 25 years. But 25 years is a millisecond to MacAskill, an advocate of “longtermism”, a clumsy word which means that in order to ensure the greatest good for the greatest number, it’s clear (to longtermists, anyway) that we need a lot more people to make happy. More people, indeed, than Earth’s ecology could ever support.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/victoria/two-hour-delays-after-11-vehicle-smash-closes-princes-freeway-20250611-p5m6gx.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Princes Freeway crash: Hours-long delays continue after road damage causes 11-vehicle collision",
        "publish_date": "Wed, 11 Jun 2025 11:58:25 +1000",
        "category": "finance",
        "authors": [
            "Alexander Darling"
        ],
        "text": "Surface damage on the Princes Freeway in Melbourne’s outer west caused multiple crashes involving a truck and up to 10 cars on Wednesday morning, closing the busy road for hours.\n\nTwo of the three northbound lanes remain closed, and motorists trying to get from Geelong to Melbourne still face traffic delays of more than two hours.\n\nMotorists are being diverted through Werribee and Wyndham Vale, where there are also reports of traffic jams.\n\nAll northbound lanes of the road were closed for more than four hours after a series of crashes at about 4.20am.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/rugby-union/appetite-for-destruction-how-mum-s-kitchen-put-suaalii-back-on-track-to-tame-lions-20250611-p5m6h5.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Appetite for destruction: How mum’s kitchen put Suaalii back on track to tame Lions",
        "publish_date": "Wed, 11 Jun 2025 11:57:52 +1000",
        "category": "sports",
        "authors": [
            "Iain Payten"
        ],
        "text": "Forget the $1.6 million pay cheque. It’s a mum’s humble home cooking that could prove a more valuable factor in Joseph-Aukuso Suaalii leading the Wallabies to victory over the British and Irish Lions next month.\n\nAfter a 12-year wait, the highly anticipated Lions tour is now just weeks away and Suaalii joined fellow Wallabies Angus Bell and Andrew Kellaway at Taronga Zoo on Wednesday to visit some real lions and promote the blockbuster series.\n\nThe smile on Suaalii’s face will be a welcome sight for Wallabies fans – and coach Joe Schmidt – after the star recruit suffered a broken jaw four weeks ago, throwing his involvement into doubt.\n\nBut after surgery and a rehab period that involved wearing a protective face mask, Suaalii says he is back to full health and will be ready to take on Fiji early next month, and then the Lions in the main show later in July.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/business/markets/has-trump-created-an-opportunity-for-the-euro-to-displace-the-us-dollar-20250611-p5m6hh.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Has Trump created an opportunity for the euro to displace the US dollar?",
        "publish_date": "Wed, 11 Jun 2025 11:57:30 +1000",
        "category": "finance",
        "authors": [
            "Stephen Bartholomeusz"
        ],
        "text": "Others, conscious that the US relies on foreign capital inflows to fund its yawning (and rapidly growing) government deficits and debt and enable the government and US citizens to live beyond their means, won’t view the apparent crack in the value of the dollar and the US markets’ status as the world’s safe haven quite as positively. In the near term, the weaker US dollar also means the inflationary impacts in the US of Trump’s trade war on the rest of the world will be exaggerated. A strong dollar, by making imports cheap in US dollar term, would muffle the impact on inflation. ‘European leaders have recognised the window of opportunity opened by America’s self-destructive trade policies.’ The likely effects of Trump’s war is reflected in this week’s downgrading of the outlook for global and US growth by the World Bank, which sees global growth slowing from 2.8 per cent last year to 2.3 per cent and growth in the US economy halving from 2.8 per cent to 1.4 per cent. That outlook, if it eventuates, would provide even less reason to invest in the US and would result in an even greater reduction in demand for US dollars.\n\nDoes that provide an opportunity for the euro? Perhaps, albeit not one that could be easily or quickly realised. The dollar has reined supreme as the world’s reserve currency in the post-war era and still does. Even though the degree of dominance has been waning in recent years, it still accounts for about 58 per cent of central bank reserves – it was above 70 per cent in the early years of this century and was still above 60 per cent five years ago – and about 55 per cent of trade invoicing is denominated in dollars. The US dollar has depreciated about 10 per cent this year. Credit: Bloomberg The euro ranks second on both counts, with a 30 per cent or so share of reserves and a similar share of trade financing.\n\nThe challenge for the Europeans, if they want to challenge the dollar’s status, is that, while they might have the “next best” currency, they lack some of the foundations that would make it the reserve currency. Loading They do have a floating exchange rate, no capital controls, an independent and respected central bank and an independent and respected judicial system. They don’t have deep and liquid capital markets nor a single economy that is growing consistently and strongly, nor do they have current account deficits to expand the supply of euros – the European Union consistently runs current account surpluses (and hence is a major target for Trump’s tariffs). The European capital markets are fragmented and shallow – European companies rely on banks rather than markets as their primary source of funding – and the condition of the underlying economies varies considerably.\n\nThe closest thing the EU has to a US Treasury bond is a Germany bund but, where the US Treasury market has about $US28 trillion ($43 trillion) of securities on issue, the market for bunds is only about €1.8 trillion (about $3.2 trillion). That market, thanks to the historic decision to reform the country’s “debt brake” in order to use debt-financing for what might be a €600 billion increase in military spending, will grow, but it would still remain small relative to the Treasury market. Loading What could the EU do to create a deeper bond market? It could issue eurobonds, or debt raised on behalf of all its members and backed by all their economies. It has toyed with that idea for decades and, indeed, created a eurobond facility of up to €800 billion to help member countries recover from the pandemic, although those bonds are supposed to progressively mature and disappear by 2058.\n\nGermany has historically been opposed to the issuance of collective EU debt. It’s strict fiscal discipline means it can borrow more cheaply than other EU members and pay lower interest rates on its debt. With eurobonds, it would pay more and effectively be subsidising the rest of the EU. The prize for the EU as a whole – a greater share of world reserves, a more stable currency in stressful times, cheaper funding generally and therefore greater economic growth and the geopolitical benefits from having a reserve currency – is, however, worth striving for. The EU could do more trade in euros – it buys a lot of energy but pays for it almost exclusively in US dollars, for instance – it could issue a digital euro to facilitate global transactions, and it could integrate its economies and policies more deeply. While the Europeans have the “next best” currency, they lack some of the foundations that would make it THE reserve currency. Credit: AP It could also do as the US Federal Reserve Board has done in financial crises, and create permanent swap lines with its major trading partners to provide euro liquidity in moment of stress. That would bolster confidence in the currency.\n\nIt is improbable that the euro could displace the dollar as the world’s reserve currency in anything other than the truly long term. Loading It could, however, increase its share of global reserves and transactions and share some of the dollar’s “exorbitant privilege” – the ability to borrow cheaply without any real limits, the haven status in a crisis, the ability, if they ever transpired, to run trade deficits without any fear of a balance of payments crisis, and, above all, the enhanced geopolitical authority the EU has always sought. European leaders have recognised the window of opportunity opened by America’s self-destructive trade policies – it’s been a growing topic of conversation in Europe since Trump’s “Liberation Day” tariffs announcement – but have also acknowledged the complexities and obstacles to taking advantage of it. Still, small but important steps could be taken, with eurobond issuance at the forefront and, with the EU members committed to ramping up their defence spending in response to Russia’s invasion of Ukraine, this could be an instance where, thanks to Trump and Vladimir Putin, opportunity and need start to converge.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/australia-news-live-australia-sanctions-israeli-ministers-trump-vows-heavy-force-against-protesters-20250611-p5m6gi.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Australia news LIVE: Curfew imposed on LA as Trump calls protesters ‘animals’; Israeli ministers sanctioned by Australia, US allies",
        "publish_date": "Wed, 11 Jun 2025 11:54:10 +1000",
        "category": "finance",
        "authors": [
            "Amber Schultz"
        ],
        "text": "Loading\n\nPrime Minister Anthony Albanese will, from next month, be paid more than Donald Trump after the Remuneration Tribunal boosted federal politicians’ pay by 2.4 per cent.\n\nThe decision, which takes effect on July 1, lifts Albanese’s salary from $607,500 to $622,071.\n\nThat means he will now overtake Trump, who is paid US$400,000 ($614,175) for his presidential duties.\n\nThe pay rise, revealed today, is lower than the 3.5 per cent increase granted by the Fair Work Commission (FWC) for minimum wage earners earlier this month.\n\nIn its justification, the tribunal said it had taken account of economic conditions, past and projected movements in pay in the private and public sectors, and the FWC’s decision.\n\n“This adjustment reflects a measured approach, balancing the need for restraint given economic conditions with the recognition of the upward pressure on household costs since the Tribunal’s 2024 review,” it said.\n\nTreasurer Jim Chalmers’ salary will hit $448,609 while Opposition Leader Sussan Ley’s pay will rise from the $432,253 figure previously received by her predecessor Peter Dutton, to $442,627.\n\nPoliticians who do not hold senior positions, will see their pay reach $239,258.\n\nMPs will sit in the House of Representatives for fewer days this year than any other in the past two decades, spending just 40 days this year passing laws. That’s two weeks less than the average of 48 sitting days during previous election years.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/world/asia/the-us-and-china-thrashed-out-their-trade-fight-for-20-hours-here-s-what-they-agreed-to-20250611-p5m6j3.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "The US and China thrashed out their trade fight for 20 hours. Here’s what they agreed to",
        "publish_date": "Wed, 11 Jun 2025 11:48:26 +1000",
        "category": "finance",
        "authors": [
            "Lisa Visentin"
        ],
        "text": "Singapore: US officials said Chinese restrictions on the export of critical rare earth minerals and magnets had been resolved under a preliminary deal to resurrect a fragile trade truce struck in Geneva last month.\n\nEmerging from two days of intense discussions in London, US and Chinese negotiators said they had reached a new framework committing to the original trade deal struck on May 12, which almost unravelled in a dispute over China’s export curbs on rare earths and US controls on technology sales.\n\nUS Treasury Secretary Scott Bessent, second right, departs following trade talks at Lancaster House in London. Credit: Bloomberg\n\nThe new agreement still needs to be signed off by both US President Donald Trump and Chinese President Xi Jinping.\n\nBoth sides offered few concrete details about what had been brokered over almost 20 hours of discussions.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/culture/books/two-journalists-an-eclectic-restaurant-and-taylor-swift-inside-the-making-of-jac-maley-s-new-book-20250609-p5m5wz.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Two journalists, an eclectic restaurant and Taylor Swift: Inside the making of Jac Maley’s new book",
        "publish_date": "Wed, 11 Jun 2025 11:45:00 +1000",
        "category": "finance",
        "authors": [
            "Melanie Kembrey"
        ],
        "text": "Save Log in , register or subscribe to save articles for later. Save articles for later Add articles to your saved list and come back to them any time. Got it Normal text size Larger text size Very large text size Lunch begins with an editorial intervention. “I want to say, for the record,” Jacqueline Maley – ever the journalist – announces. “That this was on my vision board before Tay Tay came. I was so on the zeitgeist.” We’re dining at Pellegrino 2000, tucked inside a historic terrace in Surry Hills, where the vibe is old-school Italian with a wink. Chianti bottles sit like trophies, tomato tins masquerade as rustic decor, and ropes of dried herbs and spices dangle above the bar. An eccentric collection of framed artwork lines the walls – including an image of the Michelin Man, beaming over the room like an ironic deity, blessing the carb-loading faithful below. It’s theatrical, yet charming. The perfect setting for a pop star – or, in Maley’s case, her second novel, Lonely Mouth. Long before Taylor Swift and her gal pal Sabrina Carpenter turned the restaurant into pop culture real estate when they spent the first night of their Eras and Sydney Zoo tour here, Maley was already a regular. She started visiting for the relaxed refinement and crema caramello alla banana (accompanied, no hyperbole, by an entire plate of cream!), but she kept visiting once she realised Pellegrino 2000 also served up perfect inspiration for a novel. Lunch with journalist and novelist Jacqueline Maley Credit: Steven Siewert “It’s one of my favourite Sydney restaurants,” Maley says. “The restaurant I had in mind for the novel was elegant and cool, but it was never going to try too hard or be like a white tablecloth place. I love good food, but I hate any stuffy atmosphere.” Maley would sit at the bar, sketching details in a notepad, absorbing the restaurant’s textures and rhythms. In Lonely Mouth, Pellegrino 2000 becomes the inspiration for the fictional Bocca – an Italian restaurant with a Japanese twist and a trattoria-meets–art deco aesthetic, located in Darlinghurst. Her narrator, Matilda, works there as the manager: a sharp and solitary 30-something nursing an unrequited crush on the restaurant’s bad-boy owner, Colson, and quietly shouldering the aftershocks of her mother leaving her and her sister, Lara, when they were children (made doubly traumatic by the fact it happened outside the Big Merino rest stop at Goulburn, off the Hume Highway). As a menu reduces a sauce, so too does a plot summary flatten Lonely Mouth. It’s a novel, rich with humour and sharp observations, about desire – for food, for love, for life – and what happens when that desire gets swallowed. It’s about sisters, and mothers and daughters. And Bocca becomes more than a backdrop: it’s a space where chaos meets order, appetite meets discipline, and everyone’s slightly hungry for something they can’t quite name.\n\nAdvertisement\n\n“I knew I wanted to set the novel in a restaurant. I thought it would be a dynamic setting,” Maley says. “I wanted it to be very realistic. I really wanted the restaurant to be like a character in the book, to be so atmospheric, it would take people there.” Caponata di melanzane: Eggplant, tomato, pine nuts and pickled celery. Credit: Steven Siewert How many times did she visit Pellegrino 2000? “You should ask my accountant when I put through my next tax return,” Maley quips. Mercifully, we avoid the worst part of Lunch Withs – the stilted pas de deux over the menu, the self-consciousness of wondering if one’s contributions to the ordering are too much, too little, too indulgent, too virtuous. Maley takes full control, like someone who has asked far tougher questions than “shared plates or mains”? To start, we opt for a pillowy focaccia and truffle-parmesan, an unexpectedly punchy caponata due to pickled celery, and a lush buffalo mozzarella, adorned with figs and honey. The wine stays on theme – a glass of Italian Pinot Grigio and a sharp Catarratto. Photographer Steven Siewert hovers nearby like a set designer reworking a diorama – moving errant phones out of frames, opening blinds for better light, repositioning cutlery with surgical precision. Pappardelle al pomodoro: Pappardelle, truss tomatoes and stracciatella. Credit: Steven Siewert “It is weird to be on the receiving end of what we usually do to other people,” Maley says. She has a deadline for her own Lunch With interview, with a senior public figure, looming. After completing an arts law degree, Maley started at The Sydney Morning Herald as a cadet in 2003. She comes from media stock: her mother, Judy, to whom Lonely Mouth is dedicated, worked at the Herald; her great-grandfather and great-uncle were political journalists; and her brother, Paul, was a reporter at The Australian. Maley’s a senior writer, columnist, podcast host and newsletter editor and, today, the unfortunate soul sitting on the wrong side of the notepad.\n\nAdvertisement\n\nYet, Maley’s not entirely unprepared. This isn’t our first time at the Lunch With table together. When her debut novel, The Truth About Her, came out in 2021, we met for breakfast in a courtyard of a cafe that was a little more toast crumbs than terrazzo tables. Now look at us: dining in a hot spot frequented by actual celebrities. For everyone’s sake, I suggest Maley consider setting her next novel in a five-star resort. Jacqueline Maley’s second novel Lonely Mouth is largely set in a restaurant. “We’re cosmopolitan ladies of the world now,” Maley retorts. “I think we need to really level up. I’m thinking ... Denmark. What’s that place? Noma.” The three-Michelin-star restaurant serves 20-course meals and regularly tops lists of the best restaurants in the world. For Lonely Mouth, Maley became something of a restaurant obsessive – fascinated by the ecosystems they contain and the quiet dramas unfolding between courses. She interviewed chefs and hospitality managers, read a stack of chef memoirs, watched YouTube videos of kitchens in action – and, for balance, quite a bit of The Great British Bake Off (the latter more for pleasure). In full Daniel Day-Lewis mode, she even picked up a few waitressing shifts. “They were sort of a bit bemused, but they were nice about it. I just did what I was told. I think the other waiters were like: Who is this lady? But everyone tolerated me,” Maley says. “People open up when you take a real interest in them, their lives, what they want to do, what they have done, the thing they are passionate about, and ask them to explain it to you. People were really giving that way, even though it was a weird ask, and no one really knew what I was doing.”\n\nAdvertisement\n\nIt wasn’t quite Down and Out in Paris, but the experience gave Maley what she needed: a feel for the choreography, the repetition, the small tensions and quiet triumphs of restaurant life. What surprised her was how much it resembled a newsroom – fast-paced, hierarchical, and always one dropped order away from chaos. “It’s a structured environment, but it attracts people who are unstructured in other ways. It’s a little like journalism and a newsroom in that way,” she says. Bill, please! “Journalists are not people who want to work a 9 to 5 job, they’re in for the experience and the adventure. We’re solo operators, but we have to work within an organism, which is the newsroom. Newspapers are very hierarchical, even though we’re all recalcitrant personalities who don’t like being told what to do.” With classic recalcitrance, I break the fourth wall to ask our off-duty journalist if she’s enjoying her turn in the Lunch With hot seat. “Are you checking in?,” Maley jokes. “It’s going great for me, but am I giving you what you need?” A master of the form, I ask Maley for her Lunch With advice – she’s got the recipe down, but I’m probably still chopping onions. “Just get them really drunk,” she deadpans. “It’s quite high pressure, I think. It’s like a social interaction on the surface, but your journalist brain is constantly working. ” A pause in proceedings: the main. Pappardelle with stracciatella and truss tomatoes so ripe they look ready to explode on impact. Maley unfolds a paper napkin and tucks it, bib-style, into the relaxed collar of her blue silk shirt. She catches my eye – the journalist’s brain, even now, still quietly whirring.\n\nAdvertisement\n\n“Can you not put this in the piece?” A pause, a sigh, a smile. “No, you can, if you want.” The same brain – always scanning for angles and incoming alerts– makes it hard for Maley to write fiction while working her day job. Journalism brings a constant overload of information, paired with the nagging sense you’re always missing something important. And while her reporting and novels both circle themes of gender and power, she doesn’t see them as flexing the same muscle. Jacqueline Maley did shifts at a restaurant while she was writing her second novel Lonely Mouth. Credit: Louise Kennerley Her ideal writing conditions are long, uninterrupted stretches away from work, not trying to wedge sentences between school drop-offs, play dates, early dog walks and breaking news alerts. Annual leave became writing leave – less a break than a change of deadlines. There was also the pressure of following up the success of her first novel and being contracted to a deadline as part of a two-book deal – a deadline she fell so far behind on that she can’t even precisely remember when it was. “I didn’t take a holiday in years,” Maley says. “So I ended up, at the end of it, realising it’s quite hard to juggle all of this. It took a toll on me in terms of stress levels, and so that was something that I wouldn’t want to do again. ” She’s got ideas bubbling away – another novel, maybe a non-fiction project – but for now, she’s letting them simmer. And at least restaurants are just restaurants again, no longer research sites in disguise.\n\nAdvertisement",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/lifestyle/health-and-wellness/living-better-for-longer-the-health-checks-for-your-40s-50s-and-beyond-20250526-p5m2el.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Living better for longer: The health checks for your 40s, 50s and beyond",
        "publish_date": "Wed, 11 Jun 2025 11:44:18 +1000",
        "category": "lifestyle",
        "authors": [
            "Shona Hendley"
        ],
        "text": "While there is no one-size-fits-all approach for preventative health checks, individual factors– including family or personal medical history, gender, ethnicity, and lifestyle – influence which tests a person should undertake, as well as when to begin them and the frequency at which they are performed. However, the Royal Australian College of General Practitioners (RACGP) does recommend certain health screens for the general population at each decade of life. Taking an active interest in your health increases your chances of living a long, full life. Credit: Getty Images In your 40s “By your early 40s, you should have a thorough check-up, including history and a full physical examination,” says Dunne.\n\nCertain regular health screenings should also begin. These include annual blood pressure monitoring from age 40 and STI tests if you are sexually active. Five-yearly blood tests for cholesterol, glucose, cell counts, and nutrition deficiency, as well as bowel cancer screening, should begin at age 45. Loading Skin cancer checks are recommended due to the increased risk with age, and due to a trend of increasing colon cancer in people under age 50, the Australian government has recently changed the starting age for colorectal cancer screening from 50 to 45, says Ding. In your 50s\n\nNatasha Yates, assistant professor of general practice at Bond University, says that people in their 50s should continue all the health screenings from their 40s, with the addition of some others. “Add a bone health assessment and consider screening for osteoporosis, especially if risk factors are present,” she says. “Vision and hearing tests to detect age-related changes are also recommended.” Yates says the National Lung Cancer Screening Program is due to commence in July this year. It will offer two-yearly low-dose CT scans to detect lung cancer in asymptomatic patients aged 50 to 70 who are deemed to be at high risk from smoking, she says. In your 60s\n\nIn addition to existing screenings, Yates says that a cognitive function evaluation, which assesses for signs of cognitive decline or dementia, should be undertaken. Similarly, a physical functioning screening for preventing falls and frailty should also be considered, adds Ding. 70s and beyond In your 70s, on top of existing checks, ensure your immunisations, including tetanus and shingles, are up-to-date, says Dunne. “There is a funded vaccination program for older Australians, including influenza, COVID, shingles and pneumococcal pneumonia,” he says. Gendered screenings\n\nDue to anatomy and physiology, women and men each have unique health risks, which warrant their own specific health screenings. “For example, whereas women are at risk of cancers of the cervix, ovaries and uterus, men are at risk of prostate cancer,” says Dunne. Breast screening is free for Australian women once they reach 40 years. Women aged 50 to 74 years will receive an invitation for screening from BreastScreen Australia. Credit: Getty Images Gender can also impact their approach to healthcare. “Unlike women, who are often introduced to regular health screenings from a young age, such as pap smears, breast checks, and GP visits for contraception, men typically don’t develop the same routine health-seeking behaviours,” Dunne says.\n\n“This makes early detection for men especially important, as they are more likely to delay seeking help until symptoms become severe.” Health screenings for men 40 + Men in their 40s should discuss with their GP screening tests for things like prostate cancer, high cholesterol, and type 2 diabetes. “Your GP will consider your individual circumstances, including family history, when recommending when to begin these tests,” says Dunne. Screening tests and regular GP check-ups should continue through your 50s and 60s.\n\nHealth screening for women 40 + Women are going through a lot during their 40s and 50s, says general practitioner Judith Hammond of women’s health clinic, Jean Hailes. “Peri menopause, menopause … women start to get to that sandwich generation, when they are working, worried about children who need support and supporting elderly parents, life really gets quite crushed around that time,” she says. In this period, it is increasingly important for women to undergo mental health screening, she says. Additionally, regular breast cancer screening via free mammograms can be undertaken from age 40.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/queensland/brisbane-news-live-millions-of-dollars-unaccounted-for-in-queensland-winter-chill-hits-brisbane-20250610-p5m69o.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Brisbane news live: Broncos new logo elicits mixed reviews; Jewellery store worker hit with hammer in armed hold-up; Calls mount for Crisafulli government to buy Toowong Private Hospital",
        "publish_date": "Wed, 11 Jun 2025 11:40:01 +1000",
        "category": "finance",
        "authors": [],
        "text": "News of a potential Broncos logo rebrand has elicited mixed reviews from fans online.\n\nRecords show Brisbane Broncos Corporation Pty Ltd submitted the design to IP Australia for trademark protection last week.\n\nAfter this masthead revealed the new design yesterday, punters were quick to vocalise their dislike of the new design.\n\n“Nope stick with the old logo thanks,” one punter said.\n\nAnother wrote: “If we go with this logo I won’t be buying Broncos merchandise.”\n\nA third said: “Hell no, there’s no Maroon, it’s our identity.”\n\nWhile the trademarked image is in black and white, a fully realised logo would most likely incorporate the Broncos’ club colours of maroon, white and yellow.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/queensland/watching-a-disaster-unfold-calls-mount-for-crisafulli-government-to-buy-brisbane-private-hospital-20250611-p5m6jc.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘Watching a disaster unfold’: Calls mount for Crisafulli government to buy Brisbane private hospital",
        "publish_date": "Wed, 11 Jun 2025 11:38:57 +1000",
        "category": "finance",
        "authors": [
            "Marissa Calligeros"
        ],
        "text": "The state opposition has joined 11th-hour calls for the Queensland government to swoop in and save one of Brisbane’s few mental health hospitals from closure.\n\nThe financially stricken Toowong Private Hospital, which treated 3000 patients annually, was set to close its doors on Wednesday after administrators brought in last month found no viable option to keep it open, and found no potential buyers.\n\nThe hospital’s chief executive, Christine Gee, denied rumours it was at risk of closing in September last year, despite a funding crisis involving health insurers that threatened the viability of private hospitals nationwide.\n\nToowong Private Hospital has been operating on Milton Road for more than 40 years. Credit: Facebook\n\nPatients and their treating psychiatrists were given just two weeks’ notice that the hospital would close, leaving doctors scrambling to find available beds at the few other facilities in Brisbane.",
        "source": "TheAge"
    },
    {
        "url": "https://au.news.yahoo.com/expat-reveals-astounding-ev-detail-on-roads-of-chinese-city-thats-on-another-level-074433718.html",
        "title": "Expat reveals astounding EV detail on roads of Chinese city that's on 'another level'",
        "publish_date": "2025-06-10T07:44:33Z",
        "category": "finance",
        "authors": [],
        "text": "Australia is miles behind China when it comes to adopting electric cars – and it means our cities are a lot louder.\n\nA Chinese city is completely silent despite cars and motorbikes on the roads. Source: TikTok/TheForeignerLIfe\n\nWhen visiting any city with a large population, most travellers would expect to jump off public transport and instantly be hit with a barrage of sights and sounds. However, one US expat living in China has revealed the incredible – and quite different – reality emerging in the county while on a recent visit to a neighbouring city.\n\nUS citizen Garrett took a trip to the city of Suzhou, about an hour from his home in Shanghai. Arriving there, he was left astounded while standing beside the road because, despite cars and motorbikes zooming past, there was virtually no traffic noise.\n\n\"Quite a busy intersection but super quiet,\" he told Yahoo News of the surprising moment, which highlights just how successful the uptake of electric vehicles has been in the Asian economic powerhouse.\n\n\"The silence on the streets is fantastic; even in a city of 30 million people, the streets are incredibly calm,\" he said.\n\nElectric car driving 'just normal' in China\n\nFor Garrett, he's seen firsthand that it's hard for Westerners to understand why this has happened.\n\nADVERTISEMENT\n\n\"As I have seen in China, sustainability isn’t political at all; it’s a widely acknowledged necessity for the planet and for economics,\" he said, explaining that EV-driving \"isn't cool, it's just normal\".\n\nIn 2024, China sold nearly 13 million fully electric and hybrid vehicles, meaning EVs accounted for 40 per cent of total sales in the Chinese market.\n\nThe number of sales is four times as many as the United States. In Australia, that figure was just 114,000 in the same time frame, according to the Electric Vehicle Council.\n\nAustralians are continuing to buy more electric vehicles than ever before, according to recent sales records. But traditional brands like Toyota and Ford still dominate new car sales, with Toyota topping the charts for an incredible 23 years.\n\nADVERTISEMENT\n\nGarrett said his Chinese colleagues are more surprised to hear that someone doesn't drive an EV.\n\n\"Many of my colleagues have EVs, and when I pointed that out, they responded with ‘oh, yeah, don’t you drive one?’,\" he said.\n\n\"In my view, I think it’s because people don’t seem to politicise sustainability.\"\n\nThis was laid bare as US President Donald Trump and Tesla CEO Elon Musk exchanged in a very public back-and-forth earlier this week, signalling their relationship may well be over.\n\nThe Tesla boss criticised the president's 'Big Beautiful Bill' aimed to fast-track policy around spending, revenue and the debt ceiling, which would see electric vehicle subsidies scrapped in the US.\n\n\"I don’t believe America will get to the level China is at ever without significant political change,\" Garrett said.\n\nADVERTISEMENT\n\n\"And as America is a very individualistic culture, it will be very hard to sell the public on the benefit to the greater society. Most people I know in China just say ‘Well, driving EVs is better for everyone and the government supports that'.\"\n\nThe Chinese EV giant is rolling out the world's largest roll-on/roll-off (ro-ro) carriers to send cars around the world. Source: BYD\n\nChina leading electric vehicle market around the world\n\nChina is leading the way with EV uptake largely due to government support through subsidies and tax breaks. Licence plates for regular cars with internal combustion engines face long waits and high costs to get the plates, but for EVs it's free.\n\nHomegrown support has helped Chinese automakers expand across the world, with countless new models hitting the market in Australia and worldwide seemingly every month.\n\nBYD took the world by storm when photos of its fleet of car carriers recently emerged. The brand, commonly seen on Aussie roads, is moving with \"unprecedented speed\" to overtake US rival Tesla as the global leader in electric vehicles.\n\nADVERTISEMENT\n\nCar expert Paul Maric recently returned from the Shanghai International Automobile Industry Exhibition, where Chinese car brands displayed their latest innovations.\n\n\"China is on another level entirely,\" he told Yahoo News recently.\n\n\"Anyone in Australia who thinks they’re just going to go away sometime soon is in for a shock.\n\n\"I think eventually it will just lead to cars becoming more affordable,\" he said of the growing expansion of the Chinese industry.\n\nDo you have a story tip? Email: newsroomau@yahoonews.com.\n\nYou can also follow us on Facebook, Instagram, TikTok, Twitter and YouTube.",
        "source": "Yahoo"
    },
    {
        "url": "https://au.news.yahoo.com/caravan-dad-left-gagging-after-nightmare-camping-mistake-060947116.html",
        "title": "Caravan dad left gagging after 'nightmare' camping mistake",
        "publish_date": "2025-06-10T06:09:47Z",
        "category": "finance",
        "authors": [],
        "text": "Families caravanning their way around the country may look like they're living the dream, but there is one dirty task which left this dad gagging.\n\nThere are plenty of things to love about caravaning around Australia. The vast landscapes, incredible sunsets, awe-inspiring wildlife and wide open spaces are just a few of the reasons why so many people are quitting their jobs, selling their houses and hitting the open road.\n\nBut just like life back home, there are jobs that you don't want to do. One such task in the caravanning world is emptying what's affectionately known as the \"devil's suitcase\". When the caravan toilet is filled with waste, it must be emptied at a designated dump point.\n\nBut it doesn't always go to plan, with regular instances of the dirty task going awry. One caravanning dad learnt the hard way just how wrong it can go when he dropped the lid down the dump point into piles of human waste below.\n\nWhile some may simply accept their fate and give up on the lost item, determined dad Ashley Moy, who was staying in Alice Springs with his family at the time, told Yahoo News it was too \"important\" to leave behind.\n\nADVERTISEMENT\n\n\"If you don't have the cap, you run the real risk of your waste sloshing out of the cassette,\" he said, describing that scenario as \"yuck\".\n\nHow did caravan dad lose cassette toilet lid?\n\nAshley told Yahoo the family of five, who are doing a 12-month lap of the country, had just arrived in Alice Springs in the Northern Territory when they realised their caravan toilet needed emptying. He sarcastically said it's a \"very common but enjoyable chore\" all caravanners must undertake.\n\n\"We found the local toilet dump site and began emptying out the waste from inside the casette,\" he said. \"The casette has a great lid that screws onto the casette, you unscrew the lid when emptying it.\"\n\nADVERTISEMENT\n\nWhen he was finished, he packed away the hose used to clean out the cassette, and \"knocked the cap into the dump point hole\" and into the septic tank down below.\n\nArmed with a pair of tongs, the Aussie dad attempted what many would simply refuse to do and put his hand down the dump point. In a clip shared online, the dad is seen gagging while his wife Rachel cackles in the background as she films.\n\nIncredibly, after gagging a few times, the dad manages to get the cap out of the septic tank by putting his entire arm down the dump point hole.\n\nSome viewers described the scene as their \"worst nightmare\".\n\n\"I'm dry heaving just watching this, I can’t imagine doing it,\" said another.\n\nLuckily, the dad was able to retrieve the item and avoided the risk of human waste sloshing around in his caravan.\n\nADVERTISEMENT\n\nBut if you're wondering what happened to the tongs after the deed was done, Ashely said: \"Let's leave the tongs up to people's imagination\".\n\nDo you have a story tip? Email: newsroomau@yahoonews.com.\n\nYou can also follow us on Facebook, Instagram, TikTok, Twitter and YouTube.",
        "source": "Yahoo"
    }
]