[
    {
        "url": "https://www.9news.com.au/national/myer-brand-sass-and-bide-to-close-down-within-weeks/ac80f6c9-055a-4ad7-b9a8-affef2811e31",
        "title": "Cult Australian designer clothing brand to close down within weeks",
        "publish_date": "Fri, 16 Jan 2026 01:59:41 +0000",
        "category": "finance",
        "authors": [
            "Jan"
        ],
        "text": "Cult ﻿ Australian designer clothing brand Sass & Bide has announced it will shut down all its physical and online stores within weeks as it tries to become relevant to younger generations.\n\nThe Myer-owned label said it was reinventing the brand and the closure was not goodbye, but a \"see you soon\".\n\n\"From the end of January 2026, our stores and MYER concessions will be closed. From the end of February 2026, our online store will close, too,\" a statement on the brand's website said.\n\nREAD MORE: ﻿ Future of Bondi footbridge on hold after council pushes back decision\n\nSass & Bide is an Australian women's fashion company. (Facebook)\n\n\"While we're offline, we'll be re-imagining what Sass & Bide can and should look like.\n\n\"The direction may be new, but a free-spirited and distinctly Australian attitude is at the heart of who we are, and that will never change.\n\n\"We know this change may come as a surprise.\n\n\"But at Sass & Bide, we've never been ones for following the rules.\"\n\nMyer Group said the rebrand would keep the label relevant for a new generation as the wider department store goes through a refresh of its own later this year.\n\n\"We have spent considerable time listening to our customers hearing from them about the brands they like and those they don't,\" a spokesperson said.\n\n\"This feedback is helping shape our strategy to provide customers with a more elevated product offering across our apparel range.\"\n\nMyer said Sass & Bide will be relaunched in the coming months.\n\nCustomers are unable to return or exchange sale items unless faulty, but are still able to refund full-price items within 14 days.\n\nThey are still able to use gift cards until the company stops trading. After that, the gift cards can be traded in for a Myer gift card of the same value.\n\nREAD MORE: ﻿ Unwelcome sign nasty interest rate shock is on the way\n\nSass & Bide stores will shut within weeks. (Dominic Lorrimer)\n\nSass & Bide was founded by Sarah-Jane Clarke and Heidi Middleton in 1999 and sells women's clothing and accessories across Australia.\n\nThe brand has physical stores in all states except Tasmania, the Northern Territory and the Australian Capital Territory.\n\nIts items are also found in Myer after ﻿the department store purchased a 65 per cent share from under David Jones in 2011.\n\nMyer went on to purchase the remaining 35 per cent of the brand, and Clarke and Middleton left the company in 2014.\n\nThe department store will launch 20 new local and international brands by the end of July as part of a broader rebrand keep up with changing demand and trends.\n\n\"The launches are just the start, with a strong pipeline of new and renowned brands set to join Myer throughout the year,\" a Myer Group spokesperson said.\n\n\"Each new addition has been carefully selected to complement our existing portfolio and to meet the growing demand for contemporary, high‑quality, and trend‑driven fashion.\"",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/world/future-of-nato-will-us-withdraw-greenland-crisis-article-5-withdrawal-impacts-explained/190cd0ba-8100-4561-aa59-85ccc5d01bdb",
        "title": "What the Greenland dispute means for NATO - and the future of Europe",
        "publish_date": "Thu, 15 Jan 2026 19:32:56 +0000",
        "category": "finance",
        "authors": [
            "Jan"
        ],
        "text": "It's winter in the northern hemisphere, and the weather is reflecting the frosty mood between Donald Trump and some of his key allies.\n\nThe US president has made it clear he wants the Arctic island of Greenland to come under his control, but he is being rebuffed by both the autonomous territory and Denmark , a NATO ally that still administers it.\n\nNATO nations, including the UK , France and Spain , have stood behind Greenland, with fears the disagreement could lead to the US leaving the crucial alliance.\n\nGreenland is home to just over 56,000 residents, yet it's causing tensions that could upend Europe. (Odd Andersen/AFP/Getty Images)\n\nSo will Trump make a decisive move to take over Greenland and what would that look like for the NATO alliance, Europe and beyond?\n\nWhy does the US want Greenland?\n\nIt's easy to wonder why an icy European island with a population of just 56,000 people is so coveted by the mightiest country on earth, but it holds great strategic importance .\n\nIts location between the US and Europe is key, as it sits in a corridor called the GIUK gap, a maritime passage between Greenland, Iceland and the UK.\n\nREAD MORE: ﻿ Iran slams airspace shut as death toll climbs\n\nGreenland's importance is underlined by its abundance of natural resources. (Hannibal Hanschke/Reuters via CNN Newsource)\n\nIt links the Arctic to the Atlantic Ocean, making it a vital shipping route when considering Greenland's natural resources.\n\nThe island holds large deposits of oil, gas and rare earth minerals, which are hugely important in a geopolitical context as the US faces a battle to stay on top of China .\n\nThey are also critical to the world economy, used in the manufacture of electric cars, wind turbines and military equipment.\n\nWill the US leave NATO over the Greenland dispute?\n\nTrump has threatened to pull out of the NATO alliance before, including at the end of 2024, when he cited low defence spending numbers of several allies.\n\nHe has not specifically threatened to leave the 77-year alliance during the latest Greenland dispute, dodging the question when asked by reporters in recent days .\n\n\"You don't know what I'm going to do,\" he said in response to questions of whether he would leave NATO.\n\n\"I wouldn't be telling you what I'm willing to do - certainly I'm not going to give up options - but it's very important.\"\n\nPresident Donald Trump has been coy on whether or not he will seek to remove the US from the NATO alliance. (AP)\n\nLaws drafted in before Trump's second term prohibit him from removing the US from the alliance without approval of a two-thirds Senate super-majority or an act of Congress.\n\nBut you also aren't supposed to capture a sitting head of state of another country in the dead of night, and Trump seemed comfortable breaking those rules in Venezuela.\n\nCan NATO survive without the US?\n\nAsk many key European leaders and officials, and they will tell you the US is the bedrock of the NATO alliance.\n\nA key issue is Article 5 in the treaty, which says an attack on one is an attack on all.\n\nWith Greenland part of Denmark, and Denmark being a NATO member, this creates a clear problem.\n\nDanish Prime Minister Mette Frederiksen was frank in her view on the matter.\n\nDanish Prime Minister Mette Frederiksen believes NATO will collapse without the US. (AP)\n\n\"If the United States chooses to attack another NATO country militarily, then everything stops,\" Frederiksen told Danish broadcaster TV2 last week.\n\n\"That is, including our NATO and thus the security that has been provided since the end of the Second World War.\"\n\nTrump also seems to think NATO wouldn't last should the US pull out, judging by his comments yesterday.\n\n\"I'm the one that saved NATO,\" he said on Air Force One.\n\nHow have Russia and China reacted to the Greenland dispute?\n\nRussia and China are clearly a motivator for Trump's hawkish instincts on Greenland, as he claims matters of national security.\n\n\"NATO should be leading the way for us to get it [Greenland]. IF WE DON'T, RUSSIA OR CHINA WILL, AND THAT IS NOT GOING TO HAPPEN!\" he wrote on Truth Social this week.\n\nChina has an Arctic policy called the Polar Silk Road, launched in 2018, but a spokesperson for the government insisted their goals weren't military.\n\nREAD MORE: Trump freezes immigrant visas for 75 countries in latest crackdown\n\nRussian President Vladimir Putin could benefit from the US leaving NATO, or at the very least destabilising it. (AP)\n\n\"China's activities in the Arctic are aimed at promoting peace, stability, and sustainable development in the region and are in accordance with international law,\" Chinese Foreign Ministry spokesperson Mao Ning said earlier this week.\n\nOn the Russian side, top officials have made cryptic remarks regarding their views on Greenland.\n\n\"Trump needs to hurry. According to unverified information, in a few days there could be a sudden referendum, at which the entire 55,000-strong Greenland could vote to join Russia,\" former Russian President Dmitry Medvedev said earlier this week, according to Interfax.\n\nAny turbulence with NATO would no doubt help Russian President Vladimir Putin in his war in Ukraine , with the alliance being a key supporter of the country Putin has been at war with since 2022.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/commonwealth-bank-macquarie-bank-raise-fixed-home-loan-rates/63c359b4-4801-48ec-b9e0-b4cbeccc623c",
        "title": "Unwelcome sign nasty interest rate shock is on the way",
        "publish_date": "Thu, 15 Jan 2026 20:27:24 +0000",
        "category": "finance",
        "authors": [
            "Jan"
        ],
        "text": "Australia's biggest bank has hiked its fixed home loan rates, in a worrying sign that could forecast an interest rate increase by the Reserve Bank.\n\nCommonwealth Bank yesterday increased owner-occupier rates by up to 0.7 percentage points, to make its lowest fixed loan rate now 5.79 per cent for a two-year term.﻿\n\nMacquarie Bank﻿ also, on the same day, lifted rates by 0.25 per cent across all fixed loan terms, bringing its lowest rate to 5.59 per cent for a one-year term.\n\nColorful australian dollars laying on wooden table (Getty)\n\nMacquarie previously increased its rates on December 5.﻿\n\nAs a result of these changes, NAB now offers the lowest fixed rate out of the major banks, at 5.39 per cent for both one-year and two-year terms.\n\n\"The move follows on from hikes from the other majors in December as the fixed rate market continues to factor in the possibility of a higher cash rate,\" Canstar data insights director Sally Tindall said.\n\nThe RBA next meets to determine the cash rate on February 2﻿.\n\nIt has held interest rates at 3.6 per cent for several months now, amid worries over stubborn inflation.\n\nTindall said Canstar expected banks to continue hiking rates ahead of the next meeting.\n\nREAD MORE: US seizes sixth sanctioned tanker it says has ties to Venezuela ﻿\n\nCommonwealth Bank has hiked its fixed home loan rates. (Eamon Gallagher)\n\n\"The fixed rate tide is on the way out, but there's still a smattering of lenders still offering rates under 5 per cent. How long they'll hold on is a different question,\" she said.\n\n\"Canstar data show there are just 16 lenders offering a rate under 5 per cent - a significant drop from 27 a month ago.\n\n\"If this trend continues, as we expect it to, the list of lenders offering fixed rates starting with a '4' could be down to single digits by the time the next RBA meeting comes around.\"\n\nRate tracking by Canstar showed a total of 34 lenders had hiked at least one fixed rate in the past month.\n\n﻿The big banks have offered mixed predictions for the cash rate in the new year, but both CBA and NAB have predicted it will again be increased.\n\nOthers at the end of last year suggested it would continue to hold steady, but without further cuts.﻿",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/jeanswest-ai-advertising-social-media-expert-reactions/a5a1d68d-45ee-44bb-bc77-38a59ccc0c29",
        "title": "Legacy Aussie retailer lashed over this image: 'Garbage'",
        "publish_date": "Fri, 16 Jan 2026 01:57:31 +0000",
        "category": "finance",
        "authors": [
            "Jan"
        ],
        "text": "L﻿ess than three months ago, industry experts told 9news.com.au the use of generative AI in advertising will be much more common in the future.\n\nJeanswest has proven them right far sooner than expected.\n\nThe fashion retailer, which has gone into administration twice in the last six years, has been called out by consumers for using generative AI extensively in advertising online.\n\nREAD MORE: Unwelcome sign nasty interest rate shock is on the way\n\nMany promotional images on the Jeanswest website appear to be AI-generated. (Jeanswest)\n\nInstagram videos show AI models posing in digital versions of Jeanswest styles, and the brand's website ﻿is stacked with AI-generated photos and videos.\n\n9news.com.au has contacted Jeanswest for comment.﻿\n\nA Jeanswest customer support representative confirmed the ﻿content was AI-generated in a statement to the Sydney Morning Herald.\n\nREAD MORE: Man wounded in early morning shooting in Sydney\n\nThe representative told the SMH that ﻿AI is one of many tools in the brand's creative workflow and said it is dedicated to maintaining authenticity and relatability.\n\nProduct photos on the Jeanswest website do not appear to be AI-generated or altered.\n\nConsumers have voiced frustration and disappointment with the brand's heavy use of generative AI on social media, calling it \"garbage\".\n\nA screenshot from an AI-generated video posted to the official Jeanswest Instagram account. (Instagram/@jeanswest)\n\nOne comment on an AI video on the Jeanswest Instagram page called for the people responsible for approving the clip to be fired.﻿\n\nOn TikTok, an Australian user called content on the brand's website \"AI slop\"﻿.\n\n﻿\"At the moment, there are a lot of brands trying to use AI and using it in a really clumsy way that's getting a lot of ridicule,\" consumer psychologist, creative strategist, and Thinkerbell founder Adam Ferrier﻿ previously told 9news.com.au.\n\nBut AI can be a powerful marketing tool when used well and Ferrier﻿ said it will become more common in advertising as brands become better at using it.\n\nUniversity of Sydney Business School lecturer and consumer psychologist Dr Christina Anthony said it's likely that consumers will not react as strongly to AI ad campaigns as they become more normalised.\n\n\"And ﻿most brands won't abandon generative AI as the efficiencies are too valuable,\" she previously told 9news.com.au.\n\nInstead, they'll work towards making AI content that feels more authentic and human-centred – so much so that it may become undetectable.\n\nNew data has shown that more than half of Australians are unable to tell the difference between a real image and a deepfake .\n\nThough consumers seem to have spotted Jeanswest's clunky AI content without any issue, future generative AI ad campaigns made with rapidly improving technology will likely be harder to identify﻿.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/donald-trump-organisation-family-investment/5ec586fc-195a-4fa5-8520-790abd60806b",
        "title": "Trump family eyeing Gold Coast property as latest investment",
        "publish_date": "Fri, 16 Jan 2026 00:55:16 +0000",
        "category": "finance",
        "authors": [
            "Jan"
        ],
        "text": "Donald Trump's family is eyeing their first Trump-branded property on Australian soil, with the Gold Coast the likely destination.\n\nConversations are underway to build a Trump Tower on the beach at Surfers Paradise .\n\nThe property is located on 3 Trickett Street, and has been a vacant block of land since 2013.\n\nThe prime piece of real estate is on the Esplanade, the main drag running alongside the beach.\n\nThe site has been in development hell since the Iluka Resort was demolished.\n\nThe Trump Organisation is now being run by the president's sons Donald Jr and Eric .\n\nThey have been prolific in expanding their portfolio globally.\n\nThey have upcoming projects in Saudi Arabia, Oman, Dubai, India, Vietnam, Romania, Qatar and Indonesia.\n\nREAD MORE: Donors give hundreds of thousands to Trump heckler\n\nDonald Jr and Eric Trump now run the Trump Organisation. (AP)\n\nIt currently has multiple properties in the US as well as Dubai, Indonesia, India, Oman, the Philippines, Qatar, Romania, Saudi Arabia, South Korea, Turkey, Uruguay and Vietnam.\n\nThe previous plan for a skyscraper on the property. (DBI)\n\nBut most of their projects are not owned by the organisation but are simply branding deals - that is, developers pay the Trumps to put their name on the building.\n\nThe details of the prospective deal have not been made public.\n\nNo development application has been made to Gold Coast Council.\n\nIn 2016, a proposal was made to build the third-tallest building in Australia on the site.\n\nThe building would have had 479 luxury apartments, a rooftop pool and a series of restaurants.\n\nThe residential skyscraper was given approval by council but the $1.2 billion project never eventuated.\n\nNow all that remains is the basement construction work.\n\nThe property was sold for a loss in 2019.\n\nWhen Donald Trump himself was in Australia in 2008 he said he wouldn't invest in the country without a partner.\n\n\"If I do something in Australia, I'd want to have a partner in Australia,\" he told the Australian Financial Review .\n\nBut his wealth has exploded since then, especially in his past year as president.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/sexual-harrassment-at-work-most-people-still-wont-report-it-study-finds/c7c003e5-2428-4a75-8112-3fa614723ed9",
        "title": "Alarm bells over scale of unreported sexual harassment at work",
        "publish_date": "Fri, 16 Jan 2026 01:24:20 +0000",
        "category": "finance",
        "authors": [
            "Jan"
        ],
        "text": "Alarming new findings have shown ﻿that despite recent legal reforms and efforts to change toxic workplace cultures, most people who are sexually harassed at work still do not report it.\n\nTwo new studies from Flinders University suggest that it is not just the fear of retaliation that stops people from speaking, but also feeling unsupported by systems that will not protect them.\n\nThe lead author of both studies, Dr Annabelle Neall, a senior lecturer in mental health and wellbeing, and director of the Flinders Workplace Wellbeing Lab, says that only about one in five people who experienced harassment went on to report it.\n\nREAD MORE: Future of Bondi footbridge on hold after council pushes back decision ﻿\n\nPeople who are sexually harassed at work often still don't report it. (Getty Images/iStockphoto)\n\n\"The decision not to report wasn't just about external risks like losing a job, it was also deeply tied to internal struggles,\" Neall said.\n\n\"People weigh up whether reporting will make things better or worse and they often concluded it wasn't worth the emotional toll, the risk to their reputation, or the likelihood that nothing would change.\"\n\nThe research identified three key psychological needs that influence reporting: autonomy (feeling in control), competence (feeling capable), and relatedness (feeling respected and supported).\n\nREAD MORE: Almost 5 million Aussie social media accounts wiped in a single week ﻿\n\nPeople say they do not feel supported in reporting harassment. (Getty)\n\nWhen these needs are undermined - by unclear processes, fear of backlash, or a lack of trust in the system - people are far less likely to speak up.\n\n\"Victims and witnesses feel that they're having to choose between protecting themselves and speaking up, and that pressure makes the decision emotionally charged and very difficult,\" co-author Professor Lydia Woodyatt said.\n\n\"If people believe the system won't provide them justice or protect them, they stay silent. That silence isn't about indifference, it's about survival.\"\n\nResearchers called for more positive and empathetic workplace cultures. (Getty)\n\nParticipants described feeling unsure whether their experience \"counted\" as harassment, fearing career damage, and doubting that reporting would lead to meaningful action.\n\nMany worried about being labelled as troublemakers or weak. Others said the process itself felt punishing, with burdensome steps and little reassurance.\n\nOne of the studies, a historical review of workplace sexual harassment reporting and investigation, found these challenges were not new.\n\nWhile laws and policies have evolved since the 1980s, the research revealed that reporting systems remained largely ineffective.\n\n\"For decades, organisations have focused on legal compliance and punitive measures, but these approaches often fail to address the cultural and psychological barriers that keep people silent,\" Neall said.\n\nBoth studies call for a shift towards trauma-informed and transformative justice approaches, which move beyond punishment to address the root causes of harassment and create cultures of respect.\n\n\"People told us they didn't want revenge, but rather that they wanted assurance that it wouldn't happen again,\" Neall said.\n\n\"Reporting should feel like a step towards positive change, not a risk to your wellbeing.\"",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/video-games-time-limit-before-bad-health-effects-kick-in-australia-study/005d9f60-b64e-4b84-899e-863781e808aa",
        "title": "How much video gaming is too much? Study pinpoints health limit",
        "publish_date": "Thu, 15 Jan 2026 23:32:09 +0000",
        "category": "lifestyle",
        "authors": [
            "Jan"
        ],
        "text": "Video games might not rot your brain - but new evidence suggests they can have a marked effect on your health.\n\nA new study led by Curtin University surveyed 317 students from at Australian universities, with a median age of 20.\n\nThe participants were split into three groups classes as \"low gamers\" (zero to five hours playing video games per week), \"moderate gamers\" (five to 10 hours)﻿, and \"high gamers\" (over 10 hours).\n\nREAD MORE: Almost 5 million Aussie social media accounts wiped in a single week ﻿\n\nExcessive video gaming has been linked to bad health outcomes. (Getty)\n\nThe research team found while low and moderate gamers reported similar health outcomes, results worsened dramatically once gaming exceeded 10 hours a week.\n\nProfessor Mario Siervo, from the Curtin School of Population Health, said the findings suggested excessive gaming was the key issue, rather than gaming itself.\n\n\"What stood out was students gaming up to 10 hours a week all looked very similar in terms of diet, sleep and body weight,\" Siervo said.\n\n\"The real differences emerged in those gaming more than 10 hours a week, who showed clear divergence from the rest of the sample.\"\n\nThe study found a decline in diet quality once gaming exceeded 10 hours per week, with a greater prevalence of obesity in the high gamers group, compared to the low and moderate gamers.\n\n\"Each additional hour of gaming per week was linked to a decline in diet quality, even after accounting for stress, physical activity and other lifestyle factors,\" Professor Siervo said.\n\nExcessive gaming was also linked to poor sleep habits. (Getty)\n\nAll groups reported generally poor sleep quality, but moderate and high gamers scored worse than low gamers, with gaming hours showing a significant link to sleep disruption.\n\n\"This study doesn't prove gaming causes these issues, but it shows a clear pattern that excessive gaming may be linked to an increase in health risk factors,\" Professor Siervo said.\n\n\"Our data suggests low and moderate gaming is generally fine, but excessive gaming may crowd out healthy habits such as eating a balanced diet, sleeping properly and staying active.\n\n\"Because university habits often follow people into adulthood, healthier routines such as taking breaks from gaming, avoiding playing games late at night and choosing healthier snacks may help improve their overall wellbeing.\"",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/victoria-flash-flood-clean-up-begins-holidaymakers-trapped/0d732377-d157-4ca8-9d00-f4d16619c75a",
        "title": "Holidaygoers trapped in flash floods open up on moment 'tsunami' hit",
        "publish_date": "Thu, 15 Jan 2026 21:13:45 +0000",
        "category": "finance",
        "authors": [
            "Jan"
        ],
        "text": "T﻿wo holidaygoers caught in yesterday's \"tsunami\" flash flood in Victoria have spoken of the \"chaos\" that erupted as surging waters rose.\n\nAt least one person had to be rescued from a roof yesterday and multiple cars were swept away ﻿in Wye River, Kennett River, Cumberland River and Lorne.\n\nSeveral waterways burst their banks at the popular Victorian holiday spot following a deluge of 180mm of rain in less than five hours.\n\nREAD MORE: Unwelcome sign nasty interest rate shock is on the way ﻿\n\nDarren Schonewille and Matthew Clark were caught in Victoria's flash flood yesterday. (Today)\n\n\"It was a pretty crazy sight,\" holidaygoer Darren Schonewille told Today this morning.\n\n\"Just to see how, like, quick the water rose, and the chaos.\"\n\nHe said the flood had come up suddenly.\n\nCars underwater in the Wye River flood. (9News)\n\n\"We were a little bit trapped, I guess, in terms of we were at the front of the and so it was quite hard to get in and help anyone out,\" fellow holidaygoer Matthew Clark said.\n\n\"Seeing those cars float out and then trying to get around those people who lost belongings pretty quickly, it was pretty traumatic for the people.﻿\"\n\nThe Great Ocean Road remains closed in both directions between Lorne and Skenes Creek due to the flooding and the fear of possible landslides.\n\nCars were even swept out to sea. (Supplied)\n\nCoach services are taking detours, while drivers are urged to detour using the Princes Highway via Colac.﻿\n\n\"Transport Victoria reminds the community of the extreme danger of travelling in the current conditions,\" Transport Victoria said in a notice.\n\n\"Roads may be closed and public transport routes may be cancelled at short notice.\"\n\nVic Emergency's latest update, posted at midnight, said the threat of immediate flash flooding had passed.\n\nPeople were caught by surprise. (Nine)\n\n\"Dangerous hazards including floodwater, mud, debris, damaged roads and fallen trees are still be present,\" the update read.\n\nEmergency relief centres have opened at Lorne Stribling Reserve, 45 Otway Street, Lorne; and at Apollo Bay P12 College, Pengilley Avenue, Apollo Bay.\n\nThe Bureau of Meteorology has cancelled two severe weather warnings for Victoria, and no new ones are in place.﻿",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/perth-cottlesoe-beach-greek-tourist-ioannis-vidiniotis-may-never-walk-again/9c8fd294-21c0-44a5-9438-9c0519054c20",
        "title": "Tourist may never walk again after NYE tragedy at popular Aussie beach",
        "publish_date": "Thu, 15 Jan 2026 10:32:27 +0000",
        "category": "sports",
        "authors": [
            "Jan"
        ],
        "text": "Ioannis Vidiniotis, 28, was swimming with his loved ones at Cottesloe Beach in\n\nPerth\n\n- the city's postcard 1.5km stretch of sand - on New Year's Eve when he struck his head on a sandbank.",
        "source": "9News"
    },
    {
        "url": "https://www.abc.net.au/news/2026-01-16/stephen-peters-calls-out-lack-of-investment-in-women-football/106234734",
        "title": "Perth Glory Women's coach calls for more investment in Australia's 'forgotten' league",
        "publish_date": "Fri, 16 Jan 2026 01:20:29 +0000",
        "category": "sports",
        "authors": [],
        "text": "Perth Glory Women's coach Stephen Peters has criticised a lack of investment in the women's A-League, which he says has not reaped the benefits of the Matildas' success at the 2023 FIFA Women's World Cup.\n\nIn recent years, the Glory's women's side has been Perth's saving grace, as the men's team suffered back-to-back wooden-spoon finishes.\n\nDespite this, they consistently draw a small, but dedicated, home crowd of just under 1,000 people, while the Glory men's worst Perth audience this season was just over 5,000.\n\nSpeaking to media ahead of Sunday's game against the Central Coast Mariners, Peters said he felt progress had plateaued and money was not going to where it was most needed.\n\n\"Our league seems to get forgotten,\" he said.\n\n\"Everyone obviously celebrates the success of the Matildas, which is unbelievable, but is that money being reinvested into the league in the way it should be?\n\n\"Are there enough people putting hands in pockets to invest in the sport?\n\nFor Stephen Peters, more action needs to be taken. (Supplied: Tom McCarthy)\n\n\"I don't know but we've got to catch up.\"\n\nPeters called for improved governance, better conditions and salaries for players, and the introduction of Video Assistant Referee (VAR) technology.\n\n\"We're probably the only league that doesn't have VAR,\" he said.\n\n\"So whatever needs to happen for that to happen, whatever stadiums we need to play at, we need to make that happen.\"\n\nPlayers desperate to focus on the game at hand\n\nMost A-League women's players are currently only contracted for just under nine months of the year on a minimum salary of $26,500.\n\nPeters said getting players on 12-month contracts was a top priority to allow them to focus on injury prevention in the off-season, with many currently playing in the second-tier National Premier Leagues (NPL) to make ends meet.\n\nMischa Anderson (left) reflects on the challenges of being a female athlete. (Supplied: Tom McCarthy)\n\nGlory player Mischa Anderson said most of her team mates juggled second and third jobs outside of their A-League commitments.\n\n\"It's quite hard for a lot of us girls to be professional athletes, for example I work two other jobs,\" the 19-year-old said.\n\n\"I think a lot of girls struggle with that. We don't get as much rest, we have to do jobs after we come in here and I think it maybe affects our game some times.\n\nMatildas inspire new generation of boys Kids in regional WA had the opportunity to see their heroes up close at home for the first time when the Matildas took on Panama in Bunbury this weekend.\n\n\"But that's the stuff you've got to do.\"\n\nSwiss-born Glory defender Onyinyechi Zogg said while the A-League still had a way to go, that growth potential was part of what had drawn her here.\n\nZogg, who has played for clubs around the world, said she was keen to bring her experience to a new landscape.\n\n\"I saw [the club] wants to really invest, they want to build something with it,\" she said.\n\n\"It's definitely a good feeling to be part of that growth.\"\n\nOnyinyechi Zogg (left) believes there is much potential in the league. (Supplied: Tom McCarthy)\n\nZogg said Australia should look to England, where the women's league was fully professionalised in 2018 and has since enjoyed an uptick in game attendance.\n\n\"I really hope with the [AFC Asian Cup] that's coming up that it will give another push and we can accomplish this 12-month contract so that everybody can literally focus on football and the level and everything will increase after that,\" she said.\n\n\"That's definitely our main goal because I think it's really necessary for the next generation as well.\"\n\nPerth will host the Asian Cup in March.\n\nReport reveals downturn\n\nA report released on Wednesday by Professional Footballers Australia (PFA) echoed the experiences of players like Anderson and Zogg.\n\nIt found the women's A-League was losing ground to global leagues and rival domestic sports despite strong international interest in women's football, with a 26 per cent downturn in game attendance for the 2024-25 season compared to the year prior.\n\nDespite the Matildas' popularity, the women's A-League is facing a downturn in crowd attendance, according to the report. (ABC South West WA: Bridget McArthur)\n\nNewly appointed Football Australia chief executive Martin Kugeler said he agreed there was untapped potential in women's sport and that higher investment correlated to better games and bigger audiences.\n\n\"We will work with all stakeholders in strengthening and building that in the future,\" he said.\n\n\"There's a new management at the A-Leagues, and I'm really looking forward to engage with the team to think about how we jointly can work together.\"\n\nKugeler's deputy, former player Heather Garriock, said moving forward there would be a head of men's football and a head of women's football.\n\nShe said it was the first time this had not been a combined role.\n\nThe ABC of SPORT Sports content to make you think... or allow you not to. A newsletter delivered each Saturday.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2026-01-16/engaged-couple-kubler-inglis-through-aus-open-main-draw/106236722",
        "title": "Engaged Aussie tennis stars qualify for Open within an hour of each other",
        "publish_date": "Fri, 16 Jan 2026 01:05:29 +0000",
        "category": "sports",
        "authors": [],
        "text": "Newly-engaged tennis couple Maddison Inglis and Jason Kubler have sealed Australian Open qualification within an hour of each other to read the main draw of the tournament.\n\nKubler had fought back from a set down against Alexander Blockx before the German retired when the Australian was leading 3-6, 6-3, 1-0.\n\n\"I wasn't sure if I would be back,\" he said.\n\n\"I played [the Open] a couple years ago, and it's been a bit of a bumpy ride since then.\n\n\"But fortunately for me, today, it worked out, and I get another chance, which is nice.\"\n\nJason Kubler was able to watch his fiancée make it into the AO main draw. (AAP: Lukas Coch)\n\nKubler was able to see Inglis seal a 6-4, 6-4 win over Germany's Tamara Korpatsch and claim her first main draw berth since 2022.\n\n\"To see her get over the hump and qualify — it's just so cool,\" he said.\n\n\"I would actually say I felt happier watching her do that than I did at the end of my match.\"\n\nInglis and Kubler, who got engaged in December, played at the same time all week — and she initially didn't realise he had won.\n\n\"I saw he lost the first set and then he was over to my match not too much longer after, so I was like, 'oh bugger, he must have lost in straight [sets],\" Inglis said.\n\n\"It was a really special moment.\n\n\" It's pretty crazy. It's not every day you both get through qualifying, and are in the main draw of a grand slam. \"\n\nIn his first main draw since 2024, Kubler's reward is a daunting first-round match-up with world number 29 Francis Tiafoe.\n\nAustralian Open 2026: Everything you need to know With the 2026 Australian Open just around the corner here's everything you need to know about the tournament.\n\nInglis will take on fellow Australian Kimberly Birrell.\n\nMeanwhile, self-described scrapper Dane Sweeny also battled his way into the main draw while fellow local hope Storm Hunter completed a return after serious injury.\n\nIt's the first time since 1992 that four Aussies have reached the Australian Open through qualifying.\n\nThere are 21 Australians for fans to cheer on this year — 11 men and 10 women — across the two main draws.\n\nAAP",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2026-01-16/sporting-event-exemptions-us-visa-ban-trump/106236490",
        "title": "US announces 'major sporting event' exemptions from broad visa bans",
        "publish_date": "Fri, 16 Jan 2026 00:21:53 +0000",
        "category": "sports",
        "authors": [],
        "text": "The Trump administration has identified a host of athletic competitions it classifies as \"major sporting events\" — aside from soccer's 2026 World Cup and the 2028 Olympic Games — that athletes and coaches will be allowed to travel to the US to take part in, despite a broad visa ban on nearly 40 countries.\n\nIn a cable sent to all US embassies and consulates, the State Department said athletes, coaches and support staff for the World Cup, the Olympics and events endorsed or run by a long list of collegiate and professional sporting leagues and associations, would not be subject to the full and partial travel bans that apply to citizens of 39 countries and the Palestinian Authority.\n\nHowever, the cable made clear that foreign spectators, media and corporate sponsors planning to attend the same events would still be banned unless they qualify for another exemption.\n\nUS to suspend immigrant visa processing for 75 countries The US State Department will suspend processing of immigrant visas for people from 75 countries, including Fiji, Cambodia, Thailand, Somalia and Brazil, from January 21.\n\n\"Only a small subset of travellers for the World Cup, Olympics and Paralympics, and other major sporting events will qualify for the exception,\" it said.\n\nDonald Trump's administration has issued a series of immigration and travel bans as well as other visa restrictions as part of ongoing efforts to tighten US entry standards for foreigners.\n\nAt the same time, the administration has been looking to ensure that athletes, coaches and fans are able to attend major sporting events in the US.\n\nTrump's December 16 proclamation banning the issuance of visas to the 39 countries and the Palestinian Authority had carved out an exception for athletes and staff competing in the World Cup, the Olympics and other major sporting events. It delegated a decision on which other sporting events would be covered to Secretary of State Marco Rubio.\n\nWednesday's cable lists the events that are covered, including \"all competitions and qualifying events\" for the Olympic Games, Paralympic Games, Pan-American Games, and Para Pan-American Games; events hosted, sanctioned or recognised by a US National Governing Body; all competitions and qualifying events for the Special Olympics; and official events and competitions hosted or endorsed by FIFA, soccer's governing body, or its confederations.\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\nThe exemption also will cover official events and competitions hosted by the International Military Sports Council, the International University Sports Federation and the National Collegiate Athletic Association as well as those hosted or endorsed by US professional sports leagues such as the National Football League, the National Basketball Association and Women's National Basketball Association, Major League Baseball and Little League, National Hockey League, Professional Women's Hockey League, NASCAR, Formula 1, the Professional Golf Association, Ladies Professional Golf Association, LIV Golf, Major League Rugby, Major League Soccer, World Wrestling Entertainment, Ultimate Fighting Championship and All Elite Wrestling.\n\nThe cable said other events and leagues could be added to the list.\n\nOf the 39 countries, a full travel ban applies to Afghanistan, Burkina Faso, Chad, the Republic of the Congo, Equatorial Guinea, Eritrea, Haiti, Iran, Laos, Libya, Mali, Myanmar, Niger, Sierra Leone, Somalia, Sudan, South Sudan, Syria, Yemen, and people with Palestinian Authority-issued passports.\n\nA partial ban is in place for citizens of Angola, Antigua and Barbuda, Benin, Burundi, Cuba, Dominica, Gabon, Gambia, Ivory Coast, Malawi, Mauritania, Senegal, Tanzania, Tonga, Togo, Venezuela, Zambia and Zimbabwe.\n\nAP",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2026-01-16/north-qld-farmer-redclaw-demand/106232620",
        "title": "Redclaw farmer expands to meet restaurant demand as industry production falls",
        "publish_date": "Fri, 16 Jan 2026 00:03:54 +0000",
        "category": "finance",
        "authors": [],
        "text": "Freshwater crayfish farmer Nathan Cleasby says he cannot keep up with demand from restaurants all over Australia.\n\nMr Cleasby, who bought his 20-hectare Townsville farm in 2023, said he was overwhelmed with summer demand for redclaw, despite the industry declining.\n\n\"We can't keep up, not even close … the demand is phenomenal,\" Mr Cleasby said.\n\nHe said he aspired to have the biggest redclaw farm in Australia.\n\nNathan Cleasby is focusing on research before scaling up his farm. (ABC News: Brooke Tindall)\n\nMr Cleasby has 5.5 hectares of ponds but said he was working out the next step to increase production.\n\nWorking with James Cook University and the CSIRO, he said he was focusing on sustainable feedstock and animal genetics to improve the survival rates of growing redclaw.\n\n\"We've got the land, we've got the machinery, it's all ready to go,\" he said.\n\n\"We just want to know what we're doing before we start.\"\n\nA struggling industry\n\nRedclaw crayfish are native to northern Queensland but a declared noxious aquatic species outside their native range because they out-compete other native yabbie species.\n\nThe Queensland Department of Primary Industries' 2023-24 Aquaculture Production Summary found redclaw production recorded by farmers had shrunk by 45.7 per cent from the previous year.\n\nJames Cook University aquaculture expert Dean Jerry said redclaw was established as a \"cottage\" industry with small-scale farmers.\n\n\"I think this has discouraged some new entrants to come into the industry, despite the biological potential of the animal itself to be a great product to scale,\" Professor Jerry said.\n\nHe said more long-term research was needed to ensure increasing production would be comparable to other aquaculture industries, such as prawns.\n\n\"Quite often, for many new industries, projects are short and sweet, but they don't sort of realise their potential impact because there is no continuation of the research,\" he said.\n\nMr Jerry said nutrition and genetics were the areas of interest for redclaw.\n\n\"We do know a little bit about the nutrition of redclaw, but there's still a lot of work to be done in that area and the production of the feeds that are cost-effective,\" he said.\n\nHe said demand had remained strong for the product.\n\nRedclaw is increasingly popular in restaurants. (ABC News: Brooke Tindall)\n\n\"There is certainly demand for this product and a lot of restaurants when they have the product they will want to put it on their menus,\" he said.\n\n\" It comes down to that scaling issue — having enough of the product being produced to regularly supply restaurants. \"\n\nPopular on the menu\n\nTownsville fine dining chef Steele Lee, who features Mr Cleasby's crayfish on his menu, said his customers were impressed with the species.\n\n\"You can use the whole animal — the shells, the meat, it's pretty exciting as a chef to be able to do so many different things with one animal,\" he said.\n\nHe said he had seen its popularity in fine-dining restaurants grow over the past few years.\n\n\"It's good to see it's growing and getting its place on the menu,\" he said.\n\nMr Cleasby said the few producers still in the industry worked strongly together.\n\n\"I think the demand is strong enough, the price point is really good, so hopefully we can turn the industry and start increasing production year on year.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2026-01-16/office-computer-updates-slowing-down-productivity/106236080",
        "title": "Are relentless computer updates driving you crazy? You're not alone",
        "publish_date": "Fri, 16 Jan 2026 00:02:11 +0000",
        "category": "finance",
        "authors": [],
        "text": "You're back from holidays, turning on a laptop for the first time in days, and, before you know it, its little fan is at full speed and everything's running slow before it shuts down again.\n\nLater on, you're under the pump with a critical deadline to hit, and your PC forces an update on you, and then another, and maybe a third for good measure, hitting you with the so-called blue screen of death for a good 10 minutes.\n\nSound familiar?\n\nThis is the modern era of office work, where a bid to become ultra secure with updated operating systems has made corporate-owned computers an unpredictable hotbed of stress.\n\nIt seems like the machines are forever interrupting us with updates, often to install new, \"shiny\" software that — once you've endured its fourth update of the day — is often less user-friendly, less efficient, and somehow makes your job harder.\n\nSo what's going on?\n\nA high-level Adelaide-based IT expert, who has spoken on condition of anonymity, says many of the updates we endure are for security reasons.\n\n\"The cyber threat now is so high, even to what it was 10 years ago, that a lot of companies are extremely risk-averse and just want to make sure their systems are secure as possible,\" he said.\n\nMost Australian office workers will be familiar with the so-called blue screen of death. (ABC News: Bang Xiao)\n\nHe said corporations used to look over updates rolled out by the big tech they had enterprise agreements with and chose what was relevant to them, ignoring the others.\n\n\"But I think what's happening more and more is they're just putting on all the available updates as there's so many threats now, from foreign nationals, governments … someone gets hacked, and it's out in the media in five minutes and can cause a lot of reputational damage,\" he said.\n\n\"It does slow things down.\"\n\nOne corporate manager told the ABC, tongue in cheek, that his job is now \"just to sit there and do updates on my computer\".\n\n'Shiny' before 'real usability'\n\nSydney's University of Technology Software Engineering head, Asif Gil, said changes could also be driven by revenue, regulatory compliance, or safety and maintaining a reputation — all of which could impact usability or cause a \"misalignment with the business goals and operations\".\n\nLess is more, right? So why is keeping things simple so complicated? No inventor strives to make their creations so complex that it confounds users; no one strives to make their lives more difficult. So why is keeping things simple so complicated?\n\nHe said there was also focus on new features rather than \"real usability\" and \"people's work habits\".\n\n\"Sometimes it is about releasing and adopting a shiny tool as soon as possible without detailed problem and need analysis,\" Professor Gil said.\n\nHe said this could be due to an organisation's fear of lagging behind, or wanting a \"first-mover competitive advantage\".\n\n\"But software release frequency needs to align with the business goals and day-to-day operations, including their smooth integration within the existing workflows,\" Professor Gil said.\n\nOlder computers typically struggle to deal with updates and new software. (AAP)\n\nThe Adelaide IT expert said large software providers often rebrand their products, prompting people to say, \"Hang on. This was so much easier the old way.\"\n\n\"They're just trying to refresh and give you more functionality. The thing is, with more functionality, you need more processing power, and when they do release new versions, in the background, there will be security enhancements,\" he said.\n\n\"Older computers will be more affected by updates, as they are not made for them, and I think a lot of companies hold onto IT equipment for too long.\n\n\"At the end of the day, it's a cost, but they don't see the cost in productivity loss.\"\n\nHe said bespoke software made specifically for corporations also had to be updated to reflect external software changes.\n\nLocal interfaces were also sometimes updated simply because it was on an employee's performance agreement to do so.\n\n\"They achieved it, but is it any better?\"\n\nMore frequent updates to come\n\nProfessor Gil said there needed to be a trade-off between updating software to reflect hardening security regulations and retaining usability and speed.\n\nHe said if the updates were driving users crazy, people could expect more of them and even more frequently due to AI-generated code.\n\nTactics of hold music A professor in music therapy gives her take on the phenomenon of hold music and its ulterior motives.\n\n\"Its code generation can happen quickly, but the challenge is, are humans ready to adopt that code, because they are at the forefront of actually using it, taking action, and being accountable,\" he said.\n\n\"I think there's a misalignment between the day-to-day operations and what software can do as well.\"\n\nIn the meantime, just trying to save a draft article of this article to my PC is a minor battle, as I fend off its attempts to save it to the cloud rather than my own laptop — regardless of how many times I opt out or disable the wretched new interface.\n\nSound familiar?",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2026-01-16/australian-customer-receives-payback-cheque-from-amazon-prime/106231918",
        "title": "US lawsuit results in mystery cheque from Amazon in woman's mailbox",
        "publish_date": "Thu, 15 Jan 2026 23:29:09 +0000",
        "category": "finance",
        "authors": [],
        "text": "If you go to your mailbox and find a cheque for US$51 from Amazon Prime, it may not be a scam but the result of a US legal case.\n\nThis is exactly what happened to Wollongong resident Laura Wells, who had to find out why the corporate giant sent her money.\n\n\"It was bizarre to open up an official-looking cheque from the US, unbeknownst to me that I was even getting it,\" she said.\n\nThe company reached an agreement with US regulators last year to pay $US 2.5 billion ($3.8 billion) in fines and reimbursements to Prime subscribers to settle allegations it deceived its customers to generate subscriptions.\n\nAfter discovering details of the reimbursement on the internet, Ms Wells said she hoped the full amount would be passed on to her, as banks often take a conversion fee and other payments.\n\n\"I am not holding my breath that it will be fee-free but I'm sure I will see a little bit of money deposited into my account,\" she said.\n\n'Confusing' situation\n\nMelbourne Law School consumer protection expert Jeanie Patterson said the unusual case had caused widespread confusion.\n\nShe said the Federal Trade Commission brought an action against Amazon for \"confusing interfaces\" in 2023.\n\nAmazon Prime is providing refunds to mainly US customers. (Reuters: Gustavo Graf)\n\n\"People went on to Amazon US to sign up to buy an item and they were offered two free days of shipping,\" she said.\n\n\"By clicking that button and in fact not opting out, they were [inadvertently] signed up to Amazon Prime, which is about $14 a month — or a year depending on the deal you got — and didn't know they were signed up.\n\n\" They then weren't able to unsubscribe and so at the end of last year there was a settlement and part of that was that Amazon had to pay customers that were affected back. \"\n\nCustomers were offered two days of free shipping, which also inadvertently signed them up to Amazon Prime. (Reuters: Gustavo Graf)\n\nThe Federal Trade Commission said on its website that, as a result of the historic settlement, Amazon began sending claim notices to eligible Prime customers in January 2026.\n\nA statement from Amazon in September said the company and its executives worked hard to make it clear and simple for customers to both sign up and cancel their memberships.\n\n\"Amazon and our executives have always followed the law and this settlement allows us to move forward and focus on innovating for customers,\" it said.\n\nAmazon did not admit wrongdoing in the case and has since told the ABC some eligible Australian customers could get a cheque if they \"previously signed up to Prime via Amazon.com and not Amazon.com.au\".",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2026-01-16/ben-castlehow-ran-24-parkruns-in-24-hours-in-albany/106229186",
        "title": "Twenty-four parkruns in 24 hours no sweat for WA runner",
        "publish_date": "Thu, 15 Jan 2026 23:01:42 +0000",
        "category": "sports",
        "authors": [],
        "text": "A West Australian parkrunner has run the equivalent of three marathons, completing 24 parkruns in 24 hours and raising thousands for charity in the process.\n\nParkrun events are held every Saturday morning in communities around the world, with participants walking or running 5 kilometres.\n\nWhile generally focused on community building and fitness, Albany's course is known as a challenge, covering a hilly run up the city's landmark Mount Clarence.\n\nThe Mount Clarence parkrun contains some steep stretches. (Supplied: Brad Harkup Photography)\n\nBen Castlehow said before taking on the 120km challenge last weekend, running the course 24 times, the furthest he had run was 85km.\n\n\"We went out on the hour every hour — [we] started at 8am in the morning [on Saturday] with the Mount Clarence parkrun,\" he said.\n\n\"And then continued on each hour and then finished up at 8am on Sunday.\"\n\nDozens of runners completed various distances during the event, but only one other person completed the full 24 alongside Mr Castlehow.\n\nRunners continued to slog their way around the route each hour through the night. (Supplied: Ben Castlehow)\n\nRunning for a purpose\n\nMr Castlehow used the challenge as an opportunity to raise funds for the charity On My Feet, which helps people experiencing homelessness achieve long-term self-sufficiency.\n\n\"About eight years ago I left Albany due to poor decisions of mine, addiction being the main one, and that made me homeless,\" he said.\n\n\" I was introduced to On My Feet while I was in Perth, and they helped me to regain my life back. \"\n\nRunners travelled to Albany to be part of the event. (Supplied: Ben Castlehow)\n\nRunning has been a part of his life since then.\n\n\"Committing that time to myself, it clears my head,\" he said.\n\n\"It just gives those good endorphins that your body needs to sort of calm yourself down.\"\n\nMarathon effort\n\nAmong the runners was 12-year-old Jackson Beeck, who does the Mount Clarence parkrun most Saturdays.\n\nDuring the weekend, he completed the parkrun course enough times to equal the marathon distance of 42.2km.\n\n\"The first half was pretty easy and then it just got worse from there,\" Jackson said.\n\n\"My hips and legs were hurting a bit.\"\n\nJackson Beeck (back right) ran the equivalent of a marathon over the event. (Supplied: Ben Castlehow )\n\nIt was more than four times his previous longest run.\n\n\"I just really wanted to complete a marathon, so I thought I would just keep going and try my best,\" he said.\n\nJackson usually plays the likes of Red Hot Chili Peppers and Nirvana while running, but after leaving his headphones at home on Saturday that was not an option.\n\nRunning around the place\n\nRunners around Australia have challenged themselves to run 24 parkruns in 24 hours in the past.\n\nAnd last weekend, a similar event was taking place about 300km away in the state's South West.\n\nKeeton Hardwick completed the 24 parkruns in 24 hours in Bunbury. (Supplied: Keeton Hardwick)\n\nKeeton Hardwick ran a gruelling 24 laps around Big Swamp in Bunbury.\n\nMr Hardwick said it was a huge challenge that tested him both physically and mentally.\n\n\"It's a long way and it's never easy; staying on top of hydration and getting enough calories into you is challenging,\" he said.\n\n\"Physically it gets to a point where everything hurts more and you have to push though.\n\n\" [In] the middle of the night I started to get a little impatient — my hardest was lap 23. \"\n\nMr Hardwick took on the challenge to raise money for the Type 1 Diabetes Family Centre in Perth.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2026-01-16/world-champion-shelley-taylor-smith-runs-swim-group/106233342",
        "title": "The 'Sea Shells Teabaggers' swim group helping women find confidence",
        "publish_date": "Thu, 15 Jan 2026 22:57:44 +0000",
        "category": "sports",
        "authors": [],
        "text": "They call themselves the \"Sea Shells Teabaggers\" — and with a former world champion at the helm, this ocean swim group has built something much stronger than good technique.\n\nShelley Taylor-Smith is a retired seven-time World Marathon Swimming Champion and learnt everything she knows in the water at Mettams Pool in Perth's north.\n\nShelley, 64, has been offering the free swimming lessons for a year. (ABC News: Grace Burmas)\n\nAlmost six decades since she started swimming, she decided to put her experience competing in some of the world's most challenging open waters to good use.\n\nA year ago, she posted in a social media group, asking people to join her for laps twice a week at her old watering hole.\n\nThe group is aimed at mature women, who are finding fitness and friendship. (ABC News: Grace Burmas)\n\n\"I thought I was just talking to the locals, and I was talking to 30,000 people and that's how it started,\" Shelley said.\n\nBuilding confidence\n\nEach woman has her own story about how and why she became a \"teabagger\".\n\nAfter decades away from the role, Kathy requalified as a swim teacher. (ABC News: Grace Burmas)\n\nEx-swim teacher Kathy heard Shelley on ABC Radio Perth and wanted to help women gain confidence in the water.\n\n\"I got down here and some of the ladies were just terrified and now [they're] just up and back, up and back, it's just incredible,\" Kathy said.\n\nLoading...\n\n\" I haven't taught in over 30 years, and I got so inspired with this group I went and requalified this year. \"\n\nHer friend Diane hadn't taken a swimming lesson since high school and would have never swum alone at the beach.\n\nDiane (left) and Kathy (right) find confidence with the group. (ABC News: Grace Burmas)\n\n\"Just the camaraderie that we have has just made it so much easier to approach the water,\" Diane said.\n\nCommunity at its core\n\nThere's a seriousness behind the cause.\n\nIn 2025, one third of all drowning deaths were adults aged 65 and older, according to Royal Life Saving.\n\nSome of the swimmers are training for the well-known Busselton Jetty Swim. (ABC News: Grace Burmas)\n\nBut you wouldn't know it from attending the sessions, which involve a bit of swimming and a lot of chatting.\n\nWhen Hilly joined the group a year ago she needed some help in and out of the water, but she's now smashing a dozen laps of the reef-protected lagoon.\n\nHilly (centre) is seen as the matriarch of the group. (ABC News: Grace Burmas)\n\nWhat you can't measure is the pride on her friends' faces as they watch the way she now moves with ease.\n\n\"I'm the matriarch of the group, I'm 75 this year and it's one of the best things I've ever done is join this group,\" Hilly said.\n\n\"I've never come across such a random group of women who have all connected and I think we'll be lifelong friends, you just know you get that feeling.\"\n\nSharing her medals\n\nSome of the group are attempting the Busselton Jetty swim this year, after previously being afraid of the ocean.\n\nThe iconic swim has 3.6 kilometre, 1.6km and 500 metre legs.\n\nShelley found a box of hundreds of gold medals from her state and national championships and decided to reward the women for their dedication.\n\nSome of Shelley's old medals are finding a new life with the \"teabaggers\". (ABC News: Grace Burmas)\n\n\"I thought it was going to be a bit corny, but I wanted to reward them for getting out of their comfort zones and coming down here,\" she said.\n\n\"I wanted them to really feel empowered, and they deserved a gold medal.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2026-01-16/motorsport-dakar-rally-daniel-sanders-return-collarbone/106236054",
        "title": "'We don't quit': Aussie returns to Dakar Rally after broken collarbone",
        "publish_date": "Thu, 15 Jan 2026 22:56:11 +0000",
        "category": "sports",
        "authors": [],
        "text": "Less than 24 hours after sustaining a broken collarbone and sternum that ended his dream of back-to-back Dakar Rally motorbike titles, a defiant Daniel Sanders has refused to be beaten by the sport's most illustrious and demanding race.\n\nThe 31-year-old Australian world champion climbed back into the saddle of his factory Bull KTM on Thursday, local time, dipping further into his reserves of courage to complete the 11th stage and finish 13th.\n\nIt meant he slipped from first to fourth in the general rankings. A further two gruelling days still lie ahead.\n\nThe man from Victoria's Yarra Valley saw his hopes disappear in a calamitous crash 138 kilometres into the second half of Wednesday's marathon stage from Wadi ad Dawasir to Bisha. He careered over one of the huge dunes at high speed.\n\nHis commanding six-minute overall lead had gone, but after receiving treatment, he eventually remounted and completed the stage. \"We don't quit,\" he said.\n\nHe dropped from first to fourth, 17 minutes and 37 seconds behind the new leader, Monster Energy Honda's American two-time winner Ricky Brabec, who had stopped to assist the fallen Sanders.\n\nWhile Sanders was left to fight his own personal battle in the Saudi desert on Thursday, Brabec deliberately gave up his lead over Luciano Benavides, Sanders' KTM teammate, while Nasser Al-Attiyah was happy to cruise through another day closer to his sixth car title.\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\nHonda cooked up a strategy for Adrien van Beveren to open the way and let teammate Brabec catch up after the 190km pit stop and pick up time bonuses.\n\nBrabec boosted his overall lead from 56 seconds to nearly four minutes just 25km from the finish. He was also within a minute of the stage lead, but he slowed down so KTM rival Benavides was the new overall leader, but only by 23 seconds.\n\nBrabec got his his wish to start Friday's stage 12 six minutes behind Benavides, so he can eye him. He is counting on his experience of winning the Dakar in 2020 and 2024 to trump Benavides, who has a best placing of fourth last year.\n\nBrabec said: \"I've been in this situation before. For the whole two weeks I've been just trying to stay relaxed, stay comfortable and just be confident, so two days more. I'm gonna do the same thing tomorrow that I've been doing every day; ride dirt bikes and have fun.\"\n\nTactics played a major part in the day's car racing, too, as Al-Attiyah was content to let Dacia teammate Sébastien Loeb catch up and pass him to have a teammate nearby for any help and to minimise errors on the mazy, dirt track.\n\nThe stage was won by Mattias Ekstrom, while Australia's Toby Price, a double Dakar winner ‍on motorcycles, finished in 13th place in his Toyota. He is eighth overall, 56 minutes and 59 seconds behind Al-Attiyah.\n\nAAP",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2026-01-16/artificial-reef-among-robe-erosion-options-south-australia/106224506",
        "title": "Tourist town considers artificial reef to stop popular beaches vanishing",
        "publish_date": "Thu, 15 Jan 2026 22:45:47 +0000",
        "category": "finance",
        "authors": [],
        "text": "A coastal town in SA's south east is considering options, including artificial reefs, to battle erosion along popular beaches.\n\nThe District Council of Robe has been awarded a total of $130,000 in funding to minimise the impact of erosion at Fox and Hoopers beaches.\n\nThe town's erosion struggles have been highlighted by recent cliff collapses, and plans to replicate the iconic obelisk, which is likely to be lost to the sea in the coming decades.\n\nThe Robe obelisk is at risk of collapse because of erosion. (ABC South East SA: Sam Bradbrook)\n\nCouncil chief executive Nat Traeger said severe weather last year meant erosion was significantly outpacing expectations.\n\n\"With those big storms, we got to where we thought we'd be in the year 2050,\" she said.\n\nMs Traeger said the study would look at all adaptation pathways around, including dune planting or even retreat.\n\n\"What public and private infrastructure would be at risk?\" she said.\n\n\"If council just retreated and did nothing, where would that coastline around that Fox Beach area go?\"\n\nAn artificial reef is being used at CY O'Connor beach in WA to mitigate erosion. (ABC News: Nicholas Martyr)\n\nTeam examines all options\n\nUniversity of Melbourne research fellow in coastal processes Andrew Pomeroy, who is acting as a consultant on the project, said the investigation would also look at dune reconstructions, seawalls, and contemporary solutions, including reef enhancements or the artificial reef option.\n\n\"Everything's on the table, and then we progressively take things off the table as we look at what we're trying to do, how we're trying to do it and the different levers we can pull,\" Dr Pomeroy said.\n\n\"Whatever we do in any particular location will have much wider implications.\n\n\" We don't want to just install a reef at the expense of supplying sand or moving sand movements around. We need to make sure it works in its actual environment. \"\n\nArtificial reefs have been installed in other parts of the country impacted by erosion.\n\nJustin Geldard (centre) has been monitoring the effectiveness of artificial reefs. (ABC News: Kenith Png)\n\nIn Western Australia, an artificial reef at a dog beach was expanded in 2024, after an initial installation proved effective.\n\nUniversity of WA research associate Justin Geldard said artificial reefs were not the only solution, but could be used alongside beach nourishment and other hard engineering measures.\n\n\"It's more attractive to the public because they can see that positive effect that it's having,\" he said.\n\n\"The community at CY O'Connor [Beach] have loved the recreation side.\n\n\"It's created a snorkelling and diving habitat and brought a lot of marine species in.\"\n\nArtificial reefs can be created in a variety of ways, including concrete structures. (ABC News: Kenith Png)\n\nImplementing could be difficult\n\nCoastal engineer Aaron Salyer said artificial reefs broke waves offshore, reducing their impact on the shoreline.\n\n\"It's kind of finding this balance between allowing some of the wave energy to come in, but taking out the big sting of it,\" he said.\n\n\"When you create habitat, you create the ecology, and that has potential flow-on effects for eco-tourism and additional fishing.\"\n\nHowever, Dr Pomeroy said implementing an artificial reef at Robe could be difficult.\n\n\"You have very small, isolated beach environments,\" he said.\n\n\"It becomes quite difficult to implement a reef in that environment relative to larger, very straight coastlines.\n\nStorms last year caused significant damage at Fox Beach. (Supplied: District Council of Robe)\n\n\"There may be other solutions that are more economical, but also the complexity of having success compared to dune work or trying to widen the beaches, or changing our instrument management system.\"\n\nIn the meantime, Robe council will use $205,000 in state government funding to install \"geo-textile\" sandbags at Fox Beach, and $30,000 for sand replenishment.\n\n\"They don't wash away like sand nourishment does,\" Ms Traeger said.\n\n\"That's going to be a big contribution towards the protection at Fox Beach.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2026-01-16/kimberley-farmers-face-bom-radar-outage/106232438",
        "title": "WA farmers grapple with radar outage during wet season",
        "publish_date": "Thu, 15 Jan 2026 22:19:51 +0000",
        "category": "finance",
        "authors": [],
        "text": "Farmers and pastoralists in Western Australia's north are facing financial losses and safety risks, with a key weather radar expected to be offline for at least three months.\n\nA Bureau of Meteorology (BOM) spokesperson confirmed there was currently no radar coverage in the north-east Kimberley, including areas across Wyndham, Kununurra, Lake Argyle and the lower Ord River, about 3,000 kilometres from Perth.\n\nWith numerous pastoral stations and a significant farming sector, weather decisions across the region often hinge on what the Wyndham radar is showing.\n\nJessica Lingard says the Wyndham radar is expected to be offline for three months. (ABC News: Tabarak Al Jrood)\n\nBOM meteorologist Jessica Lingard said the radar was struck by lightning on Christmas Day.\n\n\"That would be an easy fix if the lightning hadn't also caused an internal fire within the radar itself,\" she said.\n\n\"Unfortunately, the fire has caused considerable damage to the radar and it isn't going to be online for a fairly extensive period of time.\"\n\nA weather radar helps people track and forecast severe weather events and, in the Kimberley's wet season, is critical for farmers.\n\nThe Kimberley wet season typically runs from November to April, meaning the radar may not be back until the most critical period has already passed.\n\nPastoralists and farmers in the Kimberley use the Wyndham radar to track rain and thunderstorms during the wet season. (Supplied: Tim Lanzon)\n\nFarmer Matt Gray said his team at Ceres Farm in Kununurra would typically check the radar at least 10 times a day during this time of year.\n\n\"Whether that's [for] planting, spraying, or fertilising,\" he said.\n\n\"Being the wet season, there's very limited opportunities to plant, and making the most of those opportunities by seeing where the storms are coming from and how far away they are plays a critical role in those three things.\"\n\nHe said only time would tell what the financial impact would be on his business.\n\nAbout 40 kilometres south of Wyndham is Digger's Rest Station, a cattle station that also offers accommodation and experiences such as horse riding and camping.\n\nAlida and Roderick Woodland use the Wyndham radar daily. (Supplied: Alida Woodland)\n\nAlida Woodland, who owns the station with her husband Roderick, said life on their remote property depended greatly on a working radar.\n\n\"Just a couple of days ago, we had a really powerful storm come through and we didn't have any sense of it,\" she said.\n\n\"This just hit us really quickly and took out some trees in the paddocks and around the houses, so it would have been nice to have a bit of a heads up with that one.\"\n\nMs Woodland added that without the radar, even routine jobs such as spraying weeds were harder, and mistakes — like chemicals being washed away — could be expensive.\n\n\"We'll survive, we'll get by fine,\" she said.\n\n\"But it is a huge inconvenience and a bit of a safety issue.\"\n\nImpacts of outage spread interstate\n\nWaterloo Station in the Northern Territory is about 245km from Wyndham, and sits just inside the coverage area of the radar, close to the WA border.\n\nStation owner and manager Hamish Brett said he \"relied heavily\" on the radar as it helped him assess whether it was safe to cross flooded rivers on his property.\n\n\"It's annoying, to be honest … if you can't see it (the rain), it makes it a bit hard and makes you realise, just how much you rely on decent systems to work during the wet season,\" he said.\n\n\"I think everyone feels a bit let down by BOM. Why don't they have gear available somewhere like Katherine or Kununurra?\n\n\"So if one of these radars go down, they can go and fix it straight away.\"\n\nDamage assessment underway\n\nThe BOM said it was assessing the damage caused to the Wyndham radar.\n\nMs Lingard acknowledged the disruption the outage had on the daily operations of farmers and pastoralists.\n\n\"We definitely empathise with those folks who are struggling without it,\" she said.\n\nMs Lingard recommended people access surrounding radars, such as Halls Creek, Broome, and Darwin, and to use satellite imagery on the BOM website to track thunderstorms while the radar was offline.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2026-01-16/boxing-tszyu-zerafa-weigh-in-clash-brisbane-fight/106235908",
        "title": "Tszyu and Zerafa separated by security in fiery weigh-in clash",
        "publish_date": "Thu, 15 Jan 2026 22:05:21 +0000",
        "category": "sports",
        "authors": [],
        "text": "The grudge clash between Nikita Tszyu and Michael Zerafa has exploded, with both boxers needing to be separated after a heated exchange at the weigh-in.\n\nThe history of bad blood between the Tszyu family and Zerafa is real, and it reached boiling point when the two clashed heads in Brisbane's King George Square.\n\nThere is no NRL-style sin-bin at weigh-ins, but two security officials separated the pair as they faced off after making weight, before they came together with a more civilised parting.\n\nZerafa (34-5, 22KO) explained what had ticked him off ahead of tonight's showdown at Brisbane Entertainment Centre.\n\n\"Nikita has put his hands in my face and on my chin too much in the lead-up. I let it happen, but not this time,\" Zerafa fired.\n\n\"It was nothing personal, but it was to show my authority and that I am not a pushover.\"\n\nTszyu (11-0, 9KO) said the exchange was a turning point in his campaign.\n\n\"We are getting ready to fight. That is nothing compared to what is going to happen tomorrow,\" he said.\n\n\"Once the weigh-in happens, there is a certain switch that flicks in the body, where you are prepared for war.\n\n\"I wanted the momentum to change. In the past, in the press conferences, I am a bit more chilled out and relaxed, but the weigh-in is where I really set off.\"\n\nZerafa said he was ahead of the intensity curve in a testy barb back at Tszyu.\n\n\"His switch might have been flicked now. Mine was flicked 48 hours ago,\" he replied.\n\n\"It's show time.\"\n\nNikita Tszyu (pictured) told his opponent Michael Zerafa to \"enjoy the pain\" when the pair meet in the ring. (Supplied: No Limit Boxing)\n\nTszyu could not resist one more shot across the bow at his opponent when asked about what his final words to Zerafa would be before the fight.\n\n\"Enjoy the pain because I live for this pain,\" Tszyu said.\n\n\"I take comfort in the pain. Pain is where I feel most alive. I know in the past he hasn't enjoyed it as much so … let's love it.\"\n\nZerafa had different final words for Tszyu when asked what they might be.\n\n\"God bless,\" he said.\n\nThat is not so strange for a man who has a tattoo of Psalms 30:5, which says: \"Weeping may endure for a night, but joy comes in the morning.\"\n\nWhy Asofa-Solomona walked away from NRL Former Melbourne enforcer Nelson Asofa-Solomona reveals how he fell out of love with rugby league and turned down lucrative contract offers to pursue a career in boxing.\n\nZerafa, who hopes to be joyous on Saturday morning, also had one final sledge for Tszyu.\n\n\"He starts pretty solid, and he does fade towards the end, so I am expecting the same,\" Zerafa said.\n\n\"I don't care. Whatever he brings, I believe I have answers for.\n\n\"He does make a lot of mistakes. I guess we all do, but we have worked in the gym and worked in the camp to capitalise on that.\"\n\nFor Tszyu, who could get a world title shot in the next 12 months if he wins, it is his time to shine against a noted enemy.\n\n\"All the history and all the things he has said in the past have all come to this moment,\" Tsyzu said.\n\n\"It is a huge moment for me, and the biggest test of my career, easily. It is the pinnacle of my life to this point. This is everything.\"\n\nAlso on the card is former Melbourne Storm star Nelson Asofa-Solomona, who is making his professional boxing debut.\n\nSolomona will take on former NRL player Jeremy Latimore, who played 182 NRL games for five clubs.\n\nAAP",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2026-01-16/75pc-of-feedlot-cattle-now-have-access-to-shade-industry-says/106224914",
        "title": "Inside the push to shade 1.3 million feedlot animals",
        "publish_date": "Thu, 15 Jan 2026 22:02:56 +0000",
        "category": "finance",
        "authors": [],
        "text": "Stretching 7 kilometres, costing $3.3 million and taking three years to complete, the latest project of well-known Queensland cattleman Bryce Camm is all about keeping his cattle cool.\n\nThe feedlot owner near Dalby, west of Brisbane, has installed shade cloth across his family's operation to protect about 25,000 cattle from heat stress.\n\nHe said the investment was significant, but one he believed paid off through improved animal welfare, better productivity and greater public confidence in the industry.\n\n\"Happy cattle are productive cattle,\" Mr Camm said.\n\n\"It's one of those elements in ensuring that the industry's meeting community expectations and looking after our cattle.\"\n\nCamm Agricultural Group installed 7 kilometres of shade cloth at its feedlot near Dalby as part of an expansion. (Supplied: Camm Agricultural Group)\n\nMr Camm is among a growing number of feedlot operators voluntarily installing shade.\n\nAccording to a new report from the Australian Lot Feeders' Association (ALFA), three-quarters of all cattle in feedlots — or 1.3 million head — now have access to shade.\n\nThat is up from 56 per cent in 2020.\n\nLessons from the past\n\nAbout 46 per cent of the nation's feedlot occupancy is located within 200 kilometres of Dalby, according to Western Downs council. (ABC Rural: Brandon Long)\n\nFeedlots take cattle raised on grass for most of their lives and feed them a grain-based diet for an average of 50 to 120 days.\n\nThe industry took off in Australia in the 1950s, helping producers deliver consistent beef during droughts and seasonal changes.\n\nHowever, it ran into challenges in the early 2000s, when heat-related cattle deaths made headlines.\n\nThat sparked years of research into heat stress, and since then, the industry has spent more than $6 million studying shade and encouraging feedlots to install it.\n\nMr Camm was right in the middle of that push.\n\nCamm Agricultural Group runs a rural land portfolio covering more than 450,000 hectares in northern, central and southern Queensland, turning off about 40,000 cattle a year for an annual turnover of over $70 million. (ABC Rural: Brandon Long)\n\nBack in 2020, when he was president of ALFA, the organisation launched a shade policy that encouraged all Australian feedlots to provide shade by 2026.\n\nWhile that target has not been met, current ALFA president Grant Garey said the industry was moving in the right direction.\n\n\"We'd like to see all cattle with access to shade over time, and we'll continue to work with lot feeders … to install shade where they haven't yet got to do so,\" Mr Garey said.\n\nGrant Garey says the industry is working to get all lot-fed cattle under shade. (Supplied: Teys)\n\nMandatory or voluntary?\n\nNot everyone is convinced.\n\nSome feedlot operators argue the costs are too high, or that shade is not always necessary depending on the climate or the breed of cattle.\n\nBut research suggests otherwise.\n\nA recent study found that even in temperate regions, shaded cattle regulated their body temperature better and showed improved signs of health.\n\nWhile there are general state legal requirements for those in charge of livestock to provide sufficient shelter, shade for livestock is not explicitly mandatory.\n\nThat gap has sparked petitions, protests — even a lamb being brought into parliament — and the birth of advocacy groups like Animals Need Shade.\n\nA Department of Agriculture, Fisheries and Forestry spokesperson said the Australian government had committed $5 million to the renewal of the Australian Animal Welfare Strategy, which would \"provide a framework for a national approach to animal welfare and bring key stakeholders together on animal welfare issues of national significance\".\n\nThe strategy is due out in 2027.\n\nVeterinary professor of animal welfare Andrew Knight said shade should be mandatory for lot-fed cattle.\n\n\"It's crazy that in a country as hot, and sometimes as humid as Australia, it's not already a legal requirement that these animals be provided with shade,\" Professor Knight said.\n\n\"The fact that they don't drop dead always if they don't have shade does not mean that they're not suffering.\n\n\"This situation is only going to get worse as climate change increases.\"\n\nAndrew Knight says shade should be mandatory for lot-fed cattle. (Supplied: Griffith University)\n\nProfessor Knight said current animal welfare laws were \"completely wrong\" and outdated but he acknowledged the industry's progress.\n\n\"It indicates a genuine commitment to animal welfare when the industry is prepared to do this, and those that hold out against this kind of obvious pro-animal welfare position are not doing themselves or the industry any favours,\" he said.\n\nAlthough heat stress may be more severe in feedlots because of the proximity of animals, he said it was also a risk in paddocks lacking tree cover.\n\nGaining trust\n\nProviding shade is one of several steps the feedlot industry has taken to improve its public image, and the effort appears to be paying off.\n\nConsumer concern about grain-fed cattle has been falling steadily since 2013, with a sharp drop since 2021.\n\nMore broadly, trust in the red meat industry reached a record high in 2025.\n\nMr Garey said a key driver was the perception that cattle producers were ethical and humane.\n\n\"A lot of that's been driven by the focus of the industry to do things like installing shade and looking after the cattle and making sure the animal welfare is right in what we do every day,\" he said.\n\nALFA estimates about 85 per cent of feedlot cattle will have access to shade by 2029.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2026-01-16/sydney-water-3-billion-plan-for-debris-balls-on-sydney-beaches/106235746",
        "title": "$3bn wastewater overhaul after debris balls on Sydney beaches",
        "publish_date": "Thu, 15 Jan 2026 21:42:25 +0000",
        "category": "finance",
        "authors": [],
        "text": "Western Sydney will undergo a $3 billion overhaul of its wastewater infrastructure following an investigation into debris balls that washed up on the city's popular beaches.\n\nSydney Water's Malabar wastewater treatment system services the entirety of south-western Sydney, including Campbelltown, Fairfield, Glenfield and Liverpool.\n\nThe NSW Environment Protection Authority (EPA) identified the site as the source of debris balls, which appeared on beaches stretching from the eastern suburbs and the northern beaches to the Central Coast between late 2024 and early 2025.\n\nThe balls contained mainly fatty acids, a small portion of petroleum hydrocarbons and other materials, including human hair and various fibres, according to the independent environmental regulator.\n\nWorkers had to clean up Coogee Beach after debris balls washed ashore. (ABC News: Timothy Ailwood)\n\nMinister for Water Rose Jackson told the ABC the government would invest $3 billion into upgrading the system over the next 10 years, to reduce the volume of wastewater required to be treated and discharged via the Malabar deep ocean outfall.\n\nMs Jackson said the city's sewerage system was aging and required upgrades right across the network, but the Malabar site had been pushed \"up the priority list\" following the outcome of the EPA's investigation.\n\n\"We've seen debris balls and other issues washing up on beaches; we don't want to see that,\" she said.\n\n\" We want to make sure that our system is fully up to scratch environmentally. \"\n\nMinister 'hopeful' of fewer debris balls washing up\n\nThe Glenfield and Liverpool wastewater facilities will be upgraded in the first stage of the project.\n\nThe balls contained mainly fatty acids, a small portion of petroleum hydrocarbons and other materials. (ABC Central Coast: Sarah Forster)\n\nSydney Water will also increase its cleaning and inspection of ocean outfall screens, tighten trade-waste controls for high-risk customers, and expand its fats, oils and grease education campaign to reduce \"problematic material\" from entering the network.\n\n\"We understand the seriousness of recent debris ball incidents and the need to ensure our network is equipped for Sydney's growing population,\" Sydney Water chief executive Darren Cleary said in a statement.\n\nMs Jackson said she was hopeful to make progress \"quite quickly\" but said there was no guarantee further debris balls would not appear in the interim.\n\n\"As soon as we start taking pressure off Malabar, we're hopeful there will be an improvement,\" she said.\n\n\" The reality is we're playing catch-up a little bit on the environmental side; this is something that hasn't been looked at, hasn't been done for a long time. \"\n\nMs Jackson said limited disruptions were expected amid the project, with the exception of noise from construction works.\n\n\"The disruption for services is unlikely; the only impact is going to be for people who live near the current facilities,\" she said.\n\n\"If you live close to them, there might be a little noise; there will be truck movements.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.smh.com.au/sport/tennis/2026-adelaide-international-highlights-kimberly-birrell-v-victoria-mboko-20260116-p5nulb.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "2026 Adelaide International Highlights: Kimberly Birrell v Victoria Mboko",
        "publish_date": "Fri, 16 Jan 2026 13:06:03 +1100",
        "category": "finance",
        "authors": [],
        "text": "2026 Adelaide International Highlights: Kimberly Birrell v Victoria Mboko\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/goodfood/melbourne-eating-out/70s-bangkok-meets-modern-melbourne-at-carnegie-s-hot-new-restaurant-20260115-p5nudo.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "’70s Bangkok meets modern Melbourne at Carnegie’s hot new restaurant",
        "publish_date": "Fri, 16 Jan 2026 13:02:29 +1100",
        "category": "finance",
        "authors": [
            "Daniela Frangos"
        ],
        "text": "Add articles to your saved list and come back to them anytime.\n\nSave this article for later\n\nRemove items from your saved list to add more.\n\nYou have reached your maximum number of saved items.\n\nTyga is a vibey new spot on Carnegie Road.\n\n1 / 6 Dishes at Tyga in Carnegie. Flat Pack Studios 2 / 6 Inside the venue. Flat Pack Studios 3 / 6 Wood-fired bone marrow with crab sambal and flaky coconut roti at Tyga. Flat Pack Studios 4 / 6 Tom Yum burrata with king prawns, tom yum, heirloom tomatoes, yaowarat donuts. Flat Pack Studios 5 / 6 Borneo Hinava - swordfish ceviche, sea grapes, coconut, green mango, calamansi dressing. Flat Pack Studio 6 / 6 Cocktails are also on the menu. Flat Pack Studios Previous Slide Next Slide\n\nThai$$$$\n\nThis bright new spot blends a nostalgia for 1970s Bangkok with modern Melbourne energy. Borneo-born culinary director Esca Khoo (ex-Miss Mi) gets playful with tom yum burrata featuring king prawns, heirloom tomatoes and fluffy doughnuts like the ones you’d find on Yaowarat – the main road of Bangkok’s Chinatown – submerged in punchy, fragrant tom yum sauce. There’s also charcoal-grilled snapper in a turmeric-cider butter sauce and swordfish hinava, a Bornean ceviche. Decks spinning vinyl keep the vibes high.\n\nMust-try: Wood-fired bone marrow topped with crab sambal, served with flaky coconut roti.\n\nWant to visit this venue? Save it in the Good Food app.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/politics/federal/trump-ignores-the-lessons-of-nixon-and-the-us-suffers-20260114-p5nu3p.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘A moment of sheer nihilism’: Trump is running into a problem many political populists face",
        "publish_date": "Fri, 16 Jan 2026 12:42:57 +1100",
        "category": "finance",
        "authors": [
            "Shane Wright"
        ],
        "text": "The extraordinary response by economists and central bankers this week to the unprecedented criminal investigation of current Fed chair Jerome Powell by Donald Trump’s Department of Justice draws a direct line to Richard Nixon and other phone calls he had with Burns in the early 1970s. Loading Powell, labelled everything from a “fool” to a “major loser” by Trump, went public on Sunday night to confirm a criminal probe into evidence he had given to a Congressional committee on the overrun in the cost of rebuilding a part of the Fed’s Washington offices. Declaring that no one was above the law, he said the investigation was simply a pretext to pressure the Fed into cutting rates to aid Trump, who faces midterm elections in November. “The threat of criminal charges is a consequence of the Federal Reserve setting interest rates based on our best assessment of what will serve the public, rather than following the preferences of the president,” he said.\n\n“This is about whether the Fed will be able to continue to set interest rates based on evidence and economic conditions – or whether instead monetary policy will be directed by political pressure or intimidation.” The three still-living former Fed chairs – Alan Greenspan, Ben Bernanke and Janet Yellen – rallied to Powell’s support, likening Trumps’ actions to developing countries riven by weak central banks and high inflation. “It has no place in the United States, whose greatest strength is the rule of law, which is at the foundation of our economic success,” they declared. RBA governor Michele Bullock was one of 13 leading central bankers to defend the independence of Jerome Powell. Credit: Louie Douvis A day later, 13 senior central bankers, including the Reserve Bank of Australia’s Michele Bullock, released their own statement defending Powell and warning of the dangers of politicians interfering in the setting of interest rates.\n\n“The independence of central banks is a cornerstone of price, financial and economic stability in the interest of the citizens that we serve,” they said. “It is therefore critical to preserve that independence, with full respect for the rule of law and democratic accountability.” Loading These are not people who throw around words lightly, parsing printed words to within an inch of their meaning. But seeing what is at stake, they decided to make their support for Powell known. The heads of the world’s two oldest central banks, Erik Thedeen from Sveriges Riksbank and Andrew Bailey from the Bank of England, signed up.\n\nChristine Lagarde, who has headed the European Central Bank since 2019, signed along with Anna Breman, who has been in charge of the Reserve Bank of New Zealand for less than two months (and who copped criticism from the populist NZ Foreign Minister Winston Peters, who struggled with the concept of independent central banking). These bankers are worried not just about a rerun of Nixon and Burns. They are fearful that actions like launching a criminal investigation against a central banker for not cutting interest rates is being normalised. Westpac’s chief economist, Luci Ellis, previously a senior Reserve Bank executive, noted central bankers know what happens when their hard-won independence is surrendered. Nixon and Burns unleashed inflation on the US economy for a decade. More recently, Argentina in the late 2000s and Turkey last year, where inflation reached 80 per cent, have all suffered from populist leaders fiddling with interest rates for political ends. Ellis said the biggest problem could be when Powell’s term ends in a few months time.\n\n“This turn of events poisons the well for Powell’s successor – an appointment that is yet to be announced. Who would agree to take a position in government service in the US knowing that you might be subjected to trumped-up criminal investigations?” she said. Keeping up with Trump’s policy prognostications is difficult at the best of times. But the move against Powell followed an avalanche of proposals that would normally dominate public debate. They include introducing a 10 per cent cap on interest charged on credit cards, a plan to have America’s two huge publicly owned housing finance agencies, Fannie Mae and Freddie Mac, buy $US200 billion ($350 billion) in mortgage bonds to push down lending rates, and a ban on large institutional investors buying family homes. A local walks past a mural featuring oil pumps and wells in Caracas, Venezuela, this week. Credit: AP The military action against Venezuela, initially described as an effort to stop illegal drugs and criminal migrants flowing into the US, is now clearly a claim on that nation’s oil supplies, with a stated aim of bring oil down to $US50 a barrel (although crude has climbed 10 per cent since the military action).\n\nTrump’s ambition for Greenland is as much an economic as a political play as he seeks to garner the resources of the Danish territory. Throw in his ongoing tariffs (which could be struck down by the Supreme Court at any time) which are supposed to fund a $2000 per person “dividend” to American voters by year’s end, and that’s just the past 10 days of economic debate out of the White House. Loading Trump, whose poll numbers are falling like temperatures in a Greenland winter, is running into a problem many political populists face – their rhetoric doesn’t match the lived experience of ordinary people. Inflation has been above the Fed’s 2 per cent target for almost four years. Without big tech’s data centre building boom, the economy would have flatlined last year.\n\nFigures last week from the Bureau of Labour Statistics – the agency whose head Erika McEntarfer was sacked last year – confirmed trouble in the American jobs market. Through 2025, the US generated a net 584,000 jobs. That compares with 2 million each in 2023 and 2024. Blue-collar jobs are disappearing on Trump’s watch. Manufacturing, which was supposed to be supercharged by Trump’s tariffs, shed almost 68,000 positions. Other losses were recorded in mining and logging (16,000), transportation and warehousing (59,000) and professional services (97,000). It was the healthcare and social services sector that boomed last year, accounting for almost 70 per cent of all jobs created, including a 30 per cent jump in hospitals staff. There has also been a steep increase in the number of people employed part-time whose hours had been cut.\n\nWhile central bankers and economists quickly condemned Trump’s move on Powell, the business community was almost silent. Respected economic historian Adam Tooze noted with alarm this seeming indifference among investors and business leaders, who now only care about their immediate fortunes. “[To them] institutions don’t matter. All that matters are the flows of money and power. As far as POLITICAL economy goes, it is a moment of sheer nihilism,” he wrote to his Substack subscribers. Economic historian Adam Tooze says the response by business leaders to the assault on Powell suggests nihilism has overtaken America’s business elite. Credit: Getty Monash University economist and former RBA economist Zac Gross said among all the ideas coming out of Trump at present, finding those that have “real bite” compared with those that are “mostly bark”(like the cap on credit card rates) is proving difficult.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/cricket/scorchers-dismiss-injury-concerns-ahead-of-vital-clash-20260116-p5nuky.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Scorchers dismiss injury concerns ahead of vital clash",
        "publish_date": "Fri, 16 Jan 2026 12:16:53 +1100",
        "category": "sports",
        "authors": [
            "Shayne Hope"
        ],
        "text": "Finn Allen has dismissed injury concerns over he and Perth Scorchers teammate Mitch Marsh as they gear up for a high-stakes BBL clash with the Melbourne Stars.\n\nAllen and Marsh opened the batting against the Melbourne Renegades on Thursday night, with the Kiwi blaster smashing a century to lead the Scorchers to an important 50-run win.\n\nFinn Allen of the Scorchers bats during Thursday’s clash with the Melbourne Renegades. Credit: Morgan Hancock/Getty Images\n\nBut the pair did not field after the innings break, casting some doubt over their availability for Saturday night’s second-versus-third fixture at Optus Stadium.\n\nAllen, who thumped 101 from 53 balls against the Renegades, said he had cramped in his troublesome left hamstring, while Marsh (20 off 15) copped a ball to the heel.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/business/companies/dalaroo-soars-as-greenland-punt-pays-off-with-critical-minerals-surge-20260116-p5nuks.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Dalaroo soars as Greenland punt pays off with critical minerals surge",
        "publish_date": "Fri, 16 Jan 2026 12:15:39 +1100",
        "category": "finance",
        "authors": [
            "Doug Bright"
        ],
        "text": "In the high-stakes global race to secure critical minerals outside China’s orbit, Greenland is fast emerging as a strategic battleground – and Dalaroo Metals has just planted a very firm flag.\n\nThe company’s shares caught a strong bid today – up almost 50 per cent in early trade to 7.9c on huge turnover - after maiden stream and surface sediment sampling at its wholly owned Blue Lagoon project unveiled a broad, coherent rare earths, zirconium and hafnium system extending for 2.7 kilometres along strike.\n\nDalaroo Metals’ Blue Lagoon project area in Greenland contains a host of critical metals that have not been subject to any modern exploration.\n\nNotably, every one of the 113 samples collected has returned anomalous results, a rare outcome for a first-pass scout program and one that hints at serious scale potential.\n\nSampling delivered exceptional rare earths oxides results, including one assay that returned a whopping 8079 parts per million (ppm) total rare earths oxide (TREO), with magnet rare earths oxides (MREO) making up a solid 29 per cent of the sample.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/tennis/can-sinner-make-it-a-threepeat-our-tennis-scribes-have-their-say-expert-tips-bluffer-s-guide-to-australian-open-20260114-p5nu32.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Can Sinner make it a threepeat? Our tennis scribes have their say: Expert tips to Australian Open",
        "publish_date": "Fri, 16 Jan 2026 11:58:14 +1100",
        "category": "sports",
        "authors": [
            "Marc Mcgowan"
        ],
        "text": "Michael Gleeson Men’s winner: Sinner again.\n\nMen’s runner-up: Zverev again\n\nWomen’s winner: Coco Gauff.\n\nWomen’s runner-up: Swiatek.\n\nThe player everyone will be talking about and why: Not everyone will be talking about it, but the coffee drinkers will not lightly forget Iga Swiatek dissing Melbourne coffee. Because, like, Polish coffee is so good ...\n\nBiggest story of the tournament: Casper Ruud quits the semi-final mid-match to fly to Norway to be at the birth of his first child.\n\nThe Australian who will capture the public’s attention: Aside from de Minaur, I can’t see many Aussies ringing a bell, but I do expect there to be fascination in the Norwegian Ruud as per the above.\n\nHow far will Demon make it? Third round (Tiafoe).\n\nThe thing that will have fans grumbling: Why are there more party courts? Why aren’t there more party courts? Also, where is Danielle Collins? I miss her. Coco Gauff warming up at Melbourne Park this week. Credit: AP Billie Eder Men’s winner: Jannik Sinner.\n\nMen’s runner-up: Carlos Alcaraz.\n\nWomen’s winner: Elena Rybakina.\n\nWomen’s runner-up: Aryna Sabalenka.\n\nThe player everyone will be talking about: OK, big call, but I’m going to say Australian wildcard Taylah Preston. I watched her beat Emma Raducanu on Thursday night, and she looked ferocious and powerful. She would likely have a tough second round opponent in Linda Noskova, but Australians always perform and surprise at Melbourne Park.\n\nBiggest story of the tournament: Here we go, another big call, but I think Australian Alexei Popyrin eliminates 2025 finalist Alexander Zverev in the second round. Popyrin can pull an amazing tournament out of nowhere, and Zverev has been vulnerable since his appearance in last year’s final. Heard it here first.\n\nThe Australian who will capture the public’s attention: Who else but our newest Australian, Daria Kasatkina? She should win her first round match against qualifier Nikola Bartunkova, but it will be the second round that’s likely tricky, with world No.10 Belinda Bencic predicted to play Kasatkina. First Australian Open as an Australian, that’s going to be pretty memorable.\n\nHow far will Demon make it? I really want Alex de Minaur to make his grand slam semi-final debut in Australia, but unfortunately, I just don’t think that’s going to happen. He’s predicted to meet world No.1 Carlos Alcaraz in the quarter-finals, and I think that’s where his tournament ends.\n\nThe thing that will have fans grumbling: Come on, as always, it’s going to be the late finishes. Tennis is renowned for its ridiculous finish times, and I can already see the fans streaming out of Melbourne Park at 1am or 2am after a five-set epic.\n\nScott Spits Men’s winner: Carlos Alcaraz. It’s time for the world No.1 to make his mark on Melbourne.\n\nMen’s runner-up: In a dream final Alcaraz will pip Jannik Sinner in four sets.\n\nWomen’s winner: Elena Rybakina.\n\nWomen’s runner-up: Coco Gauff.\n\nThe player everyone will be talking about: Jordan Smith. We might have already seen the player on everyone’s lips. The amateur player from NSW took home $1 million – the last player standing in the AO’s “1-Point Slam”. Everyone was gripped by the moment, even Alcaraz.\n\nBiggest story of the tournament: Novak Djokovic. Whatever the 10-time champion does, how far he goes in the tournament and even his interactions with a TV host – ala his dispute with Tony Jones last year – are guaranteed to generate headlines.\n\nThe Australian who will capture the public’s attention: Maya Joint might be women’s world No.32 and our best women’s player, but she remains a huge unknown to the local audience. That will change over the next two weeks.\n\nHow far will Demon make it? Quarter-finals. I’m tipping Alex de Minaur to fight his way through a challenging draw before Alcaraz stops him at the oh-that’s-so-frustrating quarter-final stage.\n\nThe thing that will have fans grumbling: Fighting for seats on the outside courts. The AO gets bigger and bigger by the year. Therefore, securing great seats on show courts and smaller courts to watch top matches gets more difficult. Jake Niall Men’s winner: Sinner.\n\nRunner-up: Alcaraz.\n\nWomen’s winner: Sabalenka.\n\nRunner-up: Amanda Anisimova.\n\nThe player everyone will be talking about: Novak Djokovic. At 38, this might be his last shot at an 11th title.\n\nBiggest story of the tournament: Dodgy use of medical timeouts in a critical match.\n\nThe Australian who will capture the public’s attention: Maya Joint.\n\nHow far will the Demon make it: The fourth round.\n\nThe thing that will have the fans grumbling: Beer prices or shortages. Hannah Kennelly Loading Men’s winner: Sinner.\n\nMen’s runner-up: Alcaraz.\n\nWomen’s winner: Swiatek.\n\nWomen’s runner-up: Sabalenka.\n\nPlayer everyone will be talking about: Sabalenka. After her controversial Battle of the Sexes match with Nick Kyrgios, I suspect Sabalenka will continue to keep Aussies talking. She’s got a brilliant, fiery style of tennis and will no doubt stay in the headlines.\n\nThe Australian who will capture the public’s attention: Dane Sweeny. Ranked as low as 680th in the world last year, Sweeny’s had a meteoric comeback and qualified for the men’s singles this year. There wasn’t a spare seat for his qualifying matches this week. The 24-year-old has an entertaining, almost acrobatic, style of tennis and is definitely one to watch.\n\nHow far will Demon make it: Fourth round. I’m a massive fan, but the Aussie definitely has a tough draw this year. I struggle to see him getting past Alexander Bublik, but happy to be proved wrong.\n\nBluffer’s guide to the Open By Marc McGowan Not everyone is a tennis aficionado. But you will be able to bluff your mates by reading our Australian Open form guide, which should quickly bring you up to speed with what is about to happen across the next fortnight. The bankable stars Ten-time champion Novak Djokovic is the undisputed king of Melbourne Park, and has not lost before the semi-finals since 2018. Even at age 38, Djokovic remains a leading title threat. World No.1 Aryna Sabalenka is trying to win her third women’s singles championship in four years – after losing the final to Madison Keys in 2025 – while Jannik Sinner is hunting a hat-trick of men’s titles.\n\nLoading Chasing history This is the worst-performed slam for Carlos Alcaraz, but he was still a quarter-finalist the past two years and needs the Australian Open trophy to complete his grand slam set. Alcaraz would join Djokovic, Rafael Nadal, Roger Federer, Andre Agassi, Rod Laver, Roy Emerson, Fred Perry and Don Budge as the only men to do that if he salutes at Melbourne Park. Iga Swiatek is also eyeing a career grand slam in Australia after winning Wimbledon for the first time last year. Margaret Court, Maureen Connolly, Steffi Graf, Doris Hart, Shirley Fry, Billie Jean King, Chris Evert, Martina Navratilova, Serena Williams and Maria Sharapova won each of the four majors. Don’t count on ’em Casper Ruud is a triple grand slam finalist, but reached the fourth round at Melbourne Park only once in six previous trips, including four exits by the second round. Other men’s seeds with questionable records here are Alexander Bublik (four first-round and three second-round exits), Lorenzo Musetti (never beyond the round of 32 in four visits), Arthur Rinderknech (three first-round losses from four Opens) and Corentin Moutet (lost by the second round in five of six attempts). On the women’s side, it is difficult to trust Leylah Fernandez (five second-round losses from six tries), Liudmila Samsonova (never past the second round in six trips), Emma Raducanu (three second-round exits out of four attempts) and Ekaterina Alexandrova (five first-round defeats from nine Opens).\n\nNew names to track Loading Valentin Vacherot is at the top of this list. A virtual unknown before last year’s Shanghai Masters, the Monaco man stormed from qualifying to the title, beating his cousin Rinderknech in an unlikely final. His scalps included Bublik, Holger Rune and Djokovic. Powerful trio Gabriel Diallo, Raphael Collignon and Ethan Quinn enjoyed breakout seasons in 2025, too. Indonesia’s Janice Tjen was one of the WTA Tour’s biggest risers last year, surging from a year-end ranking of No.412 in 2024 to a career-high No.53. Other steep climbers were Germans Eva Lys and Ella Seidel, Filipino Alexandra Eala and Colombia’s Emiliana Arango. The teenage tyros",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/lifestyle/life-and-relationships/was-2016-the-last-good-year-social-media-seems-to-think-so-20260116-p5nuj1.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Was 2016 the last ‘good’ year? Social media seems to think so",
        "publish_date": "Fri, 16 Jan 2026 11:40:15 +1100",
        "category": "lifestyle",
        "authors": [
            "Lauren Ironmonger"
        ],
        "text": "Where were you in 2016?\n\nI’ll go first. I’d just started uni and I had thick curtain bangs à la twee queen Zooey Deschanel. Beyoncé’s Lemonade was getting some serious air time on my car radio, and Instagram still showed posts in order of when they were posted. I didn’t know what a Labubu was and Rihanna was still making music. It was, put simply, a pretty good year.\n\n2016, clockwise from top left: Kylie Jenner, Selena Gomez, Ariana Grande, then-couple Kendall Jenner and Harry Styles, Karlie Kloss and Taylor Swift, and Bella Hadid. Credit:\n\nYes, part of this is just the buoyancy of youth, the feeling of having “the world at my feet”, to quote my year 12 yearbook. But I’m not alone in idealising 2016.\n\nThe latest social media trend invites users to share photos of themselves from a decade ago, with celebrities like Kylie Jenner, Selena Gomez and Hailey Bieber taking part.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/tennis/the-australian-open-is-offering-10-million-for-one-lucky-fan-but-there-s-almost-no-way-to-win-20260113-p5ntrb.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "The Australian Open is offering $10 million for one lucky fan. But there’s almost no way to win",
        "publish_date": "Fri, 16 Jan 2026 11:30:00 +1100",
        "category": "sports",
        "authors": [
            "Frances Howe"
        ],
        "text": "In the most ideal world, a punter would pick the favourite for every match and there would be no upsets. If they did, they’d pocket $10 million. But the chances of that happening are, you guessed it, pretty slim. In fact, a zero-upset tournament has never occurred in grand slam history. Last year, 13 seeded players (ranked in the top 32) were knocked out by an unseeded player in the first round of the tournament alone, meaning anyone that only picked match favourites would be wrong 13 times after just the first round. One lucky fan could ride an Alex de Minaur hot streak all the way to $10 million. Credit: Eddie Jim “Even if we use the best possible predictive techniques we have in statistics and machine learning, we can still only get that probability down to one in a billion because there is so much chance, variability, close games, changes in individuals, differences in performance on days,” Humphries said. “No matter how much you know about the game, it’s almost impossible to get 127 decisions correct.” On the other hand, “If you don’t enter, then your chances of winning are precisely zero,” she said. “Even if your chance of winning is one in a billion – that’s still better than zero, even though it’s very close to zero.”\n\nTennis Australia knows the chances are that slim because it didn’t come up with the idea. It’s actually a favourite of Warren Buffett, who routinely offers huge sums of cash for his employees if they can correctly guess every outcome of the 67 games of “March Madness”, the big annual tournament in men’s and women’s college basketball. No one has ever done it, but luckily for his employees, the consolation prize is a little more than what Tennis Australia is offering, at $US100,000 for the next best guesses. In response to our experts’ number crunching, Tennis Australia director of audience Phil Brook said: “Picking 127 winners is a big challenge, but there’s a huge prize of $10 million if someone has the skill to do it. Last night, against all odds, we saw an amateur beat the world’s best men and women players to win $1 million. So, in tennis, anything’s possible. “In addition to the $10 million grand prize there are two $10,000 prizes that will be won by the best bracket in each of the men’s and women’s main draws. So, it’s definitely worth having a go. Nexo co-founder Antoni Trenchev with US president Donald Trump at the Trump International Golf Links in Aberdeen, Scotland. Credit: Instagram/Nexo “Bracket challenges are huge in the US. During March Madness … everyone fills one out and follows the tournament. Even Barack Obama filled out his bracket while in the White House. In Australia, footy tipping and Melbourne Cup sweeps are a tradition, and we plan to make the AO Bracket Challenge another great Australian tradition.”\n\nTennis Australia says it is a competition based on skill and not chance. That’s because if it were purely based on chance, TA would have had to pay to register the competition as a trade promotion lottery in several Australian states, and agree to be regulated by state bodies. Loading Either way, the offer of $10 million is a sure bet to get more eyes on the brand partnership between Tennis Australia and Nexo, which professor Alex Russell, from the Experimental Gambling Research Laboratory at CQUniversity, said was handy given those likely to take a chance at winning $10 million may also be the kind to try out cryptocurrency. “It fits in with that whole crypto vibe of you can make a tonne of money real quick,” he claimed. Tennis Australia’s partnership with the company follows a re-emerging trend for sports organisations to pair with crypto platforms. The Open is Nexo’s fourth partnership with a tennis event – and they could certainly afford the $10 million.",
        "source": "SMH"
    },
    {
        "url": "https://www.sbs.com.au/news/article/antidepressants-less-effective-for-atypical-depression-landmark-australian-study-finds/14fbc79zx",
        "title": "Antidepressants didn't work for Alexis — she's not alone",
        "publish_date": "Thu, 15 Jan 2026 23:31:15 +0000",
        "category": "lifestyle",
        "authors": [],
        "text": "People living with depression are facing a major gap in treatment options as researchers discover why antidepressants might not be helping many address their symptoms.\n\n\n\n\n\nThe University of Sydney's Brain and Mind Centre has undertaken the largest study of its kind of almost 15,000 Australians living with depression, 75 per cent of whom were women.\n\n\n\n\n\nResearchers identified a distinct \"atypical depression\" strongly linked to other mental and physical illnesses.\n\n\n\n\n\nSymptoms of atypical depression included weight gain and excessive sleep during their worst depressive episodes, which are different to characteristics traditionally associated with depression.\n\n\n\n\n\nAntidepressants are routinely prescribed as a first-line treatment, but the study found people with this illness profile were less likely to respond to the medication and more likely to experience side effects such as further weight gain.\n\n\n\nREAD MORE The 'unknown' depression code Australians have helped crack\n\nAtypical depression was more common in women and the findings suggested a major gap in treatment for those experiencing it, lead author Mirim Shin said.\n\n\n\n\n\n\"Depression is not a one-size-fits-all and there are many different types,\" she said.\n\n\n\n\n\n\"People with atypical depression had higher genetic risk of many other mental health conditions and physical health conditions, such as diabetes, and did not respond well to antidepressants.\"\n\n\n\n'I couldn't handle the side effects'\n\nAlexis Hutcheon struggled with the side effects of common antidepressants for more than a year before she was able to find a treatment that worked for her.\n\n\n\n\n\nShe was experiencing physical symptoms, including metabolic, sleep and inflammatory issues along with her depression, which made it difficult to determine what the problem was.\n\n\n\nAntidepressants are routinely prescribed as a first-line treatment for depression. Source: AAP / Lukas Coch \"Even though I've worked in mental health for a long time, I didn't recognise some of the things I was experiencing as depression,\" Hutcheon said.\n\n\n\n\n\n\"The antidepressants I was prescribed either worked for a little bit and stopped, or I couldn't handle the side effects.\"\n\n\n\n\n\nHutcheon took part in a clinical trial that helped address her atypical depression, but she said more education was needed for clinicians and patients.\n\n\n\n\n\n\"Physical and mental health is all linked and understanding that and having that explained to you is really important,\" she said.\n\n\n\n\n\n\"This sort of research starts a conversation about not having a one-size-fits-all approach, and shifting the thinking that one single diagnosis won't be treated in the same way for everyone.\"\n\n\n\n\n\nThe study findings suggested biological processes, such as a dysregulated body clock, might be behind atypical depression, and showed the need for alternative treatments that targeted the circadian rhythm.\n\n\n\n\"By understanding this unique trajectory leading to atypical depression, we can tailor treatments to individuals based on an individual's biology,\" Shin said.\n\n\n\n\n\n\"This personalised approach would ensure people got help sooner and avoid ineffective and prolonged medication trials that may cause side effects that can be distressing.\"\n\n\n\n\n\nA significant number of Australians, many of them women, were not receiving the right treatment the first time they sought help, Brain and Mind Centre co-director Ian Hickie said.\n\n\n\n\n\n\"This research makes a strong case for more precise treatment for individuals based on their biology as a vital tool in tackling increasing rates of depression.\"\n\n\n\n\n\nReaders seeking support with mental health can contact Beyond Blue on 1300 22 4636. More information is available at beyondblue.org.au . Embrace Multicultural Mental Health supports people from culturally and linguistically diverse backgrounds.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/social-media-ban-4-7-million-accounts-deactivated/i34bwsseq",
        "title": "'Huge achievement': Labor hails wave of under-16 social media account deletions, restrictions",
        "publish_date": "Thu, 15 Jan 2026 11:38:20 +0000",
        "category": "finance",
        "authors": [],
        "text": "The government has hailed data showing over 4.7 million under-16 accounts had been deactivated, removed or restricted within days of social media restrictions coming into effect, with one minister calling it a \"huge achievement\".\n\n\n\n\n\nPrime Minister Anthony Albanese said it was \"encouraging that social media companies are making meaningful effort to comply with laws and keep kids off their platforms\".\n\n\n\n\n\n\"Change doesn't happen overnight. But these early signs show it's important we've acted to make this change,\" he said in a statement sent to media outlets on Thursday, which also contained the preliminary figures provided to the eSafety Commissioner.\n\n\n\n\n\nCommunications Minister Anika Wells said the number of under-16 social media accounts that had been deactivated after the laws took effect on 10 December was a \"huge achievement\".\n\n\n\n\n\n\"We've said from the beginning that we weren't expecting perfection straight away – but early figures are showing this law is making a real, meaningful difference,\" she said in the statement.\n\n\n\n\"We know there's more work to do and the eSafety Commissioner is looking closely at this data to determine what it shows in terms of individual platforms' compliance.\"\n\n\n\n'We'll need more data'\n\nUniversity of Sydney researcher Timothy Koskie told SBS News that 4.7 million was an \"extraordinarily high number\" but cautioned that \"some of those accounts are going to be multiple platforms for individuals\".\n\n\n\n\n\nHe said that, given the number of platforms included in the ban, and the number of \"particularly socially media savvy kids\", it was impossible to tell how many under-16s had actually stopped using social media.\n\n\n\n\n\n\"We can see that it's shutting down accounts and that was one of the slated things that they were going to do,\" said Koskie, who is a post-doctoral associate at the university's School of Media and Communications.\n\n\n\n\n\n\"As far as the top line item of protecting youth from the risks of social media, it might be a little bit of a bridge to say that shutting down the accounts means protecting the youth, because we don't necessarily know, for instance, that the accounts haven't been opened under other names or that protections haven't been bypassed through parents,\" he said.\n\n\n\n\n\n\"We'll need more data in order to know how that's rolling out.\"\n\n\n\nDigital Rights Watch chair Lizzie O'Shea echoed those concerns, saying the \"number of accounts deleted is not the measure of the success or failure of the ban\".\n\n\n\n\n\n\"This is measured by its effect on young people's wellbeing. By that yardstick, the ban continues to fail. Teens are flocking to mental health crisis services as they come to terms with being cut off from their support networks,\" she told SBS News.\n\n\n\n\n\n\"The social media ban has not made life better for Australian teens. For many of them, particularly the most vulnerable, it has caused grave harm.\"\n\n\n\n\n\nDigital Rights Watch opposed the introduction of the social media age limit, calling instead for more regulation of social media companies.\n\n\n\nThe government said the eSafety Commissioner's office would continue to closely monitor social media platforms to ensure they were complying with their obligations.\n\n\n\n\n\nAccording to Thursday's statement, the eSafety website has recorded more than one million visits since the launch of the social media age limit's education campaign, which the government said showed that Australians were engaging with the ban and seeking clear, reliable information about the changes.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/video/mamma-does-derby-crashes-into-sydneys-historic-town-hall/oiwkm7dyv",
        "title": "'Mamma Does Derby' crashes into Sydney's historic Town Hall",
        "publish_date": "Thu, 15 Jan 2026 08:52:00 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/bhp-challenging-for-cbas-crown-why-us-rates-may-not-fall/03lmpzmb7",
        "title": "BHP challenging for CBA's crown & why US rates may not fall",
        "publish_date": "Thu, 15 Jan 2026 06:51:36 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/irans-brutal-crackdown-trump-greases-oil-execs-for-venezuela-indonesias-onion-repeal/urj3ld0hc",
        "title": "Iran’s brutal crackdown, Trump greases oil execs for Venezuela & Indonesia’s onion repeal",
        "publish_date": "Thu, 15 Jan 2026 05:37:50 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/the-plan-to-tackle-australias-drowning-crisis/5afttwbpx",
        "title": "The plan to tackle Australia's drowning crisis",
        "publish_date": "Thu, 15 Jan 2026 03:49:18 +0000",
        "category": "lifestyle",
        "authors": [],
        "text": "Listen to Australian and world news and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nAustralia is home to some of the best beaches and swimming spots in the world.\n\n\n\n\n\nThroughout summer in Australia, a trip to the beach or somewhere to swim feels almost mandatory for locals and visitors alike.\n\n\n\n\n\nBut since the COVID-19 pandemic, drowning in Australia has been trending upwards, and this summer alone, 33 people have died in drowning incidents.\n\n\n\n\n\nAustralian Water Safety Council Convener and Royal Life Saving Australia CEO, Dr Justin Scarr, says the swimming ability of Australians is in decline.\n\n\n\n\n\n“The factors there are obviously Australia is a much more diverse place with many people coming from backgrounds that perhaps don't have a history of strong swimming and water safety skills. This decline not only increases drowning, but it puts barriers in place to people enjoying that sort of great Australian way of life around local rivers in the local pool or at a local beach.”\n\n\n\n\n\nIn response to the rising toll, the Australian Water Safety Council has released their new Australian Water Safety Strategy 2030.\n\n\n\n\n\nWith this, they're hoping to strengthen national efforts to reduce drowning deaths by 50 per cent by the end of the decade.\n\n\n\n\n\nOne contributing factor to the upward trend in drowning deaths is declining water safety skills, particularly among Australians who have moved from countries with limited water safety awareness.\n\n\n\n\n\nIn Sydney, Eve Wheeler is an active patrolling member of Bondi Surf Bathers Life Saving.\n\n\n\n\n\nWith older Australians and migrants both identified as at-risk groups for drowning, Eve Wheeler told SBS Arabic that it's never too late for people to learn.\n\n\n\n\n\n“My beautiful mother migrated here without swimming, without knowing how to swim in the '70s from Lebanon. And she learned how to swim in her 50s and it was difficult to start with, but in the end now she can swim and she can swim with her children. She can protect her children and her grandchildren. It's the most wonderful skill to have, but it's also lifesaving.”\n\n\n\n\n\nWith small children also at risk, Ms Wheeler says parents and guardians have to be vigilant with kids around water.\n\n\n\n\n\n“100 per cent essential, your eyes shouldn't be anywhere else except on your children. We see it many times while patrolling, and we urge you to please be present, put the phones down, please be present, watch your children, help them, because in a matter of seconds, they can be taken by a wave and dragged under in a rip. You might not see it, but it can happen.”\n\n\n\n\n\nThe strategy sets out three key focus areas to reverse the current trend: boosting swimming and water safety skills for all, localising water safety efforts, and strengthening coordination across sectors and jurisdictions.\n\n\n\n\n\nDr Scarr says many incidents occur when people are exploring Australia's waterways.\n\n\n\n\n\n“The other thing is I think people are exploring Australia, but by exploring Australia, they're coming into contact with really unfamiliar waterways, whether that's an unpatrolled beach or perhaps a river or a lake in rural Australia. And if they lack their swimming ability or awareness of water safety to keep themselves safe, they're getting themselves into trouble very quickly.”\n\n\n\n\n\nOne at-risk group identified in the strategy is young men aged 15 to 29.\n\n\n\n\n\nOver-represented in drowning deaths, this group isn't at risk necessarily because they lack the ability to swim, rather they're more likely to take risks around the water.\n\n\n\n\n\nDr Scarr says young men can often be harder to reach through traditional health and safety messaging.\n\n\n\n\n\n“We do believe you can't really separate awareness of water safety from the skills and capabilities to use our waterways successfully. So there is a link between knowing how to swim and knowing where to swim and knowing why not to swim. Alcohol is a significant factor, and we're working very closely with campaigns and also providers, sorry, managers of recreational water spaces to reduce the opportunity for alcohol consumption. But traditionally, it's very difficult to get to young men, and that's why we think boosting life-saving programs in high schools is a pretty good way to go.”\n\n\n\n\n\nOnce a mandatory part of the school curriculum in Australia, in-school swimming lessons are becoming harder and harder to find.\n\n\n\n\n\nIn 2025, Royal Life Saving Australia reported that teachers estimated 48 per cent of Year 6 students could not swim 50 metres and tread water for two minutes.\n\n\n\n\n\nDr Steve Georgakis is a senior lecturer of sports studies at the University of Sydney.\n\n\n\n\n\nHe says mandatory swimming lessons in schools can do much more than improve water safety.\n\n\n\n\n\n“There's no doubt that that is the most important reason. But then if you look at this issue in a little more detail and from a more critical perspective, you realize that if someone is feeling safe and is happy to swim in water, what will happen is that they'll spend more time in the water. And if they spend more time in the water, they'll ask their parents to take them to the beach or to take them to the pool. And they'll have a lot more social learning going on. They'll connect more with nature. They'll connect more with people. They'll connect more with family. And we know psychologically and mentally they'll also feel a lot better about themselves.”\n\n\n\n\n\nAccording to parents surveyed, the majority of students going without in-school swimming lessons are from lower socio-economic backgrounds or live in rural and regional communities.\n\n\n\n\n\nWhile swimming lessons may be more prevalent in coastal areas, data shows that drowning deaths in rivers are more common than at beaches and 61 per cent of drowning deaths happen outside of major cities.\n\n\n\n\n\nDr Georgakis says every single child in Australia should be able to swim.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/trade-off-major-divisions-ahead-of-the-signing-of-the-historic-mercosur-trade-deal/s8vc4i9hv",
        "title": "Trade off: major divisions ahead of the signing of the historic Mercosur trade deal",
        "publish_date": "Thu, 15 Jan 2026 00:59:23 +0000",
        "category": "finance",
        "authors": [],
        "text": "Listen to Australian and world news and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT:\n\n\n\n\n\nIt stops just short of free trade, but the Mercosur agreement between Europe and much of Latin America is one of the most ambitious deals in history.\n\n\n\n\n\n25 years after it was first conceived, EU Commission President, Ursula Von der Leyen is to put pen to paper on the deal on Saturday.\n\n\n\n\n\nThe agreement is for tariffs to be removed from 91 per cent of European exports to the Mercosur bloc, which includes Argentina, Brazil, Paraguay and Uruguay, over the next 15 years.\n\n\n\n\n\nTrade is on the label, but Brazilian researcher Dr Lia Vall says this is a deal designed to bolster ties, at a time global alliances including the World Trade Organisation are being undermined by the United States government under President Donald Trump.\n\n\n\n\n\n“With Trump’s policy favouring unilateralism and showing strong rejection of multilateral institutions, this agreement takes on political significance. First, it shows the possibility of two major blocs reaching a broad trade agreement, not just about trade, demonstrating that cooperation is possible.”\n\n\n\n\n\nThe EU Mercosur Trade Agreement passed the European Parliament last week - a development hailed by Latin American signatories.\n\n\n\n\n\nThe headline exports in question involve farms, cars and minerals.\n\n\n\n\n\nCurrent tariffs can be as high as 35 per cent for auto parts and cars or 28 per cent on dairy products.\n\n\n\n\n\nRemoving these tariffs would save approximately $4 billion and are to take effect gradually, with a timeline dependent on the specific product.\n\n\n\n\n\nBrazilian Vice President Geraldo Alckmin says it would promote investment and result in \"cheaper and better quality products\".\n\n\n\n\n\n\"A win-win situation, that is, cheaper and better quality products. So, wherever it's more competitive, it sells. We are more competitive in the sector, we export; the other is more competitive in another sector, we buy. Society benefits with cheaper and better quality products.\"\n\n\n\n\n\nBut the deal is not considered a \"win-win\" by all parties in Europe.\n\n\n\n\n\nOpposition has been fierce, particularly in the lead-up to the EU Parliament vote.\n\n\n\n\n\nAt the time, Greek farmers said they would be severely hurt by a free trade deal with South American nations.\n\n\n\n\n\nMany staged blockades with tractors across major motorways, with farmer Vasilis Theodouru condemning the government over what he says is an already-dire situation for the nation's farmers.\n\n\n\n\n\n“There is a wider problem in all of Europe with the Mercosur program, with what will happen with Ukraine. It is foreseen that products from third world countries will enter Europe and destroy prices of European products, which means that our survival is hanging by a thread.”\n\n\n\n\n\nIrish, Polish and French farmers followed suit, with the chief concerns including food safety and that the deal would see 99,000 tonnes of cheap beef come from South America.\n\n\n\n\n\nDr Vall, who works with Brazilian Economic Institute FGV-IBRE, says that scenario would almost certainly be prevented.\n\n\n\n\n\n\"No trade agreement fully liberalises a country’s commerce - they always preserve more sensitive products. In Europe’s case, those are clearly agricultural products. So while there will be greater market access for meat, which is our main interest, it will never be total.”\n\n\n\n\n\nThe deal would fuel Europe's struggling auto industry, which is predominantly German, with South American countries representing a growth market for cars.\n\n\n\n\n\nIt is important to the bloc's economy and has been struggling under developments including Donald Trump raising tariffs on European imports.\n\n\n\n\n\nThis week, he reiterated his commitment to U-S domestic car manufacturing.\n\n\n\n\n\n\"We want to make them here. And that's what's happening. Everybody's moving here. From Canada, they're coming here. From Mexico, from Japan, from Germany, from all over the world, they are coming here, they're opening up their plants.\"\n\n\n\n\n\nOn both sides of politics, French politicians have been scathing of the Mercosur deal, this week criticising President Emmanuel Macron for not fighting harder to prevent it.\n\n\n\n\n\nMathilde Panot of the Unbowed Party is in rare agreement with her conservative party counterparts in this assessment.\n\n\n\n\n\n\"So, officially, France voted against the European Union-Mercosur agreement. But this superficial opposition doesn't make anyone forget eight years of participation in the negotiations during which Emmanuel Macron did nothing to prevent or block anything. You bear full responsibility for this humiliation.\"\n\n\n\n\n\nWithout the support of two key member states, and with major reservations from more than 100 politicians, the EU Commission president's signature this weekend does not guarantee when or if the agreement comes into motion.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/adelaide-festival-retracts-statement-on-randa-abdel-fattah-invites-her-to-next-writers-week/3l5p7fvd4",
        "title": "Adelaide Festival retracts statement on Randa Abdel-Fattah, invites her to next writers' week",
        "publish_date": "Thu, 15 Jan 2026 00:36:43 +0000",
        "category": "entertainment",
        "authors": [],
        "text": "One of Australia's top literary festivals has issued a fresh apology and invited a Palestinian-Australian author to its 2027 edition after her controversial removal generated a massive backlash.\n\n\n\n\n\nRanda Abdel-Fattah was dumped on 8 January from the Adelaide Writers' Week line-up in a board decision, triggering a mass boycott by 180 speakers and the resignation of its renowned director and several board members.\n\n\n\n\n\nWriters' week, which was due to start in February, was entirely canned after its program collapsed, with a new board and chair installed.\n\n\n\n\n\nA re-issued apology on Thursday comes after the former Adelaide Festival board cited \"cultural sensitivity\" after the Bondi terror attack in cancelling the author's appearance.\n\n\n\n\" We retract that statement. We have reversed the decision and will reinstate Dr Abdel-Fattah's invitation to speak at the next Adelaide Writers' Week in 2027,\" the new board led by immediate past chair of the Adelaide Festival, Judy Potter, said on Thursday.\n\n\n\n\n\n\"We apologise to Dr Abdel-Fattah unreservedly for the harm the Adelaide Festival Corporation has caused her.\n\n\n\n\n\n\"Intellectual and artistic freedom is a powerful human right. Our goal is to uphold it, and in this instance Adelaide Festival Corporation fell well short.\"\n\n\n\n\n\nThe board belatedly apologised to Abdel-Fattah on Tuesday for how the decision was represented, citing \"a continuing rapid shift in the national discourse around the breadth of freedom of expression\".\n\n\n\n\n\nIt approached Abdel-Fattah on Wednesday evening about the fresh apology and the request to attend in 2027.\n\n\n\nAbdel-Fattah to consider invitation to 2027 event\n\nThe author told the Australian Associated Press she would consider accepting the invite to next year's festival, confirming she would attend in a \"heartbeat\" if respected publisher Louise Adler was at the helm again.\n\n\n\n\n\n\"I accept this apology as acknowledgement of our right to speak publicly and truthfully about the atrocities that have been committed against the Palestinian people,\" she said in a statement given to the Australian Associated Press.\n\n\n\n\n\n\"I accept this apology as a vindication of our collective solidarity and mobilisation against anti-Palestinian racism, bullying and censorship.\n\n\n\n\n\n\"I accept this unreserved apology as acknowledgement of the harm inflicted on our community.\"\n\n\n\nThe Palestinian Australian academic and novelist had faced scrutiny over social media posts critical of Israel.\n\n\n\n\n\nFormer New Zealand prime minister Jacinda Ardern , British novelist Zadie Smith, author Trent Dalton, commentator Jane Caro and former Wallaby turned columnist Peter FitzSimons were among those who pulled out in solidarity with the academic.\n\n\n\n\n\nHer axing was supported by South Australian Premier Peter Malinauskas, who remains steadfast in his position despite mounting criticism of political interference.\n\n\n\n\n\n\"I have a responsibility to call out those who expressly commit themselves to deny other people a voice, as Ms Abdel-Fattah has done,\" he told ABC's 7.30 program on Wednesday.\n\n\n\n\n\nAbdel-Fattah has accused him of unleashing a \"vicious personal assault\" and suggesting at a press conference that she was an extremist terrorist sympathiser.\n\n\n\n\n\nShe has flagged defamation proceedings against Malinauskas over the press conference comments.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.theage.com.au/world/north-america/venezuelan-opposition-leader-says-she-presented-trump-with-her-nobel-peace-prize-20260116-p5nuib.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Trump accepts Nobel Peace medal from Venezuelan opposition leader",
        "publish_date": "Fri, 16 Jan 2026 13:16:29 +1100",
        "category": "sports",
        "authors": [
            "Nandita Bose",
            "Gram Slattery",
            "Steve Holland"
        ],
        "text": "Advertisement\n\nUpdated WorldNorth AmericaVenezuela Trump accepts Nobel Peace medal from Venezuelan opposition leader Nandita Bose , Gram Slattery and Steve Holland Updated January 16, 2026 — 1:16pm ,first published January 16, 2026 — 10:01am Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share A A A\n\nWashington: Venezuelan opposition leader Maria Corina Machado gave her Nobel Peace Prize medal to US President Donald Trump during a White House meeting, as she tries to gain some influence over how he shapes the South American country’s political future. In a social media post, Trump wrote: “Maria presented me with her Nobel Peace Prize for the work I have done. Such a wonderful gesture of mutual respect. Thank you Maria!” A White House official confirmed that Trump intended to keep the medal. Venezuelan opposition leader María Corina Machado departs the White House after meeting with President Donald Trump. AP Machado, who described the meeting on Thursday (Friday AEDT) as “excellent”, said the gift was in recognition of what she called his commitment to the freedom of the Venezuelan people.\n\nAdvertisement\n\nMachado’s attempt to sway Trump came after he dismissed the idea of installing her as Venezuela’s leader to replace the deposed Nicolás Maduro. Trump openly campaigned for the prize before Machado was awarded it last month and complained bitterly when he was snubbed. Though Machado gave Trump the gold medal that honourees receive with the prize, the honour remains hers; the Norwegian Nobel Institute has said the prize cannot be transferred, shared or revoked. Machado’s daughter, Ana Corina Sosa Machado, accepted the Nobel Peace Prize on her mother’s behalf last month. Bloomberg Asked this week if he wanted Machado to give him the prize, Trump told Reuters: “No, I didn’t say that. She won the Nobel Peace Prize.” The Republican president long expressed interest in winning the prize and has at times linked it to diplomatic achievements. Last week, Trump said he would accept the prize if Machado offered it to him when they met.\n\nAdvertisement\n\nThe lunch meeting, which appeared to last slightly over an hour, marked the first time the two have met in person. Machado then met with more than a dozen senators, both Republican and Democratic, on Capitol Hill, where she has generally found more enthusiastic allies. While the visit was ongoing, White House press secretary Karoline Leavitt said Trump had been looking forward to meeting Machado, but that he stood by his “realistic” assessment that she did not currently have the support needed to lead the country in the short term. Machado leaves the Capitol after meeting with Congress members, following her meeting with Trump. AP Machado, who fled Venezuela in a daring seaborne escape in December, is competing for Trump’s ear with members of Venezuela’s government and seeking to ensure she has a future role in governing the nation. After the US captured Venezuela’s longtime leader, Maduro, in a snatch-and-grab operation this month, various opposition figures, members of Venezuela’s diaspora and politicians throughout the US and Latin America have expressed hope that Venezuela will begin the process of democratisation.\n\nAdvertisement\n\nDemocratic senator Chris Murphy, who met with Machado, said the opposition leader had told senators that repression in Venezuela was no different now than under Maduro. Venezuela’s interim President Delcy Rodríguez was a “smooth operator” who was growing more entrenched by the day thanks to Trump’s support, he said. “I hope elections happen, but I’m sceptical,” Murphy, of Connecticut, said. Delcy Rodríguez (centre) in Caracas overnight. Getty Images Trump has said he is focused on securing US access to the country’s oil and economically rebuilding Venezuela. The US president has on several occasions praised Rodriguez, Maduro’s second-in-command, who became Venezuela’s leader upon his capture. In an interview with Reuters on Wednesday, Trump said, “She’s been very good to deal with.” Machado was banned from running in the 2024 presidential election by a top court stacked with Maduro allies. Outside observers widely believe Edmundo Gonzalez, an opposition figure backed by Machado, won by a substantial margin, but Maduro claimed victory and retained power.\n\nAdvertisement\n\nWhile the current government has freed dozens of political prisoners in recent days, outside groups and advocates have said the scale of the releases has been exaggerated by Caracas. Related Article Venezuela crisis Who is Venezuela’s vice president and can she fill Maduro’s shoes? In an annual address to lawmakers, Rodriguez called for diplomacy with the US and said should she need to travel to Washington, she would do so “walking on her feet, not dragged there”. She also said she would propose reforms to her country’s oil industry aimed at increasing access for foreign investors. Reuters Get a note directly from our foreign correspondents on what’s making headlines around the world. Sign up for our weekly What in the World newsletter.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/tennis/2026-adelaide-international-highlights-kimberly-birrell-v-victoria-mboko-20260116-p5nulb.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "2026 Adelaide International Highlights: Kimberly Birrell v Victoria Mboko",
        "publish_date": "Fri, 16 Jan 2026 13:06:03 +1100",
        "category": "finance",
        "authors": [],
        "text": "2026 Adelaide International Highlights: Kimberly Birrell v Victoria Mboko\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/goodfood/melbourne-eating-out/70s-bangkok-meets-modern-melbourne-at-carnegie-s-hot-new-restaurant-20260115-p5nudo.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "’70s Bangkok meets modern Melbourne at Carnegie’s hot new restaurant",
        "publish_date": "Fri, 16 Jan 2026 13:02:29 +1100",
        "category": "finance",
        "authors": [
            "Daniela Frangos"
        ],
        "text": "Add articles to your saved list and come back to them anytime.\n\nSave this article for later\n\nRemove items from your saved list to add more.\n\nYou have reached your maximum number of saved items.\n\nTyga is a vibey new spot on Carnegie Road.\n\n1 / 6 Dishes at Tyga in Carnegie. Flat Pack Studios 2 / 6 Inside the venue. Flat Pack Studios 3 / 6 Wood-fired bone marrow with crab sambal and flaky coconut roti at Tyga. Flat Pack Studios 4 / 6 Tom Yum burrata with king prawns, tom yum, heirloom tomatoes, yaowarat donuts. Flat Pack Studios 5 / 6 Borneo Hinava - swordfish ceviche, sea grapes, coconut, green mango, calamansi dressing. Flat Pack Studio 6 / 6 Cocktails are also on the menu. Flat Pack Studios Previous Slide Next Slide\n\nThai$$$$\n\nThis bright new spot blends a nostalgia for 1970s Bangkok with modern Melbourne energy. Borneo-born culinary director Esca Khoo (ex-Miss Mi) gets playful with tom yum burrata featuring king prawns, heirloom tomatoes and fluffy doughnuts like the ones you’d find on Yaowarat – the main road of Bangkok’s Chinatown – submerged in punchy, fragrant tom yum sauce. There’s also charcoal-grilled snapper in a turmeric-cider butter sauce and swordfish hinava, a Bornean ceviche. Decks spinning vinyl keep the vibes high.\n\nMust-try: Wood-fired bone marrow topped with crab sambal, served with flaky coconut roti.\n\nWant to visit this venue? Save it in the Good Food app.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/politics/federal/trump-ignores-the-lessons-of-nixon-and-the-us-suffers-20260114-p5nu3p.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘A moment of sheer nihilism’: Trump is running into a problem many political populists face",
        "publish_date": "Fri, 16 Jan 2026 12:42:57 +1100",
        "category": "finance",
        "authors": [
            "Shane Wright"
        ],
        "text": "Advertisement\n\nPoliticsFederalTrump's White House ‘A moment of sheer nihilism’: Trump is running into a problem many political populists face Shane Wright Updated January 16, 2026 — 12:42pm ,first published January 16, 2026 — 5:45am Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share A A A\n\nIt was December 10, 1971, and Richard Nixon was on the phone in the Oval Office. As usual, a tape deck installed in the presidential desk started recording the conversation. Nixon was speaking to Arthur Burns, the then chair of America’s central bank, the Federal Reserve. The conversation topic was an upcoming meeting of the Fed committee that set key interest rates. Richard Nixon pressured his Federal Reserve chair to cut interest rates which led to a recession and high inflation. Donald Trump is putting pressure on current Fed chair Jerome Powell. AP With a presidential election less than 12 months away, Nixon was keen to ensure that Burns – who the president had made the Fed’s chair a few years earlier – did his bidding. He wanted interest rates lower, to ensure the economy picked up steam just in time for voters to reward Nixon at the ballot box. Burns revealed a cut was in the offing, taking interest rates down to 4.5 per cent.\n\nAdvertisement\n\nNixon would tell Burns that there was just one way to deal with members of the Fed’s monetary policy committee that feared lower rates could lead to higher inflation: “Just kick ’em in the rump.” Related Article Sketch\n\nUS politics Federal Reserve chief schools Trump in excruciating live fact-check Nixon is known today for corruption. Forgotten is the inflation tidal wave unleashed by Burns and the Fed because of those politically advantageous rate cuts delivered to help Nixon’s 1972 electoral victory. Inflation would surge from 3.4 per cent to 8.3 per cent within 12 months. By September 1973, the Fed had pushed rates to 10.8 per cent. That wasn’t enough – inflation would not be squeezed out of the US economy until another Fed chair, Paul Volcker, pushed official rates beyond 20 per cent and plunged America into its early 1980s recession.\n\nAdvertisement\n\nThe extraordinary response by economists and central bankers this week to the unprecedented criminal investigation of current Fed chair Jerome Powell by Donald Trump’s Department of Justice draws a direct line to Richard Nixon and other phone calls he had with Burns in the early 1970s. Related Article US politics Bullock joins top central bankers in expressing ‘full solidarity’ with Powell in clash with Trump Powell, labelled everything from a “fool” to a “major loser” by Trump, went public on Sunday night to confirm a criminal probe into evidence he had given to a Congressional committee on the overrun in the cost of rebuilding a part of the Fed’s Washington offices. Declaring that no one was above the law, he said the investigation was simply a pretext to pressure the Fed into cutting rates to aid Trump, who faces midterm elections in November. “The threat of criminal charges is a consequence of the Federal Reserve setting interest rates based on our best assessment of what will serve the public, rather than following the preferences of the president,” he said.\n\nAdvertisement\n\n“This is about whether the Fed will be able to continue to set interest rates based on evidence and economic conditions – or whether instead monetary policy will be directed by political pressure or intimidation.” The three still-living former Fed chairs – Alan Greenspan, Ben Bernanke and Janet Yellen – rallied to Powell’s support, likening Trumps’ actions to developing countries riven by weak central banks and high inflation. “It has no place in the United States, whose greatest strength is the rule of law, which is at the foundation of our economic success,” they declared. RBA governor Michele Bullock was one of 13 leading central bankers to defend the independence of Jerome Powell. Louie Douvis A day later, 13 senior central bankers, including the Reserve Bank of Australia’s Michele Bullock, released their own statement defending Powell and warning of the dangers of politicians interfering in the setting of interest rates.\n\nAdvertisement\n\n“The independence of central banks is a cornerstone of price, financial and economic stability in the interest of the citizens that we serve,” they said. “It is therefore critical to preserve that independence, with full respect for the rule of law and democratic accountability.” Related Article Exclusive\n\nTrade wars Five years of slow decay: Bullock’s grim warning for future These are not people who throw around words lightly, parsing printed words to within an inch of their meaning. But seeing what is at stake, they decided to make their support for Powell known. The heads of the world’s two oldest central banks, Erik Thedeen from Sveriges Riksbank and Andrew Bailey from the Bank of England, signed up.\n\nAdvertisement\n\nChristine Lagarde, who has headed the European Central Bank since 2019, signed along with Anna Breman, who has been in charge of the Reserve Bank of New Zealand for less than two months (and who copped criticism from the populist NZ Foreign Minister Winston Peters, who struggled with the concept of independent central banking). These bankers are worried not just about a rerun of Nixon and Burns. They are fearful that actions like launching a criminal investigation against a central banker for not cutting interest rates is being normalised. Westpac’s chief economist, Luci Ellis, previously a senior Reserve Bank executive, noted central bankers know what happens when their hard-won independence is surrendered. Nixon and Burns unleashed inflation on the US economy for a decade. More recently, Argentina in the late 2000s and Turkey last year, where inflation reached 80 per cent, have all suffered from populist leaders fiddling with interest rates for political ends. Ellis said the biggest problem could be when Powell’s term ends in a few months time.\n\nAdvertisement\n\n“This turn of events poisons the well for Powell’s successor – an appointment that is yet to be announced. Who would agree to take a position in government service in the US knowing that you might be subjected to trumped-up criminal investigations?” she said. Keeping up with Trump’s policy prognostications is difficult at the best of times. But the move against Powell followed an avalanche of proposals that would normally dominate public debate. They include introducing a 10 per cent cap on interest charged on credit cards, a plan to have America’s two huge publicly owned housing finance agencies, Fannie Mae and Freddie Mac, buy $US200 billion ($350 billion) in mortgage bonds to push down lending rates, and a ban on large institutional investors buying family homes. A local walks past a mural featuring oil pumps and wells in Caracas, Venezuela, this week. AP The military action against Venezuela, initially described as an effort to stop illegal drugs and criminal migrants flowing into the US, is now clearly a claim on that nation’s oil supplies, with a stated aim of bring oil down to $US50 a barrel (although crude has climbed 10 per cent since the military action).\n\nAdvertisement\n\nAdvertisement\n\nFigures last week from the Bureau of Labour Statistics – the agency whose head Erika McEntarfer was sacked last year – confirmed trouble in the American jobs market. Through 2025, the US generated a net 584,000 jobs. That compares with 2 million each in 2023 and 2024. Blue-collar jobs are disappearing on Trump’s watch. Manufacturing, which was supposed to be supercharged by Trump’s tariffs, shed almost 68,000 positions. Other losses were recorded in mining and logging (16,000), transportation and warehousing (59,000) and professional services (97,000). It was the healthcare and social services sector that boomed last year, accounting for almost 70 per cent of all jobs created, including a 30 per cent jump in hospitals staff. There has also been a steep increase in the number of people employed part-time whose hours had been cut.\n\nAdvertisement\n\nWhile central bankers and economists quickly condemned Trump’s move on Powell, the business community was almost silent. Respected economic historian Adam Tooze noted with alarm this seeming indifference among investors and business leaders, who now only care about their immediate fortunes. “[To them] institutions don’t matter. All that matters are the flows of money and power. As far as POLITICAL economy goes, it is a moment of sheer nihilism,” he wrote to his Substack subscribers. Economic historian Adam Tooze says the response by business leaders to the assault on Powell suggests nihilism has overtaken America’s business elite. Getty Monash University economist and former RBA economist Zac Gross said among all the ideas coming out of Trump at present, finding those that have “real bite” compared with those that are “mostly bark”(like the cap on credit card rates) is proving difficult.\n\nAdvertisement\n\nA repeat of what happened in the 1970s or Turkey last year would lead to high inflation and probably a recession. “Even some Republican senators appear unwilling to risk that kind of economic disaster, and the Supreme Court has signalled that Federal Reserve independence is one area where presidential power is not unlimited,” he said. “Still, that feels like fairly cold comfort given how large the potential economic damage could be.” Nixon won 49 states at the 1972 election. But within two years he had resigned in disgrace, while Arthur Burns was left overseeing a recession that he and the president helped engineer. Start the day with a summary of the day’s most important and interesting stories, analysis and insights. Sign up for our Morning Edition newsletter.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/cricket/scorchers-dismiss-injury-concerns-ahead-of-vital-clash-20260116-p5nuky.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Scorchers dismiss injury concerns ahead of vital clash",
        "publish_date": "Fri, 16 Jan 2026 12:16:53 +1100",
        "category": "sports",
        "authors": [
            "Shayne Hope"
        ],
        "text": "Finn Allen has dismissed injury concerns over he and Perth Scorchers teammate Mitch Marsh as they gear up for a high-stakes BBL clash with the Melbourne Stars.\n\nAllen and Marsh opened the batting against the Melbourne Renegades on Thursday night, with the Kiwi blaster smashing a century to lead the Scorchers to an important 50-run win.\n\nFinn Allen of the Scorchers bats during Thursday’s clash with the Melbourne Renegades. Credit: Morgan Hancock/Getty Images\n\nBut the pair did not field after the innings break, casting some doubt over their availability for Saturday night’s second-versus-third fixture at Optus Stadium.\n\nAllen, who thumped 101 from 53 balls against the Renegades, said he had cramped in his troublesome left hamstring, while Marsh (20 off 15) copped a ball to the heel.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/business/companies/dalaroo-soars-as-greenland-punt-pays-off-with-critical-minerals-surge-20260116-p5nuks.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Dalaroo soars as Greenland punt pays off with critical minerals surge",
        "publish_date": "Fri, 16 Jan 2026 12:15:39 +1100",
        "category": "finance",
        "authors": [
            "Doug Bright"
        ],
        "text": "Advertisement\n\nSponsored BusinessCompaniesBulls N' Bears Dalaroo soars as Greenland punt pays off with critical minerals surge Brought to you by Bulls N’ Bears Doug Bright January 16, 2026 — 12:15pm Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share A A A\n\nIn the high-stakes global race to secure critical minerals outside China’s orbit, Greenland is fast emerging as a strategic battleground – and Dalaroo Metals has just planted a very firm flag. The company’s shares caught a strong bid today – up almost 50 per cent in early trade to 7.9c on huge turnover - after maiden stream and surface sediment sampling at its wholly owned Blue Lagoon project unveiled a broad, coherent rare earths, zirconium and hafnium system extending for 2.7 kilometres along strike. Dalaroo Metals’ Blue Lagoon project area in Greenland contains a host of critical metals that have not been subject to any modern exploration. Notably, every one of the 113 samples collected has returned anomalous results, a rare outcome for a first-pass scout program and one that hints at serious scale potential. Sampling delivered exceptional rare earths oxides results, including one assay that returned a whopping 8079 parts per million (ppm) total rare earths oxide (TREO), with magnet rare earths oxides (MREO) making up a solid 29 per cent of the sample.\n\nAdvertisement\n\n‘This work confirms that the project hosts a fertile mineral system with clear potential to grow through systematic follow-up exploration.’ Dalaroo Metals chief executive officer John Morgan Another rare earths result romped home in second place, with 6491ppm TREO and a 27 per cent MREO component. Intriguingly, surface samples have returned an unusually strong proportion of heavy magnet rare earth metals such as dysprosium and terbium – two of the more valuable metals that underpin electric vehicle, wind turbine and defence technologies. The top two samples assayed 886ppm and 752ppm combined HREO, pointing strongly to a potentially new rare earths district in Greenland, with favourable analogous geology to the nation’s well-known heavyweight Tanbreez and Kvanefjeld rare earths projects. This geological pedigree won’t be lost on the market. One of the more encouraging technical outcomes is that mineralisation appears to improve as grain size decreases. Dalaroo’s evaluation shows consistent enrichment in the finest sediment fractions, suggesting that a process of upgrading may be in play through natural weathering.\n\nAdvertisement\n\nManagement believes that characteristic could lend itself to low-cost gravity separation, sidestepping the need for more complex chemical processing routes. Dalaroo Metals chief executive officer John Morgan said: “These maiden results represent a highly encouraging start to modern exploration at the Blue Lagoon Project and provide strong validation of the historical Greenland and Denmark Geological Survey geochemical anomalies that originally attracted us to this area.” Just as importantly for Greenland, uranium and thorium levels are extremely low, coming in well below Greenland’s mandated 100 parts per million maximum uranium threshold. That outcome could significantly reduce permitting risks, setting Blue Lagoon apart from many other rare earths systems that have become burdened with too much radioactive baggage. Zirconium results stand out, too. Multiple samples have returned zirconium oxide grades above 2 per cent, with a best result of 4.42 per cent zirconium oxide, accompanied by 98ppm hafnium oxide. The second-best zirconium oxide result came in at 4.09 per cent, coupled with the top hafnium oxide hit of 99ppm.\n\nAdvertisement\n\nHafnium showed strong and consistent enrichment, with values commonly above 40 parts per million along the entire strike length sampled. That is particularly relevant because hafnium is both scarce and strategically critical. As a high-value metal essential for next-generation semiconductors, hafnium also has a significant role in advanced microchips, where it is used to replace silicon dioxide, putting it squarely on the radar of Western governments looking to secure future technology supply chains. What makes the overall discovery even more intriguing is that the project hasn’t seen any modern exploration since 1979. Dalaroo has effectively taken a long-forgotten Greenland anomaly and breathed new life into it with systematic sampling, modern geochemistry, analytical methods and vastly improved detection limits, with a clear eye on future development pathways. The geological setting ticks plenty of boxes. Blue Lagoon sits within Greenland’s Gardar-age alkaline intrusive province, a proven host for zirconium, niobium and rare earths deposits. Historic government survey data flagged the area decades ago and Dalaroo’s results have validated that work through vastly superior modern analytical and exploration methods.\n\nAdvertisement\n\nWith the company recently topping up its coffers via a $1.35 million placement in October, the next exploration phase in Greenland is already being lined up. Dalaroo’s discovery could scarcely be better timed. As the West scrambles to lock in critical mineral supply outside China, US President Trump has floated his own ideas about taking control of Greenland – by consent or by coercion – thrusting the company’s project into the global spotlight. The company’s follow-up work is expected to include geophysics, detailed mineralogy, further surface sampling and shallow drilling to chase the source of the mineralisation at depth. If those programs confirm what the surface sampling results are already shouting, Blue Lagoon could quickly be elevated from a mere curiosity - with its assemblage of strange metal names from the dark recesses of the periodic table of the elements - to a cornerstone asset that could put Dalaroo firmly on the critical minerals map. Is your ASX-listed company doing something interesting? Contact: mattbirney@bullsnbears.com.au\n\nSave You have reached your maximum number of saved items. Remove items from your saved list to add more. Share More: Bulls N' Bears\n\nSharemarket\n\nShares",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/tennis/can-sinner-make-it-a-threepeat-our-tennis-scribes-have-their-say-expert-tips-bluffer-s-guide-to-australian-open-20260114-p5nu32.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Can Sinner make it a threepeat? Our tennis scribes have their say: Expert tips to Australian Open",
        "publish_date": "Fri, 16 Jan 2026 11:58:14 +1100",
        "category": "sports",
        "authors": [
            "Marc Mcgowan"
        ],
        "text": "Michael Gleeson Men’s winner: Sinner again.\n\nMen’s runner-up: Zverev again\n\nWomen’s winner: Coco Gauff.\n\nWomen’s runner-up: Swiatek.\n\nThe player everyone will be talking about and why: Not everyone will be talking about it, but the coffee drinkers will not lightly forget Iga Swiatek dissing Melbourne coffee. Because, like, Polish coffee is so good ...\n\nBiggest story of the tournament: Casper Ruud quits the semi-final mid-match to fly to Norway to be at the birth of his first child.\n\nThe Australian who will capture the public’s attention: Aside from de Minaur, I can’t see many Aussies ringing a bell, but I do expect there to be fascination in the Norwegian Ruud as per the above.\n\nHow far will Demon make it? Third round (Tiafoe).\n\nThe thing that will have fans grumbling: Why are there more party courts? Why aren’t there more party courts? Also, where is Danielle Collins? I miss her. Coco Gauff warming up at Melbourne Park this week. Credit: AP Billie Eder Men’s winner: Jannik Sinner.\n\nMen’s runner-up: Carlos Alcaraz.\n\nWomen’s winner: Elena Rybakina.\n\nWomen’s runner-up: Aryna Sabalenka.\n\nThe player everyone will be talking about: OK, big call, but I’m going to say Australian wildcard Taylah Preston. I watched her beat Emma Raducanu on Thursday night, and she looked ferocious and powerful. She would likely have a tough second round opponent in Linda Noskova, but Australians always perform and surprise at Melbourne Park.\n\nBiggest story of the tournament: Here we go, another big call, but I think Australian Alexei Popyrin eliminates 2025 finalist Alexander Zverev in the second round. Popyrin can pull an amazing tournament out of nowhere, and Zverev has been vulnerable since his appearance in last year’s final. Heard it here first.\n\nThe Australian who will capture the public’s attention: Who else but our newest Australian, Daria Kasatkina? She should win her first round match against qualifier Nikola Bartunkova, but it will be the second round that’s likely tricky, with world No.10 Belinda Bencic predicted to play Kasatkina. First Australian Open as an Australian, that’s going to be pretty memorable.\n\nHow far will Demon make it? I really want Alex de Minaur to make his grand slam semi-final debut in Australia, but unfortunately, I just don’t think that’s going to happen. He’s predicted to meet world No.1 Carlos Alcaraz in the quarter-finals, and I think that’s where his tournament ends.\n\nThe thing that will have fans grumbling: Come on, as always, it’s going to be the late finishes. Tennis is renowned for its ridiculous finish times, and I can already see the fans streaming out of Melbourne Park at 1am or 2am after a five-set epic.\n\nScott Spits Men’s winner: Carlos Alcaraz. It’s time for the world No.1 to make his mark on Melbourne.\n\nMen’s runner-up: In a dream final Alcaraz will pip Jannik Sinner in four sets.\n\nWomen’s winner: Elena Rybakina.\n\nWomen’s runner-up: Coco Gauff.\n\nThe player everyone will be talking about: Jordan Smith. We might have already seen the player on everyone’s lips. The amateur player from NSW took home $1 million – the last player standing in the AO’s “1-Point Slam”. Everyone was gripped by the moment, even Alcaraz.\n\nBiggest story of the tournament: Novak Djokovic. Whatever the 10-time champion does, how far he goes in the tournament and even his interactions with a TV host – ala his dispute with Tony Jones last year – are guaranteed to generate headlines.\n\nThe Australian who will capture the public’s attention: Maya Joint might be women’s world No.32 and our best women’s player, but she remains a huge unknown to the local audience. That will change over the next two weeks.\n\nHow far will Demon make it? Quarter-finals. I’m tipping Alex de Minaur to fight his way through a challenging draw before Alcaraz stops him at the oh-that’s-so-frustrating quarter-final stage.\n\nThe thing that will have fans grumbling: Fighting for seats on the outside courts. The AO gets bigger and bigger by the year. Therefore, securing great seats on show courts and smaller courts to watch top matches gets more difficult. Jake Niall Men’s winner: Sinner.\n\nRunner-up: Alcaraz.\n\nWomen’s winner: Sabalenka.\n\nRunner-up: Amanda Anisimova.\n\nThe player everyone will be talking about: Novak Djokovic. At 38, this might be his last shot at an 11th title.\n\nBiggest story of the tournament: Dodgy use of medical timeouts in a critical match.\n\nThe Australian who will capture the public’s attention: Maya Joint.\n\nHow far will the Demon make it: The fourth round.\n\nThe thing that will have the fans grumbling: Beer prices or shortages. Hannah Kennelly Loading Men’s winner: Sinner.\n\nMen’s runner-up: Alcaraz.\n\nWomen’s winner: Swiatek.\n\nWomen’s runner-up: Sabalenka.\n\nPlayer everyone will be talking about: Sabalenka. After her controversial Battle of the Sexes match with Nick Kyrgios, I suspect Sabalenka will continue to keep Aussies talking. She’s got a brilliant, fiery style of tennis and will no doubt stay in the headlines.\n\nThe Australian who will capture the public’s attention: Dane Sweeny. Ranked as low as 680th in the world last year, Sweeny’s had a meteoric comeback and qualified for the men’s singles this year. There wasn’t a spare seat for his qualifying matches this week. The 24-year-old has an entertaining, almost acrobatic, style of tennis and is definitely one to watch.\n\nHow far will Demon make it: Fourth round. I’m a massive fan, but the Aussie definitely has a tough draw this year. I struggle to see him getting past Alexander Bublik, but happy to be proved wrong.\n\nBluffer’s guide to the Open By Marc McGowan Not everyone is a tennis aficionado. But you will be able to bluff your mates by reading our Australian Open form guide, which should quickly bring you up to speed with what is about to happen across the next fortnight. The bankable stars Ten-time champion Novak Djokovic is the undisputed king of Melbourne Park, and has not lost before the semi-finals since 2018. Even at age 38, Djokovic remains a leading title threat. World No.1 Aryna Sabalenka is trying to win her third women’s singles championship in four years – after losing the final to Madison Keys in 2025 – while Jannik Sinner is hunting a hat-trick of men’s titles.\n\nLoading Chasing history This is the worst-performed slam for Carlos Alcaraz, but he was still a quarter-finalist the past two years and needs the Australian Open trophy to complete his grand slam set. Alcaraz would join Djokovic, Rafael Nadal, Roger Federer, Andre Agassi, Rod Laver, Roy Emerson, Fred Perry and Don Budge as the only men to do that if he salutes at Melbourne Park. Iga Swiatek is also eyeing a career grand slam in Australia after winning Wimbledon for the first time last year. Margaret Court, Maureen Connolly, Steffi Graf, Doris Hart, Shirley Fry, Billie Jean King, Chris Evert, Martina Navratilova, Serena Williams and Maria Sharapova won each of the four majors. Don’t count on ’em Casper Ruud is a triple grand slam finalist, but reached the fourth round at Melbourne Park only once in six previous trips, including four exits by the second round. Other men’s seeds with questionable records here are Alexander Bublik (four first-round and three second-round exits), Lorenzo Musetti (never beyond the round of 32 in four visits), Arthur Rinderknech (three first-round losses from four Opens) and Corentin Moutet (lost by the second round in five of six attempts). On the women’s side, it is difficult to trust Leylah Fernandez (five second-round losses from six tries), Liudmila Samsonova (never past the second round in six trips), Emma Raducanu (three second-round exits out of four attempts) and Ekaterina Alexandrova (five first-round defeats from nine Opens).\n\nNew names to track Loading Valentin Vacherot is at the top of this list. A virtual unknown before last year’s Shanghai Masters, the Monaco man stormed from qualifying to the title, beating his cousin Rinderknech in an unlikely final. His scalps included Bublik, Holger Rune and Djokovic. Powerful trio Gabriel Diallo, Raphael Collignon and Ethan Quinn enjoyed breakout seasons in 2025, too. Indonesia’s Janice Tjen was one of the WTA Tour’s biggest risers last year, surging from a year-end ranking of No.412 in 2024 to a career-high No.53. Other steep climbers were Germans Eva Lys and Ella Seidel, Filipino Alexandra Eala and Colombia’s Emiliana Arango. The teenage tyros",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/trump-tower-considered-for-gold-coast-20260116-p5nuko.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Trump Tower considered for Gold Coast",
        "publish_date": "Fri, 16 Jan 2026 11:55:03 +1100",
        "category": "finance",
        "authors": [],
        "text": "Remove items from your saved list to add more.\n\nYou have reached your maximum number of saved items.\n\nSave this video for later\n\nAdd videos to your saved list and come back to them anytime.\n\nGot it",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/lifestyle/life-and-relationships/was-2016-the-last-good-year-social-media-seems-to-think-so-20260116-p5nuj1.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Was 2016 the last ‘good’ year? Social media seems to think so",
        "publish_date": "Fri, 16 Jan 2026 11:40:15 +1100",
        "category": "lifestyle",
        "authors": [
            "Lauren Ironmonger"
        ],
        "text": "Advertisement\n\nLifestyleLife & relationshipsSocial media Was 2016 the last ‘good’ year? Social media seems to think so Lauren Ironmonger January 16, 2026 — 11:40am Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share A A A\n\nWhere were you in 2016? I’ll go first. I’d just started uni and I had thick curtain bangs à la twee queen Zooey Deschanel. Beyoncé’s Lemonade was getting some serious air time on my car radio, and Instagram still showed posts in order of when they were posted. I didn’t know what a Labubu was and Rihanna was still making music. It was, put simply, a pretty good year. 2016, clockwise from top left: Kylie Jenner, Selena Gomez, Ariana Grande, then-couple Kendall Jenner and Harry Styles, Karlie Kloss and Taylor Swift, and Bella Hadid. Yes, part of this is just the buoyancy of youth, the feeling of having “the world at my feet”, to quote my year 12 yearbook. But I’m not alone in idealising 2016. The latest social media trend invites users to share photos of themselves from a decade ago, with celebrities like Kylie Jenner, Selena Gomez and Hailey Bieber taking part.\n\nAdvertisement\n\nOn TikTok, searches for “2016” surged by 452 per cent in the second week of the new year, while compilation videos of “peak Millennial culture” – think moustache tattoos, typewriters and flower crowns, all pictured in sepia tones and set to the tune of indie-folk group The Middle East’s Blood – are trending. So, why 2016? Obviously, 2026 marks a decade on. But it was also a watershed year in many ways. Donald Trump defeated Democrat Hillary Clinton in the US election, the Brexit vote took place and the Paris Agreement came into force (the last of which, a decade later, we’re on track to surpass).\n\nAdvertisement\n\nIt was a time before AI slop ruled our social media feeds, before a global pandemic turned the world inwards and before Twitter became a vanity project for Elon Musk. Gen Z – the youngest of whom were just four years old in 2016 – are embracing the culture of their Millennial elders, romanticising their youth as a simpler, more optimistic time. Editor's pick Global economy From Gaga to tradwives: Signs of economic doom, according to the internet It makes sense. Millennials came of age in an era of overwhelming hope. Start-up culture was in full swing and it was still possible to survive on a barista wage in a city like Sydney. Fuelled by Obama-era optimism, many felt like real progress was being made when it came to social issues like LGBTQ and reproductive rights, racial justice and body positivity.\n\nAdvertisement\n\nMany Gen Z today are understandably pessimistic about the future, faced with a near-impenetrable housing market, growing political polarisation and a dying planet. Many, particularly young women, have given up on love entirely. Obviously, 2016 was far from perfect. The very nature of nostalgia means we see the past through rose-tinted glasses. Clearly, the forces that led to where we are today had been brewing for some time. But in periods of deep economic and political uncertainty, it’s understandable we find comfort in the warm glow of our memories. I, for one, will be riding out the end of the world by reviving the Mannequin Challenge, watching Glee and strumming my ukulele. Make the most of your health, relationships, fitness and nutrition with our Live Well newsletter. Get it in your inbox every Monday.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/tennis/the-australian-open-is-offering-10-million-for-one-lucky-fan-but-there-s-almost-no-way-to-win-20260113-p5ntrb.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "The Australian Open is offering $10 million for one lucky fan. But there’s almost no way to win",
        "publish_date": "Fri, 16 Jan 2026 11:30:00 +1100",
        "category": "sports",
        "authors": [
            "Frances Howe"
        ],
        "text": "In the most ideal world, a punter would pick the favourite for every match and there would be no upsets. If they did, they’d pocket $10 million. But the chances of that happening are, you guessed it, pretty slim. In fact, a zero-upset tournament has never occurred in grand slam history. Last year, 13 seeded players (ranked in the top 32) were knocked out by an unseeded player in the first round of the tournament alone, meaning anyone that only picked match favourites would be wrong 13 times after just the first round. One lucky fan could ride an Alex de Minaur hot streak all the way to $10 million. Credit: Eddie Jim “Even if we use the best possible predictive techniques we have in statistics and machine learning, we can still only get that probability down to one in a billion because there is so much chance, variability, close games, changes in individuals, differences in performance on days,” Humphries said. “No matter how much you know about the game, it’s almost impossible to get 127 decisions correct.” On the other hand, “If you don’t enter, then your chances of winning are precisely zero,” she said. “Even if your chance of winning is one in a billion – that’s still better than zero, even though it’s very close to zero.”\n\nTennis Australia knows the chances are that slim because it didn’t come up with the idea. It’s actually a favourite of Warren Buffett, who routinely offers huge sums of cash for his employees if they can correctly guess every outcome of the 67 games of “March Madness”, the big annual tournament in men’s and women’s college basketball. No one has ever done it, but luckily for his employees, the consolation prize is a little more than what Tennis Australia is offering, at $US100,000 for the next best guesses. In response to our experts’ number crunching, Tennis Australia director of audience Phil Brook said: “Picking 127 winners is a big challenge, but there’s a huge prize of $10 million if someone has the skill to do it. Last night, against all odds, we saw an amateur beat the world’s best men and women players to win $1 million. So, in tennis, anything’s possible. “In addition to the $10 million grand prize there are two $10,000 prizes that will be won by the best bracket in each of the men’s and women’s main draws. So, it’s definitely worth having a go. Nexo co-founder Antoni Trenchev with US president Donald Trump at the Trump International Golf Links in Aberdeen, Scotland. Credit: Instagram/Nexo “Bracket challenges are huge in the US. During March Madness … everyone fills one out and follows the tournament. Even Barack Obama filled out his bracket while in the White House. In Australia, footy tipping and Melbourne Cup sweeps are a tradition, and we plan to make the AO Bracket Challenge another great Australian tradition.”\n\nTennis Australia says it is a competition based on skill and not chance. That’s because if it were purely based on chance, TA would have had to pay to register the competition as a trade promotion lottery in several Australian states, and agree to be regulated by state bodies. Loading Either way, the offer of $10 million is a sure bet to get more eyes on the brand partnership between Tennis Australia and Nexo, which professor Alex Russell, from the Experimental Gambling Research Laboratory at CQUniversity, said was handy given those likely to take a chance at winning $10 million may also be the kind to try out cryptocurrency. “It fits in with that whole crypto vibe of you can make a tonne of money real quick,” he claimed. Tennis Australia’s partnership with the company follows a re-emerging trend for sports organisations to pair with crypto platforms. The Open is Nexo’s fourth partnership with a tennis event – and they could certainly afford the $10 million.",
        "source": "TheAge"
    },
    {
        "url": "https://au.news.yahoo.com/carnival-cruises-accused-by-union-of-exploiting-staff-in-aussie-waters-015745433.html",
        "title": "Carnival Cruises accused by union of 'exploiting’ staff in Aussie waters",
        "publish_date": "2026-01-16T01:57:45Z",
        "category": "finance",
        "authors": [],
        "text": "Cruise ship workers on boats based in Australia are allegedly earning the equivalent of just a few dollars an hour, with unions revealing that a legal exemption allows foreign-flagged ships to operate under international labour standards rather than Australian workplace laws.\n\nThe Maritime Union of Australia (MUA) claims the pay rates apply to crew working on three Carnival Cruise Line ships home-ported in Sydney and Brisbane, which spend much of the year sailing Australian coastal routes with Australian passengers.\n\nDespite operating primarily in Australian waters, the ships are exempt from domestic labour laws under a long-standing ministerial provision in the federal Coastal Trading Act 2012. The exemption was due to expire at the end of 2024, but was extended until December 31, 2026.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nThe exemption excludes foreign-owned cruise ships over 5000 gross tonnes with more than 100 passengers from Australian licensing obligations. It means they can pay crew in line with international maritime standards rather than the Australian minimum wage, significantly reducing the costs of operating in Australian waters .\n\nMUA national secretary Shane Reside told Yahoo News Australia that whistleblowers had reported crew working long hours over extended periods, with wages paid monthly in US dollars.\n\nWhen calculated against hours worked, he said some hospitality and housekeeping staff earned the equivalent of around $2.50 an hour.\n\nCarnival Cruise Line has rejected the claims, saying its wages meet or exceed international maritime standards and are supported by additional benefits including accommodation, meals and medical care.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nDo you have a story about cruising? Contact newsroomau@yahoonews.com\n\nCarnival Cruises are beloved by Australians. Source: Getty\n\nHave cruise ships in Australia slipped under the radar?\n\nReside believes the system regulating shipping in Australia \"is very lax\".\n\n\"At the top of the chain you’ve got the captain, first officer and other senior crew — most of them are European — and they get paid very well,\" he said.\n\n\"Right at the bottom, you’ve got housekeepers and back-of-kitchen hospitality staff, and they get paid very poorly.\n\n\"Reports we’ve received from whistleblowers on board indicate some crew are working up to 10 or 12 hours a day, often for several months without a single day off.\"\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nAccording to Reside, some crew are being paid as little as $2.50 an hour when a staff member's end-of-month pay is divided by long hours.\n\nReside alleges Carnival have \"slipped under the radar\" and discovered a corner of Australian regulation that allows them to \"operate in Australia while paying wages of Thailand or Bali\".\n\n\"What the companies say is that this is good wages for the economies that people are from, and that kind of illustrates our point perfectly,\" he said.\n\n\"The majority of crew are from some of the poorest economies on earth. Other cruise liners are paying better, while Carnival’s are badly exploited.\"\n\nCarnival Cruises responds to union accusations\n\nFor its part, Carnival said it \"has nothing to hide\". It branded the MUA's claims \"baseless\".\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\n\"The Maritime Union of Australia is using Carnival’s crew to launch a membership drive,\" a spokesperson alleged to Yahoo News.\n\n\"Their tactics do a disservice to the thousands upon thousands of dedicated shipboard team members who take pride in their work and in the culture of respect that defines Carnival Cruise Line.\n\nThe spokesperson said its teams include crew who have been employed for 30 or even 40 years.\n\n\"People who build careers with us, support their families through their work, and in many cases sail alongside spouses, siblings, or relatives,\" they said.\n\nThe union’s preferred outcome is a collective agreement that delivers significantly higher pay, permanent jobs and stronger protections for workers.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nReside argued that if Carnival refused to negotiate, the federal government should step in and remove the company’s exemption under the Coastal Trading Act, a move that would force cruise operators to pay full Australian wages.\n\nCarnival has denied the MUA's claims, labelling them 'baseless'. Source: Getty\n\nMUA calls for permanent jobs, higher wages\n\nReside believes the Australian public would be \"shocked\" to hear how low the wages are for Carnival cruise staff.\n\n\"Australians love cruising and have fantastic experiences with the crew. When we explain the pay conditions, people are outraged,\" he said.\n\n\"Since the campaign started on social media, we’ve seen an enormous uptake.\n\n\"Now people know how bad the conditions are and are asking how they can support the campaign\".\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nUltimately, Reside is calling for permanent jobs, saying most crew are currently employed on six-, nine- or 12-month contracts before being sent home unpaid with no job security.\n\nHe said that insecurity prevents workers from speaking up, warning that those who do are often sent home and never rehired.\n\nReside argued that permanent roles with paid leave would immediately lift wages and give workers the security needed to raise concerns, something he said was \"critically important\".\n\nDo you have a story tip? Email: newsroomau@yahoonews.com.\n\nYou can also follow us on Facebook, Instagram, TikTok, Twitter and YouTube.",
        "source": "Yahoo"
    }
]