[
    {
        "url": "https://www.9news.com.au/world/leonard-lauder-death-son-of-cosmetics-pioneers-estee-and-joseph-lauder-dies-aged-92/4876717a-2a8b-46d9-bb8e-e4b2915e65b2",
        "title": "Leonard Lauder, billionaire heir to cosmetics empire, dies at 92",
        "publish_date": "Mon, 16 Jun 2025 00:37:37 +0000",
        "category": "finance",
        "authors": [
            "Jun"
        ],
        "text": "Leonard Lauder, the eldest son of cosmetics pioneers Estée and Joseph H. Lauder and the former head of cosmetics giant Estée Lauder Companies, died on Saturday, according to an announcement by the company. He was 92.\n\n\"Throughout his life, my father worked tirelessly to build and transform the beauty industry, pioneering many of the innovations, trends, and best practices that are foundational to the industry today,\" Leonard's son William P. Lauder, who serves as chairman of the company's board of directors, said in the statement.\n\nBorn to a Jewish family in New York City, Leonard Lauder as a boy would join his mother on sales calls in salons and helped her pack boxes of powder and cleansing oils.\n\nLeonard Lauder, the eldest son of cosmetics pioneers Estée and Joseph H. Lauder, pictured here in 2014. (Dennis Van Tine/PA Images/Getty Images)\n\nHe would later attend and graduate from Columbia University's School of Business after serving as a lieutenant in the US Navy for three years.\n\nHe formally joined Estée Lauder at age 25 in 1958, when the company had just a handful of employees and under $1 million (approx. $1.5 million) in sales.\n\nEstée Lauder Companies would grow into a global empire with a portfolio that includes Clinique, La Mer, The Ordinary, MAC Cosmetics and Bobbi Brown Cosmetics.\n\nAmong his many roles included serving as president for 23 years, beginning in 1972, and chief executive from 1982 to 1999.\n\nHe was named chairman in 1995 and held the role until 2009, according to the company.\n\nIn 1995, Lauder took the company public on the New York Stock Exchange at $26 a share.\n\nThe Estée Lauder Companies Inc. (EL) now has a market capitalisation of about $24.3 billion.\n\nAccording to Bloomberg's Billionaire Index, Lauder had a personal net worth of $15.6 billion.\n\nWhen asked what he would want to be remembered for during a 2020 interview with CBS News, Lauder replied: \"He listened … and he was kind.\"\n\nHe formally joined Estée Lauder at age 25 in 1958. Lauder pictured here in 2023. (Getty Images for Wharton School')\n\nWithin 24 hours of meeting Lauder, one could expect intimate, often handwritten, notes from the beauty pioneer.\n\nIt was a sales technique that resembled the professional style of his mother, who was also known for believing business was about developing and maintaining relationships and making people feel important.\n\n\"At the beginning, we never advertised … we gave out samples,\" he told David Rubenstein, the co-founder of the Carlyle Group, in 2021.\n\n\"We gave out samples that were large enough. If you give a customer a sample of a product and they like it, they come back and buy it again and again and again – that's what builds the business.\"\n\nLauder has been credited with creating \"the lipstick index\" during the economic downturn following the attacks on September 11, 2001.\n\nHe noticed that the purchase of cosmetics, especially lipsticks, tended to be inversely related to the economy because women replaced more expensive purchases with small pick-me-ups.\n\nIn the fall of 2001, US lipstick sales increased by 11 per cent.\n\nAnd back during the Great Depression, cosmetics sales overall increased by 25 per cent.\n\nLauder was also a devoted philanthropist and art collector.\n\nEstée Lauder Companies would grow into a global empire. (AP)\n\nREAD MORE: Race against time to find gunmen who shot Aussies in Bali\n\nIn 2013, he pledged a 78-piece collection of cubist art to the Metropolitan Museum of Art in New York City – the largest single philanthropic gift in the Met's history, according to Estée Lauder.\n\nHe also established a research centre for modern art at the Met, which supported fellowships, exhibitions and public lectures.\n\nHe was also an advocate of cancer research and served as an honorary chairman on the Breast Cancer Research Foundation's board of directors.\n\nIn 1998, Lauder and his brother, Ronald S. Lauder, founded the Alzheimer's Drug Discovery Foundation, which supports drug research to prevent, treat and cure Alzheimer's.\n\n\"His impact will be felt for generations to come thanks to his tireless philanthropy, advocacy, and creativity in tackling some of the world's greatest challenges. The number of lives he touched and positively impacted across all his endeavours is immeasurable,\" said Ronald Lauder, 81, who serves as chairman of Clinique Laboratories.\n\nThe company's founding family remains the biggest shareholder in the firm, and three members serve on the board of directors.\n\nHe is survived by his wife, Judy Glickman Lauder, and his sons William and Gary.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/hunt-for-suspected-arsonist-after-wa-car-yard-goes-up-in-flames/287c667f-26c7-4585-8915-a7d36245fb16",
        "title": "Hunt for suspected arsonist after car yard goes up in flames",
        "publish_date": "Sun, 15 Jun 2025 12:22:30 +0000",
        "category": "finance",
        "authors": [
            "Jun"
        ],
        "text": "An industrial car yard in Perth's south has been hit in a suspected arson attack.\n\nFlames destroyed multiple vehicles in Port Kennedy, with explosions heard from suburbs away.\n\nSeven vehicles went up in flames about 9.30pm yesterday, leaving the Paxton Way smash repair business looking more like a furnace.\n\nFlames destroyed multiple vehicles in Port Kennedy, with explosions heard from suburbs away. (9News)\n\n\"I heard a bang then another big bang,\" witness Aimee Leigh Brown said.\n\n\"I was a little bit worried, I didn't want to come out. And yeah just a lot of noise for a very quiet area.\"\n\nEmergency crews forced their way on to the property, cutting through a wire fence to fight the flames\n\nA nearby paint workshop full of flammable liquids was another concern for firefighters.\n\nSeven vehicles went up in flames about 9.30pm yesterday, leaving the Port Kennedy smash repair business looking more like a furnace. (9News)\n\nCar owners arrived today to see what was left.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/world/van-gogh-chair-idiot-tourists-sit-on-and-break-delicate-chair-in-italian-museum/3822b719-1eaa-4e76-bc3b-2a42cc28b4a1",
        "title": "Idiot tourists sit on and break 'delicate' Van Gogh chair in Italian museum",
        "publish_date": "Sat, 14 Jun 2025 01:39:05 +0000",
        "category": "entertainment",
        "authors": [
            "Jun"
        ],
        "text": "Two tourists have been caught on CCTV sitting on and breaking a \"very delicate\" art piece at an Italian museum.\n\nThe \"Van Gogh\" chair covered in Swarovski crystals, made by artist Nicola Bolla, was displayed in Verona's Palazzo Maffei Museum.\n\nIt was destroyed when a male tourist tried to sit on the chair, breaking it immediately.\n\nIdiot tourist break Van Gogh art chair at Palazzo Maffei. (Instagram)\n\nAnother female tourist, appearing to be his partner, stood by taking photos while ﻿the man broke the chair.\n\nThe museum released the video footage of the incident, condemning the actions of the pair.\n\n﻿\"Disrespectful behaviour has put the integrity of a work of art at risk: the 'Van Gogh' chair by the artist Nicola Bolla was damaged by some visitors,\" the museum said on Instagram.\n\n\"[They were] waiting for the security personnel to leave, chose to take a 'spectacular' photo, ignoring every rule of respect for art and cultural heritage.\"\n\nIdiot tourist break Van Gogh art chair at Palazzo Maffei. (Nine)\n\nThe chair covered in Swarovski crystals, made by artist Nicola Bolla, was in Verona, Italy's Palazzo Maffei Museum. (Facebook: Palazzo Maffei Verona)\n\nIn another post to Facebook, the museum said they were able to fix the chair after ﻿days of not knowing whether the piece could be saved.\n\n\"We are sharing this episode not only for the record, but to start a real awareness campaign on the value of art and the respect it deserves,\" the post read.\n\n\"A heartfelt thanks goes to the police, our security department and the restorers, whose precious work allowed the work to be recovered.﻿\"",
        "source": "9News"
    },
    {
        "url": "https://www.abc.net.au/news/rural/2025-06-16/record-merino-ram-sale-recalled-by-country-hour-veteran/105397444",
        "title": "The $450,000 ram and what became of Australia's wool industry",
        "publish_date": "Mon, 16 Jun 2025 01:40:13 +0000",
        "category": "finance",
        "authors": [],
        "text": "Times were tough in 1989: mortgage interest rates were hovering around 17 per cent, and even Sydney's real estate market was feeling the pinch.\n\nBut someone still found $450,000 to spend on a single ram.\n\nAs the Country Hour gets ready to mark 80 years on air, the ABC picked the brains of former rural reporters about the stories they will never forget.\n\nFor Leigh Radford, the former head of ABC Rural, it was that day at the Royal Adelaide Show when a merino ram sold for a world-record price.\n\nLeigh Radford will never forget the day a ram sold for $450,000. (Supplied)\n\n\"It's just extraordinary that that amount of money was paid for a single ram,\" he said.\n\n\" But it was right at the top of the ride for the Australian wool industry. \"\n\nRiding on the sheep's back\n\nWool was once Australia's biggest export.\n\nIn 1950, the fibre was selling for $37 per kilogram, according to the Department of Foreign Affairs and Trade, but by 1970–71 the price had fallen to just $0.60 per kilogram.\n\nWool was Australia's top export in the 1950s. (Supplied: Collinsville Stud)\n\nThe industry was propped up with a Wool Deficiency Payments Scheme in 1971, and then a Reserve Price Scheme for wool, which operated between 1974 and 1991 and kept profits artificially high.\n\nIn 1985, West Australian Neil Garnett paid $10.5 million for South Australia's Collinsville stud.\n\nThe world record sale price for a merino was broken six times under his ownership, with the run culminating in the ram called JC&S Lustre 53.\n\nA record price of $47,000 for a ram was set in 1982 but beaten in 1989. (Supplied: Merino SA)\n\nTony Wetherall was the auctioneer for the record sale.\n\n\"The whole ram shed was absolutely packed, media everywhere; you could hear a pin drop,\" he recalled.\n\nMr Wetherall said overseas interest in Australian genetics helped to drive ram prices to record levels.\n\n\"Back in the day, Collinsville was selling a lot of semen, and that ram may have had a thousand orders at $50 a dose,\" he said.\n\nA 1995 ABC 7.30 story on Collinsville reported that a third of the Australian wool clip had direct genetic links to the stud, making it the most influential in the country.\n\nWool crash\n\nBut just a couple of years after the auction, Leigh Radford was reporting on another turning point for the industry.\n\nWool industry slump Photo shows A woman in a hat and white shirt stands in a sheep yard. Wool production is forecast to drop to its lowest level in 100 years, but young farmers remain optimistic about the future.\n\nThe Australian Wool Commission (AWC) was running the reserve price scheme, setting a minimum price for wool to smooth out fluctuations in prices for growers.\n\nIt would buy the wool that did not sell, store it, and sell it later when the market recovered.\n\nBut demand was softening and sometimes 90 per cent of the offering was being bought by the commission.\n\nMr Radford was soon reporting on the collapse of that scheme.\n\n\"It became like printing money, it became too good,\" he said.\n\n\"Supply ran ahead of demand, prices got to 1,200c per kilogram on an average basis and the floor price was running at about 870c.\"\n\nThe Collinsville Stud went into receivership in 1991, owing $43 million.\n\nBy the end of the 1990s, it was reported Australian greasy wool production had fallen by 35 per cent.\n\nWhat happened to the ram?\n\nPaddy Handbury, a nephew of Rupert Murdoch, bought Collinsville in 1995 and Tim Della came on board as stud manager in 2008.\n\nMr Dalla was at the Adelaide Show that day as well, but he was just seven years old.\n\nHe is now Collinsville Stud's general manager and he said Lustre, the record-breaking ram, was put to work producing semen to sell for artificial insemination.\n\nTim Dalla (left) became manager of the Collinsville Stud and Tony Wetherall (middle) was the Elders auctioneer. (Supplied: Collinsville Stud)\n\n\"A lot of people used him through AI and he threw a lot of progeny,\" Mr Dalla said.\n\nLustre would sire three Adelaide Show supreme champions.\n\nBut the days of rams being worth more than houses appear to be over.\n\nMr Dalla said the top-priced ram since 1989 sold for $115,000 in 2022, a long way off the record price.\n\nSeasonal conditions are affecting wool growers now, with Collinsville recording its lowest rainfall figures since it was established in 1889.\n\nThis season has been the worst since the Collinsville Stud was established. (Supplied: Collinsville Stud)\n\nWhile the industry ponders how to deal with drought and increase demand for wool in the face of ongoing competition from artificial fibres, the Country Hour continues telling the stories of rural Australia.\n\nMr Radford is still broadcasting on the ABC and active in leadership roles in agricultural organisations around the world.\n\nBut he regards his career with the Country Hour as his finest work.\n\n\"It has been such a great privilege to meet people doing amazing things in very understated ways often,\" he said.\n\nThe 80th anniversary of the first Country Hour broadcast is on December 3, a milestone that makes it the longest-running radio program in the Southern Hemisphere.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-06-16/board-game-club-combats-isolation-in-regional-sa/105412846",
        "title": "'Moving to a new place can be lonely': Board gamers foster connections",
        "publish_date": "Mon, 16 Jun 2025 01:23:08 +0000",
        "category": "finance",
        "authors": [],
        "text": "When Luke Atkinson started a tabletop gaming club more than a decade ago, only 10 people turned up to its first session.\n\nThey squeezed into a small room at the local library to play a single game, and it was an altogether modest affair — but at its end, Mr Atkinson was jubilant.\n\nHe had only moved to the small town of in Kadina on South Australia's Yorke Peninsula earlier that year, and alongside a friend, Mark Dennett, had founded the group with the idea of making community connections in his new home.\n\nIn that light, the first event had been, for him, an unqualified success.\n\nThe group attracts more than 300 people to play games each year. (ABC Eyre Peninsula: Declan Durrant)\n\nBut he could not have foreseen how his and Mr Dennett's club would prove an even greater one: the group, 13 years on, now has its own building, and more than 300 people come there to play games throughout the year.\n\nCopper Coast Tabletop, the gaming club the pair started, still runs three times weekly out of a former weigh station in the nearby town of Wallaroo.\n\nThey play everything, from Monopoly and Cluedo to miniature model games like Warhammer, or the card deck-builder Magic: The Gathering.\n\nThe club has, in many ways, been the beneficiary of the board-game popularity boom that has blown the industries out to an estimated $18.8 billion globally in the past decade.\n\nBut its success is also attributable to a larger social movement that has become particularly important in regional communities — combating loneliness.\n\nGame board's common ground\n\nIt's no secret making friendships can be difficult for people moving to regions, particularly if they don't play sport. And Mr Atkinson knows that all too well.\n\nSo when he arrived in Kadina, he thought one of his old hobbies might help him and others who felt the same way.\n\n\"When you first move to a town, you don't know anyone, and generally there's a lot of close-knit friendship groups because they've known each other for generations or went to school together,\" Mr Atkinson said.\n\nTabletop gamers meet three times a week in a former weigh station in Wallaroo. (ABC North and West: Declan Durrant)\n\n\"And I've loved board games and miniature games since childhood, for both the challenge and their artistic value, and I wanted to offer that same joy and connection to the wider community.\n\n\"Because developing an environment where people can just come and enjoy hobbies and not feel like an outsider … and just connect with people, that's so important.\n\n\"Moving to a new place can be lonely.\"\n\nTackling social isolation\n\nAccording to the Department of Human Services (DHS), 27 per cent of South Australians experience persistent loneliness, while 20 per cent experience persistent social isolation, meaning they had infrequent social contact for at least eight weeks at a time.\n\nThe DHS says South Australians are the second-most socially isolated people in the country behind the Northern Territory.\n\nFlinders University senior lecturer in social policy Ben Lohmeyer said in Australia, young people in particular were more vulnerable to loneliness than previously thought.\n\nBen Lohmeyer says a shared interest is a good way to connect with other people. (Supplied: Ben Lohmeyer)\n\n\"The key thing we want when tackling social isolation and loneliness is giving people a chance to make meaningful connections with others,\" Dr Lohmeyer said.\n\n\"Having choice over where they do that, particularly if they're choosing something that's a shared interest, sounds like a great way to build connections and get to know other people.\"\n\nHe said it was important for people to have a \"third space\" — somewhere outside of work and home.\n\n\"It could be sport, a religious community or a shared interest like gaming.\n\n\"But that third space is really important to give us a sense of connection and combat things like loneliness.\"\n\nA hobby from coast to coast\n\nAcross South Australia, on the Eyre Peninsula, another group of gamers gathers.\n\nIn Port Lincoln, Steven Johnson from the West Coast Youth and Community Support group runs games sessions every Thursday and it expands to more than board games.\n\nSteven Johnson started a Port Lincoln board-games group to help foster connections in the regions. (ABC Eyre Peninsula: Duncan Bailey)\n\n\"We noticed that a lot of the clients I was working with, a lot of the people that I met, were gamers of some degree and shared a love for gaming,\" Mr Johnson said.\n\n\"Through my program we try and link people who are a bit isolated in the community back into their community in all the wonderful areas that it has.\"\n\nWest Coast Youth volunteer Brett Pullham observes the virtual Dungeons and Dragons board. (ABC Eyre Peninsula: Duncan Bailey)\n\nHe said the community was created for people who felt isolated and wanted to make friends who shared a similar interest.\n\n\"It just lets everybody come together in the same physical space and actually create some friendships.\"\n\nJack Treagus, Mr Pulham, Ryan Walker and Mr Johnson duke it out in a Dungeons and Dragons game. (ABC Eyre Peninsula: Duncan Bailey)\n\nSomething for everyone\n\nBack in Wallaroo, Mr Atkinson reflected on the 13 years and the hundreds of people who have come along to Copper Coast Tabletop to play.\n\n\"This community is something special,\" Mr Atkinson said.\n\n\"For many of our members, especially those with social needs, the structured nature of games provides a framework for interacting, helping them build confidence and a sense of fairness.\n\n\"We've seen many people grow — not just in gaming skill, but in confidence and connection — and that's what keeps us going.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-06-16/genetically-modified-purple-tomato-australia-application/105414258",
        "title": "Antioxidant-rich purple tomatoes may soon be on Australian shelves",
        "publish_date": "Mon, 16 Jun 2025 00:37:21 +0000",
        "category": "finance",
        "authors": [],
        "text": "A genetically modified tomato the colour of an eggplant could be available on supermarket shelves as early as next year if regulators approved a bid to grow it in Australia.\n\nThe purple tomato, as it is named, has been genetically modified to include genes from the edible snapdragon flower.\n\nThe tomato has had two snapdragon genes added that allow it to make a class of antioxidants called anthocyanins. (Supplied: Norfolk Healthy Produce)\n\nNathan Pumplin is the chief executive of Norfolk Healthy Produce, a United States-based company marketing the plant.\n\nHe said the tomato had two snapdragon genes added, allowing it to make a class of antioxidants called anthocyanins, whose nutrients created the purple colour and were also associated with health benefits.\n\n\"They're what make blueberries coloured, blackberries, eggplant skins, purple potatoes,\" Dr Pumplin said.\n\n\" The purple tomato is just a tomato — what's special about it is it has the antioxidants that blueberries have. \"\n\nLong time coming\n\nThe plant was developed by Cathie Martin at the John Innes Centre, an independent laboratory in the United Kingdom.\n\nDr Pumplin says the purple colour is a by-product of the increased antioxidants in the tomato. (Supplied: Norfolk Healthy Produce)\n\nShe co-founded Norfolk Plant Sciences, a company aimed at transferring the fruits of the research to people's plates.\n\nDr Pumplin said Professor Martin was a global leader in the study of how fruit and vegetables delivered nutrients to consumers.\n\nProfessor Martin previously received the Rank Prize for Nutrition – one of the field's most prestigious awards – for her work.\n\n\"She's also a type 1 diabetic, so her whole scientific career she's focused on ways to make the foods that we eat healthier and more nutritious,\" Dr Pumplin said.\n\nAfter 18 years of development the product was approved to be grown and sold in the US and has been on the market there for two years.\n\nDr Pumplin said the company last year sold more than 100,000 punnets of the fruit at grocery stores and 13,000 packets of seeds to home gardeners.\n\n\"We have a pretty decent cult following,\" he said.\n\nThe genetically modified tomato has been on sale in the US for two years. (Supplied: Norfolk Healthy Produce)\n\nGoing global\n\nThe team is now taking the plant worldwide and is focusing on the Australian and Canadian markets.\n\nAll Aussie Farmers, a Victoria-based fresh produce marketing company, has entered an exclusive commercial partnership to bring the fruit here.\n\nManaging director Travis Murphy said there had already been plenty of interest.\n\n\"Food service guys are wanting to know when they can get it for their chefs and our retail guys are asking when they can have it to put into their retail shops,\" he said.\n\nThe tomatoes get their purple colour from snapdragon genes. (Supplied: Norfolk Healthy Produce)\n\nHistorically, Australian consumers have been wary of the use of GM opinions\n\nAustralia has strict regulations on growing genetically modified crops and to date only canola, cotton, safflower, bananas and flowers have been approved.\n\nThe Office of the Gene Technology Regulator (OGTR) is the government oversight body and crops will only be approved if they are proven to be safe for people and the environment.\n\nA spokesperson said a risk assessment of the purple tomato would be undertaken, which would lead to the development of a risk management plan to allow the plant to be grown and sold domestically.\n\nPublic consultation will begin in September.\n\n\"Written comments will be sought and the consultation will be open for at least 30 days,\" the OTGR spokesperson said.\n\n\"Anyone can register to receive notifications on the OGTR website.\"\n\nTravis Murphy says the plan is to roll out the new product to customers in Melbourne first. (Supplied: All Aussie Farmers)\n\nAll genetically modified foods for sale and consumption must also undergo a safety assessment by Food Standards Australia New Zealand.\n\nMr Murphy said the purple tomato would first be grown in greenhouses in south-east Queensland, should approval be granted by early next year.\n\n\"We'll roll it out to our customer base in Melbourne firstly, for the fruit shops and food service,\" he said.\n\nPurple and orange bananas\n\nIf approved the tomatoes will be grown in greenhouses in Australia. (Supplied: Norfolk Healthy Produce)\n\nDistinguished Professor James Dale is familiar with the approvals process for genetically modified fruit.\n\nHe leads the Queensland University of Technology's (QUT) Banana Biotechnology Research Program and has been able to get its genetically modified cavendish bananas approved.\n\nThe banana is resistant to Panama Disease Tropical Race 4, which has threatened commercial production in northern Australia.\n\nProfessor Dale said getting federal approval was difficult and required proof the fruit was safe for human consumption and the environment.\n\n\"The application went to hundreds of pages of information because we had to document how we did all of those measurements,\" he said.\n\nThe process took about 12 months, but Professor Dale said field trials in the Northern Territory had been completed.\n\nJames Dale has been working on developing a genetically modified banana for more than 20 years. (Supplied: Queensland University of Technology)\n\nMore trials will be conducted in north and south-east Queensland over the next three to four months before the crop will be grown commercially.\n\n\"We're just going to make sure that the banana performs as well over in Queensland, because that's where the vast majority of bananas are grown in Australia,\" Professor Dale said.\n\nThe disease-resistant variety is a standard yellow colour, but Professor Dale said the team was working to make bananas healthier and was developing an orange banana high in provitamin A and another high in iron.\n\nHe said a purple banana with high levels of anthocyanins was also possible.\n\n\"The purple patches that you see on banana leaves are actually anthocyanins,\" Professor Dale said.\n\n\" Moving that from just in the leaves into the fruit would be a real advantage. \"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-06-16/erin-patterson-mushroom-murder-trial-live-blog-june-16/105420136",
        "title": "Live: Prosecution details four alleged deceptions at heart of Erin Patterson case",
        "publish_date": "Mon, 16 Jun 2025 00:25:34 +0000",
        "category": "finance",
        "authors": [
            "Joseph Dunstan",
            "Judd Boaz",
            "Melissa Brown"
        ],
        "text": "Dr Rogers then moves to the evidence given by surviving lunch guest Ian Wilkinson, who she says was a \"compelling witness\".\n\nIan described the guests eating off grey plates, while their host ate from an orange-coloured plate.\n\n\"You will have no trouble in being satisfied that he is a reliable witness and you can confidently accept what he told you about the details of the lunch, including the four grey plates and the fifth, odd plate,\" Dr Rogers says.\n\nShe tells the jury Ian was not the only one to notice the plate, recapping that his wife, Heather Wilkinson, told people after the lunch that she had noticed the different-coloured plates.\n\n\"Heather even mentioned it a second time during the car trip from Korumburra Hospital to Leongatha [as per Simon Patterson's evidence],\" Dr Rogers says.\n\nShe tells the jury they should \"reject\" the suggestion from the accused that there were no grey plates.\n\n\"You should also reject any suggestion that the accused just happened to eat from the different plate to her guests,\" Dr Rogers says. \"She allocated herself the different plate by picking it up and carrying it to her place at the table.\"\n\nShe recaps evidence from Erin's son, who recalled \"white dinner plates\" after the lunch.\n\nThe prosecution argues Erin Patterson served herself on a different coloured plate. (ABC News)\n\nShe notes that while Ian wasn't sure about dessert plates, the evidence of Erin's son should not dissuade the jury from accepting Ian's account.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-06-16/bruce-the-bat-dog-is-a-good-boy-at-mlb-match/105420616",
        "title": "Bruce the bat dog steals the show at MLB match",
        "publish_date": "Sun, 15 Jun 2025 23:28:46 +0000",
        "category": "sports",
        "authors": [],
        "text": "The dog days of summer arrived on the weekend at Nationals Park in Washington, DC.\n\nBruce, a 21-month-old golden retriever, fetched a bat during a ceremony before the Washington Nationals's 4-3 Major League Baseball loss to the Miami Marlins as part of a Pups in the Park promotion.\n\nHe retrieved bats the last two seasons with the Rochester Red Wings, Washington's affiliate in the lower leagues.\n\nBruce, wearing a bandana with an \"MLB debut\" patch he received when he arrived at the stadium, was presented a commemorative bat.\n\nHe then took a circuitous route from the dugout toward first base after Nationals reliever Zach Brzykcy dropped the bat in foul territory, before the bat dog collected his quarry to the delight of a crowd wowed by his work and enthusiasm.\n\n\"Look at this dog and try not to smile,\" said Bruce's owner Josh Snyder.\n\n\"He's great. He's goofy. I think he's the perfect candidate for Rochester, the Red Wings and now the Nationals.\"\n\nSnyder, who wore a number 25 Nationals jersey with \"Bruce\" on the nameplate, said he drove through the night with Bruce and arrived in Washington at about 3am on game day.\n\nBruce sits in the dugout before the MLB game gets underway. (Getty Images: Jess Rapfogel)\n\nBut it was anything but a rough morning and early afternoon for Bruce, who casually lapped up attention as he walked through the tunnel in the stadium.\n\nBruce spent about 50 minutes on the field before the ceremony, where he was praised by wellwishers. He also did a couple of practice bat retrievals with Mr Snyder's assistance before Nationals catcher Riley Adams stopped to pat him on his way out for pre-game work.\n\nHe did not work during the actual game, however, and will return to lower league duties afterward.\n\nBruce takes a spell during his hectic schedule at the game. (Getty Images: Jess Rapfogel)\n\nBruce is Mr Snyder's second dog work to with the Red Wings, following the late Milo, and both participated in campaigns to raise money for Rochester's Veterans Outreach Center and Honor Flight Rochester.\n\nThis week — which included an announcement from the Nationals that Bruce had earned a promotion — generated plenty of buzz even before his debut.\n\n\"Social media, everything like that seems like it's seriously blown up, and we love it,\" Mr Snyder said.\n\n\"Really good publicity with our goal and our mission of bringing people together. It shows it's just doing that.\"\n\nThe ABC of SPORT Sports content to make you think... or allow you not to. A newsletter delivered each Saturday.\n\nAP",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-06-16/maugean-skate-ogoh-ogoh-burns-dark-mofo/105395914",
        "title": "Dark Mofo comes to a fiery end as Maugean skate Ogoh-Ogoh burns",
        "publish_date": "Sun, 15 Jun 2025 23:10:06 +0000",
        "category": "entertainment",
        "authors": [],
        "text": "Hobart's midwinter arts festival, Dark Mofo, wrapped up on Sunday night with a community parade and the traditional burning of the Ogoh-Ogoh, an effigy this year in the shape of a giant Maugean skate.\n\nThe 10-day-long, boundary-pushing arts program that bathes the city in red and spills onto the streets with music and food offered some paid events but plenty free to the public.\n\nEach year, the festival takes over the city during the darkest time of the year — the winter solstice — with pockets of events held across Hobart's laneways, industrial spaces, little-known boltholes and waterfront.\n\nThe Maugean skate Ogoh-Ogoh hung suspended from the Goods Shed watching over crowds committing their fears to paper. (ABC News: Susan Oong)\n\nAfter a hiatus in 2024, as new artistic director Chris Twite settled in, the festival has returned with a program with enough shock value to keep up the intrigue.\n\nThis year — the festival's 11th — offered up coffin rides, an actual car crash, preserved sheep heads in jars, and staples Night Mass, and fire-pit filled Winter Feast and Dark Park.\n\nThe popular winter solstice nude swim is still to come, and will take place on Saturday, June 21.\n\nThe burning\n\nThe procession moved along the city's waterfront to Dark Park, carrying the Ogoh-Ogoh. (ABC News: Scout Wallen)\n\nThousands joined the procession of the Maugean skate effigy from parliament lawns to Macquarie Point for the Ogoh-Ogoh burning, marking the festival's finale.\n\nThe Maugean skate is an endangered species found only in world-heritage-listed Macquarie Harbour, on Tasmania's west coast. It is at risk of extinction.\n\nPlane-loads of interstate visitors travelled to Hobart to take part in the festival. (ABC News: Scout Wallen)\n\nSpectators packed into Dark Park to watch a timber pyre, with the skate craned atop, burst into flames.\n\nFireworks erupted from behind and within, as the timber structure slowly burned then eventually toppled to the ground.\n\nThe giant skate effigy was craned up to the top of a timber pyre. (ABC News: Scout Wallen)\n\nA flame was carried up a ladder by a fearless helper. (ABC News: Scout Wallen)\n\nThe Ogoh-Ogoh is based on a Balinese tradition of creating a paper-mache statue embodying chaos and disorder that is then burnt to exorcise negative energy.\n\nThroughout the festival, tens of thousands of peoples had committed their fears on pieces of paper and fed them into Maugean skate egg casings that were later burned with the skate.\n\nMr Twite said each year at the festival a Tasmanian animal under threat or endangered is chosen as the effigy.\n\nHe said the festival creatives work with a team of Balinese artists to create the sculpture and manage \"the receipt and holding of those fears\".\n\n\"It's a great spiritual weight on them to hold all of those fears from those tens of thousands of people, and then to see that those fears destroyed … it's a beautiful part of the festival,\" he said.\n\nChris Twite, who was announced as Dark Mofo's new artistic director in 2023, following the departure of inaugural director Leigh Carmichael. (Supplied)\n\nSkate the embodiment of biodiversity crisis\n\nLeonardo Guida, a conservation leader at the Australian Marine Conservation Society, said there were as few as 4,100 Maugean skates left in Macquarie Harbour, which is also a site for controversial salmon farming.\n\n\"It's quite ironic that by we're burning off our fears and our anxieties, and the fear is quite genuinely that this animal could go extinct in less than 10 years, and this extinction is a global extinction,\" Dr Guida said.\n\nMacquarie Harbour is the only known home of the Maugean skate. (ABC News: Maren Preuss)\n\nDr Guida said the skate had become representative of Australia's biodiversity crisis.\n\nSalmon farms posed an extinction threat – but have they changed? Photo shows A juvenile skate on the sea floor. Tasmania's Maugean skate, a prehistoric ray known to exist only in one harbour on the state's west coast, is at risk of extinction as pollution levels from salmon farming increase, and environment watchers want action.\n\nEarlier this year, federal Labor rushed legislation through the lower house with the aim of guaranteeing salmon farming could continue in the harbour.\n\n\"I really hope that the burning of the Ogoh-Ogoh really does ignite action to save the animal,\" Dr Guida said.\n\nThe federal government has committed tens of millions of dollars towards improving the oxygenation of water in the harbour to \"help offset the affects of human activities\".\n\nWhile Dark Mofo festivities has wrapped up, the event officially comes to a close next week after the Nude Solstice Swim at Long Beach on June 21.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-06-16/fifa-club-world-cup-auckland-city-lose-to-bayern-munich/105420516",
        "title": "Kiwi amateurs face brutal Club World Cup lesson against German giants",
        "publish_date": "Sun, 15 Jun 2025 22:59:27 +0000",
        "category": "sports",
        "authors": [],
        "text": "Bayern Munich romped to a 10-0 victory over Auckland City — a team made up of part-time players — in its Club World Cup opener.\n\nJamal Musiala had a hat trick in a 17-minute span of the second half in front of a crowd that unfurled a banner saying \"Smash FIFA!\" while accusing the governing body of mismanagement.\n\nThomas Müller, Kingsley Coman and Michael Olise scored two goals each for the Bundesliga champions, who went ahead on Coman's goal six minutes in. Bayern had a 17-1 advantage in shots on target.\n\nMusiala, a 22-year-old midfielder, replaced Harry Kane in the 61st minute, making his first appearance since April 4 after recovering from a hamstring injury. He scored in the 67th minute, converted a penalty kick in the 73rd and scored again in the 84th.\n\nThe Kiwi amateurs taking on football royalty Photo shows Two football teams, one in white and oen in blue, walk out on a suburban football ground. Conor Tracey works at a veterinary pharmaceutical warehouse and Angus Kilkolly is the regional manager of a power tool company. Both are preparing to play in the richest club football tournament of all time.\n\nAuckland City — not to be confused with Auckland FC in the A-League — were the club champions in the often-overlooked confederation of Oceania, and are the only non-professional team at the tournament.\n\nBefore a crowd of 21,152, fans displayed a red and white banner referring to the 2015 raid by US law enforcement at a Zurich hotel that led to the arrest of many soccer officials: \"10 Years Baur Au Lac — World Football Is More Poorly Governed than Before! Smash FIFA!\"\n\nMeanwhile, Fabián Ruiz and Vitinha scored in the first half, and Champions League winners Paris Saint-Germain opened their Club World Cup play with a 4-0 victory over Atlético Madrid.\n\nPSG largely dominated Atlético at the Rose Bowl in its first match since trouncing Inter Milan 5-0 to win its first Champions League title on May 31.\n\nSenny Mayulu and Lee Kang-in scored against 10-man Atlético in the second half of the European powers' meeting in front of 80,619 fans at the site of the 1994 World Cup final for one of the highest-profile matches in the group stage of the first 32-team edition of the Club World Cup.\n\nEarlier, Lionel Messi was denied a sensational late winner as Inter Miami had to settle for a 0-0 draw against Egypt's Al Ahly in the opening game of the tournament.\n\nArgentina's eight-time Ballon d'Or winner looked set to provide a stunning finish in front of a crowd of more than 60,000, whipping a curling long shot towards the top corner in the sixth minute of added time.\n\nBut he was denied his moment of glory as Al Ahly goalkeeper Mohamed Elshenawy pushed the ball onto the crossbar. Messi also shaved the post with a free kick earlier in the second half.\n\nMiami had its own good fortune, surviving a first-half onslaught by 12-time African champion Al Ahly, with goalkeeper Oscar Ustari saving a penalty from Trezeguet just before the break.\n\nThe ABC of SPORT Sports content to make you think... or allow you not to. A newsletter delivered each Saturday.\n\nAP",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-06-16/gp-margaret-niemann-awarded-oam-in-king-s-birthday-honours/105417052",
        "title": "Trailblazing GP brought mental healthcare to communities that had none",
        "publish_date": "Sun, 15 Jun 2025 22:55:30 +0000",
        "category": "finance",
        "authors": [],
        "text": "Margaret Niemann laughs off a question about her \"legacy\" in regional healthcare, but her impact is undeniable.\n\nThe retired general practitioner, whose career spanned four decades, was recently awarded an OAM in the King's Birthday honours for her services to medicine as a GP.\n\nDr Niemann's list of achievements is extensive, and includes long stints in remote Aboriginal communities, as well as providing groundbreaking access to mental health support in regional areas, long before such things became commonplace.\n\nEarly antenatal education\n\nGrowing up in a suburban household in the Melbourne region, with no relatives ever working in the health or care sectors, Dr Niemann's choice to go into medicine was unexpected.\n\n\"It just interested me,\" she said.\n\n\"I was curious about how people worked and what made them tick, and I thought medicine sounded like a way I could explore that.\n\nDr Niemann helped bring mental healthcare to Bairnsdale in East Gippsland. (Supplied: Margaret Niemann)\n\n\" That curiosity … maintained me through my [40-year career]. I just was always interested in the person in front of me. \"\n\nDr Neimann married a fellow med-school student, Michael Dawkins, a \"country boy\" who wanted to go into rural general practice.\n\nThe idea intrigued young Margaret, and they made their home in the East Gippsland town of Bairnsdale in 1984, settling down with their one-month-old baby.\n\nDr Niemann worked there as a GP-obstetrician while having her own children, and quickly noticed a gap in services for new mothers.\n\nPANDA — Perinatal Anxiety & Depression Australia — had started up in Melbourne a few years earlier, but Dr Niemann said \"there wasn't anything in the country at the time\".\n\nShe and some others in the community joined forces to start offering antenatal classes in the area.\n\nThe take-up was high, with strong interest from young mums and it helped solidify Dr Niemann's own interest in the area of mental health.\n\nA remote GP team\n\nAfter 12 years in Bairnsdale and three children, Dr Niemann and her husband needed a change.\n\nIt came in the form of a federal government push to have GPs living in remote Northern Territory communities, which led Dr Niemann and her husband to Maningrida, an Arnhem Land town of about 2,500 people, 500 kilometres east of Darwin.\n\nDr Niemann, left, said she enjoyed working in remote Aboriginal communities. (Supplied: Margaret Niemann)\n\nShe admitted it was nerve-racking, but with her husband, who she says is an \"excellent GP\", they \"made a good team\", providing much-needed healthcare and developing strong bonds with the Aboriginal community.\n\nDr Neimann said she and her husband would often go out hunting, fishing and foraging with the locals, giving them a fascinating insight into the culture.\n\n\"We just clicked — it worked well,\" Dr Niemann said.\n\nMental health care before its time\n\nDr Niemann said while she loved working in Aboriginal health, she was most proud of her achievements in mental health.\n\nWhen she began in the field, mental health care, as we now know it, was in its infancy, and psychological services in regional areas were pretty much non-existent.\n\nDr Niemann said her earliest work was with people with eating disorders, and it grew from there.\n\n\"There were no psychologists … so things like anxiety and depression, and even obsessive-compulsive disorder and PTSD were very hard to get any sort of support [for],\" she said.\n\nWhile in Bairnsdale, she began diving into the psychological effects of trauma, which dovetailed with her work in Aboriginal communities, where she quickly recognised the impact of intergenerational trauma.\n\n\"When I started, the idea [of] the psychological effects of trauma and PTSD was just not on the radar,\" Dr Neimann said.\n\n\"People didn't think about it [or] acknowledge it.\n\n\"[But now] it is recognised that it does cause … ongoing problems. We've progressed enormously from that time.\"\n\n'Life's good'\n\nDr Niemann is quick to point out that throughout her career, especially when working remotely, she has been part of a good team.\n\nShe retired during the COVID pandemic, and is loathe to use the word \"legacy\" when discussing the achievements and career that earned her a Medal of the Order of Australia (OAM) in the recent King's Birthday honours.\n\nDr Neimann and her husband still live in Bairnsdale, where she enjoys gardening, baking, crafting and catching up with friends and family.\n\nAfter a long career, \"life's good\", she said.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-06-16/shearers-shindig-thargomindah-outback-community-flood-recovery/105419168",
        "title": "Quick shears and cheers a much-needed escape for flood-hit town",
        "publish_date": "Sun, 15 Jun 2025 22:29:28 +0000",
        "category": "finance",
        "authors": [],
        "text": "Wool goes flying on stage at the Thargomindah Shearers Shindig as two people race to see who can shear a sheep the fastest.\n\nThe atmosphere is electric, but behind the thrill of the challenge there's another factor drawing the outback Queensland community together.\n\nOrganisers say the shindig brought the community together and attracted much-needed tourists. (ABC Western Qld: Grace Nakamura)\n\nTwo months ago the Thargomindah township, nearly 1,000 kilometres west of Brisbane, was almost entirely inundated by a record-breaking flood.\n\nReminders of the disaster are everywhere — in the blue flood markers pasted around the arena, the drone photos scattered near the bar, and the stories exchanged over a beer.\n\nThe record-breaking flooding caused many residents to evacuate. (Supplied: Daniel Roy)\n\nTo resident Liz Riley, the weekend of festivities was just as important to the town's recovery as clearing away the debris.\n\n\"It gets people away from thinking of the disaster, to get out and just enjoy a weekend,\" she said.\n\n\"It breaks that continuous monotony of cleaning mud, cleaning walls, looking at our insurances … it just gives you that break and that's what people need.\"\n\nLiz Riley and her family are still feeling the impact of the flood. (ABC Western Qld: Hannah Walsh)\n\nShearing and sharing stories\n\nAbout 80 shearers travelled from across Australia and New Zealand to Thargomindah to compete in the quick shears with the lure of a $41,000 prize pool, one of the largest in the country for shearing.\n\nThe event also hosted dachshund races, pig races, a colour run, and a flood debrief panel.\n\nThe Shearers Shindig attracts competitors from across Australia and overseas. (ABC Western Qld: Grace Nakamura)\n\nBullo Shire acting chief executive Tamie Warner said the flood panel was the first time many of the residents involved in the natural disaster had spoken about their experiences.\n\n\"We worked together, did what we had to do and made it happen,\" she said.\n\n\" But a few got emotional and that shows the effect it has had on a lot of people. \"\n\nTamie Warner spoke on the flood recovery panel. (ABC Western Qld: Hannah Walsh)\n\nAs mayor, John \"Tractor\" Ferguson handed out the cash prize for each category at the end of the night — several winners shook their heads and insisted the money be returned to the community recovery fund.\n\nEach time, a cheer went up through the crowd.\n\nThe fastest time of the night was 25.52 seconds, taken out by New Zealander Hemi Power.\n\nIn the women's event, Marites Woods was the quickest on the clippers, shearing her sheep in just 33.22 seconds.\n\nThe fastest time of the night was 25.52 seconds. (ABC Western Qld: Hannah Walsh)\n\nFlood impacts region's tourism\n\nThough many residents are still living in caravans, the sight of more caravans rolling into town with tourists is a welcome one.\n\nBulloo Shire Council tourism coordinator Danielle Tuit said the visitors brought a much-needed boost to local businesses.\n\n\"Our tourism industry would normally start on April 1, but that was the night the flood came through,\" she said.\n\n\" It's the ultimate time to visit and it's so very important to these outback communities. \"\n\nThere are flood markers all around Thargomindah showing how high the water came. (ABC Western Qld: Grace Nakamura)\n\nWhile the number of shindig attendees was down compared to previous years, those who came brought open wallets.\n\nBruce and Noni Kerr were on a road trip to Sydney and stopped in Thargomindah when they heard about the event.\n\n\"We heard it on the news and thought we'd come support them,\" Mr Kerr said.\n\nNoni and Bruce Kerr stopped in Thargomindah on their road trip to Sydney. (ABC Western Qld: Grace Nakamura)\n\nShearer Atareta Tekanawa-Semenoff was one of many New Zealand competitors who travelled for the quick shears competition.\n\n\"I'm here because I love supporting local outback speed shears and I saw what happened with the flooding,\" she said.\n\n\"Big ups to the community, what a way to come back.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-06-16/hundreds-of-bus-drivers-on-strike-in-victoria/105420180",
        "title": "Hundreds of bus drivers walk off job in Victoria",
        "publish_date": "Sun, 15 Jun 2025 22:00:32 +0000",
        "category": "finance",
        "authors": [],
        "text": "Bus drivers have gone on strike in Victoria for the second time as part of an enterprise bargaining dispute.\n\nAbout 600 drivers for public transport operator CDC Victoria are in the midst of a 24-hour strike.\n\nServices affected include CDC routes in Wyndham Vale and Sunshine in Melbourne's west, Tullamarine in Melbourne's north, and Oakleigh in the city's south-east, as well in the regional cities of Geelong, Ballarat and Mildura.\n\nLate last month, 1,300 drivers from CDC and operator Dysons took part in what the Transport Workers' Union (TWU) said was the largest bus strike in Victoria's history, shutting down one-third of the state's bus routes and charter services.\n\nMonday's industrial action is the second strike in a matter of weeks. (Supplied: CDC Victoria)\n\nThe union said Dysons had since progressed its negotiations, but matters remained unresolved with CDC, resulting in a strike that began at 3am today and will last until tomorrow morning.\n\n\"Bus drivers, like everybody in Victoria at the moment, are struggling under the cost-of-living crisis,\" TWU organiser Sam Lynch told ABC Radio Melbourne.\n\n\"Their wages have not gone up with inflation over the last five to 10 years.\n\n\"The offer that's currently on the table is just absolutely nowhere near resolving that.\"\n\nMr Lynch said the drivers did not take strike action lightly.\n\n\"Bus drivers don't want to be impacting the community like this,\" he said.\n\n\"They like what they do, they like driving buses and getting people where they need to go, but unfortunately we are not getting the offer that we need to get from CDC in order to resolve this.\"\n\nSome of the striking drivers attended a protest outside the office of CDC Victoria on Monday. (ABC News: Costa Haritos)\n\nMost of the commuters the ABC spoke to at a bus stop outside Sunshine Railway Station were caught unaware, but all expressed support for the drivers.\n\n\"They should get more money [because] things are going up,\" one man said.\n\nAnother man said he could no longer get where he wanted but he said he understood why the drivers were taking action.\n\n\"They need to be looked after … so good on them,\" one man said.\n\nA health worker said she would need to pay for an Uber to get to her job.\n\n“It’s their way to try to get a wage lift which I understand but it would be good if they could have earlier notice so the public can try to plan their trip to work,\" she said.\n\nCDC Victoria said it remained committed to continuing enterprise bargaining discussions and working collaboratively with the TWU to reach a fair and reasonable resolution.\n\n\"Our main priority is to minimise disruptions to our customers and the communities that we serve,\" it said in a statement.\n\nThe TWU said the drivers would take further strike action if the negotiations did not progress.\n\nTram delays in Melbourne's inner east\n\nMeanwhile, a tram derailment has caused early-morning disruptions in Kew, in Melbourne's east.\n\nA tram came off the rails on High Street at the Kew Junction at about 5am, cutting services along routes 48 and 109.\n\nTram services were disrupted after a vehicle came off the rails in Kew. (ABC News: Kate Meade)\n\nThe Department of Transport said it was caused by a fault with the rail.\n\nThere were no passengers on board at the time.\n\nThe driver was not hurt.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-06-16/asx-markets-business-news-live-updates/105419516",
        "title": "Live: Santos shares jump 12pc on $30 billion takeover bid",
        "publish_date": "Sun, 15 Jun 2025 21:43:32 +0000",
        "category": "finance",
        "authors": [
            "Stephen Letts",
            "Rebecca Brice",
            "Stephanie Chalmers",
            "Daniel Ziffer"
        ],
        "text": "The economics of the oil price spike are relatively simple.\n\nIran currently produces 3.3 million barrels per day (mbd) of oil. Around 2 mpd of that is exported.\n\nThat's now under threat.\n\nGlobal spare capacity is put as low as 3 mbd, with Saudi Arabia and the UAE the only major producers realistically capable of ramping up production quickly.\n\nSo, the market is tight and would struggle to deal with any other disruptions.\n\nAs Reuters's energy writers Ahmad Ghaddar and Seher Dareen noted over the weekend, Iran has in the past threatened to disrupt shipping through the Strait of Hormuz if it is attacked.\n\nThe strait is the exit route from the Middle East Gulf for about 30% of the world's oil supply (around 21 mbd) and 20% of global LNG supplies.\n\nHistorically, Iran has not closed the strait during previous conflicts as its economy is heavily reliant on free passage through the area.\n\nHowever, that stance may have changed.\n\n\"Iran has also previously stated that it would attack other oil suppliers that filled any gap in supplies left due to sanctions or attacks on Iran,\" the Reuters analysts said.\n\nThe head of geopolitical analysis at Rystad and a former OPEC official, Jorge Leon, pointed out Friday's spike would only be the start of things if Iran followed through on its threats to shipping through the strait.\n\n\"If Iran responds by disrupting oil flows through the Strait of Hormuz, targeting regional oil infrastructure, or striking US military assets, the market reaction could be much more severe, potentially pushing prices up by $20 per barrel or more.\"\n\nThe OPEC+ cartel, which includes the likes of Russia and Venezuela as well as most middle east producers, has recently been trying to boost production, but that has stretched the capacity of some smaller producers.\n\nInvestment, such as in exploration and plant expansion, in many producers, excluding Saudia Arabia, has been declining for years.\n\n\"Following the July hike, most OPEC members, excluding Saudi Arabia, appear to be producing at or near maximum capacity,\" JP Morgan analysts wrote in a weekend note.\n\nReuters, quoting another source, said: \"Outside of Saudi Arabia and the UAE, spare capacity was negligible.\"\n\n\"Saudi are the only ones with real barrels, the rest is paper,\" the source told Reuters.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-06-16/federal-politics-live-blog-june-16/105420142",
        "title": "Live: Albanese to sharpen pitch for AUKUS in Trump meeting on G7 sidelines",
        "publish_date": "Sun, 15 Jun 2025 21:05:21 +0000",
        "category": "finance",
        "authors": [
            "Joshua Boscaini",
            "Courtney Gould",
            "Stephanie Dalzell"
        ],
        "text": "Specialists charging too much should be named, shamed and stripped of federal funding according to a new report, which has found more than 20 per cent of Australians who visited a specialist were slapped with an exorbitant fee.\n\nThe Grattan Institute report paints a bleak picture of specialist care in Australia, where people suffer unnecessary illness and pain as they queue for care or struggle to pay for it.\n\nIt found more than one in five Australians who saw a specialist in 2023 were charged a fee deemed \"extreme\", defined as costs that are on average more than three times the Medicare schedule fee.\n\nThe Grattan Institute's health program director Peter Breadon said specialist fees are a problem that are only getting worse, saying the whole system is \"pretty much broken, it's been left on autopilot.\"\n\nOutpatient clinics run by public hospitals provide just one-third of specialist care, meaning most Australians are treated by private specialists who are free to charge whatever they like in an unregulated system.\n\nThe report calls on the government to publicly name specialists who charge excessive fees, and even argues their Medicare rebates should be withdrawn.\n\nBut Health Minister Mark Butler has called on the private health sector to do more to protect patients from exorbitant bills.\n\nRead the full story at the link below.",
        "source": "ABC"
    },
    {
        "url": "https://www.smh.com.au/politics/federal/the-pm-just-got-a-pay-rise-here-s-how-his-salary-compares-to-trump-and-other-leaders-20250613-p5m75u.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "The PM just got a pay rise. Here’s how his salary compares to Trump and other leaders",
        "publish_date": "Mon, 16 Jun 2025 11:59:25 +1000",
        "category": "finance",
        "authors": [
            "Millie Muroi"
        ],
        "text": "Prime Minister Anthony Albanese will be paid more than US President Donald Trump from next month after the Remuneration Tribunal boosted federal politicians’ pay by 2.4 per cent. But how does his salary compare to that of other countries’ leaders?\n\nWhile the US president’s salary has been steady since 2001, the Remuneration Tribunal determines the change in salaries of Australian ministers – including the prime minister – every year.\n\nPrime Minister Anthony Albanese will soon be paid more than Donald Trump. Credit: AP, Alex Ellinghausen\n\nThe latest decision, which takes effect on July 1, lifts Albanese’s salary from $607,500 to $622,071. That means he will now overtake Trump, who is paid $US400,000 ($617,000).\n\nAlbanese’s latest pay rise is lower than the 3.5 per cent increase granted by the Fair Work Commission for minimum wage earners earlier this month, which the tribunal considered alongside economic conditions and past and projected movements in private and public sector pay.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/business/markets/the-ticking-time-bomb-facing-the-global-economy-20250616-p5m7nh.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "The ticking time bomb facing the global economy",
        "publish_date": "Mon, 16 Jun 2025 11:58:51 +1000",
        "category": "finance",
        "authors": [
            "Stephen Bartholomeusz"
        ],
        "text": "This year, OPEC has been gradually bringing back some of the 6 million barrels a day of production it has held back over the past three years, but there is still a lot of spare capacity on the sidelines in a market that the International Agency says is already over-suppled, with the growth rate in supply about twice that of the growth in demand. Of far greater concern than Iran’s own production is that of the other Middle Eastern producers. Iran has the potential, if it chooses to, to close the Strait of Hormuz, the only marine entry point to the Persian Gulf and arguably the most important choke point in the global energy supply chain. Nearly a third of the world’s oil transits through the strait each day, and about 20 per cent of its LNG. If that trade were closed, or heavily disrupted, oil prices would soar, with estimates that they would reach somewhere between $US120 and $US150 a barrel. US President Donald Trump’s misguided trade wars have left the global economy vulnerable. Credit: Bloomberg Traders are clearly discounting that possibility, partly because it would deprive Iran itself of its major source of revenue and upset its major customers, but more particularly because it would almost certainly drag the US, whose Fifth Fleet is based in Bahrain, directly into the conflict.\n\nIran has, in the past, threatened to block the strait but, apart from laying some mines during the 1980s war with Iraq, hasn’t done so. Loading As long as Israel refrains from attacking its oil exports and the US remains only indirectly involved (by supporting Israel’s defence against Iran’s retaliatory strikes), the arguments for keeping the strait open would be stronger than the temptation to close it. If that were to change, it would be grim news for the rest of the world. Indeed, even the so-far relatively modest impact on oil prices isn’t helpful. Last week, before the conflict began, the World Bank cut its forecast for global growth this year from 2.8 per cent last year to 2.3 per cent. Other economic agencies and forecasters have similarly downgraded the outlook to levels that, apart from the pandemic, were last seen in the aftermath of the 2008–09 financial crisis.\n\nThat’s because Donald Trump’s tariffs are expected to severely depress global economic growth, and growth within the US in particular. The International Monetary Fund cut its forecast for US GDP growth by 90 basis points to a meagre 1.8 per cent earlier this year. The World Bank has US growth – 2.8 per cent last year – halving to 1.4 per cent. Trump’s trade wars have rendered what was reasonable global growth and a strong and out-performing US economy vulnerable to exogenous shocks. With Trump’s 10 per cent baseline tariffs on everyone already in place, the average US tariff has leapt from about 3 per cent to something in the high teens. The 90-day pause on his more draconian “reciprocal” tariffs will end on July 9, when many of America’s trading partners will face even higher rates. The tariffs will undermine US and global growth and push up US and global inflation rates.\n\nConventionally, because they would adversely impact global trade and the global economy, they would also reduce demand for oil. If Middle Eastern supply were disrupted, however, the oil price would spike and add to global inflation, increasing the threat of global stagflation, or the combination of lower growth and higher inflation. When the US released its latest inflation data for May last week, a contributing factor to the headline number of 2.3 per cent – the best result for more than four years – was that oil prices traded as low as $US60 a barrel last month. While the inflation data has yet to reflect the impact of the tariffs – US importers had front-loaded their orders to get in ahead of the tariffs and therefore their impact will be delayed and probably show up progressively in coming months – the surge in oil prices, thanks to the new outbreak of hostilities in the Middle East, will add to the US inflation rate.\n\nIt also introduces a new dimension of uncertainty for the US Federal Reserve Board, whose Open Market Committee meets this week. Loading There is no expectation that it will cut US rates at this meeting, but the prospect of a September cut – up for discussion before Israel’s attack – may have receded if oil prices remain at their current levels, or rise further. Other central banks will have to grapple with the same question mark over the trajectory of oil prices and their impacts on inflation. Trump’s trade wars have rendered what was reasonable global growth and a strong and outperforming US economy vulnerable to exogenous shocks. Israel, with its strikes on Iran’s nuclear capabilities and its attempt to destabilise the regime, has provided one that will already generate some wider economic stresses but has the potential to do considerably more damage if it doesn’t remain contained.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/rugby-union/star-power-missing-as-anzac-side-miss-out-on-world-s-highest-paid-player-20250616-p5m7om.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Star power missing as Anzac side miss out on world’s highest-paid player",
        "publish_date": "Mon, 16 Jun 2025 11:51:52 +1000",
        "category": "sports",
        "authors": [
            "Iain Payten",
            "Jonathan Drennan"
        ],
        "text": "The Australia and New Zealand Invitational side to face the British and Irish Lions seven days ahead of the first Test will lack serious star power with New Zealand five-eighth Richie Mo’unga to miss the game in Adelaide due to a broken hand.\n\nMounga’s agent Cameron McIntyre confirmed that the world’s highest-paid player has not recovered from the injury sustained playing for Japanese club Toshiba Brave Lupus and has withdrawn from talks with Rugby Australia about playing in the game.\n\nMo’unga, who is reportedly on a $2m deal, had previously spoken of his wish to play in the fixture after speaking to former New Zealand coach Ian Foster, who will be an assistant for the AUNZ side.\n\n“I miss the big Test match setting, the big arenas, this (AUNZ game) will be the closest I’ll get to it while I’m in Japan,” Mo’unga previously told rugbyjp.com.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/environment/climate-change/the-curious-case-of-the-ghost-ship-that-vanished-and-reappeared-20250610-p5m6cf.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "The curious case of the ghost ship that vanished, and reappeared",
        "publish_date": "Mon, 16 Jun 2025 11:46:30 +1000",
        "category": "finance",
        "authors": [
            "Bianca Hall"
        ],
        "text": "Days after the meeting, Nganhurra resurfaced – not physically, but in a public statement by Norwegian company BW Offshore, which announced it had secured an agreement to acquire the vessel. “Given the limited availability of suitable FPSOs for redeployment, securing this unit places BW Offshore in a strong, competitive position,” chief executive Marco Beenen said. While Nganhurra has been reborn, the question of what happens to offshore oil and gas infrastructure reaching the end of their lifespans is vexed. At an industry conference in Perth last week, delegates discussed the fate of another defunct floating production, storage and offloading facility: the decrepit and government-owned Northern Endeavour. Northern Endeavour, another former Woodside vessel, has for years been moored in the Timor Sea while it undergoes decommissioning.\n\nFour years after Woodside sold the vessel to Northern Oil and Gas Australia (NOGA) in 2015, Northern Endeavour was shut down amid safety warnings from the regulator, and NOGA collapsed just months later – forcing the government to step in. The Northern Endeavour, pictured in the Timor Sea in 2021. Credit: Boiling Cold Its decommissioning – funded by a levy on offshore oil and gas producers – demonstrates the risks of removing these giants from the ocean: in the worst-case scenario, 18,692 cubic metres of crude oil could have spilt into the Timor Sea. The Department of Industry, Science and Resources issued a tender to find a lead contractor for the next two stages of recycling the 43,000-tonne vessel. However, it was unable to find a tender that met the department’s requirements or represented value for money. A spokesman for Resources Minister Madeleine King said the procurement process was ongoing.\n\nAs dozens of oil and gas facilities reach the end of their lifespan, there are growing calls for an Australian decommissioning and recycling industry to capitalise on the opportunities presented by offshore infrastructure. In 2023, King reaffirmed her support for the jobs generated by decommissioning to stay in Australia. “As industry starts investing to decommission $60 billion in offshore infrastructure, we want as much of that investment to be spent backing Australian industry and Australian jobs.” Loading Australia’s offshore energy operator NOPSEMA said in an information paper in January that, “recent experience indicates that some titleholders do not develop appropriate or timely decommissioning plans, which has potential to increase risk to people and the environment”. Unions say offshore oil and gas workers are perfectly placed to safely and responsibly undertake this work. The Maritime Union of Australia and Australian Workers Union have jointly called on government to reinvest more than $1 billion in levies collected from oil and gas producers into a fledgling recycling industry to safely and responsibly remove offshore infrastructure.\n\n“Australia’s steel industry is ready and capable,” said Australian Workers Union national secretary Paul Farrow. “We have workers prepared to do this job safely and efficiently, and our mills stand ready to recycle high-quality ferrous metals. Sending these materials abroad is a significant missed opportunity.” Loading MUA National Secretary Paddy Crumlin said Australia’s offshore oil and gas infrastructure contains an estimated 3.7 million tonnes of high-quality ferrous metal, suitable for recycling into low-emissions steel. “Towing the Northern Endeavour to [a third country] for dismantling is not just an absurd outsourcing of jobs – it’s a 15,000-nautical-mile climate contradiction,” he said.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/pole-vault-superstar-breaks-world-record-again-20250616-p5m7pa.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Pole vault superstar breaks world record again",
        "publish_date": "Mon, 16 Jun 2025 11:42:29 +1000",
        "category": "sports",
        "authors": [],
        "text": "Pole vault superstar breaks world record again\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/nrl/it-s-a-dirty-job-but-whoever-does-it-best-can-decide-who-wins-origin-20250613-p5m75d.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "It’s a dirty job, but whoever does it best can decide who wins Origin",
        "publish_date": "Mon, 16 Jun 2025 11:40:00 +1000",
        "category": "sports",
        "authors": [
            "Robert Dillon"
        ],
        "text": "It’s a dirty job, but someone has to do it.\n\nImagine going to work every day and not knowing what time you will start, what tasks you will be assigned, how long they will take, and if indeed you will even be required. And then, when it comes time to knock off, your colleagues receive most of the credit for whatever you’ve delivered during that particular shift.\n\nWelcome to the world of Connor Watson and Kurt Mann, who earn a crust each week as the NRL’s most versatile handymen and will fill the same unglamorous but vital role in State of Origin II on Wednesday.\n\nWatson and Mann have become specialists in the No.14 jersey, which has evolved into the only bench number that effectively defines the player wearing it. Theoretically 14 should be no different to 15, 16 and 17, but we all know it is.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/politics/nsw/the-two-north-shore-councils-resisting-cookie-cutter-housing-20250612-p5m6xu.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "The two north shore councils resisting ‘cookie cutter’ housing",
        "publish_date": "Mon, 16 Jun 2025 11:30:00 +1000",
        "category": "finance",
        "authors": [
            "David Barwell"
        ],
        "text": "A major overhaul of the state’s planning laws aimed at speeding up the construction of Sydney’s “missing” housing stock has been met with resistance on Sydney’s north shore as two councils fear the “cookie cutter” reforms could lead to a spike in eyesore developments that erode the established character of the region’s tree-lined streets.\n\nMosman and Ku-ring-gai councils are leading the pushback against the NSW government’s proposed “pattern book” scheme, which aims to expedite the construction of low- and mid-rise housing builds in suburban areas.\n\nOne of the “pattern book” designs - for a mid-rise apartment block, - by Andrew Burges Architects. Credit: NSW government\n\nThe scheme would give developers a catalogue of pre-approved housing designs as a means of gaining access to fast-tracked planning pathways and quick building approval permits.\n\nTouting the program as “the future of housing in NSW”, the NSW government hopes the scheme will address the “missing middle” in Sydney’s housing stock by reopening the door to small- and medium-sized builds up to six storeys in suburban areas.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/cricket/twenty-nine-reasons-to-expect-a-different-sam-konstas-as-he-nears-a-test-recall-20250616-p5m7n4.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Twenty-nine reasons to expect a different Sam Konstas as he nears a Test recall",
        "publish_date": "Mon, 16 Jun 2025 11:30:00 +1000",
        "category": "sports",
        "authors": [
            "Daniel Brettig"
        ],
        "text": "London: As Australia’s players and staff took a moment to spend time with their families on the Lord’s outfield following the end of the World Test Championship final, Sam Konstas spent most of his time hanging out with their kids.\n\nIt was a moment that underlined how at 19, Konstas is a generation gap behind the rest of an ageing team, the oldest member of which - Usman Khawaja - is twice his age.\n\nBut it is by another number - 29 - that Konstas may be entitled to remind the world how assiduously he has worked since the end of the Australian season, to return to the kind of batting that got him into contention to play for the national team in the first place.\n\nAfter his high-profile flame out at the SCG against Scott Boland in a February Sheffield Shield match, and before his departure with the Australian Test squad for London and the Caribbean, Konstas had no fewer than 29 net sessions with his batting coach Tahmid Islam in Sydney.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/a-glimpse-into-jiho-hanbang-samgyetang-20250616-p5m7o6.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "A glimpse into Jiho Hanbang Samgyetang",
        "publish_date": "Mon, 16 Jun 2025 11:29:49 +1000",
        "category": "finance",
        "authors": [],
        "text": "A glimpse into Jiho Hanbang Samgyetang\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/property/news/local-upsizer-pays-3-93-million-for-luxury-concord-duplex-20250613-p5m7b6.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Local upsizer pays $3.93 million for luxury Concord duplex",
        "publish_date": "Mon, 16 Jun 2025 11:24:18 +1000",
        "category": "finance",
        "authors": [
            "Carmen Forward"
        ],
        "text": "An ultra-luxurious duplex home in Concord has sold for $3.93 million to a buyer upsizing from nearby Breakfast Point.\n\nThe stunning four-bedroom residence with car basement, wine cellar, gym and cinema room at 4 Tremere Street was on the left side of the duplex, as seen from the front gate.\n\nThere were three registered bidders and all three were active. The auction was held indoors before a crowd of 50, including many builders, around the fireplace.\n\nBidding opened at $3.7 million, below its $3.8 million guide. Fifty thousand dollar bids from all three parties were placed in rapid succession until it was called on the market at $3.9 million.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/property/news/boatie-drops-anchor-and-2-3-million-on-new-farm-top-floor-apartment-20250615-p5m7ks.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Boatie drops anchor – and $2.3 million – on New Farm top-floor apartment",
        "publish_date": "Mon, 16 Jun 2025 11:21:28 +1000",
        "category": "finance",
        "authors": [
            "Sarah Webb"
        ],
        "text": "A man who had spent the past two years sailing around Australia has dropped anchor in one of New Farm’s most tightly held riverfront enclaves – splashing $2.3 million on a top-floor apartment that boasts water views from almost every room.\n\nThe New Zealand-born buyer outbid three others to secure the keys to 42/341 Bowen Terrace – a three-bedroom, one-bathroom “blank canvas” with panoramic vistas of the Brisbane River and Story Bridge – paying $300,000 over the reserve.\n\nThe dated apartment sits within a tightly held complex where only a handful of homes have changed hands in recent years. This one last hit the market more than two decades ago.\n\nSix bidders registered for Saturday’s auction, four of whom raised a paddle. Bidding opened at $1.4 million and quickly jumped. A Far North Queensland buyer jumped in via phone, pushing the price to $2 million.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/lifestyle/health-and-wellness/is-there-really-such-a-thing-as-the-manopause-20250616-p5m7ni.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Is there really such a thing as the Manopause?",
        "publish_date": "Mon, 16 Jun 2025 11:20:29 +1000",
        "category": "lifestyle",
        "authors": [
            "The Economist"
        ],
        "text": "Hot flushes; insomnia; joint pains; loss of libido: for many women, the menopause is no fun. Why exactly women become infertile decades before they die is a much-debated mystery in evolutionary biology. Besides humans, the only other mammals whose females experience so early a menopause in the wild seem to be some species of whale.\n\nBut equal opportunity is the spirit of the age. These days health influencers, supplement companies and even some doctors talk about a male version of the menopause—variously called the “manopause”, “andropause”, or, for jargon-lovers, “ADAM,” which stands for “androgen deficiency in the ageing male”. Symptoms include a flagging libido, tiredness, shrinking muscles and growing body fat.\n\nSupplement companies, health influencers and some doctors are talking about the ‘manopause’, but is it real? Credit: Getty Images\n\nDo men really suffer from menopause, or something like it? On one level, obviously not. Menopause is defined by the end of a woman’s menstrual periods, and therefore the loss of her ability to reproduce, usually by her early 50s. Men, by contrast, can stay fertile well into old age. (For instance, Al Pacino, an American actor, fathered a child at 83.)\n\nIn menopause, a woman’s levels of the sex hormones oestrogen and progesterone fall sharply and suddenly. In most men levels of testosterone (the main male sex hormone) likewise start falling during middle age. But unlike in women there is no sudden drop. Levels decline gently, at a rate of around 1 per cent a year, and often stay within the normal range for a man’s entire life.",
        "source": "SMH"
    },
    {
        "url": "https://www.sbs.com.au/news/article/the-system-is-broken-millions-skip-care-as-soaring-specialist-fees-push-health-out-of-reach/ic4eh5njf",
        "title": "'The system is broken': Report recommends outing specialists with excessive fees",
        "publish_date": "Sun, 15 Jun 2025 21:13:53 +0000",
        "category": "finance",
        "authors": [],
        "text": "Key Points Nearly 1.9 million Australians are delaying or skipping critical care due to high specialist fees.\n\nSome specialists charge two to three times the Medicare rate, with annual costs topping $670 for some services.\n\nGrattan Institute urges reforms, including naming overcharging doctors and expanding access in underserved areas.\n\nAbout 1.9 million Australians are delaying or skipping critical medical care due to exorbitant fees for specialist doctors, a report by public policy think tank Grattan Institute has found.\n\n\n\n\n\nThe report recommended naming specialists who charge excessive fees and scrapping medicare subsidies for them.\n\n\n\n\n\nSome private specialist doctors charge patients two to three times more than the rate Medicare sets for those services, the report found.\n\n\n\n\n\nIt said patients of one specialist spent an average of $300 per year in 2023 — up 73 per cent since 2010.\n\n\n\n\n\nAverage out-of-pocket costs for extreme-fee-charging specialists in 2023 reached $671 for psychiatry services and more than $350 for endocrinology, cardiology, paediatrics, immunology and neurology services.\n\n\n\nThe high costs leave critical health care out of reach for millions, causing patients in poorer pockets of Australia to wait months or years for urgent appointments, and leading to missed diagnoses, avoidable pain and added pressure on hospitals.\n\n\n\n\n\nAbout four in 10 Australians visited a specialist in 2023/24.\n\n\n\n\n\nAbout two-thirds across all specialities are private appointments, with patients receiving a Medicare rebate and paying a gap fee.\n\n\n\nGrattan's Health Program director Peter Breadon said the system was broken from start to end.\n\n\n\n\n\n\"Everywhere, from how the system is planned and how training is funded through to how we target public investment and integrate the system between primary care and specialist care, it all really needs a lot of change,\" he told AAP.\n\n\n\n\n\nFederal Health Minister Mark Butler said private health insurers and specialists needed to do more to protect patients from exorbitant bills.\n\n\n\n\n\nHe said the Albanese government would upgrade the Medical Costs Finder, which helps patients find the best value for specialist medical advice, and was committed to working with stakeholders to improve cost transparency.\n\n\n\nThe report also recommends governments provide one million extra specialist appointment services every year in areas that receive the least care, a system in which GPs can get written advice from other specialists, modernise public specialist clinics, and allocate $160 million to expand specialist training for under-supplied specialities and rural training.\n\n\n\n\n\nAustralian Medical Association president Dr Danielle McMullen said public hospital underinvestment and lagging Medicare rebates made it harder for patients.\n\n\n\n\n\n\"The risks of delaying medical care are that the health problem gets worse,\" she said, adding it also puts pressure on GPs and hospitals in public and private clinics.\n\n\n\n\n\nThe doctors' association supports most of Grattan's recommendations, but said removing Medicare funding from specialists who charged excessive fees was not practical.\n\n\n\n\n\nAs governments negotiate the National Health Reform agreement, McMullen urged leaders to sort out longer-term funding for public hospitals and develop a health workforce data tracker to show where investment was needed.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/inside-the-fight-to-save-ancient-australian-forests-from-asias-paper-mills/5g7a1oxhk",
        "title": "Inside the fight to save ancient Australian forests from Asia's paper mills",
        "publish_date": "Sun, 15 Jun 2025 19:50:50 +0000",
        "category": "finance",
        "authors": [],
        "text": "Tasmania, known to its First Peoples as lutruwita, has long been a flash point in Australia's environmental struggles — from logging and mining to water protection.\n\n\n\n\n\nNow, a new generation of palawa Aboriginal leaders is stepping up, continuing an ancient legacy of defending Country in the face of environmental destruction.\n\n\n\n\n\nIn Tasmania, logging is a billion-dollar industry that supports over thousands of jobs and exports millions of tonnes of timber, woodchips and pulp overseas, primarily to feed paper mills in China and Japan.\n\n\n\nBut as vital carbon sinks and biodiversity havens shrink, Traditional Owners argue that the long-term environmental and cultural costs are far greater than the economic gains.\n\n\n\n\n\nAmong them is 25-year-old palawa lawyer Maggie Blanden. Last year, she made headlines by rejecting her nomination for Young Tasmania of the Year to protest a date — 26 January — which she said represents genocide and stolen land.\n\n\n\n\n\nBlanden told NITV's The Point that she was raised with an understanding of both Aboriginal lore and \"settler\" systems and is training to be a lawyer to challenge colonial structures from within.\n\n\n\n\n\n\"Education is power for our mob,\" Blanden said.\n\n\n\n\n\n\"Our old people were on the front line defending Country and that legacy continues today. They were protesting for their inherent rights to be Aboriginal people and to be on Country and yet they were being persecuted for it.\n\n\n\n\n\n\"Becoming a lawyer was my part in that, breaking down those systems and really bringing us home to that key message . \"\n\n\n\nMaggie Blanden, a 25-year-old palawa lawyer, with the host of NITV's The Point, John Paul Janke. Source: SBS News It's a message that echoes across places like the Styx Valley, a stronghold of Tasmania's ancient forests and a hotspot for protests against logging.\n\n\n\n\n\nEvery day vital carbon sinks and biodiversity havens shrink as forests are reduced to woodchips that are shipped offshore to become paper and fill the trays of the world's photocopiers.\n\n\n\n\n\nIt's an industry that supports over 5,500 jobs and contributes $1.2 billion to the economy, but Traditional Owners argue that the long-term environmental and cultural costs are far greater.\n\n\n\n\n\nRuth Langford, a Yorta Yorta and Dja Dja Wurrung woman born in lutruwita, is one of the cultural caretakers fighting back.\n\n\n\n\n\n\"It's not actually a forest, it's a plantation. It's a single species tree,\" she said, gesturing to rows of identical trees.\n\n\n\n\n\n\"This is very sick country.\n\n\n\n\n\n\"The concern that we have is these types of plantings create potentially catastrophic bushfires, as well as it's sucking all the water up.\"\n\n\n\nThe state government's Sustainable Timber Tasmania, formerly Forestry Tasmania, manages approximately 812,000 hectares of public production forest and promises a sustainable approach that is socially, economically and environmentally responsible.\n\n\n\n\n\nSome 1.2 million hectares of the state's forest is classified as old growth, of which eight per cent faces potential logging within the 'Permanent Timber Production Zone'.\n\n\n\n\n\nEvery three years, the government releases a forestry plan that designates large areas for logging that include a patchwork of plantations and old-growth forests and there are fears that more protected areas could be opened up to potential logging.\n\n\n\n\n\nLangford says contractors often have little say in the areas they are harvesting, and many taxpayers are asking why they are continuing to foot the bill for an unsustainable approach.\n\n\n\n\n\n\"It doesn't make economic sense,\" she said.\n\n\n\n\n\n\"The government is subsidising all the roads, all the departments, and loses all of our carbon, loses all of the biodiversity, all of the water catchment and loses the very potential of what this could be both for timber production and also for future generations.\"\n\n\n\nRuth Langford, a Yorta Yorta and Dja Dja Wurrung woman born in Tasmania (lutruwita), is one of the cultural caretakers fighting back. Source: Supplied Palawa woman Carleeta is part of a protest camp in Styx Valley and believes balance is possible and immediate change essential.\n\n\n\n\n\n\"We're not saying completely stop the whole logging industry,\" she said.\n\n\n\n\n\n\"We need to go more towards different plantations and alternatives to logging these beautiful old-growth forests that have seen, not only our old fellows, but will see our future generations be able to come and sit under these same trees that their ancestors sat under.\"\n\n\n\n\n\nAt the heart of the movement is a deep reverence for inter-generational responsibility. For Blanden, elders like Uncle Jim Everett (Puralia Meenamatta), who still physically defends forested areas, represent that legacy.\n\n\n\n\"He always says it's not about land rights — it's about the land's right. The right to be cared for. That's what we carry on our shoulders,\" she said.\n\n\n\n\n\nAs climate change accelerates and biodiversity collapses, Blanden sees Aboriginal leadership as vital.\n\n\n\n\n\n\"They need us. Country needs us and it is our time to answer that call and come and protect Country.\"\n\n\n\n\n\nThe Point airs Tuesdays 7.30pm on NITV, and is available after the broadcast on SBS On Demand .\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/nsw-government-announces-funding-for-new-movie-studio-site/nf8zysopu",
        "title": "New South Wales government announces funding for new movie studio site",
        "publish_date": "Sun, 15 Jun 2025 08:30:05 +0000",
        "category": "finance",
        "authors": [],
        "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nAustralia's movie industry received some happy news on the final day of the Sydney film festival.\n\n\n\n\n\nWith the New South Wales government announcing a $380 million package to support the film and digital games sector.\n\n\n\n\n\nIt will help develop a domestic sector that has played a starring role famous films like Happy Feet, Babe, and Planet of the Apes.\n\n\n\n\n\nNew South Wales Arts Minister John Graham is hoping to help the industry attract even more Hollywood investment.\n\n\n\n\n\n\"When filming happens, when screen production happens in Australia, half the time it happens here in New South Wales. This is the powerhouse. We're determined to keep that lead. That's why the government's investing strongly here.\"\n\n\n\n\n\nThe package includes $280 million to support post, digital, visual effects and video game development.\n\n\n\n\n\nAnother $100 million will help kickstart the hunt for a location to serve as Sydney's second film studio.\n\n\n\n\n\nMr Graham says there's a critical shortage of production space, with Disney Studios at Moore Park currently the city's only film studio.\n\n\n\n\n\nThe facility has played a pivotal role in blockbuster movies like Mad Max Furiosa and The Matrix\n\n\n\n\n\n\"Unfortunately, no one can be told what the matrix is. You have to see it for yourself.\"\n\n\n\n\n\nTreasurer Daniel Mookhey expects to see the investment spur economic activity and job creation.\n\n\n\n\n\n\"The industry supports over thirteen thousand direct jobs, and with this investment, we're confident that it's going to create a great degree of spillover. This is what it looks like to be boosting economic growth in New South Wales in the twenty first century.\"\n\n\n\n\n\nHe says the sector already injects more than $1 billion into the local economy.\n\n\n\n\n\nThe treasurer also announced new plans to cut red tape in an effort to make the movie and game-making as seamless as possible.\n\n\n\n\n\nHead of Screen New South Wales, Kyas Hepworth welcomed the news.\n\n\n\n\n\n\"It's just exciting to see the government standing for the creative work as practitioners and storytellers within the state and we're not only looking at the state what happens in New South Wales affects Australia and elevates our storytelling globally.\"\n\n\n\n\n\nOther states have been competing for big budget films, too.\n\n\n\n\n\nQueensland is giving a $71 million boost to its screen industry, and W-A forking out $300 million for a studio complex in Perth.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/interview-lauren-muratore-on-having-a-conversation-about-sex/nsv4xcb1v",
        "title": "INTERVIEW: Lauren Muratore on having a conversation about sex",
        "publish_date": "Sat, 14 Jun 2025 21:30:00 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/solar-batteries-are-about-to-get-cheaper-but-some-existing-solar-panel-users-are-sceptical/eu3uc8lli",
        "title": "Solar batteries are about to get cheaper. But some existing solar panel users are sceptical",
        "publish_date": "Sat, 14 Jun 2025 20:39:51 +0000",
        "category": "finance",
        "authors": [],
        "text": "Homeowners hoping to reduce their power bills by installing solar panels are now considering whether new discounts for solar batteries will be worth it.\n\n\n\n\n\nFrom 1 July, the federal government's Cheaper Home Batteries Program will provide a 30 per cent discount on the upfront cost of installing eligible small-scale battery systems.\n\n\n\n\n\nBut homeowners like Victorian resident Lee Bolger, who invested in solar panels a few years ago, are now experiencing dramatic drops in their feed-in tariffs and are sceptical about the added benefit of batteries.\n\n\n\n\n\nFeed-in tariffs — credits issued by energy retailers — allow solar owners to earn money for any unused electricity they generate, which is fed into the electricity grid.\n\n\n\n\n\nThe rates vary across different states and electricity providers.\n\n\n\nAdam Corrigan, an energy efficiency expert and founder of Your Energy Friend, says each household is different, and there are many other energy-saving options to consider before spending thousands on solar and batteries.\n\n\n\nSolar disappointment\n\nBolger, who lives in the Victorian town of Great Western, says he installed 30 panels on his eight-bedroom home in March 2023.\n\n\n\n\n\nHe rents out rooms in his house to boarders and says they use a lot of electricity as they often have the air-conditioning and heating on.\n\n\n\n\n\nHis 12-kilowatt system cost him $12,680 after rebates and other discounts, which he estimated he could recoup in around six years.\n\n\n\n\n\nBut the feed-in tariff at the time was around 12 cents per kilowatt-hour (kWh), and now he only gets around 6 cents.\n\n\n\n\n\nMore drops are expected, with comparison website Finder saying the minimum rate for tariffs in Victoria will drop to 0.04 cents from 1 July, although better rates are available depending on the provider.\n\n\n\n\n\nFifteen years ago, they were as high as 60 cents.\n\n\n\nFeed-in tariff rates for solar panel owners can vary widely across different states and territories. Source: SBS News Bolger estimates his original feed-in tariff of 12c per kWh would have saved him around $1,000 a year.\n\n\n\n\n\nWhen combined with the estimated $1,000 worth of electricity he saves relying on energy generated from his own system, he receives a total benefit of $2,000 per year from his solar panels.\n\n\n\n\n\nIf the feed-in tariff drops to practically zero, the benefit from his panels will reduce to around $1000 a year, meaning the time Bolger would need to pay off his panels would almost double.\n\n\n\n\n\nHe says the experience has made him \"indifferent\" about the economic benefits of solar and he won't be recommending it to others.\n\n\n\nLee Bolger says he's now \"indifferent\" to the benefits of solar after his feed-in tariffs were reduced. Source: Supplied Bolger doesn't believe installing a battery will make a difference, because his solar panels won't generate enough excess energy to store — especially in winter when it's often raining and dark — to make the purchase worthwhile.\n\n\n\n\n\n\"My summer bills were ridiculously low. In winter, you will not generally get enough charge into the battery to make a big difference,\" he says.\n\n\n\nBattery discounts attractive for some but not others\n\nCorrigan says other households might be in a different position to Bolger, as the average NSW home only uses about 20kWh of electricity per day.\n\n\n\n\n\nThe NSW-based energy expert, who has a 1.5 kilowatt solar system, says he uses less than 10 kilowatt-hours a day, although his cooktop is powered by gas.\n\n\n\n\n\n\"[For] most homes, a 10 kilowatt or 14 kilowatt battery will get you through the night easily,\" he says.\n\n\n\n\n\n\"However, if you are cranking your air conditioner and you've got ducted air conditioning, it's probably only going to last you two, three hours.\"\n\n\n\n\n\nCorrigan says batteries will work for some households and the new federal rebate does make the cost more affordable.\n\n\n\nA battery makes so much sense, because you can store that excess electricity you're generating in the middle of the day and then use it in the early evening.\n\nFinder has estimated the cost of a 10kWh battery could come down to between $6,713 – $8,904 due to the federal discount.\n\n\n\n\n\n\"In Australia, the average household uses about 15 to 20kWh of electricity per day,\" a Finder spokesperson says.\n\n\n\nEnergy Minister Chris Bowen looks at home battery systems during a visit to SolarHub in May. Source: AAP / Lukas Coch \"If most of your energy consumption is in the evening and you're paying a single electricity rate — let's use 32.34c per kWh as an average based on single-rate plans in our database — then with a 10kWh battery and using 80 per cent of its capacity, you could save about $850 a year,\" a Finder spokesperson says.\n\n\n\n\n\n\"However, the actual savings can vary depending on the type of electricity plan you have, the rates you pay, your solar panel setup, your energy consumption patterns, and how much electricity you export back to the grid.\"\n\n\n\n\n\nWhile the federal battery discount applies nationally, the states and territories also have programs that can be used to further reduce the cost.\n\n\n\nLook at other options first\n\nCorrigan recommends considering other options before investing in expensive solar panels and battery systems.\n\n\n\n\n\nHe suggests Bolger should review his insulation and energy efficiency measures to reduce his electricity consumption.\n\n\n\n\n\nThe first thing he recommends for households is to analyse their power bills and shop around to get the best deal.\n\n\n\n\n\nMaking your house more energy-efficient should be the next priority before considering solar panels and, finally, batteries.\n\n\n\nIf you want to make your home more comfortable, get your insulation sorted and do your draft proofing. That's your best return on investment. That's your best bang for buck.\n\nCorrigan says simple changes such as installing heavy-lined curtains and a box pelmet (which goes around the top of the curtain) can be very effective at keeping your home warm, and are much cheaper than double-glazed windows, for example.\n\n\n\nHeavy curtains with a pelmet can be very effective in keeping your home warm. Source: Getty / Penpak Ngamsathain Using a thermal camera around the home can also show gaps in roof insulation where batteries might have been moved.\n\n\n\n\n\n\"You only need a 5 per cent gap in that insulation blanket, and the effectiveness of that insulation — the whole blanket — diminishes by almost a half,\" Corrigan says.\n\n\n\n\n\n\"When you get into bed tonight and you pull the doona up, just cut some holes in it, see how well it works.\"\n\n\n\nCan you afford it?\n\nWhen considering whether to invest in a battery system, Corrigan says the first consideration is cost, as they are expensive and many people don't have the money sitting in the bank.\n\n\n\n\n\nThose who already have a solar system should check whether their inverter is battery-compatible, as this could also raise warranty issues if it needs to be replaced.\n\n\n\n\n\nAnother consideration is what your next car will be.\n\n\n\nREAD MORE Why Australians are buying EVs even if they can't charge the cars at home\n\nCorrigan says in one to two years, electric vehicles will be capable of vehicle-to-home and vehicle-to-grid functionality, allowing EV batteries to be used to power your home.\n\n\n\n\n\n\"Some people are already doing it,\" he says.\n\n\n\n\n\nThey are an attractive option because EV batteries generally have a huge capacity of around 50-70kWh.\n\n\n\n\n\n\"You could run your home for days on it.\"\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.theage.com.au/politics/federal/the-pm-just-got-a-pay-rise-here-s-how-his-salary-compares-to-trump-and-other-leaders-20250613-p5m75u.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "The PM just got a pay rise. Here’s how his salary compares to Trump and other leaders",
        "publish_date": "Mon, 16 Jun 2025 11:59:25 +1000",
        "category": "finance",
        "authors": [
            "Millie Muroi"
        ],
        "text": "Prime Minister Anthony Albanese will be paid more than US President Donald Trump from next month after the Remuneration Tribunal boosted federal politicians’ pay by 2.4 per cent. But how does his salary compare to that of other countries’ leaders?\n\nWhile the US president’s salary has been steady since 2001, the Remuneration Tribunal determines the change in salaries of Australian ministers – including the prime minister – every year.\n\nPrime Minister Anthony Albanese will soon be paid more than Donald Trump. Credit: AP, Alex Ellinghausen\n\nThe latest decision, which takes effect on July 1, lifts Albanese’s salary from $607,500 to $622,071. That means he will now overtake Trump, who is paid $US400,000 ($617,000).\n\nAlbanese’s latest pay rise is lower than the 3.5 per cent increase granted by the Fair Work Commission for minimum wage earners earlier this month, which the tribunal considered alongside economic conditions and past and projected movements in private and public sector pay.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/business/markets/the-ticking-time-bomb-facing-the-global-economy-20250616-p5m7nh.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "The ticking time bomb facing the global economy",
        "publish_date": "Mon, 16 Jun 2025 11:58:51 +1000",
        "category": "finance",
        "authors": [
            "Stephen Bartholomeusz"
        ],
        "text": "This year, OPEC has been gradually bringing back some of the 6 million barrels a day of production it has held back over the past three years, but there is still a lot of spare capacity on the sidelines in a market that the International Agency says is already over-suppled, with the growth rate in supply about twice that of the growth in demand. Of far greater concern than Iran’s own production is that of the other Middle Eastern producers. Iran has the potential, if it chose to, to close the Strait of Hormuz, the only marine entry point to the Persian Gulf and arguably the most important choke point in the global energy supply chain. Nearly a third of the world’s oil transits through the strait each day and about 20 per cent of its LNG. If that trade were closed, or heavily disrupted, oil prices would soar, with estimates that they would reach somewhere between $US120 and $US150 a barrel. US President Donald Trump’s misguided trade wars have left the global economy vulnerable. Credit: Bloomberg Traders are clearly discounting that possibility, partly because it would deprive Iran itself of its major source of revenue and upset its major customers but, more particularly, because it would almost certainly drag the US, whose Fifth Fleet is based in Bahrain, directly into the conflict.\n\nIran has, in the past, threatened to block the strait but, apart from laying some mines during the 1980s war with Iraq, hasn’t done so. Loading As long as Israel refrains from attacking its oil exports and the US remains only indirectly involved (by supporting Israel defence against Iran’s retaliatory strikes), the arguments for keeping the strait open would be stronger than the temptation to close it. If that were to change it would be grim news for the rest of the world. Indeed, even the so far relatively modest impact on oil prices isn’t helpful. Last week – before the conflict began – the World Bank cut its forecast for global growth this year from 2.8 per cent last year to 2.3 per cent. Other economic agencies and forecasters have similarly downgraded the outlook to levels that, apart from the pandemic, were last seen in the aftermath of the financial crisis in 2008-09.\n\nThat’s because Donald Trump’s tariffs are expected to severely depress global economic growth, and growth within the US in particular. The International Monetary Fund cut its forecast for US GDP growth by 90 basis points to a meagre 1.8 per cent earlier this year. The World Bank has US growth – 2.8 per cent last year – halving to 1.4 per cent. Trump’s trade wars have rendered what was reasonable global growth and a strong and out-performing US economy vulnerable to exogenous shocks. With Trump’s 10 per cent baseline tariffs on everyone already in place, the average US tariff has leapt from about 3 per cent to something in the high-teens. The 90-day pause on his more draconian “reciprocal” tariffs will end on July 9, where many of America’s trading partners will face even higher rates. The tariffs will undermine US and global growth and push up US and global inflation rates.\n\nConventionally, because they would adversely impact global trade and the global economy, they would also reduce demand for oil. If Middle Eastern supply was disrupted, however, the oil price would spike and add to global inflation, increasing the threat of global stagflation, or the combination of lower growth and higher inflation. When the US released its latest inflation data for May last week, a contributing factor to the headline number of 2.3 per cent – the best result for more than four years – was that oil prices traded as low as $US60 a barrel last month. While the inflation data has yet to reflect the impact of the tariffs – US importers had front-loaded their orders to get in ahead of the tariffs and therefore their impact will be delayed and probably show up progressively in coming months – the surge in oil prices, thanks to the new outbreak of hostilities in the Middle East, will add to the US inflation rate.\n\nIt also introduces a new dimension of uncertainty for the US Federal Reserve Board, whose Open Market Committee meets this week. There is no expectation that it will cut US rates at this meeting but the prospect of a September cut – up for discussion before Israel’s attack – may have receded if oil prices remain at their current levels, or rise further. Other central banks will have to grapple with the same question mark over the trajectory of oil prices and their impacts on inflation. Loading Trump’s trade wars have rendered what was reasonable global growth and a strong and out-performing US economy vulnerable to exogenous shocks. Israel, with its strikes on Iran’s nuclear capabilities and its attempt to destabilise the regime, has provided one that will already generate some wider economic stresses but has the potential to do considerably more damage if it doesn’t remain contained.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/rugby-union/star-power-missing-as-anzac-side-miss-out-on-world-s-highest-paid-player-20250616-p5m7om.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Star power missing as Anzac side miss out on world’s highest-paid player",
        "publish_date": "Mon, 16 Jun 2025 11:51:52 +1000",
        "category": "sports",
        "authors": [
            "Iain Payten",
            "Jonathan Drennan"
        ],
        "text": "The Australia and New Zealand Invitational side to face the British and Irish Lions seven days ahead of the first Test will lack serious star power with New Zealand five-eighth Richie Mo’unga to miss the game in Adelaide due to a broken hand.\n\nMounga’s agent Cameron McIntyre confirmed that the world’s highest-paid player has not recovered from the injury sustained playing for Japanese club Toshiba Brave Lupus and has withdrawn from talks with Rugby Australia about playing in the game.\n\nMo’unga, who is reportedly on a $2m deal, had previously spoken of his wish to play in the fixture after speaking to former New Zealand coach Ian Foster, who will be an assistant for the AUNZ side.\n\n“I miss the big Test match setting, the big arenas, this (AUNZ game) will be the closest I’ll get to it while I’m in Japan,” Mo’unga previously told rugbyjp.com.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/environment/climate-change/the-curious-case-of-the-ghost-ship-that-vanished-and-reappeared-20250610-p5m6cf.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "The curious case of the ghost ship that vanished, and reappeared",
        "publish_date": "Mon, 16 Jun 2025 11:46:30 +1000",
        "category": "finance",
        "authors": [
            "Bianca Hall"
        ],
        "text": "Days after the meeting, Nganhurra resurfaced – not physically, but in a public statement by Norwegian company BW Offshore, which announced it had secured an agreement to acquire the vessel. “Given the limited availability of suitable FPSOs for redeployment, securing this unit places BW Offshore in a strong, competitive position,” chief executive Marco Beenen said. While Nganhurra has been reborn, the question of what happens to offshore oil and gas infrastructure reaching the end of their lifespans is vexed. At an industry conference in Perth last week, delegates discussed the fate of another defunct floating production, storage and offloading facility: the decrepit and government-owned Northern Endeavour. Northern Endeavour, another former Woodside vessel, has for years been moored in the Timor Sea while it undergoes decommissioning.\n\nFour years after Woodside sold the vessel to Northern Oil and Gas Australia (NOGA) in 2015, Northern Endeavour was shut down amid safety warnings from the regulator, and NOGA collapsed just months later – forcing the government to step in. The Northern Endeavour, pictured in the Timor Sea in 2021. Credit: Boiling Cold Its decommissioning – funded by a levy on offshore oil and gas producers – demonstrates the risks of removing these giants from the ocean: in the worst-case scenario, 18,692 cubic metres of crude oil could have spilt into the Timor Sea. The Department of Industry, Science and Resources issued a tender to find a lead contractor for the next two stages of recycling the 43,000-tonne vessel. However, it was unable to find a tender that met the department’s requirements or represented value for money. A spokesman for Resources Minister Madeleine King said the procurement process was ongoing.\n\nAs dozens of oil and gas facilities reach the end of their lifespan, there are growing calls for an Australian decommissioning and recycling industry to capitalise on the opportunities presented by offshore infrastructure. In 2023, King reaffirmed her support for the jobs generated by decommissioning to stay in Australia. “As industry starts investing to decommission $60 billion in offshore infrastructure, we want as much of that investment to be spent backing Australian industry and Australian jobs.” Loading Australia’s offshore energy operator NOPSEMA said in an information paper in January that, “recent experience indicates that some titleholders do not develop appropriate or timely decommissioning plans, which has potential to increase risk to people and the environment”. Unions say offshore oil and gas workers are perfectly placed to safely and responsibly undertake this work. The Maritime Union of Australia and Australian Workers Union have jointly called on government to reinvest more than $1 billion in levies collected from oil and gas producers into a fledgling recycling industry to safely and responsibly remove offshore infrastructure.\n\n“Australia’s steel industry is ready and capable,” said Australian Workers Union national secretary Paul Farrow. “We have workers prepared to do this job safely and efficiently, and our mills stand ready to recycle high-quality ferrous metals. Sending these materials abroad is a significant missed opportunity.” Loading MUA National Secretary Paddy Crumlin said Australia’s offshore oil and gas infrastructure contains an estimated 3.7 million tonnes of high-quality ferrous metal, suitable for recycling into low-emissions steel. “Towing the Northern Endeavour to [a third country] for dismantling is not just an absurd outsourcing of jobs – it’s a 15,000-nautical-mile climate contradiction,” he said.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/pole-vault-superstar-breaks-world-record-again-20250616-p5m7pa.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Pole vault superstar breaks world record again",
        "publish_date": "Mon, 16 Jun 2025 11:42:29 +1000",
        "category": "sports",
        "authors": [],
        "text": "Pole vault superstar breaks world record again\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/business/small-business/know-your-skills-and-value-how-small-businesses-can-face-up-to-tax-time-with-confidence-20250605-p5m59i.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘Know your skills and value’: How small businesses can face up to tax time with confidence",
        "publish_date": "Mon, 16 Jun 2025 11:40:15 +1000",
        "category": "finance",
        "authors": [],
        "text": "It’s often said that no one becomes a small-business owner to actually run a business. It is, after all, a world that few enter into with a blueprint for success. Yet, some 2.6 million Australians have taken the leap into entrepreneurship, many of whom rely on advisers, loved ones, the internet and all manner of support systems to learn as they go. What can hold some back, however? It’s the fear of asking “silly questions” — a phrase most of us have uttered in some form or another throughout our lives.\n\nKelsie Gaffey is one such entrepreneur in the early stages of building a business. The young South Australian opened Gracie’s Wine Room, a buzzy hotspot in Melbourne’s East, earlier this year. “Entrepreneurship has always been something I’ve aspired to, but I’ve never really thought I had the time, experience or money,” she says.\n\n“But I knew in my heart that I didn’t have a passion for the nine-to-five grind, so about a year ago, I started taking steps to build something of my own, and that’s how Gracie’s came to be.”\n\nKelsie Gaffey says she is a little nervous about her first EOFY as a small-business owner. Credit: Photo credit: Jordan Price\n\nGaffey is slowly but surely learning the ropes. And with tax time on the horizon — her first being self-employed — she’s leaning into the idea that there’s no such thing as a silly question in small business.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/nrl/it-s-a-dirty-job-but-whoever-does-it-best-can-decide-who-wins-origin-20250613-p5m75d.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "It’s a dirty job, but whoever does it best can decide who wins Origin",
        "publish_date": "Mon, 16 Jun 2025 11:40:00 +1000",
        "category": "sports",
        "authors": [
            "Robert Dillon"
        ],
        "text": "It’s a dirty job, but someone has to do it.\n\nImagine going to work every day and not knowing what time you will start, what tasks you will be assigned, how long they will take, and if indeed you will even be required. And then, when it comes time to knock off, your colleagues receive most of the credit for whatever you’ve delivered during that particular shift.\n\nWelcome to the world of Connor Watson and Kurt Mann, who earn a crust each week as the NRL’s most versatile handymen and will fill the same unglamorous but vital role in State of Origin II on Wednesday.\n\nWatson and Mann have become specialists in the No.14 jersey, which has evolved into the only bench number that effectively defines the player wearing it. Theoretically 14 should be no different to 15, 16 and 17, but we all know it is.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/politics/nsw/the-two-north-shore-councils-resisting-cookie-cutter-housing-20250612-p5m6xu.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "The two north shore councils resisting ‘cookie cutter’ housing",
        "publish_date": "Mon, 16 Jun 2025 11:30:00 +1000",
        "category": "finance",
        "authors": [
            "David Barwell"
        ],
        "text": "A major overhaul of the state’s planning laws aimed at speeding up the construction of Sydney’s “missing” housing stock has been met with resistance on Sydney’s north shore as two councils fear the “cookie cutter” reforms could lead to a spike in eyesore developments that erode the established character of the region’s tree-lined streets.\n\nMosman and Ku-ring-gai councils are leading the pushback against the NSW government’s proposed “pattern book” scheme, which aims to expedite the construction of low- and mid-rise housing builds in suburban areas.\n\nOne of the “pattern book” designs - for a mid-rise apartment block, - by Andrew Burges Architects. Credit: NSW government\n\nThe scheme would give developers a catalogue of pre-approved housing designs as a means of gaining access to fast-tracked planning pathways and quick building approval permits.\n\nTouting the program as “the future of housing in NSW”, the NSW government hopes the scheme will address the “missing middle” in Sydney’s housing stock by reopening the door to small- and medium-sized builds up to six storeys in suburban areas.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/cricket/twenty-nine-reasons-to-expect-a-different-sam-konstas-as-he-nears-a-test-recall-20250616-p5m7n4.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Twenty-nine reasons to expect a different Sam Konstas as he nears a Test recall",
        "publish_date": "Mon, 16 Jun 2025 11:30:00 +1000",
        "category": "sports",
        "authors": [
            "Daniel Brettig"
        ],
        "text": "London: As Australia’s players and staff took a moment to spend time with their families on the Lord’s outfield following the end of the World Test Championship final, Sam Konstas spent most of his time hanging out with their kids.\n\nIt was a moment that underlined how at 19, Konstas is a generation gap behind the rest of an ageing team, the oldest member of which - Usman Khawaja - is twice his age.\n\nBut it is by another number - 29 - that Konstas may be entitled to remind the world how assiduously he has worked since the end of the Australian season, to return to the kind of batting that got him into contention to play for the national team in the first place.\n\nAfter his high-profile flame out at the SCG against Scott Boland in a February Sheffield Shield match, and before his departure with the Australian Test squad for London and the Caribbean, Konstas had no fewer than 29 net sessions with his batting coach Tahmid Islam in Sydney.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/a-glimpse-into-jiho-hanbang-samgyetang-20250616-p5m7o6.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "A glimpse into Jiho Hanbang Samgyetang",
        "publish_date": "Mon, 16 Jun 2025 11:29:49 +1000",
        "category": "finance",
        "authors": [],
        "text": "A glimpse into Jiho Hanbang Samgyetang\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/property/news/local-upsizer-pays-3-93-million-for-luxury-concord-duplex-20250613-p5m7b6.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Local upsizer pays $3.93 million for luxury Concord duplex",
        "publish_date": "Mon, 16 Jun 2025 11:24:18 +1000",
        "category": "finance",
        "authors": [
            "Carmen Forward"
        ],
        "text": "An ultra-luxurious duplex home in Concord has sold for $3.93 million to a buyer upsizing from nearby Breakfast Point.\n\nThe stunning four-bedroom residence with car basement, wine cellar, gym and cinema room at 4 Tremere Street was on the left side of the duplex, as seen from the front gate.\n\nThere were three registered bidders and all three were active. The auction was held indoors before a crowd of 50, including many builders, around the fireplace.\n\nBidding opened at $3.7 million, below its $3.8 million guide. Fifty thousand dollar bids from all three parties were placed in rapid succession until it was called on the market at $3.9 million.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/property/news/boatie-drops-anchor-and-2-3-million-on-new-farm-top-floor-apartment-20250615-p5m7ks.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Boatie drops anchor – and $2.3 million – on New Farm top-floor apartment",
        "publish_date": "Mon, 16 Jun 2025 11:21:28 +1000",
        "category": "finance",
        "authors": [
            "Sarah Webb"
        ],
        "text": "A man who had spent the past two years sailing around Australia has dropped anchor in one of New Farm’s most tightly held riverfront enclaves – splashing $2.3 million on a top-floor apartment that boasts water views from almost every room.\n\nThe New Zealand-born buyer outbid three others to secure the keys to 42/341 Bowen Terrace – a three-bedroom, one-bathroom “blank canvas” with panoramic vistas of the Brisbane River and Story Bridge – paying $300,000 over the reserve.\n\nThe dated apartment sits within a tightly held complex where only a handful of homes have changed hands in recent years. This one last hit the market more than two decades ago.\n\nSix bidders registered for Saturday’s auction, four of whom raised a paddle. Bidding opened at $1.4 million and quickly jumped. A Far North Queensland buyer jumped in via phone, pushing the price to $2 million.",
        "source": "TheAge"
    },
    {
        "url": "https://au.news.yahoo.com/australia-post-launches-new-mailboxes-to-tackle-growing-aussie-issue-233512125.html",
        "title": "Australia Post launches new mailboxes to tackle growing Aussie issue",
        "publish_date": "2025-06-15T23:35:12Z",
        "category": "finance",
        "authors": [],
        "text": "For the first time, Australia Post has installed talking post boxes at a few select locations.\n\nAustralia Post has installed the country’s first-ever talking post boxes in a bid to bring people closer together. The three interactive mailboxes, located in Canberra, Sydney and in Traralgon, in Victoria’s Gippsland region, use smart sensors to grab the attention of those walking past, and encourage them to write to a loved one the old fashioned way — by sending a postcard.\n\nThe installations, which were set up as part of a nationwide campaign with Beyond Blue to deliver five million prepaid Connection Postcards this month, utter phrases like:\n\n“You can make a difference with a connection.”\n\n“A little hello goes a long way.”\n\n“Send a note to someone special.”\n\n“Give them a laugh — send a free postcard from your local Post Office.”\n\nAnyone wandering by who decides to take the talking post box up on its offer can simply pop into the nearby post office and ask staff for one of specially designed postcards, a spokesperson for Australia Post told Yahoo News.\n\nADVERTISEMENT\n\nThe cards, which are illustrated by regional Aussie artist Jocelyn Proust and feature the words “sharing this postcard because I care”, are available from all post offices around the country.\n\nSince launching the initiative five years ago, over 21 million postcards have been distributed, however efforts were ramped up this year after an Australia Post survey revealed people were “more likely to send a postcard if they were prompted”, Nicky Tracey, the company’s general manager of community and stakeholder engagement, said.\n\n“For the very first time, we’re bringing talking Post Boxes to three locations. What we know is that people still feel a much deeper emotional connection when they receive a letter or postcard. And that’s why we want to encourage people to write to one another, to improve connection.”\n\nPrepaid Connection Postcards are available at post offices around the country. Source: Australia Post\n\nAustralia Post's mailbox move to help lonely Aussies\n\nIn a study conducted by Beyond Blue last year, one in three Aussies reported to feeling lonely, with some admitting it caused them similar distress to cost of living and housing pressures.\n\nADVERTISEMENT\n\nSmall acts of kindness can help bridge this gap, especially in isolated areas, Beyond Blue CEO, Georgie Harman AO, said.\n\n“Research shows that everyday micro interactions like saying hello to people in our local neighbourhood as we’re walking the dog or popping into the shops can help us feel less lonely and more connected,” she explained.\n\n“Our partnership with Australia Post and the Connection Postcards embodies those small but mighty moments by encouraging Australians to let someone know they’re thinking about them.”\n\n“Australia Post’s large network helps us reach regional and rural communities, where people are more likely to experience loneliness, which can affect their mental health, and where access to support is often limited.”\n\nThe talking post boxes can be found at the below locations until mid-July, when the campaign ends.\n\nADVERTISEMENT\n\nCanberra — 53 Alinga St\n\nSydney — 44 Market St\n\nTraralgon — 161-169 Franklin Street\n\nReaders seeking support and information about suicide prevention can contact Beyond Blue on 1300 22 4636, Lifeline on 13 11 14 or Suicide Call Back Service on 1300 659 467.\n\nDo you have a story tip? Email: newsroomau@yahoonews.com.\n\nYou can also follow us on Facebook, Instagram, TikTok, Twitter and YouTube.",
        "source": "Yahoo"
    },
    {
        "url": "https://au.news.yahoo.com/big-ev-myth-busted-as-aussies-rethink-second-hand-electric-cars-071213386.html",
        "title": "Big EV 'myth' busted as Aussies rethink second-hand electric cars",
        "publish_date": "2025-06-15T07:12:13Z",
        "category": "finance",
        "authors": [],
        "text": "A common perception is that EVs depreciate faster than petrol cars. But with advances in battery technology and growing market maturity, that view is beginning to shift.\n\nIt's expected 110,000 new EVs will be sold in 2024 by the year's end - a 'major milestone'. Source: Reddit\n\nAs electric vehicle (EV) adoption grows in Australia, long-held myths around battery life, resale value, and long-term costs are being increasingly challenged by real-world data. But despite progress, some misconceptions — particularly around second-hand EVs — continue to influence buyer behaviour.\n\nOne of the most persistent beliefs is that EVs don't hold their value as well as petrol-powered cars. While there's evidence that this is starting to shift, especially with improvements in battery technology, consumer hesitation remains.\n\nScott Maynard, managing director of EV brand Polestar Australia, acknowledges that concerns around battery health have historically been a major sticking point. He says that’s changing, particularly when buyers go through manufacturer-certified channels.\n\n\"Purchasing a used EV through a certified manufacturer network now includes a detailed battery 'report card,' which helps build trust and gives buyers the confidence to go ahead with a second-hand electric vehicle,\" Maynard told Yahoo News Australia.\n\nWA recently launched its impressive 'EV highway', spanning 70000 kilometres across the state. Source: WA Government/ Getty\n\nEletcric vehicle batteries improving\n\nMaynard has a vested interest in promoting the second-hand market. But many of his points are supported by independent data. Battery health software provider Geotab reports that the average annual degradation rate for EV batteries has dropped from 2.3 per cent in 2019 to 1.8 per cent in 2024 — a relatively modest figure compared to early concerns.\n\nADVERTISEMENT\n\nMaynard also points to advances in battery management systems that help protect long-term performance by regulating temperature and usage patterns. He argues that this technology, along with the ability to repair individual battery modules rather than replacing entire packs, is helping shift buyer perceptions.\n\nHowever, public scepticism — often amplified by social media anecdotes — still plays a role in dampening confidence. And while some consumers are now embracing the used EV market as a more affordable entry point, challenges remain around financing, insurance, and rural infrastructure.\n\nMaynard believes these barriers can be addressed through stronger industry collaboration. \"What the EV industry needs to do is engage the insurance sector on battery technology and repairability,\" he said, suggesting this could eventually result in more favourable premiums for consumers.\n\nEV charging ports are increasing in numbers across the country. Source: Supplied\n\nCharging infrastructure is broading across Australia\n\nWhen it comes to running costs, he also argues that EVs are proving cheaper to own and maintain than many Australians expect — especially for households with access to home charging and rooftop solar. Still, access to these cost-saving advantages isn't evenly distributed, particularly in regional areas.\n\nADVERTISEMENT\n\nRange anxiety continues to be a major concern, and while Australia now has more than 1,800 high-power charging locations, infrastructure reliability and coverage remain key issues. Maynard says more test drives and exposure to EVs are crucial in breaking down remaining hesitations.\n\n\"Education is crucial. Once you’ve experienced the convenience of home charging and the smooth, quiet performance of an EV, it’s hard to go back,\" he said.\n\n\"That’s before you consider the environmental and health benefits of making the switch. It’s crucial that we continue fighting misinformation around EVs and educating Australians about these benefits.\"\n\nDo you have a story tip? Email: newsroomau@yahoonews.com.\n\nYou can also follow us on Facebook, Instagram, TikTok, Twitter and YouTube.",
        "source": "Yahoo"
    }
]