[
  {
    "url": "https://www.9news.com.au/national/ai-at-work-policy-termination-exclusive-poll/428a1505-b2e9-45e8-918d-14cdbe630b8a",
    "title": "Aussie workers could risk losing their jobs with this AI blunder",
    "publish_date": "Tue, 10 Feb 2026 01:16:45 +0000",
    "category": "finance",
    "authors": [
      "Feb"
    ],
    "text": "Exclusive: Only one in three Australian workers know if their employer has an artificial intelligence use policy, let alone what it entails, according to a nine.com.au reader poll.﻿\n\nThat could cause major problems, including possible termination, for workers who are found to have used AI in a way that ﻿breaches their employer's AI use policy.\n\n\"Consequences will generally follow the same logic as any other workplace policy breach,\" Giuseppe Carabetta, an associate professor of workplace and business law at the University of Technology Sydney, told nine.com.au.\n\nAussie workers could be risking termination by using AI without knowing their employer's policy. (Nine/Getty)\n\n\"The Fair Work tribunal has upheld dismissals where employees breach data handling, privacy, social media, and information security policies.\"﻿\n\nOf the poll respondents who are currently employed, close to 20 per cent admitted they use AI at work at least daily.\n\nOf these people, nearly half admitted they rely on it multiple times a day.\n\nA futher 19 per cent said they use AI weekly, while more than 60 per cent said they never use AI on the job.﻿\n\nOf those who do use AI at work, the majority said they only use ChatGPT, Google Gemini, and other ﻿AI tools for minor tasks like writing emails and checking spelling.\n\nNearly one in three use AI to produce work like reports and presentations.\n\nAbout 10 per cent use it for other tasks like translating, researching, writing feedback, producing artwork and \"finding answers to questions asked by customers\".\n\nA little over 10 per cent admitted their employer is unaware of their AI use at work and 15 per cent are unsure if their boss knows they use AI.\n\nMore concerningly, only 32 per cent of Aussies who use AI at work actually know if their employer has an AI use policy and what it entails﻿.\n\n\"Even without a policy, an employer could still discipline an employee if AI use caused a privacy breach, disclosure of confidential information, reputational damage, or unsafe or discriminatory outcome,\" Carabetta said.\n\nIf there's no AI policy, workers ﻿can protect themselves in a few ways: never put confidential information into public AI tools; only ﻿use employer‑approved or 'secure' AI systems; and follow any other existing employer policies.\n\nIf in doubt, workers can also ask ﻿an authorised manager what AI use is permitted.\n\n\"If the worker knew the rules and ignored them, then even a first offence may justify termination,\" Carabetta said.\n\n\"Especially where confidentiality or client trust is undermined.\"\n\nThe nine.com.au poll, which runs once a fortnight, canvases the views of the Nine audience on 9Nation, which is an online community of our readers and viewers.\n\nHave you got a story? Contact reporter Maddison Leach at mleach@nine.com.au",
    "source": "9News",
    "cluster_id": 0
  },
  {
    "url": "https://www.9news.com.au/national/kangaroo-attack-man-left-with-horrific-injuries-in-north-east-victoria/f849471b-ea8e-471e-9612-53be0646dffe",
    "title": "Man left with horrific injuries after roo's 'gremlin hands' latched onto him",
    "publish_date": "Mon, 09 Feb 2026 23:30:00 +0000",
    "category": "finance",
    "authors": [
      "Feb"
    ],
    "text": "A man has been left with horrific injuries after he was attacked by a kangaroo while trying to save his dog in north-east Victoria .\n\nCol was having a few beers with his friend earlier this week when the pair heard barking down by the dam and knew \"something was wrong\".\n\n\"We drove across the paddock to the dam and ﻿the kangaroo was standing up trying to grab her,\" he said.\n\nCol was attacked by a kangaroo as he tried to save his dog. (3AW)\n\n\"﻿I got a stick and hit him with a stick.\n\n\"﻿He jumped into the dam and I flicked my dog off to my mate and said 'put her in the dog cage'.\"\n\nCol turned around to look at his dog then turned back around to look at the kangaroo.﻿\n\n\"He's come out of the water like a bloody rocket and headbutted me in the face, then punched the crap out of me,\" he said.\n\n\"When he came out, we've hit heads and I've gone onto my back.\n\n\"When I stood up, he's given me what I can describe as a flying roundhouse to the back.\n\n\"Then he's jumped on me and his little gremlin hands have grabbed my head.\n\n\"He wouldn't let go and he's just started booting the shit out of me.\"\n\nEPSTEIN FILES: Ghislaine Maxwell cites fifth Amendment as she declines to answer inquiry\n\nCol said the kangaroo started to growl and wouldn't take his hands off his head.\n\n\"He was really pretty well latched on,\" he said.\n\n\"Then my mate got a shovel and hit him with a shovel.\n\n\"I can't remember too much, it was really quick.\"\n\nCol said he was left with a lot of injuries for \"about 25 seconds of work\".\n\n\"I'm very lucky and if I hadn't have rolled onto my stomach I would've been in a lot worse of a way,\" he said.\n\n﻿\"They'v﻿e got a big tallon toe and he's got me through both sides of the stomach.\n\n\"The ultrasound said it went in about three inches.\n\n\"He embarassingly kicked me in the arse﻿ and I've got a big hole on the arse cheek.\"\n\nCol was taken to hospital in an ambulance and he spent about six hours in hospital.\n\nWildpro Pest Control managing director Alex Krstic described the situation as \"unusual\" on the kangaroo's part but \"certainly not outside of the realm of what they can do\".\n\n\"You've got to remember these things are wild animals and they'll behave like wild animals,\" Krstic said.\n\n\"They're very aggressive, especially when they're fighting with each other.\n\n\"﻿Col is lucky that when he did come close to it that it didn't use its large claw on its rear foot to disembowel him.",
    "source": "9News",
    "cluster_id": 1
  },
  {
    "url": "https://www.9news.com.au/world/venice-ferry-crash-rialto-bridge-italy/fb2bfd08-91f1-4bfc-9ac2-b82dbb7ec8aa",
    "title": "Tourists narrowly escape after malfunctioning ferry ploughs into gondolas",
    "publish_date": "Tue, 10 Feb 2026 00:31:53 +0000",
    "category": "finance",
    "authors": [
      "Feb"
    ],
    "text": "Several people have escaped serious injury after a ferry rammed into two gondolas in Venice , causing tourists to fall into the water around a famous tourist site.\n\nThe ferry, a regular service travelling to the city's airport and operated by Alilaguna, appeared to have suffered a mechanical fault, causing the driver to struggle to maintain control of the boat.\n\nAs a result, the boat ran into two gondolas, one of which was parked and one which had several tourists on board.\n\nThe malfunctioning ferry ploughed into two gondolas, forcing nine people to be rescued. (Nine)\n\nIt also scraped along the bridge and eventually came to a stop when it struck a pier and rammed into a building.\n\nLocal authorities, some of whom had been tracking the boat from behind when it was clear it was in trouble, rushed to the scene to rescue the passengers and offer aid.\n\nAuthorities raced to treat the passengers, some of whom had minor injuries. (Nine)\n\nNine people had to be rescued from the cold waters and were treated for minor injuries and hypothermia, according to reports.\n\nNo major injuries were reported.\n\nEPSTEIN FILES: Ghislaine Maxwell cites fifth Amendment as she declines to answer inquiry\n\nThe president of the company who ran the vessel insisted the age of the ferry was not a factor. (Nine)\n\nAlilunga President Fabio Sacco claimed the boat had been taken away to be investigated, but said the vessel's age was not a factor in the crash, and apologised to the gondoliers who lost their boats and others impacted by the accident.\n\n\"That launch is one of the last vessels we purchased, it's at most a year old\", he told Il Gazzettino.\n\n\"We are deeply sorry for what happened… we are heartbroken for the tourists who were in the water and whose vacations were ruined.\n\n\"The only comfort we have is the thought that none of them were seriously injured.\"",
    "source": "9News",
    "cluster_id": 2
  },
  {
    "url": "https://www.9news.com.au/world/donald-trump-paedophile-protector-ford-worker-factory-usa-news-update/243f734d-e827-4434-b693-7e105c881f49",
    "title": "Surprise fate for worker who called Trump a 'paedophile protector'",
    "publish_date": "Tue, 10 Feb 2026 00:21:27 +0000",
    "category": "finance",
    "authors": [
      "Feb"
    ],
    "text": "A factory worker who called Donald Trump a \"paedophile protector\" as the president was touring the facility has kept his job.\n\nTJ Sabula was suspended with pay after the confrontation, where the president stuck up his middle finger and appeared to mouth the words \"f--- you\" at him.\n\nBut a top union official has confirmed Sabula will not lose his job and \"has no discipline on his record\".\n\nDonald Trump pointed at and appeared to swear at a factory worker who called him a \"paedophile protector\". (Supplied)\n\n\"TJ, we got your back,\" United Auto Workers Vice President Laura Dickerson said.\n\n\"As UAW members, we speak truth to power. We don't just protect our rights, we exercise them.\n\n\"This ain't The Apprentice .\"\n\nAfter Sabula was suspended with pay, a GoFundMe account raised $US330,220 ($465,000) for him in just two days.\n\nA second account raised $US480,000 ($677,000).\n\nSabula is working at a Ford factory in Detroit.\n\nTrump had visited the factory as part of a visit to the city in January.\n\nREAD MORE: Clintons make a deal that could keep them out of prison\n\nTJ Sabula said he had no regrets after heckling Donald Trump. (GoFundMe)\n\nFord has not commented on Sabula's reinstatement.\n\nSabula said on the day he had \"no regrets whatsoever\".\n\n\"I don't feel as though fate looks upon you often, and when it does, you better be ready to seize the opportunity,\" Sabula told the Washington Post .\n\n\"And today I think I did that.\"\n\nFord issued a statement which did not go into specifics about the exchange.\n\n\"One of our core values is respect, and we don't condone anyone saying anything inappropriate like that within our facilities,\" the auto giant's statement read.\n\n\"When that happens, we have a process to deal with it, but we don't get into specific personnel matters.\"\n\nDonald Trump flashed his middle finger at the heckler. (Supplied)\n\nWhite House Communications Director Steven Cheung responded with a statement to TMZ.\n\n\"A lunatic was wildly screaming expletives in a complete fit of rage, and the president gave an appropriate and unambiguous response,\" Cheung said.\n\nTrump has been criticised for his connection to child sex traffickers Jeffrey Epstein and Ghislaine Maxwell .\n\nThe president was a long-time friend of both, and has obstructed efforts to disclose files gathered from a Department of Justice investigation into the two.\n\nTrump called the investigation a \"Democratic hoax\".\n\nNone of Epstein's victims have implicated Trump in any criminal behaviour.",
    "source": "9News",
    "cluster_id": 3
  },
  {
    "url": "https://www.9news.com.au/national/holly-bowles-bianca-jones-laos-methanol-poisoning-dfat-apology/946050b7-def7-4fd3-a037-12baca46176f",
    "title": "DFAT 'apologises unreservedly' to families of methanol poisoning victims",
    "publish_date": "Tue, 10 Feb 2026 00:27:06 +0000",
    "category": "finance",
    "authors": [
      "Feb"
    ],
    "text": "The accused were charged late last month for destroying evidence, with those verdicts relating to the death of a\n\nUS\n\ncitizen who also drank the tainted alcohol at the hostel.",
    "source": "9News",
    "cluster_id": 4
  },
  {
    "url": "https://www.9news.com.au/national/naomi-and-dan-not-so-grey-nomads-sold-house-in-sydney-to-live-on-road-with-three-kids/fa2ec527-99b7-4e6b-a161-d22627066385",
    "title": "Sydney couple sold house, quit their jobs after feeling 'trapped' in rat race",
    "publish_date": "Mon, 09 Feb 2026 18:38:04 +0000",
    "category": "finance",
    "authors": [
      "Feb"
    ],
    "text": "O﻿n the surface, it looked like Dan and Naomi Toohey had it all.\n\nThe couple had bought and renovated the \"perfect house\" on Sydney's pristine Northern Beaches, they worked well-paying jobs and were raising three beautiful children.﻿\n\nBut something was missing from their lives.\n\nDan and Naomi Toohey decided to take their three kids on a \"dream\" trip around Australia. (Supplied)\n\nDo you have a story? Contact reporter April Glover at april.glover@nine.com.au\n\n\"W﻿e had all the stuff, the house, all the vehicles. Life was good,\" Dan told nine.com.au .\n\n\"But the kids were saying to us... We miss you guys. You're always at work.\n\n\"We never see you.\"\n\nThe hamster wheel of working six days per week to pay the mortgage had taken its toll.\n\nAfter 27 years in the NSW capital, the couple were officially \"burnt out\".﻿\n\nDan and Naomi, aged in their 40s, knew it was time to abandon the rat race.\n\n\"﻿I came home one day and said to Naomi, 'I can't do this anymore',\" Dan, who ran his own electrician business, said.\n\n\"I got to the point where I felt trapped.\"﻿\n\nHe had been quietly harbouring a dream ﻿of leaving Sydney behind to travel the country in a campervan full-time.\n\nAll he needed to do was convince his wife that it was the right move for their kids.\n\nIt was an easy sell for Naomi, a midwife, who also worked long hours.﻿\n\n\"I just said, 'Let's do it',\" Naomi recalled.﻿\n\n\"She could see that I was struggling,\" Dan added.\n\n\"She could see the burnout.\"\n\nThe couple sold their home and bought a caravan to embark on a big lap of the country. (Supplied)\n\n﻿Just two months later, the family-of-five had sold their home, put most of their belongings in storage and bought a caravan.\n\n\"Everything just started falling into place for us,\" Dan said.\n\n\"It all happened very quickly, within eight weeks we left Sydney. But we felt like we were making the right decision.\"\n\nThe couple set off on what was originally a 12-month lap around Australia with their children, ﻿aged 11, nine and three.\n\nThey joined a growing club of full-time young travellers known as the \"not so grey\" nomads.﻿\n\nThe proceeds from their house sale were more than enough to pay for petrol, food, campsite fees and experiences.\n\n\"We are definitely spending a lot less than we were back in Sydney,\" Dan added.\n\nMeanwhile, the children kept up with their schooling by using distance education.\n\n﻿\"The first few months were tough,\" Dan said.\n\n\"We did rip their lives from underneath them without any warning.\"\n\nDan and Naomi, aged in their 40s, knew it was time to abandon the rat race. (Supplied)\n\nThankfully, children are adaptable and the Tooheys have settled into a routine of full-time travel – if you can call it a routine.\n\nIn the past year, the family have ticked off every bucket list item on the 15,000km \"big lap\" of Australia.\n\nSome of their highlights have been Ningaloo Reef in WA, Cape York in Far North Queensland and Kimberley region.\n\n\"The kids are learning so much more on the road than they would in a classroom,\" Naomi said.\n\n\"On a Tuesday at midday, my daughter and I were snorkelling in South Leyfroy Bay, and there's all these turtles swimming around us, starfish on the seafloor.\n\n\"I remember looking at her and saying, 'All your friends at the moment are in a classroom looking out the window, wishing they were doing what we're doing'.\"\n\nThe cherry on top of their blissful travels has been reconnecting as a family.\n\n﻿Dan and Naomi both agree: their relationship is stronger, and so is their bond with their children.\n\nIn the past year, the family have ticked off every bucket list item on the 15,000km \"big lap\" of Australia. (Supplied)\n\nREAD MORE: ﻿ Frantic dual citizens scramble to order passports amid major change\n\nThe plan was to settle down somewhere in Australia after one year of exploring the country.\n\nBut the Tooheys have caught the \"travel bug\".﻿\n\n\"At this stage, we're committing to travelling to the end of this year. But it might keep going,\" Dan said.\n\n\"Who knows where we'd end up? We're leaving things quite open.\"﻿\n\nThere is one condition: that they don't end up back in Sydney.\n\nThe couple recently bought a property sight-unseen in Noosa, which could be their next home.﻿\n\n﻿\"You could not pay me to go back to Sydney,\" Dan laughed.\n\n\"It's not the right place for us.\"\n\n﻿The Tooheys acknowledge their decision to leave it all behind was a risk.\n\nIn their opinion, it has paid off exponentially. ﻿\n\n\"The majority of people have said to us, 'You're living our dream, but we're just not that brave',\" Naomi said.",
    "source": "9News",
    "cluster_id": 5
  },
  {
    "url": "https://www.abc.net.au/news/2026-02-10/winter-olympics-2026-daily-guide-day-4matt-graham-jakara-anthony/106320694",
    "title": "Winter Olympics 2026 quick guide: What to watch",
    "publish_date": "Tue, 10 Feb 2026 02:19:55 +0000",
    "category": "sports",
    "authors": [],
    "text": "What's on?\n\n2018 silver medallist Matt Graham — plus fellow Aussies Cooper Woods , Jackson Harvey and George Murphy — in the men's freestyle skiing moguls qualifying from 9:15pm AEDT , and 2022 champion Jakara Anthony alongside Charlotte Wilson and Emma Bosco from 12:15am AEDT.\n\n— plus fellow Aussies , and — in the men's freestyle skiing moguls qualifying , and 2022 champion alongside and from The men's and women's cross-country skiing finals from 9:45pm AEDT .\n\nfinals from . Stay up til 11:30pm AEDT to see skiing with guns in the biathlon,which includes a freestyle cross-country skiing race followed by rifle shooting rounds.\n\nStay across the action\n\nGet the latest: Winter Olympics day three: Aussies miss medals in big air final Stay across the highs and lows of the Games with the ABC Sport Daily podcast and ABC Sport.\n\nOtherwise you can stream the Games live on 9Now or Stan Sport.\n\nGive me more",
    "source": "ABC",
    "cluster_id": 6
  },
  {
    "url": "https://www.abc.net.au/news/2026-02-10/sport-winter-olympics-qhs-day-three-jake-paul-steven-bradbury/106324398",
    "title": "Quick hits: Emotional helmets and hakas as Bradbury clips Paul",
    "publish_date": "Tue, 10 Feb 2026 01:08:39 +0000",
    "category": "sports",
    "authors": [],
    "text": "Steven Bradbury hits Jake Paul with a drive-by as he celebrates Jutta Leerdam's Olympic gold, while a Sydney-born Kiwi receives a special celebration.\n\nHere are the quick hits from the Winter Olympics.\n\n1. Heraskevych's helmet\n\nUkranian skeleton athlete Heraskevych wore a helmet depicting athletes killed in the Russia-Ukraine war. (Getty Images: Andrew Milligan/PA Images)\n\nAt the 2022 Games in Beijing, days before Russia's invasion of Ukraine, Ukrainian skeleton athlete Vladyslav Heraskevych held up a sign that read \"No War in Ukraine\".\n\nFour years later, Heraskevych began his campaign in Italy wearing a helmet depicting some of the Ukrainian athletes killed since then.\n\nReuters reported that some of the athletes included on the helmet were \"weightlifter Alina Perehudova, boxer Pavlo Ishchenko, ice hockey player Oleksiy Loginov, actor and athlete Ivan Kononenko, diving athlete and coach Mykyta Kozubenko, shooter Oleksiy Habarov and dancer Daria Kurdel.\"\n\nHeraskevych told Reuters the Olympic Committee had contacted the Ukrainian team about the helmet, with the Olympic Charter outlawing any \"kind of demonstration or political, religious or racial propaganda\".\n\n\"It's still being processed,\" he said to the agency.\n\n2. 'Really special' haka for silver medallist\n\nZoi Sadowski-Synnott's supporters performed a haka for her after her big air silver. (Reuters: Hannah Mckay)\n\nZoi Sadowski-Synnott just missed out on adding gold to her snowboard big air bronze and silvers from 2018 and 2022, settling for another silver behind Japan's Kokomo Murase.\n\nThe Sydney-born New Zealand rider, who won gold in slopestyle in 2022, celebrated her silver medal and received an extra honour from the whole team on the mountain.\n\n\"I didn't know that was happening,\" she said.\n\n\"I just went and saw my family, and then turned around, and the whole team was performing a haka for me, and it was really special. It meant a lot to me.\n\n\"I feel very honoured to have carried the New Zealand flag in the Opening Ceremony and to represent my country, New Zealand, Aotearoa.\n\n\"My whole family's out there. All of my teammates' families are out here. It's really special to have the support from everyone and to share this experience and enjoy the Olympics and the spirit.\"\n\n3. Bradbury's dig at Jake Paul\n\nPaul was overcome with joy as fiancee Leerdam claimed speed skating gold with an Olympic record. (Getty Images)\n\nWith more than 5 million followers on Instagram, Jutta Leerdam is a legitimate speed skating superstar.\n\nAnd she was electric on day three in Italy, claiming gold in the women's 1,000 metres with an Olympic record time of 1:12.31.\n\nBut outside of winter sport circles, she is also renowned as the fiancee of YouTuber-turned-boxer Jake Paul, who was in attendance as Leerdam broke new ground in Milan.\n\nAnd Paul was overcome with emotion as Leerdam flew towards glory, cheering and sobbing in a video he posted to Instagram, the caption reading \"MY BABY JUST SET THE OLYMPIC RECORD.\"\n\nLoading Instagram content\n\nThe couple is well known for supporting each other's sporting endeavours — but, on commentary for Channel Nine, Australian Winter Olympic great Steven Bradbury was in no doubt about who was the more talented of the pair.\n\n\"I reckon she's a better skater than he is a boxer,\" Bradbury said.\n\n4. Skeleton power couple go head-to-head\n\nSilveira (left) and Meylemans make up the power couple of world skeleton. (Getty Images: Robert Michael/picture alliance)\n\nRanked first and ninth in the world, Belgium's Kim Meylemans and Brazil's Nicole Silveira are two of the world's finest skeleton athletes.\n\nThey also happen to be married.\n\nOn day three, the couple went head-to-head in the official training for the event, with Meylemans finishing in eighth and claiming spousal bragging rights.\n\nThe pair were already together when they competed at Beijing 2022, but this is their first Games as a married couple, having tied the knot in 2025.\n\nIn an Instagram post celebrating their wedding, Meylemans wrote that competing together in Italy, where same-sex marriage was not allowed, would be a golden opportunity to \"shine a light on marriage equality\".\n\nLoading Instagram content\n\n5. Sharing is caring\n\nBefore today, there had been a total of 30 \"shared\" medals in the history of the Winter Olympics.\n\nBy the end of it, that number had risen to 32.\n\nIn the men's team alpine skiing, the Austrian pair of Vincent Kriechmayr and Manuel Feller combined for a time of 2:45:03, exactly the same figure as Swiss duo Marco Odermatt and Loïc Meillard.\n\nThat meant that, after 170 gates and 4,000 metres, both teams received silver medals, with the bronze not being awarded.\n\nThe second step on the podium got quite crowded. (Getty Images: Image Photo Agency)\n\nAnd only a matter of hours after that, lightning had struck twice, with Japan's Ren Nikaido and Switzerland's Gregor Deschwanden both finishing with 266 points in the men's normal hill ski jumping to share the third step of the podium.\n\nBefore today, the last shared medals came in 2018, with Canada and Germany uniting for two-man bobsleigh gold and Norway's Marit Bjørgen and Finland's Krista Pärmäkoski sharing bronze in the women's cross country skiing.",
    "source": "ABC",
    "cluster_id": 7
  },
  {
    "url": "https://www.abc.net.au/news/2026-02-10/rockhampton-hosting-2032-brisbane-olympic-rowing-canoeing/106325194",
    "title": "Olympic rowing backed in crocodile-inhabited river amid 'nonsense' talk of shift",
    "publish_date": "Tue, 10 Feb 2026 01:03:55 +0000",
    "category": "sports",
    "authors": [],
    "text": "The Queensland government has emphatically declared a crocodile-inhabited river prone to flooding will host Olympic rowing and canoeing events in 2032.\n\nIt comes amid reports the two Brisbane 2032 Olympic sports will be moved away from central Queensland's Fitzroy River in Rockhampton to the state's south-east.\n\n\"Rowing will be in Rockhampton, as per the 2032 Delivery Plan,\" Olympics Minister Tim Mander told the ABC on Tuesday.\n\nThe 2032 Brisbane Olympic Games rowing and canoeing events will be held in Rockhampton. (AAP via Photosport: Iain McGregor)\n\nThe river was a controversial choice of venue when it was announced last year, with Premier David Crisafulli declaring Brisbane 2032 would be \"a Queensland Games for all of Queensland\".\n\nHowever, World Rowing and the International Canoe Federation (ICF) are yet to sign off on the venue due to the waterway not meeting the technical specifications for international competition.\n\nAs Queensland Parliament resumes, Mr Mander and member for Rockhampton Donna Kirkland said they would provide an update during sittings on Tuesday.\n\nThe Fitzroy River rowing course has been the subject of independent and international testing. (Supplied: Rockhampton Fitzroy Rowing Club)\n\nMs Kirkland said speculation that Olympic officials were looking to shift rowing and canoeing events away from the city was \"nonsense\".\n\n\"Rockhampton will proudly host Olympic and Paralympic rowing on the Fitzroy River as outlined in the 2032 Delivery Plan,\" Ms Kirkland said.\n\n\" We are getting on with the job of delivering a remarkable event that showcases our region to the world and leaves a lasting legacy for growth. \"\n\nDavid Crisafulli has reassured the public that Rockhampton will host Olympic rowing. (Supplied: Rockhampton Grammar School)\n\nGames for the regions\n\nIn October the Rockhampton venue passed initial testing by the state's Games Independent Infrastructure and Coordination Authority (GICCA).\n\nBut in a signed joint statement supplied to the ABC, World Rowing president Jean-Christophe Rolland and ICF president Thomas Konietzko said the groups were not ready to give the go-ahead for the Fitzroy and were committed to ensuring \"fair and safe competition\".\n\nPremier David Crisafulli has previously said funding would be pumped into regional areas to help support legacy venues for the 2032 Olympics.\n\n\"It had been recommended to move the [rowing] event to Sydney, but I believe there is a legacy play and we must grab that,\" he said.\n\nMembers of Australian men's rowing four team train during a training session at the Tokyo Olympics. (AP: Lee Jin-man)\n\nThe site has been used as a staging camp for major events for the Australian rowing team, including before the 2020 Tokyo Olympics.\n\nIn February, World Rowing and ICF officials toured Rockhampton with members of the 2032 Organising Committee while the river was in flood.\n\nDeputy Premier Jarrod Bleijie said rowing officials walked away impressed with the region's potential.\n\nHe reiterated the state government would not change its position on hosting events in Rockhampton and other regional venues.",
    "source": "ABC",
    "cluster_id": 8
  },
  {
    "url": "https://www.abc.net.au/news/2026-02-10/broken-hill-artist-exhibits-in-japan-fujii-kaze-jpop-star/106304746",
    "title": "Outback artist finds fame in Japan thanks to tote bag and J-pop star",
    "publish_date": "Tue, 10 Feb 2026 00:07:18 +0000",
    "category": "finance",
    "authors": [],
    "text": "Jason McCarthur remembers the first time he received an email with a request to purchase one of his Broken Hill tote bags.\n\nIt was late 2024, and the email seemed odd.\n\nFor one, the sender appeared to be overseas and, secondly, McCarthur received another almost identical email about half an hour later.\n\nHe presumed it was a scam, until more enquiries arrived in his inbox about the tote bags.\n\nSoon, he had sold out of the bags so he ordered 100 more. A day later, those too had all sold out and he had 30 pre-orders for more.\n\nBut it did not stop there.\n\nJason McCarthur sells his artwork on magnets and tote bags. (ABC Broken Hill: Coquohalla Connor)\n\nUnbeknownst to McCarthur, Japanese pop star Fujii Kaze had been spotted in a documentary with one of the Broken Hill artist's designs on a tote bag.\n\nSuddenly thousands of Kaze's fans turned their attention to the outback artist living 7,000 kilometres away.\n\nMcCarthur's brush with fame led to him having an exhibition in Tokyo earlier this year.\n\nIt started with a tote bag\n\nJ-pop singer/songwriter Fujii Kaze had been in McCarthur's home town of Broken Hill filming a music video for his song Hana, which was released in November 2023 and has more than 71 million views on YouTube.\n\nDuring production the multi-award-winning artist's production team ventured into the city to collect supplies and souvenirs, stopping in at McCarthur's shop on Argent Street.\n\n\"They came in and I had a bit of a chat with one of the fellas, but you wouldn't have thought they were any different to anyone else,\" said McCarthur, who sells souvenirs, crystals and artworks.\n\nAmong the team's purchases was a tote bag with one of McCarthur's cityscapes on it.\n\nFujii Kaze's production team purchased a Broken Hill tote from Jason McCarthur. (ABC Broken Hill: Coquohalla Connor)\n\nMonths later Kaze was spotted with the tote bag in a documentary.\n\nThe documentary was only released in Japan so McCarthur was completely unaware of it when he started receiving messages from eager fans wanting the same tote.\n\n\"It was so random, and I thought it was spam … I thought someone had taken the mickey out of me,\" he said.\n\n\"I said to my wife, 'What do we do?' Like, I didn't know what the hell was going on.\n\n\"We were driving the post ladies batty.\"\n\nMcCarthur believes he has sold more than 15,000 bags since then.\n\nOpportunity comes knocking\n\nThe demand for the totes led McCarthur to make contact with a reseller in Japan, one of the first people who initially reached out to purchase the bag, a woman named Hiroko Yasutomi.\n\nThe pair became fast friends and got talking about future plans.\n\n\"I said to Hiroko that I had always dreamt of having an exhibition overseas, and she said she'd look into it.\"\n\nTo McCarthur's shock, Ms Hiroko delivered on her promise and she found a gallery cafe in Shibuya, central Tokyo, that was interested in showing his work.\n\nJason McCarthur with his family and friends at his exhibition in Tokyo. (Supplied: Jason McCarthur)\n\n\"We had to fund everything ourselves, [but] we took the risk on,\" McCarthur said.\n\n\"Up until this point it was never something on our mind to go to Japan.\"\n\nJason McCarthur was overwhelmed by the hospitality he received in Japan. (Supplied: Jason McCarthur)\n\nIn early January, McCarthur and his wife Amy, along with their two daughters, travelled to Japan to make his dream a reality.\n\n\"I had one lady cry after having a photo with me and she said, 'I'm OK, but I'm overwhelmed from meeting you', and I thought, 'I'm Jason McCarthur from Broken Hill, I'm no celebrity.'\"\n\nThe artist said he was now planning to set up a website for his business where he could sell his art online.\n\nOpen door policy\n\nMcCarthur's souvenir shop on Broken Hill's main drag is more than a store; it's also where he paints.\n\nWith a full-time business and two teenage daughters, it is often the only place he can get his artwork done.\n\n\"It might take a few days [to complete a painting] depending on how busy the shop is,\" he said.\n\nWith a busy home life, Jason McCarthur often paints at work when he has the time. (ABC Broken Hill: Coquohalla Connor)\n\nMuch of his art is inspired by the outback.\n\n\"I love painting colour and painting stories; if I see something that I like I'll have a go at it. Anything from football to flowers to the landscape, I'll have a go.\"\n\nArt has also provided him with an outlet when times get tough with his mental health.\n\nWellbeing is something McCarthur takes very seriously and it has led to him having an \"open door\" policy for anyone who needs a chat.\n\nJason McCarthur says his door is open for anyone who needs a chat. (ABC Broken Hill: Coquohalla Connor)\n\n\"[Sometimes] you're smashing your head against a brick wall, every turn seems to be another hurdle to cross and you find that you're not winning, but when you don't have people around you it's harder to see that rainbow at the end of the tunnel,\" he said.\n\n\"I tell people that if this door is open, then I'm happy to talk to them.\"",
    "source": "ABC",
    "cluster_id": 9
  },
  {
    "url": "https://www.abc.net.au/news/2026-02-10/winter-olympics-medals-breaking-breezy-johnson-alysa-liu/106325112",
    "title": "Flimsy Olympic medals prompt warning to celebrating athletes",
    "publish_date": "Mon, 09 Feb 2026 22:51:25 +0000",
    "category": "sports",
    "authors": [],
    "text": "Winter Olympics organisers are urgently looking into the apparently flimsy Milano Cortina medals after at least four athletes had their awards fall apart in the first three days of competition.\n\nAndrea Francisi, the chief operations officer for the organising committee, said it was working on a solution.\n\n\"We are aware of the situation, we have seen the images. Obviously, we are trying to understand in detail if there is a problem,\" Francisi said.\n\nGet the latest: Winter Olympics day three: Aussies miss medals in big air final Stay across the highs and lows of the Games with the ABC Sport Daily podcast and ABC Sport.\n\n\"But obviously we are paying maximum attention to this matter, as the medal is the dream of the athletes, so we want that obviously in the moment they are given it that everything is absolutely perfect because we really consider it to be the most important moment. So we are working on it.\"\n\nWomen's downhill gold medallist Breezy Johnson was one of the first to unintentionally test the medals to breaking point.\n\nShe was jumping for joy when the medal came detached from the ribbon around her neck.\n\nBreezy Johnson's medal came unstuck from its ribbon during her zealous celebration. (Getty Images: Andrew Milligan/PA Images)\n\n\"Don't jump in them,\" the American warned silver medallist Emma Aicher of Germany.\n\nDuring their post-race press conference, Johnson showed a gobsmacked Aicher the aftermath of her celebration, before revealing to reporters the various bits and pieces that led to the critical fault.\n\n\"I was jumping in excitement, and it broke,\" she said, holding up the medal, the ribbon and the pin that was supposed to keep the whole thing together.\n\nWhat happens when there's a tie for a medal? In the men's team combined Alpine skiing event at the 2026 Winter Olympics, the Swiss and Austrian teams tied for silver. So what happens to the bronze medal? And when there was a tie for bronze in the men's ski jumping, was there a spare bronze?\n\n\"It came apart. I'm sure somebody will fix it. It's not crazy broken, but it's a little broken.\"\n\nTV footage broadcast in Germany captured the moment biathlete Justus Strelow realised his mixed relay bronze had fallen off the ribbon around his neck and clattered to the floor as he danced along to a song with teammates.\n\n\"Hey Olympics, what's up with those medals?\" the German biathlon team posted on Instagram.\n\n\"Are they not meant to be celebrated?\"\n\nJustus Strelow's German biathlon teammates laughed as his bronze medal snapped off its ribbon. (Instagram: dsv_biathlon)\n\nHis German teammates cheered and laughed as Strelow tried without success to reattach the medal before realising the smaller piece had broken off and was still on the floor.\n\nUS figure skater Alysa Liu posted a clip on social media of her team event gold medal, detached from its official ribbon.\n\n\"My medal don't need the ribbon,\" Liu wrote.\n\nWomen's 10km + 10km skiathlon silver medallist Ebba Andersson also had the same thing happen as she was running across the snow with teammate and gold medallist Frida Karlsson after their medal ceremony.\n\n\"That did not go completely according to plan. It's in two pieces, with one of our coaches, right now,\" she said.\n\n\"One of the three pieces that made up the medal fell off. After a lot of faffing about, we let that piece be. It was a small pin that secured the medal in its pendant.\n\n\"I don't know if the medal is made to hang around your neck when you're running across half of the home straight, and also doing it at the speed of Frida Karlsson. I was a bit stupid trying to follow her.\"\n\nIt is not the first time the quality of Olympic medals has come under scrutiny.\n\nFollowing the 2024 Summer Olympics in Paris, some medals had to be replaced after athletes complained they were starting to tarnish or corrode, giving them a mottled look likened to crocodile skin.\n\nThe ABC of SPORT Sports content to make you think... or allow you not to. A newsletter delivered each Saturday.\n\nABC/AP",
    "source": "ABC",
    "cluster_id": 10
  },
  {
    "url": "https://www.abc.net.au/news/2026-02-10/lindsey-vonn-tibia-fracture-multiple-surgeries-winter-olympics/106325232",
    "title": "Vonn set for multiple surgeries but denies torn ACL contributed to crash",
    "publish_date": "Mon, 09 Feb 2026 22:18:04 +0000",
    "category": "sports",
    "authors": [],
    "text": "American ski great Lindsey Vonn will \"require multiple surgeries\" after sustaining a tibia fracture, but denies that her previously ruptured ACL was the cause of the crash that ended her Winter Olympic Games.\n\nThe 41-year-old's Olympic career ended with a horror crash at the Milano Cortina Games on Sunday.\n\nGet the latest: Winter Olympics day three: Aussies miss medals in big air final Stay across the highs and lows of the Games with the ABC Sport Daily podcast and ABC Sport.\n\nJust 13 seconds into her downhill run, Vonn, the 2010 Olympic downhill champion, clipped a gate on the Olimpia delle Tofane and went down.\n\nVonn was airlifted to hospital as fans, along with fellow competitors, winced at replays of the nasty fall.\n\nOn Tuesday, AEDT, Vonn took to social media to confirm she had suffered a fractured tibia and would need to go through an extensive recovery.\n\n\"Unfortunately, I sustained a complex tibia fracture that is currently stable but will require multiple surgeries to fix properly,\" Vonn said in a statement on social media.\n\nLoading Instagram content\n\nVonn's participation in the Games was contentious, after the US star ruptured the ACL in her right knee at the Crans Montana World Cup in Switzerland just nine days earlier.\n\nBut Vonn vowed to compete despite the significant injury, trying to cap off a remarkable career comeback with an Olympic medal.\n\nRivals heap praise on 'idol' Vonn after crash Lindsey Vonn's 2026 Winter Olympic Games ended in disaster, but her teammates and rivals have heaped praise on the three-time Olympic medallist.\n\nDespite competing injured, Vonn declared her ruptured ACL did not contribute to the horror crash that ended her Olympic Games prematurely.\n\n\"I was simply 5 inches too tight on my line when my right arm hooked inside of the gate, twisting me, and resulted in my crash,\" she said.\n\n\"My ACL and past injuries had nothing to do with my crash whatsoever.\"\n\nAfter retiring in 2019, Vonn ended her six-year hiatus in 2025 to return to competitive skiing.\n\nHer comeback was a magnificent success, with the American winning three World Cup events, along with a further four podium placings across downhill and Super G events.\n\nVonn entered this year's Games ranked number one in downhill and third in Super G, hoping to cap off her remarkable comeback with an Olympic medal.\n\nThose dreams were dashed in a painful way, but Vonn said she has no regrets about competing in Italy.\n\n\"While yesterday did not end the way I had hoped, and despite the intense physical pain it caused, I have no regrets,\" she said.\n\n\"Standing in the starting gate yesterday was an incredible feeling that I will never forget. Knowing I stood there having a chance to win was a victory in and of itself. I also knew that racing was a risk.\n\n\"It always was and always will be an incredibly dangerous sport.\n\n\"And similar to ski racing, we take risks in life. We dream. We love. We jump. And sometimes we fall. Sometimes our hearts are broken. Sometimes we don't achieve the dreams we know we could have. But that is also the beauty of life; we can try.\n\n\"I tried. I dreamt. I jumped.\"",
    "source": "ABC",
    "cluster_id": 11
  },
  {
    "url": "https://www.abc.net.au/news/2026-02-10/catherine-ohara-cause-of-death-announced/106324996",
    "title": "Blood clot revealed as cause of Catherine O'Hara's death",
    "publish_date": "Mon, 09 Feb 2026 21:58:51 +0000",
    "category": "entertainment",
    "authors": [],
    "text": "Actor Catherine O'Hara died from a pulmonary embolism with cancer as the underlying cause, according to her death certificate.\n\nThe certificate, released on Monday, local time, lists the pulmonary embolism, which occurs when a blood clot blocks an artery in the lungs, as the immediate cause of the actor's death at age 71.\n\nRectal cancer was the long-term cause.\n\nThe oncologist who signed off on the certificate indicated that he had been treating O'Hara since March of last year and last saw her a few days before she died at a Californian hospital.\n\nCatherine O'Hara from Home Alone and Schitt's Creek dies The Canadian-born actress died at her home in Los Angeles at the age of 71 \"following a brief illness\", according to a statement from her agency.\n\nWhat is a pulmonary embolism?\n\nA pulmonary embolism is a blood clot that blocks an artery in the lung and stops blood flow.\n\nCommonly, the blood clot forms in a deep vein in another part of the body and travels to the lung.\n\nSymptoms can include shortness of breath, chest pain and fainting.\n\nThe Canadian-born comic actor starred as Macaulay Culkin's mother in two Home Alone movies and won an Emmy as the dramatically oblivious formerly wealthy matriarch Moira Rose in Schitt's Creek.\n\nHer death was a surprise to most, and an initial statement from her representatives said only that she died \"following a brief illness\".\n\nCollaborators including Culkin, Christopher Guest, Eugene Levy and Pedro Pascal paid her loving tributes after her death.\n\nLoading Instagram content\n\nO'Hara grew up in Toronto as the sixth of seven children.\n\nShe began her acting career in 1974 as a cast member of the improvisational theatre troupe The Second City.\n\nTwo years later, the troupe created the sketch comedy television show SCTV, which often featured O'Hara's performances.\n\nShe offered her voice for numerous animated projects, including Sally in The Nightmare Before Christmas, Pinktail in The Wild Robot, Brook Ripple in Elemental and multiple voices in Frankenweenie, including Mrs Frankenstein.\n\nMore recently, she joined the cast of Seth Rogen's 2025 Hollywood satire series The Studio as Patty Leigh, the fired head of a Hollywood film studio.\n\nO'Hara is survived by her husband, Bo Welch, whom she met in 1987 on the set of Beetlejuice, and their two sons.\n\nAP/Reuters",
    "source": "ABC",
    "cluster_id": 12
  },
  {
    "url": "https://www.abc.net.au/news/2026-02-10/savannah-guthrie-makes-new-video-plea-over-missing-mother/106325066",
    "title": "Savannah Guthrie releases latest video plea for missing mother",
    "publish_date": "Mon, 09 Feb 2026 21:35:30 +0000",
    "category": "finance",
    "authors": [],
    "text": "US television personality Savannah Guthrie says her family is at the \"hour of desperation\" in the search for her kidnapped mother, Nancy Guthrie.\n\nThe Today show host made no mention of a possible ransom payment in a new video released just hours before a ransom deadline.\n\nThe video did not mention the deadline, saying her family still believed their 84-year-old mother was out there.\n\nThe FBI said it was not aware of any continued communication between Savannah Guthrie’s family and suspected kidnappers.\n\nThe FBI has also not identified any suspects or persons of interest in the woman's disappearance, said an FBI spokesperson.\n\nLoading Instagram content\n\nThe mysterious disappearance and search has riveted the US, from President Donald Trump — who spoke with the presenter last week — to online sleuths who have flooded social media with theories.\n\nMultiple press outlets have received alleged ransom letters during the past week.\n\nAt least one letter made monetary demands and set deadlines for payment.\n\nThe first deadline passed last Thursday, but a second one was set for Monday, local time.\n\nLaw enforcement officials declined to confirm the credibility of the letters but said all tips were being taken seriously.\n\nSavannah Guthrie says she will pay ransom for return of her mother In a video posted to Instagram, the host of NBC's Today Show appears to directly address her mother's kidnappers, telling them she and her siblings have \"received your message, and we understand\".\n\nInvestigators returned to Nancy Guthrie's Arizona neighbourhood several times over the weekend, ahead of a Monday-evening deadline set by her purported abductors.\n\nGuthrie said over the weekend that the family was prepared to pay for her mother's return.\n\n\"We beg you now to return our mother to us so that we can celebrate with her,\" she said in a video.\n\n\" This is the only way we will have peace. This is very valuable to us, and we will pay. \"\n\nAuthorities believe Nancy Guthrie was taken against her will from her home just outside Tucson.\n\nShe was last seen there on January 31 and reported missing the next day after not attending church services.\n\nLoading...\n\nDNA tests showed blood on Guthrie's front porch was a match to her, and her doorbell camera was disconnected in the early hours of Sunday morning, Pima County Sheriff Chris Nanos has said.\n\nDetectives and agents carried out follow-up work at multiple locations over the weekend as part of the investigation, the Pima County Sheriff's Department said on Sunday.\n\n\"Investigators have not identified any suspects, persons of interest, or vehicles connected to this case,\" the department said.\n\nInvestigators on Saturday were inside daughter Annie Guthrie's home, about 6 kilometres from Nancy Guthrie's house.\n\nOn Sunday, an investigator was seen using a pole to search an underground tank behind Nancy Guthrie's home.\n\nAuthorities say they have growing concerns about Nancy Guthrie's health because she needs daily medication.\n\nAP",
    "source": "ABC",
    "cluster_id": 13
  },
  {
    "url": "https://www.abc.net.au/news/2026-02-10/jake-waterman-chris-waterman-relishing-state-of-origin/106323028",
    "title": "Father-son pairs to make history in AFL Origin showcase",
    "publish_date": "Mon, 09 Feb 2026 21:17:43 +0000",
    "category": "sports",
    "authors": [],
    "text": "Chris Waterman didn't sugar-coat his reaction to son Jake being picked for Western Australia for Saturday's AFL Origin match.\n\nComing off a long-term shoulder injury, Jake Waterman hadn't been in Origin calculations for many people.\n\n\"[I was] surprised a little bit because his name hadn't even been mentioned,\" the former West Coast defender said.\n\n\"Then he rang me last Saturday … and said he's in, and I thought that's great.\n\nJake Waterman and his father Chris enjoy a laugh. (ABC News: Tom Wildie)\n\n\" He came out of the blue and wasn't expected [to play], so we were all pleasantly surprised that he's going to get that opportunity. \"\n\nThe elder Waterman knows a thing or two about playing for WA.\n\nHe featured in 1991, '92, '95, and was captain in 1998.\n\nHe still remembers playing against a strong South Australian side in what was WA's last State of Origin game.\n\nThe iconic black swan guernsey will be worn by Western Australia's AFL players for the first time since 1998. (Facebook: Roger Cook)\n\n\"I remember chasing Mickie O'Loughlin around Footy (Football) Park that night in South Australia, which was hard work, and then I got shifted onto Darren Jarman, so I had a pretty busy night,\" he said.\n\n\"South Australia were half Adelaide Crows, they went on and won the flag, so we went down by seven goals.\n\n\"I didn't know that was going to be the last one, though. I thought it was going to live on.\"\n\nOrigin 2.0\n\nNearly 30 years later, the AFL has resurrected the concept, staging the game at Perth Stadium during the pre-season.\n\nIt's allowed another generation of players to wear their state jumper — and bestowed two players with an unusual honour.\n\nJake Waterman and Nick Daicos will be the first father-son Origin players.\n\nJake Waterman has cemented himself as the West Coast Eagles' best forward, but his 2025 campaign was ruined by a shoulder injury. (Getty Images: Daniel Carson/AFL Photos)\n\n\"It's a bit of a dream come true really,\" Jake said.\n\n\"You look at old footage back in the day of all the State of Origin games and the great players that sort of solidify their greatness in games like this.\n\n\" I just can't wait to get out there. \"\n\nThe younger Waterman's selection comes after an up-and-down three seasons, which have seen him recover from serious illness, produce a career-best year, and suffer a serious injury.\n\nSaturday's match will be his first in 265 days, since he suffered a shoulder dislocation playing in Adelaide last May.\n\n'Special' jumper\n\nWaterman Jr knows how special the occasion is.\n\n\"You're not entitled to get to wear the WA jumper,\" Jake said.\n\nDoes State of Origin have any place left in the AFL? As the AFL prepares to reboot the State of Origin concept, the league hopes the concept will be adopted by a whole new generation of footy lovers.\n\n\"I've been fortunate enough to do it plenty of times throughout my junior career and I know how special it is.\"\n\nJake said he's looking forward to being reunited with former West Coast teammate Tom Barrass, as well as Aaron Naughton and Sam Taylor, who he played junior football with.\n\nAnd the prospect of playing alongside some of the competition's best small forwards has him licking his lips.\n\n\"Guys like Kozzy Pickett, Charlie Cameron, I'm really excited to play in the same forward line as them and see what type of magic they can get up to,\" he said.\n\nBlack swan brotherhood\n\nHe'll have advice from his father ringing in his ears.\n\n\"Enjoy the moment because it's quite different,\" Chris said.\n\n\"It's a different feeling warming up, a different feeling running up the race and getting in that last huddle before the game because you're looking around and there's faces you're not used to.\n\n\"In some way, it's a little bit daunting because you sort of feel like I just can't fail in front of these guys, these are the best going around in my state.\"\n\nChris Waterman (right) played 177 games for West Coast and was part of their 1992 and 1994 premiership teams. (ABC News: Tom Wildie)\n\nThe WA team will assemble on Wednesday night in a bid to foster a sense of camaraderie, and Jake is confident it will be a memorable week.\n\n\"If my teammates can walk off after the game, regardless of the result or how I played, [and know] that I'm a serious player, that cracked in for his state and cracked in for his boys that he played alongside, then yeah, that's all I can ask for,\" he said.\n\n\" I've got no doubt I'm going to make some lifelong friends over the next sort of week or so and look back on this week and the game very fondly down the track. \"\n\nThe ABC of SPORT Sports content to make you think... or allow you not to. A newsletter delivered each Saturday.",
    "source": "ABC",
    "cluster_id": 14
  },
  {
    "url": "https://www.abc.net.au/news/2026-02-10/mclaren-unveil-livery-for-mcl40-ahead-of-2026-f1-season/106324952",
    "title": "McLaren unveils livery as Piastri takes positive approach into 2026",
    "publish_date": "Mon, 09 Feb 2026 20:59:53 +0000",
    "category": "sports",
    "authors": [],
    "text": "McLaren has unveiled its livery for the 2026 Formula 1 championship season, retaining the design that led to championships in the previous two seasons.\n\nThe team based in Woking, England, have won the past two F1 constructors' championships, while Lando Norris secured his maiden drivers' championship last season.\n\nThe current design, a papaya and anthracite colour scheme, dates back to 2024 when McLaren won the constructors' championship. They stuck with the design in 2025 and have again kept the winning design for the 2026 season.\n\nThe McLaren MCL40 will have a similar livery design to the 2024 and 2025 challengers, when McLaren won the F1 constructors' championships. (Supplied: McLaren)\n\nThe MCL40 was unveiled in Bahrain ahead of a promotional filming day and two preseason tests this month.\n\nAustralian Oscar Piastri enters the 2026 season having narrowly missed out on the drivers' championship in 2025.\n\nPiastri won seven grands prix and led the championship for much of the season, but a form slump in the final third of the year allowed teammate Norris to claim the title.\n\nBut 2026 presents a new set of challenges for all teams and drivers. The engine and chassis regulations have been overhauled for this season, one of the largest regulation changes in F1's history.\n\nIn a statement following the launch of the MCL40 livery, Piastri said he was entering the 2026 season with confidence.\n\n\"We've got a big challenge ahead with the new regulations, but I come into this year with a lot of positivity and ready to tackle this new era of Formula 1 head on,\" he says.\n\n\"We've taken a lot of good learnings from last year, so I am feeling stronger than ever, and I look forward to seeing what we can achieve this year.\"\n\nNorris will carry the number one on his car in 2026, an honour reserved for the previous year's champion.\n\nLando Norris will drive with the number one on his car as the reigning F1 drivers' champion. (Supplied: McLaren)\n\nNorris became the first McLaren driver since Lewis Hamilton in 2008 to win the F1 drivers' championship, sealing the title with a third-place finish in the Abu Dhabi finale.\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\nNorris is the first McLaren driver to race with the number one since Jenson Button in 2010, who drove for McLaren after winning the 2009 drivers' championship with Brawn GP.\n\nWith a new season dawning, Norris said he enters the 2026 campaign filled with anticipation and excitement as the reigning champion.\n\n\"To win the Championship with the team I've been with since the beginning was incredible. We're coming into this year as World Champions, and I'm excited to see what we can achieve in this new era of Formula 1,\" he said in a statement.\n\n\"I'm ready for this year, and I can't wait to get back on track and keep pushing forward.\"\n\nThe first of two preseason testing sessions will be held in Bahrain from February 11 to 14.\n\nThe F1 season begins with the Australian Grand Prix weekend in Melbourne from March 6 to 8.",
    "source": "ABC",
    "cluster_id": 15
  },
  {
    "url": "https://www.smh.com.au/national/nsw/police-defend-actions-after-herzog-protests-turn-violent-20260210-p5o0y0.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Police defend actions after Herzog protests turn violent",
    "publish_date": "Tue, 10 Feb 2026 14:14:42 +1100",
    "category": "finance",
    "authors": [],
    "text": "Remove items from your saved list to add more.\n\nYou have reached your maximum number of saved items.\n\nSave this video for later\n\nAdd videos to your saved list and come back to them anytime.\n\nGot it",
    "source": "SMH",
    "cluster_id": 16
  },
  {
    "url": "https://www.smh.com.au/politics/federal/the-latest-illustrations-from-artist-alan-moir-20230608-p5df1x.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "The latest illustrations from artist Alan Moir",
    "publish_date": "Tue, 10 Feb 2026 14:09:42 +1100",
    "category": "finance",
    "authors": [],
    "text": "Remove items from your saved list to add more.\n\nYou have reached your maximum number of saved items.\n\nSave this gallery for later\n\nAdd galleries to your saved list and come back to them anytime.\n\nGot it",
    "source": "SMH",
    "cluster_id": 17
  },
  {
    "url": "https://www.smh.com.au/politics/queensland/cfmeu-inquiry-live-updates-hearings-begin-again-in-queensland-after-two-month-break-20260209-p5o0so.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "CFMEU inquiry LIVE updates: Civil construction boss grilled as Queensland hearings begin after two-month break",
    "publish_date": "Tue, 10 Feb 2026 14:06:56 +1100",
    "category": "finance",
    "authors": [
      "Matt Dennien",
      "William Davis"
    ],
    "text": "Long says his organisation raised concerns with the government about BPICs “strong contravention” of federal workplace laws around coercion and adverse action.\n\nThis particularly related to the requirements to “force it down the supply chain” and effectively force contractors to comply with its terms to get government work.\n\nLong says, through a solicitor, his organisation had sought the opinion of the then Australian Building and Construction Commission, which was “there was potential non-compliance”.\n\nAfter raising that concern, Long says the Department of Housing and Public Works advised it had sought Crown Law advice which said “it was legal”, but refused to release this to him.\n\nFollowing this, Long says the words “not mandatory” started creeping into government talk about the policy.\n\n“So this is an ‘aspirational document. What we want you to do is use your best endeavours to comply with this, and also your usual best endeavours to make sure the supply chain also complies with this’,” Long says.\n\nCrown Law advice about other elements of the BPICs policy were also raised by Australian Workers’ Union state secretary Stacey Schinnerl in the last public hearing – which the government also refused to outline.\n\nAnd with some more talk about proposed “demerit points” for contractors under the policies, the inquiry now breaks for lunch until 2pm.",
    "source": "SMH",
    "cluster_id": 18
  },
  {
    "url": "https://www.smh.com.au/sport/afl/demon-blow-viney-to-have-surgery-and-miss-three-months-20260210-p5o0y4.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Essendon appoints new chief from within; Viney lost to Demons for at least three months",
    "publish_date": "Tue, 10 Feb 2026 14:06:23 +1100",
    "category": "finance",
    "authors": [
      "Michael Gleeson",
      "Andrew Wu"
    ],
    "text": "Craig Vozzo is no longer CEO of Essendon, but will continue to assist the club. Credit: Justin McManus Roberts comes from the construction industry, where he has worked for over 30 years with construction consulting firm WT Partnership. A club director since 2022, Roberts was involved in Essendon’s VFL program and establishing their AFLW team at the Bombers’ spiritual home at Windy Hill, as well as being across their commercial operations, community programs and football department strategy. Sporting organisations do not usually hire a CEO from their board, though Cricket Australia took this step in 2018 when they appointed then-director Kevin Roberts to replace the long-serving James Sutherland. Essendon said Tim Roberts’ understanding of the club, coupled with his business acumen, led to him being identified as a candidate during the process, and he was encouraged to apply.\n\n“Tim has successfully built global businesses across a range of industries, and we are excited he can bring that experience and commercial acumen to his new role as CEO,” president Andrew Welsh said. “Tim has been an outstanding contributor to the club since joining in 2022, and his elevation to vice president last year was a reflection of the value he was already adding to the Bombers. “We have seen Tim’s impact firsthand in his time on the board, and he was clearly the best candidate for what Essendon needs, someone who can strengthen our culture, provide continuity and allow us to execute our club strategy. Roberts, who starts on Monday, is the Bombers’ fourth CEO in three years, following on from Vozzo, Andrew Thorburn and Xavier Campbell. Thorburn resigned after one day in the job.\n\n“The platform for success has been created by those who have gone before me, and I am proud to take on this challenge and continue Craig Vozzo’s incredible contribution,” Roberts said. Loading “The Essendon I grew up barracking for were league leaders on and off the field, proud of the red and black and seen as a fierce, courageous, confident and bold club. That’s my vision for this club, and along with Welshy, our board and leadership, we are determined to reclaim that space. “Essendon is a club that should be consistently competing for finals and premierships, be embracing and impactful in our community and commercially sustainable. “During my business career I learned that people are the cornerstone of your success, and footy clubs are no different. We have terrific talent across our club through the executive, coaches, staff and playing groups, and our focus is to get the best out of everyone, being galvanised and executing our club strategy.”\n\nViney succumbs to Achilles Michael Gleeson Jack Viney will have surgery on his Achilles injury on Tuesday and is set to miss at least three months, costing him most of the first half of the AFL season if his recovery goes well. The Demons will be without Jack Viney’s ball-winning abilities in round one. Credit: Getty Images As recently as late last week, Melbourne fitness staff were hopeful that Viney would avoid surgery and be available for the early rounds of the season.\n\nThat decision changed on Monday, with the 31-year-old leader booked for surgery. The Demons’ conservative rest and recovery plan to manage the Achilles issue and avoid surgery meant that, coupled with a back injury, Viney barely trained over the summer. Melbourne will hope All Australian small forward Kysaiah Pickett can move into the midfield to join Max Gawn Credit: Getty Images When in January the midfielder attempted to lift his training to the next level, his Achilles flared again while his back also caused problems. His lengthy absence means the Demons’ midfield, which was already to be re-cast after the trading out of Christian Petracca and Clayton Oliver in the off-season, and the trading in of former Saints captain Jack Steele, will now be almost unrecognisable from the midfield set-up that has carried the club for most of the last decade.\n\nOnly captain Max Gawn will remain of the regular midfield quartet that will take on the Saints at the MCG in round one on March 15. Gawn is playing for Victoria in the State of Origin match against WA on Saturday night. New Melbourne coach Steven King knew he was taking on the job with a different list to manage, but that is even more apparent now, without four players from the top 10 in the club’s best and fairest last year – Petracca was second, Oliver seventh and Viney 10th. Jake Bowey, who finished fourth, had surgery to repair a lisfranc injury in his foot in December, a procedure that was expected to sideline him for at least six months. The importance of the trading in of Steele from St Kilda has grown in significance to help keep experience around the ball for the Demons. The absences are expected to deliver more opportunities for promising young players Harvey Langford, Caleb Windsor and Xavier Lindsay.",
    "source": "SMH",
    "cluster_id": 19
  },
  {
    "url": "https://www.smh.com.au/money/planning-and-budgeting/why-a-high-salary-won-t-save-you-from-these-common-money-problems-20260210-p5o10a.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Why a high salary won’t save you from these common money problems",
    "publish_date": "Tue, 10 Feb 2026 14:00:00 +1100",
    "category": "finance",
    "authors": [
      "Paridhi Jain"
    ],
    "text": "Advertisement\n\nMoneyPlanning & budgetingMoney psychology Opinion Why a high salary won’t save you from these common money problems Paridhi Jain Money contributor February 10, 2026 — 2:00pm\n\nFebruary 10, 2026 — 2:00pm Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share A A A\n\nThrough my education and coaching work, I’ve had the opportunity to work with a really diverse range of people, some who are financially struggling, but many who are already financially comfortable, from doctors and lawyers to senior professionals and business owners. Despite having a good income, many of them carry a nagging feeling of financial uncertainty and stress. They know they “should” be doing well, but somehow they can’t seem to get ahead. A six-figure salary won’t mean much if your fundamentals are still broken. Simon Letch Contrary to popular opinion, earning a high income won’t create financial success (many high-income earners live pay to pay), unless you know how to convert money into wealth. Today, I’m sharing some of the challenges that hold high-income earners back from creating the level of financial success that their income makes possible.\n\nAdvertisement\n\nThe inertia that comes with comfort It is not unusual for me to see clients who are financially struggling create bigger and more rapid changes in their financial life than some who are financially comfortable. When I started working in this space, this surprised me. I knew that with a few small changes, people could make a $50,000 and even $100,000 impact to their financial future. It seemed bizarre to me that someone who was in a position to make these changes with ease would be less inclined to do so than those who were struggling to get by. When you arrive at a place where you’re financially comfortable, you unlock the opportunity to grow. But there is an urgency that comes with struggle and pain that is a powerful driver of action. This is a key missing ingredient for so many people who are financially comfortable.\n\nAdvertisement\n\nThey do not have a strong enough drive to take action. They see their finances as just another administrative chore that they keep telling themselves they’ll get around to some time in the future. How do you overcome this inertia? When you no longer have pain and struggle driving your action, you have to switch gears and learn how to be motivated by desire. You have dreams you’ve probably talked yourself out of: Buying a dream home; Quitting your job to go travelling for a year; Retiring early; Sending your kids to private school. What if those dreams weren’t impossible? What if you could get there with a lot less work than you think? When you arrive at a place where you’re financially comfortable, you unlock the opportunity to grow not because you have to, but because you want to.\n\nAdvertisement\n\nWhy would you want to keep growing when you don’t have to any more? Because the goal of life isn’t just comfort, it’s aliveness. Comfort is nice. But that feeling of exhilaration you get when you create a version of your life that you barely thought was possible? That’s priceless. Trying to pay away the problem Editor's pick Opinion\n\nActive investing Novice to pro: How to go from $0 to $100K in investments Paridhi Jain Money contributor When you have money, it’s easier to just pay someone to figure it out for you. Dropping a few thousand dollars on a financial planner, buyer’s agent or investment adviser is not a huge deal. But working with financial professionals is not a substitute for developing your own financial capability. Unlike outsourcing other tasks – housekeeping, lawn-mowing, meal-prepping etc – there is a lot more on the line when you’re outsourcing your finances.\n\nAdvertisement\n\nIdeally, you should always be in the driver’s seat of your own financial life. That doesn’t mean you shouldn’t engage professionals – it just means their role should be to advise you, not to call the shots for you. The stronger your foundational understanding of your own finances, the more you can actively participate in the decision-making process. This will not only produce better outcomes long-term, but also significantly reduces the risks of engaging financial professionals. This is another way in which I find that people with less disposable income can end up better off long-term. They don’t have the luxury of dropping $5000 to $10,000 to outsource their financial decisions, so they have to find the time to figure things out the hard way: by themselves. In the process they build their financial capability and confidence, which becomes a lifelong asset. Meanwhile, I’ve seen high-income earners sink tens of thousands of dollars bouncing from one financial professional to another, hoping that “this one will work out”. In short, just because you can afford to outsource your financial decisions doesn’t mean you’re ready to, or that that’s the optimal place for you to start.\n\nAdvertisement\n\nIt pays (literally) to learn how to do some of the basics yourself first, so you are better equipped to handle a relationship with a professional long-term. It’s not hard, but it does take a bit of time and a bit of work. Earning a high income only gives you the potential for financial success. Whether you can actualise that potential depends on how well you can convert those earnings (money) into assets (wealth) through saving and investing. Paridhi Jain is founder of SkilledSmart, which helps adults learn to manage, save and invest money through financial education courses and classes. Advice given in this article is general in nature and not intended to influence readers’ decisions about investing or financial products. They should always seek their own professional advice that takes into account their own personal circumstances before making any financial decisions. Expert tips on how to save, invest and make the most of your money delivered to your inbox every Sunday. Sign up for our Real Money newsletter.\n\nSave You have reached your maximum number of saved items. Remove items from your saved list to add more. Share License this article More: Money psychology\n\nOpinion Paridhi Jain is the founder of financial education platform, SkilledSmart, which has helped hundreds of adults become financially confident by teaching them practical strategies to manage, save and invest their money.",
    "source": "SMH",
    "cluster_id": 20
  },
  {
    "url": "https://www.smh.com.au/national/western-australia/wa-news-live-cyclone-weakens-to-a-tropical-low-as-it-crosses-the-coast-20260209-p5o0up.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "WA news LIVE: Cyclone weakens to a tropical low as it crosses the coast",
    "publish_date": "Tue, 10 Feb 2026 13:49:15 +1100",
    "category": "finance",
    "authors": [],
    "text": "A compliance blitz across WA’s regional abattoirs has revealed widespread safety issues, with 562 improvement notices and six prohibition notices issued across 19 facilities.\n\nWorkSafe said the most common reason for an improvement notice was guarding of machinery (81), followed by provision of a safe layout (52), maintenance (20), and emergency stops (18).\n\nThe watchdog, in a statement, said the most common tool used in the industry and the cause of the most lost time injuries was the knife.\n\n“Common issues relating to knives included workers walking around with knives, knives being left unsecured around the workplace, workers sharpening knives near other workers, and workers using damaged knives,” it said.\n\n“The best practice system seen in workplaces involved asset tracking, where workers received a sharp, sterilised knife at the start of their shift and returned the knife at the end of the shift for resharpening and storage.”\n\nWorksafe said it would continue to monitor the sector.",
    "source": "SMH",
    "cluster_id": 21
  },
  {
    "url": "https://www.smh.com.au/national/western-australia/adrian-fini-s-280-million-smiths-beach-development-gets-watchdog-s-green-tick-20260210-p5o11z.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Adrian Fini’s $280 million Smiths Beach development gets watchdog’s green tick",
    "publish_date": "Tue, 10 Feb 2026 13:43:46 +1100",
    "category": "finance",
    "authors": [
      "Hamish Hastie"
    ],
    "text": "Advertisement\n\nNationalWADevelopment outrage Adrian Fini’s $280 million Smiths Beach development gets watchdog’s green tick Hamish Hastie February 10, 2026 — 1:43pm Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share A A A\n\nThe long-running fight against development at Smiths Beach in Yallingup has been dealt a huge blow after the Environmental Protection Authority recommended the project be approved. The EPA made public its recommendations to Environment Minister Matthew Swinbourne on Tuesday, five years after the Adrian Fini-led developer Smiths 2014 Pty Ltd first lodged the 42-hectare Smiths Beach Project proposal. The latest renders for the Smiths Beach development in WA’s South West. The project, valued at $280 million in 2022, includes a hotel, wellness centre, 61 holiday homes, campground, community hub and surf lifesaving club. The recommendation comes six days after Swinbourne approved Saracen Properties’ 121-room five-star Westin resort and residential village in Gnarabup, south of the Smiths Beach site.\n\nAdvertisement\n\nIn its press release, the EPA took the step of noting that “several members” of the EPA, including chair Darren Walsh declared a conflict of interest regarding the Smiths Beach proposal and were not “involved in any related discussions and/or decisions.” Walsh has a lengthy history working in the development sector, including at Satterley Property Group, and at JBS&G, the environmental consultancy that Fini used to prepare its application to the EPA. The EPA said board members Jane Bennett, David Caddy and Hamish Beck also recused themselves from Smiths Beach discussions. Locals have been fighting development at the site for more than two decades under the Save Smiths Beach Action Group banner, citing concerns about the level of clearing, fire risk, sewage impacts and the use of the controversial State Development Assessment Unit to gain planning approval. The proposal has also attracted criticism from the opposition and features in an ongoing opposition-led parliamentary inquiry into Labor Government planning procedures. Save Smiths Beach Action Group convenor David Mitchell said the EPA had ignored its own rulings in a 2009 proposal the suggested the western half of the development site on the headland should not be developed.\n\nAdvertisement\n\n“There’ll be a very happy group of Western suburbs businessmen today. There’s probably a long lunch being had in Subiaco,” he told ABC’s Mornings Program. “They have basically regurgitated the developer’s own proposal, and the EPA has capitulated. “It’s universal that all the government agencies are against development on the headland on both visual and environmental grounds.” The EPA made its recommendation subject to conditions around wastewater management, clearing and offsets of fauna habitat. Those offsets, proposed by Fini’s company, included rehabilitation of western ringtail possum and black cockatoo foraging habitat at three sites within the state government’s estate.\n\nAdvertisement\n\nRelated Article Property development Perth developer denies trying to ‘bypass’ planning process in bid to expand prime beach project Other conditions include requiring the developer to manage weeds at the site and 50 metres outside the development envelope, including on Crown land. “Maintaining habitat connectivity between vegetation in the development envelope and the Leeuwin-Naturaliste National Park is front and centre of the EPA’s conditions,” an EPA spokeswoman said. “Other measures in the proponent’s conservation significant Fauna Management Plan and Offset Strategy address feral animal control, nearby offset areas, and a community-based revegetation program. “And conditions relating to secondary foraging and dispersal habitat for the western ringtail possum contain a requirement for a conservation covenant. This includes establishment costs and long-term management and maintenance costs.”\n\nAdvertisement\n\nA Smiths Beach Project spokeswoman welcomed the EPA’s decision and said the company would adhere to the conditions. “Our project team of leading Australian landscape designers and architects have designed the coastal village, including its hotel and community facilities, in a way that is sensitive to the site’s environmental and cultural significance,” she said. Aerial view of Smiths Beach and the Smiths Beach Resort. Tourism WA “This brings us closer to realising our project vision of creating a world-class seaside village for the benefit of Western Australia and the South-West - enabling the local community and visitors to this state to share and enjoy the best aspects of our lifestyle and environment.” Fini was behind the Bunker Bay Resort, built south of Smiths Beach in 2004, and has been pursuing a development at the Smiths Beach site after purchasing it alongside several other families in 2014.\n\nAdvertisement\n\nThe previous owner’s proposal attracted the first iteration of the Save Smiths Beach community protest campaign, with locals claiming a win after the developer went on to become embroiled in a Corruption and Crime Commission investigation, along with several local councillors. The structure plan approved under the old owners’ proposal featured up to 500 tourism and residential dwellings, with the western side of the lot to be handed to the state government as a national park. Fini’s new proposal features a broader footprint but less density, which Fini in the past has said improved amenity and greater retention of vegetation. Last year, Fini’s company removed a planned ramp to Smiths Beach over community concerns it would act like a “sea wall”. The EPA’s recommendation will be open for a three-week public appeal period.\n\nAdvertisement\n\nVasse MP Libby Mettam said the EPA’s approval was disappointing, also pointing to the 2009 EPA decision, which recommended the western headland section not be built on. Start the day with a summary of the day’s most important and interesting stories, analysis and insights. Sign up for our Morning Edition newsletter.",
    "source": "SMH",
    "cluster_id": 22
  },
  {
    "url": "https://www.smh.com.au/sport/aussies-clinical-first-run-20260210-p5o0wk.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Aussie's clinical first run",
    "publish_date": "Tue, 10 Feb 2026 13:14:23 +1100",
    "category": "sports",
    "authors": [],
    "text": "Aussie's clinical first run\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 23
  },
  {
    "url": "https://www.smh.com.au/business/markets/asx-set-to-edge-up-as-wall-street-advances-20260210-p5o0vt.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Tech stocks boost ASX; Aussie dollar strengthens",
    "publish_date": "Tue, 10 Feb 2026 13:09:10 +1100",
    "category": "finance",
    "authors": [
      "Staff Reporter"
    ],
    "text": "Advertisement\n\nUpdated BusinessMarketsWorld markets Tech stocks boost ASX; Aussie dollar strengthens Staff reporter Updated February 10, 2026 — 1:09pm ,first published February 10, 2026 — 5:25am Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share A A A\n\nTechnology stocks are leading the Australian sharemarket higher on Tuesday while Wall Street steadied overnight. The S&P/ASX 200 was up 28.1 points or 0.3 per cent, to 8898.20 just before 1pm AEDT, with nine of 11 industry sectors in positive territory. Wall Street’s benchmark index has made a positive start to the week. AP Mining stocks are mixed after a strong start to the session. BHP and Rio Tinto each jumped 1.3 per cent but Fortescue fell into the red to be 0.5 per cent lower. Among gold miners, Northern Star added 0.5 per cent while Evolution Mining lost 0.9 per cent. The price of silver surged by more than 7 per cent overnight, sending South32 up 1.9 per cent. Financial stocks are mixed, with National Australia Bank climbing 0.4 per cent, but Commonwealth Bank gave up 0.4 per cent, Westpac fell by 1.5 per cent and ANZ Bank lost 1 per cent. Macquarie Group rose 1 per cent after reporting, in a December quarter update on Tuesday, better profits across its four business units, including its commodities and global markets unit where profit was substantially up on the previous corresponding period.\n\nAdvertisement\n\nRelated Article Opinion\n\nWorld markets The looming D-Day that has sent shivers through Wall Street Stephen Bartholomeusz Senior business columnist Energy stocks climbed as oil prices strengthened. Woodside Energy gained 0.6 per cent, Santos rose 0.8 per cent and Yancoal was 0.9 per cent higher. Tech stocks strengthened, with WiseTech up 0.6 per cent and Xero 2.2 per cent, but there were gains elsewhere, with NextDC jumping 1.7 per cent and Technology One advancing 0.9 per cent. Childcare operator G8 Education slumped 15.6 per cent after announcing a $350 million non-cash impairment and telling investors it would scrap its final dividend and a pause its share buyback. “Sector conditions remain challenging,” G8 said. Australia’s biggest winemaker, Treasury Wine Estates, jumped 6.7 per cent after it settled a dispute with its former Californian distributor and told investors it expected its first half earnings to be $236 million, above its previous guidance.\n\nAdvertisement\n\nThe global wine giant will purchase the stock held by Republic National Distributing Company, which shut its Californian operations in September 2025, for a confidential sum that compensates Treasury Wine for its closure. The Penfolds maker expects settlement costs of $65 million in the second half of the financial year. The Australian dollar continues to strengthen, trading at US70.89¢ at 1.08pm AEDT. Overnight, the S&P 500 rose 0.5 per cent and inched closer to its record set two weeks ago. The Dow Jones was down 13 points, or less than 0.1 per cent, and the Nasdaq composite was 1 per cent higher. The relatively modest moves followed a 3.9 per cent burst higher for Japan’s Nikkei 225 to a record. Stocks rallied in Japan following a landslide victory for the prime minister’s political party in a parliamentary election. The thought is that will give Sanae Takaichi more power to push through reforms that will boost the economy and market. On Wall Street, the US stock market is coming off its best day since May to close last week, but several concerns still hang over it. That includes criticism that stocks have simply become too expensive following their run to records.\n\nAdvertisement\n\nWorries are also heavy about whether all the huge spending by Big Tech and other companies on AI can produce enough profit to make the investments worth it. Related Article Opinion\n\nLuke Sayers The prince of business networking, the lewd pic and the ghost poster Elizabeth Knight Business columnist Slightly more stocks fell in the S&P 500 than rose, but some of the winners from that rush into AI helped prop up the market. Chip companies rose, for example, with Nvidia up 3.4 per cent and Broadcom up 4 per cent. They were two of the strongest forces pushing upwards on the S&P 500. On the losing end was Hims & Hers Health, which sank 24.5 per cent after Novo Nordisk filed a lawsuit and alleged Hims & Hers is unlawfully selling versions of its weight-loss treatments. The suit follows a move by the US Food and Drug Administration to restrict access to the ingredients needed to copy popular weight-loss medications. In the bond market, Treasury yields held relatively steady ahead of several potentially market-moving reports coming later in the week. The US government will offer the latest monthly update on the health of the job market on Wednesday. Friday will bring the latest monthly reading of inflation at the consumer level.\n\nAdvertisement\n\nBitcoin dipped back towards $US70,000 after climbing above $US71,000 at the weekend. It had dropped close to $US60,000 last week, more than halfway below its record set in October. With AP The Market Recap newsletter is a wrap of the day’s trading. Get it each weekday afternoon.\n\nSave You have reached your maximum number of saved items. Remove items from your saved list to add more. Share More: World markets\n\nWall Street\n\nShares",
    "source": "SMH",
    "cluster_id": 24
  },
  {
    "url": "https://www.smh.com.au/sport/nrl/souths-haas-signing-steals-show-at-nrl-launch-20260210-p5o12i.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Souths’ Haas signing steals show at NRL launch",
    "publish_date": "Tue, 10 Feb 2026 12:55:08 +1100",
    "category": "sports",
    "authors": [],
    "text": "Souths’ Haas signing steals show at NRL launch\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 25
  },
  {
    "url": "https://www.smh.com.au/goodfood/melbourne-eating-out/lune-lonsdale-20260210-p5o11r.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Lune Lonsdale",
    "publish_date": "Tue, 10 Feb 2026 12:22:15 +1100",
    "category": "finance",
    "authors": [
      "Tomas Telegramma"
    ],
    "text": "Add articles to your saved list and come back to them anytime.\n\nRemove items from your saved list to add more.\n\nYou have reached your maximum number of saved items.\n\n1 / 5 Almond croissants. Simon Schluter 2 / 5 Pastry chefs prepare croissants at Lune bakery in Lonsdale Street, Melbourne. Simon Schluter 3 / 5 The opening special is a twice-baked croissant filled with “choc chip” frangipane and topped with Chappy’s chips. Supplied 4 / 5 Ready to be baked. Simon Schluter 5 / 5 The Lune team preparing pastries on site ahead of opening day. Simon Schluter Previous Slide Next Slide\n\nBakery$$$$\n\nDubbed “Maxi Lune”, Lune’s fourth Melbourne store beneath the Ritz-Carlton hotel in the west end churns out more than 6000 croissants a day. Designed by local studio In Addition, the 418-square-metre shopfront and production site has soaring ceilings, a sprawling concrete bench laid with one of each pastry, and its signature glass-walled “cube” where you can peer in on the pastry being laminated – centimetres away from an inside bench seat, or through a huge window from the footpath. It’s also got the most seating of any Lune store, with room for 50 people.\n\nPastries are baked fresh throughout the day, so you can get them while they’re still warm. That includes the bestselling almond croissant and the second-bestselling traditional croissant, as well as monthly specials and Lune Lonsdale exclusives.\n\nWant to visit this venue? Save it in the Good Food app.",
    "source": "SMH",
    "cluster_id": 26
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/interview-feyza-tuncay-on-helping-children-learn-about-ethics/xclgycqpn",
    "title": "INTERVIEW: Feyza Tuncay on helping children learn about ethics",
    "publish_date": "Tue, 10 Feb 2026 00:59:01 +0000",
    "category": "finance",
    "authors": [],
    "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
    "source": "SBS",
    "cluster_id": 27
  },
  {
    "url": "https://www.sbs.com.au/news/article/roblox-put-on-notice-over-disturbing-child-grooming-reports/op1usxr7v",
    "title": "Roblox put on notice over 'disturbing' child grooming reports",
    "publish_date": "Mon, 9 Feb 2026 20:30:35 +0000",
    "category": "finance",
    "authors": [],
    "text": "Controversial gaming platform Roblox has been put on notice, with persistent reports predators are targeting kids with sexually explicit and suicidal material.\n\nCommunications Minister Anika Wells has requested an urgent meeting with the popular platform two months after Australia's world-leading under-16s social media ban kicked in.\n\nShe's alarmed by claims young Roblox users are being exposed to graphic and gratuitous user-generated content.\n\n\"Even more disturbing are reports and concerns about children being approached and groomed by predators, who actively seek to exploit their curiosity and innocence,\" Wells said in a statement.\n\nAustralia's social media minimum age restrictions came into effect on 10 December and require digital platforms to verify users' ages and lock accounts for those younger than 16.\n\nTen digital platforms were asked to comply with the law, including Google's YouTube, Meta's Facebook, Instagram and Threads, as well as Snapchat, Reddit and TikTok.\n\nAn issue of 'deep concern'\n\nRoblox, which is not named under the law, revealed 60 per cent of its Australian daily active users had undertaken age checks.\n\nThe platform is not a single game, but is described as a vast ecosystem of user-created \"experiences\" hosted on it.\n\nIn the lead-up to the ban, parents expressed concerns over harms on Roblox, including sexually explicit and suicidal content being shared in public chats.\n\nWells said content was persisting, despite Roblox engaging \"extensively\" with eSafety over the past two years.\n\n\"This is untenable and these issues are of deep concern to many Australian parents and carers,\" she said.\n\neSafety Commissioner Julie Inman Grant said Roblox must immediately take action to block predators having access to children after the \"horrendous\" reports.\n\nRoblox informed eSafety it delivered on its commitments under the ban, including switching off features such as direct chats and voice functions for Australian kids.\n\nInman Grant said the platform would be assessed for its compliance.\n\n\"We remain highly concerned by ongoing reports regarding the exploitation of children on the Roblox service, and exposure to harmful material,\" she said.\n\n\"They can and must do more to protect kids, and when we meet I'll be asking how they propose to do that.\"\n\nA digital duty of care\n\nPlatforms that decline to comply with the social media ban face fines of up to $49.5 million.\n\nWells has asked the internet watchdog what powers can be ramped up to combat harms on Roblox as the government works towards legislating a digital duty of care.\n\nThe proposed legal obligation is separate from the social media ban and would apply to large online platforms to take proactive, reasonable steps to prevent foreseeable harms to users.\n\nThe commissioner said codes focused on age-restricted material, including pornography and self-harm, would come into force on 9 March and apply to Roblox.\n\nReaders seeking support can ring Lifeline crisis support on 13 11 14 or text 0477 13 11 14, Suicide Call Back Service on 1300 659 467 and Kids Helpline on 1800 55 1800 (for young people aged 5 to 25). More information is available at beyondblue.org.au and lifeline.org.au .\n\nAnyone seeking information or support relating to sexual abuse can contact Bravehearts on 1800 272 831 or Blue Knot on 1300 657 380.\n\nFor the latest from SBS News, download our app and subscribe to our newsletter.",
    "source": "SBS",
    "cluster_id": 28
  },
  {
    "url": "https://www.sbs.com.au/news/article/australian-research-combatting-antibiotic-resistance/6s3a7lbvu",
    "title": "The world is running out of antibiotics. New research could make old ones work again",
    "publish_date": "Mon, 9 Feb 2026 18:31:41 +0000",
    "category": "lifestyle",
    "authors": [],
    "text": "The rise of antibiotic resistance is threatening millions of lives worldwide, but \"unconventional\" Australian research could make obsolete medications effective again.\n\nData released by the World Health Organization (WHO) has found that some of the most common illnesses in the world are becoming more resistant to treatment every year.\n\nDr Maud Eijkenboom says the current approach of developing new antibiotics is losing the battle to ever-evolving viruses and bacteria.\n\nAfter her son struggled with an antibiotic-resistant disease, Eijkenboom set out on her own path to discover a better way to quell the rising wave of lethal pathogens.\n\nLISTEN TO Australian researchers on a mission to save millions of lives from antibiotic resistance SBS News 14:06 English\n\nIn 2021, she founded Lixa, a Perth-based biotech company that has received international support for its \"game-changing\" research.\n\nA decade of debilitation\n\nEijkenboom says her son Jonathan Barker once couldn't lead a normal life.\n\nHe was 12 years old when he started to faint regularly, and would fall asleep without being able to be roused — often for hours at a time.\n\n\"He virtually was a hundred per cent in bed,\" Eijkenboom tells SBS News.\n\n\"We had to carry him to the bathroom for two years, and then it took a total of six years to come back from it.\"\n\nBarker had multiple infections stemming from Lyme disease, which he developed after being bitten by a tick in Europe. The disease is typically transmitted to humans by ticks carrying a bacterium called Borrelia burgdorferi. Scientists have not found the bacterium in ticks in Australia.\n\n\"It had become chronic, and it was pretty nasty, and it was very difficult to get to the bacteria [for analysis],\" she says.\n\n\"My husband and I are both drug developers, and we looked around in frustration because we couldn't help our son.\"\n\nThat frustration propelled Eijkenboom and her husband to do their own research. They felt the medical world was too focused on developing new drugs and was not asking what could be done about antibiotics that were no longer working.\n\n\"Because we couldn't help Jonathan for a long time, we did a lot of research,\" Eijkenboom says.\n\nAfter studying and working with university researchers, she raised capital and founded Lixa, aiming to find a solution to antibiotic resistance — for her son and others.\n\n\"You look around, and resistance and chronic conditions are everywhere,\" she says.\n\n\"You see elderly women with urinary tract infections, you see children with glue ear [a build-up of sticky fluid in the middle ear that can cause temporary hearing loss], there must be something in common across all bacteria that we need to be able to get to.\"\n\nRise of antimicrobial resistance\n\nAntimicrobials are drugs such as antibiotics, antivirals, antifungals and antiparasitics that target and kill germs — or pathogens. These are microorganisms that cause disease and include bacteria, viruses, fungi and parasites.\n\nThe WHO has found that pathogens are developing antimicrobial resistance (AMR), making them harder to treat and causing patients to suffer through symptoms for longer.\n\nBased on data from the National Antimicrobial Prescribing Survey, 50 per cent of Australian hospital patients will receive an antimicrobial, such as broad-spectrum antibiotics.\n\nThese are used to treat common infections, such as Neisseria gonorrhoeae, which causes gonorrhoea, and Methicillin-Resistant Staphylococcus Aureus (MRSA), which causes a range of skin infections as well as serious infections like pneumonia and sepsis.\n\nSource: SBS News\n\nAssociate professor Rietie Venter, the head of microbiology at the University of South Australia, tells SBS News that AMR poses \"significant treatment challenges\".\n\n\"Pathogens can start showing signs of resistance to a new medication very fast, within a few years even,\" Venter says.\n\n\"Lower and middle-income countries often struggle with limited access to newer or last-line antibiotics, exacerbating the impact of resistant infections.\"\n\nVenter explains that AMR is more than just a problem for wound care.\n\n\"The agriculture industry in the US, for instance, has a big problem with resistance, driven by the overuse of antibiotics in livestock production,\" she says.\n\nResistant bacteria can spread from farms into soil and water through animal waste, contaminating the food supply and surrounding environments, she explains.\n\nAMR is even on the rise in households due to cross-contamination via washing machines and kitchen counters, which can harbour detergent-resistant germs.\n\n\"Supporting research and development of new antibiotics or alternative antimicrobial therapies is vital in combating the growing threat of antimicrobial resistance,\" she says.\n\nAn 'unconventional' new approach\n\nEijkenboom says her company's mission is to solve the antimicrobial resistance \"crisis\", not by creating new antibiotics, but by targeting the composition of deadly pathogens.\n\n\"We do that by breaking resistance. And we've got universal resistance breakers that tame bacteria,\" she explains.\n\n\"They go from a resistant state to a sensitive state, and suddenly the oldest antibiotics — or biocides or surfactants or whatever detergents you want to use — can work again as they used to.\"\n\nThe innovative approach neutralises pathogens and stops them from developing resistance to treatment. Pathogens typically develop resistance through genetic mutations, which are then passed on via rapid reproduction.\n\nSome antimicrobials directly damage or disrupt the cell membrane, which is basically the bacteria’s skin.\n\nWhen that happens, the cell leaks its contents and dies. But breaking it also triggers its survival instincts, allowing resistance to develop. So Eijkenboom’s approach is to avoid breaking the membrane.\n\n\"If you break the membrane of a bacterium, you create an evolutionary pressure, which will cause more resistance. So by not breaking it, you can bring back antibiotics again.\"\n\nREAD MORE The key to a long life? One factor may matter more than we thought\n\nLixa's technology has completed a phase one clinical trial using a nebuliser (a type of medical inhaler) to test its effectiveness in treating chronic respiratory infections.\n\nShe says it was found to be \"very safe\" for the lungs, one of the body's most sensitive organs.\n\nThe company is now looking to test an oral form, such as a tablet.\n\nLixa announced a partnership with the Global Antibiotic Research & Development Partnership (GARDP) on 2 February to scale the technology to market-readiness.\n\nThe GARDP is a not-for-profit global health organisation based in Switzerland that analysed Lixa's clinical data for 10 months before agreeing to support the company.\n\n\"Lixa's compounds represent an unconventional new approach to AMR treatment and after a review of their preclinical data, our experts thought that it is worth supporting Lixa to generate additional data to pressure-test their approach,\" François Franceschi, an associate director at GARDP, said in a statement.\n\n\"If their technology is found to be safe and effective in clinical trials, this could represent a game-changer in the way we treat drug-resistant bacterial infections.\"\n\nThe innovation gap\n\nJames Graham, the CEO of Recce Pharmaceuticals, says \"next-generation novel approaches are urgently needed to stay ahead of this crisis\".\n\nHe tells SBS News there is an \"innovation gap\" where a lack of funding and resources means new medicines are hard to research and develop.\n\n\"Most antibiotic classes we rely on today were discovered between the 1940s and 1980s, and no new class has been approved in over 40 years,\" he says.\n\nRecce Pharmaceuticals, a biotechnology company headquartered in Sydney, is developing a new product designed to combat AMR: synthetic anti-infectives.\n\nGraham says that while this kind of innovation is very much needed, the process of researching, trialling and taking a new treatment to market in Australia is long and expensive.\n\n\"We've spent nearly $100 million getting this new class of antibiotics into a late-stage phase three trial,\" he says.\n\n\"And we're not done yet.\"\n\nClinical trials typically consist of three phases, says Graham, covering discovery through to testing in labs and, finally, in people.\n\n\"The final piece of that is at the end of phase three, you obviously then submit for market application, which can take many months to about a year.\"\n\nGraham says more financial investment is needed in companies looking for solutions to AMR, but he believes Australia is \"really well placed\" to support new innovation.\n\nHe describes the federal government's research and development tax incentive scheme as an \"incredibly compelling\" program, which can enable companies to offset R&D expenditure up to $150 million. Those with an annual turnover of less than $20 million can offset costs equal to their corporate tax rate, plus a premium of 18.5 per cent. The premium is lower for companies with higher turnover.\n\n\"That's incredibly unique anywhere in the world. So if you're in the United States, you're lucky to get 2 to 5 per cent [of expenditure offset],\" he says.\n\n'Create a life now'\n\nEijkenboom says her son, who is now 22, can leave the house again.\n\n\"It took 10 years for him to recover; he didn't have any schooling, no high school, because he was asleep,\" she says.\n\n\"When we count the impact of AMR, we count the people who die, but we don't count the people who are debilitated, who can't take part in a normal life.\"\n\nShe says her son is \"much better now\" and found his first job a few months ago.\n\n\"He doesn't want to look back on his illness. And he just wants to go ahead and create his life now.\"\n\nEijkenboom is looking to the future too. She believes Lixa’s work, although in its early stages, could make a unique contribution to the fight against AMR.\n\n\"I think we're onto something and that we're really kicking some big goals, and it's quite interesting to do that from little Perth, whereas the rest of the world is still stuck in developing antibiotics.\"\n\nFor the latest from SBS News, download our app and subscribe to our newsletter.",
    "source": "SBS",
    "cluster_id": 29
  },
  {
    "url": "https://www.sbs.com.au/news/video/coalition-split-sealed-but-internal-threats-to-leys-liberal-leadership-remain/npjxd41de",
    "title": "Coalition split sealed but internal threats to Ley's Liberal leadership remain",
    "publish_date": "Mon, 9 Feb 2026 08:45:04 +0000",
    "category": "finance",
    "authors": [],
    "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
    "source": "SBS",
    "cluster_id": 27
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/asx-has-best-day-since-donald-trumps-liberation-day/w2jrhqh7n",
    "title": "ASX has best day since Donald Trump's Liberation Day",
    "publish_date": "Mon, 9 Feb 2026 07:25:26 +0000",
    "category": "finance",
    "authors": [],
    "text": "And you can find more On the Money podcasts by subscribing to On the Money here, or wherever you get your podcasts.\n\nAnd you can listen to Australian and world news, and follow trending topics with SBS News Podcasts",
    "source": "SBS",
    "cluster_id": 30
  },
  {
    "url": "https://www.theage.com.au/national/nsw/police-defend-actions-after-herzog-protests-turn-violent-20260210-p5o0y0.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Police defend actions after Herzog protests turn violent",
    "publish_date": "Tue, 10 Feb 2026 14:14:42 +1100",
    "category": "finance",
    "authors": [],
    "text": "Remove items from your saved list to add more.\n\nYou have reached your maximum number of saved items.\n\nSave this video for later\n\nAdd videos to your saved list and come back to them anytime.\n\nGot it",
    "source": "TheAge",
    "cluster_id": 16
  },
  {
    "url": "https://www.theage.com.au/politics/federal/the-latest-illustrations-from-artist-alan-moir-20230608-p5df1x.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "The latest illustrations from artist Alan Moir",
    "publish_date": "Tue, 10 Feb 2026 14:09:42 +1100",
    "category": "finance",
    "authors": [],
    "text": "Remove items from your saved list to add more.\n\nYou have reached your maximum number of saved items.\n\nSave this gallery for later\n\nAdd galleries to your saved list and come back to them anytime.\n\nGot it",
    "source": "TheAge",
    "cluster_id": 17
  },
  {
    "url": "https://www.theage.com.au/politics/queensland/cfmeu-inquiry-live-updates-hearings-begin-again-in-queensland-after-two-month-break-20260209-p5o0so.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "CFMEU inquiry LIVE updates: Civil construction boss grilled as Queensland hearings begin after two-month break",
    "publish_date": "Tue, 10 Feb 2026 14:06:56 +1100",
    "category": "finance",
    "authors": [
      "Matt Dennien",
      "William Davis"
    ],
    "text": "Long says his organisation raised concerns with the government about BPICs “strong contravention” of federal workplace laws around coercion and adverse action.\n\nThis particularly related to the requirements to “force it down the supply chain” and effectively force contractors to comply with its terms to get government work.\n\nLong says, through a solicitor, his organisation had sought the opinion of the then Australian Building and Construction Commission, which was “there was potential non-compliance”.\n\nAfter raising that concern, Long says the Department of Housing and Public Works advised it had sought Crown Law advice which said “it was legal”, but refused to release this to him.\n\nFollowing this, Long says the words “not mandatory” started creeping into government talk about the policy.\n\n“So this is an ‘aspirational document. What we want you to do is use your best endeavours to comply with this, and also your usual best endeavours to make sure the supply chain also complies with this’,” Long says.\n\nCrown Law advice about other elements of the BPICs policy were also raised by Australian Workers’ Union state secretary Stacey Schinnerl in the last public hearing – which the government also refused to outline.\n\nAnd with some more talk about proposed “demerit points” for contractors under the policies, the inquiry now breaks for lunch until 2pm.",
    "source": "TheAge",
    "cluster_id": 18
  },
  {
    "url": "https://www.theage.com.au/sport/afl/demon-blow-viney-to-have-surgery-and-miss-three-months-20260210-p5o0y4.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Essendon appoints new chief from within; Viney lost to Demons for at least three months",
    "publish_date": "Tue, 10 Feb 2026 14:06:23 +1100",
    "category": "finance",
    "authors": [
      "Michael Gleeson",
      "Andrew Wu"
    ],
    "text": "Craig Vozzo is no longer CEO of Essendon, but will continue to assist the club. Credit: Justin McManus Roberts comes from the construction industry, where he has worked for over 30 years with construction consulting firm WT Partnership. A club director since 2022, Roberts was involved in Essendon’s VFL program and establishing their AFLW team at the Bombers’ spiritual home at Windy Hill, as well as being across their commercial operations, community programs and football department strategy. Sporting organisations do not usually hire a CEO from their board, though Cricket Australia took this step in 2018 when they appointed then-director Kevin Roberts to replace the long-serving James Sutherland. Essendon said Tim Roberts’ understanding of the club, coupled with his business acumen, led to him being identified as a candidate during the process, and he was encouraged to apply.\n\n“Tim has successfully built global businesses across a range of industries, and we are excited he can bring that experience and commercial acumen to his new role as CEO,” president Andrew Welsh said. “Tim has been an outstanding contributor to the club since joining in 2022, and his elevation to vice president last year was a reflection of the value he was already adding to the Bombers. “We have seen Tim’s impact firsthand in his time on the board, and he was clearly the best candidate for what Essendon needs, someone who can strengthen our culture, provide continuity and allow us to execute our club strategy. Roberts, who starts on Monday, is the Bombers’ fourth CEO in three years, following on from Vozzo, Andrew Thorburn and Xavier Campbell. Thorburn resigned after one day in the job.\n\n“The platform for success has been created by those who have gone before me, and I am proud to take on this challenge and continue Craig Vozzo’s incredible contribution,” Roberts said. Loading “The Essendon I grew up barracking for were league leaders on and off the field, proud of the red and black and seen as a fierce, courageous, confident and bold club. That’s my vision for this club, and along with Welshy, our board and leadership, we are determined to reclaim that space. “Essendon is a club that should be consistently competing for finals and premierships, be embracing and impactful in our community and commercially sustainable. “During my business career I learned that people are the cornerstone of your success, and footy clubs are no different. We have terrific talent across our club through the executive, coaches, staff and playing groups, and our focus is to get the best out of everyone, being galvanised and executing our club strategy.”\n\nViney succumbs to Achilles Michael Gleeson Jack Viney will have surgery on his Achilles injury on Tuesday and is set to miss at least three months, costing him most of the first half of the AFL season if his recovery goes well. The Demons will be without Jack Viney’s ball-winning abilities in round one. Credit: Getty Images As recently as late last week, Melbourne fitness staff were hopeful that Viney would avoid surgery and be available for the early rounds of the season.\n\nThat decision changed on Monday, with the 31-year-old leader booked for surgery. The Demons’ conservative rest and recovery plan to manage the Achilles issue and avoid surgery meant that, coupled with a back injury, Viney barely trained over the summer. Melbourne will hope All Australian small forward Kysaiah Pickett can move into the midfield to join Max Gawn Credit: Getty Images When in January the midfielder attempted to lift his training to the next level, his Achilles flared again while his back also caused problems. His lengthy absence means the Demons’ midfield, which was already to be re-cast after the trading out of Christian Petracca and Clayton Oliver in the off-season, and the trading in of former Saints captain Jack Steele, will now be almost unrecognisable from the midfield set-up that has carried the club for most of the last decade.\n\nOnly captain Max Gawn will remain of the regular midfield quartet that will take on the Saints at the MCG in round one on March 15. Gawn is playing for Victoria in the State of Origin match against WA on Saturday night. New Melbourne coach Steven King knew he was taking on the job with a different list to manage, but that is even more apparent now, without four players from the top 10 in the club’s best and fairest last year – Petracca was second, Oliver seventh and Viney 10th. Jake Bowey, who finished fourth, had surgery to repair a lisfranc injury in his foot in December, a procedure that was expected to sideline him for at least six months. The importance of the trading in of Steele from St Kilda has grown in significance to help keep experience around the ball for the Demons. The absences are expected to deliver more opportunities for promising young players Harvey Langford, Caleb Windsor and Xavier Lindsay.",
    "source": "TheAge",
    "cluster_id": 19
  },
  {
    "url": "https://www.theage.com.au/money/planning-and-budgeting/why-a-high-salary-won-t-save-you-from-these-common-money-problems-20260210-p5o10a.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Why a high salary won’t save you from these common money problems",
    "publish_date": "Tue, 10 Feb 2026 14:00:00 +1100",
    "category": "finance",
    "authors": [
      "Paridhi Jain"
    ],
    "text": "Advertisement\n\nMoneyPlanning & budgetingMoney psychology Opinion Why a high salary won’t save you from these common money problems Paridhi Jain Money contributor February 10, 2026 — 2:00pm\n\nFebruary 10, 2026 — 2:00pm Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share A A A\n\nThrough my education and coaching work, I’ve had the opportunity to work with a really diverse range of people, some who are financially struggling, but many who are already financially comfortable, from doctors and lawyers to senior professionals and business owners. Despite having a good income, many of them carry a nagging feeling of financial uncertainty and stress. They know they “should” be doing well, but somehow they can’t seem to get ahead. A six-figure salary won’t mean much if your fundamentals are still broken. Simon Letch Contrary to popular opinion, earning a high income won’t create financial success (many high-income earners live pay to pay), unless you know how to convert money into wealth. Today, I’m sharing some of the challenges that hold high-income earners back from creating the level of financial success that their income makes possible.\n\nAdvertisement\n\nThe inertia that comes with comfort It is not unusual for me to see clients who are financially struggling create bigger and more rapid changes in their financial life than some who are financially comfortable. When I started working in this space, this surprised me. I knew that with a few small changes, people could make a $50,000 and even $100,000 impact to their financial future. It seemed bizarre to me that someone who was in a position to make these changes with ease would be less inclined to do so than those who were struggling to get by. When you arrive at a place where you’re financially comfortable, you unlock the opportunity to grow. But there is an urgency that comes with struggle and pain that is a powerful driver of action. This is a key missing ingredient for so many people who are financially comfortable.\n\nAdvertisement\n\nThey do not have a strong enough drive to take action. They see their finances as just another administrative chore that they keep telling themselves they’ll get around to some time in the future. How do you overcome this inertia? When you no longer have pain and struggle driving your action, you have to switch gears and learn how to be motivated by desire. You have dreams you’ve probably talked yourself out of: Buying a dream home; Quitting your job to go travelling for a year; Retiring early; Sending your kids to private school. What if those dreams weren’t impossible? What if you could get there with a lot less work than you think? When you arrive at a place where you’re financially comfortable, you unlock the opportunity to grow not because you have to, but because you want to.\n\nAdvertisement\n\nWhy would you want to keep growing when you don’t have to any more? Because the goal of life isn’t just comfort, it’s aliveness. Comfort is nice. But that feeling of exhilaration you get when you create a version of your life that you barely thought was possible? That’s priceless. Trying to pay away the problem Editor's pick Opinion\n\nActive investing Novice to pro: How to go from $0 to $100K in investments Paridhi Jain Money contributor When you have money, it’s easier to just pay someone to figure it out for you. Dropping a few thousand dollars on a financial planner, buyer’s agent or investment adviser is not a huge deal. But working with financial professionals is not a substitute for developing your own financial capability. Unlike outsourcing other tasks – housekeeping, lawn-mowing, meal-prepping etc – there is a lot more on the line when you’re outsourcing your finances.\n\nAdvertisement\n\nIdeally, you should always be in the driver’s seat of your own financial life. That doesn’t mean you shouldn’t engage professionals – it just means their role should be to advise you, not to call the shots for you. The stronger your foundational understanding of your own finances, the more you can actively participate in the decision-making process. This will not only produce better outcomes long-term, but also significantly reduces the risks of engaging financial professionals. This is another way in which I find that people with less disposable income can end up better off long-term. They don’t have the luxury of dropping $5000 to $10,000 to outsource their financial decisions, so they have to find the time to figure things out the hard way: by themselves. In the process they build their financial capability and confidence, which becomes a lifelong asset. Meanwhile, I’ve seen high-income earners sink tens of thousands of dollars bouncing from one financial professional to another, hoping that “this one will work out”. In short, just because you can afford to outsource your financial decisions doesn’t mean you’re ready to, or that that’s the optimal place for you to start.\n\nAdvertisement\n\nIt pays (literally) to learn how to do some of the basics yourself first, so you are better equipped to handle a relationship with a professional long-term. It’s not hard, but it does take a bit of time and a bit of work. Earning a high income only gives you the potential for financial success. Whether you can actualise that potential depends on how well you can convert those earnings (money) into assets (wealth) through saving and investing. Paridhi Jain is founder of SkilledSmart, which helps adults learn to manage, save and invest money through financial education courses and classes. Advice given in this article is general in nature and not intended to influence readers’ decisions about investing or financial products. They should always seek their own professional advice that takes into account their own personal circumstances before making any financial decisions. Expert tips on how to save, invest and make the most of your money delivered to your inbox every Sunday. Sign up for our Real Money newsletter.\n\nSave You have reached your maximum number of saved items. Remove items from your saved list to add more. Share License this article More: Money psychology\n\nOpinion Paridhi Jain is the founder of financial education platform, SkilledSmart, which has helped hundreds of adults become financially confident by teaching them practical strategies to manage, save and invest their money.",
    "source": "TheAge",
    "cluster_id": 20
  },
  {
    "url": "https://www.theage.com.au/national/western-australia/wa-news-live-cyclone-weakens-to-a-tropical-low-as-it-crosses-the-coast-20260209-p5o0up.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "WA news LIVE: Cyclone weakens to a tropical low as it crosses the coast",
    "publish_date": "Tue, 10 Feb 2026 13:49:15 +1100",
    "category": "finance",
    "authors": [],
    "text": "A compliance blitz across WA’s regional abattoirs has revealed widespread safety issues, with 562 improvement notices and six prohibition notices issued across 19 facilities.\n\nWorkSafe said the most common reason for an improvement notice was guarding of machinery (81), followed by provision of a safe layout (52), maintenance (20), and emergency stops (18).\n\nThe watchdog, in a statement, said the most common tool used in the industry and the cause of the most lost time injuries was the knife.\n\n“Common issues relating to knives included workers walking around with knives, knives being left unsecured around the workplace, workers sharpening knives near other workers, and workers using damaged knives,” it said.\n\n“The best practice system seen in workplaces involved asset tracking, where workers received a sharp, sterilised knife at the start of their shift and returned the knife at the end of the shift for resharpening and storage.”\n\nWorksafe said it would continue to monitor the sector.",
    "source": "TheAge",
    "cluster_id": 21
  },
  {
    "url": "https://www.theage.com.au/national/western-australia/adrian-fini-s-280-million-smiths-beach-development-gets-watchdog-s-green-tick-20260210-p5o11z.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Adrian Fini’s $280 million Smiths Beach development gets watchdog’s green tick",
    "publish_date": "Tue, 10 Feb 2026 13:43:46 +1100",
    "category": "finance",
    "authors": [
      "Hamish Hastie"
    ],
    "text": "Advertisement\n\nNationalWADevelopment outrage Adrian Fini’s $280 million Smiths Beach development gets watchdog’s green tick Hamish Hastie February 10, 2026 — 1:43pm Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share A A A\n\nThe long-running fight against development at Smiths Beach in Yallingup has been dealt a huge blow after the Environmental Protection Authority recommended the project be approved. The EPA made public its recommendations to Environment Minister Matthew Swinbourne on Tuesday, five years after the Adrian Fini-led developer Smiths 2014 Pty Ltd first lodged the 42-hectare Smiths Beach Project proposal. The latest renders for the Smiths Beach development in WA’s South West. The project, valued at $280 million in 2022, includes a hotel, wellness centre, 61 holiday homes, campground, community hub and surf lifesaving club. The recommendation comes six days after Swinbourne approved Saracen Properties’ 121-room five-star Westin resort and residential village in Gnarabup, south of the Smiths Beach site.\n\nAdvertisement\n\nIn its press release, the EPA took the step of noting that “several members” of the EPA, including chair Darren Walsh declared a conflict of interest regarding the Smiths Beach proposal and were not “involved in any related discussions and/or decisions.” Walsh has a lengthy history working in the development sector, including at Satterley Property Group, and at JBS&G, the environmental consultancy that Fini used to prepare its application to the EPA. Locals have been fighting development at the site for more than two decades under the Save Smiths Beach Action Group banner, citing concerns about the level of clearing, fire risk, sewage impacts and the use of the controversial State Development Assessment Unit to gain planning approval. The proposal has also attracted criticism from the opposition and features in an ongoing opposition-led parliamentary inquiry into Labor Government planning procedures. Save Smiths Beach Action Group convenor David Mitchell said the EPA had ignored its own rulings in a 2009 proposal the suggested the western half of the development site on the headland should not be developed.\n\nAdvertisement\n\nRelated Article Property development Perth developer denies trying to ‘bypass’ planning process in bid to expand prime beach project “There’ll be a very happy group of Western suburbs businessmen today. There’s probably a long lunch being had in Subiaco,” he told ABC’s Mornings Program. “They have basically regurgitated the developer’s own proposal, and the EPA has capitulated. “It’s universal that all the government agencies are against development on the headland on both visual and environmental grounds.” The EPA made its recommendation subject to conditions around wastewater management, clearing and offsets of fauna habitat.\n\nAdvertisement\n\nThose offsets, proposed by Fini’s company, included rehabilitation of western ringtail possum and black cockatoo foraging habitat at three sites within the state government’s estate. Other conditions include requiring the developer to manage weeds at the site and 50 metres outside the development envelope, including on Crown land. “Maintaining habitat connectivity between vegetation in the development envelope and the Leeuwin-Naturaliste National Park is front and centre of the EPA’s conditions,” an EPA spokeswoman said. “Other measures in the proponent’s conservation significant Fauna Management Plan and Offset Strategy address feral animal control, nearby offset areas, and a community-based revegetation program. “And conditions relating to secondary foraging and dispersal habitat for the western ringtail possum contain a requirement for a conservation covenant. This includes establishment costs and long-term management and maintenance costs.”\n\nAdvertisement\n\nA Smiths Beach Project spokeswoman welcomed the EPA’s decision and said the company would adhere to the conditions. “Our project team of leading Australian landscape designers and architects have designed the coastal village, including its hotel and community facilities, in a way that is sensitive to the site’s environmental and cultural significance,” she said. Aerial view of Smiths Beach and the Smiths Beach Resort. Tourism WA “This brings us closer to realising our project vision of creating a world-class seaside village for the benefit of Western Australia and the South-West - enabling the local community and visitors to this state to share and enjoy the best aspects of our lifestyle and environment.” Fini was behind the Bunker Bay Resort, built south of Smiths Beach in 2004, and has been pursuing a development at the Smiths Beach site after purchasing it alongside several other families in 2014.\n\nAdvertisement\n\nThe previous owner’s proposal attracted the first iteration of the Save Smiths Beach community protest campaign, with locals claiming a win after the developer went on to become embroiled in a Corruption and Crime Commission investigation, along with several local councillors. The structure plan approved under the old owners’ proposal featured up to 500 tourism and residential dwellings, with the western side of the lot to be handed to the state government as a national park. Fini’s new proposal features a broader footprint but less density, which Fini in the past has said improved amenity and greater retention of vegetation. Last year, Fini’s company removed a planned ramp to Smiths Beach over community concerns it would act like a “sea wall”. The EPA’s recommendation will be open for a three-week public appeal period.\n\nAdvertisement\n\nVasse MP Libby Mettam said the EPA’s approval was disappointing, also pointing to the 2009 EPA decision, which recommended the western headland section not be built on. Start the day with a summary of the day’s most important and interesting stories, analysis and insights. Sign up for our Morning Edition newsletter.",
    "source": "TheAge",
    "cluster_id": 22
  },
  {
    "url": "https://www.theage.com.au/sport/aussies-clinical-first-run-20260210-p5o0wk.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Aussie's clinical first run",
    "publish_date": "Tue, 10 Feb 2026 13:14:23 +1100",
    "category": "sports",
    "authors": [],
    "text": "Aussie's clinical first run\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 23
  },
  {
    "url": "https://www.theage.com.au/business/markets/asx-set-to-edge-up-as-wall-street-advances-20260210-p5o0vt.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Tech stocks boost ASX; Aussie dollar strengthens",
    "publish_date": "Tue, 10 Feb 2026 13:09:10 +1100",
    "category": "finance",
    "authors": [
      "Staff Reporter"
    ],
    "text": "Advertisement\n\nUpdated BusinessMarketsWorld markets Tech stocks boost ASX; Aussie dollar strengthens Staff reporter Updated February 10, 2026 — 1:09pm ,first published February 10, 2026 — 5:25am Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share A A A\n\nTechnology stocks are leading the Australian sharemarket higher on Tuesday while Wall Street steadied overnight. The S&P/ASX 200 was up 28.1 points or 0.3 per cent, to 8898.20 just before 1pm AEDT, with nine of 11 industry sectors in positive territory. Wall Street’s benchmark index has made a positive start to the week. AP Mining stocks are mixed after a strong start to the session. BHP and Rio Tinto each jumped 1.3 per cent but Fortescue fell into the red to be 0.5 per cent lower. Among gold miners, Northern Star added 0.5 per cent while Evolution Mining lost 0.9 per cent. The price of silver surged by more than 7 per cent overnight, sending South32 up 1.9 per cent. Financial stocks are mixed, with National Australia Bank climbing 0.4 per cent, but Commonwealth Bank gave up 0.4 per cent, Westpac fell by 1.5 per cent and ANZ Bank lost 1 per cent. Macquarie Group rose 1 per cent after reporting, in a December quarter update on Tuesday, better profits across its four business units, including its commodities and global markets unit where profit was substantially up on the previous corresponding period.\n\nAdvertisement\n\nRelated Article Opinion\n\nWorld markets The looming D-Day that has sent shivers through Wall Street Stephen Bartholomeusz Senior business columnist Energy stocks climbed as oil prices strengthened. Woodside Energy gained 0.6 per cent, Santos rose 0.8 per cent and Yancoal was 0.9 per cent higher. Tech stocks strengthened, with WiseTech up 0.6 per cent and Xero 2.2 per cent, but there were gains elsewhere, with NextDC jumping 1.7 per cent and Technology One advancing 0.9 per cent. Childcare operator G8 Education slumped 15.6 per cent after announcing a $350 million non-cash impairment and telling investors it would scrap its final dividend and a pause its share buyback. “Sector conditions remain challenging,” G8 said. Australia’s biggest winemaker, Treasury Wine Estates, jumped 6.7 per cent after it settled a dispute with its former Californian distributor and told investors it expected its first half earnings to be $236 million, above its previous guidance.\n\nAdvertisement\n\nThe global wine giant will purchase the stock held by Republic National Distributing Company, which shut its Californian operations in September 2025, for a confidential sum that compensates Treasury Wine for its closure. The Penfolds maker expects settlement costs of $65 million in the second half of the financial year. The Australian dollar continues to strengthen, trading at US70.89¢ at 1.08pm AEDT. Overnight, the S&P 500 rose 0.5 per cent and inched closer to its record set two weeks ago. The Dow Jones was down 13 points, or less than 0.1 per cent, and the Nasdaq composite was 1 per cent higher. The relatively modest moves followed a 3.9 per cent burst higher for Japan’s Nikkei 225 to a record. Stocks rallied in Japan following a landslide victory for the prime minister’s political party in a parliamentary election. The thought is that will give Sanae Takaichi more power to push through reforms that will boost the economy and market. On Wall Street, the US stock market is coming off its best day since May to close last week, but several concerns still hang over it. That includes criticism that stocks have simply become too expensive following their run to records.\n\nAdvertisement\n\nWorries are also heavy about whether all the huge spending by Big Tech and other companies on AI can produce enough profit to make the investments worth it. Related Article Opinion\n\nLuke Sayers The prince of business networking, the lewd pic and the ghost poster Elizabeth Knight Business columnist Slightly more stocks fell in the S&P 500 than rose, but some of the winners from that rush into AI helped prop up the market. Chip companies rose, for example, with Nvidia up 3.4 per cent and Broadcom up 4 per cent. They were two of the strongest forces pushing upwards on the S&P 500. On the losing end was Hims & Hers Health, which sank 24.5 per cent after Novo Nordisk filed a lawsuit and alleged Hims & Hers is unlawfully selling versions of its weight-loss treatments. The suit follows a move by the US Food and Drug Administration to restrict access to the ingredients needed to copy popular weight-loss medications. In the bond market, Treasury yields held relatively steady ahead of several potentially market-moving reports coming later in the week. The US government will offer the latest monthly update on the health of the job market on Wednesday. Friday will bring the latest monthly reading of inflation at the consumer level.\n\nAdvertisement\n\nBitcoin dipped back towards $US70,000 after climbing above $US71,000 at the weekend. It had dropped close to $US60,000 last week, more than halfway below its record set in October. With AP The Market Recap newsletter is a wrap of the day’s trading. Get it each weekday afternoon.\n\nSave You have reached your maximum number of saved items. Remove items from your saved list to add more. Share More: World markets\n\nWall Street\n\nShares",
    "source": "TheAge",
    "cluster_id": 24
  },
  {
    "url": "https://www.theage.com.au/sport/nrl/souths-haas-signing-steals-show-at-nrl-launch-20260210-p5o12i.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Souths’ Haas signing steals show at NRL launch",
    "publish_date": "Tue, 10 Feb 2026 12:55:08 +1100",
    "category": "sports",
    "authors": [],
    "text": "Souths’ Haas signing steals show at NRL launch\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 25
  },
  {
    "url": "https://www.theage.com.au/goodfood/melbourne-eating-out/lune-lonsdale-20260210-p5o11r.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Lune Lonsdale",
    "publish_date": "Tue, 10 Feb 2026 12:22:15 +1100",
    "category": "finance",
    "authors": [
      "Tomas Telegramma"
    ],
    "text": "Add articles to your saved list and come back to them anytime.\n\nRemove items from your saved list to add more.\n\nYou have reached your maximum number of saved items.\n\n1 / 5 Almond croissants. Simon Schluter 2 / 5 Pastry chefs prepare croissants at Lune bakery in Lonsdale Street, Melbourne. Simon Schluter 3 / 5 The opening special is a twice-baked croissant filled with “choc chip” frangipane and topped with Chappy’s chips. Supplied 4 / 5 Ready to be baked. Simon Schluter 5 / 5 The Lune team preparing pastries on site ahead of opening day. Simon Schluter Previous Slide Next Slide\n\nBakery$$$$\n\nDubbed “Maxi Lune”, Lune’s fourth Melbourne store beneath the Ritz-Carlton hotel in the west end churns out more than 6000 croissants a day. Designed by local studio In Addition, the 418-square-metre shopfront and production site has soaring ceilings, a sprawling concrete bench laid with one of each pastry, and its signature glass-walled “cube” where you can peer in on the pastry being laminated – centimetres away from an inside bench seat, or through a huge window from the footpath. It’s also got the most seating of any Lune store, with room for 50 people.\n\nPastries are baked fresh throughout the day, so you can get them while they’re still warm. That includes the bestselling almond croissant and the second-bestselling traditional croissant, as well as monthly specials and Lune Lonsdale exclusives.\n\nWant to visit this venue? Save it in the Good Food app.",
    "source": "TheAge",
    "cluster_id": 26
  },
  {
    "url": "https://au.news.yahoo.com/rebel-wilson-stand-fiery-film-025728311.html",
    "title": "Rebel Wilson to take stand in fiery film showdown",
    "publish_date": "2026-02-10T02:57:28Z",
    "category": "finance",
    "authors": [],
    "text": "Hollywood A-lister Rebel Wilson has been slammed in court after sacking her original lawyers and leaving her new legal team in the lurch during a high-profile film feud.\n\nThe 45-year-old and her firm Camp Sugar are being sued by the production company behind The Deb, a musical comedy filmed in rural NSW that Wilson produced and directed, while also starring.\n\nShe will be made to testify in September to defend claims she breached her contract with AI Film Production, gave misleading statements and made injurious falsehoods.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nThe Pitch Perfect star was lambasted in the NSW Supreme Court on Tuesday by the production company's barrister for not complying with the timetable for the case.\n\nBarrister Sue Chrysanthou said Rebel Wilson had given no explanation why she sacked her lawyers. (Bianca De Marchi/AAP PHOTOS)\n\nSue Chrysanthou SC also criticised Wilson for firing her old lawyers days before the directions hearing.\n\n\"No explanation has been provided ... for the timing of that decision and why she couldn't wait until today to make that decision,\" she said.\n\n\"(There is no explanation) why when she terminated her lawyers, on Tuesday she didn't have other lawyers ready to go.\"\n\nWilson's new barrister was forced to plead ignorance over much of the details of the case, including the arguments the actor plans to use in her defence.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\n\"A question of good faith may be inferred from the context of the dealings between the parties,\" Dauid Sibtain SC said.\n\n\"I don't know what we say that context was.\"\n\nHe conceded it was unacceptable that Wilson had failed to comply with orders to produce evidence.\n\nThe Deb premiered at Toronto International Film Festival in September 2024 but has been blocked from wider distribution by the ongoing legal action.\n\nWilson has been paid over $1 million for her roles as actor, director and producer in the still-unreleased film.\n\nAI is seeking damages for lost revenue, but Ms Chrysanthou said calculating lost income would be impossible until box office takings from its eventual release could be assessed.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nA proposed release date of April had been flagged for the film, she said.\n\nWilson and the production company are set to face off during a two-week hearing, scheduled to begin on September 14.\n\nFour witnesses - including Wilson - will be called to provide the bulk of the evidence, the court was told.\n\nProducers Amanda Ghost and Vince Holden are also expected to testify along with star of the film, Charlotte MacInnes.\n\nWhile one dispute heads towards a climax, the troubled film and its cast and crew remain embroiled in other lawsuits spanning different continents.\n\nWilson is also facing a defamation suit brought by MacInnes in the Federal Court over social media posts that claimed the younger actor revealed she was subjected to sexual harassment.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nMacInnes' denials that any sexual misconduct took place have not deterred Wilson, who stands by the claims.\n\nIn California, Ghost and Holden have sued Wilson for defamation over allegations including embezzlement, sexual harassment of MacInnes and obstruction of the film's release.\n\nWilson has attempted to counter-sue, but a judge in January indicated he would likely strike all of her claims from her complaint.\n\n1800 RESPECT (1800 737 732)\n\nNational Sexual Abuse and Redress Support Service 1800 211 028",
    "source": "Yahoo",
    "cluster_id": 31
  },
  {
    "url": "https://au.news.yahoo.com/major-sydney-road-shutdown-crash-025709431.html",
    "title": "Major Sydney road shutdown after crash",
    "publish_date": "2026-02-10T02:57:09Z",
    "category": "finance",
    "authors": [],
    "text": "A major highway has been partially shut after reports of a bus hitting a pedestrian in Sydney’s inner west.\n\nThe Princes Highway is closed northbound between Forest Road at Arncliffe and Union Street at Tempe.\n\nThe NSW Transport Management Centre has advised to motorists avoid the area and instead take Marsh Street and Airport Drive.\n\nThe heavy traffic comes after reports of a crash. Picture: NewsWire/ Tim Pascoe\n\n“Northbound traffic already in the area is being diverted via Gannon Street and Unwins Bridge Road,” the transport authority said in a statement.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\n“Traffic is very heavy. Motorists are advised to allow plenty of extra travel time.\n\n“Additionally, route 422 and 348 buses are starting and ending their trips early through the area.”\n\nEmergency services and traffic crews are on site.\n\nMore to come.",
    "source": "Yahoo",
    "cluster_id": 32
  },
  {
    "url": "https://au.finance.yahoo.com/news/aussie-meat-high-demand-despite-025456973.html",
    "title": "Aussie meat in high demand despite international beef",
    "publish_date": "2026-02-10T02:54:56Z",
    "category": "finance",
    "authors": [
      "Stephanie Gardiner",
      "Mon February At Pm",
      "Min Read"
    ],
    "text": "Australian beef continues to be in hot demand around the world despite trade barriers, as the government continues talks with China over its surprise import tariffs.\n\nChina unveiled 55 per cent ‍tariffs on beef imports over certain quotas for nations including Australia in an unexpected move implemented on New Year's Day.\n\nThe measures were designed to protect China's local producers, with Australia allocated ‌205,000 tonnes of the nation's total 2.7 million tonnes quota for 2026.\n\nAustralia exported 270,000 tonnes of beef to China in 2024/25, worth about $2.8 billion, according to Australian Bureau of Agricultural and Resource Economics and Sciences data aired at Senate estimates on Tuesday.\n\nJared Greenville believes Australian beef exports will find markets to replace any losses in China. (Lukas Coch/AAP PHOTOS)\n\nThe effect of China's tariffs could be offset by the reasonably flexible global market and ongoing strong demand for Australian beef, the bureau's executive director Jared Greenville said.\n\n\"We continually look at ... that global geopolitical space and the vulnerability across our trading environment,\" Dr Greenville told the hearing in Canberra.\n\n\"One of the things that's key in that is the movement and the flexibility between different markets.\"\n\nAustralia was made aware of China's tariffs on December 30, one day before they took effect, acting head of the department's trade and international division Alistair Campbell said.\n\nNationals senator Matt Canavan has been questioning bureaucrats over Australia's beef industry. (Lukas Coch/AAP PHOTOS)\n\nThe government and the media found out about the restrictions around the same time, he said under questioning from Nationals senator Matt Canavan.\n\nAgriculture Minister Julie Collins and Trade Minister Don Farrell have since been in contact with Chinese officials, with the most recent letter sent on Monday.\n\n\"The government has been quite forward-leaning in saying that they're very disappointed with this decision,\" Mr Campbell told the hearing.\n\nThe US remained Australia's biggest market for red meat, with 10 per cent tariffs imposed by President Donald Trump removed in late 2025.\n\nBeef exports to the US were worth $5.2 billion each year and the demand for sheep meat was also strong, exports and veterinary services first assistant secretary Tom Black said.\n\nCattle prices are down after producers in flood and fire-affected regions sold off stock. (Dan Peled/AAP PHOTOS)\n\n\"Demand into the US market is incredibly high,\" Mr Black said.\n\n\"The US herd is at historical lows and they're seeking to take product from not only Australia, but other markets as well.\"\n\nLocal cattle prices had started to wane as producers in flood and fire-affected regions sold off stock, Bendigo Bank's monthly market update said.\n\nBut beef export volumes reached a record high at 20 per cent above the five-year average for January.\n\n\"While most demand is coming from the US and China, China's new import quota on Australian beef may start to impact this in 2026,\" the update said.",
    "source": "Yahoo",
    "cluster_id": 33
  }
]