[
    {
        "url": "https://www.9news.com.au/national/police-and-asic-raid-wisetech-offices/a252fa05-cfcd-48e4-bb3e-d9476e6fbb33",
        "title": "Police raid offices of $28b Aussie tech giant",
        "publish_date": "Tue, 28 Oct 2025 00:25:44 +0000",
        "category": "finance",
        "authors": [
            "Oct"
        ],
        "text": "The Australian Federal Police and the financial watchdog have raided the Sydney offices of software giant WiseTech.\n\nDuring yesterday's operation, police officers and Australian Securities and Investments Commission (ASIC) officials requested documents related to alleged ﻿share trading by billionaire co-founder Richard White and three other employees from late last year to early 2025, the board said in a statement to the ASX today.\n\n\"So far as WiseTech is aware, no charges have been laid against any person, and there are no allegations against the company itself,\" it said.\n\nREAD MORE: Two dead after mine explosion near regional town\n\nRichard White, the co-founder of software company WiseTech. (Dominic Lorrimer)\n\n\"WiseTech intends to fully co-operate with any investigation.\"\n\nA spokesperson for ASIC said today it had executed a search warrant, with the assistance of the AFP.\n\n\"As the investigation is ongoing, ASIC is unable to provide further comment at this time,\" it said.\n\n﻿WiseTech, a leading logistical software company, employs about 17,000 staff worldwide.\n\nThe company has a market capitalisation of $28.5 billion.\n\nThe leadership of White, who stepped down as chief executive last year but remains executive chairman, has come under scrutiny over recent months.﻿\n\nThe company has been beset with reports over complaints about inappropriate conduct regarding White's personal life, including ﻿his relationships with female WiseTech staff members.\n\nWhite left the WiseTech board last year.\n\nA joint investigation by the Australian Financial Review, Sydney Morning Herald, and The Age in February found White had sold more than $200 million worth of WiseTech shares over a length of time when directors and executives were banned from selling company stock, known as a blackout period.\n\nThe ASIC investigation is likely to come down to whether or not the sale of shares was made using privileged information not available to other investors.﻿\n\nWiseTech shares dropped 17 per cent to $70.68 today following the announcement of the AFP and ASIC raid.﻿",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/telcos-forced-to-make-outages-public-in-realtime-with-fines-for-triplezero-impacts-increased-to-30-million/49a0146c-2afc-44ea-a749-e9e28fb6a03a",
        "title": "Telcos forced to make outages public with fines for triple-zero failures increased to $30m",
        "publish_date": "Tue, 28 Oct 2025 00:50:37 +0000",
        "category": "finance",
        "authors": [
            "Oct"
        ],
        "text": "Telcos will need to share their network outages in real-time on a public ﻿register and face increased fines of $30 million if customers cannot connect to the triple-zero system.\n\nCommunications Minister Anika Wells has written to the regulator to formally direct it to strengthen the transparency of network outages and require telcos to maintain a public register.﻿\n\n\"I am writing to advise that I have decided to formally direct the ACMA to make new rules to strengthen the telecommunications regulatory framework,\" she wrote in an excerpt of the letter.\n\nCommunications Minister Anika Wells. (Getty)\n\n\"I will be issuing a Direction to the ACMA to amend the Telecommunications (Customer Communications for Outages) Industry Standard 2024 to mandate that telecommunications providers maintain a public register of their network outages.\"\n\nTelcos are already legally required to report outages, but it is not always readily available to the public,﻿ with information spread across websites and social media pages.\n\nUnder the formal direction, customers would have access to real-time data in one location﻿, similar to the way energy companies and state fire departments have live maps detailing current incidents on their websites.\n\nAustralia's peak consumer body, the Australian Communications Consumer Action Network (ACCAN), has been calling for a public register and welcomed the news.\n\n\"Confidence in triple zero and telco services overall has taken a significant hit over recent times. This register is so important to stabilise community concerns,\" ACCAN chief executive ﻿Carol Bennett said.\n\nThe federal government is trying to ﻿rebuild Australia's confidence in the triple-zero system after three people died in an Optus triple-zero outage last month.\n\nOptus CEO Stephen Rue facing the media over last month's triple-zero outage. (Sitthixay Ditthavong)\n\nThe under-siege telco then experienced a second outage just days later, shaking the public's already dwindling trust . ﻿\n\nThe government has introduced fast-tracked legislation in parliament to establish a triple-zero \"custodian\" to oversee the network.\n\nDuring a debate over the bill in the Senate yesterday, Labor agreed to calls from the Greens and Coalition to increase the penalties for triple-zero outages to $30 million.\n\n﻿\"We are not on the side of corporate criminals on this side of the chamber, and we will certainly make sure that these penalties signify what the community standard and expectation is, but also from the government,\" Labor's Nita Green, who introduced the bill in the Senate on behalf of Wells, said.\n\nToday, the Senate will vote to establish a Senate inquiry into Optus' triple-zero outage last month, with the Greens and the Coalition appearing to team up to help get it over the line.\n\nOptus has commissioned an internal investigation and also remains under investigation by the Australian Communications and Media Authority (ACMA). ﻿",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/tomago-aluminium-staff-warned-over-future-of-aluminium-smelter/3aaefcae-c23d-4459-9ce8-908de7eabbf2",
        "title": "'Unviable': Over 1000 Aussie jobs in doubt",
        "publish_date": "Mon, 27 Oct 2025 23:19:09 +0000",
        "category": "finance",
        "authors": [
            "Oct"
        ],
        "text": "Over 1000 staff at Australia's biggest aluminium smelter have been warned that the plant's future is in doubt as government negotiations over untenable energy costs stall.\n\nRio Tinto-owned Tomago ﻿Aluminium said it has reached a \"difficult point\" and has started a consultation process with employees for when its electricity contract with AGL expires in 2028.\n\nThe miner said it has been undertaking a \"comprehensive market-sounding process﻿\" to reach a solution for its NSW smelter since 2022, but is yet to identify a commercially-viable path forward.\n\nREAD MORE: Two dead after mine explosion near regional town\n\nRio Tinto-owned Tomago ﻿Aluminium said it has reached a \"difficult point\". (Instagram/tomago_aluminium)\n\nTomago has been in years-long talks with state and federal ministers for ways to bring down its soaring energy prices and keep the smelter open.\n\nTomago chief executive Jérôme Dozol described the projected energy costs as \"not commercially viable\".﻿\n\n\"﻿We continue to engage with stakeholders on a viable pathway for Tomago,\" Dozol said.\n\n\"Unfortunately, all market proposals received so far show future energy prices are not commercially viable, and there is significant uncertainty about when renewable projects will be available at the scale we need.\n\n\"While no decision has been made, this is a difficult point to reach. Our focus remains on operating safely and giving our people certainty as soon as possible.\"\n\nElectricity accounts for more than 40 per cent of Tomago Aluminium's operating costs, Tomago said.\n\n\"Based on market proposals received to date, the cost of both coal-fired and renewable energy options from January 2029 would increase significantly, fundamentally changing operating economics and leaving the smelter unviable,\" the smelter said in a statement.\n\nIt has reached a point where the smelter may consider ceasing operations by the end of 2028.\n\nREAD MORE: Pauline Hanson changes party name as polling support surges\n\nTomago has been in years-long talks with state and federal ministers for ways to bring down its soaring energy prices. (Instagram/@tomago_aluminium)\n\n﻿An official decision has not yet been made.\n\nThe consultation process with staff will run until November 21.\n\nTomago Aluminium was founded in 1983 and produces up to 590,000 tonnes of aluminium per year, making it the country's largest smelter.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/employment-hurdles-facing-older-australians/807e507a-1cf8-4819-ae49-10a99cf0cf27",
        "title": "Older Australian job seekers 'facing unique obstacles' in tighter employment market",
        "publish_date": "Mon, 27 Oct 2025 18:32:40 +0000",
        "category": "finance",
        "authors": [
            "Oct"
        ],
        "text": "New research has shed a light on the hurdles facing older Australian job seekers amid a tightening labour market.\n\nThis month Australian Bureau of Statistics (ABS) figures revealed the country's unemployment rate had reached a four-year high of 4.5 per cent.\n\nAccounting software company Reckon has crunched the data to reveal the challenges facing job seekers across every age group.\n\nMore workers aged 55 in and over in Australia are putting retirement off. (iStock)\n\nAbout one in seven people across all age groups looking for work say there are too many applicants for too few roles, with employers flooded by resumes, the study showed.\n\nBut Australians aged 55 and above face a major obstacle in the form of being perceived too old for the job by prospective employers.\n\nTheir personal health issues and having to care for elderly family members were also holding them back from seeking a job, or forcing them to quit one.\n\nFor those aged 64 and over, 44 per cent were considered too old to perform the role, while employers regarded 21 per cent of job seekers in the 55 to 64 years age bracket as past it.\n\nPersonal health issues impacted 26 per cent of those above 65 and 20 per cent aged 55 to 64.\n\nResponsibilities for older relatives are also increasing for people in their mid-fifties and sixties, reflecting an ageing population.\n\nTop 20 Aussie jobs that pay over $150,000 revealed View Gallery\n\nThe research showed shifting retirement patterns amid a tight labour market were pitting younger and older generations against each other in the hunt for jobs.﻿\n\nFor those aged in their late forties and early fifties, fewer people are retiring, though women remain more likely than men to step away from work.\n\nAmong 55 to 64-year-olds, retirement is also declining, with women again more likely than men to retire.\n\nBeyond 65, retirement remains common, but more people are continuing to work past traditional retirement age, particularly men, reflecting changing financial needs, longer life expectancy, and changing attitudes towards work later in life.\n\nBut there are concerns ﻿employer bias is blocking many skilled people from employment that is essential to the national economy.\n\n\"With retirement ages creeping higher, we can't afford to sideline people who still have plenty to offer,\" said Reckon general manager Alex Alexandrou.\n\n\"If we can get better at supporting both early careers and later careers, we'll build a stronger, fairer workforce that makes the most of every generation.\"",
        "source": "9News"
    },
    {
        "url": "https://www.abc.net.au/news/2025-10-28/how-the-social-media-ban-will-impact-teens-with-a-disability/105929756",
        "title": "How the social media ban will impact teens with a disability",
        "publish_date": "Tue, 28 Oct 2025 01:34:49 +0000",
        "category": "finance",
        "authors": [],
        "text": "For 15-year-old Wren Alfaro, social media has been a lifeline.\n\nWren is a teenager who has difficulty walking, chronic fatigue, ADHD and autism.\n\nFor them, finding a community on Instagram has connected them with people with similar interests who understand what it is like to be a teenager with a disability.\n\nFor 15-year-old Wren Alfaro, social media has been a lifeline. (ABC News Breakfast)\n\nWren also enjoys watching fun videos on YouTube and talking to friends on social media.\n\nIn less than two months, Australia's social media ban for teens under 16 will take effect.\n\nThe world-first ban will extend to Facebook, Instagram, Snapchat, TikTok, Twitter/X, and YouTube, amongst other platforms.\n\n\"Some days I can't even go to school, so it's my only way of being able to have some time with friends,\" Wren tells the ABC.\n\nCome December, Wren is worried they could end up losing contact with friends and online communities due to being banned from social media.\n\n\"Because I personally have a physical disability, I struggle to get out a lot,\" they say.\n\n\"[Social media] helps me engage with my community without having to go out and struggle through painful days.\"\n\nFinding a safe environment\n\nWren's concerns are shared by advocates working in the disability support sector.\n\n\"Social media allows teenagers with a disability to connect to their friends in an easy and safe environment,\" CEO of Children and Young People with Disability Australia Skye Kakoschke-Moore says.\n\nSkye Kakoschke-Moore says the ban shouldn't apply to teens with disability. (ABC News Breakfast)\n\n\"A lot of our public spaces aren't built to meet the needs of people with a physical disability,\" she says.\n\n\" I think it is worth exploring having an exemption for teens with disability to the ban on social media. \"\n\nIgnored by the government\n\nWren understands social media can have its drawbacks.\n\n\"Although there are harmful ways that social media can impact young people, it's been amazing for me,\" they say.\n\nDisability and mental health advocate Emily Unity says that social media and online spaces give teens a voice.\n\nEmily Unity says social media and online spaces give teens a voice. (ABC News Breakfast)\n\n\"If you remove those lifelines, they are not going to be able to seek help in the way that they most prefer and that is most accessible to them,\" they said.\n\n\" This is an incredibly disempowering law that shows them that the government doesn't really care about what they think. \"\n\nThe federal government's Online Safety Amendment was passed last November with bipartisan support.\n\nE-Safety Commissioner Julie Inman Grant says the government is not banning the internet and cites the exemption for online gaming platforms and messaging apps.\n\n\"This is really a social media delay for those between the ages of 13 and 17.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-10-28/tas-public-sector-teacher-strikes-tuesday/105941232",
        "title": "'Feeling undervalued': Teachers, other public workers begin strikes in Tasmania",
        "publish_date": "Tue, 28 Oct 2025 01:26:22 +0000",
        "category": "finance",
        "authors": [],
        "text": "Tasmanian teachers, health workers, firefighters and other public sector employees in the state's north-west have walked off the job, as the fight over pay and conditions intensifies.\n\nFurther action is planned for Launceston and the rest of the north tomorrow, and then in the state's south on Thursday.\n\nThe tension has been brewing for weeks, with unions rebuking the state government's temporary offer of a 3 per cent pay rise for the first year, while they negotiate a long-term deal.\n\nThe government offer also includes changes to leave, including parental, medical, reproductive, gender affirmation and pregnancy loss entitlements.\n\nBut it has been rejected, with workers claiming they had been treated with \"contempt\", pushing hundreds to rally at Burnie and Devonport.\n\nHellyer College teacher Ronan Douglas addressed the crowd, detailing how dispirited teachers were feeling as their workload mounts.\n\n\"It's quite crushing,\" Mr Douglas said.\n\n\"Every day we're pretty well letting our students down with the conditions that we're put under.\n\n\"Day to day, we're catching up on emails, we're doing wellbeing referrals, we're checking attendance, we're following up with phone calls, checking in with parents, checking in with staff, doing professional learning, and just otherwise trying to mark, plan lessons.\"\n\nFurther rallies are planned for the north and south of the state in the coming days. (ABC News: Mackenzie Heard)\n\nHe said much of that work, and far more, was done out of hours.\n\nThe Australian Education Union member said the government needed to not only increase pay, but prioritise smaller class sizes and protect planning time.\n\n\"We're really feeling undervalued, under-respected, and it's really important that the government looks at us, and respects us for the work that we're doing,\" Mr Douglas said.\n\nPublic schools in the north-west did not open their doors until 11am on Tuesday.\n\nUnions claim Tasmanian teachers' pay is more than 5 per cent behind the mainland. They are calling for a 10 per cent increase in the first year, and 5 per cent in subsequent years.\n\n\"Workers are extremely angry, they're not going to stop until the government actually treat them with respect, and that's what this is about — fair wages, fair conditions,\" Tasmanian Health and Community Services Union secretary Robbie Moore said.\n\n\"The reality is the government have to take this seriously and stop mocking workers with pathetic offers like they have been so far.\"\n\nThe health services union says better pay is needed to increase the workforce and reduce reliance on overtime and locums. ( ABC News: Luke Bowden )\n\nA major sticking point is the recent 22 per cent pay bump for Tasmanian parliamentarians, which was recommended by the state's Industrial Commission after a seven-year pay freeze.\n\nThe Liberal government had tried to stop the pay increase but a motion to keep pay frozen failed to pass after Labor and upper house independents did not support it.\n\nThe pay rise for politicians equates to a 3.1 per cent increase over each of the seven frozen years.\n\n\"Telling workers on very low wages that they can afford just a 3 per cent pay rise is an absolute disgrace; I've never seen a more hypocritical line from a government in my life,\" Mr Moore said.\n\nPublic sector workers say they're struggling with high workloads and feeling undervalued. (ABC News: Mackenzie Heard)\n\nHe said a larger pay increase would be better for the state budget, because the health system would not have to pay hefty overtime rates and exorbitant locum doctor fees.\n\n\"It's the recruitment and retention issues that mean that we are working short in our hospitals and across our health system everyday, so we need decent wages and conditions,\" he said.\n\n\"We can't afford to let this fail. If the government doesn't deliver decent wages and conditions, we will not be able to deliver health services to the community.\"\n\nHospital staff say situation is 'the worst it's ever been'\n\nDayna French says many employees at the North West Regional Hospital feel \"overlooked\". (ABC News: Mackenzie Heard)\n\nDayna French, who has works in food services at the North West Regional Hospital for 28 years, said employees were \"struggling\" with low wages and short staffing.\n\n\"It's the worst it's ever been,\" she said.\n\n\"We do feel overlooked a lot, all of us.\n\n\"They don't think much of us, but we are the backbone of the hospital. Without food services or domestics or orderlies, there is no hospital.\"\n\nGovernment 'disappointed'\n\nGovernment minister Felix Ellis defended the offer, saying it was \"fair and affordable\", and above the inflation rate.\n\n\"We're disappointed that strike action is being taken today,\" Mr Ellis said.\n\n\"Particularly when it comes to the school strikes, because every school day matters … this strike is disruptive, it's disruptive for students, it's also disruptive for parents and small businesses.\n\n\" We'll continue to bargain in good faith, and I just encourage our public sector unions to do so as well. \"\n\nThe strikes will continue in the north on Wednesday, and the south on Thursday.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-10-28/celtic-manager-brendan-rodgers-quits-postecoglou-speculation/105941616",
        "title": "Celtic boss quits, prompting speculation of a return for Ange Postecoglou",
        "publish_date": "Tue, 28 Oct 2025 00:42:02 +0000",
        "category": "sports",
        "authors": [],
        "text": "Brendan Rodgers, who succeeded Ange Postecoglou as Celtic manager, has resigned and former boss Martin O'Neill and Shaun Maloney have been put in charge of the Scottish giants on a temporary basis.\n\nThe move has prompted speculation that Postecoglou could return to the club that he led in two highly successful seasons before moving to England in 2023.\n\nHe was recently sacked from his second English Premier League job with Nottingham Forest.\n\nRodgers's second spell at Celtic ended after Sunday's 3-1 Scottish Premiership defeat at Hearts left the team eight points adrift of the Edinburgh side.\n\nBrendan Rodgers resigned after a 3-1 loss to Hearts. (Getty Images: SNS Group/Craig Williamson)\n\nThe beleaguered champions have dropped 10 points in their opening nine matches.\n\n\"Celtic Football Club can confirm that football manager Brendan Rodgers has today tendered his resignation,\" a club statement released late on Monday read.\n\n\"It has been accepted by the club and Brendan will leave his role with immediate effect.\n\n\"The club appreciates Brendan's contribution to Celtic during his two very successful periods at the club.\n\n\" The process to appoint a new permanent manager is underway and the club will update supporters further on this as soon as possible. \"\n\nStream End Game with Tony Armstrong on ABC iview Tony Armstrong will tackle Australia's overdue reckoning with racism in sport, with the help of some of its biggest sports stars.\n\nPostecoglou won back-to-back Scottish League titles with Celtic and the domestic treble in 2022-23 before moving to English club Tottenham.\n\nDespite leading Spurs to a breakthrough Europa League triumph earlier this year he was sacked shortly afterwards, primarily due to a poor league record.\n\nThe 60-year-old then lasted eight winless games at Nottingham Forest before being dumped for the second time in five months.\n\nAAP",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-10-28/prisoner-death-in-custody-tasmania/105942044",
        "title": "Prisoner dies in custody in Tasmania",
        "publish_date": "Tue, 28 Oct 2025 00:37:43 +0000",
        "category": "finance",
        "authors": [],
        "text": "A female Tasmanian prisoner has died in custody, the state's prisons director has confirmed.\n\nThe prisoner died on Monday but no further details of the incident or where it occurred have been released.\n\n\"On behalf of the Tasmania Prison Service I extend my sincere condolences to the family and friends of the deceased woman at this difficult time,\" director of prisons Narelle Pamplin said in a statement.\n\n\"The Tasmania Prison Service will not be making any further comment as the matter will now be referred to the coroner for examination.\"\n\nMs Pamplin said it was standard practice for all deaths in a corrections environment to be referred to the coroner.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-10-28/tomago-aluminum-closure-risk-energy-price-increase/105941120",
        "title": "Energy prices threaten future of Australia's biggest aluminium smelter",
        "publish_date": "Tue, 28 Oct 2025 00:17:13 +0000",
        "category": "finance",
        "authors": [],
        "text": "Australia's largest aluminium smelter is consulting with employees about the future of its operations as it struggles with rising energy costs.\n\nIn a statement released this morning Tomago Aluminium said it was yet to identify a pathway that supported commercially viable operations beyond the expiration of its energy contract in 2028.\n\nThe smelter, located north of Newcastle, employs more than 1,000 people and produces almost 40 per cent of Australia's annual aluminium output.\n\nThe company said finding competitively priced energy remained a \"central challenge\".\n\nTomago Aluminium is the country's largest single user of electricity and its energy costs account for more than 40 per cent of its operating costs.\n\nThe company said the increased cost of coal-fired and renewable energy options from 2029 would render the smelter \"unviable\".\n\nFor months the company's majority owner, Rio Tinto, has been in discussions with state and federal governments about interventions to avoid closure.\n\nThe company said it had also engaged in a \"market-sounding\" process since 2022.\n\nBut Tomago Aluminium chief executive Jérôme Dozol said none of the options presented would be enough to keep the smelter running.\n\n\"Unfortunately, all market proposals received so far show future energy prices are not commercially viable and there is significant uncertainty about when renewable projects will be available at the scale we need,\" he said.\n\nNo final decision has been made about the smelter's future at this stage.\n\nGrim forecast from union\n\nAustralian Manufacturing Workers' Union NSW secretary Brad Pidgeon said today's announcement was another blow for the manufacturing sector.\n\n\"It's very disappointing for the workers and community by and large, but I think it really validates the sad news that's going to occur moving into the future,\" he said.\n\nThe union has been in discussions with Tomago for the last 12 months about the smelter's future but Mr Pidgeon said no definite decision had been communicated to workers.\n\n\"Today's announcement firms up that, unfortunately, the business is highly unlikely to operate post 2028,\" he said.\n\nMr Pidgeon said he would like to see the government and Tomago come to the table and offer support for workers in the face of uncertainty.\n\n\"The pressure of uncertainty really plays on the minds of workers,\" he said.\n\n\"We want to see some sort of project fast-tracked to ensure that there are some jobs for workers in the Hunter, but more importantly making sure we have our communities looked after in the process as well.\"\n\nMr Dezol said the company was committed to supporting its workers.\n\n\"This is a difficult point to reach,\" he said.\n\n\"Our focus remains on operating safely and giving our people certainty as soon as possible.”",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-10-28/brisbane-school-apologies-teaching-wrong-topic/105941574",
        "title": "Top Brisbane high school teaches wrong topic for Year 12 exam",
        "publish_date": "Tue, 28 Oct 2025 00:09:10 +0000",
        "category": "finance",
        "authors": [],
        "text": "One of Queensland's top state high schools has apologised to students and parents after admitting it taught the wrong topic for a Year 12 external exam in a major curriculum blunder.\n\nBrisbane State High School, which has more than 3,500 students, wrote to students and parents on Monday, informing them they had taught the wrong topic for the Ancient History external examination being held on Wednesday afternoon.\n\nSchools are notified of the topic more than 12 months in advance.\n\nThe education department confirmed that on Monday this week the school realised it had taught the incorrect unit on Augustus, instead of Julius Caesar.\n\nIn the email, the school said it was \"sincerely sorry for this error\" and had been in contact with the Queensland Curriculum and Assessment Authority (QCAA) \"to try and find a solution\".\n\n\"Unfortunately, due to the nature of the examination QCAA cannot write an additional paper for us,\" the school's email said.\n\nBrisbane State High School has two classes of students enrolled in Ancient History. (ABC News: Michael Lloyd)\n\nThe school said the QCAA had \"assured that the examination is skills-based\".\n\n\"Although we have deviated from the prescribed topic our students will be able to be successful in the exam,\" the email said.\n\nThe school said it would apply for an \"Access Arrangements and Reasonable Adjustments\" (AARA) with the curriculum authority outlining the school's error so it can be considered when marking the student's work.\n\nIn the letter to parents, Brisbane State High School said it was \"sincerely sorry\" for the error and recognised it was \"distressing for our students and will therefore have extra support provided by our Student Services team\" on Tuesday and Wednesday.\n\nEmergency study sessions\n\nThe Ancient History exam is worth 25 per cent of the final result for the subject, with internal assessments accounting for 75 per cent.\n\nTwo classes of students at the high school are enrolled in the subject.\n\nAfter realising the error, the school rushed to put together a \"resource\" on Julius Caesar, the correct topic, to try and help prepare students for Wednesday afternoon's exam.​\n\nStudents are currently undertaking Year 12 exams. (ABC News: Casey Briggs)\n\nThe school is also holding emergency study sessions today and on Wednesday morning to run through exam questions and examples of answers to help students prepare.\n\nA spokesperson for the education department said the department and school were \"deeply sorry for this mistake and are supporting students and families during this time\".\n\nWhile the cram sessions have been arranged for students today and tomorrow, Year 12 students also have other exams — including English on Tuesday morning.\n\nOther exams before Ancient History include Visual Arts on Tuesday afternoon, and Economics on Wednesday morning.\n\nMaking sure no student is disadvantaged\n\nThe Queensland Curriculum and Assessment Authority chief executive officer, Claude Jones, told ABC Radio Brisbane in a statement staff were working closely with the school to ensure \"no student is disadvantaged\".\n\n\"Schools are notified of the topic for the Ancient History external exam more than 12 months in advance,\" Mr Jones said.\n\nThe QCAA said the school would submit a \"whole-cohort\" misadventure application so special consideration could be applied when student results were finalised.\n\n\"Our assessment experts will apply additional quality assurance processes when marking these exam responses. Students have already completed 75 per cent of their assessments in this subject,\" Mr Jones said.\n\n\"The QCAA is committed to ensuring every student receives fair and accurate results.\"\n\nQueensland Minister for Education and the Arts John-Paul Langbroek has reassured parents and students. (ABC News: Lucas Hill)\n\nSpeaking on ABC Radio Brisbane, Education Minister John-Paul Langbroek said he wanted to reassure students, parents, and teachers that \"these were not 100 per cent exams\".\n\nMr Langbroek said the system was designed so that external exams were not a \"high-stakes test\".\n\n\"If we did have this circumstance, that is still to be investigated, and it was a 100 per cent exam and you walked in and you were suddenly asked questions about something you hadn’t studied, you would be freaking out if it was 100 per cent, so I just want to reassure people,\" he said.\n\nOn Monday, external exams for Accounting, Design, Aerospace Systems and Music were cancelled at three Brisbane schools – Brigidine College, Stuartholme School and Ambrose Treacy College – after power outages caused by Sunday’s storm.\n\nAt the time, the Queensland Curriculum and Assessment Authority said exams could not be rescheduled, \"to maintain security and ensure fairness\".",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-10-28/google-microsoft-restarting-nuclear-plants-for-ai-power/105941378",
        "title": "Google, Microsoft to reopen old nuclear plants to power AI infrastructure",
        "publish_date": "Tue, 28 Oct 2025 00:03:13 +0000",
        "category": "finance",
        "authors": [],
        "text": "Google has unveiled a plan to restart a US nuclear facility in Iowa to power the company's artificial intelligence infrastructure.\n\nIt made the announcement to reopen the Duane Arnold Energy Center in collaboration with electric power company NextEra Energy.\n\nThe facility, which was shuttered in 2020, would return to service in 2029 \"to help power Google's growing cloud and AI infrastructure in Iowa\", the companies said in a joint statement.\n\nGoogle signed off on a 25-year agreement to purchase power from the facility once it restarted.\n\nIt comes more than a year after power company Constellation announced it was in the process of restarting the Three Mile Island plant in Pennsylvania following a 20-year power purchase agreement with Microsoft.\n\nThat facility had also closed in 2019 due to economic reasons and is also known for a near-catastrophic meltdown there in 1979.\n\nIt has been announced it will return as the Crane Clean Energy Center.\n\nThe Google plant would be 100 per cent owned by NextEra, which struck a deal with minority owners to purchase the share of the plant it does not currently own, the companies said.\n\nWhat if AI isn't a bubble? Speculative manias where the first investors win because there isn't a bust are rare occurrences.\n\n\"As the US enters a new era of innovation and opportunity driven by AI, this strategic collaboration aims to enable Google to grow its business needs responsibly,\" the statement said.\n\nThe statement also praised nuclear energy as a carbon-free source of power.\n\n\"This partnership serves as a model for the investments needed across the country to build energy capacity and deliver reliable, clean power, while protecting affordability and creating jobs that will drive the AI-driven economy,\" said Ruth Porat, president and chief investment officer of Alphabet and Google.\n\nJohn Ketchum, chairman and CEO of NextEra Energy, said the partnership \"accelerates the development of next-generation nuclear technology\".\n\nAI energy needs surge\n\nAI has emerged as a major source of energy demand in 2025.\n\nIn April, the International Energy Agency (IEA) projected that electricity consumption by data centres will more than double by 2030.\n\nElectricity consumption by data centres that also power AI will more than double by 2030. (Supplied: Google)\n\nThe IEA report said electricity consumption from data centres was estimated to amount to around 415 terawatt hours, or about 1.5 per cent of global electricity consumption, in 2024.\n\nThe report added a warning that there was \"substantial uncertainty both about data centre consumption today and in the future\".\n\nGoogle has announced other initiatives to secure additional power capacity, including a venture with Elementl Power to develop three advanced nuclear power plants in the United States.\n\nABC/AFP",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-10-28/camera-to-show-robe-obelisk-as-it-erodes-into-sea/105920268",
        "title": "Council considers installing camera to catch obelisk's plummet into sea",
        "publish_date": "Tue, 28 Oct 2025 00:02:10 +0000",
        "category": "finance",
        "authors": [],
        "text": "A live stream, app or even subscription model could be used to show people the moment a 170-year-old coastal landmark slips into the sea.\n\nThe District Council of Robe is considering a project to install a camera pointing at the town's obelisk at Cape Dombey on South Australia's south-eastern coastline, which could fall into the ocean due to erosion five to 25 years from now.\n\nThe project has $5,000 in financial backing from the Robe Lions Club, while parents at the Robe Primary School will be recruited to clean the lens and check on the camera.\n\nThe obelisk was built in 1855 as a guide for ships entering the bay. (ABC South East SA: Josh Brine)\n\nCouncil chief executive Nat Traeger said there was a lot of interest in the future of the obelisk.\n\n\"As with anything that's iconic that is at risk, even though it's a negative story, people do seem to gravitate towards that,\" she said.\n\n\"Even though it could be 10, 20 or 30 years, it would be terrible to miss the actual moment the obelisk falls in.\"\n\nMs Traeger said if the council gave the project the go-ahead, a camera could be installed in the first quarter of next year.\n\nRobe Obelisk Working Party chair Richie White (left) with Nat Traeger at the obelisk. (ABC South East SA: Sam Bradbrook)\n\nA sign of rapid erosion\n\nMs Traeger said the camera would show how rapidly the local coastline was eroding.\n\n\"We've got to where we thought we'd be in 2050,\" she said.\n\n\"We don't know when the next big storm might take a chunk of it out.\n\n\" I think it will become an island before it falls into the sea … It could be sitting there as the obelisk apostle. \"\n\nErosion from strong waves is causing major issues for Robe and the Limestone Coast. (ABC South East SA: Josh Brine)\n\nQuotes to set up the project cost between $7,500 and $10,000.\n\nMs Traeger said the camera could also be placed near the town's lighthouse to allow fishers to monitor conditions on the water.\n\nShe said it had not been decided whether the camera would provide a live feed, be motion-activated, or even be shown on a subscription-based app, possibly to raise funds for a replica obelisk.\n\n\"We would just need to be careful before we enter into that space that we've got a product that's worth it,\" Ms Traeger said.\n\nThe council is also planning public consultation during summer about how it will mark the site for the replica, above the town's jetty, until the original obelisk is lost.\n\nMs Traeger said options included creating the replica before the original was destroyed, putting a plaque on the site, or creating a frame for the replica to be filled in down the track.\n\n\"We think it's important to get not just community and ratepayers, but visitors' views,\" she said.\n\n\"We won't show any costings on the survey. We don't want that to influence what people's opinion is.\"\n\nEngaging the next generation\n\nAt the local primary school, the issues facing the obelisk have captured the attention of year 5/6 students Mani, Ariah, Edie, Mali, Fred and Morgan.\n\nRobe Primary School students Mani, Ariah, Edie, Mali and Fred. (ABC South East SA: Josh Brine)\n\n\"The erosion's getting really bad and that's what's mainly causing this,\" Edie said.\n\n\" I just think it's really amazing that so many people have loved this one building for so long. \"\n\nMali said it was also an important symbol for the school.\n\n\"[It's] representing Robe itself, and showing that school kids here are really proud of where they live,\" she said.\n\nImages of the obelisk are prominent around the school and Robe more widely. (ABC South East SA: Josh Brine)\n\nWith the new camera project, Fred and Mani said it would be exciting to see the moment the obelisk tumbled into the ocean.\n\n\"I think it will be really good to see such a special moment of something that shaped our town falling,\" Fred said.\n\nAriah said the moment would be tinged with some sadness, though.\n\n\"Not only has it been a part of our town for so long, but I think that Robe would also drop a bit in popularity,\" she said.\n\nMorgan said he also believed it would hurt visitation.\n\n\"We might lose a fair few tourists who come to Robe for a holiday,\" he said.\n\nAccess to Robe's iconic obelisk has been restricted due to erosion at Cape Dombey. (ABC South East SA: Josh Brine)\n\nCommunity backing\n\nSchool principal Anne Grayson said nearly 20 parents responded to an initial letter asking for help once the camera was set up.\n\nShe said the school would also look at how it could use the project in its teaching in some way.\n\n\"Erosion and degradation are part of everyday life in Robe,\" she said.\n\n\"It is part of our science curriculum covering topics like erosion, and the fact kids can walk outside their front door and see it happening in real time is highly engaging, even though it's devastating.\"\n\nRobe Lions Club president Trevor Wagner said he was keen to support the project.\n\nTrevor Wagner is keen for people around the world to tune into the project. (ABC South East SA: Josh Brine)\n\n\"The obelisk is such an icon in Robe, and unfortunately, we all realise that one day it's going to go,\" he said.\n\n\"The chances of us seeing it go are very slim, until this idea came up.\n\n\"I think it's something that people all over the world will hopefully be able to log in and have a look.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-10-28/wisetech-office-searched-by-afp-asic/105941382",
        "title": "WiseTech shares crash after AFP and ASIC raid office",
        "publish_date": "Mon, 27 Oct 2025 22:50:24 +0000",
        "category": "finance",
        "authors": [],
        "text": "Shares in major ASX-lised software and logistics company WiseTech have crashed on news its Sydney office was raided by the Australian Federal Police (AFP) and the Australian Securities and Investments Commission (ASIC).\n\nAt midday (AEDT) WiseTech shares were down 17 per cent to $70.65.\n\nIn a release to the ASX, the company said ASIC and the AFP executed a search warrant requiring the production of documents regarding alleged trading in WiseTech shares by co-founder Richard White and three WiseTech employees during the period from late 2024 to early 2025.\n\n\"So far as it is aware, no charges have been laid against any person and there are no allegations against the company itself,\" WiseTech said in the ASX statement.\n\nManagement controversy\n\nThe founder and previous chief executive, Mr White has been embroiled in controversy since October 2024, when he stepped down from the role after multiple media reports of allegations about his personal life, including payments to a past sexual partner.\n\nIn February, ASIC initiated \"preliminary inquiries\" into the logistics software maker following a mass exodus of executives and surprise return of Mr White as chairman.\n\nCo-founder Richard White is a former chief executive of WiseTech. (AAP: Brendan Esposito)\n\nWiseTech code of conduct review\n\nThe ABC reported in March that a review found Mr White misled the firm's board about the nature of several relationships.\n\nA \"sub-committee\" of the board — the three directors besides Mr White — said it \"has indicated to Mr White … that such conduct is not acceptable and must not be repeated\".\n\nA review was subsequently undertaken into the company's code of conduct.\n\nAt the time the billionaire said he had accepted the findings and understood \"the seriousness of his actions\".\n\nWiseTech shares plunged when news of the raid broke. (ABC News: John Gunn)\n\nWiseTech will 'cooperate'\n\nWiseTech says it “intends to fully cooperate with any investigation\".\n\nThe software company said it would not provide any further comment today.\n\nWiseTech also said Mr White would not be commenting.\n\nThe AFP has not commented on the matter.\n\n\"Yesterday morning (27 October), ASIC, with assistance from the Australian Federal Police, executed search warrants as part of an ongoing investigation,\" an ASIC spokesperson said.\n\n\"As the investigation is ongoing, ASIC is unable to provide further comment at this time.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-10-28/city-of-sydney-investigates-cap-on-short-term-rentals/105940988",
        "title": "Sydney council looks into reducing short-term rental cap to 60 days",
        "publish_date": "Mon, 27 Oct 2025 22:23:14 +0000",
        "category": "finance",
        "authors": [],
        "text": "City of Sydney council will investigate reducing the cap on un-hosted short-term rentals from 180 days a year to 60 days in a bid to improve housing availability in the inner city.\n\nGreens councillors who put forward the proposal say the plan could return thousands of homes to the long-term rental market in the middle of a housing affordability crisis.\n\nCouncil unanimously backed a motion for staff to investigate the plan at a meeting of councillors last night.\n\n\"More and more, we're seeing whole houses or apartments being ripped away and turned into mini-hotels, rented out short-term for huge profit,\" Greens councillor Matthew Thompson said.\n\n\"Post-COVID, we have seen an explosion in the number of Airbnbs in our city. On conservative estimates, there are at least 5,000.\"\n\nMatthew Thompson says too many homes in the city are being used as \"mini-hotels\". (ABC Radio Sydney: Natalie Agius)\n\nCr Thompson said the proposal would work because the idea elicited a strong response from investors who emailed councillors ahead of the meeting, advocating for the idea to be rejected.\n\n\"We actually had a flood of emails over the weekend from property investors and businesses that have ripped hundreds, sorry thousands, of homes from the inner city … calling on us to vote down the motion,\" the councillor told ABC Radio Sydney Breakfast.\n\n\" In a housing crisis when people can't find homes, every house should be a home. \"\n\nA report commissioned by the council last year showed 68 per cent of short-term rental hosts in the city had multiple listings, while many had 10 or more sites.\n\nCr Thompson cited a recent move in Byron Shire on the state's north coast as inspiration for the cap reduction.\n\nIn September last year, Byron Shire capped the number of days non-hosted short-stays could be rented to 60 days a year.\n\nFigures from the NSW Department of Planning, Housing and Infrastructure show the number of short-term stays dropped by about 15 per cent in the Byron Shire in the year since the changes.\n\nCity suburb mostly rentals\n\nThe city's move comes weeks after a childcare centre in the inner-city suburb of Millers Point announced it was closing due to a lack of enrolments.\n\nResidents in the area say the suburb has become mostly short-term stays.\n\nResidents say housing in Millers Point in inner Sydney has become mostly short-term rentals. (ABC Radio Sydney: John Donegan)\n\n\"The problem is much worse than people realise,\" Millers Point resident Cormack Champion told ABC Radio Sydney Breakfast.\n\n\"We've had, I think, it's about eight young families that had young kids just in our street that have been pushed out in the last 18 months.\n\n\"There's a street that has over 100 or so houses. There's only two permanent residents in that street, every other door is lock boxes.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-10-28/athletes-call-for-climate-action-ahead-of-cop30/105941094",
        "title": "Sport stars call for climate action as Brazil prepares to host COP30",
        "publish_date": "Mon, 27 Oct 2025 22:11:49 +0000",
        "category": "sports",
        "authors": [],
        "text": "Climate change is one of the toughest opponents athletes face, according to Brazilian soccer player Tamires Dias.\n\nShe is one of about 40 elite sportsmen and women involved in the launch of a new global campaign that will feature at next month's COP30 summit in her country.\n\nDias, who played in two Women's World Cups, has been joined by the likes of NBA player DeAndre Jordan, Brazilian surfer Maya Gabeira, Romanian Olympic swimmer David Popovici and former England soccer player Raheem Sterling in support of Adapt2Win.\n\nThe Adapt2Win global multimedia campaign, which launched on Monday and is backed by the Gates Foundation and Wellcome Trust, urges governments to prioritise and invest in climate adaptation.\n\nDias, 38, says adapting to climate change is no longer optional and that extreme heat and damaging rain can make playing soccer in Brazil challenging.\n\n\"In sport, we learn to adapt every day — to new teams, new tactics, new opponents,\" she said.\n\n\" But climate change is a different kind of opponent. It's stronger, more unpredictable and no-one can face it alone. \"\n\nForty athletes have signed an open letter calling for action and a hard-hitting film showing the dramatic impact of floods and fires on sports venues will be aired at COP30 in Belem next month.\n\nThe film starts with a caption stating \"this can either be the worst defeat in history or the greatest comeback of all time\".\n\nAlarming climate data shows 'existential threat' facing cricket Cricket greats speak out after a new report warns increasing temperatures are making it harder to play the sport at all levels.\n\nAccording to campaign organisers, climate-related disasters caused $US417 billion ($616 billion) in economic losses in 2024, but less than 10 per cent of global climate finance is directed toward adaptation.\n\n\"For me, this is personal,\" said Sterling, who was born in Jamaica but has played for England 82 times.\n\n\"I've seen how climate change is reshaping life across the Caribbean.\n\n\"Through my foundation's work on mosquito-borne disease prevention, I've seen how simple, community-led solutions can make a huge difference.\n\n\" COP30 is the moment for leaders to back those solutions. \"\n\nThe campaign also highlights grassroots efforts already underway, such as SMS drought alerts in Kenya and heat-resilient maternal healthcare in Sierra Leone.\n\n\"Adapt2Win reminds us that every sector, from governments to business to sports, has a role to play in creating change,\" COP30 chief executive Ana Toni said.\n\nStream End Game with Tony Armstrong on ABC iview Tony Armstrong will tackle Australia's overdue reckoning with racism in sport, with the help of some of its biggest sports stars.\n\nOther signatories include South Africa rugby player Bongi Mbonambi, American two-time world champion sailor Mike Buckley and Nigeria soccer player Kenneth Omeruo.\n\n\"Growing up in Nigeria, you could always count on the seasons — when the rains would come, when the fields would turn green,\" said Omeruo, who has 69 international caps and was part of Nigeria's triumphant African Cup of Nations squad in 2013.\n\n\"But in recent years, everything has changed.\n\n\"The weather is unpredictable, communities are struggling and even football pitches we once trained on have flooded or dried out.\n\n\"Climate change is something we live with every day.\"\n\nReuters",
        "source": "ABC"
    },
    {
        "url": "https://www.smh.com.au/business/markets/asx-set-to-slide-wall-street-jumps-on-us-china-talks-gold-slumps-again-20251028-p5n5qg.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "ASX slides as gold miners, CSL and WiseTech shares slump; Banks surge",
        "publish_date": "Tue, 28 Oct 2025 12:17:13 +1100",
        "category": "finance",
        "authors": [
            "Staff Writers"
        ],
        "text": "The Australian sharemarket had a rocky start to trading on Tuesday, with gold miners and some big companies weighing on the market while financial stocks and retailers advanced after Wall Street hit more records overnight.\n\nWiseTech Global shares plunged after the software giant said police and market regulators raided its headquarters and executed a search warrant this week. CSL shares tanked after Australia’s biggest healthcare company told investors vaccine scepticism in the US had hurt its profits, and it would delay the planned spin-off of its vaccines arm.\n\nWall Street set new records, but it’s a mixed bag for the Australian market. Credit: AP\n\nThe S&P/ASX 200 was down 35 points, or 0.4 per cent, at 9020.60 as of 11.32am AEDT, even as seven of its 11 industry sectors were trading higher. The bourse’s decline comes after the ASX added 0.4 per cent on Monday. The Aussie dollar traded at US65.59¢ at 11.31am.\n\nWiseTech shares plunged 17 per cent after the company said that Australian Federal Police and market regulators had raided its Sydney headquarters and executed a search warrant on Monday. The investigation concerns alleged trading in WiseTech shares by its billionaire co-founder Richard White and three company employees between late 2024 and early 2025, the board said.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/new-bureau-website-suffers-backlash-20251028-p5n5w7.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "New bureau website suffers backlash",
        "publish_date": "Tue, 28 Oct 2025 12:16:14 +1100",
        "category": "finance",
        "authors": [],
        "text": "New bureau website suffers backlash\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/nrl/tom-trbojevic-commits-to-sea-eagles-with-900-000-contract-extension-20251028-p5n5wf.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Tom Trbojevic commits to Sea Eagles with $900,000 contract extension",
        "publish_date": "Tue, 28 Oct 2025 12:14:59 +1100",
        "category": "sports",
        "authors": [
            "Adrian Proszenko"
        ],
        "text": "Manly have announced the retention of Tom Trbojevic on a new one-year deal.\n\nTrbojevic has agreed to take a pay cut to remain at the NRL club, accepting an offer of about $900,000 to stay put until the end of 2027. It ends what has been a long and at times adversarial negotiation period. The 29-year-old fullback at one point considered his options in the English Super League.\n\nSuperstar Manly fullback Tom Trbojevic is staying put on the northern beaches. Credit: Getty Images\n\nHowever, the parties have come to an agreement, avoiding what would have been a public relations disaster after Manly captain Daly Cherry-Evans opted to leave at the end of the club’s 2025 campaign.\n\nA former Dally M Medallist, “Turbo” is preparing for his 12th season with Manly, having scored 111 tries from 170 NRL games. The local junior said he’s glad to have his future finalised after recently returning from a post-season holiday.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/business/markets/trump-tightens-the-noose-on-putin-s-cash-machine-20251028-p5n5sz.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Blacklisted: Trump puts the squeeze on Putin",
        "publish_date": "Tue, 28 Oct 2025 11:58:33 +1100",
        "category": "finance",
        "authors": [
            "Stephen Bartholomeusz"
        ],
        "text": "Donald Trump and his family have personal relationships, of course, with a number of the leaders of the key Middle Eastern producers that they might be able to call on if there is a need to further expand OPEC production. Whether that is necessary, or not, depends on what impact the new sanctions have. Russia has been able to find workarounds to counter earlier sanctions and the price caps the G7 economies have imposed on its exports. An oil field in Siberia. About 80 per cent of Russia’s oil exports have now been targeted by the US and the European Union. Credit: Bloomberg It has developed a vast “shadow” fleet of tankers that have shipped its oil, albeit at discounts to global prices, to countries including China, India and Turkey. They have been prepared to ignore the sanctions.\n\nThe American intervention, and the threat of secondary sanctions that threaten to cut off access to the US and US dollar-denominated global financial system, has, however, already had an impact. Loading Chinese state-owned companies and India’s major refineries – Russia’s two biggest customers – have already suspended seaborne imports of Russian oil while they work through the implications of the sanctions. They can’t afford to be shut out of the global financial system. China’s purchases of Russian oil and assistance for its war efforts will inevitably come up in this week’s head-to-head discussions between Trump and Chinese President Xi Jinping. Trump’s 50 per cent tariff on India’s exports to the US might also become a discussion point between the US and India if the US is serious about throttling Russia’s oil revenues. Russia will almost inevitably find some sort of workaround – it’s shown how resourceful and creative its oil exporters can be – but there will be some squeezing of its oil exports and, if it is to largely maintain export volumes, it will probably come at the cost of even bigger discounts to global prices.\n\nThe EU and United Kingdon (but not the US), last month reduced the price cap on Russian oil (backed by the threat of sanctions and loss of insurance cover) from the $US60 a barrel cap imposed in late 2022 to $US47.60 a barrel. Russia’s flagship crude had been selling at $US12 to $US13 a barrel discounts to the previous cap. To maintain export volumes now that Rosneft and Lukoil have been sanctioned, Russia may well have to increase the scale of its discounts even as the cost of establishing new and more expensive ways of circumventing the sanctions increases. With oil exports accounting for about one-third of Russia’s budget revenues and those revenues already under pressure from a slowing economy and an inflation rate running above 8 per cent, the impact of the sanctions on Russia’s economy – if the US polices them effectively – could be material. That economy has held up far better than expected when the West first responded to Russia’s invasion of Ukraine with sanctions and the seizure of about $US300 billion ($457.4 billion) of Russia’s offshore foreign exchange reserves, largely because Vladimir Putin rapidly switched its structure away from a market-driven economy to a wartime economy.\n\nPerversely, that generated increased growth, reduced unemployment and significant increases in wages as more and more of Russia’s industrial base – and its citizens – were devoted to the war effort. There are, however, now signs of strain. Russia’s industrial base is now devoted to producing goods that, once deployed in the war, produce no recurrent economic benefit. Investment has flowed away from other activities into military spending, increasingly starving non-military activity of funds. With oil inventories bulging and expanding and OPEC still sitting on millions of barrels a day of unused capacity, any reduction in the flow of Russian oil into the global market could be absorbed without massive price impacts. The expansion of the Russian military, and the need to replace the hundreds of thousands who have died and the other hundreds of thousands that have been wounded, is producing shortages of workers across the economy while driving up wages and inflation. Resources have been concentrated in Moscow and military centres, drawing them away from the regions and causing financial stresses and degrading services in some of Russia’s poorer regions.\n\nFrom a remarkably positive 4.3 per cent growth in GDP last year, even Russia’s own forecasters see growth of only about 1 per cent this year. The International Monetary Fund and World Bank both forecast growth of less than 1 per cent this year and not much more over the next few years. Loading Last week Russia’s central bank cut its policy rate by 0.5 of a percentage point, to 16.5 per cent. It had been as high as 21 per cent. Economic growth of 1per cent or less and inflation of 8 per cent or more equals stagflation. Russia’s economy is stagnating, with the inflation rate eroding the value of the revenues and taxes available for military spending, which accounts for about 40 per cent of Moscow’s spending and about 8 per cent of GDP – about twice the amount spent before the invasion. Moscow is budgeting for flat defence and security expenditures in 2025-26. That implies a reduction in real terms and signals how tight the country’s finances now are even though the government has been increasing fees, fines, taxes on individuals and companies and has foreshadowed an increase in the country’s value-added tax rate to 22 per cent and a broadening of that tax’s base.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/politics/federal/reluctant-but-compliant-snapchat-tiktok-and-meta-yield-to-social-media-ban-20251028-p5n5rs.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Reluctant but compliant Snapchat, TikTok and Meta yield to social media ban",
        "publish_date": "Tue, 28 Oct 2025 11:56:09 +1100",
        "category": "finance",
        "authors": [
            "Nick Newling"
        ],
        "text": "Snapchat, TikTok and Meta will comply with the government’s under-16 social media ban, confirming their capitulation during a tense Senate inquiry in which TikTok was accused of intimidating a senator’s office for asking tough questions.\n\nThe platforms that failed to front an earlier inquiry this month, but had met with Communication Minister Anika Wells, told senators on Tuesday they would not fight the ban, but that it would harm the wellbeing of young people locked out of the platforms.\n\nElla Woods-Joyce, Public Policy Lead, Content and Safety, TikTok, appears via videolink (bottom left) during a hearing on the Internet Search Engine Services Online Safety Code. Credit: Alex Ellinghausen\n\n“We will comply with the law, even though we believe it has been unevenly applied and risks undermining community confidence in the law,” Snap Inc’s senior vice president of global policy Jennifer Stout told the Senate inquiry this morning.\n\n“We know this will be difficult for young people who use Snapchat to communicate with their closest friends and family. For teens, connection and communication are strong drivers of happiness and wellbeing. Taking that away does not necessarily make them safer and it may instead push them towards other messaging services that lack Snapchat’s safety and privacy protections,” Stout said.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/nrl/a-high-tackle-ended-a-test-appearance-within-90-seconds-the-victim-wanted-a-stronger-punishment-20251027-p5n5n8.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "A high tackle ended a Test appearance within 90 seconds. The victim wanted a stronger punishment",
        "publish_date": "Tue, 28 Oct 2025 11:54:00 +1100",
        "category": "sports",
        "authors": [
            "Christian Nicolussi"
        ],
        "text": "An angry Stefano Utoikamanu could not believe Francis Molo avoided scrutiny for a high shot that ended his Tongan debut in 90 seconds, saying: “I don’t know what more evidence you need to sin-bin someone.”\n\nUtoikamanu had to fly back to Sydney with the Samoan players on Monday rather than join the Tongans in New Zealand, following Sunday’s 34-6 loss at a packed Suncorp Stadium.\n\nThe front-rower confirmed he would miss Sunday’s must-win clash against New Zealand as part of the sport’s concussion protocols. He’s also stunned Molo was only penalised, and not sent to the sin-bin, over the incident.\n\nThe match review committee charged Molo with a grade-two careless high tackle, but the sanction for that in an international match is 13 per cent of his $3000 match payment, or $390.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/world/europe/how-epstein-and-andrew-drew-a-pm-s-daughter-into-a-swamp-20251028-p5n5qk.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "How Epstein and Andrew drew a PM’s daughter into a swamp",
        "publish_date": "Tue, 28 Oct 2025 11:53:44 +1100",
        "category": "finance",
        "authors": [
            "David Crowe"
        ],
        "text": "She was sufficiently connected, however, to be in Epstein’s seven-storey townhouse in Manhattan in December 2010. Unbeknownst to Epstein and Andrew, a photographer was watching them. Keating was seen leaving the house as Andrew waved her farewell at the front door. Loading Her misfortune was to be in the house at what turned out to be a pivotal moment. Epstein and Andrew went for a walk in Central Park – and the photographer, Jae Donnelly, took the shot that proved they were back in touch. Andrew chose to keep up his friendship with a man convicted of sex with a minor. Keating has never talked about why she was at Epstein’s house that December. But she confirmed she went to the dinner in February. “It was a large social event,” she told The Daily Mail, and she mentioned prominent media personalities who also attended. “A sizeable chunk of NY society was there, including Barbara Walters, Charlie Rose and Katie Couric. At the time, I had only lived in NY about 10 weeks, and was happy to accept the odd social invitation.”\n\nShe could not be contacted by this masthead for comment. All of this is fuel for those who assume the guilt of anyone who came near Epstein. Social media has spread slurs about Keating for years because of the townhouse photo. Some will add the email to the mix. But the public interest is slim. Keating does not hold any public office. She is under no obligation to answer questions about her private life. The main reason for looking into the new email is to counter the conspiracies. One assumption, for instance, is that Keating knew Maxwell and moved in the same circles as Epstein. In fact, there is no evidence that she knew Maxwell before 2014, when she interviewed her for a project called IdeaPod, published by the Huffington Post. Another assumption is that she was very close to Andrew. Instead, the friendship seems to have been with his daughters, Princess Eugenie and Princess Beatrice. Keating was photographed with Eugenie at Fashion Week in New York in 2014.\n\nAt the risk of labouring the point, there are no grounds for suggesting an intimate relationship with Andrew. Prince Andrew is under renewed pressure over his links with Epstein. Credit: AP Nor is there a reason to think Keating knew all the murky details about Epstein. The plea deal meant some of the facts did not see the light of day until years later. Keating was not alone in walking too close to the spider’s web. Epstein drew many people around him from 2010 onwards, when he regained his place in New York society. Some of them were his accomplices. Others were simply invited to dinner. He used donations to charities, amplified by publicists, to try to bury the past. One New York publicist, Peggy Siegal, ensured he was invited to events. Siegal told The New York Times in 2019 that she had no trouble restarting their friendship after his prison term: “The culture before #MeToo was – ‘You’ve done your time, now you’re forgiven’.”\n\nSiegal arranged a dinner party for Prince Andrew at Epstein’s mansion in 2010, according to The New York Times. Those at the dinner included filmmaker Woody Allen and his wife, Soon-Yi Previn, as well as broadcasters Charlie Rose, Katie Couric and George Stephanopoulos. Loading Turning up to dinner did not make someone an Epstein accomplice. It might demonstrate poor judgment, or ignorance, but not necessarily guilt. Comedian Chelsea Handler attended the 2010 dinner, for instance, and later said she had no idea who Epstein was. She also asked a pointed question of Allen and his wife: “So, how did you two meet?” Two key conclusions emerge from the email about Keating, Epstein and the prince. The first is that there is no evidence that Keating did anything wrong. The second is that Andrew is utterly exposed. This is the second email to emerge within the last two weeks that confirms he misled the public when he claimed that he cut off contact with Epstein on the day they walked in Central Park in December 2010.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/afl/chloe-molloy-out-for-the-season-in-huge-blow-to-swans-finals-hopes-20251028-p5n5un.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Chloe Molloy out for the season in huge blow to Swans’ finals hopes",
        "publish_date": "Tue, 28 Oct 2025 11:53:19 +1100",
        "category": "sports",
        "authors": [
            "Hannah Kennelly"
        ],
        "text": "Sydney superstar Chloe Molloy will miss the remainder of the AFLW season after suffering a back injury, in a devastating blow to the team’s finals hopes.\n\nThe Swans’ co-captain made a spectacular return to AFLW this season after being sidelined with an ACL injury in 2024 that required a knee reconstruction and long recovery.\n\nChloe Molloy will miss the rest of the 2025 AFLW season. Credit: Getty Images\n\nThe Swans said in a statement that Molloy had experienced back soreness for the past fortnight.\n\n“Following further investigation and specialist opinion, the club’s medical staff have made the recommendation for Molloy to undergo surgery later this week,” Sydney said.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/afl/top-afl-draft-prospect-stars-in-vfl-debut-20251028-p5n5w1.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Top AFL draft prospect stars in VFL debut",
        "publish_date": "Tue, 28 Oct 2025 11:47:21 +1100",
        "category": "sports",
        "authors": [],
        "text": "Top AFL draft prospect stars in VFL debut\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.sbs.com.au/news/article/nationals-senator-says-tiktok-bullied-staffer-amid-new-teen-social-media-ban-details/f5nzyc4v9",
        "title": "Nationals senator says TikTok bullied his office amid new teen social media ban details",
        "publish_date": "Tue, 28 Oct 2025 00:54:08 +0000",
        "category": "finance",
        "authors": [],
        "text": "TikTok, Meta and Snapchat have faced a parliamentary inquiry into the teen social media ban, confirming they will deactivate, delete or freeze accounts of those under 16 when the new law comes into effect in December.\n\n\n\n\n\nThe social media company executives — who appeared remotely via video call — were questioned about potential harm inflicted on young people by the platforms, age assurance technology measures, and whether they would comply with the impending ban.\n\n\n\n\n\nTiKTok was also asked by a Nationals senator if it was a \"bullying behemoth\" as he accused the social media giant of bullying his office.\n\n\n\n\n\nGreens senator Sarah Hanson-Young previously threatened to force executives to appear at the inquiry into online safety after they were no-shows at an earlier hearing, but all three companies agreed to give their views on the social media ban at the hearing without a subpoena.\n\n\n\nCompanies to comply with 'unevenly applied' ban\n\nTikTok, Meta, and Snapchat have confirmed they will comply with the social media ban, though they have expressed concerns about the new law.\n\n\n\nJennifer Stout, Snap's senior vice president of global policy and platform operations, said Snapchat should be excluded as it could be classified as a messaging service, which is supposed to be excluded under the ban. However, it said it would apply with the \"unevenly applied\" ban.\n\n\n\n\n\n\"We will comply with the law, even though we believe it has been unevenly applied and risks undermining community confidence in the law,\" Stout said.\n\n\n\n\n\n\"Beginning 10 December, we will disable accounts for Australian Snapchatters under 16. We know this will be difficult for young people who use Snapchat to communicate with their closest friends and family.\"\n\n\n\n\n\nWhile TikTok said it would also comply, its director of public policy in Australia, Ella Woods-Joyce, said the ban could cause more harm.\n\n\n\n\n\n\"Experts believe the ban will push younger people into darker corners of the internet where rules, safety tools and protections don't exist,\" Woods-Joyce said.\n\n\n\nLISTEN TO 'As data-minimising as possible': under-16 social media ban guidelines published SBS News 03:52 English\n\nMeta will also deactivate any accounts for users under 16 on 10 December, its director of policy in Australia, Mia Garlick, said, ending speculation that the media giant's new teen accounts feature would pave the way for an exemption.\n\n\n\n\n\nIts teen accounts feature is automatically applied to users under 18 and includes additional built-in safety and privacy settings, such as content restrictions, contact limitations, and screen time management tools.\n\n\n\n\n\nThe ban will result in about 1.5 million accounts across Facebook, Instagram, YouTube, TikTok, Threads and X being deactivated.\n\n\n\n\n\nWhile children under 16 will be banned from social media platforms, there are some exceptions for health and education services, including WhatsApp and Meta's Messenger Kids.\n\n\n\nNew details about the ban's implementation\n\nThe Senate inquiry also revealed more details about how each company would implement the ban.\n\n\n\n\n\nSnapchat and TikTok will archive content — including posts, photos, and videos — as part of the process of freezing accounts.\n\n\n\nSnapchat will implement a tool, Download My Data, to help affected users secure photos and communications before accounts are locked. It also questioned temporarily \"freezing\" — rather than deactivating — accounts of those close to the age of 16.\n\n\n\n\n\nAffected TikTok users will be able to deactivate, suspend or delete their accounts, with an archive feature available. It said it would use additional measures, including monitoring users' \"behaviours\" to further verify their age.\n\n\n\n\n\nMeta users will have the option to delete, deactivate or temporarily pause their accounts, but said they were \"still working through the precise wording and flows\".\n\n\n\n\n\nMeta will use a third-party provider, Yoti, to enforce age assurance technology, giving people the option to submit a video selfie, an age estimation approach, or provide government identification, Garlick said.\n\n\n\nConcerns about age verification technology\n\nThe social media ban is the first of its kind in the world, with TikTok's Woods-Joyce saying the company was \"doing the best we can\" to navigate the new requirements.\n\n\n\n\n\nStill, the platforms expressed concerns about challenges associated with the rollout of the ban, particularly age verification and age assurance measures.\n\n\n\n\n\nThe ban requires affected social media companies to take \"reasonable steps\" and \"have appropriate measures in place\" to prevent underage users from creating or using accounts. That includes deactivating accounts and implementing age verification measures to prevent new account creation.\n\n\n\n\n\nFailure to do so could attract fines of up to $49.5 million.\n\n\n\n\n\nWhile the government has noted there is no one-size-fits-all solution for all companies, age assurance technology might involve using age estimation via AI, facial age analysis, and identity document verification to verify someone's age.\n\n\n\nThe Snapchat executive said there were \"privacy risks\" associated with age assurance technology and said they would be \"supportive\" of device age assurance, which would mean someone's age would be verified when purchasing a device, rather than when apps are downloaded.\n\n\n\n\n\n\"Google and Apple have not set that up, but we're going to do the best we can to comply,\" Stout said.\n\n\n\n\n\nThe Age Assurance Technology Trial report, commissioned by the federal government and released in August 2025, said \"age assurance can be done in Australia privately, efficiently and effectively\". It found there were \"no substantial technological limitations\" in its implementation and said \"secure data handling practices\" were available.\n\n\n\n\n\nGoogle previously told the inquiry the ban would be extremely difficult to enforce, and a lack of detail around how the platforms plan to implement age verification systems has clouded the ban since its announcement.\n\n\n\nNationals senator accuses TikTok of bullying\n\nThe inquiry also witnessed Nationals senator Ross Cadell accuse a TikTok staff member of intimidation and bullying following questions he was asking about the age assurance inquiry.\n\n\n\n\n\nHe alleged a TikTok staff member called his office and said: \"We get on very well with the leader's office, we get on very well with the shadow minister's office. You shouldn't be asking these questions.\"\n\n\n\n\n\nWoods-Joyce said she was \"not aware of the details that you're talking about\", adding the TikTok team \"needs to operate professionally and appropriately at all times, and I have confidence that that's what we do\".\n\n\n\n\n\nCadell asked Woods-Joyce if TikTok was a \"bullying behemoth that wants to get its own way at any cost\", to which she responded, \"absolutely not\".\n\n\n\n\n\n— With additional reporting by Australian Associated Press\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/critical-minerals-plea-to-pm-voices-are-not-being-heard/e5wpwubuj",
        "title": "'Voices are not being heard': Plea to Albanese over critical minerals deal",
        "publish_date": "Tue, 28 Oct 2025 00:45:23 +0000",
        "category": "finance",
        "authors": [],
        "text": "The signing of the $13 billion critical minerals deal has exacerbated anxiety in Western Victoria, leaving farmers feeling like \"their voices are not being heard\".\n\n\n\n\n\nThey're inviting Prime Minister Anthony Albanese to visit the communities that they say will bear the brunt of the proposed mineral mining boom's impacts.\n\n\n\n\n\nThe Victorian Farmers Federation letter (VFF), seen by SBS News, expresses \"deep concern\" that in a rush for critical minerals, community concerns will not be addressed.\n\n\n\n\n\n\"Farmers in this region are facing significant uncertainty regarding the future of their land, water, security, and long-term agricultural viability,\" VFF president Brett Hosking wrote to Albanese on Monday morning.\n\n\n\n\n\n\"This concern has been compounded by the signing of the recent critical minerals agreement with the United States.\"\n\n\n\nWhile last week's US$300 million ($462 million) in equity commitments focused on projects in Western Australia and the Northern Territory, the government granted Astron Corporation's Donald Rare Earth and Minerals Sands \"major project status\" the following day.\n\n\n\n\n\nHosking said farmers in and around Donald, about 280km north-west of Melbourne, are worried that \"commitments to fast-track projects will further erode their capacity to have a say on the future of their communities\".\n\n\n\n\n\n\"A visit from you would send a strong signal that the federal government is listening to rural Australians, especially at a time when many feel their voices are not being heard,\" he wrote.\n\n\n\n\n\nAstron says it acknowledges community concerns and continues to engage with locals. The company says the major project status is largely an acknowledgement of the project’s strategic significance, with most major approvals already in place.\n\n\n\n\n\nThe plea came hours before the government revealed that the Environment Protection and Biodiversity Conservation Act (EPBC) reforms, to be tabled in parliament on Thursday, would include an exemption to push through projects deemed in the \"national interest\".\n\n\n\n\n\nA draft section states that Environment Minister Murray Watt can exercise discretion and make a decision \"inconsistent with the national environment standards, where it is demonstrably in the public interest and with a clearly articulated statement of reasons\".\n\n\n\nWhile Labor argues this will improve environmental outcomes, farmers said last week the \"fast tracking\" of projects could impact food production and have broader impacts on surrounding communities.\n\n\n\n\n\nSlow approval times for projects, including the duplication of processes across state and federal governments, have been partially blamed for holding up renewable energy projects as well as the mining of minerals that will allow Australia to compete with China.\n\n\n\n\n\nThere will be a 28-day time limit to challenge the minister's decision, during which work can continue.\n\n\n\nGreens appalled by 'national interest' clause\n\nGreens leader Larissa Waters says the party is still open to negotiations with Labor as long as the reforms \"work for nature\" and \"don't see coal and gas and logging fast-tracked unabated\".\n\n\n\n\n\n\"They’re [the laws] already riddled with loopholes,\" she said.\n\n\n\n\n\n\"But rather than fix those loopholes, the proposal by this environment minister under this government is to add additional loopholes and yet more fast-track mechanisms for coal and gas.\"\n\n\n\nGreens leader Larissa Waters has accused Labor of creating \"loopholes\" for coal and gas projects in the reforms to environmental law protections. Source: AAP / Mick Tsikas Waters says drafts of the legislation are \"written for big business\", predicting that Labor will make a deal with the Coalition instead.\n\n\n\n\n\nThe Business Council of Australia urged the Opposition to pass the bill in full in the Senate, arguing it would offer more certainty for business , after Opposition leader Sussan Ley called on the environmental protections to be split into two sections.\n\n\n\nREAD MORE Federal government approves Woodside gas project extension, with some conditions\n\nDespite Watt labelling the proposition \"mad\" on Monday, Opposition environment spokesperson Angie Bell doubled down in her calls to have it split.\n\n\n\n\n\n\"We want to see the Bill split so we can streamline approvals, and we can improve environmental protections separately,\" she told ABC radio on Tuesday morning.\n\n\n\n\n\n\"And what we've seen from the Government is a flat refusal immediately. And that's what we kind of expected because it seems that it's their way or the highway.\"\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/morning-news-bulletin-28-october-2025/a2203v2i5",
        "title": "Morning News Bulletin 28 October 2025",
        "publish_date": "Mon, 27 Oct 2025 20:28:49 +0000",
        "category": "finance",
        "authors": [],
        "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nHurricane Melissa has been upgraded to a category 5 storm and has begun hitting Jamaica with violent gusts.\n\n\n\n\n\nIt's the strongest storm on record to hit the Caribbean island.\n\n\n\n\n\nJamaican Prime Minister Andrew Holness has implored residents to evacuate to nearly 900 shelters around the country, providing assistance to those wanting to leave.\n\n\n\n\n\nBoth international airports are closed.\n\n\n\n\n\n\n\n.\n\n\n\n\n\nLiberal senator Sarah Henderson has called for a senate inquiry into the Triple Zero outage in September.\n\n\n\n\n\nAn inquiry into the outage is already underway, led by the Australian Communications and Media Authority, but Ms Henderson says a senate inquiry is needed to fully understand what happened.\n\n\n\n\n\nMs Henderson is expected to put the motion today as she accuses the government of not taking enough action to tackle the issue.\n\n\n\n\n\n\"A number of people died. There're still conflicting reports about whether three or four people died. They died as a result of a catastrophic failure by Optus. And for this government to scramble now to bring in this bill on the triple zero custodian, on recommendations that were made close to two years ago is a disgrace.\"\n\n\n\n\n\n\n\n\n\n\n\nMeanwhile Minister for Communications Anika Wells says she will formally direct the communications and media authority to improve the transparency of how telecommunication outages are reported.\n\n\n\n\n\nThe direction will include a mandate that telcos maintain a real-time register of network outages, which will be available to the public.\n\n\n\n\n\n.\n\n\n\n\n\nThe Greens have criticised the federal government's proposed environmental law changes, saying they fail to safeguard Australia's natural environment and the climate.\n\n\n\n\n\nGreens leader Larissa Waters says Labor's proposed bill can be easily exploited by mining corporations.\n\n\n\n\n\n\"The drafted environmental laws that we've seen make it easier and faster for the big miners and the big loggers to trash the place and do absolutely nothing to protect nature from big corporations and their absolute profiteering. It's almost like they gave the pen to Chevron, and Woodside and Santos to write this version of our environmental laws, that is how convenient it will be for business to trash the place.\"\n\n\n\n\n\nThe Coalition, which also opposes the reforms, is urging Labor to consider splitting the bill into two.\n\n\n\n\n\nHowever, both parties have been criticised by Professor Graeme Samuel, the author of the 2021 review of the Environment Protection and Biodiversity Conservation Act.\n\n\n\n\n\nProfessor Samuel has urged the parties to set aside their differences and embrace the reforms.\n\n\n\n\n\n.\n\n\n\n\n\nAt least four people have been killed in clashes with security forces in Cameroon following a tightly contested presidential election that saw the 92-year-old incumbent President Paul Biya returned.\n\n\n\n\n\nThe result has been contentious, with hundreds storming the streets of various cities in defiance of a protest ban, claiming opposition candidate Issa Tchiroma Bakary had been denied a legitimate vote.\n\n\n\n\n\n\"We want our president, Issa Tchiroma, to come and fix the country. We have suffered enough. Young people are not working. Everyone is suffering. There are no jobs and the country is in chaos. In other words, the crisis in the north is not being resolved. The arms dealers are not being dealt with. Because one person can ruin the country, destroy the country at every level. That means that people are suffering, you see, the whole population has started to lose their jobs.\"\n\n\n\n\n\nThe government has rejected opposition accusations of irregularities.\n\n\n\n\n\n.\n\n\n\n\n\nIn Tokyo, a small group of protesters took to the streets to demonstrate against the United States President's plans to meet with Japan's newly elected Prime Minister, Sanae Takaichi.\n\n\n\n\n\nPrime Minister Takaichi will be hoping to impress Donald Trump further - after already making an $842 billion investment pledge in exchange for respite from import tariffs.\n\n\n\n\n\nThis 62-year-old protester was among the group of demonstrators that accused the U-S and Japan of waging war against China.\n\n\n\n\n\n\"The United States and Japan are trying to prolong the life of this capitalist system, this imperialist system, by waging war against China. We're demonstrating today as workers, students and citizens to show our total opposition to this.\"\n\n\n\n\n\nMr Trump is aiming to reach a trade truce when he meets Chinese President Xi Jinping in South Korea later this week.\n\n\n\n\n\n.\n\n\n\n\n\nTo sport now, and in football...\n\n\n\n\n\nMacarthur F-C have brushed off illness to beat Adelaide 2-1 and rise from the bottom of the A-League Men's table.\n\n\n\n\n\nThe Bulls were without three starting midfielders in Monday night's clash at Campbelltown Stadium, after losing Anthony Caceres, Chris Ikonomidis and Sime Grzan to gastroenteritis.\n\n\n\n\n\nThe trio had picked up the illness in Vietnam, where the Bulls drew 1-1 with Cong An Hanoi FC in the ACL Two last Thursday.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/video/early-testing-the-key-to-preventing-serious-bone-breaks/u4f4lkxq2",
        "title": "Early testing the key to preventing serious bone breaks",
        "publish_date": "Mon, 27 Oct 2025 08:28:08 +0000",
        "category": "lifestyle",
        "authors": [],
        "text": "Early testing the key to preventing serious bone breaks\n\nPublished 27 October 2025, 7:42 am\n\nAlmost 40 per cent of people who experience a fracture from a minor fall have never received a bone density test, according to a new report. Experts say earlier testing and treatment for osteoperosis, is an important part of preventing serious bone breaks.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/how-to-check-if-youre-eligible-to-claim-part-of-this-50m-payout-from-facebook/22lalg70b",
        "title": "How to check if you're eligible to claim part of this $50m payout from Facebook",
        "publish_date": "Mon, 27 Oct 2025 06:53:37 +0000",
        "category": "finance",
        "authors": [],
        "text": "More than 311,000 Australian Facebook users can apply for a slice of a $50 million compensation fund from tech giant Meta — the largest ever payment for a breach of Australians' privacy.\n\n\n\n\n\nBut the clock is ticking. Even if you're eligible, you only have until 31 December to make your claim. Similar payouts have already started in the United States.\n\n\n\n\n\nFrom who's eligible, to how to make a claim, to how much the eventual payout might be: here's what you need to know.\n\n\n\nWhy so many Australians can apply?\n\nThe landmark settlement arose from Meta's involvement in the Cambridge Analytica scandal, a massive data breach in the 2010s in which a British data firm harvested private information from 87 million Facebook profiles worldwide.\n\n\n\n\n\nIt led to a record-breaking US$5 billion ($7.7 billion) penalty in the US against Meta as Facebook's parent company, and the creation of a US$725 million ($1.1 billion) compensation scheme for affected Americans.\n\n\n\nHere in Australia, an investigation by the national privacy regulator — the Office of the Australian Information Commissioner — found Cambridge Analytica used the This Is Your Digital Life personality quiz app to extract personal information.\n\n\n\n\n\nThat investigation found just 53 Australian Facebook users installed the app. But another 311,074 Australian Facebook users were friends of those 53 people, meaning the app could have requested their information too.\n\n\n\n\n\nIn December 2024, the information commissioner announced she had settled a court case with Meta in return for an \"enforceable undertaking\", including a record $50 million payment program.\n\n\n\n\n\nClaims opened on 30 June and close on 31 December.\n\n\n\nWho can apply?\n\nYou can apply if you:\n\n\n\nheld a Facebook account between 2 November 2013 and 17 December 2015 (the eligibility period);\n\n\n\nwere in Australia for more than 30 days during that period, and\n\n\n\neither installed the Life app or were Facebook friends with someone who did.\n\nHow to apply – but watch for scams\n\nThe Facebook Payment Program is being administered by the consulting firm KPMG. Meta has to pay KPMG to run it; that doesn't come out of the $50 million fund.\n\n\n\n\n\nThat website is where to go with questions or to lodge a claim.\n\n\n\n\n\nMeta has sent all Australians it knows may be eligible this \"token\" notification within Facebook: You may be entitled to receive payment from litigation recently settled in Australia. Learn more.\n\n\n\n\n\nTry this link to see if the company has records of you or your friends logging into the Digital Life app. If there are, you should be able to use the \" fast track \" application.\n\n\n\n\n\nIf you didn't get that notification but you think you were affected, you can make a claim using the standard process by proving:\n\n\n\nyour identity, such as with a passport or driver's licence\n\n\n\nyou held a Facebook account and were located in Australia during the eligibility period.\n\nBut watch out for scammers pretending to be from Facebook or to be helping with claims.\n\n\n\nWhich payout could you be eligible for?\n\nYou need to choose to apply for compensation under one of two \"classes\", requiring different types of proof.\n\n\n\n\n\nClass 1: the harder option, expected to get higher payouts\n\n\n\n\n\nTo claim for \"specific loss or damage\", you'll need to provide documented evidence of economic and/or non-economic loss or damage. For example, this could include out-of-pocket medical or counselling costs, or having to move if your personal details were made public.\n\n\n\n\n\nYou'll also need to show damage was caused by the Cambridge Analytica data breach. For many people, proving extensive loss or damage may be difficult.\n\n\n\nClass 1 claims will be decided first. There are no predetermined payout amounts; each will be decided individually.\n\n\n\n\n\nIf your class 1 claim is unsuccessful, but you're otherwise eligible for a payout, you will be able to get a class 2 payout instead.\n\n\n\n\n\nClass 2: the easier option, likely to get smaller payouts\n\n\n\n\n\nAlternatively, you can choose to claim only for loss or damage based on \"a generalised concern or embarrassment\" caused by the data breach.\n\n\n\n\n\nIt's a much easier process — but also likely to be a much smaller payment.\n\n\n\nAll class 2 claimants will receive the same amount, after the class 1 payouts.\n\n\n\n\n\nThese claimants only need to provide a statutory declaration that they have a genuine belief the breach caused them concern or embarrassment.\n\n\n\n\n\nIn Meta's enforceable undertaking with the information commissioner, it states KPMG is able to apply a cap on payments to claimants. It also states if there is money left after all the payouts, KPMG will pay that amount to the Australian government's Consolidated Revenue Fund.\n\n\n\n\n\nMeta told The Conversation: \"There is not a predetermined cap on payments.\"\n\n\n\n\n\n\"The appropriate time to determine whether any cap should apply to payments made to claimants is following the end of the registration period [December 31].\"\n\n\n\n\n\nSo it's not yet clear how much of the $50 million fund will go to Australian claimants versus how much could end up going to the federal government.\n\n\n\n\n\nPayments are expected to be made from around August 2026.\n\n\n\nHow much are payouts likely to be?\n\nPayouts from similar settlements by Meta elsewhere have been very small. For example, US Facebook users eligible for their US$725 million ($1,100 million) compensation scheme have expressed surprise at the size of their payouts. One report suggests the average US payment is around US$30 ($45) each.\n\n\n\n\n\nHere in Australia, a lot will depend on how many people bother to register between now and 31 December.\n\n\n\n\n\nGraham Greenleaf is an honorary professor at Macquarie Law School, Macquarie University. Greenleaf is a board member of the Australian Privacy Foundation, a voluntary, non-government organisation.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/us-china-optimism-boosts-asx-ahead-of-global-rate-decisions/m0icgigw2",
        "title": "US China optimism boosts ASX ahead of global rate decisions",
        "publish_date": "Mon, 27 Oct 2025 06:34:39 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/copyright-laws-to-protect-creatives-from-ai-data-mining/eyp1pr58e",
        "title": "Copyright laws to protect creatives from AI data mining",
        "publish_date": "Mon, 27 Oct 2025 04:14:24 +0000",
        "category": "finance",
        "authors": [],
        "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts .\n\n\n\n\n\nTRANSCRIPT:\n\n\n\n\n\nIn a victory for Australian creators, the Albanese government is definitively ruling out giving tech giants free rein to mine creative content for training Artificial Intelligence models.\n\n\n\n\n\nThe Australian Recording Industry Association's chief executive Anna Bell has told the ABC that it was a \"critical step in the right direction.\"\n\n\n\n\n\n\"The government has stood up and backed in copyright law as well as artists, creators and rights holders. And basically what they're saying is we will not agree to dilute and weaken our copyright laws so that a small number of very large tech companies can have free and open access to very important and valuable cultural works.\"\n\n\n\n\n\nRequested by sections of the tech sector, the so-called “text and mining” exemption was floated by the productivity commission in their August interim report into harnessing data and digital technology.\n\n\n\n\n\nThe report suggested that AI could boost the economy by $116 billion over a decade.\n\n\n\n\n\nBut the proposal faced immediate denunciation from the creative sector and the Australian Council of Trade Unions, who argued it would give tech giants a \"free pass\" for the rampant theft of creative work, and deprive Australian artists of valuable income.\n\n\n\n\n\nEnvironment Minister Murray Watt says that's not what the government wants.\n\n\n\n\n\n\"The Albanese Government are a strong supporter of our arts community and we recognise that they deserve their fair share for their efforts in producing product, as do media organisations. One of the things that we know about AI is that while it can produce enormous productivity gains and many benefits for us on a personal level, we also need to have proper safeguards in place to make sure that in this case artists, media organisations, creatives get their fair share from their work and that's why we will not be providing an exemption for what's known as text and data mining for AI companies.\"\n\n\n\n\n\nTom Sulston from Digital Rights Watch has told SBS that while the government's decision to scrap the text and data mining exemption is welcome, it doesn't go far enough.\n\n\n\n\n\nHe argues that protections shouldn't stop with professional creatives but must be extended to cover all Australians' social media content, private information, and biometric data.\n\n\n\n\n\n\"Sure at the moment, the AI companies are able to ingest content from social media without gathering the consent of the people who have written it. Most social media companies will have a Terms of Use that essentially say anything you put into their system they can do whatever they want with. And we don't think that is sufficient. As individuals, we still control that data, so it's important that we're allowed to say, I don't want this to be part of an AI training thing or used for something that I don't want it to be used for. And then similarly, our personal and private information is also up for grabs by AI companies.\"\n\n\n\n\n\nMr Sulston says that while Australian's browse the internet, the private data they generate can be used by big tech for anything from profiling to targeted ads.\n\n\n\n\n\nCalling this a \"huge power imbalance,\" he argues that it leaves citizens little control over their own lives, proposing a change in privacy law to address the issue.\n\n\n\n\n\n\"So we're calling for a right to delete provision in the upcoming Privacy Act review that will allow us to say, hey, you know, I gave a company some data because we were doing, you know, some business together, and now I want to revoke that permission, and they are not allowed to use my data for whatever other purposes they might be putting it to.\"\n\n\n\n\n\nWhile the government is completely ruling out a \"text and data mining\" exemption, Federal Attorney-General Michelle Rowland has told the ABC that the work is not over.\n\n\n\n\n\nInstead, the 'reconstituted copyright and AI reference group' is convening to determine the path forward.\n\n\n\n\n\nMs Rowland says that while Australia’s Copyright Act is 'robust,' it must also accommodate the challenges of AI.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/sbs-news-in-easy-english-27-october-2025/0xl6e1iig",
        "title": "SBS News in Easy English 27 October 2025",
        "publish_date": "Mon, 27 Oct 2025 04:01:49 +0000",
        "category": "sports",
        "authors": [],
        "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nWelcome to SBS News in Easy English, I'm Camille Bianchi.\n\n\n\n+++\n\n\n\n\n\nJapan's Prime Minister Sanae Takaichi has told Australia's Prime Minister Anthony Albanese their two countries should be the leaders in creating partnerships in the region.\n\n\n\n\n\nMr Albanese congratulated Ms Takaichi for being elected and Ms Takaichi told the ASEAN world leaders meeting that a secure Indo-Pacific is very important.\n\n\n\n\n\n\"And Japan advocates for a free and open Pacific and consistently supports the ASEAN outlook on the Indo-Pacific.\"\n\n\n\n+++\n\n\n\n\n\nCanada's Prime Minister, Mark Carney, has also spoken to South East Asian leaders at the ASEAN Summit, saying he wants to build stronger trade relations with countries in the region.\n\n\n\n\n\nCanada is moving away from exporting its goods to its main trading partner, the United States, because of tariffs.\n\n\n\n\n\nMr Carney did not talk about the US in his speech.\n\n\n\n\n\n\"But very important, and this is something I want to underscore. We would like to complete the negotiations of the Canada-ASEAN free trade agreement over the course of next year's presidency. We will put all the resources in to supplement to your work on digital, on clean tech and energy wherever we can. Because this is the form of reason and respect. This is the form of inclusivity and sustainability. And we are keen to contribute in any way we can.\"\n\n\n\n+++\n\n\n\n\n\nQueensland's health department is asking people to be aware of products without labels, after rat poison was found in chilli pastes.\n\n\n\n\n\nProfessor Catherine McDougall is the state's health officer.\n\n\n\n\n\n\"The products that we have provided information about have tested positive for brodifacoum and three of the five people who have tested positive have consumed these products.\"\n\n\n\n+++\n\n\n\n\n\nA new football competition - the FIFA ASEAN Cup is starting in south east Asia,\n\n\n\n\n\nFIFA president Gianni Infantino, says 11 countries will play in the tournament.\n\n\n\n\n\n\"And we launch this competition to give a real boost to football with the best players in the framework of the international match calendar of FIFA to make it really, really impactful in the region, but also to shine in the entire world. Football unites the world. We are uniting the world together with all 11 ASEAN countries.\"\n\n\n\n+++\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/video/how-a-literacy-and-numeracy-program-is-helping-adults-open-up-career-options/w59nddetj",
        "title": "How a literacy and numeracy program is helping adults open up career options",
        "publish_date": "Mon, 27 Oct 2025 03:59:59 +0000",
        "category": "finance",
        "authors": [],
        "text": "How a literacy and numeracy program is helping adults open up career options\n\nPublished 27 October 2025, 2:19 am\n\nOne in five Australians, or 3 million adults, have low literacy or numeracy skills, and it can have a big impact on how they're able to engage in everyday life. Programs are in place across the country to help people improve their skills and achieve their life goals. One in Tasmania is helping adults become work ready.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/video/access-to-culturally-safe-disability-support-essential-many-first-nations-clients-say/2u8ov3v7m",
        "title": "Access to culturally safe disability support essential, many First Nations clients say",
        "publish_date": "Mon, 27 Oct 2025 03:59:51 +0000",
        "category": "finance",
        "authors": [],
        "text": "Access to culturally safe disability support essential, many First Nations clients say\n\nPublished 27 October 2025, 2:25 am\n\nIndigenous clients make up eight percent of NDIS recipients, but they can only choose from less than one percent of First Nations service providers. Many say culturally safe support is essential - but the NDIS says it's trying to change that.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/video/nearly-a-decade-on-these-aussie-posters-are-re-igniting-conversations/eb5obxf4r",
        "title": "Nearly a decade on, these Aussie posters are re-igniting conversations",
        "publish_date": "Mon, 27 Oct 2025 03:31:52 +0000",
        "category": "entertainment",
        "authors": [],
        "text": "Nearly a decade on, these Aussie posters are re-igniting conversations\n\nPublished 27 October 2025, 2:43 am\n\nNearly a decade ago, posters began popping up in cities around the country with a striking image of a Muslim cameleer with the caption “Aussie”. The artist aimed to start a conversation about what it means to be Australian at a time when racial division was rife. His message is still relevant today - dividing opinions and touching the lives of many, including politicians.",
        "source": "SBS"
    },
    {
        "url": "https://www.theage.com.au/business/markets/asx-set-to-slide-wall-street-jumps-on-us-china-talks-gold-slumps-again-20251028-p5n5qg.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "ASX slides as gold miners, CSL and WiseTech shares slump; Banks surge",
        "publish_date": "Tue, 28 Oct 2025 12:17:13 +1100",
        "category": "finance",
        "authors": [
            "Staff Writers"
        ],
        "text": "The Australian sharemarket had a rocky start to trading on Tuesday, with gold miners and some big companies weighing on the market while financial stocks and retailers advanced after Wall Street hit more records overnight.\n\nWiseTech Global shares plunged after the software giant said police and market regulators raided its headquarters and executed a search warrant this week. CSL shares tanked after Australia’s biggest healthcare company told investors vaccine scepticism in the US had hurt its profits, and it would delay the planned spin-off of its vaccines arm.\n\nWall Street set new records, but it’s a mixed bag for the Australian market. Credit: AP\n\nThe S&P/ASX 200 was down 35 points, or 0.4 per cent, at 9020.60 as of 11.32am AEDT, even as seven of its 11 industry sectors were trading higher. The bourse’s decline comes after the ASX added 0.4 per cent on Monday. The Aussie dollar traded at US65.59¢ at 11.31am.\n\nWiseTech shares plunged 17 per cent after the company said that Australian Federal Police and market regulators had raided its Sydney headquarters and executed a search warrant on Monday. The investigation concerns alleged trading in WiseTech shares by its billionaire co-founder Richard White and three company employees between late 2024 and early 2025, the board said.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/new-bureau-website-suffers-backlash-20251028-p5n5w7.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "New bureau website suffers backlash",
        "publish_date": "Tue, 28 Oct 2025 12:16:14 +1100",
        "category": "finance",
        "authors": [],
        "text": "New bureau website suffers backlash\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/nrl/tom-trbojevic-commits-to-sea-eagles-with-900-000-contract-extension-20251028-p5n5wf.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Tom Trbojevic commits to Sea Eagles with $900,000 contract extension",
        "publish_date": "Tue, 28 Oct 2025 12:14:59 +1100",
        "category": "sports",
        "authors": [
            "Adrian Proszenko"
        ],
        "text": "Manly have announced the retention of Tom Trbojevic on a new one-year deal.\n\nTrbojevic has agreed to take a pay cut to remain at the NRL club, accepting an offer of about $900,000 to stay put until the end of 2027. It ends what has been a long and at times adversarial negotiation period. The 29-year-old fullback at one point considered his options in the English Super League.\n\nSuperstar Manly fullback Tom Trbojevic is staying put on the northern beaches. Credit: Getty Images\n\nHowever, the parties have come to an agreement, avoiding what would have been a public relations disaster after Manly captain Daly Cherry-Evans opted to leave at the end of the club’s 2025 campaign.\n\nA former Dally M Medallist, “Turbo” is preparing for his 12th season with Manly, having scored 111 tries from 170 NRL games. The local junior said he’s glad to have his future finalised after recently returning from a post-season holiday.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/business/markets/trump-tightens-the-noose-on-putin-s-cash-machine-20251028-p5n5sz.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Blacklisted: Trump puts the squeeze on Putin",
        "publish_date": "Tue, 28 Oct 2025 11:58:33 +1100",
        "category": "finance",
        "authors": [
            "Stephen Bartholomeusz"
        ],
        "text": "Donald Trump and his family have personal relationships, of course, with a number of the leaders of the key Middle Eastern producers that they might be able to call on if there is a need to further expand OPEC production. Whether that is necessary, or not, depends on what impact the new sanctions have. Russia has been able to find workarounds to counter earlier sanctions and the price caps the G7 economies have imposed on its exports. An oil field in Siberia. About 80 per cent of Russia’s oil exports have now been targeted by the US and the European Union. Credit: Bloomberg It has developed a vast “shadow” fleet of tankers that have shipped its oil, albeit at discounts to global prices, to countries including China, India and Turkey. They have been prepared to ignore the sanctions.\n\nThe American intervention, and the threat of secondary sanctions that threaten to cut off access to the US and US dollar-denominated global financial system, has, however, already had an impact. Loading Chinese state-owned companies and India’s major refineries – Russia’s two biggest customers – have already suspended seaborne imports of Russian oil while they work through the implications of the sanctions. They can’t afford to be shut out of the global financial system. China’s purchases of Russian oil and assistance for its war efforts will inevitably come up in this week’s head-to-head discussions between Trump and Chinese President Xi Jinping. Trump’s 50 per cent tariff on India’s exports to the US might also become a discussion point between the US and India if the US is serious about throttling Russia’s oil revenues. Russia will almost inevitably find some sort of workaround – it’s shown how resourceful and creative its oil exporters can be – but there will be some squeezing of its oil exports and, if it is to largely maintain export volumes, it will probably come at the cost of even bigger discounts to global prices.\n\nThe EU and United Kingdon (but not the US), last month reduced the price cap on Russian oil (backed by the threat of sanctions and loss of insurance cover) from the $US60 a barrel cap imposed in late 2022 to $US47.60 a barrel. Russia’s flagship crude had been selling at $US12 to $US13 a barrel discounts to the previous cap. To maintain export volumes now that Rosneft and Lukoil have been sanctioned, Russia may well have to increase the scale of its discounts even as the cost of establishing new and more expensive ways of circumventing the sanctions increases. With oil exports accounting for about one-third of Russia’s budget revenues and those revenues already under pressure from a slowing economy and an inflation rate running above 8 per cent, the impact of the sanctions on Russia’s economy – if the US polices them effectively – could be material. That economy has held up far better than expected when the West first responded to Russia’s invasion of Ukraine with sanctions and the seizure of about $US300 billion ($457.4 billion) of Russia’s offshore foreign exchange reserves, largely because Vladimir Putin rapidly switched its structure away from a market-driven economy to a wartime economy.\n\nPerversely, that generated increased growth, reduced unemployment and significant increases in wages as more and more of Russia’s industrial base – and its citizens – were devoted to the war effort. There are, however, now signs of strain. Russia’s industrial base is now devoted to producing goods that, once deployed in the war, produce no recurrent economic benefit. Investment has flowed away from other activities into military spending, increasingly starving non-military activity of funds. With oil inventories bulging and expanding and OPEC still sitting on millions of barrels a day of unused capacity, any reduction in the flow of Russian oil into the global market could be absorbed without massive price impacts. The expansion of the Russian military, and the need to replace the hundreds of thousands who have died and the other hundreds of thousands that have been wounded, is producing shortages of workers across the economy while driving up wages and inflation. Resources have been concentrated in Moscow and military centres, drawing them away from the regions and causing financial stresses and degrading services in some of Russia’s poorer regions.\n\nFrom a remarkably positive 4.3 per cent growth in GDP last year, even Russia’s own forecasters see growth of only about 1 per cent this year. The International Monetary Fund and World Bank both forecast growth of less than 1 per cent this year and not much more over the next few years. Loading Last week Russia’s central bank cut its policy rate by 0.5 of a percentage point, to 16.5 per cent. It had been as high as 21 per cent. Economic growth of 1per cent or less and inflation of 8 per cent or more equals stagflation. Russia’s economy is stagnating, with the inflation rate eroding the value of the revenues and taxes available for military spending, which accounts for about 40 per cent of Moscow’s spending and about 8 per cent of GDP – about twice the amount spent before the invasion. Moscow is budgeting for flat defence and security expenditures in 2025-26. That implies a reduction in real terms and signals how tight the country’s finances now are even though the government has been increasing fees, fines, taxes on individuals and companies and has foreshadowed an increase in the country’s value-added tax rate to 22 per cent and a broadening of that tax’s base.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/politics/federal/reluctant-but-compliant-snapchat-tiktok-and-meta-yield-to-social-media-ban-20251028-p5n5rs.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Reluctant but compliant Snapchat, TikTok and Meta yield to social media ban",
        "publish_date": "Tue, 28 Oct 2025 11:56:09 +1100",
        "category": "finance",
        "authors": [
            "Nick Newling"
        ],
        "text": "Snapchat, TikTok and Meta will comply with the government’s under-16 social media ban, confirming their capitulation during a tense Senate inquiry in which TikTok was accused of intimidating a senator’s office for asking tough questions.\n\nThe platforms that failed to front an earlier inquiry this month, but had met with Communication Minister Anika Wells, told senators on Tuesday they would not fight the ban, but that it would harm the wellbeing of young people locked out of the platforms.\n\nElla Woods-Joyce, Public Policy Lead, Content and Safety, TikTok, appears via videolink (bottom left) during a hearing on the Internet Search Engine Services Online Safety Code. Credit: Alex Ellinghausen\n\n“We will comply with the law, even though we believe it has been unevenly applied and risks undermining community confidence in the law,” Snap Inc’s senior vice president of global policy Jennifer Stout told the Senate inquiry this morning.\n\n“We know this will be difficult for young people who use Snapchat to communicate with their closest friends and family. For teens, connection and communication are strong drivers of happiness and wellbeing. Taking that away does not necessarily make them safer and it may instead push them towards other messaging services that lack Snapchat’s safety and privacy protections,” Stout said.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/nrl/a-high-tackle-ended-a-test-appearance-within-90-seconds-the-victim-wanted-a-stronger-punishment-20251027-p5n5n8.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "A high tackle ended a Test appearance within 90 seconds. The victim wanted a stronger punishment",
        "publish_date": "Tue, 28 Oct 2025 11:54:00 +1100",
        "category": "sports",
        "authors": [
            "Christian Nicolussi"
        ],
        "text": "An angry Stefano Utoikamanu could not believe Francis Molo avoided scrutiny for a high shot that ended his Tongan debut in 90 seconds, saying: “I don’t know what more evidence you need to sin-bin someone.”\n\nUtoikamanu had to fly back to Sydney with the Samoan players on Monday rather than join the Tongans in New Zealand, following Sunday’s 34-6 loss at a packed Suncorp Stadium.\n\nThe front-rower confirmed he would miss Sunday’s must-win clash against New Zealand as part of the sport’s concussion protocols. He’s also stunned Molo was only penalised, and not sent to the sin-bin, over the incident.\n\nThe match review committee charged Molo with a grade-two careless high tackle, but the sanction for that in an international match is 13 per cent of his $3000 match payment, or $390.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/world/europe/how-epstein-and-andrew-drew-a-pm-s-daughter-into-a-swamp-20251028-p5n5qk.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "How Epstein and Andrew drew a PM’s daughter into a swamp",
        "publish_date": "Tue, 28 Oct 2025 11:53:44 +1100",
        "category": "finance",
        "authors": [
            "David Crowe"
        ],
        "text": "She was sufficiently connected, however, to be in Epstein’s seven-storey townhouse in Manhattan in December 2010. Unbeknownst to Epstein and Andrew, a photographer was watching them. Keating was seen leaving the house as Andrew waved her farewell at the front door. Loading Her misfortune was to be in the house at what turned out to be a pivotal moment. Epstein and Andrew went for a walk in Central Park – and the photographer, Jae Donnelly, took the shot that proved they were back in touch. Andrew chose to keep up his friendship with a man convicted of sex with a minor. Keating has never talked about why she was at Epstein’s house that December. But she confirmed she went to the dinner in February. “It was a large social event,” she told The Daily Mail, and she mentioned prominent media personalities who also attended. “A sizeable chunk of NY society was there, including Barbara Walters, Charlie Rose and Katie Couric. At the time, I had only lived in NY about 10 weeks, and was happy to accept the odd social invitation.”\n\nShe could not be contacted by this masthead for comment. All of this is fuel for those who assume the guilt of anyone who came near Epstein. Social media has spread slurs about Keating for years because of the townhouse photo. Some will add the email to the mix. But the public interest is slim. Keating does not hold any public office. She is under no obligation to answer questions about her private life. The main reason for looking into the new email is to counter the conspiracies. One assumption, for instance, is that Keating knew Maxwell and moved in the same circles as Epstein. In fact, there is no evidence that she knew Maxwell before 2014, when she interviewed her for a project called IdeaPod, published by the Huffington Post. Another assumption is that she was very close to Andrew. Instead, the friendship seems to have been with his daughters, Princess Eugenie and Princess Beatrice. Keating was photographed with Eugenie at Fashion Week in New York in 2014.\n\nAt the risk of labouring the point, there are no grounds for suggesting an intimate relationship with Andrew. Prince Andrew is under renewed pressure over his links with Epstein. Credit: AP Nor is there a reason to think Keating knew all the murky details about Epstein. The plea deal meant some of the facts did not see the light of day until years later. Keating was not alone in walking too close to the spider’s web. Epstein drew many people around him from 2010 onwards, when he regained his place in New York society. Some of them were his accomplices. Others were simply invited to dinner. He used donations to charities, amplified by publicists, to try to bury the past. One New York publicist, Peggy Siegal, ensured he was invited to events. Siegal told The New York Times in 2019 that she had no trouble restarting their friendship after his prison term: “The culture before #MeToo was – ‘You’ve done your time, now you’re forgiven’.”\n\nSiegal arranged a dinner party for Prince Andrew at Epstein’s mansion in 2010, according to The New York Times. Those at the dinner included filmmaker Woody Allen and his wife, Soon-Yi Previn, as well as broadcasters Charlie Rose, Katie Couric and George Stephanopoulos. Loading Turning up to dinner did not make someone an Epstein accomplice. It might demonstrate poor judgment, or ignorance, but not necessarily guilt. Comedian Chelsea Handler attended the 2010 dinner, for instance, and later said she had no idea who Epstein was. She also asked a pointed question of Allen and his wife: “So, how did you two meet?” Two key conclusions emerge from the email about Keating, Epstein and the prince. The first is that there is no evidence that Keating did anything wrong. The second is that Andrew is utterly exposed. This is the second email to emerge within the last two weeks that confirms he misled the public when he claimed that he cut off contact with Epstein on the day they walked in Central Park in December 2010.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/afl/chloe-molloy-out-for-the-season-in-huge-blow-to-swans-finals-hopes-20251028-p5n5un.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Chloe Molloy out for the season in huge blow to Swans’ finals hopes",
        "publish_date": "Tue, 28 Oct 2025 11:53:19 +1100",
        "category": "sports",
        "authors": [
            "Hannah Kennelly"
        ],
        "text": "Sydney superstar Chloe Molloy will miss the remainder of the AFLW season after suffering a back injury, in a devastating blow to the team’s finals hopes.\n\nThe Swans’ co-captain made a spectacular return to AFLW this season after being sidelined with an ACL injury in 2024 that required a knee reconstruction and long recovery.\n\nChloe Molloy will miss the rest of the 2025 AFLW season. Credit: Getty Images\n\nThe Swans said in a statement that Molloy had experienced back soreness for the past fortnight.\n\n“Following further investigation and specialist opinion, the club’s medical staff have made the recommendation for Molloy to undergo surgery later this week,” Sydney said.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/afl/top-afl-draft-prospect-stars-in-vfl-debut-20251028-p5n5w1.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Top AFL draft prospect stars in VFL debut",
        "publish_date": "Tue, 28 Oct 2025 11:47:21 +1100",
        "category": "sports",
        "authors": [],
        "text": "Top AFL draft prospect stars in VFL debut\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://au.news.yahoo.com/details-social-media-ban-231124197.html",
        "title": "‘Snitch’: Senators blow up over social ban",
        "publish_date": "2025-10-28T01:32:36Z",
        "category": "finance",
        "authors": [],
        "text": "A key hearing into the enforcement of Australia’s social media ban was derailed after two senators broke out into an argument over a “snitch line” feature for parents.\n\nNationals senator Ross Cadell asked Meta, TikTok and Snapchat executives whether the platforms had developed a tool for parents to “dob their kids in” if parents had no ability to shut down their children’s accounts.\n\nBefore the platforms could respond, Greens senator David Shoebridge quietly scoffed: “Are you serious?”\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nMr Cadell quickly responded in the affirmative and was halfway through questioning Mr Shoebridge before the Greens politician said: “I don’t think you should have a dob-in-a-child line.”\n\nAt this point, committee chair Sarah Hanson-Young was forced to intervene between the two politicians.\n\n“The questions are for our witnesses, you guys can debate in your own time,” she said.\n\nMr Cadell then accused Mr Shoebridge of trying to “avoid the law” before Senator Hanson-Young again interrupted to demand order.\n\nThe Tuesday hearing was into the Internet Search Engine Services Online Safety Code, known informally as the social media ban, and run by the Environment and Communications References Committee.\n\nTikTok a ‘bullying behemoth’\n\nDuring the inquiry, TikTok was singled out by Senator Cadell, whoaccused the social media giant of bullying and intimidation, claiming a TikTok staff member contacted his office while he was in a previous hearing related to the social media ban.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nHe claims the staffer said: “We get on very well with the leader’s office, we get on very well with the shadow minister’s office. You shouldn’t be asking these questions.”\n\nIn response, content and safety public policy lead Ella Woods-Joyce said she “wasn’t aware of the details” of the allegations.\n\n“What I can say is that the team needs to operate professionally and appropriately at all times, and I have confidence that that’s what we do,” she said.\n\nSenator Cadell also questioned why the Chinese-owned social media platform had aggressively lobbied the Australian government to rewrite the blanket under-16 ban to include YouTube.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\n“Is Tiktok not just a bullying behemoth that wants to get its own way at any cost?” he said.\n\nElla Woods-Joyce represented TikTok in Tuesday’s inquiry. NewsWire / Martin Ollman\n\nEarlier this year, Communications Minister Anika Wells reversed the government’s pre-election pledge to exclude YouTube from the incoming legislation after lobbying from senior TikTok executives, including Ms Woods-Joyce, who represented the company during Tuesday’s hearing.\n\n“We take a very transparent approach to all of the work that we do and very happy to share details of our concerns around the legislation and also our compliance strategy because at the end of the day we acknowledge we are captured by the law that the committee is here to speak about,” Ms Woods-Joyce told the committee.\n\nDeactivate or delete options\n\nEarlier in the hearing, social media companies shed light on how Aussie teens would be able to save their memories before the world-first platform ban takes effect.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nMeta, TikTok and Snapchat would initially freeze accounts for children who are 15 years and under on December 10 in compliance with Australia’s social media ban, the inquiry was told.\n\nArchiving memories, like existing posts, photos and videos, will be a part of TikTok and Snapchat’s process of freezing accounts when the ban kicks into effect in early December.\n\nFor TikTok users, several options would be available to affected teen users, including the ability to deactivate an account, place it in a state of suspension, or delete the account, in which case an archive feature would be available, Ms Woods-Joyce said.\n\nSnapchat, Meta and TikTok executives were questioned on their compliance with the laws. Picture: NewsWire / Martin Ollman\n\n“We also want to make sure that we’re communicating really clearly with our community about what they can expect and when they can expect it,” Ms Woods-Joyce said.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nSnapchat would implement a tool called Download My Data, which would secure photos and communications before accounts were disabled and locked, Snapchat global policy senior vice-president Jennifer Park Stout said.\n\n“Now, if you are a user who is able to establish that they are over 16, they will have an opportunity to do that through a variety of ways,” Ms Stout said.\n\n“They will have to verify their age through an age assurance mechanism that will be done in the most privacy protective way possible, but it would require the user to provide identification, indicating that they are 16 and above, go through a series of steps, and then they would then have access to their account.”\n\nMeta, which owns Instagram and Facebook, will provide deletion or deactivation options for teens whose accounts fall under the ban. Picture: NewsWire / Martin Ollman\n\nMeta would also provide the choice between deactivation and temporary pauses of young people’s accounts, Meta ANZ director of policy Mia Garlick said.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\n“We’re still working through the precise wording and flows, but we’ll certainly be providing people with notice … there’s deletion, which would remove the account, but deactivation will just temporarily pause it,” she said.\n\n“So we’re looking through a range of different options, but making sure that there is very clear notice to young people and their parents so they can take the actions that work best for them.”\n\nThe platform, which owns Instagram and Facebook, would enforce the minimum age limit with third-party provider Yoti, where people are given the option either of a video selfie, an age estimation approach or providing government identification, Ms Garlick said.",
        "source": "Yahoo"
    },
    {
        "url": "https://au.news.yahoo.com/time-soon-big-call-barnaby-012556485.html",
        "title": "‘Any time soon’: Big call on Barnaby’s future",
        "publish_date": "2025-10-28T01:25:56Z",
        "category": "finance",
        "authors": [],
        "text": "Michael McCormack says fellow former Nationals leader Barnaby Joyce is not defecting to One Nation “any time soon”, after the rogue MP hinted he could.\n\nMr Joyce earlier this month sensationally declared he would not recontest his seat of New England, citing an irreparable breakdown in his relationship with National Party leader David Littleproud.\n\nHe then played into speculation that he could make a Senate run for One Nation, which he said was “not barking mad” on climate policy.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nMr McCormack, who Mr Joyce deposed as deputy prime minister in 2021, said on Tuesday his old rival still had a responsibility to serve out his current term with the Nationals.\n\nFormer Nationals leader Michael McCormack says Barnaby Joyce will not defect to One Nation ‘any time soon’. Picture: NewsWire / Nikki Short\n\n“I think that’s what you need to do when people are prepared to hand out for you, and they’re prepared to don your yellow T-shirt with ‘I’m backing Barnaby’ on the back,” Mr McCormack told Nine’s Today, adding that Mr Joyce “needs to continue to serve and sit with the Nationals”.\n\n“I’ve always believed that life is determined by those who turn up.\n\n“And it was a shame he didn’t turn up to the party room meeting.”\n\nNationals MP Barnaby Joyce has hinted he is mulling a defection to One Nation. Picture: NewsWire / Martin Ollman\n\nMr Joyce snubbed his colleagues by skipping their party room meeting on Monday.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nHe did so after Mr Littleproud publicly said he was welcome and had a role to play.\n\nMr Joyce was booted from his shadow cabinet position in a move Mr Littleproud put down to a “generational change”.\n\nBoth the phrase and the demotion ruffled Mr Joyce’s feathers and left him to lead a crusade against net-zero emissions by 2050 from the backbench, undermining Sussan Ley and Mr Littleproud’s shared vision of a wholesale post-election review.",
        "source": "Yahoo"
    },
    {
        "url": "https://au.news.yahoo.com/social-media-giants-front-child-163000751.html",
        "title": "Tech giants agree to teen ban but give dark warning",
        "publish_date": "2025-10-28T01:24:59Z",
        "category": "finance",
        "authors": [],
        "text": "Snapchat, Facebook, Instagram and TikTok will comply with Australia's looming social media ban for children under the age of 16 but claim the restrictions will push young people into \"darker corners\" of the internet.\n\nKids who do not meet the age requirement will be booted off social media platforms from December 10, but there will be exceptions for health and education services including WhatsApp and Meta's Messenger Kids.\n\nTech executives were grilled during a parliamentary inquiry hearing on Tuesday, saying although they did not agree with the age restrictions they would implement the ban.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nTikTok public policy lead Ella Woods-Joyce said the company shared the concerns of experts that the \"blunt\" age bans won't work or resolve the concerns the laws aim to address.\n\n\"We support evidence-based sensible legislation that improves safety standards for all internet users ... a ban will push younger people into darker corners of the internet where rules, safety, tools and protections don't exist,\" she said.\n\nJennifer Stout, a representative from Snapchat's parent company Snap Inc, said the platform believed the ban had been applied unevenly and risked undermining community confidence in the new rules.\n\n\"For teens, connection and communication are strong drivers of happiness and well being, taking that away does not necessarily make them safer and it may instead push them towards other messaging services that lack Snapchat safety and privacy protections,\" she said.\n\nSnap Inc executive Jennifer Stout says the ban has been applied unevenly. (Lukas Coch/AAP PHOTOS)\n\nMeta regional director of policy Mia Garlick said compliance presented challenges because 16 was a \"globally novel age boundary\" as existing technologies were built to identify the age milestones of 13 and 18 years.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\n\"Distinguishing 13 from 16 is inherently less reliable and it also found greater challenges at the 16 age boundary with age estimation technologies,\" she said.\n\nPlatforms face fines of up to $50 million if they do not take reasonable steps to comply with the ban, but there won't be penalties for young people or their families if they gain access to the platforms.\n\nGreens senator Sarah Hanson-Young previously threatened to force executives from TikTok, Snapchat and Meta - the parent company of Facebook and Instagram - to appear at the inquiry into online safety after they were no-shows at an earlier hearing.\n\nPlatforms have been warned they face fines of up to $50 million if they do not comply with the ban. (Lukas Coch/AAP PHOTOS)\n\nThe law puts the onus for compliance on the companies to \"detect and deactivate or remove\" accounts from underage users.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nThis will mean about 1.5 million accounts on Facebook, Instagram, YouTube, TikTok, Threads and X will be deactivated in less than two months.\n\nTech giants Apple and Google removed OmeTV from their app stores this week after being alerted to concerns predators were using it to groom and sexually exploit Australian children.\n\nOmeTV instantly connects individuals with random strangers for a video chat.\n\nThe app's Portugal-based parent company Bad Kitty's Dad, LDA did not comply with requests sent by eSafety Commissioner Julie Inman Grant in August to introduce protections for Australian children.\n\neSafety Commissioner Julie Inman Grant detailed the dangers to children posed by OmeTV. (Mick Tsikas/AAP PHOTOS)\n\nThe tech giants have since banned the app and are expected to review all others available in their Australian stores.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\n\"This is an app that randomly pairs young children - with pedophiles,\" Ms Inman Grant told ABC News on Tuesday.\n\n\"This app will no longer be able to reach Australians and they will no longer be able to make money off children's misery.\"",
        "source": "Yahoo"
    },
    {
        "url": "https://au.news.yahoo.com/rush-to-find-foreign-object-after-aussie-tesla-windscreen-smashed-in-world-first-005833199.html",
        "title": "Rush to find foreign object after Aussie Tesla windscreen smashed in 'world first'",
        "publish_date": "2025-10-28T00:58:33Z",
        "category": "finance",
        "authors": [],
        "text": "A Tesla driver is desperately hoping officials can track the source of a foreign object that crashed into his windscreen while he and his wife were driving through farmland earlier this month.\n\nSouth Australian Dr Andrew Melville-Smith is lucky to be alive after the sudden collision sent \"hot\" shards of glass throughout the car, and it may even be a \"world-first\" occurrence.\n\nThe vet was driving his new Tesla on the Augusta Highway, 40km north of Port Germein, at 9pm on Sunday, October 19, when the frightening incident took place.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nIt's suspected that the object may have been a meteorite plummeting from space, with scientists keen to trace the object for further inspection.\n\nAndrew said it was \"pitch-black\" at the time, but it was an otherwise clear evening. He said the pair were cruising along the road listening to a podcast when they were jolted by \"a very, very violent explosion\".\n\n\"We had just picked up a new Tesla and we were driving up to Whyalla ... it was pitch black and the weather was calm — there was no rain or lightning or anything like that,\" he told ABC News Breakfast on Tuesday.\n\n\"Then there was, [what] I can only describe as a very, very violent explosion. The whole inside of the car was literally blasted with glass fragments. It was full of white smoke, and it smelled like the car was on fire.\"\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nThe crash left Andrew \"stunned\" for a good 10 seconds, he said. \"I was covered in glass. My wife said, 'Oh, the car's blown up',\" he recalled. Dramatic imagery shows the massive crack in the windscreen left by the flying rock, which Andrew said was hot to the touch.\n\nRemarkably, the Tesla, in self-driving mode at the time, carried on as if nothing had occurred.\n\nThe 'crater' left by the collision was 'hot to the touch'. Source: Andrew Melville-Smith/ABC News\n\n\"I thought we'd had an accident, but then I looked at the screen and went 'Oh, we're still driving',\" Andrew said.\n\n\"We were moving around, so it obviously thought we were paying attention, and it was happy to keep driving to Port Augusta. After we pulled over, we saw the big crater in the windscreen.\"\n\nCould Tesla driver's 'meteorite collision' be a world first?\n\nThe 71-year-old reported the unusual incident to the South Australian Museum. According to Geologist Dr Kieran Meaney, the damage to the windshield suggested a meteorite might be responsible, but it was too soon to confirm the exact cause.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\n\"The little detail that’s really selling it for me at the moment is that whatever it was that hit the windscreen seems to have been very hot,\" Mr Meaney told The Adelaide Advertiser, noting the discolouration where the plastic laminate had been scorched.\n\nAndrew wasn't able to locate the meteorite, but there is hope that fragments in the windshield may offer clues as to the source of the foreign object.\n\n“But until we can actually find the object and have a good look at the windscreen ourselves, we can’t say for certain what it was,\" Meaney said.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nIf it's confirmed, it could be the first reported incident of its kind. Andrew said he had been \"hit by rocks a few times\" while driving over the years, but this instance was markedly different.\n\n\"As I recovered from the shock of it, I had to wipe all the glass, because I was just covered in grass fragments. This was nothing like a rock,\" he said.\n\n\"A rock, you see them, you hear them. With this, there was no warning; it was just a huge explosion as you were driving along.\" Andrew is now in the process of organising researchers at the museum to examine the windscreen.\n\nDo you have a story tip? Email: newsroomau@yahoonews.com.\n\nYou can also follow us on Facebook, Instagram, TikTok, Twitter and YouTube.",
        "source": "Yahoo"
    }
]