[
    {
        "url": "https://www.9news.com.au/national/lotto-numbers-victorian-man-dumbfounded-after-winning-15-million/f5ed06c2-a519-4944-ac02-330222915c2f",
        "title": "Victorian man 'dumbfounded' after winning $1.5 million",
        "publish_date": "Fri, 05 Sep 2025 01:42:55 +0000",
        "category": "finance",
        "authors": [
            "Sep"
        ],
        "text": "A﻿ Victorian man has been left \"dumbfounded\" after winning $1.5 million in the weekly lotto draw.\n\nThe man from Hoppers Crossing won the division one prize in the TattsLotto draw 4603 on August 30.\n\nThere were four division one winners, with each one taking home ﻿$1,569,487.31.\n\nREAD MORE: Melania Trump reemerges to highlight responsible AI\n\nThe winning ticket was bought from Super Lotto in Hogans Shopping Centre, Hoppers Crossing. (Google Maps)\n\nThe winning numbers were ﻿10, 28, 5, 4, 9 and 36, and the supplementary numbers were 2 and 14.\n\nThe man found out he had won five days after the draw. ﻿\n\n﻿\"It's a dizzying experience!\" the man told The Lott after finding out he won.\n\n\"I always go to the same agency and play two tickets a week.\n\n\"But I just can't be bothered checking them straight away, so I usually only find out if I have a win when I go in the following week and collect $20 or $30.\n\n\"I went in today and asked them to check my ticket...the guy behind the counter said, 'Hang on, I've got good news for you'.\n\n\"I said, 'How good?'. He said, 'Very good news!'. Then he told me I'd won $1.5 million.\"\n\nHe said he'll still go to work, but the win will help him out greatly. ﻿ (The lott)\n\n\"I just stood there. I'm dumbfounded...It's a good feeling. The first thing that goes through your head is, 'you won't want for anything'.\n\n\"I lead a reasonably simple life. I'm not an extravagant spender.\"\n\nHe said he'll still go to work, but the win will help him out greatly. ﻿\n\n\"Nothing changes. I will still go to work,\" he said.\n\n\"It's just that if worst comes to worst, I won't have to worry about money.\n\n\"I'll pay off the house, but I won't touch the rest of it for a while. I'll invest it and think about how best to use it.\"\n\nREAD MORE: Thousands of free NYE tickets up for grabs as ballot opens\n\nOwner ﻿John Falduto said the newsagency was thrilled the mystery winner turned out to be one of their regulars. (Lotto)\n\nThe winning ticket was bought from Super Lotto in Hogans Shopping Centre, Hoppers Crossing.\n\nOwner ﻿John Falduto said the newsagency was thrilled the mystery winner turned out to be one of their regulars.\n\n\"We were thinking it was about time for another big win,\" he said.\n\n\"This is our twelfth division one win during the past 22 years!\"\n\n\"Congratulations to our winner. We hope this changes your life in a positive way.\"",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/world/researchers-find-oldest-written-claim-that-the-shroud-of-turin-was-faked/01e66860-7e08-4e92-a0d9-b8d7ad950a4a",
        "title": "Researchers find oldest written claim that the Shroud of Turin was faked",
        "publish_date": "Thu, 04 Sep 2025 21:41:29 +0000",
        "category": "entertainment",
        "authors": [
            "Sep"
        ],
        "text": "The Shroud of Turin — a 4.25-metre linen cloth bearing an image of a crucified man — has captivated people for centuries, stirring debate over whether the relic once wrapped the body of Jesus Christ.\n\nFor some, the cloth serves as visual proof of Jesus' resurrection; for others, it is merely a medieval relic made by an artist in the 14th century.\n\nNow, researchers have found new evidence that the authenticity of the cloth was disputed in writing earlier than once thought: medieval texts from a respected and influential French philosopher, Nicole Oresme, who alleged around 1370 that the Shroud was faked for the purpose of the church.\n\nThe Shroud of Turin — a 5.25 metre long linen cloth bearing an image of a crucified man — has captivated people for centuries. (Getty via CNN)\n\nThese claims appeared in Oresme's collection of writings known as his \"Problemata,\" which are dated between 1355 and 1382, according to the new study published on August 28 in the Journal of Medieval History .\n\nOresme's Problemata has been well researched — much of the text is even available online —but the philosopher's claims about the Shroud had been overlooked for centuries. It wasn't until lead study author Nicolas Sarzeaud, a researcher in history at the Catholic University Louvain, in Belgium, received the text from a colleague editing an unpublished treatise that he realised the significance of the writing.\n\n\"The fact that we have this new testimony on this object is very, very valuable,\" said Sarzeaud, who is also a fellow of the Villa Medici, a French Academy in Rome. Oresme was an interesting figure, not only for his merit as a scholar and philosopher, but because of his unbiased approach to topics, particularly those involving the church. \"In his debates, he tried to be sure that a phenomenon was real before he (discussed it). … he wrote a lot about believing. 'What is believing? And why do we believe in something?'\"\n\nPrior to the discovery of Oresme's claims, the oldest known documentation of the Shroud was in a series of documents from 1389 to 1390 written by notable figures such as the former bishop of Troyes, Pierre d'Arcis, who stated that the Shroud was created by an artist.\n\nWhile researchers like Sarzeaud claim Oresme's text adds to the already plentiful scientific and historical evidence that the Shroud is fake, some remain unconvinced.\n\nOresme and the Shroud of Turin\n\nAccording to the 1389 documents, including a letter written by Bishop d'Arcis to the pope, the Shroud of Turin appeared in the Champagne region of France around 1355. The cloth, bearing an image of a naked man with long hair and a beard, as well as reddish-brown stains resembling wounds from crucifixion, quickly became popular. News spread that the fabric was believed to have once wrapped the body of Christ, and the Shroud was said to cause miracles.\n\nBishops and priests prayed in front of the Shroud of Turin in 2010 in the Cathedral in Turin. (Getty via CNN)\n\nShortly after, the documents noted, the bishop of Troyes, Henri de Poitiers, announced that the cloth was fraudulent, adding he had met the artist who created the image. About 30 years later, when the cloth began to attract popular attention once more, the following bishop, Pierre d'Arcis, also stated in his letter that the cloth was artwork, and the pope decided soon after that it could continue being on display only as a representation of the true Shroud of Christ.\n\nThe cloth moved around several times after that, until it was relocated to Turin, Italy, in 1578. It can still be found there today, at the Cathedral of St. John the Baptist.\n\nRadiocarbon dating, conducted in 1988 by three separate laboratories, dated the fabric between 1260 and 1390, said Andrea Nicolotti, a professor of the history of Christianity and churches at the University of Turin who was not involved with the study but had worked with Sarzeaud previously.\n\nThe Shroud shows evidence of being a relic from medieval times, as its patterns are complex and would have required a sufficient loom likely not introduced until the 13th century, added Nicolotti, who is also the author of the 2019 book \"The Shroud of Turin: The History and Legends of the World's Most Famous Relic.\"\n\n\"In my opinion, we already have enough information to have settled the debate a long time ago,\" he said.\n\n\"Since no human body can leave that kind of image on the cloth, only two possibilities seem to remain: either it was artificially created by an artist, or it is a miracle,\" Nicolotti said in an email. \"Being able to say that the shroud is the result of a miracle, and that it is proof of the resurrection, is very tempting for some Christians: they think this way they can demonstrate Christ's divinity to the world.\"\n\nIn his Problemata, Oresme recommended caution when assessing alleged miracles, \"because many clergy men thus deceive others, in order to elicit offerings for their churches.\" He cited the Shroud as an example: \"There is manifest experience of that in a church in Champagne, where it was said that there was the shroud of the Lord Jesus Christ.\" Oresme died in 1382, seven years prior to the claims from the bishop of Troyes in the 1389 letter.\n\nOngoing debate\n\nMore than 600 years after its documented discovery, the Shroud of Turin is still being researched and debated. In July, a study from a researcher in Brazil using 3D-modeling software concluded that the image on the cloth is more likely the result of an imprint from a statue rather than from a human body.\n\nThose who believe the Shroud to be authentic, however, argued that the 3D-modeling study was incomplete. Skeptics claimed that the researcher did not factor in findings from the 1978 Shroud of Turin Research Project (STURP) that could disprove the theory of the cloth being artwork, such as a lack of pigment and the details of the blood stains, which are detectable with UV technology.\n\nCheryl White, the Hubert Humphreys Endowed Professor of History at Louisiana State University at Shreveport, said that the newly examined texts from Oresme do not add much to our understanding of the Shroud and its debated authenticity. White was not involved in the new study.\n\n\"This reference points only to something I think historians have always known — that skepticism about the Shroud existed early on,\" White, who also served as the historical consultant for the original Shroud of Turin exhibition at the Museum of the Bible in Washington, DC, said in an email. \"There is no question (Oresme) was one of the leading intellectuals of 14th-century France, a bishop and royal advisor. His skepticism might carry more weight given his standing, but it actually reflects his broader fight against false relics more than drawing upon any direct knowledge he had of the Shroud itself.\"\n\n\"My position is that the Shroud of Turin has defied explanation for centuries. … It is neither falsifiable nor is it reproducible, making it an ongoing mystery,\" White added. \"We need both more historical documents and the most advanced scientific testing; however, the Shroud may never be 'put to rest' — its enduring mystery is what makes it so compelling.\"",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/finance/ato-warning-unpaid-debt-commissioner-rob-heferen-speech/a99e8597-da85-4263-af68-62fda01ea496",
        "title": "Thousands of Aussies hit with $11 billion warning by tax office",
        "publish_date": "Thu, 04 Sep 2025 03:26:36 +0000",
        "category": "finance",
        "authors": [
            "Sep"
        ],
        "text": "The Australian Taxation Office (ATO) has issued a warning to the 22,000 people who owe it a collective $11 billion as it chases down billions more in unpaid tax .\n\nIn a speech to the Tax Institute today, ATO commissioner Rob Heferen said his organisation is currently owed some $50 billion in collectible debt.\n\n\"This debt is not disputed, most of it has been self-reported, and a significant portion is made up of amounts that have been withheld from employees' wages, or collected from consumers as GST – but not passed on to government,\" he said.\n\nREAD MORE: Former AFL coach Mick Malthouse assaulted while fighting off home invaders ﻿\n\nAustralians owe the tax office a collective $50 billion, with 22,000 people particularly bad offenders. (Getty)\n\n\"While the majority of tax is paid on time – about 90 per cent – in dollar terms, there is a significant amount that isn't.\"\n\nHeferen said collecting the $50 billion is a major focus for the ATO, and revealed there are 22,000 Australians in particular who can expect to hear from the tax office soon.\n\nWhile they comprise just 1 per cent of the taxpayers who are in debt to the ATO, they owe a collective $11 billion – around 20 per cent of all outstanding funds owed to the ATO, and about $500,000 each.\n\n\"It's a significant priority for us,\" Heferen said.\n\nREAD MORE: Major bank predicts no interest rate cut from RBA this month ﻿\n\nRob Heferen has said chasing down the ATO's collectible debt book was a priority for the tax office. (Alex Ellinghausen)\n\n\"We're using every tool available to recover what's owed from those 22,000 – using statutory demands for payment, wind-up processes, director penalty notices, garnishee notices, and departure prohibition orders.\"\n\nThe $50 billion in outstanding debt is almost enough to cover Australia's entire defence budget for a year, while the $11 billion is more than the federal government put towards its key election policies of boosting bulk billing under Medicare and extending energy bill rebates for six months combined.\n\nEarlier in his speech, Heferen gave an update on tax returns for the 2024-25 financial year.\n\nWith about two months to go until the October 31 deadline, about a quarter of taxpayers had lodged their returns, and had been given a significant average refund.\n\n\"As of 24 August, we've had over 6.1 million tax returns lodged and have issued over 4.5 million refunds, totalling $12 billion – with an average refund of $2639,\" he said.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/time-using-phone-on-toilet-increases-haemorrhoids-risk-study-finds/d8181d04-0e70-4b6d-b0b9-c9abe2dee70c",
        "title": "Using your phone on the toilet could bring a very painful result",
        "publish_date": "Thu, 04 Sep 2025 10:00:59 +0000",
        "category": "lifestyle",
        "authors": [
            "Sep"
        ],
        "text": "We can now add \"sitting on the dunny\" to the growing list of things smartphones and social media are helping to ruin.\n\nA new study out of the US found that people who used their phone while sitting on the toilet had a significantly higher risk of developing haemorrhoids.\n\n﻿Cethan Ramprasad and colleagues, from Beth Israel Deaconess Medical Centre, reported that out of their survey participants, 66 per cent reported using smartphones on the toilet, and they tended to be younger than non-users.\n\nSpending more time on the toilet - while scrolling on a phone, for example - can increase the risk of haemorrhoids. (Getty)\n\nAfter statistically accounting for other factors thought to possibly be linked with hemorrhoid risk – such as exercise habits, age, and fibre intake – the researchers found that participants who used a smartphone on the toilet had a 46 per cent higher risk of hemorrhoids than non-users.\n\nStrictly speaking, it's not the phone itself that's the issue, but the increased amount of time users spend on the porcelain throne while staring at the screen.\n\n\"It's incredibly easy to lose track of time when we're scrolling on our smartphones—popular apps are designed entirely for that purpose,\" study senior author Trisha Pasricha said.\n\n\"But it's possible that constantly sitting longer on the toilet than you intended because you're distracted by your smartphone could increase your risk of hemorrhoids.\n\n\"We need to study this further, but it's a safe suggestion to leave the smartphone outside the bathroom when you need to have a bowel movement.\"\n\n﻿Dr Jarrah Dowrick, research fellow with the Gastrointestinal Research Group at the Auckland Bioengineering Institute at the University of Auckland, was sceptical of the direct phone link but said the result was an \"important finding\".\n\n\"While the reality of modern screen addiction does make the smartphone narrative more compelling, the real story here is that spending longer on a seated toilet appears to be linked with haemorrhoid presentation,\" he said.\n\n\"Phone or no, this study suggests limiting each visit to the toilet to five minutes when possible﻿.\"\n\nVictoria University digital wellness expert Dr Alex Beattie﻿ said the study provided another example of how smartphones had infiltrated every corner of people's lives.\n\n\"It's quite telling that the study found men were more likely than women to use their phones on the toilet, though this difference wasn't statistically significant,\" Beattie said.\n\n\"Still, it reflects a broader truth of this digitally saturated era – that smartphones are often used as a form of escape: from parenting, from domestic routines, and sometimes from other people.\"",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/what-happened-to-office-cubicles-open-plan-distractions/b59cf341-38f1-4cee-8f72-3b777cc15acb",
        "title": "The office cubicle once reigned supreme. Could it make a comeback?",
        "publish_date": "Wed, 03 Sep 2025 23:54:01 +0000",
        "category": "finance",
        "authors": [
            "Sep"
        ],
        "text": "Imagine having your own space at work. For most Australians working in corporate offices, it's a far-off dream.\n\nMore than 2.2 million Aussies aged 15 to 24 were employed in July 2025, most of whom have only ever known the chatter and distraction of open-plan offices.\n\nBut there was a time – one older members of the workforce still recall – when the cubicle reigned supreme in offices all over the country.\n\nCubicles made a comeback in the TV series Severance, but could they return to Aussie offices? (Apple TV+)\n\nA time before hotdesking and being exposed to every sight, sound and smell in the office was the norm, despite how detrimental it can be to our ability to actually work.\n\nBut as businesses try to coax ﻿employees back into offices after years of work-from-home (WFH) arrangements, could 2025 be the year Australia finally resurrects the cubicle?\n\nOne expert says it's not entirely out of the question.﻿\n\nThe death of the office cubicle\n\nOnce an Aussie office staple, cubicles were largely phased out by the 2000s.\n\nThey were meant to be an affordable alternative to private offices that still gave employees a sense of space and privacy.\n\nBut over time, some employees and employers came to view \"cubicle farms\" as oppressive and isolating.\n\nOnce an office staple, cubicles came to be seen as oppressive and isolating over time. (Getty)\n\nMany adopted ﻿open-plan layouts instead.\n\nPopularised by architect Frank Lloyd Wright﻿, egalitarian open-plan offices would ﻿encourage workers to communicate, collaborate, solve problems and generate ideas.\n\nOr so the theory went.﻿\n\n﻿\"Unfortunately, it hasn't actually worked out that way,\" MBA director and Associate Professor of Organisational Behaviour at Bond University, Dr Libby Sander told 9news.com.au.\n\n\"If we look at a big body of research over the last 15 years, what it shows conclusively is that just putting people together in one room doesn't make them do all those things.\n\n\"In fact, it can often do the opposite.\"\n\nThe open-plan problem\n\nTo work in an open-plan office is to be distracted.﻿\n\nAussie workers report the constant noise makes it significantly harder to get work done, with some saying they can be ﻿distracted 80 times in a single morning.\n\nIt doesn't even need to be a direct distraction, like being asked a question or roped into a conversation, either.\n\nAussie workers report that open-plan offices are rife with distractions, much like the Dunder Mifflin office in The Office TV series. (NBC)\n\n﻿A study Sander ran found that ﻿workers exposed to standard open-plan office noise, even over a short period of time, experienced a 34 per cent spike in physiological stress and a 25 per cent increase in negative mood.\n\n\"When you couple that with the interruptions and distractions of people actually coming up and talking to you, or having a meeting next to your desk ... it's very, very difficult for people to do focused and concentrated work,\" Sander said.\n\n\"They become more withdrawn, even hostile in some cases ... because they get very, very frustrated that they just can't concentrate.\"\n\nResearch also shows it can take up to 20 minutes to get back on task after being distracted – and that's bad for business.\n\nIt's part of why so many Aussies have latched onto WFH arrangements and refuse to let go, even years post-pandemic.﻿\n\nThe highest paid jobs that let you work from home View Gallery\n\nThe rise of ﻿hotdesking and \"activity-based working\" hasn't helped either.\n\nWhile it can work for some industries and roles, even Sander agreed \"a lot of people are very unhappy with\" having to share desks with colleagues that don't always clean up after themselves – if they can find a desk at all.﻿\n\n﻿Resurrecting the cubicle - or something like it\n\nWith many businesses still trying to coax﻿ workers back into the office, now seems like the perfect time to address the layout issues that make staff reluctant to return.\n\n\"Companies are starting to realise the impact that noise, distraction and interruption actually has on their employee, which is their biggest expense,\" Sander said.\n\n\"And that the savings you make in real estate by not giving everyone their own space, or cramming everyone into an open plan space, doesn't actually pay off in the long term.\"\n\nAccording to Sander, \"cramming everyone into an open plan space, doesn't actually pay off in the long term\". (Getty Images/iStockphoto)\n\nBut the solution isn't as simple as resurrecting cubicles in every office.\n\nInstead, Sander recommended businesses design office layouts specific to ﻿the work employees need to get done.\n\nThat could mean cubicles, private offices, or a well-designed open-plan ﻿layout with private spaces available.\n\nSome companies have already invested in small, free-standing office \"booths\" where staff can work without distraction.﻿\n\nIt may also mean allowing long-term WFH arrangements; whatever works best for staff just trying to get the job done.﻿\n\n\"There isn't a one-size-fits-all answer,\" Sander said.\n\n\"Because ultimately, you need to have a variety of options for people who have a variety of needs﻿.\"\n\nSmall, free-standing office 'booths' can allow staff to work without distraction. (Getty)\n\nAnd with a looming talent shortage, ﻿aging populations and declining birth rates, businesses that don't try to meet staff needs risk falling behind those that do.﻿\n\n\"As we understand more and more the impact of noise and distraction, we are going to see better-designed offices with better acoustics, more dividers, less open-plan space, so people can actually concentrate and get their work done,\" Sander said.\n\n\"If you're not doing that, your competitors are already doing it or going to do it, and you're going to get left behind.\"\n\nHave you got a story? Contact reporter Maddison Leach at mleach@nine.com.au",
        "source": "9News"
    },
    {
        "url": "https://www.abc.net.au/news/2025-09-05/nt-us-military-fuel-tanks-darwin-government-exemption-foi/105736876",
        "title": "NT minister exempts unlawfully built US military fuel tanks from certification",
        "publish_date": "Fri, 05 Sep 2025 01:20:52 +0000",
        "category": "finance",
        "authors": [],
        "text": "The Northern Territory government has exempted 11 massive US military fuel tanks built unlawfully on Darwin Harbour from needing occupancy certification.\n\nThe announcement was made the same day the government was due to respond to ABC questions regarding an almost year-long secret plan to exempt the tanks.\n\nThe questions were sparked by an email chain between the NT government and Australian Department of Defence — obtained by the ABC — detailing preparations to compile a departmental report for minister Josh Burgoyne to seek an exemption.\n\nObtained through Freedom of Information, the emails mark the latest chapter in a months-long investigative series into the Darwin Harbour fuel facility.\n\nThe Project Caymus fuel tanks will be used by the US military, but are currently sitting empty. (ABC News: Michael Franchi)\n\nDubbed Project Caymus, the $270 million fuel tank farm was announced in 2021, with works at the site beginning in January 2022.\n\nAmerican company Crowley won a tender from the US government to build and manage the tanks, which sit on NT government land.\n\nThe ABC has previously revealed the 11 tanks were constructed unlawfully without a building permit and were not designed to withstand winds of more than 193.5 kilometres per hour.\n\nWater has also been leaking into the base of the tanks, which are yet to hold fuel.\n\nOn Thursday afternoon, the NT's Minister for Lands, Planning and Environment, Josh Burgoyne, released a statement saying he had approved the tanks for operation, after they were signed off by an independent engineer hired by Crowley.\n\n\"I made a declaration under the Building Act that occupancy certification is not required for the fuel facility,\" he said.\n\n\"The current legislation does not allow for a building permit to be issued retrospectively.\"\n\nOccupancy certification is granted by a building certifier and shows that a structure has complied with all regulations.\n\nJosh Burgoyne did not respond to a question from the ABC asking if he ordered the departmental report on the tanks. (ABC News: Peter Garnish)\n\nIn the statement, Mr Burgoyne said Crowley had provided a \"signed compliance statement from an independent structural engineer\".\n\n\"Stating that the facility meets the National Construction Code and relevant Australian standards,\" he said.\n\n\"Crowley Australia has obtained full environmental approval and demonstrated that the bunds surrounding the tanks have the capacity to contain all of the fuel in the tanks.\n\n\"The independent structural engineer has confirmed that the tanks are constructed to withstand winds equivalent to a category four cyclone under the Bureau of Meteorology's cyclone categories.\"\n\nCrowley is the owner-operator of the Project Caymus bulk fuel facility. (ABC News: Michael Franchi)\n\nMr Burgoyne also said the NT Fire and Rescue Service and NT Environment Protection Authority had reviewed reports provided by Crowley.\n\nHis statement was publicly released at 3:30pm on Thursday — right on the deadline the ABC had given the government to respond to detailed questions sent the previous day.\n\n'Prepare a report for the minister'\n\nThe NT government's plan to exempt the tanks goes at least as far back as December 2024, according to the email chain obtained by the ABC.\n\nThe correspondence includes an email sent by the acting deputy chief executive of the Department of Lands, Planning and Environment (DLPE), to the Australian Defence Department in December 2024.\n\nIt states that the DLPE was planning to \"prepare a report for … Minister [Burgoyne] to seek an exemption from building certification\".\n\nUnlawful build of US military fuel tanks not realised for almost two years Photo shows Drone shot of eleven fuel tanks next to harbour The NT government was unaware for almost two years that 11 massive US military fuel tanks were being built unlawfully on Darwin Harbour.\n\nThe email subsequently asks the Defence Department representative to help finalise the report.\n\n\"Given your understanding of the issues, I would be grateful if you could peer review my report to the minister,\" the email reads.\n\n\"In terms of timing, I hope to have the report drafted in early January [2025], assuming that Crowley has addressed all outstanding issues.\"\n\nConstruction of the tanks began in 2022. (ABC News: Michael Franchi)\n\nMr Burgoyne did not respond to questions asking if he ordered the report.\n\nThe name of the acting deputy chief executive of the DLPE is redacted in the email.\n\nThe DLPE did not respond to a question regarding who was in the role at the time or what \"outstanding issues\" Crowley needed to address.\n\nThe FOI release also did not include the Defence Department's reply to the email, although one page of correspondence is entirely redacted.\n\nDefence has been contacted for comment.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-09-05/sam-kerr-finally-returns-after-acl-injury/105738920",
        "title": "Kerr's long-awaited return arrives as coach confirms Chelsea selection",
        "publish_date": "Fri, 05 Sep 2025 00:35:23 +0000",
        "category": "sports",
        "authors": [],
        "text": "Sam Kerr will make her long-awaited return to soccer after a 20-month absence in Chelsea's Women's Super League season-opener — and she will be looking to mark the occasion with a landmark 100th goal for the club.\n\nThe news that the English champions' fans — not to mention all Matildas supporters — wanted to hear came when Chelsea boss Sonia Bompastor revealed Kerr was in the squad to play Manchester City on Saturday morning (AEST) at Stamford Bridge.\n\n\"Sam Kerr is in the squad. She will be involved in the game. We don't know yet if she will start or not, but she's in the squad,\" said the Frenchwoman.\n\n\"She's in a good place. She's been training well. She's physically in a good position, also mentally.\"\n\nIt will be the 31-year-old's first match since she played in the Champions League against Swedish club Häcken just before Christmas in 2023, where, typically, she got on the scoresheet with her 99th goal in Chelsea blue.\n\nBut just a couple of weeks later, she suffered the anterior cruciate ligament injury that has sidelined her ever since, during which time she was also at the centre of a high-profile court case in which she was cleared of racially aggravated harassment of a police officer.\n\nBut now she is ready to at last resume her quest to score goal 100 for Chelsea — although the team has changed out of all recognition since she last played.\n\nIf she does take the pitch on Friday, she will probably have a Matildas teammate alongside her for the first time in the shape of Chelsea's new signing, Ellie Carpenter, from Bompastor's old club, Lyonnes.\n\nThe burning question remains: how has such a long period out following such a debilitating injury affected the game of one of the world's top players?\n\n\"It's nice because she is one of the players everyone wants to see on the pitch,\" said Bompastor, who was not in charge of the club when Kerr got injured.\n\nThe evolution of Sam Kerr We captured data tracing the evolution of Sam Kerr, from a 15-year-old playing in quiet suburban stadiums to the goal scoring machine she has become in England.\n\nBut the boss who led Chelsea to a sixth straight WSL title in May is happy to have her back.\n\n\"That's nice for me, with her leadership and experience,\" she said.\n\nHowever, she is urging Chelsea fans, who have become so used to watching the extraordinary goalscoring feats from their old favourite, to give Kerr time to rediscover her best.\n\n\"To be fair to her, she's been away from the pitch for a long time, so I think we still need to be patient,\" she said.\n\n\"That's normal for her not to be at her best level yet. Hopefully, soon, but that's already a good step for her and for us for her to be in the squad.\n\n\"She played some minutes in pre-season games but we cannot expect Sam, having not played for 15 or 16 months, to be immediately ready and at her best level.\n\n\"We need to be patient, even if you and I want to have Sam back because she's a wonderful player and we love watching her on the pitch.\"\n\nKerr's return also spells great news for the Matildas with the Women's Asian Cup in Australia looming next March.\n\nThe ABC of SPORT Sports content to make you think... or allow you not to. A newsletter delivered each Saturday.\n\nAAP",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-09-05/coronial-inquest-lightning-ridge-health-centre-death/105710988",
        "title": "Inquest hears doctor getting counselling since Indigenous woman's death",
        "publish_date": "Fri, 05 Sep 2025 00:13:50 +0000",
        "category": "lifestyle",
        "authors": [],
        "text": "The family of a First Nations woman who died at a Western New South Wales hospital say they hope an inquest will ensure other remote families are not left to face the same \"pain and anguish\" they have endured.\n\nWARNING: Aboriginal and Torres Strait Islander readers are advised that this article contains the name and images of a person who has died, included with the permission of the family.\n\nEve Liza Brown died on July 2, 2021 at the Lightning Ridge Multi-Purpose Health Centre.\n\nAn inquest at Walgett before Deputy State Coroner Harriet Grahame examined the care the 42-year-old received.\n\nEve Brown was a freelance artist and mother of three. (ABC Western Plains: Zaarkacha Marlan)\n\nMs Brown's parents, Trina and John Brown, along with her sisters Angie Newman and Jessica Brown, attended the four-day hearing.\n\n\"She bought a splash of colour to all our lives,\" Ms Newman said.\n\nThey said Ms Brown, a mother of three, loved growing up and living in Lightning Ridge, and they hoped the inquest would bring change for rural health care.\n\n\"We choose to live in a small, remote community, but that doesn't mean that we shouldn't have access to a high standard of health care and services,\" Ms Newman said.\n\nMs Brown's care at Lightning Ridge\n\nAn autopsy found Ms Brown had a hidden spleen injury, as well as a kidney infection that combined to cause septic shock and internal bleeding.\n\nHealthcare professionals from the Lightning Ridge Multi-Purpose Health Centre, which is one of NSW's most isolated medical facilities, gave conflicting accounts of the critical moments leading to Ms Brown's death.\n\nThe inquest was told that Ms Brown arrived at the centre's emergency department about 9:30am on July 1, reporting three days of vomiting, constipation and intense abdominal pain.\n\nShe was admitted to the acute care ward later that afternoon, where visiting doctor Irfan Hakeem treated her for an upper urinary tract infection.\n\nMedical care at Lightning Ridge is under the spotlight. (ABC Western Plains: Zaarkacha Marlan)\n\nDr Hakeem told the inquest that after a physical exam of Ms Brown, he did not suspect sepsis.\n\n\"Oxygen saturation was normal, the respiratory rate was normal,\" he said\n\n\"That told me it was infection and not sepsis.\"\n\nMs Brown's condition deteriorated overnight, and early the next morning she collapsed while trying to walk to the toilet.\n\nDr Hakeem, who was on-call at the time, said he was not told of Ms Brown's severe \"left-sided abdominal pain\".\n\n\"Yes, I should have seen her,\" he said.\n\n\" [Ms Brown's death] has been living with me since then. I am getting counselling. \"\n\nRegistered nurse Jamie Brizuela, who was caring for Ms Brown and in charge of the facility overnight, told the inquest he chose not to request Dr Hakeem's attendance, explaining he was not an \"assertive nurse\".\n\n\"I should have [requested him], but because there's some instances I've experienced of doctors who would get upset,\" he said.\n\nLater that morning, a request was made for the Royal Flying Doctor Service retrieval team to transfer Ms Brown to Dubbo Hospital.\n\nHowever, Ms Brown went into cardiac arrest about midday and was pronounced dead at 1:30pm on July 2, 2021.\n\nStaffing pressures\n\nRegistered nurse Emma Reavell was at the start of a 14-hour double shift due to a \"roster deficit\" when Ms Brown presented to the hospital.\n\nThe hearing heard all four acute beds and four emergency beds were occupied at the medical centre that night.\n\n\"It's a huge workload for one nurse,\" Ms Reavell told the inquest.\n\nThe inquest in Walgett has examined the care Eve Brown received. (ABC Western Plains: Zaarkacha Marlan)\n\nThe inquest heard protocol required Ms Brown's vital signs to be taken hourly while she was in the emergency department, and every four hours once admitted.\n\nBut her initial observations at 9:35am were not repeated until almost 12 hours later at 11:35pm.\n\n\"I don't recall what was going on, you get very busy in a small rural, remote facility, and you get distracted very easily and some things don't get done, I'm sorry to say,\" Ms Reavell said.\n\nNurse manager Kerry Irvin, who was also the acting health service manager that day, became visibly emotional when recalling Ms Brown's death.\n\nShe told the hearing she was \"horrified\" that vital signs were not recorded more regularly, but said nurses in small hospitals were often forced to juggle competing demands.\n\n\"Policy says hourly, but unfortunately, the reality is we only have so many staff to see so many patients, and so it becomes a juggling act,\" Ms Irvin said.\n\nFacility lacks tools for critical care\n\nThe inquest heard Lightning Ridge Multi-Purpose Health Centre did not have a CT scanner or surgical support, meaning complex patients were often transferred to Dubbo Hospital, 349 kilometres away.\n\nLightning Ridge patients are often flown long distances for treatment. (ABC News: Andrew O'Connor)\n\nEmergency physicians Matthew Bragg, Luke Lawton and Jeremy Hsu told the inquest early planning for transfers was critical for small rural hospitals, because delays could arise due to distance, weather, flight logistics and staff shortages.\n\nAll three experts agreed a consultation with the retrieval service should have occurred by 5pm the day Ms Brown presented to the hospital.\n\nMs Grahame will hand down her findings at a later date.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-09-05/nsw-nurses-and-midwives-accept-3-per-cent-pay-bump/105738546",
        "title": "NSW nurses and midwives accept 3pc interim pay increase offer",
        "publish_date": "Fri, 05 Sep 2025 00:13:30 +0000",
        "category": "finance",
        "authors": [],
        "text": "NSW nurses and midwives have voted to accept a 3 per cent interim wage increase offer with improvements to working conditions, but they say it is \"not the end\" of their dispute with the state government.\n\nThe interim offer will be back paid to July 1, plus 0.5 per cent in superannuation following years-long industrial action.\n\nPublic sector nurses and midwives will also see night shift penalty rates lifted from 15 per cent to 20 per cent, as well as a guarantee of two consecutive days off and no changes made to rosters without consultation.\n\nWorkers will also be free from night shifts if they have annual leave booked, unless requested.\n\nHealth Minister Ryan Park said around 56,000 healthcare workers across the state would benefit.\n\n\"We've been working with them [NSW Nurses and Midwives' Association] for a long time … I'm not going to pretend it's been easy, it hasn't it's been a challenging twoand a half years.\n\n\"But I've said from the very beginning I was determined to reach a point where we were able to put money into the pockets of nurses and midwives whilst at the same time respect the independent umpire looking at the rest of their case,\" he said on Friday morning.\n\nThe union will now put a special case forth for a 35 per cent pay rise at the Industrial Relations Commission in a six-week hearing starting from September 30.\n\nThe union will now put a special case forth for a 35 per cent pay rise at the Industrial Relations Commission later this month. (ABC News: Timothy Ailwood)\n\n'Not the end' of fight for better pay\n\nNSW Nurses and Midwives' Association General Secretary, Shaye Candish, said the agreement would put money in members' pockets now, but there was still a long way to go.\n\n\"Nurses and midwives are struggling to pay their bills in this cost-of-living crisis so any financial relief is welcomed. Improvements to rosters will also provide staff with greater work-life balance,\" Ms Candish said.\n\n\" However, this is not the end of our pay and conditions fight. Our case for a 35 per cent pay increase over three years will begin in the NSW Industrial Relations Commission later this month. \"\n\nMs Candish said the association would present evidence to the commission around \"the gendered undervaluation of nurses and midwives' work\".\n\nIn the first two years of the Minns government, nurses were given an 8 per cent pay bump — inclusive of 1 per cent super.\n\nPremier Chris Minns said workers had suffered 12 years of wage suppression in a neglected health system.\n\n\"This interim deal on pay, night shift penalties and improvements to conditions is an important step towards the long-term repair of healthcare across NSW,\" he said.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-09-05/germany-in-trouble-after-first-ever-away-world-cup-qualifier-los/105738644",
        "title": "Germany in trouble after first-ever away World Cup qualifier loss",
        "publish_date": "Fri, 05 Sep 2025 00:02:55 +0000",
        "category": "sports",
        "authors": [],
        "text": "Four-time world champions Germany have suffered their first away loss in a World Cup qualifier, with a shock 2-0 defeat by hosts Slovakia in their opening qualifier for the 2026 tournament.\n\nThe Germans, who have set a goal of winning the 2026 World Cup, had never before lost a World Cup qualifier on the road but have now lost their last three consecutive matches, following defeats by Portugal and France in the Nations League in June.\n\n\"We did not show any emotionality in our game today. In terms of emotions the opponents were miles ahead of us,\" said Germany coach Julian Nagelsmann.\n\n\"We want to go to the World Cup but today we were miles away from that.\n\n\"I want to see that emotionality. We picked the best players in Germany but maybe we have to put less importance on quality and more on players who will give it all out there.\"\n\nThe Germans have not made an impact in major international tournaments since last winning the World Cup in 2014.\n\nNagelsmann's team were on the back foot with the Slovaks missing a golden chance in the opening seconds with Ľubomír Šatka.\n\nGermany goalkeeper Oliver Baumann then denied Leo Sauer in their one-on-one with a superb save in the 21st minute in early warnings that the visitors did not heed.\n\nSlovakia's offensive play paid off in the 42nd when Germany's Florian Wirtz lost possession and the hosts launched a quick break with Dávid Hancko completing it with a fine finish.\n\nGermany, toothless in the first half, looked more aggressive after the break and Leon Goretzka came close.\n\nHowever, Slovakia struck against the run of play, with David Strelec sending defender Antonio Rüdiger the wrong way before curling a shot past Baumann in the 55th minute.\n\nJulian Nagelsmann was left to ponder making personnel changes after his team's shock loss to Slovakia. (Getty Images: Sebastian Frej)\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\n\"The first 5 minutes of the second half were a bit brighter but the rest was pretty grim,\" Nagelsmann said.\n\n\"I trust my team but they have to understand that simply being a better player than the opponent is not enough if you don't show willingness and desire.\n\n\"You won't get results with the handbrake on.\"\n\nThe Germans, who were eliminated in the first round of the previous two World Cups, were unable to mount a serious comeback, lacking any ideas and punch up front.\n\nSlovakia travel to Luxembourg for their next Group A match on Monday morning, Australian time, while Germany hosts Northern Ireland.\n\nReuters",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-09-05/spring-snow-in-tasmania-bom-weather-forecast/105738476",
        "title": "Spring snow puts on a show in Tasmania",
        "publish_date": "Thu, 04 Sep 2025 23:44:23 +0000",
        "category": "finance",
        "authors": [],
        "text": "The first week of spring has had a white backdrop, with snow settling as low as 300 metres above sea level in some parts of Tasmania overnight.\n\n\"The snow level was lowest overnight [Thursday],\" Matthew Thomas from the Bureau of Meterology told ABC Radio Hobart.\n\n\"It snowed at my place at 360 metres, I've heard of snow falls at Leslie Vale and I've seen some pictures of some snow falling but not settling at Bagdad at about 150 metres.\"\n\nHartz Road in the Huon Valley on Friday morning. (Supplied: Darren Wright Photos)\n\nVinces Saddle on the Huon Highway south of Hobart was blanketed in snow. (ABC News: Daniel Miller)\n\nMr Thomas said the lowest snow he was aware of settled at 300 metres.\n\nVinces Saddle, on the Huon Highway, was blanketed in snow on Friday morning, with cars stopping by the roadside and people getting out to take photos.\n\nFor people in Hobart, Kunanyi/Mount Wellington was a snowy sight for a second day after fresh snowfalls overnight.\n\nKunanyi/Mount Wellington was covered in snow for the second morning in a row. (ABC News: Loretta Lohberger)\n\nFrom the top, looking down. (Supplied: Adrian Bol)\n\nHobart City Council's Kunanyi/Mount Wellington crew members were doing a regular Pinnacle Road safety check when they discovered a \"huge rock\" had fallen.\n\nThe council said work was underway to remove the rock, but the icy conditions were \"proving challenging\".\n\nAnyone eager to visit the mountain is urged to check the status of Pinnacle Road.\n\nThe rock fell on Pinnacle Road, just above the chalet. (Facebook: City of Hobart)\n\nHobartians woke to a snow-covered mountain on Friday morning. (ABC News: Loretta Lohberger)\n\nCollinsvale Primary School, in the hills above Glenorchy, advised on social media its school bus run and learn to swim program were cancelled for the day.\n\nThe school remained open, but advised parents to drive children to school only \"if it is safe to do so\".\n\nSnow at Sandfly on Friday morning. (Supplied: Cassie Leah)\n\nHobart can expect a maximum temperature of 13 degrees Celsius on Friday, which Mr Thomas said was \"several degrees below average\".\n\nIt is also expected to reach 13C in Burnie, and 14C in Devonport and Launceston.\n\nThe view of Collins Bonnet from Mountain River in southern Tasmania. (Supplied: Kathleen Brient )\n\nSome warmer weather is on the way, however.\n\nAfter a cold start to Saturday morning, with frosts expected in some areas, Mr Thomas said winds would shift northerly during the day.\n\nOn Sunday for Father's Day, maximum temperatures are expected to be 16C in Burnie and Devonport, 19C in Launceston and 20C in Hobart.\n\nSpring has started with snowfalls in Tasmania. (ABC News: Owain Stia-James)",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-09-05/ballina-tip-audit-clothing-waste-fast-fashion/105724116",
        "title": "Masses of near-perfect clothing thrown in rubbish bin, tip hunt finds",
        "publish_date": "Thu, 04 Sep 2025 23:30:41 +0000",
        "category": "finance",
        "authors": [],
        "text": "A survey of thousands of clothing items at a council landfill has revealed a snapshot of Australia's mounting fast fashion problem.\n\nThe Ballina Shire Council on the New South Wales North Coast found more than 80 per cent of 2,000 clothing items arriving at its waste facility during four weeks from June to July were in perfect or near-perfect condition.\n\nEducation officer Justine Rowe sorted through the clothes as part of an audit and said she found some beautiful pieces, including vintage and handmade items and children's clothing with tags on it.\n\nJustine Rowe says people throw out some incredible clothing items. (ABC North Coast: David Kirkpatrick)\n\n\"Over 80 per cent of items were in perfect, or near-perfect condition, and probably were being sent to landfill just because people weren't aware or didn't have another option to choose for those items,\" she said.\n\nCommunity support worker Josh Gooley has worked at Ballina tip's Salvage Shed for the past 18 months and said he had also noticed more clothing piling up.\n\nJosh Gooley says he is on the frontline of fast fashion waste. (ABC North Coast: David Kirkpatrick)\n\n\"Each week we'll get four 200-litre bins full of clothes that have been dumped,\" he said.\n\nClothing filling Australian landfills\n\nAustralians are one of the biggest consumers of clothing in the world, buying an average of 55 new clothing items each year.\n\nThe Australian Fashion Council has estimated the industry was worth $27.2 billion to the Australian economy across retail and manufacturing.\n\nOp shops around the country are often overwhelmed by the sheer volume of clothes being donated, and more than 220,000 tonnes of clothing ends up in landfill annually — the equivalent weight of four Sydney Harbour bridges.\n\nThe Salvage Shed at Ballina tip tries to rehome good-condition clothing. (ABC North Coast: David Kirkpatrick)\n\nThe Ballina council is taking a back-to-basics approach to addressing the issue, holding free workshops to help residents learn skills in caring for and mending clothes.\n\n\"It seems really simple, but it is not something we are taught very often these days,\" Ms Rowe said.\n\n\"We'd love to see … a greater understanding of how to actually wash and care for clothes.\"\n\n\"We'd also like people to rethink how they access clothes and why.\n\n\" Are we just shopping because we are in that mindset? \"\n\nThe project is funded through the waste levy.\n\nThe levy is paid by waste facilities for each tonne of landfill waste.\n\nIt aims to decrease the number of items going to landfill and promote resource recovery and recycling.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-09-05/hollow-knight-silksong-explainer-team-cherry/105727946",
        "title": "Australian-made Hollow Knight: Silksong crashes global stores on launch",
        "publish_date": "Thu, 04 Sep 2025 23:19:53 +0000",
        "category": "finance",
        "authors": [],
        "text": "It's a world of anthropomorphic bugs, tucked away in a hidden ruined kingdom — and it's one of the most highly anticipated video games of all time.\n\nThe small game development studio based in Adelaide behind Hollow Knight have been almost entirely silent for seven years.\n\nNow they're back with its sequel — Hollow Knight: Silksong.\n\nThe original game sold more than 15 million copies, developed by Ari Gibson, William Pellen and Jack Vine of South Australia's Team Cherry with composer Christopher Larkin.\n\nWhen news broke of an impending sequel, excitement quickly grew to a fever pitch, increased by wild speculation at each tiny update.\n\nWhen it launched overnight, demand was so great that players crashed online PlayStation, Xbox, Nintendo and PC stores.\n\nBut there was no big secret behind their tight-lipped timeline, just the desire to do exactly what they wanted.\n\nSo why did it take so long?\n\nSpeaking to Bloomberg, developer Ari Gibson said that the development process was so enjoyable that the team just took the time to make the game they wanted to make, and dismissed concerns the game was halted in production.\n\n\"It was always progressing. It's just the case that we're a small team, and games take a lot of time. There wasn't any big controversial moment behind it,\" Gibson said.\n\nThe team at Team Cherry created a spritesheet, a large image which contains all the frames of animation for each pose and move that player character Hornet can take. (Supplied: Team Cherry)\n\nGibson said that due to the way the team developed the game, every idea that was conceived was added quickly to the game, and that he needed to stop sketching, otherwise the game would 'take 15 years to finish'.\n\nSize of the game grew significantly during development\n\nHow indie developers saved Australia's video game industry Photo shows A screenshot of an advertisement for a video game showing a cartoon lamb surrounded by other animals, in a red and black motif. Australia's video game industry has gone from being almost non-existent after the global financial crisis to pioneering in the space of 15 years.\n\nSilksong was originally intended to be an expansion for the first Hollow Knight game which was crowdfunded in 2014.\n\nThis new game features a new playable character called Hornet, a boss and secondary protagonist in first game, exploring her own story.\n\nGibson said in a recent interview that the scale of this new story meant it needed to be its own title.\n\n\"For a time, we imagined you would be able to dynamically switch to Hornet in Hollow Knight, she would have her own adventure and her abilities would allow her to access new areas,\" he told ACMI curator Jini Maxwell as part of the Game Worlds exhibition.\n\nGibson said that the scale of the game quickly grew and it made sense for the project to become its own sequel.\n\n\" We have a habit of expanding the content to be quite large, that led pretty quickly to the conclusion that Hornet would need to be in a new world, in a land that fit her scale and then also match her identity. \"\n\nWilliam Pellen said that the game in the team's mind was already a success, with their biggest hope being a smooth launch.\n\n\"The 'goal' is already kind of done. I think, we had an idea for a game that we wanted to make, a version of the game that satisfies the theme, the best version we can make,\" Pellen said.\n\n\"It's a hard one, honestly. I think just releasing it with no major bugs.\"\n\nOther studios delay their games to make room for Silksong\n\nOn the PC gaming platform Steam, the largest online store for video games, Silksong currently sits at number one on the wishlist chart with around 418,000 players following the title, 26,000 of those followers were added in just the last week.\n\nWhile the game appears to be two dimensional, it's actually a 3D game built in layers, similar to a theatre stage. (Supplied: Team Cherry)\n\nSo great is the anticipated impact of the launch of the game, a number of other video games have been delayed until later in the year or even early next year.\n\nSingaporean publisher Ysbryd Games said in a statement their title Demonschool originally slated for launch yesterday would be delayed because September would be 'Silksong's moment' and to allow their title 'to be seen and talked about meaningfully'.\n\nBaby Steps which was made by a team including Australian developer Bennett Foddy was another title pushed back, moving from September 8 two weeks later to September 23.\n\nA game that people keep discovering\n\nPellen said that the team was surprised with its enduring appeal, but that it spoke to their distinctive style that didn't age.\n\n\"The fact that people keep discovering Hollow Knight, the original, and this was our hope with it, suggests that it hasn't fallen out of date,\" Pellen said.\n\n\"The satisfying thing with Hollow Knight was that we were making something that was to our tastes, and that meant that we were making things that were slightly different it was inspired by older games, so its qualities were slightly different from the more modern games of the time.\n\n\"In a way that it's sort of outside of time, hopefully Silksong can achieve that too.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-09-05/australia-names-squad-for-icc-women-s-cricket-world-cup/105698780",
        "title": "Australia names squad for ICC Women's Cricket World Cup",
        "publish_date": "Thu, 04 Sep 2025 23:00:55 +0000",
        "category": "sports",
        "authors": [],
        "text": "Australia has named a 15-strong squad for the upcoming ICC Women's Cricket World Cup in India and Sri Lanka.\n\nAustralia has won the tournament seven times and is the defending champion.\n\nWomen's ODI cricket ICC rankings 1: Australia — rating 167\n\n2: England — rating 126\n\n3: India — rating 124\n\n4: New Zealand — rating 96\n\n5: South Africa — rating 90\n\n6: Sri Lanka — rating 82\n\nTime has moved on since the last edition of the World Cup, with the retirements of Meg Lanning and Rachael Haynes, and the absence of players like Jess Jonassen and Amanda-Jade Wellington.\n\nBut 10 members of the squad from New Zealand in 2022 have been chosen to represent Australia again.\n\nPhoebe Litchfield, Georgia Voll, Sophie Molineux, Georgia Wareham and Kim Garth have been included in their first 50-over World Cup squad.\n\nThe Australian team will prepare for the tournament, heading to the subcontinent to play three ODIs against hosts India from 14-20 September in New Chandigarh and New Delhi.\n\nMolineux — who has been recovering from a knee injury — will miss the series against India but is expected to be fit and ready to take part in the World Cup.\n\nAustralia goes into the ICC Women's Cricket World Cup as defending champions, although players like Meg Lanning and Rachael Haynes will be missing this time around. (Getty Images: ICC/Kai Schwoerer)\n\nThe last tournament was delayed by a year because of COVID-19, meaning there has only been three years between editions this time round.\n\nAustralia's opening game of the World Cup will be against New Zealand on October 1 in Indore.\n\nThe team will then face Sri Lanka (October 4), Pakistan (October 8), India (October 12), Bangladesh (October 16), England (October 22) and Bangladesh (October 25).\n\nThe top four from the round robin will qualify for the semifinals.\n\nThe ICC Cricket World Cup will run from September 30 to November 2.\n\nSquad:\n\nAlyssa Healy (NSW, captain), Darcie Brown (SA), Ashleigh Gardner (NSW), Kim Garth (VIC), Grace Harris (QLD), Alana King (WA), Phoebe Litchfield (NSW), Tahlia McGrath (SA, vice-captain), Sophie Molineux (VIC), Beth Mooney (WA), Ellyse Perry (NSW), Megan Schutt (SA), Annabel Sutherland (VIC), Georgia Voll (QLD), Georgia Wareham (VIC).",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-09-05/containers-for-change-gulf-recycling-scheme-mornington-island/105728694",
        "title": "With no bin in sight, these outback regions are recycling for a profit",
        "publish_date": "Thu, 04 Sep 2025 22:23:41 +0000",
        "category": "finance",
        "authors": [],
        "text": "Wheeling a recycling bin to the curb can be a mundane weekly chore for many Australians, but for residents in remote regions across outback Queensland, those mainstream recycling services do not exist.\n\nTo combat the growing need and demand for recycling in the state's North West, a not-for-profit organisation hit the Gulf of Carpentaria's red dirt streets to do it themselves.\n\nGulf Containers for Change (C4C) is a container-refund scheme, collecting cans and bottles from residents and businesses for recycling for a return of 10 cents per item, which is reinvested into the community.\n\nMillions of containers have been collected by the Gulf Containers For Change depot. (Supplied: Robbie Katter)\n\nThe scheme diverted 4 million bottles and cans from landfill in 2024.\n\nAnd now, Gulf C4C is expanding its 270,000-square-kilometre patch to service Mornington Island, one of the most isolated regions in the country.\n\nLauren Christian, an executive general manager of COEX, the company facilitating Gulf C4C, said the expansion was environmentally and culturally significant.\n\nPartnering with Indigenous rangers on the island, containers will be collected and taken to the local barge.\n\nThey will then be shipped to the nearest mainland town, Karumba, for recycling.\n\nMornington Island will now have a Containers for Change service. (Supplied: Mornington Island Life)\n\nMs Christian said expanding the scheme to the island of 1,200 people had the potential to save thousands of containers from litter and landfill, and the 10-cent-per-item refund would be invested back into the community.\n\n\"The rangers have been really passionate about keeping plastic bottles and cans out of the environment,\" she said.\n\n\"We have a number of really engaged community advocates who understand the benefits of recycling and the benefit from an economic, a social and an environmental perspective.\"\n\nCleaning up country\n\nGulf C4C director Annie Cork is based in Normanton, a small town 500 kilometres north-east of Mount Isa, and loads up her truck every day, ready to collect thousands of containers.\n\nAnnie Cork and her husband Joseph run Gulf Containers for Change. (Supplied: Annie Cork)\n\n\"Unlike probably most of the other depots, we go out and do household collections,\" she said.\n\n\"We've got two trucks and two trailers … there's a huge amount of kilometres — as you could imagine — that we'd cover.\"\n\nMs Cork said the scheme ticked all the boxes for the Gulf.\n\n\"You're not only cleaning up country, but people are getting paid,\" she said.\n\n\"It's cleaned up towns immensely. It's generating quite a bit of revenue back into the economy.\n\nThe collection has proven popular with residents. (Supplied: Robbie Katter)\n\n\"We do a massive amount of cattle stations as well, the ones that are not a million miles off the road, and they're really appreciative of it.\"\n\nGarbage in the sticks\n\nAt Stirling Station, 100 kilometres north-east of Normanton, the only waste-management system was a personal landfill built on the property.\n\nBut Gulf C4C has changed that.\n\nWorkers at Stirling Station collect bottles and cans to fund their end of year event. (Supplied: Cheryl Ryan)\n\n\"[Containers] would just go into the dump, because we'd have nowhere else to take them,\" station manager Cheryl Ryan said.\n\n\"We just can't go and do what they do [in the city] when someone collects it. It's all up to us to look after it.\n\n\"Our workers put all our tins and plastics in a bin and our bottles in a separate one, and then we collect them in the bigger bins, and then we take them when someone's going into town.\"\n\nBut for the workers on the station, it is about more than just recycling.\n\nContainers for Change is the only available recycling scheme in many rural towns. (ABC Western Queensland: Grace Nakamura)\n\n\"We have all our young workers and we have a social club, and we thought it was a good way to get a little bit of money to take them out fishing on a boat at the end of the year,\" Ms Ryan said.\n\n\"It's a benefit. You're helping the environment by recycling … and it's just that bit of money in your pocket as well.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-09-05/tottenham-hotspur-chairman-daniel-levy-steps-down/105738422",
        "title": "Spurs chairman steps down months after sacking Postecoglou as manager",
        "publish_date": "Thu, 04 Sep 2025 22:08:22 +0000",
        "category": "sports",
        "authors": [],
        "text": "Daniel Levy has stepped down as Tottenham chairman, ending the nearly 25-year tenure of a divisive figure known for keeping the Premier League team profitable but being unable to turn it into a trophy-winning force.\n\nThe 63-year-old Levy, who was the longest-serving chairman in the Premier League, said he was leaving Tottenham as a \"global heavyweight competing at the highest level\".\n\n\"It hasn't always been an easy journey,\" Levy said.\n\n\"But significant progress has been made. I will continue to support this club passionately.\"\n\nLevy's departure comes several months after Tottenham ended a 17-year trophy drought by beating Manchester United 1-0 to win the Europa League final under the guidance of Australian manager Ange Postecoglou.\n\nIt was the first major title for Spurs since they won the English League Cup in 2008, and first European triumph since they won the UEFA Cup — the equivalent of the Europa League now — for the second time in 1984.\n\nWeeks later, Levy and other Spurs powerbrokers decided to sack Postecoglou.\n\nKnown as a fierce and uncompromising negotiator in the transfer market, Levy was also accused by many Tottenham fans of chasing profits over silverware in failing to fully back some of the most high-profile managers in soccer that he employed in recent years, such as Jose Mourinho and Antonio Conte.\n\nAnge's Spurs sacking the sad reality for awful league campaign Photo shows Tottenham Hotspur head coach Ange Postecoglou looks on during the post-season friendly match Ange Postecoglou flew into the Spurs job on a wing and a prayer, and surpassed expectations immediately. But long-standing structural issues and Postecoglou's own pigheadedness ensured a reversion to Tottenham's 'Spursy' norm.\n\nThere were protests against his tenure last season, when Tottenham finished 17th in the Premier League — one place above the bottom three — despite the club being among the so-called \"Big Six\" in English soccer and owning one of the best stadiums in world soccer.\n\nLevy oversaw the move from White Hart Lane to the Tottenham Hotspur Stadium, its home since 2019 and now a venue for concerts and other sporting events, including boxing and NFL.\n\nTottenham said there would be \"no changes to the ownership or shareholder structure of the club\" in light of the departure of Levy, who reportedly owns around 30 per cent of the share capital of ENIC, the club's majority owner.\n\nPeter Charrington has become non-executive chairman. He thanked Levy and his family for \"their commitment and loyalty to the club over so many years.\"\n\nThe ABC of SPORT Sports content to make you think... or allow you not to. A newsletter delivered each Saturday.\n\nAP",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-09-05/asx-markets-business-live-news-september-5-2025/105738358",
        "title": "Live: ASX gains as global interest rate fears subside",
        "publish_date": "Thu, 04 Sep 2025 21:39:06 +0000",
        "category": "finance",
        "authors": [
            "Michael Janda",
            "Yiying Li",
            "Daniel Ziffer"
        ],
        "text": "Before we move ahead, let's look back at movement in the US market overnight.\n\nHere's Kyle Rodda from capital.com with his take:\n\n\"Wall Street pushed to record highs as the markets leaned completely into a September rate cut from the US Federal Reserve in a couple of weeks' time.\n\n\"Further underwhelming jobs data added to the case for a cut -- and several more to come following that. US jobless claims were higher than forecast, while ADP Payrolls data undershot expectations. While the mainstream view on the latter has been that it has no predictive value when it comes to the official employment figures, that notion is being reconsidered.\n\n\"Although it's true that the ADP figure rarely shows any meaningful relationship to the official report the week of their release, it's been demonstrated that it's quite a reliable indicator of labour market activity following revisions to the NFPs.\n\n\"When piling on top of that a market that's more wary of the Bureau of Labor Statistics' credibility because of President Trump's attacks on the institution, as well as the proven shortcomings in its analytical process, the ADP is taking on greater import.\n\n\"The Non-Farm Payrolls data tonight is something of a sink or swim moment for the markets. The critical question is whether the slowdown in employment is continuing and gathering pace, and whether the Fed is in the right position to lower rates and buffer the economy, or if it's behind the curve. Should the data point to an economy accelerating off a cliff, that could spark risk aversion and volatility in the markets. Consensus forecasts point to a relatively modest 75,000 job increase in the US economy last month, with the unemployment rate tipped to rise to 4.3%. The devil will be in the details, too. A recent fall in the participation rate, a lot to do with US President Trump's immigration policies, has masked underlying weakness in labour demand.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-09-05/aussie-basketballer-rocco-zikarsky-minnesota-timberwolves/105731074",
        "title": "Australian teenager standing 7-foot-4 gears up for NBA preseason",
        "publish_date": "Thu, 04 Sep 2025 21:08:48 +0000",
        "category": "sports",
        "authors": [],
        "text": "Australian basketball sensation Rocco Zikarsky is set to achieve his childhood dream of playing in the NBA.\n\nIn June, the 19-year-old Queenslander was selected by the Minnesota Timberwolves as the 45th pick of the 2025 draft.\n\nAt 7 foot 4 inches (223cm) in height the Brisbane Bullets prospect will be the third-tallest player in the league.\n\n\"I still don't think it's really hit me and I don't think it will hit me until I get on that court for the first time,\" Zikarsky said.\n\nHe debuted his Minnesota threads in July while participating in the NBA Summer League — an off-season tournament designed to give young prospects a chance to showcase their talent.\n\nZikarsky returned home to the Sunshine Coast this week to enjoy some downtime following a stressful months-long draft process.\n\nZikarsky was drafted by the Minnesota Timberwolves with the 45th pick. (Supplied: Minnesota TImberwolves)\n\nThat included the NBA draft combine, where rookies assemble to participate in physical assessments and drills in front of team scouts.\n\n\"You start off at the combine, you get all your measurements done, you do all your shooting tests and then teams want to see you in their gym,\" Zikarsky said.\n\n\"They're flying you across the country, landing at 2am … and you've got to work out at 8am and then you're off to the next city that afternoon.\n\n\" It's a wild process and then the draft comes around and you have no idea where you're going to end up. \"\n\nRocco and his mum Kylie spent the week winding down on the Sunshine Coast following a stressful draft process. (ABC Sunshine Coast:Jake Kearnan)\n\nSport in the blood\n\nZikarsky is the son of former German Olympic-medallist swimmer Björn Zikarsky and champion Australian ironwoman Kylie Zikarsky.\n\nHis mother was by his side throughout the draft process and said there were many sleepless nights.\n\n\"It was not cool — I'm so glad I don't have to go through it again,\" she said.\n\n\"It's an emotional roller-coaster — it's full of highs, it's full of lows and watching him go through that was really hard, as a parent.\n\n\" You feel everything they feel but you've got to show up and be strong for them — but on the inside, you're just thinking, 'God, this is terrifying.' \"\n\nZikarsky spent two seasons with the Brisbane Bullets before electing for the NBA draft. (Getty Images: Chris Hyde)\n\nZikarsky was touted as a first-round, top-30 prospect and had gained significant interest from more than 10 NBA teams.\n\nThe draft is an unpredictable process, which sees teams change preferences as each domino falls.\n\nIt was an anxious wait for Zikarsky who was eventually drafted by the Chicago Bulls and then immediately traded to Minnesota.\n\nZikarsky has landed on the same team as fellow Aussie Joe Ingles. (Getty Images: David Sherman/NBAE)\n\n\"It was a little crazy, I remember my dad on the other side of the table, he said, 'Oh, Chicago,' and then I had my agent calling me, saying I'm going to Minnesota,\" he said.\n\n\"I'm fortunate enough that I still ended up with an Aussie on my team in Joe Ingles.\n\n\" I was working out in Minnesota, so it's a best-case scenario for sure. \"\n\nZikarsky may find himself facing up against with the NBA's all-time scoring champion and four-time title-winner LeBron James. (AP: Mike Ehrman)\n\nFacing his idols\n\nZikarsky has signed a two-year, two-way contract, which will see him split his time on the court between the Timberwolves and their G-League affiliate side, the Iowa Wolves, which will give the youngster a chance to grow and develop his game.\n\nThe 7'4\" rookie is set to be the third tallest player in the NBA. (ABC Sunshine Coast: Jake Kearnan)\n\nHe will share the hardwood with NBA All-Stars Anthony Edwards, Julius Randle and Rudy Gobert, and face off against his childhood idol, LeBron James.\n\n\"We've been talking about it so he doesn't have that fan-girl response when he hits the court,\" Ms Zikarsky laughed.\n\n\" He's had lots of opportunities to be around his teammates now, but I think it's still going to be like, 'Wow' — but I think he'll manage it all right. \"\n\nRocco Zikarsky towering over his teammates at an under-12s tournament. (Supplied: Kylie Zikarsky)\n\nZikarsky will return to the US next week to prepare for the NBA season.\n\n\"I think the thing that excites me most is the fan-base — I went to a couple of games before the draft and before I knew I was going to be a Timberwolf,\" he said.\n\n\"I'll probably spend the majority of my time in Iowa playing with the Wolves and hopefully I'll get a couple of call-ups this year and get my chance to see an NBA floor.\n\n\"I'll do my time and then hopefully get onto the main roster in the next couple of years.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.smh.com.au/business/the-economy/australia-is-having-the-last-laugh-on-trump-s-trade-beef-20250807-p5ml77.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Australia is having the last laugh on Trump’s trade beef",
        "publish_date": "Fri, 05 Sep 2025 11:45:51 +1000",
        "category": "finance",
        "authors": [
            "Colin Kruger"
        ],
        "text": "It may have been the tail end of summer, but many Americans got badly burnt as they celebrated the Labor Day holiday this week.\n\nDespite Trump claiming via social media that “Prices are ‘WAY DOWN’ in the USA, with virtually no inflation” every American’s hot plate was telling a different story - especially when it comes to their insatiable appetite for beef.\n\nElon Musk, US President Donald Trump, Donald Trump jnr, Mike Johnson and Robert F Kennedy jnr eat McDonald’s aboard Trump’s private plane. Credit: @DonaldJTrumpJr/X\n\nWhile Trump plays King Canute, trying to hold back the inflation tide with nothing more substantial than his social media tirades, beef prices have never been higher.\n\nAs Americans shopped for their Labor Day weekend steaks and burger meat, they were hit with prices that have risen well over 10 per cent over the past year, according to the latest consumer price index data.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/world/asia/what-s-wrong-with-this-photo-the-rule-that-left-women-and-girls-to-die-under-afghan-rubble-20250905-p5mslt.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "What’s wrong with this photo? The rule that left women and girls to die under Afghan rubble",
        "publish_date": "Fri, 05 Sep 2025 11:42:57 +1000",
        "category": "finance",
        "authors": [
            "Fatima Faizi"
        ],
        "text": "Save Log in , register or subscribe to save articles for later. Save articles for later Add articles to your saved list and come back to them any time. Got it Normal text size Larger text size Very large text size The first rescue workers reached Bibi Aysha’s village more than 36 hours after an earthquake devastated settlements across eastern Afghanistan’s mountainous areas on the weekend. But instead of bringing relief, the sight of them heightened her fears; not a single woman was among them. Afghan cultural norms, enforced even in emergencies by the ruling Taliban, forbid physical contact between men and women who are not family members. In the village of Andarluckak, in Kunar province, the emergency team hurriedly carried out wounded men and children, and treated their wounds, said Aysha, 19. But she and other women and adolescent girls – some of them bleeding – were pushed aside, she said. The body of a girl is placed on a bed frame after being pulled from the rubble on Tuesday, In Afghanistan, strict cultural and religious norms mean that only a close male relative – her father, brother, husband or son – is permitted to touch a woman or adolescent girl. Credit: AP “They gathered us in one corner and forgot about us,” she said. No one offered the women help, asked what they needed or even approached them. Tahzeebullah Muhazeb, a male volunteer who travelled to Mazar Dara, also in Kunar province, said that members of the all-male medical team there were hesitant to pull women out from under the rubble of collapsed buildings.\n\nAdvertisement\n\nTrapped and injured women were left under stones, waiting for women from other villages to reach the site and dig them out. “It felt like women were invisible,” said Muhazeb, 33. He added, “The men and children were treated first, but the women were sitting apart, waiting for care.” If no male relative was present, he said, rescue workers dragged dead women out by their clothes so as not to make skin contact. Displaced Afghan women and children gather in Mazar Dara with their belongings on Wednesday. Credit: AP More than 2200 people died and 3600 others were injured in the magnitude 6 quake that flattened countless hamlets and villages, according to figures released by Afghanistan’s government. The response to the quake on Sunday has epitomised the dual standards that women and girls face in Afghanistan, aid groups and humanitarian organisations say, trapped both under the rubble and the weight of gender discrimination. “Women and girls will again bear the brunt of this disaster, so we must ensure their needs are at the heart of the response and recovery,” the special representative for UN Women Afghanistan, Susan Ferguson, said in a statement this week.\n\nAdvertisement\n\nAlthough the Taliban have not released a gender breakdown of the casualties, women have faced an especially harsh ordeal, made worse by neglect and isolation, more than half a dozen doctors, rescue workers and women in areas hit by the quake said in interviews. Afghanistan faces a critical shortage of healthcare workers and, in particular, of women in that field. Last year, the Taliban imposed a ban on women’s enrolment in medical education. The dearth of female doctors and rescue workers has been all too evident in the wake of the earthquake. Injured Afghan men wait to be treated at a hospital in Jalalabad on Tuesday. Credit: AP Women and girls in Afghanistan face some of the world’s most severe restrictions under the Taliban, who took power four years ago and have remained unflinching, even as most of the Muslim world, countless human rights organisations and bodies like the World Bank have warned against the long-lasting effects of such policies on the country’s social fabric and economy. Girls are prohibited from going to school beyond sixth grade. Women cannot travel far without a male companion and are barred from most jobs, including in nonprofits and humanitarian organisations. Afghan women working for UN agencies have faced repeated harassment, culminating in threats so serious this year that the agencies instructed their female employees to temporarily work from home.\n\nAdvertisement\n\nIn Afghanistan, strict cultural and religious norms mean that only a woman’s close male relative – her father, brother, husband or son – is permitted to touch her. The same applies in reverse: Women are not allowed to touch men outside their family. In disaster zones, female rescuers are restricted from assisting men. But a woman can pull unrelated women out from under debris. A New York Times journalist who reached the Mazar Dara area the day after the quake didn’t see any women among the medical, rescue or aid teams treating victims. In one district hospital visited, there were no female staff members. When a trickle of nurses and humanitarian workers began reaching the affected areas by Tuesday, only a few were women. Soldiers followed them and prevented journalists from asking questions or photographing them. A spokesperson for the Taliban-run Ministry of Health acknowledged that there was a lack of female health workers in the quake-ravaged areas. “But in hospitals in Kunar, Nangarhar and Laghman, the largest number of female doctors and nurses are working, especially to treat earthquake victims,” Sharafat Zaman, the spokesperson, said of the worst-hit provinces. Afghanistan is still dealing with aftershocks. On Thursday, one with a magnitude of 5.6 struck.\n\nAdvertisement",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/race-by-race-how-oscar-piastri-can-become-2025-world-champion-20250902-p5mrnk.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Race-by-race: How Oscar Piastri can become 2025 world champion",
        "publish_date": "Fri, 05 Sep 2025 11:40:00 +1000",
        "category": "sports",
        "authors": [
            "Luke Slater"
        ],
        "text": "Save Log in , register or subscribe to save articles for later. Save articles for later Add articles to your saved list and come back to them any time. Got it Normal text size Larger text size Very large text size Championship leader Oscar Piastri is now 34 points ahead of Lando Norris after his teammate’s forced retirement in the closing stages of the Dutch Grand Prix. With a maximum of 249 points on offer to any individual driver in the final nine rounds of the season, Piastri is by no means across the finish line yet. With everything we know from their two seasons together, and what we have learned this year, we take a look at whether Piastri can cruise to victory in the final nine rounds and three sprint races to become the first Australian F1 champion since Alan Jones in 1980, or whether Norris can reel him in. Here’s our race-by-race verdict. Italian Grand Prix\n\nAdvertisement\n\nAs was most often the case in 2024, Norris qualified ahead at Monza last year but not by a great deal. Just over a tenth of a second separated the pair. That is very much as it has been in 2025. The race, though, was where Piastri asserted his authority over Norris. He qualified one spot behind but put a bold move on his teammate at the second chicane on the opening lap, taking the lead. On the day, he lost out to Ferrari’s one-stop strategy, but still finished in front of Norris. The high-speed Monza circuit is a track where pushing too hard can lead to a locked brake and losing time that’s difficult to get back in qualifying. Could Norris’s new all-out attack approach hinder him in Italy? Our verdict: Piastri Azerbaijan Grand Prix Looking at their results from the past two seasons, Azerbaijan is one of only two races where Piastri has an advantage in average finishing position. That is largely thanks to his victory there last year, which was more decisive and impressive than his maiden grand prix win in Hungary.\n\nAdvertisement\n\nOscar Piastri on the podium after winning the 2024 Azerbaijan Grand Prix. Credit: NurPhoto via Getty Images It is difficult to directly compare Norris’s 2024 performance in Baku to Piastri, given a mistake in qualifying, but surely an imperious win there – and a bold overtake – will give the Australian the edge. That said, Norris fought back from 16th on the grid to fourth, and the McLaren car is likely to be strong. Our verdict: Piastri Singapore Grand Prix Whilst it is not universally true, Norris has tended to excel on street circuits. In Singapore last year, his advantage in both qualifying (0.4sec) and the race (first to Piastri’s third) was fairly pronounced, as it was in 2023. Singapore is also a more traditional street circuit, a little closer in style to Monaco, where Norris won in May, than Baku. Given Piastri’s rapid improvement in almost all areas, he should pose more of a threat this year. If Norris can remain error-free in qualifying, then he should go down as favourite at Marina Bay. Our verdict: Norris\n\nAdvertisement\n\nUnited States Grand Prix Norris was clearly ahead of Piastri at the Circuit of the Americas last year, with a gap of 0.6 seconds in qualifying. Piastri did not even make it out of the first part of sprint qualifying either, whilst Norris was fourth. It is difficult to see him putting a gap like that on Piastri in 2025, given the Australian’s progress from last season to this. Still, Norris likes this track, and Piastri has struggled. Advantage Norris. Our verdict: Norris Mexico City Grand Prix\n\nAdvertisement\n\nLooking at results from 2023 and 2024, Mexico City is a track where Norris has the largest advantage statistically. That was primarily because Piastri only qualified 17th last season, whilst Norris qualified third before his controversial tussle with Verstappen. Yet in 2023, Norris qualified in 19th but managed to charge through the field to finish ahead of Piastri, who started seventh. It’s fair to say that something has not quite clicked for the Australian in Mexico. Our verdict: Norris Oscar Piastri at the 2024 Mexican Grand Prix. Credit: Getty Images Brazilian Grand Prix Looking at the form book for Sao Paulo is not the most useful because of how wet and chaotic last year’s event was. Again, the Briton holds the better record during the past two years. In two grand prix and two sprint races, Piastri has only scored 11 points to Norris’s 43 in the same period. Yet, that would have been the case at plenty of tracks throughout 2025, too. Look how that has played out. Let’s not forget that Piastri took the sprint pole and was on course to win before moving over and handing victory to his team-mate.\n\nAdvertisement",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/queensland/brisbane-news-live-tributes-for-young-skier-who-died-at-thredbo-walsh-delivers-broncos-warning-what-to-do-this-weekend-20250904-p5msjg.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Brisbane news live: Tributes for young skier who died at Thredbo | Walsh delivers Broncos’ warning | What to do this weekend",
        "publish_date": "Fri, 05 Sep 2025 11:39:56 +1000",
        "category": "finance",
        "authors": [],
        "text": "Nurses and midwives in public hospitals will be asked to vote on a deal hashed out with the state government, with their union announcing this morning they have given in-principle agreement to the offer.\n\nThe draft agreement, which the Queensland Nurses and Midwives’ Union emailed to its members a week ago, includes a 3 per cent wage increase this year, along with improved overtime rates and a new pay point for registered nurses and midwives.\n\nSarah Beaman (left) said the deal came after months of negotiations and protected industrial action. Credit: Courtney Kruk\n\nThe union spent the last week speaking with members about the draft, and told Health Minister Tim Nicholls this morning they would proceed to a formal ballot.\n\n“We’ve managed to secure a much-improved offer from the government – one that protects our members existing entitlements and secures new conditions, new pay points and increased earnings across the sector,” QNMU secretary Sarah Beaman said.\n\n“There is always work to be done but this is another important step, it is a step that starts to value us, respect us and support ongoing recruitment to our profession.”\n\nQueensland’s state school teachers are also negotiating a new deal, but have delayed any further strike action until next term, while the lowest paid public sector workers this week landed a pay rise of up to 3.5 per cent.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/lifestyle/how-to-answer-the-job-interview-question-everyone-dreads-20250905-p5msom.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "How to answer the job interview question everyone dreads",
        "publish_date": "Fri, 05 Sep 2025 11:39:05 +1000",
        "category": "lifestyle",
        "authors": [],
        "text": "How to answer the job interview question everyone dreads\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/tennis/pegula-snatches-first-set-from-champion-20250905-p5msol.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Pegula snatches first set from champion",
        "publish_date": "Fri, 05 Sep 2025 11:32:00 +1000",
        "category": "sports",
        "authors": [],
        "text": "Pegula snatches first set from champion\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/victoria/erin-patterson-s-plea-for-mercy-runs-aground-on-a-simple-truth-she-has-no-remorse-20250902-p5mrt6.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Erin Patterson’s plea for mercy runs aground on a simple truth: she has no remorse",
        "publish_date": "Fri, 05 Sep 2025 11:30:00 +1000",
        "category": "finance",
        "authors": [
            "John Silvester"
        ],
        "text": "Heather Wilkinson, along with Don and Gail Patterson, could not tell their stories as they died terrible deaths in this monstrous plot. When it became Patterson’s defence team’s turn, it was clear their egg and spoon would be no match for the sword of justice. In a normal plea, the offender’s lawyers usually call character witnesses to say sure, their client may be a homicidal maniac, but they care for rescue dogs, donate to charity and buy cookies from Girl Guide fundraisers. They then produce a psychiatry report to say their client had a terrible childhood, was brought up by wolves in the jungle and got hit in the head by lightning when they were five. But Patterson’s lawyers couldn’t do that as Erin maintains she is innocent and the victim of such a monstrous injustice not seen since the witch trials in Salem.\n\nOne tactic the defence could have explored would have been to say that while Patterson maintained her innocence, she was prepared to waive an appeal so that her surviving family, including her children, could get on with their lives. That might have got her a three to five-year discount. But that is not in Patterson’s DNA. She is the victim. She asked to have her trial at Morwell then whinged and whined about her cell conditions, no doubt writing a stinging review on Tripadvisor. Erin Patterson arrives at court for her plea hearing. It did not go well. Credit: POOL With yet another complaint, she told a custody officer: “You don’t know what it is like to suffer.” Everything is relative. Being painfully and deliberately poisoned so that your vital organs shut down is suffering. Not having a fluffy pillow in your watchhouse bunk is more an inconvenience.\n\nWhile she says she is the biggest patsy since Lee Harvey Oswald, her senior barrister, Colin Mandy, SC, took a more sensible route. “This is very grave offending, and we make no argument that the sentence should be anything other than life imprisonment, but the issue is whether there should be a non-parole period,” he told Beale. Patterson is aged 50 and has already served nearly two years. Mandy wants the judge to set a minimum of 30 years so she could be out when aged about 80. Mandy must surely acknowledge this submission is ambitious. Barrister Colin Mandy, SC, outside court with Erin Patterson’s legal team of Sophie Stafford (left) and Ophelia Hollway. Credit: Jason South In fact, the plea backfired. Out of the blue her team said Patterson was suffering from autism. It would appear to be another Erin self-diagnosis as she didn’t provide a medical diagnosis or even a sick note from a teacher.\n\nOf course, we remember that she used a fake cancer diagnosis to lure her victims to the deadly beef Wellington lunch and so another piece of medical trickery is unlikely to endear her to the judge. To make the point, prosecutor Jane Warren said in court: “The evidence just isn’t there.” Beale responded, “She doesn’t have a lot of credibility ... you’re pushing on an open door.” More appropriately he could have said she has stepped onto a trapdoor. The judge said he had read 28 victim impact statements, affecting four generations of the families, describing it as a tsunami.\n\nProsecutor Warren came off the long run wanting the judge to throw away the key. “It is a crime that is so cruel and so horrific that, in our submission, the offender is not deserving of this court’s mercy.” Mandy played his strongest cards. Patterson will do jail hard. She will have to be in protection for years, which is solitary confinement. She can chat to her neighbour through some mesh but as that neighbour is a committed, barking-mad terrorist, the dialogue will hardly be witty. Patterson will not see her children grow up and has ruined her life. But she finished three lives and damaged many more. Former husband Simon Patterson told the court how he and his children had been stalked by the media and how they were made to feel as if they were the prize targets in a massive story not of their making.\n\nBeale has listened and acted. After a plea hearing, a judge usually takes months to write their sentencing remarks. In this case, he has broken speed records to be back in court on Monday. Loading He wants this off the books, not for his sake but the sake of the victims in the hope that the searing light of publicity dims – at least temporarily. Contrary to the view that sentencing judges can be soft or tough, they really have to stay within the lanes with sentencing guidelines and a nod to previous cases. And contrary to public perception, sentencing, at least at the serious end, has become tougher.\n\nIn 1987, Julian Knight murdered seven people and wounded 19 in a mass shooting in Hoddle Street. He received life with a minimum of 27 years. That is about four years per killing with no punishment for the wounding. Loading More astonishing was the fact the prosecutor said there should be a minimum sentence. Decades later, the government stepped in to ban him from parole. Back then, we in the media would get it wrong. The headline would be the main sentence not the minimum that was the real sentence.\n\nOnce inside, an offender would get a further discount for good behaviour. So a murderer who was sentenced to life with a minimum of 21 years would probably serve only 14 and with a few cunning tricks, serve even fewer. Beale has a balancing act. Life with no minimum would likely lead to an appeal on sentence, dragging the case out for another year. If the judge shows mercy, it will not be for Patterson but for the survivors who want this circus ended. If she gets a minimum and appeals, the prosecution could again ask for life potentially extinguishing any chance she will be freed. One case he may look at is that of Ashley Mervyn Coulston who in 1992 went to a house in Burwood to answer an ad for a tenant. He tied up the three people in the house, Kerryn Henstridge, 22, Anne Smerdon, 22, and Peter Dempsey, 27, and executed them.\n\nNo motive was ever established. After trials and retrials, he was finally sentenced to life with Justice Norman O’Bryan saying: “You have forfeited forever your entitlement to live outside the confines of a prison.” Beale will consider how tough Patterson’s jail time will be. But it is hard to think of a worse crime. Loading She researched methods of murder for months, perhaps years. She decided death cap mushrooms would be the best poison, went out and foraged for the right ones then plotted the crime she believed could be written off as a horrible accident. Although her prime target was ex-husband Simon, she proceeded with the deadly lunch in the hope he would change his mind. When he didn’t, she prepared the deadly beef Wellingtons, served them to her four guests then prayed with them.\n\nShe made small talk watching as they took bite after bite, then watched as Don finished his wife’s leftovers. A hot lunch from the coldest of killers. As soon as they were gone, she headed to the local tip to dump evidence, faked similar symptoms when her guests fell ill, concealed evidence, lied, used her kids as alibi witnesses, and has not once, not ever, shown the slightest sign of remorse. The judge will also know she will not re-offend. No one in their right mind would eat anything she served up after she serves her time. Beale would be well within the law to sentence her to life with no minimum, but if he sets a non-parole period, it will be close to 40 years. The defence would like her eligible for release by the time she is 80. It will be closer to 90, if at all.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/culture/music/live-music-is-struggling-but-for-one-genre-things-have-never-been-better-20250903-p5ms8g.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Live music is struggling. But for one genre, things have never been better",
        "publish_date": "Fri, 05 Sep 2025 11:30:00 +1000",
        "category": "finance",
        "authors": [
            "Karl Quinn"
        ],
        "text": "Save Log in , register or subscribe to save articles for later. Save articles for later Add articles to your saved list and come back to them any time. Got it Normal text size Larger text size Very large text size There are two types of music, the old joke goes – country and western – and in Australia right now, they’re both riding high. While the last couple of years have seen the live music and festival sector generally struggle, country (the western has long since been put out to pasture) has been experiencing an unprecedented surge in popularity. “Country music isn’t just growing,” says Kevin Azzopardi, marketing director of ticket reseller Tixel, which has just released its fourth annual State of Play report into the health of the live music sector in Australia. “It’s booming at the moment.” Tixel’s survey, produced in collaboration with marketing consultancy Bolster, draws on a survey of more than 2700 music fans (not just Tixel customers), as well as industry research and interviews with promoters, managers, and senior label and festival personnel. Young listeners, such as this group of fans at Honky Tonks in Brisbane’s Fortitude Valley, are tuning in to country music like never before. Credit: Markus Ravik And while the overall picture is of a live music industry slowly regaining its footing after a tough few years marked by pandemic shutdowns, cost-of-living pressures, and changing consumer behaviour, in the formerly niche area of country music, everything is coming up roses. Country music fans attend more live events, and spend more at those events – on food, drink, transport and merchandise – than fans of other genres. And there’s more of them than ever before.\n\nAdvertisement\n\nLoading “They spend 57 per cent more than regular consumers,” says Azzopardi. “And country music attendance has jumped 54 per cent since 2023. We’re seeing country grow in all areas. We’re seeing it take over socials … there’s country core, this fashion trend that’s emerging, as well. And so I think there’s a whole cultural phenomenon at the moment around country.” Though as a genre it sits well behind the biggest categories – pop at 59 per cent of respondents leads the way, with rock (49 per cent) and EDM/electronic (almost 45 per cent) close behind – country was up from 9 per cent in 2023-24 to 14 per cent in 2024-25. And much of the growth is coming from young people in the capital cities. Bella Bown, a 26-year-old office worker from Bayswater in Melbourne’s outer eastern suburbs, is one such fan. In her early 20s, she says, her taste in music leaned towards house or the kind of pop she heard on commercial radio. Melbourne’s Bella Bown is among a new generation of country music fans. Credit: Wayne Taylor “My brother was a huge fan of country, but I used to say, ‘Why do you listen to that?’” she says. “And then, four or five years ago, I don’t know, something changed.” And what was it about country that hooked her? “It makes you happy when you’re sad,” she says. “And it makes you feel a part of something.”\n\nAdvertisement\n\nBown’s first big concert was Luke Combs in August 2023. “We were in the mosh pit,” she recalls, “and the vibe just made me fall more in love with country music.” American Combs, who has almost 26 million monthly listeners on Spotify and had three albums in last year’s ARIA top 100 chart, is both contributor to and barometer of the growth of country music in Australia. When he first toured in 2018, he played The Forum in Melbourne and the Enmore in Sydney, in front of a couple of thousand people. By 2023, he was playing Rod Laver in Melbourne (capacity around 14,000) and QUDOS in Sydney (21,000). Last year, he was packing venues three or four times that size. Luke Combs is leading the country crossover into the mainstream. Credit: Wolter Peeters “[A few years ago] you were struggling to fill smaller arenas [with international country artists],” says Dobe Newton, long-standing member of The Bushwhackers and current chair of the Country Music Association of Australia. “And then all of a sudden, here’s Luke Combs, the first country artist to not only headline stadiums, but actually sell them out. You know, 320,000 people over six concerts.” Loading In July, the CMAA released its latest census (the last was in 2019). And the story it told was remarkable.\n\nAdvertisement\n\nIn 2024-25, country music generated revenue of $1.11 billion, a 79 per cent increase on the $619 million reported in 2019. Around half of that spend ($587 million) was from ticket sales. The report claimed 3.26 million people attended country music shows across the year. Crucially, there was no Taylor Swift bump in those numbers, because while country music as a genre is a remarkably broad church, Tay-Tay has excommunicated herself. “She went to enormous trouble to remove the country signature banjos and fiddles from early recordings,” says Newton, referring to her re-recording of her back catalogue under the “Taylor’s Version” rubric. Taylor Swift has worked hard to distance herself from her country music origins. Credit: Invision “That’s her decision, and I think most people would recognise that she’s not regarding herself – and therefore most people don’t regard her – as a country artist. Though now she’s seen the uptick in country, she may produce new versions of those albums with the banjos back in. It would certainly make the next census look pretty damn good.” As country music talent and branding director at Frontier Touring, where she works across the CMC Rocks and Ridin’ Hearts country music festivals, Georgie Luxton has witnessed the explosion in popularity up close. “There is definitely a new generation of fan,” Luxton says. “I think social media, and especially TikTok, has helped expand people’s view of what country is, the whole breadth of country artists. That platform has really helped give recognition to the genre.”\n\nAdvertisement\n\nWhen the city-based single-day festival Ridin’ Hearts was launched three years ago, it drew around 3000 people in Melbourne and 4000 in Sydney. This year, they expect to sell between 8000 and 9000 tickets in each city. CMC Rocks – which turns 20 in 2027 – will have about 25,000 people onsite in Willowbank in Queensland on each of its three days next March. “There’s just so many artists coming out at the moment,” Luxton says. “Three or four years ago, we would maybe have been doing like five country tours. Next year, it’s like five festivals, plus at least, I would say, 15 country tours coming through.” Loading The mainstreaming of country owes something to its uptake by some of the world’s biggest pop stars. “You’ve got Beyonce crossing genres [with her Cowboy Carter album], you’ve got Chappell Roan releasing country singles, you’ve got Post Malone doing collaborations with Taylor Swift,” notes Azzopardi. But country is taking hold at a grassroots level too – with rodeos, line-dancing classes and country-themed club nights spreading like wildfire. There’s even been the emergence of a cosmic-country/ambient Americana strand in electronic music. “It really has exploded,” says Luxton. But for every inner-city hipster lining up for a boot-scooting session in Melbourne’s Brunswick or dropping an ironic yee-har at Jolene’s in the Sydney CBD, there are those who prefer to take their country straight, no chaser. Country music fan Ash Thorpe: “When you come down to it, it’s three chords and the truth.” Credit: Louise Kennerley\n\nAdvertisement",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/nrl/nrl-around-the-clubs-round-27-20250831-p5mr9y.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "History repeats as Asofa-Solomona faces critical finals ban again",
        "publish_date": "Fri, 05 Sep 2025 11:29:39 +1000",
        "category": "sports",
        "authors": [
            "Dan Walsh",
            "Adrian Proszenko",
            "Christian Nicolussi",
            "Michael Chammas"
        ],
        "text": "Asofa-Solomona is on Melbourne’s books until the end of 2028 on a lucrative deal that makes him their highest-paid forward aside from captain Harry Grant. Privately, the club has indicated that it would not stand in Asofa-Solomona’s way if Rugby360 gets off the ground and he pursues a return to the code he played as a junior in New Zealand. Meanwhile, Hughes’ is considered unlikely to play again this year. The Dally M medallist’s return from a six-week shoulder lay-off lasted just 25 minutes when his arm was caught awkwardly in an attempted tackle on Brendan Piakura. Utility Tyran Wishart and promising playmaker Jonah Pezet loom as the Storm’s replacement options once again. NFL hopeful who blew Viking horn in Vegas sacked and suspended\n\nThe NFL wannabe who was kicked out of Allegiant Stadium shortly after blowing the Viking horn has been cut by the Las Vegas Raiders and suspended for two games. Tyler Manoa, a 25-year-old defensive tackle, was given the honour of blowing a custom-made horn that was constructed solely for the purposes of marking Canberra’s debut in the United States in the opening round of the season. Tyler Manoa may have jeopardised his NFL career moments after blowing the Viking horn. Credit: Fox Sports Canberra had reached out to a number of celebrities - including Dana White, Tom Brady, Rob Gronkowski and Las Vegas Raiders head coach Pete Carroll - in the hope they would be available. When they all declined, Manoa - who is yet to make his run-on NFL debut - was enlisted for the job. Shortly after blowing the horn, Manoa was ejected from the stadium for misbehaviour in the corporate area. Then a member of the Las Vegas Raiders’ practice squad, it’s alleged Manoa damaged property inside the restrooms, with some reports suggesting he was also tasered.\n\nManoa was scheduled to make a guest appearance in the Canberra sheds after their win against the New Zealand Warriors, but was a no-show. With the NFL season just a month away, the Raiders have cut Manoa, making him a free agent. However, it’s been reported that he will cop a two-game NFL suspension, said to be linked to the Allegiant Stadium incident, that could be a turn-off for prospective employers.The NFL announced on Sunday (AEST) that Manoa had been suspended due to “conduct detrimental to the league”. Canberra’s stellar performance in Las Vegas has been the springboard to a dominant season in which they claimed their first minor premiership since 1990. To’o, Kernick crowned Blues’ winners Christian Nicolussi\n\nBrian To’o has clinched the Brad Fittler Medal for a second time with Olivia Kernick crowned the Origin Player of the Series Award on Monday night. To’o scored five tries in three games on the left wing for the Blues, including a hat-trick in Perth, but was still unable to help the Blues avoid a humiliating series-decider loss in Sydney. Olivia Kernick and Brian To’o were the big winners at the Brad Fittler Medal on Monday night. Credit: Gregg Porteous/NRL Images The 27-year-old To’o will now turn his sights to winning a fifth straight title with the Panthers, and is expected to be part of the returning star cavalry for Saturday’s trip to Wollongong against the Dragons. Fittler himself let slip on stage how, “I just asked Brian and he said he’s not playing”, but To’o said it was news to him, and was hopeful to be included on the team sheet on Tuesday. The Panthers rested a whopping 16 players against the Bulldogs last week.\n\n“It was a bit of a shock to us, we weren’t expecting that at all,” said To’o, of the mass withdrawals. “Our commander-in-chief [coach Ivan Cleary] has a plan for everything, and we definitely trust him. I got to spend some quality time with the family and had that little recharge, and now I’m ready to go. “I’m a big believer everything happens for a reason. Time will tell if we can [go all the way again].” To’o was joined at The Star by wife Moesha who is 30 weeks pregnant with their second child, a girl, who is due in November “after the Samoan Tests”. “There are so many people to thank for this award, including my wife whose back is sore, it’s aching, yet she still manages to come here tonight and supports me,” To’o said.\n\nCoach Laurie Daley, who was struggling with his voice on stage, said it was disappointing to “not get the result we deserved” in what was his first series back in charge since 2017. “But sometimes it takes a setback like that to put you on the right path,” Daley said. Isaah Yeo, Lindsay Smith, Stephen Crichton and Lindsay Smith were among the other Blues to attend the event that honours the achievements of players and participants across all competitions around the state. 2025 Brad Fittler Medal winners Brad Fittler Medal: Brian To’o (Penrith Panthers) True Blue Award: Payne Haas (Brisbane Broncos) The Daily Telegraph People’s Choice Award: Brian To’o (Penrith Panthers), Olivia Kernick (Sydney Roosters) NSW Blues Women’s State of Origin Player of the Year: Olivia Kernick (Sydney Roosters) NSW Blues Women’s Award: Abbi Church (Parramatta Eels) NSW Under 19s State of Origin Player of the Match: Jacob Halangahu (St George Illawarra Dragons) NSW Under 19s Women’s State of Origin Player of the Match: Tess McWilliams (Parramatta Eels) The Knock-On Effect NSW Cup Player of the Year: Kalani Going (Warriors) Harvey Norman NSW Women’s Premiership Player of the Year: Monique Donovan (Cronulla-Sutherland Sharks) Jersey Flegg Cup Player of the Year: Preston Conn (Melbourne Storm) Leagues Clubs Australia Ron Massey Cup Player of the Year: Joseph Nohra (Wentworthville Magpies), Taniela Lasalo (Hills Bulls) Sydney Shield Player of the Year: Tallis Brown (Moorebank Rams) Angus Crichton won last year’s Brad Fittler Medal, with To’o taking home the silverware in 2023.\n\nTo’o has 11 Origin tries, the same amount as Blues’ record-holders Josh Addo-Carr and Michael O’Connor. Payne Haas, the only other Blues player who would have gone close to taking out the top gong, picked up the people’s choice award. Roosters star Kernick was crowned best womens’ player, while first-year Blues fullback Abbi Church collected the NSW Blues Women’s Award. Kernick took to the stage earlier in the night to accept the country championships’ player of the year prize for her brother, Jacob, “who can’t be here because he’s on Mad Monday”. Latrell unlikely for Roosters grudge match\n\nMichael Chammas South Sydney superstar Latrell Mitchell is unlikely to be available for Friday night’s grudge match against his old club, the Sydney Roosters, with a neck and back injury. In a huge boost for the Sydney Roosters’ chances of qualifying for the finals, Mitchell is considered “unlikely” to play for the Bunnies in their final game of 2025. Latrell Mitchell is unlikely to play for South Sydney this week. Credit: Getty Images Mitchell missed the Rabbitohs’ 40-0 win against the Dragons in round 25, but it was expected he would return following last week’s bye.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/eagles-star-ejected-for-spitting-20250905-p5msog.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Eagles star ejected for spitting",
        "publish_date": "Fri, 05 Sep 2025 11:21:44 +1000",
        "category": "finance",
        "authors": [],
        "text": "Eagles star ejected for spitting\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/lifestyle/life-and-relationships/there-s-something-comedic-about-the-grandad-child-swap-case-but-it-hurts-my-heart-20250904-p5msip.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "There’s something comedic about the grandad child-swap case, but it hurts my heart",
        "publish_date": "Fri, 05 Sep 2025 11:20:00 +1000",
        "category": "lifestyle",
        "authors": [
            "Kate Halfpenny"
        ],
        "text": "In 1975 our parents went to Europe for six weeks so our nans moved into the Glen Waverley casa to look after us four kids and the dog. Cool, right? What’s the worst that can happen when nans run the show?\n\nNeita, mum’s mum, did the housekeeping. And did it on her ear. She was a fantastic cook who’d make ginger creams in five minutes. To this day, I miss her cheese omelettes.\n\nGrandparents are increasingly being called upon to help out with their children’s kids. Credit: Sean Davey\n\nBeatrice was transport chief. She’d only had her driver’s licence for a couple of years since Grandad died, but — aided by Bex powders — gamely squashed us all into her Cortina with the 007 number plates for school runs and grocery shopping.\n\nAll good. Until one day Beat fanged it into the garage and out the brick wall at the end, like a slow-mo cartoon scene. Clipping Dad’s silver Ford GT on the way. Watching, my sister and I were delighted and alarmed in equal measure.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/business/markets/asx-set-to-jump-as-wall-street-rises-on-rate-cut-hopes-20250905-p5msl2.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Banks jump again to drive ASX higher",
        "publish_date": "Fri, 05 Sep 2025 11:15:27 +1000",
        "category": "finance",
        "authors": [
            "Staff Reporter"
        ],
        "text": "The Australian sharemarket has made a bright start to the session on the back of a strong lead from Wall Street, with the big four banks again driving gains.\n\nThe S&P/ASX 200 was up 41.7 points, or 0.5 per cent, to 8868.2 at 11.12am AEST, with seven of its 11 industry sectors in positive territory, led by consumer stocks and financials.\n\nWal Street is eagerly awaiting the next jobs report. Credit: Bloomberg\n\nFinancial stocks were stronger, with the big four banks bouncing higher. NAB jumped 1.5 per cent, Westpac rose 1.1 per cent, ANZ gained 0.9 per cent and Commonwealth Bank was 0.6 per cent higher in early trade.\n\nQantas shares are 1.5 per cent higher. The airline’s former chief executive Alan Joyce has had his final windfall from the company, with his last long-term share bonus vesting, resulting in him pocketing a further $3.8 million worth of shares. Meanwhile, his successor Vanessa Hudson’s pay jumped 44 per cent to $6.3 million, according to the airline’s annual report filed with the ASX.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/nrl/why-cameron-munster-is-wary-of-mercurial-walsh-20250905-p5mskw.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Why Cameron Munster is wary of mercurial Walsh",
        "publish_date": "Fri, 05 Sep 2025 11:15:14 +1000",
        "category": "sports",
        "authors": [
            "Nick Wright"
        ],
        "text": "Queensland Maroons skipper Cameron Munster has achieved everything rugby league has to offer, but even he is on edge for what Reece Walsh could produce once the NRL finals launch.\n\nThe Brisbane Broncos’ fullback produced what his halfback Ben Hunt defined as “his most controlled game for a while” to orchestrate a 30-14 boilover of Melbourne on Thursday night, all but sealing their place in the top four.\n\nMunster was forced to watch as Walsh triggered everything: scoring twice – his second coming straight after his own 40/20 – and setting up another in a career-best 22 point haul.\n\nOn and off the field, Walsh is never far from a headline. His now infamous social media video drinking from a toilet appeared an unnecessary distraction in the lead up to the crucial clash, while he has been both lauded and criticised for his audacious play.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/goodfood/recipes/adam-liaw-s-30-best-spring-recipes-of-all-time-20250903-p5ms1t.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Adam Liaw’s 30 best spring recipes of all time",
        "publish_date": "Fri, 05 Sep 2025 11:15:05 +1000",
        "category": "finance",
        "authors": [
            "Adam Liaw"
        ],
        "text": "Recipe collection\n\nAdam Liaw’s 30 best spring recipes of all time\n\nGet ready to shed your winter layers and dive into Adam Liaw’s most vibrant new-season recipes, starring everything from zesty lemon lamb cutlets to a show-stopping two-metre banh mi.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/culture/tv-and-radio/katie-lowes-teases-a-return-in-season-2-of-the-hunting-wives-20250905-p5mso5.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Katie Lowes teases 'a return' in Season 2 of The Hunting Wives",
        "publish_date": "Fri, 05 Sep 2025 11:06:24 +1000",
        "category": "finance",
        "authors": [],
        "text": "Katie Lowes teases 'a return' in Season 2 of The Hunting Wives\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.sbs.com.au/news/article/albanese-has-warm-and-constructive-call-with-trump/uejgn2k9k",
        "title": "Albanese hails 'constructive' talk with Trump amid calls for in-person meeting",
        "publish_date": "Thu, 4 Sep 2025 22:35:40 +0000",
        "category": "finance",
        "authors": [],
        "text": "Prime Minister Anthony Albanese has held further talks with United States President Donald Trump on trade and security, but there's no word yet on when the pair will meet face-to-face.\n\n\n\n\n\nAlbanese revealed the leaders spoke in a social media post just before midnight on Thursday.\n\n\n\n\n\nIt was the fourth phone call between the pair, which Albanese said was \"warm and constructive\".\n\n\n\n\n\n\"We discussed our trade and economic relationship as well as areas for growth, including critical minerals,\" he said in the post on X.\n\n\n\n\n\n\"We also discussed shared US-Australia security interests.\"\n\n\n\nA readout of the meeting said Albanese discussed economic cooperation, as well as trade and critical minerals important to both countries.\n\n\n\n\n\n\"Leaders also discussed the strength of our relationship and the importance of our shared security interests,\" it said.\n\n\n\n\n\nBut there was no word on when the two leaders will hold their first face-to-face meeting, which Australia has been pursuing since Trump's return to the presidency in November.\n\n\n\n\n\nThe two were expected to have talks in June on the sidelines of a G7 summit in Canada, but the meeting was cancelled after Trump returned to the US early to deal with issues in the Middle East.\n\n\n\nREAD MORE Albanese defends cancelled Trump talks as new meeting opportunity emerges\n\nThe call took place just weeks ahead of a United Nations general assembly meeting, which Trump will also attend, at which Australia is expected to join the United Kingdom, France, Canada and others in pushing for the recognition of a Palestinian state.\n\n\n\n'Lots going on in the US-Australia relationship'\n\nAustralian ambassador to the US, Kevin Rudd, welcomed the phone call between the two leaders.\n\n\n\n\n\n\"Lots going on in the US-Australia relationship. And going from strength to strength,\" he said on X.\n\n\n\nThe phone call coincides with Australia's efforts to persuade the US to drop tariffs on its exports.\n\n\n\n\n\nTrump imposed a baseline tariff of 10 per cent on all Australian goods to the US and a 50 per cent tariff on steel and aluminium.\n\n\n\n\n\nAt the same time, the US is reviewing the AUKUS trilateral security alliance, under which Australia is expected to spend $386 billion on nuclear-powered attack submarines.\n\n\n\n\n\nThe US has been pushing Australia to raise its defence spending to 3.5 per cent of gross domestic product.\n\n\n\nThe government is currently spending 2.02 per cent with a view to increasing that sum to 2.33 per cent of GDP by 2033/34.\n\n\n\n\n\nEmployment Minister Amanda Rishworth said the phone call between the two leaders expanded on ties between the allies.\n\n\n\n\n\n\"We have the lowest trade tariffs of any country in the world when it comes to the US, but no doubt, this builds on what is already a warm relationship between the two of them,\" she told Seven's Sunrise program on Friday.\n\n\n\n\n\n\"As the prime minister has indicated, they'll meet when it's convenient for both parties.\n\n\n\n\n\n\"Clearly, there's a connection there with four phone calls,\" she said.\n\n\n\nBut Liberal senator Jane Hume told Seven's Sunrise program more work needed to be done to secure a face-to-face meeting with Trump.\n\n\n\n\n\n\"It's been 300 days now since President Trump has was elected, and still no meeting between our leaders, and that's a concern.\n\n\n\n\n\n\"We want Anthony Albanese to step up and represent Team Australia with President Trump, and particularly to secure our AUKUS agreements.\"\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/are-neo-nazis-really-gaining-traction-in-australia/hi4h1lcnw",
        "title": "Are neo-Nazis REALLY gaining traction in Australia?",
        "publish_date": "Thu, 4 Sep 2025 21:00:00 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/italian-fashion-designer-giorgio-armani-dies-aged-91/xf8lvxumi",
        "title": "'A legend': Italian fashion designer Giorgio Armani has died aged 91",
        "publish_date": "Thu, 4 Sep 2025 20:45:33 +0000",
        "category": "lifestyle",
        "authors": [],
        "text": "Designer Giorgio Armani, who helped to put Italy at the forefront of global fashion and dressed Hollywood stars, has died at the age of 91, the company that he founded and led for five decades said.\n\n\n\n\n\n\"With infinite sorrow, the Armani Group announces the passing of its creator, founder and tireless driving force: Giorgio Armani,\" the fashion house said in a statement.\n\n\n\n\n\nArmani died at home, the company said.\n\n\n\n\n\nArmani, who was 91, was synonymous with modern Italian style and elegance.\n\n\n\n\n\nHe dressed celebrities including Cate Blanchett, Julia Roberts, George Clooney, Nicole Kidman, Kevin Costner and Lady Gaga.\n\n\n\nGiorgio Armani was seen as a pioneer of suit tailoring for men and women. Source: AAP / Daniel Dal Zennaro / EPA Armani combined the flair of a designer with the acumen of a businessman, running a company that turned over 2.3 billion euros ($4.1 billion) annually.\n\n\n\n\n\nHe also owned several bars, clubs, restaurants and his own basketball team, EA7 Emporio Armani Milan, better known as Olympia Milano.\n\n\n\n\n\nHe opened more than 20 restaurants, spanning from Milan to Tokyo, since 1998, as well as two hotels: one in Dubai in 2009 and another in Milan in 2010.\n\n\n\nFrom medicine to fashion\n\nHaving initially studied medicine, Armani transitioned into fashion during the 1960s and established his own label alongside his partner, Sergio Galeotti, in 1975. This label became renowned for its luxury in both men's and women's wear.\n\n\n\n\n\nThe designer's career spanned almost six decades, with his brand becoming a household name after its re-invention of power dressing gained global attention in 1980 when he dressed Richard Gere in American Gigolo.\n\n\n\n\n\nHe had been unwell for some time and was forced to drop out of his group's shows at Milan's Men's Fashion Week in June, the first time in his career that he had missed one of his catwalk events.\n\n\n\nGiorgio Armani went on to work with numerous celebrities, including Nicole Kidman, Cate Blanchett, Julia Roberts, and Lady Gaga. Source: AAP / Will Oliver/EPA Known as \"Re Giorgio\" — King Giorgio — the designer was known for overseeing every detail of his collection and every aspect of his business, from advertising to fixing models' hair as they head out onto the runway.\n\n\n\n\n\n\"I design for real people. There is no virtue whatsoever in creating clothes and accessories that are not practical,\" he liked to say when asked to identify his clientele.\n\n\n\n'A true friend. A legend'\n\nRoberts, who famously wore an Armani men's suit to the 1990 Golden Globes, posted a picture of herself with the designer on Instagram, accompanied by a broken heart emoji.\n\n\n\n\n\n\"A true friend. A legend,\" she wrote.\n\n\n\n\n\nArmani remained the sole owner of his company and worked with a tight-knit group of long-time colleagues and family members.\n\n\n\n\n\n\"He treated everyone as equals and felt at ease among young people. He'd invite us to birthday parties and dinners at his villa in Broni [northern Italy], groups of us: tailors, mailmen, sales assistants,\" said Mauro Barbieri, who worked as a warehouse man for Armani in Milan for 32 years.\n\n\n\n\n\n\"He would laugh with us and was really down to earth,\" Barbieri told Reuters.\n\n\n\n\n\nA funeral chamber will be set up over the weekend in Milan, the company said, followed by a private funeral at a later date.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/video/new-report-places-spotlight-on-racism-experienced-by-healthcare-workers/5didpa5y5",
        "title": "New report places spotlight on racism experienced by healthcare workers",
        "publish_date": "Thu, 4 Sep 2025 10:44:51 +0000",
        "category": "finance",
        "authors": [],
        "text": "New report places spotlight on racism experienced by healthcare workers\n\nPublished 4 September 2025, 8:11 am\n\nA new report has directed a spotlight onto the level of racism and discrimination which Aboriginal and culturally diverse health care workers say they face. After nearly 70 per cent of survey respondents reported facing racism at work, the union has described the situation as a 'public health emergency.'",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/call-for-action-after-report-details-racism-faced-by-nurses-midwives/ow12fdojj",
        "title": "Call for action after report details racism faced by nurses, midwives",
        "publish_date": "Thu, 4 Sep 2025 09:59:15 +0000",
        "category": "finance",
        "authors": [],
        "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts .\n\n\n\n\n\nWhen Loveness Tsitsi Mauwa began her first job in a New South Wales Hospital as a nurse, a colleague told her there was what she called a template for career success in the hospital.\n\n\n\n\n\n\"She told me to progress, you have to be young, Caucasian and beautiful. And at that time, it didn't make sense to me.\"\n\n\n\n\n\nBut as she stayed in the sector for longer, she realised the template existed.\n\n\n\n\n\nIn the following decade, the Zimbabwe-born nurse applied for various opportunities to progress her career, only to find she often didn't make it to the final stage.\n\n\n\n\n\n\"So I did put out some applications, and in one of the applications, I was promised I was going to get an opportunity, but that opportunity never came, but everyone else who had applied who met the criteria was able to progress.\"\n\n\n\n\n\nAs one of the critical sectors that face a labour shortage, the federal government has been prioritising visas for nurses in the skilled migration system.\n\n\n\n\n\nMs Mauwa says in the 25 years she has lived in Australia, she has seen the workforce become more culturally diverse - but barriers still exist.\n\n\n\n\n\n\"I think the health system is happy if we (are) just working on the floor, but not wanting to progress into management or senior roles, so that is where it becomes a challenge.\"\n\n\n\n\n\nA new report by the New South Wales Nurses and Midwives Association found two-third of nurses and midwives from culturally and linguistically diverse backgrounds in the state have experienced racism at work.\n\n\n\n\n\nOver 3,000 nursing union members were surveyed for the report.\n\n\n\n\n\nOne in five said they have been verbally abused or insulted; and one in 10 said they had been subjected to name-calling by patients, clients or colleagues.\n\n\n\n\n\nRace Discrimination Commissioner Giridharan Sivaraman says the report shows racism is a public health emergency that must be dealt with urgently.\n\n\n\n\n\n\"Put simply, racism is making people sick. Racism is stopping people who are sick from getting better, and racism is making people who are sick get worse.\"\n\n\n\n\n\nMr Sivaraman says while he launched a National Anti-Racism Framework last year, he hasn't seen governments put it into action.\n\n\n\n\n\n\"And the report that the New South Wales Nurses and Midwives Association courageously prepared off the back of feedback from their members shows that the recommendations; and our framework, which align completely with the recommendations and their report, need to be implemented.\"\n\n\n\n\n\nThe nursing union's report calls on employers to ensure all staff complete bystander action education.\n\n\n\n\n\nIt also makes another eight recommendations, including: prioritising the elimination of institutional racism; policies and training on incident reporting; and monitoring the effectiveness of co-designed anti-racism training.\n\n\n\n\n\nThe general secretary at NSW Nurses and Midwives' Association, Shaye Candish, says the union has launched a partnership to ensure progress is made.\n\n\n\n\n\n\"It will be chaired by the Human Rights Commission, and we will have participants from governments, from employers, from the union, from the advocacy groups, from all stakeholders involved in this collaborative. The reality, unfortunately, is that racism is a pervert problem, and it is a really layered and complex problem. It's going to take a lot of work and commitment from organisations. But it's also going to take a collaboration from all of our organisations, because there is no one simple solution, and there is no one organisation that can fix this on their own.\"\n\n\n\n\n\nNew South Wales Health Minister Ryan Park says there are robust anti-racism policies in place, but individuals need to work together to ensure they are implemented.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/xis-new-world-order-indonesia-unrest-thailands-political-plight/gf52cf61m",
        "title": "Xi’s 'new world order', Indonesia unrest & Thailand’s political plight",
        "publish_date": "Thu, 4 Sep 2025 07:42:30 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/is-victoria-australias-crime-state-and-what-does-it-mean-for-insurance-premiums/iqp477ah1",
        "title": "Is Victoria Australia's crime state and what does it mean for insurance premiums?",
        "publish_date": "Thu, 4 Sep 2025 07:15:07 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/jacinta-price-says-she-wont-apologise-over-remarks-on-indian-migrants/vbhq75zpu",
        "title": "Jacinta Price says she won't apologise over remarks on Indian migrants",
        "publish_date": "Thu, 4 Sep 2025 06:29:45 +0000",
        "category": "finance",
        "authors": [],
        "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nThe Coalition is in damage control after Senator Jacinta Nampijinpa Price made false claims that Labor was taking in more migrants from certain backgrounds to bolster their vote.\n\n\n\n\n\nSingling out Indians coming to Australia, Senator Price made the allegations on ABC's Afternoon Briefing, following a series of anti-immigration rallies in Australia.\n\n\n\n\n\n\"There is a concern with the Indian community, because there's been large numbers and we can see that reflected in the way that the community votes for Labor at the same time. So if they're going to see a reflection that okay these individuals are going to vote for us more so than other parts of the community; will then of course they're going to express the view that will get those sorts of individuals into our communities.\"\n\n\n\n\n\nAn hour after making the remarks, she issued a statement saying she made a mistake, adding that Australia \"maintains a longstanding and bipartisan non-discriminatory migration policy\".\n\n\n\n\n\nLanguage used by organisers and speakers at the weekend's anti-immigration rallies - and in promotional materials - have been condemned by experts for fuelling misinformation on immigration data - and for targeting Indian Australians.\n\n\n\n\n\nSenator Price says she believes that raising concerns about migration does not mean that you are racist.\n\n\n\n\n\nFederal Opposition leader Sussan Ley told Sky News, the Coalition's migration policy is not discriminatory.\n\n\n\n\n\n\"Every day that I'm opposition leader, I'm fighting for every single Australian, no matter where you came from, and our Australian Indian community are amazing. You contribute as Australian Indians, so much to our country. We know how hard you work, your family values, and the contribution you make across this country, and as opposition leader, I value that incredibly.\"\n\n\n\n\n\nShe says it is important to note that Senator Price has since corrected her comments.\n\n\n\n\n\nHowever, Senator Price doubled down on the comments, telling reporters in Canberra that she has nothing to apologise for.\n\n\n\n\n\n\"I don't believe I have anything to apologise about. In the context of discussing the marches that took place on the weekend, it was the ABC interviewer who pushed the issue, who brought up the issue of anti-Indian migration. What I was doing was highlighting the fact that there is huge concern for Labor's mass migration agenda; which is applying pressure to housing to infrastructure to services. And then I was further pursued on this line of talking. So what I did was point out the fact that, yes, Indian migrants are the second largest migrant group to this country, and soon to be largest migrant group to this country.\"\n\n\n\n\n\nSenator Price went on to cite a poll from RedBridge, saying that around 85 per cent of those who have Indian ancestry in Australia, voted for Labor in the 2022 federal election.\n\n\n\n\n\nSpeaking to SBS, Redbridge director Kos Samaras says the Coalition has damaged it's chances with the Indian community.\n\n\n\n\n\n\"None of this is going to be good for the Coalition. Well, we have to acknowledge, though, that many Chinese and Indian Australians that arrived in this country, did so under the John Howard policy of skilled migration. This is a pivot, which that government flipped to away from family reunion to skilled migration. And it was certainly on paper, a very clever bit of policy, not only from an economic perspective, because that's where the country was heading in terms of its skilled needs and wants. But also from a cultural perspective, these two communities should have been voting Coalition.\"\n\n\n\n\n\nThe President of the Council of Indian Australians, Shail Wadhwa, told SBS News, the community deserves an apology.\n\n\n\n\n\n\"Having this statement by Senator price is really not helping. Actually, it's making the community more divided. So she should be, I think, showing some facts and figures before making such comments which divide the community further. And I guess, the wider Australian-Indian Community expect she should be apologising to the community.\"\n\n\n\n\n\nHe says the Senator's comments came at a time when the Australian-Indian community are feeling unsafe.\n\n\n\n\n\n\"Having this comment coming very untimely, and is adding the fuel to diaspora. And of course, after speaking to so many people, they started feeling unsafe. And even the day on the rally, lot of people chose to stay home, not to go out.\"\n\n\n\n\n\nAccording to Kos Samaras, the Coalition is not doing itself any favours by alienating migrant communities.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/after-australias-economic-surprise-heres-what-could-happen-to-your-mortgage/pl4mjloqq",
        "title": "After Australia's economic surprise, here's what could happen to your mortgage",
        "publish_date": "Thu, 4 Sep 2025 05:21:05 +0000",
        "category": "finance",
        "authors": [],
        "text": "Australia’s economy is growing faster than expected — a positive sign for the broader economy, but one with potential consequences for mortgage holders.\n\n\n\n\n\nReserve Bank of Australia (RBA) governor Michele Bullock described Wednesday's gross domestic product (GDP) figure as \"positive\" and said \"it's a little stronger than\" the RBA's expectation, adding it might impact the bank's decision on interest rates.\n\n\n\n\n\n\"What it means for the future of interest rates? I don't know at this stage,\" Bullock said during a lecture at the University of Western Australia on Wednesday night.\n\n\n\n\n\n\"It's possible that if it keeps going, then there may not be many interest rate declines left to come, but it all depends.\"\n\n\n\n\n\nAlthough some economists believe recent growth could influence interest rates, others argue that this will not change the RBA's plans.\n\n\n\nREAD MORE What the RBA's interest rate decision means for your mortgage\n\n'Minor surprise'\n\nGDP has increased by 0.6 per cent over the three months to June 2025 and 1.8 per cent compared to the previous year, according to data released by the Australian Bureau of Statistics (ABS) on Wednesday.\n\n\n\n\n\nThe figure was 0.1 per cent more than the forecast, something AMP chief economist Shane Oliver described as a \"minor surprise\".\n\n\n\n\n\n\"If it had come at 0.8 or 0.9, then it would be a lot, a lot more significant,\" he told SBS News.\n\n\n\n\n\n\"I suppose the surprise was mainly on consumer spending. It was certainly more than expected, but it was partly balanced by pretty soft investment numbers in there.\"\n\n\n\nHow could this impact interest rates?\n\nWhile inflation is considered the key factor in the RBA's interest rate decisions, economic growth can also be a factor.\n\n\n\n\n\nOliver said: \"Normally you cut interest rates to help an economy that is weak. Whereas if the economy is stronger than expected, then it may mean less of a case to cut interest rates.\"\n\n\n\n\n\nIn June, when GDP figures indicated that Australia's economy was slowing, there was speculation about potential interest rate cuts; now, the situation has reversed.\n\n\n\n\n\nBut independent economist Saul Eslake said the difference between the forecast and GDP rate is not \"big enough\" for the RBA to \"alter their plans\".\n\n\n\n\n\n\"The choice they had was do they cut rates quickly or gradually, and their view was that there's no reason to cut them quickly,\" he said.\n\n\n\n\n\n\"Yesterday's data will have reinforced their view that there's no urgency about cutting rates. You can still expect a rate cut in November, but there's no reason to expect one at the next meeting at the end of this month.\"\n\n\n\n\n\nEslake predicts there will be two rate cuts in the next six months — one in November and the other in February 2026.\n\n\n\nSource: SBS News In its last meeting in August, the RBA announced a reduction in the cash rate from 3.85 to 3.6 per cent.\n\n\n\n\n\nThe RBA board's remaining meetings this year are scheduled for late September and early November and December. It will announce its interest rate decision after each meeting.\n\n\n\n'Material living standards on rise'\n\nWhile there are concerns about how the growth will impact mortgage holders, GDP growth is generally considered good news for the economy.\n\n\n\n\n\nOliver said: \"When you're seeing decent economic growth, it means that material living standards are probably on the rise.\"\n\n\n\n\n\n\"This doesn't necessarily mean people are happier, but at least their material living standards are on the rise.\n\n\n\n\n\n\"Whereas when growth is weak, then material living standards might deteriorate.\"\n\n\n\n\n\nHowever, Oliver said the growth might \"slide back\", as the factors that impacted the GDP rise may not be present this quarter.\n\n\n\n\n\n\"We had the Easter-Anzac Day holiday, which was a period when many people took off as a holiday, and therefore they went and spent more, and we had the start of the new Nintendo Switch [video game console] ... \" he said.\n\n\n\n\n\n\"All those things artificially boosted growth, and that may not be sustained.\"\n\n\n\nOn the other hand, the ABS data revealed that household spending grew by 0.9 per cent in the June quarter, following a 0.4 per cent increase in the March quarter.\n\n\n\n\n\nThe increase was mainly because of discretionary spending, which rose 1.4 per cent, whereas essential spending increased by 0.5 per cent.\n\n\n\n\n\nEslake said that \"the signs for household consumption spending for the moment are encouraging\".\n\n\n\n\n\nHe said inflation is falling faster than wage growth, and tax cuts that took effect in July and recent interest rate cuts have all impacted this trend.\n\n\n\n\n\n\"There are good reasons to think that all of those three trends are gonna continue for a while,\" he said.\n\n\n\n\n\n\"For the moment at least, there's no reason to think that that won't continue gradually to pick up.\"\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/robodebt-class-action-settles-with-additional-475-million-to-be-paid-by-commonwealth/m2ve4030e",
        "title": "Government to pay further $475m to robodebt victims in class action settlement",
        "publish_date": "Thu, 4 Sep 2025 02:05:47 +0000",
        "category": "finance",
        "authors": [],
        "text": "The federal government has announced it will pay an additional $475 million to victims of the \"disastrous\" robodebt scheme.\n\n\n\n\n\nThe total amount of the deal is now $548.5m, with up to $60m set aside to administer the settlement scheme and up to $13.5m to cover the applicants' reasonable legal costs.\n\n\n\n\n\nThe settlement, which is subject to approval from the Federal Court, is in addition to the more than $1.8 billion payout handed down in 2020.\n\n\n\n\n\nAttorney-General Michelle Rowland said on Thursday that settling the claim shows the government is doing the right thing.\n\n\n\n\n\n\"Today's settlement demonstrates the Albanese Labor government's ongoing commitment to addressing the harms caused to hundreds of thousands of vulnerable Australians by the former Liberal government's disastrous robodebt scheme,\" she said in a statement.\n\n\n\n\n\n\"The royal commission described robodebt as a 'crude and cruel mechanism, neither fair nor legal'. It found that 'people were traumatised on the off chance they might owe money' and that robodebt was 'a costly failure of public administration, in both human and economic terms'.\"\n\n\n\n\n\nThe class action settlement, if approved by the Federal Court, would be the largest in Australia's history.\n\n\n\nBetween 2015 and 2019, the botched debt recovery scheme, set up by the then Coalition government, automatically used tax office data to calculate average earnings and issue debt notices to welfare recipients.\n\n\n\n\n\nRobodebt recovered more than $750 million from almost 400,000 people, but the automated process often failed to accurately reflect people's earnings.\n\n\n\n\n\nMany welfare recipients were falsely accused of owing the government money, and the scheme was linked to several people taking their own lives.\n\n\n\n'Bittersweet' moment for victim\n\nOne of the lead applicants in the robodebt scheme, Felicity Button, has spoken to reporters in Melbourne following the announcement.\n\n\n\n\n\n\"I'm thankful and I am so relieved that it came to this point, but at the same time, there is a bitter sweetness to it thinking of the people that have had irreparable damage happen,\" she said on Thursday.\n\n\n\n\n\n\"People that have lost family members. People that have gone through divorce, become bankrupt. Irreparable mental health issues that have stemmed from this, that will never ... we can never compensate for that.\"\n\n\n\n\n\nLawyer Peter Gordon, who worked on the case, spoke along with Button.\n\n\n\n\n\n\"Today is a day of vindication and validation for hundreds of thousands of Australians afflicted by the Robodebt scandal. Today, they know that their voices have been heard,\" he said.\n\n\n\n\n\n\"Today is also one more vindication of the principle that Australia remains a nation ruled by laws and not by kings — laws which even hold the government accountable.\"\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.theage.com.au/world/asia/where-will-dan-andrews-be-when-the-tanks-roll-20250904-p5msgr.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Where will Dan Andrews be when the tanks roll?",
        "publish_date": "Fri, 05 Sep 2025 11:54:51 +1000",
        "category": "finance",
        "authors": [
            "Cheng Lei"
        ],
        "text": "A photo that says 1000 words. When I worked in Beijing I was once asked if I could help a private entrepreneur get into a group photo with Chinese President Xi Jinping – “doesn’t matter how far back”. I said I couldn’t help.\n\nFormer Victorian premier Dan Andrews, top far right, joins a group photo with Xi Jinping (centre front) and world leaders including Vladimir Putin and Kim Jong-un, before the military parade. Credit: AP\n\nMuch easier if you’re a former Australian state premier at a time of China needing Western endorsement.\n\nOr maybe that was the set-up; Dan Andrews cops flak from the media back home but gets financial reward from his business plus a pat on the back from “big business”, while the Labor government enjoys the fruits of ambivalence. Because to the Chinese, of course, his attendance was tacitly approved by our leadership.\n\nOfficials are seen very differently in China compared to the West. Ours are public servants. There, the public serves them. Photo ops with Xi are worth 1000 times more than snaps with Albo.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/business/the-economy/australia-is-having-the-last-laugh-on-trump-s-trade-beef-20250807-p5ml77.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Australia is having the last laugh on Trump’s trade beef",
        "publish_date": "Fri, 05 Sep 2025 11:45:51 +1000",
        "category": "finance",
        "authors": [
            "Colin Kruger"
        ],
        "text": "It may have been the tail end of summer, but many Americans got badly burnt as they celebrated the Labor Day holiday this week.\n\nDespite Trump claiming via social media that “Prices are ‘WAY DOWN’ in the USA, with virtually no inflation” every American’s hot plate was telling a different story - especially when it comes to their insatiable appetite for beef.\n\nElon Musk, US President Donald Trump, Donald Trump jnr, Mike Johnson and Robert F Kennedy jnr eat McDonald’s aboard Trump’s private plane. Credit: @DonaldJTrumpJr/X\n\nWhile Trump plays King Canute, trying to hold back the inflation tide with nothing more substantial than his social media tirades, beef prices have never been higher.\n\nAs Americans shopped for their Labor Day weekend steaks and burger meat, they were hit with prices that have risen well over 10 per cent over the past year, according to the latest consumer price index data.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/world/asia/what-s-wrong-with-this-photo-the-rule-that-left-women-and-girls-to-die-under-afghan-rubble-20250905-p5mslt.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "What’s wrong with this photo? The rule that left women and girls to die under Afghan rubble",
        "publish_date": "Fri, 05 Sep 2025 11:42:57 +1000",
        "category": "finance",
        "authors": [
            "Fatima Faizi"
        ],
        "text": "Save Log in , register or subscribe to save articles for later. Save articles for later Add articles to your saved list and come back to them any time. Got it Normal text size Larger text size Very large text size The first rescue workers reached Bibi Aysha’s village more than 36 hours after an earthquake devastated settlements across eastern Afghanistan’s mountainous areas on the weekend. But instead of bringing relief, the sight of them heightened her fears; not a single woman was among them. Afghan cultural norms, enforced even in emergencies by the ruling Taliban, forbid physical contact between men and women who are not family members. In the village of Andarluckak, in Kunar province, the emergency team hurriedly carried out wounded men and children, and treated their wounds, said Aysha, 19. But she and other women and adolescent girls – some of them bleeding – were pushed aside, she said. The body of a girl is placed on a bed frame after being pulled from the rubble on Tuesday, In Afghanistan, strict cultural and religious norms mean that only a close male relative – her father, brother, husband or son – is permitted to touch a woman or adolescent girl. Credit: AP “They gathered us in one corner and forgot about us,” she said. No one offered the women help, asked what they needed or even approached them. Tahzeebullah Muhazeb, a male volunteer who travelled to Mazar Dara, also in Kunar province, said that members of the all-male medical team there were hesitant to pull women out from under the rubble of collapsed buildings.\n\nAdvertisement\n\nTrapped and injured women were left under stones, waiting for women from other villages to reach the site and dig them out. “It felt like women were invisible,” said Muhazeb, 33. He added, “The men and children were treated first, but the women were sitting apart, waiting for care.” If no male relative was present, he said, rescue workers dragged dead women out by their clothes so as not to make skin contact. Displaced Afghan women and children gather in Mazar Dara with their belongings on Wednesday. Credit: AP More than 2200 people died and 3600 others were injured in the magnitude 6 quake that flattened countless hamlets and villages, according to figures released by Afghanistan’s government. The response to the quake on Sunday has epitomised the dual standards that women and girls face in Afghanistan, aid groups and humanitarian organisations say, trapped both under the rubble and the weight of gender discrimination. “Women and girls will again bear the brunt of this disaster, so we must ensure their needs are at the heart of the response and recovery,” the special representative for UN Women Afghanistan, Susan Ferguson, said in a statement this week.\n\nAdvertisement\n\nAlthough the Taliban have not released a gender breakdown of the casualties, women have faced an especially harsh ordeal, made worse by neglect and isolation, more than half a dozen doctors, rescue workers and women in areas hit by the quake said in interviews. Afghanistan faces a critical shortage of healthcare workers and, in particular, of women in that field. Last year, the Taliban imposed a ban on women’s enrolment in medical education. The dearth of female doctors and rescue workers has been all too evident in the wake of the earthquake. Injured Afghan men wait to be treated at a hospital in Jalalabad on Tuesday. Credit: AP Women and girls in Afghanistan face some of the world’s most severe restrictions under the Taliban, who took power four years ago and have remained unflinching, even as most of the Muslim world, countless human rights organisations and bodies like the World Bank have warned against the long-lasting effects of such policies on the country’s social fabric and economy. Girls are prohibited from going to school beyond sixth grade. Women cannot travel far without a male companion and are barred from most jobs, including in nonprofits and humanitarian organisations. Afghan women working for UN agencies have faced repeated harassment, culminating in threats so serious this year that the agencies instructed their female employees to temporarily work from home.\n\nAdvertisement\n\nIn Afghanistan, strict cultural and religious norms mean that only a woman’s close male relative – her father, brother, husband or son – is permitted to touch her. The same applies in reverse: Women are not allowed to touch men outside their family. In disaster zones, female rescuers are restricted from assisting men. But a woman can pull unrelated women out from under debris. A New York Times journalist who reached the Mazar Dara area the day after the quake didn’t see any women among the medical, rescue or aid teams treating victims. In one district hospital visited, there were no female staff members. When a trickle of nurses and humanitarian workers began reaching the affected areas by Tuesday, only a few were women. Soldiers followed them and prevented journalists from asking questions or photographing them. A spokesperson for the Taliban-run Ministry of Health acknowledged that there was a lack of female health workers in the quake-ravaged areas. “But in hospitals in Kunar, Nangarhar and Laghman, the largest number of female doctors and nurses are working, especially to treat earthquake victims,” Sharafat Zaman, the spokesperson, said of the worst-hit provinces. Afghanistan is still dealing with aftershocks. On Thursday, one with a magnitude of 5.6 struck.\n\nAdvertisement",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/race-by-race-how-oscar-piastri-can-become-2025-world-champion-20250902-p5mrnk.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Race-by-race: How Oscar Piastri can become 2025 world champion",
        "publish_date": "Fri, 05 Sep 2025 11:40:00 +1000",
        "category": "sports",
        "authors": [
            "Luke Slater"
        ],
        "text": "Save Log in , register or subscribe to save articles for later. Save articles for later Add articles to your saved list and come back to them any time. Got it Normal text size Larger text size Very large text size Championship leader Oscar Piastri is now 34 points ahead of Lando Norris after his teammate’s forced retirement in the closing stages of the Dutch Grand Prix. With a maximum of 249 points on offer to any individual driver in the final nine rounds of the season, Piastri is by no means across the finish line yet. With everything we know from their two seasons together, and what we have learned this year, we take a look at whether Piastri can cruise to victory in the final nine rounds and three sprint races to become the first Australian F1 champion since Alan Jones in 1980, or whether Norris can reel him in. Here’s our race-by-race verdict. Italian Grand Prix\n\nAdvertisement\n\nAs was most often the case in 2024, Norris qualified ahead at Monza last year but not by a great deal. Just over a tenth of a second separated the pair. That is very much as it has been in 2025. The race, though, was where Piastri asserted his authority over Norris. He qualified one spot behind but put a bold move on his teammate at the second chicane on the opening lap, taking the lead. On the day, he lost out to Ferrari’s one-stop strategy, but still finished in front of Norris. The high-speed Monza circuit is a track where pushing too hard can lead to a locked brake and losing time that’s difficult to get back in qualifying. Could Norris’s new all-out attack approach hinder him in Italy? Our verdict: Piastri Azerbaijan Grand Prix Looking at their results from the past two seasons, Azerbaijan is one of only two races where Piastri has an advantage in average finishing position. That is largely thanks to his victory there last year, which was more decisive and impressive than his maiden grand prix win in Hungary.\n\nAdvertisement\n\nOscar Piastri on the podium after winning the 2024 Azerbaijan Grand Prix. Credit: NurPhoto via Getty Images It is difficult to directly compare Norris’s 2024 performance in Baku to Piastri, given a mistake in qualifying, but surely an imperious win there – and a bold overtake – will give the Australian the edge. That said, Norris fought back from 16th on the grid to fourth, and the McLaren car is likely to be strong. Our verdict: Piastri Singapore Grand Prix Whilst it is not universally true, Norris has tended to excel on street circuits. In Singapore last year, his advantage in both qualifying (0.4sec) and the race (first to Piastri’s third) was fairly pronounced, as it was in 2023. Singapore is also a more traditional street circuit, a little closer in style to Monaco, where Norris won in May, than Baku. Given Piastri’s rapid improvement in almost all areas, he should pose more of a threat this year. If Norris can remain error-free in qualifying, then he should go down as favourite at Marina Bay. Our verdict: Norris\n\nAdvertisement\n\nUnited States Grand Prix Norris was clearly ahead of Piastri at the Circuit of the Americas last year, with a gap of 0.6 seconds in qualifying. Piastri did not even make it out of the first part of sprint qualifying either, whilst Norris was fourth. It is difficult to see him putting a gap like that on Piastri in 2025, given the Australian’s progress from last season to this. Still, Norris likes this track, and Piastri has struggled. Advantage Norris. Our verdict: Norris Mexico City Grand Prix\n\nAdvertisement\n\nLooking at results from 2023 and 2024, Mexico City is a track where Norris has the largest advantage statistically. That was primarily because Piastri only qualified 17th last season, whilst Norris qualified third before his controversial tussle with Verstappen. Yet in 2023, Norris qualified in 19th but managed to charge through the field to finish ahead of Piastri, who started seventh. It’s fair to say that something has not quite clicked for the Australian in Mexico. Our verdict: Norris Oscar Piastri at the 2024 Mexican Grand Prix. Credit: Getty Images Brazilian Grand Prix Looking at the form book for Sao Paulo is not the most useful because of how wet and chaotic last year’s event was. Again, the Briton holds the better record during the past two years. In two grand prix and two sprint races, Piastri has only scored 11 points to Norris’s 43 in the same period. Yet, that would have been the case at plenty of tracks throughout 2025, too. Look how that has played out. Let’s not forget that Piastri took the sprint pole and was on course to win before moving over and handing victory to his team-mate.\n\nAdvertisement",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/queensland/brisbane-news-live-tributes-for-young-skier-who-died-at-thredbo-walsh-delivers-broncos-warning-what-to-do-this-weekend-20250904-p5msjg.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Brisbane news live: Tributes for young skier who died at Thredbo | Walsh delivers Broncos’ warning | What to do this weekend",
        "publish_date": "Fri, 05 Sep 2025 11:39:56 +1000",
        "category": "finance",
        "authors": [],
        "text": "Nurses and midwives in public hospitals will be asked to vote on a deal hashed out with the state government, with their union announcing this morning they have given in-principle agreement to the offer.\n\nThe draft agreement, which the Queensland Nurses and Midwives’ Union emailed to its members a week ago, includes a 3 per cent wage increase this year, along with improved overtime rates and a new pay point for registered nurses and midwives.\n\nSarah Beaman (left) said the deal came after months of negotiations and protected industrial action. Credit: Courtney Kruk\n\nThe union spent the last week speaking with members about the draft, and told Health Minister Tim Nicholls this morning they would proceed to a formal ballot.\n\n“We’ve managed to secure a much-improved offer from the government – one that protects our members existing entitlements and secures new conditions, new pay points and increased earnings across the sector,” QNMU secretary Sarah Beaman said.\n\n“There is always work to be done but this is another important step, it is a step that starts to value us, respect us and support ongoing recruitment to our profession.”\n\nQueensland’s state school teachers are also negotiating a new deal, but have delayed any further strike action until next term, while the lowest paid public sector workers this week landed a pay rise of up to 3.5 per cent.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/lifestyle/how-to-answer-the-job-interview-question-everyone-dreads-20250905-p5msom.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "How to answer the job interview question everyone dreads",
        "publish_date": "Fri, 05 Sep 2025 11:39:05 +1000",
        "category": "lifestyle",
        "authors": [],
        "text": "How to answer the job interview question everyone dreads\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/tennis/pegula-snatches-first-set-from-champion-20250905-p5msol.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Pegula snatches first set from champion",
        "publish_date": "Fri, 05 Sep 2025 11:32:00 +1000",
        "category": "sports",
        "authors": [],
        "text": "Pegula snatches first set from champion\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/victoria/erin-patterson-s-plea-for-mercy-runs-aground-on-a-simple-truth-she-has-no-remorse-20250902-p5mrt6.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Erin Patterson’s plea for mercy runs aground on a simple truth: she has no remorse",
        "publish_date": "Fri, 05 Sep 2025 11:30:00 +1000",
        "category": "finance",
        "authors": [
            "John Silvester"
        ],
        "text": "Heather Wilkinson, along with Don and Gail Patterson, could not tell their stories as they died terrible deaths in this monstrous plot. When it became Patterson’s defence team’s turn, it was clear their egg and spoon would be no match for the sword of justice. In a normal plea, the offender’s lawyers usually call character witnesses to say sure, their client may be a homicidal maniac, but they care for rescue dogs, donate to charity and buy cookies from Girl Guide fundraisers. They then produce a psychiatry report to say their client had a terrible childhood, was brought up by wolves in the jungle and got hit in the head by lightning when they were five. But Patterson’s lawyers couldn’t do that as Erin maintains she is innocent and the victim of such a monstrous injustice not seen since the witch trials in Salem.\n\nOne tactic the defence could have explored would have been to say that while Patterson maintained her innocence, she was prepared to waive an appeal so that her surviving family, including her children, could get on with their lives. That might have got her a three to five-year discount. But that is not in Patterson’s DNA. She is the victim. She asked to have her trial at Morwell then whinged and whined about her cell conditions, no doubt writing a stinging review on Tripadvisor. Erin Patterson arrives at court for her plea hearing. It did not go well. Credit: POOL With yet another complaint, she told a custody officer: “You don’t know what it is like to suffer.” Everything is relative. Being painfully and deliberately poisoned so that your vital organs shut down is suffering. Not having a fluffy pillow in your watchhouse bunk is more an inconvenience.\n\nWhile she says she is the biggest patsy since Lee Harvey Oswald, her senior barrister, Colin Mandy, SC, took a more sensible route. “This is very grave offending, and we make no argument that the sentence should be anything other than life imprisonment, but the issue is whether there should be a non-parole period,” he told Beale. Patterson is aged 50 and has already served nearly two years. Mandy wants the judge to set a minimum of 30 years so she could be out when aged about 80. Mandy must surely acknowledge this submission is ambitious. Barrister Colin Mandy, SC, outside court with Erin Patterson’s legal team of Sophie Stafford (left) and Ophelia Hollway. Credit: Jason South In fact, the plea backfired. Out of the blue her team said Patterson was suffering from autism. It would appear to be another Erin self-diagnosis as she didn’t provide a medical diagnosis or even a sick note from a teacher.\n\nOf course, we remember that she used a fake cancer diagnosis to lure her victims to the deadly beef Wellington lunch and so another piece of medical trickery is unlikely to endear her to the judge. To make the point, prosecutor Jane Warren said in court: “The evidence just isn’t there.” Beale responded, “She doesn’t have a lot of credibility ... you’re pushing on an open door.” More appropriately he could have said she has stepped onto a trapdoor. The judge said he had read 28 victim impact statements, affecting four generations of the families, describing it as a tsunami.\n\nProsecutor Warren came off the long run wanting the judge to throw away the key. “It is a crime that is so cruel and so horrific that, in our submission, the offender is not deserving of this court’s mercy.” Mandy played his strongest cards. Patterson will do jail hard. She will have to be in protection for years, which is solitary confinement. She can chat to her neighbour through some mesh but as that neighbour is a committed, barking-mad terrorist, the dialogue will hardly be witty. Patterson will not see her children grow up and has ruined her life. But she finished three lives and damaged many more. Former husband Simon Patterson told the court how he and his children had been stalked by the media and how they were made to feel as if they were the prize targets in a massive story not of their making.\n\nBeale has listened and acted. After a plea hearing, a judge usually takes months to write their sentencing remarks. In this case, he has broken speed records to be back in court on Monday. Loading He wants this off the books, not for his sake but the sake of the victims in the hope that the searing light of publicity dims – at least temporarily. Contrary to the view that sentencing judges can be soft or tough, they really have to stay within the lanes with sentencing guidelines and a nod to previous cases. And contrary to public perception, sentencing, at least at the serious end, has become tougher.\n\nIn 1987, Julian Knight murdered seven people and wounded 19 in a mass shooting in Hoddle Street. He received life with a minimum of 27 years. That is about four years per killing with no punishment for the wounding. Loading More astonishing was the fact the prosecutor said there should be a minimum sentence. Decades later, the government stepped in to ban him from parole. Back then, we in the media would get it wrong. The headline would be the main sentence not the minimum that was the real sentence.\n\nOnce inside, an offender would get a further discount for good behaviour. So a murderer who was sentenced to life with a minimum of 21 years would probably serve only 14 and with a few cunning tricks, serve even fewer. Beale has a balancing act. Life with no minimum would likely lead to an appeal on sentence, dragging the case out for another year. If the judge shows mercy, it will not be for Patterson but for the survivors who want this circus ended. If she gets a minimum and appeals, the prosecution could again ask for life potentially extinguishing any chance she will be freed. One case he may look at is that of Ashley Mervyn Coulston who in 1992 went to a house in Burwood to answer an ad for a tenant. He tied up the three people in the house, Kerryn Henstridge, 22, Anne Smerdon, 22, and Peter Dempsey, 27, and executed them.\n\nNo motive was ever established. After trials and retrials, he was finally sentenced to life with Justice Norman O’Bryan saying: “You have forfeited forever your entitlement to live outside the confines of a prison.” Beale will consider how tough Patterson’s jail time will be. But it is hard to think of a worse crime. Loading She researched methods of murder for months, perhaps years. She decided death cap mushrooms would be the best poison, went out and foraged for the right ones then plotted the crime she believed could be written off as a horrible accident. Although her prime target was ex-husband Simon, she proceeded with the deadly lunch in the hope he would change his mind. When he didn’t, she prepared the deadly beef Wellingtons, served them to her four guests then prayed with them.\n\nShe made small talk watching as they took bite after bite, then watched as Don finished his wife’s leftovers. A hot lunch from the coldest of killers. As soon as they were gone, she headed to the local tip to dump evidence, faked similar symptoms when her guests fell ill, concealed evidence, lied, used her kids as alibi witnesses, and has not once, not ever, shown the slightest sign of remorse. The judge will also know she will not re-offend. No one in their right mind would eat anything she served up after she serves her time. Beale would be well within the law to sentence her to life with no minimum, but if he sets a non-parole period, it will be close to 40 years. The defence would like her eligible for release by the time she is 80. It will be closer to 90, if at all.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/culture/music/live-music-is-struggling-but-for-one-genre-things-have-never-been-better-20250903-p5ms8g.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Live music is struggling. But for one genre, things have never been better",
        "publish_date": "Fri, 05 Sep 2025 11:30:00 +1000",
        "category": "finance",
        "authors": [
            "Karl Quinn"
        ],
        "text": "Save Log in , register or subscribe to save articles for later. Save articles for later Add articles to your saved list and come back to them any time. Got it Normal text size Larger text size Very large text size There are two types of music, the old joke goes – country and western – and in Australia right now, they’re both riding high. While the last couple of years have seen the live music and festival sector generally struggle, country (the western has long since been put out to pasture) has been experiencing an unprecedented surge in popularity. “Country music isn’t just growing,” says Kevin Azzopardi, marketing director of ticket reseller Tixel, which has just released its fourth annual State of Play report into the health of the live music sector in Australia. “It’s booming at the moment.” Tixel’s survey, produced in collaboration with marketing consultancy Bolster, draws on a survey of more than 2700 music fans (not just Tixel customers), as well as industry research and interviews with promoters, managers, and senior label and festival personnel. Young listeners, such as this group of fans at Honky Tonks in Brisbane’s Fortitude Valley, are tuning in to country music like never before. Credit: Markus Ravik And while the overall picture is of a live music industry slowly regaining its footing after a tough few years marked by pandemic shutdowns, cost-of-living pressures, and changing consumer behaviour, in the formerly niche area of country music, everything is coming up roses. Country music fans attend more live events, and spend more at those events – on food, drink, transport and merchandise – than fans of other genres. And there’s more of them than ever before.\n\nAdvertisement\n\nLoading “They spend 57 per cent more than regular consumers,” says Azzopardi. “And country music attendance has jumped 54 per cent since 2023. We’re seeing country grow in all areas. We’re seeing it take over socials … there’s country core, this fashion trend that’s emerging, as well. And so I think there’s a whole cultural phenomenon at the moment around country.” Though as a genre it sits well behind the biggest categories – pop at 59 per cent of respondents leads the way, with rock (49 per cent) and EDM/electronic (almost 45 per cent) close behind – country was up from 9 per cent in 2023-24 to 14 per cent in 2024-25. And much of the growth is coming from young people in the capital cities. Bella Bown, a 26-year-old office worker from Bayswater in Melbourne’s outer eastern suburbs, is one such fan. In her early 20s, she says, her taste in music leaned towards house or the kind of pop she heard on commercial radio. Melbourne’s Bella Bown is among a new generation of country music fans. Credit: Wayne Taylor “My brother was a huge fan of country, but I used to say, ‘Why do you listen to that?’” she says. “And then, four or five years ago, I don’t know, something changed.” And what was it about country that hooked her? “It makes you happy when you’re sad,” she says. “And it makes you feel a part of something.”\n\nAdvertisement\n\nBown’s first big concert was Luke Combs in August 2023. “We were in the mosh pit,” she recalls, “and the vibe just made me fall more in love with country music.” American Combs, who has almost 26 million monthly listeners on Spotify and had three albums in last year’s ARIA top 100 chart, is both contributor to and barometer of the growth of country music in Australia. When he first toured in 2018, he played The Forum in Melbourne and the Enmore in Sydney, in front of a couple of thousand people. By 2023, he was playing Rod Laver in Melbourne (capacity around 14,000) and QUDOS in Sydney (21,000). Last year, he was packing venues three or four times that size. Luke Combs is leading the country crossover into the mainstream. Credit: Wolter Peeters “[A few years ago] you were struggling to fill smaller arenas [with international country artists],” says Dobe Newton, long-standing member of The Bushwhackers and current chair of the Country Music Association of Australia. “And then all of a sudden, here’s Luke Combs, the first country artist to not only headline stadiums, but actually sell them out. You know, 320,000 people over six concerts.” Loading In July, the CMAA released its latest census (the last was in 2019). And the story it told was remarkable.\n\nAdvertisement\n\nIn 2024-25, country music generated revenue of $1.11 billion, a 79 per cent increase on the $619 million reported in 2019. Around half of that spend ($587 million) was from ticket sales. The report claimed 3.26 million people attended country music shows across the year. Crucially, there was no Taylor Swift bump in those numbers, because while country music as a genre is a remarkably broad church, Tay-Tay has excommunicated herself. “She went to enormous trouble to remove the country signature banjos and fiddles from early recordings,” says Newton, referring to her re-recording of her back catalogue under the “Taylor’s Version” rubric. Taylor Swift has worked hard to distance herself from her country music origins. Credit: Invision “That’s her decision, and I think most people would recognise that she’s not regarding herself – and therefore most people don’t regard her – as a country artist. Though now she’s seen the uptick in country, she may produce new versions of those albums with the banjos back in. It would certainly make the next census look pretty damn good.” As country music talent and branding director at Frontier Touring, where she works across the CMC Rocks and Ridin’ Hearts country music festivals, Georgie Luxton has witnessed the explosion in popularity up close. “There is definitely a new generation of fan,” Luxton says. “I think social media, and especially TikTok, has helped expand people’s view of what country is, the whole breadth of country artists. That platform has really helped give recognition to the genre.”\n\nAdvertisement\n\nWhen the city-based single-day festival Ridin’ Hearts was launched three years ago, it drew around 3000 people in Melbourne and 4000 in Sydney. This year, they expect to sell between 8000 and 9000 tickets in each city. CMC Rocks – which turns 20 in 2027 – will have about 25,000 people onsite in Willowbank in Queensland on each of its three days next March. “There’s just so many artists coming out at the moment,” Luxton says. “Three or four years ago, we would maybe have been doing like five country tours. Next year, it’s like five festivals, plus at least, I would say, 15 country tours coming through.” Loading The mainstreaming of country owes something to its uptake by some of the world’s biggest pop stars. “You’ve got Beyonce crossing genres [with her Cowboy Carter album], you’ve got Chappell Roan releasing country singles, you’ve got Post Malone doing collaborations with Taylor Swift,” notes Azzopardi. But country is taking hold at a grassroots level too – with rodeos, line-dancing classes and country-themed club nights spreading like wildfire. There’s even been the emergence of a cosmic-country/ambient Americana strand in electronic music. “It really has exploded,” says Luxton. But for every inner-city hipster lining up for a boot-scooting session in Melbourne’s Brunswick or dropping an ironic yee-har at Jolene’s in the Sydney CBD, there are those who prefer to take their country straight, no chaser. Country music fan Ash Thorpe: “When you come down to it, it’s three chords and the truth.” Credit: Louise Kennerley\n\nAdvertisement",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/nrl/nrl-around-the-clubs-round-27-20250831-p5mr9y.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "History repeats as Asofa-Solomona faces critical finals ban again",
        "publish_date": "Fri, 05 Sep 2025 11:29:39 +1000",
        "category": "sports",
        "authors": [
            "Dan Walsh",
            "Adrian Proszenko",
            "Christian Nicolussi",
            "Michael Chammas"
        ],
        "text": "Asofa-Solomona is on Melbourne’s books until the end of 2028 on a lucrative deal that makes him their highest-paid forward aside from captain Harry Grant. Privately, the club has indicated that it would not stand in Asofa-Solomona’s way if Rugby360 gets off the ground and he pursues a return to the code he played as a junior in New Zealand. Meanwhile, Hughes’ is considered unlikely to play again this year. The Dally M medallist’s return from a six-week shoulder lay-off lasted just 25 minutes when his arm was caught awkwardly in an attempted tackle on Brendan Piakura. Utility Tyran Wishart and promising playmaker Jonah Pezet loom as the Storm’s replacement options once again. NFL hopeful who blew Viking horn in Vegas sacked and suspended\n\nThe NFL wannabe who was kicked out of Allegiant Stadium shortly after blowing the Viking horn has been cut by the Las Vegas Raiders and suspended for two games. Tyler Manoa, a 25-year-old defensive tackle, was given the honour of blowing a custom-made horn that was constructed solely for the purposes of marking Canberra’s debut in the United States in the opening round of the season. Tyler Manoa may have jeopardised his NFL career moments after blowing the Viking horn. Credit: Fox Sports Canberra had reached out to a number of celebrities - including Dana White, Tom Brady, Rob Gronkowski and Las Vegas Raiders head coach Pete Carroll - in the hope they would be available. When they all declined, Manoa - who is yet to make his run-on NFL debut - was enlisted for the job. Shortly after blowing the horn, Manoa was ejected from the stadium for misbehaviour in the corporate area. Then a member of the Las Vegas Raiders’ practice squad, it’s alleged Manoa damaged property inside the restrooms, with some reports suggesting he was also tasered.\n\nManoa was scheduled to make a guest appearance in the Canberra sheds after their win against the New Zealand Warriors, but was a no-show. With the NFL season just a month away, the Raiders have cut Manoa, making him a free agent. However, it’s been reported that he will cop a two-game NFL suspension, said to be linked to the Allegiant Stadium incident, that could be a turn-off for prospective employers.The NFL announced on Sunday (AEST) that Manoa had been suspended due to “conduct detrimental to the league”. Canberra’s stellar performance in Las Vegas has been the springboard to a dominant season in which they claimed their first minor premiership since 1990. To’o, Kernick crowned Blues’ winners Christian Nicolussi\n\nBrian To’o has clinched the Brad Fittler Medal for a second time with Olivia Kernick crowned the Origin Player of the Series Award on Monday night. To’o scored five tries in three games on the left wing for the Blues, including a hat-trick in Perth, but was still unable to help the Blues avoid a humiliating series-decider loss in Sydney. Olivia Kernick and Brian To’o were the big winners at the Brad Fittler Medal on Monday night. Credit: Gregg Porteous/NRL Images The 27-year-old To’o will now turn his sights to winning a fifth straight title with the Panthers, and is expected to be part of the returning star cavalry for Saturday’s trip to Wollongong against the Dragons. Fittler himself let slip on stage how, “I just asked Brian and he said he’s not playing”, but To’o said it was news to him, and was hopeful to be included on the team sheet on Tuesday. The Panthers rested a whopping 16 players against the Bulldogs last week.\n\n“It was a bit of a shock to us, we weren’t expecting that at all,” said To’o, of the mass withdrawals. “Our commander-in-chief [coach Ivan Cleary] has a plan for everything, and we definitely trust him. I got to spend some quality time with the family and had that little recharge, and now I’m ready to go. “I’m a big believer everything happens for a reason. Time will tell if we can [go all the way again].” To’o was joined at The Star by wife Moesha who is 30 weeks pregnant with their second child, a girl, who is due in November “after the Samoan Tests”. “There are so many people to thank for this award, including my wife whose back is sore, it’s aching, yet she still manages to come here tonight and supports me,” To’o said.\n\nCoach Laurie Daley, who was struggling with his voice on stage, said it was disappointing to “not get the result we deserved” in what was his first series back in charge since 2017. “But sometimes it takes a setback like that to put you on the right path,” Daley said. Isaah Yeo, Lindsay Smith, Stephen Crichton and Lindsay Smith were among the other Blues to attend the event that honours the achievements of players and participants across all competitions around the state. 2025 Brad Fittler Medal winners Brad Fittler Medal: Brian To’o (Penrith Panthers) True Blue Award: Payne Haas (Brisbane Broncos) The Daily Telegraph People’s Choice Award: Brian To’o (Penrith Panthers), Olivia Kernick (Sydney Roosters) NSW Blues Women’s State of Origin Player of the Year: Olivia Kernick (Sydney Roosters) NSW Blues Women’s Award: Abbi Church (Parramatta Eels) NSW Under 19s State of Origin Player of the Match: Jacob Halangahu (St George Illawarra Dragons) NSW Under 19s Women’s State of Origin Player of the Match: Tess McWilliams (Parramatta Eels) The Knock-On Effect NSW Cup Player of the Year: Kalani Going (Warriors) Harvey Norman NSW Women’s Premiership Player of the Year: Monique Donovan (Cronulla-Sutherland Sharks) Jersey Flegg Cup Player of the Year: Preston Conn (Melbourne Storm) Leagues Clubs Australia Ron Massey Cup Player of the Year: Joseph Nohra (Wentworthville Magpies), Taniela Lasalo (Hills Bulls) Sydney Shield Player of the Year: Tallis Brown (Moorebank Rams) Angus Crichton won last year’s Brad Fittler Medal, with To’o taking home the silverware in 2023.\n\nTo’o has 11 Origin tries, the same amount as Blues’ record-holders Josh Addo-Carr and Michael O’Connor. Payne Haas, the only other Blues player who would have gone close to taking out the top gong, picked up the people’s choice award. Roosters star Kernick was crowned best womens’ player, while first-year Blues fullback Abbi Church collected the NSW Blues Women’s Award. Kernick took to the stage earlier in the night to accept the country championships’ player of the year prize for her brother, Jacob, “who can’t be here because he’s on Mad Monday”. Latrell unlikely for Roosters grudge match\n\nMichael Chammas South Sydney superstar Latrell Mitchell is unlikely to be available for Friday night’s grudge match against his old club, the Sydney Roosters, with a neck and back injury. In a huge boost for the Sydney Roosters’ chances of qualifying for the finals, Mitchell is considered “unlikely” to play for the Bunnies in their final game of 2025. Latrell Mitchell is unlikely to play for South Sydney this week. Credit: Getty Images Mitchell missed the Rabbitohs’ 40-0 win against the Dragons in round 25, but it was expected he would return following last week’s bye.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/eagles-star-ejected-for-spitting-20250905-p5msog.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Eagles star ejected for spitting",
        "publish_date": "Fri, 05 Sep 2025 11:21:44 +1000",
        "category": "finance",
        "authors": [],
        "text": "Eagles star ejected for spitting\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/lifestyle/life-and-relationships/there-s-something-comedic-about-the-grandad-child-swap-case-but-it-hurts-my-heart-20250904-p5msip.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "There’s something comedic about the grandad child-swap case, but it hurts my heart",
        "publish_date": "Fri, 05 Sep 2025 11:20:00 +1000",
        "category": "lifestyle",
        "authors": [
            "Kate Halfpenny"
        ],
        "text": "In 1975 our parents went to Europe for six weeks so our nans moved into the Glen Waverley casa to look after us four kids and the dog. Cool, right? What’s the worst that can happen when nans run the show?\n\nNeita, mum’s mum, did the housekeeping. And did it on her ear. She was a fantastic cook who’d make ginger creams in five minutes. To this day, I miss her cheese omelettes.\n\nGrandparents are increasingly being called upon to help out with their children’s kids. Credit: Sean Davey\n\nBeatrice was transport chief. She’d only had her driver’s licence for a couple of years since Grandad died, but — aided by Bex powders — gamely squashed us all into her Cortina with the 007 number plates for school runs and grocery shopping.\n\nAll good. Until one day Beat fanged it into the garage and out the brick wall at the end, like a slow-mo cartoon scene. Clipping Dad’s silver Ford GT on the way. Watching, my sister and I were delighted and alarmed in equal measure.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/business/markets/asx-set-to-jump-as-wall-street-rises-on-rate-cut-hopes-20250905-p5msl2.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Banks jump again to drive ASX higher",
        "publish_date": "Fri, 05 Sep 2025 11:15:27 +1000",
        "category": "finance",
        "authors": [
            "Staff Reporter"
        ],
        "text": "The Australian sharemarket has made a bright start to the session on the back of a strong lead from Wall Street, with the big four banks again driving gains.\n\nThe S&P/ASX 200 was up 41.7 points, or 0.5 per cent, to 8868.2 at 11.12am AEST, with seven of its 11 industry sectors in positive territory, led by consumer stocks and financials.\n\nWal Street is eagerly awaiting the next jobs report. Credit: Bloomberg\n\nFinancial stocks were stronger, with the big four banks bouncing higher. NAB jumped 1.5 per cent, Westpac rose 1.1 per cent, ANZ gained 0.9 per cent and Commonwealth Bank was 0.6 per cent higher in early trade.\n\nQantas shares are 1.5 per cent higher. The airline’s former chief executive Alan Joyce has had his final windfall from the company, with his last long-term share bonus vesting, resulting in him pocketing a further $3.8 million worth of shares. Meanwhile, his successor Vanessa Hudson’s pay jumped 44 per cent to $6.3 million, according to the airline’s annual report filed with the ASX.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/nrl/why-cameron-munster-is-wary-of-mercurial-walsh-20250905-p5mskw.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Why Cameron Munster is wary of mercurial Walsh",
        "publish_date": "Fri, 05 Sep 2025 11:15:14 +1000",
        "category": "sports",
        "authors": [
            "Nick Wright"
        ],
        "text": "Queensland Maroons skipper Cameron Munster has achieved everything rugby league has to offer, but even he is on edge for what Reece Walsh could produce once the NRL finals launch.\n\nThe Brisbane Broncos’ fullback produced what his halfback Ben Hunt defined as “his most controlled game for a while” to orchestrate a 30-14 boilover of Melbourne on Thursday night, all but sealing their place in the top four.\n\nMunster was forced to watch as Walsh triggered everything: scoring twice – his second coming straight after his own 40/20 – and setting up another in a career-best 22 point haul.\n\nOn and off the field, Walsh is never far from a headline. His now infamous social media video drinking from a toilet appeared an unnecessary distraction in the lead up to the crucial clash, while he has been both lauded and criticised for his audacious play.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/goodfood/recipes/adam-liaw-s-30-best-spring-recipes-of-all-time-20250903-p5ms1t.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Adam Liaw’s 30 best spring recipes of all time",
        "publish_date": "Fri, 05 Sep 2025 11:15:05 +1000",
        "category": "finance",
        "authors": [
            "Adam Liaw"
        ],
        "text": "Recipe collection\n\nAdam Liaw’s 30 best spring recipes of all time\n\nGet ready to shed your winter layers and dive into Adam Liaw’s most vibrant new-season recipes, starring everything from zesty lemon lamb cutlets to a show-stopping two-metre banh mi.",
        "source": "TheAge"
    },
    {
        "url": "https://au.news.yahoo.com/reason-640-flood-grants-rejected-014317666.html",
        "title": "Reason 640 flood grants rejected",
        "publish_date": "2025-09-05T01:43:17Z",
        "category": "finance",
        "authors": [
            "Nathan Schmidt"
        ],
        "text": "Almost half of claims for small business grants in areas impacted by the NSW Mid-North Coast floods have been knocked back,\n\nAlmost half of claims for small business grants in areas impacted by the NSW Mid North Coast floods have been knocked back as the minister responsible admits it can be “painful” for business owners to apply for funding.\n\nAs of September 3, 1435 claims had been made for a Small Business Recovery Grant, a budget estimates hearing was told on Friday, of which some 412 had been approved, 383 were still being processed, and 640 had been rejected.\n\nRecovery Minister Janelle Saffin said claims were rejected because they were for lost income or had not met the criteria and admitted it was “a bit painful” for business to fill out an application.\n\n“It’s not that hard,” Ms Saffin told the hearing.\n\nADVERTISEMENT\n\n“But, I understand when people are trying to rebuild a business and do all the things that they have to do, doing more paperwork can be a bit painful, I get that.\n\nRecovery Minister Janelle Saffin said claims were rejected because they were for were lost income or had not met the criteria. Picture: NewsWire / John Appleyard\n\n“But, the reality is, from 2022 we’ve had Auditor-General reports about these programs, and there was a lot of looseness in the programs … and they did have to be tightened up after that.”\n\nMs Saffin said she wanted anyone who applied for a recovery grant to “get it as quick as I can possibly get it”, but not all applicants had the required information and were required to “go back and do it again”.\n\nAsked about the wrapping up of Recovery Co-ordinator for the Hunter and Mid North Coast Dave Owens after 103 days in the role, Ms Saffin said “it was time-limited”.\n\n“Recovery co-ordinators come in for a certain amount of time to be on the ground, the eyes and ears,” Ms Saffin said.\n\nADVERTISEMENT\n\n“It was only to be three months, and I think it might be extended by a couple of weeks.\n\n“It’s not their role to actually clean it up, it’s his role to be there to make sure it happens”.\n\nMs Saffin admitted the recovery was “long and complex”, but “we’re not going to have the recovery co-ordinator there forever”.\n\nThe state government has faced pressure over its handling of grants after the NSW Mid North Coast floods. Picture: NewsWire Handout/ Transport NSW\n\nThe hearing was told the recovery co-ordinator role was “not gone” and instead had transitioned over to an employee of the reconstruction authority.\n\nMr Owens was appointed recovery co-ordinator on May 29 but quietly wrapped up his role on Tuesday, according to The Daily Telegraph.\n\nNSW Nationals leader Dugald Saunders said the scaling back of the recovery co-ordinator role only added “insult to injury”, with work left to do.\n\nHe claimed businesses were “wondering how and why they should keep going after waiting for over three months and clearly being let down”.\n\nADVERTISEMENT\n\n“You just can’t expect people to hang by a thread for that amount of time and it once again feels like our regional communities are being punished,” he said.\n\nNationals Myall Lakes MP Tanya Thompson said decisions about funding “make or break people’s lives”.\n\n“The stroke of a pen is affecting whether people can open their doors or shut up shop forever,” she said.",
        "source": "Yahoo"
    }
]