[
    {
        "url": "https://www.9news.com.au/national/hecs-debt-reduction-how-it-will-change-your-pay-from-july-this-year/763cad42-a590-424e-b7f0-a4920cecb367",
        "title": "'This is now going to happen': Millions of Aussies will have their debt slashed soon",
        "publish_date": "Thu, 31 Jul 2025 02:09:48 +0000",
        "category": "finance",
        "authors": [
            "Jul"
        ],
        "text": "The federal government's promised legislation to slash HECS debts by 20 per cent has now passed in the Senate.﻿\n\nLabor introduced the student debt cuts as a first order of business when parliament resumed this month and it passed today 36 votes to three.\n\nThree million Australians are set to benefit from the bill, with $5,520 wiped from the average debt of $27,600.\n\nAround $5,520 will be wiped from the average debt of $27,600. (iStock)\n\nSo when exactly will HECS balances be slashed?\n\nEducation Minister Jason Clare said it may take \"a bit of time\" for Australians with a HECS debt to see the difference in their balance.\n\n﻿\"The next step is for the tax office to do the work they need to do. Now that the bill has passed, they've got the certainty they need to make the changes to their systems to pass this on to three million Australians,\" Clare said.\n\n\"That will take a bit of time. They've got to write about 50,000 lines of code to implement this and make sure that they get it right.\n\n\"But this is now going to happen. It's guaranteed. And it will be backdated to 1 June this year, before indexation happened.\"\n\nREAD MORE: New breakthrough in fight against HIV after vaccine trials gives positive results\n\nMinister for Education Jason Clare said the changes will \"take a bit of time\". (Alex Ellinghausen)\n\n﻿The bill will also raise the minimum threshold from $54,435 to $67,000 and reduce minimum repayments.\n\nIt wi﻿ll mean someone earning $70,000 will pay back $1300 less per year.\n\n\"Getting an education shouldn't mean a lifetime of debt,\" Prime Minister Anthony Albanese said today.\n\n\"No matter where you live or how much your parents earn, my government will work to ensure the doors of opportunity are open for you.\"\n\nIn a short video posted on X last week, Albanese said the legislation would be introduced to parliament as a matter of priority. .﻿\n\n\"We said it would be the first thing that we do and today we're making it happen,\" he said.\n\n\"We're introducing our legislation to cut your student debt by 20 per cent. No application, no forms, just real help with your student debt.﻿\"\n\nThis will impact your student debt balance if you have one and, eventually, your pay.\n\nREAD MORE: Millions of Sydney commuters ride free as gates turned off ﻿\n\nMore than three million Australians are expected to have their student debt cut by 20 per cent next month. (9News)\n\nNow the legislation has passed, the Australian Tax Office (ATO) will apply the 20 per cent reduction and it will be calculated on what that person's debt was as of June 1, 2025.\n\n\"It'll take a lot of weight off the shoulders of a lot of young Australians who are just out of uni … looking to move out of home or save up to get a mortgage,\" Clare said last week.\n\n\"You don't start paying off your university degree until your degree starts to pay off for you.\"\n\nHow will it all work?﻿\n\n\"The ATO will automatically apply the 20 per cent reduction to your outstanding debt and retrospectively adjust any indexation applied to your debt,\" CPA Australia's business lead Gavan Ord told 9news.com.au.\n\n\"No action is required from individuals. The government will notify you when the changes are implemented, and balances can be checked via myGov.\"\n\nThis reduction will be applied on top of any repayments made throughout the year after your tax return is completed.\n\nOrd said Australians﻿ should avoid listening to financial advice from online influencers about how to optimise their tax returns.\n\nAustralians﻿ should avoid listening to financial advice from online influencers about how to optimise their tax returns, an expert says. (Dominic Lorrimer)\n\n\"We urge Aussies not to follow misleading advice from social media 'finfluencers' suggesting you delay lodging your tax return,\" he said.\n\n\"Lodging your return is a legal responsibility and essential for accurate assessment.\"\n\nWhat happens if my HECS debt is finally paid off?\n\nCompulsory ﻿HECS repayments aren't allocated to your debt until after you have lodged your tax return.\n\nAfter this, it might mean your debt has reached the all-important zero balance.﻿\n\nIt means yo﻿u will no longer see the compulsory repayments taken out of your weekly, fortnightly or monthly pay.﻿\n\nYou'll need to let your employer know about this though, as it won't automatically stop.\n\nIt involves filling out a tax form ﻿called a \"withholding declaration\", which indicates to your employer that you no longer have a HECS debt.\n\nIt's as simple as ticking the box ﻿\"no\" on the form when it asks if you have a higher Education Loan Program (HELP), VET Student Loan (VSL), Financial Supplement (FS), Student Start-up Loan (SSL) or an Australian Apprenticeship Support Loan (AASL) debt.\n\nOnce your employer stops withholding extra tax, your next paycheck may slightly increase.\n\nCompulsory ﻿HECS repayments aren't allocated to your debt until after you have lodged your tax return. (Getty Images/iStockphoto)\n\nThis amount will vary depending on your salary and what your regular contributions were.﻿\n\nYou have to be earning above the threshold for it to impact﻿ your pay.\n\n﻿Australian taxpayers earning between $54,435 and $62,850 pay one per cent on their income and the figure rises the more you earn.\n\n\"Another proposed change to HECS is raising the income threshold at which people are required to start repaying their debt from $54,435 to $67,000, starting 1 July 2025, subject to the law being changed,\" Ord added.\n\n\"This means that if you earn less than $67,000, you won't need to make repayments, although voluntary repayments remain an option.\n\n\"This change also means your repayments will be lower.\"\n\nIf you've overpaid your HECS debt throughout the previous financial year, the ATO will take this into account and it will be refunded to you when you lodge your tax return.﻿",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/gold-coast-tye-alroe-death-tributes/60cb7223-5328-4843-8f5d-9344a6a4ff9e",
        "title": "Tributes for 'pioneer' property developer after sudden death",
        "publish_date": "Thu, 31 Jul 2025 00:41:39 +0000",
        "category": "sports",
        "authors": [
            "Jul"
        ],
        "text": "Gold Coast property developer Tye Alroe has died suddenly at the age of 39.\n\nThe founder and CEO of Alroe Constructions suffered a heart attack while exercising at a Burleigh Heads gym on Tuesday afternoon.\n\nHe collapsed after feeling unwell, and despite being attended to by emergency service workers, he was unable to be revived.\n\nMany have paid tribute to Tye Alroe after his death at the age of 39. (Alroe)\n\nAlroe initially embarked on a career in rugby league, being contracted by NRL side Melbourne Storm, but he left before making his debut and entered the construction industry instead.\n\nHe founded a company called Alroe in 2012, and the company currently has $250 million worth of projects underway or in planning, according to its website.\n\nAlroe specialised in projects in south-east Queensland and northern New South Wales.\n\nSeveral figures within the Gold Coast construction industry paid tribute to Alroe after his death.\n\nREAD MORE: New breakthrough in fight against HIV after vaccine trials gives positive results\n\n\"The loss of a pioneer, someone that never quits, never takes no as an answer! You will never be forgotten,\" said an Instagram post from Capra Build Co.\n\n\"Unfortunately we have lost one of the better people in this world,\" began an Instagram post by Callum Smith of Bluewater Interiors.\n\n\"I'm sure you will be missed by many. You have made a positive impact on so many people and will no doubt be remembered.\"\n\nAlroe is survived by his partner Nikki, daughter Poppy, his mum and dad, Vicki and John, and his sister Courtney.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/health/hiv-vaccine-study-united-states-health/ce8d576e-5b59-48b0-bc26-6afd08b3263d",
        "title": "New breakthrough in quest for HIV vaccine",
        "publish_date": "Wed, 30 Jul 2025 19:21:37 +0000",
        "category": "lifestyle",
        "authors": [
            "Jul"
        ],
        "text": "A new type of vaccine could hold the key to finding a cure for HIV, a new study shows.﻿\n\nThere is currently no cure for HIV, but researchers in the USA believe mRNA can bypass common obstacles in the creation of a vaccine for the disease.\n\nHIV impacts nearly 41 million people globally and over 30,000 people in Australia.\n\nAn mRNA-based vaccine for HIV could help in the fight against the disease. (Supplied)\n\nThe study, conducted by the Fred Hutchinson Cancer Centre in the United States, found antibodies to fight HIV were present in 80 per cent of volunteers.\n\nIt marks a step in finding a long-term cure to the disease, which is currently treated with antiretroviral therapy.\n\nIt is still highly prevalent in southern Africa, including Botswana and South Africa.\n\nREAD MORE: Six injured in wedding minibus crash in NSW Hunter Valley\n\nSeth Cheetham, who specialises in mRNA at the University of Queensland, said the vaccine could be a crucial tool in the fight against HIV.\n\n\"This study marks significant progress in the global effort to develop a safe and effective HIV vaccine that prevents infection,\" he said.\n\n\"While drugs for HIV treatment and prevention have transformed the lives of people living with HIV, an effective vaccine is still urgently needed.\n\n\"[If] the results hold up in larger real-world studies in the community, mRNA vaccines could be a transformative tool in the fight against HIV.\"",
        "source": "9News"
    },
    {
        "url": "https://www.abc.net.au/news/rural/2025-07-31/last-wool-scour-victoria-ep-robinson-closes-merges-mitchell-wool/105581838",
        "title": "Wool scouring to end in Victoria after more than 160 years",
        "publish_date": "Thu, 31 Jul 2025 01:51:22 +0000",
        "category": "finance",
        "authors": [],
        "text": "The last early-stage wool processing mill in Victoria will close next month, ending more than 160 years of wool scouring in the state.\n\nWool scouring is the process of cleaning and removing impurities from the fleece, so it can be manufactured into clothing, blankets or other items.\n\nE.P. Robinson (EPR) in Geelong will merge with Michell Wool in Adelaide to create a new business, Australian Wool Processors (AWP), based at the South Australian mill.\n\nThirty jobs will be lost in Geelong.\n\nWhen the consolidation is complete, AWP will be the last wool scour in Australia.\n\nScouring cleans raw wool to remove lanolin and dirt. (ABC News: Kate Forrester)\n\nWool clip shrinking\n\nAustralian wool production is dropping, with forecasts last year estimating it would reach its lowest level in 100 years in 2025.\n\nEPR managing director Jim Robinson said the trend was \"a declining wool clip\".\n\n\"At the same time [there has] just been an increase in offshore processing in China,\" he said.\n\nMr Robinson said combining the two companies was the only way forward.\n\n\"Regrettably for our employees, our staff, there's 30 odd staff that will be made redundant out of this,\" he said.\n\nThirty people will lose their jobs when the mill closes at the end of August. (ABC News: Harrison Tippet)\n\n'Merger of convenience'\n\nMr Robinson said both the EPR and Michell Wool factories had not been operating at optimal levels.\n\n\"We're running at 50 per cent capacity,\" he said.\n\n\" There's no secret [both plants] have been losing money, so this is just a merger of convenience to at least keep one of them running. \"\n\nMr Robinson said the merger would allow buyers to have confidence in how wool was produced.\n\n\"This partnership will allow the Australian wool industry — most notably our customers, the growers and traders — to offer the many international clients who wish to buy processed wool directly from Australia a world-class, home-based service,\" he said.\n\n\"Overseas mills and brands place great value on the full transparency and integrity that's inherent throughout the Australian supply chain, from farm to fibre.\n\n\"They know it is authentically Australian.\"\n\nThe Australian wool clip is at its lowest level in 100 years. (ABC News: Cara Jeffery)\n\nScouring ends in Victoria\n\nWool scouring dates back to the 1860s in Geelong, where factories were established along the Barwon River.\n\nAccording to the National Wool Museum, sheep farming began in the Geelong area in 1835 and the city was known as the \"wool centre of the world\" for many years.\n\nBuildings were constructed on what is now the site of the EPR mill in the suburb of Newtown in around 1920, as the second location for Collins Bros wool manufacturers.\n\nWorkers pose for a photo out the front of the Collins Bros wool mill in about the 1930s or 40s. (Supplied: National Wool Museum Collection)\n\nCollins Bros closed the mill in 1974 and EPR started operations there in 1988.\n\nScouring factories in Australia have been steadily closing due to high energy and labour costs, and environmental waste concerns.\n\nAustralian processing needed\n\nWool Producers Australia, the peak advocacy body for wool growers, supports the merger between EPR and Michell Wool.\n\nGeneral manager Adam Dawes said it was better the companies joined to continue wool manufacturing in Australia, rather than closed altogether.\n\n\"It protects some of our sovereign capacity to process wool,\" he said.\n\nMr Dawes said he had tried to get support from the federal government for local wool scouring.\n\n\"There is an ongoing need for us, at an industry and Australian government level, to invest in developing the diversified demand for the early-stage-process products,\" he said.\n\nSamples of Physician woollen blankets made at the Collins Bros mill in Geelong. (Supplied: National Wool Museum Collection)\n\nHope is not lost\n\nDespite the last Victorian wool scour closing and Australian wool production hitting a record low, there is still hope in the industry for better days ahead.\n\nJock Laurie is a farmer from Queensland and the chair of the grower-funded group Australian Wool Innovation.\n\nHe said wool did not contain microplastics and was not mined, which would ensure the Australian industry survived.\n\nJock Laurie says wool still has a great future. (Supplied: Jock Laurie)\n\n\"We've got all of the things [consumers] really want on environmental issues, and what we need is confidence for them to go out and spend,\" Mr Laurie said.\n\n\"Wool has got a great future. All the feedback we are getting is that wool is a product that people want.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-31/sheep-milk-more-nutrients-than-cows-milk/105577114",
        "title": "Cow's milk alternative tastes like 'ice cream', sheep dairy farmers say",
        "publish_date": "Thu, 31 Jul 2025 01:30:03 +0000",
        "category": "lifestyle",
        "authors": [],
        "text": "Did you know sheep's milk is considered to have more nutrients than cow's milk?\n\nThe sheep dairy industry in Australia is small, particularly when compared to regions like the Mediterranean where sheep's milk and cheese are an integral part of people's diets.\n\nBut that is not stopping Australian producers and dietitians from wanting to raise awareness about the alternative milk's health benefits and unique taste.\n\nSheep's cheese is generally more expensive than cow's cheese. (ABC South West WA: Kate Forrester)\n\nEat Sustainably nutritionist Amelia Harray said sheep's milk had a higher percentage of protein than milk produced by cows or goats.\n\n\"With that comes a higher amount of calcium, phosphorus, manganese, zinc, and all these other really essential nutrients that our bodies need to stay well each day,\" Dr Harray said.\n\n\" One glass of sheep's milk provides Australian adults with about 50 per cent of their calcium requirements, so this is huge in terms of people's bone health. \"\n\nSheep being milked at Cambray Cheese in WA's South West. (Supplied: Maddie Wilde)\n\nDr Harray, who is also a researcher with the University of Western Australia's medical school, said despite the health benefits of sheep's milk, it would likely not be a viable option for people with a dairy allergy.\n\n\"Many people who have a cow's milk protein allergy will also react to milk from other mammals, including sheep and goats,\" she said.\n\nCambray Cheese, located about 240 kilometres south of Perth, is Western Australia's only commercial sheep milk and cheese producer.\n\nCambray Cheese mainly supplies to WA. (ABC South West WA: Kate Forrester)\n\nOwner Tom Wilde said he was \"spreading the word\" as much as possible about the benefits of sheep dairy products.\n\n\"When we do the farmers' market in Margaret River every weekend, people have a try [of our products] and we can tell them about how it's a lot better for your gut and easier to digest,\" he said.\n\n\"Traditionally, people are looking for goat's milk and cheese. A lot of people don't even know that there's sheep's milk or sheep's cheeses around, so it's just about educating people.\"\n\nWorth the price?\n\nMr Wilde said Cambray Cheese sold its first batch of sheep's milk in 2024 for $12 a litre, about three times the price of a litre of cow's milk.\n\n\"We were worried that people wouldn't be able to afford the price that it needed to be because it's expensive milk, but there were no issues. People absolutely loved it,\" he said.\n\n\"The milk is very sweet compared to cow's milk, and it's really nice and thick. It's lovely milk.\n\n\" Some people would describe it as ice cream in a bottle. \"\n\nMeredith Dairy, a family farm located 120 kilometres west of Melbourne, is Australia's largest sheep and goat milk and cheese producer.\n\nMeredith Dairy's Sandy and Julie Cameron (right) milk sheep and goats. (Supplied: Julie Cameron)\n\nDirector Julie Cameron said sheep and goat dairy products were generally more expensive due to the extensive labour requirements.\n\n\"We can get a litre of milk a day from a sheep, we can get 3 litres from a goat, but if you're a cow dairy farmer, you can get between 15 and 40 litres a day,\" she said.\n\nDue to improvements in animal production and automation, Ms Cameron said she had only raised her prices once in the past three decades.\n\nSheep cheese curds at the Cambray Cheese factory. (ABC South West WA: Kate Forrester)\n\nShe said the demand for specialty cheeses had fallen recently as a result of the current \"economic crisis\".\n\nDespite this, Ms Cameron said she remained hopeful the situation would turn around.\n\n\"We talk to the dairy buyers in the supermarkets and they say sales are slow for specialty cheeses, which is sad, but maybe people don't have that spare money for discretionary purchases of luxury items like mould-ripened cheeses or blue cheeses or imported cheeses,\" she said.\n\n\"But I have faith that the economy will pick up, and I'm sure the sales of these specialty cheeses will pick up again.\"\n\nSheep milk at Cambray Cheese being processed. (Supplied: Maddie Wilde)\n\nMr Wilde said he would like to see more farmers give sheep milk production a go.\n\n\"It's probably one of the biggest industries of start-ups and failures in Australia,\" he said.\n\n\"There are not many sheep dairies still running in Australia because it's very labour-intensive.\n\n\"[But] if you love sheep, then it's worth it.\n\n\"We would actually love to be able to buy sheep's milk from other farmers. If that was an option, then we could focus on the cheese side of things.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-31/archibald-peoples-choice-2025-loribelle-spirovski-william-barton/105567540",
        "title": "Loribelle just won an art prize for a portrait she painted with her fingers",
        "publish_date": "Thu, 31 Jul 2025 01:15:00 +0000",
        "category": "entertainment",
        "authors": [],
        "text": "Loribelle Spirovski has won the People's Choice Award for the 2025 Archibald Prize for a portrait she painted with her fingers of Kalkadunga musician William Barton.\n\nThe Sydney-based Filipina Australian artist is a four-time Archibald Prize finalist, having previously painted actors John Bell (2017) and Nicholas Hope (2018), and musician Megan Washington (2019).\n\nSpirovski is only the ninth woman to win the People's Choice Award since it was established in 1988. She is also a finalist in this year's Lester Prize, worth $50,000, for a painting of her partner, classical pianist Simon Tedeschi.\n\nHer oil-on-canvas portrait of Barton — a composer and producer who plays the yidaki (didgeridoo) and guitar — is one of the largest in the exhibition at the Art Gallery of New South Wales (AGNSW), measuring almost 183 centimetres in height. That's compared to Barton himself, who stands at 188cm tall.\n\nAGNSW director Maud Page said the portrait possessed a spontaneity and energy that captured Barton's spirit.\n\n\"The light that is shining onto the side of his beaming face creates a warm intimacy that Loribelle has further emphasised by bringing us right into the picture.\"\n\nSpirovski met Barton after one of his concerts in 2024, and has described his stage presence \"serene and electric\". (Supplied: AGNSW/Jenni Carter)\n\nSpirovski had been recovering from a nerve injury that made painting painful for many years when she resolved to paint Barton. \"Many times, I've questioned my role as an artist,\" she wrote in her artist statement. She even came close to giving up painting altogether.\n\nIt was listening to Barton's song 'Birdsong at Dusk' that inspired her to paint with her fingers instead of a brush.\n\n\"Without a brush, painting was almost painless. As the portrait painted itself, I felt alive in a way I hadn't for a very long time,\" she wrote.\n\nSpirovski's win for People's Choice follows Julie Fragar winning the $100,000 Archibald Prize in May, for her portrait of artist Justene Williams, becoming the 13th woman to win the prize in 104 years. Earlier that month, Abdul Abdullah won the Packing Room Prize for his portrait of artist Jason Phu.\n\nJulie Fragar wins Archibald Prize Photo shows Painting of black and white figure suspended in air. Artist Julie Fragar has won the $100,000 Archibald Prize for her portrait Flagship Mother Multiverse (Justene).\n\nSelected from 904 entries, the 57 finalists in the Archibald Prize include portraits of 2025 Australian of the Year Neale Daniher, rapper and triple j host Nooky, author Kathy Lette, broadcaster Jackie O and actor Hugo Weaving.\n\nPast winners of the People's Choice Award include Angus McDonald for his portrait of academic Marcia Langton (2024), Jaq Grantford for her portrait of actor Noni Hazlehurst (2023) and Jeremy Eden for his portrait of actor Samuel Johnson (2022).\n\nThe Archibald, Wynne and Sulman Prizes 2025 exhibition runs until August 17 at the Art Gallery of New South Wales, followed by a regional tour.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-31/sydney-sweeney-american-eagle-advertisement-controversy/105589506",
        "title": "Why an ad about Sydney Sweeney's 'great jeans' is facing a backlash",
        "publish_date": "Thu, 31 Jul 2025 01:14:05 +0000",
        "category": "finance",
        "authors": [],
        "text": "US jeans brand American Eagle is facing accusations its new ad campaign featuring Sydney Sweeney is \"tone deaf\" and promotes eugenics theory.\n\nThe advertising campaign, which launched this week, features the blonde-haired and blue-eyed actor dressed in denim and it bears the tagline: \"Sydney Sweeney has great jeans.\"\n\nThe company saw a 10 per cent surge in sales after the advertisement's release. However, the campaign has faced mixed reviews online, with some social media users saying it alludes to theories of racial superiority.\n\nHere's why.\n\nSydney Sweeney has 'great jeans'\n\nThe advertising campaign features several videos in which the company uses \"genes\" and \"jeans\" in a play on words.\n\nSeveral videos show Sweeney, dressed head to toe in denim, discussing how great her genes/jeans are while playing with a puppy or starting up a Ford Mustang.\n\n\"Genes are passed down from parents to offspring, often determining traits like hair colour, personality and even eye colour,\" she says in another video which has since been removed.\n\n\"My jeans are blue.\"\n\nLoading Instagram content\n\nBut some critics online say the ads allude to eugenics, a theory popular among white supremacists, that suggests the human race could be improved by breeding out \"less desirable traits\".\n\n\"After watching the full thing, I was a bit confused because I thought, 'OK it's not about selling jeans, it was about Sydney Sweeney,' and I took a step back and analysed the symbols and language used,\" TikTok creator and activist Jeff Kissubi said.\n\n\"She's obviously conventionally attractive but it was what they considered great genes. Pale skin, blonde hair, blue eyes.\n\n\"When eugenic theory started in America, it was saying that everything that was not centred around whiteness would make your gene pool bad.\n\n\"And it was the word play of the advertisement that subtly mirrored far-right Americana themes.\"\n\n'Valid criticism'\n\nMr Kissubi said, given the current political climate in the US, the reaction online was \"valid\".\n\n\"In a country where identity and belonging are already being weaponised, especially now with the far-right MAGA narrative that is on the rise, I don't think it was this overreaction,\" he said.\n\n\"I think that when people consume things that evoke a sudden reaction, that emotion is valid.\n\n\"When people feel erased and unsafe by what they see, it's very important brands don't exist in a vacuum.\"\n\nLauren Rosewarne, from the University of Melbourne, said while the conversations around the advertisements and race were valid, the negative interpretations of the brand's messaging could have been missed by advertisers.\n\n\"There are focus groups and these ads are never just designed in a vacuum,\" she said.\n\n\"They are shown to groups of people to see what things jump out at them, but this is the danger of social media; you can never focus-group enough people to fully gauge what a social media response might look like.\n\n\"Something that might not seem particularly obvious to focus groups will enter niche parts of social media.\"\n\nShe said advertisers were navigating an era when there were social media users with high media literacy and accounts dedicated to unpicking subtext and pop culture.\n\nA 'divisive' figure\n\nThe advertisement is not the first to cause controversy.\n\nDr Rosewarne said the American Eagle videos reminded her of a 1980s ad campaign for Calvin Klein jeans.\n\nThe advertisement featured 15-year-old actor Brooke Shields and the tagline: \"Nothing gets between me and my Calvins.\" It was criticised at the time for its suggestive nature.\n\nSome TV networks declined to air the ad because of the suggestive double entendre and Shields's age.\n\nBut Shields told Vogue in 2021 that she thought the backlash was \"ridiculous\".\n\nSweeney has also faced controversy before.\n\nIn 2022, she shared pictures of her mother's 60th birthday in which family members wore MAGA-style hats that read \"make sixty great again\".\n\nSweeney later tweeted that people were turning an \"innocent celebration\" into an \"absurd political statement\".\n\nNeither Sweeney nor American Eagle has commented on the backlash to the jeans ads.\n\nAnd the proceeds of the jeans will be donated to The Crisis Text Line, a US charity hotline for people who need mental health support.\n\nDr Rosewarne said Sweeney was \"always going to be a divisive figure\".\n\n\"It also works for her,\" she said.\n\n\"She gets the opportunities because of the decisions she's made and, so long as you don't cross the line where the majority of people think it's quite problematic, throwing caution to the wind is quite seductive in certain markets, and she gets away with it because she's pretty.\n\n\"This is where we talk about pretty privilege … and that kind of slack isn't given to people who are older or less conventionally beautiful.\"\n\nWhat is eugenics?\n\nEugenics is a racist and scientifically inaccurate theory that humans can be improved through selective breeding, according to the US National Human Genome Research Institute.\n\nBritish explorer Francis Galton coined the term in 1883.\n\nGalton believed health and disease, as well as social and intellectual characteristics, were based on genes and the concept of race.\n\nHe advocated for a system where \"the more suitable races or strains of blood have a better chance of prevailing speedily over the less suitable\".\n\nHe interpreted certain physical traits and characteristics as more socially and economically valuable.\n\nThe implementation of eugenics theory has caused widespread harm to marginalised populations throughout history.\n\nPronatalism booming in the US Photo shows A woman with a baby on her back with a rifle hanging on the wall in the background. Americans are being encouraged to have more children by the likes of Donald Trump, JD Vance and Elon Musk. And even though the risks for the poster families of pronatalism are real, they are happy to bear them.\n\nThe movement gained traction in the late 1800s and early 1900s and some leaders and intellectuals believed the use of methods such as involuntary sterilisation, segregation and social exclusion would rid society of individuals deemed by them to be unfit.\n\nThe theory was so prevalent in America in the early 1900s that it was supported by US president Woodrow Wilson and prominent families such as the Rockefellers.\n\nThe most radical interpretation of the theory came during the Holocaust, when a large number of Nazi persecutory policies stemmed from theories of eugenics.\n\nIn Germany, the term was largely referred to as \"racial hygiene\" and it influenced the thinking of Adolf Hitler who blended racial antisemitism with eugenic theory, according to the US Holocaust Museum.\n\nHe used it to justify the Nazis's treatment of Jews, disabled people and minority groups.\n\n'Shifting climate'\n\nThe Trump administration has been accused of \"dog whistling\" to the far-right movement through its policies targeting diversity and inclusion programs.\n\nShortly after taking office, US President Donald Trump signed executive orders cracking down on diversity, equity and inclusion programs.\n\nAt Mr Trump's inauguration, the former head of his Department of Government Efficiency, Elon Musk, was accused of making a Nazi salute, a claim he denied.\n\nAnd in February, US Vice-President JD Vance courted the leader of Germany's far-right, anti-immigration AfD party, which Germany's spy agency has labelled racist and \"extremist\".\n\nSome marketing experts say they have observed a shift in the industry since Mr Trump returned to office.\n\nJazmin Burell, a founder of a brand consulting agency in the US, told AP she had noticed more advertisements featuring white models.\n\n\"I can see us going back to a world where diversity is not really the standard expectation in advertising,\" she said.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-31/chris-o-connell-beats-stefanos-tsitsipas-maya-joint-eliminated/105594742",
        "title": "O'Connell stuns Tsitsipas, Joint loses in three sets at Canadian Open",
        "publish_date": "Thu, 31 Jul 2025 01:13:24 +0000",
        "category": "sports",
        "authors": [],
        "text": "Australian Christopher O'Connell has stunned Greek 23rd seed Stefanos Tsitsipas to advance to the final 32 of the Canadian Open.\n\nThe 31-year-old from Sydney stormed away in the final set to claim a 6-4, 4-6, 6-2 win.\n\nO'Connell could be part of an all-Australian round of 32 match-up, as he will face either compatriot Alex de Minaur or 24-year-old Argentine Francisco Comesana.\n\nDe Minaur and Comesana are playing on Thursday morning, AEST.\n\nMeanwhile, Australia's Maya Joint pushed 28th seed McCartney Kessler to the limit before losing in three sets at the Canadian Open.\n\nThe 19-year-old Aussie came flying out of the blocks in Montreal on Wednesday, local time, taking the first set, before the American bounced back strongly to claim the next two for a 4-6, 6-4, 6-3 victory.\n\nMaya Joint was knocked out of the Canadian Open after a three-set battle with American McCartney Kessler. (AP: The Canadian Press/Graham Hughes)\n\nLittle separated the players throughout the match, which threw up 14 break points for each. Joint converted three of those chances, while her American opponent managed four breaks.\n\nJoint had been hoping to back up her first-round upset of local favourite Leylah Fernandez, the world No.24 who was fresh off claiming the biggest title of her career on Sunday, the Washington Open.\n\nDespite the loss, Joint has shown she is finding top form ahead of the year's final major, the US Open, which kicks off in New York on August 24.\n\nJoint is already a two-time WTA title winner this year, and will be looking to start making a real impact at grand slam level.\n\nJoint causes Canadian Open upset as star laments 'political issues' Photo shows Maya Joint wears sunglasses and hits a forehand. Maya Joint continues her red-hot form by upsetting Leylah Fernandez in the first round of the Canadian Open, as Coco Gauff survives a massive scare to advance.\n\nShe reached the second round at Flushing Meadows in 2024, but is yet to progress past the first round of the other majors.\n\nAustralia's only remaining competitor in the women's singles, 15th seed Daria Kasatkina, will face 24th seed Marta Kostyuk of Ukraine in the third round on Thursday.\n\nIn other second-round results on Wednesday, six-time grand slam champion Iga Swiatek was all business in a 6-3, 6-1 demolition of China's Guo Hanyu.\n\nThe Polish superstar, seeded second in Montreal, is hot off her record-breaking win in the Wimbledon singles final, where she served up two \"donuts\" to American Amanda Anisimova.\n\n\"I think I played a really solid match today,\" Swiatek said.\n\n\"Playing the first match on hard court after a pretty long break from the surface is always tricky, so I'm happy that I just focused on myself, adjusted to the conditions and played well.\"\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\nAmerican third seed and two-time defending champion Jessica Pegula remained on track for a title hat-trick by beating Maria Sakkari of Greece 7-5, 6-4.\n\nFour-time major champ Naomi Osaka of Japan upset 13th-seeded Russian Liudmila Samsonova 4-6, 7-6 (8-6), 6-3 to continue her impressive return to tennis after taking a maternity break.\n\nSixth-seeded American Madison Keys was dominant over Germany's Laura Siegemund 6-2, 6-1.\n\nAAP/AP",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-31/zarli-skopp-ndis-child-therapy-funding-cut/105585624",
        "title": "As Zarli, 9, took her first steps at therapy her NDIS funding was cut",
        "publish_date": "Thu, 31 Jul 2025 00:19:00 +0000",
        "category": "finance",
        "authors": [],
        "text": "Rinnie Skopp watched on in awe as her daughter Zarli, aged nine, took her first steps earlier this year at a specialist children's therapy service in Brisbane.\n\nEach wobbly step felt momentous for Ms Skopp, but her jubilation was cut short.\n\nAfter arriving back at home in Calliope in central Queensland, she learned her daughter's funding for the service had been cut by the National Disability Insurance Agency (NDIA).\n\n\"They said it was a duplication and not value for money,\" Ms Skopp said.\n\n\"It's disheartening because Zarli's goals are going to be slowly reached if we don't give her as much as possible now.\"\n\nZarli taking her first steps earlier this year. (Supplied: Rinnie Skopp)\n\nZarli was born with CHOPS syndrome, a rare genetic disease which affects multiple parts of the body and can delay skills like walking.\n\nMs Skopp said Zarli took her first steps at Brisbane's NAPA Centre in April this year during a three-week-long therapy block which focused on building her core strength.\n\n\"She started with a few steps and we got to around 15 metres,\" Ms Skopp said.\n\nMs Skopp said her daughter's physiotherapy, occupational therapy and speech pathology funding under the NDIS had almost halved from $59,782 to $30,366 since her plan was reviewed in April.\n\nHer total NDIS plan of $194,000 per year was reduced to $179,000, and included 233 hours of allied health and behaviour supports annually.\n\nRinnie Skopp says it is the second time she has had to advocate for Zarli after NDIS funding cuts. (ABC Capricornia: Jasmine Hines)\n\nThe NDIA, which operates the NDIS, said its top priority was ensuring participants could access the disability support they needed.\n\n\"It's normal for NDIS plans to go up and down over time, especially for young children,\" a spokesperson said.\n\n\"As a child's needs change, plans will change — especially as children start to access other community supports such as early childhood education or school.\"\n\nIt said funding was provided based on individual needs rather than funding providers or programs.\n\nZarli with her therapists at a NAPA Centre. (Supplied: Rinnie Skopp)\n\nA review of Zarli's funding was requested by her family, and is in progress.\n\nNDIS 'nightmare'\n\nNAPA (Neurological and Physical Abilitation) Centres help families with complex disabilities access multidisciplinary care.\n\nAustralian director of client services Louise Conn said she believed it was one of the few clinics in the country which had experience working with a child with CHOPS syndrome.\n\nLouise Conn says funding is being significantly cut across the board. (Supplied: Louise Conn)\n\nShe was devastated to learn Zarli's funding had been cut.\n\n\"I know how beautiful and amazing Zarli is and the great potential she has. They've been through an absolute nightmare with the NDIS,\" she said.\n\nMs Conn said she would like the NDIS to look closer at internal cost savings rather than savings from developing children.\n\n\"We do have deep concerns that the cuts that they are making seem to not be very well focused,\" she said.\n\n\"Nine-year-old children who are learning to walk are becoming the victims of a very, very, strange big budget shift.\"\n\nZarli's mum says it's stressful having to repeatedly prove what therapy her daughter needs. (Supplied: Rinnie Skopp)\n\nMs Conn said the centres had noticed — irrespective of diagnosis, age or location — funding was being significantly cut across the board.\n\n\"Allied health professionals provide a lot of complex reports … and these seem to be getting ignored more and more, and the recommendations ignored, which is really, deeply concerning,\" Ms Conn said.\n\n\" There is an absolute groundswell of families in panic mode. \"\n\nMs Skopp said it was the second time her daughter's NAPA Centre funding had been cut.\n\n\"It's stressful, especially when you feel like you're providing all the evidence they require,\" she said.\n\nZarli's NDIS plan is currently under review again. (Supplied: Rinnie Skopp)\n\nMs Skopp said her daughter had regressed since taking her first steps, but was confidently using her walker.\n\nShe said Zarli was at an exciting, sponge-like stage of life.\n\n\"Her brain development falls in that early intervention. As we're teaching her things, she is just absorbing it right now,\" Ms Skopp said.\n\n\"She has become very playful, the eye contact and the communication.\n\n\"She's just succeeding in so much and this is really where we need to throw as much as we can at her.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-31/le-court-first-african-to-win-tour-de-france-femmes-stage/105594266",
        "title": "Le Court becomes first African to win stage at Tour de France Femmes",
        "publish_date": "Wed, 30 Jul 2025 23:34:34 +0000",
        "category": "sports",
        "authors": [],
        "text": "Mauritian cyclist Kimberley Le Court Pienaar has become the first African to win a stage at the Tour de France Femmes.\n\nWith a late push during a marathon 165.8 kilometre ride from Jaunay-Marigny to Gueret, Le Court reclaimed the yellow jersey on Wednesday.\n\nLe Court (AG Insurance-Soudal), 29, who led the general classification after stage two but was overtaken by Marianne Vos (Visma-Lease a Bike), won a breakneck downhill push to the finish of stage five, edging 2023 champion Demi Vollering.\n\nThe fifth stage, the longest in the Tour this year, covered relatively flat terrain before three climbs in the final 35km. It resulted in several failed breakaway attempts as the peloton covered 46.5km in the first hour despite multiple crashes.\n\nGreen jersey holder Lorena Wiebes (SD Worx-Protime) recovered from a crash to rejoin the peloton, but struggled to keep up after the first climb, ultimately finishing 58th.\n\nLe Court's stage win was aided by Australian teammate Sarah Gigante, who was pivotal in reducing the lead group with a brutal turn on the front on the final climb, dragging her team leader into yellow.\n\n\"I had a teammate with me, that helped a lot,\" Le Court said.\n\n\"If I didn't have Sarah, maybe the group behind would have come back.\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\n\"Once Sarah got back on the down hill I was really, really lucky to have her because she just committed fully to the line and without her I wouldn't have done what I did today.\n\n\"It shows how you need teamwork in this sport.\"\n\nAustralian Brodie Chapman was awarded the most combative prize for the stage, for her efforts in a long breakaway early in the race.\n\nAmerican Olympic champion Kristen Faulkner (EF Education-Oatly) abandoned the race after her third crash in three days.\n\nMaria Giulia Confalonieri, Elisa Balsamo and Monica Trinca Colonel also abandoned the race.\n\nVos, who stayed in the peloton behind a leading group for most of the race, attacked in the final 15km during the mountainous part of the stage, but fell behind during the final uphill push, dropping to sixth in the general classification.\n\nVollering (FDJ-Suez) rose to third overall, while Pauline Ferrand Prevot (Visma-Lease a Bike) moved up to second, sitting 18 seconds behind Le Court in the general classification.\n\nThe Tour continues on Thursday with a mountainous 123.7km ride from Clermont-Ferrand to Ambert.\n\nReuters/ABC",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-31/traditional-owners-tassal-cone-bay-barramundi-expansion-concerns/105590000",
        "title": "Concerns grow over fish farm expansion in WA waters",
        "publish_date": "Wed, 30 Jul 2025 23:27:27 +0000",
        "category": "finance",
        "authors": [],
        "text": "Traditional owners in Western Australia's far north say they are growing increasingly concerned over seafood giant Tassal's plans to expand its fish farming operation off the remote Kimberley coast.\n\nKnown for its salmon farming off Tasmania, Tassal has been seeking to expand its 32-cage barramundi operation centred on the iconic farm at Cone Bay.\n\nThe company is seeking to add seven fish farms, comprising 84 cages, to its holdings in the surrounding waters off the coast.\n\nTassal already owns a 32-cage barramundi operation at Cone Bay. (Supplied: Marine Produce Australia)\n\nWA's Environmental Protection Authority is assessing the proposal.\n\nWith the company's record in Tasmania attracting significant controversy, the Dambimangari Aboriginal Corporation, which represents the region's traditional owners, is concerned the farm's expansion could undo years of conservation work in the Buccaneer Archipelago.\n\nIndustry vs sanctuary\n\nComprising more than 1,000 scattered islands, the archipelago contains three marine parks across 600,000 hectares, co-designed and jointly managed by the area's Bardi Jawi, Mayala and Dambimangari traditional owners.\n\nTassal's facility falls on Mayala country, with the company signing an Indigenous Land Use Agreement with the group last year.\n\nBut the broader potential impact on the marine park has representatives of the neighbouring cultural groups concerned.\n\nDambimangari board member and marine park chair Francis Woolagoodja said conservation needed to be prioritised.\n\nFrancis Woolagoodja says he does not support Tassal's plans. (Supplied: Dambimangari Aboriginal Corporation)\n\n\"Where does the barramundi industry fit within conservation and looking after country?\" he said.\n\n\" It contradicts what we've been trying to do when you put a barramundi zone right next to a sanctuary zone, which are two opposite things. \"\n\nMr Woolagoodja said the issues surrounding salmon farming in Tasmania were the \"elephant in the room\".\n\n\"We don't want what's happening in Tasmania to happen to the Kimberley coast,\" he said.\n\n\"I'm not supportive of what they're doing over in Tasmania … we're hearing it really has impacted coastlines, so we're mindful of those things.\"\n\nThe archipelago off the north-west coast is used by traditional owners for hunting and customary activities, as well as for tourism and recreational and commercial fishing. (Supplied: Air Kimberley)\n\nMr Woolagoodja said he was not against the creation of jobs and development, but he held concerns around the scale of the expansion.\n\n\"Something huge around barramundi, which will really impact country — that's opposite to what government's been doing with us for the last 15 years,\" he said.\n\n\"We think the government wouldn't contradict everything they've done … and we will try to find a middle ground.\"\n\nFishers concerned\n\nWith the archipelago a popular destination, recreational fishers in Broome and Derby are also concerned about the farm's potential impact.\n\nRecfishwest operation leader Matt Gillett said many local fishers wanted the Kimberley to \"remain untouched and accessible\".\n\nTassal bought the Cone Bay barramundi farm in 2023. (Supplied: MainStream Aquaculture)\n\n\"Kimberley fishers love this area … one of the last things they want is aquaculture facilities that impact access to their favourite fishing spots,\" he said.\n\nMr Gillett said fishers' access to the region, already restricted by the marine park, should not be impacted further.\n\nBut Broome Chamber of Commerce and Industry chief executive Sharni Foulkes said the expansion could offer tourism and employment opportunities.\n\n\"These guys aren't your mum and dad operators, this is a big corporate promising 140 new jobs,\" she said.\n\n\" The Kimberley could be on the map internationally for our barramundi supply, and if that bolsters tourism because people will try our seafood and eat at our restaurants, then I think they've done a fantastic job. \"\n\nMs Foulkes said she believed investing in the state's aquaculture industry was a crucial first step in economic diversification.\n\n\"They [Tassal] want to support skilled development and support career pathways for local people, which is an important opportunity the region needs to grab hold of and support,\" she said.\n\nTassal says project 'exciting' for region\n\nA Tassal spokesperson said the project was an exciting opportunity for the region, contributing to job growth and investment in local suppliers.\n\nCascade Bay is a popular destination for recreational fishers in the archipelago. (ABC Kimberley: Ben Collins)\n\n\"The footprint of the project removes around 400 hectares from the proposal previously submitted by the past operators, recognising concerns raised by important local stakeholders such as traditional owners and recreational fishers,\" they said.\n\n\"We are proud and humbled to have secured the consent for the project via a voluntary Indigenous Land Use Agreement with the Mayala traditional owners on whose country the proposal is wholly located.\"\n\nA WA government spokesperson said the EPA was assessing potential impacts to marine environmental quality, benthic communities and habitats, and marine fauna from the operation of aquaculture sea cages.\n\nThe full report on Tassal's proposal is due by the end of 2025.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-31/world-athletics-sets-deadline-for-athlete-chromosome-tests/105594118",
        "title": "World Athletics sets deadline for competitor chromosome tests",
        "publish_date": "Wed, 30 Jul 2025 23:19:30 +0000",
        "category": "sports",
        "authors": [],
        "text": "World Athletics has set a September 1 deadline for athletes to pass a gene test for competing at the world championships.\n\nTrack and field's governing body said in March it would require chromosome testing by cheek swabs or dried blood-spot tests for female athletes to be eligible for elite-level events.\n\nThe next championship opens on September 13 in Tokyo, and September 1 is \"the closing date for entries and the date the regulations come into effect,\" World Athletics said in a statement.\n\nThe latest rules update gives certainty for the 2025 championships in an issue that has been controversial on the track and in multiple courts since Caster Semenya won her first 800m world title as a teenager in 2009.\n\nCaster Semenya is still caught up in court cases, despite her athletics career being over. (AP Photo: Mark Schiefelbein)\n\nSemenya won a ruling at the European Court of Human Rights three weeks ago in Strasbourg, France, in the South African star's years-long challenge to a previous version of track and field's eligibility rules affecting athletes with medical conditions known as Differences in Sex Development (DSD).\n\nThat legal win, because she did not get a fair hearing at the Swiss Supreme Court, did not overturn the track rules.\n\nWorld Athletics drew up rules in 2018, forcing two-time Olympic champion Semenya and other athletes with DSD to suppress their elevated natural testosterone levels to be eligible for international women's events. Semenya refused to take medication.\n\nNow, the Monaco-based track body requires a \"once-in-a-lifetime test\" to determine whether athletes it deems biologically male carry a Y chromosome.\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\n\"We are saying, at elite level, for you to compete in the female category, you have to be biologically female,\" World Athletics president Sebastian Coe said.\n\nThe governing body is covering up to $100 of the costs for each test, with the protocol overseen by its member federations at the national level. Test results should be ready within two weeks.\n\n\"The SRY test is extremely accurate and the risk of false negative or positive is extremely unlikely,\" World Athletics said.\n\nWorld Athletics has combined its eligibility framework for DSD and transgender athletes, with transitional rules that let \"a very small number of known DSD athletes\" continue competing if they are taking medication to suppress natural testosterone.\n\n\"The transitional provisions do not apply to transgender women as there are none competing at the elite international level under the current regulations,\" World Athletics said.\n\nNow age 34, and her track career effectively over, Semenya should now see her legal case go back to the Swiss federal court in Lausanne, where she lost her original appeal against track and field's rules at the Court of Arbitration for Sport.\n\nThe ABC of SPORT Sports content to make you think... or allow you not to. A newsletter delivered each Saturday.\n\nAP",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-31/sat-ruling-may-make-it-harder-for-wa-homeowners-to-remove-trees/105593004",
        "title": "Warning legal ruling over tuart tree could hinder WA property owners",
        "publish_date": "Wed, 30 Jul 2025 23:15:47 +0000",
        "category": "finance",
        "authors": [],
        "text": "A \"landmark\" court decision could make it harder for West Australian property owners to remove mature trees on their land, and see them risk hefty fines, a legal expert and environmental advocates say.\n\nThe decision, handed down in the State Administrative Tribunal (SAT) this week, relates to the right of a property owner in the western Perth suburb of City Beach to remove a mature tuart tree from her backyard as part of a new home build.\n\nThe local council, the Town of Cambridge, issued an approval for the development to go ahead late last year, but then a few months later adopted a policy of protecting large trees in order to maintain the area's green canopy.\n\nPerth has the least tree canopy coverage of any Australian capital city at less than 20 per cent. (Adobe Stock)\n\nFollowing community protest, the council then told the resident that she could not cut the tree down, which she challenged in the SAT.\n\nThe tribunal this week ruled in the landowner's favour.\n\nTrees to be ripped out to protect Perth residents' 'million-dollar' vistas Photo shows Three of the saplings in Sir James Mitchell park that South Perth council has now voted to remove The City of South Perth votes narrowly in favour of removing six saplings planted last year on the Swan River foreshore parkland, after complaints they would eventually block views of the city skyline.\n\nBut it also determined that removal of a single tree on private property may be classed as \"development\", something planning law expert Alex McGlue said was not previously part of the state's planning rules and that could have ramifications for homeowners.\n\n\"Historically, the concept of development was more associated with physical work, such as constructing a building, or using premises for a particular business purpose,\" he said.\n\n\"What the SAT has reasoned is that the works associated with removing this tree would have had a significant visual impact and an impact on the amenity of the surrounds, and therefore constituted development.\"\n\n'Criminal offence'\n\nMr McGlue, a partner in the WA legal firm Lavan, said this meant homeowners would need to approach their local government before they removed large trees from their land, or risk prosecution.\n\n\"Breaching a planning requirement it is a criminal offence,\" he said.\n\n\" It's not punishable by imprisonment, but it is punishable by fines, and they can be pretty significant. \"\n\nHe said in the wake of this decision, local governments would need to formally organise their rules for landowners.\n\n\"I would recommend that every local government in the state be immediately adopting local planning policies too, because local planning policies can set out exemptions from what requires development approval,\" he said.\n\nLocal governments are being urged to formally organise rules for landowners over the removal of mature trees. (720 ABC Perth: Emma Wynne)\n\nMr McGlue said councils could, for example, provide automatic exemptions for approval of the removal of trees under a certain height.\n\nFears over fallout\n\nThe property owner at the centre of the SAT decision, Lisa Zorzi, said she bought the land to build a home for her family.\n\nShe wanted to remove the tree because she felt it was not able to be maintained, and was worried it posed safety risks to her and her neighbours.\n\nThe Town of Cambridge adopted a policy of protecting large trees to maintain the area's green canopy. (ABC News: Glyn Jones)\n\nShe also had trouble getting insurance given the breadth of the canopy.\n\nMs Zorzi is worried the legal implications that may flow from her taking her case to the SAT, despite it ruling in her favour, could impact other property owners negatively.\n\n\"I think it's taking away a lot of property owners' rights, and it's also forcing them to take on risk and liability that they're not necessarily comfortable with,\" she said.\n\n\"They're going to have to put up with that for the rest of their life, or the time they own that property, which is really scary for someone who's invested a lot of their livelihood into [a] property in WA.\"\n\nMs Zorzi also felt targeted and \"dehumanised\" by some environmental groups during the saga.\n\n\"I believe that true change, and true policy change, occurs through respectful decision-making, and taking into account everybody's point of view,\" she said.\n\nWALGA welcomes ruling\n\nThe WA Local Government Association welcomed the SAT's decision, saying it supported its view that the removal of a single tree should require approval.\n\n\"WALGA has for many years been calling for stronger protections of trees on private land,\" WALGA president Karen Chappel said in a statement.\n\n\" It is acknowledged that the majority of tree loss occurs on private land in WA, and that without addressing this trend, our urban canopy will continue to decline. \"\n\nWALGA's policy, so far adopted by six councils across Perth including the Town of Cambridge, sets out rules for which trees should be preserved.\n\nThese include:\n\nIs 8m or more high; and/or\n\nhas an average canopy diameter of at least 6m; and/or\n\nhas a truck circumference of at least 1.5m, measured 1.4m above the ground; and\n\nis of a species that is not included on State or local area weed register.\n\nThe West Australian Tree Canopy Advocates (WATCA) group also lauded the SAT's ruling as a \"landmark\" precedent.\n\nSarah Allchurch says the ruling gives local governments \"real teeth\" when it came to protecting trees. (ABC News: Grace Burmas)\n\nWATCA chair Sarah Allchurch said it gave local planning policies \"real teeth\".\n\n\"It means no one can bust out the chainsaws and clear-fell trees over 8 metres, because the trees are deemed to be a community asset, even on private land,\" Ms Allchurch said.\n\nLoading...",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-31/red-tape-holding-back-sydney-street-food-scene/105592534",
        "title": "Mates triumph after two-year battle to realise hospitality dream",
        "publish_date": "Wed, 30 Jul 2025 23:07:51 +0000",
        "category": "finance",
        "authors": [],
        "text": "After leaving their day jobs, Serwan Roman and Andrew Vu thought they could get their cafe on the site of an unused car wash in Sydney's south-west open in a few months.\n\nThe pair worked casual night shifts as security guards to make ends meet while trying to get their vision off the ground.\n\n\"We were trying to work around the clock,\" Mr Roman said.\n\n\"During the day speak to the council, speak to town planners, speak to architects [to] get drawings happening, and then at night do the graveyard shift.\"\n\nAndrew Vu and Serwan Roman worked night shifts as security guards while trying to get approvals. (ABC Radio Sydney: Declan Bowring)\n\nBut they ended up in a back-and-forth with Canterbury-Bankstown Council for two years.\n\nThe council was worried their business did not provide enough parking — despite being next to a public car park — and that they were on a state-owned road that might have lanes added in the future.\n\nThe pair decided to pivot their business to being a food truck which could be on-site without needing to substantially develop the infrastructure.\n\n\"The food truck just felt like it fast-tracked us to where we wanted to be,\" Mr Roman said.\n\nThe pair's business, Roman's Deli, has since amassed a cult following with at least 9,000 followers on their Instagram account.\n\nRoman's Deli operates out of an unused car wash facility adjoining a petrol station in Georges Hall. (ABC Radio Sydney: Declan Bowring)\n\nMr Roman felt the council often took a long time to respond to enquiries and it would have been easier had it been a one-stop shop.\n\n\"They're always telling you 'you have to speak to the A-team or this B-team or this C-team' rather than 'I'm the one person that has these answers for you',\" Mr Roman said.\n\nReport calls for one-and-done payment system\n\nSimplifying the process of getting approvals into a one-stop shop is one of many recommendations put forward by a new report looking into Sydney's growing street food scene.\n\nThe report from the Sydney think tank Committee for Sydney wants to see councils publish simple step-by-step guides for setting up businesses and the state government review planning controls restricting street food in heritage areas.\n\nA new report calls for an end on day limits for food stalls which have approval to run during a festival or regular market. (ABC Radio Sydney: Declan Bowring)\n\nThe report wants street food vendors to be able to operate regularly in areas where there are already approvals for weekly markets.\n\nIt also calls for a system where mobile food trucks can work across multiple council areas with ease.\n\n\"If possible, a one-and-done kind of payment system so that food operators can operate across all these different jurisdictions as simply and as easily as possible,\" said Matt Levinson from the Committee for Sydney.\n\nStreet food can be a money spinner for local economies, the report said, citing how the Parramatta Lanes 2023 festival is estimated to have injected $1.5 million into the local economy.\n\n\"You think about the places that you love going around the world, whether that's New York or Hanoi or Mexico City, and the first thing so many people will think about is the street food culture,\" Mr Levinson said.\n\nThe main street of Harris Park in Sydney's west has become a street food destination. (ABC News: Declan Bowring)\n\n\"Operators are working in every single council area across the city. So even just finding information, let alone going through approvals, paying the costs involved, can be just time consuming.\"\n\nA spokesperson for the NSW Department of Planning, Housing and Infrastructure said a new policy was being developed to support outdoor dining.\n\n\"The NSW government's vision for the state's 24-hour economy is to cement NSW as a world-class nightlife destination for visitors, locals and workers alike,\" a spokesperson said.\n\nABC Radio Sydney understands the Office of Local Government is developing a process to allow councils to recognise each other's approvals for mobile businesses.\n\nWaiting times hurting the most\n\nBlanca Perera recently opened her Mexican food business Olotl into a restaurant in Sydney's inner west.\n\nMs Perera says there was not a clear path for someone wanting to establish a new food business and feels that could be spelled out more clearly by authorities such as local councils.\n\nThe process for setting up food businesses needs to be simplified, a new report says. (ABC Radio Sydney: Declan Bowring)\n\nShe also said the time spent waiting for responses and approvals from councils was a problem for food operators who work on small margins.\n\nShe had previously worked as an architect and was very familiar with lengthy development processes.\n\n\"It's different in architecture because people are ready and prepared for construction and design and all that,\" Ms Perera said.\n\n\" But in hospitality you don't have the margin and you needs things to go faster. \"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-31/ben-stokes-out-of-fifth-india-test-with-shoulder-injury/105594064",
        "title": "Ben Stokes still on track for Ashes despite succumbing to another injury",
        "publish_date": "Wed, 30 Jul 2025 22:57:35 +0000",
        "category": "sports",
        "authors": [],
        "text": "England captain Ben Stokes has been ruled out of the fifth and final Test against India with a right shoulder injury.\n\nOllie Pope will replace Stokes as captain for the conclusion to the action-packed series at The Oval in London, with 21-year-old Jacob Bethell returning to the batting line-up for the first time this year.\n\nPlay begins on Thursday night (AEST), with India trailing 2-1 in the series and needing a win to draw.\n\nStokes said he expected to be sidelined for up to seven weeks, which should in no way impact his participation in the Ashes in Australia this summer.\n\nIndia coach caught in ugly tirade at The Oval Photo shows GxBwBgfW8AAcQ5- Gautam Gambhir is caught on video berating grounds staff at The Oval after he was asked to stay off the pitch.\n\nThe 34-year-old said after the drawn fourth Test he was \"very unlikely\" to miss the Anderson-Tendulkar finale, but on match-day eve said it was too risky to play.\n\n\"It is one of those of weighing up the risk-reward, and the risk was way too high for damaging this any further than it currently is,\" he said.\n\n\"I wouldn't expect to put any of my players at risk with an injury like this. Once this series is done, I was feet up anyway, [so] it doesn't really make too much difference to what I've got from the end of the series up until the [English] winter.\"\n\nThe first Test against Australia starts in Perth on November 21, and England will be counting on Stokes to help win back the urn from Australia for the first time since 2015, and win their first series in Australia since 2011.\n\n2025-26 Ashes schedule First Test: November 21-25 at Perth Stadium\n\nNovember 21-25 at Perth Stadium Second Test: December 4-8 at the Gabba (day-night)\n\nDecember 4-8 at the Gabba (day-night) Third Test: December 17-21 at Adelaide Oval\n\nDecember 17-21 at Adelaide Oval Fourth Test: December 26-30 at MCG\n\nDecember 26-30 at MCG Fifth Test: January 4-8 at SCG\n\nStokes was named player of the match in last week's drawn fourth Test, taking six wickets against India with some hostile and accurate spells, and scoring his long-awaited 14th Test century, over two years since his last.\n\nHe said after the game he told his players \"pain is just an emotion\", but bowling long spells took its toll on Stokes, in his first series back from a torn hamstring, battling a biceps issue and clutching at his right shoulder repeatedly.\n\nEngland is also resting seamers Jofra Archer — who only recently returned to Test cricket after more than four years out — and Brydon Carse, while spinner Liam Dawson was left out in one of four changes.\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\nGus Atkinson returns to bolster England's attack, along with Jamie Overton and Josh Tongue rounding out an inexperienced pace trio to back up Chris Woakes.\n\nThe fourth Test ended with tensions between the teams, with Stokes saying his opposite number, Shubman Gill, should have accepted his offer of a draw with the match heading toward an inevitable stalemate.\n\nBut Gill chose to wait until Ravindra Jadeja and Washington Sundar — whose watchful and stubborn long partnership helped save the Test — had completed their centuries.\n\nIn the lead-up to the final match, India head coach Gautam Gambhir clashed with the Oval's lead curator, Lee Fortis.\n\nThe ABC of SPORT Sports content to make you think... or allow you not to. A newsletter delivered each Saturday.\n\nAP",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-31/aged-care-and-home-care-shortage-puts-pressure-on-hospitals/105503700",
        "title": "Hundreds of WA hospital beds occupied by people who don't need to be there",
        "publish_date": "Wed, 30 Jul 2025 22:34:51 +0000",
        "category": "finance",
        "authors": [],
        "text": "Each day around 200 hospital beds in Western Australia are taken up by people who do not need to be there, according to state budget estimates released last month.\n\nIt is the result of a lack of aged care vacancies and at-home support for older people, particularly in regional areas.\n\nThe issue has added pressure to the state's already stretched health system, which experienced its worst month on record for regional ambulance ramping in May.\n\nPatients are being admitted to hospital for genuine health issues, but to be released into an at-home care model, they may have to wait an extra 10 days in hospital, while those waiting for a residential aged care place face an additional 16-day wait on average.\n\nWA's Shadow Health Minister Libby Mettam said not enough was being done to address the issue, and patients should not be staying in hospital longer than medically required.\n\nLibby Mettam says it is costing taxpayers. (ABC News: Andrew O'Connor)\n\n\"It is not good for their dignity, their welfare,\" she said.\n\n\"It also has an impact on the rest of the hospital system, and it all comes as an unnecessary cost to taxpayers.\"\n\nAn average hospital bed costs $2,370 per day compared with an aged care placement of about $350 a day.\n\nA 2022–23 report from the state's auditor general, Management of Long Stay Patients in Public Hospitals, highlighted concerns for the patients themselves, the impact on the health system, and a lack of data in relation to the ongoing issue.\n\nLack of beds\n\nWA Minister for Seniors and Aged Care Simone McGurk said aged care was a federal government responsibility, and there were not enough beds available across the country.\n\n\"There are not enough concessional beds, so those people who are least able to pay are usually in a very difficult position and are more likely to end up in hospital,\" she said.\n\nSimone McGurk says Western Australia is not the only state dealing with a lack of aged care beds. (ABC News: Cason Ho)\n\nAt the end of March, federal Department of Health, Disability and Ageing figures showed there were 87,597 people nationally waiting for home care packages.\n\nThe state government has committed to a $100 million low-interest loan scheme to help aged care providers deliver up to 500 additional concessional aged care beds.\n\nThe scheme is expected to be rolled out next financial year.\n\nMs McGurk said the state government's Time to Think program also provided 42 beds at different aged care facilities in Perth for those leaving hospital, but it only operated in Perth.\n\nMoving away from home\n\nMs Mettam said the scarcity of residential aged care options in regional areas was of great concern.\n\nIn Northam, about 95 kilometres north-east of Perth, aged care providers estimate there is an undersupply of nearly 200 residential aged care beds, predicted to reach 350 beds by 2032, including 160 retirement accommodation places.\n\nThe town has two aged care facilities with a total of 80 beds, built in the 1970s and 80s and privately run by Juniper Aged Care.\n\nThe Shire of Northam said it was aware of 50 aged care clients who had relocated to Perth because their needs could no longer be met by the existing facilities, which were in vital need of upgrades or expansion.\n\nNortham is home to more than 12,000 people, and the town's services also cater to the wider Wheatbelt region, according to Shire President Chris Antonio.\n\nChris Antonio says there is a rising shortage of residential aged care beds. (ABC Midwest & Wheatbelt: Eliza Bidstrup)\n\n\"The ageing population, particularly our farmers, want to stay close to where they are from,\" he said.\n\n\"It is close enough that they can still go back to the farm or the town that they grew up in without having to move to the city.\n\n\"They don't want to live in the city and, by not having aged care beds, we aren't making that possible for them.\"\n\nCr Antonio said the local government was asking for state and federal government support.\n\n\"What we're doing is we're ripping out the older population from their community because we've got a shortage of beds,\" he said.\n\nCr Antonio said the shire estimated private providers would need an investment in excess of $10 million to provide the level of aged care the region needed.\n\nPeople are leaving their local communities because of a lack of available aged care places. (ABC News: Jessica Hayes)\n\nHe said Killara Adult Day Care and Respite Centre, which provided temporary care to aged care clients living at home, had taken on four clients in the past month from Northam Regional Hospital to reduce the strain on the health system.\n\nAgeing at home\n\nJuniper Aged Care chief executive Russell Bricknell said without additional Commonwealth funding for home care packages, those in need would \"pass away before they get any support\".\n\n\"If I'm an older person and I'm having to make decisions because I'm getting frailer, the absolute preference is to maintain my independence in my home, close to my community, close to my family, and getting the supports in the home,\" he said.\n\nIn a statement, federal Aged Care Minister Stuart McRae said the government was investing almost $1 billion through the Aged Care Capital Assistance Program to help providers and aged care facilities develop residential aged care homes across Australia, especially within rural and regional areas.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-31/camel-meat-and-milk-farm-summer-land-livestock-industry/105559222",
        "title": "Camel meat, milk and vodka on the menu, but feral pains persist",
        "publish_date": "Wed, 30 Jul 2025 22:18:16 +0000",
        "category": "finance",
        "authors": [],
        "text": "Across remote Australia, hundreds of thousands of wild camels are considered feral pests, with many shot and left to rot.\n\nBut in South East Queensland's Scenic Rim, they're being milked to make \"camelccinos\", lattes, gelato, and even vodka.\n\nIt's all part of farmer Paul Martin's attempt to help Australians re-imagine the camel as a sustainable livestock animal.\n\nHis ultimate plan is to build an entirely new industry from the ground up.\n\nBut to do that, he said, he must first challenge Australia's \"cultural issue with camels\".\n\n\"There are a few reasons why people are stand-offish around eating camel — but it's changing,\" Mr Martin said.\n\nPaul Martin says a camel meat and milk industry would create jobs. (ABC News: Chris Kimball)\n\nHistorically, Australian palates have preferred beef, lamb and pork over game meats, but that has not deterred Mr Martin.\n\n\"Success in this operation is basically getting camel milk and meat mainstream,\" he said.\n\nFerals 'turned loose' now milked for lattes\n\nCamels were introduced to Australia 180 years ago for use by explorers traversing unforgiving landscapes, and as a means of transporting goods over barren inland regions.\n\nBut as cars and trucks took over, Mr Martin said camels were \"labelled feral, turned loose and forgotten\".\n\n\"They were essential to opening up the country, now we're trying to give them a second chance,\" he said.\n\nExplorers prepare for an expedition into the Simpson Desert in 1939. (ABC Archives)\n\nMr Martin's farm — Summer Land — has grown into a major tourist attraction at the Scenic Rim over the past decade.\n\nVisitors can feed camels, take selfies with them, and ride them.\n\nIt's also an opportunity for them to learn about camel-based skincare products, feta and milk, as well as Summer Land's gelato and vodka.\n\nWild-caught camels being unloaded at Summer Land Camel farm. (ABC Gold Coast: Dominic Cansdale)\n\n\"Camel skincare is good for eczema, milk's good for dairy intolerance, I've just had a bad day, so I'll drink the vodka — there's something for everyone,\" Mr Martin said.\n\nBut the fastest-growing opportunity may be camel meat.\n\nWild pest to domesticated livestock\n\nEstimates of Australia's wild camel population range from 300,000 to 1 million.\n\n\"They're still being culled in large numbers,\" Summer Land tourism manager Emily Riggans said.\n\n\" We want to change everyone's perspective from pest and feral, back to resource and livestock. \"\n\nSummer Land offers camel meat pies, rolls, burgers and curries — items it hopes will start popping up on mainstream menus.\n\nBut that involves changing customers' views on camel meat.\n\nCamel meat products are popular among some parts of the community. (ABC News: Chris Kimball)\n\n\"If I did a [camel] sausage sizzle and didn't tell you, you probably wouldn't know,\" Ms Riggans said.\n\n\" It's heart-healthy, low fat and full of omega-3s. \"\n\nMs Riggans said Summer Land had found reliable markets among north African and Arab communities in south-east Queensland \"who already know camel, they grew up with it\".\n\nThey also supply restaurants and halal butchers in Brisbane and Sydney.\n\nBut getting camel accepted as a Sunday roast option is another challenge.\n\nCuriosity to customers\n\nChef Heath Betts has spent years turning exotic meats — including crocodile, buffalo and camel — into farmers market favourites.\n\nAbsolutely Sous Vide chef Heath Betts at the Brisbane markets. (ABC Gold Coast: Dominic Cansdale)\n\n\"A lot of people that turn their nose up at the products have never tried it,\" Mr Betts said.\n\nHe said the more people tried camel meat, the more popular it would become.\n\nHis market stalls in Brisbane and on the Gold Coast sell about 200 kilograms of camel meat each month.\n\nTo convert customers from beef to camel, Mr Betts said he explained the taste (\"not as gamey as people think\") and the best way to cook it (\"just like beef\").\n\n\"They'll try it, then try all the other products as well,\" he said.\n\nCamel meat can be used in pies, rolls and burgers. (ABC Gold Coast: Dominic Cansdale)\n\nBut turning camel into a standard protein alternative for customers isn't simple.\n\n\"You can't just send them through a standard abattoir. The animals don't fit, and the boners need to understand the structure,\" he said.\n\nMr Betts said that could make camel meat more expensive to sell.\n\nBut there are also environmental hurdles.\n\nWhy camel farming stirs debate\n\nAdvocacy group the Invasive Species Council warns that commercialising a declared pest makes it harder to control their populations.\n\n\"We've seen it with deer and goats — they're treated as resources, and the populations have increased,\" said Dr Carol Booth, policy director at the council.\n\nTwo juvenile camels at Summer Land in the Scenic Rim. (ABC Gold Coast: Dominic Cansdale)\n\nAustralia ended its culling program in 2013, and with estimates of up to 1 million camels running wild, their environmental impact is significant.\n\nThe council estimates that without sustained intervention, pest camel populations will double every eight to 10 years.\n\nThe animals trample native vegetation, damage water sources, compete with livestock and degrade infrastructure.\n\n\"If the claim is that this is a solution to Australia's camel problem, then we just say, that's ridiculous,\" Dr Booth said.\n\n\"It might sound like a win-win, make money and solve a problem, but in reality, it's not based on biology and it's not effective population control.\"\n\nCamels were brought to Australia 180 years ago. Now they are considered feral pests. (ABC News: Chris Kimball)\n\nWhile the Invasive Species Council remains sceptical about commercial camel farming as a strategy to control feral populations, it acknowledges sourcing some wild animals to build breeding herds could be feasible, with strict safeguards.\n\n\"If it was just taking a certain number of camels to use as breeding stock, that would [make] absolutely no difference to the population,\" Dr Booth said\n\n\"[But] it wouldn't do any harm either.\"\n\nEmily Riggans says camel products will become more popular as people learn more about them. (ABC News: Chris Kimball)\n\nPioneers in the camel industry\n\nBack on the farm, between sharing samples of camel milk vodka and guiding visitors on a farm tour, Ms Riggans remains optimistic, despite the challenges.\n\n\"If you think too much about it, it's daunting, but day to day, it's exciting,\" she said.\n\n\" I joke with my husband that I'm a pioneer in the camel industry. \"\n\nPaul Martin is keen to see camel meat on more menus around the country. (ABC Gold Coast: Dominic Cansdale)\n\nBut from paddock to plate, almost every link needed to create a new livestock chain — supply, transport, processing — has to be built from scratch.\n\n\"It's not about building a camel farm, it's about building an industry,\" Mr Martin said.\n\n\" If we can manage them, farm them, and create jobs and protein, why wouldn't we? \"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-31/inflation-in-wa-explainer/105591928",
        "title": "It leads the nation, but just how bad is inflation in Western Australia?",
        "publish_date": "Wed, 30 Jul 2025 22:12:41 +0000",
        "category": "finance",
        "authors": [],
        "text": "Thinking about the cost of living and the pressures of inflation are things we would all rather leave in the past, right?\n\nThe WA government certainly wants you to.\n\n\"The inflation beast has been tamed,\" Treasurer Rita Saffioti said in handing down this year's state budget, with its noted shift away from cost-of-living relief and towards the government's focus on diversifying the state's economy.\n\nLatest inflation figures make rates cut 'increasingly likely', economists say Photo shows Cost of living image of old hand holding cash with bills, calculator, glasses and cup of tea The \"trimmed mean\" measure of inflation — the Reserve Bank's preferred measure of underlying inflation — has also declined.\n\nBut has the beast really been tamed?\n\nThe latest inflation data from the Australian Bureau of Statistics — the authority on these things — showed an improving picture nationally which strengthens the argument for an August interest rate cut.\n\n'Responsible management'\n\nWestern Australia was the outlier, recording a 1.9 per cent increase in the cost of living between March and June, and a 2.7 per cent increase over the year — both the highest in the nation.\n\nThe vast majority of that was caused by a 116.8 per cent increase in power bills, with Commonwealth and state government rebates coming to an end.\n\nThat has added an extra $550 to most homes' power bills compared to last year.\n\n\"Thanks to our responsible management of the state finances, we've been able to provide significant cost-of-living relief to Western Australians through the worst of the cost-of-living crisis,\" was how Ms Saffioti said she saw the inflation numbers.\n\nRita Saffioti said the government had tamed the beast of inflation when she handed down the last state budget in May. (ABC News: Keane Bourke)\n\n\"When excluding the impact of electricity credits being unwound, [quarterly] Perth CPI rose by 0.7 per cent.\"\n\nIt is a line the government has often repeated since the budget: if you leave electricity out of inflation calculations, the increases are significantly lower.\n\nWhich is true, of course — across the rest of the economy, the price shocks of years gone by have significantly settled.\n\nAt one point, we were seeing annual increases of over eight per cent.\n\n\"It would be nice to exclude certain increases, [but] that's not the lived experience of people living in Western Australia at the moment,\" independent economist Conrad Liveris said.\n\nConrad Liveris says government power credits may have actually prolonged the financial pain for households. (ABC News: Keane Bourke)\n\n\" They can't actually exclude those increases. \"\n\nBecause, while having a less heated economy on the whole is helpful for people making ends meet, it does not change the fact that power bills are going up significantly over the year.\n\nThat couple of hundred extra dollars will have to come from somewhere.\n\nInflation beating wage growth\n\nAlso not helping is that wages have not kept up with rising prices, as anyone trying to balance a household budget knows.\n\nBetween March 2020 and March 2025, inflation rose 22 per cent in Perth — but wages rose only 17 per cent.\n\nThat is among the biggest gaps in the country, despite wage growth in the west being the third strongest around the nation.\n\n\"Unfortunately, Western Australian families have to pay escalating rents and mortgages whilst wages aren't budging,\" shadow treasurer Sandra Brewer told a business breakfast on Wednesday.\n\nSandra Brewer says she has seen \"no initiative\" from the state government. (ABC News: Grace Burmas)\n\n\"We've had no productive reforms in this state to drive wages above inflation and create prosperity for the people [since 2017].\n\n\"I welcome the lead of Jim Chalmers's roundtable to boost productivity and real wages because we have not seen any initiative from WA Labor.\"\n\nBand-aids ripped off\n\nAt the end of the day, though, yesterday's inflation numbers show Western Australians not only endured the second-worst increase in cost of living over the past five years, but also the longest period of pressure.\n\n\"Effectively, in one way, [the electricity credits] delayed the pain that households are experiencing and they'll have to contend with that now,\" Mr Liveris said.\n\n\" So the situation that we've got [from government power credits] has meant that the pain is actually prolonged when it comes to the cost-of-living issues. \"\n\nRipping off the multi-billion-dollar power bill credit band-aids was always going to hurt.\n\nThe question, which can only be judged with the benefit of hindsight, is whether that support was ultimately well-timed to suppress what could have been an even worse cost-of-living crisis, or whether it could have been better managed to prevent such a harsh end.\n\nInflation eased further in the June quarter, but Western Australia led the nation. (Reuters: David Gray)\n\nThe next challenge for the government to confront is how to help wages catch up with inflation in the long term and really share the prosperity of the nation's richest state with those who have helped create it.",
        "source": "ABC"
    },
    {
        "url": "https://www.smh.com.au/sport/afl/you-can-t-get-consumed-goodwin-feels-the-blowtorch-after-shattering-loss-20250731-p5mj8s.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘You can’t get consumed’: Goodwin feels the blowtorch after shattering loss",
        "publish_date": "Thu, 31 Jul 2025 12:22:51 +1000",
        "category": "sports",
        "authors": [
            "Scott Spits"
        ],
        "text": "Simon Goodwin says he feels “incredibly supported” by Melbourne’s board as the club grapples with the fallout from giving up a 46-point lead at three-quarter-time against St Kilda last Sunday to lose.\n\nThe Demons coach presented to the board barely 24 hours after the dramatic scenes at Marvel Stadium in which the Saints notched a miraculous win after Nasiah Wanganeen-Milera’s heroics, kicking the match-winning goal after the siren.\n\nDemons coach Simon Goodwin presented to the club board this week after the gut-wrenching loss to St Kilda. Credit: AFL Photos\n\nBut a defeat to last-placed West Coast at Marvel Stadium on Saturday would be catastrophic for Melbourne, who are 13th with just six wins this season.\n\n“I feel incredibly supported by the board. I have for nine years. We’ve been able to go through these challenges before with clarity and strength and stability to create success,” Goodwin said on Thursday.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/politics/victoria/gross-witch-hunt-brittany-groth-breaks-silence-to-rip-into-intrusive-tabloid-reports-20250731-p5mj7s.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘Gross witch hunt’: Brittany Groth breaks silence to rip into intrusive tabloid reports",
        "publish_date": "Thu, 31 Jul 2025 12:17:39 +1000",
        "category": "sports",
        "authors": [
            "Chip Le Grand"
        ],
        "text": "Brittany Groth, the wife of Victorian Liberal Party deputy leader Sam Groth, has slammed a “despicable” decision by the Herald Sun newspaper to publish a series of stories speculating about “when I first had sex with my husband”.\n\nIn an emotive statement, Brittany Groth said the inference that their relationship began when she was under 18 and he was her tennis coach was baseless and false and that a tabloid hit-job on her husband had “spiralled into a gross witch hunt”.\n\nSam Groth’s wife, Brittany, has slammed the Herald Sun for its reports on her relationship with her husband. Credit: Getty\n\nThe Groths have launched legal action against the paper, both for defamation and serious invasion of privacy, after it published stories questioning whether their relationship began on an improper, and potentially criminal, basis.\n\nLawyers for the couple have also initiated defamation proceedings against Victorian Health Minister Mary-Anne Thomas for comments she made in response to a question about the Groths at a press conference on Tuesday.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/racing/berry-keen-to-get-back-in-premiership-race-after-rollercoaster-ride-20250731-p5mj6n.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Berry keen to get back in premiership race after rollercoaster ride",
        "publish_date": "Thu, 31 Jul 2025 12:17:00 +1000",
        "category": "sports",
        "authors": [
            "Craig Kerry"
        ],
        "text": "After a rollercoaster season of rich wins and injury setbacks, Tommy Berry is driven to get back near the top of the Sydney jockeys premiership with a consistent run in 2025-26.\n\nAnd Berry, coming off a double last weekend at Randwick, hopes a string of wet-track chances will give him a winning start to the new campaign in town on Saturday at Rosehill.\n\nTommy Berry rides Lugh to victory at Randwick last Saturday. Credit: Getty Images\n\nThe 34-year-old had 47 NSW metropolitan winners in 2024-25 to finish eighth in the Sydney premiership won by James McDonald (83) for a seventh consecutive time and ninth victory overall.\n\nBerry had 59 wins the season before, when he made a late start because of an eight-month disqualification that halved his 2022-23 campaign. He was fourth in 2021-22 with 63 and finished in the top three the previous three seasons with 111, 76 and 77 wins.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/scrapping-surcharges-could-hit-credit-card-rewards-20250731-p5mja5.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Scrapping surcharges could hit credit card rewards",
        "publish_date": "Thu, 31 Jul 2025 12:15:59 +1000",
        "category": "finance",
        "authors": [],
        "text": "Scrapping surcharges could hit credit card rewards\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/queensland/hundreds-visited-these-drug-checking-sites-but-a-review-into-them-will-stay-secret-20250731-p5mj6o.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Hundreds visited these drug checking sites, but a review into them will stay secret",
        "publish_date": "Thu, 31 Jul 2025 12:10:33 +1000",
        "category": "finance",
        "authors": [
            "Courtney Kruk"
        ],
        "text": "About one in 10 samples tested by Queensland’s first permanent pill testing sites contained drugs people were not expecting or wanting to find, a report from the organisation running the sites has revealed.\n\nThe data formed part of an evaluation report published by The Loop on Thursday, after the state government again refused to make public the findings of an independent, taxpayer-funded study.\n\nThe Loop’s evaluation found nearly 700 visitors to the CheQpoint sites at Bowen Hills and Burleigh Heads, which operated for a few hours, one day a week, for about a year before they were defunded by the new LNP government and closed in April.\n\nBrisbane’s first and only permanent pill testing site closed in April after being defunded by the LNP government. Credit: Courtney Kruk\n\nAbout 600 of these were presentations for drug testing, including 444 from Brisbane.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/culture/art-and-design/finger-painting-of-australian-virtuoso-musician-wins-archibald-people-s-choice-20250725-p5mhwy.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Finger painting of Australian virtuoso musician wins Archibald People’s Choice",
        "publish_date": "Thu, 31 Jul 2025 12:06:19 +1000",
        "category": "entertainment",
        "authors": [
            "Linda Morris"
        ],
        "text": "In the last four years, Manila-born artist Loribelle Spirovski had come close to giving up on painting while nursing a debilitating injury that sends pins and needles into her hands and makes holding a brush difficult and painful.\n\nOn Thursday, Spirovski was named winner of the 2025 Archibald Prize People’s Choice award with a joyful portrait of yidaki (didgeridoo) virtuoso William Barton, painted entirely with gloved fingers and hands.\n\nDirector Maud Page said the portrait was painted under incredible duress and with resilience which captured the energy and spirit of Barton.\n\nPeople’s choice: Loribelle Spirovski with subject William Barton Credit: Steven Siewert\n\nSpirovski said when she first met Barton she was too shy to ask him to sit for her and worried she might not be able to do his talent justice. “I can never thank you enough Will.”",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/business/the-economy/the-man-who-isn-t-listening-to-trump-s-golden-age-story-20250731-p5mj6v.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "The man who isn’t listening to Trump’s ‘Golden Age’ story",
        "publish_date": "Thu, 31 Jul 2025 12:00:09 +1000",
        "category": "finance",
        "authors": [
            "Stephen Bartholomeusz"
        ],
        "text": "“A reasonable base case is that the effects on inflation could be short-lived, reflecting a one-time shift in the price level. “But, it is also possible that the inflationary effects could instead be more persistent, and that is a risk to be assessed and managed,” he said. It might not be until well into next year or even beyond that a clearer picture of the effects of the trade wars and whether they are transitory or entrenched is available. Credit: Bloomberg “We’re going to need to see the data, and it can go in many different directions. We’re going to make a judgement based on all of the data.” The data to date appears benign. The economy grew at an apparently very robust 3 per cent annualised rate in the June quarter, prompting the White House to claim it as evidence that Trump’s policies have ignited a new “Golden Age.”\n\nBeneath the headline number, however, things weren’t quite as golden. In the first quarter of the year the economy actually contracted, as companies front-loaded their imports to get in ahead of Trump’s tariffs. In the June quarter, those bloated inventories were run down and imports fell away. If the first half is looked at as a whole, the economy grew at an annualised rate of 1.25 per cent. In the same half last year, when Joe Biden was in the White House, it grew at 2.3 per cent. Moreover, the US inflation rate, at 2.7 per cent, is still above the Fed’s target of 2 per cent and, even before the bulk of Trump’s tariffs are active, there are signs of tariff-related goods inflation. To date, on the available data, there is no evidence of a need to reduce rates. Indeed, a case could be mounted for a rate rise. Powell said he still expected tariffs to flow through to consumer prices but that the process might be slower than expected and that some companies might be finding it difficult to fully pass on the costs to consumers because consumers were unwilling or unable to pay higher prices.\n\nA case in point is the US car manufacturing sector, where the companies have yet to raise their prices despite substantial tariff-related cost increases. General Motors has estimated the tariffs will cost it between $US4 billion and $US5 billion ($6.2 billion-$7.8 billion) this year. Ford said on Wednesday that the tariffs would cost it $US3 billion this year. Loading Some US companies are starting to raise prices. Amazon, Walmart and other retailers have said they will have to raise some prices and, also on Wednesday, the giant consumer products group, Procter & Gamble, said it would raise prices on about a quarter of its product range because it expects a $US1 billion hit from the tariffs. In theory, the tariffs should produce a one-time impact on prices and inflation. The complex layers of duties Trump has imposed on raw materials, semi-finished and finished goods, the messy way in which the tariffs are being rolled out and the degree of uncertainty in what the final trade picture will look like, given the key deals with major trading partners are more statements of intent rather than conventional detailed and binding trade agreements, however, complicates evaluations of their effects.\n\nPowell said it was a “very dynamic time” for trade negotiations but “we are still aways away from seeing where things settle down.” “What we see now is, basically, the very beginning of whatever the effects turn out to be on goods inflation. They may be less than people estimate, or more than people estimate. They are not going to be zero. “Consumers will pay some of this. Businesses will pay some of this. Retailers will pay some of this. We’re just going to have to see it through,” he said. Trump has been piling on the pressure on Powell, even using a blowout in the costs of the Fed’s renovations of its Washington headquarters to try to pressure him to resign or provide an excuse to fire him “for cause.”\n\nHe wants lower interest rates to help generate greater economic growth and lower the cost of servicing the US government’s soaring debt levels – debt that will increase substantially as a result of his “One Big Beautiful Bill” that cut taxes and increased spending. Powell said the government’s interest costs weren’t something the Fed took into account. “We have a mandate and that’s maximum employment and price stability. We don’t consider the fiscal needs of the federal government. It’s just not something we take into consideration,” he said. He also left open the possibility that, after his term as chair ends next year, he might serve out the rest of his term as a governor, which doesn’t end until 2028, despite the administration saying that he should, as other chairs have, leave the board when he relinquishes the chair. Trump is going to appoint a successor to Powell who will do his bidding, or at least try to. The administration expects to appoint that person in the near term and hopes that they will, before they displace Powell, effectively become a “shadow” chair whose views influence the Fed and markets and overshadows Powell’s.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/lifestyle/fashion/the-hero-of-your-winter-wardrobe-is-the-garment-you-might-least-expect-20250722-p5mh04.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "The hero of your winter wardrobe is the garment you might least expect",
        "publish_date": "Thu, 31 Jul 2025 12:00:00 +1000",
        "category": "lifestyle",
        "authors": [
            "Damien Woolnough"
        ],
        "text": "Save Log in , register or subscribe to save articles for later. Save articles for later Add articles to your saved list and come back to them any time. Got it Normal text size Larger text size Very large text size The turtleneck has escaped its style sentence as the trusty uniform for women of a certain age who imagine that they’re Diane Keaton in a romantic comedy and computer nerds following in the white sneaker steps of Apple founder Steve Jobs. Also known as the skivvy or polo neck, the turtleneck received a get-out-of-fashion-jail-free card at the Celine runway presentation in Paris during the most recent haute couture season. Extravagant gowns encrusted with pearls or diamonds usually steal the haute couture show, but the debut of American designer Michael Rider at the French fashion house placed humble white turtlenecks front and centre. Uniqlo cashmere turtleneck (worn throughout), $130. Max Mara sleeveless coat, $4285, belt, $640, and pants, $1610. Weekend Max Mara x Sebago loafers, $915. Credit: Bec Parsons Rider may have been inspired by former Celine designer and turtleneck devotee Phoebe Philo but his runway masterclass restored the wardrobe staple of Audrey Hepburn and Marilyn Monroe to its former free-spirited glory. Here’s how to style a turtleneck and keep your cool while staying warm. For beginners: On its own The easiest way to embrace the turtleneck is to wear it with jeans or trousers as an alternative to bulky jumpers. Remember to balance out the snug fit of a thin turtleneck with straight-leg or wide pants or jeans.\n\nAdvertisement\n\nMarilyn Monroe wore her black turtleneck with checked capri pants and Audrey Hepburn with black tights, playing a beatnik in the classic musical Funny Face. Most of us are neither bombshells nor beatniks and more than 60 years have passed, so let’s loosen up. Max Mara jacket, $2945. Courtney Zheng “Elsje” dress, $600 (belt included). Credit: Bec Parsons One trend from the last millennium worth holding on to is feminist Gloria Steinem’s turtlenecks paired with long, statement silver necklaces from the 1970s. It’s not just groovy, it’s liberating. Intermediate: Beneath a jacket A turtleneck is a streamlined alternative to wearing a blouse beneath a blazer or jacket. When it comes to layering, the thinner the turtleneck the better. A white turtleneck breaking up double denim looks better than Jake Gyllenhaal breaking up fights in Road House. If you’re self-conscious about your curves, try wearing the turtleneck untucked to lengthen your silhouette. Otherwise, tuck it in and break out your best belt. Max Mara jacket, $2945. Deering “Gossamer” skirt, $280. Celine “Triomphe” sunglasses, POA. Credit: Bec Parsons\n\nAdvertisement\n\nIf you’re after a monochrome approach, pairing a white turtleneck with a white jacket, or a black turtleneck with a black jacket, be prepared to play with textures. The cotton, wool or cashmere (if you’re fancy) of a turtleneck provides a delightful on-trend contrast with a crackly leather jacket or the sleek satin lapel of a dinner jacket. Sharon Stone’s black turtleneck worn beneath a black velvet jacket at the 1996 Academy Awards remains an inspiration to many stylists for a very good reason. Expert: Beneath a shirt The Parisian staple of a white turtleneck beneath a white collared shirt, worn with jeans and leather boots, is the height of trans-seasonal chic. Once again, make sure the turtleneck is fitted but let the shirt billow. Look for a shirt with a classic rather than tailored fit and remember, you can undo as many buttons as you like without having to worry about stiff breezes. Celine cashmere jacket, POA, silk blouse, POA, “Marco” jeans, $1700, and sneakers, $1350. Credit: Bec Parsons A black turtleneck with a white shirt and jeans also works but be careful of straying into the coastal grandma trend, exemplified by Diane Keaton, of white, on white, on white. If you take this path, be prepared for stares and stains. For the office, match your trousers with your turtleneck before layering with a white shirt. Grey and black work brilliantly, with white acting as a crisp contrast. Break out the starch because stiff cotton shirts work best with relaxed knits.\n\nAdvertisement",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/business/companies/heading-to-italy-or-france-get-ready-to-pay-a-new-35-fee-20250731-p5mj6x.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Heading to Italy or France? Get ready to pay a new $35 fee",
        "publish_date": "Thu, 31 Jul 2025 11:54:53 +1000",
        "category": "finance",
        "authors": [
            "Chris Zappone"
        ],
        "text": "Australians travelling to Italy, Spain, and France will be slugged with a new fee next year, which appears to be part of a trend making overseas travel more expensive.\n\nAustralians will need to pay €20 ($35.44) per application to visit the bloc of 30 EU states in the Schengen visa-free travel zone, once the European Travel Information and Authorisation System (or ETIAS) becomes operational for visitors next year.\n\nThe town of Monopoli in Italy’s region of Puglia. Europe is hiking its fee for entry to the Schengen zone. Credit: Getty Images/iStockphoto\n\nThe travel authorisation fee was originally slated to cost €7 ($12.40), but the EU settled on a higher cost.\n\nThe ETIAS fee will capture most Australian visitors to Europe - and will function a bit like the US ESTA visa waiver, or the UK Electronic Travel Authorisation.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/australia-recognising-palestinian-statehood-a-matter-of-when-not-if-20250731-p5mj9n.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Australia recognising Palestinian statehood a matter of 'when, not if'",
        "publish_date": "Thu, 31 Jul 2025 11:51:21 +1000",
        "category": "finance",
        "authors": [],
        "text": "Australia recognising Palestinian statehood a matter of 'when, not if'\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/lifestyle/bride-shares-her-mums-brutal-reactions-to-wedding-dresses-20250731-p5mj9m.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Bride shares her mum's brutal reactions to wedding dresses",
        "publish_date": "Thu, 31 Jul 2025 11:50:24 +1000",
        "category": "lifestyle",
        "authors": [],
        "text": "Bride shares her mum's brutal reactions to wedding dresses\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/hecs-debt-bill-passes-through-parliament-midday-news-bulletin-31-july-2025/d1smyyijc",
        "title": "HECS debt bill passes through parliament | Midday News Bulletin 31 July 2025",
        "publish_date": "Thu, 31 Jul 2025 02:13:00 +0000",
        "category": "finance",
        "authors": [],
        "text": "\n\n\n\nListen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nMillions of students will have their debts reduced, after a HECS debt bill passed through parliament\n\nIsrael under increasing pressure over Gaza, ahead of US talks in coming hours...\n\nHarrison Turner claims Australia's first-ever world championship medal for 200 metre butterfly\n\n\n\nThree million Australian students will have their education debts reduced, after Labor's highly-anticipated student debt bill passed through Parliament today.\n\n\n\n\n\nThe Albanese government introduced the HECS debt bill to cut 20 per cent from existing university and TAFE debts as its first order of business last week.\n\n\n\n\n\nThe laws aim to reduce student debt as well as reform the repayment system.\n\n\n\n\n\nThe cut will apply to debt levels retrospectively, before the 1 June indexation, but will take a few months for the Australian Tax Office to implement.\n\n\n\n\n\nBalances are expected to be revised by the end of the year, saving students and graduates roughly $16 billion.\n\n\n\n\n\nIsrael is under increasing pressure to ease the deepening humanitarian crisis in Gaza, with Canada the latest country to move to recognise Palestinian statehood and a U-S envoy en route to the Middle East.\n\n\n\n\n\nThe Trump Administration's representative, Steve Witkoff, is due to arrive in Israel later today for talks on the situation in Gaza.\n\n\n\n\n\nThe Israeli military has reported that 220 aid trucks have entered Gaza on Tuesday.\n\n\n\n\n\nUN agencies are calling for 500 to 600 a day, to meet the needs of a population aid agencies say is starving.\n\n\n\n\n\nCanada's intention to recognise Palestinian statehood was announced in recent hours and Prime Minister Mark Carney says it is subject to conditions.\n\n\n\n\n\n\"This intention is predicated on the Palestinian Authority's commitment to much-needed reforms, including commitments by its president, Mahmoud Abbas, to reform its governance and to hold general elections in 2026 in which Hamas can take no part and to demilitarize the Palestinian state. Canada will increase its efforts to support strong democratic governance in Palestine and contributions of its people to a more peaceful and hopeful future.\"\n\n\n\n\n\nThe World Health Organisation says it has helped evacuate 47 critically ill patients and 129 of their companions from Gaza this week.\n\n\n\n\n\nUnited Nations spokesperson Farhan Haq says the Office for the Coordination of Humanitarian Affairs is alarmed by an increase in hunger, disease and displacement in famine-stricken regions of Sudan.\n\n\n\n\n\nThe Sudan Doctors Network says thirteen children died of malnutrition-related causes last month in a camp for displaced people in the western Darfur region of Sudan, where civil war has created the world’s worst humanitarian crisis.\n\n\n\n\n\nUNICEF reports a 46 per cent increase in the most deadly form of malnutrition among children in Darfur, compared with the same period last year.\n\n\n\n\n\nAid groups have pleaded for the warring sides to allow in more humanitarian assistance.\n\n\n\n\n\nMr Haq says the besieged city of Al-Fashir in Darfur is one of the worst-affected sites.\n\n\n\n\n\n\"In the besieged city of Al-Fashir, the state capital of North Darfur, local sources report that people are dying from hunger and malnutrition. Community-run kitchens have shut down due to lack of food stocks, and some residents have reportedly resorted to consuming animal feed. These cascading crises demand increased international support. The 2025 response plan seeking $4.2 billion to assist 21 million of the most vulnerable people across Sudan is currently 23 per cent funded.”\n\n\n\n\n\nMillions of people on coastlines across 12 countries, have returned home after being evacuated overnight.\n\n\n\n\n\nA tsunami warning has been downgraded in Japan and Hawaiian authorities are reporting minimal damage, after one of the strongest ever earthquakes was recorded off Russia.\n\n\n\n\n\nParts of Japan, including Hokkaido Prefecture and the Tohoku region, recorded a 60 centimetre swell.\n\n\n\n\n\nThere had been fears of a life-threatening tsunami for a number of countries after the 8.8 magnitude quake, but so far there have been only few minor injuries reported.\n\n\n\n\n\nWhat could be Australia's heaviest insect has been identified in northern Australia's high altitude rainforests.\n\n\n\n\n\nThe supersized stick insect, which is about 40cm long, was discovered in high altitude trees in Millaa Millaa in Queensland's Atherton Tablelands.\n\n\n\n\n\nIdentified by James Cook University researchers, the female specimen weighed 44g, significantly heftier than Australia's heaviest insect, the up-to 30g giant wood moth.\n\n\n\n\n\nThe next step in identifying and eventually naming the species is finding a male, which is proving difficult, due to the male's significantly smaller size.\n\n\n\n\n\nTo sport now and in swimming,\n\n\n\n\n\n21 year-old Harrison Turner has made history, securing Australia's first world championship medal in the mens' 200-metre butterfly.\n\n\n\n\n\nTaking the bronze medal, Turner toppled a 16-year national record, despite only just scraping into the finals of the event.\n\n\n\n\n\n\"If you told me I was gonna win a, sorry a bronze medal at the start of the year with a pb (personal best) of 1.57 (minutes) I would have said nah you're dreaming. So, I am lost for words.\"\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/tour-de-france-femmes-gigante-makes-big-move-as-chapman-shows-her-fight/exabrhvml",
        "title": "Tour de France Femmes: Gigante makes big move as Chapman shows her fight",
        "publish_date": "Thu, 31 Jul 2025 02:05:14 +0000",
        "category": "sports",
        "authors": [],
        "text": "Australia's Sarah Gigante has powered into the leading group at the Tour de France Femmes after a battling display during a marathon 165.8km ride from Jaunay-Marigny to Gueret.\n\n\n\n\n\nShe crossed the line at the end of the fifth stage just behind AG Insurance-Soudal teammate Kimberley Le Court Pienaar, the Mauritian who thus became the first African to win a stage at the Tour de France Femmes.\n\n\n\n\n\nIt meant a big move up the general classification for Gigante, the 24-year-old Victorian who climbed from 19th at the start of the day to eighth place, 55 seconds behind Le Court.\n\n\n\nChapman dropped back to finish 54th and and is 76th overall, 24:23 behind Le Court. But her efforts secured her the award for the most combative rider of the day.\n\n\n\n\n\nThe 29-year-old Le Court, who led the general classification after stage two but was overtaken by Marianne Vos (Visma-Lease a Bike), won a breakneck downhill push to the finish that included Gigante, edging out 2023 champion Demi Vollering.\n\n\n\n\n\nThe fifth stage, the longest in the Tour this year, went through relatively flat terrain before three climbs in the final 35km and saw several failed breakaway attempts as the peloton covered 46.5km in the first hour despite multiple crashes.\n\n\n\nGreen jersey holder Lorena Wiebes (SD Worx-Protime) recovered from a crash to rejoin the peloton, but struggled to keep up after the first climb, ultimately finishing 58th.\n\n\n\n\n\nAmerican Olympic champion Kristen Faulkner (EF Education-Oatly) abandoned the race after her third crash in three days. Maria Giulia Confalonieri, Elisa Balsamo and Monica Trinca Colonel also quit the race.\n\n\n\n\n\nVos, who stayed in the peloton behind a leading group for most of the race, attacked in the final 15km during the mountainous part of the stage, but fell behind during the final uphill push, dropping to sixth in the general classification.\n\n\n\n\n\nVollering (FDJ-Suez) rose to third overall, while Pauline Ferrand Prevot (Visma-Lease a Bike) moved up to second, sitting 18 seconds behind Le Court in the general classification.\n\n\n\n\n\nThe Tour continues on Thursday with a mountainous 123.7km ride from Clermont-Ferrand to Ambert.\n\n\n\n\n\nFor the latest from SBS News, download our app and subscribe to our newsletter .\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/labor-has-passed-its-student-debt-cut-when-will-you-see-the-changes/73zlarrnq",
        "title": "Labor has passed its student debt cuts. When will you see the changes?",
        "publish_date": "Thu, 31 Jul 2025 01:02:15 +0000",
        "category": "finance",
        "authors": [],
        "text": "Three million Australians will have their student debt slashed as Labor passed the highly anticipated legislation through parliament.\n\n\n\n\n\nAs promised to voters, the Albanese government introduced the HECS debt bill to cut 20 per cent from existing university and TAFE debts as its first order of business last week.\n\n\n\n\n\nIt passed the Senate on Thursday morning, 36 votes to three. Crossbenchers David Pocock, Fatima Payman, and Tammy Tyrrell all voted with the government and the Greens.\n\n\n\n\n\nEducation Minister Jason Clare said the average $5,500 that Australians would save is a \"big deal\".\n\n\n\n\"That's a lot of weight off their back, and it will help a lot of young people that might be just out of uni, just out of home, just getting started,\" he told reporters before introducing the bill in the House of Representatives.\n\n\n\n\n\nThe laws aim to reduce student debt as well as reform the repayment system.\n\n\n\n\n\nHere's how they'll work.\n\n\n\nWhen can I expect my student debt reduction?\n\nThe Universities Accord Bill will apply a one-off reduction to student support loans including HELP, VET Student Loan and the Australian Apprenticeship Support Loan.\n\n\n\n\n\nThe cut will apply to debt levels retrospectively, before the 1 June indexation, but will take a few months for the Australian Tax Office to implement.\n\n\n\n\n\nBalances are expected to be revised by the end of the year, saving students and graduates roughly $16 billion.\n\n\n\nOpposition education spokesperson Jonno Duniam admitted the Coalition's position was \"a view that was not supported by Australians\", conceding \"we'll work\" with the government.\n\n\n\nHow is the repayment system changing?\n\nThe changes include reforms to the repayment system, ensuring compulsory repayments are marginal, as recommended by the Australian University Accord.\n\n\n\n\n\nThe threshold at which students are required to start paying back their loans will be lifted from $54,435 to $67,000.\n\n\n\n\n\nUnder the old system, an Australian earning $70,000 would have paid back $1,750 annually. Following the changes, this will be reduced by $1,300 to $450.\n\n\n\nREAD MORE How does a HECS debt affect your home loan borrowing power?\n\nThe measures are a recognition that course fees have increased — spiking under the Morrison government's Jobs-ready Graduates package — and younger Australians are paying high fees at a time when they are also looking to buy their first homes and start a family.\n\n\n\n\n\nThe adjustments do not apply to people earning above $180,000.\n\n\n\nCould other reforms be on the way?\n\nClare has flagged that further reforms are being looked at, particularly concerning the former Liberal government's job-ready graduates program.\n\n\n\n\n\nThe program aimed to fill skills shortages by making it cheaper to take courses such as teaching, nursing and psychology, while doubling the cost of popular degrees including law, communications, business, humanities and the arts.\n\n\n\n\n\nThe universities' accord final report branded the program \"deeply unfair\" last year, recommending that fees reflect future earning potential as part of 47 recommendations to reform the sector.\n\n\n\n\n\nUniversities Australia chief executive Luke Sheehy has welcomed the HECS bill but called on the government to repeal the jobs-ready graduates scheme.\n\n\n\n\n\nBruce Chapman, the economist who developed the HECS system, similarly said the top priority should be reviewing the price of each degree, because humanities students finish with the highest level of debt and end up being the lowest-paid graduates.\n\n\n\n\n\n— With additional reporting by the Australian Associated Press\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/video/growing-calls-for-tougher-regulations-around-ai/81icatvkq",
        "title": "Growing calls for tougher regulations around AI",
        "publish_date": "Wed, 30 Jul 2025 09:33:09 +0000",
        "category": "finance",
        "authors": [],
        "text": "Growing calls for tougher regulations around AI\n\nPublished 30 July 2025, 7:51 am\n\nThere are growing calls for tougher regulations around the rollout of AI in the workplace as the technology seemingly integrates its way into our everyday lives. Students at a top Sydney university are petitioning against a course seeking to incorporate the use of Generative AI in art. It comes as Australia's largest bank replaces 45 call centre employees with AI chat-bots.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/video/the-government-will-include-youtube-in-its-kids-social-media-ban/494cdmf3a",
        "title": "The Government will include YouTube in its kids social media ban",
        "publish_date": "Wed, 30 Jul 2025 09:29:55 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/could-do-better-naplan-results-show-many-children-arent-meeting-expectations/t2lu310lc",
        "title": "Could do better - NAPLAN results show many children aren't meeting expectations",
        "publish_date": "Wed, 30 Jul 2025 07:54:23 +0000",
        "category": "finance",
        "authors": [],
        "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nThe report-card is in and it shows little to no improvement from last year's NAPLAN results.\n\n\n\nThis year's tests indicate one in three students across years three, five, seven and nine aren't meeting academic expectations across reading, numeracy and writing.\n\n\n\nThe Deputy Program Director of the Grattan Institute's Education program, Amy Haywood, says if those education benchmarks aren't met then students will fall more and more behind.\n\n\n\n'We should be concerned because that number hasn't really budged since over the last three years of testing and we know it's actually worse for disadvantaged students, so our First Nations students, students whose parents you may not have finished high schools and also those kids that live outside of metro areas in more rural and remote areas of the country.'\n\n\n\nAround 10 per cent of students have been assessed as needing extra support to catch up to their peers.\n\n\n\n\n\n'And that's a really frustrating experience for an individual student and it's pretty demoralising sitting in class feeling like you're not sure what's going on.'\n\n\n\nThe Northern Territory, a region which has the largest proportion of Indigenous students... has fared the worst in the country.\n\n\n\nThe results are unsurprising for former Northern Territory school principal Dr Gary Fry.\n\n\n\n'Northern Territory has since 2008 when national assessment commenced, has always been on the bottom of the rankings. One of the problems that I've seen for a very long time, has been the lack of Indigenous representation in the key decision making layers of the organisation.'\n\n\n\nHe says bi-culture education is one solution to improve academic performance.\n\n\n\n'The Yirrkala School back in 2021 celebrated eight students who completed year 12 with ATAR scores that allowed them to go into any Australian university, they did so through a two-way bi-lingual program which the community has been driving for many, many years.'\n\n\n\nFiona Longmuir, a senior lecturer from Monash University's School of Education says the results are an annual wake-up call for the sector.\n\n\n\n'It is 100% not a good indicator of teaching performance at all, what NAPLAN tells us most years, is that our system is incredibly inequitable, we need more funding, we need more resources and we need more support for our schools and teachers.\n\n\n\nThe federal government says it has made the biggest investment in public schools ... worth $16 billion over the next 10 years with funding tied to real and practical reforms.\n\n\n\nDespite some stagnating results, however, there were some positive take-aways.\n\n\n\nTwo out of three students were at the 'strong' or 'exceeding' level across all skills while Indigenous students in years 7 and 9 were at the \"Exceeding\" level in writing and numeracy - an improvement over the past three years.\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/easing-inflation-opens-door-for-august-interest-rate-cut/gkquae51m",
        "title": "Easing inflation opens door for August interest rate cut",
        "publish_date": "Wed, 30 Jul 2025 07:39:58 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/rate-cut-outlook-firms-after-outstanding-inflation-data/f2yqsh7mq",
        "title": "Rate cut outlook firms as RBA gets the 'outstanding' inflation data it was waiting for",
        "publish_date": "Wed, 30 Jul 2025 05:43:13 +0000",
        "category": "finance",
        "authors": [],
        "text": "The Reserve Bank of Australia (RBA) looks all but guaranteed to cut rates next month, after both annual headline and underlying inflation fell in the June quarter.\n\n\n\n\n\nThe Australian Bureau of Statistics released its June quarter consumer price index (CPI) data on Wednesday, with annual trimmed mean inflation — the RBA's preferred measure — at 2.7 per cent in the year to 30 June, down from an annual rate of 2.9 per cent in the March quarter.\n\n\n\n\n\nIt's the first time trimmed mean inflation — a measure of underlying inflation that removes the biggest price swings — has been that low since December 2021, and the second quarter it has been within the RBA's target band of 2-3 per cent.\n\n\n\n\n\nHeadline inflation rose 0.7 per cent in the June quarter and 2.1 per cent annually, down from 0.9 and 2.4 per cent respectively in the March quarter. It's the lowest annual inflation rate since the March 2021 quarter.\n\n\n\nTreasurer Jim Chalmers has celebrated the figures.\n\n\n\n\n\n\"Today's inflation numbers are outstanding,\" he told Sky News. \"There's no two ways about it.\"\n\n\n\nInflation data key to Reserve Bank's next interest rate decision\n\nThe RBA kept rates on hold at 3.85 per cent earlier this month, defying expectations of a third cut this year following 0.25 per cent decreases in both February and May.\n\n\n\n\n\nAt the time, RBA governor Michele Bullock said the inflation data would be a key factor ahead of the board's next meeting on 12 August, to determine whether or not inflation was still on track to sustainably reach 2.5 per cent.\n\n\n\n\"Provided we are still on top of inflation, which is what we intend to be, then, and we're getting confirmation that we are, then, yes, there is an easing cycle coming,\" she said.\n\n\n\n\n\n\"We just want to confirm with a full quarterly CPI that we're still on track to deliver inflation continuing down to the middle of the band over time.\n\n\n\n\n\n\"That's the reason we're waiting. We decided to hold and we'll reconsider again in August with this extra information and new forecasts. And that will allow us to decide whether or not we're still on track for continuing to ease.\"\n\n\n\nThe Reserve Bank kept interest rates at 3.85 per cent earlier this month. Source: SBS News The 'big four' banks — Commonwealth Bank, Westpac, NAB and ANZ — all agree the next rate cut will come in August, at 0.25 per cent.\n\n\n\n\n\nSally Tindall, financial comparison site Canstar's data insights director, said Wednesday's figures were \"the confirmation the RBA has been waiting for\".\n\n\n\n\n\n\"Inflation is back into the target band for the second quarter in a row and continuing to track towards the mid-point of 2.5 per cent, giving the RBA a clear runway to continue easing rates,\" she said.\n\n\n\n\n\nTindall said the numbers, combined with a surprise lift in Australia's unemployment rate , should be \"more than enough for the RBA to pull the trigger on the third cash rate cut for the year\".\n\n\n\n\n\n— Additional reporting by the Australian Associated Press\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/what-to-know-about-under-16s-social-media-ban/cunrckq5u",
        "title": "'We can police the sharks': Australia's looming social media ban explained",
        "publish_date": "Wed, 30 Jul 2025 04:38:26 +0000",
        "category": "finance",
        "authors": [],
        "text": "The Australian government will soon implement social media restrictions for under-16s, as part of its push to protect young people and prioritise \"parents ahead of platforms\".\n\n\n\n\n\nThe government has announced, after months of speculation, that YouTube will be included in its ban , while also tabling which types of online services will be exempt from the rules.\n\n\n\n\n\n\"We know that social media is doing social harm, and my government and this parliament is prepared to take action to protect young Australians,\" Prime Minister Anthony Albanese said on Wednesday, alongside Communications Minister Anika Wells.\n\n\n\n\n\nWells said the government was \"prioritising parents over platforms\" and that it wouldn't be \"intimidated\" by tech companies.\n\n\n\n\n\n\"We are implementing these rules and this law on behalf of parents who want and deserve better protection for their kids online. We want kids to know who they are before platforms assume who they are.\"\n\n\n\nCommunications Minister Anika Wells said the government is putting parents ahead of platforms. Source: AAP / Mick Tsikas\n\nHow will the ban work?\n\nLast November, the government passed a new law to establish a minimum age of 16 to access social media.\n\n\n\n\n\nUnder the world-first legislation, \"age-restricted social media platforms\" will have to take \"reasonable\" steps to prevent children under this age from having accounts on their service.\n\n\n\n\n\nPlatforms will face fines of up to $49.5 million for failing to comply with the law.\n\n\n\n\n\nWhen it comes to enforcement, Wells described \"working rules\" that will not be \"set and forget\", adding the onus is on social media companies to work with the eSafety commissioner in determining what this looks like on their individual platforms.\n\n\n\n\n\n\"Social media platforms have been on notice since December last year that this was coming,\" she said.\n\n\n\n\n\nWells outlined four \"reasonable steps\", including deactivating existing accounts, ensuring no new accounts are activated, implementing workarounds and correcting errors.\n\n\n\nREAD MORE Will the tech behind the teen social media ban work? These questions remain unanswered\n\n\"Kids, God bless them, are going to find a way around this, and maybe they are all going to swarm on LinkedIn, we don't know,\" Wells said.\n\n\n\n\n\n\"These are meant to be working rules, and they also need to correct any errors as they arise.\"\n\n\n\n\n\nFor users over the age of 16, Wells said the government is awaiting the final recommendations from its age assurance trial.\n\n\n\nWhich platforms will be included in the ban?\n\nAccording to the government, and in consultation with eSafety Commissioner Julie Inman Grant, age-restricted social media platforms will include Facebook, Instagram, Snapchat, TikTok, X and YouTube, among other platforms.\n\n\n\n\n\nWhen the legislation was passed by parliament, YouTube was one of a handful of platforms listed as exempt because they were \"out of scope\" of the policy. However, last month, Inman Grant wrote to Wells, making a formal recommendation that YouTube be included among the banned platforms.\n\n\n\n\n\nInman Grant said the recommendation was based on research conducted by eSafety, which found YouTube was the most prevalent social media platform young Australians were accessing, and also the most frequent place they were experiencing harm online.\n\n\n\nThe restrictions placed on YouTube will allow the YouTube Kids platform to operate, and minors will also be able to watch videos on the website in a logged-out state or under parental supervision.\n\n\n\n\n\nBut under-16s will not be allowed to have active YouTube accounts or subscribe to YouTube channels.\n\n\n\n\n\nUnlike many of the other platforms included in the ban, YouTube doesn't require users to have an account or be logged in to access content.\n\n\n\nOnline gaming, messaging apps, health and education services won't be included.\n\n\n\n\n\n\"These types of online services have been excluded from the minimum age obligations because they pose fewer social media harms to under-16s,\" Wells said.\n\n\n\n\n\n\"All services that meet the definition of age-restricted social media platforms, and are not specifically excluded in the rules, will be subject to the social media minimum age law.\"\n\n\n\nWhen will the ban come into effect?\n\nThe law will come into effect from 10 December this year.\n\n\n\n\n\nWells acknowledged \"there is no perfect solution\" when it comes to keeping young people safe online, but that the law \"will make a meaningful difference\".\n\n\n\n\n\n\"As parents, we are really trying our best when it comes to the internet. But it is like trying to teach your kids how to swim in the open ocean, with the rips and the sharks, compared to at the local council pool. We can't control the ocean, but we can police the sharks,\" Wells said.\n\n\n\nWe can't control the ocean, but we can police the sharks. Communications Minister Anika Wells\n\n\"That's why we will not be intimidated by legal threats when this is a genuine fight for the wellbeing of Australian kids.\"\n\n\n\nHow have social media platforms responded?\n\nA YouTube spokesperson said in a statement posted on its parent company Google's blog on Wednesday that the company shares the government's goal of reducing harm.\n\n\n\n\n\n\"Our position remains clear: YouTube is a video sharing platform with a library of free, high-quality content, increasingly viewed on TV screens. It's not social media,\" they said, adding the decision reverses a public commitment to exclude YouTube from the ban, and that it would consider next steps.\n\n\n\n\n\nGoogle had this week written to Wells, asking her \"to uphold the integrity of the legislative process and protect the age-appropriate experiences and safeguards we provide for young Australians\".\n\n\n\n\n\nThe company warned it would consider its legal options if included in the ban, warning the restrictions could impact the implied constitutional freedom of political communications.\n\n\n\nInman Grant has rejected claims the decision would impact educators and schools.\n\n\n\n\n\nWhen the laws passed , Meta, the parent company of Facebook and Instagram, said it maintained there was a lack of evidence associating youth mental health with social media. Both Meta and TikTok described a rushed process.\n\n\n\n\n\nEarlier this month, Meta announced expanded protections for teen accounts and child safety features.\n\n\n\n\n\nTikTok has also been featuring ads promoting its educational benefits for teens.\n\n\n\n\n\n— With additional reporting from Alex Gallagher and Naveen Razik.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.theage.com.au/sport/afl/you-can-t-get-consumed-goodwin-feels-the-blowtorch-after-shattering-loss-20250731-p5mj8s.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘You can’t get consumed’: Goodwin feels the blowtorch after shattering loss",
        "publish_date": "Thu, 31 Jul 2025 12:22:51 +1000",
        "category": "sports",
        "authors": [
            "Scott Spits"
        ],
        "text": "Simon Goodwin says he feels “incredibly supported” by Melbourne’s board as the club grapples with the fallout from giving up a 46-point lead at three-quarter-time against St Kilda last Sunday to lose.\n\nThe Demons coach presented to the board barely 24 hours after the dramatic scenes at Marvel Stadium in which the Saints notched a miraculous win after Nasiah Wanganeen-Milera’s heroics, kicking the match-winning goal after the siren.\n\nDemons coach Simon Goodwin presented to the club board this week after the gut-wrenching loss to St Kilda. Credit: AFL Photos\n\nBut a defeat to last-placed West Coast at Marvel Stadium on Saturday would be catastrophic for Melbourne, who are 13th with just six wins this season.\n\n“I feel incredibly supported by the board. I have for nine years. We’ve been able to go through these challenges before with clarity and strength and stability to create success,” Goodwin said on Thursday.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/politics/victoria/gross-witch-hunt-brittany-groth-breaks-silence-to-rip-into-intrusive-tabloid-reports-20250731-p5mj7s.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘Gross witch hunt’: Brittany Groth breaks silence to rip into intrusive tabloid reports",
        "publish_date": "Thu, 31 Jul 2025 12:17:39 +1000",
        "category": "sports",
        "authors": [
            "Chip Le Grand"
        ],
        "text": "Brittany Groth, the wife of Victorian Liberal Party deputy leader Sam Groth, has slammed a “despicable” decision by the Herald Sun newspaper to publish a series of stories speculating about “when I first had sex with my husband”.\n\nIn an emotive statement, Brittany Groth said the inference that their relationship began when she was under 18 and he was her tennis coach was baseless and false and that a tabloid hit-job on her husband had “spiralled into a gross witch hunt”.\n\nSam Groth’s wife, Brittany, has slammed the Herald Sun for its reports on her relationship with her husband. Credit: Getty\n\nThe Groths have launched legal action against the paper, both for defamation and serious invasion of privacy, after it published stories questioning whether their relationship began on an improper, and potentially criminal, basis.\n\nLawyers for the couple have also initiated defamation proceedings against Victorian Health Minister Mary-Anne Thomas for comments she made in response to a question about the Groths at a press conference on Tuesday.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/racing/berry-keen-to-get-back-in-premiership-race-after-rollercoaster-ride-20250731-p5mj6n.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Berry keen to get back in premiership race after rollercoaster ride",
        "publish_date": "Thu, 31 Jul 2025 12:17:00 +1000",
        "category": "sports",
        "authors": [
            "Craig Kerry"
        ],
        "text": "After a rollercoaster season of rich wins and injury setbacks, Tommy Berry is driven to get back near the top of the Sydney jockeys premiership with a consistent run in 2025-26.\n\nAnd Berry, coming off a double last weekend at Randwick, hopes a string of wet-track chances will give him a winning start to the new campaign in town on Saturday at Rosehill.\n\nTommy Berry rides Lugh to victory at Randwick last Saturday. Credit: Getty Images\n\nThe 34-year-old had 47 NSW metropolitan winners in 2024-25 to finish eighth in the Sydney premiership won by James McDonald (83) for a seventh consecutive time and ninth victory overall.\n\nBerry had 59 wins the season before, when he made a late start because of an eight-month disqualification that halved his 2022-23 campaign. He was fourth in 2021-22 with 63 and finished in the top three the previous three seasons with 111, 76 and 77 wins.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/scrapping-surcharges-could-hit-credit-card-rewards-20250731-p5mja5.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Scrapping surcharges could hit credit card rewards",
        "publish_date": "Thu, 31 Jul 2025 12:15:59 +1000",
        "category": "finance",
        "authors": [],
        "text": "Scrapping surcharges could hit credit card rewards\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/queensland/hundreds-visited-these-drug-checking-sites-but-a-review-into-them-will-stay-secret-20250731-p5mj6o.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Hundreds visited these drug checking sites, but a review into them will stay secret",
        "publish_date": "Thu, 31 Jul 2025 12:10:33 +1000",
        "category": "finance",
        "authors": [
            "Courtney Kruk"
        ],
        "text": "About one in 10 samples tested by Queensland’s first permanent pill testing sites contained drugs people were not expecting or wanting to find, a report from the organisation running the sites has revealed.\n\nThe data formed part of an evaluation report published by The Loop on Thursday, after the state government again refused to make public the findings of an independent, taxpayer-funded study.\n\nThe Loop’s evaluation found nearly 700 visitors to the CheQpoint sites at Bowen Hills and Burleigh Heads, which operated for a few hours, one day a week, for about a year before they were defunded by the new LNP government and closed in April.\n\nBrisbane’s first and only permanent pill testing site closed in April after being defunded by the LNP government. Credit: Courtney Kruk\n\nAbout 600 of these were presentations for drug testing, including 444 from Brisbane.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/culture/art-and-design/finger-painting-of-australian-virtuoso-musician-wins-archibald-people-s-choice-20250725-p5mhwy.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Finger painting of Australian virtuoso musician wins Archibald People’s Choice",
        "publish_date": "Thu, 31 Jul 2025 12:06:19 +1000",
        "category": "entertainment",
        "authors": [
            "Linda Morris"
        ],
        "text": "In the last four years, Manila-born artist Loribelle Spirovski had come close to giving up on full-time painting while nursing a debilitating injury that sends pins and needles into her hands and makes holding a brush difficult and painful.\n\nOn Thursday, Spirovski was named winner of the 2025 Archibald Prize People’s Choice award with a joyful portrait of yidaki (didgeridoo) virtuoso William Barton, painted entirely with gloved fingers and hands.\n\nPeople’s choice: Loribelle Spirovski with subject William Barton Credit: Steven Siewert\n\nAccepting the prize, Spirovski said when she first met Barton she was too shy to ask him to sit for her and worried she might not be able to do his talent justice. “I can never thank you enough Will.”\n\nIn celebration Barton sang a lullaby accompanied by his yidaki.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/business/the-economy/the-man-who-isn-t-listening-to-trump-s-golden-age-story-20250731-p5mj6v.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "The man who isn’t listening to Trump’s ‘Golden Age’ story",
        "publish_date": "Thu, 31 Jul 2025 12:00:09 +1000",
        "category": "finance",
        "authors": [
            "Stephen Bartholomeusz"
        ],
        "text": "“A reasonable base case is that the effects on inflation could be short-lived, reflecting a one-time shift in the price level. “But, it is also possible that the inflationary effects could instead be more persistent, and that is a risk to be assessed and managed,” he said. It might not be until well into next year or even beyond that a clearer picture of the effects of the trade wars and whether they are transitory or entrenched is available. Credit: Bloomberg “We’re going to need to see the data, and it can go in many different directions. We’re going to make a judgement based on all of the data.” The data to date appears benign. The economy grew at an apparently very robust 3 per cent annualised rate in the June quarter, prompting the White House to claim it as evidence that Trump’s policies have ignited a new “Golden Age.”\n\nBeneath the headline number, however, things weren’t quite as golden. In the first quarter of the year the economy actually contracted, as companies front-loaded their imports to get in ahead of Trump’s tariffs. In the June quarter, those bloated inventories were run down and imports fell away. If the first half is looked at as a whole, the economy grew at an annualised rate of 1.25 per cent. In the same half last year, when Joe Biden was in the White House, it grew at 2.3 per cent. Moreover, the US inflation rate, at 2.7 per cent, is still above the Fed’s target of 2 per cent and, even before the bulk of Trump’s tariffs are active, there are signs of tariff-related goods inflation. To date, on the available data, there is no evidence of a need to reduce rates. Indeed, a case could be mounted for a rate rise. Powell said he still expected tariffs to flow through to consumer prices but that the process might be slower than expected and that some companies might be finding it difficult to fully pass on the costs to consumers because consumers were unwilling or unable to pay higher prices.\n\nA case in point is the US car manufacturing sector, where the companies have yet to raise their prices despite substantial tariff-related cost increases. General Motors has estimated the tariffs will cost it between $US4 billion and $US5 billion ($6.2 billion-$7.8 billion) this year. Ford said on Wednesday that the tariffs would cost it $US3 billion this year. Loading Some US companies are starting to raise prices. Amazon, Walmart and other retailers have said they will have to raise some prices and, also on Wednesday, the giant consumer products group, Procter & Gamble, said it would raise prices on about a quarter of its product range because it expects a $US1 billion hit from the tariffs. In theory, the tariffs should produce a one-time impact on prices and inflation. The complex layers of duties Trump has imposed on raw materials, semi-finished and finished goods, the messy way in which the tariffs are being rolled out and the degree of uncertainty in what the final trade picture will look like, given the key deals with major trading partners are more statements of intent rather than conventional detailed and binding trade agreements, however, complicates evaluations of their effects.\n\nPowell said it was a “very dynamic time” for trade negotiations but “we are still aways away from seeing where things settle down.” “What we see now is, basically, the very beginning of whatever the effects turn out to be on goods inflation. They may be less than people estimate, or more than people estimate. They are not going to be zero. “Consumers will pay some of this. Businesses will pay some of this. Retailers will pay some of this. We’re just going to have to see it through,” he said. Trump has been piling on the pressure on Powell, even using a blowout in the costs of the Fed’s renovations of its Washington headquarters to try to pressure him to resign or provide an excuse to fire him “for cause.”\n\nHe wants lower interest rates to help generate greater economic growth and lower the cost of servicing the US government’s soaring debt levels – debt that will increase substantially as a result of his “One Big Beautiful Bill” that cut taxes and increased spending. Powell said the government’s interest costs weren’t something the Fed took into account. “We have a mandate and that’s maximum employment and price stability. We don’t consider the fiscal needs of the federal government. It’s just not something we take into consideration,” he said. He also left open the possibility that, after his term as chair ends next year, he might serve out the rest of his term as a governor, which doesn’t end until 2028, despite the administration saying that he should, as other chairs have, leave the board when he relinquishes the chair. Trump is going to appoint a successor to Powell who will do his bidding, or at least try to. The administration expects to appoint that person in the near term and hopes that they will, before they displace Powell, effectively become a “shadow” chair whose views influence the Fed and markets and overshadows Powell’s.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/lifestyle/fashion/the-hero-of-your-winter-wardrobe-is-the-garment-you-might-least-expect-20250722-p5mh04.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "The hero of your winter wardrobe is the garment you might least expect",
        "publish_date": "Thu, 31 Jul 2025 12:00:00 +1000",
        "category": "lifestyle",
        "authors": [
            "Damien Woolnough"
        ],
        "text": "Save Log in , register or subscribe to save articles for later. Save articles for later Add articles to your saved list and come back to them any time. Got it Normal text size Larger text size Very large text size The turtleneck has escaped its style sentence as the trusty uniform for women of a certain age who imagine that they’re Diane Keaton in a romantic comedy and computer nerds following in the white sneaker steps of Apple founder Steve Jobs. Also known as the skivvy or polo neck, the turtleneck received a get-out-of-fashion-jail-free card at the Celine runway presentation in Paris during the most recent haute couture season. Extravagant gowns encrusted with pearls or diamonds usually steal the haute couture show, but the debut of American designer Michael Rider at the French fashion house placed humble white turtlenecks front and centre. Uniqlo cashmere turtleneck (worn throughout), $130. Max Mara sleeveless coat, $4285, belt, $640, and pants, $1610. Weekend Max Mara x Sebago loafers, $915. Credit: Bec Parsons Rider may have been inspired by former Celine designer and turtleneck devotee Phoebe Philo but his runway masterclass restored the wardrobe staple of Audrey Hepburn and Marilyn Monroe to its former free-spirited glory. Here’s how to style a turtleneck and keep your cool while staying warm. For beginners: On its own The easiest way to embrace the turtleneck is to wear it with jeans or trousers as an alternative to bulky jumpers. Remember to balance out the snug fit of a thin turtleneck with straight-leg or wide pants or jeans.\n\nAdvertisement\n\nMarilyn Monroe wore her black turtleneck with checked capri pants and Audrey Hepburn with black tights, playing a beatnik in the classic musical Funny Face. Most of us are neither bombshells nor beatniks and more than 60 years have passed, so let’s loosen up. Max Mara jacket, $2945. Courtney Zheng “Elsje” dress, $600 (belt included). Credit: Bec Parsons One trend from the last millennium worth holding on to is feminist Gloria Steinem’s turtlenecks paired with long, statement silver necklaces from the 1970s. It’s not just groovy, it’s liberating. Intermediate: Beneath a jacket A turtleneck is a streamlined alternative to wearing a blouse beneath a blazer or jacket. When it comes to layering, the thinner the turtleneck the better. A white turtleneck breaking up double denim looks better than Jake Gyllenhaal breaking up fights in Road House. If you’re self-conscious about your curves, try wearing the turtleneck untucked to lengthen your silhouette. Otherwise, tuck it in and break out your best belt. Max Mara jacket, $2945. Deering “Gossamer” skirt, $280. Celine “Triomphe” sunglasses, POA. Credit: Bec Parsons\n\nAdvertisement\n\nIf you’re after a monochrome approach, pairing a white turtleneck with a white jacket, or a black turtleneck with a black jacket, be prepared to play with textures. The cotton, wool or cashmere (if you’re fancy) of a turtleneck provides a delightful on-trend contrast with a crackly leather jacket or the sleek satin lapel of a dinner jacket. Sharon Stone’s black turtleneck worn beneath a black velvet jacket at the 1996 Academy Awards remains an inspiration to many stylists for a very good reason. Expert: Beneath a shirt The Parisian staple of a white turtleneck beneath a white collared shirt, worn with jeans and leather boots, is the height of trans-seasonal chic. Once again, make sure the turtleneck is fitted but let the shirt billow. Look for a shirt with a classic rather than tailored fit and remember, you can undo as many buttons as you like without having to worry about stiff breezes. Celine cashmere jacket, POA, silk blouse, POA, “Marco” jeans, $1700, and sneakers, $1350. Credit: Bec Parsons A black turtleneck with a white shirt and jeans also works but be careful of straying into the coastal grandma trend, exemplified by Diane Keaton, of white, on white, on white. If you take this path, be prepared for stares and stains. For the office, match your trousers with your turtleneck before layering with a white shirt. Grey and black work brilliantly, with white acting as a crisp contrast. Break out the starch because stiff cotton shirts work best with relaxed knits.\n\nAdvertisement",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/business/companies/heading-to-italy-or-france-get-ready-to-pay-a-new-35-fee-20250731-p5mj6x.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Heading to Italy or France? Get ready to pay a new $35 fee",
        "publish_date": "Thu, 31 Jul 2025 11:54:53 +1000",
        "category": "finance",
        "authors": [
            "Chris Zappone"
        ],
        "text": "Australians travelling to Italy, Spain, and France will be slugged with a new fee next year, which appears to be part of a trend making overseas travel more expensive.\n\nAustralians will need to pay €20 ($35.44) per application to visit the bloc of 30 EU states in the Schengen visa-free travel zone, once the European Travel Information and Authorisation System (or ETIAS) becomes operational for visitors next year.\n\nThe town of Monopoli in Italy’s region of Puglia. Europe is hiking its fee for entry to the Schengen zone. Credit: Getty Images/iStockphoto\n\nThe travel authorisation fee was originally slated to cost €7 ($12.40), but the EU settled on a higher cost.\n\nThe ETIAS fee will capture most Australian visitors to Europe - and will function a bit like the US ESTA visa waiver, or the UK Electronic Travel Authorisation.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/australia-recognising-palestinian-statehood-a-matter-of-when-not-if-20250731-p5mj9n.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Australia recognising Palestinian statehood a matter of 'when, not if'",
        "publish_date": "Thu, 31 Jul 2025 11:51:21 +1000",
        "category": "finance",
        "authors": [],
        "text": "Australia recognising Palestinian statehood a matter of 'when, not if'\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/lifestyle/bride-shares-her-mums-brutal-reactions-to-wedding-dresses-20250731-p5mj9m.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Bride shares her mum's brutal reactions to wedding dresses",
        "publish_date": "Thu, 31 Jul 2025 11:50:24 +1000",
        "category": "lifestyle",
        "authors": [],
        "text": "Bride shares her mum's brutal reactions to wedding dresses\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    }
]