[
  {
    "url": "https://www.9news.com.au/national/david-cameron-former-british-prime-minister-reveals-cancer-diagnosis/22f9a1e4-d379-48d7-bd1a-f5bef7b7ada1",
    "title": "Former UK Prime Minister David Cameron reveals prostate cancer diagnosis",
    "publish_date": "Mon, 24 Nov 2025 00:58:11 +0000",
    "category": "finance",
    "authors": [
      "Nov"
    ],
    "text": "he was initially urged to get checked by his wife Samatha after the couple heard a radio interview.\n\nThe 59-year-old told British newspaper The Times he was initially urged to get checked by his wife Samatha after the couple heard a radio interview.",
    "source": "9News",
    "cluster_id": 0
  },
  {
    "url": "https://www.9news.com.au/national/australians-drinking-less-more-choosy-new-survey-finds/6c46c213-364b-4edb-8bd8-b6673934c9c0",
    "title": "Milestone shifts in Aussie drinking habits revealed",
    "publish_date": "Sun, 23 Nov 2025 23:58:18 +0000",
    "category": "finance",
    "authors": [
      "Nov"
    ],
    "text": "Almost half of all Australians cut back their drinking or quit altogether in the past year, as the ongoing tectonic shift in alcohol habits continues.\n\nA new report, from not-for-profit consumer group Shop! ANZ and consumer insights platform Vypr, found that 47 per cent of Australians had reduced or halted their alcohol consumption in the past year.\n\nCost of living pressures were the greatest driver of this change, cited by 58 per cent of people, followed by health and wellness at 49 per cent.\n\nREAD MORE: NT cyclone bringing huge temperature surge around the country ﻿\n\nAlmost half of Australians sought to cut back their drinking in the past year. (Getty Images/iStockphoto)\n\nThe report found this could indicate the changing habits of Australians were part of a long-term behavioural shift, rather than a temporary response to straitened economic circumstances.\n\nFor those who do still drink, brand loyalty is out the window, creating a tougher marketplace for purveyors of beer, wine, and spirits, all of which claim a roughly equal share of customers.﻿\n\n\"Australians choose their alcohol based on occasion, mood or price. But at the end of the day, taste is the overall decisive factor for the majority of wine (78 per cent), beer (71 per cent) and spirit (68 per cent) drinkers,\" Shop! ANZ general manager Carla Bridge said.\n\nThose who do still drink are becoming more choosy. (Getty)\n\n\"At the same time, almost two-thirds (66 per cent) of consumers say price is the most important factor when purchasing alcohol in bottle shops, outweighing brand story, packaging or provenance. People want both taste and value, and they'll switch quickly if they don't get it.\"\n\nJust over one in five (22 per cent) of wine drinkers maintain loyalty to one particular brand, along with 28 per cent of spirits drinkers.\n\nBeer drinkers show more brand loyalty, with 50 per cent having a go-to brand, and most identifying with particular labels.\n\nBeer commands more brand loyalty than wine or spirits. (Instagram)\n\nVypr international chief revenue officer Sam Gilding said consumers were also being drawn to clear savings and special offers on the shelf.\n\n\"'Buy one, get one free' offers (50 per cent) and straightforward price discounts (47 per cent) have the strongest impact,\" he said.\n\n\"Free gifts (19 per cent), competitions (2 per cent), or in-store tastings (10 per cent) have far less sway. This means that brands that offer clarity, value and visibility will come out ahead in this shrinking market.\"",
    "source": "9News",
    "cluster_id": 1
  },
  {
    "url": "https://www.9news.com.au/world/london-tourist-tax-expected/35f3a0e5-22e4-4c1c-97f7-ac84554defc5",
    "title": "Tourist tax tipped to be imposed in London",
    "publish_date": "Sun, 23 Nov 2025 23:16:11 +0000",
    "category": "finance",
    "authors": [
      "Nov"
    ],
    "text": "L﻿ondon - one of the most popular overseas destinations for Australians - is expected to introduce a tourist tax for visitors staying overnight in the city.\n\nThe UK government is being tipped to give the green light for the levy, estimated to raise £240 million ($506 million) a year for the nation's capital.﻿\n\nA spokesperson for London Mayor Sadiq Khan, who has long campaigned for a tourist tax, welcomed the move, the BBC reports.\n\nThe UK government is being tipped to give the green light for the levy, estimated to raise £240 million ($506 million) a year for the nation's capital.﻿ (AP)\n\nThe proposed changes would bring London into line with many other international cities, such as Paris, New York and Tokyo, which﻿ impose a levy for visitors.\n\nResearch commissioned by the Greater London Authority found other global cities had three types of taxes for visitors: a percentage rate levied on stays, a single flat fee for bookings, and a levy paid depending on a star rating system.\n\n﻿A percentage or flat fee system would be the best option for London, the researchers concluded.\n\nThe report also said London would be \"unlikely to see a significant drop in visitors\" if it adopted one.\n\nREAD MORE: Impact of Tropical Cyclone Fina causing temperatures to nudge towards 50 degrees\n\nVisitors staying in London could soon be hit with a new tourist tax.(Photo by Hollie Adams/Getty Images) (Getty)\n\nThe option for London to bring in a visitor tax is part of new laws proposed by the UK government to hand more powers to cities, which are being debated in Parliament. ﻿\n\nLast year London recorded 89 million overnight stays.\n\nIn 2023, there were 1.2 million Australians who visited the UK, according﻿ to the Department of Foreign Affairs and Trade. Many of them would have stayed in London.",
    "source": "9News",
    "cluster_id": 2
  },
  {
    "url": "https://www.9news.com.au/national/skye-gyngell-award-winning-australian-chef-dies-aged-62/d710d421-ea3d-4512-aaf9-6a19753dbebc",
    "title": "Skye Gyngell, the first Australian woman to win Michelin star, dies aged 62",
    "publish_date": "Sun, 23 Nov 2025 23:51:24 +0000",
    "category": "finance",
    "authors": [
      "Nov"
    ],
    "text": "Skye Gyngell, the first Australian female chef to win a Michelin star, has died aged 62.\n\nHer family announced the award-winning chef had passed away in London on Saturday while surrounded by her loved ones. ﻿\n\n\"We are deeply saddened to share news of Skye Gyngell's passing on 22nd November in London, surrounded by her family and loved ones,\" her family said in a statement.\n\nChef and author Skye Gyngell at her workplace in Richmond, south of London. (Wade Laube)\n\n\"Skye was a culinary visionary who influenced generations of chefs and growers globally to think about food and its connection to the land.\n\n\"She leaves behind a remarkable legacy and is an inspiration to us all.\"\n\nGyngell had been battling Merkel cell carcinoma, a rare and aggressive skin cancer, after discovering a lump on her neck last year.\n\nThe acclaimed chef was born in Sydney in 1963 into an established broadcast family.\n\nHer father, Bruce Gyngell, was the first face and voice on Australian television in 1956, earning him a place in the Australian Media Hall of Fame.\n\nHer mother, interior designer Ann Gyngell, died ﻿just days before she did last week.\n\nHer brother David was chief executive of Nine, the publisher of this website, across two stints between 2007 and 2015.\n\nGyngell initially studied law at Sydney University before she moved to Paris to train under renowned chefs.\n\nShe worked in kitchens abroad before moving to London, where she became one of the country's most famed chefs.\n\nShe took on the role of head chef at Petersham Nurseries, where her distinctively seasonal and elegant cooking awarded the organic greenhouse Italian restaurant a Michelin star in 2011.\n\nREAD MORE: ﻿ Fina strengthens to category 4 on path to Western Australia\n\nSkye Gyngell, the first Australian female chef to win a Michelin star, has died aged 62. (Instagram)\n\nShe was appointed culinary director of Heckfield Place in 2012 and opened up Spring Restaurant, her first solo venture in the arts and cultural heart of London, in 2014.\n\nSpring reflects Gyngell's passion for seasonal menus, with the restaurant describing its cooking as \"wholesome, produce-driven and cooked by a team of people who are passionate about what they do\".\n\nGyngell was awarded a lifetime achievement award at the National Restaurant Awards in June.\n\nSpring paid tribute to her \"remarkable legacy\", saying that she was more than a chef.﻿\n\n\"She was a mentor, an anchor, and a force who helped so many of us find our place in what we do,\" the restaurant said.\n\n\"Her presence shaped our culture and the way we see the world around us in profound and lasting ways, and we remain deeply grateful for the time we were able to share with her.\n\n\"She will be deeply missed by all who knew her.\"\n\nChefs and food professionals have shared their heartbreak over news of her passing and appreciation for her trailblazing impact on the industry.\n\nSkye Gyngell and her family. (Instagram)\n\n\"﻿This is terribly sad news. She was an amazing woman, and incredible cook, and kind-hearted. She will be very very, very missed,\" celebrity chef Jamie Oliver said.\n\n\"Thank you for all that you did to inspire young cooks.\"\n\n\"Skye was one of the greatest cooks of all time,\" ﻿Australian chef Kylie Kwong said.\n\n﻿Gyngell leaves behind her daughters, Holly and Evie, and her granddaughter Cyprien.",
    "source": "9News",
    "cluster_id": 3
  },
  {
    "url": "https://www.9news.com.au/national/brisbane-teenager-reveals-housing-and-money-are-his-biggest-worries-unicef-state-of-the-children-report-exclusive/fbf8f383-c5d5-41a1-ad61-7cbe68231d9d",
    "title": "Chris is only 17 but he and his schoolmates worry they won't ever afford a house",
    "publish_date": "Sun, 23 Nov 2025 18:56:58 +0000",
    "category": "finance",
    "authors": [
      "Nov"
    ],
    "text": "E﻿xclusive: Most teenagers still at high school hopefully only worry about passing their driver's licence test or the upcoming maths exam.\n\nBut Brisbane high schooler Chris, 17, said he and his friends suffer from the same stressful financial anxieties as adults.\n\nIt's hard to ignore the constant stream of catastrophic reporting about the state of the country's housing crisis﻿ – and teenagers are listening closely.\n\nREAD MORE: Why thousands of Australians are buying and selling snack vending machines\n\nBrisbane teenager Chris said he and his peers worry about housing affordability. (Supplied)\n\nDo you have a story? Contact reporter April Glover at april.glover@nine.com.au\n\n﻿A sobering 43 per cent of young Australians report worrying about housing and money in 2025, according to the latest UNICEF State of Australia's Children report released today.\n\nChris told nine.com.au he and his peers constantly worry about how expensive house prices are in every Aussie capital city.\n\n\"It's impossible to get into the housing market at all,\" Chris explained.\n\n\"Young people have to think about because if we're putting in $10,000 each year to university how are we going to save up and still maintain the cost of living etc, while saving up for a house?\n\n\"Those things aren't taught in schools. Life skills should be a part of the curriculum.\"\n\nChris is a member of Generation Z, known colloquially as Gen Z.\n\n﻿Recent research from the e61 Institute claims Gen Z – born between 1997 and 2012 – will likely end up being richer than their parents.\n\nBut there is a catch: this w﻿ealth will come much later in life via inheritance and wages.\n\nUNICEF's report ﻿found a staggering 62 per cent of children agree they will be \"worse off\" than their parents.﻿\n\n\"Housing is just so much less accessible, there was more land... more ability ﻿to buy a house near the CBD,\" Chris added.\n\nREAD MORE: ﻿ Professor flooded with death threats over what he wants banned from Queensland\n\nChris and his peers constantly worry about how expensive house prices are in every Aussie capital city. (Getty)\n\nHe and his schoolmates believe they won't be able to afford to live anywhere near their families.\n\nIn Brisbane, where Chris lives, the median house price is forecast to hit $1.185 million by the end of 2026.\n\nYoung Australians are being raised in suburbs they will later be priced out of - until they can inherit those homes.\n\n\"They might say all young people have it easy,\" Chris said of the government and the older generations.\n\n\"That notion that young people need to work hard to get what they want is not really reflective of what the circumstances are now for young people.\"\n\nUNICEF's report, which includes responses from over 2000 Australian kids, also found only less ﻿than a third of teens feel very \"excited or hopeful\" about the next five years.\n\nChris the sobering statistic resonates with him.\n\nHe's not feeling too positive about the decisions the government is making about his future.\n\n\"I feel like my sentiment is reflective of most young people, particularly my peers,\" Chris added.\n\n\"Most of my friends don't really trust the government at all.\"\n\nHe hopes educational and housing reforms will help steer Gen Z in the right direction.\n\nBut if the government is too \"slow\", Chris is wary his peers will be left behind.﻿",
    "source": "9News",
    "cluster_id": 4
  },
  {
    "url": "https://www.9news.com.au/world/donald-trump-update-elon-musk-doge-doesnt-exist-with-eight-months-left-on-its-charter/5d6fbc37-3279-4211-9ce1-022f899b0c10",
    "title": "Doesn't exist': DOGE is done for – eight months early",
    "publish_date": "Sun, 23 Nov 2025 14:55:33 +0000",
    "category": "finance",
    "authors": [
      "Nov"
    ],
    "text": "US President Donald Trump 's Department of Government Efficiency has disbanded with eight months left to its mandate, ending an initiative launched with fanfare as a symbol of Trump's pledge to slash the government's size but which critics say delivered few measurable savings.\n\n\"That doesn't exist,\" Office of Personnel Management Director Scott Kupor told Reuters earlier this month when asked about DOGE's status.\n\nIt is no longer a \"centralised entity,\" Kupor added, in the first public comments from the Trump administration on the end of DOGE.\n\nElon Musk holds up a chainsaw he received from Argentina's President Javier Milei, right, as they arrive to speak at the Conservative Political Action Conference, CPAC, at the Gaylord National Resort & Convention Center, Thursday, Feb. 20, 2025, in Oxon Hill, Md. (AP Photo/Jose Luis Magana) (AP)\n\nThe agency, set up in January, made dramatic forays across Washington in the early months of Trump's second term to rapidly shrink federal agencies, cut their budgets or redirect their work to Trump priorities. The OPM, the federal government's human resources office, has since taken over many of DOGE's functions, according to Kupor and documents reviewed by Reuters.\n\nAt least two prominent DOGE employees are now involved with the National Design Studio, a new body created through an executive order signed by Trump in August. That body is headed by Joe Gebbia, co-founder of Airbnb, and Trump's order directed him to beautify government websites.\n\nGebbia was part of billionaire Elon Musk's DOGE team while DOGE employee Edward Coristine, nicknamed \"Big Balls\", encouraged followers on his X account to apply to join.\n\nThe fading away of DOGE is in sharp contrast to the government-wide effort over months to draw attention to it, with Trump, his advisers and cabinet secretaries posting about it on social media. Musk, who led DOGE initially, regularly touted its work on his X platform and at one point brandished a chainsaw to advertise his efforts to cut government jobs.\n\n\"This is the chainsaw for bureaucracy,\" Musk said, holding the tool above his head at the Conservative Political Action Conference in National Harbor, Maryland, in February.\n\nDOGE claimed to have slashed tens of billions of dollars in expenditures, but it was impossible for outside financial experts to verify that because the unit did not provide detailed public accounting of its work.\n\n\"President Trump was given a clear mandate to reduce waste, fraud and abuse across the federal government, and he continues to actively deliver on that commitment,\" said White House spokeswoman Liz Huston in an email to Reuters.\n\nCEO of Tesla and SpaceX Elon Musk leaves the stage holding a chainsaw after speaking at the Conservative Political Action Conference (CPAC) at the Gaylord National Resort Hotel And Convention Center on February 20, 2025 in Oxon Hill, Maryland. The annual four-day gathering brings together conservative U.S. lawmakers, international leaders, media personalities and businessmen to discuss and champion conservative ideas. Argentinian President Javier Milei gifted M (Getty)\n\nTrump officials have been signalling DOGE's demise\n\nTrump administration officials have not openly said that DOGE no longer exists, even after Musk's public feud with Trump in May. Musk has since left Washington.\n\nTrump and his team have nevertheless signalled its demise in public since this summer, even though the US president signed an executive order earlier in his term decreeing that DOGE would last through July 2026.\n\nIn statements to reporters, Trump often talks about DOGE in the past tense. Acting DOGE Administrator Amy Gleason, whose background is in healthcare tech, formally became an adviser to Health and Human Services Secretary Robert Kennedy in March, according to a court filing, in addition to her role with DOGE. Her public statements have largely focused on her HHS role.\n\nRepublican-led states, including Idaho and Florida, meanwhile are creating local entities similar to DOGE.\n\nA government-wide hiring freeze - another hallmark of DOGE - is also over, Kupor said.\n\nTrump on his first day in office barred federal agencies from bringing on new employees, with exceptions for positions his team deemed necessary to enforce immigration laws and protect public safety. He later said DOGE representatives must approve any other exceptions, adding that agencies should hire \"no more than one employee for every four\" that depart.\n\n\"There is no target around reductions\" anymore, Kupor said.\n\nPresident Donald Trump talks after meeting with New York City Mayor-elect Zohran Mamdani in the Oval Office of the White House, Friday, Nov. 21, 2025, in Washington. (AP Photo/Evan Vucci) (AP)\n\nFormer DOGE employees move on to new roles\n\nDOGE staff have also taken on other roles in the administration. Most prominent is Gebbia, whom Trump tasked with improving the \"visual presentation\" of government websites.\n\nSo far, his design studio has launched websites to recruit law enforcement officers to patrol Washington, DC, and advertise the president's drug pricing program. Gebbia declined an interview with Reuters via a spokesperson.\n\nZachary Terrell, part of the DOGE team given access to government health systems in the early days of Trump's second term, is now chief technology officer at the Department of Health and Human Services. Rachel Riley, who had the same access according to court filings, is now chief of the Office of Naval Research, according to the office's website.\n\nElon Musk flashes his T-shirt that reads \"DOGE\" to the media as he walks on South Lawn of the White House, in Washington, March 9, 2025 (AP)\n\nJeremy Lewin, who helped Musk and the Trump administration dismantle the US Agency for International Development, now oversees foreign assistance at the State Department, according to the agency's web site.\n\nMusk shortly after Trump's election said he had a mandate to \"delete the mountain\" of government regulations. He made undoing government regulations and remaking the government with AI two key tenets of DOGE, in addition to eliminating federal government jobs.\n\nThe administration is still working toward slashing regulations. The White House budget office has tasked Scott Langmack, who was DOGE's representative at the Department of Housing and Urban Development, with creating custom AI applications to pore through US regulations and determine which ones to eliminate, according to his LinkedIn profile.\n\nMusk, meanwhile, has reappeared in Washington. This week, he attended a White House dinner for Saudi Arabian Crown Prince Mohammed bin Salman.",
    "source": "9News",
    "cluster_id": 5
  },
  {
    "url": "https://www.9news.com.au/national/politics-australian-children-report/1223ed7b-0422-4115-99a2-99db9710613a",
    "title": "Nation's children worried about their future, landmark report warns",
    "publish_date": "Sun, 23 Nov 2025 08:45:23 +0000",
    "category": "finance",
    "authors": [
      "Nov"
    ],
    "text": "Australia's children are deeply anxious about their future, with a landmark report revealing many already carry the burden of worrying about housing and cost of living pressures.\n\nThe escalating concerns paired with an alarming decline in school and community engagement have prompted calls for more support.\n\nBillionaire Nicola Forrest is one of those funding the inaugural State of Australia's Children report, which shows children are worried about their future.\n\nNicola Forrest is one of those funding the inaugural State of Australia's Children report which shows children are worried about their future. (Luis Enrique Ascui )\n\n\"If children feel safe, if their parents are supported, if the community around them is the right environment then they will thrive. We've got most of those elements,\" she said.\n\nThe survey of more than 2000 kids found 62 per cent believe they'll be worse off than their parents, with school engagement declining sport and community participation down.\n\nOver half have experienced cyber bullying.\n\n\"We need to make sure young people are in places that are safe and if they're not safe - find places to connect,\" Greens Senator Sarah Hanson Young said.\n\nNationals Leader David Littleproud called for a rethink of the curriculum.\n\n\"Get it back to basics, get it back to life skills,\" he said.﻿\n\nCost of living affects kids as well, with 43 per cent worried about housing and money.\n\nMeanwhile, Housing Minister Clare O'Neil announced the third round of builds under the Housing Australia Future Fund, promising 21,000 social and affordable homes.\n\nOver half of children asked had experienced cyber bullying. (Getty Images/iStockphoto)\n\n\"We're in the middle of a housing crisis that has been cooking for generations and the single most important thing the Commonwealth government can do is build more houses for Australians,\" O'Neil said.\n\nHomelessness Australia chief executive Kate Colvin said it will make \"an enormous difference for every one of those homes\".\n\n\"We've got a lot more to do to step up and fix the homeless crisis,\" she said.\n\nRight now homes are being held up by the environmental approvals process and changing those laws is the big fight as MPs return to parliament this week for the final time this year.",
    "source": "9News",
    "cluster_id": 6
  },
  {
    "url": "https://www.9news.com.au/world/nvidia-the-worlds-biggest-company-just-told-everyone-to-chill-out/d94c1dc9-6e74-426b-a608-908028a64d11",
    "title": "The world's biggest company just told everyone to chill out",
    "publish_date": "Sat, 22 Nov 2025 13:30:25 +0000",
    "category": "finance",
    "authors": [
      "Nov"
    ],
    "text": "Concerns about an AI bubble have been simmering for at least a year and a half. Nvidia's incredibly strong earnings this past week tried to put those fears to bed. It may not have been enough.\n\nNvidia on Wednesday posted sales and profits up more than 60 per cent year-on-year, stronger than Wall Street had projected. CEO Jensen Huang said \"sales are off the charts\". And the company expects fourth quarter revenue of about $US65 billion ($100 billion), once again ahead of Wall Street's projections.\n\nNvidia executives said these results, along with growth from other major AI players and the billions being poured into AI infrastructure, indicate that fears of an AI bubble are overblown.\n\nREAD MORE: Education minister calls out prestigious school over leaked document about students\n\nJensen Huang, NVIDIA founder and CEO, at a Q&A session during the APEC CEO summit in Gyeongju, South Korea. (Getty)\n\n\"There's been a lot of talk about an AI bubble,\" Huang said on a call with analysts on Wednesday. \"From our vantage point, we see something very different.\"\n\nSome Wall Street analysts agree. But the wider market is not yet convinced: After briefly ticking up on Thursday morning following Nvidia's report, the chipmaker's shares (NVDA) dipped back into the red. They closed Friday down 1 per cent, although the stock remains up 29 per cent from the start of this year.\n\nIn other words, Nvidia answered a lot of questions about where the industry stands right now, but it may take more to shift the overall AI narrative.\n\nNot to burst your bubble\n\nNvidia CFO Colette Kress said the company anticipates $US3 trillion ($4.65 trillion) to $US4 trillion ($6.2 trillion) in annual AI infrastructure spending by the end of the decade, adding that demand \"continues to exceed our expectations\". Already, tech giants are expected to pour $US400 billion into AI-related capital expenditures this year, to meet what they say is growing demand for AI and cloud services but also to avoid falling behind industry rivals.\n\nNvidia has every reason to try to reassure investors — expectations for the company are sky-high after nearly two years of astronomical growth. And many look to the chipmaker as a bellwether for the overall tech industry.\n\nEven as Silicon Valley tries to figure out the business model for generative AI, Nvidia has a big role to fill in the existing tech services people use every day, Huang said. That could help insulate Nvidia even if returns from new AI applications are smaller than expected or take longer to arrive than planned.\n\nUS President Donald Trump speaks with Saudi Arabia's Crown Prince Mohammed bin Salman, Elon Musk, Nvidia CEO Jensen Huang and others at the Saudi Investment Forum. (AP)\n\n\"The world has a massive investment in non-AI software, from data processing to science and engineering simulations, representing hundreds of billions of dollars in cloud computing spend each year.\" Much of the infrastructure powering that software has transitioned from running on older CPU chips to Nvidia's GPUs, the chips known for running AI tools, Huang said.\n\nKress also took the unusual step of ticking through highlights from the chipmaker's partners' recent financial reports. At Meta, for example, AI recommendation systems are leading to \"more time spent on apps such as Facebook and Threads\". Anthropic recently noted it expects to earn $US7 billion in annual revenue this year. And Salesforce's engineering team is 30 per cent more efficient now that it's using AI for coding, she said, ﻿among a long list of corporate customers she rattled off.\n\nNvidia isn't the only one arguing that AI bubble concerns may be exaggerated.\n\n\"The pure Nvidia numbers/guidance and strategic vision shows the AI Revolution is NOT a Bubble…instead its Year 3 of a 10-year build out of this 4th Industrial Revolution in our view,\" Wedbush tech analyst Dan Ives said in emailed commentary.\n\nKing Charles III presents the 2025 Queen Elizabeth Prize for Engineering to Jensen Huang. (Getty)\n\nBrian Colello, senior equity analyst at investment research company Morningstar, said he doesn't \"see many signs to suggest that 2026 will be a weak year for Nvidia in any way\" and sees the bubble fears weighing on the company's stock as a \"buying opportunity\".\n\nFears remain\n\nBut despite those strong results, it appears the stock market may not be ready to relax just yet.\n\nQuestions remain about whether tech firms will maintain their massive spending on AI infrastructure, especially as Nvidia has invested in key, unprofitable customers such as OpenAI and Anthropic. OpenAI CFO Sarah Friar also raised alarms earlier this month when she suggested that the government should backstop the debt tech companies are incurring to build AI infrastructure. Some took her comments as a sign OpenAI may struggle to afford its commitments, although the company later tried to walk back the statement.\n\nAnd while Nvidia likely has enough customers even if a bubble burst causes some casualties among AI firms, investors may still be worried about what a downturn or even a slowdown could mean for the larger market.\n\n\"There's been a lot of talk about an AI bubble,\" Huang said on a call with analysts on Wednesday. \"From our vantage point, we see something very different.\" (Getty)\n\nDaniel Morgan, senior portfolio manager at Synovus Trust Company, said questions about the sustainability of Big Tech's infrastructure spending spree and Nvidia's circular funding deals were not \"put to rest\" with its latest report. Instead, they may just be \"punted\" to the next quarter.",
    "source": "9News",
    "cluster_id": 7
  },
  {
    "url": "https://www.abc.net.au/news/2025-11-24/cfs-firefighter-dies-at-pinkawillinie-conservation-park-blaze/106044594",
    "title": "Breaking: CFS firefighter dies at scene of Eyre Peninsula blaze",
    "publish_date": "Mon, 24 Nov 2025 01:26:11 +0000",
    "category": "finance",
    "authors": [],
    "text": "A firefighter has died at the scene of a blaze in South Australia's northern Eyre Peninsula, the Country Fire Service has confirmed.\n\nThe service said Peter Curtis died \"in the line of duty\" at Pinkawillinie Conservation Park and that an investigation would examine the circumstances of the incident.\n\nSA CFS chief executive Brett Loughlin said an \"immediate search\" for Mr Curtis was launched after firefighters determined there was an unaccounted-for member on the fireground.\n\n\"During the course of that search, firefighter Peter Curtis was located and sadly was unable to be revived,\" he said.\n\n\"Peter's loss will be felt very keenly across the fire services … and our thoughts and our prayers are with his friends and family.\"\n\nMr Loughlin said the fire started Saturday evening and was believed to have been sparked by lightning.\n\n\"The specific details of this incident are obviously subject to an investigation and I can't go into them further at this point in time and I won’t be drawn on any speculation on what may or may not have occurred at this point,\" he said.\n\nEmergency Services Minister Rhiannon Pearce said it was a \"tremendously sad occasion\" and that support had been offered to Mr Pearce's family.\n\nEarlier, SA Premier Peter Malinauskas told reporters he would speak publicly about the incident \"once appropriate processes have gone through\".",
    "source": "ABC",
    "cluster_id": 8
  },
  {
    "url": "https://www.abc.net.au/news/2025-11-24/victims-ai-deepfake-sue-under-david-pocock-bill/106037560",
    "title": "'You should own your own face': Pocock launches AI deepfake bill",
    "publish_date": "Mon, 24 Nov 2025 01:18:44 +0000",
    "category": "finance",
    "authors": [],
    "text": "Australians who share AI deepfakes of another person without that person's consent could be sued or face steep fines, under a new proposal before federal parliament today.\n\nIndependent senator David Pocock, who is introducing the bill, said the government was yet to respond to rapid advances in the field of AI, and urgent action was needed.\n\n\"I'm concerned that the government has dropped the ball,\" Senator Pocock told the ABC.\n\n\"Currently, unless a deepfake is sexually explicit, there's very little that you can do as an Australian.\"\n\nHe said Australians lacked \"basic safeguards\" against having their likeness copied and used for scams, commercial exploitation, disinformation and a range of other purposes.\n\n\"This bill would put into legislation that your face, voice and likeness is yours,\" he said.\n\nDavid Pocock says Australians lack \"basic safeguards\" against having their face and voice copied without permission. (ABC News: Berge Breiland)\n\nThe proposal seeks to add a dedicated complaints framework to the Online Safety Act, granting the eSafety Commissioner powers to demand deepfake removals and issue immediate fines.\n\nUnder the changes, individuals who share a non-consensual deepfake could be fined $165,000 up-front, while companies that fail to comply with a removal notice could pay as much as $825,000.\n\nAs well as the initial fine, individuals caught sharing non-consensual deepfakes could also be hit with a second fine for ignoring removal notices.\n\nAdditionally, proposed changes to the Privacy Act would allow Australians to bring civil lawsuits and sue perpetrators directly for financial compensation.\n\nUnder Senator Pocock's proposal, the victim would not have to prove they had suffered financially in order to bring a case, in recognition of the emotional harm caused by deepfakes.\n\n\"As humans — our likeness, our face, our voice, our mannerisms — that's a big part of who we are,\" he said.\n\n\" To me, this seems like a bit of a no-brainer. You should own your face. \"\n\nThe bill seeks to grant the eSafety Commissioner new powers to demand deepfake removals and issue immediate fines. (ABC News: Abbey Haberecht)\n\nThe bill also contained important limits, Senator Pocock said.\n\nIt would carve out uses such as journalism, satire, and good faith uses by law enforcement, with similar exemptions and defences to defamation law, and an additional exemption for children.\n\nThe bill was also designed with the goal of sparing people who share non-consensual deepfakes without realising it, while still catching out those who do so knowingly or recklessly.\n\n\"We are now living in a world where increasingly anyone can create a deepfake and use it however they want,\" Senator Pocock said.\n\nLoading...\n\nLast year, the crossbencher created AI-generated videos of Prime Minister Anthony Albanese and then-opposition leader Peter Dutton ahead of the election, to highlight how easily deepfakes could distort political debate.\n\nHe said the changes proposed in his bill would also apply to political campaigns.\n\n\"We have to draw a line in the sand and say, this is not on — you cannot deepfake someone without their consent,\" he said.\n\nCrossbench moves on AI as government mulls response\n\nSenator Pocock's bill is not the only effort from the crossbench to tackle AI harms, fuelled by a sense that the government has fallen behind.\n\nIn July, independent MP Kate Chaney introduced a private members' bill to criminalise AI apps and tools that generate child sexual abuse material.\n\nBill to criminalise AI child abuse apps to be introduced Independent MP Kate Chaney is set to introduce a bill to criminalise the use of AI tools purpose-built to create child sexual abuse material.\n\n\"I spoke to the attorney-general's office, and there was an acknowledgement that, yeah, there probably is an issue here. But still, we've seen no action on it,\" she said.\n\nThe government passed a law in August 2024 to criminalise sharing non-consensual sexually explicit deepfakes, although it did not criminalise the act of creating such material.\n\nMs Chaney and Senator Pocock said there was now an urgent need for far broader protections beyond the issue of sexualised deepfakes.\n\n\"The crossbench is stepping up here because the government has been missing in action,\" Senator Pocock said.\n\n\"Talking to Australians, they're concerned about the misuse of AI,\" he said.\n\nLast week, Ms Chaney raised similar concerns about the lack of protections, calling for Australia to establish its own AI Safety Institute.\n\n\"The US, the UK, Canada, Japan, Singapore all have an equivalent. Australia has supported the idea of them but has not yet actually taken action on putting one forward,\" she said.\n\n\" We can't afford to sit around twiddling our thumbs wondering what to do about AI while it is changing so rapidly. \"\n\nKate Chaney says Australia \"can't afford to sit around twiddling our thumbs\" on AI. (ABC News: Matt Roberts)\n\nThe government has been considering its wider policy response to AI after mothballing a draft proposal for specific AI regulation, driven by the previous minister for industry and innovation, Ed Husic.\n\nLabor's rhetoric shifted in the middle of the year to instead focus on the economic promise of AI, as the Productivity Commission called for AI laws to be \"a last resort\".\n\nIn August, new minister Tim Ayres told the ABC the government was not \"rushing\" towards a regulatory response, and was waiting on the outcome of a review due at the end of 2025.\n\n\"I want to make sure that the government makes good decisions here … to deliver the right outcome,\" he said.\n\nSenator Pocock said the government began consultation on AI two years ago and since then had done \"absolutely nothing with it\".\n\n\"At the same time … swallowing the lines from big AI companies who are promising the world in terms of productivity, but not actually talking about the very real risks,\" he said.",
    "source": "ABC",
    "cluster_id": 9
  },
  {
    "url": "https://www.abc.net.au/news/2025-11-24/aflw-erin-phillips-hired-gm-gold-coast-suns-womens-program/106044648",
    "title": "New Suns AFLW boss Phillips says strugglers can become 'powerhouse'",
    "publish_date": "Mon, 24 Nov 2025 01:14:57 +0000",
    "category": "sports",
    "authors": [],
    "text": "AFLW legend Erin Phillips has been tasked with turning around Gold Coast's ailing AFLW program after being appointed as the Suns' general manager of women's football.\n\nA two-time league best and fairest and Australian Football Hall of Fame member, Phillips has been poached from the AFL's football operations team, where she supported game analysis, talent pathways, player movement, and player engagement across the AFLW.\n\nSince her 2023 retirement, the former Opals and WNBA star and ex-Adelaide and Port Adelaide AFLW captain has also worked in the media.\n\n\"I always admired the Gold Coast Suns and I just feel like this was a really perfect fit for me,\" Phillips said in a club statement.\n\nErin Phillips leaves father in tears with moving Hall of Fame speech Erin Phillips joined her father Greg in the Australian Football Hall of Fame, with the pair becoming the first father-daughter inductees.\n\n\"Tracy [Phillips's wife] and I moving four kids from Adelaide to the Gold Coast speaks volumes of just how much I believe in this club and this team.\n\n\"I wouldn't have even considered it if I didn't have that full belief that this team can be an absolute powerhouse.\"\n\nThe Suns received the wooden spoon under new coach Rhyce Shaw this season after finishing 17th under predecessor Cameron Joyce the previous year.\n\nChief executive Mark Evans expected Phillips to drive a Suns resurgence.\n\n\"With an extensive and decorated background in both elite basketball and football, Erin embodies the ambition and professionalism we want to instil within our group,\" he said in a statement.\n\n\"We believe her knowledge and expertise will help provide the tools to develop a high-performing environment that ultimately drives success within our women's program.\n\n\"We're excited to see our football club take the next steps forward under Erin's guidance in the years to come.\"\n\nThe Suns endured a torrid AFLW season in 2025, finishing at the bottom of the ladder after registering a 2-10 record with a percentage of 41.3. (Getty Images/AFL Photos: James Wiltshire)\n\nPhillips indicated she wanted to build up the Suns' culture as the battling team prepares to welcome an influx of local and academy talent at the upcoming draft.\n\n\"This role brings together everything that I'm really passionate about; working in a team, working in high performance, building a program and helping athletes get the absolute best out of themselves, and hopefully we can have some success through that,\" Phillips said.\n\n\"I've had over 24 years of experience working in elite programs all around the world. So, I've been blessed to see how some of the great ones operate and learn from ones that haven't done so well.\n\n\"I want this culture to be team first — I want people to walk through these doors and love being here, and I want them to come here, get better and go home and can't wait to come back tomorrow.\"\n\nAAP",
    "source": "ABC",
    "cluster_id": 10
  },
  {
    "url": "https://www.abc.net.au/news/2025-11-24/titanic-isidor-straus-pocket-watch-record-sale/106044460",
    "title": "Titanic passenger's gold pocket watch fetches record $3.6m at auction",
    "publish_date": "Mon, 24 Nov 2025 01:07:19 +0000",
    "category": "finance",
    "authors": [],
    "text": "A gold pocket watch recovered from the body of one of the passengers on the Titanic has sold for 1.78 million pounds ($3.6 million) at auction, breaking the record amount ever paid for Titanic memorabilia.\n\nThe 18-carat gold Jules Jurgensen pocket watch belonged to Isidor Straus, the co-founder of the Macy's department store.\n\nMr Straus and his wife Ida were among the richest passengers on board the Titanic.\n\nHis body was recovered from the Atlantic Ocean days after the ship sank, and his possessions were collected and returned to his family. Ms Straus's body was never found.\n\nIn his possession was the pocket watch that had stopped at 2:20am — the exact time the Titanic sank.\n\nThe watch is engraved with the initials IS and has passed through generations of the family since.\n\nIsidor and Ida Straus were depicted in the 1997 film as the couple who died in each others arms. (Supplied: Henry Aldridge and Son Ltd)\n\nCouple featured in movie\n\nIn the 1997 film Titanic, James Cameron wrote in the Strauses as the elderly couple holding each other on their bed as the ship sank.\n\nMr Straus's wife refused a place in a lifeboat on the night of the 1912 disaster, making clear she would rather die by her husband's side.\n\nIt is believed Mr Straus refused a place on the lifeboats as he wanted to make sure all women and children were escorted off first.\n\nThere is a memorial statue of Isidor and Ida Straus at the intersection of Broadway and West End Avenue in Manhattan.\n\nAlso found in his possession was a letter written by his wife on Titanic-headed notepaper to a family friend.\n\nIt too was sold at the auction held by Henry Aldridge & Son auctioneers in England, fetching 100,000 pounds ($203,000).\n\nIda Straus described the size and luxury of the Titanic in a letter she wrote, which also sold at auction. (Supplied.)\n\nIn the letter, she described the luxury of the then-biggest cruise liner in the world.\n\n\"What a ship! So huge and so magnificently appointed,\" she wrote.\n\n\"Our rooms are furnished in the best of taste and most luxurious.\"\n\nThere is also a reference to the incident where the Titanic almost collided with the SS New York, which was moored in Southampton.\n\n\"Size seems to bring its troubles,\" Ms Straus said in the letter, saying her husband witnessed the near-collision with SS New York.\n\n\"But the danger was soon averted, and we are now well on our course across the channel to Cherbourg.\"\n\nOther items that went under the hammer included a Titanic passenger list sold for 104,000 pounds ($211,000) and a gold medal given to members of the rescue crew, which sold for 86,000 pounds ($174, 000).",
    "source": "ABC",
    "cluster_id": 11
  },
  {
    "url": "https://www.abc.net.au/news/2025-11-24/alcoa-shelves-plans-to-explore-perth-hills-for-bauxite-mining/106044264",
    "title": "Alcoa shelves plans to explore Perth Hills for mining expansion",
    "publish_date": "Mon, 24 Nov 2025 01:02:09 +0000",
    "category": "finance",
    "authors": [],
    "text": "US mining giant Alcoa will withdraw part of its plans to expand its mining operations in the world's only jarrah forests, following community concerns around water security and environmental impacts.\n\nThe Pennsylvania-based company has mined in WA's jarrah forests for bauxite, used to create aluminium, since the 1960s.\n\nAlcoa has two proposals before the state's Environmental Protection Authority (EPA) to expand its mines and increase its alumina production.\n\nAn aerial shot of Alcoa's operations encroaching around Serpentine Dam. (Supplied: Nearmap)\n\nPart of Alcoa's proposed expansion plans included exploration in the Perth Hills, which was met was staunch community backlash due to the potential impacts on drinking water and the forests.\n\nAlcoa has decided not to push ahead with these exploration plans due to \"stakeholder and local community input\", according to the company's director of regulatory approvals Kane Moyle.\n\nPerth council rejects Alcoa drilling over water, forest concerns Alcoa's proposed expansions to its mining operations near Perth could lead to the release of three years' worth of Australia's greenhouse gas emissions — in Australia and downstream internationally — over their lifetime, documents show.\n\n\"We did hear some very strong concerns coming out of those communities ... and what we have done here is acted in response to that,\" he told ABC Radio Perth.\n\n\"We've made a decision to prioritise our mining plans.\n\n\"This low-impact strategic drilling was all about understanding more of the resource in the northern part of our lease, but we never had any mining plans associated with this area.\"\n\nAlcoa is still proposing to expand its Myara North, Holyoake and O'Neil mining regions, and increase its alumina production at its Pinjarra refinery.\n\nCommunity 'win'\n\nThe Shire of Mundaring was one in a band of local governments opposing Alcoa's planned mining and exploration expansions, along with the Cities of Armadale, Kalamunda, and others.\n\nMundaring shire president Paige McNeil said Alcoa's decision reflected the strength of the community's concern about mining impacts on the jarrah forests.\n\nShire of Mundaring president Paige McNeil addressed a Save Perth Hills rally earlier this year. (ABC News: Phoebe Pin)\n\n\"Residents across the shire have made it clear that exploration activity in the northern jarrah forest posed risks to our biodiverse environment and water security,\" she said.\n\n\" This is a significant win for our community and our environment. \"\n\nThe shire said it would continue to advocate for safeguards against future mining activities which may impact the forest, and one of WA's major drinking water supplies, the Mundaring Weir.\n\nAlcoa's failed promise on jarrah forests In the world's only jarrah forests a US aluminium giant has been mining bauxite for 60 years. Scientists say the damage may be permanent.\n\nAlcoa said its decision not to explore parts of the Perth Hills would not necessarily be indefinite.\n\n\"It's not a permanent change in terms of excising this area from our lease, but what we don't have is any active plans in relation to this area,\" Mr Moyle said.\n\n\"If we were to consider any future proposal, it would obviously require an extent of public consultation.\"\n\nDrinking water risk\n\nAlcoa is exempt from most of WA's environmental legislation, and is instead governed under state agreements which are approved or opposed by the state development minister, who is Premier Roger Cook.\n\nInternal advice from 2023 on Alcoa's mining plans previously found the company's activities posed a \"high level of risk to public drinking water\", according to the Department of Water and Environmental Regulation.\n\nAlcoa's mining footprint between 1984 and 2022. (Supplied: Google Earth)\n\nThe state-owned Water Corporation, responsible for managing Perth's water supply, said in the event of the Serpentine Dam being contaminated, more than 100,000 people could consume contaminated water after six hours.\n\nAlcoa has previously defended its commitment to protecting water reservoirs, and its \"multi-decade track record of operating in WA without ever negatively impacting drinking water supply\".",
    "source": "ABC",
    "cluster_id": 12
  },
  {
    "url": "https://www.abc.net.au/news/2025-11-24/thai-superstar-thitikul-backs-up-with-6-2-million-golf-win/106044014",
    "title": "Thai superstar Thitikul backs up with record $6.2 million golf win",
    "publish_date": "Mon, 24 Nov 2025 00:00:36 +0000",
    "category": "sports",
    "authors": [],
    "text": "Sydney star Steph Kyriacou provided the fireworks as world number one Jeeno Thitikul claimed the riches and spoils in an action-packed finale to the LPGA Tour season in Florida.\n\nThitikul collected a monster cheque for $US4 million ($6.2 million) — the biggest in women's golf history — after successfully defending her Tour Championship crown with a commanding four-shot triumph in Naples.\n\nThe 22-year-old closed with a four-under-par 68 to finish with a remarkable 26-under 262 tournament total.\n\nThe $US8 million Thitikul has pocketed for back-to-back victories at Tiburon Golf Club ranks as the second-highest earnings at the same tournament over a two-year period in the history of all women's sport.\n\nOnly tennis star Aryna Sabalenka, with $US8.6 million earned from her 2024 and 2025 US Open triumphs, has won more.\n\nIn addition to the mega money and successive season-ending titles, Thitikul secured player of the year honours and the Vare Trophy for the LPGA Tour's lowest-ever scoring average for 2025, eclipsing the great Annika Sorenstam's 2002 record.\n\n\"Definitely means a lot,\" Thitikul said.\n\n\"Back then, when I was six years old, I'm just a really young kid that had no idea what LPGA was, what a world number one looked like.\n\n\"But as I'm stepping here on the LPGA Tour, I know our part is playing golf but also inspiring the next generation is part of our job as well.\"\n\nAfter dominating all week and starting the final round with a six-stroke buffer, she briefly had her lead cut to two shots by fellow Thai Pajaree Anannarukarn on Sunday (Monday AEST).\n\nBut Anannarukarn's challenge stalled down the stretch.\n\nStill, after being the last player to qualify for the 60-player field, Anannarukarn walked away with a life-changing $US1 million runner-up prize following her sizzling final-round 66.\n\n\"There is a lot of things to take away, for sure,\" the 26-year-old said.\n\nA hole-out eagle from the fairway bunker on the par-four 11th was the spark for world number two Nelly Korda to finish outright third, six shots behind Thitikul, after a final-round 68.\n\nWinless in 2025 after lifting seven trophies last year, Korda finished at 20 under, one stroke ahead of Gaby Lopez in fourth after the Mexican's 62-65 weekend flurry.\n\nKyriacou stormed home to join world number four Minjee Lee as the leading Australians in a tie for 13th after producing a rollercoaster equal low round of the day featuring a hole in one among two eagles, five birdies, three bogeys and eight pars.\n\nSteph Kyriacou went four-under for three holes including a hole in one, but could only finish tied for 13th at the Tour Championship. (Getty Images: Julio Aguilar)\n\nKyriacou was ambling along at one-over for her round through five holes before bursting to life with her second ace of the season on the par-three eighth.\n\nIncredibly, Kyriacou's nine-iron ace — after also jagging one at the British Open — came barely half an hour after her South Korean playing partner Hye-Jin Choi holed out on the fifth hole.\n\n\"So when I had mine I was like, 'This is like a joke; this never happens,'\" Kyriacou said.\n\nLoading Instagram content\n\n\"Yeah, it was a pretty 10-out-of-10 shot. Hitting right towards it. I picked up my tee and went to the side and everyone started cheering.\n\n\"Couldn't see it go in but heard it from the cheers.\"\n\nThe exciting Kyriacou also boasts a rare albatross in 2025 and typically closed out her year with a spectacular four-under-par run over the last three holes to rocket up the leaderboard with a final-round six-under 66.\n\nLee had surged to outright second early on Saturday but ultimately endured a disappointing weekend to also finish at 12-under after a last-round 71.\n\nFellow Australian 2025 major winner Grace Kim (69) tied for 26th at 10-under, with Hannah Green (71) equal 51st at 2-under.\n\nAAP",
    "source": "ABC",
    "cluster_id": 13
  },
  {
    "url": "https://www.abc.net.au/news/2025-11-24/new-supermarket-revives-memories-of-kalgoorlie-market-gardens/106040602",
    "title": "'Water is key': Spud King open to growing Kalgoorlie produce",
    "publish_date": "Sun, 23 Nov 2025 23:54:04 +0000",
    "category": "finance",
    "authors": [],
    "text": "Decades after dozens of Italian migrants settled in Western Australia's Goldfields to make a living off the land, a well-known WA businessman with Sicilian ancestry is making his mark on the historic mining region.\n\nKnown as the Spud King, Tony Galati's newest supermarket venture in Kalgoorlie-Boulder, 600 kilometres east of Perth, follows a multi-million-dollar investment to buy and refit the Hannans Boulevard Shopping Complex.\n\nIt follows the recent $14 million purchase of two major orchards near Manjimup in WA's South West.\n\nTony Galati says he purchased new trucks to manage the logistical challenges of the new Kalgoorlie supermarket. (ABC Goldfields: Macey Turner)\n\n\"We were a little bit worried … we put a lot of investment in this place, a massive investment,\" Mr Galati said as hundreds of residents lined up for last Thursday's official opening.\n\nSince 1998, a total of 19 Spudshed stores have opened, selling directly from the Galati family farms, which are spread across WA from Kununurra in the north to Manjimup in the south.\n\nHundreds of residents lined up for the opening of the new Kalgoorlie Spudshed supermarket. (ABC Goldfields: Jarrod Lucas)\n\nIt represents new competition for the giant duopoly of Coles and Woolworths amid a cost-of-living crisis, a decade after Mr Galati went to war with the now-defunct Potato Marketing Corporation.\n\nBut the mining city's inland location was no small logistical challenge for the sleeveless entrepreneur, who spent five years weighing up his expansion into Kalgoorlie-Boulder.\n\n\"I first came here five years ago and I really like the place,\" he said.\n\n\"So many people I have spoken to came here for a year or two, but they're still here 20 years later, so that's what made me think … it really resonated with me and here we are five years later.\"\n\nTony Galati speaking to customers at the Kalgoorlie-Boulder opening. (ABC Goldfields: Jarrod Lucas)\n\nMigrant workers did hard yards\n\nMr Galati's business empire has grown from humble beginnings. His Sicilian parents started a 2-hectare market garden in the 1960s in Spearwood in Perth's southern suburbs.\n\nIt is a familiar road walked by many Italian migrant families who arrived in WA post-World War II, including those who ventured inland to the Goldfields.\n\nLoading...\n\nBy the 1950s, Kalgoorlie-Boulder was home to at least 35 market gardens, supplying fresh produce to markets.\n\nThe city's last market garden, owned by the Trasimeno family who migrated from Italy in 1955, closed in 2003.\n\nOn the possibility of restarting a once-thriving agriculture industry, Mr Galati said he would support any local business that started growing produce in Kalgoorlie-Boulder.\n\n\"Absolutely, 100 per cent,\" he said.\n\n\"Actually, if we find any decent water we might even do that ourselves.\n\n\"We could grow produce here. The soil is really good, we just need fresh water. Water is the key.\"\n\nKalgoorlie-Boulder's fresh water supply today continues to be piped 566 kilometres via the 122-year-old Goldfields water supply scheme, built by WA's first engineer-in-chief, CY O'Connor, during the 1890s gold rush.\n\nKalgoorlie-Boulder was home to at least 35 market gardens during the 1950s. (Supplied: Marie Genovese)\n\nFamily ties run deep\n\nPerth retiree Frank Genovese, 75, said his father, Alfio, arrived in Australia in the late 1930s before World War II and eventually settled in Kalgoorlie-Boulder.\n\n\"He was told get yourself into primary industry or you'll be interned because of the war, so that's why he got into market gardens and he did that until he retired in 1969,\" he said.\n\n\"There was no air freight or refrigeration in those days, so Kalgoorlie was completely self sufficient with all of its perishable produce.\"\n\nHe remembers getting up early before school to cut cauliflower or lettuce on the day it went to market, and the horse and plough used to maintain the fields until machinery was introduced in the 1960s.\n\nTrento and Maria Trasimeno operated a market garden on Emin Street in Kalgoorlie from 1958 until 2003. (Supplied: Marie Genovese)\n\nMr Genovese's wife, Marie, was the daughter of Italian migrants, Trento and Maria Trasimeno, who ran market gardens in Kalgoorlie for 45 years until they retired to Perth in 2003.\n\n\"The soils were very rich. We fertilised the soils with waste from the abattoirs and grew everything organically, sustainably,\" Mr Genovese said.\n\n\"Water was the whole secret to life in Kalgoorlie, from the days of CY O'Connor onwards.\n\n\"The vegetables, everything was grown in Kalgoorlie during my young years. We consumed Kalgoorlie product all the way through.\"\n\nA Kalgoorlie Miner newspaper article from 2003 when Trento and Maria Tarismeno retired to Perth. (Supplied: Marie Genovese)\n\nIndustry restart unlikely\n\nRetired producer John Borromei, 70, followed in the footsteps of his Sicilian grandfather and father by operating a 5-hectare market garden with his brother until 1995.\n\nHe was also the city's last auctioneer of local produce, describing the region's clay soil as ideal for growers.\n\nBut he said access to water and workers was the biggest hurdle competing alongside big wages in the mining industry.\n\nMarket gardens in Kalgoorlie-Boulder in the 1930s. (Supplied: State Library of WA)\n\n\"Tony's got the resources, he could do it, he's got the money and he's smart,\" Mr Borromei said.\n\n\"It would be pretty expensive to set it up properly, but honestly I could never see that happening because I don't think it would be worth his while.\n\n\"You've got places like the Ord River in the Kimberley with thousands of acres, whereas I don't see the land available to set something up of scale to make it a viable proposition.\"\n\nThe Kalgoorlie City Markets circa 1902. (Supplied: State Library of WA)\n\nMr Genovese agreed, saying times had changed in Kalgoorlie-Boulder and market gardens were likely an industry lost to the past.\n\n\"It's a hard job, long hours, hot, sweaty, and the pay does not come close to up north in the mines when you can make $100,000 a year,\" he said.\n\n\"It wasn't a 40-hour week, this was people totally dedicated to progressing themselves and their children to a future, because they came here with nothing.\n\n\"You'd need to find the right soils, allocate water from the pipeline. I don't think practically you're going to do it again in Kalgoorlie. Times are different.\"",
    "source": "ABC",
    "cluster_id": 14
  },
  {
    "url": "https://www.abc.net.au/news/2025-11-24/organic-wine-on-the-rise/106031838",
    "title": "A new vintage: Why gen Z and millennials favour organic wines",
    "publish_date": "Sun, 23 Nov 2025 23:38:38 +0000",
    "category": "finance",
    "authors": [],
    "text": "In Canowindra in central-west NSW, winemaker Sam Statham has noticed a trend that has nothing to do with price or palate.\n\nThe co-owner of Rosnay Organic Farm said there was a distinct move towards environmentally conscious wine consumption.\n\n\"I'm definitely seeing young people interested in organic wine … young people with little young families,\" Mr Statham said.\n\n\"I think that's probably hit them like a truck, the realisation that the next generation is coming through and they've got to do the best they can for them.\"\n\nSam and Simone Statham in their cellar door at Rosnay Organics, Canowindra. (ABC Central West: Emily Middleton)\n\nAccording to data group IWSR, which monitors beverage trends across the globe, organic wine consumption in Australia grew by 60 per cent between 2020 and 2024.\n\nIn the same timeframe, national total wine declined by 15 per cent, meaning organic wine accounted for 4 per cent of all wine consumed in Australia in 2024.\n\nRosnay Organics, which also grows olives, has been certified organic since 1998. (ABC Central West: Emily Middleton)\n\nAnthony Saliba, a professor of psychology at Charles Sturt University and has been researching consumer behaviour for 25 years.\n\nHe said millennial and gen Z customers had a greater awareness of environmental and ethical practices.\n\n\"You've got newer, younger mindsets and practices, so some of the winemakers are just wanting to try these things out a bit more,\" Professor Saliba said.\n\nHe said less heavy wines, with a lower alcohol content, such as pétillant naturel (pét nat), were attractive to younger consumers.\n\n\"One of the stickier factors around choice for younger people is lower alcohol and lighter styles.\"\n\nAnthony Saliba says younger consumers tend to be more aware of environmental factors. (Supplied: Anthony Saliba)\n\nSustainable winemaking\n\nSustainability is another key factor in the choices made by customers, according to research organisation Wine Australia, which found 62 per cent of wine drinkers had a \"high connection to sustainability\".\n\nNSW Wine Industry Association executive officer Matthew Jessop said the trend towards organic wine was good news for the state.\n\n\"If you look across all of our regions, there are lots of organic producers but there are also lots of people that are farming their properties regeneratively or biodynamically, being good to the earth,\" he said.\n\nOrganic wine consumption in Australia grew by 60 per cent between 2020 and 2024. (ABC Central West: Emily Middleton)\n\nMr Jessop said the farming practices had been around for decades, but the uptake from consumers took time.\n\n\"Just take a region like Orange, two of the biggest producers there, Seesaw and Tamburlaine … both of them are organic and have been for quite some time,\" he said.\n\nBecoming organic\n\nIn Australia, wine grape growers can become certified organic, meaning the entire process from vine to bottle meets strict standards that are regularly checked; however not all organic wines have this label.\n\nMr Statham's operation was organically certified in 1998.\n\nSam Statham's wines are certified as organic. (ABC Central West: Emily Middleton)\n\nHe said it was not so much about the final product being chemical-free, but rather the process and management plan.\n\n\"It's about demonstrating that you actually have tools in your toolbox to deal with the problems that you've got, so they can feel assured that you're not going to be tempted to reach for some pesticides, fungicides and herbicides,\" he said.\n\n\"I don't want to use chemicals … and I don't want to be paying other people to use chemicals and be exposed to chemicals.\"",
    "source": "ABC",
    "cluster_id": 15
  },
  {
    "url": "https://www.abc.net.au/news/2025-11-24/union-questions-metro-tunnel-emergency-safety-permit-validity/106043620",
    "title": "Firefighters union questions Metro Tunnel safety permit",
    "publish_date": "Sun, 23 Nov 2025 23:05:45 +0000",
    "category": "finance",
    "authors": [],
    "text": "A stoush over the safety of Melbourne's Metro Tunnel has escalated, with Victoria's firefighters union asking the national rail safety authority to assess the validity of accreditation given to run services in the underground network.\n\nBut the Office of the National Rail Safety Regulator (ONRSR) and other stakeholders have strongly refuted claims the Metro Tunnel's emergency response systems are unsafe, saying it supports the opening of the tunnel in less than a week.\n\nThe United Firefighters Union (UFU) has reported all Fire Rescue Victoria (FRV) radios failed to connect to the antenna systems used by emergency services when an unknown number of them were tested in the tunnel in mid-November.\n\nIt claimed 6,000 portable radios used by FRV would need to be reprogrammed by Telstra and re-tested.\n\nThat process could take more than a month, the union said. The tunnel's first passenger services are due to run on Sunday.\n\nAs well as the alleged radio issues, the UFU claimed operator Metro Trains Melbourne (MTM) failed to carry out required consultation with the union as part of its safety accreditation to operate services in the tunnel.\n\nUnion secretary Peter Marshall wrote to the rail safety regulator questioning the validity of Metro Train's permit to operate in the Metro Tunnel.\n\nIn a copy of a letter to the ONRSR seen by the ABC, the UFU also alleged underground breathing equipment was outdated and non-operational, there were problems with emergency vehicles used to travel along the tunnel's rail tracks, that Metro Trains staff needed better understanding of fire indication panel operations and that there was insufficient atmospheric monitoring for smoke or toxic gasses.\n\nIt said it had obtained legal advice that failing to consult with the union rendered Metro Train's safety plan invalid and that it was a criminal offence to run rail services without that accreditation.\n\n\"When we plan public transport, we should plan for public safety,\" UFU Secretary Peter Marshall said in a statement.\n\nVictorian infrastructure in the spotlight The Victorian government has defended the safety of the soon-to-be-opened West Gate Tunnel as a visit from Prime Minister Anthony Albanese coincided with key Metro Tunnel and Suburban Rail Loop updates.\n\n\"In their haste to open infrastructure, the government has abandoned safety altogether.\n\n\"They have pushed communications testing to the last minute, only to find nearly every radio firefighters depend on has failed.\"\n\nBut the ONRSR said it had been provided detailed evidence of consultation between MTM and FRV, including on the issue of radio systems in the Metro Tunnel.\n\n\"Modifications have been made, including the implementation of additional relays in all cross passages of the tunnel,\" a spokesperson from the regulator said.\n\nThe regulator also said it had been issued with a copy of a \"Letter of No Objection\" that FRV sent to MTM to indicate its support for the opening of the tunnel.\n\nPremier Jacinta Allan says the union's claims are wrong. (ABC News)\n\nPremier Jacinta Allan was asked about the issue at a media event with Metro Trains CEO Raymond O'Flaherty at Parkville Station on Monday morning.\n\n\"The claims that have been made by the union today are wrong,\" Ms Allan said.\n\n\"And they've also been clearly rejected by the rail safety regulator who is the expert on this matter.\"\n\nMr O'Flaherty said the tunnels had state-of-the-art emergency systems.\n\n\"Fire Rescue Victoria has carried out a lot of tests of the systems, the regulator is satisfied … everything is safe and we're actually ready to go.\"\n\nMetro Trains CEO Raymond O'Flaherty says the Metro Tunnel is safe and ready to begin operations. (ABC News)\n\nFRV said it had been involved in the project from its early stages to ensure crucial safety features were included in the tunnel's designs.\n\nIt said there was a contingency plan for any radio faults.\n\nThe UFU has been waging a campaign about safety in the underground rail network and the new West Gate Tunnel road project, along with long-running industrial disputes against Fire Rescue Victoria (FRV) and the state government.\n\nPremier Jacinta Allan was joined by Prime Minister Anthony Albanese earlier this month in announcing the early opening date of Sunday, November 30.",
    "source": "ABC",
    "cluster_id": 16
  },
  {
    "url": "https://www.abc.net.au/news/2025-11-24/what-did-mclaren-do-wrong-at-the-las-vegas-f1-grand-prix/106043812",
    "title": "What did McLaren do wrong in shock disqualification at Las Vegas GP?",
    "publish_date": "Sun, 23 Nov 2025 22:37:43 +0000",
    "category": "sports",
    "authors": [],
    "text": "McLaren has apologised to drivers Oscar Piastri and Lando Norris after the pair was disqualified from the Las Vegas F1 Grand Prix.\n\nThe disqualification came after it was found the skid blocks — also known as the plank — that runs underneath the car had worn too much during the course of the race.\n\nThe plank is 10mm thick and cannot wear more than 1mm during a race.\n\nAt its worst spots, Norris's plank had worn by 1.12mm and Piastri's by 1.26mm.\n\nThe plank runs along the bottom of the car. (Getty Images: Mark Sutton)\n\nWearing happens when the bottom of the car drags along the track. The rule exists to stop teams from running their cars too low, which gives the vehicle an aerodynamic advantage.\n\nTwo previous plank disqualifications — in Shanghai earlier this year and in Austin in 2023 — came during sprint weekends and had been explained as teams not having enough time to practise and verify calculations around fuel load and suspension configuration.\n\nWet weather in Las Vegas had made it difficult for teams to lock in a configuration that would suit qualification and withstand the race, while the bumpiness of the Vegas circuit also meant a greater risk to the plank wearing down.\n\nHowever, McLaren was the only team to make a mistake.\n\nSensors on the plank can tell the team that it is wearing more than usual during a race, but there is no way to judge exactly how much wear the plank has endured. The team had directed the drivers to drive more conservatively mid-race, suggesting they knew there was an issue.\n\n\"The skid wear of car numbers 81 and 04 was checked,\" the technical delegate's report read.\n\n\"The rearmost skid was measured on both cars according to the team's submission in accordance with TD039 M, item 1.2 b) i).\n\n\"The measured thickness was less than 9mm on both cars, which is the minimum thickness required by TR Article 3.5.9 e).\"\n\nTeam apologises to drivers\n\nMcLaren said the breach was unintentional, and a high level of \"porpoising\" had caused the error. Porpoising is the rhythmic bounce of the bottom car during the race.\n\n\"We apologise to Lando and Oscar for the loss of points today, at a critical time in their championship campaigns after two strong performances from them all weekend,\" team principal Andrea Stella said in a McLaren statement.\n\nThe damaged underfloor plank from a McLaren car during the 2014 season. (Getty Images: Darren Heath)\n\n\"During the race, both cars experienced unexpected, high levels of porpoising not seen in the practice sessions, which led to excessive contact with the ground.\n\n\"We are investigating the reasons for this behaviour of the car, including the effect of accidental damage sustained by both cars, which we found after the race, and that led to an increase of movement of the floor.\n\n\"As the FIA noted, the breach was unintentional.\"\n\nMcLaren had argued that interrupted practice sessions — including one that was almost completely wiped out due to a loose drainage cover — qualified as mitigating circumstances.\n\nRace stewards wrote that while they did agree that the breach was unintentional, there was no provision for a lesser punishment than disqualification.\n\n\"The team submitted that the degree of the breach was lower than prior breaches of this regulation in 2025,\" a statement read.\n\n\"The FIA argued that, unfortunately, there was no provision in the regulations or in precedent for any penalty other than the usual penalty [i.e., disqualification].\n\n\"The FIA noted that it strongly held the view that the breach was unintentional and that there was not a deliberate attempt to circumvent the regulations.\"\n\nDrivers react\n\nThe incident has left Norris in particular in a precarious position with two races and a sprint left in the calendar, with Las Vegas winner Max Verstappen now sitting equal with Piastri on points, just behind Norris.\n\n\"Disappointing to come away from this weekend with no points after an unfortunate disqualification due to skid wear,\" Australian star Piastri said.\n\nWhat Piastri needs to do in the final rounds to snatch the F1 championship Here is how the drivers' championship is poised with two rounds remaining.\n\n\"With how close the grid is, we're always looking at where we can gain performance, and we didn't get it right this time.\n\n\"We now need to reset, refocus and push to get the best points possible in the final two rounds, both tracks that we've been strong at previously.\"\n\nNorris said he was frustrated as his title hopes looked more uncertain.\n\n\"A frustrating end to today,\" Norris said.\n\n\"We had to do some managing towards the end of the race, and now we know it was due to some issues with our car, which have unfortunately resulted in us being disqualified.\n\n\"It's frustrating to lose so many points. As a team, we're always pushing to find as much performance as we can, and we clearly didn't get that balance right today.\"",
    "source": "ABC",
    "cluster_id": 17
  },
  {
    "url": "https://www.abc.net.au/news/2025-11-24/cristiano-ronaldo-scores-stunning-bicycle-kick-in-saudi-league/106043828",
    "title": "Cristiano Ronaldo scores stunning bicycle kick in Saudi league at 40",
    "publish_date": "Sun, 23 Nov 2025 22:16:37 +0000",
    "category": "sports",
    "authors": [],
    "text": "Cristiano Ronaldo gave another demonstration of his enduring quality by scoring from a bicycle kick for his Saudi Arabian club on Sunday.\n\nRonaldo's goal came in the sixth minute of added time, with the stunning strike crowning Al-Nassr's 4-1 win over Al Khaleej in the Saudi Pro League.\n\nThe 40-year-old Portugal superstar was waiting to launch as a cross came in from the right wing.\n\nAs an Al Khaleej defender rushed toward him, Ronaldo leapt and twisted his body to crush an acrobatic volley into the top left corner of the net past a despairing dive from keeper Anthony Moris.\n\nThe striker then gave home fans what they wanted.\n\nHe ran towards the corner flag before delivering his trademark \"Siu\" celebration — leaping, spinning and planting his feet while bringing his arms to his side in a flourish that prompted a roar from the stands at the King Saud University Stadium in Riyadh.\n\nThe big win extended Al-Nassr's lead at the top to four points over Al-Hilal.\n\nRonaldo, who moved to the Saudi team in 2023, has been a prolific scorer with nearly a goal a game — 85 goals from 87 appearances — since his arrival.\n\nRonaldo has just returned from international duty with Portugal, during which he was sent off against Ireland but celebrated his country qualifying for the World Cup.\n\nSwinging elbow earns Ronaldo first ever international red card Cristiano Ronaldo is mocked by Irish fans after being sent off for the first time in his international career following a vicious swinging elbow at his opponent in a World Cup qualifier.\n\nHis swinging elbow on Irish defender John O'Shea was initially given a yellow card, as the Portuguese great wound up the fans in Dublin by making a crying gesture.\n\nHowever, a review by VAR found the foul worthy of a red card, and Irish fans responded by cheering and making the same crying gesture back at Ronaldo as he walked off the field.\n\nIf he goes, it will be a record sixth appearance in the World Cup, however he may miss his country's first one or two games at the finals, depending on any penalty he receives for the send-off against Ireland.\n\nAP/ABC",
    "source": "ABC",
    "cluster_id": 18
  },
  {
    "url": "https://www.abc.net.au/news/2025-11-24/wagga-wagga-residents-call-for-insurance-investigation/106026284",
    "title": "Flood insurance premiums still rising in area last inundated in 1956",
    "publish_date": "Sun, 23 Nov 2025 22:02:00 +0000",
    "category": "finance",
    "authors": [],
    "text": "The last time Wagga Wagga's CBD was inundated by floodwater, Robert Menzies was the prime minister, Melbourne was ready to host the Olympics, and Elvis Presley was topping the charts.\n\nSo, when David and Vicki Malligan received their annual insurance renewal from Coles Insurance this year, they were convinced there had been a mistake.\n\nThe cost of insuring their new-build central Wagga Wagga unit against flooding increased from just over $500 in 2024 to nearly $9,000 in 2025.\n\nVickie and David Malligan faced a 94 per cent annual hike in their insurance premium for their property in central Wagga Wagga. (ABC News: Melinda Hayter )\n\nThe 2025 renewal notice for Vickie and David Malligan's Wagga Wagga property. (ABC News: Melinda Hayter )\n\n\"We started looking around for other insurers to take on our property, going through maybe eight insurance companies, and we could not get a quote below a few thousand dollars,\" Mr Malligan said.\n\n\"It's legal extortion.\"\n\nLocal broker Georgina Brown said it was a widespread issue across the southern New South Wales city of nearly 70,000 people.\n\n\"Among the four or five insurers we have that issue home insurance, I would say that the premiums have gotten worse in the last five years,\" she said.\n\n\"It definitely seems to be a whole-market approach.\"\n\nThe hike in premiums comes at a time when the city should be less likely to flood.\n\nUpgraded levee\n\nIn 2020, Wagga Wagga City Council completed a $23m upgrade to the city's extensive levee system, which is rated to protect the central business district and surrounding residential areas from one-in-100-year floods in the Murrumbidgee River.\n\nThe improvements came after major flooding in 2012, which resulted in the evacuation of the CBD for just over 24 hours, but did not lead to inundation.\n\nWagga Wagga's levee bank system protects the CBD and surrounding residential areas from inundation when the Murrumbidgee River floods. (Supplied: Wagga Wagga City Council )\n\nThe last time the Wagga CBD flooded was in 1956.\n\nMeanwhile, in Queensland, the inland town of Roma has been lauded by the federal government as an example of how flood mitigation projects like levees can reduce insurance premiums.\n\nIn a 2023 speech to the Insurance Council of Australia's conference, former assistant treasurer and minister for financial services Stephen Jones said, \"… the construction of the levee [in Roma] reduced insurance premiums by an average of 34 per cent.\"\n\nScott Sanbrook, CEO of advocacy group Committee 4 Wagga, cannot understand why the opposite situation has happened in his community.\n\nScott Sanbrook says the higher insurance premiums in the city's CBD make life difficult for residents and businesses alike. (ABC News: Melinda Hayter )\n\n\"We've received a lot of feedback from residents. They ask, 'Why am I paying more money than ever before, when the CBD is safer than it ever has been?'\" Mr Sanbrook said.\n\nIn a statement to the ABC, the Insurance Council of Australia said the upgrade of the Wagga levee had been fully incorporated into the National Flood Information Database (NFID) — a key tool the insurance agency uses to determine flood risk to individual properties.\n\nInconsistent insurance mapping\n\nMs Brown said she was told the increases were a result of climate change, but the premiums being charged seemed inconsistent.\n\n\"I tried to quote a property in the Wagga CBD, which was returning a premium well over $15,000. Yet, changing that address to an area in Shepparton that actually did flood in the past three years, the premium came back to below $5,000,\" Ms Brown said.\n\nFloodwaters from the Goulburn River inundated Shepparton in October 2022. (ABC News: Danny Morgan)\n\n\"There definitely is something not working correctly in the background.\"\n\nA comparison of home insurance quotes for a property in central Wagga Wagga. (Supplied: Georgina Brown )\n\nWagga vs Lismore\n\nThe ABC lodged an insurance quote using NRMA's online portal for a property currently for sale in the northern NSW city of Lismore — a well-known flood hotspot.\n\nThe property, which the listing agent notes was affected by flooding in 2022, returned an annual home insurance quote, which includes flood cover, of just over $9,427.\n\nLismore recorded its highest flood on record in February 2022. (Supplied: Rod Evans)\n\nThat is only about $500 more than the quote offered to the Malligans for a property that has not flooded in almost 70 years.\n\n\"Personally, I'd like to see a bit of an overhaul and a lot more transparency from the insurers on how they have arrived at their pricing,\" Ms Brown said.\n\n\"Many will send their renewal schedules out where it'll say, 'If you want information on how we've arrived at your premium, give us a call,' but that really doesn't result in much enlightenment.\"\n\nGeorgina Brown believes premiums have increased in Wagga's CBD since the city's levee bank was upgraded. (ABC News: Melinda Hayter )\n\nA spokesperson from QBE acknowledged concerns around rising insurance costs and the complex factors driving premiums, including increasing severity of weather events, rising global reinsurance costs and higher inflation.\n\nNRMA Insurance said pricing in Wagga had been updated twice, during the Wagga levee's construction and just prior to it being completed, and that on average, local premiums decreased by up to 33 per cent.\n\nAllianz said it reviewed flood premiums based on government maps, external data and flood risk modelling.\n\nThe ABC has sought comment from Coles Insurance, which is underwritten by the Auto and General Insurance Company, regarding the Malligans' renewal notice.\n\nThe couple has reinsured their property with a new provider, but it was still double what they paid last year.\n\nThe situation has David Malligan thinking about the future.\n\n\"It's not going to take too much to tip us over the edge and say, 'Bugger it, we're outta here'.\"",
    "source": "ABC",
    "cluster_id": 19
  },
  {
    "url": "https://www.abc.net.au/news/2025-11-24/australians-switching-jobs-as-ai-changes-workforce/106036106",
    "title": "'It's been really disheartening': The reality of trying to find a new job",
    "publish_date": "Sun, 23 Nov 2025 22:01:47 +0000",
    "category": "finance",
    "authors": [],
    "text": "Hairdresser Lisa Seeger is feeling the impact of a tough jobs market.\n\n\"I'm a sole income, single parent, paying a mortgage on my own,\" Ms Seeger said.\n\n\" If I don't get a [better-paying] job, I'm going to have to start putting the wheels in motion of trying to get my house ready to sell. \"\n\nFalling job mobility is making it harder for many Australians to secure better-paying positions and advance their careers.\n\nThere are also concerns the growing use of artificial intelligence (AI) could result in even bigger changes to the Australian workforce.\n\nAfter 16 years of running her own salon, Ms Seeger wants a job that is less physically demanding and higher paying.\n\nShe is looking at roles in sales, customer service and local government.\n\nLisa Seeger worries that employers' use of AI is limiting her chances to change careers. (ABC News: Peter Drought)\n\nBut in the six months of trying to find work, she has faced a series of rejections.\n\n\"I thought I had a lot to offer, I thought I'd have a lot of transferable skills from running my own business,\" she said.\n\n\"Everyone keeps telling me, 'Oh you'll smash it, you'll get a job', but it's been really disheartening and disappointing.\"\n\nMs Seeger said she believed AI was playing a role in her struggle to find work, with employers using it to weed out applicants without relevant experience.\n\n\" We need to remember that sometimes how someone presents on paper isn't actually who they are in person. \"\n\nDo you know more? Contact Fiona Blackwood at blackwood.fiona@abc.net.au.\n\nDespite her struggle in an uncertain job market, Ms Seeger is determined to show her daughter that a career change is possible.\n\n\"I'm going to continue to be resilient and try and find a better job that pays better money, [so] that I can provide for her and keep a roof over our heads for the future.\"\n\nThe Grattan Institute's Trent Wiltshire said Australia should start preparing for disruption now, saying \"the dawn of AI is certainly upon us, it's in all workplaces\".\n\nThere are many uncertainties around how artificial intelligence will affect the workforce. (ABC News: Mark Leonardi)\n\nHow has the jobs market changed since the pandemic?\n\nWhile still relatively low, the unemployment rate of 4.3 per cent in October has been on an upward trajectory for the past three years. It was 3.4 per cent in October 2022.\n\nThe number of jobs being advertised over the past year has dropped.\n\nThere were 5,000 fewer job vacancies, a drop of 1.5 per cent, over the year to August 2025, according to the Australian Bureau of Statistics.\n\nArtificial intelligence is being used by employers and those looking for work. (Unsplash: Israel Andrade)\n\nAfter the pandemic, there was a big demand for labour.\n\nSince then, job mobility has fallen for a second year in a row — 7.7 per cent of employed people changed their employer or business in the year to February 2025, compared with a job mobility rate of 9.5 per cent in 2022.\n\n\"We've really come off the back of a jobs boom a couple of years ago and the labour market and the economy has been slowing down,\" Blair Chapman, senior economist for jobs website SEEK, said.\n\nJob mobility is important for individual wage growth and the broader economy.\n\n\"If you want wage increases, often the best way to get them is to switch jobs,\" Mr Chapman said.\n\nWhy is it getting harder to change careers?\n\nAlongside a slowdown in the economy, an ageing population could be part of the reason job mobility is declining, with more older Australians less likely to change jobs.\n\nMr Wiltshire said competition and business dynamism had also reduced.\n\n\"So that means more legacy firms stay around longer and there's fewer new start-ups,\" he said.\n\nTrent Wiltshire says the government needs to prepare for disruption that will be caused by AI. (ABC News: Peter Drought)\n\nA tighter jobs market in New Zealand could also be having an impact.\n\nThe New Zealand unemployment rate was at 5.3 per cent for the September quarter this year, the highest rate in nine years.\n\n\"There are a lot of Kiwis looking for jobs in Australia,\" Mr Chapman said.\n\nUncertainty around US tariffs and the promise of AI could be other reasons why businesses are reluctant to increase their headcount.\n\nBusinesses use AI to check job applications\n\nLisa Seeger is concerned that AI is limiting her chances to change careers by eliminating applications without relevant experience.\n\nMr Chapman said AI was increasingly being used by employers and job seekers.\n\n\"Around 20 per cent of new hirers are making use of AI to write their job ads and to streamline that process,\" he said.\n\n\"A little bit over one-third of candidates are using AI to help write their cover letters and CVs and things like that.\"\n\nBlair Chapman says changing jobs is often the best way for workers to get a wage increase. (Supplied)\n\nHe said while Seek provided a full list of candidates who had applied for a job to the hirer, AI could be used by the employer to go through applications to make sure a person had relevant experience.\n\n\"If you are a forklift driver do you have a forklift licence? AI is making that sort of very tick box exercise much quicker.\"\n\nWhat can be done?\n\nThe rapid growth of the use of AI is threatening a range of jobs, including radiologists, middle managers and financial analysts, according to the Grattan Institute's Trent Wiltshire.\n\nMr Wiltshire said it was not yet clear whether companies would use AI to replace workers in order to reduce costs or use it to improve the productivity of existing workers.\n\n\"There's a potential doomsday scenario where there's mass unemployment,\" he said.\n\nArtificial intelligence is threatening a range of jobs, Trent Wiltshire says. (AAP: Dan Himbrechts)\n\nMr Wiltshire said while the doomsday scenario was unlikely, contingency plans were needed and the government should be preparing now.\n\n\"The job seeker [unemployment benefit] rate is very low, it's not going to be adequate for a lot of people,\" he said.\n\nMr Wiltshire said the government should consider unemployment insurance, which is a higher but time-limited payment linked to a person's previous income.",
    "source": "ABC",
    "cluster_id": 20
  },
  {
    "url": "https://www.abc.net.au/news/2025-11-24/eze-s-derby-hat-trick-gunners-six-points-clear-premier-league/106043700",
    "title": "Eze's derby hat-trick sends Arsenal six points clear in Premier League",
    "publish_date": "Sun, 23 Nov 2025 21:03:32 +0000",
    "category": "sports",
    "authors": [],
    "text": "Eberechi Eze scored a majestic hat-trick for Arsenal as they trounced north London rivals Tottenham Hotspur 4-1 to open up a commanding six-point lead at the top of the Premier League on Sunday.\n\nFor 36 minutes, the derby was a cagey contest with Tottenham frustrating Mikel Arteta's side, but the hosts struck three times in 10 minutes either side of half-time.\n\nLeandro Trossard broke the deadlock from close range before Eze, the player Arsenal snatched in a summer transfer tussle with Tottenham, rifled in Arsenal's second after 41 minutes.\n\nThe second half was only seconds old when Eze again found space on the edge of the area to dispatch another shot inside the post and put his side in complete control.\n\nTottenham got a lifeline out of the blue in stunning fashion in the 55th minute when Richarlison lobbed Arsenal keeper David Raya from near the centre circle.\n\nThe visitors were more of a threat in the second half, but Arsenal never really looked troubled, and Eze completed his hat-trick in the 76th minute with another clinical finish.\n\nArsenal, unbeaten in nine league games, have 29 points from 12 games, with second-placed Chelsea on 23. Tottenham's first away league defeat of the season left them ninth on 18 points.\n\nEze was at the centre of a summer transfer battle between the two north London clubs, with Arsenal scooping the former Crystal Palace forward from under the noses of their rivals.\n\nIf that was not bad enough, the England international rubbed Tottenham's noses in it on Sunday as he lit up his first north London derby in scintillating fashion.\n\nTottenham had been impressive away from home under new manager Thomas Frank with no defeats and only three goals conceded in the Premier League before Sunday.\n\nFrank set his side up conservatively for his first taste of the derby, with containment, not entertainment, on his mind.\n\nThree central defenders, two holding midfielders and deep fullbacks restricted Arsenal to just one real chance in the opening half an hour with Eze's scooped pass met on the volley by Declan Rice and Guglielmo Vicario saving well.\n\nVicario was not called into serious action again until the 33rd minute when he sprang to his right to keep out a Bukayo Saka free kick.\n\nBut the breakthrough came soon after as, for once, Arsenal found space in the Tottenham area with Mikel Merino's chipped pass controlled by Trossard with his back to goal.\n\nThe Belgian took a touch and his shot on the turn nicked off Micky van de Ven to give Vicario no chance.\n\nTottenham's negative game plan was in tatters when Eze turned on the edge of the area and fired a low shot through a crowd and beyond Vicario.\n\nFormer Crystal Palace forward Eberechi Eze was on target for Arsenal against Spurs in the North London Derby. (Getty Images: Julian Finney)\n\nThe visitors sent on attacking midfielder Xavi Simons at half-time, but within seconds of the restart, it was effectively all over as a contest as once again Eze was allowed too much time and he thrashed a shot past Vicario.\n\nTottenham had not landed a glove on Arsenal for 55 minutes but scored with their first shot on target as Joao Palhinha won the ball just inside Arsenal's half and Richarlison, spotting Raya off his line, floated a 45-metre shot into the net.\n\nIt maintained Tottenham's record of scoring in every away derby at Arsenal since 2017, and for a while, they were re-energised.\n\nBut any hope of a comeback ended when Eze yet again found space, and his finish was sublime.\n\nReuters",
    "source": "ABC",
    "cluster_id": 21
  },
  {
    "url": "https://www.smh.com.au/national/head-explains-why-he-opened-20251124-p5nhy7.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Head explains why he opened",
    "publish_date": "Mon, 24 Nov 2025 13:00:39 +1100",
    "category": "finance",
    "authors": [],
    "text": "Head explains why he opened\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 22
  },
  {
    "url": "https://www.smh.com.au/business/markets/asx-set-to-jump-as-wall-street-swings-higher-20251124-p5nhs2.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "ASX climbs after Wall Street swings higher; Macquarie bids $11.6b for Qube",
    "publish_date": "Mon, 24 Nov 2025 12:56:58 +1100",
    "category": "finance",
    "authors": [
      "Staff Reporters"
    ],
    "text": "The Australian sharemarket has made a bright start to the week after Wall Street swung higher to close last week on rising hopes of US interest rate cuts.\n\nThe S&P/ASX 200 was 81.4 points, or 1 per cent, higher to 8497.9 in early afternoon trade on Monday as all 11 sectors climbed higher, with tech and materials among the best performers.\n\nWall Street closed the week with a positive session. Credit: AP\n\nMining stocks are higher. BHP advanced 0.5 per cent after it announced on Monday morning it was abandoning plans to pursue a takeover of Anglo American, after the two companies had preliminary discussions. It is the second time in the past two years the Australian giant has stepped away from a chase for Anglo. Rio Tinto jumped 2.2 per cent and Fortescue gained 1.4 per cent. Among gold miners, Northern Star (up 1.4 per cent), Evolution Mining (up 2.1 per cent) and Newmont (up 1.7 per cent) gained while rare earths miner Lynas jumped 4.4 per cent.\n\nFinancial stocks are mixed, with Westpac (up 1.1 per cent) the best of the big four banks while Commonwealth Bank added 0.6 per cent but National Australia Bank and ANZ Bank edged 0.1 per cent lower in early afternoon trade.",
    "source": "SMH",
    "cluster_id": 23
  },
  {
    "url": "https://www.smh.com.au/national/missed-a-golden-chance-vaughan-lashes-englands-dumb-cricket-20251123-p5nhms.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "'Missed a golden chance': Vaughan lashes England's 'dumb cricket'",
    "publish_date": "Mon, 24 Nov 2025 12:55:06 +1100",
    "category": "sports",
    "authors": [],
    "text": "'Missed a golden chance': Vaughan lashes England's 'dumb cricket'\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 24
  },
  {
    "url": "https://www.smh.com.au/traveller/aerial-view-of-the-mushroom-area-of-wadi-rum-desert-in-jordan-20251124-p5nhy1.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Aerial view of the Mushroom Area of Wadi Rum Desert, in Jordan",
    "publish_date": "Mon, 24 Nov 2025 12:47:10 +1100",
    "category": "finance",
    "authors": [],
    "text": "Remove items from your saved list to add more.\n\nYou have reached your maximum number of saved items.\n\nSave this video for later\n\nAdd videos to your saved list and come back to them anytime.\n\nGot it",
    "source": "SMH",
    "cluster_id": 25
  },
  {
    "url": "https://www.smh.com.au/sport/nfl-legend-erupts-during-sons-debut-20251124-p5nhy2.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "NFL legend erupts during son's debut",
    "publish_date": "Mon, 24 Nov 2025 12:45:41 +1100",
    "category": "sports",
    "authors": [],
    "text": "NFL legend erupts during son's debut\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 26
  },
  {
    "url": "https://www.smh.com.au/property/news/opera-singer-s-carindale-house-hits-high-note-in-1-69m-auction-20251124-p5nhu3.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Opera singer’s Carindale house hits high note in $1.69m auction",
    "publish_date": "Mon, 24 Nov 2025 12:27:24 +1100",
    "category": "finance",
    "authors": [
      "Sarah Webb"
    ],
    "text": "A brick-and-tile ’80s relic in the heart of Brisbane’s burgeoning suburbia sparked one of the city’s fiercest pre-Christmas auction battles on Saturday, with 12 buyers going head-to-head before it sold for a reserve-smashing $1.69 million.\n\nDrawn by the 673-square-metre block, solid bones, and the chance to buy into a suburb where house prices have almost doubled in five years, 36 bidders registered for the auction of 96 Kilmorey Street, Carindale.\n\nA young couple outlasted investors and interstate punters to claim the keys.\n\nThe four-bedroom, two-bathroom deceased estate – which was home to a beloved local and opera singer – drew dozens of groups during a short, high-intensity campaign, with all proceeds of the sale earmarked for an animal charity.",
    "source": "SMH",
    "cluster_id": 27
  },
  {
    "url": "https://www.smh.com.au/goodfood/melbourne-eating-out/head-to-this-clayton-bakery-for-greek-frappe-coffee-and-fresh-spanakopita-20251124-p5nhxj.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Head to this Clayton bakery for Greek frappe coffee and fresh spanakopita",
    "publish_date": "Mon, 24 Nov 2025 12:26:14 +1100",
    "category": "finance",
    "authors": [
      "Dani Valent"
    ],
    "text": "Add articles to your saved list and come back to them anytime.\n\nThe Grain Emporium has baked its own bread for more than three decades.\n\nOutside of Clayton’s Grain Emporium. Wayne Taylor\n\nBakery$$$$\n\nThey bake their own bread at this three-decade stayer but you’ll have to peer past a laden fridge of cakes and pastries to see the racks of multigrain and high-tops. Owners Jim Mademlis, Nick Mademlis and Alex Moscon also serve a classic Greek frappe coffee and a lovely spanakopita, which they’ll happily warm for you to eat at pavement tables.\n\nWant to visit this venue? Save it in the Good Food app.",
    "source": "SMH",
    "cluster_id": 28
  },
  {
    "url": "https://www.smh.com.au/national/body-found-in-search-for-missing-swimmer-off-nsw-coast-20251124-p5nhxk.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Body found in search for missing swimmer off NSW Coast",
    "publish_date": "Mon, 24 Nov 2025 12:16:56 +1100",
    "category": "sports",
    "authors": [],
    "text": "Body found in search for missing swimmer off NSW Coast\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 29
  },
  {
    "url": "https://www.smh.com.au/lifestyle/life-and-relationships/the-best-christmas-gifts-from-7-to-100-for-2025-20251027-p5n5n9.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "The best Christmas gifts from $7 to $100 for 2025",
    "publish_date": "Mon, 24 Nov 2025 12:13:40 +1100",
    "category": "lifestyle",
    "authors": [
      "Lauren Ironmonger"
    ],
    "text": "Nice Pickles Pickled Pineapple If they love a Hawaiian pizza, then they’ll love this jar of pickled pineapple ($15). Made in South Australia by self-professed “pickle nerds” Nice Pickles, they’re brined with mint, jalapeño and ginger, making the perfect sweet, sour and tangy addition to toasties, salsa, pizza or even avocado toast. Fend Insect Repellant\n\nFor the person planning on spending their whole summer outdoors, or has a tropical holiday on the horizon, consider this Insect Repellent from Australian brand Fend ($19 for 50ml travel pump). Unlike your run-of-the-mill mozzie spray, it has a gentle scent, is non-oily and hypoallergenic, meaning it’s suitable for sensitive skin and kids. Muji Soft Slippers Muji’s Soft Slippers ($15) are an affordable gift for the homebody in your life. They come in a range of colours and open and closed-toe options, plus, they’re the airplane shoe of choice for Lune Croissanterie founder Kate Reid. Able & Game Microfibre Glasses Cleaner\n\nFor the glasses wearer in your life, these microfibre cleaning cloths from Able & Game ($10) are a fun and practical gift. Available in a range of prints (mainly centred around cats, sorry dog lovers), they can also be used to clean jewellery, tablets, phones or laptops. Hultafors Fire Steel Flint The Hultafors Fire Steel Flint ($25) is a great little tool for the habitual camper. Made from ultra-thick steel and designed for ergonomic use, both ends of the steel can be struck and it can be used in all weather conditions.\n\nMesa Collections Fish Lemon Squeezer For the citrus lover in your life, consider this cute fish lemon squeezer ($20) from Mesa Collections. It’s a handy kitchen aide to have on hand – whether it’s juicing 10 lemons for a pitcher of lemonade or adding a final touch to a whole-baked fish – and looks pretty sitting on a kitchen shelf when not in use. The best Christmas gifts under $50\n\nA nice gift for someone who’s recently moved into a new home, Studio Roof’s Dutch Masters Bouquet ($40) are pretty flowers they won’t be able to kill. Printed on recycled cardboard with vegetable ink, this option is inspired by the traditional realism of painters like Rembrandt and Vermeer – but the range includes styles to suit any taste, from Monet to Van Gogh. Karst Goods Studio Muse Notebook Karst Goods’ notebooks are a great option for the accident-prone doodler or adventurer in your life. Their Studio Muse Notebook ($45) comes in a range of bold and graphic cover designs. Its clever paper, made from recycled stone, is waterproof and tear resistant and thread-bound to lay completely flat for comfortable note-taking. Produce Pod\n\nIf you have someone in your life that loves a farmer’s market, Produce Pod’s Veggie Bags ($47) are a practical gift. Made with an inner cotton layer that retains moisture and a breathable outer later, they’re designed to extend the life of fruit and veggies. As a bonus, they can be thrown in the washing machine for easy cleaning. Two Good Co x Messina Make-At-Home Gingerbread Cookie Pie For the baker in your life, this Gingerbread Cookie Pie kit from Gelato Messina ($40) makes a great rainy-day activity. Each pack contains everything they’ll need to make a delicious festive treat. Made in collaboration with social enterprise Two Good Co., 50 per cent of proceeds from each sale go towards supporting and employing women in crisis.\n\nStitched Up Embroidery Kits For the person looking to take up a new hobby this Christmas, these embroidery kits from Australian brand Stitched Up, owned by two sisters, are a nice option. This mini lobster kit ($50), is perfect for food lovers, but the brand also sells larger sizes ($60) including this handsome Kookaburra. Kits are beginner-friendly and come with step-by-step printed instructions as well as video tutorials. Bon Lux Scallop Wheat Bag\n\nThese wheat bags from Bon Lux ($40) are great for soothing cramps, sore muscles or for keeping warm come winter. Made from soft and durable linen and filled with Australian wheat and dried flowers, just put them in the microwave and heat as needed. Little Tin Co Original Mixed 3-Pack If they love fish or have just returned from a holiday in Portugal and want to continue their tinned fish obsession, consider this Original Mixed Pack ($48) from Little Tin Co., which uses sustainably sourced seafood products using local Australian ingredients. This three pack is a nice little taster, with Port Lincoln sardines, smokey mussels and kingfish pate, but they also sell individual tins.\n\nThe best Christmas gifts under $75 Piecework Hors D’Ouevre Coasters For the habitual entertainer in your life, these Hors D’Ouevre Coasters from Piecework ($70) will make a fun and playful addition to their dining table. Sold as a set of four – including an oyster, olive, slice of brie and tin of sardines – they are made from soft linen (for soaking up condensation) and embroidered with cotton. Variety Hour “I Love Carbs” Cap\n\nIf bread, pasta or rice is their primary food group (and isn’t that all of us?), then they’ll love this slogan baseball cap. The “I Love Carbs” Cap from Variety Hour ($70) lets them wear their food philosophy on their sleeve (or head). It’s unisex with an adjustable back, embroidered in Melbourne and comes in this cobalt blue or a soft butter yellow. Home Lab Chilli Icon Glass Set of Four Perfect for the spice-lover in your life, these sweet Chilli Icon Glass Tumblers ($72 for a set of four) from Home Lab are perfect for serving spicy margaritas, gin and tonics or just plain old water. They come packaged in a nice gift box too for those who don’t have time for wrapping.\n\nWater and Wines Australia Wine Puzzle This Australian Wine Puzzle ($75) from Water and Wine is a fun and hands-on gift for the aspiring sommelier in your life. Featuring colourful illustrations of Australia’s over 60 wine regions, flora, fauna and landmarks, each puzzle also comes with grape profiles and food-pairing tips. If wine isn’t their speed, Water and Wine also has puzzles for whisky, coffee and beer lovers. Toast Contrast Rim Enamel Oven Dish\n\nThis enamel oven dish ($70) from Toast is a hardy kitchen workhorse and lovely gift for the busy home cook or person building out their kitchen tool kit. The contrasting blue and mahogany tones are an unusual twist on the classic blue and white enamelware, and makes an attractive serving dish straight from the oven. Santa Maria Novella Scented Wax Tablets For the person who is always impeccably dressed and appreciates the finer things in life, Italian apothecary Santa Maria Novella’s Scented Wax Tablets ($59) are a small indulgence to add a soft scent to their wardrobe. Available in a range of fragrances, tablets can be hung from wardrobe railings, nestled in the linen cupboard or packed in suitcases while travelling.\n\nThe best Christmas gifts under $100 Slip Zodiac Sleep Mask If they take their shut-eye seriously and also happen to be an obsessive reader of their horoscope each week, consider this sleep mask from Slip ($80). Made from pure silk, their Zodiac collection features fun and attractive designs tailored to each star sign. Hario Coffee Mill Dome\n\nIf coffee is a way of life for them, consider this timber coffee grinder from Japanese makers Hario ($80). Perfect for slow mornings, it’s got a lovely wooden and metal exterior, with ceramic burrs that shave rather than crush coffee beans for a better brew. Green Life Table Top BBQ Grill This Table Top Grill ($99) from Japanese brand Green Life is a great compact alternative to a Hibachi grill and ideal for kitchens large and small or taking on picnics or camping trips. Made in Niigata, Japan from a lightweight stainless steel, just add charcoal and grill yakitori, veggies, seafood.\n\nNunu Avo Egg Cup and Bowl Smashed avo takes on a slightly different meaning with Nunu’s Avo Egg and Cup Bowl ($80). Made from hand blown glass, they can be used for eggs, as salt pinch pots or even as trinket holders. Just treat them with care and they’ll never be past their use-by date. The Strong Band Trio Set",
    "source": "SMH",
    "cluster_id": 30
  },
  {
    "url": "https://www.smh.com.au/culture/tv-and-radio/bride-to-be-tells-randy-his-words-have-haunted-her-20251124-p5nhxi.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Bride-to-be tells Randy his words have haunted her",
    "publish_date": "Mon, 24 Nov 2025 12:11:39 +1100",
    "category": "finance",
    "authors": [],
    "text": "Bride-to-be tells Randy his words have haunted her\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 31
  },
  {
    "url": "https://www.smh.com.au/national/queensland/seq-s-cheap-rent-pockets-shrink-despite-housing-boom-20251124-p5nhty.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "SEQ’s cheap rent pockets shrink despite housing boom",
    "publish_date": "Mon, 24 Nov 2025 12:10:17 +1100",
    "category": "finance",
    "authors": [
      "Catherine Strohfeldt"
    ],
    "text": "Growing suburbs in Brisbane’s south are some of the only places where rent is affordable for workers in some of the city’s fastest-growing industries.\n\nWhile Brisbane’s rents are the least affordable they have ever been, tourism hotspots in Queensland’s regions outstrip most cities as some of the country’s most expensive places to rent.\n\nThe 2025 national rental affordability index report, released by National Shelter and SGS Economics and Planning on Monday, found Brisbane and Perth were the only two capital cities where rents were not stabilising.\n\nBrisbane’s rental affordability is still “unstable” and the state’s regions are the most expensive nationwide.\n\n“Since 2019, affordability has worsened significantly, and consistently, in Perth and Brisbane,” it read.",
    "source": "SMH",
    "cluster_id": 32
  },
  {
    "url": "https://www.smh.com.au/sport/nrl/he-feared-his-career-was-over-a-milestone-has-confirmed-enforcer-s-return-20251124-p5nhwf.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "He feared his career was over. A milestone has confirmed enforcer’s return",
    "publish_date": "Mon, 24 Nov 2025 12:01:05 +1100",
    "category": "sports",
    "authors": [
      "Nick Wright"
    ],
    "text": "Thomas Flegler is poised to cast aside a tumultuous two years, with the Dolphins’ enforcer completing contact training and on track for a round one comeback.\n\nThe three-time Queensland Maroons forward was heralded as one of the biggest signings in the Redcliffe-based club’s short history, before suffering nerve damage in his shoulder four games after leaving the Brisbane Broncos – in his 100th first-grade appearance.\n\n“A hundred on the dot, what a milestone that was,” Flegler said with a laugh.\n\nThomas Flegler is on track to return from a career-threatening shoulder injury in round one, 2026. Credit: NRL Photos\n\n“I didn’t really know how to take it. It was a little bit hard coming to training and I guess I was kind of just waiting to get to this point.”",
    "source": "SMH",
    "cluster_id": 33
  },
  {
    "url": "https://www.smh.com.au/goodfood/sydney-eating-out/can-t-get-a-7pm-dinner-booking-bentley-team-drops-strict-sittings-system-at-new-restaurant-20251121-p5nhe4.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Can’t get a 7pm dinner booking? Bentley team drops strict sittings system at new restaurant",
    "publish_date": "Mon, 24 Nov 2025 12:00:00 +1100",
    "category": "finance",
    "authors": [
      "Scott Bolles"
    ],
    "text": "Advertisement\n\nEating outJust open Can’t get a 7pm dinner booking? Bentley team drops strict sittings system at new restaurant A proliferation of new Sydney restaurants has led the high-profile hospitality group to do things differently at their just-opened eastern Mediterranean venue Watermans at Barangaroo. Scott Bolles November 24, 2025 Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share\n\nThe long, languid 7pm dinner has proven elusive for many Sydney diners in recent years, with more venues operating on a two sittings system, often strictly timed to a two-hour seating limit. Now one restaurant is moving away from the approach, which keeps tables ticking over and maximises bums on seats, but can push customers to eat earlier or later than they’d like, especially during busy periods. Watermans launches in the One Sydney Harbour development behind Watermans Cove. Ethan Smart “You can book whenever you like,” says restaurateur Nick Hildebrandt from Bentley Restaurant Group of its new venture, Watermans. The venue opens at Barangaroo on Monday, November 24. “We don’t want to be kicking people out, we want them to stay the whole night.”\n\nAdvertisement\n\nThe eastern Mediterranean restaurant, which launches in the One Sydney Harbour development behind Watermans Cove, is the latest venue from the Bentley hospitality team. The same group operates CBD fine diner Bentley, Asian-inspired restaurant King Clarence, and the recently crowned New Restaurant of the Year, Eleven Barrack. The menu at Watermans draws on the cooking of Greece, Cyprus, Turkey and Lebanon. Ethan Smart Hildebrandt said the proliferation of new restaurants in Sydney had left venues with fewer customers to go around. “So you [need to] look after them,” he said. The restaurateur agreed that the number of sittings at Sydney’s hot restaurants had become “a bit ridiculous”. When Hildebrandt and business partner, chef Brent Savage, dreamt up their eastern Med concept, top of their list was “guest experience” as well as recruiting chef Darryl Martin, whose cooking they admired at now-closed Marrickville restaurant Barzaari.\n\nAdvertisement\n\nHildebrandt said the combination of Martin’s flavours with Savage’s finesse and plating had created some early kitchen alchemy. Their collaborative effort transformed musakhan – a chicken dish of Palestinian origins traditionally served with bread – into a roasted chicken reinterpretation coated with potato flakes instead of bread. The team behind Watermans (above) also operated the award-winning seafood restaurant Cirrus. Ethan Smart The chefs have taken their own approach to taramasalata, a now ubiquitous Sydney menu item. At Watermans, it’s served with Greek Easter bread, reworked into tiny slider buns topped with taramasalata and roe. “We pulled back on the sweetness of the Easter bread and brush it with pomegranate molasses,” Martin said. Watermans, which seats up to 150 diners, isn’t the first Barangaroo foray for Hildebrandt and Savage. They operated the award-winning seafood restaurant Cirrus, just a few steps away from Watermans, from 2016 until their lease ran out last year. “The John dory [at Watermans] has Cirrus vibes,” Savage said. “But we used to serve it with a green chilli salsa, it’s now a full-blown chermoula. They are talking the same language, but this version is a little more spiced up.”\n\nAdvertisement\n\nFrom left: Nick Hildebrandt, Darryl Martin and Brent Savage. While Savage insists that “Watermans isn’t a seafood restaurant”, the menu does lean in on seafood, with prawns and saffron orzo, pickled octopus and wood-fired scallop with pomegranate and brown butter. Hildebrandt and Savage have lost count of the exact number of restaurants they’ve opened, but they think it’s 10 and remain hands-on with the pre-launch process. “I’ve been at Flower Power getting plants, and Brent has been painting,” Hildebrandt said. It has been a busy year for the two, who have recalibrated their hospitality group. In March, they sold the plant-based Yellow to the restaurant’s long-serving head chef, Sander Nooij, and his business partner. Later in the year, they closed Monopole restaurant and stepped away from Brasserie 1930 at Capella Sydney hotel. Roasted chicken, preserved lemon, parsley and green olive. Ethan Smart\n\nAdvertisement\n\nThe two describe the new strategy as “pruning and preparing for growth” by focusing on restaurants they have full control over, and venues of a certain scale and size. This includes the February launch of Eleven Barrack, which proved to be one of the hottest openings of the year. While sympathetic towards smaller venues, Hildebrandt said venues with fewer than 60 seats don’t make sense for the business any more. “You either need to be an owner-operator [working in the venue] or turn over the tables two or three times to survive. It’s part of the reason we let Yellow go.” Open lunch and dinner daily R1/88 Barangaroo Avenue, Barangaroo, bentleyrestaurantgroup.com.au/watermanssydney Related Article New Restaurant of the Year, presented by Aurum Poultry: Eleven Barrack Related Article Exclusive Three-hatted Crown restaurant Oncore by Clare Smyth to close\n\nRestaurant reviews, news and the hottest openings served to your inbox. Sign up",
    "source": "SMH",
    "cluster_id": 34
  },
  {
    "url": "https://www.sbs.com.au/news/article/what-black-friday-sales-shopping-does-to-your-brain/b2z4qtdbz",
    "title": "What Black Friday sales shopping does to your brain, and how to stay in control",
    "publish_date": "Mon, 24 Nov 2025 00:52:22 +0000",
    "category": "finance",
    "authors": [],
    "text": "Every November, Black Friday arrives with big claims of massive savings and \"one-day-only\" deals. We are bombarded with offers that seem too good to pass up. But beneath all this lies something far more strategic.\n\n\n\n\n\nBlack Friday is not simply about a day (now more than a fortnight) of discounts. It’s also a psychological event, carefully designed to take advantage of how our brains make decisions.\n\n\n\n\n\nUnderstanding some of the science behind this process can help us recognise when we are being pushed to spend more than we intended.\n\n\n\nQuick, quick, spend up big\n\nWhen we decide between options, such as whether to buy a new TV, our brains weigh up bits of evidence for and against each choice. We compare prices, features, reviews and what we can afford. Once we feel we have enough information, we decide.\n\n\n\n\n\nNormally this process takes time. The more important the decision, the more evidence we like to gather.\n\n\n\n\n\nBut when we are put under pressure, that changes. The brain lowers the threshold for how much information it needs before deciding. In other words, time pressure makes us decide faster and with less evidence.\n\n\n\n\n\nThis can be useful when acting quickly matters. If a spider lands on your arm, you do not calmly evaluate the pros and cons before flicking it off.\n\n\n\n\n\nBut during Black Friday sales, that same quick-decision process can lead us to spend impulsively.\n\n\n\nREAD MORE The simple shopping swap that could save you $4,000 a year\n\nOMG, they’re almost sold out\n\nAs well as tapping into \"urgency\", Black Friday sales tap into \"scarcity\". We know the sale lasts only a short time, and many people are shopping at once. This creates a strong feeling of competition: if we do not act quickly, we will miss out.\n\n\n\n\n\nWhile we’re browsing for a TV, the website says there are \"only 8 left in stock\", and \"12 people have this item in their carts\". Suddenly, it feels like a race. Even if you were not planning to buy right away, you might feel more compelled to \"add to cart\" before it’s too late.\n\n\n\n\n\nThat sense of scarcity changes how our brain processes information. When we believe something is in limited supply, we assign it more value, telling us the item must be good simply because others have it in their basket too.\n\n\n\nWhat was I thinking?\n\nWhen we make decisions quickly, we rely on less evidence and are more likely to make mistakes, a long-known psychological phenomenon called the speed-accuracy trade-off.\n\n\n\n\n\nUnder time pressure, our brain tries to find shortcuts to help evaluate options, such as how many people are viewing an item. But this may be less useful information than details such as warranty, product quality or long-term value.\n\n\n\n\n\nSignalling that something is scarce can also discourage us from looking for more information. If it seems like a product might sell out, taking the time to compare prices or read reviews feels risky. The product could disappear while we’re still thinking.\n\n\n\n\n\nOur brains prefer predictable outcomes and try to avoid unnecessary risk, so instead of getting more information, we act quickly.\n\n\n\n\n\nFast decisions are not always a bad thing. Acting quickly can save time or prevent harm when we do not have complete information. This could include evacuating when the fire alarm goes off, even if you are not sure if there is an actual fire.\n\n\n\n\n\nBut during Black Friday, retailers create artificial urgency. Timers, \"limited stock\" alerts and \"today only\" banners are designed to mimic real scarcity, pushing our brains into decision-making overdrive.\n\n\n\n\n\nOnce that sense of urgency kicks in, rational thinking can take a back seat. We stop asking \"Do I really need this?\" and start thinking \"What if I miss out?\"\n\n\n\n\n\nIt's the type of thinking that sees you buy a new TV that is only slightly better than the one you have.\n\n\n\nBlack Friday feels like a celebration of savings, but it is also a masterclass in behavioural and brain science. Every timer, pop-up and \"only 3 left\" alert is carefully crafted to grab your attention, and shorten your decision time.\n\n\n\n\n\nKnowing how these tactics work can help you stay in control.\n\n\n\n4 tips to stay in control:\n\nPlan before the pressure hits — research what you really need and obtain more information before the sales season. This will help when the brain has to make decisions under time pressure.\n\nSet a budget and keep it visible — decide how much you are willing to spend and remind yourself while shopping. This helps counteract the \"scarcity effect\", reminding your brain that other limits also exist.\n\nPause before you purchase — when you feel the pressure, take a minute. A break lets your brain catch up with the excitement.\n\nAsk yourself \"Would I want this at full price?\" This helps your brain focus on the actual value of the item.\n\n\n\nThere is nothing wrong with enjoying a good deal. But when you find yourself in the middle of all the excitement, it is worth remembering what is happening inside your brain, and who truly benefits.\n\n\n\n\n\nTijl Grootswagers receives funding from the Australian Research Council.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 35
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/vietnam-floods-death-toll-reaches-90/yeuybakyu",
    "title": "Vietnam floods death toll reaches 90",
    "publish_date": "Sun, 23 Nov 2025 20:41:47 +0000",
    "category": "finance",
    "authors": [],
    "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
    "source": "SBS",
    "cluster_id": 36
  },
  {
    "url": "https://www.sbs.com.au/news/article/rental-crisis-single-mothers-affordability-perth-housing/sanyz35v6",
    "title": "'It's just impossible': The rental crisis pushing working families to the brink",
    "publish_date": "Sun, 23 Nov 2025 18:38:11 +0000",
    "category": "finance",
    "authors": [],
    "text": "On paper, Emily Clements is doing everything right.\n\n\n\n\n\nThe 32-year-old Perth single mother works part-time in administration while raising two neurodivergent children.\n\n\n\n\n\nShe budgets carefully, covers only the basics, and — like many single parents receiving benefits — works the maximum hours she can before her carer payment begins to taper. But she's still slipping behind.\n\n\n\n\n\nFour years ago, Clements paid $380 a week for a three-bedroom rental. Today, she pays $850 for a home further from the city.\n\n\n\n\n\n\"My Centrelink payment is $1,600 a fortnight, but my rent is $1,700, so already everything has gone to paying the rent,\" Clements told SBS News.\n\n\n\n\n\n\"I don't save anything. I don't have any savings.\"\n\n\n\n\n\n\n\nWithout help from her father, she said she would be homeless — and her children would lose access to the therapies they need.\n\n\n\nEmily says she's had to cut back on necessary therapy for her neurodivergent children. Source: SBS News / Christopher Tan \"I try not to think about it ... because it makes me feel like a huge failure,\" she said.\n\n\n\n\n\n\"It's never been on my radar that I couldn't provide for my kids.\n\n\n\n\n\n\"We had to cut back on their necessary therapy … we don't go on holidays, we don't really leave the house much, we don't eat out.\"\n\n\n\nSource: SBS News\n\nThe clock is ticking on stability\n\nThis may be Clements' last Christmas in her home. With her lease expiring in less than three months, the risk of eviction looms large.\n\n\n\n\n\nShe said she's stopped going to open houses altogether because the anxiety has become overwhelming.\n\n\n\n\n\n\"At the recent openings I went to, there were over 40 people at each,\" she said.\n\n\n\n\n\n\"I remembered overhearing one woman having a conversation with the agent, and she said she had $600,000 from selling her home and was willing to pay a year's rent upfront.\n\n\n\n\n\n\"That's who I'm competing with.\"\n\n\n\nIt hasn't always been like this.\n\n\n\n\n\nClements grew up in a stable, middle-income household, and through much of her twenties, renting was a practical way to save for a deposit.\n\n\n\n\n\nBut Perth's rental market — once the country's most affordable — has become so distorted that even former homeowners are re-entering the market as renters, displacing those with the fewest options.\n\n\n\nA crisis years in the making\n\nThe 2025 National Shelter–SGS Rental Affordability Index (RAI) confirms what renters already know: affordability has collapsed nationwide.\n\n\n\n\n\nPerth has overtaken Sydney as the nation’s least affordable capital for the second year in a row, with median rents now consuming 32 per cent of the average renter household's income — well above the 30 per cent housing-stress threshold.\n\n\n\n\n\nIn 2020, that figure was 21 per cent.\n\n\n\n\n\nAcross the rest of the country, the picture isn't much brighter.\n\n\n\nRental affordability changes in WA between 2016 and 2025. Source: SBS News Sydney and Adelaide follow close behind, with households in both cities spending around 30 per cent of their income on rent.\n\n\n\nRegional WA has slipped sharply too — moving from 'affordable' in 2020 to moderately unaffordable, with renters now paying 28 per cent of their income.\n\n\n\n\n\nBrisbane and Adelaide have hit their lowest affordability levels on record, while the ACT remains the only jurisdiction considered 'acceptable', largely because its residents earn higher-than-average incomes.\n\n\n\n\n\nMeanwhile, in regional Queensland, rents are consuming more than 30 per cent of household income, making it the least affordable regional market in Australia.\n\n\n\n\n\nThe Northern Territory is not included in the report as adequate rental data has not been sourced to develop indices.\n\n\n\nA generation pushed into permanent renting\n\nOver the past decade, more Australians — especially women and single parents — have been locked into lifelong renting.\n\n\n\n\n\nBetween 1995 and 2020, renter households increased from 26 to 31 per cent, while the share of public housing tenants halved.\n\n\n\n\n\nOver the same period, rents grew faster than mortgage repayments.\n\n\n\n\n\nRenters now spend at least 20 per cent of their income on housing, compared with 15.5 per cent for homeowners with a mortgage.\n\n\n\nOver the past decade, more Australians — especially women and single parents — have been locked into lifelong renting. Source: SBS News / Christopher Tan But the RAI measures rent alone — not food, utilities, transport, medical bills, or school costs.\n\n\n\n\n\nFor many single-parent households like Clements', those essentials push budgets far beyond the numbers on a graph.\n\n\n\n\n\nHer daily choices — therapy or groceries, petrol or school excursions — rarely show up in national indexes. But they define her reality.\n\n\n\nA new life in Australia, but always renting\n\nOn the opposite side of the country, in Sydney's south-east, Charlotte Karlsson-Jones has lived with rental insecurity for most of her adult life.\n\n\n\n\n\nShe arrived from Malmö, Sweden, at 19.\n\n\n\n\n\nTwo decades on, the 42-year-old architecture graduate is still renting.\n\n\n\nRent consumes 60 per cent of Charlotte Karlsson-Jones' income. Source: SBS News / Sam Foster She works part-time, earning $2,000 a fortnight.\n\n\n\n\n\nHer fortnightly rent is $1,200 — 60 per cent of her income.\n\n\n\n\n\n\"For me, to be able to get a home loan has almost been impossible,\" Karlsson-Jones told SBS News, adding that banks see her as high-risk.\n\n\n\n\n\n\"As a single mum, it is just impossible. Every year it is getting worse.\"\n\n\n\n\n\nHer two children are 12 and seven, and, like Clements, she pays for food, fuel, activities, school costs and therapy on top of rent.\n\n\n\n\n\nShe has tried to access government support, including Rent Choice Assist, but her initial applications were rejected.\n\n\n\nSource: SBS News She eventually appealed the decision and was approved — but not without lasting worry.\n\n\n\n\"I feel like a lot of systems we currently have sort of wait for you to be homeless. And then they kick in to support you,\" she said.\n\n\n\n\n\n\"The trauma and the long-term effect of experiencing that ... it takes years to recover.\n\n\n\n\n\n\"For a long time, older women have been at the highest risk,\" Karlsson-Jones said.\n\n\n\n\n\n\"I think we need to address it way earlier in a woman's life. Especially after we've spent so much of our time looking after the people we care about and love.\"\n\n\n\n\n\nShe said the crisis has deep roots.\n\n\n\n\n\n\"I've met people who've been in social housing for more than 10 years,\" she said.\n\n\n\n\n\n\"And even when they first applied, their waitlist was already over a decade long.\"\n\n\n\nThe wealthiest state, the worst rental affordability\n\nRobert Pradolin, executive director of housing advocacy group Housing All Australians, said rental stress is now threatening the workforce itself.\n\n\n\n\n\n\"From cafes and hotels to hospitals and childcare centres, businesses across WA are struggling to find staff because there's nowhere affordable for them to live nearby,\" Pradolin said.\n\n\n\n\n\n\"Even WA's community services sector — the very people supporting our most vulnerable — can't recruit or retain staff because workers can't afford to live in the regional communities they serve,\" he said.\n\n\n\n\n\nHousing, he argues, is \"critical economic infrastructure\".\n\n\n\n\n\nPerth cafe owner Ie-Tehn Kwee said the crisis is reshaping how small businesses operate.\n\n\n\n\n\n\"Generally, we can see the rental prices are extremely high now,\" he told SBS News.\n\n\n\n\n\n\"It definitely has some impact … on people that work for me.\"\n\n\n\nCafe owner Ie-Tehn Kwee says rental pressures are reshaping the lives of his workers and patrons. Source: SBS News / Christopher Tan Kwee sees the strain on staff and customers.\n\n\n\n\n\n“Anecdotally, I am aware of people moving back in with parents or … trying to find alternative solutions.\"\n\n\n\n\n\nLong commutes are becoming normal.\n\n\n\n\n\n\"In an industry like mine, you start work at 6am. If you are living an hour away, you are waking up at 4am,\" Kwee said.\n\n\n\n\n\n\"The issue is that there are less houses available than people need to live in them. And some people own way more houses than they can live in.\"\n\n\n\n\n\nKath Snell, CEO of Perth-based housing advocacy group Shelter WA, said the latest figures confirm a worsening trend.\n\n\n\n\n\n\"It's mind-boggling that Australia's wealthiest state has the worst affordability for renters,\" she told SBS News.\n\n\n\n\"This crisis is no longer confined to those on the lowest incomes. It's climbing the ladder and affecting working families.\"\n\n\n\n\n\nSnell said WA needs 5,000 additional social and affordable homes per year, alongside rent caps, minimum standards, limits on short-stay rentals and the end of no-grounds evictions.\n\n\n\n\n\n\"The WA government is making progress, but we need ambition that matches the scale of this crisis.\"\n\n\n\n\n\nIn a statement to SBS News, the WA Housing and Works Minister John Carey pointed to the state government's record investment in public housing.\n\n\n\n\n\n\"Across the nation, there continues to be pressures on housing and rental markets, and WA's nation-leading economy and rapid population growth adds to the pressure,\" he said.\n\n\n\n\n\n\"Our government is rolling out an ambitious $5.8 billion housing investment, adding more than 3,800 social homes since 2021.\n\n\n\n\n\n\"This record investment in public housing is about ensuring vulnerable West Australians, including victims of domestic violence, single parents and people with disabilities have a place to call home.\"\n\n\n\n\n\nLast year, the WA government adopted some rental reforms, including limiting rent increases to once per year, allowing pets and minor modifications in rentals, as well as a new process to resolve disputes without the need to go to court.\n\n\n\n\n\nAdvocates welcomed the changes but warned they weren't significant enough to make a difference until rent increases were capped, and no-fault evictions were scrapped.\n\n\n\n\n\nCarey said the state's Rental Relief Program has helped more than 3,600 households avoid evictions and that recommendations for a second phase of rental reforms are expected to be finalised for consideration later this year.\n\n\n\n\n\n\"Our government continues to do everything it can to ensure Western Australians have safe and secure homes and access to essential services to support their needs.\"\n\n\n\n\n\nThe Federal Government's Envoy for Social Housing and Homelessness Josh Burns said Australia’s housing crisis “has been decades in the making” and will take time to turn around.\n\n\n\n\n\n\"As the Rental Affordability Index shows, the work we are doing to boost supply across the housing spectrum is making a difference,\" he said.\n\n\n\n\n\n\"That's why we are working with the states and territories and the community housing sector to deliver 55,000 social and affordable homes for people who need it.\n\n\n\n\n\n\"We know there is more work to do, but we are getting on with the job of building more rental homes, more support for first home buyers, and unlocking more social and affordable homes for people who need it.\"\n\n\n\n'I just want a future for them'\n\nClements says she isn't asking for a miracle — just the chance to build a life where she can save, plan, and avoid living one notice away from crisis.\n\n\n\n\n\n\"If [my children] came up to me and asked me for something, most of the time it's a no straightaway,\" she said.\n\n\n\n\n\n\"Or it takes me months to save up for.\"\n\n\n\nEmily Clements says she has to say \"no\" most of the times her children ask for something. Source: SBS News / Christopher Tan \"I don't want to lie to my kids,\" she said.\n\n\n\n\n\n\"It's such a complicated question … why they can't just have $10 on Roblox, or buy an ice cream on a hot day.\"\n\n\n\n\n\nIn Sydney, Karlsson-Jones feels that burden stretching across generations.\n\n\n\n\n\nShe said that as a first-generation immigrant, her parents aren't in the property market, so she's \"already far behind\".\n\n\n\n\n\n\"That will affect my children's future, and their opportunities to get into the property market as well.\"\n\n\n\n",
    "source": "SBS",
    "cluster_id": 37
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/interview-associate-professor-bassina-farbenblum/0qnmbvopq",
    "title": "INTERVIEW: Associate Professor Bassina Farbenblum",
    "publish_date": "Sat, 22 Nov 2025 21:00:00 +0000",
    "category": "finance",
    "authors": [],
    "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
    "source": "SBS",
    "cluster_id": 36
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/underground-struggles-illegal-miners-risk-death-in-moroccos-forgotten-coal-town/xszzlmjvx",
    "title": "Underground struggles: Illegal miners risk death in Morocco's forgotten coal town",
    "publish_date": "Sat, 22 Nov 2025 20:30:00 +0000",
    "category": "finance",
    "authors": [],
    "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nIn Morocco's northeastern city of Jerada, illegal coal miners continue to risk their lives to make ends meet.\n\n\n\n\n\nIn 1927, the one and only coal mining plant was founded there - 40 kilometres west of the Algerian border.\n\n\n\n\n\nSince the 1920s, coal mining has been the bread and butter for that North African community.\n\n\n\n\n\nBut in the late 1990s, the Moroccan government decided to shut Jerada's mines, leaving around 9,000 workers unemployed.\n\n\n\n\n\nSo, what's it like now?\n\n\n\n\n\nAlthough it was formally closed for almost three decades, the mines serve as an important source of income for a majority of its residents still there.\n\n\n\n\n\n“When I arrived there was really difficult for me because I was the only one from outside. And when I arrived I saw a funeral happening - it was a little bit chaotic I will say.”\n\n\n\n\n\nIn an exclusive interview, SBS News spoke to David Tiago Barbosa, a photojournalist from Portugal.\n\n\n\n\n\nHe was there in 2023 to document the harsh realities facing these miners.\n\n\n\n\n\nMr Barbosa reflects on his first impression of Jerada.\n\n\n\n\n\n“They were working in the mines but without safety - very dangerous. They were going inside with not harness, they were using a bag, a corn bag, and they attached the corn bag to the rope.”\n\n\n\n\n\nHe was about to enter the coal mine to document their work when this happened.\n\n\n\n\n\n“A big coal bag coming outside and almost falling. So I took the pictures two, three seconds before the bag broke and almost hit two miners there. So they said to me that was very dangerous to go inside.”\n\n\n\n\n\nHe says depending on the area, it could be as deep as 15-40 metres, and as wide as 100 metres horizontally.\n\n\n\n\n\n“The mines are still closed officially, but illegal mining continues, like in secret, mining shafts are dug by hands without safety equipment, without oxygen, without emergency help. And people know they can die at any moment, but they have no other way to feed their families. Some government projects were promised, but the poverty, it's still there.”\n\n\n\n\n\nThat's Mr Hamid - Mr Barbosa's local fixer in Jerada.\n\n\n\n\n\nAccording to local reports, three people died in 2022 from carbon dioxide suffocation inside a well for collecting coal.\n\n\n\n\n\nThe story of coal miners putting their lives at risk to make ends meet has been under-reported in the media.\n\n\n\n\n\nIn 2017, large protests erupted in Jerada following the deaths of two brothers aged 23 and 30 inside a mine.\n\n\n\n\n\nJust last month, the country's Finance Minister Nadia Fettah Alaoui announced Morocco will adjust its upcoming budget to prioritise spending on health and education, as well as allocate some additional funds to reduce regional inequalities.\n\n\n\n\n\nA few days after that, the Powering Past Coal Alliance announced Morocco plans to phase out coal entirely by 2040 if it secures international climate finance.\n\n\n\n\n\nMorocco's energy minister was quoted saying the country has stopped planning for new coal power plants.\n\n\n\n\n\nSBS News has contacted the relevant organisers and ministries in Morocco for a comment, and is yet to receive a response.\n\n\n\n\n\nBut the locals in Jerada remain sceptical this will change the situation for their community.\n\n\n\n\n\nDavid Tiago Barbosa's project titled 'Jerada: The Valley Of Resilience' - which was awarded an honourable mention by the International Photography Awards (IPA)* - was only recently published.\n\n\n\n\n\nHe recalls being under surveillance during his time there, fearing for the safety of his fixer, Hamid.\n\n\n\n\n\n“A police guy went there and started asking for us, asking for what we were doing there. Because I was afraid to them taking my pictures and my SD card.”\n\n\n\n\n\nThankfully he had his images backed up to his hard drive.\n\n\n\n\n\nDuring his stay, he met Youssef, a 25-year-old who had been working in the mine since he was 14 and who was already suffering from lung disease.\n\n\n\n\n\n“He said to me that he started working when he was 12-years-old and his father was working in the old factory. And then when the factory closed, he started working as illegal as well. And the father was with lungs with 100 per cent with silica. So it was really bad and using a mask for breathing and Youssef also started to be really bad with silica problems on the lungs as well.”\n\n\n\n\n\nYoussef has since been arrested in Algeria, while trying to cross by boat to Spain, in search of a better life.\n\n\n\n\n\nSo, what is silica dust, and how is it produced?\n\n\n\n\n\nLung Foundation Australia CEO, Mark Brooke discusses the health implications for the community living and working at these mines.\n\n\n\n\n\n“Silica dust and other forms of hazardous materials in industries that are, for example, mining industries are produced when we are cut through or shape or somehow grind in the extraction of those minerals and we create dust in the air and that dust may contain or is most likely going to contain particulates that are harmful for your lungs.”\n\n\n\n\n\nHe talks about the harmful effects of silica dust on one's health, and why are coal miners largely at risk.\n\n\n\n\n\n“What we do know in Australia, we had an outbreak of coal miners lung disease or black lung about 15 years ago, which was a resurgence of a disease that we had not seen for some time.”\n\n\n\n\n\nHe says that was caused by a whole range of factors, including poor regulation and surveillance, a lack of issuing proper personal protection equipment, and the response from mining corporations to their workers' safety.\n\n\n\n\n\n“Since that time, we've put in place really strong and strict measures that do their very best to protect coal miners and miners, lung health and their health more broadly. And that's because of union campaigns. It's because of organisations like the Lung Foundation and the Thoracic Society working together to really highlight how dangerous dust in workplaces can be.”\n\n\n\n\n\nHe says black lung disease as a disease was always thought about as an accumulation. So it essentially can be someone working in these mines for many years but not seeing the immediate effects.\n\n\n\n\n\n“One of the things we know about black lung disease is that often the diagnosis takes place in later years. Increasingly now, as we have seen with the rapid uptake, the rapid number of patients showing with silicosis in Australia that subject to the manufacturing process, the type of stone being extracted, the cutting tools used the level of personal protection issued to the employees.”\n\n\n\n\n\nMr Brooke says we're increasingly seeing - not just here in Australia but around the world - that the length of time being exposed is shrinking dramatically as people who have only been exposed for a year are showing up with significant lung diseases.\n\n\n\n\n\nHe shares his thoughts on what developing nations can do to prevent this.\n\n\n\n\n\n“The World Health Organisation has recently published a global resolution on lung health. And one of the areas that the New World Health Organisation resolution on integrated care and lung health speaks to is occupational exposures. Every country around the world should be looking at its occupational exposures and lung health and putting in place the frameworks, regulations, and policies and procedures.”\n\n\n\n\n\nStephen Smyth is the Mining and Energy Union General's Vice President in Australia.\n\n\n\n\n\nHe tells SBS News one of the first requirements in all countries for any mining sector anywhere in the world in relation to health and safety - in particularly developing countries - is the adoption of ILO 176.\n\n\n\n\n\nAnd what's really alarming is a lot of countries have not adopted the ILO 176.\n\n\n\n\n\n“Certainly alarming what they're using to be able to get themselves to work without having actually seeing or experienced what they're doing. You're really alarmed. The fact that if they're using, in my words, primitive measures - you'd have to say the working conditions in the mine themselves would be atrocious, would be dangerous. And we certainly lack the basic health and safety legislation, but requirements of to do the job.”\n\n\n\n\n\nHe says despite there being room for improvement in Australia - it has one of the world's leading practices in relation to health and safety - and uses all mechanical machinery.\n\n\n\n\n\n“If you compare it to Australia or other countries, we have standards for lifting devices, standards for slinging, harnessing all those mechanisms as well. So certainly alarming and concerning that workers are putting their lives at risk just getting into the mine, let alone working in tough, hazardous, dangerous conditions each and every day.”\n\n\n\n\n\nHuman rights groups have echoed similar sentiment in the past - defending protesters in the eastern city of Jerada.\n\n\n\n\n\nMr. Hamid shares the realities of the miners on the ground.\n\n\n\n\n\n“Many young men have died in this mines from flooding, explosions, collapsing tunnels, lack of oxygen. Families are left without fathers, brothers or sons.”\n\n\n\n\n\nHe says even young girls work at these mines.\n\n\n\n\n\nAlthough women can't work inside the mines, they can help to select the coal.\n\n\n\n\n\n“Even some, girls between 12 to 16 they go to work there and about if there is insurance, no, some help from the government. No, no protection, nothing.”\n\n\n\n\n\nSome people have left to Oudja in eastern Morocco to work.\n\n\n\n\n\nBut Mr Hamid says most of them stay because it's their homeland and they have nowhere to go.\n\n\n\n\n\n“So the community survives by depending on each other. So sharing food, money and support. Some families collect coal and sell it to the middleman. So the one that it suffers, they don't earn much, but the middleman, he's the one that earns much without doing any job. He's just like buy and then he sells again.”\n\n\n\n\n\nHe says the locals want real jobs, not empty promises from the government.\n\n\n\n\n\n“They don't want to die in this holes. They don't want factories, projects, or legal mines with safety and rights. They want to work with dignity, not in fear.”\n\n\n\n\n\nAdding they are left with no choice.\n\n\n\n\n\n“No one is happy doing this. The go underground, because they don't have a choice. Every time they enter a mine, they say goodbye to their families. It could be the last time. So they work with fear, not with hope.”\n\n\n\n\n\nHe says a miner can earn between 60 Dirham or ten dollars and 120 Dirham or $20 dollars per day - depending on the amount of coal they extract.\n\n\n\n\n\nMr Hamid says the money that they earn is enough for basic necessities such as bread, sugar, food and rent to survive.\n\n\n\n\n\nThe plant that was built was a contract between a Chinese company and the Moroccan government worth over $465 million dollars.\n\n\n\n\n\nThe plant already exists -- as photographed by Mr Barbosa -- with the cemetery in the foreground.\n\n\n\n\n\nThis company created some jobs, but not enough to employ the greater number of people who continue to have no other option and work illegally, risking their lives.\n\n\n\n\n\n“The Chinese company is different because it was a huge investment there and the thing was a new factory, but they didn't have a lot of jobs. So for example, 90 per cent of Jerada is illegal miners and maybe with a new factory, just 10 per cent have a job on the Chinese company. And the other percentage, some people said it was European companies that went there and just say, hey, if you want to earn more, I can give you some tools and you can extract and give to me.”\n\n\n\n\n\nMr Hamid says the danger never stops.\n\n\n\n\n\n“Some of them, they just use kind of a turban or something. There is no oxygen. The tunnels, they collapse, flooding kills minors. There is no hospitals or emergency teams, no legal protection or insurance. And the police chase them because it's illegal and that it happened to me personally when I was with David.”\n\n\n\n\n\nMr Barbosa echoes a similar sentiment.\n\n\n\n\n\n“They don't have, like for example good medical centre, if they have problems with silica problems, they need to go to Casablanca or another big city to have treatment.”\n\n\n\n\n\nMr Hamid again, quoting a miner in Jerada.\n\n\n\n\n\n“My friend who lives in Jerada, he just told me that they have a phrase that they say there. They say we dig our own graves to survive.”\n\n\n\n\n\nThe International Mining Congress this year will be held in Morocco from the 24th to 26th November.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 38
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/isolation-and-shame-australians-are-avoiding-perinatal-mental-health-support-new-research-reveals/71wsofd52",
    "title": "'Isolation and shame': Australians are avoiding perinatal mental health support, new research reveals",
    "publish_date": "Sat, 22 Nov 2025 20:00:00 +0000",
    "category": "finance",
    "authors": [],
    "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\n\"Pregnancy was a very, it was a very isolating experience. Because I was depressed and low throughout it, I felt a real sense of shame around not experiencing pregnancy like you think you should.\"\n\n\n\n\n\nThat was Lisa Fox - a 44-year-old mother based in the Central Coast of New South Wales.\n\n\n\n\n\nShe recalls experiencing poor mental health during the perinatal period when she was pregnant and gave birth to her son 10 years ago.\n\n\n\n\n\nWhile Lisa was already seeing a psychiatrist and psychologist for a pre-existing mental health condition, she says she was never introduced to specific perinatal support.\n\n\n\n\n\nLisa says she felt isolated and disconnected during her pregnancy and in the 12-18 months after she gave birth to her son Luka.\n\n\n\n\n\n\"And in fact, you know, at about 4 months I had about 5 weeks in a mental health facility to support me. And just that shame that comes with that, and how shame leads to isolation, which is so detrimental to how you can lift yourself out of these things.\"\n\n\n\n\n\nNew research by not-for-profit perinatal mental health organisation, the Gidget Foundation, has found a quarter of Australians experiencing perinatal mental health issues are not seeking help.\n\n\n\n\n\nThis month's survey of over 1,600 Australians found one third of people believed their symptoms were not serious enough.\n\n\n\n\n\nGidget Foundation clinical psychologist and team manager, Katie Peterson says this is due to a lack of awareness around the signs and symptoms of poor perinatal mental health.\n\n\n\n\n\n\"I think it's got to do with people maybe not quite understanding what the difference is between maybe a mental health disorder and what are the different challenges around adjusting to becoming a new parent. Because there are a lot of factors in the perinatal period that we would consider risk factors for why people would go on to develop a mental health disorder. I guess what we know though is that early intervention is the best. So instead of waiting for someone to be kind of more at a serious or severe end, we really want people engaging with professional support early on.\"\n\n\n\n\n\nMs Peterson explains some of the risk factors for mental health issues associated with the perinatal period.\n\n\n\n\n\n\"People are having to adjust to, especially mums, they're going through significant changes hormonally, emotionally, physically, as well as in their social roles. So there's a lot of things that new parents are having to navigate. But we also see new parents might experience birth trauma. They may experience perinatal loss, some parents may have health complications for themselves or for their baby. So it's just a time where things can go wrong sometimes, I guess. And it adds to the extra stresses.\"\n\n\n\n\n\nShame and stigma also play a role in preventing people from seeking appropriate help.\n\n\n\n\n\nChief executive of perinatal mental health organisation PANDA, Julie Borninkhof, explains.\n\n\n\n\n\n\"We know still that people in this country, especially our mums fear raising a conversation about vulnerability because they expect then that the system and community will say 'you're not fit to parent'. And we still hear from callers that they are concerned that people are going to want to take their bubs off them and say 'you're not fit to parent'. And that gets in the way of help-seeking behaviour.\"\n\n\n\n\n\nLisa believes access to tailored perinatal mental health tools would have helped her navigate feelings of shame she experienced at that time.\n\n\n\n\n\n\"Having perinatal specific support I think is crucial for women because even... I was seeking a private psychologist and psychiatrist and didn't receive the sort of fullness of support you can receive when you're going through pregnancy and giving birth. And I think also from that what I really learnt, is that you need to advocate. It's difficult but advocate for your own needs. You can move on, and find other professionals to support you.\"\n\n\n\n\n\nConnecting with and speaking to other mothers during her son's toddler years became a crucial support in how Lisa navigated her mental health.\n\n\n\n\n\n\"And for me, I think this is a key thing around the isolation that exists in this period, is that you really internalise that this is just me. This is just me, it's my fault, I can't cope. But when you do spend time with other women that are going through the same thing, you can say, oh yeah, okay, isn't just me, this is a universal thing that's going on. This is sleep deprivation. This is just really, really hard.\"\n\n\n\n\n\nMs Peterson agrees that reducing isolation and creating shared communities is key to improving individuals' access to mental health care.\n\n\n\n\n\n\"A lot of parents do need to hear the story from someone who kind of have has lived experience of that, of perinatal mental health. And then I guess they may start to relate to that story and see that for themselves. And then by realising that they're not alone, it really does reduce the shame and the stigma around reaching out to mental health services.\"\n\n\n\n\n\nFinancial pressures also contribute to people avoiding professional support, with data from The Gidget Foundation noting 47 per cent of those surveyed relied heavily on bulk billing appointments during the perinatal period, and 27 per cent saying they couldn't afford to seek help.\n\n\n\n\n\nPeople from culturally and linguistically diverse backgrounds, as well as First Nations people, may also confront added cultural and language barriers - as Ms Peterson explains.\n\n\n\n\n\n\"We know that there can be delays in accessing culturally appropriate services, accessing interpreters, and sometimes people from a multicultural background or culturally and linguistically diverse families may find navigating services a little bit tricky or not culturally appropriate. As well as Aboriginal and Torres Strait Islander families, there is an increase in the likelihood of perinatal mental health challenges and again, it's about finding the right supports that are culturally appropriate.\"\n\n\n\n\n\nFathers also often feel excluded from perinatal mental health services - with only just over 5 per cent of PANDA's helpline callers men, despite men making up 14 per cent of the mental health checklist users.\n\n\n\n\n\nThis is something Ms Borninkhof calls the 'Dad gap'.\n\n\n\n\n\n\"I think there's still a significant stigma around the fact that men feel that they have to be the rocks in the family, and we often spend time talking about the fact that even rocks crumble. And I think that services are still behind the eight ball in terms of supporting dads in this country. There's a real resurgence and growth in dads support, but they're still being built because the investment from the funders and the government isn't there because we've been so focused on mums.\"\n\n\n\n\n\nLisa says whole communities need to be aware of the support they can provide new parents.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 39
  },
  {
    "url": "https://www.theage.com.au/national/head-explains-why-he-opened-20251124-p5nhy7.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Head explains why he opened",
    "publish_date": "Mon, 24 Nov 2025 13:00:39 +1100",
    "category": "finance",
    "authors": [],
    "text": "Head explains why he opened\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 22
  },
  {
    "url": "https://www.theage.com.au/business/markets/asx-set-to-jump-as-wall-street-swings-higher-20251124-p5nhs2.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "ASX climbs after Wall Street swings higher; Macquarie bids $11.6b for Qube",
    "publish_date": "Mon, 24 Nov 2025 12:56:58 +1100",
    "category": "finance",
    "authors": [
      "Staff Reporters"
    ],
    "text": "The Australian sharemarket has made a bright start to the week after Wall Street swung higher to close last week on rising hopes of US interest rate cuts.\n\nThe S&P/ASX 200 was 81.4 points, or 1 per cent, higher to 8497.9 in early afternoon trade on Monday as all 11 sectors climbed higher, with tech and materials among the best performers.\n\nWall Street closed the week with a positive session. Credit: AP\n\nMining stocks are higher. BHP advanced 0.5 per cent after it announced on Monday morning it was abandoning plans to pursue a takeover of Anglo American, after the two companies had preliminary discussions. It is the second time in the past two years the Australian giant has stepped away from a chase for Anglo. Rio Tinto jumped 2.2 per cent and Fortescue gained 1.4 per cent. Among gold miners, Northern Star (up 1.4 per cent), Evolution Mining (up 2.1 per cent) and Newmont (up 1.7 per cent) gained while rare earths miner Lynas jumped 4.4 per cent.\n\nFinancial stocks are mixed, with Westpac (up 1.1 per cent) the best of the big four banks while Commonwealth Bank added 0.6 per cent but National Australia Bank and ANZ Bank edged 0.1 per cent lower in early afternoon trade.",
    "source": "TheAge",
    "cluster_id": 23
  },
  {
    "url": "https://www.theage.com.au/national/missed-a-golden-chance-vaughan-lashes-englands-dumb-cricket-20251123-p5nhms.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "'Missed a golden chance': Vaughan lashes England's 'dumb cricket'",
    "publish_date": "Mon, 24 Nov 2025 12:55:06 +1100",
    "category": "sports",
    "authors": [],
    "text": "'Missed a golden chance': Vaughan lashes England's 'dumb cricket'\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 24
  },
  {
    "url": "https://www.theage.com.au/traveller/aerial-view-of-the-mushroom-area-of-wadi-rum-desert-in-jordan-20251124-p5nhy1.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Aerial view of the Mushroom Area of Wadi Rum Desert, in Jordan",
    "publish_date": "Mon, 24 Nov 2025 12:47:10 +1100",
    "category": "finance",
    "authors": [],
    "text": "Remove items from your saved list to add more.\n\nYou have reached your maximum number of saved items.\n\nSave this video for later\n\nAdd videos to your saved list and come back to them anytime.\n\nGot it",
    "source": "TheAge",
    "cluster_id": 25
  },
  {
    "url": "https://www.theage.com.au/sport/nfl-legend-erupts-during-sons-debut-20251124-p5nhy2.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "NFL legend erupts during son's debut",
    "publish_date": "Mon, 24 Nov 2025 12:45:41 +1100",
    "category": "sports",
    "authors": [],
    "text": "NFL legend erupts during son's debut\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 26
  },
  {
    "url": "https://www.theage.com.au/property/news/opera-singer-s-carindale-house-hits-high-note-in-1-69m-auction-20251124-p5nhu3.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Opera singer’s Carindale house hits high note in $1.69m auction",
    "publish_date": "Mon, 24 Nov 2025 12:27:24 +1100",
    "category": "finance",
    "authors": [
      "Sarah Webb"
    ],
    "text": "A brick-and-tile ’80s relic in the heart of Brisbane’s burgeoning suburbia sparked one of the city’s fiercest pre-Christmas auction battles on Saturday, with 12 buyers going head-to-head before it sold for a reserve-smashing $1.69 million.\n\nDrawn by the 673-square-metre block, solid bones, and the chance to buy into a suburb where house prices have almost doubled in five years, 36 bidders registered for the auction of 96 Kilmorey Street, Carindale.\n\nA young couple outlasted investors and interstate punters to claim the keys.\n\nThe four-bedroom, two-bathroom deceased estate – which was home to a beloved local and opera singer – drew dozens of groups during a short, high-intensity campaign, with all proceeds of the sale earmarked for an animal charity.",
    "source": "TheAge",
    "cluster_id": 27
  },
  {
    "url": "https://www.theage.com.au/goodfood/melbourne-eating-out/head-to-this-clayton-bakery-for-greek-frappe-coffee-and-fresh-spanakopita-20251124-p5nhxj.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Head to this Clayton bakery for Greek frappe coffee and fresh spanakopita",
    "publish_date": "Mon, 24 Nov 2025 12:26:14 +1100",
    "category": "finance",
    "authors": [
      "Dani Valent"
    ],
    "text": "Add articles to your saved list and come back to them anytime.\n\nThe Grain Emporium has baked its own bread for more than three decades.\n\nOutside of Clayton’s Grain Emporium. Wayne Taylor\n\nBakery$$$$\n\nThey bake their own bread at this three-decade stayer but you’ll have to peer past a laden fridge of cakes and pastries to see the racks of multigrain and high-tops. Owners Jim Mademlis, Nick Mademlis and Alex Moscon also serve a classic Greek frappe coffee and a lovely spanakopita, which they’ll happily warm for you to eat at pavement tables.\n\nWant to visit this venue? Save it in the Good Food app.",
    "source": "TheAge",
    "cluster_id": 28
  },
  {
    "url": "https://www.theage.com.au/national/body-found-in-search-for-missing-swimmer-off-nsw-coast-20251124-p5nhxk.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Body found in search for missing swimmer off NSW Coast",
    "publish_date": "Mon, 24 Nov 2025 12:16:56 +1100",
    "category": "sports",
    "authors": [],
    "text": "Body found in search for missing swimmer off NSW Coast\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 29
  },
  {
    "url": "https://www.theage.com.au/lifestyle/life-and-relationships/the-best-christmas-gifts-from-7-to-100-for-2025-20251027-p5n5n9.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "The best Christmas gifts from $7 to $100 for 2025",
    "publish_date": "Mon, 24 Nov 2025 12:13:40 +1100",
    "category": "lifestyle",
    "authors": [
      "Lauren Ironmonger"
    ],
    "text": "Nice Pickles Pickled Pineapple If they love a Hawaiian pizza, then they’ll love this jar of pickled pineapple ($15). Made in South Australia by self-professed “pickle nerds” Nice Pickles, they’re brined with mint, jalapeño and ginger, making the perfect sweet, sour and tangy addition to toasties, salsa, pizza or even avocado toast. Fend Insect Repellant\n\nFor the person planning on spending their whole summer outdoors, or has a tropical holiday on the horizon, consider this Insect Repellent from Australian brand Fend ($19 for 50ml travel pump). Unlike your run-of-the-mill mozzie spray, it has a gentle scent, is non-oily and hypoallergenic, meaning it’s suitable for sensitive skin and kids. Muji Soft Slippers Muji’s Soft Slippers ($15) are an affordable gift for the homebody in your life. They come in a range of colours and open and closed-toe options, plus, they’re the airplane shoe of choice for Lune Croissanterie founder Kate Reid. Able & Game Microfibre Glasses Cleaner\n\nFor the glasses wearer in your life, these microfibre cleaning cloths from Able & Game ($10) are a fun and practical gift. Available in a range of prints (mainly centred around cats, sorry dog lovers), they can also be used to clean jewellery, tablets, phones or laptops. Hultafors Fire Steel Flint The Hultafors Fire Steel Flint ($25) is a great little tool for the habitual camper. Made from ultra-thick steel and designed for ergonomic use, both ends of the steel can be struck and it can be used in all weather conditions.\n\nMesa Collections Fish Lemon Squeezer For the citrus lover in your life, consider this cute fish lemon squeezer ($20) from Mesa Collections. It’s a handy kitchen aide to have on hand – whether it’s juicing 10 lemons for a pitcher of lemonade or adding a final touch to a whole-baked fish – and looks pretty sitting on a kitchen shelf when not in use. The best Christmas gifts under $50\n\nA nice gift for someone who’s recently moved into a new home, Studio Roof’s Dutch Masters Bouquet ($40) are pretty flowers they won’t be able to kill. Printed on recycled cardboard with vegetable ink, this option is inspired by the traditional realism of painters like Rembrandt and Vermeer – but the range includes styles to suit any taste, from Monet to Van Gogh. Karst Goods Studio Muse Notebook Karst Goods’ notebooks are a great option for the accident-prone doodler or adventurer in your life. Their Studio Muse Notebook ($45) comes in a range of bold and graphic cover designs. Its clever paper, made from recycled stone, is waterproof and tear resistant and thread-bound to lay completely flat for comfortable note-taking. Produce Pod\n\nIf you have someone in your life that loves a farmer’s market, Produce Pod’s Veggie Bags ($47) are a practical gift. Made with an inner cotton layer that retains moisture and a breathable outer later, they’re designed to extend the life of fruit and veggies. As a bonus, they can be thrown in the washing machine for easy cleaning. Two Good Co x Messina Make-At-Home Gingerbread Cookie Pie For the baker in your life, this Gingerbread Cookie Pie kit from Gelato Messina ($40) makes a great rainy-day activity. Each pack contains everything they’ll need to make a delicious festive treat. Made in collaboration with social enterprise Two Good Co., 50 per cent of proceeds from each sale go towards supporting and employing women in crisis.\n\nStitched Up Embroidery Kits For the person looking to take up a new hobby this Christmas, these embroidery kits from Australian brand Stitched Up, owned by two sisters, are a nice option. This mini lobster kit ($50), is perfect for food lovers, but the brand also sells larger sizes ($60) including this handsome Kookaburra. Kits are beginner-friendly and come with step-by-step printed instructions as well as video tutorials. Bon Lux Scallop Wheat Bag\n\nThese wheat bags from Bon Lux ($40) are great for soothing cramps, sore muscles or for keeping warm come winter. Made from soft and durable linen and filled with Australian wheat and dried flowers, just put them in the microwave and heat as needed. Little Tin Co Original Mixed 3-Pack If they love fish or have just returned from a holiday in Portugal and want to continue their tinned fish obsession, consider this Original Mixed Pack ($48) from Little Tin Co., which uses sustainably sourced seafood products using local Australian ingredients. This three pack is a nice little taster, with Port Lincoln sardines, smokey mussels and kingfish pate, but they also sell individual tins.\n\nThe best Christmas gifts under $75 Piecework Hors D’Ouevre Coasters For the habitual entertainer in your life, these Hors D’Ouevre Coasters from Piecework ($70) will make a fun and playful addition to their dining table. Sold as a set of four – including an oyster, olive, slice of brie and tin of sardines – they are made from soft linen (for soaking up condensation) and embroidered with cotton. Variety Hour “I Love Carbs” Cap\n\nIf bread, pasta or rice is their primary food group (and isn’t that all of us?), then they’ll love this slogan baseball cap. The “I Love Carbs” Cap from Variety Hour ($70) lets them wear their food philosophy on their sleeve (or head). It’s unisex with an adjustable back, embroidered in Melbourne and comes in this cobalt blue or a soft butter yellow. Home Lab Chilli Icon Glass Set of Four Perfect for the spice-lover in your life, these sweet Chilli Icon Glass Tumblers ($72 for a set of four) from Home Lab are perfect for serving spicy margaritas, gin and tonics or just plain old water. They come packaged in a nice gift box too for those who don’t have time for wrapping.\n\nWater and Wines Australia Wine Puzzle This Australian Wine Puzzle ($75) from Water and Wine is a fun and hands-on gift for the aspiring sommelier in your life. Featuring colourful illustrations of Australia’s over 60 wine regions, flora, fauna and landmarks, each puzzle also comes with grape profiles and food-pairing tips. If wine isn’t their speed, Water and Wine also has puzzles for whisky, coffee and beer lovers. Toast Contrast Rim Enamel Oven Dish\n\nThis enamel oven dish ($70) from Toast is a hardy kitchen workhorse and lovely gift for the busy home cook or person building out their kitchen tool kit. The contrasting blue and mahogany tones are an unusual twist on the classic blue and white enamelware, and makes an attractive serving dish straight from the oven. Santa Maria Novella Scented Wax Tablets For the person who is always impeccably dressed and appreciates the finer things in life, Italian apothecary Santa Maria Novella’s Scented Wax Tablets ($59) are a small indulgence to add a soft scent to their wardrobe. Available in a range of fragrances, tablets can be hung from wardrobe railings, nestled in the linen cupboard or packed in suitcases while travelling.\n\nThe best Christmas gifts under $100 Slip Zodiac Sleep Mask If they take their shut-eye seriously and also happen to be an obsessive reader of their horoscope each week, consider this sleep mask from Slip ($80). Made from pure silk, their Zodiac collection features fun and attractive designs tailored to each star sign. Hario Coffee Mill Dome\n\nIf coffee is a way of life for them, consider this timber coffee grinder from Japanese makers Hario ($80). Perfect for slow mornings, it’s got a lovely wooden and metal exterior, with ceramic burrs that shave rather than crush coffee beans for a better brew. Green Life Table Top BBQ Grill This Table Top Grill ($99) from Japanese brand Green Life is a great compact alternative to a Hibachi grill and ideal for kitchens large and small or taking on picnics or camping trips. Made in Niigata, Japan from a lightweight stainless steel, just add charcoal and grill yakitori, veggies, seafood.\n\nNunu Avo Egg Cup and Bowl Smashed avo takes on a slightly different meaning with Nunu’s Avo Egg and Cup Bowl ($80). Made from hand blown glass, they can be used for eggs, as salt pinch pots or even as trinket holders. Just treat them with care and they’ll never be past their use-by date. The Strong Band Trio Set",
    "source": "TheAge",
    "cluster_id": 30
  },
  {
    "url": "https://www.theage.com.au/culture/tv-and-radio/bride-to-be-tells-randy-his-words-have-haunted-her-20251124-p5nhxi.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Bride-to-be tells Randy his words have haunted her",
    "publish_date": "Mon, 24 Nov 2025 12:11:39 +1100",
    "category": "finance",
    "authors": [],
    "text": "Bride-to-be tells Randy his words have haunted her\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 31
  },
  {
    "url": "https://www.theage.com.au/national/queensland/seq-s-cheap-rent-pockets-shrink-despite-housing-boom-20251124-p5nhty.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "SEQ’s cheap rent pockets shrink despite housing boom",
    "publish_date": "Mon, 24 Nov 2025 12:10:17 +1100",
    "category": "finance",
    "authors": [
      "Catherine Strohfeldt"
    ],
    "text": "Growing suburbs in Brisbane’s south are some of the only places where rent is affordable for workers in some of the city’s fastest-growing industries.\n\nWhile Brisbane’s rents are the least affordable they have ever been, tourism hotspots in Queensland’s regions outstrip most cities as some of the country’s most expensive places to rent.\n\nThe 2025 national rental affordability index report, released by National Shelter and SGS Economics and Planning on Monday, found Brisbane and Perth were the only two capital cities where rents were not stabilising.\n\nBrisbane’s rental affordability is still “unstable” and the state’s regions are the most expensive nationwide.\n\n“Since 2019, affordability has worsened significantly, and consistently, in Perth and Brisbane,” it read.",
    "source": "TheAge",
    "cluster_id": 32
  },
  {
    "url": "https://www.theage.com.au/sport/nrl/he-feared-his-career-was-over-a-milestone-has-confirmed-enforcer-s-return-20251124-p5nhwf.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "He feared his career was over. A milestone has confirmed enforcer’s return",
    "publish_date": "Mon, 24 Nov 2025 12:01:05 +1100",
    "category": "sports",
    "authors": [
      "Nick Wright"
    ],
    "text": "Thomas Flegler is poised to cast aside a tumultuous two years, with the Dolphins’ enforcer completing contact training and on track for a round one comeback.\n\nThe three-time Queensland Maroons forward was heralded as one of the biggest signings in the Redcliffe-based club’s short history, before suffering nerve damage in his shoulder four games after leaving the Brisbane Broncos – in his 100th first-grade appearance.\n\n“A hundred on the dot, what a milestone that was,” Flegler said with a laugh.\n\nThomas Flegler is on track to return from a career-threatening shoulder injury in round one, 2026. Credit: NRL Photos\n\n“I didn’t really know how to take it. It was a little bit hard coming to training and I guess I was kind of just waiting to get to this point.”",
    "source": "TheAge",
    "cluster_id": 33
  },
  {
    "url": "https://www.theage.com.au/goodfood/sydney-eating-out/can-t-get-a-7pm-dinner-booking-bentley-team-drops-strict-sittings-system-at-new-restaurant-20251121-p5nhe4.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Can’t get a 7pm dinner booking? Bentley team drops strict sittings system at new restaurant",
    "publish_date": "Mon, 24 Nov 2025 12:00:00 +1100",
    "category": "finance",
    "authors": [
      "Scott Bolles"
    ],
    "text": "Advertisement\n\nEating outJust open Can’t get a 7pm dinner booking? Bentley team drops strict sittings system at new restaurant A proliferation of new Sydney restaurants has led the high-profile hospitality group to do things differently at their just-opened eastern Mediterranean venue Watermans at Barangaroo. Scott Bolles November 24, 2025 Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share\n\nThe long, languid 7pm dinner has proven elusive for many Sydney diners in recent years, with more venues operating on a two sittings system, often strictly timed to a two-hour seating limit. Now one restaurant is moving away from the approach, which keeps tables ticking over and maximises bums on seats, but can push customers to eat earlier or later than they’d like, especially during busy periods. Watermans launches in the One Sydney Harbour development behind Watermans Cove. Ethan Smart “You can book whenever you like,” says restaurateur Nick Hildebrandt from Bentley Restaurant Group of its new venture, Watermans. The venue opens at Barangaroo on Monday, November 24. “We don’t want to be kicking people out, we want them to stay the whole night.”\n\nAdvertisement\n\nThe eastern Mediterranean restaurant, which launches in the One Sydney Harbour development behind Watermans Cove, is the latest venue from the Bentley hospitality team. The same group operates CBD fine diner Bentley, Asian-inspired restaurant King Clarence, and the recently crowned New Restaurant of the Year, Eleven Barrack. The menu at Watermans draws on the cooking of Greece, Cyprus, Turkey and Lebanon. Ethan Smart Hildebrandt said the proliferation of new restaurants in Sydney had left venues with fewer customers to go around. “So you [need to] look after them,” he said. The restaurateur agreed that the number of sittings at Sydney’s hot restaurants had become “a bit ridiculous”. When Hildebrandt and business partner, chef Brent Savage, dreamt up their eastern Med concept, top of their list was “guest experience” as well as recruiting chef Darryl Martin, whose cooking they admired at now-closed Marrickville restaurant Barzaari.\n\nAdvertisement\n\nHildebrandt said the combination of Martin’s flavours with Savage’s finesse and plating had created some early kitchen alchemy. Their collaborative effort transformed musakhan – a chicken dish of Palestinian origins traditionally served with bread – into a roasted chicken reinterpretation coated with potato flakes instead of bread. The team behind Watermans (above) also operated the award-winning seafood restaurant Cirrus. Ethan Smart The chefs have taken their own approach to taramasalata, a now ubiquitous Sydney menu item. At Watermans, it’s served with Greek Easter bread, reworked into tiny slider buns topped with taramasalata and roe. “We pulled back on the sweetness of the Easter bread and brush it with pomegranate molasses,” Martin said. Watermans, which seats up to 150 diners, isn’t the first Barangaroo foray for Hildebrandt and Savage. They operated the award-winning seafood restaurant Cirrus, just a few steps away from Watermans, from 2016 until their lease ran out last year. “The John dory [at Watermans] has Cirrus vibes,” Savage said. “But we used to serve it with a green chilli salsa, it’s now a full-blown chermoula. They are talking the same language, but this version is a little more spiced up.”\n\nAdvertisement\n\nFrom left: Nick Hildebrandt, Darryl Martin and Brent Savage. While Savage insists that “Watermans isn’t a seafood restaurant”, the menu does lean in on seafood, with prawns and saffron orzo, pickled octopus and wood-fired scallop with pomegranate and brown butter. Hildebrandt and Savage have lost count of the exact number of restaurants they’ve opened, but they think it’s 10 and remain hands-on with the pre-launch process. “I’ve been at Flower Power getting plants, and Brent has been painting,” Hildebrandt said. It has been a busy year for the two, who have recalibrated their hospitality group. In March, they sold the plant-based Yellow to the restaurant’s long-serving head chef, Sander Nooij, and his business partner. Later in the year, they closed Monopole restaurant and stepped away from Brasserie 1930 at Capella Sydney hotel. Roasted chicken, preserved lemon, parsley and green olive. Ethan Smart\n\nAdvertisement\n\nThe two describe the new strategy as “pruning and preparing for growth” by focusing on restaurants they have full control over, and venues of a certain scale and size. This includes the February launch of Eleven Barrack, which proved to be one of the hottest openings of the year. While sympathetic towards smaller venues, Hildebrandt said venues with fewer than 60 seats don’t make sense for the business any more. “You either need to be an owner-operator [working in the venue] or turn over the tables two or three times to survive. It’s part of the reason we let Yellow go.” Open lunch and dinner daily R1/88 Barangaroo Avenue, Barangaroo, bentleyrestaurantgroup.com.au/watermanssydney Related Article New Restaurant of the Year, presented by Aurum Poultry: Eleven Barrack Related Article Exclusive Three-hatted Crown restaurant Oncore by Clare Smyth to close\n\nRestaurant reviews, news and the hottest openings served to your inbox. Sign up",
    "source": "TheAge",
    "cluster_id": 34
  },
  {
    "url": "https://au.news.yahoo.com/mps-colourful-suit-start-conversation-020035193.html",
    "title": "MP's colourful suit to start conversation about suicide",
    "publish_date": "2025-11-24T02:00:35Z",
    "category": "finance",
    "authors": [],
    "text": "Dan Repacholi is a big man in a colourful suit.\n\nThe two-metre-tall, five-time Olympian turned MP has recruited a workwear company and a tailor to create the custom, rainbow-splashed suit, all in the name of starting conversations about men's mental health.\n\n\"I'm a tradie. I'm a blue collar worker,\" he told reporters in Canberra on Monday.\n\nDan Repacholi is determined to shine a light on a topic that many men shy away from. (Mick Tsikas/AAP PHOTOS)\n\n\"It's not weak to speak. It's actually extremely strong to go and have those conversations,\" Mr Repacholi said.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nThe regional politician has teamed up with TradeMutt, a company which makes colourful workwear designed to get people talking about mental health, to create the suit.\n\nThe clothing brand donates half of its profits to TIACS, a free counselling service for blue-collar workers.\n\nTailoring was done by Urbbana, a chain of Australian suit makers.\n\nMr Repacholi, who's represented his NSW seat of Hunter since 2022, says he wants more men to talk about their mental health.\n\n\"If we could just save one person from actually possibly going down that route and using the tool that's in their toolbox, that's in the very, very back corner of it, which is suicide ... suicide is still a tool to be there, but we need to make sure it stays in those deep, dark corners of your toolbox,\" he said.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nMr Repacholi is Australia's first special envoy for men's health and has made the issue a cornerstone of his time in parliament.\n\n\"I urge every bloke out there that's seeing me in this wild suit today, not to just think it's a wild suit and look at this dickhead from Canberra. Actually look and start the conversation with a mate,\" he said.\n\nLifeline 13 11 14\n\nbeyondblue 1300 22 4636",
    "source": "Yahoo",
    "cluster_id": 40
  },
  {
    "url": "https://au.news.yahoo.com/no-illusions-labors-environmental-reforms-215735285.html",
    "title": "Coalition urged to strike deal on environment reforms",
    "publish_date": "2025-11-24T01:57:24Z",
    "category": "finance",
    "authors": [],
    "text": "Business groups are urging the coalition to strike a deal with Labor on its proposed environmental reforms as the government courts the Greens ahead of the looming end-of-year deadline.\n\nThe federal parliament has returned for the final sitting week, with the Albanese government yet to secure the numbers it needs in the Senate to pass the package.\n\n\"Under no illusions, we are going to pass these laws this week, and it's going to happen with either the coalition or the Greens,\" Environment Minister Murray Watt told reporters in Canberra on Monday.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\n\"They have an important choice to make about whether they want to be part of this process and work with us cooperatively, or whether they want to sit on the sidelines complaining and see us do a deal with the opposite party.\"\n\nBusiness Council of Australia chief executive Bran Black said the group's focus was on working with the coalition and Labor to ensure an agreement.\n\n\"That's so very important, because at the end of the day, these reforms have to have longevity, and you get longevity when it's the two major parties of the government working together,\" he said.\n\nIn a bid to win over the Greens, Labor has promised tougher rules on native forest logging which would still go ahead under the new legislation, in addition to scrapping a provision to allow coal and gas projects to bypass the main approval process.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nThe coalition has been offered changes to limit \"stop work\" orders, and wants a requirement for a project to report its carbon emissions to be dumped.\n\nEnvironment Minister Murray Watt has indicated how far Labor will go to pass new environment laws. (Mick Tsikas/AAP PHOTOS)\n\nIndependent senator David Pocock said it was clear from consultation \"substantial changes\" were needed to reverse the ongoing decline in nature, while providing certainty for business.\n\n\"We have a once-in-a-generation chance to get these reforms right, and I urge the government to listen to the feedback and take the time to ensure that these laws actually do what is promised,\" he said.\n\nSenator Watt said based off negotiations at the weekend, he was \"very confident\" in landing an agreement.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\n\"We are prepared to make some further concessions in order to pass these laws, because it's not in anyone's interests for us to hang on to the current laws that we've got at the moment, which are completely broken,\" he said.\n\nOpposition environment spokeswoman Angie Bell said the coalition was \"not in a rush to fail\" and was seeking to work constructively with the government.\n\n\"The ball is in the minister's court,\" she told ABC radio.\n\nAngie Bell is keen to see proposed amendments to environment reforms. (Mick Tsikas/AAP PHOTOS)\n\n\"I would need to see the amendments in terms of those substantive issues, and there's a list of seven, but there are more than that that I presented to the minister.\"\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nThe Centre for Public Integrity said at a time when trust in government was at an all time low, bypassing scrutiny and public input would only further undermine confidence in the democratic process.\n\n\"These reforms are extensive and highly technical, amending an already complex statutory environment, yet there is no publicly available evidence that adequate public consultation was undertaken,\" the centre said.",
    "source": "Yahoo",
    "cluster_id": 41
  }
]