[
    {
        "url": "https://www.9news.com.au/national/phone-numbers-of-prime-minister-opposition-leader-shared-online/9f3c8b8f-d002-4de2-afa7-ad2622464762",
        "title": "Personal phone numbers of Albanese, Ley and Trump published on US website",
        "publish_date": "Tue, 14 Oct 2025 00:34:31 +0000",
        "category": "finance",
        "authors": [
            "Oct"
        ],
        "text": "T﻿he phone numbers of several high-profile politicians, including the prime minister, opposition leader and even Donald Trump have been published online.\n\nA US data company appears to have used AI to scrape the internet for the personal phone numbers and emails of Anthony Albanese and Sussan Ley and made them publicly available.\n\nActing Prime Minister Richard Marles said the government is \"aware\" of the incident.\n\nPersonal details of the prime minister have been published online. (Getty)\n\n﻿\"We've notified authorities, and that is being worked through, but obviously, there is concern,\" Marles told reporters at Parliament House.\n\nLinkedIn has been named as a possible source of the information.\n\nHowever, a spokesperson for the site denied there was a data breach.\n\n﻿\"Our policies are clear that third-party companies taking personal data and using it in ways our members did not agree to is prohibited, and these companies are not affiliated with LinkedIn,\" the spokesperson told The Sydney Morning Herald.\n\nA spokesman for Ley said the personal information could only be accessed by a login.\n\n\"We were made aware of this issue when media contacted us yesterday,\" the spokesman said.\n\n\"This is obviously concerning, and we have reached out to LinkedIn to understand what occurred here.\n\n\"We are waiting for their response. We have asked the website to remove the information.\"\n\nA spokesman for Sussan Ley said there had not been a \"hack\". (Getty)\n\nThe website also published the numbers of former prime minister Scott Morrison, former foreign affairs minister Julie Bishop and Trump's business number.\n\nThe website has not been named.﻿\n\n9news.com.au has contacted the﻿ prime minister's office for comment.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/workplace-burnout-millions-of-australians-considering-leaving-their-jobs/d08262c2-8a51-4717-b399-b6255b180f37",
        "title": "Millions of Australians considering quitting their jobs due to workplace burnout",
        "publish_date": "Mon, 13 Oct 2025 21:59:43 +0000",
        "category": "finance",
        "authors": [
            "Oct"
        ],
        "text": "Millions of Australians are considering leaving their jobs in the coming year, as workplace burnout continues to wreak havoc around the country.\n\nNew research from Allianz Australia found that almost 80 per cent of employee responders, and almost 66 per cent of surveyed managers, don't believe their organisation enforces good workplace habits and boundaries.\n\nAnd 78 per cent of managers said there were system barriers exacerbating the issue, including a lack of time and resources, the absence of suitable technology, and conflict with other workplace priorities.﻿\n\nMillions of Aussies are considering quitting their job as worker burnout continues to wreak havoc. (Getty)\n\nMeanwhile, 59 per cent of employees said they'd experienced work-related mental distress, often sparked by workload pressure, meeting overload, and unrealistic expectations.\n\nOn average, Australian employees claimed they spend 3.31 hours a week on jobs or meetings deemed \"unnecessary\", and 32 per cent felt unable to take proper breaks.﻿\n\nDespite new right-to-disconnect laws, 19 per cent of employees said technology made it difficult to switch off from work, and 25 per cent said their cost-of-living worries affected their workplace performance.\n\nREAD MORE: Israeli hostages on cusp of freedom as Trump heads to Middle East\n\nMost employees say they get overwhelmed at work. (Getty)\n\nAnd 2.73 million Australians are considering quitting their jobs in the next 12 months.﻿\n\nAllianz's own numbers showed a relative increase of 28.4﻿ per cent for mental distress compensation claims between the 2021 and 2025 financial years, while the average time off per claim rose 10 per cent to 81 days.\n\n\"Our claims data tells us that mental stress and work pressure is the second highest contributor of primary active psychological claims (34 per cent),\" Allianz Australia executive general manager personal injury Mark Pittman said.\n\n\"While Allianz works to support injured workers who have been harmed by workplace stress, we recognise that the best outcomes are achieved through prevention.\"\n\nAllianz is calling on workplaces to \"unschedule the burnout\" with a range of online resources .\n\nThe company's research revealed a vast majority of employees were unable to schedule personal time for themselves and were struggling with pressures outside work, including household duties, caregiving, and unsupported parenting duties like school drop-offs.\n\nFurther, only a stark minority of managers believed their workplace was well set-up to accommodate working parents and carers.\n\nTen jobs in Australia that can offer more pay than a CEO View Gallery\n\n\"Allianz is calling on Australian workplaces to take a holistic view of employee wellbeing,\" Allianz Australia national manager mental health strategy for personal injury, Brianna Cattanach, said.\n\n\"Business leaders can support this through job design that ensures: manageable workloads, a natural ebb and flow to work demands, adequate 'recovery' time during work hours and ground rules for disconnecting after-hours.\"\n\nHelen Lawson Williams, co-founder of anti-burnout program TANK, said burnout could vary person to person, but it didn't have to be considered part of the job.\n\n\"Employees can start by recognising when their stress (and) recovery balance is off, which could feel like fatigue, overwhelm, irritability, or caring less about their work than usual,\" she said.\n\n\"Speak up before things escalate, and be specific about what's making it harder to limit stress or recover well – whether it's meeting overload, lack of breaks, unrealistic deadlines or inability to focus due to pressures outside the workplace.\"",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/social-media-ban-youtube-requests-exemption-from-new-restrictions-politics-news/7de210e9-9eda-4558-9e5a-6a9d30c56238",
        "title": "YouTube cites Troye Sivan as reason for exemption from social media ban",
        "publish_date": "Mon, 13 Oct 2025 10:39:01 +0000",
        "category": "finance",
        "authors": [
            "Oct"
        ],
        "text": "Google has claimed Australia's impending social media ban for kids under 16 could make children less safe by removing parental controls.\n\nThe tech giant has not given up on its push for a YouTube exemption to the laws, which come into effect on December 10.\n\nAll child accounts active on that date would be disabled, but kids would still be able to watch without an account.\n\nYouTube is seeking an exemption from the under-16s social media ban. (CFOTO/Future Publishing/Getty Images/File via CNN)\n\n\"Forcing kids to use YouTube without an account removes the very parental controls and safety filters built to protect them﻿,\" Rachel Lord, Google and YouTube's public policy and government affairs manager, told a Senate committee.\n\n\"It's also the ability of parents to set up supervised accounts for their children.\"\n\nLord said the restrictions also prevent a career path for emerging stars such as Troye Sivan, who found fame on YouTube.\n\n\"You don't need to look too hard to find Australian success stories that started their career on YouTube,\" Lord said.\n\nAustralia's own Troye Sivan found early fame on YouTube. (Getty)\n\nNicola Palfrey from Headspace said while young people were unsure of what would happen on December 10, at least a third were sure they would get around the restrictions.\n\nDespite YouTube's plea to the Senate, Communications Minister Anika Wells today told executives from social media giants Meta, Snapchat, YouTube and Tiktok there will be no exemptions and the platforms will be expected to facilitate the new restrictions.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/brisbane-airport-lost-property-auction/0c73975e-42ca-418e-8573-2fffea44a362",
        "title": "Necklace worth $11k, plane seats and Ansett lifejacket up for grabs at airport auction",
        "publish_date": "Mon, 13 Oct 2025 04:18:58 +0000",
        "category": "finance",
        "authors": [
            "Oct"
        ],
        "text": "A﻿ designer Bulgari gold diamond necklace worth $11,000 and other pricey jewellery are up for grabs as part of an auction of lost property found at an Australian airport.\n\nBrisbane Airport is putting ﻿the lost items - as well as airport memorabilia - up for auction for charity.\n\nThe auction features hundreds of items left behind by the 24 million passengers who travelled through the terminals in the past year.\n\nA﻿ designer Bulgari gold diamond necklace worth $11k is up for grabs at the auction. (Supplied)\n\nDespite efforts to reunite owners with their belongings, many items remain unclaimed, the airport said.\n\nOther forgotten items like walking sticks, hundreds of pairs of sunglasses, dozens of phones and numerous pair of headphones are also on offer.\n\nA hefty supply of laptops is also being sold, as well as a printer which appears to have been lost.\n\nWalking frames and children's buggies have also ended up not being claimed.\n\nREAD MORE: Israeli hostages on cusp of freedom as Trump heads to Middle East\n\nA flight recorder is up for grabs. (Supplied)\n\nAn Ansett lifejacket from the defunct Aussie airline is on offer. (Supplied)\n\nSome forgetful fliers also managed to lose pairs of sneakers and other clothes and shoes, fishing rods and surfboards.\n\nA handful of sewing machines have also bizarrely made it to lost property, as well as medical gear like CPAP machines.\n\nMeanwhile, special airport memorabilia including old plane seats, an Ansett lifejacket from the defunct airline and even a black box flight recorder from a plane are also being sold to the highest bidder.\n\nA row of old plane seats could be yours. (Supplied)\n\n\"It's always surprising and even a little bizarre to see what gets left behind by the 70,000 passengers who pass through Brisbane Airport each day,\" Peter Doherty from the airport said.\n\n\"With Brisbane Airport turning 100 this year, we've also included some special heritage aviation items we think will attract a lot of interest.\n\n\"Where else can you pick up a row of airline seats, a black box, cockpit voice recorder or vintage life jackets with Ansett on them?\"",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/australia-health-hand-washing-survery/e6016bdf-70d2-4b02-828b-c8a19f792de3",
        "title": "Aussies admit to disgusting habit after going to the bathroom",
        "publish_date": "Mon, 13 Oct 2025 01:45:45 +0000",
        "category": "lifestyle",
        "authors": [
            "Oct"
        ],
        "text": "Millions of Aussies have admitted they don't always wash their hands after going to the bathroom, including 13 per cent of men and 11 per cent of women after defecating.\n\nThe concerning data also revealed 28 per cent of men surveyed and 18 per cent of women also said they did not wash their hands after urinating, the study from the Food Safety Information Council revealed.\n\nLydia Butchmann, CEO of the Council, said the results were worrying, highlighting the consequences such habits and actions can cause to everyone.\n\nREAD MORE: ﻿ Qantas to face scrutiny after data leak exposes millions\n\nMillions of Aussies have admitted they don't always wash their hands after going to the bathroom, including 13 per cent of men and 11 per cent of women after defecating. (Getty)\n\n\"The survey came up with some interesting (and disturbing) results,\" she said.\n\n\"28 per cent of men and 18 per cent of women surveyed said they didn't always wash their hands after a pee.\n\n\"But this is essential as toilets and bathrooms are also one of the favourite locations for harmful bacteria to hang out.\n\n\"Of even more concern, 13 per cent of men and 11 per cent of women said they didn't always wash their hands after a poo.\"\n\nButchmann said the risk of these habits was compounded given almost half of all Aussies also admitted to another startling habit that also poses a huge health risk.\n\n\"If you don't wash your hands after going to the toilet you will be spreading the risk of diseases, especially as 43 per cent of men and 49 per cent of women surveyed also admitted that they didn't always wash their hands before handling food,\" she said.\n\nThe Food Safety Information Council's advice is to always wash and dry your hands:\n\nBefore handling, preparing and eating food\n\nAfter touching raw meat, fish, seafood, shell eggs or poultry\n\nAfter using the toilet, attending to children's (or others') toileting, and changing nappies\n\nAfter blowing your nose\n\nAfter touching a pet, cleaning up animal pee, poo or vomit or cleaning cat litter trays\n\nAfter gardening",
        "source": "9News"
    },
    {
        "url": "https://www.abc.net.au/news/2025-10-14/dave-hughes-hospital-again-afl-legends-game/105888798",
        "title": "Dave Hughes in hospital again six weeks after AFL Legends game",
        "publish_date": "Tue, 14 Oct 2025 01:30:08 +0000",
        "category": "sports",
        "authors": [],
        "text": "Comedian Dave Hughes has returned to hospital, six weeks after suffering five broken ribs and a punctured lung in the AFL's Legends game.\n\nRepresenting Victoria in the exhibition match in August, Hughes was on the receiving end of bumps from former AFL players Andrew Embley, Daniel Gorringe and Mitch Robinson during the match.\n\nHughes, 54, was hospitalised after the match with five broken ribs and a punctured lung.\n\nLoading Instagram content\n\nOn Monday, the comedian took to social media to announce that he was back in hospital with more lung issues.\n\n\"The experts are draining a coupla litres of lung fluid into a goon bag for me. Then it's party time again,\" Hughes wrote.\n\nHughes's greatest concern in hospital appeared to be a constant beeping noise as he lay in a bed.\n\nIn a separate post, Hughes discussed the dismay he had at the persistent noise.\n\n\"You know what kills you about hospitals?\" he said.\n\n\"Not the risk of infection. It's just the beeping. Someone shut the fridge, for f***'s sake.\"\n\nDespite being on the receiving end of several bumps in the match, Hughes said he believed the main damage came from a collision with 2006 Norm Smith medallist Embley.\n\n\"I just want to say that I am so sorry for my little thump on you last night that has obviously caused so much damage, you look so sore right now,\" Embley said after Hughes was hospitalised the first time.\n\n\"How brave were you, big fella, to continue with the game?\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-10-14/victoria-liberal-opposition-first-peoples-treaty-scrapped/105888108",
        "title": "Victorian Liberals will scrap Australian-first Treaty within 100 days if elected",
        "publish_date": "Tue, 14 Oct 2025 01:13:59 +0000",
        "category": "finance",
        "authors": [],
        "text": "The Victorian Liberals will scrap Australia's first formal Treaty agreement with First Peoples' if elected.\n\nThe ABC understands the decision was made at a recent shadow cabinet meeting, with the Opposition on Tuesday committing to introduce legislation repealing Treaty in the first 100 days of a state Liberal government.\n\nWhile the Opposition had already withdrawn its support for the Treaty process and said it would not support the proposed bill, it had not announced a plan to repeal the agreement once signed until today.\n\nIn a statement, the party said it did not believe Treaty was the best way to deliver better outcomes for Aboriginal Victorians and would instead establish a new government department — called First Nations Victoria — to report to Parliament and oversee progress on Closing the Gap targets.\n\nPremier Jacinta Allan said the announcement was divisive.\n\n\"They've said to the Victorian community, that their first priority if they should have the privilege of holding government is not to build the future it's to tear it down,\" she said.\n\n\"Tear down something that has been worked on not just for the last ten years that we have been working on this, but for decades.\"\n\nThe proposed Treaty with First Peoples' in Victoria follows generations of advocacy of First Peoples in Victoria and around Australia and a Labor initiated consultation, planning and negotiation process which began in 2016.\n\nThe proposed legislation that underpins the agreement was introduced into Parliament last month, and is set to be debated this week with the aspiration for the agreement to be signed before the end of the year.\n\nUnder the planned agreement, the existing First Peoples' Assembly, an elected body that represents Aboriginal Victorians, would be made permanent and given new powers to ask questions of ministers and make decisions on some specific matters that impact Aboriginal people.\n\nVictoria's historic treaty legislation was formally tabled in parliament in September. (ABC News: Dylan Anderson)\n\nIt would also establish and control new accountability and truth-telling bodies but would not have veto powers over government decision-making.\n\nThe treaty bill is still expected to pass with the support of Labor and the Greens.\n\nEarlier today, Premier Jacinta Allan attended a smoking ceremony on the steps of Parliament house ahead of the Treaty debate.\n\n\"We trust you to do the right thing for us, as we are Victorians too,\" Uncle Andrew Gardiner, Wurundjeri Woi-wurrung elder and representative on the First Peoples' Assembly of Victoria, told the crowd.\n\nIn a statement, Victorian Greens leader Ellen Sandell said the Liberals' new position on repealing Treaty would not make a difference.\n\n\"It's deeply disrespectful that the Liberals have turned their backs on this history-making moment and on Aboriginal Victorians who have been working for years on Treaty,\" she said.\n\n\"To use this historic and proud moment to sow division is a new low, even for the Liberals. The Liberals have been a hopeless opposition, and the fact that their only plan for Victoria is to drag us backwards shows just how unfit for government they are.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-10-14/australia-call-up-josh-philippe-and-matt-kuhnemann/105888558",
        "title": "Philippe, Kuhnemann in for ODI with Inglis injured",
        "publish_date": "Tue, 14 Oct 2025 01:07:17 +0000",
        "category": "sports",
        "authors": [],
        "text": "Josh Philippe is set to play his first ODI for Australia in four years, after Josh Inglis failed to recover from his calf strain in time for the series opener against India.\n\nAustralian officials confirmed on Tuesday that Philippe had been called into the squad for the Perth one-dayer, while Matt Kuhnemann will briefly replace Adam Zampa.\n\nThe changes come as staff attempt to juggle a marquee bilateral series against India with preparations for the Ashes.\n\nInjured Cummins in doubt for Perth Test Pat Cummins all but rules himself out of the first Ashes Test, saying he is still a way short of completing his condensed recovery schedule from a back injury.\n\nInglis had hoped to be fit to play through the entire white-ball series after straining his calf last month in New Zealand.\n\nBut medical staff now expect him to miss the first two ODIs, with the hope he will be fit by the series finale in Sydney on October 25.\n\nInglis is also part of Australia's squad for the first two T20s against India, and would likely remain with the side for all five of those matches.\n\nAlex Carey replaced Inglis in the recent white-ball matches in New Zealand, but officials want him to play in South Australia's Sheffield Shield match against Queensland starting Wednesday.\n\nThat has left Philippe to come into the squad for the series opener, before Carey takes the gloves for the second ODI in Adelaide and Inglis potentially returns for the third.\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\nPhilippe enters the series in form, scoring a century for Australia A against India A in a four-day fixture last month in Lucknow.\n\nHe also struck 85 in Darwin against Sri Lanka A in July.\n\nKuhnemann's call-up, meanwhile, comes as Zampa remains back in NSW with his wife close to giving birth.\n\nThe finger spinner's last ODI was back in 2022 in Sri Lanka, with his form on that tour enough to put him in the frame for a Test debut.\n\nThe left-armer has enjoyed a rapid rise since then, to the point where he is Australia's first option to partner Nathan Lyon on the subcontinent in Tests.\n\nAAP",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-10-14/when-to-share-the-news-of-a-pregnancy-with-your-employer/105865350",
        "title": "Is there a 'right time' to tell your employer you're pregnant?",
        "publish_date": "Tue, 14 Oct 2025 00:27:30 +0000",
        "category": "finance",
        "authors": [],
        "text": "Sharing news of a pregnancy with those in your close circle is often an exciting occasion.\n\nBut those feelings may change when you start to consider when and how to tell your boss or employer.\n\nWe asked some experts how much notice you need to give an employer for parental leave and what to consider before you have the conversation.\n\nThe 12-week pregnancy 'rule'\n\nThere's an unwritten \"rule\" that says women should keep their pregnancy news quiet — at least for the first 12 weeks.\n\nAccording to Penny Sheehan, obstetrician and head of the Royal Women's Hospital in Melbourne's Preterm Labour Clinic, there are no clinical guidelines stipulating when a woman should or should not announce her pregnancy.\n\nDr Sheehan says at 12 weeks, most people can \"believe with some confidence\" that their pregnancy will be ongoing.\n\nExperts say deciding when to announce a pregnancy is a deeply personal choice. (Unsplash: Anastasiia Chepinska)\n\nBut she says it's up to each individual (or couple) to decide when the time is right for them to share the big news.\n\n\"I've never told [anyone] to not tell anyone. In fact, I would usually say to share it with a support person and some close family and friends, so that you do have some support,\" she says.\n\nWhen you need to tell your employer about your pregnancy\n\nLegally you need to provide a minimum of 10 weeks' notice before you intend to finish work.\n\nMelissa Innes says you need to give 10 weeks' notice in writing. (Supplied: Dr Melissa Innes)\n\nDr Melissa Innes, an associate lecturer in the School of Business at the University of the Sunshine Coast, on Kabi Kabi Country, says this is to ensure the employer has enough time to advertise and recruit a replacement.\n\n\"The idea is that that you try and give them as much notice as you can because that's a healthy working relationship.\n\n\" And yes, it does provide for them to find someone to help out while you're not there. \"\n\nShe says employers have legal obligations to provide parental leave under the Fair Work Act.\n\nSign up to the ABC Lifestyle newsletter Get a mid-week boost and receive easy recipes, wellbeing ideas, and home and garden tips in your inbox every Wednesday. You’ll also receive a monthly newsletter of our best recipes.\n\nWhat that looks like \"does depend on the nature of your workplace and the relationship that you have with them and how long you've been with your employer,\" says Dr Innes.\n\n\"If you're working for a great employer who is focused on their employer brand … then they may have some best-practice approaches to parental leave.\"\n\nThese can include financial support beyond government schemes, flexibility in leave and return to work, and superannuation contributions during leave.\n\nIf these are in place, Dr Innes says an employee might feel happy to let their employer know much earlier than 10 weeks that they intend on taking parental leave.\n\nHow to have the conversation about a pregnancy\n\nDr Innes says an employee needs to provide the \"10 weeks' notice in writing\".\n\n\"I personally would prefer initially a face-to-face discussion about something as personal as this that's going to affect your life in a big way,\" she says.\n\nI'm glad I took paternity leave My son now looks at me the same way he looks at Mum — and I wouldn't change that for anything.\n\n\" But legally you do actually need to provide that written notice. \"\n\nShe says you also need to clarify how much time you're intending to take and whether you're taking continuous unpaid leave, as per the Fair Work Act.\n\nShe also recommends investigating whether your workplace has other options in place and how much you would like to use those, for example flexible parental leave and working from home.\n\nThe same applies to partners when they want to take parental leave.\n\nSunshine Coast-based business author and psychosocial safety specialist Brenda Jamnik says people may find themselves needing to have conversations with employers sooner than they'd hoped due to complicating factors.\n\n\"Some women will have a different performance level,\" she says.\n\n\"For example … [with] constant morning sickness, sometimes they just can't drag themselves out of bed.\n\nBrenda Jamnik says people may find themselves needing to have conversations with employers sooner than they had hoped. (Supplied: Dr Brenda Jamnik)\n\n\" If you've got a really good workplace, they will understand that [you] may need to access leave. \"\n\nDr Jamnik says parental leave typically begins six weeks before the expected due date, or earlier if the employer agrees.\n\nIf someone wants to work beyond that, the workplace can ask for a medical certificate from the employee stating whether they are fit to work and if their position is safe for them to work in during this period.\n\n\"Some people get upset about this,\" says Dr Jamnik, \"but really it is about the mum's fitness for work because the employer has a duty of care.\"\n\nEmployers need to support pregnant staff\n\nDr Jamnik says employers need to make suitable workplace adjustments for a pregnant employee to ensure they can work safely.\n\n\"The employer has an obligation to make what's called reasonable adjustments to ensure not only that they provide modified work hours [if needed] but also that they might adjust the workplace to make it safe,\" she says.\n\nParents receiving government paid parental leave to get super Parents accessing the government-funded paid parental leave will receive an additional 12 per cent of their payments in super from July next year, after the federal government's legislation passed parliament.\n\n\"If [the employee is] in a retail sector, they might ask if they can have a chair.\n\n\"They can ask for ergonomic stations, changes to their start and finish times, those sorts of things.\"\n\n\"If the employer says, 'look, we've got no safe job', they're entitled to unpaid parental leave or they're entitled to leave.\"\n\nShe warns that businesses cannot discriminate against any employees because of their pregnancy.\n\nThis article contains general information only. You should consider obtaining independent professional advice in relation to your particular circumstances.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-10-14/nt-aboriginal-and-torres-strait-islander-art-alice-springs/105887842",
        "title": "National art gallery in Alice Springs scrapped after government rift",
        "publish_date": "Mon, 13 Oct 2025 23:16:56 +0000",
        "category": "entertainment",
        "authors": [],
        "text": "The Northern Territory government has scrapped plans for a multi-million-dollar Aboriginal and Torres Strait Islander Art Gallery of Australia in Alice Springs, after nine years of back and forth.\n\nLast week, NT infrastructure minister Bill Yan gave his federal counterpart Catherine King an ultimatum to approve his government's downsized plans for the gallery or it wouldn't go ahead.\n\nMs King said she refused to be forced into a decision on the project.\n\nMr Yan told ABC Alice Springs on Tuesday the federal Labor government were not serious about delivering the project and his government would not go ahead with it, blaming Lingiari MP Marion Scrymgour for the delay.\n\n\"There's been a campaign launched by Marion Scrymgour since the election … she wants the gallery moved to Desert Knowledge, halfway between Alice [Springs] and the airport,\" he said.\n\nNT Treasurer Bill Yan gave federal Minister for Regional Development Catherine King an ultimatum last week. (ABC News: Peter Garnish)\n\n\"Now it's time for Labor to put their money where their mouth is … I can't continue on this merry-go-round that the territory and the people of Alice Springs have been on now for nine long years at the will of the Labor government.\"\n\nMs Scrymgour and Ms King have both been contacted for comment.\n\nWhat happened with the gallery plans?\n\nThe project was first announced in 2017 by the former NT Labor government and was set to be built on Anzac Oval.\n\nThe federal government had promised $80 million towards the gallery, with the NT government contributing $69 million.\n\nIt was the subject of intense debate over its location, on what traditional owners said was a sacred site.\n\nLoading...\n\nThe Labor government was also criticised for ignoring advice from a committee it set up in 2017 that concluded the gallery should be built out of the town centre, at the Desert Park.\n\nDespite this, the design for the gallery at Anzac Oval was released in 2023, with its open layout and four-level atrium structure touted as its key features.\n\nHowever, in November last year the new CLP government revealed plans to almost halve the size of the art gallery and said it would be moved to the Wills Terrace car park.\n\nThe CLP released the new design for the gallery in late July, drawing criticism from residents and Ms Scrymgour as being poorly located and too small to host a gallery of national significance.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-10-14/midnight-oil-fans-secure-rob-hirsts-drum-kit-at-charity-auction/105887566",
        "title": "Fans scramble to keep Midnight Oil drummer's kit 'in public hands'",
        "publish_date": "Mon, 13 Oct 2025 23:03:31 +0000",
        "category": "finance",
        "authors": [],
        "text": "Some of Midnight Oil's most dedicated fans have secured drummer Rob Hirst's kit at a charity auction.\n\nHirst put his kit up for auction, which he has had since 1979, after declaring he could no longer keep playing the big rock and roll drum kit because of his battle with pancreatic cancer.\n\nThe fan community Powderworkers bought the kit at the auction for $77,500 on Monday night.\n\nHirst says he cannot play the kit anymore owing to his battle with pancreatic cancer. (AAP: Dean Lewins)\n\nMatthew Yau, who ran the auction on Hirst's behalf and is from Powderworkers, told 702 ABC Radio Sydney that it would be donated to the Australian Music Vault in Melbourne.\n\n\"It's in public hands,\" Mr Yau said.\n\nMr Yau said the auction came down to the last minute on Monday when the fan club's $65,000 bid was almost pipped at the post by an anonymous bid of around $75,000.\n\nA last-minute scramble for extra money led to the 16,000-member Powderworkers securing the kit.\n\nThe drum kit has been on stage for every Midnight Oil tour since 1979, right up to farewell shows in October 2022.\n\nThe drums fetched $77,500 at Monday night's auction. (Supplied: Chuck Bradley)\n\nSpeaking with Radio National, Hirst said he still performed and wrote but could not play the high-energy shows he did with Midnight Oil for 45 years.\n\n\"I've just kind of been through the litany of things that can keep one alive,\" Hirst told The Radio National Hour this month.\n\n\"I've had two major operations. I've had untold chemo. I've had radiotherapy. I got sepsis at one point.\n\n\" I'm still here. I'm a bit breathless these days and I can't play a big rock and roll drum kit anymore, but I'm still writing songs. \"\n\nHirst said the kit was built like \"a brick shed\" and had been bashed around in and out of tour trucks — but still looked brand new at auction.\n\nHirst put the kit up to raise money for First Nations musicians in the Northern Territory and the support crews for Australian bands who have fallen on hard times.\n\nHe bought the black Ludwig kit from a Turramurra music store in Sydney's north in 1979 ahead of the recording of the band's second album Head Injuries.\n\nAs well as the band's drummer, Hirst is a songwriter on many Midnight Oil hits. He has writing credits on songs including Beds Are Burning, Blue Sky Mine and Read About It.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-10-14/brittany-higgins-faces-bankruptcy-proceedings-linda-reynolds/105887676",
        "title": "Linda Reynolds launches bankruptcy proceedings against Brittany Higgins",
        "publish_date": "Mon, 13 Oct 2025 22:39:42 +0000",
        "category": "finance",
        "authors": [],
        "text": "Former senator Linda Reynolds has launched bankruptcy proceedings in the Federal Court against her ex-staffer Brittany Higgins as she tries to recover damages awarded to her for defamation.\n\nIn August Ms Higgins was ordered to pay Ms Reynolds $315,000 plus $26,000 in interest after she and her husband David Sharaz were found to have defamed the former senator in a series of social media posts.\n\nMs Higgins was also ordered to pay 80 per cent of Ms Reynolds's legal costs.\n\nBrittany Higgins ordered to pay $340k to ex-boss Linda Reynolds Former WA senator Linda Reynolds wins her high-profile defamation case against ex-staffer Brittany Higgins, whom she had accused of conducting an orchestrated campaign to end her political career.\n\nMs Reynolds was represented in court by a team of barristers led by Martin Bennett, who confirmed her legal bill had exceeded $1 million.\n\nThe Federal Court's website shows the former West Australian MP filed a creditor's petition against Ms Higgins on Friday.\n\nThat was the same day Ms Reynolds said Mr Sharaz had been served bankruptcy papers, declaring he had 21 days to pay his debt or she would \"proceed to apply to formally bankrupt him\".\n\nHe was found liable for up to $220,000 in damages plus costs.\n\nDavid Sharaz and Brittany Higgins were both found to have defamed Linda Reynolds. (Instagram: David Sharaz)\n\n'Committed to seeing this through'\n\nIn a statement on Wednesday Ms Reynolds confirmed bankruptcy proceedings against Ms Higgins had begun.\n\nMs Reynolds won her defamation case against Ms Higgins and Mr Sharaz in Perth in August. (ABC News: Glyn Jones)\n\n\"I confirm that after Brittany failed to comply with the bankruptcy notice I had issued to her several weeks ago, I have now filed a creditor’s petition in the Federal Court,\" she said.\n\n\"It is unfortunate that I have to take this step in this long-running saga.\n\n\"As I have said, this is conduct which comes as no surprise to me, however, what should be plain now is that I am committed to seeing this through to the end.\"\n\nThe new matter is listed for a hearing before a WA registrar in November.\n\nMs Higgins lodged an appeal against the defamation ruling last month on the last day possible for her to appeal.\n\nDefamed in social media posts\n\nThe defamation action was launched by Ms Reynolds following social media posts made by Ms Higgins beginning in 2022.\n\nThe former senator argued the posts trashed her reputation and caused her immense distress following a period of ill health.\n\nMs Higgins wrote the posts four years after she was raped in the then-senator's office by her colleague Bruce Lehrmann.\n\nSome of the social media posts made by Brittany Higgins which Ms Reynolds took action over. (Supplied: WA Supreme Court)\n\nThe finding of rape was made last year by Justice Michael Lee during a separate defamation action Mr Lehrmann had launched in the Federal Court against Channel 10 and journalist Lisa Wilkinson.\n\nThat finding was made on the balance of probabilities, the standard of proof in a civil court matter.\n\nSeparate criminal proceedings against Mr Lehrmann, which required a charge to be proved beyond reasonable doubt, were discontinued after juror misconduct and concerns for Ms Higgins's welfare.\n\nMr Lehrmann has always denied raping Ms Higgins.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-10-14/alexei-popyrin-defeated-in-atp-tour-stockholm-open/105887672",
        "title": "Popyrin defeated in ATP Tour return after two-month back injury layoff",
        "publish_date": "Mon, 13 Oct 2025 22:29:24 +0000",
        "category": "sports",
        "authors": [],
        "text": "Alexei Popyrin's ATP Tour return has ended with defeat as Australia's second-highest-ranked men's player returns to the court following a back injury.\n\nIn his first match since being defeated by Jannik Sinner at the US Open, Popyrin fell to Sebastian Korda 6-7 (4-7), 6-1, 6-3 at the Stockholm Open in Sweden.\n\nThe seventh-seeded Australian had split the two previous clashes with the American but the world number 48, who enjoyed reaching a career-high 19 just before playing at Flushing Meadows, succumbed in two hours 24 minutes.\n\nBoth men lost their serve twice in the opening set, while Popyrin was broken a further five times en route to Korda setting up a second-round clash with a fellow unseeded opponent.\n\nOther first-round winners included Swedish wildcard Leo Borg, son of 11-time grand slam winner Bjorn, Brit Jacob Fearnley and Serbia's Miomir Kecmanovic.\n\nMeanwhile at the ATP 250 hardcourt event in Almaty, James Duckworth was a 6-3, 6-4 opening-round winner over fellow qualifier Ugo Blanchet, one day after the Frenchman eliminated another Aussie in Rinky Hijikata.\n\nCompatriot Bernard Tomic was beaten in Kazakhstan 6-1, 7-6 (11-9) by eighth seed Corentin Moutet in just under two hours.\n\nDuckworth faces seventh seed Gabriel Diallo next after the Canadian saw off local Amir Omarkhanov 6-3, 6-1.\n\nDefending champion and top seed Karen Khachanov received a first-up bye.\n\nAAP",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-10-14/mobile-phone-power-outages-during-emergencies-generator-trial-wa/105835910",
        "title": "Communities given generators to save mobile coverage during emergencies",
        "publish_date": "Mon, 13 Oct 2025 22:01:47 +0000",
        "category": "finance",
        "authors": [],
        "text": "Farmer and volunteer firefighter Scott Smith made and received hundreds of calls while tackling a bush fire in WA's Great Southern earlier this year.\n\nDespite repeated attempts to connect to other farmers and firefighters, many went unanswered.\n\n\"[I made] just over 250 calls,\" Mr Smith said.\n\n\"The vast majority of those either didn't connect or cut out seconds in.\"\n\nScott Smith farms in Green Range and faces ongoing issues with connectivity. (Supplied: Scott Smith)\n\nMr Smith, who farms at Green Range, 440 kilometres south of Perth, said he could not understand why he was struggling to get service, given he could see the phone tower on Green Range Hill.\n\n\"We could've gotten away with 60 or 70 [calls] if connectivity was reliable,\" he said.\n\nIn the days after the fire, the Department of Fire and Emergency Services (DFES) said the service outage was a result of damage to Western Power infrastructure sustained at the height of the blaze.\n\nWithout backup power on site, the mobile tower failed, creating the temporary service outage that led to Mr Smith's poor signal.\n\nGreen Range locals say communication on the fire ground was a challenge because of patchy coverage. (ABC Great Southern: Andrew Chounding )\n\nA statewide issue\n\nConnectivity during emergencies is an issue that has impacted other regional communities across the state.\n\nIn 2024 a supercell thunderstorm in the Wheatbelt and Goldfields region caused widespread disruptions to the telecommunications network.\n\nWhile in 2021, Cyclone Seroja ripped through the state's Mid West and Wheatbelt, destroying homes, businesses and mobile services.\n\nA review by DFES the same year found the cyclone left more than 100 3G mobile towers and 79 4G base stations without signal for days.\n\nKaren Chappel says connectivity during emergencies is \"critical\" for rural communities. (Supplied: WALGA)\n\nLocal Government Association president Karen Chappel said ensuring rural connectivity remained in place during emergencies was \"critical\" for local residents.\n\n\"Cyclone Seroja, fires in the Goldfields, Bruce Rock, Esperance — those have really identified the need for emergency services and families to have [mobile] contact,\" she said.\n\nTrial to test backup generators\n\nIn November, the state government announced it would trial a pilot program using automatic transfer units (ATU) at 80 sites across the Wheatbelt and Goldfields to provide power during an outage.\n\nATUs are devices that switch power from the network grid to a backup power generator, allowing for the continuous flow of electricity to the network infrastructure.\n\nDFES and Telstra, who are co-funding the program, said the units could be switched on by locals in an emergency meaning they don't have to wait for a utility provider to get on site.\n\nThe program has been touted as a solution to combat network outages by Regional Development Minister Don Punch.\n\n\"Being able to communicate quickly and effectively during an emergency is critical,\" he said.\n\n\"Automatic transfer units across the Wheatbelt and Goldfields will help secure essential mobile and communication services to support first responders and regional communities during network outages.\"\n\nHowever a DFES spokesperson described the pilot program to the ABC as a \"temporary workaround\".\n\nA fire tore through Scott Smith's property this year. (Supplied: Scott Smith)\n\nLife-saving solution\n\nMs Chappel said she would like to see more towers and a permanent solution put in place to improve coverage, particularly in areas with busy tourism and emergency response seasons.\n\n\"It's a pilot program and we're hoping it's so successful that it's rolled out across the state, so the ATUs are in place and there are no interruptions; so lives will be saved,\" she said.\n\nTelstra regional general manager Boyd Brown said the company continually reviewed its sites to ensure backups were working as expected.\n\nHowever Mr Brown said the telco's own services could be affected by low power levels.\n\n\"Our network sites can use the same amount of power as 10 homes every day, so disruptions will occur if power is out for a long time in your area,\" Mr Brown said.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-10-14/afl-trade-period-day-seven-live-updates-merrett-curnow-petracca/105886172",
        "title": "Live: Pies and Lions shuffle picks as wheels begin to turn on Merrett and Curnow",
        "publish_date": "Mon, 13 Oct 2025 21:47:28 +0000",
        "category": "sports",
        "authors": [
            "Chris De Silva"
        ],
        "text": "Is geelong still in the race for curnow since he went to the swans hq. - Lachlan Is charlie curnow going to tour the cats facilities as well. - Henry Jeez, you just about take that offer if you're Carlton. Can't see what else they'd want there? - Sam Could Curnow moving to Sydney open the door to Marshall joining the Cats? - ManCat Hey again, with Geelong's offer of three first round picks for Curnow, that seems an awful lot for one player. What was the reason for Carlton declining this? - Marcus Surely Sydney's offer for Curnow has set somewhat of a benchmark for Hawthorn re Merrett. The mooted offers are clearly not good enough. - Matt\n\nRattling through a few more questions regarding Charlie Curnow.\n\nLachlan: This is the million-dollar question. I wouldn't rule Geelong completely out. I'm keen to see whether they send Carlton a counteroffer.\n\nHenry: There's no indication of Curnow touring Geelong's facilities, at least publicly. I wonder whether he's done it already, given he's from the area.\n\nSam: I don't think it's too great a deal, particularly if you're sending back what is essentially a first-round pick (No.22).\n\nManCat: These two definitely seem to be linked. If Curnow goes to Sydney, the Cats can certainly get more aggressive in a Marshall deal.\n\nMarcus: I think the picks, although first-round by name, were going to be at best in the teens, making them far less appealing from a Carlton perspective.\n\nMatt: This is also an interesting wrinkle. It wouldn't surprise me if the Hawks use a similar framework. Who has the higher trade value out of Curnow and Merrett? I'd say probably Curnow given his age and position.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-10-14/six-nrl-players-named-in-england-rugby-league-ashes-sqaud/105887552",
        "title": "Six NRL players in England Ashes squad, no place for Man of Steel",
        "publish_date": "Mon, 13 Oct 2025 21:16:29 +0000",
        "category": "sports",
        "authors": [],
        "text": "Six NRL players have been named in the England rugby league squad for the upcoming Ashes series against Australia, but there was no room for the most consistent player of the Super League season.\n\nEngland's 24-man squad was announced on Monday, but did not feature Leeds Rhinos halfback Jake Connor.\n\nThe Rhinos half won Super League's Man of Steel award, the competition's individual honour for the season's most consistent performer, after leading his side to a top-four finish in 2025.\n\nRugby league Ashes returns to end lost generation New Kangaroos coach Kevin Walters was part of an era where the green and gold jersey was the highest honour rugby league could offer and ahead of the return of the Ashes it's a legacy he's desperate to pass down to his players.\n\nConnor has not played Test rugby league since representing Great Britain in 2019, and the 30-year-old will have to wait a little longer for another opportunity.\n\nEngland coach Shaun Wane opted for Mikey Lewis, Harry Smith and captain George Williams as his options in the halves.\n\nSpeaking to Sky Sports, Wane said the Man of Steel award did not come into his consideration when selecting his Ashes squad.\n\n\"When I'm picking a squad, the thing you will never hear from me is 'he's won the Man of Steel he needs to be in',\" Wane said.\n\nWalsh earns Kangaroos selection Recognition of Reece Walsh's breathtaking performance in the NRL grand final continues, with the Brisbane Broncos hero set to make his Test debut for Australia later this month.\n\n\"I don't even know who picked the Man of Steel, I don't know what goes into it. The Dream Team, I don't even know who's in the Dream Team, so that never comes into my reckoning. Them things that are important to other people.\n\n\"I just watch the players play and think who can do a fantastic job against Australia. It is more about form than anything else.\n\n\"We had a good chat, he's a really good lad and I've lots of time for him.\n\n\"But there's other players, other than Jake Connor, not got in this 24, and I don't see the obsession about why every single person, the Man of Steel, it just doesn't mean anything to me.\"\n\nA quarter of the England squad play in the NRL, with John Bateman (North Queensland Cowboys), AJ Brimson (Gold Coast Titans), Herbie Farnworth (Dolphins), Kai Pearce-Paul (Newcastle Knights), Morgan Smithies (Canberra Raiders) and Dom Young (Newcastle Knights) being picked.\n\nBrimson, who has won a State of Origin series for Queensland, has been selected after switching his allegiance to England this year.\n\nBrimson was eligible for England through his mother, but needed the approval of the International Rugby League tribunal to switch his allegiance from Australia, another tier one nation in rugby league.\n\nThis year's three-Test series with be the first rugby league Ashes in 22 years.\n\nAustralia has held the Ashes since 1973, when it defeated Great Britain 2-1 in a three-Test series.\n\nEngland rugby league Ashes squad\n\nJohn Bateman (North Queensland Cowboys)\n\nAJ Brimson (Gold Coast Titans)\n\nJoe Burgess (Hull KR)\n\nDaryl Clark (St Helens)\n\nHerbie Farnworth (Dolphins)\n\nEthan Havard (Wigan Warriors)\n\nMorgan Knowles (St Helens)\n\nMatty Lees (St Helens)\n\nMikey Lewis (Hull KR)\n\nJez Litten (Hull KR)\n\nMike McMeeken (Wakefield Trinity)\n\nHarry Newman (Leeds Rhinos)\n\nMikolaj Oledzki (Leeds Rhinos)\n\nTom Johnstone (Wakefield Trinity)\n\nKai Pearce-Paul (Newcastle Knights)\n\nHarry Smith (Wigan Warriors)\n\nMorgan Smithies (Canberra Raiders)\n\nOwen Trout (Leigh Leopards)\n\nAlex Walmsley (St Helens)\n\nJake Wardle (Wigan Warriors)\n\nKallum Watkins (Leeds Rhinos)\n\nJack Welsby (St Helens)\n\nGeorge Williams (Warrington Wolves)\n\nDom Young (Newcastle Knights)\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-10-14/chalmers-retreat-on-super-tax-had-prime-minister-behind-it/105886080",
        "title": "Chalmers wielded the axe on his super tax, but the PM's fingerprints were obvious",
        "publish_date": "Mon, 13 Oct 2025 21:02:11 +0000",
        "category": "finance",
        "authors": [],
        "text": "Tension with the prime minister is written into the treasurer's job description.\n\nEconomic reforms can shape how history remembers a government, but they rarely seem like political winners from the outset. It is a treasurer's job to push the unpopular and the prime minister's job to push back on the unsellable.\n\nJim Chalmers has embraced this role, unafraid to show his ambition for tax reform and venture beyond the more cautious Anthony Albanese. Though he has more often than not been pulled back into line, he has also had the occasional victory.\n\nOn Tuesday, one of those victories soured into a defeat. With the boss on leave, Chalmers was sent out to mangle his own super earnings tax, an idea he championed back in 2023, and which seemed closer than ever to passing with Greens support.\n\nThe treasurer insisted it was his own idea to unwind every single contentious element of his plan to double the earnings tax on super balances above $3 million, replaced with a new plan to raise less money from fewer people.\n\nBut the prime minister's fingerprints were all over the backflip. First, the tax vanished from the legislative agenda. Second, a trickle of media reports suggested he was having doubts. Third, Treasury confirmed it had met with his office to discuss criticisms of the policy.\n\nAxe (contentious elements of) the tax\n\nWithin a day of that revelation, cabinet's expenditure review committee met to axe the parts of the tax that had caused trouble from the beginning, with the changes finalised by cabinet on Monday.\n\nThe $3 million threshold would be indexed, sparing more taxpayers from the tax in the future but slashing the amount of revenue the new tax would raise. And the tax would no longer apply to \"unrealised\" earnings, such as a higher valuation on a home or farm.\n\n\"We have found another way to deliver on the same objectives,\" Chalmers ventured.\n\nRelationships between prime ministers and treasurers have inevitable tensions. (ABC News: Adam Kennedy)\n\nThere was a consolation prize of an even higher tax on earnings above $10 million, and a substantial super boost for low earners, which could net some people an extra $15,000 in retirement, and which was welcomed by welfare advocates.\n\nBut there are no two ways about it: the new plan does not do as much as the old plan to rein in tax concessions for super, which politicians of all stripes have long admitted flow disproportionately to the wealthy, but which have been stubbornly hard to dislodge.\n\nReform finds no backers\n\nFrom the outset, the changes were difficult to explain. The rationale for taxing unrealised gains was fuzzy at best — the government said it was the only way large super funds could administer the tax.\n\nThere was some substance to that point. Super funds treat their members' money as one big pool, and can't easily distinguish which members \"realise\" any particular gain.\n\nHow Labor's super tax proposal is changing Every prominent criticism of the tax has been addressed, with the result that it will apply to fewer people and raise less money.\n\nBut explaining why it was fair to tax people on earnings they couldn't actually access because they were tied up in assets that were not liquid was difficult, even if the affected people were likely wealthy enough to manage.\n\nAnd it was tough to justify the decision not to index the threshold, except on the grounds that it would raise more money.\n\nTrue, critics exaggerated how significant this would have been. Even in 15 years' time, the tax would still only have covered about one in 20 super funds.\n\nAnd crucially, those people would still be getting a tax concession — just a smaller one. They would pay 30 per cent instead of 15 per cent, only for the portion of their earnings which fell above the $3 million line — still lower than the top income tax rate of 45 per cent most would otherwise pay.\n\nBut it's not hard to see how that argument could lose people, and it seems, at least, to have lost the prime minister.\n\nTreasurer's unrealised ambitions\n\nIn the end, all this ado might amount to nothing much. In 2028-29, the new version of the tax would raise $2 billion, whereas the old one would raise $2.5 billion. A lot of kerfuffle for half a billion, even if the gap would have grown over time with indexation.\n\nFew would go so far as to say that the super tax changes — in either their past or present form — constitute the sort of legacy-defining tax reform that economists covet. They are the sort of thing vaunted economist Ken Henry likes to call \"tinkering\".\n\nBut the ill portents for a treasurer who has said he wants to \"grasp the nettle\" and take on bigger-picture reforms to the tax system, but who has been up against a wary prime minister from the start, are hard to ignore.\n\nDespite its colossal election victory, Albanese's government continues to err on the side of caution.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-10-14/university-access-in-broome-aims-to-address-workforce-shortages/105857418",
        "title": "Why are regional students under-represented at universities?",
        "publish_date": "Mon, 13 Oct 2025 21:02:01 +0000",
        "category": "lifestyle",
        "authors": [],
        "text": "For high-schoolers graduating in remote communities across Australia, the pathway to university can seem fraught with obstacles.\n\nUprooting your life and moving to a capital city is not always viable, which is the case for many young people in the outback Kimberley town of Broome, where the state's capital is over 2,000 kilometres away.\n\nNationally, about 20 per cent of domestic students starting university in 2024 had a regional or remote address, according to the federal Department of Education's latest statistics.\n\nBut in Western Australia, rural students make up only 12 per cent.\n\nStudying rurally\n\nA university in Broome and various federal government initiatives are attempting to reverse this educational inequity.\n\nThe University of Notre Dame's remote Broome campus will expand its course offerings from 2026 to include a Bachelor of Primary Education and a Bachelor of Commerce.\n\nJosephine Younan is studying her post-graduate Doctor of Medicine at Notre Dame's Broome campus. (ABC Kimberley: Ruby Littler)\n\nThese are in addition to the university's Doctor of Medicine post-graduate course, where Josephine Younan is a student.\n\n\"I want to study rurally to eventually work rurally, and so I figured, if I want to be a rural doctor, what better way to train for that than to do my whole degree up here?\" she said.\n\n\"Rural generalists up here, they're loved by the community, they're involved in the community, and then they work in the hospital, so that means when the patients see you, you're not a stranger.\"\n\nThe Notre Dame Broome campus attracts Perth students, who are training to be nurses and teachers for six to 10-week placements.\n\nThis sometimes attracts students to return to the region after graduation, filling much needed roles.\n\nStudent placements at Notre Dame's Broome campus can be up to 10 weeks, depending on the course. (ABC Kimberley: Ruby Littler)\n\nUniversity deputy head of education Patrick Hampton said from next year, aspiring teachers would be able to live and work locally while earning their Bachelor of Primary Education.\n\n\"It's a revelation for students at the schools here in Broome that they can actually study teaching whilst living in Broome,\" he said.\n\n\"It's new, it's unique … through the Reach Higher program, students don't have to come from Broome to Perth, and they'll be studying the same program we offer in Sydney and Fremantle.\"\n\nLearning closer to home\n\nThere are also 56 Regional University Study Hubs (RUSH) dotted across the country.\n\nThe government initiative, launched in 2018, was designed to expand access to tertiary education for regional and remote students.\n\nPilbara Kimberley University Centres chief executive Susan Grylls said she helped students with everything from enrolment and educational counselling to getting doctor's certifications.\n\nSusan Grylls says the community's interest in the centres has been incredible. (ABC Pilbara: Kelsey Reid)\n\n\"You can't do what you can't see,\" she said.\n\n\"There are aspiration challenges of young people … because they have a perception you must be a certain individual from a certain background to pursue certain pathways.\"\n\nMs Grylls said workforce shortages and challenges in the state's far north had been \"a crisis that had been going on for many years\".\n\n\"Our focus is very much on providing those people who know they love living in the remote Kimberley … with the opportunities to pursue higher education to take up those workplace roles we desperately need.\"\n\nMs Grylls, who oversees five university hubs across WA's north, is optimistic a sixth centre in Kununurra would get off the ground by the start of next year.\n\nThe Kununurra University Hub was announced in February 2025 as part of a federal plan to create 10 new Regional University Study Hubs, following recommendations from the Universities Accord Review.\n\nShe said the centres had a real impact and their popularity had been steadily increasing in areas with \"historically low\" tertiary education uptake.\n\n\"We're still a new idea, a new concept and we don't get the same funding as other, more established models,\" Ms Grylls said.\n\nNational targets\n\nA Department of Education spokesperson said the RUSH program had been \"successful in improving tertiary education participation\".\n\n\"As of the latest data collection, 5,270 students were being supported by a RUSH,\" they said.\n\n\"Of these, 12 per cent identified as First Nations and 44 per cent identified as [the] first in [the] family.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-10-14/asx-markets-business-live-news-14-oct/105887484",
        "title": "Live: Ansell reports unauthorised access to data in cyber incident",
        "publish_date": "Mon, 13 Oct 2025 21:01:06 +0000",
        "category": "finance",
        "authors": [
            "Gareth Hutchens",
            "Nassim Khadem",
            "Stephanie Chalmers"
        ],
        "text": "The minutes of last month's Reserve Bank monetary policy board meeting have just been published.\n\nThe board kept the cash rate target at 3.6%.\n\nIn the minutes, which you can read in the link below, board members said: \"Monetary policy was probably still a little restrictive but acknowledged the extent of restriction was difficult to determine.\"\n\nThey said financial conditions had eased recently with the reduction in the cash rate target in August, and the pick-up in housing price and credit growth over prior months was indicative of the easing in monetary policy earlier in the year having an impact.\n\nBut it may be some time before the full effect of that easing flows through the economy.\n\nIn the global economy, they said, risks remained heightened.\n\nHigher tariff rates imposed by the United States were now in effect for many economies, but there was still considerable uncertainty about their macroeconomic effects (given their scale and potential for further change as the United States continues negotiations with its three largest trading partners). On the upside, global trade had remained at a high level, in part reflecting significant shifts in global trade patterns in response to the higher tariffs. GDP growth in Australia’s trading partners had also remained resilient and stronger than expected in the June quarter. Economic activity in the United States had been surprisingly robust, though employment growth had slowed over preceding months and GDP growth was expected to slow as well. Members noted that the slowing in US employment growth could, at least in part, reflect changes in US immigration policy and measures to reduce the number of federal government employees. Higher tariffs were also contributing a little to US inflation.\n\nOn China, the board members noted that domestic demand had slowed by more than expected in July and August, but any material slowing in activity in China would probably prompt incremental fiscal stimulus from the authorities to support growth.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-10-14/music-exam-competition-manage-performance-anxiety/105873254",
        "title": "Do you have performance anxiety? Musicians share tips for keeping it manageable",
        "publish_date": "Mon, 13 Oct 2025 21:00:00 +0000",
        "category": "lifestyle",
        "authors": [],
        "text": "If you have budding musicians in your life, you know that preparing for exams or competitions can be stressful for the whole family.\n\nExams and competitions provide snapshots of how well musicians cope under pressure.\n\nBut more often than not, the process is riddled with expectations to do well, and a sense that this is a 'make-or-break' moment.\n\nGetting your kids to practise their musical instrument might be easier than you think Musicians share why kids need to practise, how to get them motivated and how to incorporate it into your family’s daily routine.\n\nThis added pressure might also lead some musicians to experience performance anxiety which can include emotional and physical symptoms like nervousness or dread, shaking, sweating, racing heart and feeling nauseous.\n\nSo, why do we put young musicians through exams and competitions in the first place?\n\n\"Exams are very useful to motivate kids to practise, and it puts some structure around their learning by giving them a goal to work towards,\" says Genevieve Lang, co-host of ABC Classic's Music Class and a professional harpist.\n\nThese are also great transferable life skills.\n\nBut is there a way to reduce the stress?\n\nWe ask a few experts to share practical tips for making these high-pressure situations as stress-free as possible.\n\nWhat do you get out of doing exams and competitions?\n\nPerformance exams might not be for everyone.\n\nLang says the people who most benefit from exams and competitions are those who are really motivated by results.\n\n\"They might be encouraged to continue to stretch themselves if they [do well],\" she says.\n\nMost people studying music will have to do an exam at some point in their journey. (Pixabay)\n\nAlthough competitions can be optional, most people studying music will encounter exams at some stage, either at school or university.\n\nMusicians can also choose to do graded exams from institutions outside of school. Some of the most common in Australia are the Australian Music Examination Board (AMEB), the Associated Board of the Royal Schools of Music (ABRSM) and the Suzuki method.\n\nThese grades range from beginner to advanced levels and provide qualifications that are well-regarded in the music community.\n\nDoing exams can also help broaden your repertoire through fulfilling the requirements of the exam syllabuses, Lang explains.\n\nWhat do examiners and judges want?\n\nIt's easy to assume that you need to be note-perfect to succeed in performance exams. But while there is a baseline expectation of technical proficiency, it isn't the sole focus.\n\nYour music questions answered Music Class is a weekly deep dive with Ed Le Brocq and Genevieve Lang into all things music, including musical terms, notation, theory and much more.\n\n\"Judges and examiners are looking for communication over perfection,\" says Tim Li, a Brisbane-based teacher and chamber music ensemble coach.\n\nAs a pianist, Li has played with many students during their music examinations.\n\nHe recently coached the IncrediBows string quartet, an ensemble which just won Musica Viva's national youth chamber music competition, Strike A Chord.\n\n\" It's very important to establish the right mentality, which is to make music. \"\n\nLi points out that sometimes, the harshest critic you face is yourself.\n\n\"When you communicate the ideas and the feelings with the music, it's very easy for the adjudicator to look past technical imperfections.\"\n\nIf you're a parent or caregiver, you can help young musicians by framing the performance as a positive experience at home and in the lead up to the big moment.\n\n\"Rather than saying, 'have you practised enough?' or 'don't make mistakes', you can say 'I love hearing you play' or 'I can see how hard you're working'.\"\n\nCreating doubts about whether you've practised enough, or focusing on not making mistakes, can backfire, according to Li.\n\n\" The more you focus on not making mistakes, you tend to start to make more mistakes. \"\n\nHow do you manage performance anxiety?\n\nPerformance anxiety can significantly impact someone's ability to play.\n\nKnowing how to manage it can be beneficial for musicians so they can achieve the best outcome.\n\n\"Anxiety is about focusing on what might go wrong in the future based on what has gone wrong in the past,\" says string musician and psychologist Anthea Cottee.\n\nPerformance anxiety can stop some people from enjoying playing the music when it matters. (Unsplash: Siniz Kim)\n\nWhen we get anxious, our body releases neurotransmitter hormones such as adrenaline and cortisol which can increase our heart rate as well as sweating and shaking. Not to mention the feeling of dread and fear of failure.\n\nThis, in turn, makes us less able to concentrate on the task at hand, namely performing to the audience, which includes judges or examiners.\n\nLi says sometimes it's useful to think about these high-pressure situations in terms of potentials and distractions.\n\n\"Your end result is your potential minus the distractions,\" he says.\n\nBut that's easier said than done for most people.\n\nThe main findings of the research of music performance anxiety centres around our perception of how acceptable we are to other people, according to Cottee.\n\nOne way to influence how our bodies cope with these high-pressure situations is by thinking about the situation like a challenge rather than a threat.\n\n\"It's really about being able to bring all your talent and resources as effectively to the moment when you need them,\" Cottee says.\n\n\" Use that fuel [of adrenalin and cortisol] to enhance your focus for your performance. \"\n\nThis is where preparing and practising, including having some psychological preparations, can really set you up for success.\n\nHow do you prepare to get the best outcome?\n\nLang says performing for an audience such as family and friends, or filming yourself and uploading the recording online can help to simulate high-stakes moments before the big day.\n\nShe regularly practises performing during the lead up to important concerts.\n\n\"If something goes wrong at any point in the performance, a memory slip or a finger slip, I have had a chance to practise in the moment with all the fight and flight response going on,\" Lang says.\n\nEven very young children can practise this skill by performing to soft toys, Li suggests.\n\nIn performance, you have to keep going even if you play some wrong notes. (Adobe Stock: Chalabala)\n\nIn performance, as opposed to regular practice, you need to keep going even if you play some wrong notes or make other errors.\n\nSo how do you move on when you can't stop to fix your mistakes?\n\nRather than blaming yourself or your kids, Cottee says we can practise to be kind and compassionate.\n\nIf you're criticising yourself, \"Ask if that's something you would say to a friend,\" says Cottee.\n\nThere's no way around the fact that you are being judged when doing exams or competitions. But shifting the focus to what you love about music could be more helpful than worrying about what the other person thinks.\n\n\" Think about how beautiful this piece of music is, how much you enjoy the feeling of playing, or how good it makes you feel. \"\n\nWhat happens if you actually fail?\n\nAlthough exams or competitions can feel like the most important performance of your life, according to all the experts we spoke with, it's not as career-defining as you might fear.\n\nEven if you or your kids fail the exam or don't win the competition, \"you probably learn a lot from the experience,\" Cottee says.\n\nLearning from failure can be a foundation for resilience, Cottee explains.\n\n\"We develop resilience through difficulty. There's actually no other way around it,\" Cottee says.\n\nBut as a parent, she acknowledges how difficult it is to let kids learn from hard experiences.\n\n\"Just getting up [on stage] and performing is a great experience to have,\" Li says, even if you don't get any prize.\n\n\" Learn from the process and you'll know how to do better next time. \"\n\nAlthough exams and competitions might help in building a music career, they're not the only path to success.\n\n\"A lot of countries don't have exam systems, and they produce very high-level musicians,\" Li says, but adds that you need to work with the system that's available.\n\n\"I didn't do exams on my harp, and the harp is my career,\" Lang says.\n\nGet the latest classical music stories direct to your inbox",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-10-14/alleged-environmental-law-breach-nt-beetaloo-basin-gas-company/105854186",
        "title": "NT government accused of 'turning a blind eye' to unlawful fracking allegations",
        "publish_date": "Mon, 13 Oct 2025 20:47:38 +0000",
        "category": "finance",
        "authors": [],
        "text": "A decision not to prosecute a Beetaloo Basin oil and gas company for an alleged breach of environmental laws sets a low standard for the Northern Territory's environmental protections, according to a legal expert in the field.\n\nImperial Oil and Gas was found to have breached its Environment Management Plan (EMP) by drilling in the Beetaloo Basin in 2022, according to a report approved by the Department of Lands, Planning and Environment (DLPE) in April this year.\n\nThe DLPE found the company drilled the fracking well — dubbed Carpentaria-3H — without constructing an underground barrier between two major aquifers below, as required by its EMP.\n\nImperial is a subsidiary of Empire Energy, which changed its name to Beetaloo Energy this year.\n\nThe Beetaloo Basin has attracted a number of companies looking to mine natural gas in the NT. (ABC News: Jane Bardon)\n\nThe ABC has seen documents released to anti-fracking group Lock the Gate, under Freedom of Information (FOI) laws, which state the DLPE elected not to prosecute the company — instead, the government department sent a letter \"intended [to] encourage behaviour change\".\n\nThat was despite the DLPE report claiming Imperial had a \"history of non-compliance\", \"uncertain\" risk of aquifer interaction, and an acknowledgement Empire may have benefited from the non-compliance.\n\nThe department said it asked Imperial to alter its EMP in 2021, to reflect the detection of an aquifer — called Anthony Lagoon — near another aquifer, called Gum Ridge, below the well site.\n\nBut Imperial declined the alter the plan, and told the department \"the aquifers will be isolated as already required by the EMP\".\n\nThe ABC has seen documents released to anti-fracking group Lock the Gate. (ABC News: Michael Donnelly)\n\nIn late 2022, after drilling at Carpentaria-3H had begun, the DLPE said it discovered \"Imperial had not isolated the Anthony Lagoon and Gum Ridge aquifers from each other\".\n\nThe DLPE said the Department of Mining and Energy (DME) \"took action to ensure it does not happen again\" and \"prosecution was considered disproportionate\" to the alleged offending.\n\n\"Prosecution was considered disproportionate to the actions taken by [the Department of Mining and Energy],\" the DLPE said in its report.\n\n\"The cost of remedial actions to comply with DME requirements is considered a sufficient deterrent.\"\n\nHowever, the environment department's report also noted \"any remedial actions could compromise\" the integrity of fracking wells in the NT.\n\nCompany denies wrongdoing\n\nIn a statement responding to the DLPE findings, Beetaloo Energy chief executive Alex Underwood said \"there was no incident\".\n\nHe said the report \"was not previously seen by the company\" and alleged it \"contains numerous inaccurate and misleading statements\".\n\nNT Mining and Energy Minister Gerard Maley agreed with the company's view.\n\nGerard Maley says Imperial did not breach the law. (ABC News: Pete Garnish)\n\n\"There was no incident or non-compliance at the Carpentaria-3H well, under the regulatory responsibilities administered by the DME,\" he said.\n\nImperial only needed to separate the aquifers if they were not already connected, according to the minister.\n\n\"Imperial had its own scientific evidence that indicated the Anthony Lagoon and Gum Ridge aquifers were in communication, plus publicly available scientific evidence from CSIRO publications on the area,\" Mr Maley said.\n\nHowever, a 2021 report from the DLPE's Water Resources Division said \"the evidence to date on the degree of connectivity between the two aquifers is inconclusive\".\n\nWhat happens if aquifers connect?\n\nA study looking to determine connectivity between aquifers in the eastern Beetaloo Sub-Basin — including Anthony Lagoon and Gum Ridge — is underway, with the CSIRO due to deliver its findings next year.\n\nPete Callender from Lock the Gate said it was incredibly important for any aquifers to remain separate if they were not already connected.\n\nPete Callender says Lock the Gate is worried about the potential for groundwater wells to be linked due to fracking activity. (Supplied: Frack Free NT)\n\n\"Some of our aquifers are for example hypersaline, some contain heavy metals, toxins,\" he said.\n\n\" If they were to be connected to a freshwater aquifer, then that material could get in. \"\n\nIn its report earlier this year, the DLPE said \"consequences from aquifer connectivity and interaction are uncertain\".\n\nElaine Johnson, director of environmental law firm Johnson Legal, said if the DLPE was correct in its finding that Imperial breached its EMP, the company had broken the law.\n\n\"It's a legal requirement to comply with the terms of the Environment Management Plan,\" she said.\n\nClaims company let 'off the hook'\n\nNT Lands, Planning and Environment Minister Josh Burgoyne said the allegations raised in his department's report had been \"dealt with\" by the previous Labor government, before the Country Liberal Party was elected late last year.\n\nJosh Burgoyne says Imperial was dealt with by the DME. (ABC News: Hamish Harty)\n\n\"Our department is now working to ensure that anything that happens now, and into the future, is obviously dealt with and all the processes are followed,\" he said.\n\nBut Ms Johnson said the NT's environmental laws were weakened by successive governments choosing not to enforce them.\n\n\"It's essentially letting the company off the hook, so that when it goes to apply for a new licence or approval, its past non-compliance behaviour is not taken into account,\" she said.\n\n\"What that means is we set up an expectation with industry, that the requirements and rules to ensure environmental protections are not really going to be enforced — and in fact, we'll turn a blind eye when you come back to us for a new approval.\"\n\nElaine Johnson says without proper enforcement, NT environmental protections could be weakened. (Supplied: Johnson Legal)\n\nIn January, Beetaloo Energy disclosed a spill of contaminated water at its Carpentaria-1 well, and last year it was investigated by the federal government for alleged misuse of a research grant.\n\nBut regarding the allegations concerning aquifer separation below Carpentaria-3H, the company's chief executive maintained drilling at the site had caused \"no environmental harm or impact\".\n\n\"Beetaloo Energy has demonstrated our commitment to sustainable operations, transparency and accountability in the 12 years we have been active in the Beetaloo Basin,\" Mr Underwood said.",
        "source": "ABC"
    },
    {
        "url": "https://www.smh.com.au/sport/afl/afl-trade-period-live-updates-swans-ramp-up-the-chase-for-curnow-as-star-hits-sydney-20251013-p5n284.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "AFL trade period LIVE updates: Hawks ‘must part with one of their stars’ for Merrett; Stewart opens up on finals concussion",
        "publish_date": "Tue, 14 Oct 2025 12:55:12 +1100",
        "category": "sports",
        "authors": [
            "Scott Spits",
            "Melissa Coulter Ryan"
        ],
        "text": "Collingwood have bolstered their hand in this year’s draft in a trade with Brisbane as they prepare to match a bid on next-generation academy prospect Zac McCarthy.\n\nThe Magpies sent pick 59 this year and a 2026 third-round selection (via Melbourne, which they secured in the Brody Mihocek deal) to the Lions for picks 45 and 56.\n\nThe Demons’ pick gives the Lions a greater spread of selections across the next two drafts, given they already have enough draft points to match a bid on star academy midfielder Daniel Annable, who is set to be a top-five pick in the 2025 draft.\n\nThe deal is unrelated to any potential deal for Callum Ah Chee, with Brisbane still hoping to snaffle pick 16 off Adelaide, who are only willing to offload a future second-rounder for the dual premiership-winning forward.\n\nThe extra picks should also help Collingwood secure key forward Jack Buller from Sydney.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/culture/tv-and-radio/is-colin-hanks-portrait-of-this-80s-movie-star-a-little-too-sweet-to-believe-20251013-p5n25h.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Is Colin Hanks’ portrait of this ’80s movie star a little too sweet to believe?",
        "publish_date": "Tue, 14 Oct 2025 12:49:24 +1100",
        "category": "entertainment",
        "authors": [
            "Karl Quinn"
        ],
        "text": "That makes it enormously watchable and rich in feeling (and, to a degree, anecdote). But it also pushes it right to the brink of hagiography.\n\nSteve Martin, Martin Short, Eugene Levy, Catherine O’Hara, Bill Murray, Dan Aykroyd, Macaulay Culkin, Conan O’Brien – even the director’s father, a certain Tom Hanks – all speak in the most glowing terms of a man they considered a friend, a colleague of incredible talent and generosity, and a performer who combined comedic delivery and genuine acting chops to brilliant effect.\n\nThe great strength, and perhaps also the greatest weakness, of this documentary is the depth of talent director Colin Hanks has assembled to share memories of the late Canadian actor John Candy, one of the biggest screen comedy stars of the 1980s.\n\nNo one, it seems, has a bad word to say about Candy, who died of a heart attack in 1994, aged 43. Thankfully, there are glimpses of the man himself shining at least a little light into the darker corners of his soul, his psyche and his self-image.\n\nThe picture that emerges on that score is of a (sometimes) sad clown who never quite overcame the trauma of losing his father (also of a heart attack, at age 35) on his fifth birthday. A man who carried an unshakeable – and, as it happened, well-founded – fear that he, too, was marked for an early end.\n\nWith Steve Martin in Planes, Trains and Automobiles (1987).\n\nCandy was troubled, too, by intense self-consciousness about his size. He was reasonably tall, at 188 centimetres, and for most of his life very heavy, but by the end, he was massive. His widow, Rose, recalls buying clothes for him and having to upscale from “double X to triple X to 5X” in size. “It wasn’t easy,” she says.\n\nSon Chris reflects on his father’s prodigious intake – of food, alcohol, cigarettes – as a symptom of, and means of coping with, deep-seated issues. “If you go a whole lifetime eating your feelings, drinking your feelings, smoking your nerves, it shows up, in one way or another,” he observes. “It’s an alarm system, and it’s saying, ‘Hey, there is something wrong here’.”",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/money/super-and-retirement/labor-fixed-its-super-tax-but-one-glaring-problem-still-remains-20251014-p5n2dl.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Labor fixed its super tax, but one glaring problem still remains",
        "publish_date": "Tue, 14 Oct 2025 12:46:39 +1100",
        "category": "finance",
        "authors": [
            "Noel Whittaker"
        ],
        "text": "Two years ago, Treasurer Jim Chalmers unveiled what quickly became the most controversial proposal in the history of superannuation – a new tax on members whose balances exceeded $3 million.\n\nThe plan was for a 15 per cent tax to be levied on the increase in a member’s total super balance from July 1, 2025 to June 30, 2026, after adjusting for contributions and withdrawals.\n\nTreasurer Jim Chalmers is hoping the new superannuation taxes will help bolster the budget. Credit: Alex Ellinghausen\n\nThe problem was that the calculation was to include unrealised gains – paper increases in the value of assets that hadn’t actually been sold or turned into cash. In other words, people could have been taxed on profits that didn’t exist.\n\nTo make matters worse, the $3 million threshold was not going to be indexed, meaning that over time, as inflation pushed up super balances, more and more Australians would have been dragged into the net.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/afl/strong-appetite-to-return-to-coaching-buckley-joins-chris-scott-at-geelong-20251014-p5n2e2.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘Strong appetite to return to coaching’: Buckley joins Chris Scott at Geelong",
        "publish_date": "Tue, 14 Oct 2025 12:44:14 +1100",
        "category": "sports",
        "authors": [
            "Jon Pierik"
        ],
        "text": "AFL great Nathan Buckley will return to coaching next season – at Geelong.\n\nThe club confirmed on Tuesday that Buckley will be a full-time assistant to Chris Scott next season.\n\nBack on the tools: Nathan Buckley after his last match as Magpies’ coach in 2021. Credit: Getty Images\n\nThe Cats’ general manager of football Andrew Mackie said Buckley, 53, would be an invaluable addition to the club.\n\n“We are excited to add Nathan to our club and, more specifically, to our coaching group. He is respected and highly regarded across the football industry and brings a wealth of experience and a fresh perspective,” Mackie said.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/western-australia/wa-news-live-perth-schools-riddled-with-defects-opposition-claims-20251013-p5n28z.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "WA news LIVE: Perth schools riddled with defects, opposition claims",
        "publish_date": "Tue, 14 Oct 2025 12:40:37 +1100",
        "category": "finance",
        "authors": [],
        "text": "An assessment of WA public schools has revealed more than 10,000 maintenance defects including cracked walls, crumbling ceilings and asbestos.\n\nThe audit, looking at conditions at the state’s 834 public schools, was tabled in parliament recently.\n\nEsperance Senior High School recorded the most defects – 121.\n\nManjimup Senior High School recorded 87, Kent Street Senior High School recorded 86, Shenton College 85 and Singleton Primary School 79.\n\nShadow Education Minister Liam Staltari said the report laid bare the state of disrepair and neglect many students and teachers were working in.\n\nHe said the government should be “ashamed” of the conditions.\n\n“This reality must be compounding teacher stress and the sense of disrespect that we know is driving record resignations,” Staltari said.\n\n“This report is a long-overdue wake-up call. No one should have to work and learn in these conditions and the Government needs to sit up and listen.”\n\nEducation Minister Sabine Winton said the worst of the defects had already been rectified by the time the findings from the audit had been published.\n\n“Since coming to government, we’ve made it a priority to fix a significant backlog of maintenance issues at our public schools caused by years of neglect under the previous Liberal-National Government,” she told the West Australian.\n\n“A well-maintained school supports not just learning, but also pride and belonging among students, staff and their communities.”",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/racing/world-s-top-jockey-locked-in-for-everest-ride-on-waller-trained-star-20251014-p5n2dh.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "World’s top jockey locked in for Everest ride on Waller-trained star",
        "publish_date": "Tue, 14 Oct 2025 12:38:07 +1100",
        "category": "sports",
        "authors": [
            "Craig Kerry"
        ],
        "text": "Premier jockey James McDonald will ride Joliestar in the $20 million The Everest (1200m) on Saturday at Randwick as he bids for his second win in the richest race on turf.\n\nMcDonald, No.1 on the world jockey rankings, had been in line to ride either Joliestar or another Chris Waller-trained mare, Lady Shenandoah, in the race.\n\nJoliestar and James McDonald cruise to victory in the Shorts at Randwick. Credit: Getty Images\n\nWaller stable representative Darren Beadman said on Saturday that the decision would be made via consultation between McDonald, Waller and Victorian jockey Damian Lane, who will now ride Lady Shenandoah.\n\nMcDonald, who won the 2021 Everest on the Waller-trained Nature Strip, has a strong association with both stars but was locked in for Joliestar on Tuesday ahead of tonight’s barrier draw reveal.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/business/markets/which-tariffs-china-finds-new-markets-to-defy-trump-s-trade-war-20251014-p5n2ag.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Which tariffs? China finds new markets to defy Trump’s trade war",
        "publish_date": "Tue, 14 Oct 2025 12:11:34 +1100",
        "category": "finance",
        "authors": [
            "Stephen Bartholomeusz"
        ],
        "text": "The September data showed that even as exports to the US slumped, those to the European Union rose 14.2 per cent. Exports to South-East Asian economies were up 15.6 per cent, while to Latin America they climbed 15.2 per cent and to Africa (off a modest base) they surged 56 per cent. China’s exports have been re-routed, demonstrating that Trump’s thesis that China’s export-oriented economy made it over-dependent on the US market was flawed. In 2018, when the first of Trump’s tariffs on China were imposed, exports to the US accounted for about 3.5 per cent of China’s GDP. Last year, that percentage was 2.8 per cent. It will be significantly lower this year. Trump’s tariffs can damage, and are damaging, China’s economy, but the country’s exposure and vulnerability to them is reducing rapidly. Now, America - while still an important destination for Chinese goods - is part of a far more diversified global market for Chinese companies, one fortified by massive investments by China in economies other than the US that are also gradually shifting their geopolitical relationships away from America. Trump’s tariffs on everyone are aiding that process.\n\nWhile there are some signs of pushback against the flood of cheap exports from China in Europe, Latin America and even Africa, there’s nothing occurring of the scale and breadth of the US tariff regime to stem them. Very few of those economies dealing with the Trump tariffs would want to open a new front by initiating a trade war with China. Loading What Trump may have underestimated was the rest of the world’s – and America’s – reliance on China’s cheap goods and China’s dominance of key industrial technologies and their supply chains. There are no instantly available and competitively priced substitutes for many of its key exports. There’s also no market for some of America’s agricultural products bigger than China. It was notable that China’s imports of soybeans in September were up 4.8 per cent to 12.9 million tonnes. American farmers are now harvesting a near-record crop, none of which has been pre-purchased by China, which now sources most of its soybeans from South America.\n\nLast week’s significant tightening of export restrictions on rare earths, magnets and batteries, which caused Trump to threaten China with a 100 percentage point hike in the tariff rate, also highlighted China’s own leverage in the trade stoush, and how it is amplified by US financial markets, which went into a meltdown on Friday and would’ve played a role in Trump’s backing away from his initial aggressive response. Trump used to boast that trade wars were good and easy to win. Experience of the Trump tariffs says that they aren’t good for anyone, and no one wins. The September trade data showed that China’s exports of rare earths were down 31 per cent from August and were about half the volumes China was exporting mid-year. It would appear that China had started squeezing the market for rare earths, a market it absolutely dominates, even before the announcement of the new export restrictions. Wall Street recovered some of their losses on Monday after Trump adopted a far more conciliatory tone. The growth in China’s exports shows how dynamic its companies are.\n\nSome of that growth will reflect an arbitraging of tariff rates, with goods being trans-shipped to their eventual destination, America, but there’s also an organic appetite for cheap Chinese goods in the developing economies that China has been building relationships with for years through its Belt and Road initiative. The growth is coming at a cost, with export volumes significantly higher than their value. China’s companies are operating in sectors with substantial excess capacity and fighting torrid price wars in their domestic markets. They have slashed export prices to absorb that excess capacity, which has caused increased tension with China’s non-US trade partners even as their profits have kept falling. It’s also led to deflation and weaker growth in an economy that has never fully recovered from a downturn in its property market that is now in its fifth year, although a 7.4 per cent rise in China’s imports in September, to $US238.1 billion, could suggest the domestic economy is faring a little better than most forecasters have predicted. Beijing has responded with a campaign against what it calls “involution,” or excess capacity and continuing cycles of price competition, which should see some consolidation of industries and some companies exiting markets.\n\nChina’s broader economic data for September is due to be released next week, which will provide a better insight into the toll the trade war and China’s domestic settings are taking on an economy which is over-exposed to trade. Loading Also next week, the most important meeting of China’s leaders for the year – the “Fourth Plenum” – will start, with hundreds of the country’s senior officials reviewing the government’s next five-year plan for the economy and society. To date, Beijing has resisted any large-scale effort to stimulate the domestic economy to dilute its reliance on exports - but there will be significant interest from external observers in whether there are plans to boost consumption over the remainder of this decade, and whether there will be more done to address the structural imbalances and the degree of unproductive capital within the economy. Trump used to boast that trade wars were good and easy to win. Experience of the Trump tariffs says that they aren’t good for anyone, and no one wins.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/queensland/flower-petals-and-half-days-off-the-prizes-given-to-worksafe-staff-for-closing-claims-20251002-p5mzit.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Flower petals and half-days off: The prizes given to WorkCover staff for closing claims",
        "publish_date": "Tue, 14 Oct 2025 12:06:25 +1100",
        "category": "finance",
        "authors": [
            "Cameron Atfield"
        ],
        "text": "WorkCover Queensland caseworkers have come under extreme pressure to finalise workers’ compensation claims, being pitted against colleagues to earn “flower petals” for each closed claim to win prizes.\n\nInternal documents, seen by this masthead, show competition between co-workers being encouraged, with team incentives including half-days off and team lunches being offered.\n\n“It’s certainly been heating up on the floor! Loving the healthy competition amongst you all,” a senior manager said in an email to staff.\n\nThe “handy visual” for caseworking teams.\n\n“This week as a segment we have already finalised 94 claims with two working days left in the week to go. If you haven’t noticed already, we have a handy visual on the wall near the lifts showing our progress each week towards our monthly stretch target for BP [business partnerships]. We are well over halfway there!”",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/soccer/rat-stops-play-in-world-cup-qualifier-20251014-p5n2eb.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Rat stops play in World Cup qualifier",
        "publish_date": "Tue, 14 Oct 2025 12:04:50 +1100",
        "category": "sports",
        "authors": [],
        "text": "Rat stops play in World Cup qualifier\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/culture/tv-and-radio/sam-pang-is-charming-and-personable-but-one-topic-is-off-limits-20251013-p5n22r.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Sam Pang is charming and personable, but one topic is off-limits",
        "publish_date": "Tue, 14 Oct 2025 12:01:41 +1100",
        "category": "finance",
        "authors": [
            "Louise Rugendyke"
        ],
        "text": "Save Log in , register or subscribe to save articles for later. Save articles for later Add articles to your saved list and come back to them any time. Got it Normal text size Larger text size Very large text size Try the calamari, Sam,” calls out the woman as she leaves the back dining area at the Napier Hotel. “I’m really boring, I have it all the time, I don’t even look at the menu.” “That’s good enough for me. Thank you!” replies Sam Pang. It’s a Friday lunchtime and the 51-year-old comedian and TV host is sitting in the back dining area of the old-school corner pub in Melbourne’s inner-city suburb of Fitzroy. He is just days away from launching season two of his chat show Sam Pang Tonight and is still a bit twitchy after a few days of heavy press. He has a reputation for not liking interviews, something, he says, was purely a product of him always playing second or third fiddle on panel shows. With Sam Pang Tonight, however, and his Logie hosting duties, he has been prised into the open. Still, the interview comes with a caveat – no personal questions – but he will happily talk about his work. He is great company – charming, personable and generously laughing at my terrible jokes – but sees no point in talking about himself. Loading “I don’t like talking about myself,” he says. “Some people, by the way, love talking about themselves. You know, they love it. But this show, it seems when your name’s in the title – and I’m so grateful, and I’m proud to be able to have my own show – I’m happy to try to do some publicity, or get the word out there.” He winces when I mention I spotted him that day on the cover of TV Week (headline: “I’m very grateful”) and admits that, yes, he gets recognised regularly. Is he a celebrity?\n\nAdvertisement\n\n“No,” he says. “I’m comfortable with being a comedian. I’m happy with that.” So there’s no tell-all book coming, the usual celebrity memoir caper? “That sounds like too much work.” His good friend Kitty Flanagan has written a book … “But she’s a supremely talented woman who can do anything, and I’m concentrating so hard on doing just one thing,” he says. “She can do that because she’s already a triple threat. I’m not that.” Sam Pang’s order: salt and pepper squid with togarashi mayo, bean sprout, spring onion salad and burnt lime. Pang chose the Napier because “because pub meals are a bit hit and miss – I don’t usually go for the food – but this is good, I can back this menu in.” He adds a side of chips to his plate of salt and pepper squid with togarashi mayo, spring onion salad and burnt lime, while I go for the enormous crispy fish burger with salad and fries (it’s delicious, but it’s also the most awkward food you can eat while interviewing someone). For drinks, it’s a large soda water with lime for both of us.\n\nAdvertisement\n\nHe won’t say if the pub, which featured in the ABC TV series Jack Irish, is his local – although staff member farewells him by name when we leave – but he did attend primary school nearby, in Clifton Hill. He won’t give away much about his family: I try to sidle in by talking about my young daughter, knowing he also has a daughter, and for a moment, it looks like he’s going to say something before he decides not to. Same story when I ask about his parents. Do they watch his show, are they proud? “I’m not a doctor, so you know…,” he jokes. What he does confirm, however, is that he is related to Lorrae Desmond, aka Shirley from A Country Practice aka Australian TV royalty. When I read that, I honestly thought it was made up. She is his mum’s cousin – although his mum had never met her – and Pang arranged to present with Desmond at the Logies in 2017. The enormous crispy fish burger with salad and chips. Credit: Luis Enrique Ascui “We grew up hearing about this mythical figure,” says Pang. “She was on A Country Practice, and she won a Gold Logie and had her own show … the Logies asked if I wanted to present with Ed or Tom [his Have You Been Paying Attention co-stars] but I said I’ll present at the Logies if I can do it with Lorrae Desmond, which was an odd request. “And they found her. She was living in Bowral [she died in 2021]. She hadn’t been on telly for ages. And it was a special moment. There’s a lot of love in the room for it. And I remember – it’s the only time I met [Mushroom Records boss] Michael Gudinski – he came up and said, ‘Well done. Well done on celebrating and getting her here tonight, so that people can pay tribute to her.’ It was like, you know, I can do nice things … I think I made mum proud.” Lorrae Desmond as Shirley in A Country Practice. While Pang may see no point in talking about himself, he is one of our most in-demand small-screen personalities, who manages to work simultaneously across two commercial networks (on Have You Been Paying Attention and Sam Tonight on Ten and the Logies and The Front Bar on Seven). He has also logged several stints at SBS, co-hosting Eurovision for eight years with Julia Zemiro, as well as two seasons of the FIFA World Cup show Santo, Sam and Ed’s Cup Fever! and one year of the short-lived quiz show ADbc.\n\nAdvertisement\n\nThat’s a lot of TV. This year alone, he’ll have been on our screens for, say, about 40 out of the 52 weeks in a year. “This will be as – what’s the word? – combative as I get,” he says. “If you add up the hours, what is it, about 90 [hours across the year]. So if you, say, hosted a nightly news program or a breakfast television show, they’re on five days a week, for three and a half hours a day. “I don’t feel like I’m on that much … but for the next eight weeks, you’ve got me for eight hours, OK? My work ethic is ridiculously overblown. There’s the illusion of busyness.” Sam Pang is one of the rare small-screen personalities who is working across multiple networks. Rosie O’Donnell and Sam Pang in epsiode one of season two of Sam Pang Tonight. And yes, they got a new chair for the guests. His chat show returned for its second season on Monday night this week. The first season, which debuted in March for an eight-week run, was the first time Pang had gone solo since ADbc in 2009. It was a rough ride, with ratings diving after the first episode premiered to mixed reviews, while viewers had opinions on everything from the choice of guests to the cheap-looking set (in particular, he desperately needed a new guest chair). Pang, however, says he was not bothered by the feedback. Or the ratings, which started at about 799,000 (for comparison, on that same night, Married At First Sight on Nine held 2.43 million viewers captive), but then dropped away before a small recovery at the end.\n\nAdvertisement\n\n“If the trend of the viewers had kept on going – I think someone described it as a J curve or something like that – I didn’t look at the ratings, but there’s other people that do. I just feel like there’s nothing that I can control less. On Monday night, we’ll do the show and, hopefully, enough people watch that the network says you’re on again next week. That’s all. Loading “I was on Have You Been Paying Attention and The Front Bar when no one watched them. And I thought, when I did them at the time, that we had a good time shooting them and then the idea that [the ratings the] next day would affect the enjoyment or satisfaction [I had] of the night before, you know, that’s not a good model. But there’s commercial realities, and if it just started off at this number and it went down, I understand you don’t survive.” The thing is, Pang is a survivor. His rise from working in a bottle shop in his 20s, after several false starts at university, to manning the phones for Melbourne community radio station 3CR and then a spot on Triple R’s breakfast show to, eventually, TV and commercial radio is well known. It’s a rare path to tread, especially when you don’t have connections, apart from a neighbour who was a Triple J producer who suggested community radio. “It wasn’t paid, I was a volunteer,” he says of his start on 3CR. “It was like I was in a radio station. That’s cool.” He first words on air, as a fill-in host for the Marngrook Footy Show, were “Hello, welcome to the Marngrook Footy Show, I’m Sam Pang, and I’m not Indigenous.” The bill After that, it was just one step after another, no great light bulb moment, no great magical career plan. He won’t say if he’s signed on for the Logies again next year – although it’s hard to imagine Seven won’t have him back, as this year’s broadcast was its highest rating since 2012, with an average national audience of 1.43 million.\n\nAdvertisement",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/good-food-guide-restaurant-of-the-year-corner-75-20251013-p5n23q.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Good Food Guide Restaurant of the Year: Corner 75",
        "publish_date": "Tue, 14 Oct 2025 12:01:07 +1100",
        "category": "finance",
        "authors": [],
        "text": "Good Food Guide Restaurant of the Year: Corner 75\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/good-food-guide-young-chef-of-the-year-jen-kwok-lee-20251013-p5n23v.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Good Food Guide Young Chef of the Year: Jen Kwok Lee",
        "publish_date": "Tue, 14 Oct 2025 12:01:07 +1100",
        "category": "finance",
        "authors": [],
        "text": "Good Food Guide Young Chef of the Year: Jen Kwok Lee\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/good-food-guide-bill-granger-trailblazer-sharon-winsor-20251013-p5n23z.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Good Food Guide Bill Granger Trailblazer: Sharon Winsor",
        "publish_date": "Tue, 14 Oct 2025 12:01:07 +1100",
        "category": "finance",
        "authors": [],
        "text": "Good Food Guide Bill Granger Trailblazer: Sharon Winsor\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/world/middle-east/israeli-hostages-david-and-ariel-cunio-are-reunited-with-loved-ones-20251014-p5n2bz.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Israeli hostages David and Ariel Cunio are reunited with loved ones",
        "publish_date": "Tue, 14 Oct 2025 12:01:07 +1100",
        "category": "finance",
        "authors": [],
        "text": "Israeli hostages David and Ariel Cunio are reunited with loved ones\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/business/companies/kyle-and-jackie-o-back-losing-listeners-as-abc-picks-up-market-share-20251014-p5n2b1.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Kyle and Jackie O back losing listeners as ABC picks up market share",
        "publish_date": "Tue, 14 Oct 2025 12:00:57 +1100",
        "category": "finance",
        "authors": [
            "Calum Jaspan"
        ],
        "text": "The progress Kyle Sandilands and Jackie ‘O’ Henderson made in Melbourne has stalled, with the radio duo losing more listeners in the city, at a time the media regulator prepares sanctions on KIIS Network’s owner for failing to rein in their stars.\n\nThe Kyle and Jackie O Show, which this month picked up seven new breaches of broadcasting decency codes, surrendered 0.1 of a percentage point in Melbourne, according to the latest radio ratings.\n\nKyle Sandilands and Jackie ‘O’ Henderson have had their ratings slip as they await the media regulator to announce penalties for their station’s owner.\n\nThe show has shown recent signs of life after a horror first year in Melbourne, growing its share in the two previous ratings survey, but now landing on a 6 per cent share. It fell back to eighth place in the market in the all-important breakfast slot. The set survey timeslots do not always completely line up with the run time of different shows.\n\nDespite the recent gains, The Kyle and Jackie O Show finds itself largely with the same audience size compared to the same survey one year ago, with 427,000 Melbourne listeners across the survey period, which spanned July 20 to September 27. In the corresponding survey in 2024, there were 420,000 cumulative listeners.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/cricket/nsw-cricketer-reported-for-alleged-lewd-wicket-celebration-20251014-p5n2at.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "NSW cricketer reported for alleged lewd wicket celebration",
        "publish_date": "Tue, 14 Oct 2025 12:00:00 +1100",
        "category": "sports",
        "authors": [
            "Tom Decent"
        ],
        "text": "NSW Blues player Joel Davies has been reported for allegedly making a lewd gesture during a premier cricket match on the weekend.\n\nCricket NSW confirmed Davies, a full contracted male player, has been reported for an incident during a first-grade match on Sunday between Manly and Sydney University.\n\nAfter taking a wicket, Davies celebrated by thrusting his hips in the direction of a Sydney University batsman.\n\nThe incident was not reported by on-field umpires. Davies has been reported under Cricket NSW’s code of conduct but, so far, has not been charged.",
        "source": "SMH"
    },
    {
        "url": "https://www.sbs.com.au/news/article/concern-over-prime-ministers-phone-being-leaked/rrh4ae0o5",
        "title": "'Concern' over prime minister and Opposition leader's phone numbers being leaked",
        "publish_date": "Tue, 14 Oct 2025 00:55:02 +0000",
        "category": "finance",
        "authors": [],
        "text": "Authorities are investigating a \"concerning\" data leak that has resulted in the public release of dozens of high-profile phone numbers, including Prime Minister Anthony Albanese and Opposition leader Sussan Ley.\n\n\n\n\n\nThe information was allegedly obtained by a third-party data site using artificial intelligence to scrape sites, including social media profiles, for user details. It is then collated to create a digital phonebook.\n\n\n\n\n\nActing Prime Minister Richard Marles said the government was aware of the breach.\n\n\n\n\n\n\"We've notified authorities, and that is being worked through. But obviously, there is concern,\" he told reporters on Tuesday morning.\n\n\n\nActing Prime Minister Richard Marles said authorities are looking into the breach. Source: AAP / James Ross Initial reporting by Australian website Ette Media claimed both major party leaders' details, as well as those of Marles and former prime minister Scott Morrison, were \"scraped\" by the US-based site from professional networking platforms including LinkedIn.\n\n\n\n\n\nIt prompted Ley's office to request that LinkedIn \"remove the information\" from the Opposition leader's profile.\n\n\n\n\n\n\"This is obviously concerning, and we have reached out to LinkedIn to understand what occurred here. We are waiting for their response,\" an Opposition spokesperson said.\n\n\n\n\n\nLinkedIn told SBS News that the third-party use of personal data is prohibited, with the platform having several measures in place to protect users.\n\n\n\n\"In addition to the technology and teams we've long had in place to stop unauthorised data scraping, we continue to invest in new defences and take legal action when necessary, to detect and prevent our members' information being used without their consent,\" a LinkedIn spokesperson said in a statement.\n\n\n\n\n\nThe security breach follows new data from the Australian Signals Directorate (ASD), which shows 42 per cent of cyber incidents last year were the result of stolen credentials.\n\n\n\n\n\nThe agency responsible for detecting and disrupting malicious cyber threats released its annual report on Tuesday, revealing a rise of 11 per cent in cyber incidents.\n\n\n\nASD director-general Abigail Bradshaw said the way cyber criminals and state actors are gaining access to organisations, critical infrastructure, and businesses is changing.\n\n\n\n\n\n\"Networks are increasingly not being hacked, but are being breached through compromised or stolen credentials to gain unauthorised access,\" she said.\n\n\n\n\n\nIn almost half of the incidents impacting large organisations, access was gained using real usernames and passwords, often stolen or bought by cyber criminals on the dark web.\n\n\n\n\n\nGiven that the access is genuine, instead of a hack, it is harder to track.\n\n\n\n\n\nASD urged Australians to opt out of using passwords and replace them with multi-factor authentication, among a series of other measures , to keep their families' data safe.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/cape-verde-historic-world-cup-qualification/kyjoflpjv",
        "title": "'I don't have words': Cape Verde erupts in celebration after historic World Cup qualification",
        "publish_date": "Tue, 14 Oct 2025 00:39:48 +0000",
        "category": "sports",
        "authors": [],
        "text": "A carnival-like atmosphere erupted in the streets of Cape Verde's capital Praia on Tuesday AEDT after the tiny archipelago nation qualified for the first time ever for the World Cup.\n\n\n\n\n\nAmid honking horns and street fireworks, euphoric fans poured out of the Cape Verde National Stadium following the 3-0 victory over Eswatini, which secured the Blue Sharks a place in the 2026 finals, to be held in the United States, Canada and Mexico.\n\n\n\n\n\nIn the streets, people danced to the sound of reggae tunes and local funaná music.\n\n\n\n\n\nIt was \"an incredible moment\", 37-year-old fan Jorge Junior Livramento told Agence France-Presse not far from the stadium.\n\n\n\n\n\n\"I don't have words. I was at the stadium and I supported our team unconditionally,\" he said.\n\n\n\nCape Verde clinched their qualification for the 2026 World Cup after beating Eswatini. Source: AP / Cristiano Barbosa Cape Verde, located off the coast of Senegal, is the country with the smallest population to represent Africa in the global showpiece, with just 550,000 inhabitants.\n\n\n\n\n\nIt becomes the second-least populous nation to reach the World Cup, after Iceland, with just over 350,000, at Russia 2018.\n\n\n\n\n\n\"I shouted a lot during the match and now my voice is bad, but I am happy,\" Praia resident Jose Vieira said after the victory, which he watched live in the stadium.\n\n\n\n\n\nThe celebrations were expected to continue into the night with a concert at Praia's municipal stadium featuring local artists such as Djodje and Soraia Ramos.\n\n\n\nFootball fans celebrated in the streets after Cape Verde qualified for the FIFA World Cup for the first time. Source: AFP / Queila Fernandes Blue Sharks coach Pedro 'Bubista' Brito told the press, \"giving this happiness to these people is enormous\", adding that \"it's a victory for all the Cape Verdean people\".\n\n\n\n\n\nCape Verde won Group D with 23 points, four more than Cameroon, who hold the African record for World Cup appearances with eight. Cameroon drew 0-0 with Angola in Yaounde.\n\n\n\n\n\nAn archipelago of 10 islands in the Atlantic Ocean, Cape Verde gained independence from Portugal in 1975 and first attempted to reach the 2002 World Cup in Japan and South Korea.\n\n\n\n\n\n\"It's a special moment in this celebration of the 50th anniversary of our independence,\" Bubista said.\n\n\n\n\n\n\"It's a victory for all the Cape Verdean people and, above all, a victory for those who fought for our independence.\"\n\n\n\nCape Verde is the country with the smallest population to represent Africa in the global football showpiece, with just 550,000 inhabitants. Source: AFP / Queila Fernandes An emotional Vozinha, the 39-year-old goalkeeper, admitted: \"I have been dreaming of this moment since I was a child. It's time to celebrate.\"\n\n\n\n\n\n\"We knew we could do better (in the second half), and that's it ... it's time to celebrate,\" he said.\n\n\n\n\n\n\"It's too emotional. I embrace all the Cape Verdean people, at home and in our great diaspora,\" said scorer Stopira.\n\n\n\n\n\nCaptain and striker Ryan Mendes said: \"Honestly, I don't have the words to describe this moment. I'm very, very happy.\"\n\n\n\nCape Verde's Stopira (bottom) celebrates with his teammate after defeating Eswatini. Source: AP / Cristiano Barbosa The team reached the Africa Cup of Nations quarter-finals on their debut in 2013 and again in 2023, and are currently ranked 70th in the world.\n\n\n\n\n\n\"It's time to celebrate,\" 39-year-old goalkeeper Vozinha told the press, saying he had \"been dreaming of this moment since I was a child\".\n\n\n\n\n\nAlgeria, Egypt, Morocco, Tunisia, Ghana and Cape Verde have now won groups and filled six of the nine places automatically reserved for Africa at the 2026 World Cup.\n\n\n\n\n\nFan Jose Jorge Borges, a 60-year-old journalist, said it was a very memorable moment for Cape Verdeans.\n\n\n\n\n\n\"The emotions are visible and difficult to describe.\"\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/freed-israeli-hostages-hug-loved-ones-in-tears-of-joy/jxif449lm",
        "title": "In pictures: Freed Israeli hostages hug loved ones in tears of joy",
        "publish_date": "Mon, 13 Oct 2025 20:39:56 +0000",
        "category": "sports",
        "authors": [],
        "text": "Freed Israeli hostages and their family and friends bounded into one another's arms on Monday, beaming and crying with joy at the end of the captives' two-year ordeal in Gaza.\n\n\n\n\n\nWrapped in blue and white Israeli flags, those returning waved and smiled as military helicopters landed them back in Israel after militants freed the remaining 20 living hostages from the Palestinian territory under a US-backed ceasefire deal.\n\n\n\n\n\nVideos filmed and released by the Israeli military captured some of the raw emotion of the reunions.\n\n\n\nMatan Zangauker (right) was received by his mother Einav Zangauker (left). Source: AFP / Israeli Army \"My life, you are my life ... you are a hero,\" cried Einav Zangauker as she embraced her smiling son Matan, in one video.\n\n\n\n\n\n\"Love of your mother, bless you, bless you, my dear.\"\n\n\n\nEitan Mor (middle) aboard an Israeli military helicopter with his family. Source: AFP / Israeli Army Eitan Mor's father wailed in relief as he and the young man's mother squeezed him tight, the footage showed.\n\n\n\nBar Kuperstein waves from the window of a bus at Sheba Tel-HaShomer Medical Centre in Ramat Gan, Israel. Source: AFP / Ahmad Gharabli Other young hostages such as Bar Kuperstein and Yosef Haim Ohana waved from the windows of vans that brought them to the Sheba medical centre near Tel Aviv, as cheering crowds nearby raised Israeli flags.\n\n\n\n\n\nFreed Israeli-German twins Gali and Ziv Berman smiled and gave the thumbs-up, wearing the yellow and blue shirts of their favourite football team, Maccabi Tel Aviv.\n\n\n\nZiv (left) and Gali (right) Berman after being handed over in the prisoner-hostage swap. Source: AFP / Israeli Army\n\nHostages' families rejoice\n\nIn nearby Tel Aviv, hundreds of people erupted in joy, tears and song on Tel Aviv's Hostages Square on Monday as news of the releases broke.\n\n\n\n\n\nMany had come at sunrise, carrying pictures of the hostages and waving Israeli flags bearing a yellow ribbon, a symbol of the movement calling for their release.\n\n\n\n\n\n\"It's so exciting and overwhelming that it's finally happening,\" said Shelly Bar Nir, 34.\n\n\n\nOmri Miran (left) was received by a family member. Source: AFP / Israeli Army \"What we've been fighting for, for over two years — finally our hostages are coming home.\"\n\n\n\n\n\nAnother woman on the square, Noga, who wore a badge that read \"Last day\", shared her pain and joy.\n\n\n\n\n\n\"I'm torn between emotion and sadness for those who won't be coming back,\" she said.\n\n\n\nElkana Bohbot greeted upon his arrival at the Sheba Tel-HaShomer Medical Centre. Source: AFP / Ahmad Gharabli Hamas and its militant allies took 251 hostages into Gaza during the October 7 attack on Israel in 2023.\n\n\n\n\n\nMany of them were released in earlier truces, but 47 people seized on October 7 remained in Gaza. Only 20 of them are alive.\n\n\n\n\n\nSince that day, Noga has worn a small badge each day, counting the days of their captivity.\n\n\n\n'Welcome home'\n\nFor the past two years, people have held frequent rallies and gatherings on this spot in Tel Aviv that has become known as Hostages Square.\n\n\n\n\n\nWhen the news broke that the first seven of the remaining hostages had been released on Monday, the square broke out in cheers and song.\n\n\n\n\n\nIsrael later confirmed all living 20 hostages had returned to the country, with a series of posts on X that read: \"Welcome home\".\n\n\n\nAvinatan Or greets well-wishers upon arriving at Beilinson Hospital in the Rabin Medical Centre in Petah Tikva, Israel. Source: AFP / Menahem Kahana The Hostages and Missing Families Forum, the main organisation representing their relatives, had called on people to gather at the site with the yellow ribbons.\n\n\n\n\n\nAs the war in the Gaza Strip has dragged on, the ribbons became ubiquitous in public spaces in Israel, from roundabouts to car door handles and stroller grips.\n\n\n\n\n\nIsrael did not expect all of the dead hostages to be returned on Monday.\n\n\n\n\"Our struggle is not over. It will not end until the last hostage is located and returned for proper burial,\" the forum said in a statement.\n\n\n\n\n\n\"Only then will the people of Israel be whole.\"\n\n\n\n\n\nIn exchange for the hostages, Israel freed nearly 2,000 prisoners and detainees held in its jails, most of them Gazans detained since the start of the war.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/the-new-threat-to-australias-potato-industry-what-is-it-and-how-can-we-deal-with-it/l0arbsua4",
        "title": "The new threat to Australia's potato industry - what is it and how can we deal with it?",
        "publish_date": "Mon, 13 Oct 2025 20:30:00 +0000",
        "category": "finance",
        "authors": [],
        "text": "Listen to Australian and world news and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nStuart Applebee has been growing potatoes in north-west Tasmania for decades.\n\n\n\n\n\nPotato mop top virus isn't the first disease he's dealt with.\n\n\n\n\n\nHearing it has made its way into his state was a blow, but he's hopeful it can be managed.\n\n\n\n\n\n\"Like any new virus, it's quite concerning when you know you're probably the first state to be detected in the country with it. Once we found out a little bit more out of New Zealand and a couple of other countries that are dealing with it, that probably relaxed my own thoughts a little bit.\"\n\n\n\n\n\nPotato mop top virus isn't a threat to human health, but it can affect the skin and flesh of potatoes and impact crop yields.\n\n\n\n\n\nIt was first detected on a farm in north-west Tasmania in July, also marking the first time it's been found in Australia.\n\n\n\n\n\nTesting in Tasmania ahead of planting saw 1,700 tonnes of infected seed potatoes destroyed, with calls for a federal assistance package for affected farmers.\n\n\n\n\n\nTasFarmers CEO Nathan Calman says concerns also remain about how it got here.\n\n\n\n\n\n\"The most concerning thing about the mop top incursion into Tasmania is that this isn't just the first time the virus has been detected in Tasmania, but it's also the first time that it's been detected within Australia. So its presence here represents a failure of our national biosecurity protocols, but also our state biosecurity protocols.\"\n\n\n\n\n\nStuart Applebee says steps need to be taken to avoid a repeat.\n\n\n\n\n\n\"We have these rules and regulations in place, and somehow things are coming in. We're not that far away from having a major outbreak of something here, if this is going to be a common practice.\"\n\n\n\n\n\nA spokesperson for the Federal Department of Agriculture, Fisheries and Forestry told SBS the current government has committed an extra $2 billion to resourcing the country's biosecurity system since it came to power and that the system is “world-leading.”\n\n\n\n\n\nBiosecurity Tasmania says it has not yet been able to confirm – and is unlikely to be able to confirm – when or how potato mop top virus arrived in Tasmania.\n\n\n\n\n\nBut a spokesperson said efforts so far to trace the source indicate it could have been present in Tasmania for at least two years.\n\n\n\n\n\nAustralia's chief plant protection officer, Dr Gabrielle Vivian-Smith, was questioned about the incursion by Tasmanian senator Richard Colebeck in Estimates last week.\n\n\n\n\n\n\"Potato mop top virus is believed to have been in the country for at least two years based on what we know in terms of tracing at this point. But it's not known exactly how it arrived in Australia, it potentially could have come in on a number of different pathways.\"\n\n\n\n\n\nBiosecurity Tasmania said the virus has been detected across multiple sites - including growing sites, a research site and storage facilities.\n\n\n\n\n\nThe only detection on the mainland to date is in seed potatoes in cold storage in Victoria.\n\n\n\n\n\nThat state, as well as New South Wales and South Australia, has placed restrictions on the movement of unprocessed potatoes and production equipment from the Apple Isle.\n\n\n\n\n\nA national committee last month decided the virus was not eradicable in Australia.\n\n\n\n\n\nZarmeen Hassan is the biosecurity manager for the peak representative body for the potato industry, AUSVEG.\n\n\n\n\n\nShe says if it's been in Tasmania for two years, there is a concern it's already spread to the mainland.\n\n\n\n\n\n\"So far we know that it's only in Tasmania, right? We don't actually know whether it has spread to the mainland. If it has not spread to the mainland, then obviously the industry and government want to work towards containing it.\"\n\n\n\n\n\nAcross the Tasman, New Zealand has been dealing with mop top for seven years, after it was found at a processing plant on the South Island in September 2018.\n\n\n\n\n\nNew Zealand also determined it could not be eradicated, but Potatoes New Zealand CEO Kate Trufitt said management is going well — so far.\n\n\n\n\n\n\"We’re not seeing any impact. Our processes monitor it and report back if we see any (effects). So we're not really seeing that impact at all. We're not seeing lost yields, we're not seeing anything. But they do call it the sleeping disease, so something for us to be aware of is that something could happen in the future. So we do need to be looking to the future and whether we do more surveys. We look to resistant varieties. And we do get advice from international players because it is worldwide.\"\n\n\n\n\n\nShe said washing down of machinery when moving between farms, crop rotation and improving soil health were crucial in preventing the disease.\n\n\n\n\n\nAnother disease found in potatoes – powdery scab – is a known vector of potato mop top virus, helping it to spread.\n\n\n\n\n\nThe Tasmanian government is investing $200,000 into a research program looking into powdery scab and mop top.\n\n\n\n\n\nZarmeen Hassan said powdery scab is found across the country.\n\n\n\n\n\n\"Powdery scab is prevalent in the country across all the growing, majority of the growing regions. And if that's the case, then it may be further than Tasmania. We don't know that, it's a bit of an unknown right now.\"\n\n\n\n\n\nMop top and powdery scab can both remain dormant in soil for years, even without a potato crop.\n\n\n\n\n\nThere’s currently no soil test to detect powdery scab or mop top but work is underway.\n\n\n\n\n\n\"At this point, there isn't a soil testing protocol and methodology in place in Australia. It is being worked on but planting season is starting now, so it won't be available for this planting season; it will be available for the next season.\"\n\n\n\n\n\nPlanting the next crop of potatoes is getting underway in Tasmania, but ongoing rain means for some, including Stuart Applebee, the ground is still too wet.\n\n\n\n\n\nDespite this and other challenges, he can't imagine doing anything different.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/juggling-act-social-services-payments-rent-food/g4wjshlw9",
        "title": "'Eating mostly brown food': The 'devastating' juggle faced by a rising number of Australians",
        "publish_date": "Mon, 13 Oct 2025 18:32:50 +0000",
        "category": "finance",
        "authors": [],
        "text": "\"Everything changed\" for Mike Sadler in 2020, when the payment he received from Centrelink increased by $550 a fortnight.\n\n\n\n\n\nThe supplemental payment, introduced in recognition of the COVID-19 pandemic's impact on the Australian workforce, was applied on top of his JobSeeker payment.\n\n\n\n\n\nAll of a sudden, his fortnightly income was $1,115.70 — brought above the poverty line, closer to the national median wage.\n\n\n\n\n\nIt was a relief. Before the increase, Mike and his family of four had been eating a lot of \"brown food\", he said.\n\n\n\n\n\n\"It was cheaper to buy packaged chips than potatoes, so we'd buy the packets,\" he told SBS News.\n\n\n\n\n\n\"But suddenly it was COVID and the payments went up and we could afford the potatoes, afford fresh produce.\"\n\n\n\nFor Australians like Mike, the end of the Coronavirus Supplement in 2021 and the return to \"regular\" social support payments like JobSeeker, Austudy and Youth Allowance after lockdown meant a return to poverty.\n\n\n\n\n\nAdvocates are calling for government service payments to be brought back up to COVID-levels, to address the millions of Australian students, jobseekers and single parents who are forced to live below the income poverty line as rents steadily increase nationally.\n\n\n\n\n\nIn spite of small increases to social support payments since the pandemic, including a $12.50 per fortnight increase to JobSeeker in September this year, Australia's social service payments are \"woefully\" below the poverty line, the head of a leading anti-poverty advocacy group says.\n\n\n\nOne in seven Australians living below the poverty line\n\nA new report from the University of New South Wales (UNSW) and the national advocacy group for poverty, disadvantage and inequality, the Australian Council of Social Security (ACOSS), found more than 3 million Australians were living below the poverty line in 2022-23.\n\n\n\n\n\nThe relative poverty line is defined as 50 per cent of the median household after-tax income, with those below it considered to be experiencing poverty.\n\n\n\n\n\nUsing the latest figures from the Household, Income and Labour Dynamics in Australia survey, researchers found the number of people living in poverty in Australia has increased to one in seven, up from one in eight in 2020-21.\n\n\n\n\n\nSpeaking at a press conference in Canberra, ACOSS CEO Cassandra Goldie said an increasing number of Australians were faced with the choice between putting food on the table and experiencing homelessness.\n\n\n\n\n\n\"The reality is that in one of the wealthiest countries in the world, poverty is on the rise. Housing costs are affecting many people, but if you're on a low fixed income, JobSeeker is just $401 a week,\" she said.\n\n\n\n\n\nYuvisthi Naidoo, a senior research fellow at UNSW’s Social Policy Research Centre who was the lead researcher on the study, said the JobSeeker payment was just 42 per cent of the national minimum wage.\n\n\n\n\n\n\"In our report, we show how far the income support payments are below the poverty line,\" she told SBS News.\n\n\n\n\n\n\"Currently, for example, somebody who is relying on the JobSeeker payment is $205 per week below the income poverty line. A sole parent with two children who is on a family payment is $163 below the poverty line. And a young person on Youth Allowance is $279 under the poverty line.\"\n\n\n\nSource: SBS News The report found the poverty line for a single adult is $584 per week, minus housing costs. JobSeeker is now $793.60 per fortnight for a single with no dependants, while a single person with one or more children receives a maximum of $849.90.\n\n\n\n\n\nThe figures reveal a poverty gap of nearly $380 per fortnight, or $190 per week, for a single with no dependants. For families with children, the poverty line was $1,226, meaning incomes on that weekly payment were $464 below the poverty line.\n\n\n\n\n\nNaidoo said income support payments were currently so low that the government would need to increase them \"significantly\" to meet the poverty line.\n\n\n\n\n\n\"If they're going to make a $56 a week increase, it's not going to be much. There needs to be a substantive increase in the working-age income support payments,\" she said.\n\n\n\n\n\n\"When we talk about what the poverty line is, we remember the national minimum wage is a figure that's higher than the poverty line. The JobSeeker payments are so far below the line and level of destitution.\"\n\n\n\n\n\nNaidoo said it was \"not possible to live on income support payments\", even if a recipient also receives rent assistance.\n\n\n\nFamilies with children\n\nMike and his wife Liz moved to Wagga Wagga from Sydney with their two young children after finding themselves out of work and unable to afford rent.\n\n\n\n\n\nThe pair decided to study and become primary school teachers — something they thought would be an \"absolute job-guarantee way of retraining\".\n\n\n\n\n\n\"But you've basically got to live on Austudy, in poverty for four or five years, and then you're going to have debt at the end of it,\" Mike said.\n\n\n\n\n\n\"It was a matter of searching for food almost to see what you could afford to put on the table before the money ran out each fortnight.\"\n\n\n\n\n\nACOSS' report stresses that one in six children is living below the poverty line — more than 750,000 Australian kids. Goldie said it was \"disturbing\" for everyone.\n\n\n\n\n\n\"What's disturbing for all of us is that we are seeing an increase in poverty on our watch,\" she said.\n\n\n\n\n\n\"I think it's very true that in a very wealthy country, for many people, [living in poverty] is a devastating experience that leads to a great sense of 'I'm not as worthy as other people' and a great desire to hide the experience, as you look around and see other people who have a lot of money, and a lot of people who are doing extremely well.\"\n\n\n\nSource: SBS News She said for children in particular it was a \"terrible signal\".\n\n\n\n\n\nAnd for parents, Goldie said poverty had \"devastating effects\".\n\n\n\n\n\n\"Both in the immediate term in terms of chronic anxiety and distress — you're constantly figuring 'What can I afford today, what can I go without, do I keep paying the rent and keep the roof over my head whilst I can only afford to feed myself once a day?\"\n\n\n\n\n\nShe said experiencing poverty had significant impacts on people's mental health, and would leave acute anxiety, something Mike says he is all too familiar with.\n\n\n\n\n\n\"It'd often come down to the last five dollars, for Liz and I to not eat, to feed the kids,\" he said.\n\n\n\n\n\n\"It is a juggling act of the highest order, trying to juggle all this stuff and at the end you still fail, right? It just depends how well you do it, and you kick yourself when you fail, but it's how well you can juggle all of this stuff.\"\n\n\n\n\n\nMike said the worst part of poverty was the social isolation.\n\n\n\n\n\n\"When you're living on Centrelink income support, the kids and yourself are basically prevented from going anywhere,\" he said.\n\n\n\n\n\n\"You've got no money to put petrol in the car, so you don't go visiting, you can't meet friends at the pub for a pizza, right? It's just not something you can do at all.\"\n\n\n\nCost of living pressures, housing stress key drivers of poverty\n\nThe report highlights increasing rents as a key driver of rising poverty. Housing affordability advocates agree.\n\n\n\n\n\nKate Colvin, a spokesperson for Everybody's Home, a national advocacy coalition targeting Australia's housing crisis, said the poverty report \"demonstrates that runaway rents are pushing more Australians than ever into rental stress and homelessness, leaving many struggling to cover basic living costs\".\n\n\n\n\n\n“No one should have to choose between paying rent and buying food, medicine and other essentials, but sadly this is becoming more common,\" she told SBS News.\n\n\n\n\n\nThe report notes that the lowest-paid people were experiencing rental stress — when more than 30 per cent of one's pay is spent on rent.\n\n\n\n\n\nIn the 2022-2023 period, the proportion of renters in the lowest 20 per cent of earners experiencing rental stress increased to 57 per cent, up from 52 per cent in 2020–21.\n\n\n\nSource: SBS News \"Access to a safe, decent, and affordable home is the foundation to building a stable, secure life,\" Colvin said.\n\n\n\n\n\n\"Right now, Australia has a social housing shortfall of 640,000 homes and demand is rising.\n\n\n\n\n\n\"To turn the tide on rising poverty we need the federal government to urgently deliver a major boost to public and community housing so people being squeezed out of the rental market can find a decent, affordable home.\"\n\n\n\n\n\nNaidoo said rent assistance wasn't helping low-income earners.\n\n\n\n\n\nShe said from 2021 to 2023, median advertised rents for units went up 30 to 40 per cent in all major cities.\n\n\n\n\n\nThe federal government increased rent assistance by 10 per cent in September 2024, but Naidoo said it needs to be \"significantly higher\".\n\n\n\n\n\n\"The important thing to remember is that only around a quarter of all people on income support payments actually receive Commonwealth rent assistance,\" she said.\n\n\n\n\n\nMike said he believes that everyone just wants to work.\n\n\n\n\n\n\"It's a social thing. It's an empowering thing. It gives you some satisfaction,\" he said.\n\n\n\n\n\nHe said he didn't think people really understood the \"social exclusion that comes with having no money\".\n\n\n\n\n\n\"You just cannot participate in society, and when that happens, communities break down,\" he said.\n\n\n\n\n\n\"But please, people shouldn't be treating those who don't have those resources like pariahs. All us humans need this. It's part of who we are, and to have it excluded as a kind of punishment defies logic to me.\"\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/video/youtube-argues-social-media-ban-leaves-children-vulnerable-to-harmful-content/lg0ys0wna",
        "title": "YouTube argues social media ban leaves children vulnerable to harmful content",
        "publish_date": "Mon, 13 Oct 2025 09:40:57 +0000",
        "category": "finance",
        "authors": [],
        "text": "YouTube argues social media ban leaves children vulnerable to harmful content\n\nPublished 13 October 2025, 8:49 am\n\nGoogle has warned a looming social media ban on children will be extremely difficult to enforce and may in fact expose minors to more harm. The parent company of YouTube would not say if it was lobbying the White House about the restrictions ahead of the Prime Minister's visit to the US.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/video/new-report-highlights-disadvantages-faced-by-carers/6grs09740",
        "title": "New report highlights disadvantages faced by carers",
        "publish_date": "Mon, 13 Oct 2025 09:25:34 +0000",
        "category": "lifestyle",
        "authors": [],
        "text": "New report highlights disadvantages faced by carers\n\nPublished 13 October 2025, 8:48 am\n\nThe wellbeing of millions of unpaid carers is declining, that is according to new data from Carers Australia. National Carers Week is hoping to raise awareness about the challenges faced by families, with many people likely to provide care at some point in their lives.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/video/treasurer-announces-revised-superannuation-tax-plan/2wcn6z97m",
        "title": "Treasurer announces revised superannuation tax plan",
        "publish_date": "Mon, 13 Oct 2025 09:19:24 +0000",
        "category": "finance",
        "authors": [],
        "text": "Treasurer announces revised superannuation tax plan\n\nPublished 13 October 2025, 8:48 am\n\nThe Treasurer has unveiled a suite of watered-down reforms to superannuation tax labelled a humiliation, by the Opposition. Jim Chalmers has denied being rolled by the Prime Minister who has gone on leave this week.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/new-super-changes-for-low-income-earners-and-high-balances-how-geopolitics-is-impacting-markets/mb3ysbk81",
        "title": "New super changes for low income earners and high balances & how geopolitics is impacting markets",
        "publish_date": "Mon, 13 Oct 2025 06:09:30 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/families-wait-for-hostages-to-return-within-hours-evening-news-bulletin-13-october-2025/q06u0oicp",
        "title": "Families wait for hostages to return within hours | Evening News Bulletin 13 October 2025",
        "publish_date": "Mon, 13 Oct 2025 04:59:04 +0000",
        "category": "finance",
        "authors": [],
        "text": "Key Points Remaining Israeli hostages, Palestinian detainees to be released\n\nSuperannuation changes aimed at making system “fairer”\n\nAustralian women’s cricket team beats India at Women’s World Cup\n\nListen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nFamilies are preparing for reunions with loved ones, with the imminent release of Israeli hostages in Gaza and Palestinian detainees in Israel.\n\n\n\n\n\nAs part of the first phase of the Gaza peace plan, 48 Israeli hostages will be released in exchange for about 2,000 Palestinian prisoners and detainees.\n\n\n\n\n\nMoshe Lavi is the relative of Israeli hostage Omri Miran.\n\n\n\n\n\n\"Yeah, we've been preparing logistically over the past few days. Where are we going to meet? What are we going to say once it happens? And also preparing the girls. They have two daughters, Roni and Alma, four years old and two years old. We had to try and frame it in a way that they understand that their daddy might be returning home soon.\"\n\n\n\n\n\nIn the West Bank, Yousef Shamasneh says he is waiting for the release of his sons, Abdel Jawad and Mohammad Shamasneh.\n\n\n\n\n\n\"I swear to God, the 34 years have been extremely difficult — very, very hard. Even though many prisoner exchange deals were made over the years, they were always excluded. But thanks to God, today, He has willed their release, and we are truly happy and grateful for that.\"\n\n\n\n---\n\n\n\n\n\nThe federal Treasurer says changes to superannuation policy aims to make the system better and fairer.\n\n\n\n\n\nThe low-income superannuation tax offset will be raised from $500 to $810.\n\n\n\n\n\nThe eligibility threshold will be lifted from $37,000 to $47,000 effective from July 1 in 2027.\n\n\n\n\n\nFor 3.1 million Australians eligible for the offset, the change is projected to add around $15,000 to the superannuation balance by retirement age.\n\n\n\n\n\nTreasurer Jim Chalmers also announced changes to tax concessions for Australians with higher super balances.\n\n\n\n\n\n\"For earnings on super balances between 3 and 10 million dollars, the rate remains 30 per cent. The rate for over 10 million dollars becomes 40 per cent. So, this is still a concessional tax arrangement, but it is better targeted. It will still only impact only half a per cent of Australians.\"\n\n\n\n---\n\n\n\n\n\nThe federal government's controversial decision to approve an extension to a gas plant in Western Australia is being challenged in the Federal Court.\n\n\n\n\n\nThe Australian Conservation Foundation has launched the legal challenge, arguing the minister left critical details out of his decision on Woodside's North West Shelf extension, one of the world's biggest liquified natural gas projects.\n\n\n\n\n\nThe extension to 2070 has prompted backlash from conservation groups, and First Nations communities concerned about impacts on ancient rock art.\n\n\n\n\n\nAdam Beeson is the general counsel at the Australian Conservation Foundation.\n\n\n\n\n\n\"The Australian Conservation Foundation is challenging the lawfulness of the minister's decision. The minister decided that the climate change impacts of this project were not relevant to his decision to approve this project. We think that was wrong, and if successful, this case could reshape the way that climate impacts are assessed in Australia. We also think the minister made legal mistakes when he waved through this project because he didn't understand with any precision what gas will actually be processed at this facility.\"\n\n\n\n---\n\n\n\n\n\nOne in six Australian children are living in poverty - defined as households earning half the median Australian household after-tax income - $584 a week for a single adult and $1226 a week for a couple with two children.\n\n\n\nThat's the finding of a new report* by the Australian Council of Social Services and the University of New South Wales.\n\n\n\n\n\nThe report shows poverty has increased since the COVID-19 pandemic.\n\n\n\n\n\nIt also found 3.7 million people, or 14.2 per cent of the population, were living in poverty in the years 2022-23, equating to one in seven Australians.\n\n\n\n\n\nThat includes 757,000 children.\n\n\n\n\n\nACOSS CEO, Dr Cassandra Goldie, says the federal government needs to take urgent action to address inequity and the impacts felt by the poorest Australians.\n\n\n\n\n\n\"Costs are affecting many people but if you're on a low fixed income, JobSeeker for example is just $401 per week. If you're trying to get private rental out in the market, you simply cannot afford to pay. We could immediately lift the adequacy of social security payments, and dramatically decrease the rate of poverty in this very wealthy country. We could make sure that we're regulating the increase in rents. And growing the supply of low-income housing.\"\n\n\n\n---\n\n\n\n\n\nTo sport - Australia has recorded the highest run chase in women's O-D-I history against India, at the Women's Cricket World Cup.\n\n\n\n\n\nChasing down India’s mammoth 330, skipper Alyssa Healy made 142 from 107 deliveries. It is the sixth ODI century of her career.\n\n\n\n\n\nThat set the team up to claim the win.\n\n\n\n\n\nHealy says it feels great.\n\n\n\n\n\n\"If you have been watching me in the nets, it has been a frustrating experience because I feel like I have had no rhythm whatsoever. I have been struggling to find it and I didn't really know where it went before I came into the World Cup. But I think once you step out in the field, your competitive instincts kick in - and you kind of lock into getting into the contest. And that was a really enjoyable experience. And like I said, it was my day today.\"\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/the-six-superannuation-changes-in-treasurer-jim-chalmers-surprise-announcement/bz4k2c5zs",
        "title": "The changes to your superannuation in Treasurer Jim Chalmers' surprise announcement",
        "publish_date": "Mon, 13 Oct 2025 02:27:13 +0000",
        "category": "finance",
        "authors": [],
        "text": "The government has retreated on changes to unrealised capital gains and adjusted tax concessions for larger superannuation balances following ongoing concerns from businesses and economists.\n\n\n\n\n\nIn a surprise press conference on Monday, Treasurer Jim Chalmers announced six superannuation changes signed off by cabinet hours earlier.\n\n\n\n\n\nFollowing a review, the government is proposing a second tier of super concessions, with a 40 per cent tax rate applying for balances over $10 million.\n\n\n\n\n\nThis change comes in lieu of a super cap and will operate alongside the original 30 per cent on balances above $3 million as proposed.\n\n\n\n\n\nBoth balances will be indexed, addressing concerns the thresholds may capture more Australians over time due to bracket creep.\n\n\n\nThe changes include the removal of tax on unrealised capital gains, which Chalmers said \"was a genuine sticking point\" for critics, hoping its removal will mean \"no excuses but to support\" the changes.\n\n\n\n\n\nAustralians on lower incomes will also see a change to their super tax offset, which will increase from $500 to $810 as the government expands the eligibility criteria from a $37,000 cut-off to $45,000.\n\n\n\n\n\nChalmers said the government had taken into consideration a series of feedback from industry experts, including during the economic roundtable in August .\n\n\n\n\n\n\"Our objective, which will be satisfied with these changes, is a fair tax system from top to bottom,\" he told reporters in Canberra on Monday.\n\n\n\n\n\n\"It means better outcomes for people on the lowest incomes and better targeted concessions for people with the biggest balances. And that's a good outcome from our point of view.\"\n\n\n\n\n\nChalmers highlighted \"14 times more people will benefit from the lower income super changes than will be impacted by the better targeted concessions\".\n\n\n\nWhat are the six superannuation changes?\n\nFrom 1 July 2027, Australians earning between $28,000 and $45,000 will receive a $810 offset at tax time.\n\nSuperannuation balances over $10 million will be taxed at a 40 per cent concessional rate, alongside the existing proposal to tax balances over $3 million at 30 per cent.\n\nBoth the $3 million and $10 million thresholds will be indexed over time to address bracket creep.\n\nThe new changes will not apply to unrealised gains.\n\nThe changes will be delayed by a year, until July 2026, to allow for consultation, except for the lower income tax offset.\n\nExtend existing constitutional tax exemptions for federal and state judges.\n\nGreens accuse Labor of succumbing to 'pressure'\n\nChalmers said he'd had an initial conversation with Greens leader Larissa Waters about the changes following the cabinet meeting and hopes to \"engage constructively\" with the party.\n\n\n\n\n\nGreens senator Sarah Hanson-Young said Chalmers had been forced to \"weaken\" his tax reform due to \"pressure\" from big businesses and the wealthiest, as the party welcomed tax relief for lower-income earners.\n\n\n\nGreens senator Nick McKim said the government lacks the courage to tax the wealthy. Source: AAP / Mick Tsikas However, ahead of reviewing the full legislation, Greens economic justice spokesperson Nick McKim said on Monday afternoon the changes demonstrated the Albanese government \"doesn't have the guts to tax big corporations and billionaires fairly\".\n\n\n\n\n\n\"Labor has stripped out the tax on unrealised gains and indexed the $3 million threshold, a gift to the super-rich that will cost the budget billions.\n\n\n\n\n\n\"This is a capitulation to the wealthiest people in the country, and a slap in the face to everyone else who pays their tax straight out of their pay packet.\"\n\n\n\n\n\nMeanwhile, the Opposition's Treasury spokesperson Ted O'Brien said Labor's back-down was a \"win for everyday Australians\".\n\n\n\n\n\n“The Coalition will read the details before coming to any conclusion, which is the usual process, of course,\" he said.\n\n\n\n\n\n“We opposed it every step of the way. And I want to say that today really is a victory for the coalition of common sense over a very tax hungry Labor government.\"\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.theage.com.au/sport/afl/afl-trade-period-live-updates-swans-ramp-up-the-chase-for-curnow-as-star-hits-sydney-20251013-p5n284.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "AFL trade period LIVE updates: Hawks ‘must part with one of their stars’ for Merrett; Stewart opens up on finals concussion",
        "publish_date": "Tue, 14 Oct 2025 12:55:12 +1100",
        "category": "sports",
        "authors": [
            "Scott Spits",
            "Melissa Coulter Ryan"
        ],
        "text": "Collingwood have bolstered their hand in this year’s draft in a trade with Brisbane as they prepare to match a bid on next-generation academy prospect Zac McCarthy.\n\nThe Magpies sent pick 59 this year and a 2026 third-round selection (via Melbourne, which they secured in the Brody Mihocek deal) to the Lions for picks 45 and 56.\n\nThe Demons’ pick gives the Lions a greater spread of selections across the next two drafts, given they already have enough draft points to match a bid on star academy midfielder Daniel Annable, who is set to be a top-five pick in the 2025 draft.\n\nThe deal is unrelated to any potential deal for Callum Ah Chee, with Brisbane still hoping to snaffle pick 16 off Adelaide, who are only willing to offload a future second-rounder for the dual premiership-winning forward.\n\nThe extra picks should also help Collingwood secure key forward Jack Buller from Sydney.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/culture/tv-and-radio/is-colin-hanks-portrait-of-this-80s-movie-star-a-little-too-sweet-to-believe-20251013-p5n25h.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Is Colin Hanks’ portrait of this ’80s movie star a little too sweet to believe?",
        "publish_date": "Tue, 14 Oct 2025 12:49:24 +1100",
        "category": "entertainment",
        "authors": [
            "Karl Quinn"
        ],
        "text": "That makes it enormously watchable and rich in feeling (and, to a degree, anecdote). But it also pushes it right to the brink of hagiography.\n\nSteve Martin, Martin Short, Eugene Levy, Catherine O’Hara, Bill Murray, Dan Aykroyd, Macaulay Culkin, Conan O’Brien – even the director’s father, a certain Tom Hanks – all speak in the most glowing terms of a man they considered a friend, a colleague of incredible talent and generosity, and a performer who combined comedic delivery and genuine acting chops to brilliant effect.\n\nThe great strength, and perhaps also the greatest weakness, of this documentary is the depth of talent director Colin Hanks has assembled to share memories of the late Canadian actor John Candy, one of the biggest screen comedy stars of the 1980s.\n\nNo one, it seems, has a bad word to say about Candy, who died of a heart attack in 1994, aged 43. Thankfully, there are glimpses of the man himself shining at least a little light into the darker corners of his soul, his psyche and his self-image.\n\nThe picture that emerges on that score is of a (sometimes) sad clown who never quite overcame the trauma of losing his father (also of a heart attack, at age 35) on his fifth birthday. A man who carried an unshakeable – and, as it happened, well-founded – fear that he, too, was marked for an early end.\n\nWith Steve Martin in Planes, Trains and Automobiles (1987).\n\nCandy was troubled, too, by intense self-consciousness about his size. He was reasonably tall, at 188 centimetres, and for most of his life very heavy, but by the end, he was massive. His widow, Rose, recalls buying clothes for him and having to upscale from “double X to triple X to 5X” in size. “It wasn’t easy,” she says.\n\nSon Chris reflects on his father’s prodigious intake – of food, alcohol, cigarettes – as a symptom of, and means of coping with, deep-seated issues. “If you go a whole lifetime eating your feelings, drinking your feelings, smoking your nerves, it shows up, in one way or another,” he observes. “It’s an alarm system, and it’s saying, ‘Hey, there is something wrong here’.”",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/money/super-and-retirement/labor-fixed-its-super-tax-but-one-glaring-problem-still-remains-20251014-p5n2dl.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Labor fixed its super tax, but one glaring problem still remains",
        "publish_date": "Tue, 14 Oct 2025 12:46:39 +1100",
        "category": "finance",
        "authors": [
            "Noel Whittaker"
        ],
        "text": "Two years ago, Treasurer Jim Chalmers unveiled what quickly became the most controversial proposal in the history of superannuation – a new tax on members whose balances exceeded $3 million.\n\nThe plan was for a 15 per cent tax to be levied on the increase in a member’s total super balance from July 1, 2025 to June 30, 2026, after adjusting for contributions and withdrawals.\n\nTreasurer Jim Chalmers is hoping the new superannuation taxes will help bolster the budget. Credit: Alex Ellinghausen\n\nThe problem was that the calculation was to include unrealised gains – paper increases in the value of assets that hadn’t actually been sold or turned into cash. In other words, people could have been taxed on profits that didn’t exist.\n\nTo make matters worse, the $3 million threshold was not going to be indexed, meaning that over time, as inflation pushed up super balances, more and more Australians would have been dragged into the net.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/afl/strong-appetite-to-return-to-coaching-buckley-joins-chris-scott-at-geelong-20251014-p5n2e2.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘Strong appetite to return to coaching’: Buckley joins Chris Scott at Geelong",
        "publish_date": "Tue, 14 Oct 2025 12:44:14 +1100",
        "category": "sports",
        "authors": [
            "Jon Pierik"
        ],
        "text": "AFL great Nathan Buckley will return to coaching next season – at Geelong.\n\nThe club confirmed on Tuesday that Buckley will be a full-time assistant to Chris Scott next season.\n\nBack on the tools: Nathan Buckley after his last match as Magpies’ coach in 2021. Credit: Getty Images\n\nThe Cats’ general manager of football Andrew Mackie said Buckley, 53, would be an invaluable addition to the club.\n\n“We are excited to add Nathan to our club and, more specifically, to our coaching group. He is respected and highly regarded across the football industry and brings a wealth of experience and a fresh perspective,” Mackie said.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/western-australia/wa-news-live-perth-schools-riddled-with-defects-opposition-claims-20251013-p5n28z.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "WA news LIVE: Perth schools riddled with defects, opposition claims",
        "publish_date": "Tue, 14 Oct 2025 12:40:37 +1100",
        "category": "finance",
        "authors": [],
        "text": "An assessment of WA public schools has revealed more than 10,000 maintenance defects including cracked walls, crumbling ceilings and asbestos.\n\nThe audit, looking at conditions at the state’s 834 public schools, was tabled in parliament recently.\n\nEsperance Senior High School recorded the most defects – 121.\n\nManjimup Senior High School recorded 87, Kent Street Senior High School recorded 86, Shenton College 85 and Singleton Primary School 79.\n\nShadow Education Minister Liam Staltari said the report laid bare the state of disrepair and neglect many students and teachers were working in.\n\nHe said the government should be “ashamed” of the conditions.\n\n“This reality must be compounding teacher stress and the sense of disrespect that we know is driving record resignations,” Staltari said.\n\n“This report is a long-overdue wake-up call. No one should have to work and learn in these conditions and the Government needs to sit up and listen.”\n\nEducation Minister Sabine Winton said the worst of the defects had already been rectified by the time the findings from the audit had been published.\n\n“Since coming to government, we’ve made it a priority to fix a significant backlog of maintenance issues at our public schools caused by years of neglect under the previous Liberal-National Government,” she told the West Australian.\n\n“A well-maintained school supports not just learning, but also pride and belonging among students, staff and their communities.”",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/racing/world-s-top-jockey-locked-in-for-everest-ride-on-waller-trained-star-20251014-p5n2dh.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "World’s top jockey locked in for Everest ride on Waller-trained star",
        "publish_date": "Tue, 14 Oct 2025 12:38:07 +1100",
        "category": "sports",
        "authors": [
            "Craig Kerry"
        ],
        "text": "Premier jockey James McDonald will ride Joliestar in the $20 million The Everest (1200m) on Saturday at Randwick as he bids for his second win in the richest race on turf.\n\nMcDonald, No.1 on the world jockey rankings, had been in line to ride either Joliestar or another Chris Waller-trained mare, Lady Shenandoah, in the race.\n\nJoliestar and James McDonald cruise to victory in the Shorts at Randwick. Credit: Getty Images\n\nWaller stable representative Darren Beadman said on Saturday that the decision would be made via consultation between McDonald, Waller and Victorian jockey Damian Lane, who will now ride Lady Shenandoah.\n\nMcDonald, who won the 2021 Everest on the Waller-trained Nature Strip, has a strong association with both stars but was locked in for Joliestar on Tuesday ahead of tonight’s barrier draw reveal.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/business/markets/which-tariffs-china-finds-new-markets-to-defy-trump-s-trade-war-20251014-p5n2ag.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Which tariffs? China finds new markets to defy Trump’s trade war",
        "publish_date": "Tue, 14 Oct 2025 12:11:34 +1100",
        "category": "finance",
        "authors": [
            "Stephen Bartholomeusz"
        ],
        "text": "The September data showed that even as exports to the US slumped, those to the European Union rose 14.2 per cent. Exports to South-East Asian economies were up 15.6 per cent, while to Latin America they climbed 15.2 per cent and to Africa (off a modest base) they surged 56 per cent. China’s exports have been re-routed, demonstrating that Trump’s thesis that China’s export-oriented economy made it over-dependent on the US market was flawed. In 2018, when the first of Trump’s tariffs on China were imposed, exports to the US accounted for about 3.5 per cent of China’s GDP. Last year, that percentage was 2.8 per cent. It will be significantly lower this year. Trump’s tariffs can damage, and are damaging, China’s economy, but the country’s exposure and vulnerability to them is reducing rapidly. Now, America - while still an important destination for Chinese goods - is part of a far more diversified global market for Chinese companies, one fortified by massive investments by China in economies other than the US that are also gradually shifting their geopolitical relationships away from America. Trump’s tariffs on everyone are aiding that process.\n\nWhile there are some signs of pushback against the flood of cheap exports from China in Europe, Latin America and even Africa, there’s nothing occurring of the scale and breadth of the US tariff regime to stem them. Very few of those economies dealing with the Trump tariffs would want to open a new front by initiating a trade war with China. Loading What Trump may have underestimated was the rest of the world’s – and America’s – reliance on China’s cheap goods and China’s dominance of key industrial technologies and their supply chains. There are no instantly available and competitively priced substitutes for many of its key exports. There’s also no market for some of America’s agricultural products bigger than China. It was notable that China’s imports of soybeans in September were up 4.8 per cent to 12.9 million tonnes. American farmers are now harvesting a near-record crop, none of which has been pre-purchased by China, which now sources most of its soybeans from South America.\n\nLast week’s significant tightening of export restrictions on rare earths, magnets and batteries, which caused Trump to threaten China with a 100 percentage point hike in the tariff rate, also highlighted China’s own leverage in the trade stoush, and how it is amplified by US financial markets, which went into a meltdown on Friday and would’ve played a role in Trump’s backing away from his initial aggressive response. Trump used to boast that trade wars were good and easy to win. Experience of the Trump tariffs says that they aren’t good for anyone, and no one wins. The September trade data showed that China’s exports of rare earths were down 31 per cent from August and were about half the volumes China was exporting mid-year. It would appear that China had started squeezing the market for rare earths, a market it absolutely dominates, even before the announcement of the new export restrictions. Wall Street recovered some of their losses on Monday after Trump adopted a far more conciliatory tone. The growth in China’s exports shows how dynamic its companies are.\n\nSome of that growth will reflect an arbitraging of tariff rates, with goods being trans-shipped to their eventual destination, America, but there’s also an organic appetite for cheap Chinese goods in the developing economies that China has been building relationships with for years through its Belt and Road initiative. The growth is coming at a cost, with export volumes significantly higher than their value. China’s companies are operating in sectors with substantial excess capacity and fighting torrid price wars in their domestic markets. They have slashed export prices to absorb that excess capacity, which has caused increased tension with China’s non-US trade partners even as their profits have kept falling. It’s also led to deflation and weaker growth in an economy that has never fully recovered from a downturn in its property market that is now in its fifth year, although a 7.4 per cent rise in China’s imports in September, to $US238.1 billion, could suggest the domestic economy is faring a little better than most forecasters have predicted. Beijing has responded with a campaign against what it calls “involution,” or excess capacity and continuing cycles of price competition, which should see some consolidation of industries and some companies exiting markets.\n\nChina’s broader economic data for September is due to be released next week, which will provide a better insight into the toll the trade war and China’s domestic settings are taking on an economy which is over-exposed to trade. Loading Also next week, the most important meeting of China’s leaders for the year – the “Fourth Plenum” – will start, with hundreds of the country’s senior officials reviewing the government’s next five-year plan for the economy and society. To date, Beijing has resisted any large-scale effort to stimulate the domestic economy to dilute its reliance on exports - but there will be significant interest from external observers in whether there are plans to boost consumption over the remainder of this decade, and whether there will be more done to address the structural imbalances and the degree of unproductive capital within the economy. Trump used to boast that trade wars were good and easy to win. Experience of the Trump tariffs says that they aren’t good for anyone, and no one wins.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/queensland/flower-petals-and-half-days-off-the-prizes-given-to-worksafe-staff-for-closing-claims-20251002-p5mzit.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Flower petals and half-days off: The prizes given to WorkCover staff for closing claims",
        "publish_date": "Tue, 14 Oct 2025 12:06:25 +1100",
        "category": "finance",
        "authors": [
            "Cameron Atfield"
        ],
        "text": "WorkCover Queensland caseworkers have come under extreme pressure to finalise workers’ compensation claims, being pitted against colleagues to earn “flower petals” for each closed claim to win prizes.\n\nInternal documents, seen by this masthead, show competition between co-workers being encouraged, with team incentives including half-days off and team lunches being offered.\n\n“It’s certainly been heating up on the floor! Loving the healthy competition amongst you all,” a senior manager said in an email to staff.\n\nThe “handy visual” for caseworking teams.\n\n“This week as a segment we have already finalised 94 claims with two working days left in the week to go. If you haven’t noticed already, we have a handy visual on the wall near the lifts showing our progress each week towards our monthly stretch target for BP [business partnerships]. We are well over halfway there!”",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/soccer/rat-stops-play-in-world-cup-qualifier-20251014-p5n2eb.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Rat stops play in World Cup qualifier",
        "publish_date": "Tue, 14 Oct 2025 12:04:50 +1100",
        "category": "sports",
        "authors": [],
        "text": "Rat stops play in World Cup qualifier\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/culture/tv-and-radio/sam-pang-is-charming-and-personable-but-one-topic-is-off-limits-20251013-p5n22r.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Sam Pang is charming and personable, but one topic is off-limits",
        "publish_date": "Tue, 14 Oct 2025 12:01:41 +1100",
        "category": "finance",
        "authors": [
            "Louise Rugendyke"
        ],
        "text": "Save Log in , register or subscribe to save articles for later. Save articles for later Add articles to your saved list and come back to them any time. Got it Normal text size Larger text size Very large text size Try the calamari, Sam,” calls out the woman as she leaves the back dining area at the Napier Hotel. “I’m really boring, I have it all the time, I don’t even look at the menu.” “That’s good enough for me. Thank you!” replies Sam Pang. It’s a Friday lunchtime and the 51-year-old comedian and TV host is sitting in the back dining area of the old-school corner pub in Melbourne’s inner-city suburb of Fitzroy. He is just days away from launching season two of his chat show Sam Pang Tonight and is still a bit twitchy after a few days of heavy press. He has a reputation for not liking interviews, something, he says, was purely a product of him always playing second or third fiddle on panel shows. With Sam Pang Tonight, however, and his Logie hosting duties, he has been prised into the open. Still, the interview comes with a caveat – no personal questions – but he will happily talk about his work. He is great company – charming, personable and generously laughing at my terrible jokes – but sees no point in talking about himself. Loading “I don’t like talking about myself,” he says. “Some people, by the way, love talking about themselves. You know, they love it. But this show, it seems when your name’s in the title – and I’m so grateful, and I’m proud to be able to have my own show – I’m happy to try to do some publicity, or get the word out there.” He winces when I mention I spotted him that day on the cover of TV Week (headline: “I’m very grateful”) and admits that, yes, he gets recognised regularly. Is he a celebrity?\n\nAdvertisement\n\n“No,” he says. “I’m comfortable with being a comedian. I’m happy with that.” So there’s no tell-all book coming, the usual celebrity memoir caper? “That sounds like too much work.” His good friend Kitty Flanagan has written a book … “But she’s a supremely talented woman who can do anything, and I’m concentrating so hard on doing just one thing,” he says. “She can do that because she’s already a triple threat. I’m not that.” Sam Pang’s order: salt and pepper squid with togarashi mayo, bean sprout, spring onion salad and burnt lime. Pang chose the Napier because “because pub meals are a bit hit and miss – I don’t usually go for the food – but this is good, I can back this menu in.” He adds a side of chips to his plate of salt and pepper squid with togarashi mayo, spring onion salad and burnt lime, while I go for the enormous crispy fish burger with salad and fries (it’s delicious, but it’s also the most awkward food you can eat while interviewing someone). For drinks, it’s a large soda water with lime for both of us.\n\nAdvertisement\n\nHe won’t say if the pub, which featured in the ABC TV series Jack Irish, is his local – although staff member farewells him by name when we leave – but he did attend primary school nearby, in Clifton Hill. He won’t give away much about his family: I try to sidle in by talking about my young daughter, knowing he also has a daughter, and for a moment, it looks like he’s going to say something before he decides not to. Same story when I ask about his parents. Do they watch his show, are they proud? “I’m not a doctor, so you know…,” he jokes. What he does confirm, however, is that he is related to Lorrae Desmond, aka Shirley from A Country Practice aka Australian TV royalty. When I read that, I honestly thought it was made up. She is his mum’s cousin – although his mum had never met her – and Pang arranged to present with Desmond at the Logies in 2017. The enormous crispy fish burger with salad and chips. Credit: Luis Enrique Ascui “We grew up hearing about this mythical figure,” says Pang. “She was on A Country Practice, and she won a Gold Logie and had her own show … the Logies asked if I wanted to present with Ed or Tom [his Have You Been Paying Attention co-stars] but I said I’ll present at the Logies if I can do it with Lorrae Desmond, which was an odd request. “And they found her. She was living in Bowral [she died in 2021]. She hadn’t been on telly for ages. And it was a special moment. There’s a lot of love in the room for it. And I remember – it’s the only time I met [Mushroom Records boss] Michael Gudinski – he came up and said, ‘Well done. Well done on celebrating and getting her here tonight, so that people can pay tribute to her.’ It was like, you know, I can do nice things … I think I made mum proud.” Lorrae Desmond as Shirley in A Country Practice. While Pang may see no point in talking about himself, he is one of our most in-demand small-screen personalities, who manages to work simultaneously across two commercial networks (on Have You Been Paying Attention and Sam Tonight on Ten and the Logies and The Front Bar on Seven). He has also logged several stints at SBS, co-hosting Eurovision for eight years with Julia Zemiro, as well as two seasons of the FIFA World Cup show Santo, Sam and Ed’s Cup Fever! and one year of the short-lived quiz show ADbc.\n\nAdvertisement\n\nThat’s a lot of TV. This year alone, he’ll have been on our screens for, say, about 40 out of the 52 weeks in a year. “This will be as – what’s the word? – combative as I get,” he says. “If you add up the hours, what is it, about 90 [hours across the year]. So if you, say, hosted a nightly news program or a breakfast television show, they’re on five days a week, for three and a half hours a day. “I don’t feel like I’m on that much … but for the next eight weeks, you’ve got me for eight hours, OK? My work ethic is ridiculously overblown. There’s the illusion of busyness.” Sam Pang is one of the rare small-screen personalities who is working across multiple networks. Rosie O’Donnell and Sam Pang in epsiode one of season two of Sam Pang Tonight. And yes, they got a new chair for the guests. His chat show returned for its second season on Monday night this week. The first season, which debuted in March for an eight-week run, was the first time Pang had gone solo since ADbc in 2009. It was a rough ride, with ratings diving after the first episode premiered to mixed reviews, while viewers had opinions on everything from the choice of guests to the cheap-looking set (in particular, he desperately needed a new guest chair). Pang, however, says he was not bothered by the feedback. Or the ratings, which started at about 799,000 (for comparison, on that same night, Married At First Sight on Nine held 2.43 million viewers captive), but then dropped away before a small recovery at the end.\n\nAdvertisement\n\n“If the trend of the viewers had kept on going – I think someone described it as a J curve or something like that – I didn’t look at the ratings, but there’s other people that do. I just feel like there’s nothing that I can control less. On Monday night, we’ll do the show and, hopefully, enough people watch that the network says you’re on again next week. That’s all. Loading “I was on Have You Been Paying Attention and The Front Bar when no one watched them. And I thought, when I did them at the time, that we had a good time shooting them and then the idea that [the ratings the] next day would affect the enjoyment or satisfaction [I had] of the night before, you know, that’s not a good model. But there’s commercial realities, and if it just started off at this number and it went down, I understand you don’t survive.” The thing is, Pang is a survivor. His rise from working in a bottle shop in his 20s, after several false starts at university, to manning the phones for Melbourne community radio station 3CR and then a spot on Triple R’s breakfast show to, eventually, TV and commercial radio is well known. It’s a rare path to tread, especially when you don’t have connections, apart from a neighbour who was a Triple J producer who suggested community radio. “It wasn’t paid, I was a volunteer,” he says of his start on 3CR. “It was like I was in a radio station. That’s cool.” He first words on air, as a fill-in host for the Marngrook Footy Show, were “Hello, welcome to the Marngrook Footy Show, I’m Sam Pang, and I’m not Indigenous.” The bill After that, it was just one step after another, no great light bulb moment, no great magical career plan. He won’t say if he’s signed on for the Logies again next year – although it’s hard to imagine Seven won’t have him back, as this year’s broadcast was its highest rating since 2012, with an average national audience of 1.43 million.\n\nAdvertisement",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/good-food-guide-restaurant-of-the-year-corner-75-20251013-p5n23q.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Good Food Guide Restaurant of the Year: Corner 75",
        "publish_date": "Tue, 14 Oct 2025 12:01:07 +1100",
        "category": "finance",
        "authors": [],
        "text": "Good Food Guide Restaurant of the Year: Corner 75\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/good-food-guide-young-chef-of-the-year-jen-kwok-lee-20251013-p5n23v.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Good Food Guide Young Chef of the Year: Jen Kwok Lee",
        "publish_date": "Tue, 14 Oct 2025 12:01:07 +1100",
        "category": "finance",
        "authors": [],
        "text": "Good Food Guide Young Chef of the Year: Jen Kwok Lee\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/good-food-guide-bill-granger-trailblazer-sharon-winsor-20251013-p5n23z.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Good Food Guide Bill Granger Trailblazer: Sharon Winsor",
        "publish_date": "Tue, 14 Oct 2025 12:01:07 +1100",
        "category": "finance",
        "authors": [],
        "text": "Good Food Guide Bill Granger Trailblazer: Sharon Winsor\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/world/middle-east/israeli-hostages-david-and-ariel-cunio-are-reunited-with-loved-ones-20251014-p5n2bz.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Israeli hostages David and Ariel Cunio are reunited with loved ones",
        "publish_date": "Tue, 14 Oct 2025 12:01:07 +1100",
        "category": "finance",
        "authors": [],
        "text": "Israeli hostages David and Ariel Cunio are reunited with loved ones\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/business/companies/kyle-and-jackie-o-back-losing-listeners-as-abc-picks-up-market-share-20251014-p5n2b1.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Kyle and Jackie O back losing listeners as ABC picks up market share",
        "publish_date": "Tue, 14 Oct 2025 12:00:57 +1100",
        "category": "finance",
        "authors": [
            "Calum Jaspan"
        ],
        "text": "The progress Kyle Sandilands and Jackie ‘O’ Henderson made in Melbourne has stalled, with the radio duo losing more listeners in the city, at a time the media regulator prepares sanctions on KIIS Network’s owner for failing to rein in their stars.\n\nThe Kyle and Jackie O Show, which this month picked up seven new breaches of broadcasting decency codes, surrendered 0.1 of a percentage point in Melbourne, according to the latest radio ratings.\n\nKyle Sandilands and Jackie ‘O’ Henderson have had their ratings slip as they await the media regulator to announce penalties for their station’s owner.\n\nThe show has shown recent signs of life after a horror first year in Melbourne, growing its share in the two previous ratings survey, but now landing on a 6 per cent share. It fell back to eighth place in the market in the all-important breakfast slot. The set survey timeslots do not always completely line up with the run time of different shows.\n\nDespite the recent gains, The Kyle and Jackie O Show finds itself largely with the same audience size compared to the same survey one year ago, with 427,000 Melbourne listeners across the survey period, which spanned July 20 to September 27. In the corresponding survey in 2024, there were 420,000 cumulative listeners.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/cricket/nsw-cricketer-reported-for-alleged-lewd-wicket-celebration-20251014-p5n2at.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "NSW cricketer reported for alleged lewd wicket celebration",
        "publish_date": "Tue, 14 Oct 2025 12:00:00 +1100",
        "category": "sports",
        "authors": [
            "Tom Decent"
        ],
        "text": "NSW Blues player Joel Davies has been reported for allegedly making a lewd gesture during a premier cricket match on the weekend.\n\nCricket NSW confirmed Davies, a full contracted male player, has been reported for an incident during a first-grade match on Sunday between Manly and Sydney University.\n\nAfter taking a wicket, Davies celebrated by thrusting his hips in the direction of a Sydney University batsman.\n\nThe incident was not reported by on-field umpires. Davies has been reported under Cricket NSW’s code of conduct but, so far, has not been charged.",
        "source": "TheAge"
    },
    {
        "url": "https://au.news.yahoo.com/major-airline-drops-huge-change-011554087.html",
        "title": "Virgin cuts bag item allowance in big change",
        "publish_date": "2025-10-14T01:37:07Z",
        "category": "finance",
        "authors": [],
        "text": "Virgin Australia passengers will soon be able to carry more weight in carry-on luggage, but with the number of items reduced.\n\nEconomy passengers are currently permitted to bring two items weighing up to 7kg combined, plus a small personal item.\n\nBut, from February 2, that limit will be increased to 8kg, but only for a single item.\n\nPassengers will still be permitted to carry a single personal item, such as a handbag or laptop.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nVirgin Australia Chief Operations Officer Chris Snook said the changes were based on team member and guest feedback.\n\nVirgin Australia passengers will soon be able to carry more weight in carry-on luggage. Picture: NewsWire / Jeremy Piper\n\n“(The changes) will help deliver an enhanced on-board experience, while keeping the boarding process simple and consistent,” he said.\n\n“The result will be a smoother start to the journey and a more comfortable experience on board.\n\n“We want your bag, where you sit.”\n\nHowever, the number of items has reduced.\n\nBusiness Class, Economy X and other loyalty program members will be able to carry two bags up to 14kg, plus one small item.\n\nThe same size limits will continue to apply.\n\nWight limits of 7kg have generally been the standard across Australia’s airlines.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nQantas allows one 7kg bag on its international economy flights, or one piece totally 10kg or two pieces totally 14kg on domestic flights.\n\nVirgin also announced on Tuesday that Velocity Frequent Flyer members would be able to redeem their points to book small cats and dogs on new pet-friendly flights.\n\nThe carrier announced last month that it would be operating Australia's first-ever flights with pets on board on services.\n\nThe flights will be between Melbourne and the Gold Coast and Melbourne and the Sunshine Coast, and will commence October 16.",
        "source": "Yahoo"
    },
    {
        "url": "https://au.news.yahoo.com/beyond-qantas-data-leak-australian-011904512.html",
        "title": "Beyond Qantas’ data leak, Australian finance companies are also at risk of offshore hacks",
        "publish_date": "2025-10-14T01:19:04Z",
        "category": "finance",
        "authors": [],
        "text": "Australians are once again being warned to tighten their online security and be extra alert to scammers, after up to 5.7 million Qantas customers’ personal details – including phone numbers and birthdays – were leaked to the dark web on Sunday.\n\nCyber crime supergroup Scattered Lapsus$ Hunters accessed the data back in June by convincing a Manila-based call centre operator to give the hackers access to their Salesforce system.\n\nOn Monday, federal Cyber Security Minister Tony Burke said: “You can’t simply outsource to other companies and think suddenly you’ve got no obligations on cyber security… There are very serious penalties.”\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nBut what are those potential penalties for Qantas? And why is a corporate watchdog warning about even more serious data theft risks when Australian finance companies outsource their work overseas?\n\nWhat penalties could Qantas face?\n\nLaw firm Maurice Blackburn has lodged a complaint over the Qantas data breach with Australia’s independent privacy regulator – the Office of the Information Commissioner – alleging the airline breached privacy laws by failing to adequately protect customer information.\n\nWhen asked by the ABC, the commissioner’s office wouldn’t comment on whether Qantas would be fined over this latest breach.\n\nSo how much is the maximum fine for breaches like this?\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nUnder the Privacy Act, serious or repeated privacy breaches can now incur fines of up to A$50 million or 30% of a company’s adjusted turnover during the period of the breach – whichever is greater.\n\nThis Qantas data breach is less serious than those that hit Optus and Medibank in 2022. For instance, hackers shared Medibank customers’ highly sensitive medical history data, and stole valuable identity document data, including credit card, passport and driver’s licence details. That matter is still before the courts.\n\nWhile the Qantas data was still sensitive – including customers’ dates of birth, phone numbers, addresses, emails and frequent flyer numbers – it presents less of a risk for individual customers.\n\nBesides penalties under the Privacy Act, Qantas also faces a potential class action, which affected Qantas customers can join.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nAnother potential outcome for Qantas could be a court-ordered payment scheme, in which individuals affected by the breach may be eventually entitled to compensation from Qantas.\n\nWe saw a similar arrangement for Facebook users affected by the Cambridge Analytica data breach a decade ago.\n\nWhat are the rules for companies sharing your data overseas?\n\nThe Australian Privacy Act has specific provisions covering how companies handle your data when they send it overseas.\n\nImportantly, when an Australian company gives your data to an offshore entity, the Australian company remains accountable for ensuring your data is kept safe.\n\nThis is why it’s important for Australian companies to consider carefully the potential risks of sending Australians’ data overseas.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nThese risks should be front of mind for Qantas, which in 2024 suffered a much smaller data breach due to alleged misbehaviour of overseas contractors.\n\nHowever, these risks extend well beyond flagship companies such as Qantas.\n\nWarnings over even more sensitive data\n\nThe Australian Securities and Investments Commission (ASIC) regulates Australian markets and financial services companies. Only days ago, it warned of “governance gaps” when financial services companies outsource work overseas – and potentially put Australians’ sensitive data at risk.\n\nThis year, ASIC has taken separate court action against Fortnum Private Wealth and FIIG Securities, alleging they failed to manage cybersecurity risks affecting thousands of customers.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nIn FIIG’s case, ASIC alleges a hacker was able to steal sensitive data including passport, bank account and tax file numbers. Those court cases are yet to be heard.\n\nThe finance sector – including banks, financial advisors and superannuation funds – consistently reports the third highest number of data breaches, after the health sector and government.\n\nWhat we all need to do next\n\nAs individuals, we have relatively little control over how Australian companies handle our data, let alone the overseas companies they work with. But we can all do more to make ourselves more secure.\n\nBe on scam watch: given how many Australians were exposed in the Qantas breach, be on the lookout now for scammers.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nHistory suggests scammers target data breach victims, or people who think they may have been impacted by a data breach. If you receive a message you suspect is a scam, don’t respond – report it to Scamwatch.\n\nPractise good “cyber hygiene”: avoid using the same password on multiple websites. Instead, use a password manager that saves your passwords across your computer and mobile phone.\n\nThat way, if your data is breached at Company A, it has less chance of impacting your security with Company B.\n\nCompanies need to step up too: Australian company executives would do well to ensure their governance, risk and compliance practices are up to scratch, especially on how they manage third-party risks.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nAs consumers, we entrust our cyber security to all of the companies with whom we interact. Those companies, in turn, owe it to us to ensure the drive to maximise profits doesn’t come at the cost of leaving customers worse off.\n\nThis article is republished from The Conversation. It was written by: Toby Murray, The University of Melbourne\n\nRead more:\n\n\n\nToby Murray receives funding from the Department of Defence and Google. He is Director of the Defence Science Institute, which receives funding from the Commonwealth and State governments.",
        "source": "Yahoo"
    }
]