[
    {
        "url": "https://www.9news.com.au/national/fifth-man-charged-for-alleged-involvement-in-sydneybased-satanic-child-abuse-ring/50c041c0-f4fc-4849-be08-f8b2e35a4e8d",
        "title": "Fifth man charged for alleged involvement in Sydney-based satanic child abuse ring",
        "publish_date": "Fri, 23 Jan 2026 00:41:43 +0000",
        "category": "sports",
        "authors": [
            "Jan"
        ],
        "text": "﻿\n\n: Stay across all the latest in breaking news, sport, politics and the weather via our news app and get notifications sent straight to your smartphone. Available on the",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/coalition-split-sussan-ley-absolutely-confident-in-leadership/2090826a-0627-48c7-a7e5-32c8cb78e72a",
        "title": "'Door is open but I'm not looking', Ley says after Coalition split",
        "publish_date": "Thu, 22 Jan 2026 22:36:11 +0000",
        "category": "finance",
        "authors": [
            "Jan"
        ],
        "text": "Opposition Leader Sussan Ley says she is \"absolutely confident\" in her position heading up the Liberal Party after the Coalition's shock split this week .\n\nThe Nationals ruptured with the Liberals for the second time in just months over the government's hate speech and gun control laws that passed parliament last week.\n\nNationals leader David Littleproud said the partnership was \"untenable\" under Ley's leadership .\n\nOpposition leader Sussan Ley. (Today)\n\n﻿Appearing on Today , Ley said the Liberals had stood firm on their principles, including shadow cabinet solidarity.\n\n\"My focus is always on making sure we hold the government to account,\" she said.\n\n\"I've said it before, I'll say it again, the Coalition is stronger together.\"\n\nLey and Nationals leader David Littleproud in the House of Representatives. (Alex Ellinghausen)\n\nShe said the parties had a responsibility to work together \"constructively, calmly\" and claimed there was respect between MPs still.\n\n\"The door is open, from my point of view, but I'm not looking at the door,\" she said.\n\nShe also dismissed suggestions her leadership was under threat, saying that the Coalition had \"improved\" the government's laws.\n\nLey said the Liberal party had stood for its principles after the Bondi terror attack. (Getty)\n\n\"I have led, and with respect, we've had genuine wins, with all of the things that we've done so far,\" she said.\n\n\"I am absolutely confident in the leadership that I have delivered, the leadership I will deliver, and the strength of effort that my party and I are making every single day.\"\n\nRumoured leadership contestants Andrew Hastie and Angus Taylor were \"strong, committed members of my team\", Ley said.\n\nLittleproud told Today it was Ley who \"broke the Coalition\" by accepting the resignations of shadow frontbenchers who refused to support the government's bill.\n\nHe also claimed the usual processes of party-room disagreements weren't followed.\n\n\"We are allowed, as a party, to have the courage of our conviction to stand up for ourselves,\" he said.\n\nMake 9News your preferred source of breaking news and exclusives on Google by clicking the image above. (Nine)\n\nAnd while the Liberals and Nationals were aligned on many things, he said, \"there's this perception the Coalition is one party, and it's not\".﻿\n\nNationals Senator Matt Canavan said the party had proposed \"reasonable amendments\" to the government's laws that were knocked back by the leadership.\n\n﻿\"My crime, if there is one, is doing my job as a parliamentarian,\" he said.\n\n\"I mean, what are we there for, but to make sure the laws that are passed in this country are the best for the people of Australia.\"",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/iranian-students-in-australia-helpless-as-economy-hits-record-low/1ab499e3-5048-41e3-a900-8f771c555e75",
        "title": "Iranian students in Australia facing 'darkest days' as economy hits record low",
        "publish_date": "Thu, 22 Jan 2026 19:18:26 +0000",
        "category": "finance",
        "authors": [
            "Jan"
        ],
        "text": "Exclusive: Ongoing turmoil in Iran has had a ripple effect on Iranian students in Australia , with some unable to pay for basic living expenses and tuition fees due to the economic crash in the nation.\n\nThe latest protests in ﻿Iran erupted in late December following civil unrest against the Islamic Republic government and the economic crisis.\n\nThe value of the Iranian rial plummeted to a record low ﻿amid the collapse, resulting in further revolts that rapidly spread across the entire nation.\n\nThe value of the Iranian rial plummeted to a record-low ﻿amid the collapse. (Getty)\n\nBefore the ﻿unrest, $1 was worth about 28,000 Iranian rial.\n\nNow, a $1 coin is worth over 720,000 rial.\n\nThe collapse has had significant consequences on Iranian students living in Australia, including ﻿business student Fatemah*.\n\n\"I have lots of worries about survival, how to survive financially,\" she told 9news.com.au.\n\n\"Here in Australia, sometimes the tuition fees and other things like rent increase, and it makes some problems for me.\n\n\"﻿Even very basic things, for example, shopping for groceries, I must check everything.\"\n\nREAD MORE: Donald Trump appears to mix up Greenland and Iceland four times\n\nProtesters dancing and cheering around a bonfire. (AP)\n\nFatemah came to Australia in 2022 to study IT and graduated with a Master of Business Information Systems.\n\nShe has had to pick up several jobs to stay afloat due to the collapsing Iranian economy.\n\n\"Because I need money , I (am) working in restaurants and some casual jobs.\"\n\nWhen Fatemah arrived in Australia, she was unable to convert all of ﻿her money to Australian currency due to international sanctions on Iranian banks, an issue many people from the nation are facing.\n\n\"I just want to have enough money to survive,\" she said.\n\n\"My family told me to just focus on (my) studies and to find a job related to my knowledge and expertise.\n\n\"But now it doesn't matter to me. I work in restaurants.\n\n\"I just want to cover my (expenses).\"\n\nMake 9News your preferred source of breaking news and exclusives on Google by clicking the image above. (Nine)\n\nFatemah said her family in Iran are also experiencing the effects of the economic crash and deadly protests.﻿\n\n﻿\"I'm worried about their safety,\" she said.\n\nZahra*, an Iranian student studying in Melbourne , told 9news.com.au that her family has been deeply affected by the uprising.\n\n\"I'm worried sick about my family and my friends, who I haven't heard from for a long time now, because there's a blackout in Iran,\" she said.\n\n\"My sister could call me several times in the past few days.\n\n\"I could hear her voice, but what I heard wasn't actually assuring because I could see that she was so terrified.\"\n\nZahra, who was in Iran during several protests, including the Women, Life, Freedom revolution of 2022, said the nation was battling a regime that will not give up power.\n\n\"They get more aggressive because they want to remain in power,\" she said.\n\n\"So every single time (there is) a big protest, they get more aggressive. They got more violent.\n\n\"I came (to Australia) to maintain my mental health because I couldn't tolerate the environment there anymore.\n\n\"They shot at me when I was at home through the window because I was shouting, 'stop it', 'stop it'.\n\n\"They use the real army facilities against their own people. I was traumatised by the things that I experienced.\n\n\"It kind of felt like if I stay, I'm gonna get killed.\"\n\nREAD MORE: Australia marks day of mourning for Bondi terror attack\n\nPeople gather during protest in January in Tehran. (Getty)\n\nZahra left the country in 2023, selling her apartment and car to start a new life for herself in Australia.\n\nHowever, when she arrived, she was also unable to bring all her money due to the sanctions in the nation.\n\n\"I couldn't transfer all my money at once, but I brought some,\" she said.\n\n\"When the economy started collapsing, it was hard for me to convert the money.\n\n\"I started working here because I couldn't pay for living costs anymore based on my savings.\"\n\nREAD MORE: Bill and Hillary Clinton risk prison after vote by Epstein committee\n\nProtests against the Iranian government have taken place globally. (AP)\n\nZahra put a large ﻿portion of her money into paying off her student loan, and when the economy collapsed was left financially stranded, having to ask her father in Iran to lend her money.\n\nShe believes that universities should consider postponing tuition fees of affected students due to the financial hardships the economic crash has caused.\n\n\"﻿Don't put more pressure on the students,\" she said.\n\n\"(We) are already in a very, very bad situation. We are in the darkest days of our lives.\n\n\"Don't put more pressure on us, understand us.﻿\"\n\nThe demonstrations have quickly become the largest uprising in the nation since the 1979 Islamic Revolution, claiming the lives of ﻿at least 3766 people, with a high probability of a significantly higher death count.\n\n﻿The Human Rights Activists News Agency also reported that 24,348 protesters were arrested in the crackdown.\n\n*Names have been changed to protect identities.﻿",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/world/donald-trump-tenacious-d-kyle-gass-says-hes-hashed-it-out-with-jack-black/c778dbac-337b-4403-833c-3817cd7ca2af",
        "title": "'Bigger than Oasis' return promised for Tenacious D after Trump backlash",
        "publish_date": "Thu, 22 Jan 2026 14:08:38 +0000",
        "category": "entertainment",
        "authors": [
            "Jan"
        ],
        "text": "Tenacious D's Kyle Gass says he's \"hashed it out\" with Jack Black after his controversial comment about an assassination attempt on US President Donald Trump forced the cancellation of their Australian tour and threatened the band's future.\n\nIn a Rolling Stone interview that delved deep into the ferocious global backlash to his ill-judged quip onstage in Sydney last year , the guitarist joked the band's return would be \"bigger than Oasis\" and labelled an Australian senator a \"grandstander\" over calls for them to be deported.\n\nGass said he'd been having \"the greatest day ever\" when the duo behind the ARIA platinum-selling single Tribute took to the stage for their second show at the ICC Sydney on his birthday in July last year.\n\nTenacious D has postponed its concert in Newcastle tonight amid backlash against a joke made about the the attempted assassination of Donald Trump. (Facebook/Tenacious D)\n\nBut then he uttered the \"five one-syllable words that brought down the empire\".\n\nPresented with a cake and asked by Black to make a wish, Gass joked, \"Don't miss Trump next time.\"\n\nIt was the same day Thomas Matthew Crooks left Trump bleeding from the ear with an assassination attempt at a rally in Butler, Pennsylvania.\n\n\"I'm human, I made a mistake. I was going for a joke. But timing is everything. If there was ever a 'too soon', it was this,\" Gass told the magazine.\n\nIt wasn't until the band were \"partying in my hotel room\" after the show that they started to see reports of his comments and Gass realised what was coming.\n\n\"It's overwhelming. It's like a tsunami of shit rolling over you. And then there's the regret. Like, 'Why would I do that?' I just didn't put it together. And the ramifications were so huge,\" he said.\n\nGass said there were even \"safety concerns\" and someone called his \"poor 95-year-old mum\".\n\nJack Black celebrates with Kyle Gass for his Tenacious D bandmate's birthday on July 14. (Facebook)\n\nBlack cancelled the tour and put \"all future creative plans … on hold\" as those involved went into damage control, sparking criticism from some corners that the movie star had thrown his decades-long friend under the bus to protect his Hollywood career.\n\nGass said it didn't really surprise him.\n\n\"I might have deserved it,\" he told Rolling Stone in an interview published on Wednesday.\n\n\"Or, he had to protect himself from his loose-cannon partner over here. I totally understood once safety concerns got in.\n\n\"I might have tried to finish the tour, and I think sometimes these things can blow over, but at the time, it's hard when the tsunami of shit is coming at you.\"\n\nGass said it was \"hard\" but he and Black later \"hashed it out\".\n\n\"Jack and I are all good. At the end of the day, we're friends. I've known Jack since he was 18, and it's been such a long marriage, really.\n\nTenacious D cancelled their Newcastle concert on Tuesday, July 16, 2024, before cancelling the whole Australian tour. (Tenacious D/Instagram)\n\n\"You go up and down, and we've always taken long breaks. He's had a lot of stuff to do, and I've got my other projects. So it doesn't even feel that different now.\"\n\nThe 65-year-old, whose Kyle Gass Band project has a new live album coming out, also had a parting shot for United Australia Party senator Ralph Babet who called on then-Immigration Minister Andrew Giles to deport the duo.\n\n\"It didn't take long to be like, 'Oh, this guy is such a grandstander',\" Gass told Rolling Stone .\n\n\"We're so used to it over here, where people take the opportunity to make a grand statement. And then the next day, my agent dropped me . And I was like, 'Well, gee, it would have been nice to at least talk to you or something'.\n\nGass had a parting shot for United Australia Party senator Ralph Babet. (Alex Ellinghausen)\n\n\"But I think he wanted to get in the news cycle too … It did feel like an overreaction. But that speaks more to my relationship with my agent.\"\n\nBlack last August said the band would \"be back when it feels right\" and Gass was even more enthusiastic this week.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/men-at-work-colin-hay-condemns-use-of-down-under-at-march-for-australia-rallies/deca0bdd-3317-4268-9793-2cd394fcb99c",
        "title": "Songwriter condemns use of Down Under at March for Australia rallies",
        "publish_date": "Thu, 22 Jan 2026 03:28:25 +0000",
        "category": "entertainment",
        "authors": [
            "Jan"
        ],
        "text": "Former Men at Work frontman Colin Hay has condemned the use of his 1981 hit ﻿ Down Under at March for Australia rallies, telling organisers and attendees to \"go write your own song\". ﻿\n\nHay, who emigrated with his family from Scotland in 1967, co-wrote the song that went on to become an Australian classic.\n\nThat song has been hijacked by some anti-immigration demonstrators and played at their rallies.\n\nColin Hay, the former frontman of Men at Work. (Simon Schluter)\n\nHay has criticised their use of his song, which he said did not align with its meaning or intent.\n\n\"Let me say that I most strenuously disapprove of any unauthorised, unlicensed use of Down Under , for any 'March For Australia' events,\" he said in a statement posted on social media.\n\n\" Down Under , a song I co-wrote, does not belong to those who attempt to sow xenophobia within the fabric of our great land, our great people.\n\n\" Down Under is ultimately a song of celebration. It's for pluralism and inclusion; unity, not division.\n\n\"Go write your own song, leave mine alone.\"\n\nThe artist signed off his statement with: \"Colin Hay (immigrant).\"\n\nHay is not the first artist to come out and denounce the use of his song at March for Australia events.\n\nMen at Work in 1983: Greg Ham, John Rees, Colin Hay, Roy Strykert and Jerry Spicer.\n\nCountry music singer John Williamson and punk rock band The Living End have publicly criticised the use of their music at the rallies, while PR representatives for Jimmy Barnes and Icehouse have said no approval was sought or granted to play their music at the same events.\n\n\"To be absolutely clear, the goals and philosophies of these marches are abhorrent to us, and we don't support them in any way,\" The Living End said.\n\n\"Our songs are written to bring people together, not to divide them, and especially not to be used in this way.\n\n\"In summary: F--- Nazis.\"\n\nWilliamson said: \" True Blue is a song for all Australians and should not be hijacked by any group that seeks to use the song to sow division.\n\nMake 9News your preferred source of breaking news and exclusives on Google by clicking the image above. (Nine)",
        "source": "9News"
    },
    {
        "url": "https://www.abc.net.au/news/2026-01-23/indra-brown-australia-15-year-old-freeski-halfpipe-star/106220172",
        "title": "Meet the 15yo Melbourne schoolgirl who has taken the Freeski world by storm",
        "publish_date": "Fri, 23 Jan 2026 02:02:59 +0000",
        "category": "sports",
        "authors": [],
        "text": "As 2025 ticked over into the Olympic year of 2026 in Indra Brown's household in Calgary, Canada, the popping of champagne corks had a slightly different feel to it.\n\n\"I got some practise over New Year's helping the parents pop from some bottles,\" Brown told ABC Sport with a laugh.\n\n\"Which was pretty fun.\"\n\nYou could be forgiven for being slightly concerned that a 15-year-old Melbourne schoolgirl was being co-opted into popping bottles of champagne.\n\nBut this was important, you see. Brown needed the practice.\n\nEarlier in December, at 15 years and 10 months old, Brown became the youngest Australian snow sport World Cup medallist in history, winning bronze in the Olympic halfpipe at the Secret Garden resort in Zhangjiakou, China.\n\nIndra Brown (right) stands on her first World Cup podium with stars Zoe Atkin (left) and Eileen Gu Ailing (centre). (Getty Images: Lintao Zhang)\n\nDespite it being her World Cup debut, Brown instantly showed she belonged on the world stage.\n\nLoading...\n\nHer dazzling performance put her on the podium alongside three-time Olympic medallist and defending Olympic champion Eileen Gu and defending world champion Zoe Atkin — illustrious company indeed.\n\nHer lack of World Cup experience did not show on the snow.\n\nBut when it came time to pop the corks on the celebratory champagne, Brown looked a little bit out of her depth for the first time.\n\nFortunately, Gu was on hand to help in what turned into one of the most innocent, heartwarming exchanges on the tour this season.\n\nEileen Gu helps Indra Brown with her champagne. (Supplied: FIS Park and Pipe)\n\nGu, the America-born Chinese superstar who became the first freestyle skier to win three medals at a single Winter Olympics in 2022, is one of the most recognisable athletes in the world, having appeared on the front cover of Elle, GQ and Vogue, amongst others.\n\nThe surrealism of having this global megastar help her out on a World Cup podium was not lost on Brown.\n\n\"It was an extremely special moment,\" she said.\n\n\"Just to stand there with an idol that I've looked up to for so long.\n\n\"That big-sister moment with her helping me out with the champagne, that made it even better.\"\n\nRecord-breaking start\n\nIndra Brown has finished third, second, first and fourth in her first four World Cup events. (Getty Images: Sean M. Haffey)\n\nWith such a brilliant start to her career, there's little surprise that with just five FIS World Cup starts under her belt, Brown has been named to the Australian Winter Olympic team to compete in the Milan Cortina games next month.\n\nAustralia names 53-strong Winter Olympic team From five teenagers making their Winter Olympics debut to five-time Olympian and gold medal hopeful Scott James, Australia has named its second-largest team in history for the Milan-Cortina Games.\n\nIt takes a rare talent indeed to be able to jump straight into the cut and thrust of elite competition and look at home.\n\nEven for the world's greatest winter sports athletes, those who make sliding appear an art and seem to bend the most treacherous terrains to their will, baby steps are the wisest way to proceed, at first.\n\nWhich is why the start to Brown's World Cup career has been so extraordinary.\n\nOf course, Brown is not new to skiing — she has been on snow since she was 3, family trips to Mount Hotham sparking a love that was honed into artistry during five years living in Calgary, Canada.\n\n\"I think I just loved the thrill of it,\" she told ABC Sport from Aspen, Colorado, a day out from her fourth World Cup event, where she would finish fourth.\n\nIndra Brown made her first World Cup appearance at Secret Garden in Jiangjiakou, China. She won bronze. (Supplied: FIS/Li Runsheng)\n\n\"I think the fun aspect was a huge part of [pursuing freestyle skiing] and the creativity you can have just to express yourself and show the true love you have for the sport.\n\n\"You can be creative, change your style — there's no right or wrong in the sport.\n\n\"It just gives that way of freedom and a sense of just being able to express yourself in such a fun way.\"\n\nHaving fun is one thing. But surely not even in her wildest dreams did she expect to hit the ground running to the extent that she has done on the World Cup circuit.\n\nThere was that third place on debut in the 2022 Olympic halfpipe at the Secret Garden resort in Zhangjiakou.\n\nThen, a second place a fortnight later in Copper Mountain, Colorado.\n\nIndra Brown has soared high in record time. (Getty Images: Sean M Haffey)\n\nThen, remarkably, a maiden World Cup gold medal — in just her third World Cup start — on home snow in Calgary.\n\nIt was only the second time in history that an athlete won three medals in their first three World Cup freeski starts, equalling Swedish skier Jennie-Lee Burmansson.\n\n\"I think I just wanted to go in and land a run,\" Brown said of her breakout debut performance in China.\n\n\"I've been working really hard this season.\n\n\"So just to go out there and land a run I was really happy with … and then get the result I got, just made it even more incredible. I couldn't be happier.\n\n\"It definitely gave me lots of confidence just to know that I do belong here and I can contend with these incredible athletes.\n\n\"It boosted my confidence a lot, for sure.\"\n\n'It's a pretty special thing to be able to give a kid an opportunity to dare to dream'\n\nIndra Brown is shooting for the stars. (Getty Images: Lintao Zhang)\n\nBrown, one of four children, has been travelling the tour this season with her mum, Anne, and her younger brother, who also shows an aptitude for skiing.\n\nHer dad, Grant, has been back at home in Melbourne with her other two siblings for most of the year, but did head over to Canada and the USA for Christmas and will be in Livigno for the Olympics.\n\n\"For us it's just wonderful,\" Grant told ABC Sport.\n\n\"The happiness that the sport gives Indra.\n\n\"So long as she's still performing and she's really genuinely enjoying it, and it's her choice to do this, if all those planets align, it's a pretty special thing to be able to give a kid an opportunity to dare to dream and that's what she's thriving on at the moment.\"\n\nIndra Brown first skied in a halfpipe in Calgary, where she won her first World Cup gold. (AP Photo: The Canadian Press/Jeff McIntosh)\n\nGrant said one of the most important things — apart from ensuring that Indra kept up with her schoolwork — was how well his daughter had been welcomed onto the tour, a supportive environment that was allowing her to thrive, the Zhangjiakou champagne moment a perfect example.\n\n\"That sense of community is a really, really important thing,\" he said.\n\n\"You've got these athletes that come together from all parts of the world for competitions, or training camps or whatever, and they genuinely enjoy seeing each other, hanging out, as well as being able to ski together.\n\n\"That's been really reassuring for us as parents.\"\n\nIndra has plenty of people she can talk to about what it is like making the Olympics at such a young age.\n\nBrown will be the youngest Winter Olympian to represent Australia since Scotty James and Britteny Cox both competed as 15-year-olds.\n\nShe said that she had spoken to Guseli, who finished sixth in the snowboard halfpipe in Beijing as a 16-year-old and had gone on to become the only snowboarder in history to win a World Cup medal in all three park and pipe disciplines in a single season.\n\nIndra Brown won her first gold in Calgary, the first halfpipe she ever competed on. (Supplied: FIS Freeski)\n\nInjury stymied his quest for a spot in all three events at this year's Games, something Brown hopes to achieve in 2030 when the Games shift over to the French Alps.\n\n\"I've definitely been speaking to Val and all the other Aussie athletes, it's been super nice just to get their insight on taking in this experience,\" she said.\n\n\"It's such a special, once-in-a-lifetime thing. So just taking it in, not putting any pressure on myself, just having fun, enjoying the moment and just seeing where I go.\n\n\"It's been really special to have such a great team and group of athletes around me.\"\n\nBrown also credits her \"amazing\" mum and family for all their support as she competes, including keeping her supplied with a steady amount of the two Australian staples she can't live without: Weetbix and Up and Go.\n\nIt's things like that which, despite Brown having a definite Canadian twang, means she was never going to represent Canada in international competition: \"No,\" she said, \"I'm full Aussie\".\n\nAnd her stunning rise means she is heading to Milan a genuine medal chance.\n\n\"It's a dream come true to be able to represent Australia at the Olympics,\" she said.\n\n\"It's something I think, once I really start to get into skiing, I wanted to do for so long and dreamt of.\n\n\"To have this opportunity at my age and to be getting these experiences, it's just incredible.\n\n\"I'm so excited to get to Milan.\"\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2026-01-23/ben-lee-bernard-fanning-2005-tea-sympathy-precocious-awake-sleep/106254430",
        "title": "The heartbreak and hope behind the two songs that topped the Hottest 100",
        "publish_date": "Fri, 23 Jan 2026 01:54:47 +0000",
        "category": "entertainment",
        "authors": [],
        "text": "Hope. Loss. Redemption. And some insanely catchy riffs.\n\nBernard Fanning's Tea and Sympathy and Ben Lee's Awake Is The New Sleep both came out 20 years ago and share deep elements.\n\nBarn-storming songs from each of them — Wish You Well and Catch My Disease — were inescapable.\n\nInfectious, warm and open-hearted, they rightly topped the Hottest 100 of 2005 and remain Australian classics that soundtrack events, cause sing-a-longs at live gigs and see a new life in remixes.\n\nBut it's much more than that.\n\nHitting the bottom and bouncing\n\nDespite the pair being vastly different people, the parallels of their immensely hopeful albums are astonishing, espousing kindness and a peaceful strength.\n\nThey were, and are, templates for hope in difficult times.\n\nFanning's older brother, John, had died of cancer, his long-term relationship had ended and his band, Powderfinger — the most famous in the country — was taking a year off, beaten down by relentless touring and recording.\n\nBen Lee and Claire Danes split in 2003 after six years together. (Getty: Steve Granitz)\n\nLee had separated from Claire Danes — a Gen X icon, stealing hearts in Baz Luhrmann's electric 1996 film Romeo + Juliet — and was going through a \"spiritual crisis\" amid that implosion.\n\nIt was the end of a Bondi-to-Hollywood fairytale.\n\nThe actress began a new relationship with Billy Crudup that also left adrift actress Mary-Louise Parker, heavily pregnant at the time with baby Crudup.\n\nTwo very different men\n\nFor two men in a narrow field — super-famous male Australian musicians — Ben Lee and Bernard Fanning are very different people.\n\nThe frontman of one of the nation's most enduring bands, Powderfinger, Fanning had ground out an unsuccessful first album before the group exploded in popularity with its next effort, Double Allergic, in 1996.\n\nBy contrast, Lee broke out with punk band Noise Addict in 1995, barely 16 years old, before a hit solo record Breathing Tornados in 1998.\n\nAbrasive, ambitious and filled with accolades, he proclaimed himself the saviour of Australian music.\n\nFanning called him a \"precocious little c***\".\n\nTheir most famous run-in illustrates the essentially good-natured vibe of our music industry. We can talk about it as one of the great feuds of Australian music — when it was three words and Fanning later apologised.\n\nBen Lee's latest quirky career move Ben Lee has always been a fearless experimenter. But might his new gig selling essential oils puncture his popularity?\n\nLee was precocious — literally a child star, in a punk band in his early teens.\n\nA better description is that, in parallel with his light and love, Lee can be pugnacious.\n\nAwake Is The New Sleep is heavily influenced by his time in the US.\n\n\"I'm walking down Broadway / Each footstep is a new love letter,\" he coos on Begin, before the album goes on to name-check Beyoncé and his mates Good Charlotte.\n\nIn the US, bigness is celebrated and brashness is just show business. When Lee describes gigs as hand-to-hand combat, he's not actually punching punters.\n\nBut he doesn't seem to mind the tension.\n\n\"They don't play me on the radio,\" he sings. \"And that's the way I like it\".\n\nBy contrast, Fanning is more of a Mr Australia (although not actually related to surfing champion Mick, as many believe).\n\nLoading Instagram content\n\nHe self-deprecatingly describes the album as \"West End porch music\" and you can picture him and friends back then, strumming under the verandah of a rambling Queenslander, tooling around with an album that would still resonate 20 years on.\n\nWhere they were, where they are\n\nI saw both play gigs soon after the albums were released.\n\nAt a sweaty show in Melbourne's Corner Hotel, Lee's small stage was festooned with flowers, a nod to the album artwork. For someone who'd been through a lot, Lee seemed to be in a state of Zen-like calm throughout.\n\nThe soft guitar and keyboard intro of slow-burn Apple Candy began, a song about the triangular romantic situation.\n\nA crowd member cracked the silence.\n\n\"F*** you, Billy!\" they spat with venom.\n\nLee didn't even quiver. He kept strumming, serenely and slowly shaking his head.\n\nSmiling, he continued to play the song.\n\nInside Bernard Fanning's legendary debut album \"I happen to be in a band that's quite popular, but I don't really give a shit,\" Bernard Fanning said in 2005. \"For me, the important thing is to be able to keep writing songs.\"\n\nFanning played Melbourne's Festival Hall on what he called the \"last night of our world tour\".\n\nI've been lucky enough to see everyone from Soundgarden, INXS and Oasis to Kanye West and the Sugababes in that massive venue. But the roar when Wish You Well started is right up there.\n\nSingers Sime Nugent and Clare Bowditch joined him for Watch Over Me, rounding out a night that thousands of Melburnians will remember with great affection.\n\nFar from over\n\nLee spent last year on an anniversary tour for the album. The response was rapturous.\n\nAt the Melbourne gig, he ended each song with reverb, the sound wobbling out as the roars of applause took over.\n\nFor people who loved those albums — and those who've discovered them in the years since — many will have experienced a similar reverb in their own lives.\n\nFanning did a one-off gig in Queensland, which sold out in minutes, and is touring this year.\n\nPowderfinger would squeeze out two more albums before they called it a day: Dream Days at the Hotel Existence and Golden Rule. The band broke up in 2010.\n\nBoth Fanning and Lee kept creating.\n\nLee tours relentlessly. He has a podcast, Weirder Together, with his wife, actress Ione Skye, that mixes big questions, domestic challenges and top-tier name-dropping of late 90s, early 2000s US cultural icons. He keeps releasing new singles.\n\nFanning put our more excellent solo albums and in 2024 teamed up with Something For Kate frontman Paul Dempsey to create a supergroup self-titled album: Fanning Dempsey National Park.\n\nWhy Powderfinger got back together Bernard Fanning, Darren Middleton and Jon Coghill take us inside the Powderfinger camp.\n\nPowderfinger wasn't over either.\n\nWhen the country needed them the most — in the depths of the COVID-19 pandemic — they reformed for an online concert: One Night Lonely.\n\nAnd no-one really thinks they are done.\n\nCan you imagine the roar, at the 2032 Opening Ceremony of the Olympics in Brisbane, as The Veronicas fade out of Untouched and Powderfinger drop the guitar snarl of (Baby, I've Got You) On My Mind?\n\nYou'd hear it in Perth.\n\nDouble J relives the Hottest 100 of 2005 from midday Sunday. Get all the details here.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2026-01-23/us-and-china-sign-off-on-tiktok-agreement-to-avoid-ban/105946464",
        "title": "TikTok finalises deal to form new American version of app",
        "publish_date": "Fri, 23 Jan 2026 01:53:15 +0000",
        "category": "finance",
        "authors": [],
        "text": "TikTok's Chinese owner, ByteDance, has finalised a deal to establish a majority US-owned joint venture company to avoid a ban on the popular social media app used by more than 200 million Americans.\n\nThe ​deal is a milestone for the short video app ‌after years of ‌battles that ‌began in August 2020, when US President Donald Trump first tried unsuccessfully to ban the app ​over ⁠national security concerns.\n\nThe new app will operate under \"defined safeguards that protect national security through comprehensive data protections, algorithm security, content moderation and software assurances for US users\", the company said in a statement.\n\nAdam Presser, who previously worked as TikTok's head of operations and trust and safety, will lead the new venture as its CEO.\n\nHe will work alongside a seven-member, majority-American board of directors that includes TikTok's CEO Shou Chew.\n\nThe agreement provides for ‍investors — including ⁠cloud computing giant Oracle, private equity group Silver Lake and Abu Dhabi-based MGX — to hold a ‌stake of 80.1 per cent in the new joint venture.\n\nTikTok's Beijing-based parent company, ByteDance, will retain 19.9 per cent ownership of the company.\n\nUnder the arrangement, the joint venture will assume responsibility for content moderation within the US as well as the development and enforcement of related policies.\n\nUniversity of Technology Sydney associate professor Marina Zhang said the deal was a \"defining moment\" as the first time two governments had divided ownership of data on one platform.\n\nMarina Zhang says the agreement is important. (Supplied: University of Technology Sydney)\n\n\"It creates a template for other countries on how to separate data sovereignty and digital affairs,\" she said.\n\nStill, she said, both sides had made concessions.\n\n\"Washington gained control over data and narrative, while China preserved its intellectual property — the algorithm stayed in Beijing.\"\n\nABC/Wires",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2026-01-23/paris-hilton-returns-to-washington-for-deepfake-porn-fight/106260660",
        "title": "Paris Hilton brings sex tape story to Washington for AI porn fight",
        "publish_date": "Fri, 23 Jan 2026 01:40:55 +0000",
        "category": "finance",
        "authors": [],
        "text": "It was one of the most infamous sex tape leaks of the early internet age.\n\nA 19-year-old Paris Hilton was betrayed by a much older boyfriend who published their intimate video online without consent.\n\n\"People called it a scandal,\" Hilton, now 44, recounted for reporters and a bipartisan group of politicians outside the US Capitol in Washington DC.\n\n\"It wasn’t. It was abuse.\n\n\"There were no laws at the time to protect me. There weren't even words for what had been done to me.\n\n\"The internet was still new, and so was the cruelty that came with it.\n\n\"They called me names, they laughed, and made me the punchline.\n\n\" They sold my pain for clicks, and then they told me to be quiet, to move on, to even be grateful for the attention. \"\n\nParis Hilton (left) is supporting a push by politicians including Alexandria Ocasio-Cortez (right) to get a bill through Congress. (ABC News: Brad Ryan)\n\nHalf a century after the internet was born, online cruelty and the technology that fuels it have evolved in terrifying ways.\n\nCameras are no longer needed to perpetrate image-based abuse. Artificial intelligence is now easily harnessed to create fake pornography of real-life women.\n\nAn analysis published by the New York Times estimated one AI program, Grok, recently publicly shared at least 1.8 million sexualised images of women in just nine days.\n\nSeparate research by an advocacy group, the Center for Countering Digital Hate, estimated the number is closer to 3 million – including 23,000 images depicting children.\n\nThe chatbot, owned by Elon Musk, tightened restrictions on January 8, slowing the flood of explicit deepfakes – but many other programs exist, and new ones are being created all the time.\n\nAround the world, legislation and enforcement efforts are struggling to keep up. In Australia, deepfake image-based abuse is happening in schools every week, according to eSafety Commissioner data released in October.\n\nLike countless other girls and women, Hilton is now a constant victim.\n\n\"I know today that there are over 100,000 explicit deepfake images of me made by AI,\" she said.\n\n\"Not one of them is real, not one of them is consensual. And each time a new one appears, that horrible feeling returns, that fear that someone somewhere is looking at it right now and thinking it's real.\"\n\nParis Hilton met other anti-abuse advocates and posed for selfies outside the US Capitol. (ABC News: Brad Ryan)\n\nParty girl to politics\n\nHilton has travelled to Washington to put her famous name behind a proposed law to fight what she calls an \"epidemic\" of deepfakes.\n\nThe Disrupt Explicit Forged Images and Non-Consensual Edits Act – or DEFIANCE Act – would make it easier for victims to sue the creators of deepfake pornography.\n\nThe bill passed the US Senate unanimously last week and has bipartisan backing in the House of Representatives.\n\nIts chief supporters include Democrat Alexandria Ocasio-Cortez and Republican Laurel Lee. Ms Ocasio-Cortez said there were positive signs that the House's Republican leadership would allow a vote.\n\nBut even if it passes, it has some obvious limitations. Wily deepfake creators can easily cover their tracks. And in any case, the legislation would only apply in the United States for what is a worldwide problem.\n\nBut Hilton's celebrity is adding weight to a broader global push to tackle the problem.\n\nAsked by the ABC if she planned to take her fight beyond Washington, Hilton said the American laws were the \"first step\".\n\n\"Obviously, this is happening all around the world,\" she said.\n\n\"And I want to help everyone around the world as much as I can — so, yes.\"\n\nWhat Australians think about AI We asked readers if they had thoughts or concerns about the rise of AI. This is what they told us.\n\nHotel heiress Hilton found celebrity in the early 2000s as a paparazzi-hounded socialite and, later, reality TV star. She leaned into a bimbo persona and was commonly derided as \"famous for being famous\".\n\nIn recent years, she has effectively channelled her fame into advocacy for anti-abuse causes.\n\nIn 2022, she met officials in the Biden White House to push for legal protections for institutionalised minors.\n\nShe later testified to Congress about her experiences in youth treatment centres, where she said she was \"force-fed medications and sexually abused by the staff\".\n\nIn late 2024, she returned to Capitol Hill to watch Congress pass the protections she lobbied for. Asked at the time if she would ever run for public office herself, she said: \"I can maybe see that happening.\"\n\nAsked the same question at Thursday's press conference, she said she was \"just happy to be here to support\" the cause.\n\n\"Coming here to the Capitol and to DC and doing my advocacy work has truly been the most meaningful work of my life,\" Hilton said.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2026-01-23/wollongong-sports-entertainment-precinct-funding-announced/106261074",
        "title": "Wollongong sports and entertainment precinct receives $17 million boost",
        "publish_date": "Fri, 23 Jan 2026 01:30:18 +0000",
        "category": "sports",
        "authors": [],
        "text": "Long-awaited plans for a revamp of the Wollongong sports and entertainment precinct have moved to the next stage with the NSW premier announcing $17 million in funding and unveiling new detailed plans.\n\nThe Wollongong Entertainment Centre will be rebuilt and branded WIN Arena, with capacity nearly doubling to 9,500 people.\n\nThe Wollongong showground, widely known as WIN Stadium, will be significantly redesigned to include a new northern grandstand and an extended, reconfigured southern grandstand with improved player facilities.\n\nThe concept plan also includes a new Southern Plaza to be built on the training oval and a beach promenade behind the famous eastern hill spectator area.\n\nAn aerial view of the proposed WIN Stadium redevelopment. (Supplied: NSW government)\n\nPlanning Minister Paul Scully joined with Premier Chris Minns and Sports Minister Steve Kamper to make the announcement.\n\nHe said the $17 million investment would enable the government to develop a full business case for the plans.\n\n\"It will allow us to make sure that we are ready to go,\" Mr Scully said.\n\n\"We're not in a position at the moment to be able to say, 'OK, this is how much it's going to cost to get it done.'\n\n\" We need to get the design right, [and] understand that cost before we can get underway and seek that money to get it built. \"\n\nMayor backs upgrade\n\nWollongong lord mayor and NBL Illawarra Hawks tragic, Tania Brown, welcomed the announcement, describing it as a great day for the region.\n\nCouncillor Brown said it was her understanding that the extensive construction work would be staged over time, with no starting date yet.\n\n\"They are not going to be able to do it all at one time,\" she said.\n\n\"Hopefully, they get on with the new WIN Arena first and they will work through to the stadium and showground number two.\n\n\"So it won't all be at once.\"\n\nA revamped entertainment centre would almost double the capacity for basketball games and concerts. (Supplied: NSW government)\n\nThe Wollongong Entertainment Centre was built primarily as a basketball stadium but also hosts concerts and conventions.\n\nIt opened in September 1998 with a concert by Bob Dylan and Patti Smith.\n\nLocal politicians, including Councillor Brown and Mr Scully, have long backed a push to refurbish the centre, which has had issues, including a roof leak which forced the cancellation of an NBL game.\n\nMeanwhile, WIN Stadium has hosted rugby league games since 1991, with the TV network gaining naming rights in 1997.\n\nIt was upgraded with a new northern grandstand in 2002, and a new western grandstand opened in 2012.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2026-01-23/nsw-lanlan-yang-court-rolls-royce-crash/106261518",
        "title": "Woman charged over Rolls-Royce crash breached bail, court told",
        "publish_date": "Fri, 23 Jan 2026 01:27:24 +0000",
        "category": "finance",
        "authors": [],
        "text": "A woman whose court case has sparked curiosity and intrigue amongst Chinese Australians due to her apparent wealth has appeared before a Sydney magistrate, where her lawyers admitted to a breach of bail.\n\nLanlan Yang has pleaded not guilty to four charges over the crash involving her Rolls-Royce in Rose Bay in Sydney's east last July, including dangerous driving occasioning grievous bodily harm.\n\nThe 23-year-old has been accused of also failing to submit to a breath test after the collision, which badly injured the other driver, Georgios Plassaras.\n\nLanlan Yang arrives at court with her legal team. (ABC News: Monish Nand)\n\nMs Yang has been repeatedly excused from attending court in the months since the crash.\n\nPrevious mentions have generated intrigue with spectators showing up, curious about her identity and the source of her apparent wealth, but they have been left disappointed when she did not make an appearance.\n\nMs Yang appeared in person in Downing Centre Local Court on Friday morning, where her counsel Greg Stanton conceded there had been a breach of bail due to an address change.\n\nBut he told the magistrate it wasn't his client's fault.\n\n\"The breach … was committed in circumstances really unattributable to the defendant,\" he said, citing a miscommunication between lawyers.\n\nMs Yang left court beside her lawyers without answering any questions from the media.\n\nHer address had already been updated when the case came before the Chief Magistrate, Judge Michael Allen, on Thursday.\n\nLanlan Yang was charged with multiple offences after the collision in Rose Bay. (ABC News)\n\nMr Stanton respectfully submitted the address incident was \"much ado about nothing\".\n\nIt was updated on paperwork on Thursday with the consent of the prosecution and officer in charge.\n\n'A very shy girl'\n\nJudge Allen on Thursday noted the significant media attention the case has garnered.\n\n\"This is a matter that has, I note, attracted a significant level of media interest, perhaps over and above its status in the nature of matters that come before this and other courts,\" he said.\n\nLast year, barrister John Korn told reporters outside court his client was \"a very shy girl\" and said he had never asked her about her family or background, which has stoked curiosity online.\n\nHe said he was \"a little perplexed\" at the amount of media attention the case was receiving and said it didn't help Ms Yang, personally or professionally.\n\n\"Can I say politely, why don't you people all go and find something better to do,\" he told reporters.\n\nThe case returns to court next week.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2026-01-23/sunshine-coast-op-shops-frustrated-with-illegal-dumping/106247800",
        "title": "Op shops struggle with 'eyesore' dumping at Queensland stores",
        "publish_date": "Fri, 23 Jan 2026 01:06:08 +0000",
        "category": "finance",
        "authors": [],
        "text": "Sunshine Coast op shop volunteers are fed up with \"lazy\" residents dumping their unwanted goods outside stores to avoid paying dump fees.\n\nAfter repeated incidents, they want Sunshine Coast Council to reinstate a kerbside collection program.\n\nStaff at Vinnies Caloundra arrived to work last week to find a pile of rain-soaked, broken furniture.\n\nVolunteer Kathryn Yule said the \"unfair\" burden had fallen onto elderly volunteers.\n\nA dirty mattress, a couch and a car seat were some of the items dumped outside the Vinnies Caloundra store. (Supplied: Kathryn Yule)\n\n\"There was a car seat, a baby seat, a lot of items we can't physically sell and given that they've dumped them in very bad condition, they have to go to the tip,\" Ms Yule said.\n\n\"There was broken furniture, a bag that someone has ripped open and clothes have gone everywhere.\"\n\nMs Yule said tip fees were one of the factors leading to a rise in dumping.\n\n\"I think everyone knows the donation rules — part of it is just laziness,\" she said.\n\n\"If they had kerbside collections, it would make such a difference.\"\n\nDebbie Clayton says people regularly dump items at their store after hours. (Supplied: Debbie Clayton)\n\nDebbie Clayton, from the Beautiful You Funky Op Shop at Currimundi, said their volunteers had to take a load to the tip after it was dumped at their store after hours.\n\n\"It's very time-consuming. Things that are left outside the shop can be a real eyesore,\" Ms Clayton said.\n\n\"The girls just don't have time to be going through stuff that isn't even saleable.\"\n\nMs Clayton said it was upsetting.\n\n\"Two weeks ago, we had someone come at two o'clock in the morning — that tells you something, doesn't it?\" she said.\n\n\"It's rubbish that is not even saleable — they'll even leave it in the rain.\"\n\nCalls for kerbside collection\n\nSunshine Coast Council discontinued its kerbside collection service in 2010, citing \"high costs and low usage\", among other factors.\n\nIn a statement, the council said it had been investigating options for large item waste services.\n\n\"Kerbside clean-ups are not considered the most environmentally friendly approach for dealing with unwanted household items,\" a council spokesperson said.\n\nKathryn Yule says people have broken the store's skip bins and left a mess for volunteers to clean up. (Supplied: Kathryn Yule)\n\n\"This is a position supported by Keep Queensland Beautiful, which encourages councils to implement innovative recycling initiatives and community collection days at waste resource stations.\"\n\nIn Queensland, residents caught illegally dumping can be fined $2,580, with larger volumes attracting up to $160,000 in fines.\n\nThe council said it remained committed to facilitating resource recovery.\n\nKathryn Yule wants the council to reinstate kerbside collection. (Supplied: Kathryn Yule)\n\n\"Kerbside collection is not seen as the current priority to achieve this outcome,\" it said.\n\nSignificant dumping\n\nIn a separate incident, the state government and the Sunshine Coast Council are investigating the dumping of hundreds of tyres in a state forest at Beerwah.\n\nThe discovery in early January has prompted authorities to increase surveillance in the area.\n\nLocal member for Caloundra, Kendall Morton, said the environment department was investigating the \"revolting act\" and fire hazard.\n\nHundreds of tyres have been dumped in the Beerwah State Forest. (ABC Sunshine Coast: Jake Kearnan)\n\nA spokesperson for the department said there was an ongoing investigation, but would not comment on specifics.\n\n\"There is around 200 metres of dumped tyres, which is an absolutely revolting act in the middle of a national park,\" Ms Morton said.\n\n\"The department are looking into it as a very serious incident — I am confident that the people who are responsible for this will be held to account.\n\n\"I have never seen anything like it.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2026-01-23/melioidosis-infections-mackay-region-flood-clean-up/106260730",
        "title": "Four people hospitalised with bacterial illness as flood clean-up continues",
        "publish_date": "Fri, 23 Jan 2026 00:48:45 +0000",
        "category": "lifestyle",
        "authors": [],
        "text": "Four people have been hospitalised with a potentially fatal soil-borne illness in North Queensland as the clean-up from a week of heavy rain continues.\n\nTwo people from the small community of Armstrong Beach in Mackay's south, one from Seaforth north of Mackay, and another from Bowen in the Whitsunday region are all being treated for melioidosis at the Mackay Base Hospital.\n\nAll four people, aged between 67 and 89, had been exposed to mud or recent floodwaters.\n\nThe bacteria Burkholderia pseudomallei that causes melioidosis. (Supplied: Robert Norton)\n\nAs of January 19, 16 cases of the disease were confirmed across Queensland: six in Cairns and surrounds, five in the Townsville region, one in the Mackay region and another one in the Torres and Cape regions.\n\nBut with the area around Mackay seeing new infections, the director of the Mackay Public Health Unit, Steven Donohue, said the diagnoses were a timely warning for people still cleaning up after ex-Tropical Cyclone Koji.\n\nSteven Donohue says melioidosis is just one of many infections possible after exposure to floodwater or soil. (ABC News)\n\nDr Donohue said the bacteria typically entered through a skin break or by breathing in muddy droplets.\n\n\"People at most risk of contracting melioidosis are already unwell, elderly or have existing chronic conditions such as diabetes or kidney disease,\" he said.\n\nFrom January to November in 2025, 36 people died with the illness, compared to nine people from both melioidosis and fellow bacterial disease glanders in 2022.\n\nDr Donohue said while the illness was potentially fatal, the cases were not cause for alarm.\n\n\"Early diagnosis and treatment with antibiotics can be life-saving,\" he said.\n\nCase numbers rise\n\nA broader public health campaign from Queensland Health has begun, and investigations are underway to find the cause of the 2025 outbreak.\n\nMichael Clements says the heavy rain has brought the bacteria to the surface. (Supplied: Royal Australian College of General Practitioners)\n\nRural Chair of the Royal Australian College of General Practitioners, Michael Clements, said the clean-up after a flooding event was a particularly risky time for contracting the illness.\n\n\"A week's worth of rain has brought that bacteria to the surface,\" Dr Clements said.\n\n\"If we breathe in some of the bacteria because we've been pressure washing or spraying or even mowing the lawn, there's a risk there.\"\n\nHe said it was best practice for people cleaning up to either cover their legs or wear a mask, depending on the task.\n\n\"Sometimes melioidosis presents very late: it can be deadly, and we need to respect it.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2026-01-23/australian-open-stan-wawrinka-taylor-fritz-third-round/106261080",
        "title": "40yo Wawrinka's opponent can 'barely imagine' playing tennis at same age",
        "publish_date": "Fri, 23 Jan 2026 00:07:27 +0000",
        "category": "sports",
        "authors": [],
        "text": "It was meant as a compliment, rather than a show of disrespect for one of his more experienced rivals.\n\nWhen Taylor Fritz was asked whether he would be playing professional tennis at the same age as 40-year-old Stan Wawrinka, he provided an honest answer.\n\n\"No, not at all,\" 28-year-old Fritz told reporters.\n\nFive quick hits from the Australian Open Madison Keys praises Melbourne coffee, Stan Wawrinka says he deserves a beer and Nick Kyrgios back to racquet throwing ways. Here are the quick hits from the Australian Open.\n\n\"I can barely imagine playing in, like, four years from now.\"\n\nAhead of their third-round match at the Australian Open, Fritz admits he looked up to three-time major winner Wawrinka when he was younger.\n\nWawrinka has become one of the stories of the first week of the tournament, having spent seven hours and 53 minutes on court en route to the last 32.\n\nRanked 139 in the world, a far cry from his career-high mark of number three, Wawrinka is appearing at the Australian Open for the final time.\n\nThe 2014 champion, who will retire at the end of the season, was granted a wildcard into the main draw, and he has repaid tournament organisers in spades.\n\nHis tense five-set win over French qualifier Arthur Géa on Thursday evening was one of the highlights of the second round, captivating the crowd crammed inside Kia Arena.\n\nStan Wawrinka will play Taylor Fritz in the round of 32. (Getty Images: Clive Brunskill)\n\nThe Swiss showed guile and glimpses of the form that saw him win three majors, although he refused to live in the past.\n\n\"[I] never compare the past,\" said Wawrinka, following his 4-6, 6-3, 3-6, 7-5, 7-6 (10/3) defeat of Géa.\n\n\"That's really never a good idea to do it. For me, I'm always trying to stay in the present, living with what's happening in the present.\n\n\"Of course, after a tough year like last year, knowing that this is my last Australian Open, my last year, it's really special.\n\n\"The emotion is really completely different. It's a feeling that's tough to describe.\n\n\"But it's the reason why at 40 I'm still pushing myself, pushing the limit, practising hard in the off-season. It's to live those moments.\"\n\nVeterans doing their thing\n\nWawrinka is not the only elder statesman on the ATP Tour wowing the spectators at Melbourne Park.\n\nAt 38, Novak Djokovic remains in the hunt for a record 11th Australian Open title, while 2018 runner-up Marin Čilić — a year younger than the Serb — has also reached the third round.\n\n\"I think it's great,\" Wawrinka said.\n\n\"I saw Čilić winning. It's good to see him back. He got some injury last year, too. It's good to see him at the right level.\n\n\"Novak is in a different league, anyway. We never compare ourselves to him. He's always there. He's always going to be there as long as he's playing.\n\n\"It's always amazing the way he can push everybody.\"\n\nNovak Djokovic is among the contenders for the Australian Open men's crown. (Getty Images: Clive Brunskill)\n\nFritz, the ninth seed, knows what to expect when he faces Wawrinka on Saturday.\n\nAnd the American will not be surprised if the pair go the distance across five sets.\n\n\"It's so impressive the level and just the physicality he's still bringing,\" Fritz said.\n\n\"The obvious thing is fitness, but then the other thing is just, I'd say, being a really good competitor.\n\n\"People that compete really well tend to win out over the longer matches. It speaks to how great a competitor he is.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2026-01-23/nbl-star-urges-pride-round-middle-ground/106260522",
        "title": "NBL star urges 'middle ground' in Pride Round discussion",
        "publish_date": "Thu, 22 Jan 2026 23:32:13 +0000",
        "category": "sports",
        "authors": [],
        "text": "National Basketball League star Marcus Lee has cautioned against pushing people away from important conversations about LGBTQIA+ rights by taking an all-or-nothing approach to Pride rounds.\n\nStarting this week, the NBL is celebrating its fourth Pride Round, with all courts decked out in the Pride flag and players invited to wear jerseys featuring the same logo.\n\nThe New Zealand Breakers have opted out of wearing the Pride flag on their uniforms.\n\nA statement from the club said it still \"strongly supports\" the event, but some players had raised religious and cultural concerns about wearing the Pride flag.\n\n\"In line with the league's voluntary participation policy to wear the patch, the players discussed the matter as a team,\" the statement from the Breakers said.\n\n\"To protect individual players from being singled out for their beliefs, the team collectively decided they would either all wear the insignia or none would.\"\n\nChange possible in middle ground, Lee says\n\nIn 2022, Isaac Humphries — then with Melbourne United, now with the Adelaide 36ers — became the first openly gay male to play in the NBL and the second in any top-tier basketball league in the world.\n\nLee is one of Humphries's close friends and has this year volunteered to be included in promotional content for Pride Round as an ally.\n\nMarcus Lee says his friendship with Isaac Humphries helped shape his support for the NBL’s Pride round as an ally. (Getty Images: Morgan Hancock)\n\nThe American import said forcing players to wear the rainbow flag on their jersey would undermine the round's purpose of fostering open dialogue.\n\nIn the Breakers' case, he said the outcome was not as important as the fact that they had discussed it.\n\n\"A couple of years ago, these conversations weren't happening, and it was not an option — we didn't have jerseys, we didn't have the conversation,\" he said.\n\n\"And now it's something that a coach or an owner has to sit down with the team like, 'How do you guys feel about this?'\n\n\"It's still an option, it's still your choice, but we want to make sure that they have all the information, and then we get everybody's side on it.\n\n\"It gives people a little bit more grace.\"\n\nIn 2023, the Cairns Taipans made a similar decision not to wear the rainbow logo for Pride Round, though they have worn one every year since.\n\nIn 2024, the Taipans announced an official partnership with Pride in Sport — a national not-for-profit sporting inclusion program — which is hosting \"Empowering Allies\" training sessions for players, coaches and staff across the league during this year's Pride Round.\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\nLee, who joined the Taipans last year, said change usually happened in the middle ground.\n\n\"You don't want to force anything on anybody, and that's not the point of this,\" he said.\n\n\"You want to start this conversation, and then slowly things alter. That's what made me really excited this year — we have a bunch of guys who are just open to the conversation.\n\n\"We're not here to change your opinion, but we just want to make a place where everybody's comfortable to be who they are.\"\n\nLee said the NBL provided a useful lesson to other leagues yet to introduce Pride rounds: it does not have to be all or nothing.\n\n\"It might not be every team in every league starting immediately, but I think the biggest thing is it takes one domino to just start that,\" he said.\n\n\"We're trying to take one step at a time.\"\n\n'Everybody is welcome', says Humphries\n\nHumphries was unavailable for interview as he prepares for Friday's game against the Breakers in New Zealand, but echoed Lee's sentiments in a conversation with former NBL player AJ Ogilvy — who this week came out publicly as gay.\n\n\"It's not anything about forcing; it's just a bit of visibility for a community,\" Humphries said.\n\n\"Learning to stop the judgement, accept people for who they are — that's literally what we're about, that's our through line.\n\n\"I would just always encourage others to see that and understand that mindset. We're just people trying to accept and include literally everybody.\"\n\nLGBTQI+ community support services ABCQueer has compiled this list of national and state-based support services relevant to LGBTQI+ people, their families and friends.\n\nOgilvy, who played for the Sydney Kings and Illawarra Hawks in a 218-game NBL career, said he was happy to see engagement with Pride Round grow year on year.\n\n\"There's now a place for us to have this conversation, for us to be able to talk as openly as this,\" Ogilvy said.\n\n\"I don't think it's trying to exclude people; we want to try to bring people in, not push people away.\n\n\"It doesn't have to be people on the court. Pride Round is for everyone. It's people in the stands. It's people at home watching. It's about making sure everyone feels included.\"\n\nDo you have a story idea about women in sport? Email us abcsport5050@your.abc.net.au",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2026-01-23/australian-open-2026-live-sabalenka-alcaraz-de-minaur-osaka/106260854",
        "title": "Live: Aussie wildcards dump out top seeds as Osaka urged to 'say less'",
        "publish_date": "Thu, 22 Jan 2026 23:23:46 +0000",
        "category": "sports",
        "authors": [
            "Jon Healy",
            "Andrew Mcgarry"
        ],
        "text": "Is it world number ones or world numbers one?\n\nRegardless, wildcard men's doubles pair James McCabe and Li Tu have pushed top seeds Lloyd Glasspool and Julian Cash to a tiebreak in the first set of their second-round clash.\n\n(Getty)\n\nMcCabe is serving first in the breaker. And the return doesn't make it back over the net. 1-0\n\nBut Julian Cash gets the next two in a hurry. 1-2\n\nLi Tu matches Cash with an ace out wide, and then McCabe comes up with a lovely piece of anticipation at the net to finish the point for a 2-3 lead.\n\nAnd the Australians go to the change of ends leading 2-4 after lovely net exchange ends with Cash netting a forehand volley. They're calling for the crowd to fire up and get behind them.\n\nCash puts away a simple overhead to get back to trailing only 4-3, but McCabe is serving with the mini break. He's almost come up with an unconventional ace, coming within a whisker of hitting Cash on the full at the net. When he does land his serve, Tu pounces on a couple of soft returns to send the Aussies charging to three set points at 3-6.\n\nJulian Cash saves one with an ace down the T. 4-6\n\nAnd Glasspool volleys home the +1 shot to force Li Tu to serve for the set at 6-5.\n\nAce! The Aussies have done it and Li Tu puts his hand to his ear to tell the ANZ Arena crowd to fire up!",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2026-01-23/oscar-nominations-2026-snubs-successes-surprises/106260530",
        "title": "Aussies soar, Wicked gone for good and other Oscar nomination surprises and snubs",
        "publish_date": "Thu, 22 Jan 2026 23:03:53 +0000",
        "category": "entertainment",
        "authors": [],
        "text": "It might still be January but with the 98th Academy Awards nominations released in the early hours of Australian morning — the Oscars are officially in sight!\n\nMusical horror-hybrid Sinners leads this year's cohort, securing a record-breaking 16 nominations, including Best Picture, Director and Original Screenplay.\n\nNot far behind is Paul Thomas Anderson's revolutionary tale One Battle After Another — largely considered the one to beat for Best Picture — on 13 nominations.\n\nOscar nods for Aussie actors Jacob Elordi and Rose Byrne Vampire film Sinners broke the Academy Award record for nominations with 16, while Rose Byrne was recognised for If I had Legs I'd Kick You and Jacob Elordi got a nod for his role in Frankenstein.\n\nInternational films also showed up in a big way this year, with two — Joachim Trier's Sentimental Value and Kleber Mendonça Filho's The Secret Agent — both securing multiple nominations, including Best Picture.\n\nJafar Panahi's illegally filmed It Was Just an Accident and Óliver Laxe's Sirāt also managed to nab additional nominations on top of their Best International Film nods.\n\nThis year's Academy Awards will take place on March 15 (March 16 for Australians) but, until then, let's dive into the snubs, surprises and successes from the 2026 Oscar nominations.\n\nSuccess: Aussies lock it down\n\nDon't get it twisted, Australians usually clean up alright at the Oscars, but this year we have multiple shots at bringing gold home.\n\nRose Byrne at the edge of motherhood The Sydney-born movie star discusses how her creative partnership with If I had Legs I'd Kick You director Mary Bronstein has opened the Oscars conversation.\n\nAll-season Rose Byrne's exasperated performance in dark comedy If I Had Legs I'd Kick You has been the quiet frontrunner for Best Lead Actress.\n\nHer competition comes in the form of Hamnet's Jessie Buckley; the pair have been alternating wins at key ceremonies for months.\n\nThey BOTH took home statues for Best Lead Actress in their respective genres at the Globes, so this one will be a nailbiter.\n\nOver in possibly the most competitive category (Best Supporting Actor) is Jacob Elordi for his immensely physical turn as the Creature in Guillermo del Toro's Frankenstein remake.\n\nElordi nabbed a surprise Critics' Choice Award earlier in the month, but facing off against Academy favourites like Sean Penn and Benicio Del Toro could mean an uphill battle for the boy from Brisbane .\n\nRounding out our Aussie representation is musician Nick Cave sneaking into Best Original Song for his and The National's Bryce Dessner's contribution to Best Picture nominee Train Dreams.\n\nThe category is pretty much on lock for Golden from KPop Demon Hunters, but stranger things have happened at the Oscars.\n\nAnd while Train Dreams is technically an American film, it stars Aussie Joel Edgerton so we might as well go ahead and claim that too.\n\nJacob Elordi sat through a whopping 11 hours of make-up to become the Creature in Netflix's Frankenstein. (Netflix)\n\nSurprise: F1 zooms into Best Picture race\n\nAs with most years, there were around six films that made such an impact it was impossible to imagine them NOT getting a Best Picture nod.\n\nWhich leaves around four spaces for wildcards.\n\nThere was a lot of buzz about multiple international films, such as Jafar Panahi's It Was Just an Accident and Park Chan-wook's No Other Choice, defying Academy tastes to nab a nomination.\n\nBut in the end, the voting bloc went with good ol' US popcorn fodder with Brad Pitt vehicle F1: The Movie.\n\nPushing a car-centric film into Best Picture isn't unheard of: Ford v Ferrari snuck into the 2019 race among much stronger contenders, but it's an indication that the Academy is holding on tight to the crowd-pleasing, cinema filler.\n\nIn the F1 movie, Brad Pitt is a former elite race car driver turned van-lifer who flits across the globe and avoids his feelings. (Supplied: Warner Bros)\n\nSnub: Wicked banished for good\n\nLess of a snub and more of a slow snuff out, Wicked: For Good began awards season as a Best Picture frontrunner only to tumble off the tornado with a big ol' goose egg.\n\nWicked: For Good captures the spirit of the stage musical’s second act — for better and for worse Ariana Grande and Cynthia Erivo shine in Wicked: For Good, but the sequel doesn't live up to the thrill of its predecessor.\n\nThe first film collected a robust 10 nominations, including for Best Picture, and placed a Best Supporting Actress win tantalisingly close to Ariana Grande.\n\nBut lacklustre reviews and fading cultural relevance seems to have caught up with the Broadway adaptation. Not only did Grande and lead Cynthia Erivo miss out, but For Good was completely shut out of the technical categories which it won last time around.\n\nPerhaps the most painful part is the musical's failure to secure even a Best Original Song nod, a category they missed last time due to eligibility, but was thought of as a shoo-in due to legendary composer Stephen Schwartz contributing two original songs to the sequel.\n\nSuccess: Sinners makes Academy history\n\nMove over Titanic, Sinners is now the most nominated film in Academy history! The hybrid horror bit off a whopping 16 nominations this morning, trouncing previous record holders Titanic, All About Eve and La La Land on 14.\n\nWith a nomination in nearly every eligible category, including Picture, Director, Original Screenplay and three out of four acting categories, it's almost enough to make you think the Academy's dislike of horror has evaporated.\n\nWhat really pushed their nomination collection into record territory is a surprise Supporting Actor nod for veteran actor Delroy Lindo's turn as callused blues master Delta Slim.\n\nBritish actor Wunmi Mosaku picked up a Best Supporting Actress nod for her work in Sinners. (Supplied: Warner Bros)\n\nSinners shouldn't start counting its chickens yet though; the film has led nominations lists numerous times this season only to come up frustratingly short. Here's hoping Ryan Coogler's incredible vampire story can leave its mark on the Oscars.\n\nSurprise: Best casting skips sentimentality\n\nThe new kid on the category block is Best Casting, making its debut at the 2026 ceremony.\n\nThe inaugural nominees aren't so remarkable for what they contain but rather for what they lack.\n\nJoachim Trier's Sentimental Value has cut through this season with mighty force for an international film, even securing a rare Best Picture nod.\n\nSentimental Value reunites actor Renate Reinsve with director Joachim Trier. (Supplied: Cannes)\n\nBut it was nowhere to be seen in casting this morning, despite four of its ensemble picking up acting nods including a double nomination in Supporting Actress for Elle Fanning and Inga Ibsdotter Lilleaas. It's a bit of a head scratcher.\n\nSnub: Sorry, Sorry, Baby\n\nEven the praise of Julia Roberts wasn't enough to land Eva Victor's dazzling debut an Oscar nomination.\n\nSorry, Baby was rarely in talks for Best Picture but its laundry list of awards-season nominations and wins had some pundits hoping Victor's achingly grounded script might just sneak into Best Original Screenplay.\n\nAlas, there was no love for Sorry, Baby this morning. But let's look at the kitten on the promo image just one more time.\n\nSorry, Baby is the debut feature film from writer, director and star Eva Victor. (Supplied: VVS Films)\n\nSuccess: Lil Timmy Tim inches closer to 'greatness'\n\nIf it wasn't clear enough from his audacious speech at last year's SAG awards, Timothée Chalamet wants an Oscar bad — like 2014 Leonardo DiCaprio bad.\n\nAlready a double Oscar nominee at 30, Chalamet might prove third time's the charm with his nomination today for Best Lead Actor for Marty Supreme.\n\nChalamet is chasing the Oscar hard with Marty Supreme. (Supplied: A24)\n\nChalamet's hype-beast PR stunts proved fruitful for the ping pong movie's box office but his respectful revelry has worked wonders with awards voters with Chalamet picking up both the Critics Choice and Golden Globe for his troubles.\n\nEven if there is a shock snub for Timmy come March, he can hang his hat on being the youngest actor since Marlon Brando to receive three nominations for Best Leading Actor.\n\nSurprise: The Ugly Stepsister transforms into Oscar nominee\n\nEvery year there's one most unexpected surprise buried in the technical categories and this year it comes in the most disgusting package.\n\nThe Ugly Stepsister is a tiny, independent and repulsive re-imagining of Cinederella told from the perspective of an overlooked sibling who goes to extreme lengths to measure up to the family's golden girl.\n\nFull of intentionally broken bones, sliced feet and ingested tapeworms, the body horror managed to sneak into Best Makeup and Hair-styling.\n\nIt's the first nomination for streaming service Shudder, which has been dutifully keeping fans of original horror fed for a decade, and hopefully indicates the Academy's increasing warmth towards weird horror.\n\nSnub: Mescal misses the mark\n\nWhispers of Oscar-bait have done little to dash the chances of Chloé Zhao's Hamnet, a loose adaptation of William Shakespeare's family tragedy.\n\nThe weepy drama scored eight nominations, including Best Picture and Best Director for Zhao, but one name that was curiously absent was Paul Mescal, The Bard himself.\n\nPaul Mescal plays a semi-fictional version of William Shakespeare in Hamnet. (Supplied: Universal)\n\nMany considered him a contender for Best Supporting Actor due to his full-hearted performance and previous Oscar nomination but alas, it's not to be.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2026-01-23/australian-table-grapes-export-to-japan-demand-rises/106237572",
        "title": "Aussie table grape exports jump nearly 300 per cent amid 'great' growing year",
        "publish_date": "Thu, 22 Jan 2026 22:30:39 +0000",
        "category": "finance",
        "authors": [],
        "text": "Despite a couple of heatwave events, people who enjoy Australian table grapes across the globe will have access to a good variety and quality of fruit this year.\n\nPicking has begun for the local industry, with the majority of produce to be sent overseas, predominantly to Asia.\n\nAustralian Table Grape Association chief executive Jeff Scott said he was optimistic about the season after the first year of full varietal access to Japan.\n\n\"It's still early days, but we've done our trade briefings in about five or six countries now in Asia, and the indications are that the demand is going to be very strong again,\" he said.\n\nAustralia previously only exported three varieties of table grapes to Japan – crimson seedless, red globe and Thompson seedless.\n\nNew red grape varieties, like Ruby Rush, have meant an earlier start to harvest. (Supplied: Talia Farms)\n\nBut after a successful campaign to remove the unique trade barrier, growers can supply the market with more than 130 table grape varieties.\n\n\"Japan last year increased our exports by 300 per cent,\" Mr Scott said.\n\nHe said exports went from about 3,500 tonnes to nearly 10,000 tonnes.\n\n\"It's something that we've been working on for quite a while, and we're very pleased that we've been able to achieve,\" he said.\n\nAustralia has a free trade agreement with Japan and first exported table grapes there in 2014.\n\nMr Scott said he was pleased that the industry group was one of nine horticultural commodity groups included in the federal government's Trade Diversification Network.\n\n\"It might mean additional promotional activities, it might mean supporting inbound and outbound trade missions,\" he said.\n\nPick to plate\n\nEnsuring high-quality fruit for export requires a dedicated workforce and innovative practices.\n\nAt Talia Farms in South Australia's Riverland, one of the country's largest table grape farms, fruit can go from vine to shelf in as little as 48 hours.\n\nWorkers at Talia Farms pack table grapes by day. (Supplied: Talia Farms)\n\nFrom budburst to harvest, the workforce at the 230-hectare property and pack shed grows from 13 permanent employees to a team of almost 80.\n\nFarm manager Bill Avery said it required an around-the-clock operation, with some workers starting their day wearing headlamps to pick in the dark.\n\n\"We start picking at 3 o'clock in the morning or 2.30, depending on the dew point,\" he said.\n\n\"By 9am the pickers are finished and the pack shed is full.\n\n\"We go right through to 6pm, so our fruit is then stored ready for dispatch that night.\"\n\nMr Avery said the practices helped ensure the longevity and quality of the fruit.\n\n\"We are getting an extra three or four days' shelf life on the fruit because it's being picked when it is cool as opposed to being picked when it's hot,\" he said.\n\nMr Avery said it usually took a few weeks to ship table grapes, but the premium paid for fruit ahead of Chinese New Year justified air freight.\n\n\"We're looking at 48 hours from dispatch to being in a fruit shop in South-East Asia,\" he said.\n\nThe business, owned by US-based company RPG Capital Management, is on the market, but Mr Avery said the existing management would remain when a new investor took over.\n\nDespite a strong fruit-growing season, he said Australian consumers of grapes were unlikely to see it flow through to local prices.\n\n\"It is controlled by three to five major players,\" Mr Avery said.\n\n\"So unless you are in with those groups, it's very hard to break in with the supermarket chains because they won't entertain an individual grower base.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.smh.com.au/goodfood/recipes/adam-liaw-s-curried-egg-salad-rolls-20260123-p5nwi1.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Adam Liaw’s curried egg salad rolls",
        "publish_date": "Fri, 23 Jan 2026 13:15:12 +1100",
        "category": "lifestyle",
        "authors": [
            "Adam Liaw"
        ],
        "text": "Step 1 Bring a large saucepan of water to the boil. Prick a hole in the base of each egg with a needle or egg prick to help them peel more easily. Boil for 9 minutes, then transfer to a bowl of iced water to stop them cooking further. Peel the eggs.\n\nStep 2 While the eggs are cooking, heat a small saucepan over medium heat and add the oil and mustard seeds. When the seeds start to crackle, add the green chilli, onion, garlic and ginger and fry for about 3 minutes. Add the curry powder and black pepper and cook for about 5 minutes, with a few teaspoons of water if needed, until the gravy is quite dry. Season with salt and black pepper, remove to a large bowl and cool to room temperature.\n\nStep 3 When the mixture has cooled, add the mayonnaise and sour cream. Chop each egg into 3 or 4 large pieces and stir them through the curry mixture.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/tennis/medvedev-stumped-by-wizardry-20260123-p5nwje.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Medvedev stumped by 'wizardry'",
        "publish_date": "Fri, 23 Jan 2026 13:14:00 +1100",
        "category": "finance",
        "authors": [],
        "text": "Medvedev stumped by 'wizardry'\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/goodfood/nsw-good-food-guide/meltdown-20260123-p5nwj8.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Meltdown",
        "publish_date": "Fri, 23 Jan 2026 13:13:47 +1100",
        "category": "finance",
        "authors": [
            "David Matthews"
        ],
        "text": "Add articles to your saved list and come back to them anytime.\n\nWine in the Hunter is easy. Coffee? Less so. But that doesn’t mean there aren’t a few spots to keep on the radar for your morning brew. Frank Fawkner from two-hatted EXP. Restaurant vouches for Meltdown, occupying a corner site on the border of Branxton and Huntlee. The reason? Single-origin espresso, house blends from Newcastle’s Floozy Coffee Roasters and iced matcha that’s just the right balance of bitter and sweet.\n\nThe fit-out is sunny and bright, with ochre accents from a central tiled coffee counter. On the plate? How about a fresh spin on cilbir, the Turkish egg dish ramped up with green harissa and dippy bread, or a bacon-egg roll with Old Bay barbecue sauce? Add occasional dinners and pop-ups with winemakers and it’s an essential stop-off, night or day.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/business/markets/asx-set-to-edge-higher-as-wall-street-climbs-a-bounces-20260123-p5nweq.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Banks slide as ASX dips; Gold miners, $A jump",
        "publish_date": "Fri, 23 Jan 2026 13:10:28 +1100",
        "category": "finance",
        "authors": [
            "Staff Reporter"
        ],
        "text": "Advertisement\n\nUpdated BusinessMarketsWorld markets Banks slide as ASX dips; Gold miners, $A jump Staff reporter Updated January 23, 2026 — 1:10pm ,first published January 23, 2026 — 5:23am Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share A A A\n\nThe Australian sharemarket climbed into the green by lunchtime after more gains on Wall Street, as US stocks regained more of their losses for the week following the latest walk back by President Donald Trump from his most severe threats over Greenland. The S&P/ASX 200 started the session slightly lower but was up 24.2 points, or 0.3 per cent, to 8872.9 points, with four of 11 industry sectors higher, with stocks tied to gold jumping after the price of the safe haven rebounded. Wall Street advanced again, a day after Donald Trump backtracked on threats to hit European countries with tariffs amid the stoush over Greenland. Bloomberg Among the miners, Rio Tinto shed 1.2 per cent and BHP advanced 0.3 per cent while Fortescue dropped 0.5 per cent to extend its losses from Thursday. Gold miners rebounded from sharp losses in the previous session, with Northern Star rising 6.9 per cent and Evolution Mining jumping 7.2 per cent on Friday. Financial stocks gave up some of Thursday’s strong gains, with Commonwealth Bank (down 1.3 per cent), Westpac (down 0.8 per cent), National Australia Bank (down 0.8 per cent) and ANZ Bank (down 1.2 per cent) all losing ground.\n\nAdvertisement\n\nEnergy stocks were lower, with Woodside Energy slipping 0.6 per cent while Santos lost 0.2 per cent and Yancoal was flat. The Australian dollar continued to strengthen and was trading at US68.49¢ at 12.33pm AEDT. Related Article Opinion\n\nOil Trump’s devious deal hits China’s wallet – and its influence Stephen Bartholomeusz Senior business columnist Overnight, the S&P 500 gained 0.5 per cent and added to its big gain from Wednesday, when Trump said he had reached “the framework of a future deal with respect to Greenland” and called off 10 per cent tariffs for European countries that he said opposed his having the Arctic island. The index has recovered most of the losses it took after Trump shook financial markets with his initial tariff threat. The Dow Jones climbed 306 points, or 0.6 per cent, and the Nasdaq composite rose 0.9 per cent.\n\nAdvertisement\n\nTrump’s U-turn is the latest example of him making a big, initial threat, only to pull back after seeing how much pain it created in financial markets. The pattern has led to the “TACO” acronym, suggesting that “Trump Always Chickens Out” if markets react strongly enough. Tuesday’s drop for the US stock market was the worst since October and large enough that Trump, who often takes credit when Wall Street is doing well, acknowledged “the dip.” But the pattern has also led to deals for Trump that outsiders may have initially considered unlikely if not for his market-shaking opening moves. Details are still sparse about the framework of a deal on Greenland that Trump said he reached with the head of NATO. And it is not a signed deal yet. Financial markets were still showing some signs of nervousness on Thursday. Gold’s price swiveled between small losses and gains before turning 1.6 per cent higher. Its price often rises when investors are looking for something safer to own. The value of the US dollar also weakened against the euro and several other foreign currencies. But Treasury yields held relatively steady in a signal that foreign investors weren’t rushing out of the US bond market.\n\nAdvertisement\n\nYields got some support from reports on the US economy’s strength that came in better than expected. One said fewer US workers applied for unemployment benefits last week than economists expected in a potential signal that the pace of layoffs remains low. A second suggested the US economy grew at a faster rate during the summer than the government initially estimated. A third said that inflation in November was close to economists’ expectations, while spending by US consumers was a touch better than expected. The yield on the 10-year Treasury climbed as high as 4.28 per cent following the reports, but it later eased to 4.25 per cent from 4.26 per cent late Wednesday. On Wall Street, Northern Trust climbed 6 per cent after reporting a stronger profit for the end of 2025 than analysts expected. CEO Michael O’Grady also said that the financial services company is entering 2026 with “strong momentum across all our businesses.” Procter & Gamble added 2.6 per cent after likewise delivering a better profit than analysts expected. Revenue for the company behind the Downy, Pantene and Tide brands, though, fell just shy of expectations amid what CEO Shailesh Jejurikar called a “challenging consumer and geopolitical environment.”\n\nAdvertisement\n\nShares of BitGo, a company that helps crypto businesses and traditional financial firms hold and manage digital assets, rose 2.7 per cent in their debut on the New York Stock Exchange. The company priced its stock at $US18 per share in its initial public offering, above its earlier estimated range of $US15 to $US17. JPMorgan Chase rose 0.5 per cent after a lawsuit filed by Trump against the bank caused minor ripples for its stock. Trump accused JPMorgan Chase of closing his accounts for political reasons after he left office in 2021. They helped offset an 8.1 per cent drop for spice seller McCormick & Co., whose profit fell short of expectations. CEO Brendan Foley said it continues to face rising costs because of “a shifting global trade environment.” All told, the S&P 500 rose 37.73 points to 6,913.35. The Dow Jones Industrial Average added 306.78 to 49,384.01, and the Nasdaq composite gained 211.20 to 23,436.02. In stock markets abroad, indexes climbed across Europe and Asia amid relief on Trump’s walk back of tariffs.\n\nAdvertisement\n\nRelated Article Opinion\n\nInvesting Team TACO cashes in as Trump folds again Elizabeth Knight Business columnist Japan’s Nikkei 225 jumped 1.7 per cent, and Germany’s DAX returned 1.2 per cent for two of the world’s bigger moves. Global markets also got support from a continued easing of long-term yields in Japan’s bond market. They had spiked early in the week on worries that Japan’s popular prime minister could make moves that would add heavily to the government’s already big debt. But the 40-year Japanese government bond yield has come back since hitting a record and dropped below 4 per cent on Thursday after hitting 4.22 per cent on Tuesday. With AP The Market Recap newsletter is a wrap of the day’s trading. Get it each weekday afternoon.\n\nSave You have reached your maximum number of saved items. Remove items from your saved list to add more. Share More: World markets\n\nWall Street\n\nShares",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/golf/wa-s-lee-makes-hot-start-to-us-pga-tour-event-20260123-p5nwj2.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "WA’s Lee makes hot start to US PGA Tour event",
        "publish_date": "Fri, 23 Jan 2026 12:55:22 +1100",
        "category": "sports",
        "authors": [],
        "text": "Australia’s Min Woo Lee has fired a career-best round on the US PGA Tour to take joint leadership of The American Express tournament in California.\n\nWA’s Min Woo Lee has taken joint leadership of The American Express tournament in California. Credit: Getty Images\n\nLee’s sizzling 10-under 62 in the opening round in La Quinta featured seven birdies in a nine-hole stretch.\n\nJason Day also made a hot start to the tournament, shooting nine-under 63.\n\nCompatriots Adam Scott (seven-under) and Karl Vilips (five-under) also cashed in at an event renowned for low scores, while Cam Davis finished at two-under.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/tennis/truth-missed-in-kyrgios-wild-spray-for-leading-umpire-20260123-p5nwj0.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Truth missed in Kyrgios' wild spray for leading umpire",
        "publish_date": "Fri, 23 Jan 2026 12:54:25 +1100",
        "category": "sports",
        "authors": [],
        "text": "Truth missed in Kyrgios' wild spray for leading umpire\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/tennis/umpires-big-miss-that-led-to-heated-osaka-handshake-20260123-p5nwis.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Umpire's big miss that led to heated Osaka handshake",
        "publish_date": "Fri, 23 Jan 2026 12:49:32 +1100",
        "category": "sports",
        "authors": [],
        "text": "Umpire's big miss that led to heated Osaka handshake\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/tennis/aussie-wildcards-stun-top-seeds-in-the-doubles-20260123-p5nwit.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Aussie wildcards stun top seeds in the doubles",
        "publish_date": "Fri, 23 Jan 2026 12:48:46 +1100",
        "category": "sports",
        "authors": [],
        "text": "Aussie wildcards stun top seeds in the doubles\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/basketball/pepper-red-hot-as-lights-out-wildcats-shoot-down-snakes-20260123-p5nwik.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Pepper red hot as lights-out Wildcats shoot down Snakes",
        "publish_date": "Fri, 23 Jan 2026 12:20:20 +1100",
        "category": "sports",
        "authors": [],
        "text": "The Perth Wildcats have produced a phenomenal, lights-out shooting display to crush the Cairns Taipans 106-69.\n\nKristian Doolittle congratulates Elijah Pepper on a career-high 25 points against the Taipans. Credit: Getty Images\n\nIn a performance for the ages, the fifth-placed Wildcats shot a blistering 40-of-67 from the floor, including 15-of-27 from three-point range, at RAC Arena on Thursday night.\n\nNow 16-10 for the season, the Cats sprinted away from the ninth-ranked Taipans (7-19) on the back of a 38-13 third-quarter evisceration.\n\nElijah Pepper, with a career-high 25 points and 6-of-7 three-pointers, Kristian Doolittle (19, 3-of-3) and Dylan Windler (15, 3-of-6) led their long-range assault.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/culture/movies/the-oscar-nominations-are-in-here-s-the-good-the-bad-and-the-ugly-of-this-year-s-nods-20260122-p5nwas.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "The Oscar nominations are in. Here’s the good, the bad and the ugly of this year’s nods",
        "publish_date": "Fri, 23 Jan 2026 11:59:06 +1100",
        "category": "entertainment",
        "authors": [
            "Garry Maddox"
        ],
        "text": "Advertisement\n\nCultureMoviesOscars The Oscar nominations are in. Here’s the good, the bad and the ugly of this year’s nods Garry Maddox January 23, 2026 — 11:59am Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share A A A\n\nIt’s a year for creatively ambitious Hollywood movies backed by substantial budgets at the Academy Awards, with Sinners, One Battle After Another, Marty Supreme and Frankenstein heavily nominated early this morning. And it is also a year for ambitious non-English-language films from other parts of the world with The Secret Agent and Sentimental Value featuring among the contenders. With the nominations dominated by stories about central characters challenging power in different forms, Australia has first-time nominations for Rose Byrne (If I Had Legs I’d Kick You), Jacob Elordi (Frankenstein) and, for best original song, Nick Cave (Train Dreams). Production designer Fiona Crombie, who has been nominated previously for The Favourite, is back for Hamnet. In raw numbers, Sinners leads the way with a record 16 nominations – boosted by the inclusion of a new Oscar for best casting. Next is One Battle with 13 nominations and Frankenstein, Marty Supreme and Sentimental Value all with nine.\n\nAdvertisement\n\nJoining them with best picture nominations are Hamnet, Bugonia, F1, The Secret Agent and Train Dreams. The good Byrne’s best actress nomination is one of the feel-good stories of the nominations. While If I Had Legs I’d Kick You was weirdly in the musical or comedy category when she won at the Golden Globes, Byrne is exceptional as a stressed-out American therapist in a tense drama with a horror edge. Nominated: Rose Byrne with rapper A$AP Rocky in If I Had Legs I’d Kick You. AP\n\nAdvertisement\n\nOver two decades working in the US, she has shone in Bridesmaids and multiple Insidious, X-Men and Neighbours movies, and, on TV, in Damages, Mrs America and Physical. “I can’t believe it,” Byrne told The Hollywood Reporter. “I feel like I’ve snuck into the back of the bus. I can’t believe we got in this extraordinary group of women ... “I love the Oscars. [When I was a] little girl from Sydney, Australia, I used to watch [the show]. The pageantry of it is so fun and theatrical.” Related Article Oscars Rose Byrne, Jacob Elordi lead Australia’s Oscars charge as Sinners makes history Elordi continues his striking Hollywood rise with a best supporting actor nomination at 28 – two years younger than boy wonder Timothée Chalamet, who is one of the favourites to win best actor for Marty Supreme.\n\nAdvertisement\n\nHe gave heart and deep feeling to the Creature, who emerges from a demented lab and discovers the curse of eternal life, in Frankenstein. Even in the early stages, when his character was chained up and knew only the single word “Victor”, Elordi made him compelling to watch. Nick Cave’s Train Dreams – Bryce Dessner co-wrote the music – was a haunting closer to the poetic drama Train Dreams. It will be an outsider at the Oscars, however, given it is up against Golden from the pop culture phenomenon that is KPop Demon Hunters. Without discounting the merits of One Battle After Another, Marty Supreme and Hamnet, Sinners deserves to lead the nominations. At a time when cinema fans regularly lament the lack of original films, writer-director Ryan Coogler delivered one that ambitiously fused genres, spoke about race and class in America and took creative risks. Deservedly nominated: Jacob Elordi as the creature in Frankenstein. Ken Woroner/Netflix The bad\n\nAdvertisement\n\nJoel Edgerton has been close to an Oscar nomination before, for playing an FBI agent in Black Mass a decade ago. This year he absolutely deserved to be recognised for his heartbreaking performance as an early 20th century itinerant logger and railroad labourer in Train Dreams. There is so much emotion – suppressed and occasionally overflowing – in a quiet character who experiences horror, loneliness and grief but endures to finally feel like he understands life in his last years. Train Dreams is up for best picture, adapted screenplay, cinematography and original song; the Australian actor who made it so moving has sadly missed out. While there are two non-English-language films up for best picture, Sentimental Value and The Secret Agent, the Academy overlooked the best one. Jafar Panahi’s It Was Just An Accident is a tense and twisting thriller, darkly comic, about the abuse of power in Iran that won the Palme d’Or, the major prize, at Cannes. Nick Cave, who is nominated for best original song for Train Dreams, performing in London with the Bad Seeds. Megan Cullen\n\nAdvertisement\n\nPanahi, who had already been jailed for “creating propaganda against the system” and supporting anti-government protesters, made it in secret to avoid government censorship, and his courage and craft should have been rewarded with a best director nomination as well. And how unlucky were Chase Infiniti, the breakout star as the daughter of a revolutionary in One Battle, and Paul Mescal, who played Shakespeare in Hamnet? Their categories, best actress and actor, were so competitive this time around that they missed out. Way back in 2002, when Will Smith was nominated for best actor for Ali, he told me the Academy had historically overlooked deserving African-American actors and gave Delroy Lindo from Malcolm X, Get Shorty and Cider House Rules as evidence. At 73, Lindo has finally received a nomination. He is up for best supporting actor for playing a legendary blues musician in Sinners. Should have been nominated: Joel Edgerton in Train Dreams. Netflix\n\nAdvertisement\n\nThe ugly Voters decided that sequels were ugly. There are no nominations for Wicked: For Good, not even for Ariana Grande’s performance as Glinda, and Avatar: Fire and Ice is only up for best visual effects, which it might well win, and costume design. Ariana Grande as Glinda in Wicked: For Good. AP While Frankenstein and Sinners deserved to be up for best make-up and hairstyling, alongside the little-seen Kokuho and The Ugly Stepsister, I was never sure what to make of Dwayne Johnson’s transformation into a tormented UFC fighter in The Smashing Machine. His performance was impressive, but the character’s look felt awkward and forced. Still, he did not look like Dwayne Johnson, which I guess was the triumph.\n\nAdvertisement\n\nThe Oscars take place on Monday, March 16, Australian time. Must-see movies, interviews and all the latest from the world of film delivered to your inbox. Sign up for our Screening Room newsletter.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/nrl/angus-crichton-is-signed-now-rugby-australia-are-sweating-on-max-jorgensen-20260122-p5nw8l.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Angus Crichton is signed. Now Rugby Australia are sweating on Max Jorgensen",
        "publish_date": "Fri, 23 Jan 2026 11:46:00 +1100",
        "category": "sports",
        "authors": [
            "Christian Nicolussi"
        ],
        "text": "“You never say never,” Jorgensen said. “I loved my time playing league when I was younger, I still love the game and love watching it. “We’ll see where my career takes me. If it happens, it happens.” What about the five-year offer from Rugby Australia? “I’m still signed to the Tahs and Rugby Australia this year. We’re still working through a few things,” he said.\n\n“I’m loving my time playing at the Tahs, but we’ll get through this year and see what happens. “It’s always nice to [get it done early], but sometimes it’s not up to you. Hopefully, it works itself out. Max Jorgensen with Joseph-Aukuso Suaalii at Waratahs training in Mudgee. Credit: Amber Hooper “I like to keep my cards close to my chest. Obviously, a home World Cup is massive. It doesn’t come around too often. I do know to play in a home World Cup would be really cool.” The addition of Crichton and Nawaqanitawase, will that be factored into your decision?\n\n“Angus and Marky are two very talented athletes who have done great things in union, including ‘Gus’ at schoolboys level, and Marky with the Tahs and Wallabies,” Jorgensen said. “To have them back in the game is exciting. They’re two amazing players. You do want to play with the best players. They’re elite with experience. ‘I’m loving my time playing at the Tahs, but we’ll get through this year and see what happens.’ Max Jorgensen on his future “I want to win a Super Rugby title with the Tahs. With the Wallabies, there are Bledisloes, World Cups, even trying to win against the British and Irish Lions. They are all things that are on your bucket list when growing up. “But like I said, we’ll see.”\n\nWaratahs coach Dan McKellar spoke for everyone in rugby when he said: “If we get that [deal] done sooner rather than later, everyone will sleep that little bit easier. “I can understand why the Roosters, or any NRL club, would be interested. He’s an elite talent. Max Jorgensen in Mudgee where the Waratahs spent a week training. Credit: Amber Hooper “Hopefully, he’s comfortable and enjoying where he is at the moment, and he feels valued. Max loves rugby union and what the game can offer. “He will be [well] remunerated, regardless of where he plays.\n\n“I’d be pretty confident he’s enjoying the environment we have here at the Waratahs, and he’ll enjoy it with the Wallabies. “Max’s greatest strength is his humility. He’s not a self-promoter. He’s incredibly humble, comes from a good family, and doesn’t get ahead of himself. “We’ve seen it many times before when 21-year-olds all of a sudden become superstars overnight, and they can get ahead of themselves. That’s certainly not the case with Max.” Jorgensen was born in England, but grew up in Sydney’s inner-west, playing rugby with the Balmain Wolves, and league with the Leichhardt Juniors, later switching to the Concord Wolves once the Juniors folded. He was in the Balmain Harold Matthews’ team that featured Wests Tigers forward Tony Sukkar.\n\nOne of Jorgensen’s earliest memories was wearing a Roosters jersey and supporting the club where his father spent two seasons and racked up 20 tries in the 1990s. Peter celebrated tries with the “aeroplane”, which Max said he might produce this season. “I’ve seen videos of it – I might have to bring it out this year,” he said, with a smile. Max Jorgensen playing for the Waratahs last year. Credit: Getty Images “I leaned on dad a lot when I was younger, and definitely when I was transitioning into professional footy. I still do now, and he’ll give me pointers after each game. “Dad always leaned towards supporting the Roosters, and it rubbed off on me.\n\n“I’ve followed them my whole life. I did a pre-season with the club under Robbo a couple of years ago, which was also the first time I met ‘Su’ [Joseph-Aukuso Suaalii]. “I loved Robbo as a coach, he’s a great bloke as well and a great man.” Brad Fittler is Roosters’ royalty, while his son, Zach, is now with the Waratahs, and played against Jorgensen in the GPS first XV schoolboys competition. If Jorgensen switched, Fittler said there was no question about him being a success. “He could make it as fullback or five-eighth; there was a time I thought he could have been too small, but some of the best players in our comp are now small,” Fittler said. “He’s tough, has a great skill set, and he reads the game well.”\n\nLoading The Roosters could do with a fullback or winger like Jorgensen. Fullback James Tedesco is signed until the end of next year, and although he is in the kind of form to keep playing until he is 40, the skipper cannot go on forever. Veteran winger Daniel Tupou is in the same boat, while Nawaqanitawase’s exit creates another wing opening. The Roosters have also had success starting two of their great fullbacks – Anthony Minichiello and Roger Tuivasa-Sheck – on the wing before transitioning to the No. 1. Jorgensen gives little away, but there is no hint of arrogance. He is tight with Suaalii. He was genuinely unsure if he needed a shirt for this masthead’s photo shoot, and politely asked if the zinc on his face would be an unwanted distraction for the photographer.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/culture/tv-and-radio/stuck-on-what-to-watch-we-have-you-covered-20260123-p5nwfw.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Stuck on what to watch? We have you covered",
        "publish_date": "Fri, 23 Jan 2026 11:39:51 +1100",
        "category": "finance",
        "authors": [],
        "text": "Stuck on what to watch? We have you covered\n\nWhether you're looking for deep historical reflection or a fresh escape into the world of Westeros, this week's What to Watch offers a powerful contrast between real-world legacy and fantasy adventure.",
        "source": "SMH"
    },
    {
        "url": "https://www.sbs.com.au/news/article/rose-byrne-and-jacob-elordi-receive-oscar-nominations/gn324puqu",
        "title": "'We were all screaming': Rose Byrne and Jacob Elordi receive first Oscar nominations",
        "publish_date": "Fri, 23 Jan 2026 00:33:25 +0000",
        "category": "entertainment",
        "authors": [],
        "text": "Rose Byrne has received her first Oscar nomination after making the shortlist for best actress overnight.\n\nByrne is joined by fellow Australian Jacob Elordi, who received his first nomination for best supporting actor.\n\nMusician Nick Cave has also received a surprise shot at a major gong with a nomination for best original song.\n\nByrne's performance in indie film If I had Legs I'd Kick You has already earned her the best actress prize at four key pre-Oscars events, including the Golden Globes.\n\nShe received the news of her Oscar nomination in the middle of the night in Australia.\n\nREAD MORE This film starring Rose Byrne airs the unspeakable parts of motherhood\n\n\"I was falling asleep and then [husband Bobby Cannavale] starts FaceTiming me [from New York] because I wanted to try and stay up but it was so late,\" she said.\n\n\"And then he started screaming, it was like 'They said your name!' and then my parents came in the room, they're like 'Oh my God!' and then we were all screaming, and that was it. Now I've had a shot of adrenaline and I'm wide awake.\"\n\nThe movie follows the story of Linda (played by Byrne), a therapist navigating the harsh challenges of motherhood.\n\nDirector Mary Bronstein told SBS News last year she wanted to \"create a portrait of a mother I had never seen before\".\n\n\"When I thought about it, I was like: What movie have I ever seen where it centres a woman who happens to have a child, but it's not about her mothering and it doesn't judge her and it lets her be an actual human being? That's written and made by a woman?\"\n\nByrne is up against Jessie Buckley in Hamnet, Kate Hudson in Song Sung Blue, Renate Reinsve in Sentimental Value and Emma Stone in Bugonia.\n\nJacob Elordi has been nominated for his role in Guillermo Del Toro's Frankenstein. Source: AAP / AP/Netflix\n\nElordi's nomination for his role in Guillermo Del Toro's Frankenstein is one of nine for the Netflix film.\n\nSpeaking to the Hollywood Reporter, the Brisbane-born actor said he was \"beside himself\" after receiving the news.\n\n\"I am so excited. I mean, I'm 28 years old. It's wind in the sails,\" he said.\n\nCave was nominated for the title song to Clint Bentley's film Train Dreams, which stars Australian actor Joel Edgerton.\n\nEdgerton, the central pillar of Train Dreams, was not nominated, though the picture earned four nominations, including best picture.\n\nAustralian costume and production designer Fiona Crombie has also been nominated for an Oscar this year, in the best production design category for her work on Hamnet.\n\nSinners, starring Michael ‍B Jordan, landed a record 16 nominations. Source: AAP / Warner Bros. Pictures/AP\n\nSinners sets new record\n\nSinners, a segregation-era vampire thriller starring Michael ‍B Jordan, has stormed into the awards race with the most Academy Award nominations of any film this year, landing a record 16 nods.\n\nThe large haul sets up Sinners as the ⁠frontrunner heading into the 15 March Oscars, where it will face off against contenders One Battle After Another, Frankenstein, Hamnet, Marty Supreme and others for the coveted best picture prize.\n\nThe previous record for most nominations in a single year was 14, a mark hit by All About ‌Eve, Titanic and La La Land.\n\nBugonia, F1, The Secret Agent, Sentimental Value and Train Dreams were also nominated for this ‍year's best picture trophy.\n\nWinners of the gold Oscar statuettes will be chosen by the roughly 10,000 actors, producers, directors and film craftspeople who make up the Academy of Motion Picture Arts and Sciences.\n\nComedian Conan O'Brien will host for the second year.\n\n- With additional reporting from Reuters\n\nFor the latest from SBS News, download our app and subscribe to our newsletter.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/australia-day-2026-heres-what-open-over-the-long-weekend/ukmi7oj8c",
        "title": "Australia Day 2026: Here’s what's open over the long weekend",
        "publish_date": "Thu, 22 Jan 2026 18:37:03 +0000",
        "category": "finance",
        "authors": [],
        "text": "Australia Day on January 26 this year falls on a Monday, meaning Australians can embrace a long weekend in the next few days.\n\nUnlike New Year’s Eve or Anzac Day, most shops are open on Australia Day as it’s considered a normal trading holiday.\n\nHowever, some states may restrict trading hours on public holidays.\n\nHere's what’s open on Australia Day across the country.\n\nNSW, Victoria, Northern Territory, ACT and Tasmania\n\nShops are open as usual on Australia Day in these states and territories, although some — such as Coles and Woolworths — may apply public holiday hours.\n\nSouth Australia\n\nUnder the state’s Shop Trading Hours Act, shops are subjected to restricted trading hours on Australia Day, depending on whether it’s an exempt or non-exempt shop.\n\nIf it’s an exempt shop, it can trade on any day of the year during hours that suit the business and its customers.\n\nIf it’s a non-exempt shop, it will have restricted hours or be closed on Australia Day, depending on its location.\n\nFor non-exempt shops in the CBD Tourist Precinct, shops are open from 11am to 5pm.\n\nFor those in the Metropolitan Shopping District, Binnum, Grace and Millicent, shops have to be closed.\n\nFor businesses that run hardware, furniture, floor coverings, motor vehicle parts and accessories, shops may open from 9am to 5pm.\n\nCar and boat dealerships will be closed on Australia Day.\n\nQueensland\n\nOn Australia Day, shops that belong to exempt shops — except for independent retailers — have unrestricted trading hours.\n\nFor the rest, it depends on whether it belongs to Type 1 trading areas, which include most CBDs and tourism precincts.\n\nFor supermarkets and department stores, those in Type 1 trading areas can be open from 7am to 9pm, while the rest can be open from 9am to 6pm.\n\nFor Hardware shops in Type 1 trading areas, those in Type 1 trading areas can be open from 6am to 9pm, and those outside the areas can be open from 6am to 6pm.\n\nFor car yards located in the cities, it can be open from 8am to 6pm, while those outside the area remain closed.\n\nWestern Australia\n\nOn Australia Day, shops in the Perth metropolitan area can open from 8am to 6pm, while those outside the metropolitan area remain closed.\n\nFor the latest from SBS News, download our app and subscribe to our newsletter.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/surprise-jobs-report-boosts-chance-of-february-rate-rise/58fh7nkgt",
        "title": "Surprise jobs report boosts chance of February rate rise",
        "publish_date": "Thu, 22 Jan 2026 07:37:40 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/trumps-greenland-u-turn-syria-clashes-force-kurds-into-retreat-china-brings-home-the-bacon/6qer5s35i",
        "title": "Trump’s Greenland U-turn, Syria clashes force Kurds into retreat & China ‘brings home the bacon’",
        "publish_date": "Thu, 22 Jan 2026 07:07:02 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.theage.com.au/goodfood/recipes/adam-liaw-s-curried-egg-salad-rolls-20260123-p5nwi1.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Adam Liaw’s curried egg salad rolls",
        "publish_date": "Fri, 23 Jan 2026 13:15:12 +1100",
        "category": "lifestyle",
        "authors": [
            "Adam Liaw"
        ],
        "text": "Step 1 Bring a large saucepan of water to the boil. Prick a hole in the base of each egg with a needle or egg prick to help them peel more easily. Boil for 9 minutes, then transfer to a bowl of iced water to stop them cooking further. Peel the eggs.\n\nStep 2 While the eggs are cooking, heat a small saucepan over medium heat and add the oil and mustard seeds. When the seeds start to crackle, add the green chilli, onion, garlic and ginger and fry for about 3 minutes. Add the curry powder and black pepper and cook for about 5 minutes, with a few teaspoons of water if needed, until the gravy is quite dry. Season with salt and black pepper, remove to a large bowl and cool to room temperature.\n\nStep 3 When the mixture has cooled, add the mayonnaise and sour cream. Chop each egg into 3 or 4 large pieces and stir them through the curry mixture.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/tennis/medvedev-stumped-by-wizardry-20260123-p5nwje.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Medvedev stumped by 'wizardry'",
        "publish_date": "Fri, 23 Jan 2026 13:14:00 +1100",
        "category": "finance",
        "authors": [],
        "text": "Medvedev stumped by 'wizardry'\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/goodfood/nsw-good-food-guide/meltdown-20260123-p5nwj8.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Meltdown",
        "publish_date": "Fri, 23 Jan 2026 13:13:47 +1100",
        "category": "finance",
        "authors": [
            "David Matthews"
        ],
        "text": "Add articles to your saved list and come back to them anytime.\n\nWine in the Hunter is easy. Coffee? Less so. But that doesn’t mean there aren’t a few spots to keep on the radar for your morning brew. Frank Fawkner from two-hatted EXP. Restaurant vouches for Meltdown, occupying a corner site on the border of Branxton and Huntlee. The reason? Single-origin espresso, house blends from Newcastle’s Floozy Coffee Roasters and iced matcha that’s just the right balance of bitter and sweet.\n\nThe fit-out is sunny and bright, with ochre accents from a central tiled coffee counter. On the plate? How about a fresh spin on cilbir, the Turkish egg dish ramped up with green harissa and dippy bread, or a bacon-egg roll with Old Bay barbecue sauce? Add occasional dinners and pop-ups with winemakers and it’s an essential stop-off, night or day.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/business/markets/asx-set-to-edge-higher-as-wall-street-climbs-a-bounces-20260123-p5nweq.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Banks slide as ASX dips; Gold miners, $A jump",
        "publish_date": "Fri, 23 Jan 2026 13:10:28 +1100",
        "category": "finance",
        "authors": [
            "Staff Reporter"
        ],
        "text": "Advertisement\n\nUpdated BusinessMarketsWorld markets Banks slide as ASX dips; Gold miners, $A jump Staff reporter Updated January 23, 2026 — 1:10pm ,first published January 23, 2026 — 5:23am Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share A A A\n\nThe Australian sharemarket climbed into the green by lunchtime after more gains on Wall Street, as US stocks regained more of their losses for the week following the latest walk back by President Donald Trump from his most severe threats over Greenland. The S&P/ASX 200 started the session slightly lower but was up 24.2 points, or 0.3 per cent, to 8872.9 points, with four of 11 industry sectors higher, with stocks tied to gold jumping after the price of the safe haven rebounded. Wall Street advanced again, a day after Donald Trump backtracked on threats to hit European countries with tariffs amid the stoush over Greenland. Bloomberg Among the miners, Rio Tinto shed 1.2 per cent and BHP advanced 0.3 per cent while Fortescue dropped 0.5 per cent to extend its losses from Thursday. Gold miners rebounded from sharp losses in the previous session, with Northern Star rising 6.9 per cent and Evolution Mining jumping 7.2 per cent on Friday. Financial stocks gave up some of Thursday’s strong gains, with Commonwealth Bank (down 1.3 per cent), Westpac (down 0.8 per cent), National Australia Bank (down 0.8 per cent) and ANZ Bank (down 1.2 per cent) all losing ground.\n\nAdvertisement\n\nEnergy stocks were lower, with Woodside Energy slipping 0.6 per cent while Santos lost 0.2 per cent and Yancoal was flat. The Australian dollar continued to strengthen and was trading at US68.49¢ at 12.33pm AEDT. Related Article Opinion\n\nOil Trump’s devious deal hits China’s wallet – and its influence Stephen Bartholomeusz Senior business columnist Overnight, the S&P 500 gained 0.5 per cent and added to its big gain from Wednesday, when Trump said he had reached “the framework of a future deal with respect to Greenland” and called off 10 per cent tariffs for European countries that he said opposed his having the Arctic island. The index has recovered most of the losses it took after Trump shook financial markets with his initial tariff threat. The Dow Jones climbed 306 points, or 0.6 per cent, and the Nasdaq composite rose 0.9 per cent.\n\nAdvertisement\n\nTrump’s U-turn is the latest example of him making a big, initial threat, only to pull back after seeing how much pain it created in financial markets. The pattern has led to the “TACO” acronym, suggesting that “Trump Always Chickens Out” if markets react strongly enough. Tuesday’s drop for the US stock market was the worst since October and large enough that Trump, who often takes credit when Wall Street is doing well, acknowledged “the dip.” But the pattern has also led to deals for Trump that outsiders may have initially considered unlikely if not for his market-shaking opening moves. Details are still sparse about the framework of a deal on Greenland that Trump said he reached with the head of NATO. And it is not a signed deal yet. Financial markets were still showing some signs of nervousness on Thursday. Gold’s price swiveled between small losses and gains before turning 1.6 per cent higher. Its price often rises when investors are looking for something safer to own. The value of the US dollar also weakened against the euro and several other foreign currencies. But Treasury yields held relatively steady in a signal that foreign investors weren’t rushing out of the US bond market.\n\nAdvertisement\n\nYields got some support from reports on the US economy’s strength that came in better than expected. One said fewer US workers applied for unemployment benefits last week than economists expected in a potential signal that the pace of layoffs remains low. A second suggested the US economy grew at a faster rate during the summer than the government initially estimated. A third said that inflation in November was close to economists’ expectations, while spending by US consumers was a touch better than expected. The yield on the 10-year Treasury climbed as high as 4.28 per cent following the reports, but it later eased to 4.25 per cent from 4.26 per cent late Wednesday. On Wall Street, Northern Trust climbed 6 per cent after reporting a stronger profit for the end of 2025 than analysts expected. CEO Michael O’Grady also said that the financial services company is entering 2026 with “strong momentum across all our businesses.” Procter & Gamble added 2.6 per cent after likewise delivering a better profit than analysts expected. Revenue for the company behind the Downy, Pantene and Tide brands, though, fell just shy of expectations amid what CEO Shailesh Jejurikar called a “challenging consumer and geopolitical environment.”\n\nAdvertisement\n\nShares of BitGo, a company that helps crypto businesses and traditional financial firms hold and manage digital assets, rose 2.7 per cent in their debut on the New York Stock Exchange. The company priced its stock at $US18 per share in its initial public offering, above its earlier estimated range of $US15 to $US17. JPMorgan Chase rose 0.5 per cent after a lawsuit filed by Trump against the bank caused minor ripples for its stock. Trump accused JPMorgan Chase of closing his accounts for political reasons after he left office in 2021. They helped offset an 8.1 per cent drop for spice seller McCormick & Co., whose profit fell short of expectations. CEO Brendan Foley said it continues to face rising costs because of “a shifting global trade environment.” All told, the S&P 500 rose 37.73 points to 6,913.35. The Dow Jones Industrial Average added 306.78 to 49,384.01, and the Nasdaq composite gained 211.20 to 23,436.02. In stock markets abroad, indexes climbed across Europe and Asia amid relief on Trump’s walk back of tariffs.\n\nAdvertisement\n\nRelated Article Opinion\n\nInvesting Team TACO cashes in as Trump folds again Elizabeth Knight Business columnist Japan’s Nikkei 225 jumped 1.7 per cent, and Germany’s DAX returned 1.2 per cent for two of the world’s bigger moves. Global markets also got support from a continued easing of long-term yields in Japan’s bond market. They had spiked early in the week on worries that Japan’s popular prime minister could make moves that would add heavily to the government’s already big debt. But the 40-year Japanese government bond yield has come back since hitting a record and dropped below 4 per cent on Thursday after hitting 4.22 per cent on Tuesday. With AP The Market Recap newsletter is a wrap of the day’s trading. Get it each weekday afternoon.\n\nSave You have reached your maximum number of saved items. Remove items from your saved list to add more. Share More: World markets\n\nWall Street\n\nShares",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/golf/wa-s-lee-makes-hot-start-to-us-pga-tour-event-20260123-p5nwj2.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "WA’s Lee makes hot start to US PGA Tour event",
        "publish_date": "Fri, 23 Jan 2026 12:55:22 +1100",
        "category": "sports",
        "authors": [],
        "text": "Australia’s Min Woo Lee has fired a career-best round on the US PGA Tour to take joint leadership of The American Express tournament in California.\n\nWA’s Min Woo Lee has taken joint leadership of The American Express tournament in California. Credit: Getty Images\n\nLee’s sizzling 10-under 62 in the opening round in La Quinta featured seven birdies in a nine-hole stretch.\n\nJason Day also made a hot start to the tournament, shooting nine-under 63.\n\nCompatriots Adam Scott (seven-under) and Karl Vilips (five-under) also cashed in at an event renowned for low scores, while Cam Davis finished at two-under.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/tennis/truth-missed-in-kyrgios-wild-spray-for-leading-umpire-20260123-p5nwj0.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Truth missed in Kyrgios' wild spray for leading umpire",
        "publish_date": "Fri, 23 Jan 2026 12:54:25 +1100",
        "category": "sports",
        "authors": [],
        "text": "Truth missed in Kyrgios' wild spray for leading umpire\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/tennis/umpires-big-miss-that-led-to-heated-osaka-handshake-20260123-p5nwis.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Umpire's big miss that led to heated Osaka handshake",
        "publish_date": "Fri, 23 Jan 2026 12:49:32 +1100",
        "category": "sports",
        "authors": [],
        "text": "Umpire's big miss that led to heated Osaka handshake\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/tennis/aussie-wildcards-stun-top-seeds-in-the-doubles-20260123-p5nwit.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Aussie wildcards stun top seeds in the doubles",
        "publish_date": "Fri, 23 Jan 2026 12:48:46 +1100",
        "category": "sports",
        "authors": [],
        "text": "Aussie wildcards stun top seeds in the doubles\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/basketball/pepper-red-hot-as-lights-out-wildcats-shoot-down-snakes-20260123-p5nwik.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Pepper red hot as lights-out Wildcats shoot down Snakes",
        "publish_date": "Fri, 23 Jan 2026 12:20:20 +1100",
        "category": "sports",
        "authors": [],
        "text": "The Perth Wildcats have produced a phenomenal, lights-out shooting display to crush the Cairns Taipans 106-69.\n\nKristian Doolittle congratulates Elijah Pepper on a career-high 25 points against the Taipans. Credit: Getty Images\n\nIn a performance for the ages, the fifth-placed Wildcats shot a blistering 40-of-67 from the floor, including 15-of-27 from three-point range, at RAC Arena on Thursday night.\n\nNow 16-10 for the season, the Cats sprinted away from the ninth-ranked Taipans (7-19) on the back of a 38-13 third-quarter evisceration.\n\nElijah Pepper, with a career-high 25 points and 6-of-7 three-pointers, Kristian Doolittle (19, 3-of-3) and Dylan Windler (15, 3-of-6) led their long-range assault.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/culture/movies/the-oscar-nominations-are-in-here-s-the-good-the-bad-and-the-ugly-of-this-year-s-nods-20260122-p5nwas.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "The Oscar nominations are in. Here’s the good, the bad and the ugly of this year’s nods",
        "publish_date": "Fri, 23 Jan 2026 11:59:06 +1100",
        "category": "entertainment",
        "authors": [
            "Garry Maddox"
        ],
        "text": "Advertisement\n\nCultureMoviesOscars The Oscar nominations are in. Here’s the good, the bad and the ugly of this year’s nods Garry Maddox January 23, 2026 — 11:59am Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share A A A\n\nIt’s a year for creatively ambitious Hollywood movies backed by substantial budgets at the Academy Awards, with Sinners, One Battle After Another, Marty Supreme and Frankenstein heavily nominated early this morning. And it is also a year for ambitious non-English-language films from other parts of the world with The Secret Agent and Sentimental Value featuring among the contenders. With the nominations dominated by stories about central characters challenging power in different forms, Australia has first-time nominations for Rose Byrne (If I Had Legs I’d Kick You), Jacob Elordi (Frankenstein) and, for best original song, Nick Cave (Train Dreams). Production designer Fiona Crombie, who has been nominated previously for The Favourite, is back for Hamnet. In raw numbers, Sinners leads the way with a record 16 nominations – boosted by the inclusion of a new Oscar for best casting. Next is One Battle with 13 nominations and Frankenstein, Marty Supreme and Sentimental Value all with nine.\n\nAdvertisement\n\nJoining them with best picture nominations are Hamnet, Bugonia, F1, The Secret Agent and Train Dreams. The good Byrne’s best actress nomination is one of the feel-good stories of the nominations. While If I Had Legs I’d Kick You was weirdly in the musical or comedy category when she won at the Golden Globes, Byrne is exceptional as a stressed-out American therapist in a tense drama with a horror edge. Nominated: Rose Byrne with rapper A$AP Rocky in If I Had Legs I’d Kick You. AP\n\nAdvertisement\n\nOver two decades working in the US, she has shone in Bridesmaids and multiple Insidious, X-Men and Neighbours movies, and, on TV, in Damages, Mrs America and Physical. “I can’t believe it,” Byrne told The Hollywood Reporter. “I feel like I’ve snuck into the back of the bus. I can’t believe we got in this extraordinary group of women ... “I love the Oscars. [When I was a] little girl from Sydney, Australia, I used to watch [the show]. The pageantry of it is so fun and theatrical.” Related Article Oscars Rose Byrne, Jacob Elordi lead Australia’s Oscars charge as Sinners makes history Elordi continues his striking Hollywood rise with a best supporting actor nomination at 28 – two years younger than boy wonder Timothée Chalamet, who is one of the favourites to win best actor for Marty Supreme.\n\nAdvertisement\n\nHe gave heart and deep feeling to the Creature, who emerges from a demented lab and discovers the curse of eternal life, in Frankenstein. Even in the early stages, when his character was chained up and knew only the single word “Victor”, Elordi made him compelling to watch. Nick Cave’s Train Dreams – Bryce Dessner co-wrote the music – was a haunting closer to the poetic drama Train Dreams. It will be an outsider at the Oscars, however, given it is up against Golden from the pop culture phenomenon that is KPop Demon Hunters. Without discounting the merits of One Battle After Another, Marty Supreme and Hamnet, Sinners deserves to lead the nominations. At a time when cinema fans regularly lament the lack of original films, writer-director Ryan Coogler delivered one that ambitiously fused genres, spoke about race and class in America and took creative risks. Deservedly nominated: Jacob Elordi as the creature in Frankenstein. Ken Woroner/Netflix The bad\n\nAdvertisement\n\nJoel Edgerton has been close to an Oscar nomination before, for playing an FBI agent in Black Mass a decade ago. This year he absolutely deserved to be recognised for his heartbreaking performance as an early 20th century itinerant logger and railroad labourer in Train Dreams. There is so much emotion – suppressed and occasionally overflowing – in a quiet character who experiences horror, loneliness and grief but endures to finally feel like he understands life in his last years. Train Dreams is up for best picture, adapted screenplay, cinematography and original song; the Australian actor who made it so moving has sadly missed out. While there are two non-English-language films up for best picture, Sentimental Value and The Secret Agent, the Academy overlooked the best one. Jafar Panahi’s It Was Just An Accident is a tense and twisting thriller, darkly comic, about the abuse of power in Iran that won the Palme d’Or, the major prize, at Cannes. Nick Cave, who is nominated for best original song for Train Dreams, performing in London with the Bad Seeds. Megan Cullen\n\nAdvertisement\n\nPanahi, who had already been jailed for “creating propaganda against the system” and supporting anti-government protesters, made it in secret to avoid government censorship, and his courage and craft should have been rewarded with a best director nomination as well. And how unlucky were Chase Infiniti, the breakout star as the daughter of a revolutionary in One Battle, and Paul Mescal, who played Shakespeare in Hamnet? Their categories, best actress and actor, were so competitive this time around that they missed out. Way back in 2002, when Will Smith was nominated for best actor for Ali, he told me the Academy had historically overlooked deserving African-American actors and gave Delroy Lindo from Malcolm X, Get Shorty and Cider House Rules as evidence. At 73, Lindo has finally received a nomination. He is up for best supporting actor for playing a legendary blues musician in Sinners. Should have been nominated: Joel Edgerton in Train Dreams. Netflix\n\nAdvertisement\n\nThe ugly Voters decided that sequels were ugly. There are no nominations for Wicked: For Good, not even for Ariana Grande’s performance as Glinda, and Avatar: Fire and Ice is only up for best visual effects, which it might well win, and costume design. Ariana Grande as Glinda in Wicked: For Good. AP While Frankenstein and Sinners deserved to be up for best make-up and hairstyling, alongside the little-seen Kokuho and The Ugly Stepsister, I was never sure what to make of Dwayne Johnson’s transformation into a tormented UFC fighter in The Smashing Machine. His performance was impressive, but the character’s look felt awkward and forced. Still, he did not look like Dwayne Johnson, which I guess was the triumph.\n\nAdvertisement\n\nThe Oscars take place on Monday, March 16, Australian time. Must-see movies, interviews and all the latest from the world of film delivered to your inbox. Sign up for our Screening Room newsletter.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/nrl/angus-crichton-is-signed-now-rugby-australia-are-sweating-on-max-jorgensen-20260122-p5nw8l.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Angus Crichton is signed. Now Rugby Australia are sweating on Max Jorgensen",
        "publish_date": "Fri, 23 Jan 2026 11:46:00 +1100",
        "category": "sports",
        "authors": [
            "Christian Nicolussi"
        ],
        "text": "“You never say never,” Jorgensen said. “I loved my time playing league when I was younger, I still love the game and love watching it. “We’ll see where my career takes me. If it happens, it happens.” What about the five-year offer from Rugby Australia? “I’m still signed to the Tahs and Rugby Australia this year. We’re still working through a few things,” he said.\n\n“I’m loving my time playing at the Tahs, but we’ll get through this year and see what happens. “It’s always nice to [get it done early], but sometimes it’s not up to you. Hopefully, it works itself out. Max Jorgensen with Joseph-Aukuso Suaalii at Waratahs training in Mudgee. Credit: Amber Hooper “I like to keep my cards close to my chest. Obviously, a home World Cup is massive. It doesn’t come around too often. I do know to play in a home World Cup would be really cool.” The addition of Crichton and Nawaqanitawase, will that be factored into your decision?\n\n“Angus and Marky are two very talented athletes who have done great things in union, including ‘Gus’ at schoolboys level, and Marky with the Tahs and Wallabies,” Jorgensen said. “To have them back in the game is exciting. They’re two amazing players. You do want to play with the best players. They’re elite with experience. ‘I’m loving my time playing at the Tahs, but we’ll get through this year and see what happens.’ Max Jorgensen on his future “I want to win a Super Rugby title with the Tahs. With the Wallabies, there are Bledisloes, World Cups, even trying to win against the British and Irish Lions. They are all things that are on your bucket list when growing up. “But like I said, we’ll see.”\n\nWaratahs coach Dan McKellar spoke for everyone in rugby when he said: “If we get that [deal] done sooner rather than later, everyone will sleep that little bit easier. “I can understand why the Roosters, or any NRL club, would be interested. He’s an elite talent. Max Jorgensen in Mudgee where the Waratahs spent a week training. Credit: Amber Hooper “Hopefully, he’s comfortable and enjoying where he is at the moment, and he feels valued. Max loves rugby union and what the game can offer. “He will be [well] remunerated, regardless of where he plays.\n\n“I’d be pretty confident he’s enjoying the environment we have here at the Waratahs, and he’ll enjoy it with the Wallabies. “Max’s greatest strength is his humility. He’s not a self-promoter. He’s incredibly humble, comes from a good family, and doesn’t get ahead of himself. “We’ve seen it many times before when 21-year-olds all of a sudden become superstars overnight, and they can get ahead of themselves. That’s certainly not the case with Max.” Jorgensen was born in England, but grew up in Sydney’s inner-west, playing rugby with the Balmain Wolves, and league with the Leichhardt Juniors, later switching to the Concord Wolves once the Juniors folded. He was in the Balmain Harold Matthews’ team that featured Wests Tigers forward Tony Sukkar.\n\nOne of Jorgensen’s earliest memories was wearing a Roosters jersey and supporting the club where his father spent two seasons and racked up 20 tries in the 1990s. Peter celebrated tries with the “aeroplane”, which Max said he might produce this season. “I’ve seen videos of it – I might have to bring it out this year,” he said, with a smile. Max Jorgensen playing for the Waratahs last year. Credit: Getty Images “I leaned on dad a lot when I was younger, and definitely when I was transitioning into professional footy. I still do now, and he’ll give me pointers after each game. “Dad always leaned towards supporting the Roosters, and it rubbed off on me.\n\n“I’ve followed them my whole life. I did a pre-season with the club under Robbo a couple of years ago, which was also the first time I met ‘Su’ [Joseph-Aukuso Suaalii]. “I loved Robbo as a coach, he’s a great bloke as well and a great man.” Brad Fittler is Roosters’ royalty, while his son, Zach, is now with the Waratahs, and played against Jorgensen in the GPS first XV schoolboys competition. If Jorgensen switched, Fittler said there was no question about him being a success. “He could make it as fullback or five-eighth; there was a time I thought he could have been too small, but some of the best players in our comp are now small,” Fittler said. “He’s tough, has a great skill set, and he reads the game well.”\n\nLoading The Roosters could do with a fullback or winger like Jorgensen. Fullback James Tedesco is signed until the end of next year, and although he is in the kind of form to keep playing until he is 40, the skipper cannot go on forever. Veteran winger Daniel Tupou is in the same boat, while Nawaqanitawase’s exit creates another wing opening. The Roosters have also had success starting two of their great fullbacks – Anthony Minichiello and Roger Tuivasa-Sheck – on the wing before transitioning to the No. 1. Jorgensen gives little away, but there is no hint of arrogance. He is tight with Suaalii. He was genuinely unsure if he needed a shirt for this masthead’s photo shoot, and politely asked if the zinc on his face would be an unwanted distraction for the photographer.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/culture/tv-and-radio/stuck-on-what-to-watch-we-have-you-covered-20260123-p5nwfw.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Stuck on what to watch? We have you covered",
        "publish_date": "Fri, 23 Jan 2026 11:39:51 +1100",
        "category": "finance",
        "authors": [],
        "text": "Stuck on what to watch? We have you covered\n\nWhether you're looking for deep historical reflection or a fresh escape into the world of Westeros, this week's What to Watch offers a powerful contrast between real-world legacy and fantasy adventure.",
        "source": "TheAge"
    },
    {
        "url": "https://au.news.yahoo.com/chinese-heiress-shock-admission-014227408.html",
        "title": "Chinese heiress’ shock admission",
        "publish_date": "2026-01-23T01:42:27Z",
        "category": "finance",
        "authors": [],
        "text": "LanLan Yang’s lawyer has revealed there is an “explanation” after the Chinese heiress admitted to breaching her bail following her alleged involvement in a collision with Kyle Sandilands’ chauffeur.\n\nMs Yang, 23, was allegedly in a $1.5m Rolls-Royce SUV when a head-on collision unfolded with a Mercedes that Sandilands’ chauffeur was in last July.\n\nThe chauffeur, 52-year-old George Plassaras, was left with significant injuries following the alleged incident on New South Head Rd in Rose Bay in Sydney’s east on July 26 last year.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nThe case sparked significant interest on Chinese social media, with droves of fans attending some of Ms Yang’s previous court appearances.\n\nHowever no fans were present when Ms Yang admitted to breaching her bail conditions at the Downing Centre Local Court on Friday.\n\nChinese heiress LanLan Yang has admitted to breaching her bail following her alleged involvement in a collision with Kyle Sandilands’ chauffeur. Picture: NewsWire.\n\nThe heiress wore Chanel sunglasses and a face mask as she sat in court.\n\nHer lawyer, Greg Stanton, told the court his Ms Yang’s culpability was reduced while giving explanation for the breach.\n\n“There’s an explanation, it doesn’t attribute any great fault to her,” Mr Stanton told the court.\n\n“There was a miscommunication ... an assumption was made.”\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nThe matter had been in court on Thursday where Ms Yang’s bail address was changed following the breach.\n\n“As I understand it, it is to do with the residence which Your Honour, the matter was in yesterday for a bail variation and that was done,” the prosecutor said on Friday.\n\n“Her residence is now today correct, but there was a previous breach ... in terms of that residence.”\n\nMs Yang, 23, is a Chinese heiress. Picture: 7News\n\nMagistrate Karen Stafford confirmed the breach was established, and bail was varied the day prior.\n\nMs Yang declined to speak with reporters outside court on Friday before she was whisked away into an awaiting Tesla.\n\nShe is facing a string of charges, and has pleaded not guilty to refuse or fail to submit to breath analysis, dangerous driving occasioning actual bodily harm, not give particulars to police, and negligent driving.\n\nThe matter is next due before the Downing Centre Local Court on January 30.",
        "source": "Yahoo"
    }
]