[
    {
        "url": "https://www.9news.com.au/national/good-guys-fine-misleading-store-credit-accc-australia/4a71f1d3-36ac-4b9c-871b-02273861c929",
        "title": "Aussie retail giant fined $13.5 million after misleading promotion",
        "publish_date": "Tue, 09 Sep 2025 01:15:07 +0000",
        "category": "finance",
        "authors": [
            "Sep"
        ],
        "text": "Appliance retail juggernaut The Good Guys has been hit with a $13.5 million penalty from the Federal Court after being found to have misled over 20,000 consumers and failing to provide store credits.\n\nBetween 2019 and 2023, the Aussie retail giant offered 116 promotions where store credit was offered to customers if they spent a minimum amount, purchased a specific brand or product, or used a particular payment method. The credits ranged from $10 to $1000.\n\nHowever, The Good Guys was forced to admit the advertisements for the credits did not adequately show the expiry period of the store credit, with some being as short as seven days.\n\nREAD MORE: Lewd letter to paedophile Epstein comes back to haunt Trump\n\nThe misleading practices took place between 2019 and 2023. (The Good Guys/Facebook)\n\nThe company also admitted they failed to provide about 21,500 customers with their entitled store credit within the time frame required.\n\n\"The chance to earn store credit may have encouraged some consumers to make a purchase at The Good Guys they otherwise may not have made or to choose this retailer over others\", ACCC Chair Gina Cass-Gottlieb said.\n\n\"We were concerned some of those consumers may not have done so had they been aware of all the conditions.\"\n\nIn addition to the fine, The Good Guys is also required to provide redress to certain consumers who participated in store credit promotions by providing a store credit with a longer expiry period.\n\nThe Good Guys has cooperated with the ACCC and is remediating consumers who did not receive their store credit after failing to meet the conditions.\n\n\"Businesses that use promotional programs to attract consumers and differentiate themselves from their competitors must ensure they provide any gifts or rebates to eligible consumers in the time period they said they would,\" Cass-Gottlieb said.\n\nThe Good Guys has been contacted for comment.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/20-million-dollar-powerball-ticket-spotted-on-fridge-days-after-win-victoria/6c5c8c34-5b99-4d4a-b363-f3b1af35ec63",
        "title": "Couple in affluent suburb had $20m lottery ticket stuck on fridge door for days",
        "publish_date": "Mon, 08 Sep 2025 23:39:26 +0000",
        "category": "finance",
        "authors": [
            "Sep"
        ],
        "text": "For days after an $80 million Powerball draw, a Melbourne couple ignored the ticket stuck on their fridge door - but when they finally made time to check it, they found themselves $20 million richer.\n\nThe grandparents in well-heeled Brighton, one of the most affluent suburbs in the state, held one of the four division one winning tickets in the Powerball draw last Thursday, pocketing a $20 million slice of the overall $80 million pie.﻿\n\nHowever, their ticket was unregistered, meaning officials had to wait for them to claim their prize, which took a few days.﻿\n\nREAD MORE: Lewd letter to paedophile Epstein comes back to haunt Trump\n\nA Melbourne couple are $20 million richer after claiming their win. (Supplied)\n\n\"This is unbelievable. We had no idea, and this whole time the ticket was just sitting on our fridge,\" the grandmother said.\n\n\"We've both been really busy, so we just forgot to check it.\"\n\nShe said the couple would look after their children and grandchildren, and buy \"a little house\".\n\n\"Heck! I don't know if I should keep working or retire,\" she said.\n\n\"I've had a radical change of plans for the day, that's for sure. It will take a long time for this to sink in.\"\n\nBrighton is one of the most coveted suburbs in Melbourne. (Photo credit: Amy Hemmings)\n\nBrighton is one of the wealthiest suburbs in Victoria, with a median house price of $2,842,000 in the latest Domain House Price Report .﻿\n\nThe winning entry was purchased from East Brighton Newsagency, 613 Hampton Street, Brighton.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/anz-announces-loss-of-3500-jobs-in-one-year/827cf978-6f23-479b-baf6-a2ceb93dd241",
        "title": "ANZ to slash 3500 jobs in next 12 months",
        "publish_date": "Mon, 08 Sep 2025 22:45:01 +0000",
        "category": "finance",
        "authors": [
            "Sep"
        ],
        "text": "A﻿NZ will slash thousands of jobs in the coming 12 months as part of a plan to \"simplify\" the bank and \"strengthen its focus\".\n\nIn a release today, the bank said it expected to farewell 3500 employees by September 2026.\n\nIt promised to treat employees with \"care and respect\"﻿ and to move through the process as quickly as possible.\n\nREAD MORE: Man with Palestinian flag rides horse on Bondi Beach days after protests ﻿\n\nANZ will cut thousands of jobs in the next 12 months. (Will Willitts)\n\nANZ, which has a market capitalisation of $98.3 billion, said there would be \"limited impact\" on frontline roles that involved interaction with customers.\n\n\"We know this will be difficult news for some of our staff,\" ANZ chief executive Nuno Matos said.\n\n\"While some of these changes have already commenced, we are committed to working through the impacts as quickly and safely as we can, with both care and respect for our teams affected.\"﻿\n\nREAD MORE: Teen girl attacked by dog in NSW dies in hospital\n\nANZ chief executive Nuno Matos says the bank is committed to working with staff who will be impacted by the cuts. (Arsineh Houspian)\n\nDeparting staff will be offered support including career advice, access to training, and individual support.\n\nThe bank also pledged to engage with employees and \"relevant\" unions.\n\nSurprise entrant to top 10 most trusted brands in Australia View Gallery\n\n\"We are operating in a rapidly evolving and highly competitive banking environment,\" Matos said.\n\n\"As we continue our strategic review, we are eliminating duplication and complexity, stopping work that doesn't support our priorities, and sharpening our focus on improving our non-financial risk management practices across the bank.\"﻿",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/eleven-per-cent-of-aussies-admit-to-using-credit-to-cover-everyday-expenses-according-to-new-finder-research/ee808027-8c40-4df0-b309-2465208ebfea",
        "title": "Eleven per cent of Aussies admit to using credit to cover everyday expenses",
        "publish_date": "Mon, 08 Sep 2025 20:28:18 +0000",
        "category": "finance",
        "authors": [
            "Sep"
        ],
        "text": "Australians are using credit cards to cover everyday expenses, new research from Finder shows.\n\nAs cost-of-living pressures continue, a survey by the comparison website ﻿found that 11 per cent of respondents have paid for daily expenses with plastic.\n\nFor those who have credit card debt, 40 per cent don't prioritise paying down what they owe.\n\nAS IT HAPPENED: Mushroom killer arrives at court to learn her fate\n\nAlmost 30 per cent of survey respondents are putting other expenses ahead of their credit card balances. (Getty)\n\nAlmost 30 per cent of respondents said they prioritised other expenses first, while 11 per cent of﻿ people said they could not afford to pay down their credit card debt.\n\nThe survey found fewer women than men prioritised paying down their credit card debt.\n\nMeanwhile, seven per cent of men said they could not afford﻿ to pay off their debt compared to 16 per cent of women.\n\nFinder money expert Sarah Megginson said millions risked spiralling debt as a growing number put credit card repayments last.\n\n\"Failing to tackle credit card debt keeps millions of Australians trapped in a cycle that makes it harder to get on top of their budget and creates so much stress,\" Megginson said.\n\nREAD MORE: Police probe potential mistaken identity after two kids stabbed to death\n\nFor those who have credit card debt, 40 per cent don't prioritise paying down what they owe. (Nikki Short)\n\n\"Plastic debt can quickly snowball because of the high interest rates and end up costing you far more than you borrowed.\n\n\"Every month you delay paying it off, you're giving your bank more of your hard-earned money in interest.\"\n\nMeggison urged people to seek out help to get themselves into a more comfortable position.\n\n\"It can feel really hard to get on top of credit card debts, like you're chasing Peter to pay Paul each month, but there is help available,\" she said.\n\n\"If your debts are snowballing, you can contact the National Debt Helpline for free financial counselling.\"",
        "source": "9News"
    },
    {
        "url": "https://www.abc.net.au/news/2025-09-09/pocock-leadership-change-anu-now/105751586",
        "title": "'Get on with it': Senator calls for urgent change at ANU",
        "publish_date": "Tue, 09 Sep 2025 01:41:56 +0000",
        "category": "finance",
        "authors": [],
        "text": "Senator David Pocock has repeated his calls for a change of leadership at the Australian National University, as speculation mounts about the future of Vice-Chancellor Genevieve Bell's position.\n\nProfessor Bell has been under increasing scrutiny in recent months over cost-cutting measures at the ANU, and her handling of related concerns from staff and students.\n\nMr Pocock said this morning he had spoken to staff, students, professors and deans about the situation, and urged the council to take action.\n\n\"There is a huge amount of dissatisfaction with leadership there and I think we're hopefully nearing the point where we do see some change in leadership at the top,\" Mr Pocock told ABC Radio Canberra.\n\n\"I would urge the council to get on with it now.\n\n\"Based on what I hear, the current leadership simply doesn't have the trust or any faith that they can be turned around.\"\n\nThe ABC understands the majority of the university's deans have expressed a loss of confidence in Professor Bell's leadership.\n\nANU Vice-Chancellor Genevieve Bell is under pressure to resign. (ABC News: Adam Shirley)\n\nIt is understood the relationship has deteriorated over the course of the year.\n\n\"It is the case I have had to say at this university, 'The deans work for me, not the other way around,\" Professor Bell told ABC's Stateline in March.\n\n\"For a whole lot of people, I am a very different leader than my predecessor.\n\n\"That has been a long, interesting, complicated set of conversations that we're having, but people do understand that ultimately I am the one that makes the decisions here — but I like to make them as collectively as we can.\"\n\nPocock calls for change of leadership\n\nWhile Senator Pocock said Professor Bell had \"lost the faith of people at the ANU\", he has also called Chancellor Julie Bishop's position into question.\n\n\"I don't think Genevive Bell is the right person to turn things around,\" he said.\n\n\"I think she has lost the faith of people at the ANU and there is a need for a a change of leadership.\n\n\"And I also think that the Chancellor has some very serious allegations against her, and I think in almost any other workplace would be required to step aside whilst those are are dealt with in an independent manner.\"\n\nHe said he had met with the Chancellor and the Vice-Chancellor \"a number of times\" over the past year in his capacity as a senator for the ACT to relay his concerns.\n\n\"I've heard their side of side of the story, and will continue to push publicly,\" he said.\n\nACT Senator David Pocock has renewed his calls for a change of leadership at the top of the Australian National University. (ABC News: Callum Flinn)\n\nThe ANU has been plagued by negative headlines recently, including announcing plans to cut 100 jobs to save $250 million and bullying allegations against Chancellor Bishop — which she denies.\n\nFormer ANU chancellor Gareth Evans has also publicly slammed decision making at the university as ignoring the institution's mission.\n\nSenator Pocock said there were \"concerns across the board\" at the university, including a \"culture of fear\", a lack of transparency in decision making, and the governance structure of the Council.\n\n\"This is no surprise to anyone who has been following the saga that is the ANU at the moment,\" he said.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-09-09/esperance-housing-council-solution-in-tight-rental-market/105708336",
        "title": "Shire backs 'shovel-ready' plan to fix one of Australia's toughest rental markets",
        "publish_date": "Tue, 09 Sep 2025 00:27:06 +0000",
        "category": "finance",
        "authors": [],
        "text": "The crystal blue waters off the southern coast of Western Australia have long been a key draw for the popular tourist town of Esperance.\n\nHowever, people wanting to call Esperance home are finding it almost impossible to get a rental property.\n\nEsperance is the second-tightest regional rental market in the country. (ABC News: Mark Bennett)\n\nA Regional Australia Institute (RAI) report on the country's housing crisis published in August showed the town's rental vacancy rate was 0.15 per cent in December 2024, the second-tightest rental market in regional Australia.\n\nThe shortage of local housing stock is not a new issue, with the ABC reporting on how the crisis affected staffing at childcare centres in March 2024.\n\nIn 2025, childcare centres in the town of about 15,000 people are reporting waitlists of more than 100 children.\n\nA Shire of Esperance survey of local businesses in January found an additional 60 jobs could be filled immediately if accommodation was available.\n\nThe shire believes it has a solution, with a \"shovel-ready\" 20-unit key worker accommodation project to ease the pressure of the worst rental vacancy rate in the state.\n\nRental prices have also increased due to the high demand. (ABC News: Hayden Smith)\n\nLack of housing stifling growth\n\nEsperance shire president Ron Chambers said the lack of housing options was having a \"domino effect\" across industries.\n\n\"The biggest, biggest problem within the community is the ability to fill critical roles around aged care, nursing, child care and even at the shire,\" he said.\n\nRon Chambers says the region's economy is struggling to grow without new housing stock. (ABC Esperance: Andrew Williams)\n\n\"It has a massive impact across the whole lot of it, even directly limiting population growth, which is what you need in an area to get business expansion, and then the region's ability to attract and retain talent.\"\n\nThis is supported by the RAI's report, which highlighted \"resounding feedback from consultations\" that a lack of housing for workers was a key barrier to overall regional economic growth and development.\n\n\"Without sufficient housing, filling those jobs and realising [a] region's economic potential will remain a major challenge,\" the report stated.\n\n'Shovel-ready' silver bullet\n\nCr Chambers said the situation would not improve without help from the state government, with options including releasing state-owned land in the town and covering the costs of power, water and sewage infrastructure to new blocks.\n\nCr Chambers said the shire had a \"shovel-ready solution\" called the Key Worker Accommodation Project, which would be the quickest way to ease the issue with an estimated 24-month build time, but it needed the state government's help.\n\nThe proposed location of the development is on the corner of Council Place and Jane Street in Esperance. (Supplied: Shire of Esperance)\n\nThe development would add 20 units to the heart of town, with a mix of two and three-bedroom configurations, but would need a $7.73 million state government contribution on top of $2.3 million from the shire.\n\nRAI head researcher Simon Pryor said state governments should set up regional sub-targets for new homes.\n\n\"Housing estate developments in the regions are often smaller than in the cities, so from a unit cost perspective they look more expensive,\" Mr Pryor said.\n\nSimon Pryor's research for Regional Australia Institute found 0.15 per cent of homes were available to rent in Esperance. (Supplied)\n\n\"Financing can be a challenge in regions for a whole range of reasons, so there is definitely a role for state governments … to help dissolve some of those financing challenges.\"\n\nProject funding to be assessed\n\nThe shire has applied for project funding through a Department of Communities (DOC) funding pool, which supports a range of housing delivery types, including key worker and service worker accommodation.\n\nSubmissions for this DOC funding stream closed on September 2.\n\nHousing and Works Minister John Carey would not comment on whether the state government had specific plans to address Esperance's 0.15 per cent rental vacancy rate, but did highlight efforts it had made towards tackling the state's housing crisis.\n\nJohn Carey says the Labor government has invested $5.8 billion in housing and homelessness measures since 2021. (ABC News: Courtney Withers)\n\n\"Our government recently introduced stamp duty exemptions and concessions changes that are more generous for regional WA, and mean first-home buyers in Esperance will save on stamp duty for homes valued up to $750,000,\" he said.\n\n\"The latest state budget funded the $25 million Regional Housing Support Fund, which will provide grants of up to $5 million to support new housing and land supply across regional WA.\"\n\nThe state's $80 million Infrastructure Development Fund supports up-front development costs associated with connections to water, electricity and sewerage infrastructure.\n\nMr Carey would not confirm whether the government would consider financially supporting Esperance's Workers Accommodation Project, but said it would continue to collaborate with the shire to find suitable funding sources.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-09-09/australia-post-sept-25-resume-us-shipping-tariffs/105751932",
        "title": "Australia Post to resume US shipping after meeting tariff rules",
        "publish_date": "Tue, 09 Sep 2025 00:16:31 +0000",
        "category": "finance",
        "authors": [],
        "text": "Australia Post is resuming all US shipping within weeks, after the national delivery service found a way to meet new US tariff rules.\n\n\"While we are planning to lift the temporary suspension on Thursday, September 25, if we are able to lift this earlier, we absolutely will,\" Australia Post executive Gary Starr said.\n\nThe government-owned postal service made the extraordinary decision last month to stop delivering many items to the United States in response to the Trump administration ending the so-called \"de minimis\" exemption on low-value goods entering the country.\n\nUntil August 29, parcels of goods worth less than $US800 ($1,230) were not taxed when they arrived in the US — an exemption relied upon by many Australian retailers to send items to the US duty-free.\n\nAustralia Post was just one of many global postal carriers thrown into chaos due to not having systems to collect and distribute the new taxes on imported goods.\n\nIt announced on August 26, just days before the end of the de minimis, that it needed to halt most US shipping.\n\nIt also halted shipping to a range of smaller surrounding nations, including Puerto Rico and Guam.\n\nAustralia Post now says it has a deal with a third-party platform to deal with the taxes, and will resume all shipping by September 25.\n\n\"Along with more than 190 other postal providers internationally, we've been caught in a fast-moving situation not of our making,\" Mr Starr said.\n\n\"The real impact has been on our customers who export their goods to the US accessing our cost-efficient postal service, so we've been working around the clock to find a solution.\"\n\nAre you being impacted by Australia Post's decision? Do you know more about this story? Email our journalist confidentially on terzon.emilia@abc.net.au or em.terzon@proton.me\n\nA wide range of local businesses that use Australia Post to ship items to the US had to stop sending orders there, including fashion brands and Etsy sellers.\n\nFashion label Apero pre-empted Australia Post's suspension of services and halted US orders three weeks ago.\n\n\"We've obviously lost revenue but that's always the case with uncertainty,\" Apero co-founder Laz Smith told ABC News.\n\n\"That's not necessarily Australia Post's fault. They've been trying to get a solution working.\"\n\nLaz Smith does not blame Australia Post for loss of revenue. (ABC News: Michael Lloyd)\n\nMr Smith is already working with Australia Post's new third-party platform and expects his fashion brand to turn US orders back on by the end of the month.\n\n\"You can't use Australia Post now unless you go with Zonos,\" he said.\n\n\"It's been interesting. We're making decisions on the fly.\n\n\" At least we'll have certainty about Black Friday sales now. \"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-09-09/the-good-guys-misleading-store-credit-promotions/105751816",
        "title": "The Good Guys hit with $13.5m fine for deceptive store credit promotions",
        "publish_date": "Tue, 09 Sep 2025 00:11:40 +0000",
        "category": "finance",
        "authors": [],
        "text": "The Good Guys has been ordered to pay $13.5 million in penalties for misleading promotions and for failing to provide store credit to more than 20,000 eligible customers.\n\nThe Federal Court ordered The Good Guys Discount Warehouses (Australia) Pty Ltd to pay the penalties for 116 promotions that ran between July 2019 and August 2023.\n\n\"We took this court action because we were concerned that The Good Guys had failed to adequately disclose some really key conditions attached to these store credit promotions,\" Australian Competition and Consumer Commission (ACCC) chair Gina Cass-Gottlieb said.\n\nIn those promotions, The Good Guys offered customers store credit — also called StoreCash in some promotions — if they spent a minimum amount, purchased a specific brand or product, or used a particular payment method.\n\nThe amount of credit varied between $10 and $1,000, depending on the promotion.\n\nOne of the store credit promotions. (ACCC)\n\nThe Good Guys admitted that its advertisements for the store credit promotions did not disclose, or adequately disclose, the expiry period of the store credit.\n\nIn some promotions that period was less than 10 days and in most cases customers could only get a store credit if they opted in to marketing communications from The Good Guys.\n\n\"The chance to earn store credit may have encouraged some consumers to make a purchase at The Good Guys they otherwise may not have made or to choose this retailer over others,\" Ms Cass-Gottlieb said.\n\n\"We were concerned some of those consumers may not have done so had they been aware of all the conditions.\"\n\nShe added that businesses \"must clearly disclose any key terms and conditions or limitations to avoid misleading consumers\" when advertising promotional offers.\n\nThe Good Guys also admitted that it did not provide store credit within the timeframe it specified to about 21,500 consumers.\n\nThe Federal Court ordered The Good Guys to provide redress to customers who participated in the promotions by now providing them with store credit with a longer expiry period.\n\nAll eligible customers will be contacted by The Good Guys for redress, the ACCC said.\n\nAny customer who did not receive their store credit due to not being signed up to marketing material has been remediated, according to the ACCC.\n\nThe ACCC said The Good Guys co-operated in the process of investigation, admitted liability, and agreed to make joint submissions, including in relation to penalties to the Federal Court.\n\n\"The Good Guys takes its compliance with the law very seriously and has worked cooperatively with the ACCC to resolve the matter,\" CEO Terry Smart said in a statement.\n\n\"The Good Guys has always sought to provide value and benefits to its customers and has always prided itself on its high levels of trust with consumers.\"\n\nABC",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-09-09/richmond-aflw-in-trouble-after-four-straight-losses/105748382",
        "title": "Richmond AFLW side packed with big names but winless and in trouble",
        "publish_date": "Mon, 08 Sep 2025 23:40:26 +0000",
        "category": "sports",
        "authors": [],
        "text": "Despite having some of the most talked-about names in the AFLW on their roster, Richmond currently sits in 17th place after losing their opening four matches of the season.\n\nAnd those defeats have not been narrow ones.\n\nThe Tigers went down to Essendon by 15 points, the Western Bulldogs by 21 points and Sydney in the opening round by 20 points, with their heaviest defeat coming last weekend, a 37-point hammering by Melbourne.\n\nAFLW young guns putting competition on notice Photo shows Zippy Fish of the Swans kicks the ball . Sydney superstar and co-captain Chloe Molloy says \"the talent is insane\" in the new crop of AFLW players who have debuted over the weekend.\n\nThis is despite a list containing the likes of league best and fairest Monique Conti, former number-one draft pick Ellie McKenzie, Katie Brennan, Caitlin Greiser and promising teenager Sierra Grieves.\n\nThey are now just one of two AFLW sides winless so far this season along with GWS, which finished 16th last year.\n\nGiven the brevity of the competition, a 0-4 start could mean its season is over before the side has really had a chance to click into gear.\n\nBut this is a team that made finals last year. So, what has happened?\n\nWhat's going on?\n\nAFLW analyst and commentator Gemma Bastiani says Richmond's biggest issue is not being able to convert forward 50 entries into goals, often due to poor decision-making and a lack of chemistry among their forwards.\n\nThis year, they are averaging two fewer goals per game than last, kicking an average of 26.8 points for, compared to 40.8 last season.\n\nDespite getting the ball forward often, they are turning just 9.3 per cent of inside 50 entries into goals — down from 16.8 per cent last year.\n\n\"These numbers are reflective of really poor decision-making in the front half,\" Bastiani told ABC Sport.\n\n\"It's not about skill because we saw last year the players that they have in that forward line can kick big scores, can take control of games.\n\n\"But the way they're choosing to play is not allowing them to do that this year — and teams are defending them better\".\n\nThe Tigers are not able to convert any of their territory into points. (Getty: Morgan Hancock)\n\nIn their round 2 loss against the Western Bulldogs, Richmond had zero marks inside 50.\n\nThey are also easier to score against this year, conceding 50 points per game vs 34.1 last season.\n\n\"So it's not like they've gone into a really defensive mode and that's meant that their scoring has dried up as well,\" Bastiani said.\n\n\"They're actually leaking nearly three goals more per game than they were last year.\n\n\"So not only are they converting poorly, they're then allowing it to go straight back up the other end and hurt them.\"\n\n'A lot of talent'\n\nRichmond are being figured out too easily by their opposition and they are not able to adapt in-game, which is a by-product, in part, of an over-reliance on a few senior players on the park.\n\n\"I think they are absolutely lacking depth, but not so much depth in talent. I think they have a lot of talent on the list. I think they're lacking depth in leadership,\" Bastiani said.\n\nBut that was, Bastiani said, also the nature of the young competition.\n\nThe Tigers have suffered heavy defeats in their four AFLW matches. (Getty: James Wiltshire/AFL Photos)\n\nWhile the league is now 10 seasons old, a lot of players have only been in the system for two to four years.\n\n\"So yes, you can come in with all the talent in the world, but leadership, on-field game awareness, those sorts of things, you learn over time,\" Bastiani said, citing the experience on North Melbourne, Melbourne and Brisbane's lists.\n\n\"That means you have the players on the park that can actually see when you're in an awkward situation and change it.\n\n\"So Richmond on the weekend were really fascinating in that respect because at no point did they have the wherewithal to change what they were doing that wasn't working on their own, so they needed to go into a quarter-time huddle with direction from coaches because they didn't have the players on the park that could actually make those decisions for them.\"\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\nRichmond have had no second-tier team for development or for fringe players to run through since they cut their VFLW program in 2021 and ended their VFLW alignment with Port Melbourne at the start of this year.\n\nThe Tigers' cause was not helped last weekend by the absence of captain Katie Brennan, who pulled up with knee soreness after their clash with Essendon.\n\nSo, season over?\n\nIt is a disappointing start for a side that made the finals last year, exiting in an elimination final to Port Adelaide.\n\nThe year before that, they finished 10th. In 2022 they played in their maiden finals after finishing fourth on the ladder but bowed out in straight sets.\n\nAdd to your watchlist Photo shows Mystery Road Origin ABC iview with young detective Jay Swan in the bush. The critically acclaimed Mystery Road: Origin returns as Detective Jay Swan (Mark Coles Smith) and Mary (Tuuli Narkle) uncover dark secrets in a haunted timber town, where the past threatens to tear them apart.\n\nPublicly, the word remains positive from a club point of view, with coach Ryan Ferguson saying after their fourth defeat of the year there were \"a couple of things going on but we keep chipping away\".\n\n\"Sometimes it can feel a little way off but it can click as well and sometimes [it's] not as far away as you think.\"\n\nThe short AFLW season, however, at 12 rounds this year, makes it hard for teams to make finals after poor starts.\n\nYet it is not impossible. Adelaide currently sits inside the top eight with two wins and two losses.\n\nRichmond next play Geelong at their makeshift home of Princes Park on Sunday, before taking on St Kilda at Moorabbin Oval.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/rural/2025-09-09/farmers-run-in-gumboots-south-gippsland-gumboot-gift/105746634",
        "title": "Gumboots replace running shoes for this annual community race",
        "publish_date": "Mon, 08 Sep 2025 23:27:32 +0000",
        "category": "sports",
        "authors": [],
        "text": "In this rural community, sploshing through a muddy football oval is the highlight of the year.\n\nSince 2019, residents from Victoria's South Gippsland region have donned their best gumboots to compete in the annual Gumboot Gift.\n\nLast week, competitors braved the wind and rain to keep the country tradition alive.\n\nLoading...\n\nAn annual tradition\n\nThe Gumboot Gift is a 120-metre foot race held each year in the Victorian town of Korumburra, as part of the South Gippsland Dairy and Farming Expo.\n\nExpo project secretary Deanne Kennedy said it all began with a dinner table conversation.\n\n\"We were brainstorming novelty events we could include, and somebody came up with the idea of a gumboot race,\" she said.\n\n\"Six years later, it's become a much-loved and very competitive event.\"\n\nDeanne Kennedy says the Gumboot Gift has gained quite a following. (ABC Rural: Faith Tabalujan)\n\nMs Kennedy said it brought the community together, attracting everyone from dairy farmers to Lions Club members.\n\n\"It fits so well with our farming theme and, even though some runners aren't farmers themselves, they're rural people and really value agriculture,\" she said.\n\n'Authentic' boots only\n\nGift competitors must be over 18 and fit to run 120 metres.\n\nHandicaps are incorporated into the race, with previous winners starting 10m behind and older runners given an age-based head start.\n\nOrganisers say the event has become \"very competitive\" over the years. (ABC Rural: Faith Tabalujan)\n\nBut Ms Kennedy said there was one other crucial rule.\n\n\"Only authentic gumboots are allowed,\" she said.\n\n\"That's to say, ones you'd wear on a dairy or beef farm in the middle of a wet Gippsland winter.\"\n\nMs Kennedy said it levelled the playing field.\n\n\"We had to change the rules a couple of years ago because people came in slimline or ankle-height boots,\" she said.\n\n\" But proper gumboots are much harder to run in, so it makes for a more amusing race. \"\n\nA rule that allows \"authentic\" gumboots only levels the playing field. (ABC Rural: Faith Tabalujan)\n\nFamiliar faces\n\nLeongatha resident Sarah Lewis knows this better than most.\n\nMs Lewis won this year's women's Gumboot Gift, but said it was not her first rodeo.\n\n\"I've raced each year since the gift started in 2019, but we didn't have races in 2020 and 2021 because of the pandemic,\" she said.\n\nSarah Lewis (middle) is the winner of this year's women's Gumboot Gift. (ABC Rural: Faith Tabalujan)\n\nMs Lewis said this year, the weather was not on her side.\n\n\"We raced at the Korumburra footy oval, which was super muddy and slippery, and there was plenty of fog around too,\" she said.\n\n\"But that made it extra fun.\"\n\nA worthy cause\n\nKoo Wee Rup dairy farmer and first-time gift participant Simon Finger won the men's event, and agreed it was a tough race.\n\n\"It was quite a wet track, so I just had to make sure my feet were well-planted,\" he said.\n\nMen's event winner Simon Finger (centre) says the wet track made for a tricky race. (ABC Rural: Faith Tabalujan)\n\n\"Last year I didn't run because of a shoulder injury, but this year I entered the older age bracket alongside a bunch of other local dairy farmers.\"\n\nAs this year's Gumboot Gift champions, Ms Lewis and Mr Finger took home a share of $4,000 in prize money, donated by local businesses.\n\nMr Finger entered the race knowing how he would use the money if he won.\n\n\"My mate's wife has cancer, so it'll go towards supporting them,\" he said.\n\n\"That's what I was running for.\"\n\n'Just do it'\n\nMs Kennedy said the Gumboot Gift was a tradition worth keeping.\n\n\"We'll continue to fine-tune the rules just to make sure that they're fair, but we have every intention of keeping the gift alive,\" she said.\n\n\"It's incredibly popular and everyone loves watching on, so why not?\"\n\nAccording to Ms Lewis, anyone can give it a shot.\n\n\"Just do it, because it's so much fun whether you win, lose, or fall over,\" she said.\n\n\"And everyone at the finish line walks away with a smile on their face.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-09-09/women-health-canberra-survey-access-affordability-not-serious/105748894",
        "title": "'Jarring to have my experience dismissed': Women report low healthcare satisfaction",
        "publish_date": "Mon, 08 Sep 2025 23:23:38 +0000",
        "category": "lifestyle",
        "authors": [],
        "text": "A survey of women in Canberra about the state of their health and wellbeing has revealed large gaps in access and affordability, as well as the staggering statistic that almost half of respondents felt doctors didn't take them seriously.\n\nMegan Phipps isn't even the slightest bit surprised.\n\nShe was 20, a university student and otherwise fit and healthy when she started experiencing debilitating abdominal pain five years ago.\n\nIt was so crippling, Ms Phipps was struggling to eat, sleep or study.\n\n\"I couldn't go out with my friends, I had to decline social invitations, I had to withdraw from university,\" Ms Phipps said.\n\n\"It was just so pervasive.\"\n\nMs Phipps was dismissed by her GP when battling debilitating abdominal pain, which would eventually be diagnosed as endometriosis. (ABC News: Ian Cutmore)\n\nMs Phipps's general practitioner ordered testing for appendicitis, which came back clear.\n\n\"When those tests came back fine, my GP told me it must just be stress,\" she said.\n\n\"He said, 'Take a deep breath, you're a young woman — I think you should do some stress management techniques. Try yoga, try journalling. If it's still bad, come back in a month.'\n\n\"I was so shocked. It was really jarring to have my experience dismissed.\"\n\nOwn research led to medical diagnosis\n\nThe pain did not subside and Ms Phipps spent the month doing her own research.\n\nShe returned to the GP's office and asked whether endometriosis could provide an explanation for her symptoms.\n\nIt was that point he referred her to a female GP, who then referred her to a gynaecologist.\n\nEndometriosis meant Ms Phipps was in constant pain and made every-day tasks like cooking difficult. (ABC News: Ian Cutmore)\n\nNine months later, Ms Phipps had laparoscopic surgery, which confirmed the diagnosis of endometriosis and removed the tissue that was causing her severe pain.\n\n\"After the healing process from the surgery, it was like day and night,\" she said.\n\n\" I woke up and, for the first time in nine months, I wasn't in pain — I was in disbelief. \"\n\nThe pain returned last year. The endometriosis had spread to Ms Phipps' bowel, causing a partial obstruction.\n\nShe was told by three specialists in Canberra that the surgery she needed, which required a gynaecologist and colorectal surgeon, wasn't available in the ACT.\n\n\"They basically said, 'We don't have the resources for that. You'll have to head to Sydney',\" she said.\n\n\"So, I started googling specialists in Sydney.\"\n\nLoading...\n\nMs Phipps is not alone in her endometriosis experience.\n\nThe results of this year's Women's Health Matters survey shows \"overall low levels of satisfaction\" with endometriosis healthcare in the ACT.\n\nFor the survey, 1,319 responses were collected on topics including health services, mental health, sexual health, pregnancy and birth, as well as family and sexual violence.\n\nAmong the respondents with endometriosis, 50 per cent said they were either dissatisfied or very dissatisfied with the care they received.\n\nA lonely and unsupported journey\n\nAnother area of healthcare that women felt was lacking in Canberra was in perimenopause and menopause treatment.\n\nThe survey asked respondents who had sought support, information or healthcare in relation to either condition in the past two years whether they got what they needed.\n\n\"A significant proportion — 36 per cent — reported only getting some of what they needed,\" the report states.\n\n\"While 25 per cent reported getting hardly any or none of what they needed.\"\n\nFelicity Brazil was suffering through a myriad of perimenopause symptoms — night sweats, hot flushes, brain fog and anxiety — in 2020.\n\nFelicity Brazil says finding a GP who specialises in women's health makes a big difference. (ABC News: Ian Cutmore)\n\n\"And I'd just find myself crying,\" Ms Brazil said.\n\n\" I'd be at work and be in tears, and I remember thinking, 'This just isn't me'. \"\n\nThe wait for an appointment with her usual GP was longer than Ms Brazil was willing to endure, so she booked in with a different doctor at the same practice.\n\n\"It was a younger woman who hadn't been through it and really didn't know much about it,\" Ms Brazil.\n\n\"She was having to look up online how to help.\n\n\"It was really hard because I really needed something that would help.\"\n\nMs Brazil's dog Bruno became a constant source of support and companionship in what was otherwhile a lonely medical journey. (ABC News: Ian Cutmore)\n\nMs Brazil walked away from the appointment with a prescription for anti-depressants and a new-found realisation of the importance of seeing a GP who specialised in women's health.\n\n\"What I know now — you can't talk about menopause in a 15-minute chat,\" she said.\n\n\"It's a whole-of-wellbeing discussion because it's physical and emotional.\"\n\nMs Brazil turned to a specialist GP at the Menopause Clinic at Sexual Health and Family Planning, which currently has a three-month wait for initial appointment.\n\nThat GP recommended a pelvic floor exam, which confirmed Ms Brazil was perimenopausal and also showed an abnormality on one of her ovaries.\n\n\"Within six weeks, I had both of my ovaries and my fallopian tubes out, and I also had a total hysterectomy,\" Ms Brazil said.\n\n\"I then went straight into menopause.\"\n\nMs Brazil started the Menopause Cafe in Canberra last year after finding a lack of support available for women at that stage of life. (ABC News: Ian Cutmore)\n\nAlthough she was supported medically, Ms Brazil found herself with little social support to navigate this next phase of her life.\n\nThe experience motivated her to start the Menopause Cafe in Canberra, which meets monthly and offers a safe space for women to share their experiences in an effort to destigmatise menopause.\n\nGPs under pressure\n\nMs Brazil said the cafe has given her the opportunity to hear other women's stories of navigating the healthcare system.\n\nBut it quickly made her realise that her journey was among the more positive ones.\n\n\"It's heartbreaking,\" she said.\n\n\"The majority haven't had a good experience, especially initially — some have had medical professionals refuse to give them prescriptions that would alleviate their symptoms because they don't believe in it.\n\n\" Other women have told me that they've been showing evidence to their GP and gynaecologist of their symptoms and still not being believed. \"\n\nIndeed, another concerning finding was that 45 per cent of respondents felt doctors were taking them \"only somewhat seriously or not at all seriously\" when explaining symptoms or health concerns.\n\nThe survey results are difficult for Dr Laura Chapman to hear, but not to understand.\n\nCanberra GP Dr Laura Chapman specialises in chronic disease management. (ABC News: Ian Cutmore)\n\nThe Canberra GP specialises in chronic disease management, and said women often landed in her office after having disappointing experiences elsewhere.\n\n\"Often women will come to see us saying they have felt dismissed or not taken seriously or they've had symptoms that have been really challenging to manage without being offered solutions,\" Dr Chapman said.\n\n\" Sometimes people will come here quite desperate. \"\n\nThe conditions Dr Chapman's patients most commonly complain about have been previously mismanaged or ignored: endometriosis, perimenopause and menopause.\n\nDr Chapman said the gender split of medical professionals was \"still a very real factor\" but added that those conditions were also difficult to diagnose and manage in a standard 15-minute appointment.\n\n\"The pressure that a lot of GPs are under to get through patients quickly has a huge impact,\" Dr Chapman said.\n\n\"It means that they don't have the time to do a deep-dive into symptoms and figure out what's going on.\n\n\"If a GP is seeing 30 or 40 patients a day, with that volume and the time pressures attached to that, it's really hard for them to know each patient and appreciate what might be a shift away from their baseline.\"\n\nAffordability also an issue\n\nChief executive of Women's Health Matters Lauren Anthes. (ABC News: Ian Cutmore)\n\nLauren Anthes is the chief executive of Women's Health Matters, the independent think tank behind the survey, which was also conducted in 2023.\n\nShe said, just as it did two years ago, this year's survey has brought these ongoing issues around affordability and access to healthcare for women into sharp focus.\n\nThe survey revealed around one in five respondents went without medical care or medication as a result of not having enough money.\n\nMs Anthes said that was a really critical piece of information to use when advocating for change.\n\n\"It's a hugely significant statistic,\" Ms Anthes said.\n\n\"One of the key things will be looking at how we work with government and service providers to make services more affordable.\n\n\"And how we ensure that we're identifying those people who can't afford services and how we're making them available.\"\n\nThe need for holistic care\n\nThe survey also highlighted the prevalence of sexual and family violence in the ACT — 39 per cent of women had experienced some form of violence at some point in their life, 40 per cent indicated they had experienced workplace sexual harassment and 27 per cent reported experiencing some form of domestic violence.\n\nMs Anthes said those figures should send a strong message to the ACT government about the need to adequately fund \"a whole system, not just parts of a system\".\n\nMs Anthes says the government needs to work on providing holistic care across the entire health system. (ABC News: Ian Cutmore)\n\n\"We need to make sure we're funding our frontline crisis services and we're doing that adequately while also looking more broadly than that,\" she said.\n\n\"We know that we've got a range of people who experience violence that may not ever go to a crisis service but who will be accessing healthcare services.\n\n\"That's why this dataset is so important — because we can actually look at people who experience violence and also their experiences of the health system.\n\n\"We really need to focus on a whole system in terms of violence prevention.\"\n\nWhen asked what their advice to women would be, Ms Phipps, Dr Chapman and Ms Brazil all said similarly: keep pushing until you get what you need.\n\n\"My advice would be to stick by your guns,\" Dr Chapman said.\n\n\"If you've got symptoms that are causing distress and disability, you are absolutely entitled to have a conversation with a healthcare provider about appropriate, affordable, safe treatment options.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-09-09/pm-says-nampijinpa-price-should-apologise-for-indian-remarks/105751534",
        "title": "PM says Nampijinpa Price should apologise for Indian remarks",
        "publish_date": "Mon, 08 Sep 2025 23:20:07 +0000",
        "category": "finance",
        "authors": [],
        "text": "Prime Minister Anthony Albanese says Liberal senator Jacinta Nampijinpa Price should apologise to Indian Australians for her remarks suggesting more Indian migrants were being brought to Australia because they were Labor leaning.\n\nIn what is becoming a test for Opposition Leader Sussan Ley, colleagues have pressured her to make an apology for Senator Nampijinpa Price, who defected to the Liberals just months ago to run against her as Liberal deputy under Angus Taylor.\n\nThis morning, as the issue roils within the Liberal Party, Shadow Attorney-General Julian Leeser took to social media to make an apology on behalf of his colleague — in the absence of one from either Ms Ley or the NT senator herself.\n\n\"[It] pains me to say it, but I feel like I have to say it. My colleague Jacinta Price said something this week that I want to apologise unreservedly for,\" Mr Leeser said.\n\n\"As my leader Sussan Ley said, she was wrong to say it, and she has walked back those remarks and I am pleased that she has.\"\n\nLiberals face political challenges in diverse communities Photo shows Woman in black blazer and green shirt stands against white wall There is open despair inside the Liberal Party about how to rebuild its standing in multicultural communities.\n\nMr Albanese told ABC Radio National Senator Nampijinpa Price should apologise for the \"hurt\" she had caused Indian Australians.\n\n\"She should apologise for the hurt that has been caused, and her own colleagues are saying that. But even more importantly, leaders in the community are asking for that as well,\" Mr Albanese said.\n\nLast night, Senator Nampijinpa Price did not offer an apology in an appearance on Sky News, after colleagues including Alex Hawke and Barnaby Joyce suggested she should do so.\n\n\"The regret that I have is that I wasn't clearer in my comments,\" Senator Nampijinpa Price said.\n\nSenator Nampijinpa Price also said Ms Ley had not spoken with her directly \"about that issue\".\n\n\"I guess I would expect I would hear directly from the leader herself if it was of huge concern. It didn't appear to be of huge concern,\" she said.\n\n\"I haven't received any such call.\"\n\nOpposition Leader Sussan Ley declined to apologise when asked three times on ABC Insiders. (ABC News: Ian Cutmore)\n\nMs Ley would not say on Sunday whether she had spoken to the NT senator, and also declined to apologise in that same interview — though she said the comments were wrong and should not be repeated.\n\nSenator Nampijinpa Price's remarks last Wednesday suggesting Indian migrants were coming in large numbers to Australia because their Labor-leaning sentiments boosted the government's vote has engulfed the Liberal Party in the days since.\n\nEven as Ms Ley sought to begin repairing relations with Indian Australians, meeting with community groups in Sydney, the senator took to social media to accuse Manager of Opposition Business Alex Hawke of berating her staff and threatening her in a \"cowardly\" phone call.\n\nMr Hawke later rejected those claims, though he confirmed he had advised Senator Nampijinpa Price to apologise.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-09-09/jai-hindley-targeting-podium-in-vuelta-a-espana-final-week/105751220",
        "title": "Hindley eyes Vuelta success, saying 'you race to win bike races'",
        "publish_date": "Mon, 08 Sep 2025 22:40:38 +0000",
        "category": "sports",
        "authors": [],
        "text": "No Australian has ever won the Vuelta a España, the third of cycling's three grand tours.\n\nBut Jai Hindley, one of just two Australians alongside Cadel Evans to ever win one of the sport's premier three-week stage races, is still contemplating glory at this year's event.\n\n\"For sure you race to win bike races, simple as that,\" Hindley told CyclingNews during the race's second rest day on Monday.\n\n\"At the moment the race is for the podium, but in the end it's a grand tour. It's three weeks long and it can be very unpredictable.\n\n\"I'm feeling pretty good, and in general, the Vuelta is still to play for.\"\n\nThe 2022 Giro d'Italia champion currently sits in fourth place overall, 3 minutes 10 seconds behind two-time Tour de France winner Jonas Vingegaard, with João Almeida 48 seconds behind.\n\nJonas Vingegaard, left, has been shadowing João Almeida, right, to ensure he loses no time, while Jai Hindley looms in the background. (Getty Images: Dario Belingheri)\n\nHowever, the 29-year-old West Australian is looming large just 32 seconds behind third-placed Tom Pidcock in the race for the podium.\n\nAlthough a top-three spot is the primary goal, Hindley still holds high hopes for what promises to be an intensely challenging final week.\n\n\"The podium would be really nice, and the team also deserve that,\" Hindley said.\n\n\"But it's not a given nor would be easy to do. It'll be a big fight every day to the finish.\"\n\nSeven stages remain in the race, with a total of 777.4km and 13,643m of climbing to endure, including a crucial 27.2km individual time trial in Valladolid.\n\nHindley's Red Bull-Bora-Hansgrohe team also has 21-year-old Italian phenom Giulio Pellizzari as a backup plan, the leader in the white jersey competition for the race's best young rider sitting in sixth overall.\n\nJai Hindley has the support of 21-year-old Giulio Pellizzari in the mountains. (Getty Images: Tim de Waele)\n\nPellizzari has said he is working for Hindley: \"The team's goal is the podium [for Hindley]. We're fighting for that and the white jersey is a plus,\" he said after Sunday's 15th stage.\n\nBut counting for the Australian is his uncanny ability to excel in the final week of grand tours — Hindley's 2022 Giro triumph was built off the back of a phenomenal stage win the day before the final rest day, after which he chipped away at the narrow lead held by Richard Carapaz until he finally cracked the Ecuadorian on the final 3km of the brutal ascent to Passo Fedaia on the penultimate stage.\n\n\"I think I'm growing into the race and feeling good, and there are great vibes within the team,\" Hindley said prior to the 12th stage.\n\n\"The feeling is good, but it's step by step. I also feel like I'm growing into the race … that's why I like grand tours so much, I guess.\"\n\nHindley feels that the \"decisive\" stage will be the final mountain test up the Bola del Mudo, a 12.3km climb at an average of 8.6 per cent on Saturday.\n\nBut after three tough years, Hindley is just thrilled to be fighting it out at the sharp end of the race.\n\n\"If I'm honest, it's been a long time since I've been at this level,\" Hindley said.\n\n\"It's great to be back at the pointy end of a grand tour.\"\n\nThe Vuelta has taken the riders up some brutal climbs in its 80th edition. (Getty Images: Tim de Waele)\n\nHindley hasn't enjoyed much luck in grand tours since his 2022 triumph in pink — his heavy fall and abandonment at the Giro this year a case in point — but the target was always the Vuelta this year, a race that has proved to be rich ground for Australian success in the past few years.\n\nIn 2024, Ben O'Connor finished second after a record-breaking stint in the leader's red jersey, following on from Jack Haig's surprise third place in 2021.\n\nCadel Evans also finished third at the Vuelta back in 2009.\n\nThere has been other peripheral successes in the year's final grand tour too.\n\nAustralia a cycling powerhouse Photo shows Kaden Groves and Jay Vine wave on a podium Australia has just had arguably its most successful grand tour performance in 14 years, winning two classifications jerseys and claiming second overall.\n\nSprinter Kaden Groves won the points jersey in both of the last two editions, while Jay Vine is the defending king of the mountain.\n\nVine is also leading the race for the polka dot jersey this year, a jersey also won by Michael Storer in 2021.\n\n\"I really enjoy racing the Vuelta, you know? It's a pretty sick race,\" Hindley said.\n\n\"The last couple of years I was normally meant to do it, but I was coming out of the Tour [de France] in a body bag.\n\n\"So I was really happy, super motivated to do it this year. It was the big goal.\"\n\nSo can Hindley upset the odds and mount a serious challenge for the red jersey as the race heads to Madrid?\n\nVingegaard may be in the box seat, but with a brutal Tour de France lingering in his legs and a reduced Visma Lease-a-Bike team making for an oddly conservative strategy and a UAE Team Emirates XRG squad battling on multiple fronts and perhaps not fully investing in Almeida, it's not beyond the realms of possibility.\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-09-09/bee-technology-helps-keep-wa-safe-from-varroa-mite/105738478",
        "title": "Varroa mite reaches another state, but WA has upped its game",
        "publish_date": "Mon, 08 Sep 2025 22:35:40 +0000",
        "category": "finance",
        "authors": [],
        "text": "West Australian beekeepers have taken protecting their species from varroa mite to the next level with high-tech biosecurity along the remote Eyre Highway.\n\nAI-enabled sentry hives will soon line the main route from South Australia, using cameras and 4G to detect the destructive pest.\n\nTraditional sentinel hives rely on manual inspections, while the new AI bee sentry hives use smart cameras and real-time data to detect threats.\n\nThe parasitic varroa mite was detected in New South Wales in 2022 and has since spread to Queensland, Victoria and South Australia.\n\nBee Industry Council of WA (BICWA) vice-chair Mikey Cernotta said the new technology was developed with a federal government grant and \"wasn't a silver bullet, but a start\".\n\nMikey Cernotta says the technology is a start. (ABC South West WA: Jon Daly)\n\n\"What we learned from the NSW incursion of varroa mite was that the traditional sentinel hives that we use — whilst they serve a purpose, they're too slow to react and they don't provide landscape scale surveillance,\" he said.\n\nMr Cernotta said BICWA worked with researchers who specialised in artificial intelligence to develop the feeding stations.\n\n\"The bees enter into the bee sentry unit to feed on the sugar syrup, and as they do that, they actually sit on a clear lens and we have cameras in there, which then photograph the bees from the underside because 90 per cent of varroa are actually on the underside of the bee,\" he said.\n\n\"Then if we get a detection, the AI or machine sends an immediate notification to a list of people and then we can positively or negatively identify and then determine whether we need to act.\"\n\nThe industry has worked with researchers to develop the feeding stations. (Supplied: Mikey Cernotta)\n\nVolunteers bolster biosecurity\n\nShire of Dundas CEO and amateur beekeeper Peter Fitchat oversees a local government area that spans 700 kilometres of the Eyre Highway.\n\nHis council is pushing to roll out the 20 hives on the highway, with the local postal service and shire workers checking them for sugar water.\n\nShire of Dundas CEO Peter Fitchat says the whole town benefits from the shire-owned store. (ABC Esperance: Hayden Smith)\n\n\"They'll notify me and I'll go and top it up while I do other work, in sort of volunteer capacity,\" Mr Fitchat said.\n\n\"So we're hoping that this would sort of safeguard the industry in WA, because we border SA, we are obviously the front side of it, so it's very important to get this right, straight up.\"\n\nThe Department of Primary Industries and Regional Development (DPIRD) supports the bee sentry units.\n\nDPIRD plant biosecurity research scientist Jessica Bikaun said BICWA and Dundas Shire were doing a fantastic job, which complemented the surveillance by DPIRD.\n\nAustralia has moved from eradication to a management plan. (Supplied: Alex Wild, UT Austin)\n\n'Accelerate improvements'\n\nBICWA is concerned about a lack of clarity on a response plan for varroa mite detection in WA.\n\nMr Cernotta said the council wanted the state government to support early detection, a centralised digital traceability system, and a greater departmental presence, including dedicated beekeeping compliance officers.\n\n\"These measures would not only increase WA's chances of early detection and eradication, they would significantly assist in making the transition to management of varroa far less costly,\" he said.\n\nWA Agriculture Minister Jackie Jarvis said the state government was working with affected states and with WA beekeepers to boost pest and disease awareness.\n\n\"DPIRD operates a statewide bee surveillance program with more than 40 sentinel hives placed from Derby to Esperance that are regularly tested for exotic bee pests,\" Ms Jarvis said.\n\nJackie Jarvis says the government has been liaising with affected states. (ABC Perth: Grace Burmas)\n\n\"To date in 2025, more than 400 beekeepers [have] checked hives and reported no varroa mite.\"\n\nShe said DPIRD was still working with BICWA on adopting a digital traceability system for bee hives.\n\n\"In addition to DPIRD's bee biosecurity officers, WA has five varroa development officers and one coordinator, as part of the national varroa transition to management program,\" Ms Jarvis said.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-09-09/australian-athletics-stars-inspired-and-highly-motivated/105749554",
        "title": "'Little things' driving Australia's golden generation of athletics stars",
        "publish_date": "Mon, 08 Sep 2025 22:28:23 +0000",
        "category": "sports",
        "authors": [],
        "text": "Armed with the largest team ever assembled for a major athletics meet, Australia enters the World Athletics Championships with a sense of excitement.\n\nMany Australian eyes will be focused on schoolboy sprinting sensation Gout Gout when he lines up for his heat in the men's 200 metres on Wednesday, September 17.\n\nThe 17-year-old is a major drawcard at this year's championships, but he is just one of a swathe of young Australians who are making waves in world athletics.\n\nWhat a baby-faced Bolt can teach us about Gout Photo shows Composite image of Gout Gout and Usain Bolt running. Gout Gout's star is rising even faster than his legs can carry him, and with a world championships debut on the horizon, managing expectations is going to be difficult.\n\nOf the 87-member squad picked by Australian Athletics for the championships in Tokyo, 21 of the athletes are aged 21 or younger.\n\nGout is joined by fellow young sprinters Torrie Lewis and Caleb Law, while Lachlan Kennedy — who ran a sub-10-second 100m in May — had to withdraw from the championships with a back injury.\n\nMiddle-distance runners Cameron Myers, Claudia Hollingsworth and Peyton Craig, long jumper Delta Amidzovski and race walker Elizabeth McMillen are also athletes 21 or younger who will wear the green and gold in Tokyo.\n\nThey may not all be household names yet but, if they follow their current trajectories, many can be.\n\nIt is the job of Australian Athletics head of high performance Andrew Faichney to get the best out of this group and give them the maximum opportunity to succeed internationally.\n\nOlyslagers wins another Diamond League Photo shows Nicola Olyslagers clenches her fists and smiles after winning the high jump in front of the Zurich Opera House. Nicola Olyslagers confirms her status as perhaps Australia's greatest gold medal chance at next month's athletics world championships.\n\n\"I think that we have got an extraordinary generation of athletes that are coming through,\" Faichney told ABC Sport.\n\n\"Their performances are really, really good at such a young age.\"\n\nVeteran running coach Nic Bideau has been around long enough to know that this is a generational group of young athletes.\n\n\"I've been involved in athletics at that top level since the 90s, through a long time, and I've never seen it so good,\" Bideau told ABC Sport.\n\nGout is ranked the 16th best men's 200m sprinter in the world, and Kennedy has the same rank in the men's 100m.\n\nMyers, 19, has already set a men's national record in the mile and has the junior indoor world records for the 1,500m and mile.\n\nAmidzovski, 19, won gold in the women's long jump and bronze in the 100m hurdles at last year's World Athletics Under 20 Championships in Lima. Men's 800m runner Craig, 20, won silver in Lima and made the semifinals at the Paris Olympics.\n\nDelta Amidzovski won gold for Australia in the women's long jump at the Under 20 World Championships in 2024. (AAP: Con Chronis)\n\nLast year's under-20 championships were Australia's best ever, with the team winning a total of 14 medals.\n\nFaichney told ABC Sport said preparation was the key to Australia's success in Lima, and it led to magnificent results.\n\n\"We put a real focus in preparing our athletes as the best that they could be and we went in probably the best prepared I would say of all of the countries,\" Faichney said.\n\n\"Individually, each of them are fantastic athletes, and I think what we're trying to do is set up a system and a program which is going to enable them and their coaches to do the best that they can.\"\n\nThese rising stars on the track join Australia's established performers, who won seven medals at the Olympic Games in Paris.\n\nNina Kennedy, who has withdrawn from the World Championships due to injury, won gold in the women's pole vault. Jessica Hull (women's 1,500m) and Nicola Olyslagers (women's high jump) won silver medals.\n\nJemima Montag (women's 20km race walk), Montag/Rhydian Cowley (relay race walk) Eleanor Patterson (women's high jump) and Matthew Denny (men's discuss) won bronze to complete the most successful track and field outing for Australia since the 1956 Olympic Games in Melbourne.\n\nThose athletes can all be expected to compete for medals at the Los Angeles Olympics in 2028 and some will still be around for Brisbane in 2032.\n\nFaichney said that experienced group would be complemented by the young stars, who by then would be in their prime.\n\n\"I think over the next seven or eight years, we're going to have fantastic success in the major championships through that whole group of our athletes,\" Faichney said.\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\nNic Bideau coached Cathy Freeman and Olympians Stewart McSweyn and Genevieve Gregson, and is currently coaching world championship selections Georgia Griffiths and Sarah Billings.\n\nHe said Australia's success was due to \"lots of little things\".\n\n\"It's never just one magical reason that's causing it,\" he said.\n\nBideau cited the changing demographics of Australia, increased professionalism, better coaching and high-performance support, and the chance to compete at the Brisbane Olympics as some of the reasons why we were seeing more young athletes competing on the world stage.\n\nThen there are the intangible ingredients like the belief that comes from seeing others succeed.\n\nCompetition and Brisbane 2032 spurring on Australia's rising stars\n\nTorrie Lewis is ranked 17th in the women's 200m and is a four-time national champion at just 20.\n\nShe is part of this current crop of late teens and early-20s athletes who are inspiring each other to greater ambitions, with the lure of a home Olympics.\n\n\"It's almost like we're pushing each other, like, 'If I can do it, you can do it too,' and giving each other confidence,\" Lewis said.\n\nTorrie Lewis says the success of her peers has inspired a belief within herself. (AAP: Richard Wainwright)\n\nLewis recalled then 18-year-old Calab Law making the semifinals of the men's 200m at the 2022 World Championships as a moment when fellow athletes inspired her to believe.\n\n\"I remember watching that like, 'Oh my God. That's crazy, like so good.' Then you think you can also do it as well,\" she said.\n\nThe younger athletes' success is pushing them, and their Australian teammates, to higher levels of competition and performance.\n\nIt has created an environment that breeds success, according to Bideau.\n\n\"It used to be that if you were a good athlete, it wasn't that difficult to make the Australian team,\" Bideau said.\n\n\"Now you can be a world-class athlete capable of winning Diamond League races, like Linden Hall is, and still be up again back against the wall to try and make the Australian team.\n\nAdd to your watchlist Photo shows Mystery Road Origin ABC iview with young detective Jay Swan in the bush. The critically acclaimed Mystery Road: Origin returns as Detective Jay Swan (Mark Coles Smith) and Mary (Tuuli Narkle) uncover dark secrets in a haunted timber town, where the past threatens to tear them apart.\n\n\"If you are on the Australian team, the expectation now is that you're good enough to make the final.\"\n\nWhile Australia's young crop have been motivated and inspired by their peers, the athletes are also taking responsibility for their performance.\n\nAccording to Faichney, the current generation are all highly driven and high achievers.\n\n\"It's such an individual sport, so you have to be so intrinsically motivated to be at the very top level,\" Faichney said.\n\n\"There's a number of athletes that we've had over the over the journey who, for varying reasons, probably had talent that could have taken them a little bit further, but other impacts in their life, whether that be injury, whether that be life circumstances, whether that be motivational factors, mean that they don't quite get there.\"\n\nThe Tokyo World Championships is just the first step in the journey that culminates in LA in 2028, but it may also be the moment that Australian athletics truly takes centre stage.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-09-09/anz-to-cut-jobs-3500-to-go-by-sept-2026/105751484",
        "title": "ANZ to cut 3,500 jobs in next year in broader restructure",
        "publish_date": "Mon, 08 Sep 2025 21:58:35 +0000",
        "category": "finance",
        "authors": [],
        "text": "Major bank ANZ has announced about 3,500 jobs will go by next September.\n\nIt comes as the company reveals a broader restructure, which includes reducing \"engagements with consultants and other third parties\".\n\nIn a statement on Tuesday morning, ANZ flagged a reduction in \"duplication and internal complexity\" as part of the changes, and said there would be limited impact on frontline, customer-facing roles.\n\n\"We know this will be difficult news for some of our staff,\" chief executive Nuno Matos said.\n\n\"While some of these changes have already commenced, we are committed to working through the impacts as quickly and safely as we can, with both care and respect for our teams affected.\"\n\nMr Matos said the reduction in consultant and third party contracts would affect about 1,000 managed services contractors.\n\nFinance Sector Union (FSU) president Wendy Streets said ANZ was \"betraying\" workers to \"chase even bigger profits\".\n\n\"This is out of control — it's not strategy, it's unhinged,\" Ms Streets said in a scathing statement.\n\n\"When the FSU asked ANZ who will actually do the work of the 3,500 sacked staff, the bank had no answer, except to say the work will simply stop.\n\n\"That's not a plan, that's chaos.\"\n\nFurther update on restructure due next month\n\nThe restructure has come amid an ongoing review of the bank's operations, after the new chief executive joined in May.\n\n\"We are operating in a rapidly evolving and highly competitive banking environment,\" Mr Matos said in a statement.\n\n\"As we continue our strategic review, we are eliminating duplication and complexity, stopping work that doesn’t support our priorities and sharpening our focus on improving our non-financial risk management practices across the bank.\"\n\nThe bank said it would provide a strategy update to investors on October 13.\n\nANZ CEO says automated redundancy email was 'indefensible' Photo shows The exterior of an ANZ Bank branch. Chief executive Nuno Matos says the bank is going to ensure the \"indefensible and deeply disappointing\" emails are not repeated.\n\nANZ will book restructuring charges of around $560 million, before tax, with the final details of the costs to be included in its financial results in early November.\n\nIn recent weeks, the ANZ boss issued an apology for automated redundancy emails sent to staff, which he described as \"indefensible and deeply disappointing\".\n\nSome retail banking staff facing job cuts received an email in August, telling them of their redundancies before they were officially informed.\n\nThe emails had been sent by mistake, an ANZ spokesperson said at the time, and redundancy meetings were made quickly.",
        "source": "ABC"
    },
    {
        "url": "https://www.smh.com.au/business/companies/arise-king-lachlan-a-new-era-for-the-murdoch-media-empire-has-begun-20250909-p5mtix.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Arise, King Lachlan! A new era for the Murdoch media empire has begun",
        "publish_date": "Tue, 09 Sep 2025 11:53:29 +1000",
        "category": "finance",
        "authors": [
            "Elizabeth Knight"
        ],
        "text": "For the 94-year-old Rupert Murdoch and his anointed 54-year-old son Lachlan, settling the media conglomerate’s multibillion-dollar succession plan was a desperate race against time.\n\nIn five years, or less, Rupert’s iron grip on his media empire’s future would be lost.\n\nThe media baron had declared his oldest male heir Lachlan as his successor, but his master plan was unravelling as three of his other children had different ideas. It was a gripping succession saga that has engrossed the world.\n\nIf Rupert had died with the original trust in place, James, Prudence and Elisabeth would likely have dethroned Lachlan. Credit: Marija Ercegovac\n\nAnd while a settlement has now been reached, it has come at both a financial and a personal cost to all.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/nrl/nrl-around-the-clubs-finals-week-one-20250907-p5mt32.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Taylan May knocks back Wests Tigers’ $1.5 million offer, wants shorter deal",
        "publish_date": "Tue, 09 Sep 2025 11:46:31 +1000",
        "category": "sports",
        "authors": [
            "Michael Chammas"
        ],
        "text": "Off-contract centre Taylan May has rejected a three-year, $1.5 million contract extension from the Wests Tigers, informing the club he wants a shorter-term deal on more money.\n\nThe Tigers last week tabled a three-year deal to keep May at the club after an impressive final seven weeks of the season, notching up four tries, three try assists and six line breaks in those outings.\n\nTaylan May has knocked back the Tigers’ first offer. Credit: Getty Images\n\nHowever, sources with knowledge of the situation, talking on the condition of anonymity, told this masthead that May has knocked back the club’s first offer.\n\nThe Wests Tigers are preparing to reduce the duration of the term but are in negotiations about his value.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/culture/tv-and-radio/abc-radio-boss-backs-struggling-melbourne-breakfast-duo-amid-ratings-woes-20250909-p5mtjq.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "ABC radio boss backs struggling Melbourne breakfast duo amid ratings woes",
        "publish_date": "Tue, 09 Sep 2025 11:43:07 +1000",
        "category": "finance",
        "authors": [
            "Chris Hook"
        ],
        "text": "The ABC has backed its struggling Melbourne breakfast presenters as the latest radio ratings revealed another steep decline.\n\nIn the fifth survey of the radio ratings year, 3AW* won the breakfast slot, with Ross Stevenson and Russel Howcroft maintaining their position at No.1 with a 19 per cent audience share, up 2.4 per cent on the previous ratings period, helping propel the talk station back to the No.1 spot overall.\n\nMelbourne ABC Breakfast hosts Sharnelle Vella and Bob Murphy have suffered another drop in the ratings.\n\nMeanwhile, Kyle and Jackie O have notched up another small improvement, climbing to 6.1 per cent of the audience share, up 0.5 per cent on the previous survey.\n\nHowever, ABC breakfast duo Sharnelle Vella and Bob Murphy suffered a drop of 1.3 per cent, taking their audience share to just 5.5 per cent – more than half a per cent behind Sydney duo Kyle and Jackie O, who landed with great fanfare in the Melbourne market on a rumoured $200 million, but have since fallen flat.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/goodfood/recipes/crispy-xo-pork-omelette-20250617-p5m82s.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Crispy XO pork omelette",
        "publish_date": "Tue, 09 Sep 2025 11:41:35 +1000",
        "category": "lifestyle",
        "authors": [
            "Jessica Brook"
        ],
        "text": "Heat 1 teaspoon of the peanut oil in a large wok over high heat. Add the pork belly and garlic, season with salt and pepper, and cook, tossing for 10 minutes, or until the pork starts to crisp. Add the XO and oyster sauces and cook for a further 5 minutes. Set aside.\n\nStep 3\n\nBrush a large non-stick frying pan with peanut oil and place over high heat. Add half the whisked egg mixture and swirl the pan to coat. Cook for 1-2 minutes, gently moving the egg with a spatula until just set. Top with half the cabbage, half the pork mince and shiso leaves, if using, then sprinkle with a little chilli. Remove from the pan and set aside. Repeat with the remaining egg mixture, cabbage, pork, shiso and chilli flakes. Cut each omelette in half to serve.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/lifestyle/new-book-looks-back-a-hit-show-516-years-on-20250909-p5mtlj.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "New book looks back a hit show 516 years on",
        "publish_date": "Tue, 09 Sep 2025 11:35:07 +1000",
        "category": "lifestyle",
        "authors": [],
        "text": "New book looks back a hit show 516 years on\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/afl/cult-ruckman-to-depart-dons-but-is-it-for-lions-or-crows-20250909-p5mtks.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Cult ruckman to depart Dons - but is it for Lions, or Crows?",
        "publish_date": "Tue, 09 Sep 2025 11:22:05 +1000",
        "category": "sports",
        "authors": [
            "Marc Mcgowan"
        ],
        "text": "Credit: Artists Essendon ruckman Sam Draper will play for a new team next year after telling the Bombers on Tuesday morning that he would exercise his free agency rights to join another club. Draper, who turns 27 this month, is choosing between Brisbane Lions and Adelaide, both of whom are preparing to play semi-finals this week. The Lions are considered favourites to secure his signature, and are in great need for a ruck upgrade on Darcy Fort and an ailing Oscar McInerney, whereas the Crows re-signed Reilly O’Brien but wanted to pair him with Draper. Sam Draper battles with Reilly O’Brien during his time on the ground. Credit: AFL Photos / Getty Images\n\nOriginally, the first pick in the rookie draft in 2016, Draper played 78 games for Essendon and developed a cult following for his physical playing style and mullet hairstyle. Loading The Bombers played him alongside Nick Bryan, and he demonstrated he could also have an impact as a forward before he suffered a season-ending Achilles injury. “I want to take a moment to thank everyone who has been part of my journey at Essendon,” Draper said. “Pulling on the red and black has been such a huge honour, and I’ll always be grateful for the opportunity to represent such a proud club … the last few years haven’t been easy with all the injuries I’ve sustained. This has taken a toll on me, both mentally and physically, and I’ve had to make a very hard decision for what’s best for me moving forward, and I feel it’s the right time for a fresh start.”",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/culture/tv-and-radio/smooth-fm-still-on-top-but-kiis-snatches-breakfast-crown-in-sydney-20250909-p5mtjn.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Smooth FM still on top, but KIIS snatches breakfast crown in Sydney",
        "publish_date": "Tue, 09 Sep 2025 11:17:56 +1000",
        "category": "finance",
        "authors": [
            "Thomas Mitchell"
        ],
        "text": "Smooth FM has retained its position as Sydney’s No.1 radio station in the fifth ratings survey of the year, despite 2GB closing the gap between the two stations.\n\nSmooth FM attracted 11.8 per cent of the available audience – down 0.5 percentage points from the previous survey – to remain Sydney’s most listened to radio station. 2GB also saw a dip, dropping 0.2 percentage points to 11.4, an improved result compared to survey four, which saw the broadcaster drop two whole points to 11.6 per cent. Nine is the owner of 2GB and this masthead.\n\nKyle Sandilands and Jackie O toppled Ben Fordham to snatch back the breakfast crown in Sydney.\n\nWhile just 0.4 percentage points divide Smooth (11.8) and 2GB (11.4), KIIS continues to nip at their heels.\n\nIn the previous survey, the station climbed 1.1 points to an audience share of 10.4 per cent. KIIS has improved on that result once more in survey five, nabbing an extra 0.7 percentage points for an available audience share of 11.1 per cent, putting it within touching distance of Smooth and 2GB.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/business/companies/rupert-murdoch-and-children-reach-deal-in-succession-fight-20250909-p5mth4.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Lachlan, Rupert Murdoch ‘pleased’ as succession war ends with $5b buyout",
        "publish_date": "Tue, 09 Sep 2025 11:06:51 +1000",
        "category": "finance",
        "authors": [
            "Calum Jaspan",
            "Colin Kruger"
        ],
        "text": "The Murdochs have reached a deal cementing Lachlan Murdoch as the successor to the family empire, bringing an end to the decades-long battle against his siblings to control the media dynasty’s assets including Fox News, the Wall Street Journal and The Australian.\n\nStatements from both News Corp and Fox Corp on Tuesday morning said a mutual resolution on the legal proceedings related to the Murdoch Family Trust has been reached, resulting in the termination of all litigation, and a severing of ties with three of Murdoch’s children.\n\nRupert Murdoch has ensured his media empire’s conservative editorial will continue after his death. Credit: Marija Ercegovac\n\nLachlan and Rupert Murdoch are “very pleased” with the deal, which was finalised in New York, said a source with direct knowledge of the negotiations, but not authorised to speak publicly. As a result, a new family trust will be created, benefiting Lachlan Murdoch and his half-sisters Grace and Chloe.\n\nLachlan will have total control over the trust’s voting power over Fox and News Corp’s affairs, while Chloe and Grace will retain a purely financial interest.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/why-gen-z-and-millennial-women-cant-get-enough-of-this-teen-drama-20250909-p5mtkp.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Why Gen Z and Millennial women can't get enough of this teen drama",
        "publish_date": "Tue, 09 Sep 2025 10:59:11 +1000",
        "category": "finance",
        "authors": [],
        "text": "Why Gen Z and Millennial women can't get enough of this teen drama\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later. Dismiss\n\nOur network\n\nOpen Navigation Menu The Sydney Morning Herald",
        "source": "SMH"
    },
    {
        "url": "https://www.sbs.com.au/news/article/australia-post-to-resume-shipping-to-the-us-after-suspending-services/ouef3zh1y",
        "title": "Australia Post announces new move after suspension amid US tariff rules battle",
        "publish_date": "Tue, 9 Sep 2025 01:09:09 +0000",
        "category": "finance",
        "authors": [],
        "text": "Australia Post says it plans to lift its partial suspension of parcel deliveries to the United States — a decision that was sparked by the Trump administration's tariffs.\n\n\n\n\n\nFollowing similar announcements from other international postal operators, Australia Post announced in late August that it would partially suspend postal services to the US and its overseas territories due to changes in US customs rules for parcels.\n\n\n\n\n\nThat change led to the end of an exemption that allowed parcels and goods valued below US$800 (approximately $1,200) to enter the country duty-free — a move that has affected Australian businesses selling to American customers and Australians sending expensive presents to loved ones across the ocean.\n\n\n\n\n\nAustralia Post said the suspension was unfortunate, although necessary, because it did not have a system in place to collect the duties.\n\n\n\nREAD MORE See the list: Australia spared tariff hike as Trump raises rates on others\n\nBut on Tuesday, Australia Post announced it had established an arrangement to resume postal services for its business customers on or before 25 September.\n\n\n\n\n\nAustralia Post executive general manager Gary Starr said: \"While we are planning to lift the temporary suspension on Thursday 25 September, if we are able to lift this earlier, we absolutely will.\"\n\n\n\n\n\nAustralia Post is still working on a way to allow non-business customers to send higher-value parcels to the US and has not confirmed when services will resume for these customers.\n\n\n\n\n\nCustomers can still send ordinary letters and documents, as well as gifts valued under US$100 ($153), which remain duty-free.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/liberal-mp-julian-leeser-apologises-for-jacinta-prices-comments-on-indian-migration/ia5mq09ud",
        "title": "Liberal MP Julian Leeser apologises for Jacinta Price's comments on Indian migration",
        "publish_date": "Mon, 8 Sep 2025 22:06:21 +0000",
        "category": "finance",
        "authors": [],
        "text": "Liberal MP Julian Leeser has \"unreservedly apologised\" to Indian Australians over comments made by Liberal senator Jacinta Nampijinpa Price, which have been described as \"frankly disgusting\" by a Labor MP.\n\n\n\n\n\nLeeser, who is the Opposition spokesperson for legal affairs, apologised for any \"offence\" caused by Price's remarks last week when she claimed the federal government had a \"focus\" on bringing in migrants \"from particular countries over others\", before she singled out the Indian community.\n\n\n\n\n\nSoon after the interview with the ABC, Price clarified her remarks, but her initial suggestion that Indian migration is unduly favoured fuelled division .\n\n\n\n\n\nLeeser acknowledged that Price had walked back her comments on migration, but said he felt he had to speak up while addressing a crowd at a Hindi school in NSW over the weekend.\n\n\n\n\n\n\"My colleague Jacinta Price said something this week that I want to apologise unreservedly for,\" he said.\n\n\n\n\"Let me say very clearly, the contribution of Indian Australians to this country is fantastic. The Indian community is fantastic. And you know what? India, like Australia, is a democracy,\" Leeser said.\n\n\n\n\n\n\"There are Indians that vote Labor, there are Indians that vote Liberal, there are Indians that vote Greens. I don't care how you vote. I care about the contribution you make to this country, and I know it is a fantastic contribution, and I want you to keep making it.\"\n\n\n\nPrice regretful, has not heard from Sussan Ley\n\nLeeser also spoke about Opposition leader Sussan Ley's position on Price's statement.\n\n\n\n\n\n\"As my leader Sussan Ley said, she was wrong to say it, and she has walked back those remarks and I am pleased that she has,\" he said.\n\n\n\n\n\nIn an interview with Sky News on Monday night, Price said she has regrets about her comments.\n\n\n\n\"The regret that I have is that I wasn't clearer in terms of my comments on the ABC … and since then have made a clarification,\" Price said.\n\n\n\n\n\nShe said she has not heard from Ley regarding her comments on Indian migration.\n\n\n\n\n\n\"I have not had a conversation with the leader [Sussan Ley] specifically about that issue,\" Price said.\n\n\n\n\n\n\"I guess I would expect that I would hear directly from the leader herself if it was of huge concern; it didn't appear to be of huge concern.\"\n\n\n\n\n\nLey told the ABC's Insiders program on Sunday that Price's comments \"won't be repeated\" .\n\n\n\n\n\n\"The comments were wrong, not correct. They should not have taken place,\" she said.\n\n\n\n\n\n\"They will not be repeated. What I said subsequently and what I say now is to express my deep appreciation to the Indian community for all they have brought to Australia, for all they continue to bring, for their representation in every forum of society.\"\n\n\n\nPrice should apologise, PM says\n\nPrime Minister Anthony Albanese has called for Price to apologise for her comments and \"the hurt that has been caused\".\n\n\n\nREAD MORE Jacinta Nampijinpa Price's comments on migration continue to cause headaches for the Coalition\n\n\"The comments are not true that the senator made, and of course, she should apologise for the hurt that has been caused, and her own colleagues are saying that. But even more importantly, leaders in the community are asking for that as well,\" Albanese told ABC Radio on Tuesday morning.\n\n\n\n\n\n\"It is important to make clear my position, which is that the Indian Australian community has made our nation stronger. They contribute to our economy, our communities.\n\n\n\n\n\n\"They're a vital part of modern Australia, and I just say to the Indian community, you're valued.\"\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/french-parliament-ousts-prime-minister-francois-bayrou-deepening-political-crisis-for-macron/hxxgqc5x3",
        "title": "French parliament ousts prime minister, deepening political crisis for Macron",
        "publish_date": "Mon, 8 Sep 2025 20:31:00 +0000",
        "category": "finance",
        "authors": [],
        "text": "Key Points French parliament ousted Prime Minister Francois Bayrou, rejecting his deficit plan.\n\nPresident Emmanuel Macron is resisting calls for snap elections.\n\nThe next government's most pressing task will be to pass a budget and solve France's mounting debt crisis.\n\nFrance's parliament has brought down the government over its plans to tame the ballooning national debt, deepening a political crisis that is weakening the euro zone's second-largest economy.\n\n\n\n\n\nPoliticians voted to oust Prime Minister Francois Bayrou and his minority government with 364 votes against the veteran centrist politician and 194 in his favour.\n\n\n\n\n\nPresident Emmanuel Macron, who is facing calls from the opposition to dissolve parliament and resign, will instead hunt for his fifth prime minister in less than two years. His office said he would appoint one in the next few days.\n\n\n\n\n\nThe next government's most pressing task will be to pass a budget, the same challenge Francois Bayrou faced when he took office nine months ago. Securing the backing of a very divided parliament will be equally hard.\n\n\n\n\n\n\"You have the power to bring down the government, but you do not have the power to erase reality,\" Bayrou told the parliament before losing the confidence vote.\n\n\n\n\"Reality will remain relentless: expenses will continue to rise, and the burden of debt, already unbearable, will grow heavier and more costly,\" he said.\n\n\n\n\n\nBayrou will tender his resignation on Tuesday local time, his office said.\n\n\n\n\n\nHe had called the confidence vote to try to win parliamentary support for his strategy to lower a deficit that stands at nearly double the European Union's three per cent ceiling, and to start tackling a debt pile equivalent to 114 per cent of GDP.\n\n\n\n\n\nBut opposition parties were in little mood to rally behind his planned savings of €44 billion ($78.5 billion) in next year's budget, with an election for Macron's successor looming in 2027.\n\n\n\n\n\n\"This moment marks the end of the agony of a phantom government,\" far-right leader Marine Le Pen said, pushing for a snap parliamentary election, which Macron has so far ruled out.\n\n\n\n\n\n\"Macron is now on the front line facing the people. He too must go,\" Jean-Luc Melenchon, leader of the hard-left France Unbowed, said on X.\n\n\n\nWho could be France's next prime minister?\n\nA lengthy period of political and fiscal uncertainty risks undermining Macron's influence in Europe at a time when the United States is talking tough on trade and security, and war is raging in Ukraine on Europe's eastern flank.\n\n\n\n\n\nThe French president could now nominate a politician from his own centrist minority ruling group or from the ranks of conservatives as the next premier, but that would mean doubling down on a strategy that has failed to yield a stable alliance.\n\n\n\n\n\nHe also could tack to the left and nominate a moderate socialist, or choose a technocrat.\n\n\n\nREAD MORE France to recognise Palestinian state in September, Emmanuel Macron says\n\nNo scenario would be likely to hand the next government a parliamentary majority. It was inevitable that the need to form a new government would result in a dilution of the deficit reduction plan, finance minister Eric Lombard said before the vote.\n\n\n\n\n\nMacron may eventually decide the only path out of the crisis lies in calling a snap election, but he has so far resisted calls from Le Pen's National Rally and from France Unbowed to dissolve parliament a second time.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/new-regional-hotspot-surge-city-folk-albury/c7cjpr0yj",
        "title": "The new regional hotspot that's seen a 1,500 per cent surge of city folk",
        "publish_date": "Mon, 8 Sep 2025 19:36:40 +0000",
        "category": "finance",
        "authors": [],
        "text": "When 55-year-old Jenelle Young left Melbourne's outer east to move near the city of Albury on the NSW border, she admits she was \"a little apprehensive\".\n\n\n\n\n\nShe and her husband had originally bought a house about 40 minutes outside of Albury in the vineyard town of Rutherglen, Victoria initially as a holiday base and future retirement spot. But after a two-week camping trip by the Murray River, they were hooked.\n\n\n\n\n\n\"We stayed out there for two weeks and it was just beautiful,\" she told SBS News. \"I find the Murray to be one of the most spectacular places I've ever been, especially when you get out there on a kayak.\"\n\n\n\n\n\nIn March this year, they packed up their lives in Melbourne and made the move permanent. Six months on, Jenelle can't imagine going back.\n\n\n\nREAD MORE I was priced out of my city into a regional town. It was the best thing that ever happened to me\n\n\"When I first left Melbourne, I thought I was going to miss a lot of things about the city. But now I don't feel the desire to rush back to the city at all,\" she said. \"It's much more of a relaxed lifestyle.\"\n\n\n\n\n\nShe spends her mornings kayaking before running her pickleball business in Albury and enjoys the strong sense of community she's discovered.\n\n\n\n\n\n\"All of a sudden, I've got this amazing amount of social connection that I didn't have in Melbourne,\" she said.\n\n\n\n\n\n\"I didn't realise I was missing that in the city.\"\n\n\n\n\n\nBut regional life comes with trade-offs. Local supermarkets close at 7pm, there’s no Uber Eats, and she’s now further away from her adult children in Melbourne.\n\n\n\n\n\n\"You have to be ready for the move,\" she said.\n\n\n\n\n\n\"There’s a difference between making the move because you really want to, and being pushed out. I knew what I was getting myself into.\"\n\n\n\nJenelle relocated from Melbourne to a quiet town outside Albury in March — and she hasn't looked back. Source: Supplied\n\nThe steady trickle to regional\n\nJenelle is part of a growing national trend, according to the latest Commonwealth Bank Regional Movers Index.\n\n\n\n\n\nIt found 26 per cent more people are relocating from capital cities to regional areas than vice versa. Overall, regional migration remains strong despite falling to its lowest level since before the COVID-19 pandemic.\n\n\n\nAlbury saw the biggest growth in capital-regional migration — a 16-fold increase. Source: SBS News On the NSW-Victoria border, Albury recorded a 16-fold increase — or 1520 per cent — in net migration from capital cities in the 2024-25 financial year, the biggest surge of any regional hub in the country.\n\n\n\n\n\nOther large growth areas were Gingin, WA (273.7 per cent); Townsville, Queensland (268.6 per cent); East Pilbara, WA (184.4 per cent); and Greater Bendigo, Victoria (136.6 per cent).\n\n\n\n\n\nBut the largest regional hotspot was Queensland's Sunshine Coast, recording 7.4 per cent of the share of net capital-regional migration.\n\n\n\n\n\nGreater Geelong, Victoria, slipped back to second place (7 per cent), while the Gold Coast, Queensland (5.9 per cent), Lake Macquarie, NSW (3.8 per cent) and Moorabool, Victoria (3.1 per cent), rounded out the top five most popular regional spots for capital city movers.\n\n\n\nThe largest regional hotspot was the Sunshine Coast, with Greater Geelong slipping back to second place. Source: SBS News \"Across Australia, this quarterly report shows an overall downturn in movement across the country of 15.2 per cent, which includes capital-to-capital relocation,\" Liz Ritchie, CEO of the Regional Australia Institute (RAI), said in a statement.\n\n\n\n\n\n\"However, regional Australia is no longer a second choice.\"\n\n\n\n\n\nThe index uses Commonwealth Bank data of 14.6 million customers to track internal migrations and help identify growth trends in regional centres.\n\n\n\nOverall, regional migration remains strong despite falling to its lowest level since before the COVID-19 pandemic. Source: SBS News\n\nWhat's driving the shift?\n\nAffordability remains one of the biggest drawcards of moving regionally.\n\n\n\n\n\n\"Affordability is a real challenge right now. Even though mortgage rates are starting to come down, they’re still high compared to what we’ve seen in the past, which is making it harder for many people to buy in the cities,\" a Domain spokesperson told SBS News.\n\n\n\n\n\n\"That’s why regional areas are becoming more appealing, where around 14 per cent of houses and 31.3 per cent of units in regional Australia are actually cheaper to buy than rent, which is a huge drawcard for buyers.\"\n\n\n\nREAD MORE Australia's new regional hotspot for city leavers as Sunshine Coast slips\n\nThey added that in the Albury region, prices have increased — but not as sharply as in other parts of the country.\n\n\n\n\n\n\"The median house price is now $612,000, up 9.3 per cent over the past year, showing strong demand, but it’s still relatively affordable.\"\n\n\n\n\n\nThe median cost of a house in combined capital cities is $1,207,857, compared to a combined regional cost of $670,953, according to Domain's June 2025 House Price Report.\n\n\n\n\n\nOn the ground in Albury, Ray White agent Andrew Papallo has seen the boom first-hand and says families relocating from Melbourne are leading the charge, followed by buyers from Canberra and Sydney.\n\n\n\nREAD MORE How much you could save by renting and buying regionally - and how to pull off a move\n\n\"A lot of them can come here mortgage-free, which is a big thing for a lot of people,\" he told SBS News. \"There’s less commuting, more time with family, and a slower pace. But 99 per cent of the time, it’s for cost.\"\n\n\n\n\n\nThat demand has driven local prices up by 9.3 per cent in the last year, with the median house price now sitting at $612,000.\n\n\n\n\n\n\"It's massive for the area,\" he said.\n\n\n\n\n\n\"Albury is handling the growth pretty well. There's a lot more land being released.\"\n\n\n\nCan regional areas absorb the growth?\n\nBut rapid growth brings challenges. While Papallo says Albury-Wodonga has so far absorbed the influx, the pressure is showing in parts of the housing market.\n\n\n\n\n\nRental vacancy rates have sat below 1 per cent for years, Papallo says. Additionally, an increase in investor interest — which he says began booming last October — has left first-home buyers increasingly outcompeted by investors.\n\n\n\n\n\nIn Geelong, it's a similar story, as it deals with a housing shortage, ageing infrastructure and congestion due to expansion.\n\n\n\nREAD MORE Verabella didn’t expect to be homeless for six months when she moved regionally\n\nResearch by the Australian Housing and Urban Research Institute (AHURI) found that increased migration to regional areas leads to a \"knock-on effect\" of higher prices in both rent and home purchases.\n\n\n\n\n\nProfessor Nicole Gurran from the University of Sydney, who led the research, said that the flow-on effects of this can mean low-income households are forced to move \"significant distances\" to find housing they can afford.\n\n\n\n\n\nThe report made several recommendations, including the investment in regional infrastructure to support people in non-metropolitan areas, support of low-income renters in regional areas, and better coordination between federal, state and local governments.\n\n\n\n\n\nDr Liz Allen, a demographer at the Australian National University, warns that regional growth is challenging for policymakers.\n\n\n\n\n\n\"That footprint is increasing at an alarming rate and in fact we're seeing the rates of increase and population growth occurring the fastest in regional areas ... which spells some really difficult times for policymakers.\"\n\n\n\n\n\n- With additional reporting by Gabrielle Katanasho and the Australian Associated Press.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/video/liberals-attempt-to-rebuild-relationship-with-multicultural-communities/izt7xjjij",
        "title": "Liberals attempt to rebuild relationship with multicultural communities",
        "publish_date": "Mon, 8 Sep 2025 09:38:44 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/weak-us-data-spurs-rate-cut-chance-and-the-supermarkets-court-case/hxkq8noia",
        "title": "Weak US data spurs rate cut chance, and the supermarkets court case",
        "publish_date": "Mon, 8 Sep 2025 07:36:17 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/fed-up-with-flight-delays-the-federal-government-is-looking-at-refunds-other-compensation/yh0nvmjdw",
        "title": "Fed up with flight delays? Passengers could soon get refunds under new scheme",
        "publish_date": "Mon, 8 Sep 2025 06:53:19 +0000",
        "category": "finance",
        "authors": [],
        "text": "Australian travellers whose flights have been delayed could receive rights in the form of refunds, access to food and accommodation under a proposed federal compensation scheme.\n\n\n\n\n\nThe Albanese government launched a public consultation period on a proposed new aviation consumer protection scheme on Monday, aiming to provide greater protection for those affected by unexpected flight delays or cancellations.\n\n\n\nWhat is the aviation consumer protection scheme?\n\nThe scheme, if launched, could look to enforce information requirements during bookings and check-ins, as well as communication methods, minimum levels of assistance when a flight is disrupted, and guidelines on how airlines and airports should manage complaints.\n\n\n\n\n\nThe scheme will clarify the expectations of airlines and outline the minimum level of assistance required.\n\n\n\nREAD MORE The simple reason airfares have been cheaper this year, and could stay low\n\nPush for airlines to refund passengers for delays\n\nTransport Minister Catherine King said the government believes passengers should be entitled to prompt rebookings, refunds and access to food and accommodation.\n\n\n\n\n\n\"It's been too hard often for people to try and get a rebooking or a refund. They're often offered flight credits when they don't want that,\" she said.\n\n\n\n\n\n\"What the airlines will be obliged to do is meet the minimum standards. So the Consumer Charter basically will say this is what you should expect as a passenger in terms of rebooking time, quick and prompt refunds, accommodation, transport if you need it or a meal voucher if that's what you need, and this is the sort of things and the timeliness with which you can expect it.\n\n\n\n\n\n\"What we're trying to do is, in the immediate circumstances where people are delayed, have lost their baggage, trying to really get that done quickly, rather than often people are trying to, days or sometimes weeks and months later, trying to get some form of redress, trying to get it quickly.\"\n\n\n\nGovernment seeks public feedback on scheme\n\nIf the government goes ahead with the scheme, it will be accompanied by an ombudsman scheme and a new regulator. The ombudsman will assist with customer complaints if they're unable to solve them directly with the airline.\n\n\n\nREAD MORE Could paying Australians for travel frustrations drive up airfares?\n\nThe government is seeking public feedback on its proposals for the design and implementation of the scheme over the next four weeks.\n\n\n\n\n\n\"We want to hear what your expectations are for air travel, so we can work with the industry to set clear and enforceable standards for every Australian travelling by plane,\" King said.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/i-thought-i-was-gone-calls-for-greater-awareness-of-prostate-cancer/fwgq65n2i",
        "title": "'I thought I was gone': Calls for greater awareness of prostate cancer",
        "publish_date": "Mon, 8 Sep 2025 06:35:09 +0000",
        "category": "lifestyle",
        "authors": [],
        "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nIt's a quiet moment at home for Geoff Blake and his wife Jill.\n\n\n\n\n\nIn 2022, Geoff was diagnosed with prostate cancer at 73 years old.\n\n\n\n\n\n\"I had blood in the urine. And that startled me so I went to the GP, and he did some tests and then sent me off to a urologist.\"\n\n\n\n\n\nThe cancer had become metastatic, spreading to five different bones.\n\n\n\n\n\n\"I thought I was gone. You know, once it's on the bone, you hear all these stories and you think.. oh.. how long will I last? But I never ask that question because in the back of my mind I always thought 'I can beat this'.\"\n\n\n\n\n\nFighting it would prove punishing.\n\n\n\n\n\nGeoff's PSA levels - a marker for the cancer - continued to increase, even after his prostate was removed.\n\n\n\n\n\n\"My first experience with the chemotherapy wasn't until early last year, and it was horrendous. I got every side effect you could possibly imagine, and I couldn't eat. I couldn't do... I lost 15 kilos, and you think you're going to die.\"\n\n\n\n\n\nWhen chemotherapy became ineffective, he found relief in clinical drug trials, which are now helping him manage life with stage four cancer.\n\n\n\n\n\nProstate cancer is now the country's most prevalent cancer with nearly 72 men diagnosed every day.\n\n\n\n\n\nWhile the five year survival rate is more than 95 per cent, nearly 4,000 men died from the disease last year.\n\n\n\n\n\nThe Prostate Cancer Foundation of Australia says only 36 per cent of cases are detected at a stage when it can be most effectively treated.\n\n\n\n\n\nThe group's national chairman, Adjunct Associate Professor Steve Callister says PCFA will soon release new guidelines recommending that a simple blood test is the preferred way to diagnose rather than a rectal examination.\n\n\n\n\n\n\"The importance of early diagnosis can't be understated. If you've got a family history, you should start to get tested after the age of 40, and if you're over 50, you should get tested regularly.\"\n\n\n\n\n\nWhile some may not experience symptoms, signs to look out for include frequent or weak urination, incontinence, pain in the back, hips or pelvis or blood in the urine or semen.\n\n\n\nBut catching it early can be tricky, with barriers to treatment and diagnostic accessibility, and out-of-pocket expenses.\n\n\n\n\n\nIf you live in an area outside a major city, your risk of dying from the disease increases by 24 per cent.\n\n\n\n\n\nAnd if you're from a multicultural background, research suggests you have poorer outcome,s from late diagnosis to treatment inequalities.\n\n\n\n\n\nProstate Cancer specialist nurses help families and patients navigate the complexities of treatment with sensitivity and dignity, often reducing the emotional burden on family members and patients.\n\n\n\n\n\nNurse Levina Saad from the Sydney Adventist Hospital says different organisations can still improve their resources for people from different cultural backgrounds... but there has been an improvement over the years.\n\n\n\n\n\n\"Being able to troubleshoot or think about what the best resources are for them in terms of obviously their language, but also their background and their needs.\"\n\n\n\n\n\nNow for the first time, researchers will follow the treatment journey of hundreds of men from different language and cultural groups with prostate cancer to find out what hurdles they face, including language barriers and cultural sensitivities.\n\n\n\n\n\nAssociate Professor Ben Tran from Melbourne's WEHI- a medical research group - says currently there are few resources for those men and their families.\n\n\n\n\n\n\"As treatment gets more and more complicated, our ability to explain things sufficiently to people from backgrounds different to ourselves becomes harder. And I think if we're aware of it, that's the first step.\"\n\n\n\n\n\nAssociate Professor Tran hopes his team's research will improve patient outcomes.\n\n\n\n\n\n\"I think it's really important that we dig deeper into this issue and try and find out what groups are impacted the most.\"\n\n\n\n\n\nThe Prostate Cancer Foundation of Australia is already taking steps to improve its online resources; its website can now be translated into 40 languages.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/k-pop-korea-australia-rose-blackpink-stray-kids/vexkcpgn1",
        "title": "K-pop is a global phenomenon. Some of its biggest stars are from Australia",
        "publish_date": "Mon, 8 Sep 2025 06:33:08 +0000",
        "category": "finance",
        "authors": [],
        "text": "Korean pop music, or K-pop, is now a certified cultural phenomenon that has captivated millions worldwide, including in Australia.\n\n\n\n\n\nBut beyond the soft power spectacle lies something closer to home: Australian K-pop stars.\n\n\n\n\n\nFrom BLACKPINK’s Rosé to Stray Kids' Bang Chan and Felix, Aussie K-pop 'idols' (the name given to K-pop stars) are bringing their hometown stories, slang and accents to one of the world's biggest music industries — and by extension, to the world.\n\n\n\nK-pop in Australia\n\nThe K-pop fanbase in Australia is comprised mainly of teens and young adults.\n\n\n\n\n\nFans are drawn in by the perfectly synchronised choreography, dazzling visuals and catchy earworms sung in both Korean and English.\n\n\n\n\n\nWhile far smaller than the fanbases in the United States or Asian countries, Australian K-pop fans are passionate and engaged.\n\n\n\nThis is evidenced by streaming numbers and sold-out arena tours.\n\n\n\n\n\nAs of writing, the song Golden from Netflix's KPop Demon Hunters (2025) was enjoying its fifth week at the top of the ARIA Top 50 Singles chart.\n\n\n\n\n\nAustralian K-pop fans are heavily online, and many are highly motivated to take part in event coordination, such as to celebrate idols' birthdays, as well as content creation, from dance covers to merchandise guides.\n\n\n\n\n\nOffline, K-pop's growing popularity has seen Australia host a number of world tours, with acts such as BLACKPINK, Twice, and Stray Kids performing sold-out concerts to fans in Sydney and Melbourne.\n\n\n\n\n\nIn 2023, Twice became the first Korean act to headline a stadium show in Australia, to an audience of 25,000 fans.\n\n\n\n\n\nThey will return later this year for a 360-degree stage arena tour.\n\n\n\nWhy Australian idols?\n\nWhile musical talent in the Western music industry is typically discovered 'organically', K-pop works differently.\n\n\n\n\n\nThe industry is run by South Korean entertainment companies, including the 'big four': HYBE, SM Entertainment, YG Entertainment and JYP Entertainment.\n\n\n\n\n\nThese companies cast their nets globally to sign prospective idols, often under the age of 15.\n\n\n\nMany will train for years, living in shared dorms under strict conditions.\n\n\n\n\n\nOnly a fraction of the people recruited end up debuting in a K-pop group.\n\n\n\n\n\nSinging and dance skills are, of course, a requirement.\n\n\n\n\n\nHowever, other factors such as English fluency, international marketability and multicultural backgrounds are now also extremely valuable for hopeful idols.\n\n\n\n\n\nThis reflects a broader trend in the K-pop industry, wherein the use of English has grown, both through song lyrics and the outsourcing of Western idols and artists for collaborations and features.\n\n\n\n\n\nThis was set in motion by the enormous success of BTS' 2020 hit Dynamite.\n\n\n\n\n\nThis song was the group’s first entirely English track, and the first K-pop song to hit #1 on the Billboard Hot 100.\n\n\n\nSince then, English has played a major role in driving K-pop's global visibility, accessibility and chart success.\n\n\n\n\n\nIn my research on the rising use of English in K-pop, I have found that while an Australian presence in the industry is still relatively rare, it is growing fast – likely due to a demand for English proficiency.\n\n\n\n\n\nAs of 2025, just 25 idols with Australian ties have debuted in the industry — a figure that pales in comparison to the more than 140 from both Japan and the United States.\n\n\n\n\n\nHowever, 15 of these 25 idols debuted in the last five years and, most importantly, many are members of some of the biggest K-pop acts, including BLACKPINK'S Rosé, Stray Kids' Bang Chan and Felix, NewJeans' Hanni and Danielle, NMIXX's Lily and ENHYPEN's Jake.\n\n\n\nStray Kids members Bang Chan (left) and Felix (third from left) both grew up in Sydney before joining the K-pop group. Source: Getty / Sergione Infuso / Corbis Rosé, most famously known for her single Apt. featuring Bruno Mars, grew up in Melbourne — while Bang Chan and Felix were raised in Sydney.\n\n\n\n\n\nThese idols now serve as unofficial Australian ambassadors both onstage and online, with their Australian roots forming an integral part of their idol identity.\n\n\n\nThe 'Aussie line'\n\nThis visibility has led K-pop fans to celebrate this distinct cohort, nicknamed the 'Aussie line'.\n\n\n\n\n\nMany fans delight in their Australian accents, use of local slang and stories about growing up in Australia.\n\n\n\n\n\nSome idols even embrace the 'Aussie line' label themselves.\n\n\n\nIn an industry where North American idols are normalised, their distinct 'Aussie-ness' provides a novelty enjoyed not just by local fans, but internationally.\n\n\n\n\n\nAt the same time, their presence in K-pop highlights the limitations of Australia's own music industry, which remains a site of insecurity and instability for local musicians.\n\n\n\n\n\nThis is reflected in the ongoing underrepresentation of Australian acts in the ARIA charts .\n\n\n\n\n\nBeyond this, Asian-Australian musicians (and Asian-Australians in general) have long had to contend with various forms of racism, prejudice and social exclusion.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/woolworths-and-coles-say-underpayment-court-decision-could-cost-them-1-billion/yvdzqzkcr",
        "title": "Woolworths and Coles say underpayment court decision could cost them $1 billion",
        "publish_date": "Mon, 8 Sep 2025 04:51:25 +0000",
        "category": "finance",
        "authors": [],
        "text": "Australia's two biggest supermarket chains may have to fork out more than $1 billion in repayments and other costs between them after a court ruled they underpaid thousands of salaried managers for years.\n\n\n\n\n\nThe Federal Court ruling would also require \"significant and widespread changes\" to accepted retail practice for both Woolworths Group and Australian businesses, large and small, the company said on Monday.\n\n\n\n\n\nOn Friday, Justice Nye Perram ruled Woolworths and Coles did not comply with their obligation to keep accurate employment records and paid workers their salaries without tracking other entitlements owed under the retail award.\n\n\n\n\n\nWoolworths estimates that, based on the judgment, it will have to pay another $250 million to $470 million to salaried store leaders, with interest, superannuation and payroll taxes adding another $200 million to $280 million to its net liability.\n\n\n\n\n\nThat's a total pre-tax liability of as much as $750 million for Woolworths, or $530 million after taxes.\n\n\n\n\"This is a very preliminary estimate with significant uncertainty, and is based on a historical analysis of clocked time and attendance records,\" Woolworths said on Monday.\n\n\n\n\n\nColes estimates it will have to pay between $150 million and $250 million to address the court's findings, on top of the $31 million in remediation it has already paid.\n\n\n\n\n\nColes reiterated its apology on Monday.\n\n\n\nWhat was the underpayment case about?\n\nThe Fair Work Ombudsman brought the class action case against Woolworths on behalf of 32 managers at five locations across Sydney, Melbourne and Brisbane from June 2015 to September 2019.\n\n\n\n\n\nThe case against Coles involved 42 managers, some of whom were employed in multiple shops, from 2017 to 2020.\n\n\n\n\n\nPerram will conduct a case management hearing on 27 October to determine the next steps and compensation for the affected 27,700 employees.\n\n\n\n\n\nWoolworths said it was too early to consider an appeal of any aspects of the complex decision, which spans 82,000 words.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.theage.com.au/business/companies/arise-king-lachlan-a-new-era-for-the-murdoch-media-empire-has-begun-20250909-p5mtix.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Arise, King Lachlan! A new era for the Murdoch media empire has begun",
        "publish_date": "Tue, 09 Sep 2025 11:53:29 +1000",
        "category": "finance",
        "authors": [
            "Elizabeth Knight"
        ],
        "text": "For the 94-year-old Rupert Murdoch and his anointed 54-year-old son Lachlan, settling the media conglomerate’s multibillion-dollar succession plan was a desperate race against time.\n\nIn five years, or less, Rupert’s iron grip on his media empire’s future would be lost.\n\nThe media baron had declared his oldest male heir Lachlan as his successor, but his master plan was unravelling as three of his other children had different ideas. It was a gripping succession saga that has engrossed the world.\n\nIf Rupert had died with the original trust in place, James, Prudence and Elisabeth would likely have dethroned Lachlan. Credit: Marija Ercegovac\n\nAnd while a settlement has now been reached, it has come at both a financial and a personal cost to all.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/nrl/nrl-around-the-clubs-finals-week-one-20250907-p5mt32.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Taylan May knocks back Wests Tigers’ $1.5 million offer, wants shorter deal",
        "publish_date": "Tue, 09 Sep 2025 11:46:31 +1000",
        "category": "sports",
        "authors": [
            "Michael Chammas"
        ],
        "text": "Off-contract centre Taylan May has rejected a three-year, $1.5 million contract extension from the Wests Tigers, informing the club he wants a shorter-term deal on more money.\n\nThe Tigers last week tabled a three-year deal to keep May at the club after an impressive final seven weeks of the season, notching up four tries, three try assists and six line breaks in those outings.\n\nTaylan May has knocked back the Tigers’ first offer. Credit: Getty Images\n\nHowever, sources with knowledge of the situation, talking on the condition of anonymity, told this masthead that May has knocked back the club’s first offer.\n\nThe Wests Tigers are preparing to reduce the duration of the term but are in negotiations about his value.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/culture/tv-and-radio/abc-radio-boss-backs-struggling-melbourne-breakfast-duo-amid-ratings-woes-20250909-p5mtjq.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "ABC radio boss backs struggling Melbourne breakfast duo amid ratings woes",
        "publish_date": "Tue, 09 Sep 2025 11:43:07 +1000",
        "category": "finance",
        "authors": [
            "Chris Hook"
        ],
        "text": "The ABC has backed its struggling Melbourne breakfast presenters as the latest radio ratings revealed another steep decline.\n\nIn the fifth survey of the radio ratings year, 3AW* won the breakfast slot, with Ross Stevenson and Russel Howcroft maintaining their position at No.1 with a 19 per cent audience share, up 2.4 per cent on the previous ratings period, helping propel the talk station back to the No.1 spot overall.\n\nMelbourne ABC Breakfast hosts Sharnelle Vella and Bob Murphy have suffered another drop in the ratings.\n\nMeanwhile, Kyle and Jackie O have notched up another small improvement, climbing to 6.1 per cent of the audience share, up 0.5 per cent on the previous survey.\n\nHowever, ABC breakfast duo Sharnelle Vella and Bob Murphy suffered a drop of 1.3 per cent, taking their audience share to just 5.5 per cent – more than half a per cent behind Sydney duo Kyle and Jackie O, who landed with great fanfare in the Melbourne market on a rumoured $200 million, but have since fallen flat.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/goodfood/recipes/crispy-xo-pork-omelette-20250617-p5m82s.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Crispy XO pork omelette",
        "publish_date": "Tue, 09 Sep 2025 11:41:35 +1000",
        "category": "lifestyle",
        "authors": [
            "Jessica Brook"
        ],
        "text": "Heat 1 teaspoon of the peanut oil in a large wok over high heat. Add the pork belly and garlic, season with salt and pepper, and cook, tossing for 10 minutes, or until the pork starts to crisp. Add the XO and oyster sauces and cook for a further 5 minutes. Set aside.\n\nStep 3\n\nBrush a large non-stick frying pan with peanut oil and place over high heat. Add half the whisked egg mixture and swirl the pan to coat. Cook for 1-2 minutes, gently moving the egg with a spatula until just set. Top with half the cabbage, half the pork mince and shiso leaves, if using, then sprinkle with a little chilli. Remove from the pan and set aside. Repeat with the remaining egg mixture, cabbage, pork, shiso and chilli flakes. Cut each omelette in half to serve.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/lifestyle/new-book-looks-back-a-hit-show-516-years-on-20250909-p5mtlj.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "New book looks back a hit show 516 years on",
        "publish_date": "Tue, 09 Sep 2025 11:35:07 +1000",
        "category": "lifestyle",
        "authors": [],
        "text": "New book looks back a hit show 516 years on\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/afl/cult-ruckman-to-depart-dons-but-is-it-for-lions-or-crows-20250909-p5mtks.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Cult ruckman to depart Dons - but is it for Lions, or Crows?",
        "publish_date": "Tue, 09 Sep 2025 11:22:05 +1000",
        "category": "sports",
        "authors": [
            "Marc Mcgowan"
        ],
        "text": "Credit: Artists Essendon ruckman Sam Draper will play for a new team next year after telling the Bombers on Tuesday morning that he would exercise his free agency rights to join another club. Draper, who turns 27 this month, is choosing between Brisbane Lions and Adelaide, both of whom are preparing to play semi-finals this week. The Lions are considered favourites to secure his signature, and are in great need for a ruck upgrade on Darcy Fort and an ailing Oscar McInerney, whereas the Crows re-signed Reilly O’Brien but wanted to pair him with Draper. Sam Draper battles with Reilly O’Brien during his time on the ground. Credit: AFL Photos / Getty Images\n\nOriginally, the first pick in the rookie draft in 2016, Draper played 78 games for Essendon and developed a cult following for his physical playing style and mullet hairstyle. Loading The Bombers played him alongside Nick Bryan, and he demonstrated he could also have an impact as a forward before he suffered a season-ending Achilles injury. “I want to take a moment to thank everyone who has been part of my journey at Essendon,” Draper said. “Pulling on the red and black has been such a huge honour, and I’ll always be grateful for the opportunity to represent such a proud club … the last few years haven’t been easy with all the injuries I’ve sustained. This has taken a toll on me, both mentally and physically, and I’ve had to make a very hard decision for what’s best for me moving forward, and I feel it’s the right time for a fresh start.”",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/culture/tv-and-radio/smooth-fm-still-on-top-but-kiis-snatches-breakfast-crown-in-sydney-20250909-p5mtjn.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Smooth FM still on top, but KIIS snatches breakfast crown in Sydney",
        "publish_date": "Tue, 09 Sep 2025 11:17:56 +1000",
        "category": "finance",
        "authors": [
            "Thomas Mitchell"
        ],
        "text": "Smooth FM has retained its position as Sydney’s No.1 radio station in the fifth ratings survey of the year, despite 2GB closing the gap between the two stations.\n\nSmooth FM attracted 11.8 per cent of the available audience – down 0.5 percentage points from the previous survey – to remain Sydney’s most listened to radio station. 2GB also saw a dip, dropping 0.2 percentage points to 11.4, an improved result compared to survey four, which saw the broadcaster drop two whole points to 11.6 per cent. Nine is the owner of 2GB and this masthead.\n\nKyle Sandilands and Jackie O toppled Ben Fordham to snatch back the breakfast crown in Sydney.\n\nWhile just 0.4 percentage points divide Smooth (11.8) and 2GB (11.4), KIIS continues to nip at their heels.\n\nIn the previous survey, the station climbed 1.1 points to an audience share of 10.4 per cent. KIIS has improved on that result once more in survey five, nabbing an extra 0.7 percentage points for an available audience share of 11.1 per cent, putting it within touching distance of Smooth and 2GB.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/business/companies/rupert-murdoch-and-children-reach-deal-in-succession-fight-20250909-p5mth4.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Lachlan, Rupert Murdoch ‘pleased’ as succession war ends with $5b buyout",
        "publish_date": "Tue, 09 Sep 2025 11:06:51 +1000",
        "category": "finance",
        "authors": [
            "Calum Jaspan",
            "Colin Kruger"
        ],
        "text": "The Murdochs have reached a deal cementing Lachlan Murdoch as the successor to the family empire, bringing an end to the decades-long battle against his siblings to control the media dynasty’s assets including Fox News, the Wall Street Journal and The Australian.\n\nStatements from both News Corp and Fox Corp on Tuesday morning said a mutual resolution on the legal proceedings related to the Murdoch Family Trust has been reached, resulting in the termination of all litigation, and a severing of ties with three of Murdoch’s children.\n\nRupert Murdoch has ensured his media empire’s conservative editorial will continue after his death. Credit: Marija Ercegovac\n\nLachlan and Rupert Murdoch are “very pleased” with the deal, which was finalised in New York, said a source with direct knowledge of the negotiations, but not authorised to speak publicly. As a result, a new family trust will be created, benefiting Lachlan Murdoch and his half-sisters Grace and Chloe.\n\nLachlan will have total control over the trust’s voting power over Fox and News Corp’s affairs, while Chloe and Grace will retain a purely financial interest.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/why-gen-z-and-millennial-women-cant-get-enough-of-this-teen-drama-20250909-p5mtkp.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Why Gen Z and Millennial women can't get enough of this teen drama",
        "publish_date": "Tue, 09 Sep 2025 10:59:11 +1000",
        "category": "finance",
        "authors": [],
        "text": "Why Gen Z and Millennial women can't get enough of this teen drama\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later. Dismiss\n\nOur network\n\nOpen Navigation Menu The Age",
        "source": "TheAge"
    }
]