[
  {
    "url": "https://www.9news.com.au/national/best-councils-in-australia-ranked-survey/6178e070-53e8-4889-92fc-85007998ba3e",
    "title": "Ratepayers have named the best local councils in Australia",
    "publish_date": "Sat, 16 Aug 2025 23:51:01 +0000",
    "category": "finance",
    "authors": [
      "Aug"
    ],
    "text": "L﻿ocal councils around the country have been given a score out of 100 by ratepayers – and one regional city emerged as the top performer in Australia.\n\nSmart city tech platform Snap Send Solve analysed data from incident reports to gauge the satisfaction levels from residents across issues like roads, parking, waste and graffiti.\n\nThe City of Mandurah in Western Australia was named the best in the country, with a rating of 67.4 per cent.\n\nCity of Mandurah in WA was ranked the best council in Australia. (City of Mandurah Council)\n\nFollowing closely behind was the City of Port Adelaide Enfield in South Australia at 67 per cent.\n\nWhitehorse in the eastern suburbs of Melbourne was rated third in the country at 66.8 per cent.\n\nSeveral NSW councils ranked the lowest in the country with a rating of about 60 per cent.﻿\n\nThe national average council rating was 61 per cent.﻿\n\nMelbourne City Council was the only metropolitan city council to make it into the top 20 list.﻿\n\nSnap Send Solve's community satisfaction report combined 13,700 survey responses and ratings from about 70,000 app users.\n\nSnap Send Solve helps report issues to the local council. (Instagram/@snapsendsolve)\n\nREAD MORE: Tremors may be felt for days after Queensland earthquake\n\nThe app allows ratepayers and residents to take a photo of an issue and report it to the council in real-time.\n\nIt helps councils fix issues like potholes, overhanging trees, cracked sidewalks or overflowing public rubbish bins.\n\n﻿The app also promises to help with duplicate reports.\n\nGlen Eira City Council in Victoria claimed it saved $88,000 in potential duplicate reports, avoiding costly labour, operational and contractor fees.",
    "source": "9News",
    "cluster_id": 0
  },
  {
    "url": "https://www.9news.com.au/finance/australia-wasted-money-unused-subscriptions-westpac-research/103fff10-142c-40ee-81db-c4f9cd692eb0",
    "title": "Embarrassing reason Aussies are wasting hundreds of dollars every year",
    "publish_date": "Sat, 16 Aug 2025 20:15:49 +0000",
    "category": "finance",
    "authors": [
      "Aug"
    ],
    "text": "As Australians continue to battle the cost-of-living pressures caused by years of high inflation and interest rates, plenty are wasting hundreds of dollars a year on subscription services they never use, with many even having forgotten about signing up in the first place.\n\nResearch released by Westpac this week revealed three in every 10 Aussies lose $600 a year on duplicate apps and services they don't use.\n\nIt also found the average consumer spends an extra 20 per cent on subscriptions than what they realise – the equivalent of about $14 a month or $168 a year.\n\nREAD MORE: Netflix quietly hikes up prices for Australian users ﻿\n\nThree in every 10 Australians waste $600 a year on apps they don't use. (Nine / Janie Barrett)\n\n\"Convenience is clearly appealing to Australians and they're willing to pay for it. But our research has found these services might be running away from them a little bit,\" Westpac acting chief executive, consumer, Carolyn McCann said.\n\n\"When we compared total estimated spend against customer transaction data, we could see customers are spending about $14 more each month than they think they are on subscriptions.\n\n\"While subscription costs might not seem like much in isolation, they can quickly add up – especially if these are apps or services you no longer use.\n\n\"This is hundreds or even thousands in potential savings that could be redirected elsewhere.\"\n\nWestpac also found its customers are spending more than $2200 a year on takeaway food. (Dominic Lorrimer)\n\nThe research found that failing to cancel a service during a trial was the main reason people were spending more than they thought, while just under a third of consumers said they'd paid for a subscription they'd forgotten about.\n\nA similar proportion (31 per cent) said they found it too difficult to cancel certain services.\n\n﻿Westpac also found Australians are spending $141 extra a year on subscriptions, an increase of 11.3 per cent from 2024.\n\nThat comes as a number of popular streaming providers, including Spotify and Netflix , have increased their prices in consecutive years.﻿\n\nGaming services are the biggest money sinks for Australians, costing the average consumer $55.50 a month ($666 a year), followed by video streamers ($21.63 per month/$260 a year) and music ($16.98 a month/$204 a year).\n\nAt the same time, ﻿Westpac also found its customers are spending a whopping $2200 a year on takeaway food.\n\n\"Our data suggests customers are willing to spend on what makes life easier, with a significant uplift in spend on food services,\" McCann said.\n\n\"But there's also growing awareness around value.\n\n\"While spend on home and utility subscriptions recorded the second-highest spend growth, customers also said these services delivered the least value.\"",
    "source": "9News",
    "cluster_id": 1
  },
  {
    "url": "https://www.9news.com.au/national/bedfordale-murder-charges-laid-over-perth-grandfathers-mystery-carpark-death/66f7efbb-fb9c-4687-9a6f-13b6c72c35db",
    "title": "Murder charges laid over grandfather's mystery carpark death",
    "publish_date": "Sat, 16 Aug 2025 12:12:35 +0000",
    "category": "sports",
    "authors": [
      "Aug"
    ],
    "text": ": Stay across all the latest in breaking news, sport, politics and the weather via our news app and get notifications sent straight to your smartphone. Available on the",
    "source": "9News",
    "cluster_id": 2
  },
  {
    "url": "https://www.9news.com.au/national/articifial-intelligence-future-role-of-ai-in-australian-businesses-to-be-discussed-new-government-report/eb0b0c09-0e35-4752-99be-f20c400432b0",
    "title": "Future role of AI to be discussed as new report finds it could help workers",
    "publish_date": "Sat, 16 Aug 2025 09:38:03 +0000",
    "category": "finance",
    "authors": [
      "Aug"
    ],
    "text": "The Treasurer's highly anticipated economic roundtable is shaping to be a showdown over the future of AI.\n\nBusinesses want to limit regulations while unions want workers to determine the rollout and a new government report is fuelling the tension.\n\n\"It would diminish the benefits for business and for workers and it would hold back the Australian economy,\" Andrew McKellar from the Australian Chamber of Commerce said.\n\nThe Treasurer's highly anticipated economic roundtable is shaping to be a showdown over the future of AI. (9News)\n\nAt the treasurer's economic summit in Canberra next week it could be the virtual elephant in the room.\n\nA new report has found AI is more likely to help workers turbocharge their output, rather than replace them but concedes entry-level roles could be more heavily impacted.\n\nIt recommends a government-led centralised rollout that collaborates with workers.\n\n\"They know how AI can be used at work most effectively, and importantly, where it's going to add to the productivity of their work, not where it's going to take away jobs,\" Liam O'Brien from the Australian Council of Trade Unions said.\n\nBut not everyone agrees with the sentiment.﻿\n\n\"It would give them a right of veto and we think that would be putting too much power into the hands of unions,\" McKellar said.\n\nBut business groups and unions do agree on other suggestions including a push to upskill workers with an AI crash course and to embed training into university and TAFE qualifications.\n\n﻿It puts unions and employers on a collision course ahead of next week's round table, which will discuss the role of AI in helping to slash red tape to improve productivity and lift lagging living standards.\n\n\"You do not improve living standards, by raising the cost of doing business,\" Shadow Treasurer Ted O'Brien said.",
    "source": "9News",
    "cluster_id": 3
  },
  {
    "url": "https://www.9news.com.au/national/health-star-rating-experts-say-system-has-failed-and-must-be-made-mandatory/83b69302-0008-4867-9151-37fb49a3c68b",
    "title": "Experts say the Health Star Rating system has failed. This is why",
    "publish_date": "Fri, 15 Aug 2025 21:18:25 +0000",
    "category": "finance",
    "authors": [
      "Aug"
    ],
    "text": "More than 10 years after Health Star Ratings were first introduced, experts say the voluntary system has failed because manufacturers have not been obligated to use it.\n\n﻿The system, which was launched in 2014, rates the overall nutritional profile of a packaged food product from 0.5 to 5 stars.﻿\n\nCurrently just over a third of products (36 per cent) feature a Health Star Rating and, unsurprisingly, it's the 5-star products that are far more likely to feature the rating (61 per cent) compared to only 16 per cent of 0.5-star products.﻿﻿\n\nThe Health Star Rating is designed to help consumers make healthier choices by comparing similar products. (Getty)\n\n\"Voluntary uptake has failed,\" Dr Alexandra Jones, the head of Food Governance at The George Institute for Global Health said.\n\nShe said because the system was voluntary, it was applied \"selectively... often for marketing purposes﻿\".\n\n\"Fundamentally people understand the concept of stars and they can use it to make a better choice,\" she said.\n\n\"In the real world their ability to actually use it has been mostly limited ﻿by the fact that it's only on a third of products.\"\n\n﻿In 2019, a review of the system found consumers understood the system﻿ but it was not on enough labels to adequately compare similar products.\n\nThe Australian, New Zealand and state and territory governments then set the industry a series of targets in an effort to lift the uptake.\n\nThe final target, 70 per cent by November 2025, almost certainly will not be met.﻿\n\n\"Until it's mandatory, people will continue to struggle out there ﻿to understand how to make good choices,\" Dietitians Australia CEO Magriet Raxworthy said.\n\n\"Australians want easy, transparent nutrition information about the food they are choosing for themselves and their families, and mandating the system will bring more consistency and clarity across the shelves.\"\n\nJones said Food Standards Australia New Zealand (FSANZ) had been ordered to start the preparatory work for a mandatory system but she feared the timeline could blow out as far as 2029.\n\nExperts say the logo is applied selectively as a marketing tool, rather than health advice for consumers. (iStock)\n\n\"Now that we've had 10 years of voluntary operation we know a lot about how this system works and where it needs to be improved,\" she said.\n\n\"We don't want this to go on any longer than it has to.\"\n\nShe said mandatory country of origin labelling, which has seen an uptake of more than 90 per cent in a similar time frame, proved it was possible to implement a mandatory Health Star Rating system quickly.\n\n\"Rapid food labelling change is definitely possible when it is mandated,\" she said.\n\nA spokesperson from FSANZ confirmed preparatory work to inform future decision-making by food ministers on whether the Health Star Rating system should be mandated was underway.\n\n\"If the voluntary uptake target (70 per cent of intended products displaying the HSR by 14 November 2025) is not met, FSANZ's preparatory work will enable an efficient process for incorporating the HSR system into the Australia New Zealand Food Standards Code, should ministers ask FSANZ to consider mandating the system,\" the spokesperson said.\n\nHow does the health star rating system work?\n\nManufacturers input the nutritional information of their product on a government website, which uses an algorithm to calculate the Health Star Rating of the product.\n\n﻿The algorithm gives points for protein, fibre, fruits, vegetables, nuts and legumes and removes points for saturated fat, sugar and salt.\n\nProducts are given a rating between 0.5 and 5 stars.\n\nThe manufacturer can then choose whether to display the rating on their product or not.\n\nConsumers ideally then use the rating to compare similar products and ultimately make healthier choices.\n\nThe rating aligns with the Australian Dietary Guidelines﻿ and New Zealand Eating and Activity Guidelines.",
    "source": "9News",
    "cluster_id": 4
  },
  {
    "url": "https://www.abc.net.au/news/2025-08-17/quilter-yvonne-line-work-cut-short-by-alzheimers-disease/105641682",
    "title": "Man honours sister's quilting lifework cut short by Alzheimer's disease",
    "publish_date": "Sun, 17 Aug 2025 01:40:55 +0000",
    "category": "finance",
    "authors": [],
    "text": "Internationally renowned Victorian quilter Yvonne Line is known for her cutting-edge and sometimes rule-bending works.\n\nHer brother John Lamb said his sister never developed one distinctive style in her 60 years of quilting. Instead she would constantly try new things.\n\nNow, as Alzheimer's disease cuts short her passion, Line's sibling is honouring her work in an exhibition, Threads of Life.\n\nYvonne Line has stopped quilting after 60 years because of Alzheimer's disease. (Supplied: John Lamb)\n\nMr Lamb said his sister started to show symptoms of Alzheimer's disease about four years ago.\n\n\"She lost some of her memory, but her skill set was fine because it was in her long-term memory,\" he said.\n\nBut two years ago, when her anxiety began to grow and she started to lose other everyday skills, Line stopped quilting for good.\n\nShe now lives in an aged care facility in Albury.\n\nYvonne Line's quilts aren't a typical sewing project. (ABC Goulburn Murray: Sarah Krieg)\n\nMr Lamb had spent years cataloguing some of his sister's work and produced a retrospective book as a more precise record.\n\nNow, he has put together an exhibition of Line's works for the public to enjoy.\n\n\"It's one thing to see in a book, but to see it in real life, it's just very emotional,\" he said.\n\n\"Just a few days ago, I found work that I hadn't come across, so some of that is in the exhibition as well.\"\n\nJohn Lamb has organised Threads of Life, an exhibition of his sister's work. (ABC Goulburn Murray: Sarah Krieg)\n\nMr Lamb said that not everyone understood Line's dedication to the textile arts.\n\n\"[To them] she just does a bit of sewing,\" he said.\n\nYvonne Line found a piece of material each day for a year for one of her quilts. (ABC Goulburn Murray: Sarah Krieg)\n\nA lifetime of work\n\nThe exhibition is named after the central piece of the collection.\n\nLine created panels the sizes of tea towels, arranged by theme and colour scheme.\n\n\"Every day for a year, she picked out a bit of material … religiously,\" Mr Lamb said.\n\nThe exhibition showcases a fraction of Yvonne Line's works. (ABC Goulburn Murray: Sarah Krieg)\n\nThe series, completed by Line in 2019, is hanging in the Gateway Gallery in Wodonga alongside a small selection of her other works until August 23.\n\nNational Wool Museum director Padraic Fisher said Line's quilts were \"extraordinary\".\n\nPadraic Fisher says Yvonne Line is regarded as a leading Australian quilter. (Supplied: National Wool Museum)\n\n\"Her artistry is exceptional, and world-class … she's meticulous in the way she designs and executed things,\" he said.\n\nMr Fisher said Line's ability to blend traditional techniques with contemporary design concepts made her a leader in the Australian quilting scene.\n\n\"She was part of a global movement that took quilts from a domestic [pastime] to artistic,\" he said.\n\nYvonne Line sourced material from all different places. (ABC Goulburn Murray: Sarah Krieg)\n\nIt's that commitment to the art form that Mr Lamb believes sets his sister's works apart.\n\n\"Artists are so driven to create, to the exclusion of everything else around them, and it's remarkable,\" he said.",
    "source": "ABC",
    "cluster_id": 5
  },
  {
    "url": "https://www.abc.net.au/news/2025-08-17/frank-pangallo-unveiled-as-liberal-candidate-for-waite/105662590",
    "title": "Frank Pangallo moves to Liberals to run in SA lower house seat",
    "publish_date": "Sun, 17 Aug 2025 01:38:51 +0000",
    "category": "finance",
    "authors": [],
    "text": "Independent upper house MP Frank Pangallo has launched his move to the Liberal Party by declaring he \"will be a watchdog\" who will be let \"off the leash\" ahead of the 2026 South Australian state election.\n\nMr Pangallo was today unveiled by Liberal leader Vincent Tarzia as the party's candidate for the lower house seat of Waite, which is held by Labor's Catherine Hutchesson.\n\nThe widely-tipped move had been on the cards for weeks, and has come seven years after Mr Pangallo was elected as a Member of the Legislative Council as part of Nick Xenophon's SA Best, which he left in 2023.\n\nSpeaking in the seat of Waite this morning while wearing a blue T-shirt bearing the image of a large dog and the words \"The Watchdog\", the former Today Tonight journalist acknowledged that unseating an incumbent in the seat would be the \"biggest challenge of my career\".\n\n\"I've lived in this community for 30 years and I know the challenges that they are facing in this community,\" Mr Pangallo said.\n\n\"South Australia needs a watchdog in parliament and that's what I intend to do.\"\n\nA former Today Tonight journalist, Mr Pangallo appeared in a shirt bearing the words \"The Watchdog\". (ABC News: Lincoln Rothall)\n\nMr Pangallo said he wanted to \"rattle cages\", including that of the government.\n\n\"They think they're coasting home to another election — nup, you're not. It's not going to be as easy as you think,\" he said.\n\n\"There's going to be resistance.\"\n\nLabor has hit back at Mr Pangallo and the Liberals, describing the move as \"desperate\" and Mr Pangallo as a \"long-time critic of the Liberal Party\".",
    "source": "ABC",
    "cluster_id": 6
  },
  {
    "url": "https://www.abc.net.au/news/2025-08-17/beltana-historic-royal-victoria-hotel-reopens-after-60-years-sa/105652280",
    "title": "Historic outback pub pouring beers again after 60 years",
    "publish_date": "Sun, 17 Aug 2025 01:26:06 +0000",
    "category": "finance",
    "authors": [],
    "text": "Wander around the remote Flinders Ranges township of Beltana in the early hours and \"ghost town\" comes to mind.\n\nBut when Jan Ferguson walks out of the 1870s Royal Victoria Hotel with an \"open\" sign, it's clear this town isn't ready to be consigned to history.\n\n\"We really struggle with the words abandoned, ghost, deserted,\" she said.\n\n\"There are 30 people who live here. If everybody was here in their holiday houses, that would grow to 65.\n\nMs Ferguson serves patrons inside the newly reopened Royal Victoria Hotel in Beltana. (ABC Landline: Kerry Staight)\n\n\"It's managed to survive, you know, where a lot of towns like this haven't.\"\n\nJan and her husband Chris Ferguson are at the centre of Beltana's latest revival story, the South Australian town which lies 540 kilometres north of Adelaide.\n\nCouple's decades-long connection to pub\n\nMore than 65 years after the Royal Victoria Hotel served last drinks, it's reopened its doors after the retired couple, who met in Beltana in the 1970s, bought and revived the pub with the help of family.\n\n\"We've always had a passion for the hotel,\" Ms Ferguson said.\n\nThe Fergusons are behind the recently restored bar at the Royal Victoria Hotel. (ABC Landline: Carl Saville)\n\n\" When it did come on the market, we had a conversation about how old we were and decided, 'Oh, you know, we'll do it anyway.' \"\n\nThe historic Royal Victoria Hotel in Beltana has been restored and reopened after more than 60 years. (ABC Landline: Kerry Staight)\n\nWhile the hotel was used as a home in the 1990s, it still took two and a half years to bring the main rooms back to their former glory and install modern amenities.\n\n\"We didn't realise it at the start, but every door was a different width or height, every architrave was a different width, and every skirting was a different width,\" former teacher Mr Ferguson said.\n\n\"We've done seven of the 17 rooms, so there's a lot to go, and we had to open it up as a hotel to bring some money back in,\" Ms Ferguson said.\n\nThe Royal Victoria Hotel in Beltana during the 1900s. (Supplied: State Library of South Australia)\n\nWhile being behind the bar is a change for Ms Ferguson, who has worked as a public servant and union employee, it's certainly not her first renovation job.\n\nMs Ferguson's worked on eight Beltana buildings, including the police station, which was her first home after she was married and includes a unique backyard shed.\n\nBeltana’s police station in 1897, later the Fergusons' first home after they married. (Supplied: State Library of South Australia)\n\n\"It's the cells of the police station. We stored things in them because it was the only shed,\" she said.\n\n\" It was a rations station for Aboriginal people when they were taken off their land, so the history is not all great, but it's a beautifully restored example of cells at that time. \"\n\nBeltana's past and its traditional owners\n\nLong before the township was established in 1873, the land was home to the Adnyamathanha people for centuries, and still is.\n\nKuyani-Adnyamathanha elder Beverley Patterson’s family has lived at Beltana for generations. (ABC Landline: Carl Saville)\n\nLike her grandfather, Kuyani-Adnyamathanha elder Beverley Patterson grew up here.\n\n\"When we were away from here, it felt like a loneliness living in the towns, and I think the children felt it too, and my grandchildren,\" Ms Patterson said.\n\n\" We love this place and we're not going anywhere. \"\n\nWhile European settlers changed many things for traditional owners, the town holds mostly good memories for Ms Patterson.\n\nIndigenous men outside Beltana’s police station in 1921 after receiving rations. (Supplied: State Library of South Australia)\n\nShe remembers attending the tiny primary school, which had one teacher for all the different year levels.\n\n\"This little school up there was full of kids,\" Ms Patterson said.\n\n\"I can picture everything in this place. Everybody lived together. There was no separation, you know, we were all friends.\"\n\nStudents and teachers outside Beltana’s school in about 1897. (Supplied: State Library of South Australia)\n\nBeltana was established to service the pastoral and mining industries, with its population peaking at about 400.\n\nAt one stage, it was at the end of the railway that opened up the north of the state.\n\nRailway days, roadhouses and keeping history alive\n\nWhen the rail line was shifted away from Beltana, the station became a bustling general store and gathering spot.\n\n\"Friday nights were big,\" said railway station owner Ron Tarr.\n\n\" It was a dirt road, one of the worst dirt roads in Australia, and if you didn't stop here, you're an idiot, you know. \"\n\nJan and Ron Tarr moved to Beltana in the 1980s and preserved the historic railway station. (ABC Landline: Carl Saville)\n\nMr Tarr and his wife Jan, moved to Beltana from Adelaide in the early 1980s to run and live in the general store.\n\n\"It was a bit rustic, but it was just an adventure … it was great,\" Ms Tarr said.\n\nWhen a new road bypassed Beltana, the Tarrs built the roadhouse, setting up a new gathering spot, which they ran until they retired in 2013.\n\nBut their passion for the railway station and preserving the state-heritage-listed town continues.\n\n\"You owe it to the building. You can't let them fall apart,\" Mr Tarr said.\n\n\"We've got it up to a reasonable standard and probably got another 100 years in it.\"\n\nOnce a busy hub, Beltana’s railway station now stands as a reminder of the town’s past. (ABC Landline: Kerry Staight)\n\nBeltana railway station in 1920 was once at the end of the line opening up South Australia’s north. (Supplied: State Library of South Australia)\n\nWith the reopening of the pub, Beltana people have a place to gather once again.\n\n\"Beltana's story needs to be told,\" Ms Ferguson said.\n\n\"And unless you have a business and a meeting point, you don't have a place to actually meet and share all of that history.\"\n\nAnd to the surprise and delight of the new publicans, it's not just visitors popping in, with locals from surrounding properties starting a Friday afternoon get-together at the Royal Victoria Hotel.\n\nThe sessions are unlikely to get too out of hand, though, with the hotel's owners sticking to the traditional early closing time.\n\n\"It's quite fun to say 'six o'clock closing, we're not serving anymore,'\" Ms Ferguson said.\n\n\"I don't reckon it would have ever closed at six; however, that was the law at the time,\" she said.\n\n\" This is a lifestyle business for us. We want to have some fun, as well as the people who walk through the door having some fun. \"\n\nWatch ABC TV's Landline at 12:30pm AEST on Sunday or stream anytime on ABC iview.",
    "source": "ABC",
    "cluster_id": 7
  },
  {
    "url": "https://www.abc.net.au/news/2025-08-17/off-grid-living-financial-and-psychological-benefits/105634758",
    "title": "The reasons why there's a renewed interest in off-grid living",
    "publish_date": "Sun, 17 Aug 2025 01:03:06 +0000",
    "category": "finance",
    "authors": [],
    "text": "Tucked away in southern Tasmanian bushland, Eily Stevenson and Jon Oliver are embarking on an off-grid journey.\n\nThe couple, originally from Sydney, moved to Tasmania for the weather and the lifestyle.\n\n\"We knew we wanted to have a family and the idea of raising a young family off-grid in nature was really attractive to us,\" Ms Stevenson said.\n\n\" We are outdoor nature lovers and I cannot think of a better place actually in the entire world ... Tassie is right up there with the most beautiful, pristine places. \"\n\nThe property is in southern Tasmania. (ABC News: Maren Preuss)\n\nThey purchased their bush block a few years ago, which already had the dwelling on it.\n\nNow, they are beginning to transition the property off-grid, which means being disconnected from the main electricity grid.\n\nOff-grid can also mean disconnected from other public utilities, such as water and sewerage.\n\nTheir first major task will be switching the home to solar, for which they have budgeted about $25,000 to include up to 24 panels and a few batteries.\n\n\"The up-front benefits will be at a financial loss, but I think when you factor in all the costs projecting out five to 10 years, it will pay for itself,\" Mr Oliver said.\n\nThe couple moved to Tasmania for the weather and the lifestyle. (ABC News: Scout Wallen)\n\n\"Five years ago, probably would have been upwards of $30,000, any longer probably up towards … $40,000, and the technology was nowhere near as good either, so definitely it's become more affordable to move off-grid.\"\n\nThey have already spent $45,000 on their driveway and access.\n\nThey expect to spend $18,000 on improving the septic system, $3,000 on adding two additional water tanks, and $25,000 on upgrades to the house.\n\nTheir first major task is to switch the home to solar power. (ABC News: Maren Preuss)\n\nEvolution of off-grid living\n\nPhillipa Watson is a research fellow at the Australian National University and has been studying the social change in energy uptake across Australia for two decades.\n\nAlthough there is no national database on the number of people living off-grid, Dr Watson said there had \"certainly\" been increased activity by power companies over the past decade to create more off-grid systems for their customers.\n\nShe said that shift was primarily thanks to solar power systems becoming more affordable.\n\nMeet the off-grid couple who only use an estimated 2 kWh per day Photo shows An older woman in a grey knitted jumper and an older man in a green flannelette shirt stands in their Earthship. Immune to power outages, the Tasmanian couple generate their own electricity using solar panels, for a fraction of the price.\n\n\"The old school off-gridders needed to have a lot of technical knowledge and were getting involved either because they had to, or they really, really wanted to,\" Dr Watson said.\n\n\"Then we had this newer kind of household that had to consider the new connection costs which could go into the tens of thousands in those edge-of-grid or remote areas … which then became comparable with putting in an off-grid system.\"\n\nDr Phillipa Watson has been studying off-grid living. (ABC News: Scout Wallen)\n\nDr Watson said with the increased uptake, technical support had become more readily available.\n\n\"We saw in those households they didn't need to be technically able about their off-grid system because the installers were becoming more sophisticated and were able to offer them a long-term support program.\"\n\nEily Stevenson and Jon Oliver are building a vegetable garden to increase their self-sufficiency. (ABC News: Maren Preuss)\n\nMr Oliver said their property was already connected to the electricity grid.\n\n\"It's fairly cheap once you're already connected, all the infrastructure is there, whereas if we were starting from scratch and we needed to get poles in, 100 per cent, [solar] straight away,\" Mr Oliver said.\n\nCouncil regulations can also pose a challenge.\n\n\"Contact your local council if you've got your eye on a property to make sure that you can do everything, that it's permitted,\" Ms Stevenson said.\n\nDr Watson said resourcefulness was a huge motivator.\n\n\"Especially in Tasmania, we see a really strong resourcefulness streak … people who are just really, really proud of being efficient,\" she said.\n\nMs Stevenson said the \"psychological benefits of knowing that you are living off the land and producing a lot of your own resources is really attractive\".",
    "source": "ABC",
    "cluster_id": 8
  },
  {
    "url": "https://www.abc.net.au/news/2025-08-17/tasmanian-salmon-industry-expansion-pause-as-review-ordered/105663820",
    "title": "Tasmanian salmon farming expansion plans on pause as Liberals order review",
    "publish_date": "Sun, 17 Aug 2025 00:40:43 +0000",
    "category": "finance",
    "authors": [],
    "text": "The Tasmanian government will halt marine expansion of the salmon industry in local waterways while an independent review is ordered to examine the industry's long-term sustainability and environmental impact.\n\nEarlier this year, bacterial disease piscirickettsia salmonis swept through salmon pens in southern Tasmanian waters, causing the deaths of thousands of farmed fish.\n\nThe state government has confirmed the salmon industry continues to grapple with the disease, and last week sought fast-track approval of a new antibiotic on operators' behalf to bring it under control.\n\n\"We are on the side of Tasmanians. We know how important transparency is to the industry,\" Mr Rockliff said in the statement. (ABC News: Kate Nickels)\n\nOn Sunday, the minority Liberal party announced it would launch an independent review into the troubled industry.\n\nPremier Jeremy Rockliff said the review would support the salmon industry \"to operate transparently and responsibly\" and \"meet its social licence\".\n\n\"I said clearly, after the mass mortality event of last summer, the industry is on notice,\" Mr Rockliff said in a statement.\n\nCrossbenchers wield influence in Tasmania’s new political order Photo shows Two men at press conferences wear suits and stand outside. Crossbenchers who could decide the fate of Tasmania's minority government have give mixed responses to new commitments by the Liberals and Labor.\n\n\"I do not resile from that. We must always seek to strike a balance between sustainable primary industries and our unique natural environments in which they operate.\n\n\"Our government would want to see from this study practical reforms and smarter regulations that protect our environment, but also investment certainty for industry.\"\n\nThe government said it would pause industry marine expansion during the review period, and would retract finfish farming permits from leases that are \"not subject to an existing marine farming license\".\n\nThe announcement came as the government prepared for a fresh no-confidence vote against it when parliament returns on Tuesday.\n\nThe state's July election resulted in a hung parliament, meaning crossbenchers could decide the fate of which party forms government.\n\nSince the election, both major parties have made significant pledges as they try to garner the support of crossbenchers ahead of the vote that will decide who governs the state.\n\nSalmon communities 'betrayed', industry says\n\nThe announcement has been met with ire from peak body Salmon Tasmania, who accused the premier of \"shamefully\" walking back on a promise to support the industry in a bid to secure Greens' and independents' confidence.\n\nAntibiotics found in Tasmanian wild fish after February salmon deaths Photo shows Dead pink fish and pink chunks floating in an open ocean fish pen. The EPA report says eight samples of wild fish were taken in the Zuidpool North lease, with three samples — all blue mackerel — testing above the reporting threshold.\n\nIn a letter from Mr Rockliff to salmon chief executive John Whittington ahead of the election — seen by the ABC — Mr Rockliff wrote his party would \"not trade the salmon industry in any way, shape or form in order to form or retain government\".\n\nFollowing Sunday's announcement, Dr Whittington said that assurance had \"proven worthless\".\n\n\"The premier has gone back on his word and commitments and shamefully let down every salmon worker, their families and communities across the state,\" he said.\n\n\"[He] has let down the salmon aquaculture industry; strangling growth, guaranteeing a whole host of new red tape, and significantly undermining confidence and investment.\n\nLoading...\n\n\"[They] deserve the support of their leaders, and not to be treated as a political plaything that is traded away for power.\"\n\nDr Whittington said the industry was already highly regulated, informed by science from institutions such as the Institute for Marine and Antarctic Studie (IMAS) and the CSIRO, along with government input.\n\nReview launched to maintain industry 'continuous improvement'\n\nThe review will be conducted by a specialist \"off-island\" organisation with the terms of reference to be decided by parliament.\n\nHow many salmon farms are there in Tasmania — and who owns them? Photo shows Salmon farm location map 4 Those black, circular things floating in the water off the Tasmanian coastline? They are salmon farms. Here is how many there are — and who owns them.\n\nBut the government wants it to look at existing and proposed monitoring and regulation, environmental standards, compliance, penalties and legislation, as well as antibiotic use, the industry's impact on public waterways and the environment, and different methods of fish farming.\n\nIn an effort to bolster regulatory oversight, the Liberals have also promised to introduce a Marine Environment Act, and to further resource the EPA (Environment Protection Authority), enabling it to provide \"full public reporting on matters of public interest\".\n\nPrimary industries and water minister Gavin Pearce said the government had not erred in its support of workers.\n\n\"We know salmon workers are committed to the highest environmental and animal welfare standards, and want to see continuous improvement in their industry for the benefit of our marine ecology,\" Mr Pearce said.\n\nAll three salmon companies operating out of Tasmanian waters — Brazilian multinational JBS; New Zealand's Petuna; and Canadian aquaculture giant Cooke, owner of Tassal — are owned by foreign multinationals.",
    "source": "ABC",
    "cluster_id": 9
  },
  {
    "url": "https://www.abc.net.au/news/rural/2025-08-17/northern-territory-mangoes-allowed-back-into-western-australia/105657246",
    "title": "Territory mangoes to flow back into WA as agreement reached on fruit fly",
    "publish_date": "Sun, 17 Aug 2025 00:37:41 +0000",
    "category": "finance",
    "authors": [],
    "text": "Northern Territory mangoes can freely flow into Western Australia after the regions agreed on a new fruit fly management protocol.\n\nWA suspended market access for NT mangoes in October over fruit fly concerns.\n\nA temporary program was implemented in 2024 after sudden changes to post-harvest chemical treatments in 2023.\n\nNow, a permanent agreement has been signed, which is recognised nationally and internationally.\n\nGolden fruit to WA\n\nGrowers are rejoicing at the new biosecurity protocols, weeks out from this year's NT mango harvest.\n\nKatherine mango grower Marie Piccone sends about 20 per cent of her mangoes to Western Australia.\n\nMarie Piccone is preparing for mango harvest. (Supplied: Steen Vestergaard)\n\n\"I'm so relieved that we are going to have access to the Western Australia market. There are a lot of mango lovers in Western Australia who are probably quite relieved as well,\" Ms Piccone said.\n\nThe Northern Territory is renowned for its high-quality mangoes, producing half of Australia's supply.\n\nCurrently, only four varieties can be sent from the NT to WA — Honey Gold, R2E2, Calypso and Kensington Pride — but it is hoped this list will be expanded with time.\n\nCalypso mangoes can be sent from the NT to WA. (ABC Rural: Max Rowley)\n\nTravelling to Katherine for a pre-season industry event, Barry Doran, a sales manager for a Perth-based distributor, was on the lookout to build relationships with Territory growers, where he can source more produce than from small-scale Kununurra farms.\n\n\"I think it's good news for the growers that want to come in from Katherine,\" he said.\n\n\"We probably average maybe 20 pallets a week out of Kununurra, and here we can get 20 pallets a day out of one grower in Katherine.\n\n\"So consistency in volume is probably the biggest factor in WA, and that's what we need.\"\n\nKeeping WA fruit fly free\n\nThe dreaded Queensland fruit fly is considered a major economic pest. (Supplied: Peter Rowland)\n\nWestern Australia has strict protocols in place to prevent Queensland fruit fly incursions across its borders.\n\nIn September 2023, dimethoate, used as a post-harvest treatment dip for mangoes, was suspended by the Australian Pesticides and Veterinary Medicines Authority due to excess residue levels.\n\n\"Mango growers — all of a sudden — who had contracts signed with suppliers in WA, couldn't send them,\" NT chief plant health officer Sally Heaton said.\n\nMid-harvest in 2024, WA suspended NT growers over compliance issues during a trial period using the fumigator dimethyl-bromide.\n\nThis left biosecurity officers and growers scrambling to find alternative agreed methods of treatment. The latest in place was vapour treatment, which is effective, but has limited capacity.\n\nWA buyers want more NT mangoes. (ABC News: Che Chorley)\n\nMitchael Curtis, who owns King's Farm, a few kilometres south of Katherine, last year decided not to sell to Western Australia because of the chemicals and sprays required.\n\n\"We're trying to get a real good balance in our orchard of good and bad insects, then they come out and say we have to nuke the whole orchard with these horrible sprays and that mucks up our whole farming strategy,\" he said.\n\n\"It's a decision for us; some farmers are happy to spray.\n\n\"If we want to sell our fruit, we have to do what we have to do.\"",
    "source": "ABC",
    "cluster_id": 10
  },
  {
    "url": "https://www.abc.net.au/news/2025-08-17/regulator-demands-defence-of-anu-council-conduct/105663726",
    "title": "Regulator demands ANU defend its council members' conduct",
    "publish_date": "Sun, 17 Aug 2025 00:19:28 +0000",
    "category": "finance",
    "authors": [],
    "text": "A federal government investigation into Australian National University (ANU) has demanded the university defend the conduct of its council members amid concerns they failed to competently oversee the institution's operations.\n\nA letter from the higher education regulator to ANU Vice-Chancellor Genevieve Bell in June revealed more detail about a compliance assessment being undertaken by the Tertiary Education Quality and Standards Agency (TEQSA).\n\n\"TEQSA is concerned [the ANU Council] may not have fulfilled its obligation to exercise competent governance oversight of, and be accountable for, all ANU's operations,\" the letter said.\n\nHow one of the world's most prestigious universities fell from grace Photo shows Signage for the ANU. The prestige of the Australian National University is fast fading.\n\nTEQSA began investigating compliance concerns at ANU in October 2024, but did not commence its formal compliance assessment until June.\n\nIts investigation had initially been limited to assessing ANU's Nixon Review and its proposed staff cuts, along with grades in the ANU School of Cybernetics.\n\nThe letter outlined its investigation had been expanded to include \"broader risks to compliance\" including the culture of the ANU Council and executive leadership, and oversight of its financial position.\n\n\"Further information has been considered which suggests there are broader potential risks to compliance that require assessment by TEQSA,\" the letter said.\n\nSeveral concerns identified\n\nTEQSA's letter spelled out issues such as staff afraid to voice concerns about decisions by senior leadership, the management of staff cuts, the internal culture of the ANU Council and leadership, and poor accountability of workplace practices.\n\nVice-Chancellor Genevieve Bell is one of the 15 members on ANU Council. (ABC News: Tiger Webb)\n\nThe letter, authored by TEQSA CEO Mary Russell, also specified fears about the ANU Council's oversight of the university's financial position, which included the institution's pursuit to find $250 million in savings by 2026.\n\n\"Whilst steps are being taken to address ANU's current financial position, it was under the ANU Council's oversight that ANU reached a position that now requires it to reduce recurring expenditure by $250 million,\" the letter said.\n\n\" It is unclear if the ANU Council has identified and addressed potential risks that led to this financial position and whether these potential risks persist. \"\n\nOn Tuesday, ANU was forced to respond to allegations that council members, including Chancellor Julie Bishop, had threatened, harassed and bullied staff-elected council member Dr Liz Allen.\n\nLiz Allen accused ANU Council members of bullying during a Senate inquiry hearing on Tuesday. (Supplied: Senate estimates)\n\nThe ANU demographer told a Senate inquiry investigating governance in Australia's higher education providers that the stress from her time on the council and a meeting with Ms Bishop led to her contemplating suicide and contributed to the miscarriage of a much-wanted baby.\n\nMs Bishop has denied any wrongdoing and said she rejected \"any suggestion that I have engaged with council members, staff, students and observers in any way other than with respect, courtesy and civility\".\n\nThe letter from TEQSA, which was tabled as part of the inquiry, asked the university to provide a self-assurance report as part of its compliance assessment.\n\nTEQSA said that beginning a compliance assessment did not mean it had already formed a view about whether a provider was meeting its obligations.\n\nIn a staff newsletter from July, ANU said the self-assurance report \"is a valuable opportunity to demonstrate the strength of our internal processes and continue our long-standing, constructive relationship with TEQSA\".\n\nWhat is the ANU Council and who is on it?\n\nThe ANU Council is the governing body of the university and is made up of 15 members, chaired by Ms Bishop through her role as chancellor.\n\nProfessor Bell also sits on the council.\n\nSix members are elected by groups within the ANU community — two academic staff, one professional staff member, a postgraduate student, an undergraduate student, and a dean or research school head.\n\nSeven external members are appointed by the federal education minister.\n\nOne of the academic staff positions is currently vacant after the resignation of Francis Markham due to what he described as \"concerns about governance practices within the council\".\n\nANU Council members Category Member Expiry Chancellor Julie Bishop Dec 31, 2026 Vice-Chancellor Genevieve Bell Ex-officio Seven members appointed\n\nby the minister Alison Kitchen\n\nTanya Hosch\n\nRob Whitfield\n\nLarry Marshall\n\nPadma Raman\n\nAndrew Metcalfe\n\nWayne Martin Jun 30, 2029\n\nJun 30, 2028\n\nJun 30, 2028\n\nJul 31, 2027\n\nJun 30, 2029\n\nJun 30, 2029\n\nJun 30, 2029 Deans and research school\n\nheads member Juliana Ng Sep 29, 2026 Academic staff (faculties) member Vacant Academic staff (institute) member Lyndall Strazdins Sep 29, 2026 Professional staff member Megan Easton May 25, 2026 Postgraduate student member Brenna Barker-Lamb Nov 30, 2025 Undergraduate student member Will Burfoot Nov 30, 2025 Chair, academic board (non voting) Anthony Connolly Ex-officio\n\nCouncil minutes show Ms Bishop formally informed the council of TEQSA's investigation during its July meeting.\n\nIn response, one council member requested access to independent legal advice to inform them of their responsibilities throughout the process.\n\nThe minutes show Ms Bishop arranged for the legal advice, provided by an external legal firm, to be distributed to all council members at an estimated cost of $15,000.\n\nWhat happens from here?\n\nAn inquiry hearing in Canberra on Tuesday revealed the university would not meet TEQSA's original deadline of August 12 for the self-assurance report to be provided.\n\nIt has been granted an extension to August 19.\n\n\"It should demonstrate how ANU monitors, manages and mitigates institutional risks with regard to the concerns identified in this letter,\" TEQSA said.\n\n\"The self-assurance report will be one part of the information TEQSA considers.\"\n\nMary Russell says TEQSA has the power to impose conditions on the ANU if it feels it's necessary. (Supplied: TEQSA)\n\nOn Tuesday, Dr Russell could not say how long TEQSA's process would take but said it would be \"quite lengthy\".\n\n\"[That's] due to the complexity of the matters and the importance, as we see it, of making sure that we provide every opportunity to staff, students, other stakeholders and members of the university community to share their concerns and for us to make sure that those are addressed in our process,\" she said.\n\n\"At the moment we haven't encountered anything in dealing with the ANU inquiries that we cannot manage within our existing powers. We have compulsive powers to require evidence, if that is not offered or afforded by a university.\n\n\"We have power to impose conditions on the university if we feel that that is necessary.\"\n\nDr Russell was also asked by ACT independent senator David Pocock about reports regarding a disproportionately high number of students receiving high distinctions in the School of Cybernetics, the specialty interest of Professor Bell.\n\n\"That's one of the issues that has been raised with us. That is already part of our inquiries,\" Dr Russell said.\n\nTEQSA said it was in the process of engaging assistance from an independent expert as part of the compliance assessment.",
    "source": "ABC",
    "cluster_id": 11
  },
  {
    "url": "https://www.abc.net.au/news/2025-08-17/wa-health-system-under-fire-analysis/105660174",
    "title": "WA's 'world class' health system is ailing, and no one seems to have the answers",
    "publish_date": "Sun, 17 Aug 2025 00:08:28 +0000",
    "category": "finance",
    "authors": [],
    "text": "Western Australia's health system is not in good health, and the signs for the future aren't much better.\n\nThe state government has spent the week defending its record, particularly around a range of issues at Sir Charles Gairdner Hospital, which is reportedly falling apart.\n\nIt's been the opposition's near sole focus this week.\n\n\"Will the premier commit to cancelling the Burswood racetrack project and directing those funds to fixing up Sir Charles Gairdner Hospital?\" opposition leader Basil Zempilas demanded in parliament on Tuesday, landing a two-for-one blow.\n\nThere have been reports of infrastructure concerns at Sir Charles Gairdner Hospital. (ABC News: James Carmody)\n\nThe government's responses were similarly political.\n\n\"[Basil Zempilas] is scaring Western Australians because he sees a small gap of political opportunity here,\" Premier Roger Cook responded, saying improvements were underway.\n\n\"We have a $3.2 billion capital investment program to ensure we continue to expand our health system.\n\nBasil Zempilas was accused by Premier Roger Cook of scaremongering. (ABC News: Keane Bourke)\n\n\"We have provided more funding than ever before.\"\n\nIt's a line often used by government, which usually doesn't mean a lot, because the combination of inflation and an ever-growing population means spending will almost always increase, even if what's being delivered remains the same.\n\nBleak future\n\nThere are many signs a lot more funding will be required in the future, including from a Health Department report released this week.\n\nThe idea of its 'Burden of Disease' analysis is to track changes in not only life expectancy, but also how much of people's lives are lived in good health — meaning their impact on the health system is reduced.\n\nInside WA's 'broken' health system Photo shows Woman with grey jumper and glasses looking sad Jenny Cross says her husband died after a six-month fight for answers.\n\nThe latest report, which looks at data from 2023, found life expectancy was increasing faster than the proportion of people's lives considered to be lived in good health.\n\nOn average, it said women under 64 and men aged under 60 could expect to have a smaller proportion of their remaining life in good health.\n\nIt suggests without fundamental changes in the health system, the problems facing patients today will only get worse because of ever-increasing demand.\n\nAnd there are problems at the moment — even if the government is not keen to admit them.\n\nAmbulance ramping\n\nThe amount of time ambulances spend parked outside hospitals waiting to transfer patients is just one symptom of the problem — highlighting when hospitals are at capacity and unable to meet demand.\n\nBetween June 2024 and June 2025 a patient would spend, on average, 20 minutes ramped outside a hospital — about in line with the averages in previous years.\n\nThis month, the average is closer to 30 minutes.\n\nPatients are spending an average of almost 30 minutes ramped outside WA hospitals this month. (ABC News: Keane Bourke)\n\n\"What we want is the premier to drop this 'world-class' line,\" Australian Medical Association WA president Kyle Hoath said on Tuesday.\n\n\"We want the premier to acknowledge that there is a problem with our health system, that our hospitals are on their knees, and that we need to work together to fix this.\n\n\"We need investment in our hospitals, not just new beds, but to make sure that our existing hospitals don't fall to pieces.\"\n\nKyle Hoath said WA's hospitals were in need of significant investment. (ABC News: Keane Bourke)\n\nOn Thursday, opposition health spokeswoman Libby Mettam used question time to claim the government's own figures showed it had only added 118 hospital beds in metropolitan Perth between 2018 and May 2025 — far below the 863 beds it claimed to have added.\n\n\"The number of available beds in the system will change over the course of the day,\" Health Minister Meredith Hammat attempted to explain over the opposition's interjections.\n\nMeredith Hammat defended the state government's investment in WA's hospitals. (ABC News: Keane Bourke)\n\n\"The reasons it might change, for example, are because a patient has been discharged and that room needs to be cleaned before another patient can use it. It may be that some maintenance is potentially required for one of those beds.\n\n\"This is why the more accurate measure is to count the number of beds that have been added through infrastructure upgrades.\"\n\nA world-class system?\n\nWhile a common understanding of the issue might have proved elusive, there was a marked change in language.\n\nOn Tuesday, the premier told parliament the health system was \"world-class\" four times.\n\nThe following day, Health Infrastructure Minister John Carey also used the term.\n\nOn Thursday, no ministers used the description.\n\nJohn Carey hasn't ruled out additional funding for Sir Charles Gairdner Hospital. (ABC News: James Carmody)\n\n\"Every minister in every portfolio advocates for more funding,\" Carey told reporters that day.\n\n\"I do anticipate that we will have to make further investment in Charlies.\"\n\nBut the government is not writing the health system a blank cheque, with Treasurer Rita Saffioti pointing out on Thursday \"there's always unlimited wants, unlimited demand\" for taxpayers' money.\n\n\"And so it's always trying to make sure you can deliver increased funding and getting improvements,\" she said, pointing to $110 million of investment at Sir Charles Gairdner Hospital alone.\n\nThe West Australian newspaper has published a series of articles exposing problems in the state's health system. (ABC News: Keane Bourke)\n\nOn the face of it, it's a fair enough comment for a government to make. Not every funding request it received can be accommodated.\n\nBut it's a trickier argument to make when the state budget is $2.4 billion in surplus, and the question is whether health spending should be increased.\n\nHave something to share with the ABC's WA newsroom? Photo shows Perth City and Claisebrook Cove Whether it's an image, video, story, or tip-off, you can send it to the ABC's West Australian newsroom here.\n\nOnly six months into this term of government, the opposition has honed in on health as a weak point for the government, and one it will almost certainly continue to prosecute relentlessly.\n\nIt's a tricky one for the government to counter, given the web of systems and services run by state and federal authorities in an increasingly complex space with no easy answers.\n\nWhen the next election is held in 2029, the opposition may well have convinced the public of the severity of problems — but they'll have to do a lot more to prove they have the solutions needed to turn things around.\n\nLoading...",
    "source": "ABC",
    "cluster_id": 12
  },
  {
    "url": "https://www.abc.net.au/news/2025-08-17/boom-in-gravel-grinders-hitting-wa-regional-dirt-roads/105646670",
    "title": "Scenic country towns capitalise on gravel cycling boom",
    "publish_date": "Sun, 17 Aug 2025 00:00:00 +0000",
    "category": "sports",
    "authors": [],
    "text": "Flecks of mud spatter Mark Chong's face.\n\nHe has just cycled 160 kilometres along gravel roads in Nabawa, a rural community 480 kilometres north of Perth, in about four-and-a-half hours.\n\nBut he can't stop smiling.\n\nThe 26-year-old, who has only been gravel riding for three years, was named the men's state gravel cycling champion at the Backroads Gravel event.\n\nHe is one of a growing number of \"gravel grinders\" across the world to adopt the discipline.\n\nMark Chong cycled 160 kilometres in just over four hours and thirty minutes. (ABC Midwest and Wheatbelt: Chloe Henville)\n\nWhat is gravel cycling?\n\nChong describes the sport as a mix between mountain biking and road cycling, combining fitness and technical skill on unpaved trails.\n\nGravel cycling often takes place in regional areas. (Supplied: Daniela Tommasi)\n\nHe likes that it keeps riders away from cars and closer to nature in places like Nabawa.\n\n\"You've got the canola fields, so if it ever gets too painful you can just look to the side and get a good view,\" he said.\n\nBike wheels on a gravel road\n\nChong has noticed interest in the gravel sport picking up, including in metropolitan areas.\n\n\"Even in Perth, where it’s just the city centre, I’d say one in five bikes is a gravel bike,” he says.\n\nMitch Docker travelled from Victoria to particpate in the Backroads Gravel event. (Supplied: Daniela Tommasi)\n\nFormer professional cyclist Mitch Docker has noticed the trend, too.\n\n\"Gravel bike riding has exploded in, probably, the past five years,\" he said.\n\nCycling participation has risen across Australia since Australia's Cadel Evans won the 2011 Tour de France.\n\nBut the experienced rider says the added safety of isolated tracks draws people to the off-road discipline.\n\n\"When you're on the road you're always a bit on the edge, thinking about the next car coming,\" Mr Docker said.\n\n\" When you're on the gravel, especially private roads, you really do feel free. \"\n\nMr Docker says gravel biking provides freedom. (ABC Midwest and Wheatbelt: Chloe Henville)\n\nNannup to draw world's best gravel riders\n\nWestCycle chief executive Wayne Bradshaw says WA's natural beauty makes the regions frontrunners to host national and international competitions.\n\n\"It's great scenery out there, ranging from wildflowers to rugged coastlines,\" he says.\n\nNatural scenes are one pull towards gravel cycling. (ABC Midwest and Wheatbelt: Chloe Henville; Supplied: Daniela Tommasi)\n\nHe says WA will be centre stage when Nannup, 270 kilometres south of Perth, hosts the 2026 Gravel World Championships.\n\nWith about 3,000 competitors, it has the potential to bring 10,000 visitors to the town, which is home to fewer than 1,000 residents.\n\n'Race-cations' in the regions\n\nMr Bradshaw says even small-scale events have big benefits, pointing to the annual Bike it to Ballidu event.\n\nThe event began as a school fundraiser 25 years ago and has grown to attract hundreds of elite and amateur gravel cyclists.\n\nThe small Wheatbelt town see hundred of tourists due to the Ballidu event. (Supplied: Patrick Boere photography )\n\nMr Bradshaw says Ballidu, 210 kilometres north-east of Perth, has only 58 residents, but is set to play host to 700 hundred visitors for its September event.\n\n\"Where we've got a great community spirit, there's great engagement,\" he said.\n\nBack in Nabawa, event coordinator Dave Budge says Backroads Gravel experienced massive growth for its fourth year.\n\n\"It's just grown to another level,\" he says.\n\nDave Budge says the rapid growth was unexpected but welcome. (ABC Midwest and Wheatbelt: Chloe Henville)\n\nThe 2025 competition, held last week, attracted 737 participants, with about 50 per cent travelling for the competition.\n\n\"We call these race-cations,\" Mr Budge said.\n\n\" We have participants from every state in Australia, so they come here and then race with their friends, find some new friends, then celebrate. \"\n\nThe whole Nabawa community gets behind the Backroads Gravel event. (ABC Midwest and Wheatbelt: Chloe Henville)\n\nHe says the event's economic and tourism boost was unmatched in the region.\n\n\"For every bit of accommodation that’s available, that’s booked out well in advance,\" Mr Budge said.\n\n\" Would 1,000 people [usually] come to Nabawa on a weekend? Possibly not. \"\n\nPeople of all ages participated and watched the event. (ABC Midwest and Wheatbelt: Chloe Henville)",
    "source": "ABC",
    "cluster_id": 13
  },
  {
    "url": "https://www.abc.net.au/news/2025-08-17/boomers-beat-iran-to-power-into-asia-cup-final-against-china/105663800",
    "title": "Boomers hit great heights against Iran to power into Asia Cup final",
    "publish_date": "Sat, 16 Aug 2025 23:35:06 +0000",
    "category": "sports",
    "authors": [],
    "text": "The Boomers have reached the Asia Cup final after extending their unbeaten run to five games with a convincing 92-48 defeat of Iran at the King Abdullah Sports City in Jeddah.\n\nVictory has set up a Sunday showdown with similarly undefeated 16-time champion China which defeated New Zealand in their semi-final.\n\nFIBA Asia Cup Semi-finals Australia 92 (McVeigh 17, Wessels 16) def Iran 48 (Vahedi 11)\n\nChina 98 (Zhao Rui 24, Wang Junjie 14) def New Zealand 84 (Britt 21, King 19) Australia to play China in final, Iran to play New Zealand in bronze medal game\n\nFor Australia the result means a shot at a third straight Asia Cup title and an opportunity to keep their perfect record in the competition intact.\n\nBoomers star William Hickey, who was named player of the game, lavished praise on his teammates, saying \"we are proud of how, down to the last man, we handled ourselves well\".\n\n\"If you can play defence you can always win games. I'm proud of just everyone down the line contributing today,\" he said.\n\nEvery Boomers player got on the scoreboard in a performance that showcased depth, discipline and dominance.\n\nJack McVeigh led the way with 17 points and three triples, while Harry Wessels had 16 and Hickey 14 as Australia dominated proceedings in Saudi Arabia.\n\nHickey added six rebounds and as many assists in an all-around display, while Wessels provided a steady defensive presence.\n\nOwen Foxwell set the tone early with steals and a key three-pointer, and Jack White delivered highlight-reel slams to keep the energy high.\n\nFor Iran, Sina Vahedi top-scored with 11 points including two triples, while Mobin Sheikhi had eight points, four rebounds and three assists.\n\nStar forward Mohammad Amini was limited to just two points on 1-of-9 shooting as the Boomers' defence smothered his usual offensive spark.\n\nAustralia weathered Iran's early shots in the first quarter, answering with back-to-back triples from McVeigh and Reyne Smith plus a technical foul free throw to close the period up 27-20.\n\nOwen Foxwell hit a big three-pointer to help send the Boomers on their way to the Asia Cup final with a win over Iran. (Supplied: FIBA)\n\nFrom there, the Boomers found another gear.\n\nThe second quarter saw a 24-9 burst led by Foxwell's perimeter shooting and inside dominance from White, Will Magnay and Wessels, giving the Aussies a 51-29 half-time cushion.\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\nIf the first half had Iran scrambling, the third quarter finished the job.\n\nMcVeigh's quick five points, punishing runs from Hickey and Wessels, and relentless defensive pressure resulted in a staggering 29-8 frame that pushed the margin to 80-37.\n\nBy the time Joshua Bannan's corner triple dropped, the game was long decided.\n\nThe final quarter was about managing minutes and maintaining focus, with Wessels continuing to score inside and Australia's defence ensuring Iran never threatened.\n\nThe Boomers' balanced attack, rim protection and transition efficiency proved too much for Iran's young Team Melli, still finding their identity after earlier comeback wins in the tournament.\n\nAAP",
    "source": "ABC",
    "cluster_id": 14
  },
  {
    "url": "https://www.abc.net.au/news/2025-08-17/vegetable-garden-bringing-joy-to-elderly-residents/105624348",
    "title": "How unexpected friendships formed in the garden bring joy to ageing",
    "publish_date": "Sat, 16 Aug 2025 23:26:54 +0000",
    "category": "finance",
    "authors": [],
    "text": "Joan French had one thing at the top of her wish list when it came time to move into a retirement home.\n\n\"I've always had a garden. Really loved it. So that's why I chose this place to live,\" she said.\n\n\"I like to be out in the fresh air.\"\n\nThe 92-year-old moved north from Bribie Island near Brisbane to Bundaberg to be closer to family last year.\n\nBut she's now cultivating some unexpected younger friendships.\n\nStudents grow tomatoes and other vegetables. (ABC News: Johanna Marie)\n\nIt's harvest day in the garden of Ms French's aged care home, which has been built by students from the neighbouring high school.\n\n\"We've got tomatoes, like cherries and your romas, and then we've got cauliflower, some broccoli, lettuce … even silverbeet and carrots,\" Jayden Van Rooyan, 14, said.\n\n\"There's chickens and we even bring in goats to interact with the residents.\"\n\nThe produce is provided to the aged care home kitchen for mealtimes. (ABC News: Johanna Marie)\n\nJoy in ageing\n\nThe teenagers tend the garden under the watchful eye of the elderly residents, who relish the time outdoors.\n\n\"It makes me feel like I want to bog in and help them, but I'm past that now,\" Ms French said.\n\nThe students grow a variety of fresh fruit and vegetables for the aged care home. (ABC News: Johanna Marie)\n\nGreg Cronan from the Australian Institute for Intergenerational Practice said it was important for people to continue experiencing purpose and meaning later in life.\n\n\"This is one of the biggest challenges for senior adults in residential aged care,\" Mr Cronan said.\n\n\"What we're doing with these programs is bringing joy into ageing.\n\n\"These older people can have a tremendous influence on the lives of these students.\"\n\nGreg Cronan says the program is restoring joy in residents' lives. (ABC News: Johanna Marie)\n\nThe health benefits of the social connections can't be underestimated either.\n\n\"It's meant to be stimulating … and studies show these interactions can not only delay the onset of dementia, but also help diminish its severity,\" Mr Cronan said.\n\nReciprocal learning\n\nIn this all-ages gardening club, shared interests make good fodder for conversation.\n\nThe teenagers and elderly bond over gardening and life experiences. (ABC News: Johanna Marie)\n\nJune Cuskelly, 90, grew up on dairy farms across southern Queensland, so there is no shortage of tales to pass on to her young protégés.\n\n\"Riding horses, getting the little pigs and dressing them up in doll's clothes,\" she said.\n\nAged care residents June Cuskelly and Joan French patting the baby goats. (ABC News: Johanna Marie)\n\n\"Dad would play the banjo, and mum would play the piano and us kids would get around dancing and singing.\"\n\n\"It was good to hear how different their growing up was compared to mine and learning all the history was brilliant,\" added fifth-generation farmer and student Bailey Jansen.\n\nSt Luke's Anglican School director of community and service, Matthew Cathcart, said the \"community agriculture club\" was a joint initiative with Meilene Residential Aged Care.\n\n\"We've got a lot of students that are involved in farming, so it's great to bring the two together and be able to connect with one another,\" Mr Cathcart said.\n\nJoan French and June Cuskelly enjoy watching the teenagers in the garden. (ABC News: Johanna Marie)\n\nMr Cronan believed the interactions encouraged reciprocal learning.\n\n\"The young people can learn about how hard it was to farm land 50 years ago and the older people learn about new technology and how we farm today,\" he said.\n\nPaddock to plate\n\nIt's also a lesson in sustainability.\n\nScraps from the school tuckshop are collected for compost, while chickens help fertilise the aged care garden.\n\nProduce from the vegetable garden is used in the aged care home's kitchen. (ABC News: Johanna Marie)\n\nEverything grown goes straight to the cooks in the kitchen to prepare nutritious lunches and dinners for the aged care residents.\n\n\"They reckon they bloody love it,\" Bailey said.\n\nThis story is the final in a five-part series exploring how regional Queenslanders are ageing well outside the capital city.",
    "source": "ABC",
    "cluster_id": 15
  },
  {
    "url": "https://www.abc.net.au/news/2025-08-17/bindi-irwin-sparks-endometriosis-conversation/105657380",
    "title": "The power and pain of Bindi Irwin's endometriosis journey",
    "publish_date": "Sat, 16 Aug 2025 22:55:53 +0000",
    "category": "lifestyle",
    "authors": [],
    "text": "Bindi Irwin is urging women not to accept endometriosis pain as normal.\n\nThe 27-year-old's post on social media in 2023 detailing her diagnosis with endometriosis has been liked more than one million times.\n\nThis week, Ms Irwin stated that after 13 years of fighting for answers, 51 endometriosis lesions, a cyst, two surgeries, and a hernia, it was now time to heal.\n\nShe said she felt \"utterly ashamed\" of her pain as her endometriosis symptoms were constantly dismissed.\n\nLike many women, Ms Irwin said this eroded her self-esteem, and she was speaking out to help reduce the stigma and secrecy around discussing the condition.\n\nNot just a woman's issue\n\nEndometriosis is a disease in which tissue similar to the lining of the uterus grows in other parts of the body.\n\nAbout one in 10 of those assigned female at birth have endometriosis.\n\nEbony Nykiel, 26, from Queensland's Sunshine Coast, said Bindi's post resonated with her.\n\nShe said it took 13 years for her diagnosis of endometriosis.\n\nEbony Nykiel, 26, from the Sunshine Coast, lives with endometriosis. (Supplied)\n\nMs Nykiel said she had her first period at 10, and from the start, her painful symptoms were dismissed by others.\n\nHer eventual diagnosis was \"bittersweet\".\n\nShe said it was validating to learn she \"wasn't crazy\" but that she was left with limited treatment options.\n\nMs Nykiel said it wasn't just a woman's issue. \"It's everyone's issue,\" she said.\n\nChange 'on a global scale'\n\nMs Irwin said she was \"slowly, slowly\" regaining her strength.\n\n\"I can FINALLY (sic) say that I'm feeling better. Genuinely healing. I can function in everyday life without wanting to throw up or pass out from the pain,\" she wrote on social media.\n\n\"I cannot express the gravity of my emotions as I am beginning to recognise myself again.\n\nBindi Irwin with husband Chandler Powell and daughter Grace. (Supplied: Instagram)\n\n\"I felt utterly ashamed as a teenager and young adult being told that my pain was just part of being a woman.\n\n\"I felt lesser. I felt hurt. I felt weak.\"\n\nShe said others should not have to endure isolation along with the trauma caused by endometriosis.\n\n\"Young girls and women shouldn't feel alone with pain in the driver's seat of their lives,\" Ms Irwin said.\n\n\"We need to take away the stigma of talking about women's health. It's time to have open discussions and make change on a global scale.\"\n\nBindi Irwin with brother Robert. (Instagram: @robertirwinphotography)\n\nEndometriosis doesn't discriminate\n\nJessica Spain, a social worker and PhD candidate at the University of the Sunshine Coast, is researching the experiences of women and girls in regional Queensland accessing an endometriosis diagnosis.\n\nShe said it was \"so common\" for them to be dismissed or for their pain to be normalised, misdiagnosed, or mistreated.\n\nMiss Spain said it could take six to eight years to be diagnosed.\n\nAccessing care, she said, was even more challenging for those who were Aboriginal and Torres Strait Islander, transgender, non-binary, living with a disability, or in a regional area.\n\nJessica Spain says it takes too long to get diagnosed. (Supplied: Jessica Spain)\n\n\"The stigma around it has kept women under wraps for hundreds and thousands of years,\" she said.\n\n\"Females are the experts in their own bodies and we know when something's wrong.\"\n\nShe said women were often told they were being dramatic or that it was stress-related.\n\n\" Everything under the sun is thrown out as a diagnosis instead of considering that it could be endometriosis. \"\n\nMiss Spain said she found Ms Irwin's post empowering.\n\n\"Endometriosis doesn't discriminate,\" Miss Spain said.\n\n\"It's so powerful for her to speak up about that because that will resonate with so many people.\"\n\n'People can thrive'\n\nMonica Forlano, from Endometriosis Australia, said it was a full-body and potentially lifelong health condition.\n\nMonica Forlano, chair of Endometriosis Australia. (Supplied: Endometriosis Australia)\n\nShe said, historically, the female body was not studied in the same way as men's bodies.\n\n\"It essentially just comes down to medical misogyny,\" she said.\n\n\"We know so little about it, it's still a mystery, an enigma.\"\n\nShe said that through more funding, research, and awareness, the future was likely brighter for those living with the disease.\n\nMs Forlano said she hoped to see endometriosis discussed more widely in schools with boys and girls of all ages.\n\n\"It shouldn't be a life-defining condition. People can thrive,\" Ms Forlano said.\n\n\"They just need to be seen and heard and listened to.\"",
    "source": "ABC",
    "cluster_id": 16
  },
  {
    "url": "https://www.abc.net.au/news/2025-08-17/street-artist-twoone-hiroyasu-leongatha-art-cubes/105495618",
    "title": "Street artist brings world of experience to supermarket car park",
    "publish_date": "Sat, 16 Aug 2025 22:36:48 +0000",
    "category": "entertainment",
    "authors": [],
    "text": "In an otherwise unassuming supermarket car park in Gippsland, three painters lay drop sheets and go about setting up for a day's painting.\n\nTheir canvases are three industrially built cubes at the South Gippsland council offices in Leongatha, south-east of Melbourne.\n\nThe ArtCubes have been transformed into vibrant blue, red and green murals, depicting local wildlife and detailed florals, creating a striking contrast to the industrial grey backdrop of the car park.\n\nThree art cubes have been transformed as part of the program. (ABC News: Danielle Pope)\n\nInternational artist Hiroyasu Tsuri, better known as TWOONE, is the creative mind behind the project.\n\nBorn in Yokohama, Tsuri developed an interest in drawing and crafting at an early age through skateboard graphics and graffiti.\n\nIn 2004, he moved to Melbourne where he joined the underground street art scene, quickly gaining prominence as one of Australia's finest street artists.\n\nHiroyasu Tsuri adds the final touches to his art installation in Leongatha. (ABC News: Tavleen Singh)\n\nHe has since exhibited in galleries around the world, gaining prominence for mural paintings and public artworks in countries including Italy, France, Japan and Germany.\n\nTsuri said a big appeal of painting in public was the accessibility it gave to artwork.\n\n\"I believe art is quite important and a valuable thing for anyone and everyone, but if you are not working in a public space, say in traditional museums or art galleries, then the audience who comes to see your work is only the people who are actually interested in this kind of stuff,\" he said.\n\n\"When you are painting in a public space, you encounter pretty much anyone and everyone who lives in that area.\n\n\"I definitely take something from everywhere that I go when I make a public work.\n\n\"I really feel like it's an exchange, it's not just me leaving my mark.\"\n\nOne of the art cubes worked on as part of the project. (ABC News: Danielle Pope)\n\nMentoring rural creatives\n\nTsuri said he was drawn to the project as it was an opportunity to work with the next generation of artists.\n\n\"This project was a bit more special because it was asking to do a mentorship program with the local creatives and as much as I love painting public murals myself, I think I see sharing my ideas and skills and experiences that I gather along the world with other people is quite an important part of my practice,\" he said.\n\nEileen Tanaka was one of the participants chosen for the program.\n\nHaving studied art at school, her love for painting has become a hobby.\n\n\"The first day we started was terrible, it just poured for like two hours straight, so we had to go home early,\" Ms Tanaka said.\n\n\"But I guess it doesn't really matter, it affects the art in a way where it kind of makes it better because of the dripping.\n\nEileen Tanaka was one of the participants in the mentorship program. (ABC News: Danielle Pope)\n\n\" You don't really often get a chance to legally paint on a wall like this so it's pretty exciting. \"\n\nShe said the chance to work with someone of Tsuri's standard who also shared a Japanese background was a special opportunity.\n\n\"We don't have many Japanese artists around here, so having someone who has the same interests as me and is doing so well in the field and has decided to come to Gippsland … is really exciting,\" she said.\n\nEileen Tanaka and Riam Chilver have been working with Hiroyasu Tsuri. (ABC News: Danielle Pope)\n\nFellow student Riam Chilver said he loved learning new painting techniques.\n\nHe said more opportunities to engage young artists in the region would be beneficial.\n\n\"I think it would be really cool to have more mentorship kind of programs and a lot of collaborating as well on murals and public art,\" he said.",
    "source": "ABC",
    "cluster_id": 17
  },
  {
    "url": "https://www.abc.net.au/news/2025-08-17/maxwell-the-hero-in-cairns-as-aussies-win-with-one-ball-to-spare/105663738",
    "title": "Maxwell the T20I hero in Cairns as Aussies win with one ball to spare",
    "publish_date": "Sat, 16 Aug 2025 22:27:13 +0000",
    "category": "sports",
    "authors": [],
    "text": "Glenn Maxwell has produced some trademark big show heroics to lead Australia to a series-deciding two-wicket T20 International win over South Africa in Cairns.\n\nChasing South Africa's 7-172, Australia were cruising at 2-83 on the back of Mitch Marsh's 54 off 37 balls before disaster struck.\n\nAustralia lost 4-37 to put the contest back in the balance and it was anyone's game with the hosts still needing 27 runs off the final three overs.\n\nA chaotic beamer from paceman Kagiso Rabada — which sailed two metres above Maxwell's head — at the start of the 18th over was one big turning point.\n\nMaxwell thumped his free hit for six, and it looked set to be a piece of cake once the equation got whittled down to 12 runs needed from 12 balls with four wickets still in hand.\n\nThere was more drama to come, with Corbin Bosch (3-26) dismissing Ben Dwarshuis and Nathan Ellis in consecutive deliveries to catapult South Africa back into the clash.\n\nTen runs were needed off the final over, and it became four runs required off the last two balls.\n\nMaxwell kept his cool in the heat of the moment, employing a reverse whack to thump Lungi Ngidi's hip-high full toss for four to seal victory with one ball to spare.\n\nThe win secured a 2-1 T20I series victory for Australia ahead of the ODI series.\n\n\"It was a little bit nerve wracking,\" Maxwell said.\n\n\"We were down to two wickets and I knew I had to do the majority of the striking. It was nice to get a couple out of the middle right near the end.\n\n\"We've had a great run with this T20 group, so to have another series win against a quality opposition in South Africa is great for our confidence heading forward.\n\n\"I think there's another 13 or 14 internationals before the T20 World Cup, and we're building something really nicely at the moment in this group.\"\n\nEarlier, Aaron Hardie felt the full brunt of the latest onslaught from Dewald Brevis as South Africa posted 7-172.\n\nBrevis was the hero of South Africa's game-two win, cracking an unbeaten 125 off 56 balls to level the series at 1-1.\n\nThe 22-year-old was at it again on Saturday night, thumping 53 off 26 balls before being sent packing by a diving Maxwell catch in the deep.\n\nBrevis signalled his intent early in his innings by pulling Dwarshuis (0-37) onto the Cazalys Stadium roof.\n\nBut it was the 10th over — bowled by Hardie — when Brevis went into overdrive.\n\nAfter a dot ball was followed by a two, Brevis proceeded to hit four consecutive sixes from the next four legal deliveries.\n\nThe first six — over cover — bounced onto the roof and out of the stadium.\n\nBrevis sent his next six straight down the ground, with a crowd member crashing to the ground after running into a fence while trying to take a catch.\n\nThe next Hardie delivery was also sent straight down the ground — this time with no crowd injury — before the fourth was cut over cover.\n\nA total of 27 runs was taken from the Hardie over leaving South Africa well placed at 3-96 after 10 overs and 3-108 after 11.\n\nMaxwell's diving catch in the deep to dismiss Brevis proved to be a huge turning point with South Africa restricted to 62 runs from the final 8.2 overs.\n\nEllis finished with 3-31 off four overs, while leg spinner Adam Zampa was the most economical with 2-24 from his four overs.\n\nThe Australian team wore black armbands to pay tribute to former Australia Test captain and coach Bob Simpson who has died at the age of 89.\n\nA minute's silence was held before the game began.\n\nAAP",
    "source": "ABC",
    "cluster_id": 18
  },
  {
    "url": "https://www.abc.net.au/news/2025-08-17/nt-tyre-dumping-scam-shut-down-epa-investigates-waste-scheme/105643560",
    "title": "The 'nightmare' scam that illegally dumped 50 tonnes of old tyres in a yard",
    "publish_date": "Sat, 16 Aug 2025 22:23:57 +0000",
    "category": "finance",
    "authors": [],
    "text": "When Anwar Albatat returned to work after a two-week holiday, he was stunned by what had been left in his yard.\n\nA mountain of old tyres blocked his view of the tiny houses he makes.\n\nHe had had suspicions, but it was then that the realisation fully set in.\n\nThe industrial yard he rented to construct and sell homes had been used as a base for a scam.\n\nThe pile of tyres is taking up room where Mr Albatat usually builds his tiny homes. (ABC News: Roxanne Fitzgerald)\n\nOver the past six months, two Darwin businesses have been left with tonnes of tyres and a massive clean-up bill after falling victim to a tyre dumping scheme that has impacted people across Australia.\n\n\"Everything seemed to be 100 per cent genuine about [the workers sharing our yard],\" Mr Albatat said.\n\n\"They hired people … they had their own truck.\n\n\"But slowly, slowly we start to realise they were not coming here anymore.\n\n\" Alarms start to come up and we start to ask, 'What's exactly happening with these guys?' \"\n\nMr Albatat said at the beginning of the year, his landlord rented out a portion of the yard to a new tyre recycling company called Seoul Traders, which needed space to store and recycle tyres.\n\nThe Darwin business owner says the stack of abandoned tyres has left him with a costly clean-up bill. (ABC News: Roxanne Fitzgerald)\n\nProperty owner Peter Kruhse said the NT Environment Protection Authority (EPA) had granted the company a licence to recycle tyres on a commercial basis, which was a requirement under Northern Territory law.\n\n\"At first, they paid rent on time,\" the landlord said.\n\n\"Then, they pretended to pay it and they'd send me screenshots of payments … and eventually they disappeared.\"\n\nHe said phone calls went unanswered when he tried to chase them up, and he wasn't able to track the tenants down.\n\n\"It was a nightmare. I slogged in the sun for a month packing the tyres into stacks,\" Mr Kruhse said.\n\n\" No one should have to go through this heartache. \"\n\nThe scam targets businesses with stacks of worn tyres, offering discounted recycling services.\n\nOperators collect their payment, but then abandon the tyres at rented lots or backyards and vanish with the cash.\n\nThe property's landlord said he \"slogged in the sun for a month\" stacking the discarded tyres. (ABC News: Roxanne Fitzgerald)\n\nOperator suspended\n\nIn May, interstate authorities alerted the NT Environment Protection Authority (EPA) to the scam after it had taken place in other jurisdictions — sparking an investigation.\n\nThe EPA went to the site to carry out an inspection on Seoul Traders, and found it was breaching a number of licence conditions.\n\nIn June, the EPA suspended their licence.\n\nRecycling tyres in the NT is an expensive process, despite a growing overseas market for the shredded rubber and steel. (ABC News: Roxanne Fitzgerald)\n\n\"Seoul Traders was granted an environment protection licence in March,\" a spokesperson told the ABC.\n\n\" At the time of granting the licence, the NT EPA had no intelligence about an alleged scam being run. \"\n\nThe spokesperson said the EPA checks the business records of applicants and asks if they have held licences or committed environmental offences previously, and Seoul Traders met the basic ASIC requirements to get an ABN and operate in Australia.\n\nIn 2020, thousands of old tyres were illegally dumped at vacant land lots and in the backyards of rented homes across Western Australia, prompting authorities to issue warnings about the scam.\n\nFooting the clean-up bill\n\nMr Kruhse estimated the company left around 50 tonnes of tyres on his Darwin lot, which could cost him over $30,000 to dispose of.\n\nIn May, NTEX — a legitimate recycling company in Darwin — was also targeted.\n\nPaul Wilson, the company's facility manager, said the scammers organised to pay for around 20 tonnes of tyres to be recycled.\n\nPaul Wilson, from NTEX, says an initial check of the scammer's credentials didn't show any cause for concern. (ABC News: Roxanne Fitzgerald)\n\nHe said NTEX also checked the company's credentials and found there was \"no reason to question this particular client\".\n\nBut after the tyres were dropped off, NTEX never heard from them again, and the bill was never paid.\n\nMr Wilson said after numerous attempts to contact the company, NTEX decided to take the tyres back to the address they had on file: Mr Kruhse's property where Anwar Albatat makes his tiny homes.\n\nAnwar Albatat and Peter Wilson estimate up to 50 tonnes of tyres were left for them to clean up. (ABC News: Roxanne Fitzgerald)\n\nRecycling tyres in the NT is an expensive and complex process, despite the growing overseas market for the shredded rubber and steel.\n\nIt now costs more than $1,000 for a commercial business to dispose of a tonne of tyres at the NT's main waste facility, and there are only a few cheaper options like NTEX, which charges $610 per tonne.\n\nMr Wilson said the steep rise in costs had led to a surge in illegal tyre dumping across Australia.\n\n\"There is money to be made and I could certainly understand the appetite of scammers to be in that particular scam,\" he said.",
    "source": "ABC",
    "cluster_id": 19
  },
  {
    "url": "https://www.smh.com.au/sport/nrl/southwell-binned-for-dangerous-tackle-20250817-p5mnki.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Southwell binned for 'dangerous' tackle",
    "publish_date": "Sun, 17 Aug 2025 12:14:45 +1000",
    "category": "sports",
    "authors": [],
    "text": "Southwell binned for 'dangerous' tackle\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 20
  },
  {
    "url": "https://www.smh.com.au/national/tubby-pays-tribute-to-bob-simpson-20250817-p5mnjz.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Tubby pays tribute to Bob Simpson",
    "publish_date": "Sun, 17 Aug 2025 11:55:29 +1000",
    "category": "finance",
    "authors": [],
    "text": "Tubby pays tribute to Bob Simpson\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 21
  },
  {
    "url": "https://www.smh.com.au/culture/live-reviews/headbanging-and-handstands-as-hometown-heroes-go-hard-at-tour-closer-20250809-p5mlmt.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Mozart’s ‘Abduction’ gets a wildly modern makeover",
    "publish_date": "Sun, 17 Aug 2025 11:32:39 +1000",
    "category": "entertainment",
    "authors": [
      "Barney Zwartz",
      "Andrew Fuhrmann"
    ],
    "text": "MUSIC\n\nTakács Quartet with Angie Milliken ★★★★★\n\nMusica Viva, Melbourne Recital Centre, August 14 In a very welcome return to Melbourne, the Takács Quartet reaffirmed itself as probably the best string quartet on the planet. Takács Quartet perform at Melbourne Recital Centre, August 14. 2025. Credit: Cameron Jamieson Haydn’s Quartet in G minor, Op. 74, No. 3 was a splendid curtain-raiser, showcasing the group’s burnished, multifaceted tone. Like looking into a gemstone, there were flashes of brilliance but beguiling depths of colour. After revelling in the quick-witted interplay of parts in the first movement, there came a superbly controlled second-movement choral. So ebullient was the finale that the audience burst into applause before the end. Brisbane-born, Berlin-based composer Cathy Milliken’s Sonnet of an Emigrant after Bertolt Brecht for narrator and string quartet was commissioned for Musica Viva’s 80th anniversary season. In marrying Brecht’s poetry of displacement with fragmented reminiscences of the Viennese modernism with which many musical refugees would have been familiar, Millikin has created an evocative meditation on loss and new beginnings. The empathetic narration by the composer’s sister Angie Milliken alternated between English and German, underlining a loss of belonging.\n\nAt the heart of the program was Beethoven’s String Quartet in C major, Op. 59, No. 3. The vastly different timbres of the first two chords signalled that this would be an engrossing account. Indeed, it riveted listeners for some 30 minutes. Loading After the initial brilliance of C major, it was hard not to swoon to the ensuing Andante, beautifully underpinned by András Fejér’s cello. A vividly contrasted Menuetto led directly into the fugato finale, taken at breakneck speed and overflowing with energy and excitement. A generous encore, the second movement of Ravel’s String Quartet, captivated not only with its exquisite elegance but with the most luscious pizzicato anyone could hope to hear this side of the pearly gates. Such heavenly music making really does put the Takács Quartet in a class of its own.\n\nReviewed by Tony Way\n\nMUSIC\n\nElevator Music ★★★★\n\nOmega Ensemble, Melbourne Recital Centre, August 16 Despite the tenuous link between elevators and this Omega Ensemble program, most of the music seemed to be chosen to lift listeners’ spirits. Loading Elevator Music is the title of a jazz-infused work by Adelaide-based composer Graeme Koehne, which (confusingly) was not performed. Keohne, however, provided a new work for orchestra and two clarinets to showcase the talents of English virtuoso Michael Collins and Omega’s artistic director David Rowden. Dances on the Edge of Time (a title derived from poetry by Rabindranath Tagore) consists of three movements (a rigaudon, a chaconne and a gigue), each tagged with a phrase from the popular aphorism attributed to baseballer Leroy “Satchel” Paige: “Work like you don’t need the money, love like you’ve never been hurt and dance like nobody’s watching.”\n\nCollins and Rowden, along with the rest of the ensemble, willingly followed Paige’s advice. Surmounting a buoyant rhythmic accompaniment, the ascending solo lines of the Rigaudon radiated a carefree approach. Classic gestures in the chaconne spoke of loss then love, while the concluding gigue hinted at the rustic style of Australian musical larrikin Percy Grainger. Koehne’s concerto was preceded by the instantly recognisable Allegro from Mozart’s Eine Kleine Nachtmusik, whose jollity stood in stark contrast to Stride by American composer Anna Clyne. Drawing material from Beethoven’s Pathetique Sonata, Clyne’s often busy and astringent soundscape created episodes of tension and release. Originally written for swing jazz legend Benny Goodman, Aaron Copland’s Clarinet Concerto, with its masterly writing for both orchestra and soloist, was brilliantly executed by Collins. Effortlessly negotiating its melodious languor and its infectious rhythmic energy, Collins happily and vividly brought the music alive in time and space. Arranged for two clarinets, the final movement from Elena Kats-Chernin’s Ornamental Air proved the perfect encore, taking the mood, as it were, to the top floor.\n\nReviewed by Tony Way\n\nMUSIC\n\nPress Club ★★★★\n\nCorner Hotel, August 8 “You should see the piece of skin hanging off my shin,” says Press Club singer Natalie Foster of the blood trickling down her leg, just four songs in. “It scared me. I’ve only seen that once before when I was 18 and fell off a construction site drinking tequila.” Press Club perform at the Corner Hotel on Friday, August 8. Credit: Martin Philbey This banter could be a manifesto for her jangly, garage-punk quartet. Misadventures and big emotions, testing limits and returning home to report on them: they’re key themes throughout the Brunswick group’s catalogue. Since their debut in 2017, the staunchly DIY Press Club have been on a tear – stomping across world stages and releasing four LPs in quick succession. Tonight they’re launching their latest, the sugary punk sheen of To All the Ones I Love. It also makes for an emotional homecoming, laced with a slight hint of exhaustion, to close the band’s 10-week, 30-date European and Australian tour.\n\nFollowing a walk-on to the moody I Am Everything, Press Club throw everything at it. “We’re from Melbourne,” says Foster before a blistering Cancelled. “Feels f---ing good to be playing our hometown.” The gig served as both an album launch and an emotional homecoming for the band. Credit: Martin Philbey The celebratory Headwreck ignites the first singalong, and from there it’s over to Foster to pull focus – be it via bloody injuries or her incredible voice, which retains its husky, impeccably roaring croon even when she’s mid-headbang, pulling a handstand mid-verse of Coward Street, or lost deep in the crowd. Around her the band sizzles on Greg Rietwyk’s relentlessly melodic guitar lines, Iain MacRae’s excellent burbling bass and the breakneck drumming of Timmy Hansen, filling in for founding member Frank Lees, who’s on parental leave. Dynamics of a punk show can be tricky – if every song allegedly inspires catharsis, after a while the stakes don’t seem as high. Press Club mitigate this with clever stylistic detours. Mid-show highlight Untitled Wildlife features Stu Patterson from support band Placement lend wailing saxophone to an indie-rock build that culminates in real anthemic alchemy. Suburbia, from the band’s debut, Late Teens, remains the perfect set closer, Foster yelling, “I can’t relate to letting all your dreams go”, while instructing the crowd to launch themselves one last time.\n\nBack for an encore, Foster takes the dying minute of joyous, Smiths-y closer Wilt to jump into the crowd and make her way over to help out at the merchandise desk. As we file out, she’s there keeping the dream alive.\n\nReviewed by Marcus Teague DANCE\n\nPhantasm ★★★\n\nChunky Move Studios, until August 16 The title of Melanie Lane’s new show suggests a singular, self-contained vision. In the event, however, it unfolds as a plurality of figments and counterfeits drawn from the archives of popular culture with only the loosest thematic connection. The setting is impressive. Working with designers Eugyeene Teh and Bosco Shaw, Lane constructs a wonderfully gothic space enclosed by solid walls of darkness, filled with haze and crossed with scrims. Phantasm takes place in a wonderfully gothic space. Credit: Gregory Lorenzutti\n\nA lone dancer drops into this lowermost dungeon of the mind. She bites the head off a rat, blood running over her chin, then jerks and twitches, hands vibrating like a plucked string. It’s a strong opening, with the promise of something visceral, bloody and unexpected: a feminine nexus of death, desire and horror, darkly animate. Yet little of this intensity carries through the rest of the work. Phantasm, the title of Melanie Lane’s new show, suggests a singular, self-contained vision. Credit: Gregory Lorenzutti We move through predictable variations: exotic dancers, demonic cheerleaders, gothic heroines, romantic ballerinas, witches on broomsticks. Some, like the witches suspended above the stage, are more interesting than others. They are all, however, fairly generic images. They’re types or figures, mythic only in the rather desolate sense that they are overexposed: tropes of femininity endlessly adapted and exploited by mass culture.\n\nWe rely on the movement to give these figures new relevance, and to provide the thread that might bind them into a collective phantasm. This doesn’t happen. Instead, the dance often settles into familiarity. Costumes are exiguous and change often: witches’ rags give way to tinselled cheer skirts, then tutus. Only mushroom-coloured bodystockings remain constant, giving, at a squint, the illusion of nudity. Loading In the final scene, the bodystocking is also stripped away. The setting shifts to a primeval forest where the women exchange gestures of care. The implication seems to be that this is the real myth behind the others: a return to some essentialised, pastoral femininity. I’m not convinced. This image of the natural woman seems just as constructed and just as overexposed as the others. Does Lane really intend this as a return to the body in its purest form? Surely this is just another costume to be sloughed?",
    "source": "SMH",
    "cluster_id": 22
  },
  {
    "url": "https://www.smh.com.au/sport/nrl/haas-opens-up-on-defection-to-samoa-20250817-p5mnk3.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Haas opens up on defection to Samoa",
    "publish_date": "Sun, 17 Aug 2025 11:30:41 +1000",
    "category": "finance",
    "authors": [],
    "text": "Haas opens up on defection to Samoa\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 23
  },
  {
    "url": "https://www.smh.com.au/national/australian-cricket-mourns-death-of-bob-simpson-20250816-p5mnh7.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Australian cricket mourns death of Bob Simpson",
    "publish_date": "Sun, 17 Aug 2025 11:29:21 +1000",
    "category": "sports",
    "authors": [],
    "text": "Australian cricket mourns death of Bob Simpson\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 24
  },
  {
    "url": "https://www.smh.com.au/national/queensland/toowong-s-old-woolies-site-to-become-brisbane-s-newest-urban-village-20250817-p5mnjc.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Toowong’s old Woolies site to become Brisbane’s newest urban village",
    "publish_date": "Sun, 17 Aug 2025 11:28:21 +1000",
    "category": "finance",
    "authors": [
      "Cameron Atfield"
    ],
    "text": "A new urban renewal development in Brisbane’s inner-west would tower over Toowong and transform the suburb with a mixed-use precinct.\n\nThe three-tower complex would include a “Central Plaza” that would host pop-up markets and artistic displays, along with retail tenancies, according to plans lodged with the council.\n\nThe now mostly vacant site across the road from Toowong Village and the train station was home to a standalone Woolworths supermarket until 2017.\n\nThe three planned towers of 58, 55 and 49 storeys would be more than double the 25 storeys allowed under the council’s Toowong-Auchenflower Neighbourhood Plan. Credit: KHA\n\nIn an assessment report prepared on behalf of the developers, Toowong Central Investment Holding Pty Ltd, town planning firm Urbis says the three-tower scheme made efficient use of the irregularly shaped block, which fronts onto High Street, Sherwood Road and Jephson Street.",
    "source": "SMH",
    "cluster_id": 25
  },
  {
    "url": "https://www.smh.com.au/sport/nrl/crichton-weighs-on-r360-whispers-20250817-p5mnk0.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Crichton weighs on R360 'whispers'",
    "publish_date": "Sun, 17 Aug 2025 11:19:15 +1000",
    "category": "finance",
    "authors": [],
    "text": "Crichton weighs on R360 'whispers'\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 26
  },
  {
    "url": "https://www.smh.com.au/sport/afl/aflw-weekly-live-round-one-blues-pies-name-teams-for-season-opener-20250813-p5mmlw.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "AFLW round one: Harris sent to hospital with eye injury; Bombers thump Giants",
    "publish_date": "Sun, 17 Aug 2025 10:17:30 +1000",
    "category": "sports",
    "authors": [
      "Hannah Kennelly",
      "Roy Ward",
      "Melissa Coulter Ryan"
    ],
    "text": "Tayla Harris wasn’t in the game long before suffering an eye injury but did have time to take a trademark speccy. Credit: Getty Images\n\nStar Melbourne ruck-forward Tayla Harris had her AFLW season debut cut short due to an eye injury, but it didn’t stop her Demons dominating the Bulldogs on Saturday night.\n\nAn Olivia Purcell masterclass propelled Melbourne to a dominant 48-point win at Whitten Oval. She finished with a monster haul of one goal, 33 disposals and seven clearances to help the Demons steamroll the hosts 9.8 (62) to 1.8 (14) and retain the Hampson-Hardeman Cup.\n\nBut the Demons didn’t come out of their fourth straight win over the Bulldogs unscathed.\n\nHarris showed glimpses of her All-Australian best in her first game back from a shoulder injury, before being forced out in the second quarter.\n\nAfter pulling off a trademark speccy just moments earlier, Harris copped an arm to her face in a marking contest with Bulldogs counterpart Alice Edmond.\n\nCoach Mick Stinear said after the game that Harris was being assessed at the eye hospital.\n\n“She’s doing OK but just probably in the best possible hands,” Stinear said.\n\n“I think we needed to send her there to get proper treatment but she’s doing OK … I’m not expecting anything too sinister there, but certainly needed expert attention.”\n\nThe 28-year-old Harris only played one game last year, requiring surgery after hurting her left shoulder. Melbourne, semi-finalists the previous year, missed the top eight in her absence.\n\nTyla Hanks was just as busy on Saturday with 29 disposals, and kicked two goals to match Kate Hore and Eden Zanker.\n\nThe Western Bulldogs had their own returning star, with former skipper Ellie Blackburn collecting 17 touches through managed minutes.\n\nBlackburn was limited to three games last season before hurting her foot.\n\nJasmyn Smith was the Bulldogs’ main ball winner with 21 disposals.\n\nAAP",
    "source": "SMH",
    "cluster_id": 27
  },
  {
    "url": "https://www.smh.com.au/sport/aussie-stunned-in-world-title-fight-20250817-p5mnji.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Aussie stunned in world title fight",
    "publish_date": "Sun, 17 Aug 2025 10:08:51 +1000",
    "category": "sports",
    "authors": [],
    "text": "Aussie stunned in world title fight\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 28
  },
  {
    "url": "https://www.smh.com.au/national/victoria/locals-love-this-strip-but-some-of-its-most-famous-stores-are-leaving-20250813-p5mmmv.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Locals love this strip, but some of its most famous stores are leaving",
    "publish_date": "Sun, 17 Aug 2025 10:00:00 +1000",
    "category": "finance",
    "authors": [
      "Gemma Grant"
    ],
    "text": "Just a few kilometres from the CBD, Rathdowne Village has a timeless country town feel that people love. But as rising costs and slowing trade prompt a handful of businesses to close or move on, locals fear the shopping strip has become too quiet for its own good.\n\nLocated in Carlton North along the street of the same name as the village, it is the main shopping hub in the inner-city suburb, replete with lush green median strips, wide bike lanes and the open space of Curtain Square.\n\nThe northern end of Rathdowne Village. Credit: Simon Schluter\n\nEmpty storefronts are becoming increasingly common in the otherwise busy strip. The top end has been hit hardest, with some heritage facades growing tired and slowly collecting graffiti.\n\nConnor Cunliffe opened Fledgling Café in Rathdowne Village’s north in 2017. He made the difficult decision to close the business last month, citing rising costs, slowing trade and burnout. While his original plan was to shut down completely, he was happy to find a last-minute buyer.",
    "source": "SMH",
    "cluster_id": 29
  },
  {
    "url": "https://www.smh.com.au/national/more-tremors-on-the-way-after-queensland-earthquake-20250817-p5mni7.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "More tremors on the way after Queensland earthquake",
    "publish_date": "Sun, 17 Aug 2025 09:34:18 +1000",
    "category": "finance",
    "authors": [],
    "text": "More tremors on the way after Queensland earthquake\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later. Dismiss\n\nOur network\n\nOpen Navigation Menu The Sydney Morning Herald",
    "source": "SMH",
    "cluster_id": 30
  },
  {
    "url": "https://www.smh.com.au/politics/federal/australians-are-choosing-to-travel-to-asia-over-the-us-it-s-not-because-of-trump-20250815-p5mnb7.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Australians are choosing to travel to Asia over the US. It’s not because of Trump",
    "publish_date": "Sun, 17 Aug 2025 09:30:00 +1000",
    "category": "finance",
    "authors": [
      "Millie Muroi"
    ],
    "text": "Japan, China and Vietnam are fast becoming the top travel destinations for Australians, with fewer residents flying to the United States than before the pandemic.\n\nAccording to Australian Bureau of Statistics data released last week, the number of Australian residents visiting Japan nearly doubled from about 484,000 in 2018-19 to more than 910,000 in 2024-25, making it the third most popular destination for Australian travellers, overtaking the US.\n\nJapan is now the third most popular destination for Australian travellers. Credit: Getty Images\n\nWhile China, Vietnam and Indonesia also recorded continued growth, with the latter – attracting 1.7 million visitors – remaining Australia’s most popular overseas destination, fewer than 750,000 Australian residents chose to travel to the US.\n\nThat figure was up on 714,000 the previous financial year but remained lower than the nearly 1.1 million who travelled to the States in 2018-19, before the pandemic.",
    "source": "SMH",
    "cluster_id": 31
  },
  {
    "url": "https://www.smh.com.au/sport/athletics/pretty-sick-new-national-record-for-australian-middle-distance-star-20250817-p5mnis.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "This Australian runner just set a new national record. She thinks it’s ‘pretty sick’",
    "publish_date": "Sun, 17 Aug 2025 09:29:32 +1000",
    "category": "sports",
    "authors": [
      "Michael Gleeson"
    ],
    "text": "Claudia Hollingsworth just broke the national 800m record. It was “pretty sick”.\n\nIf you don’t know her, Claudia is 20. That’s also pretty sick.\n\nIf you don’t know her, firstly that’s a shame. But you also will get to know her, for the girl – sorry, woman now – from bayside Melbourne is a bona fide emerging star. Gout Gout isn’t the only young champion athlete in this new golden era of Australian athletics.\n\nA month out from the world athletics championships in Tokyo the Diamond League meet in Silesia was a legitimate preview to Tokyo and an announcement by Hollingsworth of her station in things.",
    "source": "SMH",
    "cluster_id": 32
  },
  {
    "url": "https://www.smh.com.au/sport/soccer/richarlison-scores-goal-of-the-season-contender-20250817-p5mnj0.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Richarlison scores 'goal of the season' contender",
    "publish_date": "Sun, 17 Aug 2025 09:24:01 +1000",
    "category": "sports",
    "authors": [],
    "text": "Richarlison scores 'goal of the season' contender\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 33
  },
  {
    "url": "https://www.smh.com.au/sport/soccer/rapid-recap-mw1-aston-villa-vs-newcastle-20250817-p5mnj3.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Rapid Recap | MW1: Aston Villa vs Newcastle",
    "publish_date": "Sun, 17 Aug 2025 09:19:23 +1000",
    "category": "sports",
    "authors": [],
    "text": "Rapid Recap | MW1: Aston Villa vs Newcastle\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 34
  },
  {
    "url": "https://www.smh.com.au/sport/rugby-union/jordan-carves-up-argentina-defence-20250817-p5mniz.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Jordan carves up Argentina defence",
    "publish_date": "Sun, 17 Aug 2025 09:09:27 +1000",
    "category": "finance",
    "authors": [],
    "text": "Jordan carves up Argentina defence\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 35
  },
  {
    "url": "https://www.sbs.com.au/news/article/culturally-appropriate-aged-care-food/wmxk38cw2",
    "title": "'Feels like being back home': Is goulash the secret to this aged care facility's success?",
    "publish_date": "Sun, 17 Aug 2025 01:19:57 +0000",
    "category": "finance",
    "authors": [],
    "text": "When Magdalena Klopfer was preparing to move into a residential aged care facility 11 years ago, she was nervous about the change. But there was one thing she wasn’t worried about: the food.\n\n\n\n\n\n\"They were cooking the same as I was cooking at home,\" she says.\n\n\n\n\n\nMagdalena, who turns 100 next week, is a resident at Árpád — a 62-bed Hungarian aged care facility in Melbourne’s east. On the menu is a range of Hungarian specialties including székelykáposzta (sauerkraut goulash), húsleves (a clear broth soup with beef or chicken and vegetables), and túrós csusza (pasta with cottage cheese and fried bacon on top). On special occasions, they will indulge in pálinka, a Hungarian-style schnapps.\n\n\n\n\n\n\"I eat it all,\" she says.\n\n\n\n\n\nSitting by her side, Eva Paldy, 88, explains that Christmas feasts at the facility are an especially exciting time.\n\n\n\n\n\n\"It's absolutely beautiful,\" she says, listing the strudels and pastries that are prepared for the holidays.\n\n\n\n\n\n\"Are you getting hungry?\"\n\n\n\nAt Christmas, the Hungarian chef at Árpád Aged Care prepares beigli, a sweet bread with poppy seed or walnut filling. Source: Supplied / Árpád Aged Care In Australia, around 185,00 people aged 65 and over are currently living in residential aged care facilities across the country. Despite improvements to aged care facilities following the Royal Commission into Aged Care Quality and Safety, rates of malnutrition are still high, with one 2024 study from Griffith and Monash Universities suggesting four in 10 residents are still not getting enough nutrition.\n\n\n\n\n\nBut as our diverse population ages, there is growing awareness that culturally appropriate food can make a significant contribution to improving rates of malnutrition, while also increasing overall wellbeing and quality of life.\n\n\n\nMeals that spark joy\n\nIn 2021, the royal commission stated that access to adequate food is a fundamental human right. Its final report identified food quality as a key problem requiring immediate attention, citing one Victorian study that found 68 per cent of homes surveyed had residents who were malnourished or at risk of malnourishment.\n\n\n\n\n\nCherie Hugo is the founder of Lantern Alliance, which is dedicated to improving the quality of life for older Australians through food. She says that four years on from the report, and despite many positive government initiatives driving improvement in the sector, the problem of malnutrition is still \"way bigger than it should be\".\n\n\n\n\n\n\"There's so many reasons why malnutrition is important. It increases health complications. It increases the risk of fall by eight times. It increases pressure injuries, hospitalisations, infections and cognitive decline,\" she says.\n\n\n\nHugo says budget constraints play a role, as does a lack of training for kitchen staff. But one overlooked factor is how dietary requirements change as we get older.\n\n\n\n\n\n\"An older person's protein needs are on par with what you would see for an athlete. But the problem that also happens as we get older is our appetites decrease. So the problem is they're needing more protein, but not feeling as hungry.\"\n\n\n\n\n\nThe issue was highlighted this week by Maggie Beer at a speech given at the National Press Club. The famous former chef was inspired to start the Maggie Beer Foundation to advocate for improved nutrition after visiting a number of facilities where she was \"often appalled\" by the food that was served there.\n\n\n\nFormer chef Maggie Beer spoke at the National Press Club on Wednesday where she described seeing \"appalling\" food being served in some aged care facilities. Source: AAP / Mick Tsikas \"What was missing was not only the joy in food, but the real belief in most places that beautiful food will make such a difference to the wellbeing of residents and pride of the teams,\" she said.\n\n\n\n\n\nBeer said that some of the best food she's eaten in aged care facilities were ones with strong links to countries with vibrant food cultures, such as the Italian, Greek and Vietnamese communities.\n\n\n\n\n\nHugo agrees that enjoyable food that connects with a person's cultural identity is a \"huge uplift to resident satisfaction\".\n\n\n\n\n\n\"Food is a reflection of identity, it triggers memories, particularly when you have residents living with dementia. It's something that can bring that spark back.\"\n\n\n\n\n\nResidents are also more likely to finish a meal and subsequently not lose weight, which Hugo says is crucial to older people's overall health as they age.\n\n\n\nMore than meatballs\n\nTasty and culturally appropriate food can bring other benefits too.\n\n\n\n\n\nWhile living in an Italian-focused aged care facility during her PhD research, Hugo saw that a successful meal was about more than its nutritional content.\n\n\n\n\n\n\"I remember having a meatball dish that was just delicious. But the thing that hit me was that often in an aged care space, it’s not a noisy space. But what really struck me at this one home were the animated conversations in Italian.\"\n\n\n\n\n\nIt appeared people were shouting at each other but Hugo discovered it was a heated debate about what constitutes the perfect meatball recipe.\n\n\n\n\n\n\"The food is there to nourish, but there's that social connection too. It's a social lubricant if you have a great meal or you see the menu displayed and people get excited, that in itself elicits conversation,\" she says.\n\n\n\nA traditional Hungarian székelykáposzta or sauerkraut goulash, where the fermented cabbage is cooked with the meat and served with a dollop of sour cream on top. Source: Supplied / Árpád Aged Care Similarly, at the Árpád facility in Melbourne, meal times are social events. Magdalena says that her daughter will often join her for dinner so they can enjoy the food together. They are planning to do so again next week for her 100th birthday.\n\n\n\n\n\n\"She has said to me she likes to come here and eat because it feels like being back home, like the restaurants in Budapest.\"\n\n\n\nRisottos against social isolation\n\nThere are also a growing number of culturally appropriate options catering to the older Australians who want to continue living independently at home.\n\n\n\n\n\nIn Adelaide, not-for-profit initiative Nonna's Cucina delivers home-cooked Italian food to 500 clients.\n\n\n\n\n\nCEO Marco Staltari says the service started 26 years ago out of concern for older members of the Italian community who were struggling to cook for themselves, and the meal services on offer \"didn’t really suit Italian tastebuds\".\n\n\n\n\n\nThey emphasise flavours that Italian migrants grew up with. Traditional creamy risottos cater to those with northern Italian heritage. For Italian Australians with heritage from the south, they prepare pipi e patate, a dish of capsicum and potatoes. They also provide texture-modified foods to support people who are at higher risk of choking.\n\n\n\nAdelaide-based charity Nonna's Cucina delivers 500 home-style Italian meals daily and helps to reduce social isolation for older members of the community staying at home. Source: Supplied / Nonna's Cucina \"When people are older and lose a bit of their memory, these flavours always bring you back to your home.\"\n\n\n\n\n\nTheir menu rotates every five weeks, which general manager Dario Fabretto says provides their clients more choice.\n\n\n\n\n\n\"When you get older and you can’t cook for yourself as much anymore, you might feel a bit hard done by or that it’s unfair that you can’t cook. And then you get told what you have to eat. So we try to provide as much variety as we can,\" Dario says.\n\n\n\nA feeling of home\n\nHugo says that being able to choose your meals, and feeling as if your preferences are being listened to, makes a significant impact in the quality of life for older Australians.\n\n\n\n\n\n\"It's about residents feeling like their preferences are heard and understanding that they feel safe and can share their feedback. [This] links to a sense of maintaining your agency and having a voice and input into your community ... It's what it is to be human.\"\n\n\n\n\n\nBack at Árpád Aged Care in Melbourne, Eva says she values the familiarity of home-cooked Hungarian meals.\n\n\n\n\n\n\"When you're young, you don't think about these things, but when you're getting older and your time is over, you are just looking for a place where you belong.\"\n\n\n\n",
    "source": "SBS",
    "cluster_id": 36
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/interview-fossil-finds-add-ancestors-and-a-puzzle-to-our-human-family-tree/w7rl9sxo1",
    "title": "INTERVIEW: Fossil finds add ancestors - and a puzzle - to our human family tree",
    "publish_date": "Sat, 16 Aug 2025 21:00:00 +0000",
    "category": "finance",
    "authors": [],
    "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
    "source": "SBS",
    "cluster_id": 37
  },
  {
    "url": "https://www.sbs.com.au/news/article/personal-e-scooter-accidents-are-increasing-what-are-the-laws/ayhfyruih",
    "title": "Michael's daughter died while riding an e-scooter. He's calling for better regulation",
    "publish_date": "Sat, 16 Aug 2025 20:32:32 +0000",
    "category": "finance",
    "authors": [],
    "text": "The topic of e-scooters is a difficult one for Michael Seculovic.\n\n\n\n\n\nEarlier this month, he marked what would have been his daughter Ava's 15th birthday.\n\n\n\n\n\nShe died last year after being hit by a car while riding her e-scooter across a busy road in Perth.\n\n\n\n\n\nIn her dad's mind, Ava will always remain that 13-year-old girl on the precipice of taking on the world.\n\n\n\n\n\nShe had recently started at a new high school, which Seculovic was chuffed about, as it was the same school he had attended.\n\n\n\n\n\n\"She was a bright, beautiful girl,\" he tells SBS News.\n\n\n\nMichael Seculovic's daughter Ava was 13 years old when she died from severe head injuries sustained in an accident on her e-scooter. Source: Supplied / Michael Seculovic \"She was very friendly; it didn't matter who it was, when anyone came up to her and said 'hello, how are you?' she always replied with 'good, thank you. How are you?'\n\n\n\n\n\n\"She was just beautiful.\"\n\n\n\n\n\nAva had received her scooter as a Christmas present just a few months before the accident.\n\n\n\n\n\nSeculovic says he had nagged her and her friends to wear helmets many times, as required by state law in Western Australia, but it was often a struggle.\n\n\n\n\n\n\"It wasn't from a lack of trying, I had went and purchased another helmet, as she had said that she didn't like the one she had,\" he says.\n\n\n\n\n\n\"But also, no one else was wearing a helmet, and like many girls, they are worried about their hair.\"\n\n\n\nREAD MORE Call for scooter ban after Brisbane death\n\nTragically, Ava wasn't wearing one at the time of the accident.\n\n\n\n\n\nSeculovic has spent the past year reflecting on the regulations around e-scooters. He admits he wasn't fully aware of the legalities before his daughter's death.\n\n\n\nI was just going about everyday life, that was not really ever in front of me to know about.\n\nFor young people, e-rideables, such as e-scooters and e-bikes, represent an affordable and accessible means of transport — they are significantly cheaper than a car and can be used without a licence. Seculovic says he felt it offered his daughter some much-needed independence.\n\n\n\n\n\n\"It was her second year of high school, and she just wanted to have that sort of independence teenagers want,\" he says.\n\n\n\n\n\nBut as the devices have become more and more popular in Australia, so has debate over how to regulate them.\n\n\n\nAre e-bikes and e-scooters safe?\n\nParliamentary inquiries into e-rideables are taking place in WA and Queensland, following a rise in related accidents. Both will consider the benefits of the devices against issues regarding safety, regulation, enforcement and penalties.\n\n\n\n\n\nThe NSW government announced this week it is considering a temporary ban on the devices on public transport, pending community feedback, following two incidents in NSW and Victoria earlier this year, which involved e-rideable batteries catching fire.\n\n\n\n\n\nDeputy director of Monash University's Accident Research Centre (ARC), Professor Jennie Oxley, says incident rates have risen as the number of e-rideable users has grown.\n\n\n\n\n\n\"The rates of injuries and deaths are increasing, and a big part of that is exposure [in traffic and public spaces], because these e-rideables are becoming popular, of course we're going to see increased numbers of injuries,\" she says.\n\n\n\nREAD MORE Making a short trip? Why mopeds could be better for the environment than electric cars\n\nComparable state-based statistics on e-scooter-related injuries are not readily available.\n\n\n\n\n\nHowever, the ARC collects data on emergency department presentations and hospital admissions related to e-mobility devices, which Oxley says mirrors the situation across Australia.\n\n\n\n\n\nIn Victoria, between July 2017 and June 2023, there were 1,680 emergency department presentations related to e-scooter injuries.\n\n\n\n\n\nDuring the same period, e-scooter injury rates increased from 0.3 to 14.9 per 100,000 people, says Oxley, adding that the rate would likely have increased with the growth of e-scooter use over the past two years.\n\n\n\nThe Victorian data did not specifically break down deaths related solely to e-scooters; instead, it listed 14 deaths as a result of all e-mobility devices between 2016 and 2020, with half of these related to e-bikes, while the rest related to other self-balancing devices, including e-scooters.\n\n\n\n\n\nWA Police confirmed it had recorded one death related to e-scooters in 2023 and three in 2024.\n\n\n\n\n\nIn a submission to the inquiry into e-mobility safety in Queensland, the Australian Centre for Health Law Research said e-scooter incidents had resulted in at least eight deaths in Queensland in 2024.\n\n\n\n\n\n\"Between January 2021 and December 2024, 4,902 people presented to 31 Queensland participating emergency departments with injuries from e-scooter incidents, resulting in eight deaths in 2024 alone,\" it reads.\n\n\n\n\n\n\"These figures likely underestimate the true toll, as not all Queensland hospitals contribute data, and not all injured individuals seek treatment.\"\n\n\n\nAs more people use e-scooters, the incidents related to riding them have increased. Source: AAP / Luka Coch The submission noted that common injuries include fractures, dislocations and head trauma.\n\n\n\n\n\nSeculovic's daughter Ava suffered serious head injuries as a result of her accident in March 2024, which she later succumbed to.\n\n\n\n\n\nWhile laws in WA ban those under 16 from riding e-scooters on roads in Australia, it is not uncommon to see children in their early teens out and about in the suburbs of Perth on e-scooters.\n\n\n\nGrowing popularity of e-rideables\n\nDespite the risks, experts say e-rideables are here to stay.\n\n\n\n\n\nA 2023 report by cycling advocacy group WeRide Australia found that 3.6 million Australians had used an e-scooter in 2022 and that per capita usage was highest in WA and the ACT.\n\n\n\n\n\nThe increasing affordability of e-scooters in recent years has also fuelled growth in the number of Australians using them.\n\n\n\nWhile it is illegal to travel on an e-scooter with more than one person, it has become common practice to do so in some parts of Australia. Source: Getty / Steve Waters While some high-end models may set you back around $5,000, a new e-scooter can cost as little as $500.\n\n\n\n\n\nOxley says while e-rideables are largely used by people commuting to and from work or study, gig-economy workers, such as food and mail delivery drivers, also rely heavily on them.\n\n\n\nAround one in five Australians used an e-scooter in 2022. Source: SBS News Estimates compiled by University of Sydney professor of transport management Stephen Greaves indicate that Australians own about 400,000 personal e-scooters and mobility devices.\n\n\n\n\n\nThis is in addition to the thousands of e-mobility devices operating via share-ride schemes, which have been implemented in every capital city and across more than 25 local government areas.\n\n\n\n\n\nGreaves says they are a \"genuine alternative to motorised transport\".\n\n\n\n\n\n\"E-mobility devices, including scooters, open up the possibility for many of those trips that are maybe 2-5 kilometres, where you think, 'why are people driving cars for such distances?'\" he says.\n\n\n\n\n\nAustralian Electric Vehicle Association president Chris Jones says the boom in electric personal mobility is transformative and should be supported.\n\n\n\n\n\n\"These are some of the most accessible and affordable electric vehicles in the world, and they take up a fraction of the space of a car,\" he says.\n\n\n\nWe should be encouraging their uptake with sensible regulation.\n\nA submission to the Queensland inquiry from Brisbane West Bicycle User Group said that Queensland and the Brisbane City Council local government area are \"failing to capitalise on the congestion-busting benefits of micromobility, and particularly the increased accessibility\" afforded by e-mobility options.\n\n\n\n\n\nIt pointed out that in Brisbane, 56 per cent of all trips across all modes of transport between 2021 and 2024 were less than 5km in distance and that 75 per cent of trips under 5km were taken by car.\n\n\n\n\n\nThe group asked the inquiry to consider the benefits of e-mobility devices and their potential to replace the \"second or third family car\", which would \"have significant environmental benefits, both in terms of day-to-day emissions and pollution, but also reduced demand for road space and parking...\"\n\n\n\nInconsistent regulation\n\nFor the benefits of e-rideables to be fully realised, experts say better regulation needs to be enforced.\n\n\n\n\n\nLaws vary state by state and are overdue for an update, says Greaves.\n\n\n\n\n\nWhen e-scooters first entered the Australian market around 20 years ago, they fell into grey regulatory territory, he explains, as their integration into transport systems and roads had not been planned for.\n\n\n\n\"The origins of these rules came originally from AustRoads [a national agency representing state transport departments] ... They were talking about kids' scooters and skateboards and all those sorts of things,\" Greaves says.\n\n\n\n\n\n\"They classified them as recreational devices: the terminology was a 'wheeled recreational device' and it was then up to each state to figure out how they were going to manage that.\"\n\n\n\n\n\nGreaves says the variation between states has implications for whether devices can be used on roads or footpaths, age limits and registration requirements.\n\n\n\n\n\n\"For example, in NSW, we're not sure where scooters belong — some people consider them a kid's toy, others think of them as more of a moped. But, of course, they are not roadworthy as a motorcycle, so are illegal.\"\n\n\n\nIt's all a mess.\n\nWhile the NSW and Northern Territory governments have implemented laws that prohibit using personal e-scooters on public roads and footpaths, most other states permit their use under certain circumstances.\n\n\n\n\n\nA driver's licence is not needed to ride an e-scooter in jurisdictions where they are permitted in public areas, but riders often need to be above a certain age.\n\n\n\n\n\nIn WA and Victoria, riders must be at least 16 years of age to use an e-scooter in public spaces.\n\n\n\nQueensland allows those aged 12-15 to ride them as long as they are accompanied by an adult, while the ACT does not stipulate a minimum age; however, those under 12 must be accompanied by an adult.\n\n\n\n\n\nHelmets are generally required by law for public use, and certain activities, such as riding with more than one person or with a mobile phone in one hand, are not allowed.\n\n\n\n\n\nThere are also variations in enforceable speed limits. Riders in WA can travel on footpaths as long as they do not exceed 10km/h, while in Tasmania, it is 15km/h. It is illegal to ride an e-scooter on a footpath in Victoria.\n\n\n\n\n\nIn some states, the maximum speed for e-scooters in public areas is 20km/h; elsewhere, it is capped at 25km/h.\n\n\n\nRiding context and speed\n\nGreaves argues that regulation needs to be \"context dependent\" and take into account riding locations.\n\n\n\n\n\n\"In the inner city of Sydney, we have a decent bike network, and we have relatively low usage of those bike lanes. They should be allowed and that's what people expressed when we surveyed on this,\" he says.\n\n\n\n\n\n\"I think they're alright on local roads, where we are moving to the 40km/h default speed limits. I don't think they should be on main roads.\n\n\n\n\n\n\"Outside of the CBD, I think they should be allowed on footpaths. You go out into the suburbs and you might see two people walking on a footpath, [so] you've got this perfect infrastructure for e-scooters; let's use it for e-scooters and make it a shared path.\"\n\n\n\nTransport management professor Stephen Greaves says the local context needs to be considered when it comes to e-scooter regulations. Source: Supplied He says local governments should be engaged to help determine safe and appropriate contexts for e-rideables — but also speeds.\n\n\n\n\n\n\"Obviously, the state tries to set blanket rules around everything, but at the end of the day, the local jurisdiction needs to tweak those rules depending on the situation.\"\n\n\n\n\n\nIn March, Queensland Police warned consumers to be aware that some e-scooters being sold in Queensland exceeded the legal speed limits, which put them in a different category to personal mobility devices.\n\n\n\n\n\nGreaves says while imposing limitations on the speed of e-scooters might help to ensure those sold on the market comply with legal limits, he is aware that some e-scooter owners in Australia are making alterations to increase the speed of their devices.\n\n\n\n\n\n\"It's very easy to override that,\" he says.\n\n\n\nLISTEN TO New rules could soon ban charging of e-bikes in NSW apartments SBS News 00:50 English\n\nHe adds that implementing very low speed limits for e-scooters could take away their \"intrinsic appeal\" in helping people get from A to B faster than it would take to walk. It may also affect device operation.\n\n\n\n\n\n\"If you get below about 10 km/h it's actually quite hard to control it, it gets wobbly. There is a sort of sweet spot which is about 15km /h.\"\n\n\n\n\n\nBut Jennie Oxley from Monash points out that is the increased speed of e-scooters over walking as well as the slower interactions with traffic that add to the risk of injury.\n\n\n\nCompliance of e-mobility devices\n\nOne of the recommendations to come from a 2024 report from Monash University's ARC on injuries associated with e-scooters, e-bikes and other e-mobility devices was to \"increase police enforcement\" in an effort to deter \"noncompliant riding behaviours\".\n\n\n\n\n\nSBS News contacted police departments in each Australian state and territory to obtain recent data on e-ridable-related infringements; however, only WA and the ACT provided them.\n\n\n\n\n\nRaw numbers in the nation's capital reflect similar patterns to those in WA.\n\n\n\n\n\nWA officers recorded 303 infringements in regard to e-mobility devices between January 2024 and 7 October 2024 (when responsibility of collection of data moved to the Department of Transport) and a total of 510 infringements in 2023.\n\n\n\n\n\nAbout 85 per cent of those were related to helmets, and about 5 per cent were in relation to speeding.\n\n\n\nLaws around the use of e-scooters and other e-rideables differ from state to state. Source: Getty / BJP7images A WA Police spokesperson told SBS News: \"As with any vehicle, speed, drug and alcohol use and a lack of helmet use are contributing factors to the causes of serious injury or death involving ERDs [e-rideable devices].\n\n\n\n\n\n\"While infringements are an appropriate deterrent, they are only issued when the irresponsible or reckless rider is caught at that moment in time. The most effective way to deter irresponsible, dangerous and reckless operation of ERDs is to seize and destroy the vehicles.\"\n\n\n\n\n\nIn March, Queensland Police made a public appeal for people to take personal mobility device laws seriously, noting that between November 2022 and December 2024, more than 2,700 infringements were issued to riders for illegal road use.\n\n\n\n\n\nWhile e-bikes and e-motorbikes are categorised differently from e-scooters, there have been calls to mandate their registration and to legalise their use on roads.\n\n\n\nREAD MORE Faulty e-bike battery sparks Sydney apartment evacuation\n\nGreaves says research has shown community support for some sort of registration, insurance and licensing of e-mobility devices.\n\n\n\n\n\n\"There are a number of considerations to take into account, but such measures could potentially encourage more responsible ownership and riding,\" he says.\n\n\n\n'It really sucks'\n\nSeculovic remembers refusing to wear a helmet when riding his bike as a child, but strongly encourages anyone using an e-scooter to wear one.\n\n\n\n\n\nHe says parents with teens in particular face a challenge around e-scooter use.\n\n\n\n\n\n\"If you don't let them have one, do you then run the risk that they will then jump on the back of someone else's anyway?\" he says.\n\n\n\n\n\nDespite his personal grief over his daughter's death, Seculovic says banning scooters outright is not realistic.\n\n\n\nLook at all the road accidents, you can't just ban cars, can you?\n\nWhen a workmate recently expressed feeling conflicted about whether to allow their son to get an e-scooter, his only advice was: \"Go take him down to Wanneroo Road [northern Perth], and see Ava's cross.\"\n\n\n\n\n\n\"That's the end result, which could happen.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 38
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/trump-to-meet-with-zelenskyy-after-no-deal-reached-at-alaska-summit/099m7m1w9",
    "title": "Trump to meet with Zelenskyy after no deal reached at Alaska summit",
    "publish_date": "Sat, 16 Aug 2025 11:36:38 +0000",
    "category": "finance",
    "authors": [],
    "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts .\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nAhead of the high stakes meeting with Vladimir Putin, US President Donald Trump said he would know within two minutes of meeting the Russian leader whether it would be a success.\n\n\n\n\n\nIt took almost three hours before the leaders emerged from the meeting behind closed doors.\n\n\n\n\n\nIt was the first face-to-face meeting between Mr Trump and Mr Putin since 2019, with the Russian leader ostracised by Western leaders since Russia's full-scale invasion of Ukraine in 2022.\n\n\n\n\n\nAfter their meeting, Mr Trump and Mr Putin emerged to speak before reporters in Anchorage, but they took no questions.\n\n\n\n\n\n\"I believe that we had a very productive meeting. There were many, many points that we agreed on - most of them. I would say. A couple of big ones that we haven't quite got there. But we have made some head way. There is no deal until there is a deal. I will call up NATO in a little while. I will of course call up President Zelenskyy.\"\n\n\n\n\n\nMr Trump later told Fox News that he rated the meeting a 10 out of 10 - even though he revealed no details of the points of agreement and disagreement.\n\n\n\n\n\n\"There is not that much. There is one or two significant items (of disagreement). But I think they can be reached. Not it is really up to President Zelenskyy to get it done. And I would also say the European nations. They have to get involved a little bit. But it is up to President Zelenskyy. And if they like, I will be at the next meeting. They are going to set up a meeting between President Zelenskyy, President Putin and myself, I guess. Not that I want to be there, but I want to make sure that it gets done. We have a pretty good chance of getting it done.\"\n\n\n\n\n\nIt is a change in the tone Mr Trump had a few weeks ago when he issued a August 8 deadline for Mr Putin to show a genuine commitment to a ceasefire - or face stronger sanctions.\n\n\n\n\n\nAt the post-meeting press conference, Mr Putin was keen to cast the meeting as a success for him - in receiving the invitation, but also on the prospect of a Russian-US economic reset.\n\n\n\n\n\n\"I expect that today's agreement will be the starting point - not only for the solution of the Ukrainian issue. But will also help us bring back business and pragmatic relations between Russia and the US.\"\n\n\n\n\n\nHe says he has not shifted in his position on the full-scale invasion in Ukraine.\n\n\n\n\n\n\"We're convinced that in order to make the settlement lasting long-term, we need to eliminate the primary roots, the primary causes of the conflict. And we have said it multiple times, to consider all legitimate concerns of Russia and to reinstate a just balance of security in Europe - and in the world on a whole.\"\n\n\n\n\n\nAnd at the end of the press conference, Mr Putin was eager to secure another meeting with the US President.\n\n\n\n\n\nDonald Trump: \"Thank you very much Vladimir.\"\n\n\n\n\n\nVladimir Putin: \"Next time in Moscow.\"\n\n\n\n\n\nDonald Trump: \"Oh, that's an interesting one! I will get a little heat on that one but I could see it possibly happening. Thank you very much Vladimir. Thank you all! Thank you!\"\n\n\n\n\n\nVladimir Putin: Thank you so much.\"\n\n\n\n\n\nMatthew Sussex is a fellow at the Australian National University's Strategic and Defence Studies Centre.\n\n\n\n\n\nHe says there was a lot of theatre and optics involved in the high stakes visit - and Mr Putin got what he wanted.\n\n\n\n\n\n\"Yes, it's certainly a win for Vladimir Putin. The optics of it were that, you know, he came to American territory, but American territory in Alaska, which of course previously was part of the Russian Federation and there was a lot of media talk in Russia and billboards going up saying, you know, Alaska is Russian and we will take that back. So he got a photo opportunity with Donald Trump. So it makes him look, look respected and valued and making the American president travel all the way to Anchorage to meet him. And at the same time, he basically dodges those sanctions that Trump had threatened.\"\n\n\n\n\n\nMark Cancian is a senior adviser at the Center for Strategic and International Studies in Washington DC.\n\n\n\n\n\nHe says despite the convivial language between Mr Trump and Mr Putin, the Alaska summit was planned haphazardly from start to finish.\n\n\n\n\n\n\"The press conference was startling - even bizarre - in the sense that the meeting was expected to last maybe six hours and broke up after about three. Then the press conference was called very abruptly. The journalists race into the room. The parties come on stage and speak their piece. Putin starts off and Trump responds, and then they trip off after a couple of minutes, they take no questions and Putin gets on his airplane, flies away. And I don't think anyone quite expected a result like that. On the other hand, the words spoken were very friendly. Both Putin and Trump were encouraging about the future, but vague. And this is clearly the first step on, you know, what could be a long journey.\"\n\n\n\n\n\nHe says negotiations to end wars can take a long time to finalise, but there is a positive for Ukraine in that the worst outcome was avoided.\n\n\n\n\n\n\"Another encouraging thing was Trump saying that the Europeans and Ukraine, President Zelenskyy, had to be part of this agreement, and that had not come through quite clearly again about a week ago. The concern is that the pressure will go on to Zelenskyy to give up territory, to make an end to the conflict and get it over with as Trump would say. The Ukrainians are very reluctant to give up territory.\"\n\n\n\n\n\nUkrainian leader Volodymyr Zelenskyy says he has been briefed on the Alaska meeting in a phone call with Mr Trump.\n\n\n\n\n\nThe call also ended with an invitation for him to come to Washington DC on Monday (18 August local time).\n\n\n\n",
    "source": "SBS",
    "cluster_id": 39
  },
  {
    "url": "https://www.sbs.com.au/news/article/what-to-know-about-the-rare-brain-eating-amoeba-found-in-australian-tap-water/awfblr3lr",
    "title": "What to know about the rare 'brain-eating' amoeba found in Australian tap water",
    "publish_date": "Sat, 16 Aug 2025 06:30:43 +0000",
    "category": "lifestyle",
    "authors": [],
    "text": "One of the world’s most dangerous water-borne microorganisms, commonly called a \"brain-eating amoeba\", has recently been detected in two drinking water supplies in south-west Queensland.\n\n\n\n\n\nBoth affected towns are about 750 kilometres west of Brisbane: Augathella (population roughly 300) and Charleville (population 3,000).\n\n\n\n\n\nDuring an analysis of water samples commissioned by Queensland Health, Naegleria fowleri was detected in the water systems of two health facilities, one in Charleville and one in Augathella, as well as in the incoming town water supply at both facilities.\n\n\n\n\n\nThe Shire Council of Murweh, which takes in the two affected locations, issued a health notice for residents and visitors on August 7 warning of the detection of N. fowleri in the water supplies.\n\n\n\n\n\nSo what is this organism? And how significant is the risk likely to be in these Queensland towns, and elsewhere?\n\n\n\nWhat is the brain-eating amoeba?\n\nThe N. fowleri amoeba is a microscopic organism found around the world. It only lives in warm freshwater, generally between 25 and 40°C. This can include ponds, lakes, rivers, streams and hot springs.\n\n\n\n\n\nIf someone is infected with N. fowleri , it causes what’s called primary amoebic meningoencephalitis, a serious infection of the brain.\n\n\n\nREAD MORE Alana felt good about donating her eggs until she realised her sexuality was an issue\n\nSymptoms include a sore throat, headache, hallucinations, confusion, vomiting, fever, neck stiffness, changes to taste and smell, and seizures.\n\n\n\n\n\nThe incubation period of primary amoebic meningoencephalitis — the time between infection and symptoms appearing — typically ranges from three to seven days.\n\n\n\n\n\nTragically, this illness is nearly always fatal, even if someone receives medical attention quickly. Death typically occurs about five days after symptoms begin.\n\n\n\n\n\nFortunately though, cases are very rare. In the United States, there were 167 reported cases of primary amoebic meningoencephalitis between 1962 and 2024, according to the Centers for Disease Control and Prevention. Only four survived.\n\n\n\n\n\nA global review of the disease up to 2018 reported that, of 381 known cases, Australia accounted for 22, the fifth highest number, after the US, Pakistan, Mexico and India. Some 92 per cent of people died.\n\n\n\nHow do people get infected?\n\nThe route of infection is very unusual and quite specific. N. fowleri infects the brain through a person’s nose. The amoeba then passes through a protective membrane called the nasal epithelium.\n\n\n\nThis is an important physical barrier and allows the amoeba to travel to the brain through the olfactory nerve, which is responsible for our sense of smell. The infection then kills brain tissue and causes swelling of the brain, termed cerebral oedema.\n\n\n\n\n\nInfections occur in people when infected water travels up their nose. Most cases involve children and young people who have swum in infected waters. The majority of cases occur in males, with an average age of 14.\n\n\n\n\n\nEven water sports in affected waterways can be dangerous. A person is currently in intensive care in Missouri after it’s believed they became infected while water skiing.\n\n\n\n\n\nRegarding the recent detection in Queensland water supply systems, the source of the infection has not been reported. It’s possible a fresh waterway, or groundwater, which feeds into the affected drinking water systems, was contaminated with N. fowleri , and the amoeba travelled from there. But this will likely be determined with further investigation.\n\n\n\nIs it dangerous in drinking water?\n\nFirst, it’s important to note you can’t get primary amoebic meningoencephalitis from drinking contaminated water.\n\n\n\n\n\nBut any activity that allows infected water to enter a person’s nose is potentially dangerous. This can happen during a bath or a shower.\n\n\n\nSome people flush their nasal passages to clear congestion related to allergies or a viral infection. This has been linked to infections with N. fowleri . If you’re going to flush your nasal passages, you should use a sterile saline solution.\n\n\n\n\n\nEven young children playing with hoses, sprinklers or water activities could be at risk. A 16-month-old child was fatally infected following an incident involving a contaminated water \"splash pad\" in the US in 2023. Splash pads are water-based recreation activities, primarily for young children, that involve splashing or spraying water.\n\n\n\nWhat is the risk in Queensland?\n\nRegarding N. fowleri , Australian drinking water guidelines advise:\n\n\n\n\n\n\"If the organism is detected, advice should be sought from the relevant health authority or drinking water regulator.\"\n\n\n\n\n\nThe guidelines also provide recommendations on how to disinfect water supplies and control N. fowleri , using chlorine and other chemical compounds.\n\n\n\n\n\nAll public town water supplies across Australia are regularly tested to ensure that water is safe to drink.\n\n\n\nREAD MORE Albanese government moves ahead with election pledge to cap prescription medicines to $25\n\nWe don’t yet know the exact cause of the detection of the amoeba N. fowleri in these Queensland towns’ water supplies. But drinking or cooking with water contaminated with this amoeba will not cause an infection.\n\n\n\n\n\nAny activity that allows potentially contaminated water to go up the nose should be navigated carefully for now in the affected areas.\n\n\n\n\n\nContamination of a town drinking water supply from this amoeba is very rare and is unlikely in other Australian town water supplies.\n\n\n\n\n\nTo reduce your risk in potentially infected warm, fresh waters you should keep your head above water while swimming. And don’t jump or dive in. You can use a nose-clip if you want to swim with your head under water.\n\n\n\n\n\nThe amoeba cannot survive in salt water, so there’s no risk swimming in the ocean. Also, properly maintained swimming pools should be safe from the organism.\n\n\n\n\n\nNew South Wales Health advises that the amoeba cannot survive in water that is clean, cool and adequately chlorinated.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 40
  },
  {
    "url": "https://www.sbs.com.au/news/article/global-plastics-treaty-negotiations-fall-apart/s4bavwv7g",
    "title": "'Disappointed and angry': How negotiations for a global plastic treaty fell apart this week",
    "publish_date": "Sat, 16 Aug 2025 05:17:44 +0000",
    "category": "finance",
    "authors": [],
    "text": "Talks to strike a landmark global treaty on plastic pollution fell apart on Friday, leaving many frustrated and some calling it a \"missed opportunity\".\n\n\n\n\n\nNegotiators from 185 nations met in Geneva last week to try and draft the world's first legally-binding treaty to deal with the growing global issue of plastic pollution.\n\n\n\n\n\nDespite working beyond Thursday's deadline and through the night, the talks were ultimately futile and nations could not reach a consensus.\n\n\n\n\n\nA large bloc of nations including the European Union, Britain and many African and Latin American countries called for curbing plastic production and phasing out toxic chemicals used in plastics.\n\n\n\nHowever, a smaller group of oil-producing states including Saudi Arabia, Kuwait and Russia argued instead for waste management.\n\n\n\n\n\nThese countries railed against the negotiations being based on the entire life-cycle of plastic: from the petroleum-derived substance through to waste.\n\n\n\n\n\nWhile around 100 nations sought caps on plastic production, a number of countries including the United States stood against them and argued caps were unnecessary and a threat to their economies and industries.\n\n\n\nWhile a large number of nations argued for caps on plastic production others, including the US, stood against them. Source: AAP / Martial Trezzini/EPA\n\n'Missed a historic opportunity'\n\nRepresentatives of countries voiced anger and despair as the talks unravelled, but said they wanted future negotiations — despite six rounds of talks over three years now having failed to find agreement.\n\n\n\n\n\n\"We have missed a historic opportunity but we have to keep going and act urgently,\" said Cuba.\n\n\n\n\n\nColombia added: \"The negotiations were consistently blocked by a small number of states who simply don't want an agreement.\"\n\n\n\n\n\nTuvalu, speaking for 14 Pacific small island developing states, said: \"For our islands this means that without global cooperation and state action, millions of tonnes of plastic waste will continue to be dumped in our oceans, affecting our ecosystem, food security, livelihood and culture.\"\n\n\n\n\n\nFrance's ecological transition minister Agnes Pannier-Runacher said she was \"disappointed\" and \"angry\" and blamed a handful of countries \"guided by short-term financial interests\" for blocking an ambitious treaty.\n\n\n\n\"Oil-producing countries and their allies have chosen to look the other way,\" she said.\n\n\n\n\n\nGraham Forbes, the head of Greenpeace's delegation to the talks called the collapse of negotiations a \"wake up call for the world\".\n\n\n\n\n\n\"The vast majority of governments want a strong agreement, yet a handful of bad actors were allowed to use process to drive such ambition into the ground. We cannot continue to do the same thing and expect a different result. The time for hesitation is over,\" he said.\n\n\n\n\n\nEnvironmental NGOs also warned that without radically changing the process to better reflect the majority view, future talks will hit the same dead end.\n\n\n\n\n\nDavid Azoulay from the Center for International Environmental Law's David Azoulay said the talks had been an \"abject failure\" because some countries were out to \"block any attempt at advancing a viable treaty\".\n\n\n\n\n\nThe World Wide Fund for Nature said the talks exposed how consensus decision-making \"had now \"outplayed its role in international environmental negotiations\".\n\n\n\nWhat happens now?\n\nOil-producing nations argued that recycling, reuse and product design were sufficient to address the problem of global plastic pollution without resorting to production cuts.\n\n\n\n\n\nHowever, experts say these are not substantial answers to the issue.\n\n\n\n\n\nIngar Andersen, executive director of the United Nations Environmental Programme (UNEP), which hosted the talks, has said the world \"will not recycle our way out of the plastic pollution crisis\".\n\n\n\n\n\nMore than 400 million tonnes of plastic are produced globally each year, half of which is for single-use items.\n\n\n\n\n\nWhile 15 per cent of plastic waste is collected for recycling, only nine per cent is actually recycled.\n\n\n\nREAD MORE The tiny particles infiltrating our bodies and causing big problems for Australia\n\nThe future of the UNEP negotiations is now uncertain and while some countries have committed to resuming negotiations, others expressed that they have lost faith after repeated attempts.\n\n\n\n\n\nAndersen also pledged to continue work. \"We did not get where we want but people want a deal,\" she said.\n\n\n\n\n\nOn current trends, annual production of fossil-fuel-based plastics will nearly triple by 2060 to 1.2 billion tonnes, while waste will exceed one billion tonnes, according to the Organisation for Economic Cooperation and Development.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 41
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/midday-news-bulletin-16-august-2025/i4gtw9pz3",
    "title": "Midday News Bulletin 16 August 2025",
    "publish_date": "Sat, 16 Aug 2025 01:59:00 +0000",
    "category": "finance",
    "authors": [],
    "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts .\n\n\n\n\n\nTRANSCRIPT:\n\n\n\nThe US and Russian presidents fail to come to a Ukraine peace deal\n\nA 5.6 magnitude earthquake strikes Queensland leaving thousands without power\n\nBrisbane thrash Fremantle by 57 points as Fyfe’s finals hopes fade\n\nParents and unions have cautiously welcomed reforms to Working with Children Checks but say further action is needed to protect children.\n\n\n\n\n\nUnder changes announced on Friday, anyone barred from holding a check in one state or territory will, by year’s end, be automatically banned nationwide.\n\n\n\n\n\nAttorney-General Michelle Rowland calls the reform long overdue but rules out a single national system, with states and territories continuing to run their own checks.\n\n\n\n\n\n\"This is long overdue reform that Australians rightly expect will be delivered. We do not have a national scheme, and the states and territories administer those schemes. We are looking at a way in which we can get the most efficient outcome, and that is by individual state schemes talking to one another. That’s what we are going to do through the National Checking Capability, and that’s what states and territories have agreed.\"\n\n\n\n\n\nThe Australian Childcare Alliance says the move would help close dangerous loopholes but urged further measures, including a national register for early childhood educators and teachers.\n\n\n\n\n\n**\n\n\n\n\n\nUnited States President Donald Trump says he and Russian President Vladimir Putin were not able to reach an agreement at talks in Alaska, but he believes progress has been made toward achieving a ceasefire in Ukraine.\n\n\n\n\n\nThe summit has been the first face-to-face encounter for the two leaders since 2019.\n\n\n\n\n\nWhile President Trump seemed confident of achieving a deal with Russia prior to the meeting, he now says there are still some key points that need to be addressed first.\n\n\n\n\n\n\"There's no deal until there's a deal. I will call up NATO in a little while, I will call up President Zelenskyy and tell him about today's meeting. It's ultimately up to them. But we had an extremely productive meeting and many points were agreed to and there are just a very few that are left. Some are not that significant. One is probably the most significant, but we have a very good chance of getting there. We didn't get there, but we have a very good chance of getting there.\"\n\n\n\n\n\nPresident Putin praised Mr Trump for helping make diplomatic progress toward peace.\n\n\n\n\n\n\"Our talks were held in a constructive and mutually respectful atmosphere, and were very thorough and useful. I would like to thank my American colleague once again for the offer to come to Alaska. It is quite logical to meet here. After all, our countries, although separated by oceans, are in fact close neighbours.\"\n\n\n\n\n\nMr Putin has also suggested the next round of talks could take place in Moscow.\n\n\n\n\n\n**\n\n\n\n\n\nThe Albanese government has welcomed the diplomatic steps taken by United States President Donald Trump at talks with Russian President Vladimir Putin in Alaska.\n\n\n\n\n\nAttorney-General Michelle Rowland tells Channel Seven that all tools must be used to push for an end to Russia's invasion of Ukraine.\n\n\n\n\n\n\"Russia's illegal invasion of Ukraine has been going on for too long and we as a government welcome the United States involvement to try to bring this conflict to a close. Australia stands with Ukraine and any methods and any useful tools that the US could have at its disposal through this meeting is one that we certainly welcome because I'm sure that all Australians want to see this conflict end, as does the rest of the free world.\"\n\n\n\n\n\n**\n\n\n\n\n\nAn earthquake has struck Queensland with thousands feeling the effects near Australia's east coast.\n\n\n\n\n\nGeoscience Australia registered a 5.6 magnitude earthquake near the Wrattens National Park at Kilkivan, about 170 kilometres northwest of Brisbane this morning.\n\n\n\n\n\nThe quake was recorded about 9:50am at a depth of two kilometres.\n\n\n\n\n\nMore than 6000 people told the agency that they felt the affects of the quake within half an hour.\n\n\n\n\n\nThe agency says earthquakes above magnitude five occur every one-to-two years, with an average of 100 quakes at magnitude three or lower recorded each year in Australia.\n\n\n\n\n\n**\n\n\n\n\n\nHalf a century ago then prime minister Gough Whitlam poured a handful of soil into the hands of a man who had led an eight-year protest for the rights of his people\n\n\n\n\n\n\n\nOn the 16th of August 1975 Mr Whitlam travelled to Wave Hill Station, about 600 kilometres south of Darwin, to hand back land to the Gurindji people.\n\n\n\n\n\nIt was the first time the Commonwealth Government had returned land to its original custodians.\n\n\n\n\n\nDuring the handover ceremony, transferring leasehold title to a parcel of land at the Wave Hill cattle station to Gurindji people, Mr Whitlam poured the soil into the hands of senior Elder Vincent Lingiari.\n\n\n\n\n\nPrime Minister Anthony Albanese says the iconic image of the exchange is an enduring tribute to the courage, determination and solidarity of Gurindji people.\n\n\n\n\n\n**\n\n\n\n\n\nIn football, Liverpool have beaten Bournemouth in a 4-2 thriller at Anfield in the opening match of the Premier League season.\n\n\n\n\n\nNewcomer Hugo Ekiteke bagged a goal on his debut before Cody Gakpo doubled the lead at the beginning of the second half.\n\n\n\n\n\nBut Antoine Semenyo, who was the target of racist abuse from fans in the first half, scored twice in 12 minutes to shock the home fans and level the playing field.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 42
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/now-16-jacki-is-among-international-bull-riders-competing-at-iconic-rodeo-in-queensland/5rqu9y39t",
    "title": "Now 16, Jacki is among international bull riders competing at iconic rodeo in Queensland",
    "publish_date": "Fri, 15 Aug 2025 21:30:00 +0000",
    "category": "sports",
    "authors": [],
    "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nA rodeo ritual for team USA.\n\n\n\n\n\n(Team USA in a huddle): \"So we never stop fighting. We never give up. And when we win, it won't be by luck. Amen.\"\n\n\n\n\n\nEight-year-old Axton Hale is getting into the zone behind the chutes.\n\n\n\n\n\nHe's praying in a circle with other riders before taking on a bucking bull in the red dirt arena.\n\n\n\n\n\n\"Let's go now. Are you ready?\"\n\n\n\n\n\nThere's an organised chaos, with cowboys and cowgirls getting ready before they compete. The chaps are on and pep talks can be heard.\n\n\n\n\n\n\"It's just a fun sport, you get on cool bulls and ride cool bulls. I have some emotions if I fall off I might get a tiny little emotional but I have God with me.\"\n\n\n\n\n\nAxton is among dozens of young international competitors at the Mount Isa rodeo, which has been around since 1959.\n\n\n\n\n\nBut it's the first time the event has hosted a junior tri-national competition, with riders from the US, New Zealand and Australia going head-to-head.\n\n\n\n\n\n\"Hi my name is Jacki Gayle and I'm a bull rider on team USA.\"\n\n\n\n\n\nThe 16-year-old is the only female junior bull rider at this year's rodeo - hailing all the way from Texas.\n\n\n\n\n\nThe African American teenager started riding when she was just 11 years old, but it took months to convince her mother that the sport was safe.\n\n\n\n\n\n\"She called me crazy at first and thought that I was going to get hurt; and I wouldn't like it. But I tried and it and here we are four years later. And I've got all my friends and my rodeo family telling me that I can do this. And I don't know, it's just fun.\"\n\n\n\n\n\nJacki has earned recognition in various rodeo sanctions and currently holds the title of Southern New Mexico Rodeo Princess.\n\n\n\n\n\nShe recently competed in the Bill Pickett Youth Rodeo - an event in Texas which aims to honour Black rodeo history.\n\n\n\n\n\nJacki admits that growing up, she didn't see many cowboys and cowgirls that look like her - with representation now being an important part of her rodeo journey.\n\n\n\n\n\n\"There isn't very many dark skinned or African American cowboys out there. So it's nice for me to be one of the few who are trying to get more awareness and get more people into the sport.\"\n\n\n\n\n\nAnd she's not the only one bringing a unique flare to the arena.\n\n\n\n\n\nThe other nation competing against Australia and the USA - is New Zealand.\n\n\n\n\n\n(Sounds of Hakka dance and chant)\n\n\n\n\n\nIt's the first day of the rodeo and the sun is about to rise; standing in the empty arena, performing the Haka is the New Zealand team.\n\n\n\n\n\nLeading the Haka is Ty Blake, the 16-year-old bull rider attended his first rodeo when he was just 6 weeks old.\n\n\n\n\n\n\"Rodeo culture is just family, just one big family. Everyone's together, everyone helps each other out. Dad used to show jump way back in his glory days; and Mum's a horsemanship world champion. So I have good genes.\"\n\n\n\n\n\nHe says the sport has taught him resilience - and fearlessness.\n\n\n\n\n\n\"There's a song, called hooked on an 8 second ride and it's about the adrenaline that goes through. And it's something you can't get over. It's like an itch you just got to scratch it and ever since then, I've been scratching it.\"\n\n\n\n\n\nKylee Ferguson is the director for the youth rodeo organisation; and he helped co-ordinate the international talent for 2025.\n\n\n\n\n\n\"When we take teams to other countries, we really focus on that team building experience and making friends. To us the most important thing is getting the contacts on the other side of the world. You can see the friendships already formed and spending a lot of time together. I think, it's the best way to make friendships across the world.\"\n\n\n\n\n\n(Sound of cows mooing)\n\n\n\n\n\nA growing sport - making way for a new generation of rodeo athletes...\n\n\n\n\n\nIncluding up and coming First Nations bull riders: like 10-year-old Carl Douglas Jnr, who made the journey to Mount Isa from Cape York.\n\n\n\n\n\n\"It feels good, sitting on it and riding on it make your family proud. My family was doing bull riding - my cousin, brothers.\"\n\n\n\n\n\nThese young riders, hoping to win some buckles - and lend a hand along the way. Axton again.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 43
  },
  {
    "url": "https://www.sbs.com.au/news/video/insideout-fijian-band-celebrates-pacific-island-heritage-on-australian-tour/mh6e86oho",
    "title": "INSIDEOUT: Fijian band celebrates Pacific Island heritage on Australian tour",
    "publish_date": "Fri, 15 Aug 2025 10:48:55 +0000",
    "category": "entertainment",
    "authors": [],
    "text": "INSIDEOUT: Fijian band celebrates Pacific Island heritage on Australian tour\n\nPublished 15 August 2025, 8:42 am\n\nFijian band, Inside Out, fuses reggae grooves, pop and Fijian folk, in a celebration of their Pacific Island heritage. The group is currently on tour around Australia, and SBS went to meet them.",
    "source": "SBS",
    "cluster_id": 44
  },
  {
    "url": "https://www.sbs.com.au/news/video/milestone-for-multiculturalism-afl-sees-first-player-of-vietnamese-descent/c3ghhrlc8",
    "title": "Milestone for multiculturalism: AFL sees first player of Vietnamese descent",
    "publish_date": "Fri, 15 Aug 2025 10:37:54 +0000",
    "category": "finance",
    "authors": [],
    "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
    "source": "SBS",
    "cluster_id": 37
  },
  {
    "url": "https://www.theage.com.au/sport/nrl/southwell-binned-for-dangerous-tackle-20250817-p5mnki.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Southwell binned for 'dangerous' tackle",
    "publish_date": "Sun, 17 Aug 2025 12:14:45 +1000",
    "category": "sports",
    "authors": [],
    "text": "Southwell binned for 'dangerous' tackle\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 20
  },
  {
    "url": "https://www.theage.com.au/national/tubby-pays-tribute-to-bob-simpson-20250817-p5mnjz.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Tubby pays tribute to Bob Simpson",
    "publish_date": "Sun, 17 Aug 2025 11:55:29 +1000",
    "category": "finance",
    "authors": [],
    "text": "Tubby pays tribute to Bob Simpson\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 21
  },
  {
    "url": "https://www.theage.com.au/culture/live-reviews/headbanging-and-handstands-as-hometown-heroes-go-hard-at-tour-closer-20250809-p5mlmt.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Mozart’s ‘Abduction’ gets a wildly modern makeover",
    "publish_date": "Sun, 17 Aug 2025 11:32:39 +1000",
    "category": "entertainment",
    "authors": [
      "Barney Zwartz",
      "Andrew Fuhrmann"
    ],
    "text": "MUSIC\n\nTakács Quartet with Angie Milliken ★★★★★\n\nMusica Viva, Melbourne Recital Centre, August 14 In a very welcome return to Melbourne, the Takács Quartet reaffirmed itself as probably the best string quartet on the planet. Takács Quartet perform at Melbourne Recital Centre, August 14. 2025. Credit: Cameron Jamieson Haydn’s Quartet in G minor, Op. 74, No. 3 was a splendid curtain-raiser, showcasing the group’s burnished, multifaceted tone. Like looking into a gemstone, there were flashes of brilliance but beguiling depths of colour. After revelling in the quick-witted interplay of parts in the first movement, there came a superbly controlled second-movement choral. So ebullient was the finale that the audience burst into applause before the end. Brisbane-born, Berlin-based composer Cathy Milliken’s Sonnet of an Emigrant after Bertolt Brecht for narrator and string quartet was commissioned for Musica Viva’s 80th anniversary season. In marrying Brecht’s poetry of displacement with fragmented reminiscences of the Viennese modernism with which many musical refugees would have been familiar, Millikin has created an evocative meditation on loss and new beginnings. The empathetic narration by the composer’s sister Angie Milliken alternated between English and German, underlining a loss of belonging.\n\nAt the heart of the program was Beethoven’s String Quartet in C major, Op. 59, No. 3. The vastly different timbres of the first two chords signalled that this would be an engrossing account. Indeed, it riveted listeners for some 30 minutes. Loading After the initial brilliance of C major, it was hard not to swoon to the ensuing Andante, beautifully underpinned by András Fejér’s cello. A vividly contrasted Menuetto led directly into the fugato finale, taken at breakneck speed and overflowing with energy and excitement. A generous encore, the second movement of Ravel’s String Quartet, captivated not only with its exquisite elegance but with the most luscious pizzicato anyone could hope to hear this side of the pearly gates. Such heavenly music making really does put the Takács Quartet in a class of its own.\n\nReviewed by Tony Way\n\nMUSIC\n\nElevator Music ★★★★\n\nOmega Ensemble, Melbourne Recital Centre, August 16 Despite the tenuous link between elevators and this Omega Ensemble program, most of the music seemed to be chosen to lift listeners’ spirits. Loading Elevator Music is the title of a jazz-infused work by Adelaide-based composer Graeme Koehne, which (confusingly) was not performed. Keohne, however, provided a new work for orchestra and two clarinets to showcase the talents of English virtuoso Michael Collins and Omega’s artistic director David Rowden. Dances on the Edge of Time (a title derived from poetry by Rabindranath Tagore) consists of three movements (a rigaudon, a chaconne and a gigue), each tagged with a phrase from the popular aphorism attributed to baseballer Leroy “Satchel” Paige: “Work like you don’t need the money, love like you’ve never been hurt and dance like nobody’s watching.”\n\nCollins and Rowden, along with the rest of the ensemble, willingly followed Paige’s advice. Surmounting a buoyant rhythmic accompaniment, the ascending solo lines of the Rigaudon radiated a carefree approach. Classic gestures in the chaconne spoke of loss then love, while the concluding gigue hinted at the rustic style of Australian musical larrikin Percy Grainger. Koehne’s concerto was preceded by the instantly recognisable Allegro from Mozart’s Eine Kleine Nachtmusik, whose jollity stood in stark contrast to Stride by American composer Anna Clyne. Drawing material from Beethoven’s Pathetique Sonata, Clyne’s often busy and astringent soundscape created episodes of tension and release. Originally written for swing jazz legend Benny Goodman, Aaron Copland’s Clarinet Concerto, with its masterly writing for both orchestra and soloist, was brilliantly executed by Collins. Effortlessly negotiating its melodious languor and its infectious rhythmic energy, Collins happily and vividly brought the music alive in time and space. Arranged for two clarinets, the final movement from Elena Kats-Chernin’s Ornamental Air proved the perfect encore, taking the mood, as it were, to the top floor.\n\nReviewed by Tony Way\n\nMUSIC\n\nPress Club ★★★★\n\nCorner Hotel, August 8 “You should see the piece of skin hanging off my shin,” says Press Club singer Natalie Foster of the blood trickling down her leg, just four songs in. “It scared me. I’ve only seen that once before when I was 18 and fell off a construction site drinking tequila.” Press Club perform at the Corner Hotel on Friday, August 8. Credit: Martin Philbey This banter could be a manifesto for her jangly, garage-punk quartet. Misadventures and big emotions, testing limits and returning home to report on them: they’re key themes throughout the Brunswick group’s catalogue. Since their debut in 2017, the staunchly DIY Press Club have been on a tear – stomping across world stages and releasing four LPs in quick succession. Tonight they’re launching their latest, the sugary punk sheen of To All the Ones I Love. It also makes for an emotional homecoming, laced with a slight hint of exhaustion, to close the band’s 10-week, 30-date European and Australian tour.\n\nFollowing a walk-on to the moody I Am Everything, Press Club throw everything at it. “We’re from Melbourne,” says Foster before a blistering Cancelled. “Feels f---ing good to be playing our hometown.” The gig served as both an album launch and an emotional homecoming for the band. Credit: Martin Philbey The celebratory Headwreck ignites the first singalong, and from there it’s over to Foster to pull focus – be it via bloody injuries or her incredible voice, which retains its husky, impeccably roaring croon even when she’s mid-headbang, pulling a handstand mid-verse of Coward Street, or lost deep in the crowd. Around her the band sizzles on Greg Rietwyk’s relentlessly melodic guitar lines, Iain MacRae’s excellent burbling bass and the breakneck drumming of Timmy Hansen, filling in for founding member Frank Lees, who’s on parental leave. Dynamics of a punk show can be tricky – if every song allegedly inspires catharsis, after a while the stakes don’t seem as high. Press Club mitigate this with clever stylistic detours. Mid-show highlight Untitled Wildlife features Stu Patterson from support band Placement lend wailing saxophone to an indie-rock build that culminates in real anthemic alchemy. Suburbia, from the band’s debut, Late Teens, remains the perfect set closer, Foster yelling, “I can’t relate to letting all your dreams go”, while instructing the crowd to launch themselves one last time.\n\nBack for an encore, Foster takes the dying minute of joyous, Smiths-y closer Wilt to jump into the crowd and make her way over to help out at the merchandise desk. As we file out, she’s there keeping the dream alive.\n\nReviewed by Marcus Teague DANCE\n\nPhantasm ★★★\n\nChunky Move Studios, until August 16 The title of Melanie Lane’s new show suggests a singular, self-contained vision. In the event, however, it unfolds as a plurality of figments and counterfeits drawn from the archives of popular culture with only the loosest thematic connection. The setting is impressive. Working with designers Eugyeene Teh and Bosco Shaw, Lane constructs a wonderfully gothic space enclosed by solid walls of darkness, filled with haze and crossed with scrims. Phantasm takes place in a wonderfully gothic space. Credit: Gregory Lorenzutti\n\nA lone dancer drops into this lowermost dungeon of the mind. She bites the head off a rat, blood running over her chin, then jerks and twitches, hands vibrating like a plucked string. It’s a strong opening, with the promise of something visceral, bloody and unexpected: a feminine nexus of death, desire and horror, darkly animate. Yet little of this intensity carries through the rest of the work. Phantasm, the title of Melanie Lane’s new show, suggests a singular, self-contained vision. Credit: Gregory Lorenzutti We move through predictable variations: exotic dancers, demonic cheerleaders, gothic heroines, romantic ballerinas, witches on broomsticks. Some, like the witches suspended above the stage, are more interesting than others. They are all, however, fairly generic images. They’re types or figures, mythic only in the rather desolate sense that they are overexposed: tropes of femininity endlessly adapted and exploited by mass culture.\n\nWe rely on the movement to give these figures new relevance, and to provide the thread that might bind them into a collective phantasm. This doesn’t happen. Instead, the dance often settles into familiarity. Costumes are exiguous and change often: witches’ rags give way to tinselled cheer skirts, then tutus. Only mushroom-coloured bodystockings remain constant, giving, at a squint, the illusion of nudity. Loading In the final scene, the bodystocking is also stripped away. The setting shifts to a primeval forest where the women exchange gestures of care. The implication seems to be that this is the real myth behind the others: a return to some essentialised, pastoral femininity. I’m not convinced. This image of the natural woman seems just as constructed and just as overexposed as the others. Does Lane really intend this as a return to the body in its purest form? Surely this is just another costume to be sloughed?",
    "source": "TheAge",
    "cluster_id": 22
  },
  {
    "url": "https://www.theage.com.au/sport/nrl/haas-opens-up-on-defection-to-samoa-20250817-p5mnk3.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Haas opens up on defection to Samoa",
    "publish_date": "Sun, 17 Aug 2025 11:30:41 +1000",
    "category": "finance",
    "authors": [],
    "text": "Haas opens up on defection to Samoa\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 23
  },
  {
    "url": "https://www.theage.com.au/national/australian-cricket-mourns-death-of-bob-simpson-20250816-p5mnh7.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Australian cricket mourns death of Bob Simpson",
    "publish_date": "Sun, 17 Aug 2025 11:29:21 +1000",
    "category": "sports",
    "authors": [],
    "text": "Australian cricket mourns death of Bob Simpson\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 24
  },
  {
    "url": "https://www.theage.com.au/national/queensland/toowong-s-old-woolies-site-to-become-brisbane-s-newest-urban-village-20250817-p5mnjc.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Toowong’s old Woolies site to become Brisbane’s newest urban village",
    "publish_date": "Sun, 17 Aug 2025 11:28:21 +1000",
    "category": "finance",
    "authors": [
      "Cameron Atfield"
    ],
    "text": "A new urban renewal development in Brisbane’s inner-west would tower over Toowong and transform the suburb with a mixed-use precinct.\n\nThe three-tower complex would include a “Central Plaza” that would host pop-up markets and artistic displays, along with retail tenancies, according to plans lodged with the council.\n\nThe now mostly vacant site across the road from Toowong Village and the train station was home to a standalone Woolworths supermarket until 2017.\n\nThe three planned towers of 58, 55 and 49 storeys would be more than double the 25 storeys allowed under the council’s Toowong-Auchenflower Neighbourhood Plan. Credit: KHA\n\nIn an assessment report prepared on behalf of the developers, Toowong Central Investment Holding Pty Ltd, town planning firm Urbis says the three-tower scheme made efficient use of the irregularly shaped block, which fronts onto High Street, Sherwood Road and Jephson Street.",
    "source": "TheAge",
    "cluster_id": 25
  },
  {
    "url": "https://www.theage.com.au/sport/nrl/crichton-weighs-on-r360-whispers-20250817-p5mnk0.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Crichton weighs on R360 'whispers'",
    "publish_date": "Sun, 17 Aug 2025 11:19:15 +1000",
    "category": "finance",
    "authors": [],
    "text": "Crichton weighs on R360 'whispers'\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 26
  },
  {
    "url": "https://www.theage.com.au/sport/afl/aflw-weekly-live-round-one-blues-pies-name-teams-for-season-opener-20250813-p5mmlw.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "AFLW round one: Harris sent to hospital with eye injury; Bombers thump Giants",
    "publish_date": "Sun, 17 Aug 2025 10:17:30 +1000",
    "category": "sports",
    "authors": [
      "Hannah Kennelly",
      "Roy Ward",
      "Melissa Coulter Ryan"
    ],
    "text": "Tayla Harris wasn’t in the game long before suffering an eye injury but did have time to take a trademark speccy. Credit: Getty Images\n\nStar Melbourne ruck-forward Tayla Harris had her AFLW season debut cut short due to an eye injury, but it didn’t stop her Demons dominating the Bulldogs on Saturday night.\n\nAn Olivia Purcell masterclass propelled Melbourne to a dominant 48-point win at Whitten Oval. She finished with a monster haul of one goal, 33 disposals and seven clearances to help the Demons steamroll the hosts 9.8 (62) to 1.8 (14) and retain the Hampson-Hardeman Cup.\n\nBut the Demons didn’t come out of their fourth straight win over the Bulldogs unscathed.\n\nHarris showed glimpses of her All-Australian best in her first game back from a shoulder injury, before being forced out in the second quarter.\n\nAfter pulling off a trademark speccy just moments earlier, Harris copped an arm to her face in a marking contest with Bulldogs counterpart Alice Edmond.\n\nCoach Mick Stinear said after the game that Harris was being assessed at the eye hospital.\n\n“She’s doing OK but just probably in the best possible hands,” Stinear said.\n\n“I think we needed to send her there to get proper treatment but she’s doing OK … I’m not expecting anything too sinister there, but certainly needed expert attention.”\n\nThe 28-year-old Harris only played one game last year, requiring surgery after hurting her left shoulder. Melbourne, semi-finalists the previous year, missed the top eight in her absence.\n\nTyla Hanks was just as busy on Saturday with 29 disposals, and kicked two goals to match Kate Hore and Eden Zanker.\n\nThe Western Bulldogs had their own returning star, with former skipper Ellie Blackburn collecting 17 touches through managed minutes.\n\nBlackburn was limited to three games last season before hurting her foot.\n\nJasmyn Smith was the Bulldogs’ main ball winner with 21 disposals.\n\nAAP",
    "source": "TheAge",
    "cluster_id": 27
  },
  {
    "url": "https://www.theage.com.au/sport/aussie-stunned-in-world-title-fight-20250817-p5mnji.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Aussie stunned in world title fight",
    "publish_date": "Sun, 17 Aug 2025 10:08:51 +1000",
    "category": "sports",
    "authors": [],
    "text": "Aussie stunned in world title fight\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 28
  },
  {
    "url": "https://www.theage.com.au/national/victoria/locals-love-this-strip-but-some-of-its-most-famous-stores-are-leaving-20250813-p5mmmv.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Locals love this strip, but some of its most famous stores are leaving",
    "publish_date": "Sun, 17 Aug 2025 10:00:00 +1000",
    "category": "finance",
    "authors": [
      "Gemma Grant"
    ],
    "text": "Just a few kilometres from the CBD, Rathdowne Village has a timeless country town feel that people love. But as rising costs and slowing trade prompt a handful of businesses to close or move on, locals fear the shopping strip has become too quiet for its own good.\n\nLocated in Carlton North along the street of the same name as the village, it is the main shopping hub in the inner-city suburb, replete with lush green median strips, wide bike lanes and the open space of Curtain Square.\n\nThe northern end of Rathdowne Village. Credit: Simon Schluter\n\nEmpty storefronts are becoming increasingly common in the otherwise busy strip. The top end has been hit hardest, with some heritage facades growing tired and slowly collecting graffiti.\n\nConnor Cunliffe opened Fledgling Café in Rathdowne Village’s north in 2017. He made the difficult decision to close the business last month, citing rising costs, slowing trade and burnout. While his original plan was to shut down completely, he was happy to find a last-minute buyer.",
    "source": "TheAge",
    "cluster_id": 29
  },
  {
    "url": "https://www.theage.com.au/national/more-tremors-on-the-way-after-queensland-earthquake-20250817-p5mni7.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "More tremors on the way after Queensland earthquake",
    "publish_date": "Sun, 17 Aug 2025 09:34:18 +1000",
    "category": "finance",
    "authors": [],
    "text": "More tremors on the way after Queensland earthquake\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later. Dismiss\n\nOur network\n\nOpen Navigation Menu The Age",
    "source": "TheAge",
    "cluster_id": 30
  },
  {
    "url": "https://www.theage.com.au/national/victoria/take-the-age-quiz-20230608-p5df2m.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Take The Age quiz",
    "publish_date": "Sun, 17 Aug 2025 09:31:58 +1000",
    "category": "finance",
    "authors": [],
    "text": "WHERE AM I?\n\nWhere is this bar located? Credit: Justin McManus\n\nMelbourne’s most-inundated bar originally opened as a summer pop-up and has now been serving up drinks for 15 years. Where is the bar located, and what is its name? Check next week’s quiz for the answer.\n\nLast week’s WHERE AM I? The former GJ Coles and David Jones menswear building has reopened as Mecca’s flagship store at 299 Bourke Street.",
    "source": "TheAge",
    "cluster_id": 45
  },
  {
    "url": "https://www.theage.com.au/politics/federal/australians-are-choosing-to-travel-to-asia-over-the-us-it-s-not-because-of-trump-20250815-p5mnb7.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Australians are choosing to travel to Asia over the US. It’s not because of Trump",
    "publish_date": "Sun, 17 Aug 2025 09:30:00 +1000",
    "category": "finance",
    "authors": [
      "Millie Muroi"
    ],
    "text": "Japan, China and Vietnam are fast becoming the top travel destinations for Australians, with fewer residents flying to the United States than before the pandemic.\n\nAccording to Australian Bureau of Statistics data released last week, the number of Australian residents visiting Japan nearly doubled from about 484,000 in 2018-19 to more than 910,000 in 2024-25, making it the third most popular destination for Australian travellers, overtaking the US.\n\nJapan is now the third most popular destination for Australian travellers. Credit: Getty Images\n\nWhile China, Vietnam and Indonesia also recorded continued growth, with the latter – attracting 1.7 million visitors – remaining Australia’s most popular overseas destination, fewer than 750,000 Australian residents chose to travel to the US.\n\nThat figure was up on 714,000 the previous financial year but remained lower than the nearly 1.1 million who travelled to the States in 2018-19, before the pandemic.",
    "source": "TheAge",
    "cluster_id": 31
  },
  {
    "url": "https://www.theage.com.au/sport/athletics/pretty-sick-new-national-record-for-australian-middle-distance-star-20250817-p5mnis.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "This Australian runner just set a new national record. She thinks it’s ‘pretty sick’",
    "publish_date": "Sun, 17 Aug 2025 09:29:32 +1000",
    "category": "sports",
    "authors": [
      "Michael Gleeson"
    ],
    "text": "Claudia Hollingsworth just broke the national 800m record. It was “pretty sick”.\n\nIf you don’t know her, Claudia is 20. That’s also pretty sick.\n\nIf you don’t know her, firstly that’s a shame. But you also will get to know her, for the girl – sorry, woman now – from bayside Melbourne is a bona fide emerging star. Gout Gout isn’t the only young champion athlete in this new golden era of Australian athletics.\n\nA month out from the world athletics championships in Tokyo the Diamond League meet in Silesia was a legitimate preview to Tokyo and an announcement by Hollingsworth of her station in things.",
    "source": "TheAge",
    "cluster_id": 32
  },
  {
    "url": "https://www.theage.com.au/sport/soccer/richarlison-scores-goal-of-the-season-contender-20250817-p5mnj0.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Richarlison scores 'goal of the season' contender",
    "publish_date": "Sun, 17 Aug 2025 09:24:01 +1000",
    "category": "sports",
    "authors": [],
    "text": "Richarlison scores 'goal of the season' contender\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 33
  },
  {
    "url": "https://www.theage.com.au/sport/soccer/rapid-recap-mw1-aston-villa-vs-newcastle-20250817-p5mnj3.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Rapid Recap | MW1: Aston Villa vs Newcastle",
    "publish_date": "Sun, 17 Aug 2025 09:19:23 +1000",
    "category": "sports",
    "authors": [],
    "text": "Rapid Recap | MW1: Aston Villa vs Newcastle\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 34
  },
  {
    "url": "https://au.news.yahoo.com/aussie-mans-amazing-op-shop-discovery-which-made-500-in-30-minutes-020430308.html",
    "title": "Aussie man's amazing op shop discovery which made '$500 in 30 minutes'",
    "publish_date": "2025-08-17T02:04:30Z",
    "category": "finance",
    "authors": [],
    "text": "One savvy charity shop flipper made $500 in 30 minutes thanks to an incredibly niche discovery. Source: TikTok/Flip Weekly/Savers\n\nSifting through charity shops to uncover hidden gems is a popular Australian pastime. And while many shoppers have recently decried the rising cost of items sold at op shops across the country, those who have the patience to meticulously dig up treasure have even managed to turn the practice into a lucrative business endeavour.\n\nOne such person is professional thrifter Mat, who recently revealed the incredible \"niche\" find that made him $500 in just 30 minutes after listing the item for sale online.\n\nMat Carpenter, who runs Flip Weekly, a newsletter and podcast teaching Aussies how to flip undervalued products found in op shops, told Yahoo News that he was wandering around a Savers thrift store when he came across a unique-looking mug priced at $7.49.\n\nMat had heard that pottery mugs made by Australia's oldest rum distillery, Beenleigh Rum, in the 1950s are now highly sought after and went \"on the lookout for anything that combines alcohol and pottery.\"\n\nWhat's the story behind the $500 mug?\n\nThe brown ceramic jug depicts the caricatured face of \"Bosun Bill\". According to Beenliegh Artisan Distillers, the character comes from the legend of 'The Bosun', who operated a floating sugar mill along the Albert and Logan Rivers.\n\nADVERTISEMENT\n\n\"He soon found a productive use for the excess molasses he produced- making Rum on the sly,\" the distillery's website states.\n\nWhen the floating sugar mill, the SS Walrus, washed ashore in 1984 onto the land of the distillery, all that was found was the Bosun’s Copper Pot, inspiring its creation.\n\nThe mugs were created as memorabilia for the rum brand, and now the collectible items sell for top dollar online.\n\n\"I couldn't tell you the detailed history of Bosun Bill or Beenleigh Rum, all I know is that collectors pay a ridiculous amount of money for their items,\" said Mat. \"Fancy paying $500 for a rum jug that doesn't contain any rum,\" he joked.\n\nFlipper's advice for making lucrative discoveries in op shops\n\nWhile Mat admits that the find is incredibly niche, he advised that Aussies looking to make cash by flipping items from charity shops can easily replicate his efforts. First, they \"need to know what they're looking for,\" he said.\n\nADVERTISEMENT\n\nThe Sydneysider previously shared with Yahoo Finance that he is earning $4,000 a month by turning one man’s trash into another’s treasure. He has since now flipped hundreds of items, including books, toys, DVDs and CDs, and collectable clothes, and shares advice in his weekly newsletter.\n\n\"My background is finding unusual ways to make money,\" he said. \"There's nothing more unusual than picking up a mug in a thrift store for $7.50 and selling it 30 minutes later for $500.\"\n\nMat is able to identify exactly what is valuable, but also what's not. Last month, he called out Vinnies for selling relatively common books for as much as $1,000, advertising them behind the counter as rare and hard to find.\n\nThe books — Harry Potter and the Deathly Hallows and Harry Potter and the Half Blood Prince — were listed for $500 and $1,000, respectively. The books were labelled as rare first editions, but Mat argued they actually \"far from it\".\n\nAfter Yahoo News approached St Vincent de Paul Society (Vinnies), the charity shop confirmed the two items were pulled from the shelves, admitting that the advertised pricing was made in error.\n\nA $1,000 item sold at a Sydney Vinnies store has sparked an investigation. Source: Yelp/TikTok/Flipweekly\n\nFellow Aussies cashing in on charity shop finds\n\nAnd Matt isn't the only Aussie who's found incredible treasure on the shelves of his local op shops.\n\nADVERTISEMENT\n\nOne thrifter last year stumbled upon her \"best ever find\" in a Queensland Vinnies store when she realised a $2 pair of opal earrings could be worth up to $1,000.\n\nAnother man, Tom purchased a Seiko watch for \"less than the cost of a meal\". It turned out that a small detail on the dial — the words \"Australian Bureau of Statistics\" — made it an incredibly valuable find. The government agency previously recognised long-standing staff by gifting them a watch.\n\nAfter receiving \"a lot of offers to buy it\" he decided to list it on eBay, where on Tuesday he sold it for over $500.\n\nDo you have a story tip? Email: newsroomau@yahoonews.com.\n\nYou can also follow us on Facebook, Instagram, TikTok, Twitter and YouTube.",
    "source": "Yahoo",
    "cluster_id": 46
  },
  {
    "url": "https://au.news.yahoo.com/nuisance-tariffs-chalmers-shot-trump-235640942.html",
    "title": "‘Nuisance tariffs’: Chalmers’ shot at Trump",
    "publish_date": "2025-08-17T02:02:01Z",
    "category": "finance",
    "authors": [
      "Joseph Olbrycht-Palmer"
    ],
    "text": "Treasurer Jim Chalmers has taken a thinly veiled shot at US President Donald Trump. Picture: Mandel Ngan / AFP / Martin Ollman / NewsWire\n\nJim Chalmers has blasted tariffs as a “tax on the workers and families of the country that levies them” while flagging further action on “nuisance tariffs”.\n\nNuisance tariffs are import taxes that, while generating some government revenue, are considered inefficient and burdensome.\n\nThe Treasurer last year removed some 500 duties on a range of everyday items, including toothbrushes, women’s health products and fridges.\n\nFresh Treasury data showed dropping the imposts would save businesses $180m in compliance costs by the end of 2029-30 and already streamlined $8.5bn-worth of annual trade.\n\nIn a thinly veiled shot at Donald Trump, Mr Chalmers said on Sunday “there are good reasons to swim against the tide a bit when it comes to tariffs”.\n\nTreasurer Jim Chalmers is mulling further action on ‘nuisance tariffs’. Picture: Martin Ollman / NewsWire\n\n“Some of these nuisance tariffs in our economy risk doing more harm than good, and tariffs are essentially a tax on the workers and families of the country that levies them,” he told Sky News.\n\nADVERTISEMENT\n\n“So we’ve made a heap of progress abolishing 500 nuisance tariffs, working closely with (Trade Minister) Don Farrell and other colleagues to do that.”\n\nHe went on to say the Albanese government was “very proud of that progress that we’ve been able to make unilaterally, because tariffs push up compliance costs on business”.\n\n“They risk pushing up prices for workers and families as well,” Mr Chalmers said.\n\n“If I can build consensus and momentum to go further on that, I would like to, but I’ll do that in a way that works closely with Don Farrell, conscious of the negotiations that he has under way.\n\n“But I think we’ve shown a willingness and enthusiasm to cut those nuisance tariffs.\n\n“I would like to go further, if I can. They do often do more harm than good, and so we approach the challenge in that light.”\n\nUS President Donald Trump has threatened further sectoral tariffs. Picture: Mandel Ngan / AFP\n\nHis comments come as trade talks with the US drag on.\n\nADVERTISEMENT\n\nWhile Australia managed to avoid an increase in US tariffs earlier this month, exports are still subject to blanket 10 per cent levies.\n\nSome sectors, such as steel and aluminium, have rates of up to 50 per cent.\n\nThe US President has also threatened to slap imposts of 250 per cent on foreign pharmaceuticals – a move that would hit Australian producers hard.\n\nThe Albanese government has repeatedly labelled tariffs “economic self-harm”.\n\nMr Chalmers did not specify which products he considered slumped with nuisance tariffs, but he did say “there’s hundreds”.\n\n“In those first 500 that we abolished, there were a lot of instances where it costs more actually to levy the tariff than to the benefit that we get from it,” he said.\n\n“So I’m not prepared to put a number on any additional steps that we might be prepared to take, but this has been a pretty constant interest of mine.”",
    "source": "Yahoo",
    "cluster_id": 47
  }
]