[
    {
        "url": "https://www.9news.com.au/entertainment/amyl-and-the-sniffers-fed-square-free-gig-shut-down-crowd-crushes/0d48f845-0fe3-4aa5-8c25-aa6b05e2d4c3",
        "title": "Amyl and the Sniffers' free Melbourne gig shut down over safety fears",
        "publish_date": "Sat, 15 Nov 2025 01:29:13 +0000",
        "category": "entertainment",
        "authors": [
            "Nov"
        ],
        "text": "A free gig by Australian rockers Amyl and the Sniffers was shut down after security fences at Federation Square were breached.\n\nThe free gig for all ages in Melbourne was cancelled soon after the band was due to take to the stage.\n\n\"Fed Square will always put safety first,\" MAP Co chief executive Katrina Sedgwick said.﻿\n\nFed Square in Melbourne said it \"did not take this decision lightly\". (Simon Schluter)\n\nThe band just supported AC/DC in Melbourne and have just been nominated for a Grammy.\n\nSedgwick said the concert was stopped mid-show.\n\n\"It came about because of multiple breaches to the perimeter fencing, which caused a very real risk of crowd crushes.\"﻿\n\n\"We didn't make this decision lightly. It was a really tough decision.\"\n\nShe said at 7.40pm capacity was reached for the show.\n\nBut people outside started pushing on the fencing, breaking it down, she said.\n\n\"At that point we announced the show was cancelled.\"\n\nLead singer Amy Taylor blew up on Instagram, saying \"you simply cannot imagine the tantrum I am having\" at missing out on performing the free gig in the band's hometown of Melbourne.\n\n\"So, so, so sorry, we're really sad,\" Taylor said in a selfie video.\n\nAmy Taylor of Amy and the Sniffers at the 2025 Coachella Valley music and arts festival. (Emma McIntyre/Getty Images for Coachella)\n\n\"We're backstage, we literally would have loved to play, we're devastated.\n\n\"The f---ing fences got crushed in, too many people, f---ing cops shut it down. (We're) p---ed as f---, p---ed off, and we're just really apologetic and so sorry.\"\n\nFed Square said in an earlier statement it was forced to cancel the show \"after multiple breaches of the perimeter fences caused a very high risk of crowd crushes\".\n\n\"It was unsafe for the show to continue,\" Fed Square said.\n\nREAD MORE: Rap legend takes Aussie brand to court over name ﻿\n\nLead singer Amy Taylor blew up on Instagram, saying \"you simply cannot imagine the tantrum I am having\". (Instagram)\n\nThere were \"multiple breaches\" of the fences at the gig, Fed Square said. (Simon Schluter)\n\n\"We did not take this decision lightly and are deeply sorry for any disappointment caused, however tonight could simply not continue.\n\n\"Our sincere apologies to the band and their fans.\"\n\nTaylor and the rest of the band returned to Instagram later to say they had put $5000 bar tabs on at seven Melbourne venues- totalling $35,000, for disappointed fans to \"have a drink on us\".\n\n\"We're not doggin' ya, it's because a bunch of people rushed the f---ing barriers and so it wasn't safe, and especially because it was all ages, we just can't have that, we don't want anyone having a s--- time,\" Taylor said.\n\nFed Square said it was forced to cancel the free gig due to safety concerns. (Simon Schluter)",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/world/scientists-document-a-death-from-a-meat-allergy-tied-to-certain-ticks/0fe0157d-1347-4dde-bfb0-b5f20e0a6b97",
        "title": "'Unmitigated tragedy': US pilot dies from eating hamburger after tick bite",
        "publish_date": "Fri, 14 Nov 2025 23:43:00 +0000",
        "category": "lifestyle",
        "authors": [
            "Nov"
        ],
        "text": "Researchers have reported what they believe is the first documented death from a meat allergy that can be triggered by tick bites.\n\nA 47-year-old New Jersey man died last year from alpha-gal syndrome, which in 2011 was first linked to bites from the Lone Star tick.\n\nMore than 100,000 people in the US have become allergic to red meat since 2010 because of the syndrome, according to one estimate.\n\nA Lone Star tick, which despite its Texas-sounding name, is found mainly in the south-east of the US. (AP)\n\nFederal health officials did not immediately respond to questions about the case, but some outside experts said it appears to be the first documented case of someone suffering a deadly alpha-gal reaction shortly after eating meat.\n\nIt's possible other deaths have happened but were assumed to be from other causes and not thoroughly investigated like this one was, said Joshua Benoit, a tick biologist at the University of Cincinnati.\n\nDr. Scott Commins, a leading alpha-gal syndrome researcher at the University of North Carolina, called the death an “unmitigated tragedy.”\n\n\"Totally unnecessary and with increased awareness, this won’t happen again,” he said in an email.\n\nThe case report was published this week in the Journal of Allergy and Clinical Immunology. The lead author was the University of Virginia’s Dr. Thomas Platts-Mills, who led the 2011 paper that first linked Lone Star tick bites to the meat allergy.\n\nPeople with alpha-gal syndrome can experience symptoms including hives, nausea, vomiting, diarrhea, severe stomach pain, difficulty breathing, dizziness and swelling of the lips, throat, tongue or eye lids. Unlike some other food allergies, which occur soon after eating, these reactions typically hit hours later.\n\nThe new report tells of a healthy airline pilot who in the summer of 2024 went on a camping trip with his wife and children. They had steak as part of a late supper. That was unusual — the man rarely ate meat.\n\nHe woke up at 2am with severe stomach pain, diarrhea and vomiting. He gradually felt better, went back to sleep, and the next morning he felt well enough to eat breakfast and walk 8km.\n\nTwo weeks later, back home in New Jersey, he went to a barbecue, where he ate a hamburger. About four hours later, he grew ill. A short time after that, his son found him unconscious on the bathroom floor. The son called paramedics, but the man was declared dead that night at a hospital.\n\nA Lone Star tick can cause people to develop allergies to red meat. (Adobe Stock)\n\nThe researchers said blood tests revealed evidence of alpha-gal syndrome. Proof that it came from a Lone Star tick is incomplete. The authors made the link based on a statement from the man's wife, who had said he had 12 or 13 “chigger” bites around his ankles earlier in the summer.\n\nBut the conclusion makes sense, as people in the eastern US sometimes mistake the bites from mites with those from larval ticks, Commins said.\n\nThe number of cases of Alpha-gal syndrome is growing for a variety of reasons, including the Lone Star tick's expanding range, more people coming into contact with the ticks and more doctors learning about it and ordering tests for it.\n\nIt can take weeks or longer for infected people to develop the syndrome, which is named for the alpha-gal carbohydrate found in the tick’s saliva. Initial reactions to red meat may be milder but grow progressively more severe, Benoit said.\n\nSome patients have only stomach symptoms, and the American Gastroenterological Association has advised that people with unexplained diarrhea, nausea and abdominal pain should be tested for the syndrome.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/queensland-family-faces-fine-over-immaculate-lawn/b38e6366-7c60-4e2f-8c82-82da512bd6df",
        "title": "Family faces fine over 'immaculate' lawn",
        "publish_date": "Fri, 14 Nov 2025 09:22:09 +0000",
        "category": "finance",
        "authors": [
            "Nov"
        ],
        "text": "A Gold Coast woman is facing an ﻿$834 fine due to her family's \"immaculate\" lawn.\n\nAmanda Blair uses a high quality synthetic turf at her home which is low maintenance and helps her partner's son's allergies.\n\n\"When my partner was mowing at the previous home, the smell and the grass clippings and things like that just set him off,\" Blair said.\n\nREAD MORE: Health star ratings could be mandated as industry fails to meet target ﻿\n\nAmanda Blair uses a high quality turf at her home which is low maintenance and helps partner's sons' allergies. (A Current Affair)\n\nThe synthetic grass covers the front and back yards but it is the footpath patch that has made her local council see red.\n\nIn a letter, Gold Coast City Council advised her to rip it up or face further action.\n\n\"Get rid of it and put real grass down and then they will come in and inspect it,\" Blair said.﻿\n\nWhile fake grass on private property is widely allowed, council laws vary on footpath rules.\n\nIpswich City Council, just like the Gold Coast, doesn't allow it. Brisbane, Logan, the City of Moreton Bay and Redland councils require residents to apply for permission.\n\nPedestrian safety is a big consideration when councils weigh up artificial turf.\n\nOther factors can include the impact on neighbours and whether water can drain freely through it.\n\nREAD MORE: Australia now has a new leading cause of death\n\nThe synthetic grass covers the front and back yards but it is the footpath patch that has made her local council see red. (A Current Affair)\n\nGold Coast City Council fears turf could become a trip hazard and attract significant heat.\n\nIf residents don't comply they'll be fined $834 and council will remove the turf at the residents' expense.\n\nBlair's local councillor Nick Marshall is sympathetic.\n\n\"This is a really good example of where the resident has a really good reason for why they're doing what they're doing,\" Marshall said.\n\n\"They keep it really well maintained so I hope we can get a good outcome.\"",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/finance/gst-inequity-study-unsw-e61-institute-research/9475b147-a3dc-41fa-af72-bb3122c4d76d",
        "title": "Hidden issue in $80b tax leaving some Aussies thousands out of pocket",
        "publish_date": "Fri, 14 Nov 2025 19:59:36 +0000",
        "category": "finance",
        "authors": [
            "Nov"
        ],
        "text": "The federal government is facing yet another call to overhaul the GST, with new research outlining the tremendous amount of unfairness baked into the current system.\n\nThe GST is the federal budget's third-largest source of income, behind income and company tax .\n\nFor 2022-23, the ATO collected $81.7 billion of it; the last federal budget forecast that figure will rise to $94.1 billion this financial year, and again to close to $100 billion in 2026-27.\n\nAustralians pay close to $100 billion in GST every year. But some cough up far more than others. (Photograph by Chris Hopkins)\n\nWhile ostensibly a flat 10 per cent rate on all goods and services sold, the number of exemptions on certain products means some Australians are paying almost 50 per cent more GST than others, even though they have similar spending habits.\n\nThe findings were published in a new report from the e61-UNSW Policy Research Partnership earlier this week, which outlined the levels of inequity in the current arrangements.\n\n\"Only around half of items attract GST,\" study co-author Dr Matt Nolan said.\n\n\"Our research finds these exemptions are causing a significant inequity where households which spend or earn similar amounts overall end up paying hugely different amounts of tax.\"\n\nAccording to the report, the amount of GST paid by low-spending households, who spend an average of $15,222 a year, ranges from $729 to $1354 – a difference of 46 per cent.\n\nFor an average household with about $37,500 in yearly expenses, there's a 37 per cent difference between the lowest and highest GST bills.\n\nThat figure eases again to 33 per cent for the highest-spending households, although in dollar terms that represents a difference of more than $2500 a year.\n\nThis is a clear example of \"horizontal inequity\", Nolan and fellow co-author Josh Clyne wrote, which brought about two clear issues in the tax system.\n\n\"As a fairness principle, horizontal inequity is bad as it involves making households contribute different amounts of tax when they have the same means to pay,\" the authors wrote.\n\n\"In terms of efficiency, taxing different consumption choices differently encourages people to change their decisions about what to consume solely due to taxation – leading households and firms to organise themselves in inefficient ways to avoid the tax (i.e. supermarkets no longer offering warm cooked chickens to focus on the untaxed cold cooked chicken substitute).\"\n\nFresh food is exempt from GST, but other food products aren't. (Dominic Lorrimer/AFR)\n\nA wide range of goods and services are currently exempt from GST, including fresh food, private health insurance, childcare, sunscreen, and charitable donations.\n\nNolan said a select few are the main culprits driving the inequity.\n\n\"For households with low spending or income, the main cause of the divergence is the type of food they buy,\" he said.\n\n\"While for high-spending and high-income households, exemptions for education and child care play a larger role.\"\n\nThe GST has frequently come under fire this year from economists who argue it needs to be broadened, given both sides of politics want to reduce income taxes despite the federal budget being in structural deficit.\n\nConsumption taxes are seen to do relatively little economic damage, and compared to other nations', the GST is relatively low, at 10 per cent compared to the OECD average of 19.4.\n\nUNSW economist Richard Holden and teal independent MP Kate Chaney put forward a proposal in August to increase the GST to 15 per cent and remove all exemptions from it .\n\nUnder the proposal, every adult would receive a $3300 \"basics rebate\", effectively providing a $22,000 GST-free threshold to ensure low-income households weren't left worse off.\n\nSimilarly, Nolan and Clyne called for all exemptions to be removed and to provide an annual rebate of around $900 to all adults, while keeping the rate set at 10 per cent.\n\nThey said the measure would be budget-neutral and remove the unfairness of the current system.\n\n\"In this scenario, people who earn and spend less are made better off, while those who are higher earners and spenders end up contributing additional tax,\" Clyne said.\n\n\"This is just one example of how GST could be redesigned so it no longer depends on what people buy.\n\n\"The exact form of compensation is up for debate, but it's clear we can reduce these horizontal inequities without punishing the most vulnerable.\"",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/menulog-closing-in-australia-thousands-lose-jobs-income-exclusive/a0898a5f-1bdb-421b-a0b6-56259ad6b96c",
        "title": "Thousands of Aussies like Alexi and Andrew just lost an income",
        "publish_date": "Fri, 14 Nov 2025 21:16:34 +0000",
        "category": "finance",
        "authors": [
            "Nov"
        ],
        "text": "E﻿xclusive: For many Australians, Menulog shutting down will make it harder to order a kebab on a Friday night.\n\nBut for Menulog drivers like Alexi Edwards, 29, the closure will slash her annual income and make it harder just to get by.\n\nShe's been doing gig work on and off for almost a decade and is one of thousands of food delivery drivers who could be financially crippled by Menulog's closure.\n\nAlexi Edwards has been a gig worker for about a decade and has driven for Menulog for about a year. (Supplied)\n\n\"It's already quite hard to afford rent on delivery driver income,\" she told 9news.com.au.\n\n\"The idea of home ownership is out of the question [and] it's only going to get worse.\"\n\nMenulog announced plans to end business in Australia on Wednesday.\n\nAbout 120 jobs will be impacted, according to reports, but that figure doesn't include the thousands of couriers Menulog relies on.\n\nThat's because Menulog couriers don't count as employees.\n\n﻿Unlike the 120 employees who will be \"fully supported with generous redundancy packages above legal requirements\", eligible couriers will only receive a four-week voluntary payment when Menulog stops taking orders on November 26.\n\nMenulog invested heavily in celebrity advertising before announcing its closure. (Menulog)\n\nEdwards, who learned about Menulog's plans to shut up shop just hours before it was headline news, is one of the lucky ones eligible for a severance package.\n\nBut she doubts it will get her far.\n\n﻿\"The cost of living crisis has already affected the delivery of economy more than most,\" she said.\n\n\"With drivers having to shift platforms, and with the increasingly lower and lower fares we've been getting, it's absolutely going to make the cost of living crisis worse.\"\n\nEspecially considering the roll-on effect Menulog's closure is expected have on her other food delivery gigs.\n\nLike many gig workers, Edwards can't get by on wages from one platform alone.\n\nShe also drives for DoorDash and Uber Eats.﻿\n\nMany gig workers deliver for multiple platforms, including Uber Eats and DoorDash. (Getty)\n\nThose platforms are set to become a lot more competitive when Menulog calls last orders and thousands of drivers move across to its rivals.\n\n\"They are now going to move over, meaning less orders, a more competitive race to the bottom, and more desperate people taking lower paid orders,\" Edwards said.\n\nMelbourne gig worker Andrew Collyer, 36, doesn't drive for Menulog but fears the mass exodus will affect his job security and income.\n\nHe worries former Menulog drivers desperate to make up for lost ﻿income will flood rival platforms and accept ﻿much lower wages just to make ends meet.﻿\n\n\"We're very likely to see a drop in pay and conditions because they'll come on the platform and take anything [in terms of pay],\" Collyer told 9news.\n\n\"Because they'll be too scared to reject orders for fear of getting deactivated by an algorithm.\"﻿\n\nFood delivery is Collyer﻿'s main source of income and he can't afford to accept lower wages.\n\nBut he also can't afford to leave platforms like DoorDash and Uber Eats.\n\nAndrew Collyer, 36, drove for Menulog in Melbourne for 12 months. (Supplied)\n\nPartly because they're his main source of income, and partly because wages and conditions with smaller competitors ﻿can be even worse.﻿\n\n﻿\"What's now happening is that we've effectively got a duopoly,\" he said.\n\n\"And [DoorDash and Uber Eats] are no doubt going to use that newfound duopoly, to squeeze out small competitors, drive down wages, drive down conditions, jack up the prices for restaurants and just generally make things harder.\"﻿\n\nDrivers already have to deal with pressure to deliver orders quickly, algorithms that can work against them, and some customers, restaurant owners and members of the public who treat them like \"second class citizens\".\n\nMenulog's closure at the end of the month is likely only going to make things worse.\n\nThe Transport Workers' Union (TWU) national secretary Michael Kaine told 9news the impact of Menulog's closure on Australian gig workers will be massive.\n\n\"These are workers who have been intentionally cut out of our workplace protections by gig platforms, with not even basic rights like a minimum wage,\" he said.\n\n\"These are workers who have been treated like robots while gig behemoths make huge profits.\"\n\nAccording to the Transport Workers' Union (TWU), the impact of Menulog's closure on Australian gig workers will be massive. ( Brent Lewin/Bloomberg via Getty Images)\n\nBut there's only so much the TWU can do for the thousands of food delivery drivers like ﻿Edwards and ﻿Collyer who will be impacted by Menulog's closure.\n\nThe union has called for new standards to create a food delivery industry that \"works for both customers and workers\" before things get worse.\n\n\"This happening furthers the point the union has been making for a very long time,\" Edwards said.\n\n\"The transport reforms have come too late, the minimum standards order is happening too late, and we lost the only platform that was Australian-made and doing the right thing.\"\n\nCollyer is also worried for some of his customers.\n\nHe regularly delivers meals and groceries to the elderly, aged care facilities, people living with disabilities, and other Aussies who rely on delivery to get fed.\n\nHe fears Menulog's exit will make it harder for them to access food delivery and could see rival platforms hike prices,﻿ making the service they rely on less affordable.\n\nHave you got a story? Contact reporter Maddison Leach at mleach@nine.com.au",
        "source": "9News"
    },
    {
        "url": "https://www.abc.net.au/news/2025-11-15/first-graduates-from-mount-isa-queensland-pathways-state-college/105983352",
        "title": "Outback students 'proud' to graduate from alternative school",
        "publish_date": "Sat, 15 Nov 2025 01:37:55 +0000",
        "category": "finance",
        "authors": [],
        "text": "When Kamara moved to a new alternative high school, it was a fresh start.\n\n\"I knew that I was going to get my education straight,\" she said.\n\nKamara said she was proud to be among the first graduates of Mount Isa's new Queensland Pathways State College (QPSC) campus for teenagers who had left mainstream school.\n\n\"In 20 years from now, I'm going to be on the wall as one of the first graduates,\" she said.\n\nThe college is for year 10 to 12 students who face significant barriers in accessing mainstream education.\n\n\"There was a high proportion of students with multiple complex needs, such as mental health, disability, experience of trauma, multiple school enrolments,\" said principal Kristie de Brenni.\n\nThe college has nine locations across Queensland, and the Mount Isa campus is the first in a remote area.\n\n\"[It] was created to specifically target this group of young people to stay and succeed,\" Ms de Brenni said.\n\nShe said the school had a reduced curriculum that focused on literacy, numeracy, workplace skills and wellbeing, which gave staff time to understand the needs of each student.\n\nGemma and Kamara say they have become friends for life. (ABC News: Maddie Nixon)\n\nKamara said having a campus with just 27 students suited her.\n\n\"My classmates are amazing, friendly, respectful. I met two of my best girls here at the school, so I'm very thankful,\" she said.\n\nOne of those friends, Gemma, who is also graduating, said the interest shown by teaching staff meant she would be able to embark on a year-long bridging course at James Cook University before studying a Bachelor of Nursing.\n\n\"The teachers and all the staff overall showed a lot of support and a lot of interest in what we wanted to do, which helped me want to stay on campus,\" Gemma said.\n\nGraduates will 'give back' to community\n\nMore than 50 per cent of the college's students had dropped out of mainstream schools before being referred, according to Mount Isa head of campus Cathy McKenna.\n\nShe said having 18 students graduating in the school's first year was \"phenomenal\".\n\n\"We're so so proud of these beautiful students,\" she said.\n\nCathy McKenna says the first year of Mount Isa's Queensland Pathways State College has been a success. (ABC News: Maddie Nixon)\n\nMs McKenna said the school was not for \"naughty students\" but for anyone who had \"had a wobble\".\n\n\"They can be disengaged in school, they can have really high anxiety, they've tried mainstream school and it hasn't been for them,\" she said.\n\nAll of the 18 students graduating are moving on to employment, TAFE or university.\n\n\"They're going to be members of the community that are giving back to the community through jobs in Mount Isa,\" Ms McKenna said.\n\n'Proud of myself'\n\nXaiden did not expect to graduate.\n\n\"It's an event that I never thought I would attend,\" he said.\n\n\"I feel proud of myself.\"\n\nXaiden and Fati hope to complete trades after they graduate. (ABC News: Maddie Nixon)\n\nHis plan is to go to TAFE, then eventually work in the mines.\n\nHis friend Fati said the two of them were \"pushed out of their comfort zones\" by their teachers and that he hoped to complete a diesel apprenticeship.\n\n\"[The teachers] have this hunch if you need help or not, and they'll stick with you if you need help instead of helping you a bit and then leaving,\" Fati said.\n\nTaya said she was treated like an adult at school, and the smaller cohort made for a supportive environment.\n\n\"We're like a little family. It's really nice,\" she said.\n\nTaya says she is looking forward to going to the formal. (ABC News: Maddie Nixon)\n\nTaya was working until she figured out her next steps, but for now was celebrating her graduation.\n\n\"I'm very excited and proud of myself because I never thought I would graduate, but I am, and I get to wear a pretty dress,\" she said.\n\nThe first year of graduates from the Mount Isa campus celebrate their formal. (Supplied: Cathy McKenna)\n\nCampus 'exceeded expectations'\n\nMs de Brenni oversees a total of nine Pathways campuses across the state and would support its expansion into a number of rural and remote locations.\n\n\"However, the department has many needs across the state that require urgent funding so that all students can access their local state school with the supports they need,\" she said.\n\n\"I am immensely proud of the work the team and students have achieved in Mount Isa.\n\n\"The outcomes have exceeded my expectations.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-11-15/pitch-for-karratha-australias-most-remote-basketball-team/105987726",
        "title": "Mining town dreams of becoming state league's most remote basketball club",
        "publish_date": "Sat, 15 Nov 2025 01:30:04 +0000",
        "category": "sports",
        "authors": [],
        "text": "Would you travel over 45,000 kilometres to play your favourite sport?\n\nIsabel Chambers, 13, has taken 30 flights between Karratha and Perth this year to play elite-level basketball.\n\nShe is one of a number of high-achieving junior basketballers in the Pilbara mining city, 1,500km north of the state's capital.\n\nKarratha is a two-hour flight from Perth, where the majority of NBL1 West teams are based. (ABC Pilbara: Kelsey Reid)\n\nThe next generation\n\nFor Isabel, it is a mammoth commitment juggling travel, school and three different basketball teams.\n\n\"Sometimes I haven't really wanted to go down. I've wanted to stay here with my family,\" she said.\n\n\"But once I get down there, I'm fine and I'm happy to play with my team.\"\n\nIsabel has been selected to represent WA at a national competition in Melbourne in January.\n\nIsabel Chambers has travelled to Perth more than 30 times this year to play elite basketball. (ABC Pilbara: Kelsey Reid)\n\nShe is already on a pathway to the NBL1 West — WA's state basketball league — playing for the Cockburn Cougars' development squad.\n\nIsabel's father, Aaron Chambers, said the balance was hard, but her drive was inspiring to her family and three younger sisters.\n\n\"Emotions sometimes fly high with all the travel and you know, lack of sleep and social sacrifices,\" he said.\n\n\"But I think it's all been worth it with everything that she's achieved.\"\n\nCale Buzzard, 17, visits the basketball courts at least once a day and dreams of playing NBL1. (ABC Pilbara: Kelsey Reid)\n\nYear 12 students Cale Buzzard and Ethan Wood-Hill also live and breathe the sport.\n\nAmid juggling ATAR exams and casual work, the duo are at the courts at least once a day training, playing, refereeing or coaching.\n\nThey have completed more than 10 trips to Perth this year for try-outs and training with the Perth Redbacks, and dream of making it to the NBL1 one day.\n\nEthan Wood-Hill, 17, also dreams of playing NBL1 and travels to play with the Perth Redbacks. (ABC Pilbara: Kelsey Reid)\n\n\"The way they train — the knowledge the coaches have is just so high compared to what we know up here,\" Cale said.\n\n\"Obviously, our coaches are amazing, but the level down there is just different, and I feel like we could really use that to help develop up here.\"\n\nBoth Cale and Ethan will move to Perth in 2026 for better access to NBL1 West programs and development opportunities.\n\nSparking Karratha's basketball dream\n\nA recent surge in youth development has led the Karratha Basketball Association (KBA) to launch a bid to be the newest NBL1 West team.\n\nIt would make them the most remote state team in the country by almost 1,000km.\n\nBasketball is a popular sport in Karratha, with more than 2,000 junior and senior players.\n\nIn 2023, Karratha Leisureplex hosted an exhibition game between the Geraldton Buccaneers and Perth Redbacks.\n\nKarratha played host to the Perth Redbacks and Geraldton Buccaneers in 2023. (Supplied: Arctic Moon Photography)\n\nIt was the first state league basketball game played in the north-west and tested the town's appetite for a team.\n\nThe game drew in a sell-out crowd.\n\n\"It really created a great hype that people wanted to see that sort of level here more often,\" former KBA president Jodie Swaffer said.\n\n\"If other regional locations can make it happen, it kind of gave us that spark to go, we can do it too.\"\n\nGeographic and infrastructure challenges\n\nHowever, infrastructure and Karratha's remote location loom as major obstacles in the association's bid to join the league.\n\nBasketball currently takes place on three indoor courts at the Karratha Leisureplex, which also hosts badminton, netball, gymnastics, futsal, pickleball and volleyball, as well as servicing the local high school.\n\n\"We are absolutely maxed out — every … minute that is available to us on court we are taking,\" KBA president Nathaniel Kett said.\n\nNathaniel Kett says there is no extra court time available locally. (ABC Pilbara: Kelsey Reid)\n\nThe city has a long-term plan to invest in further courts due to the level of demand.\n\nIn the meantime, the KBA concedes it will not be feasible to play state games without a new stadium or significant upgrades.\n\nKarratha's distance from Perth, where most clubs are based, poses another obstacle.\n\nA two-hour flight between Perth and Karratha can cost up to $1,000 per person each way.\n\nThe under 18s boy's representative team, the Cyclones, train at Karratha Leisureplex. (ABC Pilbara: Kelsey Reid)\n\nNBL1 open to expansion\n\nThere are currently four clubs in the league from outside the Perth region: Bunbury, Geraldton, Kalgoorlie and Mandurah.\n\nWith the newest club — the Kalamunda Suns, from Perth's east — joining in 2008, the NBL1 West is interested in growing the league, but not at the cost of quality competition.\n\nCale Buzzard, 17, will move to Perth at the start of 2026 to pursue his dreams. (ABC Pilbara: Kelsey Reid)\n\nTo help support potential expansion, a newly developed procedure is set to be released next month to help clubs assess whether they fit the strict criteria.\n\nIt will include items such as optimal venue standards, a requirement for both a men's and women's team, and at least a two-year lead-in time for a new club.\n\nBasketball WA chief basketball officer Tyrone Thwaites said any new club would need to raise the bar of the competition.\n\nThe three indoor courts at Karratha Leisurplex are in use for a combined 9,796 hours per year. (ABC Pilbara: Kelsey Reid)\n\n\"It is a complex process, it's a long process,\" he said.\n\n\"That's because running an NBL1 program is not a cheap exercise — it's a fulfilling one and we want to make sure that clubs that join do so in a way that is sustainable and makes sense.\n\n\"It's not something that we do on a whim.\"\n\nThe KBA is yet to make a formal application to join NBL1 West and hopes to join the league within the next three to five years.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-11-15/australia-refining-rare-earths-environmental-challenges/105969994",
        "title": "Can Australia refine rare earths without repeating China's mistakes?",
        "publish_date": "Sat, 15 Nov 2025 01:00:01 +0000",
        "category": "finance",
        "authors": [],
        "text": "Australia holds a plethora of rare earths — minerals essential for all sorts of cutting-edge technologies from wind turbines to hypersonic missiles.\n\nUntil now, most of them have been sent to be refined in China.\n\nThat is largely because the process is dirty, expensive, and politically unpopular.\n\nWastewater ponds on the outskirts of the city of Baotou in China's Inner Mongolia have polluted soil and water. (Reuters: File)\n\nBut after last month signing a $13 billion critical minerals deal with the United States to boost production and refining, Australia must deal with some significant environmental challenges — mostly around water.\n\nMarjorie Valix, a professor of chemical engineering at the University of Sydney, who researches sustainable mineral processing, said Australia has plenty of opportunity — and responsibility — in this space.\n\n\"Rare earths aren't rare in Australia — especially light rare earths,\" said Professor Valix.\n\n\"But water is one of the vulnerabilities.\"\n\nThe bottleneck\n\nWhen researcher Jane Klinger first visited China's Bayan Obo mine at Baotou in Inner Mongolia — the world's largest rare-earth operation — more than a decade ago, she expected to see the future of green technology.\n\nWhat she found instead was a cautionary tale: acidic wastewater and radioactive residue in unlined ponds along with contaminated rivers and farmland.\n\nChina has reduced its use of the most-polluting refining processes. (Reuters)\n\n\"The stuff we want is typically a very small percentage of what's dug up,\" Professor Klinger, author of Rare Earth Frontiers, told the ABC.\n\n\"And then there's the waste that's generated to separate the valuable bits from the rest of the rock.\n\n\"People don't quite grasp how much waste we're talking about.\"\n\nWhat purpose do critical minerals serve? Australia is joining the European Union and the United States in establishing strategic reserves of critical minerals, but what do they actually do, and why are they so important?\n\nFor every tonne of rare-earth oxide produced, roughly 2,000 tonnes of acidic wastewater are left behind.\n\nIt was a local taxi driver, pointing to a new hospital built to treat bone disorders, who tipped her off to what was unfolding around Baotou.\n\nShe discovered cases of cancers, arsenic poisoning and birth and joint deformities linked to years of unregulated dumping.\n\nAustralian National University professor of economic geology John Mavrogenes said the Chinese companies were mining by drilling and pouring chemicals into the holes.\n\n\"They found it was so bad environmentally that even China decided maybe they should quit,\" he said.\n\nRare earth leaching pools in Myanmar. (Supplied: Global Witness)\n\nThe health and environmental impacts were so severe Beijing has since tightened regulations and cleaned up some sites.\n\nIt has also shifted much of its most-polluting refining methods to neighbouring Myanmar.\n\nIn Jiangxi province, China's other main rare earth mining hub in the south, more than 100 mine sites have been shut down in the past decade and converted into parks, according to local media.\n\nChina has introduced stricter regulations on rare earth refining to reduce damage to the environment. (Reuters: Stringer)\n\nLearning from China's mistakes\n\nExperts insist Australia can do better.\n\nThe Donald Rare Earth and Mineral Sands mine in western Victoria — which was given major projects status last month — will use a method that uses fewer chemicals than hard-rock mining to extract rare earths.\n\nOnce operational, the site is expected to become the fourth-largest rare earth mine in the world outside China.\n\nDaniel Emes, a radiation consultant on the project, said the ore there would be \"below the threshold\" for radioactivity under Australian regulations.\n\nThe Donald Rare Earth and Mineral Sands mine is located in western Victoria. (Supplied: Astron)\n\nThe company behind the project, Astron, plans to rehabilitate the land and send its rare-earth concentrate to Utah for further processing, where uranium will also be recovered.\n\nVictoria bans uranium mining outright, but the US intends to use the by-product as fuel for nuclear power plants.\n\nProfessor Klinger said one of the most impactful lessons from what she found in China was simple.\n\n\"Don't dump this stuff in tailings ponds without liners,\" she said.\n\n\"Don't contaminate groundwater, but also pay attention to 'who' is doing the modelling and monitoring.\"\n\nMarjorie Valix experiments with techniques that are less water-intensive. (Supplied: University of Sydney)\n\nWhen the Donald mine starts production next year, processing is to take place in enclosed sheds, with waste sealed into containers and shipped off-site.\n\nBut Australia has not always had a spotless record: past projects such as fracking in the northern territory and old coal mines show how environmental oversight can fail.\n\nThe water dilemma\n\nChina dominates the separation and refining of rare earths, controlling over 90 per cent of global production.\n\nIn Western Australia, Iluka Resources is building Australia's first rare earths refinery.\n\nIluka will refine heavy rare earths which are essential in modern weapons. (Supplied: Iluka)\n\nThe process — crushing rock, separating minerals, and neutralising the waste — requires vast amounts of water.\n\nIluka's refinery will consume just under 1 gigalitre of groundwater per year.\n\nIluka head of rare earths Dan McGrath told the ABC the refinery would operate as a zero liquid discharge facility.\n\n\"Unlike other facilities, we don't discharge water to the environment at any point,\" he said.\n\n\"Our design avoids generating liquid waste altogether, and the reagents we use create a saleable fertiliser by-product instead of requiring disposal.\n\n\"All remaining solids will be disposed of in existing mine voids, removing the need for new waste containment facilities or above-ground disposal facilities.\"\n\nProfessor Mavrogenes said water scarcity was already shaping where new mining projects can go ahead.\n\n\"Water is an issue because most ores are located in areas that don't have enough water,\" he said.\n\nScientists said heap leaching with sulphuric acid is one of the most impactful parts of refining. (Reuters: Joe Penney )\n\nThe Iluka refinery will produce both light and heavy rare earth oxides used in advanced manufacturing of items, including medical devices and defence weaponry.\n\nA wastewater treatment plant will form part of the facilities, but the plan has drawn criticism amid ongoing water shortages.\n\nIn Victoria, Astron has secured water entitlement from Grampians Wimmera Mallee Water.\n\nGeologists including Professor Mavrogenes have warned that a secure water supply and planning needed to account for climate change.\n\nIluka plans to build a rare earths refinery next to its mining operations. (Supplied: Iluka)\n\n\"Flooding can shut down processing, especially with heap leaching,\" he pointed out.\n\nHeap leaching is where a chemical solution is trickled through a heap of crushed ore, often in a pond, to dissolve the metals.\n\nOther environmental concerns once shadowed Lynas Rare Earths, Australia's largest producer of rare earths, which ships semi-processed concentrate to Malaysia for refining.\n\nThe company initially faced local protests over low-level radioactive waste.\n\nKuan Seng How, assistant professor in Universiti Tunku Abdul Rahman's Department of Mechanical and Materials Engineering, said Lynas had since built a permanent, sealed facility to prevent groundwater seepage — an expensive but necessary fix.\n\nProtests were held in Malaysia calling for a suspension of the Lynas rare earths processing plant. (Reuters: Liz Lee)\n\nTogether, Iluka's new refinery and Lynas' remediation effort illustrate the same lesson: refining is not just an engineering problem but a resource-management one.\n\nA cleaner frontier\n\nChina now lines its wastewater ponds with bentonite clay to reduce leakage and collects some run-off for reuse.\n\nYet even those measures have not stopped some seepage leaking outward, according to a recent article published in the Chinese journal Modern Mining.\n\nAustralia is home to many rare earths, many found in mineral monazite in Iluka's mines. (Reuters: Maxim Shemetov)\n\nIndustry and researchers are now exploring waterless extraction technologies such as solvolysis — a process that uses chemical solvents instead of water to extract rare earths.\n\n\"It can leach and separate the metals in one step,\" Professor Valix said.\n\n\"But it hasn't been scaled up yet — and right now it's more expensive.\"\n\nShe sees water management as the defining test of Australia's ambitions.\n\n\"In chemical engineering, we're already modelling water use across extraction and processing steps to minimise industries to manage it more sustainably,\" she said.\n\nHer colleague Susan Park from the University of Sydney added that as countries raced to upgrade rare earth processing, Australia must invest more in knowledge.\n\n\"One of the issues is the absence of long-term research and development into these technological processes and training people,\" she said.\n\nLynas bags rare earth concentrate in sacks and ships it to Malaysia to be refined. (Reuters: Melanie Burton)\n\nChina may already be a step ahead, testing new techniques on a large scale.\n\nIn January, the Chinese Academy of Sciences claimed a breakthrough: an electrokinetic extraction technique that slashes the use of leaching agents by 80 per cent, mining time by 70 per cent and energy consumption by 60 per cent.\n\nAccording to the scientists who revealed the development in the journal Nature Sustainability, the method could soon be viable for large-scale production.\n\nFor Australia, Professor Valix said the barrier was not capability but commitment.\n\n\"It's not that we don't have the technology,\" she said.\n\n\"What we don't have is the investment and the uptake market here like battery makers or manufacturers.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-11-15/rugby-union-wallabies-prepare-to-face-ireland/106013576",
        "title": "Wallabies vow to banish 'hurt' in Ireland Test",
        "publish_date": "Sat, 15 Nov 2025 00:39:38 +0000",
        "category": "sports",
        "authors": [],
        "text": "Wallabies captain Harry Wilson has promised his side will \"empty the tank\" when they face Ireland in Dublin on Sunday morning AEDT.\n\nThe Wallabies play the Irish a week after recording a demoralising 26-19 loss to Italy in Udine.\n\nThe result meant the Wallabies had posted back-to-back defeats on their five-Test spring tour.\n\nThey lost 25-7 to England at Twickenham a fortnight ago after opening their tour with an unconvincing 19-15 win over Japan in Tokyo.\n\nWilson said the Wallabies were determined to make up for their lacklustre performance against Italy.\n\n\"There was a lot of hurt after that Italy game, it hit the whole squad hard,\" Wilson said.\n\n\"Italy are a really good side and they taught us some harsh, harsh lessons in that game.\n\n\"But from getting on the training field on Tuesday, we've been all about moving forward towards Ireland and have had a really good week's preparation.\n\nWallabies call in reinforcements to stem European slide in Dublin The Wallabies have recalled several big-name players for their penultimate Test of 2025, as coach Joe Schmidt returns to his old Irish stamping ground.\n\n\"We're all really excited. After a few disappointing performances, there's definitely a bit more spice around the group, wanting to go out there and get a big result.\"\n\nJames O'Connor's return at fly-half was among the changes made to the Wallabies' match-day squad for the Ireland Test.\n\nWilson said the Wallabies would benefit from O'Connor's experience.\n\n\"James has been awesome since coming in,\" Wilson said.\n\n\"He's got that confidence straight away, and he's brought a lot of energy and belief after a couple of tough weeks for us.\n\n\"And when you add Lenny [Ikitau] and Allan [Alaalatoa] into it, you add a little bit more polish there too.\n\n\"I feel as if they've really lifted all the boys, and we all went with them. We've had a good week at training, but it's now about going out there and performing Saturday night (local time).\n\n\"The energy has been really good. We're near the end of our tour, so the boys know there's just a couple more weeks to empty the tank for.\"\n\nThe Wallabies will wrap up their spring tour with a Test against France in Paris next weekend.\n\nAAP/ABC",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-11-15/man-jailed-for-stealing-banksy-print-of-balloon-girl-painting/106013434",
        "title": "Man jailed for stealing signed print of Banksy's Girl with Balloon painting",
        "publish_date": "Sat, 15 Nov 2025 00:36:07 +0000",
        "category": "entertainment",
        "authors": [],
        "text": "A man who stole a signed print of Banksy's Girl with Balloon painting from a London gallery has been jailed for 13 months.\n\nLarry Fraser, 49, used a hammer to smash into the Grove Gallery and steal the print on the evening of September 8 last year.\n\nThe work, which police said was valued at £270,000 ($544,000), features a young girl reaching for a red heart-shaped balloon. Several murals around London and elsewhere depict the iconic image.\n\nThe gallery was showcasing a collection of 13 Banksy pieces worth about £1.5 million ($3 million) when the print was stolen.\n\nLarry Fraser used a hammer to smash his way into the Grove Gallery in London. (Reuters: Metropolitan Police)\n\nDespite trying to conceal his identity with a mask, Fraser was caught on camera, and police tracked him down two days after the burglary.\n\nHe pleaded guilty in October and was sentenced to 13 months in prison on Friday at Kingston Crown Court.\n\n\"This is a brazen and serious non-domestic burglary,\" Judge Anne Brown said while sentencing Fraser.\n\nLarry Fraser, 49, was sentenced to 13 months in prison. (Reuters: Metropolitan Police)\n\nDetective Chief Inspector Scott Mather told the court that Banksy's Girl with Balloon \"is known across the world\".\n\n\"We reacted immediately to not just bring Fraser to justice but also reunite the artwork with the gallery,\" he said.\n\nThe Grove Gallery's manager, Lindor Mehmetaj, said it was remarkable that the police had managed to recover the artwork so quickly.\n\n\"It’s very hard to put into words the weight that comes off your shoulders,\" Mr Mehmetaj said.\n\nThe painting's origins\n\nGirl with Balloon is one of Banksy's most recognisable works.\n\nIt first appeared on the streets of London's Shoreditch neighbourhood in 2002.\n\nIn 2004, 150 signed and 600 unsigned prints were released.\n\nBanksy pranks art auction Notorious and elusive street artist Banksy's famous Girl With Balloon shreds itself shortly after selling for almost $1.9 million at auction at Sotheby's in London.\n\nBanksy then created versions of the painting on London's South Bank in 2004 and at Israel's barrier at the West Bank in 2005.\n\nIn 2018, a framed version of the original piece sold for £1 million at Sotheby's auction house, but immediately after the sale, it was cut up by a shredder hidden in its frame.\n\nBanksy claimed responsibility for the stunt, releasing an image of the shredding on Instagram with the words: \"Going, going, gone …\".\n\nIn 2021, it was resold as Love is in the Bin at Sotheby's for £18.6 million.\n\nBanksy's rise\n\nBanksy, who has never confirmed his full identity, began his career spray-painting buildings in Bristol, England.\n\nNew Banksy artwork at London's High Court The latest mural from the British street artist depicts a judge beating a protester and is being seen as a reaction to the arrest of hundreds of demonstrators supporting banned group Palestine Action.\n\nHe rose to fame for his ironic outdoor graffiti with political themes, and has become one of the world's best-known artists.\n\nHis famous paintings include two male police officers kissing, armed riot police with yellow smiley faces, and a chimpanzee with a sign bearing the words, \"Laugh now, but one day I'll be in charge.\"\n\nSeveral of his artworks have been defaced or stolen, whether for their value, public placement, or intrigue.\n\nA satellite dish depicting a wolf — part of Banksy's animal-themed artwork series revealed in summer 2024 — was removed, possibly stolen, less than an hour after the artist claimed it on his social media.\n\nReuters/AFP",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-11-15/macdonald-valley-public-school-180-year-anniversary/105999640",
        "title": "NSW school endures floods, fires and an angry camel to mark 180 years",
        "publish_date": "Sat, 15 Nov 2025 00:30:00 +0000",
        "category": "finance",
        "authors": [],
        "text": "It is not every day a school gets put into lockdown because of an aggressive camel next door.\n\nBut that is just one of the charms of Macdonald Valley Public School in Greater Sydney, where the animal has caused mayhem on multiple occasions, including \"eating\" the side mirror of a teacher's car.\n\nWith only 13 students and four part-time teachers, the Central Macdonald school is celebrating 180 years since its doors opened.\n\nAccording to the Department of Education, it is the oldest continuously operating government school in the state.\n\nThe kids get the chance to see what primary production is all about. (ABC Central Coast: Shauna Foley)\n\nThe school has welcomed students from generations of families over the years. (ABC Central Coast: Shauna Foley)\n\nSarah Allen has been the principal for almost five years and cannot imagine ever leaving.\n\n\"When I first came here, it was like I had died and gone to heaven,\" she said.\n\nThe latest data from the Australian Bureau of Statistics shows Lower Macdonald, where most of the school's students live, has fewer than 300 residents.\n\nMs Allen said the longevity of the school was a testament to the small but connected community.\n\n\"I mean, so many of the people you meet on the street would be ex-students or teachers, or was the bus driver — it's lovely,\" she said.\n\nThe Sternbecks arrived in the early 1800s and were among the first non-Indigenous families to settle in the region.\n\nRachel Slater, a sixth-generation Sternbeck, operates a daycare centre on the same property as the primary school.\n\nRachel's grandfather, Clarence Sternbeck, was the fourth generation to be born in Lower MacDonald. (Supplied: Rachel Slater)\n\n\"My dad went here, my sister went here, and now my two children are here,\" she said.\n\n\"It's really special to have so many of us walk these halls.\"\n\nPlagued by natural disasters\n\nIn 2020, the community was a little more than an hour away from the Gospers Mountain mega-blaze.\n\nThen in 2022, the community banded together as the Macdonald River rose to a record level of more than 13 metres.\n\nStudents posing for a class photo in the 1940s. (Supplied: Sarah Allen)\n\nStudents from the 1970s posing in fancy dress-up. (Supplied: Sarah Allen)\n\nToday's Macdonald Valley Public School cohort. (Supplied: Sarah Allen)\n\n\"The community has gone through a lot here, but they really rally behind each other,\" Ms Allen said.\n\nShe said it was important for the students to experience nature as well as regular studies.\n\n\"Having the students immerse themselves in the bush is crucial so that they understand the land they live on,\" Ms Allen said.\n\nShe has been on a learning curve of her own, having gone from a school of thousands to one with barely enough students to fill a classroom.\n\n\"We're definitely like a family, but a family with boundaries,\" she said.\n\nLocation not an issue\n\nFrom Macdonald Valley Public School, the nearest major supermarket is more than a 30-minute drive away and can only be accessed by ferry.\n\nMs Allen said it was vital that the school's remote location did not restrict the students' opportunities.\n\nSarah Allen has been at the school for almost five years. (ABC Central Coast: Shauna Foley)\n\n\"I think there's a misconception that small schools miss out on a lot of things, but we want to be the exception,\" she said.\n\n\"We go to the Opera House, we go to plays in the city — we're making sure they're not sort of stuck here.\"\n\nMany of the excursions have been encouraged by music teacher Susan Walker, who has taught scores of students in the 10 years she has been at the school.\n\n\"It's rather surreal when you're in a place where you teach the kids of the kids you previously taught,\" she said.\n\n\"I've loved every second of my time here.\n\n\"I don't know when I'll stop because I just adore working with [the students] so much.\"\n\nThe schoolyard in the early '70s. (Supplied: Sarah Allen)\n\nThe teachers work hard to ensure that the students of today don't miss out on the opportunities available to those in bigger, less remote schools. (ABC Central Coast: Shauna Foley)\n\nMs Walker said her greatest joy came when a student picked up an instrument for the very first time.\n\n\"Even if it's a fairly simple instrument, like the xylophone or recorder, the look on their face when they realise they're making music is unbeatable,\" she said.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-11-15/trump-agriculture-beef-tariff-exemptions/106013518",
        "title": "Trump reverses course on beef tariff as pressure builds over cost of living",
        "publish_date": "Sat, 15 Nov 2025 00:14:49 +0000",
        "category": "finance",
        "authors": [],
        "text": "Hundreds of food products, including beef and oranges, are now exempted from US trade tariffs, according to an executive order signed by President Donald Trump on Friday.\n\nThe order is in response to concerns about persistently high grocery prices in the US, marking a sharp reversal for the president, who long insisted his import duties were not fuelling inflation.\n\nMr Trump up-ended the global trade system earlier this year by imposing 10 per cent base tariffs on imports from every country, plus additional specific duties that varied between nations.\n\nThe executive order also removes tariffs on tea, fruit juice, cocoa, bananas, tropical fruit and tomatoes.\n\nRecord-high beef prices have been a particular concern, and Mr Trump said he intended to take action to try to lower them.\n\nBeef demand trumps tariffs The beef trade between Australia and the United States is currently a one-way street. That's unlikely to change.\n\nMeat is one of Australia's top exports to the US, second only to non-monetary gold.\n\nAustralia exported 394,716 tonnes of beef to the US in 2024, valued at $4.16 billion, according to Meat and Livestock Australia.\n\nThe US has remained the largest market for Australian beef exports despite the tariffs imposed in April.\n\nTrade Minister Don Farrell welcomed the reversal in a statement on Saturday.\n\n\"Tariffs are an act of economic self-harm and ultimately hurt American consumers,\" he told the ABC.\n\n\"We maintain our position that tariffs on Australian products are unjustified, and [we] continue to advocate for their removal.\"\n\nThe executive order acknowledged that domestic demand for such products outstripped domestic capacity to produce them.\n\nSome of the products covered are not produced in the US at all.\n\nSpeaking on Air Force One on Friday evening, the president told reporters he did not think more tariff roll-backs would be necessary.\n\nPressure over grocery prices\n\nThe new exemptions took effect retroactively at midnight on Thursday.\n\nThey come after a string of victories for Democrats in state and local elections in Virginia, New Jersey and New York City, where affordability was a key topic.\n\nFriday's order followed framework trade deals announced on Thursday, which will eliminate tariffs on certain foods and other items imported from Argentina, Ecuador, Guatemala and El Salvador.\n\nMr Trump has focused squarely on the issue of affordability in recent weeks while insisting that higher costs were caused by policies enacted by former president Joe Biden and not his own.\n\nDonald Trump said he was not planning to make further exemptions. (Reuters: Annabelle Gordon)\n\nEconomists say high grocery prices have been partly fuelled by import tariffs and could rise further next year as companies start passing on the full brunt of the import duties.\n\nRichard Neal, the top Democrat on the US House of Representatives' tax-writing body, said the Trump administration was \"putting out a fire that they started and claiming it as progress\".\n\n\"The Trump administration is finally admitting publicly what we've all known from the start: Trump's Trade War is hiking costs on people,\" he said in a statement.\n\n\"Since implementing these tariffs, inflation has increased and manufacturing has contracted month after month.\"\n\nABC/AP/Reuters",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-11-15/toolondo-golf-club-thrives-in-regional-victoria/105945988",
        "title": "Golf club in the scrub with no power or greens survives on community spirit",
        "publish_date": "Sat, 15 Nov 2025 00:00:00 +0000",
        "category": "sports",
        "authors": [],
        "text": "Deep in the Wimmera scrub where wattles bloom gold in early spring and phone reception fades, the hum of a generator and the smell of wood smoke mark the heart of one of Victoria's most-loved little golf clubs: Toolondo.\n\nAs many other regional sports clubs struggle to attract volunteers and players, this 18-hole course 45 kilometres south of Horsham in western Victoria continues to thrive, despite no mobile phone reception, no electricity, no mains water and no paid staff.\n\nEach year, the club in the scrub pulls about 50 members from near and far.\n\nThe clubhouse holds many fond memories for members. (ABC News: Tamara Clark)\n\nPlayers connect not over luxury but laughter, light-hearted rivalries and homemade cream cakes.\n\nLocal farmers carved the first nine holes in the 1950s, before expanding to 18 holes the following decade.\n\nAs the years have gone by, many small neighbouring clubs have folded, including Pimpinio further north in the Wimmera.\n\nBut Toolondo endures.\n\nSo what makes it so special?\n\nToolondo Golf Club in regional Victoria has about 50 members. (ABC News: Tamara Clark)\n\nHeart and hospitality\n\nEach Saturday in winter, players fill the historic clubhouse, a former classroom from a local school.\n\nThere is no stocked bar. Drinks arrive by ute each weekend.\n\nAnd there is no wi-fi to distract from conversation.\n\nThe fire drum at Toolondo Golf Club is a meeting place for the small regional community. (ABC News: Tamara Clark)\n\nBeyond the fairways fragrant with Australian botanicals, kangaroos hop, emus nest, and sunsets glow over the wetlands where brolgas can be spotted.\n\nSwan Hill golfer Lindsay Watts has competed in the Australian and Victorian Opens.\n\nHe has been making the 540-kilometre round trip to Toolondo for 35 years.\n\n\"I have played a lot of courses, but Toolondo is unique; I can par it but I have never beaten it and that is a challenge,\" Watts said.\n\n\"But it's the people — I love the people, they are so welcoming.\n\n\"Playing here is the highlight of my year. It's my happy place.\"\n\nAllan Parfett has been with Toolondo Golf Club for a decade, since his former club at Brim folded. (ABC News: Tamara Clark)\n\nAccording to club president Allan Parfett, offering a sense of homecoming is intentional.\n\n\"We welcome everyone. It's a real country community and I think we have become pretty well-known for our afternoon teas,\" Mr Parfett said.\n\nThe famous spreads of sweets, sandwiches and scones are made in the simple volunteer kitchen.\n\nAnd former club champion Lorraine O'Beirne, 91, still sends her son Glen O'Beirne to the club each Saturday bearing mum's popular sausage rolls.\n\nToolondo golfers enjoy a drink after a day on the course. (ABC News: Sue Dunstan)\n\nValue of simplicity\n\nToolondo's grassroots affordability is a ticket to the sand scrapes at a time when golf's expense can be an inhibiting factor.\n\nAccording to a 2024 Golf Australia survey of operations, the average club membership in regional Victoria costs between about $700 and $1,000 annually.\n\nCheap fees keep people coming back to Toolondo Golf Club. (ABC News: Tamara Clark)\n\nIn Melbourne, memberships for private clubs cost an average of more than $3,000 a year, and for elite clubs like Kingston Heath and Victoria Golf Club can exceed $7,000.\n\nWeekend greens fees may cost between $35 and $50 in regional Victoria — or $80 to $100 in metropolitan areas — according to the Golf Australia 2024 Annual Report.\n\nAt Toolondo, membership is $50 for newbies — and the greens fee is $5.\n\nA stumpy lizard (Tiliqua rugosa) enjoys the sun at Toolondo Golf Club. (ABC News: Tamara Clark)\n\nWimmera District Golf Association president Lee English said Toolondo was a symbol of survival for an ageing sport.\n\n\"At the moment, there are 29 golf clubs in the Wimmera district — we have lost about five clubs in recent years,\" Mr English said.\n\n\"There are probably about 8,000 golfers in the region, but that is well down on what we had probably 10 years ago.\"\n\nHe blamed reduced funding and high participation costs.\n\n\"They used to hold clinics at school, competitions, but they have dumped all that. Maybe it's time to go back to that community ethos, community effort, community theme,\" Mr English said.\n\nToolondo's golf course smells of native botanicals. (ABC News: Tamara Clark)\n\nCharitable community charm\n\nBrimpaen farmer Ron Winfield said it was the community that drew him back each week.\n\n\"It's an outing. You don't necessarily go for the golf; it's the people,\" Mr Winfield said.\n\n\" Everyone sits around, has a chat, sometimes that is the only time of the week you see people. \"\n\nThat spirit fuels the club's charity days.\n\nToolondo Golf Club has a long and rich history. (ABC News: Tamara Clark)\n\nWhen local boy Joel Rees had a stroke aged three, the community rallied for him.\n\nFor the past 15 years, Toolondo has hosted a tournament for the Royal Children's Hospital Good Friday Appeal, raising thousands in his name.\n\n\"I can't thank the Toolondo Golf Club enough for its support,\" Joel said.\n\n\"It's a place that not only cares for its members but also for the community and that makes a real difference to the lives of a lot of people.\"\n\nIn August, the club hosts its annual four-person ambrose, which attracts people from all over the state.\n\nLadies captain Liz Jackman volunteers many hours each week to keep the club thriving. (ABC News: Tamara Clark)\n\nIt's a 27-hole tournament — but to ladies captain Liz Jackman, it's a reunion.\n\n\"We've shared wine and cheese, smoked oysters and champagne with other teams. It's a real fun day. It's challenging, but it's the country atmosphere,\" Ms Jackman said.\n\nLiz Jackman swings like a pro. (ABC News: Tamara Clark)\n\nSelf-described golf \"hacker\" Jack Alexander said, despite his handicap of 39, he would never miss a week at the course.\n\n\"It isn't the game; it is the people. It is like a family, a real family, everyone looks out for everyone,\" he said.\n\nFrom wood fires to wattles, Toolondo proves you don't need polished greens or city budgets to create a place of belonging.\n\nThrough the club, Allan Parfett and Liz Jackman are friends for life. (ABC News: Tamara Clark)\n\nABC reporter Sue Dunstan is a volunteer committee member at Toolondo Golf Club.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-11-15/victoria-voluntary-assisted-dying-amendments/106011806",
        "title": "Changes to Voluntary Assisted Dying laws pass Victorian parliament",
        "publish_date": "Fri, 14 Nov 2025 23:51:04 +0000",
        "category": "lifestyle",
        "authors": [],
        "text": "Reforms to give Victorians greater access to voluntary assisted dying (VAD) passed parliament late on Friday night.\n\nThe reforms remove a \"gag clause\" that had prevented doctors from raising VAD with patients.\n\nThe amendments also stipulate that a health practitioner who conscientiously objects to VAD must provide a minimum amount of information to a patient about the option.\n\nThere are also changes to eligibility criteria that mean people with neurodegenerative diseases will no longer need a third prognosis if their expected life span is between six and 12 months.\n\nThe amendments pased Victoria's parliament on Friday. (ABC News: Danielle Bonica)\n\nThe amendments passed the Upper House 26 to 14 after MPs from all sides were granted a conscience vote.\n\nOpposition leader Brad Battin previously opposed VAD, but changed his mind to vote for the reforms after personal experiences with a friend.\n\nVictoria led the country in 2017, becoming the first state to pass laws giving terminally ill patients the option to die voluntarily.\n\nSince then, 1,683 terminally ill Victorians have accessed voluntary assisted dying.\n\nChanges to assisted dying welcomed\n\nOne such person was Alex Blain, who took legally prescribed drugs to end his life on January 5, 2021.\n\nAlex was diagnosed with an extremely rare cancer in 2019 and underwent 19 rounds of chemotherapy.\n\nLiz Tower's partner, Alex, used Victoria's voluntary assisted dying laws. (ABC News: Costa Haritos)\n\nHis partner, Liz Tower, said Alex appreciated having access to VAD when the chemotherapy became ineffective.\n\n\"No medicine, no therapy gave Alex as much energy and dignity and control as his experience of being approved to use the voluntary assisted dying medication,\" she said.\n\nAlex Blain with his family, including fiancée Liz (left), mum Gillian, sister Julie, and dad David (right). (Supplied: Liz Towers)\n\nMs Tower said her partner would have welcomed the amendments that were passed on Friday.\n\n\"The amendments mirror exactly what Alex hoped for. They reduce the requirements for patients to have to advocate for themselves, which is eliminating the gag clause, they open the diagnosis timeline to people and, ultimately, they make the process easier,\" she said.\n\n\"People who are sick shouldn't have to do hard things. They're already doing the hard thing, which is being sick.\n\n\"He would be really comforted to know that other people would be helped the same way he was.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-11-15/mona-founder-david-walsh-on-future-of-tasmanian-museum/105982838",
        "title": "Mona has lost $408m but David Walsh is 'completely happy'",
        "publish_date": "Fri, 14 Nov 2025 22:38:44 +0000",
        "category": "finance",
        "authors": [],
        "text": "Hobart's landmark Museum of Old and New Art (Mona) has racked up a staggering $408 million in losses since it opened in 2011, but founder David Walsh insists he is \"completely happy with the finances\".\n\nPreviously unreported corporate filings for parent company Moorilla Estate, which owns and operates Mona, show that at last count, the celebrated art museum, brewery, winery, spin-off festivals and other associated businesses lost $63 million in 2023-24, up from $60 million the year before.\n\nMore recent figures are not due for release until the first half of next year.\n\n\"Mona is financially where I want it to be,\" Mr Walsh told the ABC by email.\n\nMona founder David Walsh and his wife, artist Kirsha Kaechele. (Credit: Amy Brown)\n\n\"Mona will never make money [in and of itself], and it was never intended to. If I wanted to make money, I would have built it in Sydney, or Istanbul, or somewhere.\n\n\" I'm fine spending — I'm not the most committed capitalist — and I like building stuff. \"\n\nMr Walsh is completing a $100 million extension at Mona, comprising a new wing of the gallery that will open in December and a library to open next year.\n\nBefore: The gallery in 2021. . . After: New construction in 2025. . . Instructions: Use left and right arrow keys to control image transition Before and after images SLIDE The gallery in 2021. / New construction in 2025.\n\nHe is also still contemplating a major hotel on the site, after a $400 million, 176-bed proposed development was shelved in 2021.\n\nMona ditches 'HoMo' name as it unveils plans for new hotel Mona's 2018 planned hotel development featured 172 rooms, a concert stage and a \"nerd fest\" library.\n\nSigns on the construction site hoarding at Mona proclaim: \"Yep, David's building something new. At this point, we've given up trying to stop him.\"\n\nIn round figures, Mr Walsh said Mona had cost him about $25 million per year long term.\n\nHe cited an unreleased 2018 report by Deloitte Access economics, which showed the gallery generated $135 million per year in direct and indirect economic activity in Tasmania — equivalent to 1,285 jobs across the state — and $165 million nationally. \"Whether that's worthwhile, I really don't know,\" Mr Walsh wrote.\n\n\"Hopefully, Mona will have sufficient income.\"\n\nMoorilla Estate earnings (2017–2024) (Source: Modern slavery reports, ASIC) Financial year Revenue ($) Profit/loss ($) Employees 2017 31,946,483 −23,012,384 2018 36,141,295 −28,527,794 100 2019 43,381,408 −28,843,554 790 2020 34,256,038 −19,936,351 450 2021 33,981,518 −23,415,829 430 2022 37,434,358 −33,898,873 482 2023 44,939,862 −43,666,181 503 2024 41,373,041 −63,405,101 509\n\nMr Walsh, 64, said his wife, artist Kirsha Kaechele, who was the subject of a recent Australian Story program, would continue to support the gallery when he died.\n\n\"In the event that I die today and Kirsha wanted to change the revenue base, it's pretty easy to do,\" he said.\n\nArtist Kirsha Kaechele (centre) has been in the news over her women-only Ladies Lounge. (ABC News: Ebony ten Broeke)\n\nMr Walsh sketched out an example of how Mona could save roughly $20 million per year:\n\nRaising ticket prices for the 300,000 interstate and international visitors per year, from $39 to $80 (estimated annual revenue raised: $12 million)\n\n\"We could charge Tasmanians a bit, say $30.\" Tasmanians currently get free entry (estimated annual revenue raised: $3 million)\n\n\"Reduce music offerings, since music isn't why non-Tasmanians visit\" (estimated annual saving: $2 million)\n\n\"Scale Dark Mofo back a bit\" (estimated annual saving: $3 million).\n\nArt critics told Kirsha she 'wasn't relevant'. Then she blew up the patriarchy No men are allowed at Kirsha Kaechele's Ladies Lounge and the Supreme Court agrees. The artist, curator and \"missus\" of MONA's owner knows how to cross boundaries, but can she solve Tasmania's thorniest dispute?\n\nMr Walsh said Mona could also take a range of smaller steps to make the gallery profitable, such as charging for exhibitions, increasing the ferry price and charging for the library.\n\n\"We could do simple stuff, like open on days when there are cruise ships and market to them. I'm not a fan of cruise ships in Hobart [at least the all-inclusive type], so I don't do that at the moment,\" he said.\n\n\" I won't do any of this stuff, but others will in my absence, if necessary. \"\n\nMr Walsh said last year he trimmed annual costs at Mona by roughly $9 million by cancelling summer's MONA FOMA festival at Launceston, and securing extra state government support (worth $7 million a year) for the Dark Mofo winter festival, for which tickets for the 2026 event recently went on sale.\n\nDo you know more? Contact Paddy Manning at manning.paddy@abc.net.au\n\nMr Walsh has also swung the axe in the past year, with Mona shedding some 50 people — almost a tenth of the 509 employees reported in the company's modern slavery statements filed by his private company, Downward Spiral Enterprises (DSE).\n\nThe new wing and library will cost more than the original museum did, Mr Walsh says. (ABC News: Maren Preuss)\n\nDSE owns Moorilla Estate and also owns the Mona building itself (via the separate Moorilla Unit Trust) as well as Mona's art collection (held in the Family Art Group) and subsidiaries Darklab (which runs Dark Mofo, the Odeon Theatre and the Hanging Gardens) and Aegres Art Group.\n\nMr Walsh famously made his fortune gambling as part of a global syndicate that bets $10 billion a year.\n\nMona founder started museum out of guilt for making gambling millions David Walsh says he founded Mona because he felt guilty about making millions as a professional gambler.\n\nHis current wealth is unknown, but his decades-long partner, Zeljko Ranogajec, once appeared on the Australian Financial Review's Rich List with a fortune of $600 million.\n\nOne of their companies, Data Processors, is currently suing a group of former employees for allegedly stealing intellectual property — a case which has exposed the notoriously private betting operation to rare scrutiny.\n\nMr Walsh would not comment on the case, except to say \"there wasn't much money involved\".\n\nDavid Walsh believes there is untapped value in some parts of his businesses. (ABC News: Scott Ross)\n\nWhile Mona has always lost money, Mr Walsh argues the losses are moderating and there is as-yet-untapped value in some of the group's subsidiary businesses.\n\n\"Mona is valued as a shell, because the business loses, so its value doesn't vary much,\" Mr Walsh said.\n\n\"Counting subsidiaries, it won't always lose, I hope.\"\n\nTech behind museum apps the 'great white hope' for big money\n\nArt Processors' Pladia platform is being offered to other museums and visitor experiences. (Supplied: Pladia)\n\nMr Walsh believes Mona's financial upside may lie with its emerging experience design business Art Processors, which developed \"The O\" digital guide used at the gallery since it opened in 2011, and recently launched a new visitor wayfinding platform called Pladia.\n\nArt Processors has sold Pladia to gallery customers such as Sydney's Museum of Contemporary Art and events, including the recent \"Confined 16\" First Nations exhibition at Melbourne's Glen Eira City Council Gallery, as well as cultural institutions in the US and elsewhere.\n\n\"The O\" digital guide used at the gallery since it opened in 2011. (ABC News: Maren Preuss)\n\nArt Processors has patented a virtual queuing system, which Mr Walsh said he had high hopes for.\n\n\"When implemented, [the system] may well obviate the need for queues anywhere,\" he said.\n\n\" With a bit of luck, someone will acquire it and fund the next round of Mona expansion [and this one, because I have some debt]. \"\n\nMr Walsh described Art Processors as his \"great white hope\".\n\nA digital wayfinding sign powered by Pladia. (Supplied: Art Processors)\n\nMoorilla Estate moved from 85 per cent to 100 per cent ownership of loss-making Art Processors at the end of 2023-24 — the seller and price were not disclosed — and in the process made last year's accounts look worse than usual.\n\nArt Processors' founding principal, Nic Whyte, said the company's revenue was in the $10 million range, but the business was losing between $1–1.5 million a month until it was restructured in July. It shut down its US business amid arts funding volatility that Mr Whyte said he expected would continue \"for some time\".\n\nMr Walsh argued the costs of developing Art Processors were inflating losses at Mona, but he hoped it would become profitable and may eventually be sold.\n\n\"Some of the Mona loss is the technology base, which Art Processors peddles to other institutions,\" Mr Walsh said.\n\n\" It is taking a lot of money to develop. Hopefully it's like a mini-Amazon. Loses up front, and then income when it matters. \"\n\nChocolate experience, Hobart stadium might bring more visitors, Walsh says\n\nA render of the Cadbury Chocolate Experience, set to be built in Hobart. (Supplied)\n\nOne customer for Art Processors is the yet-to-be-built $150 million Cadbury Visitor Experience centre that will be adjacent to Cadbury's Chocolate Factory at Claremont in Hobart.\n\nThe Cumulus-designed tourism operation is ambitiously projecting 550,000 visitors a year.\n\nDeveloper Simon Currant said his vision was to deliver the world's best chocolate experience, which was also \"purely Tasmanian\".\n\nPremier Jeremy Rockliff and developer Simon Currant. (ABC News)\n\nMr Currant said Art Processors won a competitive tender, among 20 entrants, to deliver a self-guided visitor experience that was \"totally engaging\".\n\nHe said Art Processors had huge experience on how to deliver messages to people in the latest creative forms and had travelled to chocolate factories in Japan, including Royce in Hokkaido, with his team to look at delivering an experience to large crowds, \"without making people feel like a bunch of ants\".\n\nMr Walsh was optimistic about the likely impact on Mona visitor numbers of the new chocolate visitor centre, and was open-minded about the potential bump from the proposed new AFL stadium at Macquarie Point.\n\nMr Walsh said while he was \"not sure\" about the proposed stadium, \"I do know that when there's a football game in Hobart, we get a huge influx of visitors\".\n\nMr Walsh says AFL matches in Hobart lead to more visitors at Mona. (Supplied: MPC)\n\nAbout a decade ago, Mr Walsh had announced his own redevelopment masterplan for the industrial Macquarie Point site that the stadium now supersedes.\n\nAlso helping Mona's financial position has been a shift in the accounting treatment of longstanding intercompany loans from ultimate parent Downward Spiral Enterprises, after an external audit was conducted in 2022-23.\n\nLast year's Moorilla Estate accounts note a \"debt to equity swap\" of $47.3 million in loans from DSE, which were extinguished and converted to equity because there was no requirement for repayments.\n\nHas the 'Mona effect' waned?\n\nDark Mofo has helped boost visitor numbers to Tasmania during the cold winter months. (Supplied: MONA/Remi Chauvin)\n\nAccording to the most recent state visitor figures, Mona was the third-most popular tourist attraction in the state in 2024-25 with 330,000 visitors, behind Hobart's Salamanca markets and Kunanyi/Mount Wellington.\n\nWhile visitation has gradually rebounded since COVID, it is still short of the 405,000 visitors Mona reported in 2018-19.\n\n\"My gut feel is the Mona effect peaked before COVID,\" says independent economist Saul Eslake.\n\n\"The people there [at Mona] are nothing if not commercially savvy. They've stepped back from some of their festivals, and last year they suspended Dark Mofo. I think they realise they've probably pushed it as far as they can.\"\n\nEconomist Saul Eslake says Mona brought a different category of tourists to Tasmania. (ABC News: Owain Stia James)\n\n\"It's still important. I think Mona has changed the image or face that Tasmania has presented to the world.\"\n\n\" Prior to Mona we [Tasmania] were in danger of being 'Jetstar-ised'. The kind of people who go to Mona don't want to fly Jetstar. \"\n\nMr Eslake said recent investment in new luxury hotels in Hobart — from Crowne Plaza to Hobart's first Hilton — probably would not have happened without Mona.\n\nWhereas previous visitors to Tasmania had come to see natural attractions, \"Mona brought a different category of tourist\", he said.\n\nHe said \"whatever you think of gambling\" Mr Walsh was an \"extraordinary character\" and Tasmania had been lucky to have his investment, likening him to a philanthropist from the gilded age or \"a Tassie version of the Medicis\".\n\nMona is widely regarded as having changed the image of Tasmania to visitors. (Facebook: MONA)\n\nMr Walsh hopes the construction cranes will again hang over Mona as he continues to build on his vision and what he wants to leave behind.\n\n\"I hope to live long enough to establish, on Mona's behalf, an endowment, or some income streams that support it,\" he said.\n\n\"In particular, Mona generates a whole bunch of visitors, but doesn't keep them long enough. We need a hotel.\n\n\"I don't see Mona as a charity. I hope it'll be an ideas incubator, that'll make money.\n\n\"I like building stuff,\" Mr Walsh says. (ABC News: Maren Preuss)\n\n\"So far, the lead time has only been 20 years. I want it to be profitable because I want other, richer, more avaricious people than me to engage in similar social experiments.\n\n\"I can't guarantee Mona's long-term survival, but I can offer assurances that I intend to support it while I'm alive.\n\n\"I know that my wife will continue that support after my demise, if she is able.\n\n\"I'm about to open an extension that costs more than the original museum. I wouldn't be doing that if I wasn't a true believer.\"\n\nMr Walsh wants Mona to continue on after he is gone. (ABC News: Maren Preuss)",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-11-15/nt-government-introduces-new-pet-crocodile-ownership-rules/106011808",
        "title": "Croc owners welcome government crackdown on Territorians' best friend",
        "publish_date": "Fri, 14 Nov 2025 22:34:02 +0000",
        "category": "finance",
        "authors": [],
        "text": "Damian \"Wildman\" Duffy has amassed around 1.8 million social media followers who watch his exploits as he comes up against the prehistoric reptiles of northern Australia.\n\nBut it is not just crocs in the wild — Duffy is also wild about new plans to more tightly regulate pet crocodile ownership in the Northern Territory.\n\n\"Crocodile pet ownership goes hand in hand with conservation,\" he said.\n\n\" The more people learn about these animals and their importance in the wild, in their natural ecosystems, the more they're going to want to conserve them, the more they'll appreciate them. \"\n\nIn the Northern Territory, which Duffy calls home, the government has released a series of new proposed guidelines which it says will improve oversight of private ownership of the apex predators.\n\nDamian Duffy says permit fees will send a message that owners have \"a responsibility financially to do the right thing\". (ABC News: Pete Garnish)\n\nThe proposed new rules include the introduction of a $299 permit fee for people to own a croc.\n\nAttorney-General Marie-Clare Boothby said the government wanted to \"ensure there is responsible crocodile ownership\" in the NT, where 63 residents are currently licensed to own pet crocs.\n\nThe plan also includes a requirement for new owners to have their animals undergo a procedure to receive identification markings, as well as upgrades to enclosure standards.\n\nOwners whose crocodiles escape and have to be recaptured by NT government rangers will also face penalties under the proposal, starting at $300 and increasing by $100 for each additional hour.\n\nIn the wild, saltwater crocodiles can grow to several metres long and weigh upwards of a tonne. (ABC News: Jayden O'Neill)\n\nPalmerston crocodile owner Andrew Fahey, who owns a young saltie nicknamed Louis Vuitton — \"because if he bites me again he might end up as a handbag\" — said he believed the new regulations were sensible.\n\n\"If the general public can see that there are conditions for owning these type of animals — if it's not too over the top — I think it's a good thing,\" he said.\n\nAdventurer Duffy said he also welcomed the new regulations.\n\n\"When you put a monetary value to something, you're going to go, 'OK, you can have a pet crocodile, but it's a $299 crocodile permit fee' and go … I have a responsibility financially to do the right thing,\" he said.\n\nNew era in pet croc ownership\n\nThe new regulations come just over a year since pet crocodile ownership was almost scrapped altogether.\n\nAndrew Fahey says regulation is \"a good thing\" so long as it's \"not too over the top\". (ABC News: Pete Garnish)\n\nThe former Labor government had agreed, under a new crocodile management plan released in April last year, to stop granting permits for people to be able to keep crocs at home.\n\nThe Country Liberal Party vowed to overturn the policy ahead of last year's election, and did so after forming government in a landslide in August.\n\nThe proposed guidelines will be open for public feedback until December 12.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-11-15/abc-quote-quiz-november-15/106008922",
        "title": "ABC Quote Quiz: The 'unofficial uniform' of Oasis, a Louvre heist cult hero and fruit shaped like body parts",
        "publish_date": "Fri, 14 Nov 2025 22:20:43 +0000",
        "category": "finance",
        "authors": [],
        "text": "See if you can work out what's going on in these quotes from the past week in the news.\n\nLoading\n\nWhere to find all the ABC's quizzes\n\nWant to test yourself even further?\n\nTake a squiz at the ABC's New Quiz topic page and see if you're a whiz at our previous quizzes.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-11-15/esperance-weekender-final-edition-regional-media-diversity/106003060",
        "title": "Closure of local paper signals end of independent print media in Goldfields",
        "publish_date": "Fri, 14 Nov 2025 22:11:38 +0000",
        "category": "finance",
        "authors": [],
        "text": "The Esperance Weekender has published its final edition and joined a growing number of regional publications shutting their doors.\n\nThe South Coast paper is the last independent masthead to leave the Goldfields and one of only a handful left in regional Western Australia.\n\nThe Weekender, which announced its closure in this week's edition, was started by a group of local benefactors who saw a need for a local newspaper after the town’s only weekly paper, The Esperance Express, ceased operating during the COVID-19 pandemic.\n\nWeekender editor Geoff Vivian, who joined the paper in 2023, said the budget had always been marginal and that shareholders saw the venture as more of a \"social enterprise\".\n\n\"There was only one of those four years where it managed to pay for all of its bills, and it wasn't last financial year,\" he said.\n\nLoading...\n\nMedia diversity shrinking\n\nThe closure of the Esperance Weekender coincides with the 130th birthday of the Seven West Media-owned Kalgoorlie Miner, which is the last remaining print publication in the region.\n\nIn WA, the majority of regional newspapers are owned by Seven West Media, which has 19 regional mastheads across the state.\n\nEarlier this year, concerns were raised about media diversity due to the proposed merger between Seven West Media and Southern Cross Media.\n\nWestern Australia's only regional daily newspaper, the Kalgoorlie Miner, has celebrated its 130th anniversary. (ABC Goldfields: Jarrod Lucas)\n\nMr Vivian said the decline in regional publications and the concentration of ownership were points of concern.\n\n\"Democracy and newspapers grew up together over about the past 400 years in our culture,\" he said.\n\n\"It worries me that there’s almost only one owner of newspapers in WA — it certainly owns more than nine out of 10 of all newspapers in WA, as well as the national TV network.\"\n\nLocal and Independent News Association (LINA) executive director Claire Stuchbery said the decline of independent news media was about revenue streams.\n\n\"We're seeing more and more of that advertising dollar moving to the social platforms, and that loss has really impacted business models, \"she said.\n\n\"Similarly, we're seeing people not necessarily wanting to pay for news.\"\n\nMs Stuchbery said smaller, independent newsrooms could look to diversify their revenue streams.\n\n\"That might be in helping to organise community events, that might be in reader contributions in other formats,\" she said.\n\n\"So looking at a really broad array of revenue streams that are potential ways that local newsrooms can make their work more sustainable.\"\n\nClaire Stuchberry works for LINA, a not-for-profit supporting local and independent media. (Supplied: LINA)\n\nMs Stuchbery said news content was also increasingly syndicated from metropolitan newsrooms.\n\nShe said international, national and statewide news remained important, but people needed to know what was going on where they lived and worked.\n\n\"A lot of that content is being reported from Sydney, which means that it's further away from issues that are really valid to local communities,\" Ms Stuchbery said.\n\nShe said that not only affected the diversity of stories for local communities, but also the stories from the regions that could have a broader reach.\n\nHistory of news in the Goldfields\n\nThe Goldfields' first newspaper, the Coolgardie Miner, was published in 1894.\n\nKalgoorlie-Boulder historian Tim Moore said there had been more than 60 mastheads in the Goldfields during the early part of the 20th century.\n\nTim Moore says several printing presses were sent to the region during the gold rush. (ABC Goldfields: Katrina Tap)\n\nMr Moore said there were not only newspapers for each town, but also for each cultural group.\n\n\"There was a newspaper here out of Coolgardie called the Othersider, and that was a newspaper aimed at all the people from the eastern states who came to Kalgoorlie-Boulder and Coolgardie,\" he said.\n\n\"What we had at the beginning of last century to what we have now, there's a huge gulf … print media still exists, but really it's localised print media.\"\n\nThe closure of the Esperance Weekender was announced in its final edition. (ABC Goldfields: Andrew Williams)\n\nMr Moore said the decline in diverse media sources could also affect the work of historians, who may have to rely more heavily on conducting interviews to understand historic events.\n\n\"It sort of makes our job only a bit more difficult because we've got a smaller pool of evidence on which to make conclusions,\" he said.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-11-15/liz-stringer-housing-tour-australia-dates-second-high/106007614",
        "title": "Why Liz Stringer 'doesn't have many s***s left to give'",
        "publish_date": "Fri, 14 Nov 2025 22:00:00 +0000",
        "category": "finance",
        "authors": [],
        "text": "Australian singer-songwriter Liz Stringer has spent decades navigating the music industry's twists and turns, learning not just its mechanics but which battles are worth her energy, and which aren't.\n\n\"I'm in my 40s now and I don't have a lot of shits left to give about what people think about me,\" she says.\n\n\"I just don't have the energy for it. All the energy has to go into making art now.\"\n\nCelebrate Ausmusic Month on Double J Tune in for all Australian Live At The Wireless sets, Take 5 interviews, Classic Albums and lots of great Australian music.\n\nBalancing creativity with the relentless demands of the industry is a battle even in the best of times. Recent professional changes have made prioritising creativity an even trickier proposition.\n\n\"I found myself, about a year ago, self-managed again. Anyone who's self-managed knows it's so much work and my creative process has suffered as a result,\" she says.\n\n\"I've only just started to write songs again after a quite a long period of not writing songs. That's the necessity of having to wear a million hats when you're working in the creative industries.\"\n\nSometimes instinct trumps convenience.\n\nAfter recording her latest album, The Second High, in London, Stringer felt compelled to stay: a decision that tested her resilience but reignited her creative spark.\n\n\"I was really inspired being there,\" Stringer says.\n\nLondon, she says, is both punishing and electrifying.\n\n\"Everyone who's been there is probably aware that it's a pretty brutal city in a lot of ways. It's incredibly expensive, it's massive, it's super busy all the time. It's incredibly stressful.\n\n\"It's also an incredibly exciting and inspiring place to be.\n\n\"It's been a challenge for me, and it's really tested my faith in my own ability as an artist and my dedication to art, because it hasn't been an easy transition at all. But I also don't regret it for a second.\"\n\nA sense of purpose\n\nNow back from London for a spell, she's deep in the throes of a 17-date Australian tour. One driven by more than music.\n\nStringer has partnered with local housing organisations in every stop to raise money and remind people of the struggles society's most vulnerable are facing.\n\n\"The way that we've managed to start working with all these charities all over Australia has given it such a sense of purpose,\" she says.\n\nLiz Stringer announces mega 17-date Australian tour One of the country's most powerful songwriters willt ake her exceptional new album on the road.\n\nShe played a fundraiser for Melbourne's Wombat Housing Services a few years ago and saw this tour as an opportunity to support organisations making a difference in helping society's most vulnerable.\n\n\"The pandemic was a great leveller, in a sense, because we were all affected by the same thing. But obviously people who were already in precarious positions were in even more precarious positions,\" Stringer says.\n\nOrganisations like Orange Sky and Signal Flare in Brisbane, Will2Live in Sydney, Hutt St Centre in Adelaide and the Katherine Women's Crisis Centre will be beneficiaries of not just money but also awareness from the shows.\n\n\"Look, I don't have a massive profile, but even if we raise a few grand for each of these organisations — because they're working on the smell of an oily rag — it will make a difference,\" Stringer says.\n\nShe says she wants to support people and organisations that are doing it tough.\n\nBut she also wants to raise awareness in the wider community about the issues.\n\n\"Really bring it back into the consciousness,\" she says.\n\nFor Stringer's dedicated Australian fans, the run of shows presents a long-overdue opportunity to connect with the singer-songwriter.\n\nIt's also a chance for Stringer and her band to re-establish their own magical connection.\n\n\"This is the biggest tour I've done since before the pandemic. I used to do tours this size a lot,\" she says.\n\n\"One of the great frustrations of the last few years is not being able to string a bunch of shows together and become really match fit as a band.\n\n\"That was always the real highlight of that sort of touring for me. So, I'm looking forward to that, doing 13 or 14 band shows [and] honing our sound together. I think that's gonna be so fun.\"\n\nThe great confidence balancing act\n\nWhile she's been a consummate live performer from the jump, Stringer acknowledges that she's recently interrogated her relationship with live shows.\n\nThose who haven't seen her for a while will likely experience her as a more comfortable and perhaps more generous performer.\n\nLoading Instagram content\n\n\"I've always really liked performing live, but I think when I was younger it was sort of like, 'Just get on and play everything really quickly and get off as quick as possible,'\" she says.\n\n\"Now I integrate who I am a bit more into my live shows. There's just a much more solid foundation to the way that I write, and the way that I am as an artist.\"\n\nHaving a little more pluck and courage is undoubtedly a positive thing. But it's equally important to keep it somewhat in check.\n\nLoading Instagram content\n\n\"You've gotta try and maintain a sense of confidence, but not overconfidence,\" Stringer says.\n\n\"I think it's easy to have smoke blown up your arse in this industry as well, and that's as dangerous as the rejection.\n\n\"It's a challenge for most people to maintain the sort of retaining walls of self-confidence.\"\n\nConfidence can be a limited resource, especially in an industry that loves to judge and doesn't always consider fairness a key metric.\n\n\"I've weathered a lot of years in an industry that is pretty brutal,\" Stringer considers.\n\n\"However much I have gotten better at protecting myself, artists are necessarily quite sensitive people.\n\n\"It's been difficult to repel all the rejection and that sort of stuff over the years. In that sense, I sort of feel a little bit browbeaten.\n\n\"On the other hand, my sense of who I am as an artist and my understanding of my own ability and what I'm capable of is just so much better developed than it was.\"\n\nNot having many shits left to give has allowed her to direct energy and confidence into the things that really matter.\n\n\"There's benefits to a bit of age under your belt, I think,\" Stringer says.\n\n\"You realise the time and energy that's wasted on stuff that used to cause me so much anxiety and angst as a younger person.\n\n\"That's just the process of getting older and repeating patterns and being in situations again and again — you just learn how to do it.\"\n\nGrowth over glory\n\nFor Stringer, it's important to channel any time and energy she has into creating art that she's proud of.\n\n\"I think what's really important to me now, which wasn't so important earlier on, is that I'm pushing myself creatively every time I make an album,\" she says.\n\n\"As a musician, I've always had a certain amount of natural ability that comes from my family — my dad's the same. I feel like early on I just cruised on that and was just like 'Oh, I can do this' and I'll just sort of make the same record four times.\n\n\"But now it's really important for me to continue to put myself out of my comfort zone and get better and learn more. That's a process that never ends.\n\n\"I want to be able to feel like I've learned something from a record now, which didn't occur to me earlier on.\"\n\nLiz Stringer is on tour around Australia right now. Get all the information here.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-11-15/the-songs-behind-carlton-hawthorn-aflw-semi-final/106013354",
        "title": "'Untouched' or 'Dark Horse': The songs behind today's AFLW semifinal",
        "publish_date": "Fri, 14 Nov 2025 21:43:53 +0000",
        "category": "sports",
        "authors": [],
        "text": "Before every game this year, the Carlton players get together and sing Untouched by Australian duo The Veronicas.\n\n\"Before the game, we were a bit silly,\" Erone Fitzpatrick told ABC Sport after the Blues' dominant 41-point elimination final win against West Coast last weekend.\n\n\"We have Ciara Fitzgerald, she gets in the middle of everybody and we just all dance to 'Untouched'.\n\n\"We play our best football when we're a bit silly and just joy and celebration really is what we're chasing this year — and I think you can see that with the way we're playing.\n\n\"I think that's the vibe that you can see on the field too, just everybody gets around each other and we're silly, but we're having fun at the same time.\"\n\nCarlton are playing in finals for the first time since 2020. (Getty: James Worsfold/AFL Photos)\n\nCarlton is playing finals for the first time since 2020 this year and will go into Saturday's semifinal against Hawthorn as the favourites.\n\nMany have credited younger players such as Sophie McKay, Poppy Scholz and Lila Keck as giving the side that has struggled in recent seasons with a new energy.\n\nIn the opposing colours, Hawthorn players have been using the song Dark Horse by Katy Perry as one of their songs this year.\n\nMidfielder Eliza West said it was emblematic of how they felt like underdogs despite achieving a top-four finish.\n\n\"Just from how our season panned out, and we've had to grind out some tough games. We're still feeling like we're the underdogs and we still have a point to prove,\" West said.\n\nThe 'tough' time that led to West playing finals with Hawthorn Eliza West is leading the Hawks on a finals charge in the AFLW, but it comes after a 'disheartening' call at the Demons.\n\nThe Hawks were second on the ladder heading into the final home-and-away game, but finished fourth after going down to minor premiers by 49 points.\n\nThis meant they had to face the Kangaroos again in the first week of finals, this time going down by 39 points.\n\nThey now face another straight-sets finals exit — after finishing in the top four last year but crashing out with back-to-back losses — after a season marred by injury.\n\nKey players Lucy Wales, Emily Bates, Aileen Gilroy, Jasmine Fleming, Ainslie Kemp, Najwa Allen, Bridie Hipwell, and Jenna Richardson have all missed significant portions of the season through injury.\n\nThe side will regain captain Bates for the do-or-die clash with Carlton, while second-year players Hayley McLaughlin and Sophie Butterworth come in to replace injured pair Emily Everist (concussion) and Kaitlyn Ashmore (calf).\n\nHawthorn have struggled with significant injuries this season. (Getty Images: AFL Photos/Michael Willson)\n\nDespite the injury setbacks, West said there was a lot of confidence within the group — and Perry was helping to get their energy up before the game.\n\n\"We've actually got a few songs that we play beforehand at different points. But I think Aine (McDonagh) and Casey (Sherriff) are the controllers of that,\" West said.\n\n\"The girls love to sing and dance before the game, it gives them energy going in … some of the girls, like Aine, she will do it and then go out and kick three goals.\"\n\nWest laughed that some of the older players, like herself and Tilly Lucas-Rodd, prefer to try to conserve their energy and warm their bodies up by throwing the ball around instead, but the song was good to get all the players into the same spirit.\n\nWhich for them is being the 'dark horse' of this finals series.\n\nHawthorn hosts Carlton for the semifinal clash at Princes Park on Saturday night.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-11-15/unit-prices-property-market-brisbane-unit-million/105996524",
        "title": "Couple who bought unit six weeks ago say they couldn't afford it now",
        "publish_date": "Fri, 14 Nov 2025 21:25:08 +0000",
        "category": "finance",
        "authors": [],
        "text": "Serena and Miffy were thrilled to crack the Brisbane property market in their early 20s — but just six weeks on, their unit has soared in value and they say they wouldn't be able to afford it now.\n\nThe couple bought their one-bedroom unit in Brisbane's affluent, leafy suburb of New Farm using the federal government's 5 per cent deposit scheme.\n\nLoading...\n\n\"Without the scheme it would have been tight for us, it's definitely given us a leg up,\" 24-year-old Serena said.\n\nUnder the government's scheme, first home buyers across all income levels can now secure a property with just a 5 per cent deposit and avoid paying costly lenders mortgage insurance (LMI).\n\nThe scheme was previously limited to singles earning under $125,000 and couples with a combined income below $200,000, but the government has now lifted those income caps.\n\nThe scheme has drawn mixed public reactions, and the couple said the process remained \"stressful,\" with crowded inspections and rising prices adding to the pressure.\n\nThe couple say they’ve heard criticism of the scheme, even though it helped them. (ABC News: Shari Hams)\n\nMiffy, 23, said inspecting properties alongside experienced investors was intense.\n\n\"You'd be shuffling around all these people, trying to get a glimpse of the bathroom, that was awful, and everyone feels like your competitor.\"\n\n\" It feels very isolating going to properties when everyone's in a different demographic to you. \"\n\nDespite only being purchased several weeks ago, their unit has already grown in value. (ABC News: Shari Hams)\n\nIn just a few weeks, the value of their unit has already climbed by an estimated $50,000, according to property experts.\n\nThe couple said the higher price point would likely put it out of reach if they were buying now.\n\nAre 5pc deposits pushing up prices? Young Australians say a 5 per cent deposit helps, but does not cure all housing ills.\n\nThey said they felt sympathetic for people still trying to break into the market.\n\n\"The growth is running away from everyone — the best time to buy property is always yesterday,\" Miffy said.\n\n\"It's already moved so much in just six weeks, and it keeps climbing.\"\n\nWhile the scheme has helped them, they are uncertain whether it offers a long-term solution to the housing affordability crisis.\n\nA million-dollar unit sale\n\nA two-bedroom brick walk-up unit on Moreton Street in New Farm has just sold for a little over $1 million — a \"bittersweet\" milestone, according to the real estate agent.\n\nRissman Property's Ben Lobie said it's the first time his agency has seen a \"basic unit\" of this kind — the sort typically built in the 1970s and 80s with no lift, amenities or large balcony — break the million-dollar mark.\n\nLoading...\n\n\"It's bittersweet as we've got owners on one side who are very excited as obviously they are starting to make money but then we've got a lot of people who are trying to buy one,\" he said.\n\nSpecialising in New Farm, Mr Lobie said strong demand for units in the area is pushing prices higher.\n\nThis New Farm unit sold for $1,001,000 at the start of October. (Supplied: realestate.com)\n\n\"We have around 2,000 two-bedroom units in New Farm, and at the moment there are only three or four on the market,\" he said.\n\n“Because so few are available and even fewer sell, prices normally fluctuate a bit — one might rise while another drops — but that just isn’t happening right now.”\n\nLoading...\n\nHe estimated the same property would have sold for around $700,000 this time last year.\n\n\"It's not going to go backwards,\" he said.\n\nOne in 10 homes bought using government incentive in October About one in 10 homes sold last month were bought by Australians using Labor's expanded 5 per cent deposit scheme to enter the market for the first time.\n\nProperty expert Tim Graham echoed the sentiment.\n\n\"If we look at New Farm, where these units were purchased, we're seeing an 11 per cent growth in units, compared with just 8 per cent for houses, it's a trend we've been reporting on for some time,\" he said.\n\nHowever, Mr Graham noted the million-dollar Moreton street sale was about $100,000 above his own valuation, driven by several factors.\n\n“We’re seeing higher rental yields and stronger rental growth in unit markets, with units competing closely in terms of capital growth,” he said.\n\nLoading...\n\nBuyers opt for units\n\nA new Domain report showed Australian buyers increasingly traded freestanding houses for more affordable townhouses and units as housing prices rose.\n\nThe analysis compared buyer searches over the past year with actual listing prices, highlighting the shift toward units.\n\n\"We've been reporting on this trend for over 18 months now, a trend that's sweeping the nation that units are going toe to toe on capital growth across the nation,\" Mr Graham said.\n\n\" It used to be the poor cousin to houses. \"\n\nLoading...\n\nHe said a growing range of people are choosing this type of living, with the trend spreading to other capital cities and even smaller markets like Darwin and Hobart.\n\n\"Whether it's down-sizers, right-sizers, lifestyle buyers, or many migrants accustomed to unit living, it's a trend we expect to continue,\" he said.\n\n\"The biggest story around Brisbane is absolutely undersupply, they simply cannot build or keep up with the demand that the city needs.\"\n\nMr Lobie says a strong demand for units is pushing prices higher. (ABC News: Shari Hams)\n\nMr Lobie said while it's a strong market for sellers, the pressure to buy is increasing.\n\n\"People assume we're all thrilled about this … some of my clients are, but some aren't,\" he said.\n\n\"Half of our office can't afford these units anymore. Our job is to sell for the best price, but we've got colleagues watching each sale over the past month, and they're frustrated.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-11-15/qld-homebirth-program-public-funded-12-months-report/106009706",
        "title": "Nearly half of Qld homebirth program participants gave birth in hospital",
        "publish_date": "Fri, 14 Nov 2025 21:09:41 +0000",
        "category": "lifestyle",
        "authors": [],
        "text": "A \"small\" number of women who were ineligible for Queensland's first publicly funded homebirth program decided to freebirth, a leaked report into the first year of the program has revealed.\n\nThe report, obtained by the ABC, has recommended doctors and midwives work with women who are \"risked out of the program\" to develop an individual plan to reduce the dangers of freebirthing.\n\nA freebirth is when a woman decides to give birth without assistance from a registered health professional.\n\nThe practice is facing growing scrutiny after publicity surrounding deaths of mothers and babies.\n\n'Sovereign birthkeepers' putting lives at risk They check the baby's position and listen to the heartbeat, but they aren't qualified midwives. Parents say a \"dangerous\" new breed of birth worker has emerged to fill the gap for women wanting to birth outside hospital.\n\nPeak medical and midwifery groups have called for health ministers across the country to pass laws so that only registered midwives and doctors can manage labour and childbirth, following the deaths.\n\nThe 12-month evaluation report of a publicly funded homebirth program run on the Sunshine Coast said a \"small number of women\" who were ineligible for the program due to clinical risk factors, \"chose to freebirth\".\n\n\"This is an undesirable and potentially unsafe outcome,\" the report said.\n\n\"Midwives reported limitations related to professional indemnity when providing care outside Queensland Health guidelines.\n\n\" A collaborative, inter-professional model involving midwives, obstetricians, and women may help develop individualised care plans for women with moderate risk factors, reducing the likelihood of unsupervised births. \"\n\nQueensland was one of the last states to announce a publicly funded homebirth service in late 2023, giving eligible women the option to birth in the comfort of their own homes, supported by trained midwives.\n\nJust over half of participants birthed at home, report finds\n\nThe project, launched in July 2024 at the Sunshine Coast University Hospital (SCUH), aimed to expand maternity care options by offering a homebirth service to eligible women with low-risk pregnancies.\n\nLoading...\n\nEarlier this year, the ABC asked Sunshine Coast Health (SCH) how many women participating in the program ended up giving birth in hospital, but a spokeswoman declined to provide the figure, saying \"there was not enough data to protect patient confidentiality\".\n\n\"With such a limited sample size, it's not possible to draw reliable correlations or meaningful conclusions without risking misinterpretation,\" she said.\n\nThe report into the first year of the program shows just over half of women enrolled ended up giving birth at home.\n\n35 women who had been enrolled in the homebirth program were transferred to hospital care for a range of reasons. (ABC News: Mark Leonardi)\n\nAccording to the report, 74 women enrolled in the service between July 2024 and 30 June 2025, with 39 women giving birth at home.\n\nParamedics were called to 14 of the homebirths and assisted in 10 of them.\n\nThe remaining 35 women enrolled in the program were transferred to hospital care for a range of reasons including medical treatment indicated, monitoring required and change of mind.\n\nOne of those women had a caesarean birth after being transferred to hospital during labour.\n\nSunshine Coast Health says it was proud to have helped local families who were eligible to participate in the homebirth program. (ABC News: Lucas Hill)\n\nSCH said a similar interstate service recorded 20 homebirths in its first year.\n\n\"We're very proud of what we've achieved for local families,\" a spokeswoman said.\n\n\"Choosing where to give birth is a deeply personal decision, and some women decide to change their plans as their due date approaches or even during labour.\n\n\"This can happen for many reasons, such as a desire for pain relief or the need for a clinical transfer to keep both mother and baby safe.\"\n\n'Any birth could face challenges'\n\nObstetrician Gino Pecoraro said the high number of low-risk women in the Queensland program who were transferred to hospital care clearly illustrated that any birth could suddenly face challenges.\n\n\"If nearly half of all women allocated to the study needed transfer, how does this provide value for the taxpayer?\" Dr Pecoraro said.\n\nDr Gino Pecoraro says the decision for women to freebirth suggests hospitals need to become more welcoming for birthing. (AAP: Russell Freeman)\n\n\"What is the actual dollar cost for each woman looked after and each baby delivered? I think there's a whole heap of unanswered questions that I'd like to know before the program is expanded.\"\n\nDr Pecoraro, president of the National Association of Specialist Obstetricians and Gynaecologists, said the decision for women to freebirth showed hospitals needed to become \"more welcoming\" for birthing women.\n\nWhat to know about home births There's been an increase in home births in recent years but they're not accessible to all, and they're not considered suitable for every pregnancy.\n\n\"I think it tells us that there is something wrong with the current maternity system if we've got people who are prepared to listen to influencers and people with no training over the advice from people that have studied for 20 years,\" he said.\n\n\"What are we doing wrong when all of a sudden women are decrying the safety of having a baby in hospital and could we use this money better to make the hospital more homelike?\"\n\nBroader access wanted for program\n\nUnder existing criteria of Queensland's publicly funded home birth program, only women living within a 30-minute radius of Sunshine Coast University Hospital are eligible.\n\nWhile that parameter was established in line with best practice evidence, the report noted patient feedback \"strongly supports\" broader access, \"warranting further exploration of safe and sustainable options for program expansion\".\n\nAccording to the report, 74 women enrolled in the service between July 2024 and 30 June 2025, with 39 women giving birth at home. (ABC News: Briana Shepherd)\n\nIt recommended a review of the eligibility criteria for \"acceptable residence distance from the hospital\".\n\nSunshine Coast Health said it acknowledged the recommendations in the report and was reviewing them to \"ensure any future improvements to the home birth program continue to prioritise the safety of mothers and babies\".\n\n\"Any changes to eligibility criteria, including distance-from-hospital requirements, will be carefully considered in consultation with clinical experts and maternity stakeholders,\" the spokeswoman said.\n\nThe report said demand for homebirths in Queensland has been increasing, with rates rising from 0.1 per cent to 0.5 per cent of all births between 2011 and 2021.\n\n\"Expanding maternity services to include publicly funded homebirths as an option offers both clinical and economic benefits,\" the report said.\n\nOnly women living within a 30-minute radius of Sunshine Coast University Hospital are eligible under the current program's guidelines. (ABC News: Lucas Hill)\n\n\"Shifting a portion of low-risk births to a homebirth model could reduce the financial burden on Queensland's public healthcare system, as perinatal care is a major contributor to hospital costs.\"\n\nThe report recommended securing long-term investment of publicly funded homebirth as part of the maternity system and ensure it is embedded in service agreements.\n\nIt estimated that if five per cent of public hospital births in Queensland were planned as home births, the system could save about $11 million per year, or more than $5,500 per low-risk pregnancy.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-11-15/trump-orders-epstein-probe-into-clinton-jp-morgan-democrats/106013208",
        "title": "Trump seeks probe of Epstein ties to former US president Bill Clinton",
        "publish_date": "Fri, 14 Nov 2025 21:03:43 +0000",
        "category": "finance",
        "authors": [],
        "text": "President Donald Trump says he will ask the Department of Justice to investigate Jeffrey Epstein's links to US bank JPMorgan and prominent Democrats, including former president Bill Clinton.\n\nThe request comes two days after a congressional committee released thousands of documents that raised new questions about Mr Trump's relationship with the late convicted sex offender.\n\nIt marks the latest in a series of demands by Mr Trump for federal law enforcement to pursue his perceived political enemies.\n\nThe justice department did not immediately respond to a request for comment. (Reuters: Elizabeth Frantz)\n\nThe Epstein scandal has been a political thorn in Mr Trump's side for months, partly because he amplified conspiracy theories about Epstein to his own supporters.\n\nMany Trump voters believe the government has covered up Epstein's ties to powerful figures and obscured details surrounding his death by suicide in a Manhattan jail in 2019.\n\nAlong with Mr Clinton, who socialised with Epstein in the early 2000s, Mr Trump said he had asked the Justice Department to investigate former treasury secretary Larry Summers, and Reid Hoffman, the LinkedIn founder who is also a prominent Democratic donor.\n\nAll three men were mentioned in the 20,000 Epstein-related documents released by the House Oversight Committee on Wednesday.\n\nBill Clinton said he cut ties with Jeffrey Epstein once sexual assault allegations emerged against him. (Reuters: Lucy Nicholson)\n\n\"Epstein was a Democrat, and he is the Democrat's [sic] problem, not the Republican's [sic] problem!\" Mr Trump wrote on social media.\n\n\" They all know about him, don't waste your time with Trump. I have a Country to run! \"\n\nAttorney General Pam Bondi says the department will pursue the Epstein case with urgency.\n\nBreaking down the newly released Epstein emails Donald Trump's relationship with Jeffrey Epstein is pushed back into the spotlight after he was named in several years-old emails unearthed by a congressional committee investigation.\n\nThe justice department did not immediately respond to a request for comment.\n\nA JPMorgan spokesperson said in an emailed statement: \"We regret any association we had with the man, but did not help him commit his heinous acts.\"\n\nMr Clinton and Mr Summers did not immediately respond to requests for comment.\n\nMr Hoffman could not be immediately reached for comment.\n\nTrump faces continued pressure over Epstein\n\nMr Trump and Epstein were friends during the 1990s and the 2000s, but Mr Trump says he broke off ties before Epstein pleaded guilty in 2008 to charges of soliciting a minor for prostitution.\n\nMr Trump has consistently denied knowing about the late financier's abuse and sex trafficking of underage girls.\n\nStill, some of Mr Trump's most ardent supporters have accused his administration of a cover-up.\n\nJeffrey Epstein and Donald Trump were friends during the 1990s and the 2000s. (Getty Images: Davidoff Studios)\n\nMr Trump, who frequently engages with reporters, has declined to take questions over the past several days as new revelations about Epstein have become public.\n\nThe Republican-controlled House of Representatives is expected to vote next week on legislation that would force the Department of Justice to release all of the material it holds on Epstein, who was facing federal charges of sex trafficking minors at the time of his suicide.\n\nThe measure is expected to pass, even after House Speaker Mike Johnson repeatedly tried to block the vote.\n\nAn image of US President Donald Trump alongside Jeffrey Epstein was projected onto Windsor castle, during his UK tour in September. (Reuters: Phil Noble)\n\nIt would also require the Senate to pass similar legislation and Mr Trump's approval to compel the justice department to act.\n\nJust four in 10 Republicans in an October Reuters/Ipsos poll said they approved of Mr Trump's handling of the Epstein files, well below the nine in 10 who approved of his overall performance in the White House.\n\nTrump distraction tactics\n\nMr Trump has harnessed the justice department to target other political opponents, some of whom now face criminal charges that outside experts have described as politically motivated.\n\n\"Trump is clearly desperately trying to distract from his own presence in the Epstein emails,\" said a former Department of Justice lawyer, Alan Rozenshtein.\n\nWhat we learned from Epstein's emails A trove of Jeffrey Epstein emails released this week reveals his preoccupation with US President Donald Trump in the years before Epstein's death.\n\n\"It's outrageously inappropriate for the president to be giving orders to the Department of Justice to investigate individual United States citizens,\" said a former federal prosecutor, Patrick J. Cotter.\n\n\"That is not how it's supposed to work.\"\n\nOn Friday, Mr Trump said he knew \"nothing\" about an email from Jeffrey Epstein suggesting he knew about the disgraced financier's sexual abuse.\n\n\"I know nothing about that. They would have announced that a long time ago,\" Mr Trump told reporters aboard Air Force One when asked what Epstein meant in a 2019 email saying \"of course he knew about the girls\".\n\nJPMorgan paid $US290 million ($443 million) in 2023 to some of Epstein's victims to settle accusations that it had turned a blind eye to his sex trafficking.\n\nJeffrey Epstein victims reach $430 million settlement with JPMorgan Chase bank JPMorgan Chase has agreed to pay about $430 million to settle a lawsuit by Jeffrey Epstein's victims who had accused the bank of being the financial conduit that allowed him to continue operating a sex trafficking operation.\n\nThe deal followed embarrassing disclosures that JPMorgan ignored internal warnings and overlooked red flags about Epstein, who was a client of the bank between 1998 and 2013.\n\nThe bank did not admit wrongdoing in the settlement.\n\nNo credible evidence has surfaced that Mr Clinton, Mr Summers or Mr Hoffman were involved in Epstein's sex trafficking.\n\nAll have previously denied wrongdoing and have expressed regret about their relationships with him.\n\nFormer US Treasury secretary Larry Summers accepted philanthropic gifts from Epstein while serving as president of Harvard University. (Supplied: Larry Summers)\n\nMr Clinton flew on Epstein's private jet several times before the financier's 2008 conviction, while Mr Summers accepted philanthropic gifts from Epstein while serving as president of Harvard University.\n\nMr Hoffman has acknowledged meeting with Epstein multiple times in professional situations.\n\nBefore his 2008 conviction, Epstein worked and socialised with a long list of well-known figures, including the UK's former Prince Andrew, who was stripped of his royal title due in part to his association with Epstein.\n\nReuters/ AFP",
        "source": "ABC"
    },
    {
        "url": "https://www.smh.com.au/sport/afl/melbourne-demons-vs-adelaide-crows-aflw-finals-live-dees-crows-battle-at-ikon-park-as-semi-finals-begin-20251114-p5nfjk.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Melbourne Demons vs Adelaide Crows AFLW Finals LIVE: Dees, Crows battle at Ikon Park as semi-finals begin",
        "publish_date": "Sat, 15 Nov 2025 12:58:23 +1100",
        "category": "sports",
        "authors": [
            "Hannah Kennelly",
            "Roy Ward"
        ],
        "text": "Coach Matthew Clarke is certain Adelaide are peaking at the right time, but remains wary of an injury-hit Melbourne in their AFLW semi-final.\n\nThe Crows travel to Melbourne for Saturday afternoon’s sudden-death encounter buoyed by their 44-point drubbing of St Kilda in an elimination final.\n\nCaitlin Gould and Niamh Kelly of the Crows (right) celebrate a goal in their elimination final win. Credit: AFL Photos via Getty Images\n\n“It was arguably our strongest performance for the season,” Clarke told reporters on Friday at Adelaide airport.\n\n“We felt as though throughout the year we’ve had patches, we have played pretty good footy, but perhaps been inconsistent.\n\n“So to bring our best game towards the back-end, and obviously in the finals, that’s really pleasing.\n\n“You hope to play your best footy at the back-end and you probably should, given that you’re starting to work together as a unit more consistently.”\n\nClarke has named an unchanged side for the Ikon Park fixture but the Demons, who slipped to a 13-point qualifying loss to Brisbane, made two alterations.\n\nLoading\n\nStar goalkicker Eden Zanker (concussion) will miss and Jemma Rigoni has been dropped, with Sinead Goldrick and Laela Ebert summoned.\n\n“Obviously for them, losing Zanker probably hurt them last week within the game,” Clarke said.\n\n“But they″⁣ve had the whole week to prepare and structure up and they’ve got multiple aerial threats ahead of the ball, even without her.\n\n“That is a significant out for them, but it’s part of footy, you’ve got to be able to manage some adversity.\n\n“We’ve been watching the way they’ve gone about it. They have had a great year and even last week, a lot of the metrics say they should have won that game.\n\n“They’re really good around the contest ... they move the ball really efficiently into their front half.\n\n“And then, like most teams, they support defensively really strongly as well.”\n\nAn Adelaide loss will finish the tenure of dual premiership coach Clarke, who is stepping down at season’s end.\n\n“The question has come up a lot but the answer has been pretty similar,” he said.\n\n“AFLW is a really short season and so your focus becomes really intense in terms of the next game.\n\n“And then you throw in the fact that you get to finals, all that other stuff is really peripheral. It’s not even a factor.\n\n“It’s really just let’s go, let’s see if we can win a game.”\n\nAAP",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/soccer/international-friendly-live-socceroos-take-next-step-on-road-to-2026-world-cup-20251114-p5nfey.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "International friendly LIVE: Socceroos take next step on road to 2026 World Cup",
        "publish_date": "Sat, 15 Nov 2025 12:58:05 +1100",
        "category": "sports",
        "authors": [
            "Vince Rugari"
        ],
        "text": "Here’s the team Tony Popovic has selected:\n\nSo there’s three debutants: goalkeeper Patrick Beach, the current standout in his position in the A-League, defender Kai Trewin, his teammate at Melbourne City, and midfielder Paul Okon-Engstler, the son of Socceroos assistant coach Paul Okon who recently moved to Sydney FC and has started the season pretty well.\n\nOkon-Engstler is just 20, was born in Belgium (his father was playing for K.V. Oostende at the time) and came through the youth academies of Club Brugge and Benfica. Clearly, he has been identified as a star of the future for Australia - but can he play a role now, or at the World Cup? This is a great test for him.\n\nElsewhere, Craig Goodwin also starts for the first time since March in what appears to be the left wing-back role - interesting - with Nestory Irankunda, Mohamed Toure and Connor Metcalfe up front, and Aiden O’Neill in midfield next to Okon-Engstler.\n\nMilos Degenek has the captain’s armband, while Nick D’Agostino and Kye Rowles are not in the squad, and Deni Juric left camp early after sustaining an injury, which means Al Hassan Toure is a really high chance to also debut off the bench.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/afl/everyone-met-him-with-open-arms-mcgrath-on-the-return-of-essendon-prodigal-son-merrett-20251114-p5nfk4.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘Everyone met him with open arms’: McGrath on the return of Essendon prodigal son Merrett",
        "publish_date": "Sat, 15 Nov 2025 12:44:46 +1100",
        "category": "sports",
        "authors": [
            "Roy Ward"
        ],
        "text": "Loading McGrath’s name is at the top of the list of likely successors to Merrett as Essendon captain, should the club make the change. McGrath said it was too early to talk about the captaincy, but also wouldn’t rule out taking on the role if it becomes available. “It’s something I haven’t really put any thought to yet,” McGrath said. “We’ve had our break, and I got married a couple of weeks ago, so footy has been on the backburner a little bit.\n\n“Those conversations will happen over the next few months. We’ll sit down with the club and figure out the next way forward, and it will be what it will be.” McGrath, 27, was among the Essendon leaders – including the likes of Nic Martin and Mason Redman – to speak out in September about Merrett wanting out. McGrath told Seven at the time that there was “disappointment, a little bit of anger and sadness” about Merrett wanting out. McGrath has experienced plenty of turbulence as a Bomber, but he’s also learnt what it takes to become a leader. Zach Merrett and McGrath share a laugh back in April. Credit: AFL Photos “If you have been in the system for a while, you’ve seen a lot, and seen the good and the bad that footy throws up,” McGrath said.\n\n“I’ve been lucky enough to have so many good leaders above me for my whole career with Dyson [Heppell] and Zach currently. You learn bits and pieces from those guys. “Everyone my age is a leader at the footy club – we’ve got some great middle-aged sort of guys, but they seem a bit older with how young our playing list is at the moment. “Guys like Kyle Langford, Mason Redman and Nic Martin are great young, emerging leaders. Sam Durham as well. “It doesn’t really feel like a big responsibility because we share the load so well. “It’s something that comes a little bit naturally to me, like connecting with the guys, and I enjoy being around my teammates, but we will see where it all lands.”\n\nA chance meeting for Charlie Superstar Swans recruit Charlie Curnow admits he’s still adjusting to life in the harbour city, away from Carlton and his former teammates. And he looked shocked when he took some breakfast out to a car at the McHappy Day event in Tullamarine on Saturday morning, only to find it was former Blues skipper Marc Murphy waiting patiently. For his part, Murphy looked just as shocked – especially when two TV cameras took in the transaction. Sydney star Charlie Curnow tests out a burger on McHappy Day on Saturday. Credit: Eddie Jim “I think he was just using young Maxy [Murphy’s son] as an excuse to come past Maccas,” Curnow said with a wide smile.\n\n“I was surprised to see him but I always see him around Carlton North near the cafes.” Both Curnow’s friendship groups lit up this week when the AFL announced the Blues would travel to Sydney to face the Swans in opening round. “I actually thought we were going to play them six times and try to make as much money as we can,” Curnow said with a laugh. “I was talking to a few of the boys – I’m still getting used to changing up which boys I’m talking about, but I was chatting to some of my Blues mates like Weiters [Jacob Weitering] about the possibility of playing opening round, and it turns out the AFL did it in the end.” Curnow said he felt fresh and was enjoying getting stuck back into training after injuries ruined his last season with the Blues.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/motorsport/six-time-bathurst-champ-announces-retirement-20251115-p5nfnk.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Six-time Bathurst champ announces retirement",
        "publish_date": "Sat, 15 Nov 2025 12:43:10 +1100",
        "category": "finance",
        "authors": [],
        "text": "Six-time Bathurst champ announces retirement\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/culture/music/safety-first-federation-square-chief-shut-down-gig-to-avoid-crowd-crush-20251115-p5nfn8.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘Safety first’: Federation Square chief shut down gig to avoid crowd crush",
        "publish_date": "Sat, 15 Nov 2025 12:35:57 +1100",
        "category": "entertainment",
        "authors": [
            "Angus Delaney",
            "Isabel Mcmillan",
            "Karl Quinn"
        ],
        "text": "The last-minute cancellation of a free concert featuring Amyl and the Sniffers on Friday night was necessary to avoid a potentially catastrophic crowd crush after hundreds of people attempted to jump over barriers to the open-air venue, the head of Federation Square says.\n\nOn Saturday, Katrina Sedgwick, chief executive of Melbourne Arts Precinct Corporation – which manages Federation Square – defended the levels of security for the event and said sufficient planning had taken place beforehand. However, she conceded they may have to change how they stage events there in future.\n\nThousands of people filled Federation Square on Friday night before being informed the free concert had been cancelled. Credit: Simon Schuter\n\nThousands of music fans were devastated after the free concert was called off about 15 minutes before members of the Grammy-nominated Australian band were due to take the stage.\n\nSedgwick apologised on Saturday both to Amyl and the Sniffers – who expressed frustration on social media at the cancellation – and to the thousands of fans who missed out on seeing them perform.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/world/north-america/us-set-to-lower-tariffs-on-beef-as-trump-cops-cost-of-living-backlash-20251115-p5nfmn.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Australian beef exempted from US tariffs as Trump cops cost-of-living backlash",
        "publish_date": "Sat, 15 Nov 2025 12:09:02 +1100",
        "category": "finance",
        "authors": [
            "Michael Koziol",
            "Mike Foley"
        ],
        "text": "Washington: US President Donald Trump has exempted beef – including billions of dollars worth of Australian exports – from his sweeping tariff program as he responds to growing unrest from American consumers over the cost of living.\n\nAn executive order issued late Friday in the US (Saturday AEDT) confirmed beef was among several agricultural products that will no longer be subject to tariffs, including coffee and tea, cocoa, bananas, oranges, tomatoes and additional fertilisers.\n\nThe US is the biggest buyer of Australian beef. Credit: Bloomberg\n\nThat means the 10 per cent tariff applied to most Australian goods from April will no longer apply to beef – one of Australia’s leading exports to the US, with annual sales worth more than $4 billion.\n\nThe White House said given Trump had negotiated trade deals with a range of countries, he had determined it was “necessary and appropriate” to remove tariffs from certain products.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/victoria/the-age-photos-of-the-week-november-15-2025-20251113-p5nf9w.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "The Age photos of the week, November 15, 2025",
        "publish_date": "Sat, 15 Nov 2025 12:02:43 +1100",
        "category": "finance",
        "authors": [],
        "text": "17/23\n\nCouncillor Claudia James from Mitchell Shire stands at the end of Camerons Lane which is to be extended to form an interchange for the Hume Freeway. The land to its immediate north is in dispute as developer Resimax has taken the planning minister to the supreme court to overturn a decision that has blocked them from developing a new housing estate until the Camerons Lane freeway interchange is built Credit:Chris Hopkins",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/amyl-and-the-sniffers-free-gig-shut-down-over-security-fears-in-melbourne-20251115-p5nfni.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Amyl and the Sniffers' free gig shut down over security fears in Melbourne",
        "publish_date": "Sat, 15 Nov 2025 12:00:28 +1100",
        "category": "finance",
        "authors": [],
        "text": "Amyl and the Sniffers' free gig shut down over security fears in Melbourne\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later. Dismiss\n\nOur network\n\nOpen Navigation Menu The Sydney Morning Herald",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/nfl/drop-punt-it-like-daicos-the-afl-s-impact-on-nfl-stars-ahead-of-mcg-showdown-20251114-p5nfhr.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Drop punt it like Daicos: The AFL’s impact on NFL stars ahead of MCG showdown",
        "publish_date": "Sat, 15 Nov 2025 12:00:00 +1100",
        "category": "sports",
        "authors": [
            "Jake Niall"
        ],
        "text": "Los Angeles: When the Los Angeles Rams come to the MCG for the first regular-season NFL game in Australia, they could well be playing at the strange time of 10am, after a period of adjustment following a 14-hour flight.\n\nIf this sounds less than convenient – the morning start, if it happens, would be for the benefit of a vast TV audience in the US – the Rams players don’t care about how long they travel, about the unusual size of the MCG, or the potential for a weird starting time.\n\nEthan Evans shapes for a drop punt-style kick as the Los Angeles Rams take on the New Orleans Saints. Credit: Los Angeles Rams\n\n“[It] makes no difference to me,” said star LA running back Kyren Williams in one of a series of interviews this week organised for Australian media by the Rams, who have struck a deal with the Victorian government that will see the Rams play an as-yet-unnamed opponent in the week of the AFL semi-finals.\n\n“I’ll play wherever, wherever they tell us the ball’s going to be kicked off I’ll go play,” said Williams.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/motorsport/bortoleto-crashes-in-sao-paulo-20251115-p5nfn2.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Bortoleto crashes in Sao Paulo",
        "publish_date": "Sat, 15 Nov 2025 09:57:45 +1100",
        "category": "finance",
        "authors": [],
        "text": "Bortoleto crashes in Sao Paulo\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/rugby-union/sure-the-wallabies-are-tired-that-s-not-the-only-reason-they-re-struggling-in-the-north-20251114-p5nfft.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Sure, the Wallabies are tired. That’s not the only reason they’re struggling in the north",
        "publish_date": "Sat, 15 Nov 2025 09:41:00 +1100",
        "category": "sports",
        "authors": [
            "Paul Cully"
        ],
        "text": "The Wallabies have the chance to revive their tour against Ireland in Dublin this weekend, but the sense that a slow-motion car crash is unfolding in the north is not unfamiliar to the Wallabies faithful.\n\nSince 2013, only two of the Wallabies’ end-of-season tours against Six Nations opponents have yielded more wins than losses. The first was in 2013, when new coach Ewen McKenzie guided the Wallabies to an impressive 4-1 record in what would turn out to be his only northern tour, and the second was in 2016, as Michael Cheika’s side went 3-2 in a tough tour that finished with losses to Ireland and England.\n\nThe Wallabies slumped to a demoralising defeat in Udine. Credit: Getty Images\n\nSuch successful tours were relatively commonplace in the first part of the new millennium. To provide an example of how expectations have changed, coach Robbie Deans was on the brink of being sacked after the Wallabies lost 33-6 to France in the first Test of the 2012 tour.\n\nDeans’s side went on to beat England, Italy and Wales in the subsequent weeks.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/cricket/the-paradox-of-pace-what-australia-and-england-have-to-do-to-win-the-first-ashes-test-20251113-p5nf9t.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "The paradox of pace: What Australia and England have to do to win the first Ashes Test",
        "publish_date": "Sat, 15 Nov 2025 09:33:00 +1100",
        "category": "sports",
        "authors": [
            "Greg Chappell"
        ],
        "text": "Perth, home to the WACA and the modern Optus Stadium, boasts a reputation built on sheer pace and bounce. The strip here is pure energy, where the ball flies with a velocity unmatched anywhere else. Instinct suggests that to conquer such an intimidating surface, a batter must meet fire with fire.\n\nBut here lies the paradox of pace: the hardest, quickest pitches in the world demand the slowest hands and the calmest mind. The harder a batter tries to hit the ball, the greater their chance of failure. To master the extreme speed, one must yield to it, allowing the wicket’s natural venom to do the work, converting pace into timing.\n\nPaceman Mitchell Starc has had plenty of experience bowling at the WACA in Perth. Credit: Getty Images\n\nThe velocity generated in Perth is a potent psychological weapon. Cricketers fear facing a ball delivered above 140km/h, not because they worry about injury, but because they know they have too little time to react. This anxiety creates a profound vulnerability, turning a difficult challenge into a mental breakdown.\n\nWhen facing express pace, a batter has less than half a second – closer to 0.4 seconds – to make a complex decision: whether they are playing or leaving, attacking or defending, and crucially, committing to the front or back foot. If a batter does not have a strong mental routine, the first thing that goes is their concentration.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/business/markets/inside-our-journalism-and-the-real-estate-agent-tricks-used-to-underquote-20251115-p5nfn0.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Inside our journalism and the real estate agent tricks used to underquote",
        "publish_date": "Sat, 15 Nov 2025 08:58:47 +1100",
        "category": "finance",
        "authors": [],
        "text": "Inside our journalism and the real estate agent tricks used to underquote\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later. Dismiss\n\nOur network\n\nOpen Navigation Menu The Sydney Morning Herald",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/world/bus-crashes-into-pedestrians-in-central-stockholm-20251115-p5nfmz.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Bus crashes into pedestrians in central Stockholm",
        "publish_date": "Sat, 15 Nov 2025 08:53:40 +1100",
        "category": "finance",
        "authors": [],
        "text": "Bus crashes into pedestrians in central Stockholm\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/lifestyle/king-charles-celebrates-77th-birthday-20251115-p5nfmy.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "King Charles celebrates 77th birthday",
        "publish_date": "Sat, 15 Nov 2025 08:43:41 +1100",
        "category": "lifestyle",
        "authors": [],
        "text": "King Charles celebrates 77th birthday\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/lifestyle/life-and-relationships/you-dress-better-than-your-partner-you-could-be-in-a-swag-gap-relationship-20251114-p5nfek.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "You dress better than your partner? You could be in a ‘swag gap’ relationship",
        "publish_date": "Sat, 15 Nov 2025 08:00:00 +1100",
        "category": "lifestyle",
        "authors": [
            "Laura Craik"
        ],
        "text": "You’re in the final stages of preparation for your date-night dinner – which is to say your hair is freshly washed and blow-dried, your kitten heels have been located, and your blouse is tucked neatly into your beloved black velvet trousers.\n\nThe table is booked for 8pm, which means your husband is cutting it a bit fine. He only went into the shower 10 minutes ago. Still, at least he’s had one.\n\nIt quickly transpires that showering is his only concession to the evening ahead. For while he may be clean, he appears to be wearing the same clothes he’s worn all week – or a variant of them. His navy quarter-zip reveals a crumpled shirt collar, and there’s a small tear in his cords.\n\nAlways immaculately turned out, Hailey Bieber steps out with her husband, Justin, who is dressed in streetwear. Credit: GC Images\n\nBut it’s the footwear that really rankles. You weren’t expecting freshly polished Oxfords, but Birkenstock Arizonas? With socks?",
        "source": "SMH"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/australias-climate-change-minister-travels-to-brazil-for-un-summit-midday-bulletin-15-november-2025/jcz1dkfe2",
        "title": "Australia's Climate Change Minister travels to Brazil for UN summit | Midday Bulletin 15 November 2025",
        "publish_date": "Sat, 15 Nov 2025 00:55:54 +0000",
        "category": "sports",
        "authors": [],
        "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts .\n\n\n\n\n\nTRANSCRIPT\n\n\n\nAustralia's Climate Change Minister travels to Brazil for the final week of negotiations at the UN Climate Summit.\n\nA five-metre tall statue of Pope Leo unveiled in Peru.\n\nIn tennis, Alex De Minaur to face defending champion Jannik Sinner in the semis of the ATP Finals\n\nClimate Change Minister Chris Bowen says he will continue to advocate strongly for Australia's bid to host COP31 in partnership with the Pacific.\n\n\n\n\n\nThe decision on who will host next year's UN climate summit will be made over the coming week at this year's COP in Brazil.\n\n\n\n\n\nIf Türkiye does not withdraw its bid to host the event, it will be hosted in the German city of Bonn*.\n\n\n\n\n\nMr Bowen, who is travelling to Brazil for the final week of COP, says he hopes it doesn't come to that.\n\n\n\n\n\n\"The situation remains that Australia has the overwhelming support of the world to host COP31. But that is not how the system works. It is not a ballot process in that sense. That means we need to reach an agreement with Türkiye. That's difficult. I do know it is in Australia's best interest to be COP President and to host COP. I will continue to have conversations with my Turkish counterparts - in consultation with the Pacific over the week or so. And we'll see how we go.\"\n\n\n\n\n\n*Under the COP rules, hosting duties rotate through five blocs of countries, which for 2026, includes Türkiye, Australia, Canada and other countries in Europe. If no consensus is reached the summit reverts to Bonn, a city in Germany that hosts the UN's climate secretariat\n\n\n\n\n\n—\n\n\n\n\n\nThe Bureau of Meteorology says severe storms will impact much of eastern Australia this weekend, after heavy rain, wind and hail resulted in thousands of households losing power in southeast Queensland.\n\n\n\n\n\nThe storm cell moved north-east over the Brisbane region on Friday evening, before heading out to sea.\n\n\n\n\n\nMore than 11, 000 households lost power.\n\n\n\n\n\nMiriam Bradbury, from the Bureau of Meteorology, says there has already been a significant amount of rainfall in the last 24 hours - and there is more to come.\n\n\n\n\n\n\"In the east (of Australia), in particular, we've seen about 30 to 70 millimetres of rain in southeast Queensland and northeast New South Wales. And this weekend, storms remain possible in Queensland and eastern New South Wales; pushing down through parts of Victoria as well. The key areas of concern though - the areas likely to be hardest hit are where we might see severe thunder storms. So for today, Saturday, those severe thunderstorm areas include southeast Queensland and much of eastern New South Wales.\"\n\n\n\n\n\n—\n\n\n\n\n\nA five-metre tall statue of Pope Leo XIV has been unveiled in northern Peru.\n\n\n\n\n\nThe monument is intended to honour the pontiff’s ties to the country.\n\n\n\n\n\nThe statue is part of a new tourist route called \"Paths of Pope Leo XIV\" designed to showcase sites connected to his pastoral work in Peru, where he served from 1985 to 2023.\n\n\n\n\n\nAt the ceremony for the statue's unveiling, Chiclayo bishop Monsignor Edinson Edgardo Farfan Cordova says the statue celebrates the spiritual connection between the city and the head of the Catholic Church.\n\n\n\n\n\n(Spanish then translated into English): \"The heart of the Holy Father is in Peru. I am sure that in a few years he will give us an answer and visit his beloved Peru, especially the city of Chiclayo.\"\n\n\n\n\n\n—\n\n\n\n\n\nAround 3,000 deaf and hard-of-hearing athletes are gathering in Tokyo for the 25th Summer Deaflympics, with the opening ceremony kicking off today.\n\n\n\n\n\nThe event takes place just over 100 years after the first Deaflympics were held in Paris in 1924.\n\n\n\n\n\nAustralia is sending a team of more than 90 athletes to the event, including members of the country's deaf women's basketball team, the Geckos.\n\n\n\n\n\nAdam Kosa, the president of The International Committee of Sports for the Deaf, says 81 countries are represented - including some for the first time.\n\n\n\n\n\nJapanese then translated into English: \"As a refugee, South Sudan. It is going to be their first time joining this Games. The East Timor and Laos - they are going to join this Game for the first time. So I am very, very happy.\"\n\n\n\n\n\n(Athletes will contest more than 200 medal events across 21 disciplines, including athletics, badminton, and karate.\n\n\n\n\n\nThe event continues until November 26.\n\n\n\n\n\n—\n\n\n\n\n\nIn Tennis, after achieving mission improbable, Alex de Minaur must now pull off what shapes as his mission impossible at the ATP Finals in Turin.\n\n\n\n\n\nAs expected in front of his home fans, defending champ Jannik Sinner breezed to yet another indoor victory in his final group match (on Friday 14 Nov).\n\n\n\n\n\nHe overcame the power serving of Ben Shelton to win 6-3 7-6 (7-3) and set up a semi-final with the Australian No.1 (Sat 15 Nov local time).\n\n\n\n\n\nSinner says he is looking forward to the match.\n\n\n\n\n\n\"In the matches we played, he has been close in a couple of matches. Especially this season we played always in different situations on the court. On different types of courts. And tennis really can change a lot from one day to the other. So I am just excited to go at least one more time on this court. Having the great support, and great crowd. And I hope I can perform in the best possible way.\"\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/bowen-heads-to-brazil-to-push-for-australias-cop31-bid-amid-standoff-with-turkiye/6yupway4l",
        "title": "Bowen heads to Brazil to push Australia's COP31 hosting bid amid standoff with Türkiye",
        "publish_date": "Sat, 15 Nov 2025 00:28:44 +0000",
        "category": "finance",
        "authors": [],
        "text": "Climate Change Minister Chris Bowen will travel to the COP30 climate summit in Brazil to press Australia's case to host next year's event, amid a standoff with Türkiye.\n\n\n\n\n\nAustralia and Türkiye both bid to host COP31, and with neither side backing down, the summit risks defaulting to Bonn, Germany — where the UN climate agency is based — if the dispute cannot be resolved.\n\n\n\n\n\nBowen, who is also the energy minister, left Sydney on Saturday morning for Belém to lead the Australian delegation at COP30.\n\n\n\n\n\nHe said he would push for Australia's COP31 bid, which is backed by Pacific island nations and would give Australia a chance to showcase its clean energy industry.\n\n\n\n\n\n\"It's not a matter of fighting on for months afterwards — it gets decided at this conference,\" he told reporters before his flight from Sydney Airport.\n\n\n\n\n\n\"Australia has the overwhelming support of the world to host COP31 but that's not how the system works.\n\n\n\nREAD MORE Australia's dispute with Türkiye over COP31 hosting rights could see both miss out\n\n\"It's not a ballot process ... that means we need to reach an agreement with Türkiye, that's difficult.\"\n\n\n\n\n\nIn a statement before he left, Bowen said global investment in clean energy projects would exceed US$2 trillion in 2025 and Australia's climate change targets \"were a big green light to local and international investors that we want to be part of this global shift\".\n\n\n\n\n\n\"As the National Climate Risk Assessment showed us, our nation has a lot at stake when it comes to climate change but every effort we make now will help avert the worst impacts,\" he said.\n\n\n\n\n\n“That’s why we want to host COP31 in partnership with the Pacific — to bring the world to the Pacific for the first time and show how together we can fight this existential threat.\"\n\n\n\nPacific islands back Australian bid\n\nThe Conference of the Parties, or COP, is the annual gathering of countries that have signed the Paris Agreement and the UN Framework Convention on Climate Change.\n\n\n\n\n\nHost countries take on a presidential role, allowing them to set the summit's agenda, highlight domestic climate issues and play a key role in brokering negotiations.\n\n\n\nAustralia made its bid to host COP31 in Adelaide with the support of the Pacific Islands Forum, a bloc of 18 countries among the most vulnerable to climate change.\n\n\n\n\n\nPrime Minister Anthony Albanese wrote to Turkish President Recep Tayyip Erdogan in an attempt to resolve the dispute, but Türkiye has refused to concede and withdraw its bid to host in Antalya.\n\n\n\n\n\nTürkiye has previously argued its Mediterranean location would help reduce emissions from flights bringing delegates to the conference, and has pointed out its smaller oil and gas industry compared to Australia.\n\n\n\n\n\nIn July, the UN urged Australia and Türkiye to resolve the hosting standoff, calling the delay unhelpful and unnecessary. It had set a deadline of June for the group to reach consensus.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/trump-cuts-tariffs-on-food-imports-including-australian-beef-amid-grocery-price-fears/n7710l8um",
        "title": "Trump cuts tariffs on food imports, including Australian beef, amid price fears",
        "publish_date": "Fri, 14 Nov 2025 23:11:41 +0000",
        "category": "finance",
        "authors": [],
        "text": "US President Donald Trump has signed an executive order to exempt a wide range of food imports, including beef, tomatoes, coffee and bananas, from sweeping tariffs imposed earlier this year on nearly every country.\n\n\n\n\n\nThe move means Australian beef — one of Australia's leading exports to the US — will no longer be subject to a 10 per cent tariff.\n\n\n\n\n\nThe order is part of a major push by Trump and his top officials to address Americans' growing concerns about persistently high grocery prices.\n\n\n\n\n\nThe new exemptions — which take effect retroactively at midnight on Thursday — mark a sharp reversal for Trump, who has long insisted that his import duties are not fuelling inflation.\n\n\n\n\n\nThey come after a string of victories for Democrats in state and local elections in Virginia, New Jersey and New York City, where affordability was a key topic.\n\n\n\nIt said any refunds due would be processed under the rules and procedures of the U.S. Customs and Border Protection.\n\n\n\n\n\nTrump has upended the global trading system by imposing a 10 per cent base tariffs on imports from every country, plus additional specific duties that vary from state to state.\n\n\n\n\n\nFriday's order followed framework trade deals announced on Thursday that will eliminate tariffs on certain foods and other items imported from Argentina, Ecuador, Guatemala and El Salvador, once those deals are finalised, with US officials eyeing additional deals before the year's end.\n\n\n\n\n\nTrump has focused squarely on the issue of affordability in recent weeks, while insisting that any higher costs were triggered by policies enacted by former president Joe Biden, and not his own tariff policies.\n\n\n\nREAD MORE Donald Trump softens tone on China after tariff tensions flare\n\nConsumers have remained frustrated over high grocery prices, which economists say have been fuelled in part by import tariffs and could rise further next year as companies start passing on the full brunt of the import duties.\n\n\n\n\n\nThe top Democrat on the House of Representatives Ways and Means Committee, Richard Neal, said the Trump administration was \"putting out a fire that they started and claiming it as progress\".\n\n\n\n\n\n“The Trump Administration is finally admitting publicly what we’ve all known from the start: Trump’s Trade War is hiking costs on people,\" Neal said in a statement.\n\n\n\n\n\n\"Since implementing these tariffs, inflation has increased and manufacturing has contracted month after month.\"\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/as-power-prices-surge-david-has-found-ways-to-cut-running-costs-by-thousands/b8175zrzi",
        "title": "As power prices surge, David has found ways to cut running costs by thousands",
        "publish_date": "Fri, 14 Nov 2025 21:00:40 +0000",
        "category": "finance",
        "authors": [],
        "text": "Listen to Australian and world news and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT:\n\n\n\n\n\nDavid Stuart runs a paint business on Sydney’s northern beaches and when it comes to cutting electricity costs, he’s ahead of the curve.\n\n\n\n\n\n\"Our factory here in Brookvale is powered 100 per cent with solar energy. Before we went solar, we were spending $24,000 a year on electricity. All that was being wasted. We took the plunge, we went solar, we got a bank loan to do it. That bank loan is now paid off. Our power bills are now negative.\"\n\n\n\n\n\nAs managing director of Colormaker Industries, Mr Stuart has combined sustainability and innovation to beat rising prices.\n\n\n\n\n\n\"Electricity is an inescapable cost for most small businesses. We're an Australian manufacturer, trying to be competitive on a world stage. As power prices rise, that takes money out of the bottom line.\"\n\n\n\n\n\nMr Stuart’s paint factory now runs entirely on renewable energy, powered by a 100-kilowatt rooftop array backed by a custom-built battery.\n\n\n\n\n\n\"Our big battery is Australian designed and built. It can take the surplus solar that we produce during the course of the day, store it overnight, then we can run all of our morning production with it. Had you told me six years ago we'd be where we are now, I would never have believed you.\"\n\n\n\n\n\nMore Australians are buying big batteries as upfront prices fall, by around 20 per cent last year alone, according to the Climate Council’s Greg Bourne.\n\n\n\n\n\n\"Initially the cost of batteries was too high and the payback period didn't really work, but that crossover point has really occurred right now and there's many more batteries available, whether it be at the residential level or at the small business level.\"\n\n\n\n\n\nAs power prices soar, up by 9 per cent last quarter according to the Australian Bureau of Statistics, Mr Bourne urges more people to get on board with battery storage.\n\n\n\n\n\n\"We have 4 million homes already with solar panels, but it's a much smaller percentage have got batteries. I would want it to double and double and double again.\"\n\n\n\n\n\nElectricity prices are driving up Australia’s inflation figures.\n\n\n\n\n\nThe cost of living (CPI) rose by 3.2 per cent in the year to September.\n\n\n\n\n\nAccording to a new report from the Australian Chamber of Commerce and Industry, these rising costs are hurting Australia’s 2.5 million small business owners.\n\n\n\n\n\nCEO Andrew McKellar explains.\n\n\n\n\n\n\"Energy is certainly one of the top costs that small businesses cite. So, it is very clear that rising energy bills over recent years have taken a toll, we know that across NSW, Victoria and QLD for many businesses those costs have gone up 200 per cent in the past three years or so and it’s a significant cost pressure that many small businesses are facing!\"\n\n\n\n\n\nFor its Small Business Conditions Survey, the Chamber of Commerce spoke with 1,100 small business owners across the nation.\n\n\n\n\n\nMore than one quarter, 28 per cent, had considered closing in the past year and 30 per cent worried they may close within the next 12 months.\n\n\n\n\n\nCost pressures are a concern for the Council of Small Business Organisations Australia (COSBOA).\n\n\n\n\n\nChair Matthew Addison says many owner operators surveyed for the Small Business Perspectives reported they use personal savings to stay afloat.\n\n\n\n\n\n\"Really tough business environment we're in at the moment and what this report brought out was 64 per cent said they recorded lower profits this year than they did the year before. Sixty per cent reported as business owners, they couldn't pay themselves every payday.\"\n\n\n\n\n\nDespite rising costs, including power prices, Mr Addison says going solar is not for everyone.\n\n\n\n\n\n\"Bill comparison is always a wise technique. If a business is in a situation, they can look at putting solar panels in or put a battery in. But in the two and a half million small businesses in Australia, one and a half million of those are sole traders, that's the individual themselves. They don't necessarily have the time or capacity or the financial capacity to invest in what might be the solar panels or the battery.\"\n\n\n\n\n\nBut with profits under pressure, Mr Stuart says making small changes can make a big difference to the bottom line.\n\n\n\n\n\n\"We bought in an energy efficiency engineer, he did an audit of the entire site and found that 26 per cent of our electricity was being used to make compressed air and a third of that was being wasted. So, we bought a new compressor and over the 12 months after that was introduced, we saw a 23 per cent drop in entire energy usage. We also bought an electric forklift. So that means we've got no more LPG on site. W e changed our lighting to LEDs. That's something that any company can do, at surprisingly little cost. And we also bought a mega shredder. So, a lot of the cardboard that we had previously sent out to be recycled we can now use on site and give it a second life. Since we introduced solar and the other enhancements, we're now saving somewhere between $35,000 and $50,000 a year every year. That's baked in!\"\n\n\n\n\n\nBusiness failure rates are forecast to stay above 5 per cent for the next year, and Mr Stuart has this advice for those struggling.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/april-le-sueur-claims-2025-natsi-sports-award/clej1o01a",
        "title": "April Le Sueur claims 2025 NATSI Sports Award",
        "publish_date": "Fri, 14 Nov 2025 21:00:00 +0000",
        "category": "sports",
        "authors": [],
        "text": "Listen to Australian and world news and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT:\n\n\n\n\n\nAs a First Nations community-led sporting club with a rich history, Rumbalara is where April Le Sueur hangs out, even when she was just a baby.\n\n\n\n\n\n\"I've been a part of this club since I was a baby, a baby 1 year-old running around, being babysat by everyone around here.\"\n\n\n\n\n\nThe 24-year-old used to play netball and Australian football at the club, but a back injury is keeping her off the field.\n\n\n\n\n\nInstead of staying away, Le Sueur chose to stay involved another way.\n\n\n\n\n\nShe became a volunteer there, helping with errands so others can focus on the sports.\n\n\n\n\n\nShe's now a board member at Rumbalara, and also the chair of the women's football community and the women's football team manager.\n\n\n\n\n\n\"I like knowing what's running down on a Sunday and being able to control a few things otherwise I'm worried it won't get done.\"\n\n\n\n\n\nThis weekend, Le Sueur will be receiving the 2025 National Aboriginal and Torres Strait Islander Sport Award, or the NATSI Sport Award, after becoming the AFL Young Leader of the Year .\n\n\n\n\n\nComing along with the award is a brand new car, which means she now faces new requests from her friends at the club.\n\n\n\n\n\n\"I've been in it but she hasn't given me a lift to training in it yet but it's nice you'll have to get her to now.\"\n\n\n\n\n\nBut besides the jokes, Le Sueur's peers say they are grateful for the volunteering work she's done for the team.\n\n\n\n\n\n\"I'm just really grateful for April. I haven't been playing footy for that long / and if it wasn't for her encouraging me to a skill level I probably wouldn't be here.\"\n\n\n\n\n\nShonelle Ritchie is the secretary of Rumbalara.\n\n\n\n\n\nShe praises Le Sueur's young leadership in the club.\n\n\n\n\n\n\"She's amongst her peers and community and is now coming into the space as one of our young leaders.\"\n\n\n\n\n\nRumbalara's history can be traced back to the 1800s.\n\n\n\n\n\nMs Ritchie says the sports club has become an important place for the First Nations community.\n\n\n\n\n\n“It's so important to have this place - it's our meeting ground basically where we can come and connect.”\n\n\n\n\n\nApril Le Sueur agrees.\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/trump-orders-criminal-investigation-into-epsteins-alleged-ties-to-clinton-and-other-democrats/lap4lr4dx",
        "title": "Trump orders criminal investigation into Epstein's alleged ties to Clinton and other Democrats",
        "publish_date": "Fri, 14 Nov 2025 20:14:32 +0000",
        "category": "finance",
        "authors": [],
        "text": "The US Justice Department said it will carry out President Donald Trump's request to investigate Jeffrey Epstein's alleged ties with former Democratic president Bill Clinton, as Trump sought to shift the focus from his own relationship with the convicted sex offender.\n\n\n\n\n\nThe move comes two days after a congressional committee released thousands of documents that raised new questions about Trump's relationship with the late financier, and marks the latest in a series of demands by Trump for federal law enforcement to pursue his perceived political enemies.\n\n\n\n\n\nAttorney general Pam Bondi on Friday said Jay Clayton, the top federal prosecutor in Manhattan, will take the lead on the investigation.\n\n\n\n\n\nThe Epstein scandal has been a political thorn in Trump’s side for months, partly because he amplified conspiracy theories about Epstein to his own supporters.\n\n\n\n\n\nMany Trump voters believe Bondi and other Trump officials have covered up Epstein’s ties to powerful figures and obscured details surrounding his death by suicide in a Manhattan jail in 2019.\n\n\n\nAlong with Clinton, who socialised with Epstein in the early 2000s, Trump said he had asked the Justice Department to investigate former treasury secretary Larry Summers, and Reid Hoffman, the LinkedIn founder who is also a prominent Democratic donor.\n\n\n\n\n\nAll three men were mentioned in the 20,000 Epstein-related documents released by the House Oversight Committee on Wednesday.\n\n\n\n\n\n\"Epstein was a Democrat, and he is the Democrat’s problem, not the Republican’s problem!\" Trump wrote on social media. \"They all know about him, don't waste your time with Trump. I have a Country to run!\"\n\n\n\n\n\nJPMorgan, which is also under investigation, said in a statement it regrets its past association with Epstein, who was a client between 1998 and 2013, and did not help him commit \"heinous acts\".\n\n\n\nJeffrey Epstein (left) and Donald Trump at Trump's Florida estate in 1997. Source: Getty / Davidoff Studios Photography JPMorgan paid $290 million in 2023 to some of Epstein's victims to settle accusations that it had turned a blind eye to his sex trafficking. The bank did not admit wrongdoing in the settlement.\n\n\n\n\n\nClinton and Summers did not immediately respond to requests for comment. Hoffman could not be immediately reached for comment.\n\n\n\nTrump faces continued pressure over Epstein\n\nTrump and Epstein were friends during the 1990s and the 2000s, but Trump says he broke off ties before Epstein pleaded guilty in 2008 to charges of soliciting a minor for prostitution.\n\n\n\n\n\nTrump has consistently denied knowing about the late financier’s abuse and sex trafficking of underage girls.\n\n\n\nLISTEN TO White House dismisses emails that raise new questions about Trump ties to Epstein SBS News 05:24 English\n\nStill, some of Trump's most ardent supporters have accused his administration of a cover-up. Trump, who frequently engages with reporters, has declined to take questions over the last several days as new revelations about Epstein have become public.\n\n\n\n\n\nThe Republican-controlled House of Representatives is expected to vote next week on legislation that would force the Justice Department to release all of the material it holds on Epstein, who was facing federal charges of sex trafficking minors at the time of his suicide.\n\n\n\n\n\nThe measure is expected to pass, even after house speaker Mike Johnson repeatedly manoeuvred to try to block the vote. It would also require the Senate to pass similar legislation and Trump's approval to compel the Justice Department to act.\n\n\n\n\n\nJust four in 10 Republicans in an October Reuters poll said they approved of Trump's handling of the Epstein files, well below the nine in 10 who approve of his overall performance in the White House.\n\n\n\nNo credible evidence has surfaced that Clinton, Summers or Hoffman were involved in Epstein's sex trafficking. All have previously denied wrongdoing and have expressed regret about their relationships with him.\n\n\n\n\n\nClinton flew on Epstein's private jet several times before the financier's 2008 conviction, while Summers accepted philanthropic gifts from Epstein while serving as president of Harvard University. Hoffman has acknowledged meeting with Epstein multiple times in professional situations.\n\n\n\n\n\nBefore his 2008 conviction, Epstein worked and socialised with a long list of well-known figures, including the UK's former Prince Andrew, who was stripped of his royal title due in part to his association with Epstein.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/if-i-had-legs-id-kick-you-film-asks-what-if-a-mother-regrets-children/88i3o5x66",
        "title": "What if a mother regrets having children? This film starring Rose Byrne aims to find out",
        "publish_date": "Fri, 14 Nov 2025 19:35:24 +0000",
        "category": "entertainment",
        "authors": [],
        "text": "It's pretty controversial to hate your children. It's even more controversial to leave your dying child in a hotel room to go smoke and flirt with a stranger.\n\n\n\n\n\nBut that's the type of motherhood at the heart of indie production house A24's new film, If I Had Legs I'd Kick You.\n\n\n\n\n\nStarring Australian actor Rose Byrne and written and directed by American filmmaker Mary Bronstein, If I Had Legs I'd Kick You follows therapist Linda (played by Byrne) — one of the unapologetically difficult mothers you'll see on screen.\n\n\n\n\n\nWith her sick daughter requiring round-the-clock care, Linda's life begins to unravel in spectacular fashion. She becomes obsessed with a mysterious hole in her ceiling — a symbol of her waning mental state, poor decision-making and inner turmoil.\n\n\n\n\n\nForced into a tiny motel room with her dying child, Linda sneaks out at night to eat Reese's Peanut Butter Cups, drink wine and engage in a flirtationship with the motel worker downstairs (a surprising A$AP Rocky) despite having a husband. She ditches her daughter's therapy sessions, zones out and offers bad advice to her own clients, confessing her darkest thoughts to her therapist and colleague (Conan O'Brien).\n\n\n\n\n\nShe's stressed. Sleepless. Hungry. An alcoholic. Trying to hold it all together — and failing.\n\n\n\nWith a surprising cast featuring the likes of Rose Byrne, rapper A$AP Rocky and talk-show host Conan O'Brien, If I Had Legs I'd Kick You might seem like a quirky affair. But there's a deeper side to it. Source: Supplied The casting might seem intentionally surprising, but the film is less about shock value than it is a meditation on the unspeakable parts of motherhood that rarely make it to the screen.\n\n\n\n\n\n\"What I wanted to do expressly was create a portrait of a mother that I had never seen before,\" Bronstein tells SBS News.\n\n\n\n\n\n\"When I thought about it, I was like: what movie have I ever seen where it centres a woman who happens to have a child, but it's not about her mothering and it doesn't judge her and it lets her be an actual human being? That's written and made by a woman?\"\n\n\n\nWriter and director Mary Bronstein doesn't want audiences to escape from the spiral of anxiety and existential dread that comes with her new film, If I Had Legs I'd Kick You. Source: Getty / Mondadori Portfolio Bronstein says she made the film for a very particular audience: mothers who may not recognise themselves in glossy or idealised portrayals.\n\n\n\n\n\n\"The more specific you get with something, the more people can actually relate to it. The movie is about something that's very specific: a mother who's in a very specific situation that most mothers are not going to be in.\"\n\n\n\n\n\nThe film is partially inspired by Bronstein's own experience caring for her seven-year-old daughter in a tiny San Diego motel room, surrounded by takeaway containers and existential dread — while navigating what she calls a \"confused combination of reverence and complete disrespect\" for motherhood.\n\n\n\n'You're stuck with her'\n\nAcross 113 minutes, If I Had Legs I'd Kick You drags its audience into a steady, uncomfortable spiral.\n\n\n\n\n\nWe watch Byrne's Linda eat with animalistic intensity — mouth open, food falling out — a visual shorthand for a woman who can't take care of herself. She drinks two bottles of wine a night while her daughter, meant to be under constant surveillance, sleeps alone. She buys a hamster and watches it escape and get run over by a car, guts spurting before the camera cuts abruptly to a slice of lasagna.\n\n\n\n\n\nThen there's the hole: a growing, pulsing void in the ceiling that serves as the film's trigger point. Even Bronstein isn't sure if the hole is real or not, explaining it as a symbol of that place in your brain where you shove everything that you can't deal with — knowing full well that it will force its way out eventually.\n\n\n\nIn If I Had Legs I'd Kick You, Rose Byrne is going through an \"existential crisis of tremendous proportions\". Source: Supplied / A24 \"This woman is having an existential crisis of tremendous proportions. She's experienced a trauma that she's avoiding at all costs. She's running away from it for the entire movie and it's going to come and get her,\" Bronstein says.\n\n\n\n\n\n\"It starts out as the first problem in the film and then expands out into this thing that takes on meaning beyond anything that reality can answer. I can't even really tell you [what it is] because it's a completely expressive idea that I can't fully articulate in words.\"\n\n\n\nREAD MORE Anya says having a child was the 'stupidest' decision she ever made\n\nByrne's performance is repulsive, unkempt, unpleasant — and terrifyingly real.\n\n\n\n\n\n\"She's in a state where she cannot take care of herself in any way, shape or form. We don't even know if she's bathing,\" Bronstein says.\n\n\n\n\n\n\"She has a de-evolution of appearance in this film. As her emotional state goes down, so does her appearance. She can't pretend anymore on the outside, it's gone.\"\n\n\n\nIf you are seeing an actual child, your sympathy is immediately going to go with that child.\n\nHer child, meanwhile, is a faceless voice that exists only off-screen and whose presence is felt through Byrne's reactions. The camera stays close to Bryne, lingering on the small, irritated microexpressions that have already generated Oscar's buzz.\n\n\n\n\n\n\"As soon as you're dealing with some of the behaviours that Linda is doing, if you are seeing an actual child, your sympathy is immediately going to go with that child. That's how we're wired,\" Bronstein says.\n\n\n\n\n\n\"What I wanted to do is make it impossible — impossible for there to be an easy way for the viewer to put their sympathy elsewhere than her. You're stuck with her. It's about her.\"\n\n\n\n'There's a deep shame'\n\nWhen it comes to motherhood on screen, the depictions we get are often narrow. In films like Bad Moms, the 'bad mother' is softened with humour — she might smoke too much or go out clubbing on a Wednesday, but she still loves her kids. She doesn't hate them. She doesn't regret becoming a mother.\n\n\n\n\n\nThat sanitation leaves little space for women who do struggle — those who experience perinatal depression, anxiety, or even regret having children entirely.\n\n\n\n\n\nUp to one in five women experience perinatal depression or anxiety during pregnancy or following the birth of their baby, according to Perinatal Anxiety & Depression Australia (PANDA). Postnatal psychosis — rarer but more severe — affects one to two new mothers per 1,000 births. Women may also experience PTSD, bipolar disorder or schizophrenia after giving birth.\n\n\n\nWriter and director Mary Bronstein isn't interested in 'bad' mothers. Instead, she hopes her film will break apart overly sentimental depictions of motherhood. Source: Supplied / A24 Julie Borninkhof, a clinical psychologist and the CEO of PANDA, says perinatal depression and anxiety often look different for everyone — sometimes like wanting to \"climb into a dark little box and block yourself away\", or being \"wound up like a rubber band\" with anxiety.\n\n\n\n\n\n\"Baby blues is an experience that's really common to women … but it's more short-winded and usually only lasts for a few weeks following the birth of a baby. Whereas anxiety and depression can go on for months and beyond the 12-month period,\" Borninkhof tells SBS News.\n\n\n\n\n\nBronstein tackles that taboo directly.\n\n\n\nOne subplot follows Linda's client Caroline (Australian Danielle Macdonald), a new mother who abandons her baby mid therapy session. Earlier, she emailed Linda a video of Andrea Yates — the real-life Texas mother who drowned her five children in 2001 after developing postpartum psychosis — fearing she might follow the same path.\n\n\n\n\n\n\"That storyline was very inspired by a lot of real cases that have happened in the [United] States. Every once in a while on the news, it's like: 'This mother did this. She did that'. She's villainised.\" Bronstein says.\n\n\n\n\n\n\"Sometimes it is bad people doing bad things. But most often, it's a mental illness. It's a real thing. It's postpartum depression and postpartum psychosis.\"\n\n\n\nWe're sold a bill of goods ... but it's not like that for a lot of women.\n\nBronstein wanted to challenge the overly sentimental depictions of motherhood we're sold.\n\n\n\n\n\n\"We're sold a bill of goods — the baby comes out, they give it to the mother, and you immediately look at and bond with the baby. But it's not like that for a lot of women.\"\n\n\n\n\n\nBorninkhof agrees that varied portrayals can help dismantle shame and stigma.\n\n\n\n\n\n\"People still find it difficult to say that they're struggling and that they need help … this pervasive feeling of being a failure and that you're not able to do what so many others are able to do is still a real barrier to people seeking help.\"\n\n\n\n'Maybe I got rid of the wrong one'\n\nThe film's most polarising moment comes when Linda, reflecting on a previous abortion, wonders aloud to her therapist: \"Maybe I got rid of the wrong one\".\n\n\n\n\n\nIt's a punch to the gut — and exactly the point.\n\n\n\n\n\n\"I wrote it in the script. I took it out. I put it back in because I knew that was the line that was going to make people uncomfortable,\" Bronstein says. \"But I was like, no — that's why it needs to be in there.\"\n\n\n\nI wrote it in the script. I took it out. I put it back in because I knew that was the line that was going to make people uncomfortable.\n\n\"It's the only time in the movie where she's truly being honest and expressing something really real and she's fuc---g kicked in the face for it.\"\n\n\n\n\n\nRegret over parenthood isn't rare. While difficult to quantify, one 2023 study estimated that between 5 and 14 per cent of parents in developed countries regret having children and would choose childlessness if they could turn back time.\n\n\n\n\n\nOnline, communities like Reddit's r/regretfulparents (54,000 members) and the Facebook group 'I Regret Having Children' (88,000 followers) share anonymous confessions — a testament to the lingering taboo.\n\n\n\nThe film's most controversial line almost didn't make it to the final cut, with Bronstein worried it would make people \"uncomfortable\". Source: SBS News / A24 Borninkhof says such regret is \"normal\" and \"human\", but can become damaging if left unaddressed.\n\n\n\n\n\n\"For people who do experience regret about being a parent and then sit in that space, it's hard to parent through that feeling,\" she says.\n\n\n\n\n\n\"We need to get help with the internal conflict that comes with that as soon as possible.\"\n\n\n\n'There's nothing wrong with being uncomfortable'\n\nBorninkhof urges viewers with lived experience of perinatal mental illness to approach films like this with care.\n\n\n\n\n\n\"For some people who feel like they've gotten through and survived that experience and have learned and grown from it, they may feel a sense of empathy and distance from being able to see a movie like this,\" she says.\n\n\n\n\n\n\"Some people feel this great sense of empowerment and self-reflection because they see that their experience was real and valid.\"\n\n\n\nWhile one clinical psychologist warns a film like this could be confronting for those who have experienced perinatal mental illness, Bronstein says there's \"nothing wrong with being uncomfortable\". Source: Supplied / A24 But she says for those who might be in the \"thick of it\", it might be confronting.\n\n\n\n\n\n\"That's not because the portrayal is not correct or shouldn't be told, but simply because our ability to hold all of our emotions at once and see them portrayed on a screen or reflected back to us in somebody's words can be really confronting.\"\n\n\n\n\n\nBronstein says discomfort is part of the point.\n\n\n\nIf something makes you uncomfortable, you need to wonder why it makes you so uncomfortable.\n\n\"There's nothing wrong with being uncomfortable. If something makes you uncomfortable, you need to wonder why it makes you so uncomfortable,\" she says.\n\n\n\n\n\n\"Why can't a woman wonder that in the privacy of her therapist's office? Why can't she say that? She's not saying it to her child. She's not even saying it to her husband.\n\n\n\n\n\n\"It's none of my business if somebody likes the movie or doesn't like the movie … I made a movie that really is dealing with some very uncomfortable things.\n\n\n\n\n\n\"But if the reason you don't like it is because something made you uncomfortable, that interests me. Why would that be a reason to not like a movie?\"\n\n\n\n\n\nThe PANDA National Helpline is available 9am-7.30pm Monday to Friday on 1300 726 306. More information is available at panda.org.au .\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/australia-causes-of-death-dementia-2024/h18jp7paz",
        "title": "Dementia now Australia's biggest killer, as leading causes of death revealed",
        "publish_date": "Fri, 14 Nov 2025 05:09:42 +0000",
        "category": "lifestyle",
        "authors": [],
        "text": "This article references suicide and domestic violence.\n\n\n\n\n\nDementia has become the country's leading cause of death, according to the Australian Bureau of Statistics (ABS).\n\n\n\n\n\nThe ABS released new figures on Friday that revealed dementia, including Alzheimer's disease, accounted for more than 17,500 deaths (9.4 per cent) in Australia in 2024. The median age of death for those with dementia was 88.7 years old.\n\n\n\n\n\nDementia is an umbrella term for a group of symptoms caused by disorders affecting the brain. There are many forms, with the most common being Alzheimer's disease. Vascular dementia, related to blood flow to the brain, is also common.\n\n\n\n\n\nThe effects vary, but dementia generally affects memory, thinking, mood and behaviour. It is a progressive, degenerative, and terminal illness.\n\n\n\n\n\nDementia had long been the second-highest cause of death nationally behind ischaemic heart disease, with the two trading places in 2024.\n\n\n\nIschaemic heart disease, also known as coronary artery disease, is a condition in which the heart is damaged by narrow arteries, causing a reduced blood supply and a lack of oxygen.\n\n\n\n\n\nThere were 16,275 deaths from the disease in 2024, with the median age at death being 83 years. It remained the leading cause of death for men in Australia.\n\n\n\n\n\nChronic lower respiratory diseases were the third-highest cause of death in 2024, in front of cerebrovascular diseases and malignant neoplasms of trachea, bronchus and lung (lung cancer).\n\n\n\n\n\nOnly around 100 deaths separate the third and fifth spots, with the three conditions causing 9,229 deaths, 9,147 deaths and 9,119 deaths respectively.\n\n\n\nWhy are more people dying from dementia?\n\nThere has been a steady increase over the past decade in deaths caused by dementia. Between 2015 and 2024, the number of deaths in Australia due to dementia increased by nearly 39 per cent.\n\n\n\n\n\nLauren Moran, ABS' head of mortality statistics, said the leading causes of death in 2024 were in line with Australia's ageing population.\n\n\n\nSource: SBS News More than two-thirds (68.2 per cent) of deaths in 2024 were people aged over 75 years, compared to 66.1 per cent 10 years ago, and 63.3 per cent 20 years ago.\n\n\n\n\n\n\"People are now more likely to live to an age where they have a higher risk of developing dementia,\" Moran said.\n\n\n\n\n\n\"This is especially true for women who have longer life expectancies.\"\n\n\n\n\n\nDementia has been the leading cause of death for Australian women since 2016, and the ABS’ data showed more than 62 per cent of Australians who died from dementia in 2024 were women.\n\n\n\n\n\nThe ABS figures come after the Australian Institute of Health and Welfare (AIHW) said earlier this year that dementia had been the leading cause of death in 2023 — a year where the ABS found it to be ischaemic heart disease. Their counts differed because the AIHW included a small number of deaths from forms of dementia not featured in the ABS reporting.\n\n\n\n\n\nThe AIHW's Dementia in Australia report predicted that by 2065, more than one million Australians will be living with dementia — more than double the current number — as Australia's population grows and ages.\n\n\n\nProfessor Tanya Buchanan is the CEO of Dementia Australia, the country's peak body for those living with the condition.\n\n\n\n\n\nShe said that the figures reflect a need for more investment in public health approaches to brain health and dementia risk reduction, as well as more targeted support for people impacted by dementia.\n\n\n\n\n\n\"There are currently an estimated 433,300 Australians living with dementia, and without significant intervention, this number is expected to increase to more than one million by 2065,\" Buchanan said. \"We need to act on dementia now.\"\n\n\n\n\n\nBuchanan said that on a community level, there needed to be more awareness of dementia and brain health, to reduce the stigma experienced by those living with dementia.\n\n\n\n\n\n\"Across health, aged, disability and community care sectors, we need to ensure quality dementia care, with palliative care tailored to the needs of people living with dementia, their families and carers at the end of their life,\" she said.\n\n\n\n\n\n\"Although there are things we cannot change, like getting older or genetics, we now know that up to 45 per cent of dementia cases globally could be prevented or delayed by addressing modifiable risk factors.\"\n\n\n\nWhat else did the data show about deaths in 2024?\n\nThere were 187,268 deaths registered in Australia in 2024, an increase of 4,137 deaths from 2023. The age-standardised mortality rate decreased to 507.8 deaths per 100,000 people, from 513 the previous year.\n\n\n\n\n\nThe ABS figures showed significant differences when comparing the causes of death in major cities to more remote areas.\n\n\n\n\n\nWhile dementia was the leading cause of death in major cities and inner regional areas, it was ischaemic heart disease in outer regional, remote and very remote areas.\n\n\n\n\n\nSuicide was the 16th highest cause of death overall and it was the sixth leading cause of death in remote and very remote areas. Diabetes was the sixth leading cause of death nationally, but the second-highest in very remote areas, and fifth-highest in remote Australia.\n\n\n\n\n\nThe leading cause of death for Aboriginal and Torres Strait Islander people in 2024 was ischaemic heart disease, followed by chronic lower respiratory diseases, diabetes, lung cancer and suicide.\n\n\n\nLISTEN TO Early action urged on diabetes, one of Australia's most common killers SBS News 06:41 English\n\nSuicide was the leading cause of premature mortality (107,327 years of potential life lost), and the leading cause of death for people aged 15-44.\n\n\n\n\n\nIt was the 27th leading cause for females, and 16th leading cause of death in males, with men accounting for just over three-quarters of the 3,307 people who died by suicide in 2024.\n\n\n\n\n\nThe median age of death was 46 years. The Northern Territory had the highest suicide rate, followed by Queensland and Tasmania.\n\n\n\n\n\n\"Suicide is very complex and multifaceted,\" Moran said.\n\n\n\n\n\n\"Whilst it's extremely important to look at the demographic factors, we also acknowledge that for each individual things affect them in a different way, and different populations are also experiencing life stresses in different ways.\"\n\n\n\n\n\nMoran said on average, around four risk factors were involved when someone took their life. Mood disorders such as depression were a leading risk factor, as well as suicidal ideation.\n\n\n\n\n\nBut there was significant variance in risk factors among different demographics.\n\n\n\nREAD MORE Dead before 50: The Australians dying young at the edge of the system\n\nMoran said while mood disorders such as depression were a much higher risk factor in younger age groups, limitation of activity due to disability was a much higher risk factor in those aged over 85.\n\n\n\n\n\nRisk factors also presented differently for remote populations.\n\n\n\n\n\n\"For people living in remote and very remote Australia, alcohol intoxication, so a high alcohol level at death, was present in over 30 per cent of suicides, compared to close to 18 per cent for people living in major cities,\" Moran said.\n\n\n\n\n\nDrug and alcohol-induced deaths both increased in 2024, with a preliminary count of 1,947 drug-induced deaths last year (up from 1,766 in 2023) and 1,765 alcohol-induced deaths (from 1,700).\n\n\n\n\n\n\"Acute toxicity was the main cause of drug-induced deaths. Opioids and other depressants, including benzodiazepines, were the most common drug class present,\" Moran said.\n\n\n\n\n\nMoran said the proportion of deaths in which amphetamines were present in the body had increased, with psychostimulants such as methamphetamine and MDMA presenting in close to half of drug overdoses.\n\n\n\n\n\n\"We expect that number to go up,\" Moran said.\n\n\n\nShe added that acute toxicity — which was the main cause of drug-induced deaths overall — was one factor in deaths from amphetamine use, but there were often coinciding factors like cardiomyopathy.\n\n\n\n\n\nAssaults also increased in 2024. There were 269 deaths due to assault in 2024, with 168 being male and 101 being female. Female deaths due to assault increased by 25 from 2023, and male deaths by four.\n\n\n\n\n\n\n\nMoran said that for women who died by assault, the perpetrator was most likely to be a spouse or partner. Women were eight times more likely to die by assault from a perpetrator who was a spouse or partner.\n\n\n\n\n\nReaders seeking crisis support can ring Lifeline on 13 11 14 or text 0477 13 11 14, the Suicide Call Back Service on 1300 659 467 and Kids Helpline on 1800 55 1800 (for young people aged up to 25). More information and support with mental health is available at beyondblue.org.au and on 1300 22 4636.\n\n\n\n\n\nEmbrace Multicultural Mental Health supports people from culturally and linguistically diverse backgrounds.\n\n\n\n\n\nIf you or someone you know is impacted by family and domestic violence, call 1800RESPECT on 1800 737 732, text 0458 737 732, or visit 1800RESPECT.org.au . In an emergency, call 000. The Men’s Referral Service , operated by No to Violence, can be contacted on 1300 766 491.\n\n\n\n\n\nGriefline provides confidential support on 1300 845 745 and via griefline.org.au\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/climate-change-authority-criticises-coalition-net-zero/i7ygs99y5",
        "title": "‘Popping champagne corks’: Climate change boss lashes Coalition for dumping net zero",
        "publish_date": "Fri, 14 Nov 2025 01:43:42 +0000",
        "category": "finance",
        "authors": [],
        "text": "The head of Australia’s Climate Change Authority, Matt Kean, has fiercely criticised the Coalition’s decision to dump net zero by 2050, accusing his former party of ignoring science and \"lining up\" with global pariah states.\n\n\n\n\n\n\"This is not a policy, it’s just politics,\" Kean, a former Liberal NSW treasurer and environment minister, told SBS from the COP 30 climate summit in Brazil.\n\n\n\n\n\n\"Politics doesn't change physics, and just because the Coalition is walking away from evidence and science doesn't mean the rest of the world is,\" Kean said.\n\n\n\n\n\nThe former energy minister said while the global community was \"doubling down\" on efforts to lower emissions, the Coalition was pandering to mining lobbyists.\n\n\n\n\"The only people that will be popping champagne corks after the Coalition's announcement yesterday are the big coal companies who stand to benefit at the cost of Australian consumers,\" Kean said.\n\n\n\n\n\nOpposition leader Sussan Ley announced on Thursday that the Liberal Party would abandon net zero, following in the footsteps of its junior Coalition partner, the Nationals, which made its own announcement earlier this month.\n\n\n\n\n\nShe said the two parties would hold talks on Sunday to negotiate a joint climate and energy policy.\n\n\n\nREAD MORE Coalition meeting looms as Liberal rejects 'Nationals-lite' label after net zero dumped\n\nKean lashed the Coalition’s plan to subsidise the extension of coal-fired power stations — due to retire at the end of the decade — as \"hugely expensive\".\n\n\n\n\n\n\"If the Opposition want to underwrite coal, what they're actually underwriting is higher electricity bills for Australian consumers and businesses.\"\n\n\n\n\n\n\"The cheapest way to deliver new generation capacity into the grid is renewables. That's what the Australian Energy Market operator says. That's what the Australian Energy Market Commission says.\"\n\n\n\n'Gen Z and millennials' top priority, Ley says\n\nAt the heart of Ley’s energy pivot is a pledge that \"energy prices will always be more affordable under us\" — though she did not nominate an exact dollar amount that bills would drop by, as Labor did before the 2022 election .\n\n\n\n\n\nThe Liberal leader believes she can sell a cost-of-living argument to young Australians — who statistically left her party in droves at the last three elections.\n\n\n\n\n\n\"Young Australians have told me that they care about climate, and I care about climate too,\" Ley said on Friday.\n\n\n\n\"[Dumping net zero] is about the national interest. It’s about the right thing for our country, and most importantly, it’s about what’s right for gen Z and millennials who, right now, can’t afford to buy a home, can’t pay their power bills, and are looking at a government that is set to deliver them a worse standard of living than their parents.\"\n\n\n\n\n\nKean, a moderate who grew up in the blue-ribbon northern Sydney electorate of Bradfield — lost by the Liberal Party for the first time in its history to teal independent Nicolette Boele in 2025 — said the Coalition's energy offering was \"ideology trumping facts\".\n\n\n\n\n\n\"I think the Coalition wants to line up with Russia, with Iran and [US President Donald] Trump, and I think that's totally out of step with what the Australian community would expect from their government.\"\n\n\n\n'Modest' underwriting of coal\n\nOpposition energy spokesperson Dan Tehan has repeatedly refused to say whether the Liberals will release modelling to support its climate policy, or how much will be spent to extend the life of existing coal power stations.\n\n\n\n\n\n\"What we have said is that we will have a technology-neutral, affordable energy scheme so that there will be existing generations supported with modest and targeted underwriting, like what is occurring but only occurring for wind and solar under the Labor Party,\" he said.\n\n\n\n\n\n\"We will release our suite of policies and that will be done with plenty of time for the Australian people to be able to look at [and] address them [before the next election]”.\n\n\n\nFormer Liberal prime minister Malcolm Turnbull — whose party rolled him over energy policy — described the decision as \"Groundhog Day\".\n\n\n\n\n\n“[The Liberals] are guaranteeing that they will marginalise their vote. It’s as though they’re worried about competing with [One Nation leader] Pauline Hanson as opposed to holding [Prime Minister] Anthony Albanese to account,\" he said.\n\n\n\n\n\nAmong the key conundrums for the Coalition now is how its stated energy objectives will align with Australia’s obligations under the 2015 Paris Agreement, which does not allow for backsliding on climate targets.\n\n\n\n\n\nKean, speaking from COP — a summit Australia hopes to host alongside Pacific Nations next year — said he did not \"understand\" how the Coalition could feasibly stay in the Paris Agreement yet abandon net zero by 2050.\n\n\n\n\n\n\"I don't think they understand how they can stay in Paris and get rid of net zero,\" Kean said.\n\n\n\n\n\n\"What's clear to me is that even though the White House has flown the white flag, the rest of the world certainly hasn't given up.\"\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/sudden-closure-of-several-canberra-schools-after-asbestos-found-in-childrens-coloured-sand/02ridnmhf",
        "title": "Schools in Canberra and Brisbane closed after asbestos found in children's coloured sand",
        "publish_date": "Thu, 13 Nov 2025 23:21:12 +0000",
        "category": "finance",
        "authors": [],
        "text": "Schools in Canberra and Brisbane have announced sudden closures over concerns that some children's play sand products may contain traces of asbestos.\n\n\n\n\n\nIt comes after the Australian Competition and Consumer Commission (ACCC) earlier this week issued a recall notice for a number of coloured play sand products. Two types of asbestos — chrysotile and tremolite — have been referenced and both are naturally occurring.\n\n\n\n\n\nThe sand is used for sensory play, education, and various arts and crafts activities.\n\n\n\n\n\nThe ACT announced on Friday that 15 schools and three pre-schools would be closed, while five other schools would be partially closed. Meanwhile, a Brisbane school announced it would also close.\n\n\n\n'Low risk', says ACT education minister\n\nACT Education Minister Yvette Berry said she understood the news might be \"upsetting\" for families, but insisted the issue was \"low risk\".\n\n\n\n\n\n\"I understand the news will be upsetting for some families, however, WorkSafe have advised the risk of exposure to traces of chrysotile [asbestos] is low,\" Berry told reporters on Friday morning.\n\n\n\n\n\nOn Tuesday, WorkSafe ACT said it had tested Kadink Decorative Sand sold in a six pack of 10 gram tubes and found traces of chrysolite asbestos. The ACCC has also referenced tremolite asbestos in its recall notice for several coloured play sand products. SBS News has contacted the consumer watchdog for clarity.\n\n\n\n\n\n\"We made the decision that this was the best action to take as a precautionary measure, noting again that it is a low risk.\"\n\n\n\n\n\n\"Closing schools will allow testing and remediation to occur as soon as possible.\"\n\n\n\nLISTEN TO Asbestos likely in one in three homes across Australia SBS Audio 01:12 English\n\nTesting of the sand started yesterday afternoon and will continue, Berry said, but noted that early results had come back negative for airborne asbestos fibres.\n\n\n\n\n\n\"There were eight test results back this morning and all eight test results were negative for airborne fibres,\" ACT Work Health and Safety commissioner Jacqueline Agius said.\n\n\n\n\n\nAgius said \"tests are happening all over the country at the moment\", but that WorkSafe ACT was only testing one type of sand in its jurisdiction.\n\n\n\n\n\nMore school closures are possible, with Berry saying it was an \"evolving situation\".\n\n\n\nBrisbane school closes\n\nMancel College, a specialist school for children and young people with language disorders, also announced on Friday that it would close.\n\n\n\n\n\nIn a statement posted on social media, Craig Duncan, head of college at the school in Brisbane's west, shared the ACCC's recall notice and said some of the product had been found in both the junior and senior schools.\n\n\n\n\n\n\"While the advice is low risk and there are only minor traces, we are acting with an abundance of caution,\" Duncan said.\n\n\n\n\n\n\"We are therefore advising parents that with immediate effect we are closing the entire college today.\"\n\n\n\nWhat are the sand products that have been recalled?\n\nThe recalled products, sold at retailers including Officeworks, Educating Kids, Modern Teaching Aids, and Zart Art, include:\n\n\n\n\n\n- Kadink Sand (1.3kg)\n\n\n\n- Educational Colours Rainbow Sand (1.3kg)\n\n\n\n- Creatistics Coloured Sand (1kg)\n\n\n\n- Kadink Decorative Sand (10g 6 pack)\n\n\n\n\n\nOfficeworks was a \"major supplier\" for the sand, the ACCC said, with the products sold in Australia between 2020 and 2025.\n\n\n\nAustralia's consumer watchdog recently issues a recall notice for Kadink Sand (1.3kg), Educational Colours — Rainbow Sand (1.3kg) and Creatistics — Coloured Sand (1kg). Source: Supplied / ACCC Asbestos, a hazardous material that can cause terminal diseases, has been banned in Australia since 2003 and is not allowed to be imported except in very limited circumstances.\n\n\n\n\n\nInhalation of asbestos can lead to an increased incidence of some respiratory diseases, including lung cancers.\n\n\n\n\n\nThe ACCC has said the release of respiratory fibres is unlikely to occur in its retailed state, a point echoed by Agius on Friday.\n\n\n\n\n\n\"Asbestos in sand is a naturally occurring substance because it comes from quartz and it's quite heavy, so when asbestos is heavy then it's difficult to breathe it in,\" she said.\n\n\n\n\n\n\"That's why we say the risk is low.\"\n\n\n\n\n\nACCC deputy chair Catriona Lowe said Officeworks has removed the products from sale.\n\n\n\n\n\nShe said any customers who own the product should stop using it immediately, place it in a heavy-duty plastic bag, and secure it with double tape.\n\n\n\n\n\n\"When doing so, in an abundance of caution, customers should take precautions such as wearing disposable gloves and a mask,\" Lowe said.\n\n\n\n\n\nAsbestos cannot be disposed of in general waste and must be taken to resource management facilities.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.theage.com.au/sport/afl/melbourne-demons-vs-adelaide-crows-aflw-finals-live-dees-crows-battle-at-ikon-park-as-semi-finals-begin-20251114-p5nfjk.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Melbourne Demons vs Adelaide Crows AFLW Finals LIVE: Dees, Crows battle at Ikon Park as semi-finals begin",
        "publish_date": "Sat, 15 Nov 2025 12:58:23 +1100",
        "category": "sports",
        "authors": [
            "Hannah Kennelly",
            "Roy Ward"
        ],
        "text": "Coach Matthew Clarke is certain Adelaide are peaking at the right time, but remains wary of an injury-hit Melbourne in their AFLW semi-final.\n\nThe Crows travel to Melbourne for Saturday afternoon’s sudden-death encounter buoyed by their 44-point drubbing of St Kilda in an elimination final.\n\nCaitlin Gould and Niamh Kelly of the Crows (right) celebrate a goal in their elimination final win. Credit: AFL Photos via Getty Images\n\n“It was arguably our strongest performance for the season,” Clarke told reporters on Friday at Adelaide airport.\n\n“We felt as though throughout the year we’ve had patches, we have played pretty good footy, but perhaps been inconsistent.\n\n“So to bring our best game towards the back-end, and obviously in the finals, that’s really pleasing.\n\n“You hope to play your best footy at the back-end and you probably should, given that you’re starting to work together as a unit more consistently.”\n\nClarke has named an unchanged side for the Ikon Park fixture but the Demons, who slipped to a 13-point qualifying loss to Brisbane, made two alterations.\n\nLoading\n\nStar goalkicker Eden Zanker (concussion) will miss and Jemma Rigoni has been dropped, with Sinead Goldrick and Laela Ebert summoned.\n\n“Obviously for them, losing Zanker probably hurt them last week within the game,” Clarke said.\n\n“But they″⁣ve had the whole week to prepare and structure up and they’ve got multiple aerial threats ahead of the ball, even without her.\n\n“That is a significant out for them, but it’s part of footy, you’ve got to be able to manage some adversity.\n\n“We’ve been watching the way they’ve gone about it. They have had a great year and even last week, a lot of the metrics say they should have won that game.\n\n“They’re really good around the contest ... they move the ball really efficiently into their front half.\n\n“And then, like most teams, they support defensively really strongly as well.”\n\nAn Adelaide loss will finish the tenure of dual premiership coach Clarke, who is stepping down at season’s end.\n\n“The question has come up a lot but the answer has been pretty similar,” he said.\n\n“AFLW is a really short season and so your focus becomes really intense in terms of the next game.\n\n“And then you throw in the fact that you get to finals, all that other stuff is really peripheral. It’s not even a factor.\n\n“It’s really just let’s go, let’s see if we can win a game.”\n\nAAP",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/soccer/international-friendly-live-socceroos-take-next-step-on-road-to-2026-world-cup-20251114-p5nfey.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "International friendly LIVE: Socceroos take next step on road to 2026 World Cup",
        "publish_date": "Sat, 15 Nov 2025 12:58:05 +1100",
        "category": "sports",
        "authors": [
            "Vince Rugari"
        ],
        "text": "Here’s the team Tony Popovic has selected:\n\nSo there’s three debutants: goalkeeper Patrick Beach, the current standout in his position in the A-League, defender Kai Trewin, his teammate at Melbourne City, and midfielder Paul Okon-Engstler, the son of Socceroos assistant coach Paul Okon who recently moved to Sydney FC and has started the season pretty well.\n\nOkon-Engstler is just 20, was born in Belgium (his father was playing for K.V. Oostende at the time) and came through the youth academies of Club Brugge and Benfica. Clearly, he has been identified as a star of the future for Australia - but can he play a role now, or at the World Cup? This is a great test for him.\n\nElsewhere, Craig Goodwin also starts for the first time since March in what appears to be the left wing-back role - interesting - with Nestory Irankunda, Mohamed Toure and Connor Metcalfe up front, and Aiden O’Neill in midfield next to Okon-Engstler.\n\nMilos Degenek has the captain’s armband, while Nick D’Agostino and Kye Rowles are not in the squad, and Deni Juric left camp early after sustaining an injury, which means Al Hassan Toure is a really high chance to also debut off the bench.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/afl/everyone-met-him-with-open-arms-mcgrath-on-the-return-of-essendon-prodigal-son-merrett-20251114-p5nfk4.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘Everyone met him with open arms’: McGrath on the return of Essendon prodigal son Merrett",
        "publish_date": "Sat, 15 Nov 2025 12:44:46 +1100",
        "category": "sports",
        "authors": [
            "Roy Ward"
        ],
        "text": "Loading McGrath’s name is at the top of the list of likely successors to Merrett as Essendon captain, should the club make the change. McGrath said it was too early to talk about the captaincy, but also wouldn’t rule out taking on the role if it becomes available. “It’s something I haven’t really put any thought to yet,” McGrath said. “We’ve had our break, and I got married a couple of weeks ago, so footy has been on the backburner a little bit.\n\n“Those conversations will happen over the next few months. We’ll sit down with the club and figure out the next way forward, and it will be what it will be.” McGrath, 27, was among the Essendon leaders – including the likes of Nic Martin and Mason Redman – to speak out in September about Merrett wanting out. McGrath told Seven at the time that there was “disappointment, a little bit of anger and sadness” about Merrett wanting out. McGrath has experienced plenty of turbulence as a Bomber, but he’s also learnt what it takes to become a leader. Zach Merrett and McGrath share a laugh back in April. Credit: AFL Photos “If you have been in the system for a while, you’ve seen a lot, and seen the good and the bad that footy throws up,” McGrath said.\n\n“I’ve been lucky enough to have so many good leaders above me for my whole career with Dyson [Heppell] and Zach currently. You learn bits and pieces from those guys. “Everyone my age is a leader at the footy club – we’ve got some great middle-aged sort of guys, but they seem a bit older with how young our playing list is at the moment. “Guys like Kyle Langford, Mason Redman and Nic Martin are great young, emerging leaders. Sam Durham as well. “It doesn’t really feel like a big responsibility because we share the load so well. “It’s something that comes a little bit naturally to me, like connecting with the guys, and I enjoy being around my teammates, but we will see where it all lands.”\n\nA chance meeting for Charlie Superstar Swans recruit Charlie Curnow admits he’s still adjusting to life in the harbour city, away from Carlton and his former teammates. And he looked shocked when he took some breakfast out to a car at the McHappy Day event in Tullamarine on Saturday morning, only to find it was former Blues skipper Marc Murphy waiting patiently. For his part, Murphy looked just as shocked – especially when two TV cameras took in the transaction. Sydney star Charlie Curnow tests out a burger on McHappy Day on Saturday. Credit: Eddie Jim “I think he was just using young Maxy [Murphy’s son] as an excuse to come past Maccas,” Curnow said with a wide smile.\n\n“I was surprised to see him but I always see him around Carlton North near the cafes.” Both Curnow’s friendship groups lit up this week when the AFL announced the Blues would travel to Sydney to face the Swans in opening round. “I actually thought we were going to play them six times and try to make as much money as we can,” Curnow said with a laugh. “I was talking to a few of the boys – I’m still getting used to changing up which boys I’m talking about, but I was chatting to some of my Blues mates like Weiters [Jacob Weitering] about the possibility of playing opening round, and it turns out the AFL did it in the end.” Curnow said he felt fresh and was enjoying getting stuck back into training after injuries ruined his last season with the Blues.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/motorsport/six-time-bathurst-champ-announces-retirement-20251115-p5nfnk.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Six-time Bathurst champ announces retirement",
        "publish_date": "Sat, 15 Nov 2025 12:43:10 +1100",
        "category": "finance",
        "authors": [],
        "text": "Six-time Bathurst champ announces retirement\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/culture/music/safety-first-federation-square-chief-shut-down-gig-to-avoid-crowd-crush-20251115-p5nfn8.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘Safety first’: Federation Square chief shut down gig to avoid crowd crush",
        "publish_date": "Sat, 15 Nov 2025 12:35:57 +1100",
        "category": "entertainment",
        "authors": [
            "Angus Delaney",
            "Isabel Mcmillan",
            "Karl Quinn"
        ],
        "text": "The last-minute cancellation of a free concert featuring Amyl and the Sniffers on Friday night was necessary to avoid a potentially catastrophic crowd crush after hundreds of people attempted to jump over barriers to the open-air venue, the head of Federation Square says.\n\nOn Saturday, Katrina Sedgwick, chief executive of Melbourne Arts Precinct Corporation – which manages Federation Square – defended the levels of security for the event and said sufficient planning had taken place beforehand. However, she conceded they may have to change how they stage events there in future.\n\nThousands of people filled Federation Square on Friday night before being informed the free concert had been cancelled. Credit: Simon Schuter\n\nThousands of music fans were devastated after the free concert was called off about 15 minutes before members of the Grammy-nominated Australian band were due to take the stage.\n\nSedgwick apologised on Saturday both to Amyl and the Sniffers – who expressed frustration on social media at the cancellation – and to the thousands of fans who missed out on seeing them perform.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/world/north-america/us-set-to-lower-tariffs-on-beef-as-trump-cops-cost-of-living-backlash-20251115-p5nfmn.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Australian beef exempted from US tariffs as Trump cops cost-of-living backlash",
        "publish_date": "Sat, 15 Nov 2025 12:09:02 +1100",
        "category": "finance",
        "authors": [
            "Michael Koziol",
            "Mike Foley"
        ],
        "text": "Washington: US President Donald Trump has exempted beef – including billions of dollars worth of Australian exports – from his sweeping tariff program as he responds to growing unrest from American consumers over the cost of living.\n\nAn executive order issued late Friday in the US (Saturday AEDT) confirmed beef was among several agricultural products that will no longer be subject to tariffs, including coffee and tea, cocoa, bananas, oranges, tomatoes and additional fertilisers.\n\nThe US is the biggest buyer of Australian beef. Credit: Bloomberg\n\nThat means the 10 per cent tariff applied to most Australian goods from April will no longer apply to beef – one of Australia’s leading exports to the US, with annual sales worth more than $4 billion.\n\nThe White House said given Trump had negotiated trade deals with a range of countries, he had determined it was “necessary and appropriate” to remove tariffs from certain products.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/victoria/the-age-photos-of-the-week-november-15-2025-20251113-p5nf9w.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "The Age photos of the week, November 15, 2025",
        "publish_date": "Sat, 15 Nov 2025 12:02:43 +1100",
        "category": "finance",
        "authors": [],
        "text": "17/23\n\nCouncillor Claudia James from Mitchell Shire stands at the end of Camerons Lane which is to be extended to form an interchange for the Hume Freeway. The land to its immediate north is in dispute as developer Resimax has taken the planning minister to the supreme court to overturn a decision that has blocked them from developing a new housing estate until the Camerons Lane freeway interchange is built Credit:Chris Hopkins",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/amyl-and-the-sniffers-free-gig-shut-down-over-security-fears-in-melbourne-20251115-p5nfni.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Amyl and the Sniffers' free gig shut down over security fears in Melbourne",
        "publish_date": "Sat, 15 Nov 2025 12:00:28 +1100",
        "category": "finance",
        "authors": [],
        "text": "Amyl and the Sniffers' free gig shut down over security fears in Melbourne\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later. Dismiss\n\nOur network\n\nOpen Navigation Menu The Age",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/nfl/drop-punt-it-like-daicos-the-afl-s-impact-on-nfl-stars-ahead-of-mcg-showdown-20251114-p5nfhr.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Drop punt it like Daicos: The AFL’s impact on NFL stars ahead of MCG showdown",
        "publish_date": "Sat, 15 Nov 2025 12:00:00 +1100",
        "category": "sports",
        "authors": [
            "Jake Niall"
        ],
        "text": "Los Angeles: When the Los Angeles Rams come to the MCG for the first regular-season NFL game in Australia, they could well be playing at the strange time of 10am, after a period of adjustment following a 14-hour flight.\n\nIf this sounds less than convenient – the morning start, if it happens, would be for the benefit of a vast TV audience in the US – the Rams players don’t care about how long they travel, about the unusual size of the MCG, or the potential for a weird starting time.\n\nEthan Evans shapes for a drop punt-style kick as the Los Angeles Rams take on the New Orleans Saints. Credit: Los Angeles Rams\n\n“[It] makes no difference to me,” said star LA running back Kyren Williams in one of a series of interviews this week organised for Australian media by the Rams, who have struck a deal with the Victorian government that will see the Rams play an as-yet-unnamed opponent in the week of the AFL semi-finals.\n\n“I’ll play wherever, wherever they tell us the ball’s going to be kicked off I’ll go play,” said Williams.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/motorsport/bortoleto-crashes-in-sao-paulo-20251115-p5nfn2.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Bortoleto crashes in Sao Paulo",
        "publish_date": "Sat, 15 Nov 2025 09:57:45 +1100",
        "category": "finance",
        "authors": [],
        "text": "Bortoleto crashes in Sao Paulo\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/rugby-union/sure-the-wallabies-are-tired-that-s-not-the-only-reason-they-re-struggling-in-the-north-20251114-p5nfft.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Sure, the Wallabies are tired. That’s not the only reason they’re struggling in the north",
        "publish_date": "Sat, 15 Nov 2025 09:41:00 +1100",
        "category": "sports",
        "authors": [
            "Paul Cully"
        ],
        "text": "The Wallabies have the chance to revive their tour against Ireland in Dublin this weekend, but the sense that a slow-motion car crash is unfolding in the north is not unfamiliar to the Wallabies faithful.\n\nSince 2013, only two of the Wallabies’ end-of-season tours against Six Nations opponents have yielded more wins than losses. The first was in 2013, when new coach Ewen McKenzie guided the Wallabies to an impressive 4-1 record in what would turn out to be his only northern tour, and the second was in 2016, as Michael Cheika’s side went 3-2 in a tough tour that finished with losses to Ireland and England.\n\nThe Wallabies slumped to a demoralising defeat in Udine. Credit: Getty Images\n\nSuch successful tours were relatively commonplace in the first part of the new millennium. To provide an example of how expectations have changed, coach Robbie Deans was on the brink of being sacked after the Wallabies lost 33-6 to France in the first Test of the 2012 tour.\n\nDeans’s side went on to beat England, Italy and Wales in the subsequent weeks.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/cricket/the-paradox-of-pace-what-australia-and-england-have-to-do-to-win-the-first-ashes-test-20251113-p5nf9t.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "The paradox of pace: What Australia and England have to do to win the first Ashes Test",
        "publish_date": "Sat, 15 Nov 2025 09:33:00 +1100",
        "category": "sports",
        "authors": [
            "Greg Chappell"
        ],
        "text": "Perth, home to the WACA and the modern Optus Stadium, boasts a reputation built on sheer pace and bounce. The strip here is pure energy, where the ball flies with a velocity unmatched anywhere else. Instinct suggests that to conquer such an intimidating surface, a batter must meet fire with fire.\n\nBut here lies the paradox of pace: the hardest, quickest pitches in the world demand the slowest hands and the calmest mind. The harder a batter tries to hit the ball, the greater their chance of failure. To master the extreme speed, one must yield to it, allowing the wicket’s natural venom to do the work, converting pace into timing.\n\nPaceman Mitchell Starc has had plenty of experience bowling at the WACA in Perth. Credit: Getty Images\n\nThe velocity generated in Perth is a potent psychological weapon. Cricketers fear facing a ball delivered above 140km/h, not because they worry about injury, but because they know they have too little time to react. This anxiety creates a profound vulnerability, turning a difficult challenge into a mental breakdown.\n\nWhen facing express pace, a batter has less than half a second – closer to 0.4 seconds – to make a complex decision: whether they are playing or leaving, attacking or defending, and crucially, committing to the front or back foot. If a batter does not have a strong mental routine, the first thing that goes is their concentration.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/business/markets/inside-our-journalism-and-the-real-estate-agent-tricks-used-to-underquote-20251115-p5nfn0.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Inside our journalism and the real estate agent tricks used to underquote",
        "publish_date": "Sat, 15 Nov 2025 08:58:47 +1100",
        "category": "finance",
        "authors": [],
        "text": "Inside our journalism and the real estate agent tricks used to underquote\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later. Dismiss\n\nOur network\n\nOpen Navigation Menu The Age",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/world/bus-crashes-into-pedestrians-in-central-stockholm-20251115-p5nfmz.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Bus crashes into pedestrians in central Stockholm",
        "publish_date": "Sat, 15 Nov 2025 08:53:40 +1100",
        "category": "finance",
        "authors": [],
        "text": "Bus crashes into pedestrians in central Stockholm\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/lifestyle/king-charles-celebrates-77th-birthday-20251115-p5nfmy.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "King Charles celebrates 77th birthday",
        "publish_date": "Sat, 15 Nov 2025 08:43:41 +1100",
        "category": "lifestyle",
        "authors": [],
        "text": "King Charles celebrates 77th birthday\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/lifestyle/life-and-relationships/you-dress-better-than-your-partner-you-could-be-in-a-swag-gap-relationship-20251114-p5nfek.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "You dress better than your partner? You could be in a ‘swag gap’ relationship",
        "publish_date": "Sat, 15 Nov 2025 08:00:00 +1100",
        "category": "lifestyle",
        "authors": [
            "Laura Craik"
        ],
        "text": "You’re in the final stages of preparation for your date-night dinner – which is to say your hair is freshly washed and blow-dried, your kitten heels have been located, and your blouse is tucked neatly into your beloved black velvet trousers.\n\nThe table is booked for 8pm, which means your husband is cutting it a bit fine. He only went into the shower 10 minutes ago. Still, at least he’s had one.\n\nIt quickly transpires that showering is his only concession to the evening ahead. For while he may be clean, he appears to be wearing the same clothes he’s worn all week – or a variant of them. His navy quarter-zip reveals a crumpled shirt collar, and there’s a small tear in his cords.\n\nAlways immaculately turned out, Hailey Bieber steps out with her husband, Justin, who is dressed in streetwear. Credit: GC Images\n\nBut it’s the footwear that really rankles. You weren’t expecting freshly polished Oxfords, but Birkenstock Arizonas? With socks?",
        "source": "TheAge"
    },
    {
        "url": "https://au.news.yahoo.com/residents-in-sleepy-regional-town-alarmed-after-disturbing-plant-discovered-devils-dust-010028884.html",
        "title": "Residents in sleepy regional town alarmed after disturbing plant discovered: 'Devil's dust'",
        "publish_date": "2025-11-15T01:00:28Z",
        "category": "finance",
        "authors": [],
        "text": "Residents in a sleepy Australian community were “alarmed” after stumpy little tubers began springing up beneath their stringybark forests. How invasive South African weed orchid arrived in Axe Creek, 120km northwest of Melbourne, is uncertain, but there’s likely a clue in its ominous nickname, “devil’s dust”.\n\nAdrian Martins from the town’s local Landcare group is working to raise awareness about how easily its fine seeds spread through the wind, machinery, and under footwear. When he spotted a single stem in his paddock, he confessed to having yelled a word too “rude” to put in print.\n\n“I was thinking, oh God, here I am dealing with another weed,” he added, noting he’s already trying to stop the spread of another “pet hate” gazanias, an invasive flowering plant that swamps paddocks and roadsides.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nA picture shared by Martins shows a screwdriver stuck into the ground next to the orchid to mark its location.\n\nSouth African onion weed suppresses native plants. Source: Adrian Martins\n\nMartins still runs a few head of sheep to manage paddocks with introduced grass, but he’s been working to restore the rest of his 10-hectare block back to native bushland. He’s not the only person in Axe Creek that’s concerned about the devil’s dust invasion.\n\n“I was visiting one of our other members, who as the crow flies, is about 7km south of me, and I noticed them as I was coming down his driveway,” he said.\n\n“He’d never seen it before either, and wondered how the hell it got there.”\n\nAdrian Martins had been working to revegetate his property, so finding a new invasive pest was not welcome. Source: Supplied\n\nThe only invasive orchid in Victoria\n\nSouth African weed orchid is the only invasive orchid in Victoria. And that's lucky, because this one species causes massive problems outcompeting and supressing native plants.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nThe weed has been in the state for decades, annoying landholders as it continues to spread. It's been described as “aggressive” by Landcare, which has warned that eliminating it is “doubtful”.\n\nOther farmers north of the Great Dividing Range have reportedly given up trying to control it. And that worries Martins, because he doesn’t want to see it spread throughout his town.\n\nGrowing between 30 and 50cm tall, the plant is self-pollinating, and each small fruit contains a large amount of seed, making it difficult to control. Anyone who finds the weed on their property is urged to use caution because disturbing it can cause it to shed seed.\n\nLove Australia's weird and wonderful environment? 🐊🦘😳 Get our new newsletter showcasing the week’s best stories.",
        "source": "Yahoo"
    },
    {
        "url": "https://au.news.yahoo.com/donald-trumps-major-backflip-on-australian-meat-001212927.html",
        "title": "Donald Trump's major backflip on Australian meat",
        "publish_date": "2025-11-15T00:12:12Z",
        "category": "finance",
        "authors": [],
        "text": "Donald Trump has sensationally backflipped on his push to slap a 10 per cent tax on Australian beef producers. The White House confirmed on Saturday it would cut tariffs on food and agriculture products, including Australian beef.\n\nTrump signed the wide-ranging executive order to exclude coffee, tea, tropical fruits, coca, bananas, oranges and tomatoes. The Trump administration said the move would seek to reduce growing cost-of-living pressures in America.\n\nThe executive order is retroactive which means importers will be refunded amounts paid to the government.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\n“Today, President Donald J. Trump signed an Executive Order modifying the scope of the reciprocal tariffs that he first announced on April 2, 2025,\" the White House statement said.\n\n\"Specifically, certain qualifying agricultural products will no longer be subject to those tariffs.\"\n\nAustralia exports more than $2 billion worth of beef to the US a year and despite the tariffs, beef exports grew in 2025.\n\nAustralian producers unexpectedly benefited as other nations were slapped with bigger tariffs. Picture: Newswire\n\nThis is due to a decline in beef production domestically, along with high tariffs slapped on other producers like Brazil.\n\nCommonwealth Bank sustainable and agricultural economist Dennis Voznesenski told Newswire Australia's gain was unexpected and that Australia was the only country with enough stock to meet America's supply needs.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\n“Mexico had a flesh eating bacteria called new age screw worm with the US closing the border to Mexico … Canada exports to the US are down 25 per cent from last year as they rebuild stock and as of August 1 President Trump plans to put a 50 per cent tariff on Brazil.”\n\nAustralia's levy was 10 per cent.\n\nThe backdown follows a wide ranging speech on April 2, when President Trump announced his sweeping tariff policy, Australia’s beef exporters were singled out.\n\n“Australia bans – and they’re wonderful people, and wonderful everything – but they ban American beef,” President Trump said.\n\n“Yet we imported $3bn of Australian beef from them just last year alone.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\n“They won’t take any of our beef. They don’t want it because they don’t want it to affect their farmers. And you know, I don’t blame them, but we’re doing the same thing right now starting at midnight tonight.”\n\nTrump has faced criticism over the backtrack from Democrats, with the administration being described a \"putting out a fire that they started and claiming it as progress\".\n\n\"The Trump Administration is finally admitting publicly what we've all known from the start: Trump's Trade War is hiking costs on people,\" Senior House Democrat Richard Neal said.\n\n\"Every day that Trump's tariffs remain in place is another day that families, small businesses, farms, and manufacturers get crushed.\n\n\"It's time to end the entire Trade War.\"\n\nDo you have a story tip? Email: newsroomau@yahoonews.com.\n\nYou can also follow us on Facebook, Instagram, TikTok, Twitter and YouTube.",
        "source": "Yahoo"
    }
]