[
    {
        "url": "https://www.9news.com.au/national/lotto-tasmania-winner-millionaire/cca089aa-d06b-40c2-b85d-e7b6ba57aec7",
        "title": "Footy fan becomes millionaire during half-time break",
        "publish_date": "Sun, 03 Aug 2025 22:36:53 +0000",
        "category": "sports",
        "authors": [
            "Aug"
        ],
        "text": "A Launceston man had a more exciting half-time break at the footy than most after winning over $1.4 million in the Tatts Lotto on Saturday.\n\nThe Tasmanian said he checked to see if his ticket was a winner during half-time of the football on Saturday, and he was in for a surprise as he found he was one of seven lucky Aussies to win $1,428,571.43.\n\nHe admitted he was taken aback by the revelation he had become a millionaire.\n\n\"I logged into The Lott app on Saturday night to check my ticket, just after half-time in the footy,\" he said\n\nThe man said he struggled to sleep that night, as he was trying to plan how to use his winnings.\n\n\"I didn't sleep much that night – it was on and off. A lot of stuff was going through my head,\" he said\n\n\"You're just that excited.\"﻿\n\nHe did have some ideas in mind, including changing his retirement plan.\n\n\"It'll certainly pay off the mortgage,\" he said, \"Then you've got to work out the retirement factor.\n\n\"I was planning on working until retirement at 65, but now I can bring that forward.\"",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/australia-tourism-ad/29ad9a57-9120-4148-930e-6b070c787e17",
        "title": "Tourism Australia's new star-studded campaign",
        "publish_date": "Mon, 04 Aug 2025 01:27:52 +0000",
        "category": "sports",
        "authors": [
            "Aug"
        ],
        "text": "T﻿ourism Australia has released its latest ad campaign, encouraging tourists from around the world to flock down under.\n\nUtilising famous names from Australia and beyond, the main slogan of the campaign is \"come and say g'day\". Several different versions have been made for different markets.\n\nRobert Irwin, ﻿son of Steve Irwin was used to market the country to the USA, while celebrity chef Nigella Lawson was featured in ads in the United Kingdom.\n\nRobert Irwin features prominently in the campaign in the US edition. (Tourism Australia)\n\nPhilanthropist Sara Tendulkar, who is the wife of cricket legend Sachin Tendulkar, was also used in the campaign in India.\n\nThis was combined with local actors from Australia, including Thomas Weatherall.",
        "source": "9News"
    },
    {
        "url": "https://www.abc.net.au/news/2025-08-04/wallaroos-rugby-world-cup-squad-caslick-palu-included/105609794",
        "title": "Wallaroos roll dice on injured duo for World Cup",
        "publish_date": "Mon, 04 Aug 2025 02:21:03 +0000",
        "category": "sports",
        "authors": [],
        "text": "Injured sevens star Charlotte Caslick has been included in the Wallaroos squad for the Women's Rugby World Cup in England, while Ashley Marsters and Trilleen Pomare have been named for their third campaign.\n\nThe Australians, ranked eighth in the world, will open their tournament in Salford on August 23 (9pm AEST) as they look to improve on a quarterfinal showing at the last tournament in 2021.\n\nCoach Jo Yapp named a 32-player squad on Monday, which included 15 World Cup debutants.\n\nDefending Super Rugby Women's champions the NSW Waratahs will be represented by 13 players, while the ACT Brumbies have eight representatives, Queensland six, with five from Western Force.\n\nWallaroos coach Jo Yapp has named 15 World Cup debutants in her squad of 32. (AAP: Darren England)\n\nOlympic gold medal winner Caslick switched from sevens this year, aiming to play in her first 15-a-side World Cup, but suffered a syndesmosis injury last month that required surgery.\n\nHowever, she and fellow sevens convert Tia Hinds were included, along with captain Siokapesi Palu, who missed the recent two Test matches against Wales with a foot injury.\n\nIt is unclear when the injured pair will be available to play.\n\nTeenage sensation Waiaria Ellis, 17, could become the youngest Wallaroo to play at a World Cup after being included in the youthful squad, which has an average age of 26.\n\nTeenager Waiaria Ellis, 17, has a chance to become the youngest player to represent the Wallaroos at a World Cup. (Getty Images: Chris Hyde)\n\nVeterans Marsters and Pomare, who both recently passed 40 Test appearances, will add some much-needed experience in their third tournament.\n\nUncapped Reds winger Caitlin Urwin has been included after impressing for Australia A. However, there was no room for out-of-favour Waratahs playmaker Arabella McKenzie.\n\nLock Annabelle Codey is set to follow in her father David Codey's footsteps by playing at a World Cup, while Katalina Amosa, the sister of Wallaby Brandon Paenga-Amosa, is one of three hookers named.\n\n\"We are very proud of the squad and the journey the players and staff have been on for the past two years to get to this point,\" said Yapp, who will step away from the role after the tournament.\n\nSiokapesi Palu has been included in the World Cup squad despite nursing a foot injury. (Getty Images: Matt Roberts)\n\n\"We have a very special group of people within this squad, diverse in culture and a range of ages and levels of experience in the game.\n\n\"A World Cup is the pinnacle event in sport, and women's rugby will showcase that in England later this month.\n\n\"We are ready to perform on the global stage and thank everyone who is supporting us on and off the field.\"\n\nThe tournament is set to be the biggest-ever women's rugby event, with more than 300,000 tickets sold.\n\nFollowing Samoa, the Wallaroos take on USA on August 31 and top-ranked tournament hosts England on September 6 to complete their pool matches.\n\nFULL WALLAROOS WORLD CUP SQUAD: Katalina Amosa, Bree-Anna Browne, Charlotte Caslick, Emily Chancellor, Annabelle Codey, Lori Cramer, Piper Duck, Waiaria Ellis, Ashley Fernandez, Georgina Friedrichs, Caitlyn Halse, Tia Hinds, Brianna Hoy, Asoiva Karpani, Lydia Kavoa, Kaitlan Leaney, Michaela Leonard, Ashley Marsters, Desiree Miller, Faitala Moleka, Layne Morgan, Tania Naden, Bridie O'Gorman, Siokapesi Palu, Faliki Pohiva, Trilleen Pomare, Cecilia Smith, Maya Stewart, Adiana Talakai, Tabua Tuinakauvadra, Caitlin Urwin, Samantha Wood\n\nAAP",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-08-04/athletics-noah-lyles-bednarek-push-shacarri-richardson/105609408",
        "title": "Furious Bednarek pushes Lyles after 'unsportsmanlike' mid-race taunt",
        "publish_date": "Mon, 04 Aug 2025 02:18:14 +0000",
        "category": "sports",
        "authors": [],
        "text": "The US track championships turned physical on Monday, Australia time, with Noah Lyles and Kenny Bednarek getting involved in a shoving and shouting match as they crossed the finish line of a hotly contested 200 metre final at Hayward Field in Eugene, Oregon.\n\nLyles landed the day's biggest blow on the track, passing Bednarek for the win, then looked his way to talk some trash.\n\nBednarek's answer was a two-handed shove in the back after the finish line, some more heated words and a challenge for a rematch that cannot come soon enough.\n\n\" Like I've said before, Noah's going to be Noah,\" Bednarek said. \"If he wants to stare me down, that's fine. \"\n\nLyles reeled in Bednarek and crossed in 19.63 seconds for a 0.04-second victory that sets up a rematch at the World Athletics Championships on September 19 in Tokyo.\n\nThe best action in Round 1 of the 2025 USA Outdoor Track and Field Championships came after the finish line. There was jawing, the shove and, then, Lyles turning around, back-pedalling, reaching his arms out and bouncing up and down like a boxer before lobbing a few more choice words at Bednarek.\n\nTheir argument bled into the start of what is normally a celebratory NBC winner's interview.\n\nBednarek has taken exception to Lyles's actions during the final few metres of the 200m final. (Getty Images: Patrick Smith)\n\n\"I tell ya, if you've got a problem, I expect a call,\" Bednarek said, as the network's Lewis Johnson moved the mic between the runners.\n\nLyles replied: \"You know what, you're right. You're right. Let's talk after this.\"\n\nThough they shook hands during that tense post-race exchange, Bednarek was fired up well after the sprinters had left the track.\n\n\"The summary is, don't do that to me,\" he said.\n\n\"I don't do any of that stuff. It's not good character right there. That's pretty much it. At the end of the day, he won the race. I've got to give him props. He was the better man today.\"\n\nThe win itself was no big surprise for Lyles, the three-time defending world champion who will have to get past Bednarek to make it four in Tokyo.\n\nBednarek was asked what Lyles said as he turned around and gloated after securing his fifth national title at his favourite distance.\n\n\"What he said didn't matter; it's just what he did,\" Bednarek said.\n\n\" Unsportsmanlike [expletive] and I don't deal with that. It's a respect factor. He's fresh. Last time we lined it up, I beat him, that's all I can say. Next time we line up, I'm going to win. That's all that matters. \"\n\nAsked to expand on his role in the tiff, Lyles was less forthcoming: \"On coach's orders, no comment.\"\n\nAs is common in a year after the Olympics — and in an era after Usain Bolt — track is a sport desperately in need of some energy. Who else to provide it than Lyles, the sport's most engaging character this side of Sha'Carri Richardson, who found herself in off-the-track headlines again this weekend.\n\nUp to now, track media and the runners themselves have tried to generate rivalries between Lyles and Erriyon Knighton (fizzled), or Lyles and Letsile Tebogo (beat him in the Olympics last year), or, of course, between Lyles and NFL receiver Tyreek Hill (supposed grudge match never took place).\n\nTurns out, they probably should have looked at the lane next to him. Bednarek has won silver and beaten Lyles the last two times they have lined up in the 200m at the Olympics, even though Lyles has had issues at both — in Tokyo with his mental health, then in Paris with COVID.\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\nBednarek referenced some long-simmering issues between the two.\n\n\"Just some personal stuff we've got to handle,\" he said.\n\nBut when asked for something, anything, about this burgeoning rivalry, Lyles demurred, instead focusing on what a difficult year this has been for him after an injury in April kept him out of spikes until June.\n\n\"If they ain't going to beat me now, they ain't going to beat me ever,\" Lyles said.\n\nBednarek is not so sure of that.\n\nThe 200m final was Bednarek's fifth race of the week, counting the three heats of the 100 meters, where he won the final Friday. Lyles, who has an automatic spot at worlds in that event as the defending champion, only ran one heat of the 100m.\n\n\"We'll go fresh and we'll see what happens,\" Bednarek said. \"Because I'm very confident I can beat him. That's all I can say.\"\n\nRichardson fails to qualify for 200m final\n\nSha'Carri Richardson narrowly missed qualifying for the 200m final on Monday (AEST), concluding what's been a tumultuous week for the sprinter in the Pacific Northwest.\n\nRichardson wound up fourth in her heat in a time of 22.56 seconds. The top two finishers in each heat advance, along with the next three fastest times. Madison Whyte edged her out on time by running 22.55 seconds in the same heat.\n\nA week ago, Richardson was arrested on a fourth-degree domestic violence offence for allegedly assaulting her boyfriend, sprinter Christian Coleman, at the Seattle-Tacoma International Airport. She was booked into South Correctional Entity (SCORE) in Des Moines, Washington, for more than 18 hours.\n\nSha'Carri Richardson failed to qualify for the 200m final after a tumultuous week. (Getty Images: Patrick Smith)\n\nDays later, Richardson, 25, ran the opening round of the 100m at nationals before withdrawing from the event. She has an automatic spot to worlds next month in Tokyo as the defending 100m champion.\n\nThis was Richardson's first 200m race of the season. She won a bronze medal at the distance during the 2023 world championships in Budapest.\n\nIt was part of a stellar showing at worlds that season, as she also won the 100 and helped the 4x100 relay to a gold. A year later, Richardson finished with the silver medal in the 100 at the Paris Games.\n\nRichardson had a positive marijuana test at the 2021 US Olympic trials and did not compete at the Tokyo Games.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-08-04/australian-chickpeas-boom-as-indian-market-returns/105538646",
        "title": "Farmers go all in on chickpeas as Indian market reopens",
        "publish_date": "Mon, 04 Aug 2025 00:44:00 +0000",
        "category": "finance",
        "authors": [],
        "text": "Mervyn Bourne has been a farmer for 35 years, but this is the first time he has gone all in on chickpeas.\n\nEncouraged by a stabilised trade relationship with India, the central Queensland grower is planting all 1,300 hectares of his farm to the pulse crop, for one good reason.\n\n\"The money,\" Mr Bourne said.\n\nMerv Bourne has planted his entire 1,300 hectares with chickpeas this season. (Supplied: Merv Bourne)\n\nWhen deciding what to plant for the winter season on his property at Kilcummin, about 280 kilometres south-west of Mackay, Mr Bourne would normally spread his risk across crops like wheat, barley, oat and chickpeas.\n\nFor the first time since 2017, the crop known to be reliable in the field is also a sure bet in the world's biggest chickpea market.\n\n\"They're probably one of the safest crops to grow and they give you the best return,\" Mr Bourne said.\n\nWhile tariff-free access to India may be a thing of the past, the renewed access coupled with rising prices means growers like Mr Bourne are confident to roll the dice.\n\nIndia has lowered tariffs to 10 per cent on Australian chickpeas. (ABC Kimberley: Courtney Fowler)\n\nOn and off again market\n\nIndia was the choice destination for Australian chickpea exporters for years, enjoying tariff-free access to the world's largest consumer of the legume.\n\nBut in 2017, amid growing pressure to stabilise prices and support domestic farmers, India introduced large tariffs on chickpea imports, effectively killing the trade.\n\nAustralian production plummeted — that year the crop was more than 2 million tonnes, but by 2023 it had shrunk to 500,000 tonnes.\n\nEven Australia's free trade agreement with India signed in 2022 failed to reinstate the trade.\n\nThe industry scrambled to diversify its markets, and now exports chickpeas to Bangladesh, Pakistan and Jebel Ali in the Middle East.\n\nThen, in May 2024, India made a surprise announcement — Australia could once again send tariff-free chickpeas, but only if they arrived before the end of March 2025.\n\nThe south Asian country was desperate to secure supply as it faced one of its lowest crops in five years due to bad weather.\n\nThe announcement came just as Australian farmers were deciding what to plant for winter, kicking off a race to get crops to the sub-continent by the tight deadline.\n\nA chickpea crop planted in central Queensland. (ABC News: Megan Hughes)\n\nPrices skyrocketed, and despite wild storms, logistics issues and worker strikes, Australia's Pulse Council Chair Peter Wilson said about 2 million tonnes made it in before the deadline.\n\n\"Some of the best desi chickpeas I've ever seen were produced in the 2024 early 2025 season,\" he said.\n\n\"They were hard, they were well filled, they were a beautiful colour.\"\n\nIndia eventually reinstated its tariffs but not to the level they were before — offering 10 per cent rather than the 66 per cent that had effectively been in place.\n\n'Open book consideration'\n\nMr Wilson said planting conditions were ideal in the northern growing area in Queensland thanks to a wet summer, which had growers' decision-making.\n\n\"It's been an open book consideration because there's been adequate profile moisture,\" he said.\n\n\" When you have that farmers will consider all of their options. \"\n\nThe first region to harvest is usually central Queensland in spring. (ABC News: Lara Webster)\n\nMr Wilson said while prices had eased from last season's highs of $1,100 a tonne, they were still sitting strong at $700 a tonne.\n\nOn top of a positive economic environment, Mr Bourne said his chickpeas were also benefiting from good weather.\n\n\"We're looking very good, probably one of the best ever [years], actually,\" he said.\n\n\"We've got ample moisture; the first lot of chickpeas we planted are just starting to get a nice foliage on them.\n\n\"Hopefully, we can get a dry October and November at harvest time.\"\n\nRhys Daniels has planted both wheat and chickpeas this winter season. (ABC News: Megan Hughes)\n\nRhys Daniels has a mixed cropping and cattle operation more than 100 kilometres south of Mr Bourne's, at Capella.\n\nThis winter he is growing wheat and chickpeas, but says he understands why Mr Bourne has gone all in.\n\n\"It's been a pretty blessed year really, we've had lots of rain when other people haven't,\" he said.\n\n\" The gross margin for chickpeas blows pretty much everything else out of the water in dryland. \"\n\nMr Daniels's family has grown the legume since the 1990s, and he said they had seen some great years.\n\n\"2016 was a stand-out year with record yields and a record price,\" he said.\n\n\"It really redefined what we actually could grow out of chickpea, the price skyrocketed to $1100 a tonne.\"\n\n\"It was pretty exciting.\"\n\nAround 2 million tonnes of Australian chickpeas went to India last season. (Supplied)\n\nWhile Queensland is starting off strong, Mr Wilson said Western Australia was doing \"okay\" and Victoria and South Australia were suffering with drought.\n\n\"Conditions were still very, very dry there, most of the crop went in dry,\" he said.\n\n\"We've had a couple of shots of rain through the south-east now, crops are out of the ground, but they're juvenile and they just don't have a lot of moisture underneath them.\"\n\nHe said harvesting was still weeks away.\n\n\"Lots of things need to go well for us to have good outcomes,\" he said.\n\n\"I think the conditions are set up for another decent year.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-08-04/tennis-alex-de-minaur-beats-frances-tiafoe-canada/105609286",
        "title": "De Minaur uses ridiculous defence to advance at Canadian Open",
        "publish_date": "Mon, 04 Aug 2025 00:24:16 +0000",
        "category": "sports",
        "authors": [],
        "text": "Alex de Minaur has continued his hard court heroics, showing his trademark tenacity to motor his way to the Canadian Open quarterfinals.\n\nIn a battle between two of the best movers on the men's circuit, ninth-seeded de Minaur fought off seventh-seeded American Frances Tiafoe 6-2, 4-6, 6-4 in their round-of-16 clash in Toronto on Sunday (local time).\n\nThe Australian got off to a sizzling start, racing through the first set 6-2 before Tiafoe regrouped in the second to force the match into a decider.\n\nDe Minaur's renowned return game held him in good stead as he converted five of the 10 break points he generated during the match, compared with the American's three of seven chances.\n\nHowever, the Australian will be looking for an improvement on his service game for his quarterfinal, after landing just 42 per cent of his first deliveries.\n\nTiafoe hit more aces than de Minaur (10 to six) and more winners (29 to 23), but the American also gave up more free points with 49 unforced errors, compared with 35 from his opponent.\n\n\"It was never going to be easy, and Frances has the ability to turn the switch on whenever he wants, so it is always very tricky to put him away,'' de Minaur said after the match.\n\nFrances Tiafoe cut a frustrating figure during his loss to de Minaur. (Getty Images: Mert Alper Dervis)\n\n\"I think I battled him, myself and the conditions, and I am happy to sneak away with the win today.''\n\nDe Minaur has found a rich vein of form in the countdown to the year's final major, the US Open on the hard courts at Flushing Meadows in New York, which starts on August 24.\n\nThe Australian is already a two-time US Open quarterfinalist (2020 and 2024) and has his sights set on making his first grand slam semifinal, having reached the quarters of all four majors.\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\nHis timing could not be better, coming to Toronto after clinching the Washington Open singles championship last week, his 10th ATP Tour title.\n\nThe Washington event was also played on hard courts, making the Aussie one of the most in-form players on the surface.\n\nHis win over Tiafoe stretched de Minaur's winning streak to eight matches.\n\nHe has previously reached the Canadian Open final, losing the 2023 decider against Italy's Jannik Sinner, who has since risen to the top of the world rankings.\n\nDe Minaur is not the only Australian left in the men's singles in Toronto, with 18th seed and defending champion Alexei Popyrin to take on top-seeded German Alexander Zverev.\n\nBoth of the quarterfinals will be played on Tuesday (AEST).\n\nAAP",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-08-04/jasmine-garner-north-melbourne-start-premiership-defence/105607518",
        "title": "The unique hangover cure bonding AFLW premiers for life",
        "publish_date": "Mon, 04 Aug 2025 00:01:44 +0000",
        "category": "sports",
        "authors": [],
        "text": "There's a small but crucial detail different about Jasmine Garner heading into this season. On the back of her right arm is a tattoo of a bounding Kangaroo.\n\n\"Well, it was tattoo Tuesday,\" Garner told ABC Sport.\n\nThe Tuesday being the one after her side won North Melbourne's maiden AFLW premiership last year.\n\n\"We had the Saturday night [after the win], then we had the Sunday, and we had Monday, and so we were all a bit hungover.\n\n\"But I think most of the group got it. It was either here on the ankle, few on the ribs … We were like, 'We kind of have to do it. It's the first ever premiership for the club.'\"\n\nJas Garner will lead North Melbourne into the season as reining premiers. (Getty: Mike Owen)\n\nThe historic flag came after an undefeated run in which North Melbourne toppled the then-reigning premier Brisbane in the final.\n\nThey were heavy favourites to do so, even before the season started, after making their maiden grand final the year before, where they fell short to the Lions.\n\nHowever, despite being heavily revered by the rest of the competition and wider footballing community, the dream run wasn't always a flawless one.\n\nIn week five against Richmond during the condensed fixture, the Kangaroos recorded their lowest score for the season with just three goals to edge a win.\n\nNorth Melbourne went undefeated in 2024 to claim a maiden AFLW premiership. (Getty: Dylan Burns/AFL Photos)\n\nAnd in week two, they drew with Geelong in a bruising clash.\n\n\"It didn't feel like that throughout the year [that we were unstoppable],\" Garner said.\n\n\"We didn't come in after a game that we'd won and been like, 'OK, this is what we did. Well, we're fine.'\n\n\"We'd break it down into quarters … It wasn't like, 'Yeah, we've got the four points, everything's going so well.'\n\n\"Because definitely last year we had some games where we weren't playing great footy. But it was just finding ways to stay in the game, and then when you've got momentum, making the most of it.\n\n\"It was the first final against Adelaide at [Princes Park], I remember the first half, a lot of it they controlled. It was like, 'Why couldn't we get the ball out?' And then in the second half, we were able to get the win.\"\n\nJas Garner was best on ground in the 2024 grand final against Brisbane. (Getty: Morgan Hancock/AFL Photos)\n\nThis year, not only will North Melbourne be hunted more than ever, Garner will also have the added responsibility of guiding the side through its premiership defence as captain, after taking the reins as skipper from veteran Emma Kearney.\n\nShe adds the captaincy to her resume, which now features a premiership, a grand final best on ground, six All Australians and four club best and fairests.\n\nNorth Melbourne women's team break club premiership drought Photo shows North Melbourne win the 2024 AFLW premiership cup. North Melbourne dominate Brisbane in the AFLW grand final to win first flag by an expansion club.\n\nHowever, the lengthy list of accolades doesn't mean Garner is getting complacent.\n\n\"If you don't do the extra work, you don't get fit, get strong, you will get left behind,\" she said.\n\n\"Every year you're just finding something different to get better at, to stay up with the elite.\"\n\nWhat is she working on right now?\n\n\"I think just every year, I'm trying to get fitter at my running,\" she said.\n\n\"I think that's what I've been able to do when I moved into the midfield and just keep building that engine.\n\n\"Because the best midfielders in the comp are usually good runners … So, just trying to stay strong.\"\n\nJasmine Garner took over the captaincy from Emma Kearney for the 2025 season. (Getty:Dylan Burns/AFL Photos)\n\nThere's also a small \"35\" tattoo inked on her wrist, and another on her ribs.\n\n\"All of a sudden, I'd got three new tattoos. I'm like, 'I was addicted',\" she joked.\n\nNow, the question will be if another bounding Kangaroo will join the first if her side can manage to go back-to-back this year after finally getting a taste of premiership success. They are tipped by many to do so.\n\nThe Kangaroos' 2025 campaign begins against Geelong on August 16.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-08-04/pilbara-public-holiday-kings-birthday-long-weekend-fenacl/105604732",
        "title": "Pilbara locals like their 'little tradition' with public holiday date",
        "publish_date": "Sun, 03 Aug 2025 23:55:49 +0000",
        "category": "finance",
        "authors": [],
        "text": "For almost 30 years, a small pocket of Western Australia's north-west has quietly celebrated an annual public holiday one month before the rest of the state.\n\nResidents and businesses in the City of Karratha and the Town of Port Hedland are the only two local governments with alternative dates for the King's Birthday public holiday, which is observed at the end of September for the rest of WA.\n\nWhy?\n\nUnder the Public and Bank Holidays Act 1997, local governments may request the King's Birthday public holiday be celebrated on an alternative date of significance within its district.\n\nThe FeNaClNG festival and Hedland Cup justify the holiday for the City of Karratha and the Town of Port Hedland, respectively.\n\nThe City of Karratha has held the different date since 1996.\n\nThe festival attracts more than 10,000 people each year. (ABC Pilbara: Mietta Adams)\n\nWhat do residents think?\n\nEarlier this year, almost 80 per cent of respondents in a City of Karratha survey voted in favour of maintaining the public holiday in August for another three years.\n\nThe FeNaClNG festival started in 1972 and is named after the formulas for iron, salt and natural gas, representing some of the Pilbara's largest resources trade.\n\nThe festival has been running for 53 years. (Supplied: City of Karratha)\n\nFestival attendee Sherry Fitzgerald has participated in the event for nearly 20 years and wants to see the public holiday tradition continue.\n\n\"It just brings everybody together, everybody is friendly,\" she said.\n\n\" Let us have our little tradition in the Pilbara. \"\n\nBut others, like Hannah Whelan, believe \"it isn't really fair\" the holiday falls at a different time to the rest of the state.\n\nHannah Whelan believes it's unfair for families living across regions to have different public holiday dates. (ABC Pilbara: Mietta Adams)\n\n\"People should be able to have the same long weekend as the rest of the state so they can make the most of it, visiting their family if they want to.\"\n\n'It's a bit strange to me,\" she said.\n\nDisruptive for business\n\nWhile some local businesses take the public holiday, others still choose to observe the September public holiday date.\n\nThe public holiday in Karratha will be reviewed again after 2027. (ABC Pilbara: Mietta Adams)\n\nCity of Karratha Mayor Daniel Scott said it depended on the company and the choice of the employer, with some businesses even choosing to take both public holidays.\n\n\"If businesses take advantage, their employees manage to get an extra public holiday than everyone else in the state,\" he said.\n\nHowever, he noted the holiday can be disruptive for bigger companies.\n\n\"There are a lot of businesses that obviously operate in Perth and also have links over the eastern states as well, so it can disrupt a few businesses because they like to have their public holidays all in line,\" he said.\n\nThe WA government is looking to reform the state holidays to align with other states. (ABC Pilbara: Mietta Adams)\n\nIt's a common issue in Western Australia, where the state government is reviewing its public holiday schedule to align holidays like the King's Birthday, Labour Day and WA Day with other states.\n\nIf changes are made, regional local governments will still be allowed to celebrate the King's Birthday on an alternative date.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-08-04/record-power-outages-canberra-winter-demand-skyrockets/105608798",
        "title": "Canberra's record power outages leave business owners like Alex nervous",
        "publish_date": "Sun, 03 Aug 2025 23:09:54 +0000",
        "category": "finance",
        "authors": [],
        "text": "Energy companies are being urged to step up their planning as Canberra faces a winter with record outages amid skyrocketing demand.\n\nThe ACT government's push to phase out gas appliances and increase electrification has seen demand for electricity rise to record levels, sometimes outstripping supply.\n\nThe result has been intermittent blackouts, sometimes coinciding with freezing temperatures.\n\nBut for some, the problem is far more serious than cold feet, with businesses dependent on electricity facing large financial losses from blackouts.\n\nFor cafe owner and cheesemonger Alex Royds, a loss of power can be a costly disaster.\n\nAlex Royds says power outages can have a big impact on his small business. (ABC News: Emily Anderson)\n\nMr Royds said his day-to-day stock was about $20,000, so any power outage could cause a significant loss, especially since everything had to be kept below 4 degrees Celsius.\n\n\"It's a big loss, especially if you're just a new business … to lose a full week's worth of stock is pretty scary and might be hard to come back from,\" Mr Royds said.\n\n\"It's really sad to throw out that much food.\n\n\" When you're filling up a skip bin that could be consumed, it's just quite sad. \"\n\nOutages up 20 per cent\n\nFor power supplier Evoenergy, it has been somewhat of a nightmare winter.\n\nThere's been a jump in demand for electricity due to a colder winter and increased electrification. (ABC News: Stuart Carnegie)\n\nThe company said the outages for June this year increased by 20 per cent on outages for the same period last year.\n\nIt was attributed to a growth in power demand caused by a colder winter, a growing population, and increased electrification.\n\nThe worst-affected areas have been the Molonglo Valley and Gungahlin, two of the fastest-growing areas.\n\nOne of the community scale batteries in Denman Prospect, which stores energy from the grid. (ABC News: Stuart Carnegie)\n\nIn May, the company began trialling six new community-scale batteries in Denman Prospect to help improve electricity reliability during Canberra's high-demand winter season.\n\nIn a statement, Evoenergy said the batteries were designed to \"store energy from the grid during off-peak periods — like overnight or midday — and release it when demand is highest, especially in the evenings when heating use peaks\".\n\nTim Juhasz says other stressors on the electricity network include weather and falling trees. (ABC News)\n\nEvoenergy acting general manager Tim Juhasz said the problems in the system usually emerged during peak times when people got up in the morning and when they got home in the evening.\n\n\"The more load you have going through your network and when it starts to get close to the network's capacity and if there are any underlying issues with the network, they start to show up and might trip the feeder and cause outages for the community,\" he said.\n\nBetter planning needed, expert says\n\nMr Juhasz said there were other stressors on the system, too, from bad weather, falling trees, and other disasters.\n\nTony Wood, an energy and climate change senior fellow at the Grattan Institute, agreed unpredictable weather, particularly caused by climate change, was a problem.\n\nTony Wood says people now depend more heavily on electricity systems than they did a decade ago. (ABC News: Tara Whitchurch)\n\nBut he said he would have expected better planning from energy companies that needed to be on top of the demand from a growing population.\n\n\"We depend upon the electricity system much more than we did 10 to 15 years ago,\" Mr Wood said.\n\n\"It does mean we put much greater value on the reliability of our electricity system than we ever have before.\n\n\"As some of our cities and regional areas are growing, we need to deal with that by putting in more infrastructure.\n\n\"That's the role of the energy companies.\"\n\nEvoenergy said that in addition to the trial batteries, before next winter, it also expected to have completed the construction of the Molonglo Zone Substation, which would power thousands of homes.\n\nMr Royds says his day-to-day stock is about $20,000, so any power outage can cause a significant loss. (ABC News: Emily Anderson)\n\nIn the meantime, Mr Royds is still pleased he has gone all electric with the help of a government grant.\n\n\"It's actually made things a hell of a lot easier,\" he said.\n\nThat is while the fridges stay on.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-08-04/teen-wants-young-people-to-talk-about-organ-donation/105589968",
        "title": "Healthy, sport-obsessed teen's world changed by kidney failure",
        "publish_date": "Sun, 03 Aug 2025 23:05:29 +0000",
        "category": "lifestyle",
        "authors": [],
        "text": "Riley Turnbull was getting ready to play a soccer game last year when he was given news that would change the trajectory of his life.\n\nThe then 18-year-old from Mount Gambier, in regional South Australia, had been sleeping poorly, was constantly tired and drinking excessive amounts of water.\n\nHe went to his doctor and was told to take a routine blood test, which he put off for weeks.\n\nBut when he received the results, he found out his kidneys were operating at 25 per cent of their function.\n\n\"I had a biopsy and found out both my kidneys were 95 per cent scarred and that I had stage three kidney failure,\" Mr Turnbull said.\n\n\"Throughout last year I was going OK once I found out, having regular appointments, and then I slowly got worse and worse.\n\n\"In November I had an operation to have a peritoneal dialysis tube put in my belly and start dialysis because my levels were under 10 per cent.\"\n\nThe Australian Institute of Health and Welfare says about 15,500 people received kidney dialysis in 2022. (Supplied: Kidney Health Australia)\n\nMr Turnbull was initially told a kidney transplant would need to happen in the coming years.\n\nBut his condition deteriorated quickly and it became clear he would need a new kidney soon.\n\n\"I travelled to Adelaide to start haemodialysis. It filters your blood and cleans it out,\" Mr Turnbull said.\n\n\"Luckily when I was up there, that's when I got the phone call there was a kidney waiting for me.\n\n\"I was at 8 per cent kidney function during my last blood test before my transplant.\"\n\nRiley Turnbull hopes to return to playing sport one day. (ABC South East SA: Sam Bradbrook)\n\nRaising awareness\n\nOverall, Mr Turnbull was in Adelaide for three months post-transplant. He spent 70 days straight attending hospital and underwent a further eight procedures.\n\nAs a sport-mad teenager, he had never thought about organ donation before he fell ill.\n\nNow, he wants to use his story to encourage conversations among people of all ages about joining the organ donation registry and discussing plans with family and friends.\n\n\"It's not just important for people like me receiving organs, but you can donate most parts of your body,\" he said.\n\n\" It's a really good thing to give someone a second chance at life like my donor gave me. \"\n\nWhen a person dies and qualifies to have their organs donated, their family is given the final say on how to proceed.\n\nFamily's three organ transplants Photo shows A family of three. The mum holds a black poodle and the son holds a football. The Stolkers had three successful organ transplants. Now they're campaigning for more Australians to become donors.\n\nDonateLife clinical manager Amanda Stewart said 80 per cent of eligible donors who discussed their plans with family before their death were given permission to donate.\n\nIt drops to 40 per cent if the family is unaware of their wishes.\n\n\"There's a taboo around death and dying, but it's as simple as having a discussion around what your wishes are,\" Ms Stewart said.\n\n\"If you've had the conversation and gone online and registered, then that burden is relieved for them.\n\n\"They know what your wishes would've been and they're able to support them.\"\n\nGambier Centrals players Sam Shoemark and Dan Crossing wore DonateLife hats during warm-ups before a game. (ABC South East SA: Josh Brine)\n\nOld friends coming together\n\nNow back in Mount Gambier after three months recovering from surgery, Mr Turnbull has returned to his soccer club Gambier Central to advocate for organ donation.\n\nHe is working with Danni Horton, a volunteer at the club who has been on her own organ transplant journey.\n\nDanni Horton was diagnosed with kidney failure in 2003 and received a transplant in 2021. (ABC South East SA: Sam Bradbrook)\n\nMs Horton was first diagnosed with kidney failure in 2003, when she was 21 years old.\n\nIt would take her until 2021 to receive a kidney transplant; in between, she gave birth, received extensive dialysis and was diagnosed with a blood clot.\n\n\"We can never thank them [donors] in person [for] … what they've done for my family, not just me,\" Ms Horton said.\n\n\" Most people have only ever known me as sick, so to actually be out, being healthy and doing more stuff, it's just fantastic. \"\n\nRiley Turnbull and Danni Horton advocate for organ and tissue donation in Mount Gambier. (Supplied: Danni Horton)\n\nMs Horton has known Mr Turnbull since he was a baby and has helped him through the organ transplant journey.\n\n\"I'm so proud of him and how he's dealing with it all,\" she said.\n\n\"He's just doing such a great job, getting out there and promoting organ donation awareness.\"\n\nCentrals players donned DonateLife socks to raise awareness. (ABC South East SA: Josh Brine)\n\nMr Turnbull has had to accept he will never go back to playing soccer.\n\nBut now he is back home and in recovery, he has set his sights on returning to sport.\n\n\"I hope to travel around Australia with my girlfriend next year,\" Mr Turnbull said.\n\n\"There's also the Transplant Games. [I want] to play sport again.\n\n\" I just can't wait to have life back, work properly and not have to worry about being stuck on dialysis. \"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-08-04/golf-rhodes-kyriacou-hole-in-one-yamashita-wins-british-open/105608928",
        "title": "Tee shot bounces off Aussie's ball for hole-in-one at British Open",
        "publish_date": "Sun, 03 Aug 2025 22:25:57 +0000",
        "category": "sports",
        "authors": [],
        "text": "She may have finished seven shots behind champion Miyu Yamashita, but there has been no keeping Steph Kyriacou out of the action at the Women's British Open.\n\nOn Friday, the 24-year-old from Sydney made the first hole-in-one of the championship on the eighth at Royal Porthcawl, in Wales.\n\nThen on Sunday, she unwittingly assisted with the second.\n\nEngland's Mimi Rhodes made a hole-in-one on the par-three fifth, but only because her tee shot glanced off playing partner Kyriacou's ball a couple of inches from the hole.\n\nSnooker-style, Rhodes's ball ended up in the cup.\n\nHer shot would certainly have rolled past had it not been for the deflection.\n\nKyriacou had hit first and nearly made her second ace until her ball rolled just left of the hole.\n\nAsked if she was the luckiest person in golf, Kyriacou replied: \"I am. We actually just watched the video, and it hit my ball, and it went in. So I'm kind of claiming it, even though Mimi is probably not going to say that.\n\n\"I had no clue she'd hit my ball. We just heard everyone shout.\"\n\nBesides setting some sort of record for holes in one, Kyriacou had a highly satisfactory final day, with five birdies in her 71. It left her 4-under-par and with a share of eighth place.\n\n\"I think I've learned a lot in majors, which I'll take into next year,\" she said.\n\nAsked about her probable entry in the world top 10, and being the top-ranked Australian, she said: \"There's nothing wrong with friendly competition, but I haven't got the win just yet. So when I do that, I'll be a little bit more arrogant, I think.\"\n\nYamashita won by two shots to claim the first major of her career after keeping England's Charley Hull and Japan's Minami Katsu at bay.\n\nYamashita finished 11-under after she sank three birdies on the front nine and remained steady on the back nine, until a late stumble with her first bogey on the par-four 17th.\n\nHull mounted a spirited challenge with five birdies that brought her to within one shot of Yamashita.\n\nHowever, back-to-back bogeys on the 16th and 17th sealed her fate.\n\nKatsu also tied for second with a final-round score of 69.\n\nJapan's Miyu Yamashita holds up the Women's Open trophy after her win. (Getty Images: Morgan Harlow)\n\nAustralia's Minjee Lee finished with a level-par 72 to end two-under-par and with a share of 13th place.\n\n\"I feel like that's probably the worst score I could have had today. I felt like I was going pretty well and then just kind of made a silly mistake on 14,\" she said.\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\n\"It was one of those weeks where I was kind of in the middle, like I wasn't really amazing at one thing or another. I'm not complaining, but I would have liked to be in the top 10.\"\n\nHaving won the KPMG Championship, her third major title, Lee said she was pleased with her year overall.\n\n\"I think, from where I was at the beginning of the year, obviously winning KPMG and played Chevron and had a good finish at Evian and all right at US Open and all right here. So I feel like I've done pretty well. Maybe an 8.5.\"\n\nEarlier, the third Australian, Grace Kim, ended her British Open with a dispiriting 80 to slip to 12-over-par.\n\nLydia Ko, New Zealand's defending champion, ended on three-over for a share of 36th place, alongside world number one Nelly Korda, among others.\n\nAAP",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-08-04/diabetes-cgm-insulin-pump-still-unsubsidised/105589510",
        "title": "'Game-changing' diabetes technologies out of reach as cost of living climbs",
        "publish_date": "Sun, 03 Aug 2025 21:58:21 +0000",
        "category": "finance",
        "authors": [],
        "text": "Sammy Haigh's day starts with a series of complex calculations.\n\n\"I get out of bed and work out how many grams of carbs I'm going to be eating for breakfast, then I put those carbs into my insulin pump, which will deliver my insulin to me,\" she said.\n\nThe 26-year-old Newcastle woman is one of 2 million Australians living with diabetes.\n\nOver the course of a year, the minimum spend on diabetes supplies sets her back almost $5,000, and that's minus the subsidies she receives from Medicare and Australia's National Diabetes Services Scheme (NDSS).\n\nLast year, a parliamentary inquiry into diabetes recommended the federal government make insulin pumps available at a low cost for all people with type 1 diabetes.\n\nThe report was released 12 months ago, and the government has yet to respond to the recommendations.\n\nSammy Haigh's insulin pump is not subsidised by the NDSS. (ABC Newcastle: Fleur Connick)\n\nIt has left people, like Ms Haigh, to deal with the financial burden of the lifelong, incurable autoimmune condition.\n\nCost burden\n\nMs Haigh is an early childhood educator and says diabetes costs her roughly $103 per week.\n\n\"My diabetes is more than half of my rent,\" she said.\n\n\"It totals, at the moment, between $400 to $500 a month.\"\n\nThis includes costs for private health insurance, which she needs in order to access an insulin pump, other diabetes technologies, and various doctors' appointments.\n\n\"These expenses are not just one-offs, but for critical equipment necessary to stay alive,\" she said.\n\n\"It's on top of an already tight young-person budget, having to juggle increasingly higher rent costs, groceries, and fuel.\n\n\" It can be really hard, having to choose between my health and putting money aside for saving for my long-term financial security or doing something fun with my friends. \"\n\nInsulin pumps are wearable devices that supply a continuous flow of insulin. (ABC Newcastle: Fleur Connick)\n\nMs Haigh has just started using an insulin pump, a small digital device that delivers insulin continuously to manage blood glucose levels.\n\nInsulin pumps are only subsidised for type 1 patients under the age of 21.\n\n\"The cost of a pump is absolutely unaffordable for some people,\" she said.\n\nMs Haigh's insulin pump works in tandem with her continuous glucose monitor (CGM), which is government subsidised.\n\nIt connects to her phone and is able to show her blood glucose levels in real time.\n\n'Crisis point'\n\nDiabetes Australia said the diabetes epidemic was at a crisis point, estimating the disease cost the health system $9.1 billion each year.\n\nProfessor David Simmons, an endocrinologist and Diabetes Australia's chief medical officer, said increasing access to insulin pumps could reduce costs for the health system, as keeping blood glucose levels stable reduces the risk of long-term health complications.\n\nDavid Simmons says Australia is lagging behind some countries when it comes to subsidising new diabetes technologies. (Supplied)\n\n\"It does reduce the cost [for the health system] by reducing people who end up in intensive care units or on dialysis, for example,\" he said.\n\nHe said Australia was lagging behind the rest of the world.\n\n\" This is now seen as normal care, but sadly in Australia it's not being provided in the way that is happening in other countries. \"\n\nMultiple countries, including the United Kingdom and Canada, subsidise insulin pumps for people with type 1 diabetes.\n\n'Inequitable access'\n\nOne recommendation of the 2023 inquiry was that continuous glucose monitor (CGM) access be expanded to type 2 diabetes patients, who are not covered by the government subsidies.\n\nHunter Valley man Pete Holland was diagnosed with type 2 diabetes 10 years ago.\n\nAfter seeing the benefits of a CGM for his daughter with type 1 diabetes, he tried it himself.\n\nPete Holland stopped using a continuous glucose monitor due to the cost. (ABC Newcastle: Courtney Yeandle)\n\nDespite describing the device as a \"game-changer\" for managing his condition, he stopped using it due to the cost.\n\n\"They're a massive expense, they're over $200 a month to be able to use these things,\" he said.\n\n\"With the cost of living these days, I can't afford to be paying that sort of stuff.\"\n\nCGMs are used to monitor blood glucose levels. (ABC Gold Coast: Damien Larkins)\n\nMr Holland said he was desperately waiting for CGM subsidies to increase.\n\n\"It's a no-brainer for me to take a load off the health system and help anybody with diabetes at the same time,\" he said.\n\nIn a statement, a spokesperson for Federal Health Minister Mark Butler said the government was carefully considering the report of the diabetes inquiry.\n\n\"The report shines a light on a serious public health issue affecting every community in Australia,\" the statement said.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-08-04/tour-de-frances-femmes-sarah-gigante-finishes-sixth/105608852",
        "title": "Gigante misses Tour de France Femmes podium after 'two hours of pain, heartbreak'",
        "publish_date": "Sun, 03 Aug 2025 21:49:45 +0000",
        "category": "sports",
        "authors": [],
        "text": "Australia's Sarah Gigante has settled for sixth place in the Tour de France Femmes, with Pauline Ferrand-Prévot claiming victory for the French.\n\nStarting the day second in the general classification, Gigante lost ground on the Joux-Plane descent and finally finished the stage seventh.\n\n\"It was two hours of pain, heartbreak and hope all in one,\" she said at the finish.\n\nFerrand-Prévot's victory was never in doubt and she launched an attack to clinch the final stage and increase her overnight lead.\n\nThe 33-year-old had put herself largely in control by winning Saturday's eighth and penultimate stage with an audacious solo breakaway on the last climb.\n\nThat gave her an overnight lead of 2:37 seconds over Gigante, and 3:18 over Demi Vollering.\n\nA young fan runs alongside Pauline Ferrand-Prévot of France as she powers to victory in her debut Tour de France Femmes. (Getty Images: Tim de Waele)\n\nThe ninth stage from Praz-sur-Arly to Chatel was a 124-kilometre trek featuring three big mountain climbs.\n\nBut Ferrand-Prévot did not face any big attacks and instead launched one of her own with 6km left.\n\nThe crowds cheered her all the way to the finish line and, moments later, the tears flowed as she lay on her back, exhausted but elated.\n\nVollering was 20 seconds behind in second place and Kasia Niewiadoma followed in third place as they sprinted to the line.\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\nEarlier, Ferrand-Prévot was with a group including Gigante when they tackled the mammoth climb up Col de Joux Plane — an 11.6km grind with a gradient of 8.5 per cent.\n\nGigante is known to have trouble descending at speed and was dropped on the long downhill. She could not make up the time, especially with no teammates to help her, and lost her podium spot, finishing sixth overall, 6 minutes and 40 seconds behind the winner.\n\n\"It was a super hard day, I was already feeling not so strong physically going up the Joux-Plane,\" Gigante said at the finish.\n\n\"I was hoping to get away and have a head start before the downhill, but I was pretty much getting dropped by the top.\n\n\"And then of course the descent was just so hard. It was a long day out.\"\n\nThe other Australians to complete the Tour de France Femmes were Neve Bradbury (71st), Lauretta Hanson (75th), Ruby Roseman-Gannon (78th) and Emily Watts (114th).\n\nHaving won Olympic gold in mountain biking and conquered the cobblestones of the Paris-Roubaix classic, Ferrand-Prévot added another line to her glittering CV with a Tour victory.\n\nThe ABC of SPORT Sports content to make you think... or allow you not to. A newsletter delivered each Saturday.\n\nAAP",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-08-04/cricket-england-vs-india-day-4-wrap-root-brook-100s/105608848",
        "title": "England and India set for gripping finale as Root leaves door ajar",
        "publish_date": "Sun, 03 Aug 2025 21:35:36 +0000",
        "category": "sports",
        "authors": [],
        "text": "England had moved to within 35 runs of securing a famous victory over India when bad light and torrential rain ended an extraordinary fourth day of the final Test at The Oval overnight.\n\nHarry Brook and Joe Root shared a superb fourth-wicket partnership of 195 to put England on the brink of completing a record run chase that would have given them a 3-1 series win.\n\nWith India on the ropes and England needing just another 73 runs, Brook played a wild stroke and skied a catch to depart for 111.\n\nThat gave India a glimmer of hope and they made the most of it.\n\nJacob Bethell also fell to a rash shot for five and Root, having completed a masterful 39th Test century, nicked a catch to wicketkeeper Dhruv Jurel off Prasidh Krishna to spark wild Indian celebrations.\n\nWith tension mounting, Jamie Smith and Jamie Overton struggled to get bat on ball, surviving several frenzied appeals before the umpires decided it was too dark to continue.\n\nThe players left the field and shortly afterwards a heavy rain shower made conditions unplayable, depriving the crowd of a tense finale to a day of unremitting drama.\n\nBut a wonderful series — all five Tests have now gone into a fifth day — will receive a nerve-racking denouement.\n\nChris Woakes may be required to bat on the final day despite dislocating his shoulder. (Getty Images: Stu Forster)\n\nEngland will resume on 6-339 on Monday night (AEST), with bowler Chris Woakes unlikely to bat due to a dislocated shoulder, and India still in with a chance of a victory that would level a gripping five-match series.\n\nWoakes could be seen kitted up and with his arm in a sling, though, and could conceivably find himself at the crease on day five, though presumably only at the non-striker's end.\n\nIndia had the better of the morning session after England resumed on 1-50, dismissing Ben Duckett for 54 and Ollie Pope for 27 to leave the hosts wobbling on 3-106.\n\nBrook, on 19, was lucky to survive when Mohammed Siraj caught him in the deep before stepping back on to the boundary cushion.\n\nThe prolific right-hander made him pay a heavy price for the error, striking two sixes and 12 fours all around the ground to reach his 10th Test century off 91 balls.\n\nRoot provided the perfect foil, continuing his consistent form throughout the series, as the Indian bowlers struggled to get much movement under grey skies.\n\nOnce past three figures, Brook launched an all-out attack, hitting Akash Deep for two fours in an over before attempting a third and Siraj completed the catch on this occasion.\n\nBrook's bat flew out of his hands as he played the stroke and he had to retrieve it before returning to the pavilion to a standing ovation from the crowd.\n\nHe probably believed he had done enough to ensure victory for his team but India had other ideas.\n\nThe highest successful run chase at The Oval was England's 9-263 against Australia in 1902.\n\nAAP",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-08-04/swimming-meg-harris-gold-freestyle-usa-beats-australia-medals/105608762",
        "title": "Harris's freestyle gold not enough to help Australia top swimming medal tally",
        "publish_date": "Sun, 03 Aug 2025 21:28:34 +0000",
        "category": "sports",
        "authors": [],
        "text": "Australian swimmer Meg Harris has won the gold medal in the women's 50m freestyle final at the world swimming championships in Singapore.\n\nOn the final night of competition, Australia's Jenna Forrester and women's medley relay team also claimed silver.\n\nHarris beat Chinese swimmers Quinfeng Wu and Yujie Cheng in 24.02 seconds, marginally slower than the swim that won her the silver medal at the Olympic Games in Paris.\n\n\"Stoked, like there's not much more I can say,\" she said after the race.\n\nMeg Harris celebrates after winning gold in the women's 50m freestyle final. (Getty Images: Maddie Meyer)\n\n\"I did the dream that I've been dreaming this whole time, like this is why I swim — also for the enjoyment — but it is nice winning.\n\n\"I still can't even put it into words … it'll take a while to process.\"\n\nHarris, who also won a gold medal in the women's 4x100m freestyle relay on night one of the championships, said she had to reset her outlook after her Paris success.\n\n\"It was a bit of a tough one,\" she said.\n\n\"I felt such a high coming off that and then starting this year had to find a new motivation, not just coming in and doing the exact the same thing.\n\n\"I tried for the first couple of months, but something just wasn't working, and I needed to find a new way to do it.\n\n\"So, I stripped everything back and started with the basics — all the reasons that I started swimming, like I love sprinting, and I love racing.\"\n\nHarris admitted after the race that she swims with her eyes closed.\n\n\"I guess it's just like trying to focus on my stroke,\" she said.\n\nShe also took a breath — against instructions.\n\n\"Pretty much my whole training has been to focus on not taking a breath, but it didn't feel so great in the semis, so I just tried to do whatever came naturally and the breath came naturally,\" she said.\n\nJenna Forrester finished an equal second behind Summer McIntosh in the women's 400m individual medley final. (Getty Images: Albert ten Hove)\n\nCanada's Summer McIntosh bounced back from her disappointment with her bronze in the 800m from Saturday night to blitz the field in the 400m individual medley.\n\nHer time of 4:25.78 was two seconds slower than her own world record but was a championship record.\n\nAustralian Forrester came from third with her last stroke to tie for second with Japan's Mio Narita, 7.48 seconds behind McIntosh.\n\n\"Yeah I didn't know that I was going to come in second, I thought, maybe third,\" Forrester said.\n\n\"But seeing second up on the scoreboard I was honestly in disbelief. That was crazy.\n\n\"To make a comeback like that this year, I'm super proud of myself. Super grateful to have the support team around me: My coach, my family, my friends.\n\n\"It really means the world to me, and I felt like that swim was for everyone who helped me get here.\"\n\nMollie O'Callaghan had one last chance to move ahead of Ian Thorpe as Australia's greatest world championship swimmer in the final of the 4x100 medley relay.\n\nBut it was the United States that stole the show, breaking their own world record with a time of 3:49.34.\n\nThe quartet of Regan Smith, Kate Douglass, Gretchen Walsh and Torri Huske will share a $US30,000 prize for breaking the record.\n\nThe United States relay team proved to be too strong for Australia in the 4x100m final. (Getty Images: Maddie Meyer)\n\nThe Australian team of Kaylee McKeown, Ella Ramsay, Alexandria Perkins and O'Callaghan came second 3.33 seconds behind the Americans.\n\n\"I'm really proud of us all, I think we've all had a big meet,\" Perkins said.\n\n\"Just to come out here and do our best is really important and I think we did a great job.\n\n\"Also, a special mention to our little 16-year-old Sienna. She did a great job this morning too.\"\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\nThat medley relay was the last event of the championships, which saw the United States top the medal table with nine gold, 11 silver and nine bronze ahead of Australia in second with eight gold, six silver and six bronze.\n\n\"One medal short,\" Australian head coach Rohan Taylor lamented.\n\n\"Obviously you hope for it all the time but it's nice for it to come down to the last relay and we did our best.\n\n\"But anyway, they were too good on the day, but that just makes us more hungry for it.\"\n\nHe said there was still room for improvement, given the absence of Ariarne Titmus, who was taking a year off, and decisions by some athletes not to swim in certain races.\n\nIllness also swept through the team and prevented Sam Short swimming in his favourite 800m.\n\n\"We've now got past this meet and me in my mindset is looking forward to the future and the next stop is Comm Games and Pan Pacs,\" Taylor said.\n\nSam Short was unable to swim in his pet event, the 800m freestyle, after suffering from an illness. (Supplied: Delly Carr/Swimming Australia)\n\n\"We had a great conversion rate … as of tonight I think our whole team had a 60 per cent of finals swims that were equal or better than trials, which is something we really strive for.\"\n\nAsked for his highlights of the meet, Taylor said they all had a little meaning.\n\nHe commended Forrester, who had to wait until the last day of the meet to swim.\n\nHe also highlighted the two 100m freestyle relay gold medals on night one and Lani Pallister's silver medal.\n\n\"Geez, that 800 free was special last night, it was just epic, I was fanning the whole time,\" he said.\n\nAsked if Ariarne Titmus planned to come back to the sport after her year off, Taylor said he hoped so\n\n\"I haven't had a chat with her, I leave Arnie alone and let her work through that, but if Arnie wants to talk to me she'll obviously ring me,\" he said.\n\n\"But I leave her to make her own decision, but I hope so, I really do. It'd be great.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.smh.com.au/goodfood/melbourne-eating-out/an-alice-in-wonderland-inspired-cocktail-bar-that-s-all-about-the-theatrics-20250804-p5mk59.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "An Alice in Wonderland-inspired cocktail bar that’s all about the theatrics",
        "publish_date": "Mon, 04 Aug 2025 12:33:00 +1000",
        "category": "finance",
        "authors": [
            "Tomas Telegramma"
        ],
        "text": "Add articles to your saved list and come back to them anytime.\n\nSave this article for later\n\nRemove items from your saved list to add more.\n\nYou have reached your maximum number of saved items.\n\nCurious, at the base of the W Hotel, has a new cocktail menu designed by UK mixologist Matt Whiley.\n\n1 / 7 Curious’s new cocktail menu is designed by UK mixologist Matt Whiley. Supplied 2 / 7 Inside the Alice in Wonderland-inspired bar. Supplied 3 / 7 The Cryocone cocktail: bourbon, smoky bacon vodka and maple raisin ice cream. Supplied 4 / 7 Cocktails are as theatrical as the space itself. Supplied 5 / 7 The “tropical sand storm” cocktail features an edible sand rim. Supplied 6 / 7 The Pyro-Flora cocktail featuring smoked vodka, burnt pear, lemon myrtle and strawberry gum soda, served in a bowl of smoked leaves. Supplied 7 / 7 The Red Earth cocktail is a desert-inspired margarita with honey pearls. Supplied Previous Slide Next Slide\n\nContemporary$$$$\n\nIt was loosely inspired by Alice in Wonderland, so the fact that there’s a lot going on at the W’s underground cocktail bar is kind of the point. An undulating ceiling of big timber beams emulates the rabbit hole, which the door person will whisk you down through a voluptuous velvet curtain.\n\nIf you want to soak up the surrounds, there’s a good vibe to bunker down for a midweek cocktail. But to find Curious at its most chock-a-block, book a table for Friday or Saturday night and watch as it gets boisterous, edging into club territory, with tables splurging on champagne magnums. Those after a quiet weekend nightcap won’t find it here.\n\nCocktails are as theatrical as the space (peppermint air, anyone?) and play on Melbourne’s stereotypical north-south rivalry (will it be one inspired by the Fitzroy Garage Party or the lavender-laden Too Right It’s Toorak?).",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/traveller/reviews-and-advice/when-people-say-cruises-are-all-same-same-i-counter-with-this-20250618-p5m8an.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "When people say cruises are all same-same, I counter with this",
        "publish_date": "Mon, 04 Aug 2025 12:16:18 +1000",
        "category": "finance",
        "authors": [
            "Brian Johnston"
        ],
        "text": "I’ve done a lot of cruising, but that doesn’t stop people who are keen to tell me that it’s a cookie-cutter experience they’d never consider.\n\nThat’s like saying you’d never stay in a hotel because they all occupy big bland buildings with identical rooms. Yes, international chains are familiar, but I don’t think anyone assumes there aren’t quirky national chains or family-owned boutique hotels out there.\n\nLikewise, cruise lines come in all varieties and, if you look beyond the regular horizon, you’ll find myriad companies, one of which will surely suit even the pickiest person. There are too many to cover here, but this small sampling might whet your appetite.\n\nStar Clipper under full sail.\n\nIf you want to sail the truly authentic way, then Star Clippers operates three of the world’s largest and tallest sailing vessels in the Caribbean, Pacific coast of Central America and Mediterranean. Its ships aren’t luxurious but you get a genuine sailing experience. Many guests are yachties, but even landlubbers will be thrilled at the billowing sails and creaking ropes.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/afl/cold-pies-and-a-giant-headache-who-will-make-the-finals-in-the-race-for-the-top-eight-20250804-p5mk2m.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Cold Pies and a Giant headache: Who will make the finals in the race for the top eight?",
        "publish_date": "Mon, 04 Aug 2025 12:09:05 +1000",
        "category": "sports",
        "authors": [
            "Jon Pierik"
        ],
        "text": "What we say: In what has largely been a humdrum race for the finals, the Magpies’ woes have piqued interest. They appeared a lock for a top-two finish, if not top spot, a month ago. At that point they were 10 premiership points clear at the top. But three defeats from their past four games have sparked concerns about Collingwood wobbling. Smashed in clearances at key stages in a worrying loss to the Lions, and missing Jeremy Howe, the Magpies had their worst performance since opening round. They now have an intimidating fortnight ahead and could slip to fifth. Best case: First. Worst case: Fifth. Major impact: Jeremy Cameron (left) and Lachie Neale have keys roles to play for the Cats and Lions, respectively. Credit: The Age Brisbane Lions\n\nWhat we say: Coach Chris Fagan said he expected his team to rebound after a heavy loss to Gold Coast, and they did just that at the MCG on Saturday night. The Lions should beat Sydney on Saturday and could slip into the top two, but their top-four fate will be decided over the final fortnight of the season with games against fellow premiership contenders. Best case: First. Worst case: Sixth. Geelong What we say: The Magpies’ woes have the Cats ready to pounce on a top-two finish. And their run home could hardly be any friendlier, with all three of their next opponents thinking about next season. Geelong should make this a trifecta of victories, and their top-two hopes will be shaped by the fortunes of the Magpies, Lions and Crows. Secure in the knowledge of at least a top-four finish, they have the luxury of managing their best players, ensuring a healthy list for September. Best case: First. Worst case: Fifth. That’s where September is: Geelong coach Chris Scott with his star onballer Bailey Smith. Credit: AFL Photos\n\nFremantle What we say: The Dockers had to rebound from four goals down at half-time against Carlton to prevail on Sunday, but that’s the type of response they would not have had this time last year. On a four-game tear, they, too, have the double chance within their grasp. We’ll back them in against the Power, but it’s the final fortnight of the season that will tell the tale. Best case: First. Worst case: Ninth. Gold Coast\n\nWhat we say: A top-four finish, possibly even third, is not out of the question for the Suns, who now appear a lock to make their September debut. We have them winning three, if not all, of their remaining four games. If it’s all four, 17 wins could be enough for the double chance. It will be great to see a fresh face in September action. Best case: Third. Worst case: Eighth. Look at that: Damien Hardwick has the Suns eyeing their maiden finals campaign. Credit: Getty Images Hawthorn What we say: It didn’t feel right a fortnight ago that our ladder predictor had the Hawks missing September, but that’s now a distinct possibility, their hopes also hurt by a season-ending injury to Will Day. A strong start against the Crows was wasted, and now comes a must-win clash against Collingwood on Thursday night. Lose, and the round-24 trip to Brisbane – and percentage – may decide all. Best case: Fourth. Worst case: Ninth.\n\nHawthorn’s Nick Watson is with a four-legged friend here, but it’s the Western Bulldogs who could usurp the Hawks in the top eight. Credit: The Age GWS What we say: The Giants are suddenly a worry. That was a shocker against the Bulldogs, even if Toby Greene, Jack Buckley and Josh Kelly were absent. While it’s hard to have too much of a crack, for the Giants had won their previous six games, they could yet miss the top eight – on percentage – even if they win two of their last three games. An upset win over Gold Coast in round 23 would solve their problems. Best case: Fourth. Worst case: Ninth. Western Bulldogs\n\nWhat we say: The Dogs claimed just their second top-eight scalp of the season on Thursday, thumping the Giants in a pivotal clash. Their avenue to September now opens up, for the Demons and Eagles should be easy kills. Then comes a juicy final-round clash with the Dockers, which could determine – believe it or not – whether they even slip into the top four. The Dogs are all-in on attack and, in Aaron Naughton and Sam Darcy, have arguably the in-form, one-two key forward punch in the league. If they continue to fire, watch out. Best case: Third. Worst case: Ninth. Predicted ladder When we completed our first ladder prediction after round 19, we had Hawthorn missing the finals by a game. That was largely based on tipping the Magpies over the Hawks this Thursday, but we have now – albeit cautiously – switched that tip. In another change, we now have Fremantle edging Port Adelaide this weekend. The Suns’ good form, in particular their win over Brisbane, means they could now finish with eight more premiership points than expected – and the double chance. Here is the original prediction.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/business/the-economy/welcome-to-donald-trump-s-dystopian-world-20250804-p5mk2i.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Welcome to Donald Trump’s dystopian world",
        "publish_date": "Mon, 04 Aug 2025 12:00:19 +1000",
        "category": "finance",
        "authors": [
            "Stephen Bartholomeusz"
        ],
        "text": "Most non-political observers would agree wholeheartedly, but removing the head of an independent and non-partisan agency and replacing them with someone acceptable to Trump would raise suspicions that the data could be manipulated for political purposes. McEntarfer may not be the only head of a data collection agency in the firing line. Shoppers in SoHo, New York, last week. The US economy is doing well despite higher interest rates. Credit: Bloomberg Trump’s feud with the Fed’s chair, Jerome Powell and his frustration at his inability to sack him and replace him with someone who will lower US interest rates is a long-running saga. When Powell’s term as chair expires next May he will be replaced by someone more amenable to Trump’s desires, risking the politicisation of the central bank’s decisions. Last week’s inflation data, also produced by the BLS, showed goods inflation is rising. Is that, too, now discredited?\n\nUS Bureau of Labor Statistics head Erika McEntarfer lost her job after her department produced numbers the president didn’t like. Credit: US Bureau of Labor Statistics The US Bureau of Economic Analysis produced the data that last week showed the US economy grew at a meagre 1.25 per cent in the first half of this year, down from the 2.3 per cent growth generated in the same half of last year. Is the leadership of that agency now under threat? There’s a quote in George Orwell’s 1984 that seems appropriate. “The Party told you to reject the evidence of your eyes and ears. It was their final, most essential command.” Despite what Trump and the propagandists in the administration might claim, Trump’s trade and immigration policies and his DOGE-led assault on the federal bureaucracy aren’t producing an economic boom. The evidence increasingly says otherwise.\n\nHis policies are doing exactly what most neutral observers said they would, even if their impacts are only just starting to emerge because of the messy way they have been implemented. The delayed April 2 “Liberation Day” tariffs, or at least some of them, have been introduced in phases, the most impactful of them only last week. They will progressively show up more clearly in the data – if they are allowed to. Even their initial announcement appears to have frozen business hirings and investment, as you’d expect when businesses have no idea what their cost of goods will be as the tariffs flow through to domestic suppliers. Tariffs raise prices and reduce supply and sales – that’s what they are designed to do. The BLS data showed job losses were concentrated in the areas most exposed to Trump’s trade policies, his job shedding in federal bureaucracies and his immigration policies, offset by additions of roles in the education and healthcare sectors that are less affected by changes in economic conditions.\n\nMore jobs will be lost in October, when the tens of thousands of government employees who took up DOGE’s offer of “voluntary” buyouts enter the statistics. The numbers are likely to get worse as the impact of the policies shows up more clearly. The Yale Budget Lab pits the effective average rate of Trump’s tariffs, so far at 18.4 per cent, compared with about 2.5 per cent before Trump regained office. That’s the highest rate since 1933 and will, Yale’s economists say, push up US prices by 1.8 per cent initially, lower US GDP growth by half a percentage point and increase the unemployment rate by 0.4 percentage points this year and 0.7 percentage points by the end of next year. None of that is surprising. The tariffs are already raising substantial amounts of revenue – revenue from customs duties jumped from about $US78 billion in July last year to $US152 billion last month – and there are estimates that tariff-related revenues will, if the tariffs remain in place, generate more than $US2 trillion over the next decade.\n\nThat revenue is a new tax on US consumption, paid for by either the US importer, their corporate customers or consumers, most likely a mix of all of them. It’s been described as the biggest tax hike in US history, so of course it will have an impact on economic growth and employment. Loading Already, some of America’s largest companies – its auto companies and consumer products companies – are saying they are experiencing multibillion-dollar cost increases from the tariffs, and planning billion dollar cost cuts in response. Those cuts will inevitably involve jobs. Manufacturing is supposed to benefit from Trump’s tariffs, indeed he has said the tariffs are designed to make the American manufacturing sector great again. The latest purchasing managers’ index – also released last week – shows US manufacturing activity contracted in July. Perversely, the gloom just starting to cloud the US economy, an economy that had the strongest growth of any developed economy before Trump took office, might convince the Fed to do what Trump has demanded for months that it should do and lower its policy rate next month.\n\nThe Fed has a dual mandate. It is charged with maximising employment while maintaining price stability. The jobs data signals that labour market is deteriorating rapidly and is likely to shrink further. The numbers are likely to get worse as the impact of the policies shows up more clearly. The tariffs, however, are pushing up an inflation rate that, even before they were in place, was already materially above the Fed’s target of 2 per cent. Its preferred measure, the core personal consumption expenditures index, has been creeping up and, according to data released last week, was running at 2.8 per cent in June. The Fed knows that number will continue to rise, and may or may not be transitory, which will create a dilemma. It may have to decide which element of its mandate it should prioritise.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/nsw/sydney-nurse-suspended-for-alleged-touching-of-underage-patient-20250802-p5mjtd.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Sydney nurse suspended for alleged touching of underage patient",
        "publish_date": "Mon, 04 Aug 2025 11:58:22 +1000",
        "category": "finance",
        "authors": [
            "Kayla Olaya"
        ],
        "text": "A nurse employed at a Sydney children’s hospital has been suspended from the medical profession by the NSW Civil and Administrative Tribunal after he was accused of sexually touching a 16-year-old patient without consent under his care.\n\nNathan Kai Wei Pang had his registration suspended for three months for professional misconduct towards the adolescent boy, including allegedly inappropriately touching his genitals, speaking in a sexualised manner and making false statements about the incidents to his employer.\n\nPang will be able to work with children again after his suspension if he completes the education requirements laid out by the Nursing and Midwifery Council of NSW, including ethics, consent and record-keeping training.\n\nThe Sydney nurse has been suspended for three months. Credit: Michael O’Sullivan\n\nThe boy was recovering from surgery that involved a catheter in his groin, and needed check-ups to ensure it was healing properly.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/property/news/two-young-fellas-team-up-to-buy-1-4m-kogarah-townhouse-20250804-p5mk2a.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘Two young fellas’ team up to buy $1.4m Kogarah townhouse",
        "publish_date": "Mon, 04 Aug 2025 11:53:43 +1000",
        "category": "finance",
        "authors": [
            "Sarah Webb"
        ],
        "text": "While the home still had original carpet and needed cosmetic updates, Flevaris said the location was the main drawcard – though even he was shocked by the result. “The owners are just beautiful people. They’ve already moved to Queensland but couldn’t believe it. I still don’t think they’ve realised what happened,” he said. “They were happy at $1.05 million. The reserve was originally $1.025 million, and they hesitated when we wanted to raise it. “But if you’d asked me if it would sell for $1.4 million, I wouldn’t have bet on it either.\n\n“This tells me the market is strong, there’s not enough quality stock, and there’s a lot of urgency out there.” The house was among 704 scheduled auctions across Sydney last week. By Saturday evening, Domain recorded a preliminary clearance rate of 73.4 per cent from 455 reported results, with 59 auctions withdrawn. Withdrawn auctions are counted as unsold when calculating clearance rates. In Northbridge, a local dad forked out $3.62 million for a “knockdown-rebuild” brick home for his daughter, outmuscling developers and paying more than $600,000 above the reserve. Built almost a century ago, the original home at 255 Sailors Bay Road had remained in the same family while occupying a flat 461.6 square metre block.\n\nThe three-bedroom, two-bathroom home had a price guide of $2.7 million to $2.8 million and a reserve of $3 million. In near-original condition, it had a solid double-brick construction, rear lane access, and no heritage or conservation restrictions. There is no legal requirement for a vendor’s reserve to be in line with their property’s price guide. Loading Bidding opened at $2.5 million, with 10 of the 27 registered parties raising their paddles. Increments of $50,000 and $25,000 pushed the price to $3 million, followed by $10,000 and $20,000 bids to $3.3 million. The final stretch – between four bidders – played out in $5000 rises. Auctioneer Michael Garofolo,of Cooley Auctions said at least 100 people turned out, undeterred by heavy rain and howling wind. “The house was in a fantastic location and it was essentially a knockdown rebuild – and that’s what attracted such a strong result,” he said.\n\n“It wasn’t heritage listed, had no issues from council, and has rear lane access while being close to the shopping village and CBD.” Loading Co-selling agent Irving Gunawan of Irving G Property said the home attracted developers, renovators, local families and investors. “But in the end, it was the Northbridge family who purchased it for their daughter,” he said. “It was a fantastic auction … there was a sale a few doors down at 239 Sailors Bay which sold for $3.3 million in November last year. That property was a four-bedroom home and was updated, whereas ours was in original condition and two bedrooms plus a study or optional third bedroom.”\n\nIn Padstow, a builder paid $2.21 million for a dated cottage he plans to transform into luxury duplexes – above the reserve by $360,000. The four-bedroom home, at 7 Barkl Avenue, sits on a 702 square metre block with a 15.24 metre frontage. It was initially guided at $1.7 million and had a reserve of $1.85 million. The property attracted strong interest from builders, developers and investors, with 17 parties registering and eight raising their paddles. Bidding opened at $1.6 million and leapt straight to $1.75 million, followed by two more $100,000 rises. At the $2.1 million mark, two remained – the builder and an investor – who traded $25,000 and $50,000 increments.\n\n“They both really wanted it and they both loved the position and location,” said selling agent Abir Eddine of Ray White Revesby. “The buyer now plans to lease it out for the next two to three years before building the duplexes.” Eddine expected strong interest given the home’s size and potential, but said the final price exceeded expectations. “We hoped the competition would drive the auction to $2 million … but it seems the mix of everything, including the expected interest rate drops, is making people want to secure something soon,” she said. “The vendors have had this one for about 25 years, and they were shocked when it hit $1.9 million.”",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/the-new-financial-battleground-for-divorcing-couples-20250723-p5mh7s.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "The new financial battleground for divorcing couples",
        "publish_date": "Mon, 04 Aug 2025 11:45:00 +1000",
        "category": "finance",
        "authors": [
            "Michaela Whitbourn"
        ],
        "text": "In a 2013 case involving a wealthy couple and millions of frequent flyer points, a husband was ordered to transfer 1 million points to his wife. Family law expert Jodylee Bartal, a partner at Schetzer Papaleo Family Lawyers, said it was important to note that, “unlike other assets, points don’t gain value over time – they are vulnerable to devaluation, expiry, and policy changes”. “The value of accumulated points can depend on how and when they are used. Strategic redemption, such as during a ‘points promotion’, can ‘buy’ more. Put another way, points rarely have a set dollar-per-point conversion,” Bartal said. Cryptocurrency Sergi said cryptocurrency and NFTs (non-fungible tokens) were growing in popularity among “a younger cohort”, and this was the biggest growth area in digital assets in family law matters.\n\nBut she said that “actually finding [those assets]” was often a major issue. It was common in family law disputes “for people to try and … hide assets that are not obvious”, she said, despite their legal obligation to provide full and frank disclosure of their financial circumstances. “It’s often a bit of a forensic exercise in making sure we’ve captured everything,” Sergi said. A person might withdraw cash and deposit it at a crypto ATM, for example, but it might be difficult for a lawyer acting for the person’s former partner to obtain records showing that transaction. ‘It can sometimes be an easy way [for a person] to potentially hide money.’ Family law specialist Josephine Sergi “There’s no central register, so finding those assets when they are not disclosed can be really hard,” she said.\n\nSergi had acted for the wife in a matter in which her client had only become aware her husband had cryptocurrency because she “spotted him at one of those ATMs ... in Melbourne”. “We would never have known from looking at his bank statements, which only included cash withdrawals. It can sometimes be an easy way [for a person] to potentially hide money if you’re not asking the right questions or taking a forensic approach to documents which are disclosed,” she said. Loading In one Federal Circuit and Family Court case in 2023, a wife alleged her husband had invested some $35,000 in cryptocurrency. He said he had invested, and lost, $13,000. There was insufficient evidence before the court to make a finding. “On the basis of this conflicted evidence, I will not include any sum referable to cryptocurrency in the parties’ pool of assets,” Judge Stewart Brown said in his decision.\n\nJodylee Bartal said family lawyers “need to constantly upskill to keep up with changes to the definition and treatment of ‘property’,” which now included digital assets. “The Family Law Act ... allows for the division of ‘property’ between separated couples. [It] does not specifically mention digital assets including ... cryptocurrency, but it is generally treated as a form of property,” she said. ‘PROPERTY’ IN FAMILY FEUDS The Family Law Act allows for the division of ‘property’ between separating couples.\n\nUnder changes to the law this year, companion animals are now a separate category of property.\n\nDigital assets including rewards points and cryptocurrency are also treated as property. “Unlike traditional bank accounts, which can be readily traced to the owner, cryptocurrency ownership is anonymised,” she said. Forensic accountants could “help trace transactions and uncover hidden digital assets”. Bartal pointed to a range of “practical challenges” relating to digital assets, such as market volatility.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/nsw/it-may-be-a-380k-cash-cow-but-is-sydney-s-biggest-billboard-also-an-eyesore-20250801-p5mjno.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "It may be a $380k cash cow. But is Sydney’s biggest billboard also an eyesore?",
        "publish_date": "Mon, 04 Aug 2025 11:42:00 +1000",
        "category": "finance",
        "authors": [
            "David Barwell"
        ],
        "text": "Sydney’s biggest billboard could continue to feature on the city skyline for three more years as part of a deal that might earn Inner West Council more than $300,000 in revenue from a major advertising company.\n\nEye Drive Sydney, a subsidiary of outdoor advertiser oOh!media, is seeking approval from the NSW government to extend the life of the 170 metre-long billboard on the Glebe Island silos, overlooking Anzac Bridge.\n\nThousands of motorists on Anzac Bridge in Sydney’s inner west pass the advertisements each day. Credit: Louie Douvis\n\nThe billboard – which thousands of motorists pass each day – was erected in the 1990s as a temporary structure to promote the Sydney Olympics. However, over the years, rolling extensions have kept it in place.\n\nNow Eye Drive Sydney has applied to the Planning Department to continue operating the billboard for another three years, saying an extension will “reinforce the landmark quality of the silos structure”.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/traveller/travel-news/beyond-tours-intrepid-travel-is-now-opening-its-own-hotels-and-resorts-20250804-p5mk29.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Beyond tours, Intrepid Travel is now opening its own hotels and resorts",
        "publish_date": "Mon, 04 Aug 2025 11:34:41 +1000",
        "category": "finance",
        "authors": [
            "Julietta Jameson"
        ],
        "text": "It used to be one of those unwritten laws in travel – accommodation companies did accommodation, tour companies did tours.\n\nIntrepid’s Daintree Ecolodge. Credit:\n\nThat was before tour operators broke the mould with expansion into river and small ship cruising, a common synergy these days.\n\nOne shining exception is Abercrombie & Kent, with its A&K Sanctuary division, comprising 15 African safari camps, lodges and five Nile riverboats with plans for further expansion internationally.\n\nAustralia’s famous tour company Intrepid Travel has also made a splash into the accommodation market, recently buying a resort in Tasmania and a riad in Morocco.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/nrl/wests-tigers-players-abuses-bulldogs-fans-20250804-p5mk4u.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Wests Tigers players abuses Bulldogs' fans",
        "publish_date": "Mon, 04 Aug 2025 11:23:43 +1000",
        "category": "sports",
        "authors": [],
        "text": "Wests Tigers players abuses Bulldogs' fans\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/interview-this-is-the-medicine-songwriter-kalani-artis-on-how-a-music-program-changed-his-life/u80immrjf",
        "title": "INTERVIEW: 'This is the medicine': Songwriter Kalani Artis on how a music program changed his life",
        "publish_date": "Sun, 3 Aug 2025 21:00:00 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/tour-de-france-femmes-gigantes-heartbreak-as-ferrand-prevot-seals-historic-victory/qx09ckgvi",
        "title": "Tour de France Femmes: Gigante's heartbreak as Ferrand-Prevot seals historic victory",
        "publish_date": "Sun, 3 Aug 2025 20:55:38 +0000",
        "category": "sports",
        "authors": [],
        "text": "Australia's Sarah Gigante was forced to settle for sixth place in the women's Tour de France as Pauline Ferrand-Prévot claimed victory for the hosts.\n\n\n\n\n\nStarting the day second in the general classification, Gigante (AG Insurance - Soudal Team) lost ground on the Joux-Plane descent and finally finished the stage seventh.\n\n\n\n\n\n\"It was two hours of pain, heartbreak and hope all in one,\" she said at the finish.\n\n\n\n\n\nFerrand-Prévot's victory was never in doubt, and she launched an attack to clinch the final stage and increase her overnight lead.\n\n\n\n\n\nThe 33-year-old had put herself largely in control by winning Saturday's eighth and penultimate stage with an audacious solo breakaway on the last climb. That gave her an overnight lead of 2:37 seconds over Gigante and 3:18 over Demi Vollering.\n\n\n\nSunday's ninth stage from Praz-sur-Arly to Chatel was a 124km trek featuring three big mountain climbs.\n\n\n\n\n\nBut Ferrand-Prévot did not face any big attacks and instead launched one of her own with 6km left.\n\n\n\n\n\nThe crowds cheered her all the way to the finish line and, moments later, the tears flowed as she lay on her back, exhausted but elated.\n\n\n\n\n\nVollering was 20 seconds behind in second place and Kasia Niewiadoma followed in third place as they sprinted to the line.\n\n\n\n\n\nEarlier, Ferrand-Prévot was with Gigante, 24, and a few others when they tackled the mammoth climb up Col de Joux Plane — an 11.6km grind with a gradient of 8.5 per cent.\n\n\n\nGigante is known to have trouble descending at speed and was dropped on the long downhill. She could not make up the time, especially with no teammates to help her, and lost her podium spot, finishing sixth overall, 6 minutes and 40 seconds behind the winner.\n\n\n\n\n\n\"It was a super hard day, I was already feeling not so strong physically going up the Joux Plane,\" she said at the finish.\n\n\n\n\n\n\"I was hoping to get away and have a head start before the downhill, but I was pretty much getting dropped by the top.\n\n\n\n\n\n\"And then of course the descent was just so hard. It was a long day out.\"\n\n\n\nThe other Australians to complete the Tour de France Femmes were Neve Bradbury (71st), Lauretta Hanson (75th), Ruby Roseman-Gannon (78th) and Emily Watts (114th).\n\n\n\n\n\nHaving won Olympic gold in mountain biking and conquered the cobblestones of the Paris-Roubaix classic, Ferrand-Prévot added another line to her glittering CV with a Tour victory.\n\n\n\n\n\nThe place to watch the 2025 Tour de France — live, free and exclusive — plus the fourth edition of the Tour de France Femmes avec Zwift is right here on the SBS On Demand Hub .\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/interview-why-dont-people-speak-up-against-racism/jorde1tcq",
        "title": "INTERVIEW: Why don't people speak up against racism?",
        "publish_date": "Sat, 2 Aug 2025 22:00:00 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/tour-de-france-stage-eight-australias-gigante-surges-into-second-place/gcvbzyfrd",
        "title": "Tour de France Femmes: Australia's Gigante surges into second place in shake-up",
        "publish_date": "Sat, 2 Aug 2025 21:37:48 +0000",
        "category": "sports",
        "authors": [],
        "text": "French rider Pauline Ferrand-Prevot took a commanding lead at the Tour de France Femmes after launching a solo victory on the final climb of Sunday AEST's penultimate stage.\n\n\n\n\n\nBut Australian rider Sarah Gigante surged into second place, two minutes and 37 seconds behind, on a day of big changes in the leading positions.\n\n\n\n\n\nThe 2023 champion, Demi Vollering of the Netherlands, is 3:18 adrift heading into Monday's last stage.\n\n\n\n\n\nOvernight leader Kimberley Le Court Pienaar — Gigante's AG Insurance-Soudal teammmate — crashed on the descent from the Col du Frene with 63 kilometres remaining, briefly trailing the peloton by about a minute.\n\n\n\n\n\nShe rejoined, but the effort and the relentless climbing cost her in the general classification as she dropped to 11th place.\n\n\n\nLast year's event had the smallest winning margin in the history of the women's and men's races, but Ferrand-Prevot — who won the mountain bike gold medal at last year's Paris Olympics — appears to be winning far more comfortably, despite Gigante's efforts.\n\n\n\n\n\nThe Frenchwoman trailed Le Court by 26 seconds heading into stage eight from Chambery to Saint-François-Longchamp, which took the riders on a 112-kilometre trek into the mountains.\n\n\n\n\n\nIt featured an early climb of 13 kilometres up Col de Plainpalais before finishing with an ascent of 18.6 kilometres to Col de Madeleine, one of the most famed climbs in cycling.\n\n\n\nGigante went on the offensive with 12 kilometres to go, and only Ferrand-Prevot of the GC favourites was able to stay with her on the climb.\n\n\n\n\n\nThe Olympic champion then attacked at the start of the final nine kilometres and Gigante was unable to keep up with her.\n\n\n\n\n\nThe Frenchwoman hit the front seven kilometres from the summit and powered to a superb victory.\n\n\n\n\n\nGigante crossed the line 1:45 behind her, while Niamh Fisher-Black rolled in 2:15 behind in third spot. Vollering was fourth.\n\n\n\nThe 24-year-old Melburnian had joked on Saturday night, at the end of the seventh stage, that some of the big names had \"missed a couple of opportunities\" to shake her off.\n\n\n\n\n\n\"They could have got rid of me yesterday, maybe Kim today. We'll see what happens, but from our point of view, hopefully they live to regret it.\"\n\n\n\n\n\nMonday's ninth and final stage from Praz-sur-Arly to Chatel is another mountainous route, with three big climbs, and is even longer at 124 kilometres.\n\n\n\n\n\nFor the latest from SBS News, download our app and subscribe to our newsletter .\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/guiding-indigenous-students-to-careers-in-science-and-technology/0v0c9mwvq",
        "title": "Guiding Indigenous students to careers in science and technology",
        "publish_date": "Sat, 2 Aug 2025 21:00:00 +0000",
        "category": "finance",
        "authors": [],
        "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\n\"This has opened my eyes, I think there are a lot of opportunities through STEM and I might try them.\"\n\n\n\n\n\nThat's Akia, a 16-year-old student from an Aboriginal high school who has spent three days problem-solving, prototyping tech, and learning about the spectrum of jobs that exist across healthcare.\n\n\n\n\n\n\"My app I choose is called the Magical Mangarrayi country, it's for back home. So when you go swimming in the tourist attraction places, there will be a little QR code that you can scan. And when you scan it it shows you the history of Mangarrayi country and all about Mataranka photos and fishing places and shops and yeah.\"\n\n\n\n\n\nShe talks about her app design - from planning to detailing it out on the computer.\n\n\n\n\n\nIt comes as Monash Health, Victoria’s largest health service and Indigenous-owned and managed non-for-profit organisation, Deadly Coders are helping introduce First Nations students to career pathways in Science, Technology, Engineering or Maths.\n\n\n\n\n\nDan Carter is the Chief Aboriginal Health Adviser at Monash Health.\n\n\n\n\n\n\"This is really to expose Aboriginal and Torres Strait kids in school to STEM science, technology, engineering, math career pathways, and as a large health service that does have many STEM careers across engineering and other areas, we thought this was a really good fit for expanding on our Aboriginal workforce, that we have real targets in place to really try and recruit and engage with more.\"\n\n\n\n\n\nMonash Health also has a well-established program for the recruitment of Aboriginal and Torres Strait Islander nurses, midwives, and allied health workers.\n\n\n\n\n\nMr Carter told SBS News how they have created an opportunity to help build the future workforce and broaden the roles filled by Indigenous Australians.\n\n\n\n\n\n\"We have an Aboriginal employment plan at Monash Health that looks at the recruitment and retention of Aboriginal Torres Strait Islander staff and career development as well. And so we do a pretty good job at the traditional career areas of medicine, doctors, nurses, and allied health. And we thought how do we expand upon that to engage in some of those careers in the STEM place across the spectrum of careers and health.\"\n\n\n\n\n\nThey were approached by Deadly Coders to run a small mini hackathon event to engage local school kids in the area, as they invest resources into digital health.\n\n\n\n\n\n\"Digital Health is really the information and communication structure systems that sit behind our health services that really support us to deliver or tackle health problems and then support us to deliver health solutions in, I guess, delivery of healthcare to improve health outcomes.\"\n\n\n\n\n\nDeadly Coders ran the App Prototyping Program at Melbourne's Moorabbin Hospital, with a focus on digital health.\n\n\n\n\n\nThe Australian Institute of Health and Welfare defines digital health as systems, tools and services based on information and communications technology that can be used to treat patients and collect and share a patient’s health information.\n\n\n\n\n\nAndrew Brodie is the Co-Founder and General Manager Deadly Coders, that more broadly delivers STEM education.\n\n\n\n\n\n\"That might be a face-to-face STEM program at a school for children in Year Two. And in that case, the programs would be designed to be gamified, hands on story based, pedagogically aligned to how indigenous kids learn best and they're really designed to get kids interested in something and bring down barriers.\"\n\n\n\n\n\nHe says they move from there into more formal programs with high school students where they may be teaching text-based coding languages, problem solving with technology, building robots, or learning how to build a website.\n\n\n\n\n\nThe Indigenous-run not-for-profit's aim is to build interest, excitement and curiosity in STEM through hands-on activities and gamified learning.\n\n\n\n\n\n\"We also have an online learning platform, so that online learning platform has valuable content on there. Things like digital literacy, financial literacy, coding tutorials. That particular platform is I think the only platform. It's kind designed by indigenous educators and tech experts and specifically for indigenous students.\"\n\n\n\n\n\nHe adds that if students can learn to link fundamental skills in A-I [[artificial intelligence]] with something in the real world, that's what they want to achieve by building that engagement amongst students.\n\n\n\n\n\nThey also run the Deadly Coders Academy - a job skilling program designed to create alternative pathways into the tech sector through upskilling rather than formal qualifications.\n\n\n\n\n\n\"The students essentially will have some time learning about a design thinking framework. So essentially at big businesses, how to tech groups within those big businesses work together to solve problems. Once the students have a bit of a grounding in that design thinking framework, they will then get access to and a bit of a 101 crash course in how to use an app prototyping software.\"\n\n\n\n\n\nHe says at the end of the three days, the students in their group will get an opportunity to pitch what they've built back to Monash Health and he hopes a panel of people there will be able to decide which app solves the problem the best.\n\n\n\n\n\nAkeima is a 14-year-old from the Katherine community.\n\n\n\n\n\nIn the three-days, she created a Mindset app for people struggling in school.\n\n\n\n\n\n\"On the second day we wrote it down and we started planning it. And at the end of the day we brought out our computers and started making our account to put it in, and the third day we just finishing up our apps with classical coding.\"\n\n\n\n\n\nShe says it was inspiring to hear from the speakers from Monash Health at the event.\n\n\n\n\n\n\"It was kind of inspiring cause it made me thought probably in my course I would have helped out with hospitals or something like that. It was really good of hearing of how they were going with their life.\"\n\n\n\n\n\nDan Carter says the students enjoy tackling digital solutions in a health setting.\n\n\n\n\n\n\"The kids have just really just enjoyed engaging with a bit of a fun program to tackle digital solutions to digital problems in a health setting. So this has more been about engaging the students at a high school level.\"\n\n\n\n\n\nDeadly Coders have been around since mid 2023. Andrew Brodie says they are growing quickly and have space for up to 30 students in their program.\n\n\n\n\n\n\"We always have some students that just take to technology like a duck to water, and it's really nice watching young people who just, something clicks for them and they get it and they get really interested in it, especially when there are kids who may not have seen technology as a pathway that was available to them. So we do get a lot of kids who didn't realise they were interested in technology, it clicks for them and they just love the program and get really interested after that.\"\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/reaction-to-victorian-premier-jacinta-allan-new-work-from-home-plan/jl6rx3tel",
        "title": "A 'really important initiative' or 'complete overreach': New WFH plan draws mixed reactions",
        "publish_date": "Sat, 2 Aug 2025 10:34:34 +0000",
        "category": "finance",
        "authors": [],
        "text": "With new Australian-first rules suggested, working from home might soon be a legal right for Victorians.\n\n\n\n\n\nPremier Jacinta Allan announced on Thursday that she would introduce legislation in 2026 legally enshrining the right to work from home for two days a week.\n\n\n\n\n\nAllan said she expected the plan to face some criticism but said many Victorians stood to benefit from the changes, which will cover all employees who can \"reasonably\" do their job from home.\n\n\n\n\n\n\"Bosses who think being seen at a desk is more important than a parent getting home for dinner with their kids, if they want to look their workers in the eye and tell them their time with their families doesn't count, they know where my government stands,\" Allan said.\n\n\n\n\n\n\"We won't stand by while workers — especially women, single mums, carers — get punished for needing balance in their lives.\"\n\n\n\nREAD MORE The male breadwinner is gone. Why working from home is necessary for modern families\n\nDetails are yet to be worked through but Allan signalled the changes could come into effect under Victoria's Equal Opportunity Act, as private workplaces are regulated by federal laws.\n\n\n\n\n\nIssues such as the definition of remote work, who can do it, how it would affect part-time workers and the types of businesses to which the law would apply, will be figured out through a consultation process.\n\n\n\n'Complete overreach'\n\nPeak business bodies have criticised the plan, with Committee for Melbourne CEO Scott Veenker calling it a \"complete overreach\".\n\n\n\n\n\n\"It's another regulatory burden or requirement that just makes the cost of doing business too hard,\" he said, adding that his group \"hadn't been consulted with prior to the announcement\".\n\n\n\n\n\n\"The reality is that we want to actually have an environment where businesses can thrive and flourish, and they don't need more regulation and more legislation to prevent them [from] doing that.\"\n\n\n\n\n\nVeenker said the state government's new plan will make \"members both small and large\" of the business advocacy group ask if they should \"continue trading in Victoria\".\n\n\n\n\"We know that businesses will move their staff and their resources accordingly, and we don't want Victoria to be seen as a place that's too hard to do business,\" he said.\n\n\n\n\n\n\"They should be arrangements that are really done in conjunction with staff and the employers, rather than the state government trying to put their nose into this.\n\n\n\n\n\n\"We want the state government to be looking at how we should be focusing on economic growth and enabling businesses to prosper.\"\n\n\n\n\n\nThe Committee for Melbourne, which merged with the Melbourne Chamber of Commerce in 2024, describes itself as being founded \"to champion key initiatives to stimulate the economy and civic development, which put Melbourne on a pathway to become one of the world’s most liveable cities\".\n\n\n\n'A really good initiative'\n\nHowever, several people SBS News talked to on the streets of Melbourne said they supported the proposal.\n\n\n\n\n\nOne young woman said it was \"a really good initiative\".\n\n\n\n\n\n\"I think working from home allows people to have a bit more of better work-lifestyle balance, therefore making them happy — happy to be at work when it is time to be at work, [and] happy to be at home,\" she said.\n\n\n\nAnother woman SBS News spoke to said the ability to work from home \"just makes life so much easier\". Source: SBS News A middle-aged man said he currently had an arrangement to work one day a fortnight at home and would \"certainly be keen for that to be made a legal thing to do more\".\n\n\n\n\n\nA young man who works from home said: \"going to [the] office necessarily doesn't mean full productivity, so that's something people have to consider,\" he said.\n\n\n\n\n\nSeveral experts recently told SBS News that working from home breaks down barriers to gender equality in the workplace and is necessary for modern families, especially those who face significant commutes to work.\n\n\n\nLISTEN TO New research shows just how much money people working from home save SBS News 03:56 English\n\nMore than one in three Australian employees typically work from home, but that figure rises to 60 per cent among managers and those in professional services, according to the Australian Bureau of Statistics (ABS).\n\n\n\n\n\nThe ABS also says 43 per cent of those who work from home do overtime, compared to one quarter of those who do not.\n\n\n\nState Opposition signals possible support\n\nAllan — whose announcement coincided with the Victorian Labor Party meeting for its annual conference — has promised to introduce the law in 2026, prior to the state election.\n\n\n\n\n\nPolls indicate Labor is on track to win a fourth term but the November 2026 poll will be the first as premier for Allan, who lags Opposition leader Brad Battin as preferred state leader.\n\n\n\n\n\nOn Saturday, Battin indicated he might support the proposal.\n\n\n\n\n\n\"We support measures that help Victorians enjoy a better work-life balance, and will review any legislation closely, to ensure it supports flexibility, productivity and personal choice,\" he said.\n\n\n\nThe federal Opposition's proposal to eliminate remote work for public servants was partly blamed for its poor performance in the May federal election, even though it abandoned the policy before voting day.\n\n\n\n\n\nDuring the campaign, former Opposition leader Peter Dutton apologised after admitting that the proposal to end work-from-home arrangements for public servants was a \"mistake\".\n\n\n\n\n\nThe plan was immediately framed by Labor and Greens parliamentarians as being a regressive move for women's working rights.\n\n\n\n\n\nIt was also criticised as being inspired by the policies of United States President Donald Trump. One of Trump's first policies after being elected for a second term was to order all government workers to return to the office.\n\n\n\n\n\n— With additional reporting from the Australian Associated Press\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.theage.com.au/goodfood/melbourne-eating-out/an-alice-in-wonderland-inspired-cocktail-bar-that-s-all-about-the-theatrics-20250804-p5mk59.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "An Alice in Wonderland-inspired cocktail bar that’s all about the theatrics",
        "publish_date": "Mon, 04 Aug 2025 12:33:00 +1000",
        "category": "finance",
        "authors": [
            "Tomas Telegramma"
        ],
        "text": "Add articles to your saved list and come back to them anytime.\n\nSave this article for later\n\nRemove items from your saved list to add more.\n\nYou have reached your maximum number of saved items.\n\nCurious, at the base of the W Hotel, has a new cocktail menu designed by UK mixologist Matt Whiley.\n\n1 / 7 Curious’s new cocktail menu is designed by UK mixologist Matt Whiley. Supplied 2 / 7 Inside the Alice in Wonderland-inspired bar. Supplied 3 / 7 The Cryocone cocktail: bourbon, smoky bacon vodka and maple raisin ice cream. Supplied 4 / 7 Cocktails are as theatrical as the space itself. Supplied 5 / 7 The “tropical sand storm” cocktail features an edible sand rim. Supplied 6 / 7 The Pyro-Flora cocktail featuring smoked vodka, burnt pear, lemon myrtle and strawberry gum soda, served in a bowl of smoked leaves. Supplied 7 / 7 The Red Earth cocktail is a desert-inspired margarita with honey pearls. Supplied Previous Slide Next Slide\n\nContemporary$$$$\n\nIt was loosely inspired by Alice in Wonderland, so the fact that there’s a lot going on at the W’s underground cocktail bar is kind of the point. An undulating ceiling of big timber beams emulates the rabbit hole, which the door person will whisk you down through a voluptuous velvet curtain.\n\nIf you want to soak up the surrounds, there’s a good vibe to bunker down for a midweek cocktail. But to find Curious at its most chock-a-block, book a table for Friday or Saturday night and watch as it gets boisterous, edging into club territory, with tables splurging on champagne magnums. Those after a quiet weekend nightcap won’t find it here.\n\nCocktails are as theatrical as the space (peppermint air, anyone?) and play on Melbourne’s stereotypical north-south rivalry (will it be one inspired by the Fitzroy Garage Party or the lavender-laden Too Right It’s Toorak?).",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/traveller/reviews-and-advice/when-people-say-cruises-are-all-same-same-i-counter-with-this-20250618-p5m8an.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "When people say cruises are all same-same, I counter with this",
        "publish_date": "Mon, 04 Aug 2025 12:16:18 +1000",
        "category": "finance",
        "authors": [
            "Brian Johnston"
        ],
        "text": "I’ve done a lot of cruising, but that doesn’t stop people who are keen to tell me that it’s a cookie-cutter experience they’d never consider.\n\nThat’s like saying you’d never stay in a hotel because they all occupy big bland buildings with identical rooms. Yes, international chains are familiar, but I don’t think anyone assumes there aren’t quirky national chains or family-owned boutique hotels out there.\n\nLikewise, cruise lines come in all varieties and, if you look beyond the regular horizon, you’ll find myriad companies, one of which will surely suit even the pickiest person. There are too many to cover here, but this small sampling might whet your appetite.\n\nStar Clipper under full sail.\n\nIf you want to sail the truly authentic way, then Star Clippers operates three of the world’s largest and tallest sailing vessels in the Caribbean, Pacific coast of Central America and Mediterranean. Its ships aren’t luxurious but you get a genuine sailing experience. Many guests are yachties, but even landlubbers will be thrilled at the billowing sails and creaking ropes.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/afl/cold-pies-and-a-giant-headache-who-will-make-the-finals-in-the-race-for-the-top-eight-20250804-p5mk2m.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Cold Pies and a Giant headache: Who will make the finals in the race for the top eight?",
        "publish_date": "Mon, 04 Aug 2025 12:09:05 +1000",
        "category": "sports",
        "authors": [
            "Jon Pierik"
        ],
        "text": "What we say: In what has largely been a humdrum race for the finals, the Magpies’ woes have piqued interest. They appeared a lock for a top-two finish, if not top spot, a month ago. At that point they were 10 premiership points clear at the top. But three defeats from their past four games have sparked concerns about Collingwood wobbling. Smashed in clearances at key stages in a worrying loss to the Lions, and missing Jeremy Howe, the Magpies had their worst performance since opening round. They now have an intimidating fortnight ahead and could slip to fifth. Best case: First. Worst case: Fifth. Major impact: Jeremy Cameron (left) and Lachie Neale have keys roles to play for the Cats and Lions, respectively. Credit: The Age Brisbane Lions\n\nWhat we say: Coach Chris Fagan said he expected his team to rebound after a heavy loss to Gold Coast, and they did just that at the MCG on Saturday night. The Lions should beat Sydney on Saturday and could slip into the top two, but their top-four fate will be decided over the final fortnight of the season with games against fellow premiership contenders. Best case: First. Worst case: Sixth. Geelong What we say: The Magpies’ woes have the Cats ready to pounce on a top-two finish. And their run home could hardly be any friendlier, with all three of their next opponents thinking about next season. Geelong should make this a trifecta of victories, and their top-two hopes will be shaped by the fortunes of the Magpies, Lions and Crows. Secure in the knowledge of at least a top-four finish, they have the luxury of managing their best players, ensuring a healthy list for September. Best case: First. Worst case: Fifth. That’s where September is: Geelong coach Chris Scott with his star onballer Bailey Smith. Credit: AFL Photos\n\nFremantle What we say: The Dockers had to rebound from four goals down at half-time against Carlton to prevail on Sunday, but that’s the type of response they would not have had this time last year. On a four-game tear, they, too, have the double chance within their grasp. We’ll back them in against the Power, but it’s the final fortnight of the season that will tell the tale. Best case: First. Worst case: Ninth. Gold Coast\n\nWhat we say: A top-four finish, possibly even third, is not out of the question for the Suns, who now appear a lock to make their September debut. We have them winning three, if not all, of their remaining four games. If it’s all four, 17 wins could be enough for the double chance. It will be great to see a fresh face in September action. Best case: Third. Worst case: Eighth. Look at that: Damien Hardwick has the Suns eyeing their maiden finals campaign. Credit: Getty Images Hawthorn What we say: It didn’t feel right a fortnight ago that our ladder predictor had the Hawks missing September, but that’s now a distinct possibility, their hopes also hurt by a season-ending injury to Will Day. A strong start against the Crows was wasted, and now comes a must-win clash against Collingwood on Thursday night. Lose, and the round-24 trip to Brisbane – and percentage – may decide all. Best case: Fourth. Worst case: Ninth.\n\nHawthorn’s Nick Watson is with a four-legged friend here, but it’s the Western Bulldogs who could usurp the Hawks in the top eight. Credit: The Age GWS What we say: The Giants are suddenly a worry. That was a shocker against the Bulldogs, even if Toby Greene, Jack Buckley and Josh Kelly were absent. While it’s hard to have too much of a crack, for the Giants had won their previous six games, they could yet miss the top eight – on percentage – even if they win two of their last three games. An upset win over Gold Coast in round 23 would solve their problems. Best case: Fourth. Worst case: Ninth. Western Bulldogs\n\nWhat we say: The Dogs claimed just their second top-eight scalp of the season on Thursday, thumping the Giants in a pivotal clash. Their avenue to September now opens up, for the Demons and Eagles should be easy kills. Then comes a juicy final-round clash with the Dockers, which could determine – believe it or not – whether they even slip into the top four. The Dogs are all-in on attack and, in Aaron Naughton and Sam Darcy, have arguably the in-form, one-two key forward punch in the league. If they continue to fire, watch out. Best case: Third. Worst case: Ninth. Predicted ladder When we completed our first ladder prediction after round 19, we had Hawthorn missing the finals by a game. That was largely based on tipping the Magpies over the Hawks this Thursday, but we have now – albeit cautiously – switched that tip. In another change, we now have Fremantle edging Port Adelaide this weekend. The Suns’ good form, in particular their win over Brisbane, means they could now finish with eight more premiership points than expected – and the double chance. Here is the original prediction.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/business/the-economy/welcome-to-donald-trump-s-dystopian-world-20250804-p5mk2i.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Welcome to Donald Trump’s dystopian world",
        "publish_date": "Mon, 04 Aug 2025 12:00:19 +1000",
        "category": "finance",
        "authors": [
            "Stephen Bartholomeusz"
        ],
        "text": "Most non-political observers would agree wholeheartedly, but removing the head of an independent and non-partisan agency and replacing them with someone acceptable to Trump would raise suspicions that the data could be manipulated for political purposes. McEntarfer may not be the only head of a data collection agency in the firing line. Shoppers in SoHo, New York, last week. Data shows the US economy grew at a meagre 1.25 per cent in the first half of this year. Credit: Bloomberg Trump’s feud with the Fed’s chair, Jerome Powell and his frustration at his inability to sack him and replace him with someone who will lower US interest rates is a long-running saga. When Powell’s term as chair expires next May he will be replaced by someone more amenable to Trump’s desires, risking the politicisation of the central bank’s decisions. Last week’s inflation data, also produced by the BLS, showed goods inflation is rising. Is that, too, now discredited?\n\nUS Bureau of Labor Statistics head Erika McEntarfer lost her job after her department produced numbers the president didn’t like. Credit: US Bureau of Labor Statistics The US Bureau of Economic Analysis produced the data that last week showed the US economy grew at a meagre 1.25 per cent in the first half of this year, down from the 2.3 per cent growth generated in the same half of last year. Is the leadership of that agency now under threat? There’s a quote in George Orwell’s 1984 that seems appropriate. “The Party told you to reject the evidence of your eyes and ears. It was their final, most essential command.” Despite what Trump and the propagandists in the administration might claim, Trump’s trade and immigration policies and his DOGE-led assault on the federal bureaucracy aren’t producing an economic boom. The evidence increasingly says otherwise.\n\nHis policies are doing exactly what most neutral observers said they would, even if their impacts are only just starting to emerge because of the messy way they have been implemented. The delayed April 2 “Liberation Day” tariffs, or at least some of them, have been introduced in phases, the most impactful of them only last week. They will progressively show up more clearly in the data – if they are allowed to. Even their initial announcement appears to have frozen business hirings and investment, as you’d expect when businesses have no idea what their cost of goods will be as the tariffs flow through to domestic suppliers. Tariffs raise prices and reduce supply and sales – that’s what they are designed to do. The BLS data showed job losses were concentrated in the areas most exposed to Trump’s trade policies, his job shedding in federal bureaucracies and his immigration policies, offset by additions of roles in the education and healthcare sectors that are less affected by changes in economic conditions.\n\nMore jobs will be lost in October, when the tens of thousands of government employees who took up DOGE’s offer of “voluntary” buyouts enter the statistics. The numbers are likely to get worse as the impact of the policies shows up more clearly. The Yale Budget Lab pits the effective average rate of Trump’s tariffs, so far at 18.4 per cent, compared with about 2.5 per cent before Trump regained office. That’s the highest rate since 1933 and will, Yale’s economists say, push up US prices by 1.8 per cent initially, lower US GDP growth by half a percentage point and increase the unemployment rate by 0.4 percentage points this year and 0.7 percentage points by the end of next year. None of that is surprising. The tariffs are already raising substantial amounts of revenue – revenue from customs duties jumped from about $US78 billion in July last year to $US152 billion last month – and there are estimates that tariff-related revenues will, if the tariffs remain in place, generate more than $US2 trillion over the next decade.\n\nLoading That revenue is a new tax on US consumption, paid for by US importers, their corporate customers or consumers, or most likely a mix of all of them. It’s been described as the biggest tax rise in US history, so of course it will have an impact on economic growth and employment. Already, some of America’s largest companies – its car and consumer products companies – are saying they are experiencing multibillion-dollar cost increases from the tariffs, and are planning billion-dollar cost cuts in response. Those cuts will inevitably involve jobs. Manufacturing is supposed to benefit from Trump’s tariffs, indeed he has said the tariffs are designed to make the American manufacturing sector great again. The latest purchasing managers’ index – also released last week – shows US manufacturing activity contracted in July. Perversely, the gloom just starting to cloud the US economy, an economy that had the strongest growth of any developed economy before Trump took office, might convince the Fed to do what Trump has demanded for months that it should do and lower its policy rate next month.\n\nThe Fed has a dual mandate. It is charged with maximising employment while maintaining price stability. The jobs data signals that the labour market is deteriorating rapidly and is likely to shrink further. The numbers are likely to get worse as the impact of the policies shows up more clearly. The tariffs, however, are pushing up an inflation rate that, even before they were in place, was already materially above the Fed’s target of 2 per cent. Its preferred measure, the core personal consumption expenditures index, has been creeping up and, according to data released last week, was running at 2.8 per cent in June. The Fed knows that number will continue to rise, and may or may not be transitory, which will create a dilemma. It may have to decide which element of its mandate it should prioritise.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/nsw/sydney-nurse-suspended-for-alleged-touching-of-underage-patient-20250802-p5mjtd.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Sydney nurse suspended for alleged touching of underage patient",
        "publish_date": "Mon, 04 Aug 2025 11:58:22 +1000",
        "category": "finance",
        "authors": [
            "Kayla Olaya"
        ],
        "text": "A nurse employed at a Sydney children’s hospital has been suspended from the medical profession by the NSW Civil and Administrative Tribunal after he was accused of sexually touching a 16-year-old patient without consent under his care.\n\nNathan Kai Wei Pang had his registration suspended for three months for professional misconduct towards the adolescent boy, including allegedly inappropriately touching his genitals, speaking in a sexualised manner and making false statements about the incidents to his employer.\n\nPang will be able to work with children again after his suspension if he completes the education requirements laid out by the Nursing and Midwifery Council of NSW, including ethics, consent and record-keeping training.\n\nThe Sydney nurse has been suspended for three months. Credit: Michael O’Sullivan\n\nThe boy was recovering from surgery that involved a catheter in his groin, and needed check-ups to ensure it was healing properly.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/property/news/two-young-fellas-team-up-to-buy-1-4m-kogarah-townhouse-20250804-p5mk2a.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘Two young fellas’ team up to buy $1.4m Kogarah townhouse",
        "publish_date": "Mon, 04 Aug 2025 11:53:43 +1000",
        "category": "finance",
        "authors": [
            "Sarah Webb"
        ],
        "text": "While the home still had original carpet and needed cosmetic updates, Flevaris said the location was the main drawcard – though even he was shocked by the result. “The owners are just beautiful people. They’ve already moved to Queensland but couldn’t believe it. I still don’t think they’ve realised what happened,” he said. “They were happy at $1.05 million. The reserve was originally $1.025 million, and they hesitated when we wanted to raise it. “But if you’d asked me if it would sell for $1.4 million, I wouldn’t have bet on it either.\n\n“This tells me the market is strong, there’s not enough quality stock, and there’s a lot of urgency out there.” The house was among 704 scheduled auctions across Sydney last week. By Saturday evening, Domain recorded a preliminary clearance rate of 73.4 per cent from 455 reported results, with 59 auctions withdrawn. Withdrawn auctions are counted as unsold when calculating clearance rates. In Northbridge, a local dad forked out $3.62 million for a “knockdown-rebuild” brick home for his daughter, outmuscling developers and paying more than $600,000 above the reserve. Built almost a century ago, the original home at 255 Sailors Bay Road had remained in the same family while occupying a flat 461.6 square metre block.\n\nThe three-bedroom, two-bathroom home had a price guide of $2.7 million to $2.8 million and a reserve of $3 million. In near-original condition, it had a solid double-brick construction, rear lane access, and no heritage or conservation restrictions. There is no legal requirement for a vendor’s reserve to be in line with their property’s price guide. Loading Bidding opened at $2.5 million, with 10 of the 27 registered parties raising their paddles. Increments of $50,000 and $25,000 pushed the price to $3 million, followed by $10,000 and $20,000 bids to $3.3 million. The final stretch – between four bidders – played out in $5000 rises. Auctioneer Michael Garofolo,of Cooley Auctions said at least 100 people turned out, undeterred by heavy rain and howling wind. “The house was in a fantastic location and it was essentially a knockdown rebuild – and that’s what attracted such a strong result,” he said.\n\n“It wasn’t heritage listed, had no issues from council, and has rear lane access while being close to the shopping village and CBD.” Loading Co-selling agent Irving Gunawan of Irving G Property said the home attracted developers, renovators, local families and investors. “But in the end, it was the Northbridge family who purchased it for their daughter,” he said. “It was a fantastic auction … there was a sale a few doors down at 239 Sailors Bay which sold for $3.3 million in November last year. That property was a four-bedroom home and was updated, whereas ours was in original condition and two bedrooms plus a study or optional third bedroom.”\n\nIn Padstow, a builder paid $2.21 million for a dated cottage he plans to transform into luxury duplexes – above the reserve by $360,000. The four-bedroom home, at 7 Barkl Avenue, sits on a 702 square metre block with a 15.24 metre frontage. It was initially guided at $1.7 million and had a reserve of $1.85 million. The property attracted strong interest from builders, developers and investors, with 17 parties registering and eight raising their paddles. Bidding opened at $1.6 million and leapt straight to $1.75 million, followed by two more $100,000 rises. At the $2.1 million mark, two remained – the builder and an investor – who traded $25,000 and $50,000 increments.\n\n“They both really wanted it and they both loved the position and location,” said selling agent Abir Eddine of Ray White Revesby. “The buyer now plans to lease it out for the next two to three years before building the duplexes.” Eddine expected strong interest given the home’s size and potential, but said the final price exceeded expectations. “We hoped the competition would drive the auction to $2 million … but it seems the mix of everything, including the expected interest rate drops, is making people want to secure something soon,” she said. “The vendors have had this one for about 25 years, and they were shocked when it hit $1.9 million.”",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/the-new-financial-battleground-for-divorcing-couples-20250723-p5mh7s.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "The new financial battleground for divorcing couples",
        "publish_date": "Mon, 04 Aug 2025 11:45:00 +1000",
        "category": "finance",
        "authors": [
            "Michaela Whitbourn"
        ],
        "text": "In a 2013 case involving a wealthy couple and millions of frequent flyer points, a husband was ordered to transfer 1 million points to his wife. Family law expert Jodylee Bartal, a partner at Schetzer Papaleo Family Lawyers, said it was important to note that, “unlike other assets, points don’t gain value over time – they are vulnerable to devaluation, expiry, and policy changes”. “The value of accumulated points can depend on how and when they are used. Strategic redemption, such as during a ‘points promotion’, can ‘buy’ more. Put another way, points rarely have a set dollar-per-point conversion,” Bartal said. Cryptocurrency Sergi said cryptocurrency and NFTs (non-fungible tokens) were growing in popularity among “a younger cohort”, and this was the biggest growth area in digital assets in family law matters.\n\nBut she said that “actually finding [those assets]” was often a major issue. It was common in family law disputes “for people to try and … hide assets that are not obvious”, she said, despite their legal obligation to provide full and frank disclosure of their financial circumstances. “It’s often a bit of a forensic exercise in making sure we’ve captured everything,” Sergi said. A person might withdraw cash and deposit it at a crypto ATM, for example, but it might be difficult for a lawyer acting for the person’s former partner to obtain records showing that transaction. ‘It can sometimes be an easy way [for a person] to potentially hide money.’ Family law specialist Josephine Sergi “There’s no central register, so finding those assets when they are not disclosed can be really hard,” she said.\n\nSergi had acted for the wife in a matter in which her client had only become aware her husband had cryptocurrency because she “spotted him at one of those ATMs ... in Melbourne”. “We would never have known from looking at his bank statements, which only included cash withdrawals. It can sometimes be an easy way [for a person] to potentially hide money if you’re not asking the right questions or taking a forensic approach to documents which are disclosed,” she said. Loading In one Federal Circuit and Family Court case in 2023, a wife alleged her husband had invested some $35,000 in cryptocurrency. He said he had invested, and lost, $13,000. There was insufficient evidence before the court to make a finding. “On the basis of this conflicted evidence, I will not include any sum referable to cryptocurrency in the parties’ pool of assets,” Judge Stewart Brown said in his decision.\n\nJodylee Bartal said family lawyers “need to constantly upskill to keep up with changes to the definition and treatment of ‘property’,” which now included digital assets. “The Family Law Act ... allows for the division of ‘property’ between separated couples. [It] does not specifically mention digital assets including ... cryptocurrency, but it is generally treated as a form of property,” she said. ‘PROPERTY’ IN FAMILY FEUDS The Family Law Act allows for the division of ‘property’ between separating couples.\n\nUnder changes to the law this year, companion animals are now a separate category of property.\n\nDigital assets including rewards points and cryptocurrency are also treated as property. “Unlike traditional bank accounts, which can be readily traced to the owner, cryptocurrency ownership is anonymised,” she said. Forensic accountants could “help trace transactions and uncover hidden digital assets”. Bartal pointed to a range of “practical challenges” relating to digital assets, such as market volatility.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/nsw/it-may-be-a-380k-cash-cow-but-is-sydney-s-biggest-billboard-also-an-eyesore-20250801-p5mjno.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "It may be a $380k cash cow. But is Sydney’s biggest billboard also an eyesore?",
        "publish_date": "Mon, 04 Aug 2025 11:42:00 +1000",
        "category": "finance",
        "authors": [
            "David Barwell"
        ],
        "text": "Sydney’s biggest billboard could continue to feature on the city skyline for three more years as part of a deal that might earn Inner West Council more than $300,000 in revenue from a major advertising company.\n\nEye Drive Sydney, a subsidiary of outdoor advertiser oOh!media, is seeking approval from the NSW government to extend the life of the 170 metre-long billboard on the Glebe Island silos, overlooking Anzac Bridge.\n\nThousands of motorists on Anzac Bridge in Sydney’s inner west pass the advertisements each day. Credit: Louie Douvis\n\nThe billboard – which thousands of motorists pass each day – was erected in the 1990s as a temporary structure to promote the Sydney Olympics. However, over the years, rolling extensions have kept it in place.\n\nNow Eye Drive Sydney has applied to the Planning Department to continue operating the billboard for another three years, saying an extension will “reinforce the landmark quality of the silos structure”.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/traveller/travel-news/beyond-tours-intrepid-travel-is-now-opening-its-own-hotels-and-resorts-20250804-p5mk29.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Beyond tours, Intrepid Travel is now opening its own hotels and resorts",
        "publish_date": "Mon, 04 Aug 2025 11:34:41 +1000",
        "category": "finance",
        "authors": [
            "Julietta Jameson"
        ],
        "text": "It used to be one of those unwritten laws in travel – accommodation companies did accommodation, tour companies did tours.\n\nIntrepid’s Daintree Ecolodge. Credit:\n\nThat was before tour operators broke the mould with expansion into river and small ship cruising, a common synergy these days.\n\nOne shining exception is Abercrombie & Kent, with its A&K Sanctuary division, comprising 15 African safari camps, lodges and five Nile riverboats with plans for further expansion internationally.\n\nAustralia’s famous tour company Intrepid Travel has also made a splash into the accommodation market, recently buying a resort in Tasmania and a riad in Morocco.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/nrl/wests-tigers-players-abuses-bulldogs-fans-20250804-p5mk4u.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Wests Tigers players abuses Bulldogs' fans",
        "publish_date": "Mon, 04 Aug 2025 11:23:43 +1000",
        "category": "sports",
        "authors": [],
        "text": "Wests Tigers players abuses Bulldogs' fans\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://au.news.yahoo.com/overseas-stars-lure-tourists-down-015417449.html",
        "title": "Overseas stars lure tourists Down Under in new push",
        "publish_date": "2025-08-04T01:54:17Z",
        "category": "finance",
        "authors": [
            "Kat Wong"
        ],
        "text": "Overseas stars lure tourists Down Under in new push\n\nAustralian celebrity Robert Irwin, English television cook Nigella Lawson and other international stars are tempting tourists to the land Down Under.\n\nShots of these celebrities set against iconic Australian landscapes are part of the federal government's newest tourism push to attract travellers from five countries.\n\nAdvertisements featuring Chinese actor Yosh Yu, Ms Lawson and Japanese comedian Abareru-kun will air in their home countries, while Steve Irwin's son will become the face of the American campaign and wellness advocate Sara Tendulkar will star in ads broadcast in India.\n\nNigella Lawson will tempt Brits to head down under in the new tourism campaign. (HANDOUT/TOURISM AUSTRALIA)\n\nThis $130 million push builds on Tourism Australia's Come and Say G'day campaign, which launched the lovable animated mascot Ruby the Roo.\n\nADVERTISEMENT\n\n\"Traditionally tourism campaigns have leveraged one famous face across every market but for our latest campaign Ruby will be joined by well-known talent from five different markets to showcase personal lasting memories of a holiday to Australia,\" Tourism Australia managing director Phillipa Harrison said.\n\n\"These international stars combine with local talent ... to create bespoke invitations for five markets.\"\n\nSince the resumption of international travel, the domestic tourism industry has grown with the number of international arrivals expected to reach a record 10 million in 2026 and 11.8 million in 2029.\n\nMore than 700,000 jobs and 360,000 Australian businesses depend on tourism.\n\nThe teaser for this campaign was first launched in July during the prime minister's trip to China.\n\nTrade Minister Don Farrell says tourism supports hundreds of thousands of jobs. (Mick Tsikas/AAP PHOTOS)\n\nChinese travellers remain Australia's second biggest cohort of tourists behind New Zealand, figures from the Australian Bureau of Statistics show.\n\nADVERTISEMENT\n\n\"Tourism is the lifeblood of so many communities right around the country and creates hundreds of thousands of jobs,\" Tourism Minister Don Farrell said.\n\n\"The previous campaign struck a chord with visitors, with Ruby the Roo bounding into the imagination of countless guests, encouraging them to book a holiday down under.\n\n\"I know this iteration, featuring popular talent like Robert Irwin, will be a smash.\"\n\nThe advertisements will go live in China from August 7 on TV and online.",
        "source": "Yahoo"
    },
    {
        "url": "https://au.finance.yahoo.com/news/global-consortium-whyalla-steelworks-sights-013351243.html",
        "title": "Global consortium has Whyalla steelworks in its sights",
        "publish_date": "2025-08-04T01:33:51Z",
        "category": "finance",
        "authors": [
            "Sun",
            "Aug",
            "Min Read"
        ],
        "text": "A huge international consortium has the Whyalla steelworks in its sights with a string of bidders lining up to take over the ailing manufacturing plant.\n\nAustralia's largest steelmaker BlueScope has formed a consortium with companies from Japan, South Korea and India to bid for the plant.\n\nEarlier in 2025 the South Australian steelworks received a $2.4 billion government bailout package to help keep it afloat and save jobs.\n\nBluescope says its consortium has identified Whyalla for iron production with lower emissions. (Isabella Ward/AAP PHOTOS)\n\nBlueScope on Monday announced it had entered into a collaboration agreement with South Korean steelmaker POSCO, Japan's Nippon Steel and India's JSW Steel conglomerate to take part in the sale process.\n\n\"The consortium has identified Whyalla as a prospective location for future production of lower emissions iron in Australia for both domestic and export markets, with the potential to play an important role in the decarbonisation of the global steelmaking industry,\" BlueScope said.\n\nSA Premier Peter Malinauskas said on Monday more than 15 national and international parties had passed the final expression-of-interest phase in a positive sign for the steelmaker's transition to new ownership.\n\n\n\nSales advisor 333 Capital reported interest from credible parties around the world and would now move to solicit indicative bids from shortlisted parties that expressed interest, with no preferred bidder at this stage.\n\nStrong interest in Whyalla is a positive sign for Australian steelmaking, the SA premier says. (Isabella Ward/AAP PHOTOS)\n\n\"The state government's objective has been to transition the ownership of the steelworks to a new credible owner who can invest in Whyalla's future,\" Mr Malinauskas said in a statement.\n\n\n\n\"This strong interest is a positive sign for the future of the Whyalla Steelworks and for the future of sovereign steelmaking capability in Australia.\"\n\nTogether, the consortium represents a market capitalisation - or total trading value - of $115 billion, giving it deep pockets for any successfully completed transaction.",
        "source": "Yahoo"
    }
]